{
  "title": "After Long Silence: A Memoir",
  "description": "“Fascinating . . . A tragic saga, but at the same time it often reads like a thriller filled with acts of extraordinary courage, descriptions of dangerous journeys and a series of secret identities.” — Chicago Tribune“To this day, I don't even know what my mother's real name is.”Helen Fremont was raised as a Roman Catholic. It wasn't until she was an adult, practicing law in Boston, that she discovered her parents were Jewish—Holocaust survivors living invented lives. Not even their names were their own. In this powerful memoir, Helen Fremont delves into the secrets that held her family in a bond of silence for more than four decades, recounting with heartbreaking clarity a remarkable tale of survival, as vivid as fiction but with the resonance of truth.Driven to uncover their roots, Fremont and her sister pieced together an astonishing story: of Siberian Gulags and Italian royalty, of concentration camps and buried lives. After Long Silence is about the devastating price of hiding the truth; about families; about the steps we take, foolish or wise, to protect ourselves and our loved ones. No one who reads this book can be unmoved, or fail to understand the seductive, damaging power of secrets.Praise for After Long Silence“Poignant . . . affecting . . . part detective story, part literary memoir, part imagined past.” — The New York Times Book Review“Riveting . . . painfully authentic . . . a poignant memoir, a labor of love for the parents she never really knew.” — The Boston Globe“Mesmerizing . . . Fremont has accomplished something that seems close to impossible. She has made a fresh and worthy contribution to the vast literature of the Holocaust.” — The Washington Post Book World",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Holocaust",
    "History",
    "World War II",
    "Biography",
    "Book Club"
  ],
  "author": "Helen Fremont",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/1001282.After_Long_Silence"
}