{
  "title": "Wanting a Daughter, Needing a Son: Abandonment, Adoption, and Orphanage Care in China",
  "description": "Kay Johnson has done groundbreaking research on abandonment and adoption in China. In Wanting a Daughter, Needing a Son, Johnson untangles the complex interactions between these social practices and the government’s population policies. She also documents the many unintended consequences, including the overcrowding of orphanages that led China to begin international adoptions. Those touched by adoption from China want to know why so many healthy infant girls are in Chinese orphanages. This book provides the most thorough answer to date. Johnson’s research overturns stereotypes and challenges the conventional wisdom on abandonment and adoption in modern China. Certainly, as Johnson shows, many Chinese parents feel a great need for a son to carry on the family name and to care for them in their old age. At the same time, the government’s strict population policy puts great pressure on parents to limit births. As a result, some parents are able to obtain a son only by resorting to illegal behavior, such as \"overquota\" births and female infant abandonment. Yet the Chinese today value daughters more highly than ever before. As many of Johnson’s respondents put it, \"A son and a daughter make a family complete.\" How can these seemingly contradictory trends--the widespread desire for a daughter as well as a son, and the revival of female infant abandonment--be happening in the same place at the same time? Johnson looks at abandonment together with two other population planning and adoption. In doing so, she reveals all three in a new light. Johnson shows us that a rapidly changing culture in late twentieth-century China hastened a positive revaluation of daughters, while new policies limiting births undercut girls’ improving status in the family. Those policies also revived and exacerbated one of the worst aspects of traditional patriarchal the abandonment of female infants. Yet Chinese parents are not literally forced to abandon female infants in order to have a son. While birth-planning enforcement can be coercive, parents who abandon are rarely prosecuted. Meanwhile, hundreds of thousands of Chinese parents informally adopt female foundlings and raise them as their own. Ironically, as Johnson shows, in some places adoptive parents are more likely than abandoning parents to incur fines and discrimination. In addressing all these issues, Johnson brings the skills of a China specialist who has spent over a decade researching her subject. She also brings the concerns of an adoptive parent who hopes that this book might help others find answers to the question, What can we tell our children about why they were abandoned and why they were available for international adoption?",
  "genres": [
    "Adoption",
    "China",
    "Nonfiction",
    "Asia",
    "History",
    "Asian Literature",
    "Feminism"
  ],
  "author": "Kay Ann Johnson",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/181420.Wanting_a_Daughter_Needing_a_Son"
}