{
  "title": "Forty Days of Yoga - Breaking down the barriers to a home yoga practice",
  "description": "Forty Days of Yoga is a powerful resource for anyone interested in committing to a home yoga practice. Drawing on her years of home practice experience, yoga teacher and writer Kara-Leah Grant examines many of the obstacles - both internal and external - that one can face when undertaking a self-directed practice, especially while living an ordinary life in the busy, modern world. Packed full of ingeniously practical worksheets and examples from Kara-Leah's own life, this book invites readers to reflect honestly and creatively on their own process and aspirations for a home yoga practice. In this way, Kara-Leah helps readers see that their life - obstacles and all - can become part of the solution, rather than being seen as a 'problem'. For more than a how-to yoga book, Forty Days of Yoga takes readers on a journey into their psyche and helps them design strategies to make daily practice possible in their life - no matter what that life is like.Kara-Leah has a no-nonsense approach that is practical, down-to-earth and also light-hearted. She's encouraging and supportive but leaves no excuses left standing. By the end of the book, you'll know what supports your practice, what undermines your practice, and exactly what you need to do about it.In addition to helping readers assess their lives and design their own personal home yoga practice, Kara-Leah also takes a closer look at yoga. She asks readers to broaden their definition of yoga and to understand that it's both a process and a practice. She teaches yoga as a personal practice - something that supports the needs of the individual and meets them where they are, as they are. If you're struggling with committing to a regular home yoga practice, this is the book for you.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Kara-Leah Grant",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/18141042-forty-days-of-yoga---breaking-down-the-barriers-to-a-home-yoga-practice"
}