{
  "title": "El sabor de lo heroico",
  "description": "En 1913 el Presidente de El Salvador Manuel Enrique Araujo es asesinado a machetazos por un grupo de rudos campesinos que no sabían del todo a quién estaban matando. Junto a ellos se captura también a un ex oficial del ejército salvadoreño que se encargó de herir de bala al Presidente Araujo durante el sangriento crimen sucedido en un parque céntrico de la capital. Los campesinos son ejecutados sin juicio por un pelotón de fusilamiento diez días después del magnicidio y el ex oficial, para sorpresa de pocos salvadoreños, amanece muerto en su celda suicidado con su propia arma.A las semanas comienzan a surgir rumores sobre quienes fueron los verdaderos asesinos. Acaso una conspiración de las familias ricas del país (Araujo siendo él mismo un próspero cafetalero incrementó los impuestos al cultivo del café para gran ira de los demás hacendados), maridos celosos (ya que eran vox populi las infidelidades presidenciales), el doctor Prudencio Alfaro (por un asunto de gallos como iba el cuento en aquellos tiempos), los Estados Unidos (ante la negativa de Araujo de reconocer como legal la intervención gringa en Nicaragua) o acaso una confabulación de la temida banca salvadoreña (pues Araujo fue y sigue siendo el único Presidente que reguló de manera agresiva a los corruptos bancos de El Salvador).De este lodo histórico, un ya olvidado e impune asesinato en la llamada república cafetalera de El Salvador, es que principia El sabor de lo heroico, donde personajes históricos como Araujo y Franz Kafka, Houdini y Boston Corbett (el hombre que mató al hombre que mató a Lincoln) se entremezclan con personajes de ficción para tejer una trama que busca concertar pasado, presente y futuro en un mismo tiempo narrativo.El sabor de lo heroico es del mismo modo la gesta de un miembro idealista de una antiquísima Cofradía de hombres que se niegan a ofrecer la otra mejilla. Desesperado por salvar una vida, llega a El Salvador en una misión no sólo suicida, pero destinada al fracaso desde un principio.",
  "genres": [],
  "author": "C. Gerardo Perla",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18142420-el-sabor-de-lo-heroico"
}