{
  "title": "The Living Hunger",
  "description": "Dr. Dennis F. Larsen presents a Post-Apocalyptic story of struggle, endurance and survival. 'The Living Hunger' is book one in the series with book two projected for early 2014.A hardened war veteran collides with a venomous leader and rogue assassin, turning Northern Utah into the next great battleground.Sergeant Farrell Jenson survives a world lost to nuclear and biological warfare only to find his home destroyed and family missing. He joins forces with Gary Merrill, a local business leader, and Major Melanie Ghostkeeper, a Marine Medic, to begin the process of rebuilding. A small group of survivors unite under a banner of freedom and hunker down in Bear River High School. Friendships and love are forged in the hot fires of adversity as they fight for their very lives, amidst a world turned upside down, where death is the new way of life.A festering evil is combing the land, led by one man, Don Bullock. The rotund, venomous leader spearheads a community with a taboo, underlying secret that will pit good against evil in a dramatic show of force and violence between the two groups. Solomon, a rogue African assassin, launches a one-man assault on the Bear Riverites, seeking blood and retribution to satiate his bloodlust and quench his need for flesh.Each side gambles all to control a newfound drug with the potential to save mankind. This new ‘currency’ trumps all, where money is worthless and food and women are king. As the struggle escalates and new battle-lines are drawn a host of unwitting participants are pulled into the fray, fighting for all they hold dear.Book One of The Living Hunger Series begs the question: ‘Which side will render your support and where will your allegiances lie?’",
  "genres": [
    "Science Fiction",
    "Horror",
    "Dystopia",
    "Fantasy",
    "Fiction",
    "Post Apocalyptic",
    "Apocalyptic"
  ],
  "author": "Dennis F. Larsen",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/18143205-the-living-hunger"
}