{
  "title": "The Filthy Truth",
  "description": "From Andrew Dice Clay, the “Undisputed Heavyweight Comedy King,” comes the unapologetic and uncensored autobiography fans have been waiting for.Andrew Dice Clay’s raw stand-up delivery has shocked and entertained audiences for decades and continues to do so to this day. When he released his debut album, Dice , in 1989, the parental advisory label simply read “ This album is offensive.” His material stretched the boundaries of decency and good taste to their breaking point, and in turn he became the biggest stand-up comic in the world.In The Filthy Truth , Dice chronicles his remarkable rise, fall, and triumphant return. Brooklyn-born Andrew Clay Silverstein started out at Pips Comedy Club in Sheepshead Bay and eventually made a name for himself a decade later with a breakout appearance on the Rodney Dangerfield HBO special Nothing Goes Right . With that single TV appearance he became the new king of comedy, and Dicemania was born. He was the first and only comedian to sell out over three hundred sports arenas across the country to an audience of more than twelve million people. He was also the first comedian to sell out Madison Square Garden two nights in a row.But Dice’s meteoric rise and spectacular fame brought on a furious backlash from the media and critics. Billboards for his album produced by Rick Rubin and for his movie The Adventures of Ford Fairlane were defaced and ripped down as fast as they were put up. By the mid-nineties, though still playing to packed audiences, the turmoil in his personal life, plus attacks from every activist group imaginable, led him to make the decision to step out of the spotlight and put the focus on raising his boys.The Diceman was knocked down, but not out. Taking inspiration from what Frank Sinatra once told him—“You work for your fans, not the media. The media gets their tickets for free”—Dice is now back with critically acclaimed roles in HBO’s Entourage and Woody Allen’s Blue Jasmine , and is once again playing to sold-out audiences.Filled with no-holds-barred humor and honesty, The Filthy Truth sets the record straight and gives fans plenty of never-before-shared stories from his career and his friendships with Howard Stern, Sam Kinison, Mickey Rourke, Sylvester Stallone, Axl Rose, and countless others.",
  "genres": [
    "Biography",
    "Comedy",
    "Memoir",
    "Nonfiction"
  ],
  "author": "Andrew Dice Clay",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/18144006-the-filthy-truth"
}