{
  "title": "The Steady Running of the Hour",
  "description": "In this mesmerizing debut, a young American discovers he may be heir to the unclaimed estate of an English World War I officer, which launches him on a quest across Europe to uncover the elusive truth.Just after graduating college, Tristan Campbell receives a letter delivered by special courier to his apartment in San Francisco. It contains the phone number of a Mr. J.F. Prichard of Twyning Hooper, Solicitors, in London and news that could change Tristan's life forever.In 1924, Prichard explains, an English alpinist named Ashley Walsingham died attempting to summit Mt. Everest, leaving his fortune to his former lover, Imogen Soames-Andersson. But the estate was never claimed. Information has recently surfaced suggesting Tristan may be the rightful heir, but unless he can find documented evidence, the fortune will be divided among charitable beneficiaries in less than two months.In a breathless race from London archives to Somme battlefields to the Eastfjords of Iceland, Tristan pieces together the story of a forbidden affair set against the tumult of the First World War and the pioneer British expeditions to Mt. Everest. Following his instincts through a maze of frenzied research, Tristan soon becomes obsessed with the tragic lovers, and he crosses paths with a mysterious French girl named Mireille who suggests there is more to his quest than he realizes. Tristan must prove that he is related to Imogen to inherit Ashley's fortune but the more he learns about the couple, the stranger his journey becomes.The Steady Running of the Hour announces the arrival of a stunningly talented author. Part love story, part historical tour de force, Justin Go's novel is utterly compelling, unpredictable, and heartrending.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Romance",
    "Historical",
    "Book Club",
    "Literary Fiction"
  ],
  "author": "Justin Go",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/18143778-the-steady-running-of-the-hour"
}