{
  "title": "The Mighty and the Almighty: Reflections on America, God, and World Affairs",
  "description": "“In this fascinating book, Madeleine Albright weaves together history, personal experiences, and brilliant analysis in exploring how religion can be a force for liberty and tolerance rather than oppression and terror.\" -- Walter Isaacson, author of The Code Breaker The New York Times bestselling author and former secretary of state Madeleine Albright offers a provocative and very personal look at the role of religion in America’s foreign policy Traditionally, America’s foreign policy professionals have sought to downplay the impact of religious beliefs in international affairs. Reinforced by the constitutional separation between church and state, policymakers have shied away from this potentially volatile and divisive issue. In this timely precient book, one of the most renowned figures in American politic argues that in today’s climate, a secular approach is no longer sufficient. The 21st century seems to be devolving into a period of religious war, and in an era of confrontation between international terrorism and the West, our political leaders can no longer avoid dealing directly and explicitly with religious issues. In The Mighty and the Almighty, Madeleine Albright examines religion and foreign affairs through the lens of U.S. history as well as her own experience in public office. She offers a sharp critique of U.S. policy, condemnation for those who exploit religious fervor for violent ends, and praise for political, cultural, and spiritual leaders who seek to harness the values of faith to unite us in these confusing and dangerous times. Illuminating and engrossing, this is a provocative work calling for leadership that is bold enough to rein in divisive religious rivalries and lay the groundwork for a new moral consensus.",
  "genres": [
    "Nonfiction",
    "Politics",
    "History",
    "Religion",
    "Biography",
    "Memoir",
    "International Relations"
  ],
  "author": "Madeleine K. Albright",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/108971.The_Mighty_and_the_Almighty"
}