{
  "title": "The Barbarian Nurseries",
  "description": "The great panoramic social novel that Los Angeles deserves—a twenty-first century, West Coast Bonfire of the Vanities by the only writer qualified to capture the city in all its glory and complexityWith The Barbarian Nurseries, Héctor Tobar gives our most misunderstood metropolis its great contemporary novel, taking us beyond the glimmer of Hollywood and deeper than camera-ready crime stories to reveal Southern California life as it really is, across its vast, sunshiny sprawl of classes, languages, dreams, and ambitions. Araceli is the live-in maid in the Torres-Thompson household—one of three Mexican employees in a Spanish-style house with lovely views of the Pacific. She has been responsible strictly for the cooking and cleaning, but the recession has hit, and suddenly Araceli is the last Mexican standing—unless you count Scott Torres, though you’d never suspect he was half Mexican but for his last name and an old family photo with central L.A. in the background. The financial pressure is causing the kind of fights that even Araceli knows the children shouldn’t hear, and then one morning, after a particularly dramatic fight, Araceli wakes to an empty house—except for the two Torres-Thompson boys, little aliens she’s never had to interact with before. Their parents are unreachable, and the only family member she knows of is Señor Torres, the subject of that old family photo. So she does the only thing she can think of and heads to the bus stop to seek out their grandfather. It will be an adventure, she tells the boys. If she only knew . . . With a precise eye for the telling detail and an unerring way with character, soaring brilliantly and seamlessly among a panorama of viewpoints, Tobar calls on all of his experience—as a novelist, a father, a journalist, a son of Guatemalan immigrants, and a native Angeleno—to deliver a novel as broad, as essential, as alive as the city itself.",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Literary Fiction",
    "Family",
    "Audiobook",
    "Novels"
  ],
  "author": "Héctor Tobar",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/10898140-the-barbarian-nurseries"
}