{
  "title": "Back from the Dead",
  "description": "This inspiring memoir from sports and cultural icon Bill Walton recounts his devastating injuries and amazing recoveries, set in the context of his UCLA triumphs under John Wooden, his storied NBA career, and his affinity for music and the Grateful Dead.In February 2008, Bill Walton suffered a catastrophic spinal collapse—the culmination of a lifetime of injuries—that left him unable to move. He spent three years on the floor of his house, eating his meals there and crawling to the bathroom, where he could barely hoist himself up onto the toilet. The excruciating pain and slow recovery tested Walton to the fullest. But with extraordinary patience, fortitude, determination, and sacrifice—and pioneering surgery—he recovered, and now shares his life story in this remarkable and unique memoir.Walton grew up in San Diego in the 1950s and 1960s and was deeply influenced by the political and cultural upheavals of that period. Although he strongly identified with the cool people, particularly in music and politics, his greatest role model outside his family was super-straight UCLA basketball coach John Wooden, a thoughtful, rigorous mentor who seemed immune to the turmoil of the times. Although there was always tension and conflict between them, the two men would speak nearly every day for forty-three years, until Wooden’s death at age ninety-nine.Despite a lifelong stuttering affliction, Walton chose a career in broadcasting after his playing days ended. He eventually won an Emmy Award and other accolades for broadcasting and was recognized as a leading media pundit.John Wooden once said that no greatness ever came without sacrifice. Nothing better illustrates this saying than the real story of Walton’s life. In his own words, Back from the Dead shares this dramatic story, including his basketball and broadcasting careers, his many setbacks and rebounds, and his ultimate triumph as the toughest of champions.",
  "genres": [
    "Sports",
    "Biography",
    "Basketball",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Music"
  ],
  "author": "Bill Walton",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/18144129-back-from-the-dead"
}