{
  "title": "Whittled Away: A Novel of the Alamo Rifles in the Civil War",
  "description": "The novel Whittled Away is the tale of Corporal Bain Gill and Private Jesús McDonald. In 1862, Bain and Jesús enlist in the Confederate army in San Antonio, Texas, joining fifty-six other Texans as soldiers in the Alamo Rifles-Company K of the Sixth Texas Infantry regiment. The two young friends, not yet twenty when they put on their first uniforms, grew up on ranches on the western edge of civilization, herding stubborn longhorns and always wary of Comanche raiders and rattlesnakes. Naïve, as are new soldiers everywhere, they come of age during the next three years, far from home, experiencing the hardships and horrors of men in combat.This is a story of soldiering, friendship and loss during America’s nightmare, the Civil War. For Bain and Jesús it begins with marching to central Arkansas. There, at a river fort called Arkansas Post they endure their first frightful artillery barrage, but also learn first-hand a lesson that in the years ahead will confound the generals of both Soldiers in trenches and behind breastworks usually survive and prevail. But facing a Union force of over 30,000 infantry and several armored gunboats, there is a mass surrender of the 4,000 Rebel defenders of Arkansas Post. Capture leads to a freezing boat ride upriver to prison camp where deprivation, brutality, and disease take a heavy toll. So concludes Part I of Whittled Away, setting the stage for two more years of war.After a short time in prison camp, the Confederates captured at Arkansas Post are part of a prisoner exchange. The Texans are moved by Union trains to Richmond, Virginia, ready to again take up arms for the Confederacy. General Lee is beating the Union army in Virginia, but the men of the Alamo Rifles find that no general wants to accept men who surrendered in their first battle. The survivors of Arkansas Post and prison camp are put on Confederate trains and sent to Tennessee, assigned to an army that has not been victorious. Even there, only one general, Patrick Cleburne, an Irish immigrant from Arkansas, is willing to accept the Arkansas Post veterans. During the next seven months, the Alamo Rifles redeem their stained reputations fighting in three major battles without faltering, even when the rest of the army is in retreat.Part 3 finds Bain and Jesús in Georgia in late spring of 1864 about to begin three months of ongoing fighting during the Atlanta Campaign. All summer the days are marked by brutal weather, ceaseless hardships, and death. The surviving men from San Antonio are being whittled away and there are no replacements. The Confederate well is running dry of men and supplies. Atlanta falls after three intense battles in which the new Confederate commander, General John B. Hood, tries to regain the initiative. He orders his troops out of their defensive breastworks and takes the fight to the huge Union army in aggressive, but futile, attacks. Even more of the men from San Antonio are lost.In Part 4, in the closing months of 1864, General Hood leads his shrunken army back into Tennessee. The handful of men remaining in the Alamo Rifles are among the 20,000 Confederates –more Rebels than were in Pickett’s Charge at Gettysburg – who are ordered forward to take the Union breastworks at Franklin. Here, Bain and Jesús are in the middle of the attack that wrecks their army. Two weeks later, the survivors of Franklin fight in bitter cold at Nashville in a last vain attempt to win in Tennessee. Whittled Away is grass-roots American military fiction, a thin slice of a vast war, seen through the eyes of a handful of young men who are not very reflective, not particularly brave, nor intentionally heroic. Mostly they carry on and make do, trying to do their duty and one day make it home.",
  "genres": [],
  "author": "Philip McBride",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/18144898-whittled-away"
}