{
  "title": "Rebel Yell: The Violence, Passion, and Redemption of Stonewall Jackson",
  "description": "From the author of the prizewinning New York Times bestseller Empire of the Summer Moon comes a thrilling account of how Civil War general Thomas “Stonewall” Jackson became a great and tragic American hero.Stonewall Jackson has long been a figure of legend and romance. As much as any person in the Confederate pantheon, even Robert E. Lee, he embodies the romantic Southern notion of the virtuous lost cause. Jackson is also considered, without argument, one of our country’s greatest military figures. His brilliance at the art of war tied Abraham Lincoln and the Union high command in knots and threatened the ultimate success of the Union armies. Jackson’s strategic innovations shattered the conventional wisdom of how war was waged; he was so far ahead of his time that his techniques would be studied generations into the future. In April 1862 Jackson was merely another Confederate general in an army fighting what seemed to be a losing cause. By June he had engineered perhaps the greatest military campaign in American history and was one of the most famous men in the Western world. He had, moreover, given the Confederate cause what it had recently lacked—hope—and struck fear into the hearts of the Union. Rebel Yell is written with the swiftly vivid narrative that is Gwynne’s hallmark and is rich with battle lore, biographical detail, and intense conflict between historical figures. Gwynne delves deep into Jackson’s private life, including the loss of his young beloved first wife and his regimented personal habits. It traces Jackson’s brilliant twenty-four-month career in the Civil War, the period that encompasses his rise from obscurity to fame and legend; his stunning effect on the course of the war itself; and his tragic death, which caused both North and South to grieve the loss of a remarkable American hero.",
  "genres": [
    "History",
    "Biography",
    "Civil War",
    "Nonfiction",
    "American History",
    "War",
    "American Civil War"
  ],
  "author": "S.C. Gwynne",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/18144074-rebel-yell"
}