{
  "title": "The End of Normal: The Great Crisis and the Future of Growth",
  "description": "The years since the Great Crisis of 2008 have seen slow growth, high unemployment, falling home values, chronic deficits, a deepening disaster in Europe—and a stale argument between two false solutions, “austerity” on one side and “stimulus” on the other.Both sides and practically all analyses of the crisis so far take for granted that the economic growth from the early 1950s until 2000—interrupted only by the troubled 1970s—represented a normal performance. From this perspective the crisis was an interruption, caused by bad policy or bad people, and full recovery is to be expected if the cause is corrected.The End of Normal challenges this view. Placing the crisis in perspective, Galbraith argues that the 1970s already ended the age of easy growth. The 1980s and 1990s saw only uneven growth, with rising inequality within and between countries. And the 2000s saw the end even of that—despite frantic efforts to keep growth going with tax cuts, war spending, and financial deregulation. When the crisis finally came, stimulus and automatic stabilization were able to place a floor under economic collapse. But they are not able to bring about a return to high growth and full employment.Today, four factors impede a return to normal. They are the rising costs of real resources, the now-evident futility of military power, the labor-saving consequences of the digital revolution, and the breakdown of law and ethics in the financial sector. The Great Crisis should be seen as a turning point, a barometer of the rise of unstable economic conditions, which should be regarded as the new normal. Policies and institutions going forward should be designed, above all, modestly, to cope with this fact, maintaining conditions for a good life in difficult times.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Business",
    "Finance",
    "Politics"
  ],
  "author": "James K. Galbraith",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/18144111-the-end-of-normal"
}