{
  "title": "Dare I Call It Murder?: A Memoir of Violent Loss",
  "description": "Winner: San Diego Book Awards, 2012 (unpublished memoir)Judge's comment: Dare I Call It Murder? is written especially well. I found myself thinking about your story -- wanting to read more. Your writing is so revealing and beneficial to others. The impact of your last few lines -- perfect.Kirkus Review:\"A chilling memoir of a family tragedy and its painful aftermath. . . . This book is an act of witness, and the author’s motivation is palpable throughout: 'I have a right to know. Our family has a right to know. Society has a right to know.” . . . A powerful testament to a son’s unyielding determination to tell his parents’ story.'In his book, Larry Edwards unmasks the emotional trauma of violent loss as he ferrets out new facts to get at the truth of how and why his parents were killed.In 1977, Loren and Joanne Edwards left Puget Sound aboard their 53-foot sailboat Spellbound, destined for French Polynesia. Six months later they lay dead aboard their boat in the middle of the Pacific Ocean.Larry's younger brother became the prime suspect in the FBI's murder investigation. But federal prosecutors never indicted him, leaving the case unresolved and splitting the Edwards family into feuding factions.Three decades later, a dispute over how to respond to a true-crime book by Ann Rule--which contained an inaccurate account of the case -- ripped the tattered family even farther apart. In Dare I Call It Murder?, Larry Edwards sets the record straight, revealing previously undisclosed facts from the FBI investigation as he lays out the case never presented in court.Larry's memoir, however, goes beyond simply telling the untold story of his parents' deaths and refuting the errors in previously published material. His broader goal is to see the book generate greater awareness of and conversations about violent loss, its impact on the survivors and their families, and the troubling effects of post-traumatic stress (PTSD).Website: DareICallItMurder.com",
  "genres": [
    "True Crime"
  ],
  "author": "Larry M. Edwards",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/18145219-dare-i-call-it-murder"
}