{
  "title": "The Unseen Face",
  "description": "Upon receiving an letter anonymously two weeks prior, ghosts from the past began to come back up to the surface. Nearly every night for the past couple of weeks, poor James has been experiencing a reoccurring nightmare regarding Emilia. In this nightmare he feels that Emilia is trying to tell him something. Perhaps it is nothing, or perhaps it is about how she died. His nightmare came from the very depths of his soul, haunting him silently until he left his guard down and he experienced an ugliness he had never realized existed inside of him. Despite the ugliness and horror that plagued him, James felt as if his soul held the key to answer his reoccurring dreams and that promised to relieve him of his horror. His doctor, Doctor Jonathan assured him that his dreams were connected to his own subconscious state where successions of emotions, sensations, images and ideas occurred in his mind with him knowing it. Doctor Jonathan claimed that this phenomenon was more prevalent in his sleeping state. He also believed that every picture that James saw within his dreams was a form of unspoken contact from Emilia. It wasn’t just Doctor Jonathan that agreed. Richard also agreed that James was perhaps suffering from the loss of Emilia. Even Jennifer believed that Emilia was trying to reach out to James to tell him something in his dreams. However, Jennifer went a step even further and asked James to go to Emilia’s tomb and attempt to communicate with her that way. However, when James goes to meet Emilia’s parents, his adventure truly begins and he begins to learn things he never thought he would. After believing for so long that Emilia died at the hands of a brain tumor, he quickly learns that is not the case. After hearing from Emilia’s mother that her daughter had been killed, James feeling confused goes to the Iredell County Jail to meet Emilia’s killer, Adam Jackson. This is when James realizes that Emilia was indeed murdered by the hands of a cold blooded killer. Every memory James has of Emilia turns out to be from a pack of twisted and horrible lies and he soon realizes he was not the person he thought himself to be.",
  "genres": [
    "Fiction",
    "Thriller",
    "Suspense"
  ],
  "author": "Joannes Rhino",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/18146897-the-unseen-face"
}