{
  "title": "Eclipse Arts",
  "description": "Dive into this unique magical school series that will transport readers into a world where performing arts dreams become reality.Fox shapeshifter Liska, half-goddess Ephy, and banshee Airin have one thing in they all want to be stars.But when they arrive at Eclipse Arts, their dream school, they find that stardom isn't all it's cracked up to be. With families that don't understand their passions and a rival determined to stop them from winning the quad talent show, the trio must forge their own path to success.With supernatural secrets, heartbreaking family curses, and a thrilling opening ceremony, Eclipse Arts is a cozy fantasy for ages 8 to 13 filled with friendship and adventure that will keep readers hooked until the very end. Join Liska, Ephy, and Airin as they discovers their true potential and learn to embrace their extraordinary talents and gifts.Author Michelle Chastaine has crafted a thoughtful and engaging story about seventh-graders finding their place in the world, making friends, and following their dreams.Kirkus called this book \"lively...a deftly balanced fantasy tale,\" and Booklife agreed, \"..slick world building, diverse students, and performing arts atmosphere offers young readers a chance to see themselves reflected in the challenges of following your dreams and growing up.\"You'll love Eclipse Arts if you enjoy stories Middle grades or YA fictionPerforming arts - popular and classical music, playing instruments, singing, dance, theater, or artModern fantasy - superpowers, unique abilities, supernatural creatures, and magicComing of age - finding your identity, family relationships, LGBTQIA+ issues, and following your passionsFriendship - loyalty, diversity, found families, and emotionally satisfying plotsCozy fantasy - low stakes, relational drama, and light humor",
  "genres": [],
  "author": "Michelle Chastaine",
  "average_rating": "4.91",
  "url": "https://www.goodreads.com/book/show/181486709-eclipse-arts"
}