{
  "title": "Prince of Endless Tides",
  "description": "A new MM Fantasy Romance Stand Alone, inspired by The Little Mermaid & Atlantis... what if the Prince and the Sea Witch fell in love in a world ruled by evil mermaids and vengeful gods? For fans of Kellen Graves, Elise Kova, and Carissa Broadbent.'Do I please you, my Prince?'Prince Ernest Ire will do anything to please his controlling father. Even if that means using his god-given magic to sway the minds of everyone he has ever met. Wealth, royalty, and control over the land and everything on it, but still, it is not enough. With the power to achieve anything, all he wants is to give it up. But everything changes when he is infected with the deadly poison of a Mer bite, and his magic is stolen.Killian Metropoli made a deal with the god of the ocean, Karakos, on the fateful night when his mother took a blade to his throat and killed him. Gifted with immortality and the power over sea and storm, Killian was offered a second chance at life, for the sole purpose of ridding the oceans of the evil soulless creatures - the Mer, terrifying monsters made from a union between two warring gods.Killian is faced with duty or escape; he must choose to go against a powerful god for a bad-mouthed prince, who could give him the one thing he desires most...freedom. Time is of the essence, otherwise, Killian will be forced against his will to kill Ernest if he becomes the very monster his life is dedicated to destroying.Fate is fickle, the threads knotted, and time is running out. Ernest must save his people before he becomes the very monster he has always feared. Killian will do anything to rid himself of his shackles. But an evil darkness is rising, and they must become allies to stop it before the world they know becomes a battlefield for benevolent gods.Prince of Endless Tides is a stand-alone in the Darkmourn Universe and can be read in or out of order. It's for readers looking for a fantasy romance with enemies to lovers, gods, monsters and heroes, sacrifice, forbidden and slow-burn romance with on-page spice that will leave your mouth burning! POET has a twisted but Happily Ever After.",
  "genres": [
    "Fantasy",
    "Romance",
    "LGBT",
    "M M Romance",
    "Queer",
    "Fantasy Romance",
    "Mermaids"
  ],
  "author": "Ben Alderson",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/181470032-prince-of-endless-tides"
}