{
  "title": "The Emotionally Resilient Expat - Engage, Adapt and Thrive Across Cultures",
  "description": "Living abroad offers enriching experiences of growth, broadened perspective, enhanced cultural understanding. Yet its transition-rich, change-driven, cross-cultural nature can place considerable demands, leaving us stressed, disconnected, our identity in flux. Building on existing literature and benefitting from recent developments in psychology and brain-body connections, The Emotionally Resilient Engage, Adapt and Thrive Across Cultures shows the key to successful transitions and beyond lies in emotional resilience to adapt, adjust or simply accept. Linda A. Janssen combines candid personal stories from experienced expats and cross-culturals, with a wealth of practical tools, techniques and best practices from emotional, social and cultural intelligence, positive psychology, mindfulness, stress management, self-care and related areas. FACTORS(TM) offers a way to live a healthier, more positive, emotionally engaged, culturally connected global life. \"Using personal story and solid theory in her groundbreaking book on emotional resilience, Linda A. Janssen guides those facing the challenges of cross-cultural living to dig under the initial rocky surfaces of overseas life to discover - and use - the rich gold of their own experience. A great resource for expats of all backgrounds.\" Ruth E. Van Reken, Author, Third Culture Growing Up Among Worlds \"Janssen's work is sure to be a stand out in any expatriate or cross-cultural arena. She eloquently, articulately and incisively delves into areas previously considered taboo in order to highlight how we can all gain mastery over whatever life throws our way. I will definitely be referencing Janssen's material when working with TCKs, expat parents and international students.\" Tina L Quick, Author, The Global Nomad's Guide to University Transition, www.internationalfamilytransitions.com \"A practical guide in the art of managing the risks of overseas life in ways that will promote endurance and effectiveness. Full of honest and hope-filled stories from the lived experience and life-long learning of Janssen and her dozens of expatriate contributors. An invaluable companion for expats who want to know that they are not alone.\" Duncan P. Westwood, PhD, (C)OACCPP Clinical Director of Expatriate Care & Development, International Health Management \"As with any food rich in nutrition, this book is best sampled regularly and digested slowly.\" Drs. Douglas W. Ota, NIP Psychologist, NMI Mediator, Family Therapist, www.dougota.nl",
  "genres": [
    "Nonfiction"
  ],
  "author": "Linda A. Janssen",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/18147656-the-emotionally-resilient-expat---engage-adapt-and-thrive-across-cultur"
}