{
  "title": "A Charmed Life: Growing Up in Macbeth's Castle",
  "description": "We grew up with the same parents in the same castle, but in many ways we each had a moat around us. Sometimes when visitors came they would say, 'You are such lucky children;' 'it's a fairytale life you live.' And I knew they were right, it was a fairytale upbringing. But fairy tales are dark and I had no way of telling either a stranger or a friend what was going on; the abnormal became ordinary.Liza Campbell was the last child to be born at the impressive and renowned Cawdor Castle, the family seat of the Campbells, as featured in Shakespeare's Macbeth. Liza's father Hugh, the twenty-fifth Thane, inherited dashing good looks, brains, immense wealth, an ancient and revered title, three stately homes, and 100,000 acres of land. A Charmed Life tells the story of Liza's idyllic childhood with her four siblings in Wales in the 1960s, until Hugh inherited Cawdor Castle and moved his family up to the Scottish Highlands. It was at the historical ancestral home that the fairytale began to resemble a nightmare. Increasingly overwhelmed by his enormous responsibilities, Hugh tipped into madness fuelled by drink, drugs, and extramarital affairs.  Over the years, the castle was transformed into an arena of reckless extravagance and terrifying domestic violence, leading to the abrupt termination of a legacy that had been passed down through the family for six hundred years.Written with a sharp wit, A Charmed Life is a contemporary fairytale that tells what is like to grow up as a maiden in a castle where ancient curses and grisly events from centuries ago live on between its stone walls. Painstakingly honest and thoroughly entertaining, Liza Campbell offers a compelling look at what it is like to grow up with enormous privilege and yet watch the father she idealizes destroy himself, his family, and his heritage.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Scotland",
    "History",
    "Biography Memoir",
    "Family"
  ],
  "author": "Liza  Campbell",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/1815048.A_Charmed_Life"
}