{
  "title": "The Book of the Short Sun: On Blue's Waters/In Green's Jungles/Return to the Whorl",
  "description": "When The Book of the Long Sun, Gene Wolfe’s science fantasy masterpiece, concluded, the Whorl – a giant generational starship sent out from Urth 300 years before – had arrived at its destination, a solar system with two habitable planets, Blue and Green. At the urging of Whorl’s religious leader, Patera Silk, the people left the ship for an uncertain future on Blue – a world already inhabited by the inhumi, blood-drinking aliens who take human form.Now The Book of the Short Sun carries the story forward to the years after the great exodus, to let Horn, narrator of the earlier work, tell his own story.Horn and his family have made a decent life for themselves on Blue, though crime, pollution and poverty have become so rampant in the city of New Viron that he is called upon to find Patera Silk. Horn must go to the still-orbiting Whorl and convince his old friend and mentor to return to Blue, for the legendary hero is the only one who can restore order and lead them to prosperity. But Horn isn’t even sure Silk still lives.Setting sail in a small boat, the aging Horn embarks on a long and difficult journey across the planet, trying to get to the Whorl. With the undine Seawrack, his adopted inhumi son, Krait, and his eldest son, Sinew, Horn makes it to the last working lander – only to be highjacked to the jungles of Green, where the inhumi imprison the passengers as slaves. There, he encounters the mysterious alien Neighbors who were once native to Blue, but whom the inhumi have all but exterminated. Horn joins their fight for freedom, is fatally wounded… and finds himself on another world, wearing a different body.As his inability to find Silk weighs heavily on his mind, Horn is further tormented by the fact that his new body bears a striking resemblance to the lost Caldé. In the end, he will have to answer a troubling question: has he truly failed in his sworn task, or has he become the very man he sought?Includes:On Blue's WatersIn Green's JunglesReturn To The Whorl",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "Gene Wolfe",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/181490.The_Book_of_the_Short_Sun"
}