{
  "title": "The Black Guard",
  "description": "The launch of an heroic fantasy saga set in the lands of Ro, an epic landscape of mountain fortresses, vast grasslands, roiling ocean and slumbering gods.The Black Guard is the first in a major new fantasy series, The Long War, set in an invented world somewhat similar to medieval Europe in terms of technology, heraldry and ethics. Magic features in the world, but is rare and mostly confined to the various priesthoods. The city of Ro Canarn has been assaulted by Knights of the Red. Amongst them is a Karesian Enchantress of the Seven Sisters, intent on manipulating the men of Ro to her ends. Her Sisters intend the assault to be the first move in a longer game, a war intended to destroy worship of the Gods of men and bring back the malevolent Forest Giant of pleasure and blood.The young Lord of Canarn, and one of his closest friends, plan a desperate gambit to take back the city, whilst his sister journeys north and confronts more of the Sisters' schemes as they try to conquer the rest of the lands of men.Divided by geography and surrounded by enemies, a disparate group of Clerics, Priests, Knights, criminals and warriors must defeat overwhelming odds to seize back the lands of men from those unknowingly under the sway of the Dead God and his Enchantresses.The Duke of Canarn is dead, executed by the King's decree. The city lies in chaos, its people starving, sickening, and tyrannized by the ongoing presence of the King's mercenary army. But still hope remains: the Duke's children, the Lord Bromvy and Lady Bronwyn, have escaped their father's fate.Separated by enemy territory, hunted by the warrior clerics of the One God, Bromvy undertakes to win back the city with the help of the secretive outcasts of the Darkwald forest, the Dokkalfar. The Lady Bronwyn makes for the sanctuary of the Grass Sea and the warriors of Ranen with the mass of the King's forces at her heels. And in the mountainous region of Fjorlan, the High Thain Algenon Teardrop launches his Dragon Fleet against the Red Army. Brother wars against brother in this, the epic first volume of the long war.",
  "genres": [
    "Fantasy",
    "Epic Fantasy",
    "High Fantasy",
    "Fiction",
    "Dark Fantasy",
    "Science Fiction Fantasy",
    "Magic"
  ],
  "author": "A.J.   Smith",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/18159154-the-black-guard"
}