{
  "title": "Pestilence",
  "description": "A break-in at the hospital morgue, the unexplained disappearance of certain bodies, intrigue among the senior staff and a chance encounter with a grieving widower prompt Dr James Saracen to question irregularities surrounding the death of a woman at Skelmore General Hospital. Narrowly avoiding personal disaster, he unearths a conspiracy to conceal the fact that she died of a disease believed to have faded out in England hundreds of years ago.The woman has recently come from abroad and the lazy and politically motivated head consultant carelessly assumes that this is an isolated incident. Saracen is sceptical and is proved right when more and more cases are brought in to the Accident and Emergency Unit. Faced with the outbreak of a highly contagious epidemic, which seems to defy the rules of containment, the town is placed under martial law. Suspense builds as Saracen struggles relentlessly against the clock to trace the elusive source of the pestilence and save the midlands town from annihilation.The legend of the curse of Skelmore, the lost site of a monastery, a young boy's delirious rantings - all add to the mystery. Saracen, putting both his job and his life on the line, must enter the realms of a medieval nightmare before the sinister and near-fatal answer is found.This title was first published by Simon & Schuster Ltd. (UK) in 1991. It was subsequently translated into sixteen languages across the globe as well as appearing in large print and audio editions.Ken McClure is the internationally bestselling author of over twenty medical thrillers such as The Lazarus Strain, The Gulf Conspiracy, White Death and Dust to Dust. His books have been translated into twenty-five languages and he has earned a reputation for the accuracy of his predicitions. McClure's work is informed by his background as an award-winning research scientist with the UK's Medical Research Council.",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Medical",
    "Crime",
    "Adult"
  ],
  "author": "Ken McClure",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/10900310-pestilence"
}