{
  "title": "Scappa per Amore",
  "description": "Banyak manusia yang keliru memaknai hidupnya,tapi lebih banyak lagi yang menjalaninya tanpa makna.Italia. Inilah negara keempat yang dikunjunginya. Awalnya, tugas liputan kehidupan kaum Muslim di beberapa negara di Eropa ini diterimanya untuk rehat sejenak dari kenyataan pahit yang sulit dihadapinya. Namun, di depan Fontana di Trevi pun. Diva masih berusaha mengumpulkan kembali serpihan hatinya yang sempat terburai karena cinta. Scappa per Amore—lari karena cinta, istilah dalam bahasa Italia ini tepat sekali menggambarkan perjalanannya. Namun, tak seperti manusia, Tuhan tak pernah meninggalkan mereka yang mencintainya. Justru di negara-negara tempat Islam menjadi minoritas itulah Diva bertemu para pejuang kehidupan yang memberinya banyak pelajaran berharga. Hakima yang rela diusir demi mempertahankan kepercayaannya. Karima dan Elise yang rela mengorbankan berbagai prestasi demi selembar hijab, teman-teman baru yang membukakan matanya dan mengenalkannya pada sisi unik Islam di Eropa, sampai Vivi, sahabat lamanya yang memberikan kejutan tak terkira.Namun, di tengah perjalanan, sebuah panggilan rindu dari mamanya di Jakarta membuatnya gamang. Hatinya cemas. Dia takut mamanya tak sekadar kangen. Diva pun harus memilih di antara tanggung jawabnya pada keluarga atau pekerjaan. ***\"Manusia selalu memerlukan perjalanan untuk menemukan kebijaksanaan. Novel ini memberi kita keduanya.\"-Fahd Djibran, penulis novel Semesta Sebelum Dunia\"Perjalanan ke enam negara Eropa yang dirangkai Dini Fitria ini mampu mengantarkan pembaca pada pemahaman tentang hidup sederhana, berdaya guna, dan sarat cinta.\"-Taufik Ismail, penyair dan sastrawan\"Tak banyak novel yang mengangkat tema dan latar keislaman di Eropa. Karya Dini ini adalah satu di antara yang sedikit itu--dengan berani dan cerdas menyuguhkan pada Anda sebuah pendekatan Islam yang indah dan cinta damai.\"-Komaruddin Hidayat, Rektor UIN Syarif Hidayatullah \"A rejuvenating novel, it is more than just portraying a snapshot of Muslim's life in Europe. It offers us priceless lesson about what's really meaningful in our life.\"-Arturo Cerulli, Wali Kota Muslim Monte Argentario Italia",
  "genres": [
    "Fiction",
    "Indonesian Literature",
    "Travel",
    "Romance",
    "Adventure"
  ],
  "author": "Dini Fitria",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/18161149-scappa-per-amore"
}