{
  "title": "The New Jefferson Bible: The Life and Morals of Jesus of Nazareth in Modern English",
  "description": "Over two hundred years ago, Thomas Jefferson began to carve away at the King James Bible with a razor—an action considered by some then and today to be blasphemous—out of a desire to produce a linear narrative of the life of Jesus of Nazareth free of claims of divinity or mentions of miraculous events. The work he produced, The Life and Morals of Jesus of Nazareth, has since come to be known as The Jefferson Bible.The words and story of Jesus of Nazareth as compiled by Thomas Jefferson are now available in modern English for the first time. Dan Marshall has pored over the Open English Bible translation to bring you those verses selected by Jefferson himself. The OEB translation was released in 2010 by the Open English Bible Project (www.OpenEnglishBible.org). Written at a high school reading level, it was designed with usability, readability, and accuracy in mind. Thanks to these modern efforts, you can understand the Gospel passages culled by Thomas Jefferson in a way never before possible. Learn the story of Jesus as viewed by one of America's most well-known Founding Fathers.Immediately following The New Jefferson Bible, Dan Marshall presents his vision of the teachings and life story of the person known as Jesus, written in paragraphs instead of verses. The Marshall edit is half the length of Jefferson's book. In holding with the vision of rejecting the supernatural, the teachings of Jesus are offered free of mentions of eternal life, threats of punishment, and references to a deity. Do the moral lessons of Jesus stand when separated from the influence of religious authority? Readers must decide for themselves.Get The New Jefferson Bible: The Life and Morals of Jesus of Nazareth in Modern English today. It's the most famous story you've yet to read.",
  "genres": [
    "Nonfiction",
    "Religion"
  ],
  "author": "Dan  Marshall",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18160781-the-new-jefferson-bible"
}