{
  "title": "Those Poor, Poor Bastards",
  "description": "'THE WALKING DEAD AND HELL ON WHEELS COLLIDE!'\nThe year is 1868...IN THE SIERRA NEVADA, during the expansion of the Central Pacific Railroad, Nina Weaver and her pa, Lincoln, trundle into Coburn Station with a wagonful of goods they're looking to barter. Of all the rotten luck, their world—and the future of the American West—is forever changed when a sudden swarm of zombies invades town on the hunt for some human-sized vittles.THOSE POOR, POOR BASTARDS is the first volume in the all-new Old Western Action-Horror series, \"Dead West.\" What folks are saying...\"...the cover blurb describes [it] as 'The Walking Dead and Hell on Wheels collide.' Not having seen the former nor being familiar with the latter, I would describe it as Night of the Living Dead meets H. P. Lovecraft and Dr. Fu Manchu...\"—Keith West, Amazing Stories Magazine\"Those Poor, Poor Bastards (the authors, as well as the book) prove that zombies and the West were made for each other, and that the undead fiends still have plenty of guts and action to offer.\"—Lincoln Crisler, author of WILD\"Unlike many zombie books in the genre, where you never really understand how the undead have risen from their graves, in 'Dead West' the authors don't mind sharing the zombies' origin. It is a very unique twist that I really enjoyed and comes straight out of American history...a nod I found to be a nice touch.\"—Tyson Mauermann, Speculative Book Review \"If there is a typical zombie fan, then I am probably not it. In fact, this was my first time reading about 'deaduns' and now I'm hooked! The story flowed with ease, the characters were vivid and most parts likeable, even the not-so-pleasant characters gain your respect and empathy towards the end. I loved the fact that it's set in the Wild West rather than modern times or some apocalyptic future. I recommend Dead West to my friends, and am looking forward to book two!\"—Sarah Fernandes, Advance Reader\"A Rip-Snortin', Ace-High addition to the walking buzzard-food genre. Marquitz, Martin, and Soward have a hit series on their hands!\"—Paul Martin, Self-Publisher's Showcase \"I'm not a big Weird Western reader. I'm not a big zombie reader. But this first Dead West book is better than just another Weird Western or just another zombie book. The writing is very visceral, raw in a style similar to Chuck Wendig...this is a high octane story [but] what makes this story stand out among the rest is the drama between the human characters.\"—Ryan Lawler, Amazon Reviewer\"Two parts bullets, three parts shambling undead, one part magic. All fast-paced Wild West action. Dead West takes you on a wild ride.\"—Becca Butcher, Advance Reader",
  "genres": [
    "Zombies",
    "Horror",
    "Fantasy",
    "Westerns",
    "Historical Fiction"
  ],
  "author": "Tim Marquitz",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/18163999-those-poor-poor-bastards"
}