{
  "title": "Conflict Rising",
  "description": "THE SERIESInspired by the Raiders of the Lost Ark, Ancient Aliens and Doctor Who“Best sci-fi time travel story going!” – S. LennonTravel back in time with the Aurora Conspiracy Prequel Series and follow Aurelius, a man from another world, on his adventure with generation after generation of the Proctor family through some of the most important events and discoveries in history. Meet famous historic figures and discover how they were impacted. The possibilities are endless with this cast of characters, who must surely be out there somewhere.Continuing on from Crash Landing…CONFLICT RISING“I can’t wait any longer. It’s time to take control.” Emily Proctor journal entry - December 3, 1897Devastated and angry, Emily will stop at nothing to get Aurelius home, if she can only find him. On her new adventure, she will meet Liza, the witch doctor, and just in the nick of time… but is it Liza of the past or Liza of the future? Emily will also discover a secret that will change the Proctors forever.Meanwhile, Aurelius investigates the Underground, the true “Area 51” operated by the military and a strange society. He will cross paths with arch rival enemy and future ally, Syrius, who will save the day more than once throughout the Aurora Conspiracy saga. While he’s there, he is also introduced to Nikola Tesla, who vows to get him home.Emily will meet Syrius and discover that he knows Aurelius and where the Underground is. When she decides to follow him, she finds herself in the kind of trouble she never could have imagined, with a noose around her neck. Will she make it out alive, and what does President McKinley have to do with it?Conflict Rising (formerly titled Tesla, McKinley and the Freemasons: Conflict Rising) is the second story from the Aurora Conspiracy Trilogy prequel series. You may also enjoy Quest of the Hybrid (Aurora Conspiracy Trilogy: Book One).",
  "genres": [],
  "author": "Ginger Gelsheimer",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/18165248-conflict-rising"
}