{
  "title": "Zora Neale Hurston's Final Decade",
  "description": "An intriguing investigation of the famous writer’s turbulent final years \"‘Courage’ is the last word that Zora Neale Hurston wrote in her letters. And Hurston’s courage is what Virginia Lynn Moylan documents in this moving and meticulously researched account of the end of Hurston’s life.\"--Anna Lillios, author of Crossing the Creek \"Moylan’s account of Hurston’s last decade contributes to our understanding of a complex artist and individual--one who was pivotal in the creation of the first ‘anthropologically correct’ baby doll and yet opposed court-ordered desegregation.\"--M. Genevieve West, author of Zora Neale Hurston and American Literary Culture \"Hats off to Virginia Lynn Moylan for filling in missing pieces of Hurston’s life story. This sympathetic biography of Hurston’s last years is both a lively introduction to her life and a must-have book for Hurston fans. . . . Add[s] heft and richness to our understanding of all that Hurston was up against and just how much she achieved, in spite of the odds.\"--Carla Kaplan, author of Zora Neale Hurston: A Life in Letters In 1948, false accusations of child molestation all but erased the reputation and career Zora Neale Hurston had worked for decades to build. Sensationalized in the profit-seeking press and relentlessly pursued by a prosecution more interested in a personal crusade than justice, the morals charge brought against her nearly drove her to suicide. But she lived on. She lived on past her accuser’s admission that he had fabricated his whole story. She lived on for another twelve years, during which time she participated in some of the most remarkable events, movements, and projects of the day. Since her death, scholars and the public have rediscovered Hurston’s work and conscientiously researched her biography. Nevertheless, the last decade of her life has remained relatively unexplored. Virginia Moylan fills in the details--investigating subjects as varied as Hurston’s reporting on the trial of Ruby McCollum (a black woman convicted of murdering her white lover), her participation in designing an \"anthropologically correct\" black baby doll to combat stereotypes, her impassioned and radical biography of King Herod, and her controversial objections to court-ordered desegregation. Virginia Lynn Moylan , educator and independent scholar, is a founding member of the Fort Pierce, Florida, Annual Zora Festival and a contributing author to The Inside Light: New Critical Essays on Zora Neale Hurston .",
  "genres": [
    "Biography"
  ],
  "author": "Virginia Lynn Moylan",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/10902336-zora-neale-hurston-s-final-decade"
}