{
  "title": "Needing You",
  "description": "Dear Author,He watched as the loud, aggressive red-head approached the blond boy on the dance floor. ‘Jake’ shook his head. The boy was just his type, but he’d found through the grapevine that the blond also came with a ton of baggage. Evidently the boy’s ex really did a number on him, enough that his friends held an intervention. But it didn’t help, the boy just stopped talking to all of them. Why the kid stayed with his ex for so long ‘Jake’ couldn’t understand, but now the boy was free and still making all the wrong choices. The boy put on a brave front as he laughed, flirted and seemed to revel in the hungry eyes on him. But when he thought no one was watching, the smile slipped away and sadness settled across his features. And each time the boy returned to the club after an encounter, he looked more broken than the time before. But why should ‘Jake’ care? The boy wasn’t his problem. What the kid needed was a shrink. So why did ‘Jake’ keep thinking about him? Too much baggage he kept telling himself. But every time he looked at the lost boy he couldn’t help thinking, “What if?”Photo Description: The slim sub’s thumb was dipped inside his blue tie-dyed underwear, teasing his cock. He’d worn them to please his Dom, and the addition of his shiny motorcycle jacket, his only other piece of clothing, was the perfect naughty counterpoint to his sweet face. His high cheekbones, that soft blond hair sweeping just above his gray-blue eyes, and those plump, pink lips made him look innocent. The heat in his eyes was anything but.This story was written as a part of the M/M Romance Group's \"Love Has No Boundaries\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Paranormal",
    "Romance",
    "Contemporary",
    "Novella",
    "Short Stories"
  ],
  "author": "Alicia Nordwell",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/18164695-needing-you"
}