{
  "title": "Tuanku Rao",
  "description": "Memperbincangkan sejarah, serasa tidak akan pernah sampai pada puncak kebenaran. Semua serba nisbi, relatif. Sebab, sejarah erat kaitannya dengan serpihan-serpihan kebenaran dan pengetahuan masa lalu, yang supaya bermakna perlu ditata dan ditafsirkan ulang. Jadi, sejarah (hanya) merupakan tafsir. Dan sebuah tafsir bukanlah segumpal kebenaran mutlak. Ia baru upaya untuk mendekati sebuah kebenaran. Itulah mengapa Friederich Nietzsche, filsuf berkebangsaan Jerman, pernah menyatakan, tidak ada fakta dalam masalah kebenaran dan pengetahuan, yang ada hanyalah tafsir. Tampaknya ungkapan itu juga sesuai untuk sejarah.Tuanku Rao adalah sebuah buku yang berupaya menggali dan menafsirkan kembali serpihan-serpihan pengalaman masa lampau itu, terutama yang terkait dengan Perang Paderi. Melalui buku ini, penulis (M.O. Parlindungan), mengajak kita mengunjungi kembali ke masa lalu Tanah Batak secara gamblang, dengan berupaya memahami proses-proses yang terjadi di balik teror kekerasan penyebaran agama Islam Madzhab Hambali di Tanah Batak pada 1816 sampai 1833.Selama berlangsungnya perang, pasukan kaum Paderi tidak hanya berperang melawan Belanda, namun mereka juga menyerang Tanah Batak Selatan, Mandailing, untuk meng-Islam-kan Tanah Batak Selatan dengan menggunakan kekerasan senjata. Agama Islam yang masuk ke Mandailing dinamakan, oleh penduduk setempat, sebagai Silom Bonjol (Islam Bonjol), karena para penyerbunya datang dari Bonjol, meski dipimpin oleh orang-orang Batak sendiri, yakni, Pongkinangolngolan Sinambela (Tuanku Rao) dan Idris Nasution (Tuanku Nelo), serta Jatengger Siregar (Ali Sakti).Menurut penulis, setidaknya terdapat dua alasan mengapa penyerbuan ke Tanah Batak tersebut dilakukan dengan kekerasan. Selain menyebarkan Islam Madzhab Hambali di Tanah Batak, penyerbuan itu juga dipicu oleh adanya dendam lama keturunan Marga Siregar terhadap Raja Oloan Sorba Dibanua, Dinasti Singamangaraja, yang pernah mengusirnya dari Tanah Batak. Togar Natigor Siregar, pemimpin Marga Siregar pun sampai mengucapkan sumpah yang diikuti seluruh keturunan Marga Siregar, yaitu akan kembali ke Batak untuk membunuh Raja Oloan Sorba Dibanua segenap anak cucunya.Penyerbuan pasukan Paderi baru terhenti pada 1220, karena berjangkitnya penyakit kolera dan epidemi penyakit pes. Dari 150.000 orang tentara Paderi yang memasuki Tanah Batak pada 1818, hanya tersisa sekitar 30.000 orang. Sebagian besar bukan tewas di medan pertempuran, melainkan mati karena berbagai penyakit. Untuk menyelamatkan sisa pasukannya, pada 1820 Tuanku Rao bermaksud menarik mundur seluruh pasukannya dari Tanah Batak Utara, sehingga rencana peng-Islam-an seluruh Tanah Batak tidak dapat diteruskan. Sementara itu, Tuanku Imam Bonjol memerintahkan agar Tuanku Rao bersama pasukannya tetap di Tanah Batak untuk menghadang masuknya tentara Belanda. Akhirnya, Tuanku Rao tewas dalam pertempuran di Air Bangis pada 5 September 1821, sedangkan Tuanku Lelo tewas dipenggal kepalanya, dan tubuhnya dicincang-cincang oleh Halimah Rangkuti, yang merupakan salah satu tawanan sekaligus selirnya.M.O. Parlindungan, dalam buku ini, lebih memilih untuk menuliskan sejarah Batak dengan story telling style (gaya bertutur), yang pada awalnya memang ditujukan kepada anak-anaknya. Di sinilah letak salah satu daya tarik buku ini. Ia muncul secara original karena fokus kajiannya lebih ditekankan pada praktik penciptaan sejarah Batak itu sendiri, ketimbang menjajarkan peristiwa-peristiwa kesejarahan naratif, seperti yang dilakukan kebanyakan sejarawan selama ini. Menariknya lagi, dokumen yang digunakan sumber penulis dalam menulis buku ini, semula adalah warisan dari sang ayah sendiri, Sutan Martua Raja Siregar, cucu Tuanku Ali Sakti dan Tuanku Lelo (hal. 358).Meski kita tak harus menyetujui keseluruhan ulasan maupun perdebatan yang menyertainya, praktis buku ini demikian berharga dan sayang untuk dilewatkan. Dengan keruntutan bahasa yang disajikan, buku ini jelas sangat imajinatif. Selain itu, buku ini juga diperkaya dengan 34 lampiran, yang antara lain berisi silsilah Raja-Raja Batak dan Minangkabau, serta dipenuhi serangkaian penelitian Willem Iskandar, di samping dokumen Klenteng Sam Po Kong, Semarang, hasil penyelidikan Residen Poortman, prestasi kesejarahan yang telah dicapai M.O. Parlindungan lewat buku setebal 691 halaman ini sayang diabaikan, terutama bagi kalangan ilmuwan yang memerlukan bahan rujukan atau karya pembanding tema ini.Dus, kehadiran buku ini patut menduduki tempat khusus di dalam penulisan sejarah berdasarkan fakta dan representasi historiografi sebagai interpretasi yang tidak mutlak. Adalah tidak berlebihan jika mengatakan bahwa karya yang inovatif ini merupakan satu dari beberapa gelintir karya yang akan menyulut perdebatan kalangan ilmuwan. Utamanya perdebatan mengenai historiografi Indonesia itu sendiri. Sebuah karya yang fantastis.Peresensi adalah Pustakawan, Mahasiswa Fakultas Tarbiyah Institut Agama Islam Negeri Sunan Ampel, Surabaya( www.inibuku.com)",
  "genres": [
    "History",
    "Indonesian Literature",
    "Nonfiction"
  ],
  "author": "Mangaradja Onggang Parlindungan",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/1816540.Tuanku_Rao"
}