{
  "title": "New Life, No Instructions",
  "description": "The Pulitzer Prize winner and New York Times bestselling author of Let’s Take the Long Way Home now gives us a stunning, exquisitely written memoir about a dramatic turning point in her life, which unexpectedly opened up a world of understanding, possibility, and connection. New Life, No Instructions is about the surprising way life can begin again, at any age. “What do you do when the story changes in midlife? When a tale you have told yourself turns out to be a little untrue, just enough to throw the world off-kilter? It’s like leaving the train at the wrong stop: You are still you, but in a new place, there by accident or grace, and you will need your wits about you to proceed. “Any change that matters, or takes, begins as immeasurably small. Then it accumulates, moss on stone, and after a few thousand years of not interfering, you have a glen, or a waterfall, or a field of hope where sorrow used to be. “I suppose all of us consider our loved ones extraordinary; that is one of the elixirs of attachment. But over the months of pain and disrepair of that winter, I felt something that made the grimness tolerable: I felt blessed by the tribe I was part of. Here I was, supposedly solo, and the real truth was that I had a force field of connection surrounding me. “Most of all I told this story because I wanted to say something about hope and the absence of it, and how we keep going anyway. About second chances, and how they’re sometimes buried amid the dross, even when you’re poised for the downhill grade. The narrative can always turn out to be a different story from what you expected.” Advance praise for New Life, No Instructions  “New Life, No Instructions is beautifully written, lucid, and wise. We come of age again and again during the course of our lives, and need those who have traveled the path before us to shine a light, to lend a hand. Caldwell’s story is moving and gripping. I found myself feeling that I had indeed been given a valuable set of instructions for how to proceed with eyes and heart wide open.”—Dani Shapiro, author of Devotion and Slow Motion  “In Gail Caldwell’s New Life, No Instructions we see a Pultizer Prize winner once again go out and earn the title. It is a meditation on how seemingly faint winds can blow us wildly off course; on how spending time with a beloved animal can benefit our basic humanity; and on what it means to overcome, at middle age, a multitude of blows. It is lyrical and smart and triumphant and you won’t read a more honest memoir in your life.”—Darin Strauss, author of Chang and Eng and Half a Life Praise for Let’s Take the Long Way Home\n \n “A near-perfect memoir: beautiful, humble, intimate and filled with piercing insights.”—Time (Top 10 Nonfiction Book of 2010)  “Stunning . . . gorgeous . . . intense and moving . . . a book of such crystalline truth that it makes the heart ache.”\n—The Boston Globe\nFrom the Hardcover edition.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Dogs",
    "Biography Memoir",
    "Autobiography",
    "Audiobook"
  ],
  "author": "Gail Caldwell",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/18167004-new-life-no-instructions"
}