{
  "title": "Kaylee's Keeper",
  "description": "Welcome to The Castle.Kaylee Waters has saved her pennies for almost two years, mentally debated for six months, changed her mind no less than two-dozen times and finally purchased a three-day pass to what promised to be the vacation of a lifetime: The Castle, the kinkiest theme-resort-to-end-all-vacation-resorts.So what if she'd fibbed a little on her online application? (Everyone does!) So what if she'd never \"actually\" engaged in BDSM before? (She's thought about it a lot.) So what if she'd never even been spanked? (She's read tons of books.) This was the Castle, after all, and it promised to change everything. Unfortunately, her first scenario is a catastrophe and sends her from the room in tears, only to be sent to Master Marshall's office - like a bad girl sent before the principal.Marshall Leaf, founding partner of The Castle, has seen a lot in the three years since the resort opened, but Ms. Kaylee Waters pretty much takes the prize. As far as he can determine, the only truthful thing on her application is her name, and he's not even completely sure about that. She lied so heinously about her past experiences (which are exactly zilch) that what he should do is refund her money and put her on a fast bus home. Instead, for reasons he can't quite understand, he gives her the first spanking of her life, and then sends her back out into the resort. He doesn't give a damn whether she wanted the spanking or not: it was exactly what she needed.Kaylee should be ecstatic. She's already gotten a spanking, and The Castle is perfect: everything she's dreamed of - and more. She can be anything she wants: sassy maid, naughty schoolgirl, bad \"baby\" in the nursery, captured princess in the dungeon. But, even though the ice has been broken, why isn't she still fitting in anywhere? Why does everything just feel wrong? Why does she break the rules again and again, and find herself right back in Master Marshall's office?Why indeed?\"Kaylee's Keeper\" is the second book in Maren Smith's Masters of the Castle series. Set three years after \"Holding Hannah: Masters of the Castle Book One, it is a stand-alone story. Kaylee's Keeper features explicit BDSM themes in a romance setting, including spanking, anal play, mouth-washing, schoolroom play, and lots more. If these themes offend you, don't buy this book.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Contemporary Romance",
    "Erotic Romance",
    "Fiction",
    "Menage"
  ],
  "author": "Maren Smith",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/18167698-kaylee-s-keeper"
}