{
  "title": "100 Amazing Facts About the Negro",
  "description": "The first edition of Joel Augustus Rogers’s now legendary 100 Amazing Facts About the Negro with Complete Proof, published in 1934, was billed as “A Negro ‘Believe It or Not.’” Rogers’s little book was priceless because he was delivering enlightenment and pride, steeped in historical research, to a people too long starved on the lie that they were worth nothing. For African Americans of the Jim Crow era, Rogers’s was their first black history teacher. But Rogers was not always shy about embellishing the “facts” and minimizing ambiguity; neither was he above shock journalism now and then. With élan and erudition—and with winning enthusiasm—Henry Louis Gates, Jr. gives us a corrective yet loving homage to Roger’s work. Relying on the latest scholarship, Gates leads us on a romp through African, diasporic, and African-American history in question-and-answer format. Among the one hundred Who were Africa’s first ambassadors to Europe? Who was the first black president in North America? Did Lincoln really free the slaves? Who was history’s wealthiest person? What percentage of white Americans have recent African ancestry? Why did free black people living in the South before the end of the Civil War stay there? Who was the first black head of state in modern Western history? Where was the first Underground Railroad? Who was the first black American woman to be a self-made millionaire? Which black man made many of our favorite household products better? Here is a surprising, inspiring, sometimes boldly mischievous—all the while highly instructive and entertaining—compendium of historical curiosities intended to illuminate the sheer complexity and diversity of being “Negro” in the world.(With full-color illustrations throughout.)",
  "genres": [
    "History",
    "Nonfiction",
    "African American",
    "Race",
    "Africa",
    "Biography",
    "American History"
  ],
  "author": "Henry Louis Gates Jr.",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/18166878-100-amazing-facts-about-the-negro"
}