{
  "title": "Mit falscher Zunge",
  "description": "Odessa 1883: Hinter einem Lagerhaus des jüdischen Kaufmanns Max Schiff wird die Leiche eines jungen Mädchens gefunden. Die Tat ist als Ritualmord getarnt. Schiff wird verhaftet und vom Mob gelyncht obwohl der wahre Täter woanders zu finden ist. Jahre später wird in Winnipeg ein ähnlicher Mord begangen, der erschreckende Parallelen zum Fall von Odessa aufweist. Nachdem ein Rabbi als Mörder verhaftet wird, beauftragt die jüdische Gemeinde Sam Klein, der als Mädchen für alles bei der Bordellbesitzerin Melinda arbeitet, sich auf die Suche nach dem wahren Mörder zu machen. Die gestaltet sich schwieriger als gedacht. Seine Nachforschungen führen ihn schon bald in die besseren Kreise der Winnipeger Gesellschaft und zu einem windigen Makler namens Tooley, der beste Beziehungen unterhält, seine Kundschaft allerdings regelmäßig betrogen hat. Während der Rabbi für schuldig befunden wird und gehängt werden soll, wird der wahre Mörder offensichtlich nervös: Sam selbst entgeht nur knap p mehreren Anschlägen und findet schließlich Tooley tot im Haus von dessen Schwester vor, nachdem bereits kurz zuvor ein befreundeter Polizist und das Freudenmädchen Amy gewaltsam ums Leben kamen, ehe sie Sam und seinem Partner, dem Reporter Maloney, etwas Entscheidendes mitteilen konnten. Schließlich wird das Freudenmädchen Sarah, die für Tooley gearbeitet hat und in die Sam sich verliebt hat, zum Schlüssel des Ganzen. Sie erzählt Sam von Tooleys Aufzeichnungen, die dieser bei ihr hinterlegt hat wodurch sie ebenfalls in Lebensgefahr schwebt! Als Sam die Unterlagen durchgeht, stößt er auf den Namen von Isaac, seinem väterlichen Freund, dem Vorsitzenden der jüdischen Gemeinde. Als er ihn zur Rede stellt, gesteht dieser, dass er die Morde begangen hat einige auch sein Handlanger. Das polnische Mädchen musste sterben, weil sie Zeugin einer Unterhaltung wurde, deren Inhalt nicht an die Öffentlichkeit sollte. Das Motiv hinter allem war Gier außerdem hatte er herausgefunden, dass Tool ey ihn betrogen hatte. Den Mord hatte er als Ritualmord getarnt, weil er die Tat in Odessa kannte: Schiff war Sams Vater gewesen und Isaac der Agent, der ihn eigentlich retten wollte. Bei der anschließenden Schießerei kommt Isaac ums Leben. Sam heiratet einige Monate später Sarah und eröffnet eine Detektei ...",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Historical Fiction"
  ],
  "author": "Allan Levine",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/18166417-mit-falscher-zunge"
}