{
  "title": "The Stigmatist",
  "description": "The Stigmatist is a novel of religious mysticism and international intrigue. At the outset, American pilgrims at an apparition site in Spain are caught up in frightening visions of how they stand with God -- a warning calling them to amend their ways. Fr. Anthony Santorelli, an American priest sent by the Vatican to investigate, returns with a message for the Pope which foreshadows the spread of the \"warning\" visions, and a series of dire events. To authenticate his role as a messenger and prophet, the priest is mystically marked with bloody stigmata in his hands, feet and side, replicating the five wounds of Christ on the Cross.Fr. Santorelli persuades the Pope to endorse the visions as sent by God to provide a time of grace for repentance, and they spread inexorably from country to country, among Christians and Jews. The Pope's approval of the warning visions provokes European Union bureaucrats, who have long resented the Holy See's resistance to their secular agenda, and its efforts to preserve the \"Christian identity\" of Europe. They turn the force of EU sanctions against the tiny nation-state.High level clerics in the Vatican who have been disturbed by the visions seize on the EU's action as an excuse to attempt to remove the Pope. And deadly opposition comes from the head of Iran's Revolutionary Guards, who regards the Roman Catholic Church as the main opponent of the spread of Islam over the centuries. He persuades himself that the Church is responsible for sending the visions and that the Vatican must be destroyed before it can generate visions that proselytize Muslims. One terrorist plot leads to another, and conflicts spin out of control in a number of countries.The Stigmatist is the story of Fr. Santorelli's very human struggle to accept and fulfill his painful mystical calling while he is being drawn by God into Vatican plots, international intrigues, terrorist acts, and nuclear war.",
  "genres": [],
  "author": "Hurd Baruch",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/10902936-the-stigmatist"
}