{
  "title": "The Scarlet Sisters: Sex, Suffrage, and Scandal in the Gilded Age",
  "description": "A fresh look at the life and times of Victoria Woodhull and Tennie Claflin, two sisters whose radical views on sex, love, politics, and business threatened the white male power structure of the nineteenth century and shocked the world. Here award-winning author Myra MacPherson deconstructs and lays bare the manners and mores of Victorian America, remarkably illuminating the struggle for equality that women are still fighting today.Victoria Woodhull and Tennessee \"Tennie\" Claflin-the most fascinating and scandalous sisters in American history-were unequaled for their vastly avant-garde crusade for women's fiscal, political, and sexual independence. They escaped a tawdry childhood to become rich and famous, achieving a stunning list of firsts. In 1870 they became the first women to open a brokerage firm, not to be repeated for nearly a century. Amid high gossip that he was Tennie's lover, the richest man in America, fabled tycoon Cornelius Vanderbilt, bankrolled the sisters. As beautiful as they were audacious, the sisters drew a crowd of more than two thousand Wall Street bankers on opening day. A half century before women could vote, Victoria used her Wall Street fame to become the first woman to run for president, choosing former slave Frederick Douglass as her running mate. She was also the first woman to address a United States congressional committee. Tennie ran for Congress and shocked the world by becoming the honorary colonel of a black regiment.They were the first female publishers of a radical weekly, and the first to print Karl Marx's Communist Manifesto in America. As free lovers they railed against Victorian hypocrisy and exposed the alleged adultery of Henry Ward Beecher, the most famous preacher in America, igniting the \"Trial of the Century\" that rivaled the Civil War for media coverage. Eventually banished from the women's movement while imprisoned for allegedly sending \"obscenity\" through the mail, the sisters sashayed to London and married two of the richest men in England, dining with royalty while pushing for women's rights well into the twentieth century. Vividly telling their story, Myra MacPherson brings these inspiring and outrageous sisters brilliantly to life. \"If the subject of Gilded Age women brings to mind buccaneers in gently rustling hoop skirts rather than feminist firebrands, Myra MacPherson's fascinating dual biography...may go a long way in changing that.\"—Vogue.com\"In this sweeping, engaging new biography, Myra MacPherson chronicles lives that intersected with nearly all of the era's great themes and famous figures.\"—Boston Globe\"[In] MacPherson's enchanting dual biography...the epilogue hammers home that even in 2014 men use women's bodies as political bargaining chips.\"—The Washington Post\"A lively account of the unlikely lives of the two most symbiotic and scandalous sisters in American History.\"—The New Yorker\"'MacPherson crusades' for 19th century feminists.\"—Vanity Fair\"Are these sisters the most scandalous feminists of all time? MacPherson's new book is about two sisters in the late 1800's but couldn't be more timely.\"—Metro \"MacPherson, an award-winning journalist, takes a theatrical approach to these radical proceedings. She provides a cast of characters and unfolds the sisters' story over the course of five irresistible 'acts.' This is a grand tale presented on a grand scale.\"—Bookpage\"MacPherson aims her wit and very sharp pen at a side of the suffrage movement rarely seen in history books, epitomized by these two real sisters...she takes us on a raucous romp through secret trysts, their self-published weekly advocating free speech and free love, sensational trials, fortune-telling, Spiritualism and brushes with the most powerful capitalists and revolutionaries of the time. Along the way the sisters set the suffrage movement on fire--albeit briefly--with their modern ideas, fiery rhetoric and passion for women's rights.\"—Los Angeles Daily Journal\"Sensational...MacPherson gives a detailed portrait of the roller-coaster, rags-to-riches lives of two backwoods country girls, who, seeking to better their own situation, hoped to do the same for women everywhere...\"—Booklist\"\"Delightful...I am going to read it again! It is that good. Thanks to 'Vicky and Tennie' for making history-changing so darn interesting.\" —BookReporter\"Ordinarily, one would look to the fiction of Twain or Dickens to find a nineteenth-century tale to match the real-life saga of the sisters Claflin-Woodhull. Happily, Myra MacPherson has rediscovered these proto-feminists. Their rebellion against Victorian sexual enslavement and the power of white males captivated and infuriated their contemporaries for good reason, and left a mark that resonates today.\"—Carl Bernstein, Pulitzer Prize-winning journalist, author of A Woman in Charge: The Life of Hillary Rodham Clinton, and coauthor of All the President's Men (with Bob Woodward)\"Victoria Woodhull is one of the great unsung characters of American history--a beauty, a radical activist, a con artist, and a true revolutionary who pushed every boundary and every button that the century offered. THE SCARLET SISTERS is a roller-coaster ride though American history that will amaze and delight readers.\"—Debby Applegate, Pulitzer Prize winner for The Most Famous Man in America: The Biography of Henry Ward Beecher\"THE SCARLET SISTERS has everything--from history and intrigue, to sex and money. Myra MacPherson has written this book with the care and professionalism of the great reporter she is but also with the wit, wisdom, and flair of the great novelist she definitely could be. A fabulous delight of a read.\"—Jim Lehrer, former host of PBS NewsHour, playwright, and author of Top Down: A Novel of the Kennedy Assassination\"Read the epilogue first, to understand immediately why THE SCARLET SISTERS resonates so richly in today's political world. Myra MacPherson's rich understanding of the threads connecting these colorful pioneers to our contentious twenty-first century issues is wonderfully instructive.\"—Lynn Sherr, author of Failure Is Impossible: Susan B. Anthony in Her Own Words and the forthcoming Sally Ride: America's First Woman in Space\"If the Scarlet Sisters hadn't existed, feminism would have had to invent them. Myra MacPherson writes the story of these fearless and path-breaking nineteenth-century radicals with her trademark energy and wit. This sisterhood is indeed powerful.\"—Ellen Goodman, Pulitzer Prize-winning journalist and coauthor of I Know Just What You Mean: The Power of Friendship in Women's Lives (with Patricia O'Brien)\"Myra MacPherson's THE SCARLET SISTERS vividly and entertainingly brings to life a long lost chapter of American history that will surprise anyone who thinks that feminism is a twentieth century invention. It's both a great tale, and a great read.\"—Jane Mayer, staff writer for the New Yorker and author of The Dark Side\"Myra MacPherson is a treasure among American historians. In [her] riveting, often uproarious chronicle, the Sisters' crusades against benighted convention were but the onset of a righteous firestorm that continues to arc into our times.\"—Ron Powers, Pulitzer Prize-winning journalist, novelist, and author of Mark Twain: A Life\"Woodhull and Claflin deserve credit for crashing the glass front doors of Wall Street, Washington, and bedrooms across the country a century and a half ago. These too long neglected amazing pioneers of the Gilded Age are brought to life in Myra MacPherson's energetic, well researched, and enthralling book.\"—Kenneth D. Ackerman, author of The Gold Ring: Jim Fisk, Jay Gould, and Black Friday, 1869",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Feminism",
    "American History",
    "Book Club",
    "Womens"
  ],
  "author": "Myra MacPherson",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/18170162-the-scarlet-sisters"
}