{
  "title": "Milked Into Thrall",
  "description": "WHAT WOULD YOU GIVE FOR A LIFETIME OF PURE PLEASURE?Heather Childe always knew she was a creature of pleasure. Young and beautiful, she uses her body to get whatever she wants, and what she wants is to be carried off to Europe by the rich and handsome Olympic recruiter who's just arrived on campus. The desperate twenty-year-old offers him her body in exchange for a ticket out of her go-nowhere life, and he takes her up on the offer, but only on one condition: she has to agree to give up her freedom as well.Torn between returning to a life of freedom and near-poverty or submitting to the demands of a master who promises her bliss beyond all measure, Heather agrees to follow Mr. Mason onto the ship he's chartered for their voyage home. She thinks she'll be nothing more than his plaything, but after only a few hours onboard, she soon finds herself in the clutches of a doctor who keeps talking about gene therapy and a dangerously attractive assistant who won't let her leave. What do these madmen plan to do with her? Why do they insist on calling her Subject 424 and not her real name?All becomes clear when she wakes up strapped to a hospital bed with breasts so large and tender she can barely even breathe without igniting an almost unquenchable sexual thirst. Transformed into a human cow, she’s stripped of her clothes, her words, and even her humanity as she’s molded into the true creature of pleasure she always knew she was.But isn’t there more to life than pleasure? She thinks she should care more about her lost freedom, but how can she when her whole life revolves around being pleased? The milkings are heaven. The sex is better than any she's ever known. If she doesn't make a stand soon, she'll lose her humanity forever, but how could she ever possibly rebel after she's been milked into thrall? MILKED INTO THRALL is a 23,000 word erotica featuring BDSM themes including bondage, domination, lactation, milking, pet play, pony play, and dark sexual encounters involving male/female, and female/female pairings. This is a work of fiction meant for an adult audience. The author does not condone or endorse any of the behaviors carried out by its characters.",
  "genres": [
    "BDSM",
    "Erotica",
    "Dark",
    "M F Romance"
  ],
  "author": "Jena Cryer",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/18168954-milked-into-thrall"
}