{
  "title": "Bhutan: The Kingdom at the Centre of the World",
  "description": "A small, sparsely populated kingdom at the eastern end of the Himalayas, Bhutan is often described as one of the most isolated countries on earth. In this unprecedented portrait an informed and insightful mix of political history and travel writing Omair Ahmad shows that the opposite, in fact, is true. Located at the intersection of several political, cultural and religious currents, Bhutan has been a part of, and been shaped by, some of the most transformative events in Asian and world history. Beginning with Padmasambhavas epic work to establish Buddhism in the Himalayas, The Kingdom at the Centre of the World tells the story of Bhutans emergence as an independent Buddhist nation in the seventeenth century under the Shabdrung Ngawang Namgyal, who turned his back on Tibet; the exploits of Jigme Namgyal the Black Regent who united Bhutan and fought the armies of British India to a standstill; and the remarkable Wangchuk monarchs, who have ruled Bhutan since the beginning of the twentieth century. Alongside, the book also examines events around Bhutan that have affected it profoundly: the rise and fall of Tibet and the Mongol and British empires; the spread of Nepali-origin people across South Asia; Sikkims dramatic loss of sovereignty; and the conflicting territorial ambitions of India and China. Most fascinating of all, the book argues that it is in Bhutan more, perhaps, than in any other nation that alternative modes of governance and progress are being tested in an increasingly homogenized world. As it chooses Gross National Happiness (GNH) over Gross National Product (GNP), grapples with a complicated refugee crisis, experiments with a guided democracy and tries to retain its cultural heritage while it opens up to the world, Bhutan could have important lessons for us all.",
  "genres": [
    "History",
    "Nonfiction",
    "Travel"
  ],
  "author": "Omair Ahmad",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/18172360-bhutan"
}