{
  "title": "In the Shape of a Man",
  "description": "On the border between the necropolis of Colma, home to over two million dead souls and 1,794 somewhat live ones -- and the gritty industrial working-class town of South City --At 1015 Crestview, little seven-year-old Reynaldo cowers under the escalating abuse hurled by an adoptive mother who now sees him as a burden.Allen, a workaholic Silicon Valley techie, seeks relief from domestic conflict by slipping away to sample the sweet brews at McCoy’s, a mysterious pub and Hell’s Angels hangout.Up the street, young adults Rad and Tawny drift between the worlds of skateboarding and community activism, free love and commitment. Sampling Buddhism and squabbling with the relatives, they avoid thinking about the 15-foot Burmese python in their garage.Does evil exist? Is it still with us? How would it manifest in modern life? This genre-bending novel of alienation and betrayal suggests that evil, as well as redemption, can come In the Shape of a Man.Paul Clayton is the author of Carl Melcher Goes to Vietnam , which was short listed for a 2001 Frankfurt eBook Award, along with works by Joyce Carol Oates and David McCullough.“Society’s ambivalence about the value of children, and personal responsibility, creates drama in two neighboring households. The haunting story of little adopted Reynaldo will send you running to hug your kids.”-- Stephen Gallup, author of What About the BoyExcerpt:Reynaldo couldn’t sleep. He got out of bed and went out into the hallway. He saw Daddy sitting in front of the TV. Reynaldo looked back down the hallway at Christine’s door. He knew Mommy would not come out tonight. She would sleep in Christine’s room.Reynaldo crept down to the living room. Daddy didn’t hear him approach as he watched the TV with his back to him. On the TV, an animal that looked like a large rat hurriedly crossed a jungle clearing. It came to a swamp and stood on its hind legs, quickly looking around, its little black animal eyes full of worry. It jumped into the water, making a splash, and started swimming. Somewhere else, a big snake raised its head at the sound. It slithered down the mud bank and entered the waters of the swamp. The rat thing looked around suddenly, sensing danger, then swam forward in a fury. The snake went under the water. Reynaldo watched open-mouthed as the water erupted and the coils of the snake engulfed the rat thing like huge thick ropes. The rat thing struggled frantically and the snake encircled it with more coils. Reynaldo saw the rat thing’s eyes full of fear and pleading. He imagined Mommy’s face on the rat thing as more coils encircled it, the look of fear freezing into a look of motionless nothingness. He watched, enthralled.",
  "genres": [],
  "author": "Paul    Clayton",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/18171169-in-the-shape-of-a-man"
}