{
  "title": "Landscapes & Cycles: An Environmentalist's Journey to Climate Skepticism",
  "description": "For 25 years, as director of San Francisco State University’s Sierra Nevada Field Campus, Jim Steele has opened the eyes and ears of countless students to the magic of California’s Sierra Nevada. His first book, Landscapes and Cycles, An Environmentalist’s Journey to Climate Skepticism will likewise open your minds. It compares the effects of landscape changes, natural cycles and climate change on polar bears, whales, walruses, penguins, frogs, pika, butterflies and marine ecosystems. Although it is wise to think globally, all wildlife reacts locally and all regions of the earth have been behaving very differently from what a globally averaged statistic might suggest. Despite media horror stories, many species have benefitted from recent climate change. Those species that are struggling have invariably been affected by issues other than climate change and require very different remedies. Controlling our carbon footprints will never address the most pressing issues of habitat loss and watershed degradation. Landscapes and Cycles juxtaposes environmental optimism and with concern. It celebrates the work of conservationists and scientists whose tireless efforts have enabled the full recovery of a great many species. On the other hand it presents withering criticism against the politicization of climate change and those who have hijacked key environmental issues to the detriment of good environmental stewardship. Steele highlights how faulty science and bad models have misguided critical conservation efforts and misrepresented conservation success. Most distressing Landscapes and Cycles reveals how global warming advocates have opposed appropriate conservation efforts simply because the concerned scientists did not blame climate change. Landscapes and Cycles demystifies both climate science and conservation science in a manner easily understood by everyone. In easily grasped terms Steele explains how natural cycles can cause abrupt climate change and extreme weather events and how those events affect wildlife. If we want to be good stewards of the environment, understanding those natural cycles are essential. Landscapes and Cycles outlines how we can build a more resilient environment and provides a much-needed perspective from which we can better separate sincere concerns from the overzealous catastrophic predictions that dominate the media. Landscapes and Cycles highlights what we need to look for during the next 10 years in order to determine if the “control knob” of global climate change is natural cycles or the rising concentration of carbon dioxide. Until then Steele argues now more than ever, we need to have more transparent and respectful debates to move the science forward. Landscapes and Cycles will enlighten anyone concerned with climate change and the fate of endangered species. Not only is it fascinating reading for the general public, it should required reading for every high school and college environmental studies class.",
  "genres": [
    "Science",
    "Environment"
  ],
  "author": "Jim  Steele",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/18178722-landscapes-cycles"
}