{
  "title": "Nano Surveillance",
  "description": "\"Nano Surveillance\" offers a frightening glimpse into the possible future of surveillance using nanotechnology. Where a government, or others, can silently infect specific targets or an entire population with bio-nanoscopic material that renders its unwitting victims' lives an open book to be overseen and controlled. Set in the northwestern part of the United States, engineer and pilot Dave Henson and his team of high tech entrepreneurs operate a nanotechnology surveillance company out of McCall, Idaho. After witnessing the economic collapse of the country, Dave and his team are intent on reversing the political and economic direction of the country. Ultimately they plan to bring a new level of transparency between the federal government and the public. To do so they've developed fantastic new nano surveillance technology to expose the corrupt alliance between the current political administration, the national press corps, and a handful of international billionaires with global political and financial agendas. While NSurv, and news reporter Dana Cogswell, work to expose the corruption in Washington D.C., the President announces new plans to end global climate change and restore the country's economy. However, the President's plans run sinisterly deeper, and include the required use of personal tracking sensors to be installed in every automobile and product sold in the country. If the President's plans become law, Henson's team is convinced it will destroy the country and provide the government with unfettered surveillance of the public. The NSurv team quickly finds itself intertwined in a deadly war with the President and his allies. As NSurv works to capture and report the ultimate story to topple the administration, the President and his allies stop at nothing to protect their self interests and to capture NSurv's new surveillance technology.",
  "genres": [],
  "author": "Mark   Donovan",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/18178842-nano-surveillance"
}