{
  "title": "Reappraisals: Reflections on the Forgotten Twentieth Century",
  "description": "From one of our greatest historians and public intellectuals, reflections on a twentieth century that is turning into ancient history, when it's not being displaced by myth or forgotten entirely, with unprecedented speed and at great cost  The accelerating changes of the past generation have been accompanied by a comparably accelerated amnesia. The twentieth century has become \"history\" at an unprecedented rate. The world of 2007 is so utterly unlike that of even 1987, much less any earlier time, that we have lost touch with our immediate past even before we have begun to make sense of it. In less than a generation, the headlong advance of globalization, with the geographical shifts of emphasis and influence it brings in its wake, has altered the structures of thought that had been essentially unchanged since the European industrial revolution. Quite literally, we don't know where we came from.  The results have proved calamitous thus far, with the prospect of far worse. We have lost touch with a century of social thought and socially motivated social activism. We no longer know how to discuss such concepts and have forgotten the role once played by intellectuals in debating, transmitting, and defending the ideas that shaped their time. In Reappraisals, Tony Judt resurrects the key aspects of the world we have lost in order to remind us how important they still are to us now and to our hopes for the future.  Reappraisals draws provocative connections between a dazzling range of subjects, from the history of the neglect and recovery of the Holocaust and the challenge of \"evil\" in the understanding of the European past to the rise and fall of the \"state\" in public affairs and the displacement of history by \"heritage.\" With his trademark acuity and Žlan, Tony Judt takes us beyond what we think we know to show us how we came to know it and reveals how many aspects of our history have been sacrificed in the triumph of mythmaking over understanding, collective identity over truth, and denial over memory. His book is a road map back to the historical sense we so vitally need.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Essays",
    "Philosophy",
    "European History",
    "War"
  ],
  "author": "Tony Judt",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/1817659.Reappraisals"
}