{
  "title": "Twisted Arrangement 3",
  "description": "Emma always knew there would be big trouble if handsome Hollywood mega-producer Josh Owens ever figured out that she was the one who robbed him. She’d just never anticipated this particular kind of trouble. The matrimonial kind. Faced with the prospect of going to jail along side her brother, Emma has no choice but to consider Josh’s outlandish proposal.Josh is determined to see his movie gets made right, and having the lovely, and talented, Emma in his debt plays right into his plans. A-list actor William Ransler thinks Josh needs a wife, so that’s just what he’ll get. In the form of one sexy, duplicitous party planner. With the proof of her theft hanging over her head, Josh makes playing the part of his wife the price of Emma’s freedom. But their headlong rush to the artificial altar is fraught with complications. Will Emma be able to fake feelings for Josh without falling for real? Can they pull off being a couple convincingly enough to fool not only Ransler, but the rest of the world? And what, exactly, is the perfect color for phony bridesmaids to wear?This third installment of the Twisted series features awkward family conversations, naughty gift bags, and plenty of steam!Genre: New Adult ContemporaryThis story unfolds over 4 volumes approximately 30,000 words each.Excerpt:Clarice spun the book around and shoved it at Emma. Emma blinked at the page for several seconds before the shapes resolved themselves into an image. An image of a woman in a wedding gown, to be precise. “It’s lovely.” The dress was beautiful, with a classic silhouette and about a yard of skirt, what was commonly called a cathedral train. The smooth, heavy satin was a creamy ivory. A swirled appliqué of seed pearls wound around the mode’s slender torso, just beneath her breasts. It was sleeveless, with a high square neck. Very demure, and yet somehow lush and sexy at the same time. Emma had never really been the type to plan her dream wedding, growing up. Or rather, she had, but just like the dreams about how her parents would turn out to really be alive, she’d stuffed the ideas firmly away when she got older.Looking at this dress made all those girlhood fantasies rush back. Her breath snagged in her throat. “Very lovely.” She touched gentle fingers to the picture.“That’s what you’ll wear. It will look fabulous on you. I’m thinking Hollywood cerise for the bridesmaids. Only two. And maybe a flower girl. Have you picked the venue yet?” Clarice was taking frantic notes on a piece of paper. Emma didn’t think she’d ever seen the older woman so animated. “Oh, yes. Josh said there’s a church near Saint Helena.”Clarice snapped. “I know it. Nice choice. Stone, beautiful rose window.” She drew ‘beautiful’ out into extra syllables. “You said soon. How soon?”“Two weeks?” Emma chewed her lip. “I don’t know if we can really pull this all off. We have to get out invitations. And the dress...”The older woman waved her off. “Nonsense. You make a general announcement in the media that it’ll be in two weeks and everyone will be clearing their schedule. No worries there. This is going to be the wedding of the year, Emma.” Emma’s stomach did a slow turn. Her ears rang. Clarice quirked a brow. “You going to answer that?”Emma blinked and glanced down at her purse. Her cell phone rang again. She chuckled weakly as she lifted it to her ear. She didn’t even have to look at the display. “Hi... honey.” The words felt blocky on her lips.“Admirable attempt, Miss Ness.” Josh’s chuckle was much more hearty than hers. “I take it you’ve got company?”She flicked a quick glance at Clarice, but the CEO was flipping through pages of the style book. “You’re so clever, darling. That’s what I love about you.” Her stomach churned and twisted. Her body hummed, as if she’d had too much caffeine.Josh sputtered. “That’s laying it on a bit thick, Emma. Are things going well with the illustrious Ms. Davenport?”“She’s agreed to the time off, if that’s what you’re asking. We’re discussing invitations and color schemes at the moment.” Emma gritted her teeth in an effort to keep the smile on her face. What she really wanted to do was bend over and put her head between her knees. That’s what you did for dizziness, right?Clarice pointed her pen at Emma without looking up. “Tell that handsome devil I want to see him in here tomorrow at... say, 11:30?”“Oh,” Emma covered the receiver with her fingers. “I’m sure Josh doesn’t want to be a part of any–”“Tell her I’ll be there,” he interrupted. “You only get fake married once, right?” He snorted. “I sure hope so,” Emma grumbled. “I mean, are you sure? Sweetie?” She tacked the last bit on when Clarice gave her a raised brow. The older woman’s shrewd gaze was making her squirm. As if any minute Clarice would go ‘Aha! You’re faking it!’On the other end of the line, she heard Josh speaking to Martin, but the words were too muffled for her to make out. “I’m sure,” he replied, back on the line. “But I need you to do me a favor too. Pumpkin.” He sounded like he was having fun. She could almost see those full lips twitching, the dimple in his cheek flashing briefly. Emma made a mental note to kick him in the shin later.“Another one, dumpling? I’m running low.” Her fingers clenched tightly around her phone. She upgraded the kick to a boot in the ass. “We need to do an interview. Are you busy tonight? We can do it over dinner.” Emma heard the smile this time. “Snookums.” Josh clacked away at computer keys. She pictured him sitting at his desk in his office, dealing with emails, the wavy blond of his hair mussed from where he ran his hand through it whenever he contemplated something.She couldn’t help the smile that tugged her lips upward. Both the mental image and the use of the term ‘snookums’ got her. Who said ‘snookums’? “Fine.” She sighed. “But make it Mia Miyamoto. She’s not only the best local reporter, but she’s likely to be more sensitive than anyone else.”“Agreed. I’ll see you tonight. Around 7:30?” Emma heard Martin in the background again, probably getting Mia on the line. “That’s fine. I’ll see you then, shmoopy.” She hung up on Josh’s laughter. For the moment, at least, the whirl of anxiety in her belly slowed. She tucked her cell phone away and turned her attention back to Clarice.",
  "genres": [
    "Romance",
    "Adult",
    "New Adult",
    "Realistic Fiction",
    "Contemporary"
  ],
  "author": "Mora Early",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/18176313-twisted-arrangement-3"
}