{
  "title": "The Past Through Tomorrow: Vol. 1",
  "description": "Here, in volume one of two volumes, are approximately half of the stories, novelettes, novella, and novels which make up Heinlein's famous Future History -- the rich, imaginative architecture of Man's destiny that many consider his greatest and most prophetic work. Heinlein wrote most of the Future History stories early in his career, between 1939 and 1941 and between 1945 and 1950. Most of the Future History stories written prior to 1967 are collected in the two volumes of The Past Through Tomorrow, which also contains the final version of the chart. That collection does not include Universe and Common Sense; they were published separately as Orphans of the Sky.Contents: Introduction (The Past Through Tomorrow) (1967) • essay by Damon Knight Life-Line [Future History] (1939) / short story by Robert A. Heinlein The Roads Must Roll [Future History] (1940) / novelette by Robert A. Heinlein Blowups Happen [Future History] (1940) / novelette by Robert A. Heinlein The Man Who Sold the Moon [D. D. Harriman] (1950) / novella by Robert A. Heinlein Delilah and the Space-Rigger [Future History] (1949) / short story by Robert A. Heinlein Space Jockey [Future History] (1947) / short story by Robert A. Heinlein Requiem [D. D. Harriman] (1940) / short story by Robert A. Heinlein The Long Watch [Future History] (1949) / short story by Robert A. Heinlein Gentlemen, Be Seated [Future History] (1948) / short story by Robert A. Heinlein The Black Pits of Luna (juvenile) [Future History] (1948) / short story by Robert A. Heinlein 'It's Great to Be Back!' [Future History] (1977) / short story by Robert A. Heinlein (variant of \"It's Great to Be Back!\" 1947).",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Short Stories",
    "Collections",
    "Anthologies",
    "Classics"
  ],
  "author": "Robert A. Heinlein",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/1090846.The_Past_Through_Tomorrow"
}