{
  "title": "Lian/Roch",
  "description": "LIANThe Hunter:Lian isn’t a happy puma. He’s a lethal Hunter who should be out fighting the enemy, not babysitting a human scholar. Still, he’ll do whatever necessary to rid the world of the evil goddess, Shakpi. And there’s the bonus of spending a few hours away from his family of Nurturers who have been smothering him with love. The last thing he expects is to discover a female who not only stirs his passions, but who calls to his cat on a primal level. The Scholar:Dr. Sage Parker has always known she’s different. Not only because she’s a genius with languages, but because she has a weird ability to see auras around people. It’s no wonder that she prefers to remain secluded in her small cottage. Then Lian charges into her life, dragging her out of the safety of her home and forcing her to travel to the Wildlands. Even more dangerously, he touches a place in her heart that she shut off long ago. Now, to claim the future she never dreamed possible, she must translate the ancient Pantera scrolls before Shakpi destroys the male she loves.  ROCHBrilliant Diplomat Roch is devoted to his work. The sexy, blond male wants nothing more than to keep his life just as it is. But when he falls ill, he’s forced to find help in the human world. Who would’ve guessed that the cure he needs is a human woman carrying the next Pantera child?  Attorney Lydia Page has not only been fired from her job for being pregnant, but the clinic where she was inseminated wants her to end the pregnancy because she’s carrying an ‘animal.’ Shocked and scared, Lydia has nowhere to turn. She loves her unborn child, and soon realizes that the only way to keep herself and her baby safe is to accept the help of a mysterious and very handsome puma shifter. But could the stranger be more than just her rescuer?",
  "genres": [
    "Paranormal",
    "Shapeshifters",
    "Paranormal Romance",
    "Romance",
    "Fantasy",
    "Magic",
    "Novella"
  ],
  "author": "Alexandra Ivy",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/18182878-lian-roch"
}