{
  "title": "House of Boreal",
  "description": "BEHIND THE MASK OF TRUTH AND HONOR, LIES SOW A CORRUPTED CREED...Hunted and horrified, the Quadren escapes to the mist-choked House of Boreal—a remote highland citadel shrouded by harrowing tales of the occult. Meanwhile, mortal lies flood the crown city and propaganda plagues the streets. Insurgents infiltrate Bastiion, each lobbying for the vacant throne.When Luscia returns to her homeland, she must convince the Elder Enclave to relinquish their elite warriors to Dmitri’s cause. In playing politics with her own people, the line between faith and zealotry quickly erodes, as does Luscia’s trust in her secretive aunt. As disappointment and rancor batters her from all sides, Luscia commits sacrilege and searches the brilliant power she’s struggling to control for the answers her mentor refuses to give, desperate to save Orynthia’s king before it’s too late.Zaethan never thought he’d march his kinsmen into their place of nightmares. Yet marked a bastard refugee, he wears the issue of his heritage like a brand. Within the storied fortress of Roüwen, he and the Darakaians are met with untried hostility, and when a woman goes missing, the already fragile peace fractures. Persecution endangers everyone he loves. As loyalties splinter, Zaethan battles to prove his leadership to his prydes. Even more to himself.Rivals turned reluctant rebels, both haidrens share a naivete to the changing shadow, to evil taking form. For it is the highlands where legend streams into reality—and in Boreal where when an ancient wrath is reborn, a more dangerous bright awakens.The SeriesHouse of Boreal is the third installment in the epic fantasy series, The Haidren Legacy. An immersive adventure armed with dark schemes, sharp objects, and bickering characters, this political masquerade packs a legendary punch for classic and contemporary readers alike. Fans of John Gwynne, George R.R. Martin, and Morgan Rhodes will be left aching to embark into Orynthia's enchanted shadow once more.",
  "genres": [
    "Fantasy",
    "High Fantasy"
  ],
  "author": "K.L. Kolarich",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/181852258-house-of-boreal"
}