{
  "title": "Apollo's Angels: A History of Ballet",
  "description": "One of The New York Times Book Review’s 10 Best Books of the YearFor more than four hundred years, the art of ballet has stood at the center of Western civilization. Its traditions serve as a record of our past. A ballerina dancing The Sleeping Beauty today is a link in a long chain of dancers stretching back to sixteenth-century Italy and France: Her graceful movements recall a lost world of courts, kings, and aristocracy, but her steps and gestures are also marked by the dramatic changes in dance and culture that followed. Ballet has been shaped by the Renaissance and Classicism, the Enlightenment and Romanticism, Bolshevism, Modernism, and the Cold War. Apollo’s Angels is a groundbreaking work—the first cultural history of ballet ever written, lavishly illustrated and beautifully told.Ballet is unique: It has no written texts or standardized notation. It is a storytelling art passed on from teacher to student. The steps are never just the steps—they are a living, breathing document of a culture and a tradition. And while ballet’s language is shared by dancers everywhere, its artists have developed distinct national styles. French, Italian, Danish, Russian, English, and American traditions each have their own expression, often formed in response to political and societal upheavals.From ballet’s origins in the Renaissance and the codification of its basic steps and positions under France’s Louis XIV (himself an avid dancer), the art form wound its way through the courts of Europe, from Paris and Milan to Vienna and St. Petersburg. It was in Russia that dance developed into the form most familiar to American audiences: The Sleeping Beauty, Swan Lake, and The Nutcracker originated at the Imperial court. In the twentieth century, émigré dancers taught their art to a generation in the United States and in Western Europe, setting off a new and radical transformation of dance. Jennifer Homans is a historian and critic who was also a professional dancer: She brings to Apollo’s Angels a knowledge of dance born of dedicated practice. She traces the evolution of technique, choreography, and performance in clean, clear prose, drawing readers into the intricacies of the art with vivid descriptions of dances and the artists who made them. Her admiration and love for the ballet shines through on every page. Apollo’s Angels is an authoritative work, written with a grace and elegance befitting its subject.",
  "genres": [
    "Nonfiction",
    "History",
    "Art",
    "Music",
    "Audiobook",
    "Historical",
    "Unfinished"
  ],
  "author": "Jennifer Homans",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/10107410-apollo-s-angels"
}