{
  "title": "Rescue Me",
  "description": "A quirky romance novel about secrets, forgiveness and falling in love.*~*~*~*~*~*~*She's does all the rescuing. But love has a way of changing everything.Hailey Jensen is in the rescue business--animal rescue--and more than willing to risk life and limb for fowl or fauna. Just when life couldn't get better, her world crumbles. Her identical twin has cancer, and her marine rescue is failing before it even gets started. Lacking coping skills, she takes refuge behind sarcasm and solitude. But, thanks to Dr. Rainer Hartmann, her sister's friend and a man who mistakes overbearing control for helping, she finds herself on the opposite end of the control stick. A wildly independent woman, Hailey fights with the determination of a bulldog as Rainer struggles to drag her out of despair...and into his arms.(73k words)SAMPLEWithin minutes, the room grew stifling. She nudged Rainer in the shoulder. “Take this will ya?” She handed him her glass.“Had enough?”“Nope. Just hot. Need to get outta this sweatshirt. She tugged the heavy garment over her head. The world tipped, and she lost her balance, bumping into Rainer. A smirk on his face made her bristle. “What?”“Nothing.”“That’s some strong ass wine,” she explained.“That’s some strong language.”“I’m not in grade school anymore, ya know.”His gaze heated. “Believe me. I know that.”She drew back, realizing she had been leaning against him. “Can I have my glass now?”“No. I think you’ve had enough.”“Who are you? My damn mother?”“No. I’m your friend.”“Oh, God, not that. I know all about you and your friends.”“You know all about it, eh?” he asked with a laugh. He was enjoying this conversation way too much. “What the hell is so funny?”“Nothing.”“You’re laughing.”“Okay, okay.” He threw up his arms in surrender. “I’m laughing. You’re funny, you little spitfire.”“You’re not. You big…you…” She couldn’t think of a word that summed him up. He was the epitome of contradictions. Gorgeous, a pain in the ass, funny, a pain in the ass, smart, sexy…her body heated even more as her gaze settled on his mouth, surrounded by a day’s worth of stubble. Yup, she was feeling alive, all right. Alive and hot.He moved closer, and her heart shuddered. “I’m what?” he asked.“Nothing.”He shook his head. “If two glasses of wine can’t even loosen you up, what will?”“What are you talking about? I’m as loose as a goose.” She lobbed her head, rolled it from side to side, then shrugged her shoulders up and down several times. “See? I couldn’t get any looser.”“That’s not what I meant.”“What’d you mean, then?”“I thought you might be more honest with a couple glasses of wine warming your belly. More honest with yourself and with me.”“I am. Hell, I was just noticing how sexy your mouth is.” She smiled. Had she just said that? “See? Honest.”“Hmmm. Honest, all right. My mouth? Sexy?”“Hell, yes. Hasn’t anyone ever told you that before?”“Nope.”“Damn shame.”“What else are you thinking?” He asked, his smoldering gaze making her temperature spike.",
  "genres": [
    "Romance",
    "Contemporary",
    "Chick Lit",
    "Contemporary Romance",
    "Fiction"
  ],
  "author": "Sydney Laine Allan",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/10910720-rescue-me"
}