{
  "title": "Hakan/Severin",
  "description": "Books 11 & 12 of the USA Today Bestselling Series, Bayou Heat. HAKAN Hakan never apologizes for being a lethal, barely civilized Hunter, but he understands that he has to be careful when it comes to his future mate, Payton. The pretty young Geek captured his heart long ago, but he was forced to keep her at a distance until she was mature enough to handle his feral nature. When he discovers she’s been captured, however, he’s done waiting. It’s time to claim his female. Unfortunately, he didn’t anticipate that Payton might refuse the mating. Payton understands that there’s nothing more important than discovering why their newest enemies are targeting the Pantera. And if that means putting herself in danger, then that’s exactly what she’s going to do, no matter what the arrogant Hakan might say. Of course, that’s easier said than done. Especially when Hakan is clearly determined to seduce her. Does she listen to her pride, or give in to the urgings of her fragile heart? SÉVERIN Humans have always been the enemy. Séverin has lived the last ten years of his life in his puma form. He is feral, predatory and angry at the human world. Born in captivity, the male is haunted by years of torture and abuse. And when he comes upon a human female running scared through his Wildlands domain, he wants nothing more than to get her back to the border. But as she finds shelter with him in his rustic treehouse, the male inside him starts to emerge, threatening his still-caged heart. Until he meets her. Running from her abusive ex, Taylor is desperate for a place to hide. She believes her only chance at life is the magical Wildlands. But with a war brewing, the Pantera species aren’t too keen on letting a stranger into their fold. Luckily, there is one Pantera who might want the beautiful teacher to stay. A male who, like Taylor, is running scared. Can they both listen to their hearts and allow the first real love of their lives in?",
  "genres": [
    "Paranormal",
    "Shapeshifters",
    "Fantasy",
    "Paranormal Romance",
    "Novella",
    "Romance",
    "Erotica"
  ],
  "author": "Alexandra Ivy",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/18188200-hakan-severin"
}