{
  "title": "How To Find Your Vital Vocation: A Practical Guide To Discovering Your Career Purpose And Getting A Job You Love",
  "description": "Ready to choose or change your job? Stuck in work you hate? Think the career of your dreams is beyond your reach?IT’S NEVER TOO LATE TO FIND YOUR VITAL VOCATION!If you don’t love your work, you deserve better – and with this book at your side, you can get it. A lively and potentially life-changing guide, How To Find Your Vital Vocation sets out a simple-to-follow yet profoundly effective process that will take you step-by-step from wherever you are now to a working life based on your most cherished dreams.LEARN HOW TO:- Hear the inner call that’s telling you what will make you truly happy- Rediscover your gifts and use them to build a perfectly-tailored career- Identify and overcome the obstacles that stand between you and your ideal work- Create powerful networks to help you find great jobs that are never advertised- Find out what it takes to become an entrepreneur of the future- Maximise the impact of your job applications- Ace every interview- Attain reward levels that will help you thrive – even in this tough economy!Put yourself in charge of your career – once and for all. Packed with valuable insights, powerful exercises and illuminating self-coaching questions, How To Find Your Vital Vocation will help you chart a practical path to a fun and fulfilling livelihood. In this comprehensive resource, expert career coach Brian Cormack Carr shows you how to find your passion and purpose and finally start doing the work you were born to do.WHAT THEY'RE SAYING:\"Too many of us have gone about finding our livelihood in a haphazard way. Before long, we become a statistic in a job dissatisfaction survey. Happily, it doesn’t have to be that way and Brian Cormack Carr proves it. If you think that work should be about more – much more - than just a way to pay your bills, this book is the roadmap you’ve been looking for. Work with How To Find Your Vital Vocation for a short time and you’ll be working at your real work for a long time.\"~ BARBARA J. WINTER Bestselling author of Making a Living Without a Job\"Warm, witty and wise. I highly recommend this book. Brian knows his stuff and How To Find Your Vital Vocation is a breath of fresh air.\"~ GRACE OWEN Executive coach and author of The Career Itch\"I appreciated the step-by-step nature of Vital Vocation. It made finding a new career that much easier, and I’m still amazed at how well it helped me clarify what I wanted to do with the rest of my life.\"~ DAVID Member of the Vital Vocation Online Coaching Programme\"Vital Vocation helped me focus after I had spent too long panicking and going nowhere. Now my part-time hobby has grown to a full-time occupation and I’ve finally given up the day job that was making me sad!\"~ STEVEN Member of the Vital Vocation Online Coaching Programme",
  "genres": [],
  "author": "Brian Cormack Carr",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/18188988-how-to-find-your-vital-vocation"
}