{
  "title": "Tomorrow To Be Brave",
  "description": "It was early spring 1942, and under the pitiless sky of the Libyan desert the climax of the great siege of Bir Hakeim was about to begin. General Koenig, the commander of the Free French and the Foreign Legion in North Africa, and his two thousand troops had been surrounded for fifteen days and nights by Rommel's Afrika Corps. Outnumbered ten to one, pounded by wave after wave of Stuka and Heikel bombers, the general and his men seemed doomed. Though their situation was hopeless, they chose to reject the Desert Fox's demand for surrender. Instead, one moonless night, the French made an audacious and suicidal bid for freedom by charging directly through the German lines. Leading the way was Susan Travers. The only woman ever to serve officially in the French Foreign Legion, there was the indomitable Englishwoman, speeding across the minefields of 'no man's land' directly towards Rommel's deadly Panzer tanks, her foot hard on the accelerator, doing her job: driving the general's car. That it was leading two thousand men in one of the great military exploits of the Second World War, the legendary mass break-out from Bir Hakeim, that it would see her hailed as the heroine of the night and eventually earn her both the Military Medal and the Legion d'Honneur, was not on her mind as the night exploded around her and German artillery lit up the desert sky. Her only thought was this: she was trying to save the life of the man she loved.\"Tomorrow to be Brave\" is the story of Susan Travers's extraordinary life, from her privileged childhood in England through her rebellious youth partying her way across interwar Europe, to her rash decision to join the Free French forces at theoutbreak of World War II. In search of adventure -- and a break from her stifling upper-class world -- she could never have dreamed the pivotal role she would play. From her part in the North African campaign through her time after the war serving in the French Foreign Legion as a regular officer -- the only woman ever to have achieved this -- there was enough adventure and passion, heartbreak and heroism, to fill a hundred lifetimes. This, in her own words, is her story. It is a tale of exceptional courage against overwhelming odds and of an epic love affair played out against the backdrop of war as she risked everything for the country -- and the man -- she loved.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Memoir",
    "World War II",
    "Womens",
    "Africa"
  ],
  "author": "Susan Travers",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/18189526-tomorrow-to-be-brave"
}