{
  "title": "The Sixth",
  "description": "Welcome to the gaslit, cobblestoned streets of Paris, 1910.Florbela Sarmentos, 21, knows what she wants: art, romance, and to free her father from the prison of Portugal’s despotic King Manuel II. Born in Lisbon, educated in London and at a painting academy in Cherbourg, France, the cosmopolitan Florbela moves to Paris and takes up residence in the wildly bohemian enclave of La Ruche, there to pursue a creative life. Some of the yet-to-be-discovered artists living in her building are Diego Rivera, Amadeo Modigliani and Marc Chagall. By day she paints, and by night she attends parties with the residents of La Ruche, who introduce her to collectors and creative spirits in Paris’s fabled Sixth Arrondissement. Along the way, Florbela attracts several hot-headed admirers, two of whom become so inflamed with jealousy that they become each other's deadly enemies. But Florbela’s fledgling artistic and social life is soon eclipsed, when she can no longer escape the political shadow of her father, a Portuguese writer imprisoned in Lisbon for criticizing the corrupt monarchy. Florbela tries to find news of her father through Portuguese political exiles and sympathizers in Paris — with alarming results. When she contacts a friend of her father, Professor Almeida, he turns up dead, killed by an assassin from the pro-monarchist society Ordo Crucis Incendio — the Order of the Burning Cross. Professor Almeida’s dying words lead Florbela to a secret, encrypted painting that might save her father and overthrow the king. Now, Florbela is the assassin's next target. With the help of Armand, a dashing French rebel, Florbela fights to bring the secret painting to the Portuguese resistance fighters. It just might save her country... and her life.",
  "genres": [
    "Historical Fiction",
    "France",
    "Historical Romance",
    "Fiction",
    "20th Century",
    "Adult Fiction",
    "Historical"
  ],
  "author": "Avery Hays",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/18189543-the-sixth"
}