{
  "title": "Phantom Armies of the Night: The Wild Hunt and the Ghostly Processions of the Undead",
  "description": "An exploration of the many forms of the ancient myth of the Wild Hunt and its influence in pagan and early Christian Europe• Recounts the myriad variations of this legend, from the Cursed Huntsman and King Herla to phantom armies and vast processions of sinners and demons• Explains how this belief was an integral part of the pagan worldview and was thus employed by the church to spread Christian doctrine• Reveals how the secret societies of medieval Europe reenacted these ghostly processions for soul travel and prophecies of impending deathOnce upon a time a phenomenon existed in medieval Europe that continuously fueled local during the long winter nights a strange and unknown troop could be heard passing outside over the land or through the air. Anyone caught by surprise in the open fields or depths of the woods would see a bizarre procession of demons, giants, hounds, ladies of the night, soldiers, and knights, some covered in blood and others carrying their heads beneath their arms. This was the Wild or Infernal Hunt, the host of the damned, the phantom army of the night--a theme that still inspires poets, writers, and painters to this day. Millennia older than Christianity, this pagan belief was employed by the church to spread their doctrine, with the shapeshifters' and giants of the pagan nightly processions becoming sinners led by demons seeking out unwary souls to add to their retinues. Myth or legend, it represents a belief that has deep roots in Europe, particularly Celtic and Scandinavian countries.The first scholar to fully examine this myth in each of its myriad forms, Claude Lecouteux strips away the Christian gloss and shows how the Wild Hunt was an integral part of the pagan worldview and the structure of their societies. Additionally, he looks at how secret societies of medieval Europe reenacted these ghostly processions through cult rituals culminating in masquerades and carnival-like cavalcades often associated with astral doubles, visions of the afterlife, belief in multiple souls, and prophecies of impending death. He reveals how the nearly infinite variations of this myth are a still living, evolving tradition that offers us a window into the world in which our ancestors lived.",
  "genres": [
    "Folklore",
    "History",
    "Nonfiction",
    "Occult",
    "Mythology",
    "Witchcraft",
    "Paganism"
  ],
  "author": "Claude Lecouteux",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/10911384-phantom-armies-of-the-night"
}