{
  "title": "The Spirit Room",
  "description": "FINALIST - CHAUCER AWARDS FOR HISTORICAL FICTION 2013HONORABLE MENTION - WRITER'S DIGEST SELF-PUBLISHED eBook AWARDS 2013A captivating historical novel about two independent-minded sisters in Victorian era AmericaSet in New York state in the late 1850s, two sisters are forced into becoming hoax mediums by their reprobate father in the wake of their mother's death. Following a short apprenticeship with a renowned Spiritualist and her clairvoyant assistant, 17-year-old Izzie and 13-year-old Clara Benton set up shop with Papa in a rigged séance parlor dubbed The Spirit Room. The intelligent, self-educated Izzie shows genuine psychic talent but fears the spirit-world voices she hears are like her mother’s, which she believes drove her mother to madness and early death. Vowing to return if Clara or her siblings need her protection, Izzie flees the family Spiritualism enterprise to go to Rochester with a new husband, a doctor specializing in “water-cure”—a trendy health spa therapy that the doctor soon begins to practice on his new wife. Clara, meanwhile, finds the Spirit Room gradually transformed, under her father's will, into a center for something much more malicious than hoax séances.Becoming separated both physically and emotionally by complex turns in their paths, the young sisters, as the story unfolds, are becoming women. But will they be able to come out whole without each other?In her noteworthy debut novel, Marschel Paul peppers her narrative with cultural and political references, from Madame Bovary to Elizabeth Cady Stanton, that effectively serve as touchstones for the story's themes of women’s independence and the power of female relationships—whether they be sisters, mentors, allies, or friends.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Fantasy",
    "Adult Fiction",
    "Historical"
  ],
  "author": "Marschel Paul",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/18191363-the-spirit-room"
}