{
  "title": "Crown the Jester",
  "description": "Thup-thup-thup-thup-thup!\"Do you hear that?\" Frank asked.\"Uh-huh!\" Sammy replied. \"When a brother hears that sound, he drops his reefer and puts his hands up.\"Frank tore the balcony curtains open. Hovering a few feet beyond the railing was Hochi's helicopter, shining darkly like a coughing inkblot.\"Shit!\" Frank said. There was his chance at saving those sixteen thousand kids, flying off into the sunrise. He could see the forming crowd of reporters and TV crews at the hotel entrance, far below. Come to bury him, no doubt. And was that Bradley in the co-pilot's chair, puking his guts out? What the hell? Frank didn't think. He couldn't -- his long night of chasing will-o-the-wisps had left his dogs barking -- and he didn't need to, for he understood his situation perfectly: He was dead. It made no difference whether his body met its end today, splattered on the sidewalk, or in six months, drunk and bloated in the sauna at Cal-Neva. On the inside, he was already dead. Resurrection, as unlikely as it was, was the only chance he had left.He ran at the railing and leapt.-----------------------------------------Crown the Jester is an action-comedy novel set in a skewed 1963. It stars these period players:Frank Sinatra - a new PresidentRichard Nixon - a schemerMarilyn Monroe - a Rousseauian bimboSam Giancana - a fading mastermindJoe DiMaggio - a baseball playerCheckers - a dogand these original characters:Bradley Hastings - a loyal bodyguardTony Montoni - a divided bodyguardDr. Haruki Mizobe - a mad scientistWilliam W. Willoughby - a hired attorneyCarla Montoni - a first loveet al.In 1960, Frank Sinatra became the Vice President, thanks to dockyards, dames, and mob money. It was beautiful; the best job he’d ever had. Easy easy, Eggs Benedict and champagne cocktails. Once a week he sang on the radio. One song, some old canard like My Heart is a Hobo, then it was time for bed.And the women!Through the whole dark drunken blur of it he never once considered that Jack might die. But Jack did die, shot dead by a prideful man.In 1963, Frank Sinatra became the President, thanks to a .38. Now, together with his friends Dean Martin and Sammy Davis Jr., he must heal the nation's wounds.And if that ain’t enough, he's got a ship on fire in the Gulf of Tonkin. And Nixon plotting to impeach him.And his Sam Giancana demanding favors due.And Marilyn making trouble just because it's her nature.And that poor sap Joe’s the one who pulled the trigger!Easy? Hell!",
  "genres": [],
  "author": "Joe Laser",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/18192874-crown-the-jester"
}