{
  "title": "I Killed Collette",
  "description": "***This novelette is also included in M Jet's terror collection, Pins and Needles***Sam and Bridget Turin have a seemingly perfect life until the unfortunate death of their daughter. When a lost little girl named Melia needs a home, they seem like the perfect candidates to take her in.Everybody around the little girl is concerned by her odd behavior and the strange circumstances of her arrival. Everybody except for Bridget Turin, whose blind motherly love overrides any other sensible instinct. Will her refusal to face reality cost her life?Sometime in the night, Melia slipped into bed with Bridget. Sam got crowded and moved to the couch He tried to be understanding, but couldn't help feeling aggravated as he went back to sleep.Bridget instinctively encircled Melia without waking and drifted to dream.The day was cold; blustery. The weathered, leafless trees looked barren against the tumultuous grey sky. She pulled her coat around her, felt her heart pounding. She stood in a graveyard. Ahead of her stood an open casket and chairs set up for a funeral, but no one was there. Bridget crept toward the casket. She wanted to run away, but was drawn forward. Even though the true version of this dream funeral had been completely different, bile rose in her throat for she knew who was in the casket.As she approached, her dread was confirmed.\"Collette,\" Bridget murmured, beginning to weep.There among the white satin inside the casket, lay her beloved daughter. Collette's shining long blonde locks were splayed perfectly over the cushion where her head rested. Bridget couldn't help but absorb every inch of her. Collette's delicate features. The sprinkling of freckles across her nose. The luxurious eyelashes resting against her pale cheeks. Her tiny hands clasped as if in prayer across her chest.Bridget could barely breathe as she reached out to touch her daughter.Then, the heavy lid of the coffin viscously slammed shut. Bridget reared back, narrowly avoiding catching her hand in the lid of Collette's coffin.And behind the coffin stood Melia. Her hands like claws were perched atop the coffin. Her eyes flickered an unearthly rage. Her chest rose and fell with rapid breaths. \"You're MY mommy now,\" Melia growled.From inside the closed casket, Bridget's dead daughter began to scream.9654 words in I Killed Collette, also includes an excerpt from \"Death Wind\" by M Jet.",
  "genres": [],
  "author": "M. Jet",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/18192885-i-killed-collette"
}