{
  "title": "Redwood Pack, Vol. 5",
  "description": "Redwood Pack Vol 5 contains the sixth book in the Redwood Pack series and a special novella in print and digital formHidden Destiny (Redwood Pack Book 5)North Jamenson has always held his wolf closer to the surface then others. He's the quiet one, the one no one really knows about yet he holds the darkest secret. He's watched his brothers find their mates and start families, and now it was his turn. He knows Lexi could be his and her son could be part of his family, but he doesn't know if he's ready to share the darkness that's entwined with his soul.Lexi Anderson is a mother, a sister, a latent wolf, and a new member of the Redwood Pack. She's also holding secrets so close to her heart she's not even sure she knows the truth anymore. When North takes another step closer to wanting to cement their bond, Lexi must come to grips with her past and what it means for her future. The Centrals' war isn't over yet and Lexi's life is on the line as the paths they've chosen takes a drastic turn.A Beta's Haven (Redwood Pack Book 5.5)Being the Beta of the Redwood Pack isn't an easy task, but Jasper has never complained. He's spent his entire adult life dropping everything so he can take care of others. Now he's a father, a husband...and tired. His mate, Willow, knows Jasper won't let others know that he might need a break, even for a weekend, so that's where she comes in.Once Jasper lets go and allows his mate to call the shots, this Beta might just be in for the ride of a lifetime.Author's This is a novella set between books 6 and 7 to give you a taste of Jasper and Willow. It is best that you have already immersed yourselves in the Redwood Pack world, however even new readers will enjoy a glimpse of one of the Redwood's favorite couples.",
  "genres": [
    "Shapeshifters",
    "Paranormal Romance",
    "Paranormal"
  ],
  "author": "Carrie Ann Ryan",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/18190712-redwood-pack-vol-5"
}