{
  "title": "High on Her",
  "description": "***This novelette is also included in the M Jet dark erotic collection, Dark Desires***James Kirk is one of those straight laced, mild mannered, button down shirt fellows who fails to realize his own sexual potential amidst his day to day activity of selling insurance and conforming with societal norms. Until Missy Raven struts into his life. High on Her is a 5337 word new erotica novelette, detailing the wild exploits of sex, crime, romance, mystery, and mental unhinging of one very repressed man. This story is erotica, and is not appropriate for those under 18! Shaking once again, James struggled to pull his eyes away from the irresistible female and pick up the pieces of what was left of his now meaningless existence, when she slowly backed out of the car and turned toward him. The perfect woman's lips split into a sultry grin and she licked them.\"See something you like, cowboy?\" she said in a soft, playful voice.James' face blazed. \"Oh, uh, um, I'm sorry… Are you talking to me?\"The woman laughed, a tinkling mischievous sound, like wind chimes. She rapidly turned to pluck sandals out of the convertible, for one second exposing that gorgeous hint of her ass as she reached. She dropped the sandals and placed her slender feet into them and proceeded to walk toward James.\"Well yeah, there isn’t anyone here but you and me, right?\" She spoke as though her words were individually pre-selected. As she moved closer, his head swam with her scent of Honeysuckle.\"Oh, I uh, well, I hadn't noticed you come in,\" James blurted. James, you dumb, dumb, idiot BASTARD, he silently berated himself.The woman smiled coyly, exposing gleaming white, pristine teeth. \"That so, sparky?\" she teased, one eyebrow arched.James blushed again and mentally blew his brains out.\"You're cute,\" she said. \"What's your name?\"James glanced around nervously; suddenly suspecting he may be suffering a psychotic break from reality since this creature could not possibly be standing there coming on to him.\"Um, it's James Kirk.\"The woman pouted. \"That's kind of boring, don't you think? How 'bout I call you Jimmy?\" she asked.Not suitable for all audiences.",
  "genres": [],
  "author": "M. Jet",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18193660-high-on-her"
}