{
  "title": "Chocolate Covered Billionaire Navy SEAL",
  "description": "I hate to be the one to break it to you, but there are probably like three good-looking billionaires on the planet. Generally speaking billionaires look a lot more like Bill Gates and Warren Buffet than Channing Tatum. Don't get me wrong, Bill and Warren are great guys, but no one is breaking out into a sweat thinking about either one of them. Now there aren't all that many Navy SEALs floating around either and the ones that are available are generally so busy being, well, Navy SEALs, that you'd be hard pressed to find one with some free time to date.If you chuckled at the above and enjoy a little sex related humor, this short parody of all the billionaire and Navy SEAL romance novels may just be for you. If you didn't at least giggle and don't enjoy that type of humor, you probably should keep looking for your next read. With that out of the way now on to the real book description...Heir to a chocolate empire, Brock Fullman joins the elite Navy SEAL team in order to avenge the death of his high school sweetheart. With his billionaire family one bad day in the stock market away from the dreaded \"Mm Mm Mm...\" word (Yes Millionaire... he's the only family member who can actually say it), he's torn between the woman he must marry to guarantee his family's future and the new woman he secretly loves. Out for revenge, will he destroy the company, his family, himself and all those around him in the process?Chocolate Covered Billionaire Navy SEAL is a short story (approximately 18,000 words) and falls somewhere in genre between a romantic comedy and contemporary romance parody. The \"SEALionaire\" is sometimes off-the-wall absurd, sometimes steamy, but always funny. It contains explicit language, sexual content, features a hot, rich, let's call him unique, military man, a bitch we love to hate, lots of chocolate (some might argue too much) and a handful of not so bright terrorists. It's intended for mature audiences and a complete work with none of those pesky cliffhangers!",
  "genres": [
    "Contemporary Romance",
    "Military Fiction",
    "Romance",
    "Humor",
    "Erotica",
    "Adult Fiction",
    "Amazon"
  ],
  "author": "Luke   Young",
  "average_rating": "3.12",
  "url": "https://www.goodreads.com/book/show/18194608-chocolate-covered-billionaire-navy-seal"
}