{
  "title": "The Frog Prince and Other Frog Tales From Around the World: Fairy Tales, Fables and Folklore about Frogs",
  "description": "A Unique Collection of Fairy Tales, Myths, Fables and Other Tales About Frogs A FROG with a crown on its head. A girl kissing a frog. If you pay attention, you'll notice these images appear frequently in the world around you. These and other variations-many humorous-appear on t-shirts, in advertisements, on book covers and novelty items to name just a few. Their shorthand You have to kiss a lot of frogs to meet your prince. Just about anyone will tell you it's from a fairy tale, some may be able to tell you the story. Not many people know that the familiar story isn't really an old tale but a fairly new variation of several tales that have been circulating for centuries. 'And so the princess kissed the frog, turning him into a prince before her very eyes.' A frog transformed into a prince with a kiss. That's how \"The Frog Prince\" fairy tale ends in modern popular culture, but it's not the way our ancestors knew the tale. Most often, violence was the key to ending the enchantment in the earliest known versions traced back to Scotland and Germany. From wise creatures to hapless victims, frogs and toads appear in numerous stories around the world. Edited with an introduction by Heidi Anne Heiner of SurLaLune Fairy Tales, this volume contains nearly one hundred fairy tales, fables, myths and ballads about frogs, including several variants of the well-known Frog Prince tales made famous by the Brothers Grimm. The book is divided into several sections, including \"Frog Kings, Princes and Bridegrooms,\" \"Frog Brides,\" \"Frog Wooing and Courting,\" \"More Frog Tales,\" and \"Fables.\" Also included is Mark Twain's famous short story, \"The Celebrated Jumping Frog of Calaveras County.\"",
  "genres": [
    "Fantasy",
    "Fairy Tales",
    "Beauty and The Beast",
    "Classics",
    "Reference"
  ],
  "author": "Heidi Anne Heiner",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/10912746-the-frog-prince-and-other-frog-tales-from-around-the-world"
}