{
  "title": "Chokepoint Capitalism: How Big Tech and Big Content Captured Creative Labor Markets and How We'll Win Them Back",
  "description": "A call to action for the creative class and labor movement to rally against the power of Big Tech and Big Media\nCorporate concentration has breached the stratosphere, as have corporate profits. An ever-expanding constellation of industries are now monopolies (where sellers have excessive power over buyers) or monopsonies (where buyers hold the whip hand over sellers)--or both.In Culture Heist, scholar Rebecca Giblin and writer and activist Cory Doctorow argue that thanks to \"chokepoint capitalism,\" exploitative businesses create insurmountable barriers to competition that enable them to capture value that rightfully belongs to others. All workers are weakened by this, but the problem is especially well-illustrated by the plight of creative workers. From Amazon's role in radically changing publishing's economics, to the influence of Spotify in leveraging digital rights management, these few vicious monopsonists have lobbied for more barriers for new entrants.By analyzing book publishing and news, live music and music streaming, screenwriting, radio and more, Giblin and Doctorow first deftly show how powerful corporations construct \"anti-competitive flywheels\" designed to lock in users and suppliers, make their markets hostile to new entrants, and then force workers and suppliers to accept unfairly low prices.In the book's second half, Giblin and Doctorow explain how to batter through those chokepoints, with tools ranging from transparency rights to collective action and ownership, radical interoperability, contract terminations, job guarantees, and minimum wages for creative work. Culture Heist is a call to workers of all sectors to unite to help smash these chokepoints and take back the power and profit that's been siphoned away--before it's too late.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Economics",
    "Business",
    "Technology",
    "Audiobook",
    "History"
  ],
  "author": "Rebecca Giblin",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/182065637-chokepoint-capitalism"
}