{
  "title": "Fusion",
  "description": "Featuring gripping Independent authors from around the world, FUSION is the first collection of short works published by Breakwater Harbor Books. Contributing heart-pumping tales of Science Fiction, Fantasy, Horror and Crime are seven stories that will thrill you, rivet you and some will even make you sleep with the light on. Authors from across a wide variety of genres, Dee Harrison, Ivan Amberlake, Claire C. Riley, Scott J. Toney, Mindy Haig, Cara Goldthorpe and C.M.T. Stibbe. The Sliver of Abilon – A Mirrorsmith Tale – 'and you thought it was safe to look in the mirror?'Diary of the Gone - Without a girlfriend, bullied by the Principal’s son, and haunted by the dead, Callum Blackwell thinks his life can’t get any worse. But he’s wrong.Life Ever After. Nina's Story: Part one. – When the dead begin to rise, it's time to put your differences aside and run!NovaFall – When the Meteor falls, the essences will come, forging flesh and planetary souls as one.Cybilla. – To claim his Muse, one man must find the gate between the mortal and the immortal worlds.Capturing Perfection – An artist's tale of love, loss and beauty in Renaissance MilanUntil The Ninth Hour – Until a man loses his daughter to a serial killer, until he loses his best friend, until he is down on his luck, Darryl Williams must put all thoughts of retaliation out of his mind.An excerpt from Dee Harrison’s The Sliver of Abilon – A Mirrorsmith Tale Junah Venmark, Master Mirrorsmith, exited the wayportal directly into the seaweed stench of Abilon. The foul odour tickled the back of his throat and he gagged on a rise of bile. Mirrorsmith Guild protocol demanded that he preview his destination before he arrived but it could not prepare him for an assault on his other senses. He vomited onto the trackway, just thankful that there was no-one to witness his most pitiful entrance ever. He loathed the smell of mouldy greens – it stirred up too many reminders of his wretched childhood in the back alleys of Varna, largest city on his homeworld of Vargo – but this was kabbige soup intensified tenfold. When his heaving subsided, Junah sank down onto his rump, trying to ignore the early evening dew which was soaking into his leggings. He pulled a kerchief from his belt-purse, to wipe the spittle from his lips, and cursed this ill-favoured world. Sissik, his wail, chittered and scurried around him like a silver-furred cyclone, mewing her distress. Junah winced when she skipped onto his tender stomach, the better to peer into his face with her large, prosimian eyes. He ran a finger down her spine and she slowly relaxed beneath his touch. Junah ill? She sent. No, I’m fine, Little One he reassured her. He grimaced. The smell caught me out, that’s all. Sissik wrinkled her own nose. Nasty, nasty stink, she concurred. Junah delved into his purse a further time and extracted a couple of lozenges from a packet. A few chews later and he could smell nothing. “Next time I’ll take ‘em before I get here,” he promised out loud. “Not that there’ll be a next time!”  Junah clambered to his feet and peeled the sodden fabric from his buttocks. Sissik took her accustomed place on his shoulders, hiding beneath his long, dark hair and curled around his neck like a fur collar. Wails were native to all the worlds of the Regium, even the undeveloped ones like Abilon. Some wails, the silver-furred ones like Sissik, were prized for their ability to generate the acoustic frequencies that Mirrorsmiths depended upon. Others, the plumper, browner ones, made good eating. Whenever Sissik irritated him, which was often, Junah threatened to dye her coat russet. Now, however, she was quiescent, understanding that it was time for work.  The wayportal, part of the network of gates that connected all the worlds of the Regium, had opened between a pair of standing stones that dominated the headland to the north of Abilon. Junah looked down at the coastal town, which nestled within the arms of a sheltering bay. A slash of fire on the horizon marked where the sun was setting and silhouetted the ugly, squat fortress guarding the harbour mouth. Somewhere among the sleazy alleyways of this provincial rats’ nest below was the inn where his contact waited. It was supposed to be a routine mission according to Teren Lemmick, Guild Master but also his oldest friend. All Junah had to do was locate the sliver of Desecrated Mirror, secure it then return it to the Mirrorsmiths’ Guild on Vargo, where it could be destroyed in relative safety. He had carried out scores of such ‘grabbits’ but this time unease pricked his spine. Mirrorsmiths tended towards the superstitious and worlds like Ysreal, with its triple moons, were considered inauspicious but this went deeper than that. Junah’s senses were trained to detect distorted vibrations and this place was riddled with them – probably due to the presence of the sliver. Sissik’s tail tightened around his neck so he dampened down his disquiet. Wails were sensitive to heightened emotion. He checked his accoutrements once more then headed for Abilon, thinking it best to get this trip over with as quickly as possible. Despite the lateness of the hour, the streets of Abilon were crowded. Every third house seemed to be selling ale and shabby, ill-visaged townsfolk bumped and barged their way through the densely-packed lanes. Junah knew roughly where the inn lay but he had previewed it during daylight and it took him a while to reach the waterfront. He spent a few minutes reconnoitering then pulled his hood up and entered the tavern. Not surprisingly most of the patrons were fishermen and the uneven floorboards must have made them feel right at home. Junah jostled his way through the raucous hubbub, towards the booth where he had arranged to meet his accomplice, but an overripe, blousy serving girl intercepted him.",
  "genres": [
    "Zombies",
    "Anthologies",
    "Horror",
    "Fiction"
  ],
  "author": "Scott J. Toney",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18207413-fusion"
}