{
  "title": "Deadly Deadly",
  "description": "Deadly Deadly is an exciting, larger than life epic that takes place during the growth of our nation westward that details the hardship encountered on a very special trail drive in the 1800s. Don’t let the cover fool you; this is a story for the more mature reader. This exciting novel tells a truly original story among a backdrop of harsh and extreme conditions. Crafted with an enormous passion, this amazing story pits an eclectic cast of characters against the unforgiving elements and the evils of men. A one-of-a-kind story, readers cannot afford to pass up. Get lost in this western epic of adversity, despair, and triumph. This story revolves around the deep bond that is established after a young man, alone in the world, discovers a newborn Texas Longhorn bull and rescues him from deaths grip. The bull calf eventually captures his heart and an inseparable bond is formed. As the bull matures, due to his lethal seven-foot horn spread, he eventually becomes know as Deadly. Their unique relationship also grows into a working partnership and together they become an indomitable force, which will be a blessing for a beautiful ranch owner who ultimately depends on them as her only hope for survival after she hires them to drive her extremely valuable and “new” to the America, Herefords, from California to Texas. With the fate of her ranch in their hands, they set forth on a dangerous journey full of extreme wilderness, nature’s wrath, injuries, and illness in order to get these prized cattle to their distant destination. With a Texan Longhorn bull as one of its main characters and events unfolding at a thrilling pace, Deadly Deadly stands out against the homogenous backdrop of today’s fiction with a character-driven story that is as gripping as it is heartfelt, and sure to hook readers within the first few pages. Whether it’s the loveable characters, unique relationships, budding romance, or facing challenging hazards both natural and manmade, this novel possesses something for everyone. This engrossing narrative uses a mesmerizing story to pepper in useful survival skills and actual training techniques used with herd animals.",
  "genres": [
    "Westerns",
    "Historical Fiction",
    "Fiction"
  ],
  "author": "M.J. Vigna",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/18207709-deadly-deadly"
}