{
  "title": "Cubed: A Secret History of the Workplace",
  "description": "You mean this place we go to five days a week has a history ? Cubed reveals the unexplored yet surprising story of the places where most of the world's work—our work—gets done. From \"Bartleby the Scrivener\" to The Office , from the steno pool to the open-plan cubicle farm, Cubed is a fascinating, often funny, and sometimes disturbing anatomy of the white-collar world and how it came to be the way it is—and what it might become.In the mid-nineteenth century clerks worked in small, dank spaces called “counting-houses.” These were all-male enclaves, where work was just paperwork. Most Americans considered clerks to be questionable dandies, who didn’t do “real work.” But the joke was on as the great historical shifts from agricultural to industrial economies took place, and then from industrial to information economies, the organization of the workplace evolved along with them—and the clerks took over. Offices became rationalized, designed for both greater efficiency in the accomplishments of clerical work and the enhancement of worker productivity. Women entered the office by the millions, and revolutionized the social world from within. Skyscrapers filled with office space came to tower over cities everywhere. Cubed opens our eyes to what is a truly \"secret history\" of changes so obvious and ubiquitous that we've hardly noticed them. From the wood-paneled executive suite to the advent of the cubicles where 60% of Americans now work (and 93% of them dislike it) to a not-too-distant future where we might work anywhere at any time (and perhaps all the time), Cubed excavates from popular books, movies, comic strips ( Dilbert! ), and a vast amount of management literature and business history, the reasons why our workplaces are the way they are—and how they might be better.",
  "genres": [
    "Nonfiction",
    "History",
    "Business",
    "Sociology",
    "Design",
    "Architecture",
    "Audiobook"
  ],
  "author": "Nikil Saval",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/18209337-cubed"
}