{
  "title": "Blossom Street Brides",
  "description": "Debbie Macomber has won the hearts of millions of readers with her moving and inspiring stories. Now wedding bells are ringing in the tight-knit community that gathers around A Good Yarn, a store in a pretty Seattle neighborhood. Knitters come to the store to buy yarn and patterns but somehow they leave richer in friendship and love.   Lauren Elliott has waited years for her long-term boyfriend, Todd, to propose, yet he seems more focused on his career than their relationship. When Lauren learns that her younger sister is pregnant before she herself even has an engagement ring, she feels overjoyed yet disheartened. Knowing she can’t put her future on hold, Lauren prepares to make a bold choice—one that leads her to a man she never dreamed she’d meet.   Newly married to her second husband, Max, Bethanne Scranton is blissfully in love. But with Max’s job in California and Bethanne’s in Seattle, their long-distance marriage is becoming difficult to maintain. To complicate matters, Bethanne’s cunning ex will do anything to win her back.   Lydia Goetz, too, is wonderfully happy with her husband, Brad, though lately she worries about the future of A Good Yarn. As she considers how to bring in business, she discovers that someone has beaten her to the punch. Baskets of yarn are mysteriously popping up all over town, with instructions to knit a scarf for charity and bring it into Lydia’s store. Never before has her shop received so much attention, but who hatched this brilliant plan?   As three women’s lives intersect in unexpected ways, Lydia, Lauren, and Bethanne realize that love heals every heart, and the best surprises still lay ahead.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary Romance",
    "Audiobook",
    "Contemporary",
    "Knitting"
  ],
  "author": "Debbie Macomber",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/18209302-blossom-street-brides"
}