{
  "title": "Nice Girl to Love: The Complete Collection, Vol 1-3",
  "description": "This is the complete Nice Girl to Love series collection, which contains: Resisting the Bad Boy  (Book One), Falling for the Good Guy (Book Two), and Choosing the Right Man (Book Three).\nTHE ONE SHE NEVER THOUGHT SHE COULD KEEP...\nAbby Bartlett is the quintessential nice girl. Between teaching, volunteering, completing her PhD, and helping her best friend raise his daughter, Abby never gets the chance to be anything but nice. That is, until the all-wrong-for-her man she's only ever known from afar starts daring her to simply take that chance for herself. His sage advice? Try something wild and fast. Preferably him.An unbridled, hotshot attorney with a not-so-little black book, Connor Sullivan has earned himself quite the bad boy reputation. But in his defense, he's a very conscientious one. He knows far too well that sometimes in life, love isn't enough...or worse, not even a factor at all. To avoid that misery--and repel the drama--Connor has a firm ‘nothing over a month’ rule. Who knew a nice girl would be the one to make him want to break all his rules?\nTHE ONE SHE NEVER HOPED SHE COULD HAVE...\nAbby is well aware that everyone thinks she’s in love with her best friend Brian. He is, after all, the type of man a nice girl should be with—the polar opposite of the bad boy—the kind of guy who didn’t let his wife’s decade-long illness stop him from showering her with a lifetime of love every second until her dying day. But everyone’s wrong; she couldn’t possibly be in love with him. Because she’s never once allowed herself that option. It’s taken a while but Brian has finally come to terms with surviving the woman he spent half his life loving, a third of it losing. Truth is though, he wouldn’t have ‘survived’ any of it really had it not been for Abby—sweet, incredible Abby—the woman he’s never once had to picture his life without, never realized he couldn’t truly live without. Until now. Now that he’s finally able to love her the way she deserves, the way he knows she wants to be loved…by his brother. Who’s giving him exactly one chance to speak now or forever hold his peace. \nA DECISION SHE NEVER DREAMED SHE’D HAVE TO MAKE...\nAnd now it’s up to Abby to decide between the bad boy wanting to start a life with her and the good guy fighting for the life they’ve already built.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Anthologies",
    "Fiction",
    "M F Romance"
  ],
  "author": "Violet Duke",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/18209377-nice-girl-to-love"
}