{
  "title": "Shadows in the Sun: Healing from Depression and Finding the Light Within",
  "description": "A first-of-its-kind, cross-cultural lens to mental illness through the inspiring story of Gayathri’s thirty-year battle with depression. This literary memoir takes readers from her childhood in India where depression is thought to be a curse to life in America where she eventually finds the light within by drawing on both her rich Hindu heritage and Western medicine to find healing.As a young girl in Bangalore, Gayathri was surrounded by the fragrance of jasmine and flickering oil lamps, her family protected by Hindu gods and goddesses. But as she grew older, demons came forth from the dark corners of her idyllic kingdom--with the scariest creatures lurking within her.The daughter of a respected Brahmin family, Gayathri began to feel different. \"I can hardly eat, sleep, or think straight. The only thing I can do is cry unending tears.\" Her parents insisted it was all in her head. Because traditional Indian culture had no concept of depression as an illness, no doctor could diagnose and no medicine could heal her mysterious malady.This memoir traces Gayathri's courageous battle with the depression that consumed her from adolescence through marriage and a move to the United States. It was only after the birth of her first child, when her husband discovered her in the backyard \"clawing the earth furiously with my bare hands, intent on digging a grave so that I could bury myself alive,\" that she finally found help. After a stay in a psych ward she eventually found \"the light within,\" an emotional and spiritual awakening from the darkness of her tortured mind.Gayathri's inspiring story provides a first-of-its-kind cross-cultural view of mental illness--how it is regarded in India and in America, and how she drew on both her rich Hindu heritage and Western medicine to find healing.",
  "genres": [
    "Mental Health",
    "Memoir",
    "Psychology",
    "Nonfiction",
    "India",
    "Mental Illness",
    "Biography"
  ],
  "author": "Gayathri Ramprasad",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/18211062-shadows-in-the-sun"
}