{
  "title": "The Meat Racket: The Secret Takeover of America's Food Business",
  "description": "An investigative journalist takes you inside the corporate meat industry—a shocking, in-depth report every American should read.The biggest takeover in American business that you’ve n ever heard ofThe American supermarket seems to represent the best in abundance, freedom, choice. But that turns out to be an illusion. The rotisserie chicken, the pepperoni, the cordon bleu, the frozen pot pie, and the bacon virtually all come from four companies.In The Meat Racket , investigative reporter Christopher Leonard delivers the first-ever account of how a handful of companies have seized the nation’s meat supply. He shows how they built a system that puts farmers on the edge of bankruptcy, charges high prices to consumers, and returns the industry to the shape it had in the 1900s before the meat monopolists were broken up. At the dawn of the twenty-first century, the greatest capitalist country in the world has an oligarchy controlling much of the food we eat and a high-tech sharecropping system to make that possible.Forty years ago, more than thirty-six companies produced half of all the chicken Americans ate. Now there are only three that make that amount, and they control every aspect of the process, from the egg to the chicken to the chicken nugget. These companies are even able to raise meat prices for consumers while pushing down the price they pay to farmers. And tragically, big business and politics have derailed efforts to change the system.We know that it takes big companies to bring meat to the American table. What The Meat Racket shows is that this industrial system is rigged against all of us. In that sense, Leonard has exposed our heartland’s biggest scandal.",
  "genres": [
    "Food",
    "Nonfiction",
    "Business",
    "History",
    "Politics",
    "Economics",
    "Agriculture"
  ],
  "author": "Christopher   Leonard",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/18211204-the-meat-racket"
}