{
  "title": "The Haunted Life: and Other Writings",
  "description": "1944 was a troubled and momentous year for Jack Kerouac. In March, his close friend and literary confidant, Sebastian Sampas, lost his life on the Anzio beachhead while serving as a US Army medic. That spring—still reeling with grief over Sebastian—Kerouac solidified his friendships with Lucien Carr, William Burroughs, and Allen Ginsberg, offsetting the loss of Sampas by immersing himself in New York's blossoming mid-century bohemia. That August, however, Carr stabbed his longtime acquaintance and mentor David Kammerer to death in Riverside Park, claiming afterwards that he had been defending his manhood against Kammerer's persistent and unwanted advances. Kerouac was originally charged in Kammerer's killing as an accessory after the fact as a result of his aiding Carr in disposing of the murder weapon and Kammerer's eyeglasses. Consequently, Kerouac was jailed in August 1944 and married his first wife, Edie Parker, on the twenty-second of that month in order to secure the money he needed for his bail bond. Eventually the authorities accepted Carr's account of the killing, trying him instead for manslaughter and thus nullifying the charges against Kerouac. At some point later in the year—under circumstances that remain rather mysterious—the aspiring writer lost a novella-length manuscript titled The Haunted Life, a coming of age story set in Kerouac's hometown of Lowell, Massachusetts.Kerouac set his fictional treatment of Peter Martin against the backdrop of the everyday: the comings and goings of the shopping district, the banter and braggadocio that occurs within the smoky atmospherics of the corner bar, the drowsy sound of a baseball game over the radio. Peter is heading into his sophomore year at Boston College, and while home for the summer in Galloway he struggles with the pressing issues of his day—the economic crisis of the previous decade and what appears to be the impending entrance of the United States into the Second World War. The other principal characters, Garabed Tourian and Dick Sheffield, are based respectively on Sebastian Sampas and fellow Lowellian Billy Chandler, both of whom had already died in combat by the time of Kerouac's drafting of The Haunted Life (providing some of the impetus for its title). Garabed is a leftist idealist and poet, with a pronounced tinge of the Byronic. Dick is a romantic adventurer whose wanderlust has him poised to leave Galloway for the wider world—with or without Peter. The Haunted Life also contains a compelling and controversial portrayal of Jack's father, Leo Kerouac, recast as Joe Martin. Opposite of Garabed's progressive, New Deal persepctive, Joe is a right-wing and bigoted populist, and an ardent admirer of radio personality Father Charles Coughlin. The conflicts of the novella are primarily intellectual, then, as Peter finds himself suspended between the differing views of history, politics, and the world embodied by the other three characters, and struggles to define what he believes to be intellectually true and worthy of his life and talents.The Haunted Life, skillfully edited by University of Massachusetts at Lowell Assistant Professor of English Todd F. Tietchen, is rounded out by sketches, notes, and reflections Kerouac kept during the novella's composition, as well as a revealing selection of correspondence with his father, Leo Kerouac.",
  "genres": [
    "Fiction",
    "Classics",
    "American",
    "Short Stories"
  ],
  "author": "Jack Kerouac",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/18210817-the-haunted-life"
}