{
  "title": "الملايين الأربعة - الجزء الثاني",
  "description": "This historic book may have numerous typos and missing text. Purchasers can usually download a free scanned copy of the original book (without typos) from the publisher. Not indexed. Not illustrated. 1919 edition. Excerpt: ... THE GIFT OF THE MAGI O DEGREESE dollar and eighty-seven cents. That was all. And sixty cents of it was in pennies. Pennies saved one and two at a time by bulldozing the grocer and the vegetable man and the butcher until one's cheeks burned with the silent imputation of parsimony that such close dealing implied. Three times Della counted it. One dollar and eighty-seven cents. And the next day would be Christmas. There was clearly nothing to do but flop down on the shabby little couch and howl. So Della did it. Which instigates the rroril reflection that life is made up of sobs, sniffles, and smiles, with sniffles predominating. While the mistress of the home is gradually subsiding from the first stage to the second, take a look at the home. A furnished flat at $8 per week. It did not exactly beggar description, but it certainly had that word on the lookout for the mendicancy squad. In the vestibule below was a letter-box into which no letter would go, and an electric button from which no mortal finger could coax a ring. Also appertaining, the reunto, was a card bearing the name \"Mr. James Dillingham Young.\" The \"Dillingham\" had been fluwg to the breeze during a former period of, rosperity when it DEGREES possessor was being paid $30 per week. No\"-, when the income was shrunk to $20, the letters of \"Dillingham\" looked biurred, as though they were thinking seriously of contracting to a modest and unassuming D. But whenever Mr. James Dillingham Young came home and reached his flat above he was called \"Jim\" and greatly hugged by Mrs. James Dillingham Young, already introduced to you as Della. Which is all very good. Della finished her cry and attended to her cheeks with the powder rag. She stood by the window and looked out dully at a grey cat walking a...",
  "genres": [],
  "author": "O. Henry",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/18210413--"
}