{
  "title": "Alpha Goddess",
  "description": "In Serjana Caelum’s world, gods exist. So do goddesses. Sera knows this because she is one of them. A secret long concealed by her parents, Sera is Lakshmi reborn, the human avatar of an immortal Indian goddess rumored to control all the planes of existence. Marked by the sigils of both heaven and hell, Sera’s avatar is meant to bring balance to the mortal world, but all she creates is chaos. A chaos that Azrath, the Asura Lord of Death, hopes to use to unleash hell on earth.Torn between reconciling her past and present, Sera must figure out how to stop Azrath before the Mortal Realm is destroyed. But trust doesn’t come easy in a world fissured by lies and betrayal. Her best friend Kyle is hiding his own dark secrets, and her mysterious new neighbor, Devendra, seems to know a lot more than he’s telling. Struggling between her opposing halves and her attraction to the boys tied to each of them, Sera must become the goddess she was meant to be, or risk failing, which means sacrificing the world she was born to protect.Sky Pony Press, with our Good Books, Racehorse and Arcade imprints, is proud to publish a broad range of books for young readers—picture books for small children, chapter books, books for middle grade readers, and novels for young adults. Our list includes bestsellers for children who love to play Minecraft; stories told with LEGO bricks; books that teach lessons about tolerance, patience, and the environment, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [
    "Mythology",
    "Fantasy",
    "Young Adult",
    "Paranormal",
    "Romance",
    "Fiction",
    "Young Adult Fantasy"
  ],
  "author": "Amalie Howard",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/18211066-alpha-goddess"
}