{
  "title": "Forbidden",
  "description": "Hauntingly romantic, achingly tragic, and highly addictive. “An action-packed, satisfying love story gets this supernatural series off to a rousing start.” ~KIRKUS REVIEWS/b> My life went sideways the moment I arrived in Haven Hurst, Connecticut. It’s one of those charming, quintessential places you find on lists like, The Top Ten Best Small Towns To Visit In America. It is beautiful, but what I now know would shock the tourists to the core. The locals have been compelled to disregard the strange behavior of a particular family because they are Guardian Angels. I never expected my hallucinations to include something of this magnitude. I never expected angels to be monitored by The Council of Guardians, which has grown increasingly suspicious of me. And I never expected to fall in love with Michael Patronus, the angel in my senior class. But is love enough when mortal sins demand retribution?“Loving a guy like Michael is like swallowing the moon, I am glowing on the inside.”And then Dante Dannoso arrived. A demon and a high ranking member of the Royal Court of the Unforgiven. Dante, who houses the Demon of Persuasion, has kept secrets from The Order of Reapers, those who control death contracts. For centuries, Dante has privately tracked the soul of his lost lover. He insists that I have this soul. He insists we share a past life and that I once begged him to find me again. Whatever the cost. It has been torture denying the sweet memories buried deep inside me. Dante casually dismisses my love for Michael… “You think I am here for your heart, amore mio? Our life begins when your heart stops beating…”Dante wants to kill me. Michael wants to save me. And yet…I am the one with all the power…",
  "genres": [
    "Paranormal",
    "Angels",
    "New Adult",
    "Young Adult",
    "Fantasy",
    "Demons",
    "Paranormal Romance"
  ],
  "author": "Lori Adams",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/18209624-forbidden"
}