{
  "title": "Unreal City: Las Vegas, Black Mesa, and the Fate of the West",
  "description": "An epic struggle over land, water, and power is erupting in the American West and the halls of Washington, DC. It began when a 4,000-square-mile area of Arizona desert called Black Mesa was divided between the Hopi and Navajo tribes. To the outside world, it was a land struggle between two fractious Indian tribes; to political insiders and energy corporations, it was a divide-and-conquer play for the 21 billion tons of coal beneath Black Mesa. Today, that coal powers cheap electricity for Los Angeles, a new water aqueduct into Phoenix, and the neon dazzle of Las Vegas.Journalist and historian Judith Nies has been tracking this story for nearly four decades. She follows the money and tells us the true story of wealth and water, mendacity, and corruption at the highest levels of business and government. Amid the backdrop of the breathtaking desert landscape, Unreal City shows five cultures colliding—Hopi, Navajo, global energy corporations, Mormons, and US government agencies—resulting in a battle over resources and the future of the West.Las Vegas may attract 39 million visitors a year, but the tourists mesmerized by the dancing water fountains at the Bellagio don’t ask where the water comes from. They don’t see a city with the nation’s highest rates of foreclosure, unemployment, and suicide. They don’t see the astonishing drop in the water level of Lake Mead—where Sin City gets 90 percent of its water supply.Nies shows how the struggle over Black Mesa lands is an example of a global phenomenon in which giant transnational corporations have the power to separate indigenous people from their energy-rich lands with the help of host governments. Unreal City explores how and why resources have been taken from native lands, what it means in an era of climate change, and why, in this city divorced from nature, the only thing more powerful than money is water.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Environment",
    "American History",
    "Travel",
    "Society"
  ],
  "author": "Judith Nies",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/18210771-unreal-city"
}