{
  "title": "The Saeshell Book of Time Part 1: The Death of Innocents",
  "description": "Black and white economy version. See the color LCX edition paperback for a better experience. Magic is an advanced science that humans don't understand. Two young people are betrothed at birth and forced by alien races to serve as the secret King and Queen of contemporary Earth: from the UK, Stefan, a seventh-grade artistic prodigy and from the US, Tova, a nineteen-year-old life sciences genius. Both were raised as humans and left to discover that they will be immortal at age nineteen. Using their emerging magic, they must protect the kingdom of Earth from unwanted alien intrusions. Shy, reclusive Stefan is ripped from his childhood and has eight weeks to learn to rule. Tova must do more than love Stefan — she must keep him sane or kill him to protect humans from his irrational use of his powers.  In this first part of the four part serial storyline, Elof, an abused Tibetan-American science wizard must teach the magical children, Ty and Tyco, to use their talents ethically. Otherwise, Tova will destroy them to protect Earth. Ty, the mysterious, fearful third-grade son of a British Prime Ministerial aid, has an ancient knowledge given to him by ‘ghosts’. Tyco, who is the fifth-grade son of a Mayan astronomer, must learn to keep his warrior impulses in check and protect his friend, Ty, from harm. While teaching these kids, Elof reconciles his own childhood with his sociopathic father. Does he have a magical inheritance he has yet to discover? Far grittier than Harry Potter, this story is an intellectual puzzle of mysteries and surprises for readers ready to meet the challenge.  This LC Edition is a low cost alternative black and white edition for people who find that the Reader's Edition or the Collector's edition are too expensive. The print is smaller than the black and white Readers Edition and the book is printed on cream book paper instead of white paper. It still contains the 22 black and white illustrations of the Reader's Edition.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Speculative Fiction",
    "Young Adult"
  ],
  "author": "Rusty A. Biesele",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/18213570-the-saeshell-book-of-time-part-1"
}