{
  "title": "Choices of Fate",
  "description": "**For mature readers only, contains adult content**On her own since the day she turned eighteen and left the group home where she grew up, twenty-five year old Alexa Ryan has made a comfortable life for herself. She has a great job, the perfect apartment, every material possession a girl her age could desire. Unfortunately, she also has an unusual condition which has forced her to keep everyone at a distance. Ethan Kellar has spent his entire life running from destiny. When he was just a boy, a powerful seer prophesied his role in events that would determine the outcome of the secret war his people had been fighting for centuries. A role he was determined not to accept, leading him to avoid letting anyone get too close, until the night Alexa fell into his arms.Drawn to her in a way he has never experienced, Ethan decides to take the ultimate risk by trusting Alexa and revealing to her all he truly is. Thinking she is an ordinary woman, he believes she is the key to preventing the prophecy from being fulfilled and allowing him to live the life he has always wanted, one he chooses. Having been so consumed with the desire to determine the course of his own life he wants no less for Alexa and knows he must tell her everything, give her a choice. Before that happens they surrender to the intense physical attraction between them and he realizes too late that in trying so hard to change his fate, he may have set the events of the prophecy in motion. In that moment, Ethan makes the most difficult decision of his life and does the only thing he can to save Alexa. He walks away. Consumed by grief, Alexa falls into a deep depression until she learns her brief encounter with love resulted in a child and somehow finds the strength to put herself back together for the sake of her baby Chloe. Nearly two years after Ethan walked out Chloe develops an unexplained illness which sends Alexa in search of anything that can help. Her pursuit leads her back to Ethan and thrusts her into his dark and mysterious world, unlocking the secrets of her past and revealing threats to their future. Together, Alexa and Ethan fight to protect Chloe and their love, but there is one battle Ethan fights alone as he struggles to choose his own path and avoid the choices of fate.",
  "genres": [
    "Vampires",
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Supernatural",
    "Amazon",
    "New Adult"
  ],
  "author": "S. Simone Chavous",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/18214068-choices-of-fate"
}