{
  "title": "Let Me Be Your Star",
  "description": "Fade in on a girl, with a hunger for fame......and with her uproariously funny, widely circulated, and often totally unhinged recaps of the television show SMASH, author, playwright, and perpetual non-speaking townsperson Rachel Shukert finally got a scrap of it to gnaw on. A once-aspiring actress who never quite got over her dreams of Broadway stardom, Shukert lovingly sunk her teeth into analyzing (and often, inventing) every detail of NBC's embattled little-musical-that-couldn't, and before long, found herself at the center of the backstage drama behind the backstage drama that captivated America (or at least, the part of it that spends a lot of time handing out their head shots in Times Square.)Childhood heroes became devoted fans. Rabid internet mobs called for her death. And through it all, Rachel kept recapping, risking her health, her sanity, and her sleep hygiene forever. And somehow, she made her Broadway dreams come true, although in a way she never could have imagined as a nine-year-old lip-synching her way through the original cast album of \"Sunday in the Park With George\" back in her living room in Omaha. An inventive blend of memoir, cultural criticism, and wildly absurdist fan fiction (and including never-before-published material, suitable for sing-alongs!), LET ME BE YOUR STAR is your recap of recaps from a master of the form, lifting the veil on fan culture, Broadway, and the woman behind the keyboard desperately trying to think of another mildly erotic joke about Elaine Stritch at 4:30 am on a Tuesday. Anyone who loves television, the Internet, or Into the Woods (and if you don't fall into any of these categories, please prove to this computer that you are a human being) won't want to miss this thoughtful, hilarious meditation on life, art, and the act of creation by one of our most inimitable comic voices.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Theatre"
  ],
  "author": "Rachel Shukert",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/18213474-let-me-be-your-star"
}