{
  "title": "Double Gun Dealer Box Set",
  "description": "This is the complete Double Gun Dealer series in one fabulous box. Book one \"AVA\"Ava is a waitress in a shitty diner in the heart of New York City. Sai is a mysterious stranger who suddenly appears out of nowhere and seems to bring the wrath of hell with him. Sometimes it is better to just keep to yourself, but in Ava's case, this could never be...Sai not only brings hell with him, he also brings all the answers to who and what Ava really is and sets her on the path she was destined to walk. Sexy, action packed with smoking hot love scenes, two guns are definitely better than one.Book two \"SALEM\"Brian is a genius in his field, creating new bio weapons for a company he has no love for, but feels trapped in. He is a loner, has been since his childhood, but longs for a relationship of any kind. His sexual needs are met mostly with his vivid imagination, or perhaps they are real. Who can tell? Along with the hallucinations come a glimpse into the real world Brian is caught up in, one that a beautiful woman, by the name of AVA, is eager to teach him about. \"SALEM\" is book 2 in the Double Gun Dealer series and takes you into the origin of Brian a.k.a \"Salem\", letting you know where he came from and where he is going.Book three \"LIN\"Marcy has a crappy job at a bar, one she would love to leave, but cannot afford to give up. She also has to endure a creepy neighbor who is a bit too enamored with her, but she just upgraded her life by moving \"uptown\" as opposed to \"down\" so the thought of moving again is also a no-go. Then in walks \"LONDON\", a mysterious stranger with a beautiful accent and all the right things for Marcy...right up until Hell follows him, literally. As things unravel and passions ignite, Marcy finds herself transforming into something she may have always suspected herself of being, explaining so many things in her life. Will she take the plunge and accept her new powers? Will she let LONDON feed her carnal needs? Find out as \"LIN\" comes into her own in book #3 of the Double Gun Dealer series, where Demon Hunters do it better.Book four \"LONDON\"Ethan was born into a life of a whore. His mother was one and his father was a repeat customer. He has never known love, but longs to. Then along comes a beautiful woman by the name of \"IZZY\", who is about to rock his world in more ways than one, showing him that what he thought was truth was but a lie and that Hell always finds you.Book five \"IZZY\"Izzy had a terrifying start in life, surviving plague and famine only to end up in the New World fighting for her life as her village was attacked by black winged devils from the sky. It seems her supernatural curse will render her a loner for eternity. Then a handsome young man arrives in town and with him her future follows. Will she finally find the love she longs for or will her curse take everything from her as it always has?Book six \"SAIGON\"Meet Saigon, a sharp tongued and jaded man who hates his station in life as much as he misses his lost love. He is a Hunter, not just any Hunter...he hunts demons who feast on human flesh and wish for destruction. With his dreams and visions becoming stronger, he tries his best to prepare for \"her\" to finally arrive. Will Saigon find redemption for past sins? Will he finally allow love to penetrate his broken heart and accept his fate? Join us in the incredible conclusion to the DGD series as we come full circle and have all questions answered, proving that everyone and everything are connected in some way.",
  "genres": [],
  "author": "Rue Volley",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18213059-double-gun-dealer-box-set"
}