{
  "title": "Under These Restless Skies",
  "description": "Journey back in time to Tudor England with a tale of romance, intrigue, and the Celtic legends of the selkies.Will Somers has spent his life alone, thinking himself unlovable. Emma is a selkie; a creature of myth and magic, one of the immortal fae-folk of the sea. When Will finds her sleeping on a beach, he recalls the tales his grandmother told him of selkie maidens taken for wives. He seizes this unexpected chance to have a wife and family of his own and steals her pelt, binding her to him. Only when it is willingly returned will she be free.Emma has never experienced life on land and can barely contain her excitement and curiosity. She has to learn to adapt quickly to human customs, for Will is headed to the glittering, dangerous court of Henry VIII to serve as the king’s fool. It’s a world where careless words can lead to the scaffold and the smallest gesture is loaded with political implications.Anne Boleyn is charmed by Emma’s naïveté and soothing selkie magic and wants Emma for her own fool. Anne is soon to become a wife herself, and the Queen of England. But wearing the crown does not ensure her own safety, and at Anne’s side, Emma becomes entangled in the dark intrigues of the court, trying to stay afloat in the turbulent seas swept by the storms of the mercurial king.Can Will protect the woman he loves from the dangers that lurk in every shadow? Emma uses her selkie magic to soothe the king’s temper, and Will uses his humor, but Henry’s moods become increasingly erratic. Theirs is a vocation that provides them some protection, but in Henry VIII’s court, no one is safe. Circa regna Around the throne, the thunder rolls.",
  "genres": [
    "Historical Fiction",
    "Fantasy",
    "Historical",
    "Paranormal",
    "Historical Romance",
    "Romance",
    "Tudor Period"
  ],
  "author": "Lissa Bryan",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/18213408-under-these-restless-skies"
}