{
  "title": "The Sanctification of Peter Kane",
  "description": "WHAT IF THE RELIGIOUS RIGHT TOOK OVER OUR COUNTRY? WHAT IF IT TOOK OVER THE WORLD?For fans Of Daniel Silva and Barry Eisler, an original, dark vision of a uniquely American apocolypse ...October, 2008. The economy is on the verge of complete, irrevocable collapse. People are losing their homes, their jobs. There's talk of more disaster to come. A paralyzing fear is sweeping the nation. A hero from the war in Iraq has shockingly defeated Senator John McCain for the Republican nomination. Now days away from the election, the polls are neck and neck between John Durham and another upstart, Senator Barack Obama. Peter Kane, a local beat reporter, scores a long sought-after interview with the candidate’s father, megachurch pastor Osgoode Durham. But moments before being shown up to see the preacher, a young man dies. By the looks of it, by Durham’s hand.Peter goes on national television to tell his story, but Glory Land Cathedral’s spin machine is lightning quick, the cover up immediate and persuasive even in the face of rumors that the dead man kept a diary.The local police won’t investigate. Kane’s paper won’t report. Then an anonymous tip comes in – the diary exists, and its contents reveal a corruption so pervasive, so complete, that it would bring down both the church and John Durham’s candidacy. The kicker? The Cathedral doesn’t have it yet.As Peter Kane races against the clock to uncover the cabal behind Durham’s White House bid, he’s kidnapped by a shadowy organization of domestic terrorists and discovers that the secrets go both deeper and higher than even he could have imagined . . .The Sanctification of Peter Kane is the first book in a series that tells the story of the rise of an American Ayatollah, and the installation of his apocalyptic administration. Two more installments of The Sundown Chronicles, Discipline and Osgoode's Ghosts, are scheduled for release in the summer and fall of 2014.",
  "genres": [
    "Fiction"
  ],
  "author": "Troy Stoops",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/18214235-the-sanctification-of-peter-kane"
}