{
  "title": "Bones of My Brother",
  "description": "From Alabama at mid-century, there’d been John and his Evelyn — now from Minnesota at century’s end, Price and his Joy — two couples whose struggles ran as parallel as rails on a track. Had John Hobson’s smile been erased by a long ago war, or had he suffered a more defining chapter in his life? And what of his son, Price, the small-town boy who stamped his mark upon a corporate world that would ultimately crumble about him?For one man, there'd been the lure of “Music City” versus the love of his treasured Evie. For the other, there'd been the heady rush of success followed by a precipitous fall from grace. To be sure, a shroud of guilt had marked both men, but when Price learns of his late father’s ambition, his obsession with the past places his marriage in dire jeopardy.John Hobson was gone now, interred “. . . in nested containers of earth, box and body,” but the secret of his lifelong angst lay not beneath the hot soil of Gethsemane's cemetery, but beneath God's tree in a tiny glade one county over. In the end, a son’s desire to bring his father’s dream to fruition triggers deadly consequences, initiating a journey along a more imperative path. \"Bones of My Brother\" is a compelling look at failure and redemption—humanity and spirituality. At turns heartfelt and raw, this family saga is full of love and intrigue with characters facing questions about the conflict of dreams and reality, love and lust. Could it be that the answers provide a revelation, the seed of a new beginning? J. Frank Dunkin grew up in Marion, Alabama during the heyday of the Grand Ole Opry and the birth of Rock and Roll. To him, the days were golden, nights were sweet, and movies offered escape to the Wild West or South Pacific. Graduating from Auburn University with a degree in Fine Arts, Dunkin served a tour of duty in Korea and worked as art director for small publications before moving into the world of corporate real estate. His stories draw heavily from his own experiences and travels.",
  "genres": [],
  "author": "J. Frank Dunkin",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/18216303-bones-of-my-brother"
}