{
  "title": "Broken Butterfly: My Daughter's Struggle with Brain Injury",
  "description": "\"It all began with the bite of a mosquito. Yes, just the bite of a pesky, seemingly innocuous, little insect that had been sucking her blood. Not just one, but hundreds had punctured her arms and legs with red marks which later swelled to small welts. Who would ever have thought that our family's life would become derailed, that its tightly woven fabric would eventually fray and break - all from the bite of a mosquito?\"In November of 1970, the Finell family's lives were changed forever by a family vacation to Acapulco. Seven-year-old Stephanie fell ill soon after their return to the United States, but her mother, Karin, thinking it was an intestinal disorder, kept her home from school for a few days. She was completely unprepared when Stephanie went into violent convulsions on a Friday morning. Following a series of tests at the hospital, doctors concluded she had contracted viral equine encephalitis while in Mexico.After a string of massive seizures - one leading to cardiac arrest - Stephanie fell into a six-week coma. When she awoke, her world had changed from predictable and comforting to one where the ground was shaking. Due to the swelling of her brain from encephalitis, she suffered serious brain damage. Doctors saw little hope of recovery for Stephanie and encouraged her parents to place her in an institution, but they refused.In Broken Butterfly, Karin Finell recounts the struggles faced by both her and her daughter, as well as the small victories won over the ensuing years. Little was known about brain injuries during that time, and Karin was forced to improvise, relying on her instincts, to treat Stephanie. Despite the toll on the family - alcoholism, divorce, and estrangement - Karin never gave up hope for Stephanie's recovery. Through Stephanie's story, her mother has found a way to share that optimism - and her lessons - with the world.",
  "genres": [],
  "author": "Karin Finell",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/18220587-broken-butterfly"
}