{
  "title": "Mozart's Women: His Family, His Friends, His Music",
  "description": "Throughout his life, Mozart was inspired, fascinated, amused, aroused, hurt, disappointed and betrayed by women -- and he was equally complex to them. But, first and last, Mozart loved and respected women. His mother, his sister, his wife, her sisters, and his female patrons, friends, lovers and fellow artists all figure prominently in his life. And his experience, observation and understanding of women reappear, spectacularly, in the characters he created. As one of our finest interpreters of Mozart's work, Jane Glover is perfectly placed to bring these remarkable women -- both real and dramatized -- vividly to life. We meet Mozart's mother, Maria Anna, and his beloved and devoted sister, Nannerl, perhaps as talented as her brilliant brother but, owing to her sex, destined to languish at home while Wolfgang and their father entertained the drawing rooms of Europe. We meet, too, Mozart's \"other family\" -- his in-laws, the Constanze, his wife, much maligned by history, and her sisters, Aloysia, Sophie and Josefa. Aloysia and Josefa were highly talented singers for whom Mozart wrote some of his most remarkable music. Aloysia was the first woman whom Mozart truly and passionately loved, and her eventual rejection of him nearly broke his heart. Constanze, though a less gifted singer, proved a steadfast and loving wife and -- after Mozart's death -- his extremely efficient widow, consolidating his reputation and ensuring that his most enduring legacy, his music, never be forgotten. Mozart's Women is their story. But it is also the story of the women in his operas, all of whom were -- like his sister, his mother, his wife and his entire female acquaintance -- restrained by the conventions and strictures of eighteenth-century society. Yet through his glorious writing, he identified and released the emotions of his characters. Constanze in Die Entführung aus dem Serail ; Ilia and Elettra in Idomeneo ; Susanna and the Countess in Le nozze di Figaro ; Donnas Anna and Elvira in Don Giovanni ; Fiordiligi, Dorabella and Despina in Così fan tutte ; Pamina and the Queen of the Night in Die Zauberflö are all examined and celebrated. They hold up the mirror to their audiences and offer inestimable insight, together constituting yet further proof of Mozart's true genius and phenomenal understanding of human nature. Rich, evocative and compellingly readable, Mozart's Women illuminates the music and the man -- but, above all, the women who inspired him.",
  "genres": [
    "Music",
    "Biography",
    "History",
    "Nonfiction",
    "18th Century",
    "Biography Memoir",
    "Classical Music"
  ],
  "author": "Jane Glover",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/1091724.Mozart_s_Women"
}