{
  "title": "Mollie Pride",
  "description": "Publication Date: April 11, 1991Hello, America, this is Mollie Pride…In the hectic days of flappers and dance marathons they play carnies and fairs from Maine to Texas. They're the Fabulous Pride Family, featuring six-year-old Mollie and her acrobatic Charleston – who cares if it's slightly off the beat, the kid's adorable. \"Don't worry,\" Mollie's dad promises, \"Easy Street is just a whistle-stop away.\" Seventeen years on, Mollie hasn't found Easy Street, only bit parts on popular radio shows like Tom Mix and The Lone Ranger, and One Man's Family. And a marriage that breaks her heart, but propels her across the Atlantic where the opening bars of the Charleston will introduce her intrepid broadcasts from blitz-battered London. In a world where the news is considered strictly a male preserve and a woman needs a man's signature to open a bank account, Mollie proves that \"human interest\" is not to be despised, that instead it's the key to ultimate victory. But while her broadcasts fascinate two continents, there's a secret no one suspects, terror and treason shadow Mollie's every word.The widely acclaimed author of Bristol House and the City of Dreams series offers here the riveting story of the role radio played in the great and terrible drama of WWII, and the individual bravery and devotion that in the end prevailed. Smart, savvy, and enriched with Swerling’s trademark historical accuracy as well as an intricately constructed plot, this is a page-turning romantic thriller sure to delight her many fans.Mollie Pride is a Beverly Swerling Encore Edition, and is appearing for the first time as an E-book.Praise for Mollie Pride\"Sweeping from 1898 and the American brides who exchanged their fortunes for an English title to the Allied alliance that ultimately saw off Hitler, this is a page-turning saga sure to delight fans of the genre.\" —Journal and Times\"Early 20th century America (and England) have never been more vivid…\" —West Country\"Pacy, Racy romantic thriller, mightily deserving of success…\" —Mail",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Beverly Swerling",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/18220356-mollie-pride"
}