{
  "title": "Magnus",
  "description": "A tortured vampire, a lonely shifter, and a deadly power struggle of supernatural proportions. Can their forbidden love prevail?  Magnus Redstone is the middle of the five Redstone brothers. He’s the quiet one. The one who keeps to himself more than the others. But he has good reason for his loner status. Two years ago, he met a woman. Not just any woman. This woman made his inner cougar stand up and roar. Even in human form, he purred when she stroked him. She was his mate. And that meant something very serious among shifters. Too bad the lady had fangs...  Following a lead about a very bad man, Mag discovers Miranda being held captive by an evil mage in a cage of silver that burns her. She’s been tortured and bled repeatedly as the monster sought to steal her power for his own. Mag frees her and takes her to his home, nursing her back to health and defying all convention to keep her with him. He doesn’t ever want to let her go again, but he knows the deck is stacked against them.  When a vampire uprising threatens the stability of the Las Vegas scene, Mag and Miranda are right in the middle of it, fighting against evil. More than just their necks are on the line when a group of vampires seek to kill them and overthrow the current Master vampire of the area. But they have powerful allies, and their renewed relationship has made both of them stronger than either would ever be alone. Will they prevail against all odds, and can they stay together forever? Or will the daylight - and their two very different worlds - tear them apart again?  * Look for the first two books in this sub-series - Tales of the Grif and Tales of the Red - available now in ebook and print.  The Tales of the Were Main Lords of the Were, Inferno The Rocky, Slade Redstone Grif, Red, and three more coming soon!  The Brotherhood of Blood series is related, and  One & Only (novella), Rare Vintage (novella), Phantom Desires (novella), Sweeter Than Wine (novel), & Forever Valentine (novella).  Wolf Hills, Wolf Quest",
  "genres": [
    "Paranormal",
    "Vampires",
    "Shapeshifters",
    "Paranormal Romance",
    "Romance",
    "Fantasy",
    "Erotica"
  ],
  "author": "Bianca D'Arc",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/18217540-magnus"
}