{
  "title": "Fifty Shades of Neigh",
  "description": "They say money is a great aphrodisiac, but are there really enough billions in the world to mitigate the many flaws of a man who wears DON’T FRIENDZONE ME t-shirts and thinks all you have to do to acquire old-school, film noir charm is to pop on a fedora and call all women toots?Can enough money exist to take the edge off a man like Crispian Neigh, a doughy internet billionaire of uncertain provenance and even less certain weight? Is he doomed to be Forever Alone, or is there a woman in the world who can see the man behind the billions, and forgive his habit of drawing busty dwarf erotica based on World of Warcraft characters?Step forward Hanna Squeal – literature student and insurance risk, a self-proclaimed intellectual so alarmingly dim that she thinks Camus is a chickpea-based dip flavoured with garlic.When Hanna stumbles, glissades and finally faceplants in front of him, Crispian Neigh is enraptured by her beauty, her implausible innocence and her shatteringly low self-esteem.Cue several hundred pages of poorly-written, repetitive ‘kinky’ sex. Flogging, whipping, fisting, anal intercourse and things that would give even James Joyce cause to pause – none of these things happen in this book. Due to a sheltered girlhood (I’m not kidding – she’s never even leaned up against the washing machine on the spin cycle.) Hanna doesn’t even know the difference between an orgasm and a sneeze.Also he’s got that thing that hasn’t quite cleared up yet.But when Crispian makes Hanna an offer she can’t refuse (Severed horse heads a very real possibility.) she is determined to forge on with the relationship in spite of the objections of her stoner friend Kate, her polyamorous Etsy addict mother and the rude retorts of her spiteful Inner Goddess.Can Hanna change him? (No) Can she turn him into the kind of boyfriend she’s always wanted? (Nope) And can she get over his deepest, darkest, pinkest secret and bring herself to love and tolerate My Little Brony? (Probably not – not if we want to wring a sequel out of this thing.)",
  "genres": [],
  "author": "Anna   Roberts",
  "average_rating": "3.24",
  "url": "https://www.goodreads.com/book/show/18221166-fifty-shades-of-neigh"
}