{
  "title": "The Bright Continent: Breaking Rules and Making Change in Modern Africa",
  "description": "The path to progress in Africa lies in the surprising and innovative solutions Africans are finding for themselvesAfrica is a continent on the move. It’s often hard to notice, though—the Western focus on governance and foreign aid obscures the individual dynamism and informal social adaptation driving the past decade of African development. Dayo Olopade set out across sub-Saharan Africa to find out how ordinary people are dealing with the challenges they face every day. She discovered an unexpected resilient, joyful, and innovative, a continent of DIY changemakers and impassioned community leaders.Everywhere Olopade went, she witnessed the specific creativity born from African difficulty—a trait she began calling kanju. It’s embodied by bootstrapping innovators like Kenneth Nnebue, who turned his low-budget, straight-to-VHS movies into a multimillion-dollar film industry known as Nollywood. Or Soyapi Mumba, who helped transform cast-off American computers into touchscreen databases that allow hospitals across Malawi to process patients in seconds. Or Ushahidi, the Kenyan technology collective that crowdsources citizen activism and disaster relief.The Bright Continent calls for a necessary shift in our thinking about Africa. Olopade shows us that the increasingly globalized challenges Africa faces can and must be addressed with the tools Africans are already using to solve these problems themselves. Africa’s ability to do more with less—to transform bad government and bad aid into an opportunity to innovate—is a clear ray of hope amidst the dire headlines and a powerful model for the rest of the world.",
  "genres": [
    "Africa",
    "Nonfiction",
    "Politics",
    "International Development",
    "Anthropology",
    "Economics",
    "History"
  ],
  "author": "Dayo Olopade",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/18222677-the-bright-continent"
}