{
  "title": "Gobekli Tepe: Genesis of the Gods: The Temple of the Watchers and the Discovery of Eden",
  "description": "An exploration of the megalithic complex at Göbekli Tepe, who built it, and how it gave rise to legends regarding the foundations of civilization• Details the layout, architecture, and exquisite carvings at Göbekli Tepe• Explores how it was built as a reaction to a global cataclysm• Explains that it was the Watchers of the Book of Enoch and the Anunnaki gods of Sumerian tradition who created it• Reveals the location of the remains of the Garden of Eden in the same regionBuilt at the end of the last ice age, the mysterious stone temple complex of Göbekli Tepe in Turkey is one of the greatest challenges to 21st century archaeology. As much as 7,000 years older than the Great Pyramid and Stonehenge, its strange buildings and rings of T-shaped monoliths--built with stones weighing from 10 to 15 tons--show a level of sophistication and artistic achievement unmatched until the rise of the great civilizations of the ancient world, Sumer, Egypt, and Babylon.Chronicling his travels to Göbekli Tepe and surrounding sites, Andrew Collins details the layout, architecture, and exquisite relief carvings of ice age animals and human forms found at this 12,000-year-old megalithic complex, now recognized as the oldest stone architecture in the world. He explores how it was built as a reaction to a global cataclysm--the Great Flood in the Bible--and explains how it served as a gateway and map to the sky-world, the place of first creation, reached via a bright star in the constellation of Cygnus. He reveals those behind its construction as the Watchers of the Book of Enoch and the Anunnaki gods of Sumerian tradition.Unveiling Göbekli Tepe’s foundational role in the rise of civilization, Collins shows how it is connected to humanity’s creation in the Garden of Eden and the secrets Adam passed to his son Seth, the founder of an angelic race called the Sethites. In his search for Adam’s legendary Cave of Treasures, the author discovers the Garden of Eden and the remains of the Tree of Life--in the same sacred region where Göbekli Tepe is being uncovered today.",
  "genres": [
    "History",
    "Nonfiction",
    "Ancient History",
    "Science",
    "Religion",
    "Archaeology",
    "Anthropology"
  ],
  "author": "Andrew Collins",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/18223780-gobekli-tepe"
}