{
  "title": "Magical Mystery Tours: My Life with the Beatles",
  "description": "A Top Ten Music Book Bestseller in The Independent (UK)\"Brings the era to vivid life. The mythic moments are all here. Magical Mystery Tours is a tour de force.\" ---Entertainment WeeklyGrowing up in a postwar Liverpool suburb, Tony Bramwell was boyhood friends with three of the Beatles long before they were famous. And by the time he caught up with George Harrison on the top of a bus to check out \"The Beatles, direct from Hamburg\"---one of which George turned out to be---Tony was well into a life story absolutely unlike any other.Tony carried George's guitar that night, and he stayed with the band from the first Number 1 to the last. From overseeing the tours of Brian Epstein's Merseybeat stars to producing shows for Jimi Hendrix, the Who, Cream, and Pink Floyd at Epstein's Savile Theatre; and from producing and directing Beatles videos to heading Apple Films, Tony's life really did encompass a who's who of rock.With an insider's shrewd eye, Tony describes the rise and fall of the Apple empire, Brian Epstein's frolics, Ken Kesey's Merry Pranksters, Phil Spector's eccentric behavior, and stories never before told about Yoko Ono. He uncovers new information about the Shea Stadium concert footage, John Lennon's late-night \"escapes,\" and more. From the Cavern Club to the rooftop concert, and from scraps of song lyrics to the discovery of the famous Mr. Kite circus poster, Tony Bramwell really did see it all.It's a story in which every character is one of the musical 1960s most colorful. Conversational, direct, and honest, the ultimate Beatles insider finally shares his own version of the frantic and glorious ascent of four boys from Liverpool lads to rock and roll kings.Praise for Magical Mystery Tours\"A must-read for anyone interested in the history of the Fab Four. Bramwell doesn't hold back with his tales of the grand insanity that tailed The Beatles.\"-- The New York Post\"Energetically written…a vivid and intensely personal look at not only the Beatles but at a storybook trip from the docks of Liverpool to swinging London and the very epicenter of the British invasion.\"-- Publishers Weekly\"A sprawling, amiable account of life near the world's most famous and most gifted pop group. A welcome addition to Beatles lore.\"-- The Globe and Mail (Canada)",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Biography Memoir",
    "Rock N Roll",
    "Autobiography"
  ],
  "author": "Tony Bramwell",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/109195.Magical_Mystery_Tours"
}