{
  "title": "The Complete A**hole's Guide to Handling Chicks",
  "description": "Congratulations, man! By picking up The Complete A**hole's Guide to Handling Chicks, you are just pages away from finally understanding:- How a five-dollar date can get you laid- How to stop being friends with girls and start getting them in the sack- Where you'll have the best odds of finding a one-night stand, and how to get rid of the chick the next morning- How to trick a woman into thinking you're classy, even if you have holes in your underwear- Why fat chicks always try to keep you from banging their hot friends, and how to finally stop these evil creatures- How to stop your wife from nagging you into an early grave- Why it's possible to watch six hours of football, put the moves on your neighbor's hot daughter, and leave the toilet seat up in the same day- And much moreThe Complete A**hole's Guide isn't like all the other candy-ass relationship books on the market; it doesn't cover issues like romance, love, and finding Miss Right. So, if that's what you're looking for, there are plenty of other books you can hide under your skirt as you skip out of the store. This book is about controlling the women in your life, and never having to say you're sorry . . . EVER AGAIN!We'll take you from the day you're born to the day you die and show you how women can be manipulated, frustrated, and ultimately dominated throughout the course of a man's life. By illustrating the insanity of the female mind, we'll show you why the flawed chick psyche causes them to continuously fall for the a**hole, no matter how many times they get burned.If you're not interested, that's fine. We're sure there are ballet classes you need to attend before your wine and cheese party. However, if you are ready, then grab a six-pack, order a pizza, and get your hand out of your pants because you're about to read the most perverse, sadistic, and hysterical relationship book ever written. Enjoy!",
  "genres": [
    "Humor",
    "Fiction"
  ],
  "author": "Dan Indante",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/182310.The_Complete_A_hole_s_Guide_to_Handling_Chicks"
}