{
  "title": "The Unicorn Tapestries",
  "description": "On permanent exhibition at The Cloisters, in New York, seven late Gothic tapestries portray the Hunter of the Unicorn. Like the unicorn himself, they are one of the marvels of the world, for in no other work of art anywhere is the pursuit and capture of this magical creatures presented in such astonishing detail, with such command of pictorial verisimilitude and symbolic intention. In a duality not rare in the late Middle Ages, the imagery is both secular and religious. The references to love, matrinmonial fidelity, and desire for progeny are understandable in an ensemble that might have celebrated a marriage. But the unicorn, at the same time, is Christ, and the compositions reflect the Incarnation, the Passion, and the Resurrection. Gabriel, the angel of the Annunciation, is one of the the unicorn loses his fierceness in the lap of the Virgin Mary; a thorny crown encircles his horn and neck when he is slain; and then the glorious creature is miraculously alive again and chained to a pomegranate tree, simultaneously an image of the risen Christ and of the lover-bridegroom secured by his adored lady. The author, who was a curator at The Cloisters, conveys in a pleasantly informative style all that is known or can be reasonably believed about the missioning and the manufacture, all that can safely be conjectured about the original owners. Comprehensive color photography of the tapestries was done especially for this publication, and forty-four of the color images are of details essential to the author's discussion, ranging from dramatic figure compositions to studies of the rarer plants. This story of the Hunt for the Unicorn is certain to interest anyone who has visited the tapestries and been struck by their unique beauty. Equally, it should prompt others—unicorn-lovers generally and devotees of medieval art in particular—to look forward to this experience. [This book was originally published in 1976. This edition is a print-on-demand version of the original book.]Published by The Metropolitan Museum of Art/Distributed by Yale University Press",
  "genres": [
    "Art",
    "Nonfiction",
    "Art History",
    "History",
    "Historical",
    "Unicorns",
    "Mythology"
  ],
  "author": "Margaret B. Freeman",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/18223165-the-unicorn-tapestries"
}