{
  "title": "Bert Stern/ Marilyn Monroe: The Complete Last Sitting",
  "description": "Bert Stern, the famous commercial and fashion photographer of the 60s, was the last to be granted a sitting by Marilyn Monroe six weeks before her tragic death. The three-day session yielded nearly 2,600 pictures-fashion, portrait, and nude studies-of indescribable sensual and human vibrancy, of which no more than 20 were published. And yet these few photographs ineradicably shaped our image of Marilyn Monroe.This book presents the complete set of 2,571 photos. The monumental body of work by the master photographer and the Hollywood actress marks a climax in the history of star photography, both in quantity and quality. It is a unique affirmation of the erotic dimension of photography and the eroticism of taking photos, and it is the world's finest and largest tribute to Marilyn Monroe.In front of the camera, Marilyn was known to possess an incredible chameleon-like ability to transform herself into whatever role she was meant to play. In these pages she is goddess, siren, child, woman, femme fatale and dream date. Yet there is an air of desperation about these photos as well. In his fascinating foreword to the book. Bert Stern looks back on that momentous sitting, offering a revealing, naked portrait of Marilyn the person -- of a vulnerable, confused woman who although at the apex of her career, had relinquished control of her life -- and of the fashion world of the early 1960s, with its new openness towards drugs, sex, and art.From the glamorous, sophisticated photos which Vogue would publish in a black-and-white \"memorial\" spread, to the less restrained color shots which Stern coaxed out of Marilyn during an intense, exhausting session, this collection covers nearly every aspect of modern photography: portraiture, fashion-driven, erotic, and artistic. But more than a comprehensive display of Stern's immeasurable talents, these photographs combine to create an homage to America's first goddess. A woman we invented, but whom we could never really know.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Art",
    "Photography",
    "Art and Photography",
    "Media Tie In",
    "Film"
  ],
  "author": "Bert Stern",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/182234.Bert_Stern_Marilyn_Monroe"
}