{
  "title": "Poetry for Living an Inspired Life: Poems as Spiritual Meditation",
  "description": "Through the eclectic use of poetic form and genre ranging from prose poems, elegy, lyric and narrative poems, as well as haiku, sonnets and more, Poetry for Living an Inspired Life takes the reader on a poetic journey through the evolution of the human spirit while embracing fully the duality of the human condition. The poems in part I of Poetry for Living an Inspired Life were Divinely inspired through the use of a meditation practice taught by Neale Donald Walsch, a modern-day spiritual messenger. This illuminated work sets the stage with a meditative tone that promotes peaceful inner-silence. Each poem gently guides the reader to ponder their purpose, perhaps with a shift in understanding, and thus intention.Part II showcases poems, many of which have been published in fine literary journals, and were written during the poet’s extensive travels. Unexpected settings from a New York City subway, to the coastal home of Chilean poet Pablo Neruda, to Colorado ghost towns, and the driest desert on earth, transform the arm-chair traveler, through use of language invoking a powerful and passionate sense of place. Ranging in tone and pace, from the soul of the city to the silence of the forest, the poems in Poetry for Living an Inspired Life, reflect the work of the many poets who have influenced this highly innovative work. From the bucolic beauty of Mary Oliver’s poems, to the probing poems of Louise Gluck, as well as the romantic and quizzical nature of Pablo Neruda’s work, and the spiritual nature of Rumi, Poetry for Living an Inspired Life invites the reader to revision themselves and the world in which we live. As much for poets and writers as for readers who have never read poetry, the poems in this book are written in accessible, straightforward language, which draws readers into this broad body of work and back to themselves renewed.",
  "genres": [
    "Poetry"
  ],
  "author": "Michele  Harvey",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/18236261-poetry-for-living-an-inspired-life"
}