{
  "title": "Triple Delight",
  "description": "*** The entire Awakening Sophy series is now available in Awakening Sophy: The Boxed Set Books 1-6 (Includes a Special Bonus Story) for the low price of $3.99 ***An Amazon Number 1 Hot New Release in EroticaAn Amazon Number 2 Best Seller in Erotica from Amazon Best Selling Erotica Author - Bianca JamesIt began as a friendly dinner invitation from her neighbors. Craig, the hot, investment banker and his old college buddy, Luke, the bodybuilding, muscle car driving, inked parolee.Sharing some home cooked French cuisine, a few glasses of wine and a naughty dessert with a couple of guys who come from opposite sides of the track, was the plan for the night.Even the erotic stories that have been melting Sophy’s Kindle recently look tame in comparison to the events that unfold during the evening, as Sophy pushes aside her shy, self-conscious demeanor to explore another smoldering, hot fantasy that has been stoked by her recent escapades.Another smoking hot, erotic and sex charged story from Amazon best-selling erotica author, Bianca James.Although this is Part Two of a series, the books can be read in any order. Stranger Addiction (Part One) is available for a limited time, at only 99 centsHere’s what a few of readers had to say about Stranger Addiction …\"Sizzling hot!!!!\" 5 Stars - Goodreads\"One of those short, hot secret books you sneak in every once in a while. I really liked it but don't tell anybody.\" 4 Stars - Goodreads“This story took me to a place in my mind that you will want to be. Can't wait for the next book.” 5 Stars – Amazon Review** Warning: This highly erotic, 10,500 word story, is suitable for adults only (18+) as it contains many explicit sex scenes between consenting adults, sex fantasies, graphic language, elements of BDSM, oral sex, spanking, rough sex, exhibitionism, voyeurism and anal play **",
  "genres": [
    "Erotica"
  ],
  "author": "Bianca  James",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/18240131-triple-delight"
}