{
  "title": "Faraday, Maxwell, and the Electromagnetic Field: How Two Men Revolutionized Physics",
  "description": "The story of two brilliant nineteenth-century scientists who discovered the electromagnetic field, laying the groundwork for the amazing technological and theoretical breakthroughs of the twentieth century.Two of the boldest and most creative scientists of all time were Michael Faraday (1791-1867) and James Clerk Maxwell (1831-1879). This is the story of how these two men - separated in age by forty years - discovered the existence of the electromagnetic field and devised a radically new theory which overturned the strictly mechanical view of the world that had prevailed since Newton's time.The authors, veteran science writers with special expertise in physics and engineering, have created a lively narrative that interweaves rich biographical detail from each man's life with clear explanations of their scientific accomplishments. Faraday was an autodidact, who overcame class prejudice and a lack of mathematical training to become renowned for his acute powers of experimental observation, technological skills, and prodigious scientific imagination. James Clerk Maxwell was highly regarded as one of the most brilliant mathematical physicists of the age. He made an enormous number of advances in his own right. But when he translated Faraday's ideas into mathematical language, thus creating field theory, this unified framework of electricity, magnetism and light became the basis for much of later, 20th-century physics.Faraday's and Maxwell's collaborative efforts gave rise to many of the technological innovations we take for granted today - from electric power generation to television, and much more. Told with panache, warmth, and clarity, this captivating story of their greatest work - in which each played an equal part - and their inspiring lives will bring new appreciation to these giants of science.",
  "genres": [
    "Science",
    "Physics",
    "History",
    "Biography",
    "Nonfiction",
    "History Of Science",
    "Audiobook"
  ],
  "author": "Nancy  Forbes",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/18240286-faraday-maxwell-and-the-electromagnetic-field"
}