{
  "title": "Sweeney Todd: The Demon Barber of Fleet Street",
  "description": "The notorious career of Sweeney Todd, the Demon Barber of Fleet Street, has been endlessly retold. But this is the first time the original tale has been reprinted since it was serialized in The People's Periodical in 1846-7. A sensational story of murder and pie-making, Sweeney Todd is a classic of British horror writing, widely adapted in print and on stage, most famously by Stephen Sondheim, whose unlikely \"musical thriller\" won eight Tony Awards. This edition offers the original story with all its atmospheric Victorian trimmings. The story of Todd's murderous partnership with pie-maker Margery Lovett--at once inconceivably unpalatable and undeniably compelling--has subsequently set the table for a seemingly endless series of successful dramatic adaptations, popular songs and ballads, novellas, radio plays, graphic novels, ballets, films, and musicals. Both gleeful and ghoulish, the original tale of Sweeney Todd, first published under the title The String of Pearls, combines the story of Todd's grisly method of robbing and dispatching his victims--by way of Mrs. Lovett's meat pies--with a romantic sub-plot involving deception, disguise, and detective work, set against the backdrop of London's dark and unsavory streets. Editor Robert Mack fleshes out the story with a fascinating introduction touching on the origins of the tale, the growth of the legend, and a history of its many retellings. Mack also includes explanatory notes that point out interesting aspects, plus a full chronology of the many versions of Sweeney Todd.  Since Sweeney Todd first entered the public imagination in mid-nineteenth-century, his exploits have chilled and fascinated audiences around the world. This new edition allows modern readers to savor the ghastly original in all its gruesome glory.",
  "genres": [
    "Horror",
    "Classics",
    "Fiction",
    "Mystery",
    "Gothic",
    "Crime",
    "Thriller"
  ],
  "author": "Anonymous",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/1823892.Sweeney_Todd"
}