{
  "title": "Sacrifice For A Kingdom",
  "description": "A sensual, timely, contemporary romance, about a philanthropic beauty from exotic Trinidad, a modern-day socially-conscious European Prince, and the other loves, lives, and lies, that complicate their potentially idyllic life. The story begins with the warm sweetness of falling in love before becoming inflamed with passion, intrigue, and danger. No Cinderella, Elizabeth is sophisticated, wealthy, and hides life-changing secrets. Not merely a figurehead, ambitious courageous fun-loving Prince Michael also has secrets, some life-threatening, all hazardous. Both harbor fears for the survival of humanity and do their parts to alleviate them with speeches. Elizabeth’s is titled ‘God Has No Gender,’ Michael’s, ‘Climate Change, Man’s Fate Or Folly?’ More afraid for her safety than his own, Michael is determined, at any sacrifice, to stop her from doing more of her controversial speeches. But Elizabeth uses them to fund an important charity she co-founded. He rightfully struggles with fears of losing the monarchy, and waiting to, honorably, unravel the mysteries of Elizabeth’s haunting past. Learning about it takes him to a place he never dreamed possible. Their vividly titillating, sometimes humorous, lovemaking, contrasts captivatingly with their involvements in serious social issues. As shocking secrets are progressively revealed, loyalties become divided, but will love conquer all? Set in the USA, Europe, and the Caribbean, the love saga takes readers on an enthralling, enigmatic, erogenous but earnest journey through their exciting lives, crossing continents and cultures, places and races, until an assassin’s bullet hits its mark. Faced with an unexpected sacrifice, Elizabeth’s formidable dilemma is how to save both the opposing Kingdoms she flabbergastingly discovers she loves equally. Without love, nothing else really means anything> I believe all things are possible, and until there is proof of something, I keep an open mind> You control the mind, you control the purse!> Imagine the heaven on earth that is within our reach, if people in power were multi-faceted because of gender balance> A mother can love ten children equally, why not two men?> The earliest statues or figurines unearthed are, female!> Unlike the Goddess, there is no discovered evidence of the male God’s original existence.> Based on archaeological findings, she existed from the beginnings of human development.> There is not one word credited to be uttered by Jesus that his disciples, preachers, should be only males.> Why would the founding fathers of Christianity propagate denigration of the female of the human species, the gender who suffers the most to continue it - relegating her to be “subservient” to her husband - when the man for whom they founded the Christian religion never preached or practiced such abominations!> I feel his heart beating in rhythm with mine. It’s as though we are one, my Prince and I.> I will always love you, till death and even beyond.",
  "genres": [],
  "author": "Patricia D'Arcy Laughlin",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/18233645-sacrifice-for-a-kingdom"
}