{
  "title": "Survival of the Fittest",
  "description": "The tale of two extraordinary romantic relationships, one modern, one historical - which become inextricably linked and together affect man’s vision of the world.Charles Darwin formed his revolutionary Theory of Evolution during decades of research and sickness. Throughout it all his devoted wife Emma nursed him and edited his work, even though, devout Christian that she was, she feared for his soul as she realised where it was leading him.The publication of Charles’s seminal work ‘Origin Of Species’ shook philosophy to its foundations and brought the perennial debate about the existence of God to the forefront of man’s consciousness. Yet in the book - partly because of Emma’s admonitions - he refrained from interpreting the religious implications for fear of adding to the public furore.But suppose that he did in fact write down his conclusions as a secret Addendum. And suppose that Emma kept her own secret journal in which, not only does she describe the hectic day-to-day doings of the enormous Darwin household, but also comments on this hidden postscript.The modern-day story involves the detective search for these two hugely significant works. Maurice, an eccentric London antiquarian book dealer, his own life in turmoil over the loss of his beloved wife, is hired by an equally eccentric American billionaire to track down the documents for his world famous collection of original manuscripts. The complex investigation ranges across England, from historic towns and stately homes, to prisons and Darwin houses. Along the way it reveals the spiritual struggle within the extraordinary Darwin family, and produces an epiphany in Maurice’s own turbulent existence. It culminates in a revelation that threatens to affect man’s thinking for ever.Extracts from reviews on the You-Write-On authors’ website where the book achieved a top five position:-•\t‘This was the most fascinating piece of work I have read in a long time. I just couldn’t stop reading.’•\t‘The writing is so precise well-formed that I feel somewhat humbled.’•\t‘Amazing command of language, a keen eye for details and a warm expression of emotions based on very good understanding of the human nature.’•\t‘The language is wonderful, with different styles playing out successfully which add to the story.’•\t‘A very engaging writing style that carried me along. I felt I was on a journey that was going to be both exciting and illuminating.’See Amazon reviews below.Robin Hawdon is one of Britain's most prolific playwrights. His plays have been seen in over forty countries. At any one moment there may be over twenty productions running across the USA, Europe, and elsewhere. This is his third novel. Publisher's website: http: //sbpra.com/RobinHawdon Author's website: robinhawdon.com",
  "genres": [],
  "author": "Robin Hawdon",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/18234276-survival-of-the-fittest"
}