{
  "title": "As Luck Would Have It",
  "description": "Star of stage, screen and television, and one of only two people to be awarded two Knighthoods, Sir Derek Jacobi is one of Britain’s most distinguished actors.‘If you want to be an actor, don’t. If you need to be an actor, do.’The world of theatre could not have been further from Derek’s an only child, born in Leytonstone, London. With his father a department store manager and his mother a secretary, his was very much a working class background. But nonetheless Derek always knew he was going to be an actor, and he remembers clearly the first time he was in costume – draping himself in his mother’s glorious wedding veil as he paraded up and down the Essex Road with his friends.A few short years later, at the age of seven, Derek made his acting debut, playing both lead roles in a local library production of The Prince and the Swineherd. By the age of 18 Derek was playing Hamlet (his most famed role) at the Edinburgh festival. He won a scholarship to Cambridge, where he studied and acted alongside other future acting greats including Ian McKellen. His talent was quickly recognised and in 1963 he was invited to become one of the first members of Laurence Olivier’s National Theatre.Often admired for his willingness to grapple with even the most dislikeable of characters, Derek Jacobi has worked continuously throughout his career, starring in roles ranging from the lead in I, Claudius to Hitler in Inside the Third Reich and Francis Bacon in the controversial Love Is The Devil. But it is his numerous Shakespearean roles that have gained him worldwide recognition.This book is, however, much more than a career record. Funny, warm and honest, Jacobi brings us his insider’s view on the world of acting. From a simple childhood in the East End to the height of fame on stage and screen, Derek recalls his journey in from the beginnings of his childhood dreams to the legendary productions, the renowned stars and the intimate off-stage moments.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Autobiography",
    "Memoir",
    "Theatre"
  ],
  "author": "Derek Jacobi",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/18240403-as-luck-would-have-it"
}