{
  "title": "Global Friendship Vol 3: Global Friendship Vol 3 Kazakhstan - Oman",
  "description": "Amara Para Global Friendship Vol 3 K - O is another exciting, educational book from the popular and fun Amara Para series which teaches children from ages 4 - 7 about diversity, global culture and the world. This book along with the others in the Global Friendship collection is an excellent resource for parents, nursery school teachers, primary school teachers and educators to read with children or to children while using the information in the book to teach children about different aspects of different cultures from flags to languages. Come and meet Amara Para's friends from around the world. Learn about the wonderful world of global culture as we take you on a journey through Kazakhstan, Luxembourg, Mexico, Nigeria and Oman in this colourful and educational book. Celebrate diversity as you learn about Amara Para's many friends, their countries, cultures, languages and the things they love. This is one of a collection of six books which teaches children and parents about diversity and global culture. Come and learn with us about the world.'I have all three books from the Global friendship collection. I must say that these are beautifully illustrated and packed with information which is great for children and parents alike. My son and I learned things about Kazakhstan, Luxembourg, Mexico, Nigeria and Oman. I think the section on languages is a great way for children to be introduced to foreign languages. My son loved the sound of foreign words and adores the characters. Very good book to teach children about different cultures, languages and places.''As a primary school teacher I think the Amara Para books are excellent tools for teaching children not only about the world but about languages and diversity.' 'This book is very cleverly written. The content and the illustrations are well thought out to have the maximum impact on the young reader. Very educational and colourful. My children have me reading them every night and then ask me thousands of questions about the different characters and the countries they come from.'",
  "genres": [],
  "author": "H. Aitoro",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/18242650-global-friendship-vol-3"
}