{
  "title": "Of Mice and Zen. Animal Encounters in the Life of a Wandering Buddhist",
  "description": "MY LOVE OF ANIMALS AND NATURE WAS GREATER THAN MY FEELINGS FOR MOST PEOPLE!It was my concern for nature and the environment, and my strong feelings about the way animals are treated individually, which led me to an interest in Hinduism and Buddhism. When I was fifteen and becoming interested in religious, ethical and philosophical issues, I started reading about these religions and the cultures in which they emerged.On realizing that higher caste Hindus and many East Asian Buddhists are vegetarian, and rejected the killing of animals, I became fascinated and devoured translations of early Buddhist texts. I understood their respect for nature, and slowly began to engage with Hindu and Buddhist teachings. I read everything I could on the cause of animal welfare and how we could mutually benefit each other as a species.Dogs in particular are known to have a calming effect on humans. Petting your dog and playing with it can actually raise your serotonin levels. This is the feel-good hormone, so reduces stress, and gives people a more positive outlook. In addition, owning a dog can even help you live longer and prevent heart problems because regularly exercising a dog can reduce human cholesterol and triglyceride levels. I do believe responsible dog ownership, or caring for a pet generally can help to make you a better person. I discuss some of the cross-cultural implications of attitudes to dogs in Thailand and Western countries, and how they influence the socialisation and training of dogs.Our encounters with animals deeply enrich our lives, and help make us what we are. I think we should delight in those encounters and honour and respect the animals that have made this relationship possible.Dr STEWART McFARLANE, the well-known Buddhist scholar and T’ai chi master has respected nature for as long as he can remember. Having spent a lifetime in the company of animals he developed an understanding which few people possess – his knowledge and discoveries have now been compiled into a personal and reflective collection of animal stories. Warning - if you think that you really know what makes animals tick, you are in for quite a surprise, as Stewart reveals his Buddhist thinking and philosophy around all things living.In our hectic and stressful life it’s all too easy to turn to short term so-called ‘solutions’ but animals have a wonderful knack of radiating a calming and relaxing feeling–they give this without expectation of reward.FIRST ANIMALGetting his first dog when he was nine- a collie-terrier cross who came from a local farm. She went everywhere with him; exploring the woods and lanes, swimming in the river, camping out under the trees. She even tracked Stewart on a two-mile walk to school one day, so he had to get permission to take her home during the morning break, but only after she had received a full quota of petting and admiration from his classmates, who crowded around them in the playground. It was about this time he began devouring all the animal stories he could get hold of.ANIMAL PHILOSOPHYThe author holds strong views on animal cruelty and mistreatment and opposes the unnecessary killing of animals; hating with a passion the burgeoning animal cruelty stories; consequently he became a vegetarian at the age of eleven. He also abhors the cruelty involved in the mass production of meat in factory farming and in slaughterhouses.OF NATUREIt was his concern for nature and the environment and his strong feelings about the way animals are treated which led him to an interest in Hinduism and Buddhism. A later chapter is devoted to his favourite Hindu animal story; the account of Prince Yudhisthira and his faithful dog. He records it later in the book, even though the story is from the ‘Great Epic the Mahabharata’. This didn’t happen to him personally, but its message has been profoundly important in his life, so heconsiders its inclusion is justified. When he first read the story at the age of 16, he was even more convinced of the wisdom of Hinduism and Asian religions.CALMING EFFECTSThere are clear benefits to children and families to having animals around, especially dogs. If dogs and children are raised correctly, then they learn self-discipline and the importance of being responsible for an animal and taking care of it properly. They are better socialized generally because they learn to put the needs of the pet first at times, and so learn to be more selfless and more caring. If they regularly walk and play with the dog, then they get the benefit of exercise as well as the dog. Dogs in particular are known to have a relaxing effect on humans. Petting your dog and playing with it can actually raise serotonin levels.ANIMAL STORIESEver since the first people sat around their campfires we have told stories to try and make sense of the world – or more likely to escape it. When we tell a story, we make connections and none more so than with our pets. Stewart makes no apology for the frequent occurrence of dog stories in his book. Many dog-owning readers will recognize similar events and relationships in their lives with their dog companions. In this book you’ll also read about and discover:•The Elephant’s Picnic or ‘How I Came to Be in an Elephant Camp in Thailand’•Vicky the Shetland Sheepdog -what happened to the hamsters climbing over her? •An Audience with Nessie and Other Sea Monsters - prehistoric marine animals and diving with Hammerhead sharks – what you mustn’t do!•Paddy the Irish Setter – bonding with your dog and play-fight psychology.•Three Heroes and Their Faithful Dogs - a favourite Hindu animal story.•Mimi the Smart Formosan Mountain Dog - used by the aboriginal tribes of Taiwan•The Enchanting Sea Life of Monterey Bay–diving off the Californian coast with sealions.•A Whale of a Time in Hawaii - whales put on a full cabaret act!•Monkey Madness in a Thai Paradise–how a small Macaque was trained to extract money from tourists.•Pepsi, the Chicken Killer: the Reformation of a Thai German Shepherd Dog.•Androcles and the Snake – how a trapped snake reacted to her rescuer.•Brian the Homing Snail – a Thai delicacy and protecting him from being eaten, and...•The Zen method for strengthening the bond between dog and owner.....and much, much moreE book (kindle) on AmazonE pub format at: http://www.taichi-exercises.com",
  "genres": [],
  "author": "Stewart McFarlane",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/18240564-of-mice-and-zen-animal-encounters-in-the-life-of-a-wandering-buddhist"
}