{
  "title": "Histoire de ma vie : édition définitive du manuscrit original. Volume 1 :Tomes 1 à 3",
  "description": "Cette nouvelle édition de l’Histoire de ma vie est entièrement basée sur le manuscrit acquis par la BNF en 2010. Elle en respecte pour la première fois le découpage et procure un texte fiable, corrigé des erreurs de transcription de la précédente édition Brockhaus-Plon de 1960 (reprise en \"Bouquins\" par F. Lacassin en 1993). Ce premier volume, remanié en profondeur, reproduit les tomes 1 à 3 des Mémoires de Casanova, depuis l’enfance de Giacomo jusqu’à son évasion de la prison des Plombs en novembre 1756. Une nouvelle préface présente un Casanova éloigné des clichés pour faire apparaître l’importance de l’écrivain et du penseur. L’appareil critique, lui aussi renouvelé et enrichi, se concentre sur le travail d’écriture de Casanova : il restitue l’histoire de la langue, éclaire son choix d’écrire en français sans renoncer à l’italianité (\"La langue française est la soeur bien-aimée de la mienne ; je l’habille souvent à l’italienne\", écrit-il), et retranscrit dans la mesure du possible les passages biffés sur le manuscrit. Ce volume I reproduit trois variantes importantes : les différents projets de préface, les deux versions du premier séjour parisien (1750-52), reproduites en regard l’une de l’autre, et le récit de l’évasion de Casanova publié en 1788 sous le titre Histoire de ma fuite des Plombs. Enfin, on y trouvera plusieurs documents permettant de mieux comprendre le monde de Casanova : évaluation de ses revenus, tables de conversion des monnaies européennes, règles des jeux comme le pharaon, et déplacements du Vénitien (cartes du monde méditerranéen, quartiers de Venise et de Paris).",
  "genres": [
    "Audiobook",
    "Nonfiction",
    "Classics",
    "Biography",
    "Memoir",
    "History",
    "Historical"
  ],
  "author": "Giacomo Casanova",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/18242273-histoire-de-ma-vie"
}