{
  "title": "S.A.I.N.T.S. Song of Winds",
  "description": "Song of Winds is a fast-pace adventure mystery thriller for older young adults and the young at heart – a sort of Indiana Jones meets Dan Brown and Jackie Chan, yet very different. Two thousand years ago, a geomancer leads a tribe out of the tomb of Emperor Qin. One thousand years later, a treasure is lost to the Incas. Today, an unusual terracotta soldier is unearthed in China.A mild mannered Korean boy can fly. A beautiful American girl finds lost souls in Peru. The richest man in Asia turns to the I Ching for clues. An old Mexican man is selling hot dogs in the streets of New York. And they are all connected in a fate that began in ancient China and ends in the mountains of present-day Peru.Meet the SAINTS (the Syndicated Alliance of Irregular and Talented Specialists): Song, the master of the mystic Tao of Twelve Winds; Diego, a clairvoyant who can see past events and past lives; Ronny, a man of unparalleled intuition; Audrey, the ultimate exponent of the healing arts of the Ayurveda; and Zengo, the enigmatic founder of SAINTS.Using sheer intellect and mastering their subtle supernatural forces, SAINTS is called upon to stop an equally formidable force, Los Payasos. But before they can succeed, in a race against time, one team must unlock the cryptic codes of Emperor Qin’s tomb while the second must find the Lost Treasure of the Incas, for so it seems, one needs the other. Yin and Yang.SONG OF WINDS is a 120,000 word quasi-historical novel; a complex and thought provoking mystery that might topple all common thinking about the relics of a rich past. It is also an adventure, a romp and a love story, a tale steeped in history and geography and magical what-if’s.Like the The DaVinci Code or National Treasure, readers will find themselves believing in the possibilities just beneath the inexplicable and, moreover, realizing there may very well be mystery in what people often consider mundane.Available in Singapore at Kinokuniya and Popular bookstores. Also available online internationally at Amazon.com and the Straits Times Press website.",
  "genres": [],
  "author": "Julian Kim",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/18241949-s-a-i-n-t-s-song-of-winds"
}