{
  "title": "Redeemed Love",
  "description": "“Who am I? For all intents and purposes, I am the nice guy; the loyal brother and decent citizen. I am quiet and non-confrontational. I am the brother nobody worries about and can always depend upon. To my family, I am the good one. However, that’s only what they see on the outside.” ~ Jeremy EvansOutwardly, Jeremy Evans is a typical guy, the calmest of the Evans brothers. He’s obsessed with cars, enjoys the company of beautiful women, and is devoted to his family. Inwardly, however, Jeremy is a ticking time bomb. Torn between what’s right versus what’s wrong. When the attempted rape on Darcie occurs, Jeremy finally loses the battle within himself. The pure hatred for Sulfur Heights consumes him and escape is all he thinks about. Three years later, he is secretly engrossed by the drug-infested underworld. Jeremy’s double life leads him on dark and sinister paths of drugs, violence and rage. The Evans family is destroyed after Presley’s murder and consequently Jeremy’s arrest. He’s sent to prison where he’s forced to survive with the mistakes he’s made on his conscience. However, only one thought lingers. It consumes the years he spends locked in a cell. Retribution. Cami Ryker used to have a picture perfect life. She was loved by her family and happy with her life until her brother’s sudden death tore her family apart. Cami is forced to care for her ailing mother and assume the responsibilities of a normal adult. However, when the bills are paid and her mother is tucked away for the night, Cami likes to cloud her mind in order to escape her daily struggles. Late one night, a stranger trolling the streets rescues her in a dark alley. The mysterious stranger will become one of the most important people in her life until the day he’s sent to prison. Four years later, Jeremy is released and seeking redemption for his mistakes, but the betrayal is still thriving amongst the Evans family. Will Jeremy finally find the solace within to gain the forgiveness from his family that he desperately craves? And is it possible for Jeremy to save those he loves and exonerate himself in the process? **Mature Content Warning** 17+ for language and sexual content**",
  "genres": [
    "Romance",
    "New Adult",
    "Dark",
    "Contemporary Romance",
    "Contemporary",
    "Drama"
  ],
  "author": "M.S. Brannon",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/18241541-redeemed-love"
}