{
  "title": "Demons, Shifters and Witches, Oh My!",
  "description": "4 Author Book Bundle--4 Paranormal ReadsThese are not short stories--they are complete books. Over 200,000 words of great paranormal reads.Something for everyone:Elizabeth A Reeves offering Baehrly Breathing (Paranormal Romance)Lanie Jordan offering Breed of Innocence (Teen Urban Fantasy/Paranormal)Hope Welsh offering Linked (Paranormal Romance)Charity Parkerson offering The Sexy & The Undead (Paranormal Romance)Baehrly Breathing by Elizabeth A ReevesThe first book in the Goldie Locke and the Were Bears series.It's difficult to be taken seriously when you are a member of the Magical community and saddled with the unfortunate name 'Goldie Locke'. It certainly doesn't help if you are also about five feet tall, blond, and most commonly described as 'cute.'. What was a girl to do?Become one of the most dreaded Magical environmental lawyers of all time?Goldie isn't there yet, but she's well on her way when a case drags her into uncharted territory-- working with Ordinary officials to figure out why 'unusual' remains are being discovered all around New England.With her hands full and a new dragon on the way, Goldie's hunches about this case may prove to be all-too true-- this stuff is bad business!Breed of Innocence by Lanie JordanOne goal: Hunt the demon that killed my family. Make that two goals: Survive.Six hours ago, men in dark suits and sunglasses came looking for me.Four hours ago, they offered me training to hunt the things that killed my family: demons.Two hours ago, I joined their secret organization--the CGE.Now... All I have to do is survive demon-hunting school.The classes won't kill me, but the finals might.Warning: This book contains kick-ass (literally) demon-hunters in training, vampires (not the cuddly, marrying type), and sarcastic (and sometimes snarky) attitudes. No humans were eaten during the writing of this book. Bitten doesn't count...right?Linked by Hope WelshLana Summers doesn't want anything to do with paranormal abilities.She's seen what it did to her mother before her death. Cole Thomas has his own talents, but can Lana accept his when she can't accept her own? Can Cole convince her to embrace her talents--and accept his--in time?When Lana's house is invaded in the middle of the night by an intruder, Lana awakes to a warning in her dream to Run! The warning came from her dead mother.As she flees to the streets via a window, she finds Cole Thomas. He offers to check her house, and decides she needs protection when his shapeshifter talents tell him that Lana's invader wasn't human.The prophecy must be deciphered--but the one being that knows isn't talking.. Now, it's up to them to figure it out. The clock is running, and time is running out.The Ancient ProphecyWhen Two Become OneAnd One Becomes TwoThe Sexy & The Undead by Charity ParkersonA potion gone wrong, or right?Single, unemployed, and in charge of her very own pet zombie, Ella Perry is cooking up trouble, and it's raining men.Ella has spent years searching for a cure for a zombie named Freddie. However, when an experimental concoction takes an unexpected turn, she gets a glimpse of the life she's been missing by hanging out with the undead.Zombies, Angels, and Pixies. Oh my! Don't miss out on the first book in the new \"Sexy Witches\" series by Bestselling Author Charity Parkerson.",
  "genres": [],
  "author": "Elizabeth A. Reeves",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/18243867-demons-shifters-and-witches-oh-my"
}