{
  "title": "Sleeping Virgin Seduction",
  "description": "HIS SLEEPING SURPRISE! HER SURPRISE NINE MONTHS LATER...It's naughty little Cassie's lucky day. For years, she's lusted over her mother's boyfriend, Matt, and now their relationship is falling apart.Strong, handsome, and kind, sexually deprived Matt won't take advantage of the eighteen year old virgin unless everything's absolutely perfect. Luckily, Cassie has an ace up her sleeve: experimental sleeping pills that let her feel everything while she appears knocked out.Once she's zonked out half-naked on her bed, Cassie knows that even good guy Matt won't be able to resist taking her virginity and planting his seed deep inside her fertile belly...Warning: This story features rough sex, sleep seduction, impregnation, and explicit language.Word count: 7,000+ words.EXCERPTCome to me, Matt. You know you want to.Throw your stupid hesitations aside. Listen to your body. Listen to the pheromones drifting off me, commanding you to do what men do best...Slowly, he turned around. To him, it looked like my eyelids were completely closed, as if I were totally lifeless and asleep.But my body was wide awake, barely clad and crying out for him! And without my judgmental eyes on him, he could do what the note said, exactly what I wanted him to do more than anything in the world - anything his sex deprived brain could conjure up.Matt peered across the gap between us, his muscles bulging slightly as he ran his eyes up and down my young body. To him, I was an untainted nymph, a wondrous creature he never expected to lay his hands on.My nerves cried out as he reached toward me. I wanted to gush with happiness and push myself into his grasp faster, but the sleeping pills wouldn't let me.He grabbed my breasts, this time confident and aggressive. His fingers slowly closed, covering my mounds, gradually folding inward toward my nipples.His massage released the fire inside me. I felt it dive into me, exploding between my thighs, all wet and warm and oh-so-ready for him to enter me.Jesus, baby. That's it. Don't be afraid to use and abuse them.As if he could read my mind, Matt bent down. He lifted my girly shirt off and hurled it across the room, freeing the woman inside from the trappings of something a teen would wear.His breath lapped against my bare neckline in steaming waves. His strong tongue popped out and curled between my cleavage, swirling arcs around my breasts before rising up, coating my neck in slick desire.When he tore himself away, my nerves were rattling without moving my limbs. Every fiber of my being wanted to reach up and pull him into my breasts - but I couldn't.I was totally at his mercy.Matt stared at me curiously - probably wondering why I didn't wake up. He reached behind my thigh and gave the side of my ass a nice hard whack.The sound stung the air, and I saw red. Suddenly, the man I loved bared his teeth, more like an angry beast than a lover sent to gently pluck my virginity.\"So...this is how you want to be taken, Cassie? Not like a sweet teen virgin, but more like a whore? I never knew you had it in you.\" He slowly smiled, running several fingers through his short cropped hair.\"Remember, you invited me to do anything I want, little girl. And I'm going to make good on that invitation while you're knocked out cold. I'm going to make you sore, thinking about that b*tch mother of yours the whole time. Or maybe I won't. Maybe you're so sticky sweet that I'll forget all about her, forget about everything except how good you feel wrapped around me...\"",
  "genres": [
    "Erotica",
    "Romance",
    "Adult"
  ],
  "author": "Nicole Snow",
  "average_rating": "2.79",
  "url": "https://www.goodreads.com/book/show/18247518-sleeping-virgin-seduction"
}