{
  "title": "Knights of Black Swan Books 1-3",
  "description": "This box set includes:Book 1, My Familiar Stranger: Elora Laiken escaped assassination when she was forced into an experimental device that left her broken physically and emotionally. She materialized within the walls of a secret society of vampire hunters and paranormal investigators. In another dimension. She must adapt to the new world and to the super abilities she gained as a side effect of interdimensional travel.If that's not enough to deal with, she must also manage the amorous attentions of three palpitating hot suitors.Book 2, The Witch's Dream: Sir Storm's heart was broken. Now the sexy vampire hunter wants nothing to do with love, or even women for that matter. But a beautiful witch who works for Black Swan as a tracker has other ideas about that.When B Team arrives in Edinburgh, the afterglow of a romantic elf tale wedding ends abruptly when Sir Kay's fiancé, Katrina, is kidnapped by a demon with a grudge. While Litha is assigned to search for the missing girl with Storm as her escort, other members of B Team are tasked with bringing in a stray werewolf who's been causing havoc in London.Book 3, A Summoner's Tale: While the devastatingly seductive ex-vampire, Istvan Baka, is forced to relive his tragic life as human and confront his history as a vampire, a very pregnant Elora Laiken is attacked by assassins from her dimension of origin. She seeks aid from a most unlikely source... the New Forest wolf pack. While their friends and mates mount frantic searches in a race to rescue them, two people who flirted with being lovers, separated by distance, simultaneously struggle through their own personal tortures. Alone. In pain and darkness.",
  "genres": [
    "Paranormal Romance",
    "Romance",
    "Paranormal",
    "Vampires",
    "Witches",
    "Fae",
    "Fantasy"
  ],
  "author": "Victoria Danann",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/18246191-knights-of-black-swan-books-1-3"
}