{
  "title": "Meant for Love",
  "description": "It's been twelve years since Jenny Wilks lost her fiancé in the 9/11 attacks in New York City. Since then she's been floundering, trying to find her way. Taking the job as lighthouse keeper on Gansett Island was the best thing she could've done for herself. On the island she's found amazing friends and a wonderful new life. There's only one thing missing and that's romance. She's recently asked her new friends to fix her up with some of the island's more eligible men. While her friends are busy arranging dates for her, Alex Martinez comes to cut the grass at the lighthouse.He's given up everything to come home to Gansett to care for his ailing mother…Alex has gone from cultivating orchids at the US Botanic Garden in Washington to cutting grass on Gansett, like he did as a teenager. Running the family business with his brother while managing their mother's dementia requires Alex's undivided attention until a sexy lighthouse keeper shows him there's much more to life than work and endless obligation.During a scorching summer heat wave on Gansett, Jenny and Alex take comfort in each other, and what begins as a hot summer fling quickly becomes something much more lasting. But will it hold up beyond the heat wave when real life intrudes on their sexy interlude?Gansett Island Reading OrderMaid for Love (Mac & Maddie)Fool for Love (Joe & Janey)Ready for Love (Luke & Sydney)Falling for Love (Grant & Stephanie)Hoping for Love (Evan & Grace)Season for Love (Owen & Laura)Longing for Love (Blaine & Tiffany)Waiting for Love (Adam & Abby)Time for Love (Daisy & David)Meant for Love (Jenny & Alex)Chance for Love, A Gansett Island Novella (Jared & Lizzie)Gansett After Dark (Owen & Laura)Kisses After Dark (Shane & Katie)Love After Dark (Paul & Hope)Celebration After Dark (Big Mac & Linda)Desire After Dark (Slim & Erin)Light After Dark (Mallory & Quinn)Victoria & Shannon (Episode 1)Kevin & Chelsea (Episode 2)A Gansett Island Christmas NovellaMine After Dark (Riley & Nikki)Yours After Dark (Finn & Chloe)Trouble After Dark (Deacon & Julia)Rescue After Dark (Mason & Jordan)",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Fiction",
    "Family",
    "Adult"
  ],
  "author": "Marie Force",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/18245515-meant-for-love"
}