{
  "title": "Next Move, You're Dead - The Trilogy",
  "description": "Enjoy Linda L Barton’s exciting Next Move, You’re Dead Trilogy, now combined into one book of pure psychological evil and heart-pounding bliss. Book One: Next Move, You’re DeadHomicide Detective John Cooper has always followed the evidence to solve any case until a mysterious caller makes him question that evidence. The murder cases he's working on are already solved, so John wonders what the phone calls have to do with them. The evidence proves the guilt of those involved, but the calls make him start to question the evidence and himself - for the first time in his career. With each move, John finds himself caught up in a game with an unknown opponent who is always one step ahead and seems to know John better than he knows himself, but how? How can someone know every detail of the murder cases and not be involved? But most importantly, how can this chilling caller know everything about John? As John prepares himself to take on the challenge, he soon realizes that everything he's believed in is no longer part of his new reality.Book 2: A New GameDetective Lucinda Mackey is tough as nails and she never gives up until those who would do harm to the innocent are brought to justice. She has always lived by a certain code, but she never counted on being chosen by a mysterious caller to play in his game of life and death. Can she survive this brush with an unknown opponent who is determined to destroy her, or will she face the same fate as all the others who have played in The Game?Book 3: ErebusErebus is back and ready to play The Game, but this time he has added a new twist. John Cooper has been kidnapped, and it's up to Mac and Tom to rescue him before time is up. Each move takes them closer to solving the mystery of Erebus, but will they succeed before they are all destroyed?In books 1 & 2 you learned to hate Erebus. Now you will learn who he is, and why he plays his games.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Crime",
    "Amazon"
  ],
  "author": "Linda L. Barton",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/18246599-next-move-you-re-dead---the-trilogy"
}