{
  "title": "A Christmas Dress For Ellen",
  "description": "On Christmas Eve, 1927, in the prairie town of Hillsspring, Alberta, Canada, a young mother, Mary Jeppson, was getting her five small children ready for bed. Her heart was full of sorrow, for there was nothing to fill the stockings, and there would be only a little mush for breakfast. Mary had written to her sisters in Idaho, asking for help with such necessities as wheat, yeast, flour, and cornmeal. She had also asked for clothing and some old, used quilts, for all of hers were thin and full of holes.At the close of the letter, she had written, \"If you could just find a dress that someone has outgrown, I could make it over to fit Ellen. She is far too somber for such a young girl. She worries so about the family and about our needs. She has only one dress that she wears all the time, and it is patched and faded.\"Her letter had gone unanswered, it seemed, and their Christmas would be far from merry. But George Schow, their mailman, had a surprise in store. Could he brave the coming storm and bitter cold to deliver a Christmas miracle? And would there be a special present for Ellen? Find out in this classic tale of Christmas sacrifice and service.About this book: President Thomas S. Monson told the story \"A Christmas Dress for Ellen\" at the First Presidency Christmas Devotional in 1997, and an adaption of his address was published as a Christmas booklet in 1998. The story was related to President Monson by Marian Jeppson Walker (now deceased), a daughter of Mary Jeppson, the mother in the story. Sister Walker and her husband, William, also exchanged correspondence about the story with President Monson over the years. Additional details were obtained through correspondence with descendants of George Schow, the mailman who delivered the long-looked-for packages to the Jeppson family on Christmas Eve. In addition to other family members, those descendants include Mark Schow (now deceased) and Gayla Woolf Holt. The help and information from all these family members is acknowledged and appreciated.",
  "genres": [
    "Christmas",
    "Picture Books",
    "Lds",
    "Nonfiction",
    "Childrens",
    "Holiday",
    "Biography"
  ],
  "author": "Thomas S. Monson",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/1824804.A_Christmas_Dress_For_Ellen"
}