{
  "title": ". . . and His Lovely Wife: A Memoir from the Woman Beside the Man",
  "description": "The first time I heard it, I laughed.Oh, come on, I thought. He didn’t just say that.We were at a restaurant in southern Ohio, where a hundred or so Democrats and a handful of young campaign workers had gathered to hear my husband, Sherrod Brown, announce for the seventh time in two days why he was running for the United States Senate.The party chairman of the county stood up at the lectern and in a loud, booming voice, introduced “Congressman Sherrod Brown–and his lovely wife.”By Week 40 of the campaign, I had been introduced that way nearly a hundred times. I stopped counting once we hit the 50 marker. I knew I was not the point at these gatherings, and I was so proud of the man who was.Also, I realized I was getting cranky about something I could not change. If I couldn’t rely on a sense of humor, I was in for one long year on the campaign trail.Writing with her trademark warmth, wit, and common sense, Pulitzer Prize-winning columnist Connie Schultz reveals the rigors, adrenaline joys, and absolute madness of a new marriage at midlife and campaigning with her husband, now the junior senator from Ohio. She describes the chain of events leading up to Sherrod’s decision to campaign for Senate (he would not run without his wife’s unequivocal support) in a state where no Democrat had won statewide office for twelve years. She writes about the moment her friends in the press became not so friendly; the constant campaign demands on her marriage and family life; a personal tragedy that came out of the blue. She gives us a candid behind-the-scenes look at the often ludicrous trials and tribulations of being an opinionated columnist, a political wife, and a newly married woman in her forties, and the rigors of political audacious bloggers, ruthless adversaries, campaign fatigue, political divas, the no-small-planes agreement, and staffers young enough to be her children suddenly directing her and her husband’s every move.Filled with eye-opening revelations about the election process, . . . and His Lovely Wife illuminates through one woman’s story a marriage, our political system, our working lives, and our nation. Connie Schultz is outspoken, passionate, and very public about her opinions–in other words, every political consultant’s nightmare, and every reader’s dream.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Politics",
    "Biography Memoir",
    "Womens",
    "Feminism",
    "Biography"
  ],
  "author": "Connie Schultz",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/10928._and_His_Lovely_Wife"
}