{
  "title": "Tracing The Stars",
  "description": "Hankarron Eros has loved Tara since she had pigtails, but his fear of losing the strength and support that their friendship provides leads him to keep his heart's desires locked away. When the truth about his family is exposed and leaves him grasping to hold onto his ship, his crew and his sanity, words are spoken that can't be taken back and the presence he had grown so used to having at a convenient reach is gone.Tara Flint has never denied her heart's attraction to the floppy-haired, brown-eyed Hankarron, even if he can be a stupid limik sometimes. Her strong will falters as she is forced to decide between a promise she made to her father, a boy she has loved since she had pigtails and the possibility of finding out what her life might be like without the presence of Hankarron always by her side.When you get knocked down, you get back up and hit the other guy harder. Trip 'Wild Fists' Weston is a Runata'ji combat fighter at the top of his career with a fame and fortune he doesn't want and a Lucky Clover tattooed across his heart to remind him of the girl who is always just out of reach. When Tara's luck lands her in his lap without Hankarron on her heels, Trip wonders if this is his chance to capture his Clover, or if Tara's luck has other ideas in mind. Fate doesn't always give you want you want, but it will always give you what you need.Jennadri Szina doesn't have time for matters of the heart or trying to get two wayward agents back on track. She's got a mission to run, a Director who is dying and a mother who isn't easy to impress. When Jehdra sends her to save Hank and Tara, Jen takes her mother's mission on at full speed, but she isn't prepared to manage 'Wild Fists' Weston and his damn dimple.They say that the stories of our time will one day be traced into the stars to help guide others home. Fate strings intertwine with skipping stones across the stars of the universe, pulling it forward and writing new lines in the night sky as the Corwint Central Agent saga continues to lead Ethan, Orynn and Jarren towards a collision that holds the power to change everything.",
  "genres": [
    "Science Fiction",
    "Romance",
    "Aliens"
  ],
  "author": "C.E. Kilgore",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18248897-tracing-the-stars"
}