{
  "title": "Acting on Temptation",
  "description": "Anna Lewis is just tired. She’s tired of being predictable. She’s tired of khaki skirts, sweater sets and pearls. She’s tired of her overbearing mother trying to push the Perfect boyfriend on her. She wants to stand up for herself do normal things kids her age do. She’s eighteen not thirty-eight. With her mother still on her case, an ex-boyfriend who’s an ass that won’t leave her alone, it’s not going to be easy. She was ready to move on with her life, leave the step-ford wife her mother was trying to turn her into behind. The only way she sees of doing that is going off to college. She’s always admired the strength that her sister Gabby radiates and wishes she could be more like her. After Gabby asks her to come to college with her and live in the house with her and her roommates how can she turn it down?Russ Addison has pretty much always been a football star. Going to college with that status could get him any girl he wants, with no strings attached. That is until he was introduced to her. He was in pure awe over the angel he met last year, Anna Lewis. He was both excited and scared about the possibility of living with her. Her sister and everyone else in the house had threatened him and his balls to stay clear of anything romantic with Anna. He would just have to stay away from her in the romantic sense and be her friend…Her best damn friend. Because he knows he’ll never be good enough to be anything more to her.After everyone is moved in and ready to start the fall semester, Russ starts to figure out that everything may not be what it seems with Anna. He also realizes that he can’t stay away from her no matter how much he tries. Anna knows she can’t seem to have enough time with Russ and she can’t help but wonder why he thinks so little of himself. Will they be able to stay away from each other or will they have to act on the temptation of each other.",
  "genres": [
    "New Adult",
    "Sports Romance",
    "Sports",
    "Romance"
  ],
  "author": "S.M. Donaldson",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/18249766-acting-on-temptation"
}