{
  "title": "Krac's Firebrand",
  "description": "Section K Replication Alluthan Clone, or Krac as he was now called, had one focus in his life; protecting the descendants of the Freedom Five who ruled Earth’s council. Rescued by members of the family from a secret facility, he pledged to do what he could to always keep them safe. Things become personal when insurgents target a special member of the Freedom Five, Gracie Jones-Jefe and her family. When Violet Jefe is kidnapped, he swears to do everything he can to bring the precocious little girl, who is the image of her mother, home safely and kill those who took her without mercy. Captain “Skeeter” Lulu Belle Mann lives a life of freedom drifting from Spaceport to Spaceport in her short haul freighter looking for unusual treasures to add to her collection of mismatched prizes. On the Pyrus Space Station, she finds two treasures she has to have! One is the new navigation module she desperately needs and the other is a curly haired little girl with big green eyes that melts her heart. Never one to be denied what she really wants, Skeeter buys the first and steals the second. When sources lead Krac to the Lulu Belle, he finds more than he expects - a woman who fires his blood almost as much as she draws it. Krac’s hands and life are suddenly full to overflowing. He has to capture the woman who is driving him crazy, protect little Violet, and keep them all alive long enough to deliver one home and the other to his bed. There is more than Violet in danger, though. Someone has targeted Skeeter and the Lulu Belle and they are just as deadly as Krac. Can he protect the feisty firebrand that has captured his heart or will he lose the only thing he has ever cared about to another of his kind?",
  "genres": [
    "Science Fiction",
    "Romance",
    "Aliens",
    "Science Fiction Romance",
    "Fantasy",
    "Futuristic",
    "Paranormal Romance"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/18249936-krac-s-firebrand"
}