{
  "title": "The Psychopath Whisperer: The Science of Those Without Conscience",
  "description": "A compelling journey into the science and behavior of psychopaths, written by the leading scientist in the field of criminal psychopathy.We know of psychopaths from chilling headlines and stories in the news and movies—from Ted Bundy and John Wayne Gacy, to Hannibal Lecter and Dexter Morgan. As Dr. Kent Kiehl shows, psychopaths can be identified by a checklist of symptoms that includes pathological lying; lack of empathy, guilt, and remorse; grandiose sense of self-worth; manipulation; and failure to accept one’s actions. But why do psychopaths behave the way they do? Is it the result of their environment— how they were raised—or is there a genetic compo­nent to their lack of conscience?This is the question Kiehl, a protégé of famed psychopath researcher Dr. Robert Hare, was deter­mined to answer as he began his career twenty years ago. To aid in his quest to unravel the psy­chopathic mind, Kiehl created the first mobile functional MRI scanner to study psychopaths in prison populations. The brains of more than five hundred psychopaths and three thousand other offenders have been scanned by Kiehl’s labora­tory—the world’s largest forensic neuroscience repository of its kind. Over the course of The Psy­chopath Whisperer , we follow the scientific bread crumbs that Kiehl uncovered to show that the key brain structures that correspond with emotional engagement and reactions are diminished in psy­chopaths, offering new clues to how to predict and treat the disorder.In The Psychopath Whisperer , Kiehl describes in fascinating detail his years working with psy­chopaths and studying their thought processes— from the remorseless serial killers he meets with behind bars to children whose behavior and per­sonality traits exhibit the early warning signs of psychopathy.Less than 1 percent of the general population meets the criteria for psychopathy. But psycho­paths account for a vastly outsized proportion of violent crimes. And as Kiehl shows, many who aren’t psychopaths exhibit some of the behaviors and traits associated with the condition. What do you do if you discover your roommate, or boss, or the person you are dating has traits that define a psy­chopath? And what does having a diminished limbic region of the brain mean for how the legal system approaches crimes committed by psychopaths?A compelling narrative of cutting-edge science, The Psychopath Whisperer will open your eyes on a fascinating but little understood world, with startling implications for society, the law, and our personal lives.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Science",
    "True Crime",
    "Crime",
    "Mental Health",
    "Neuroscience"
  ],
  "author": "Kent A. Kiehl",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/18248486-the-psychopath-whisperer"
}