{
  "title": "Total Garbage: How We Can Fix Our Waste and Heal Our World",
  "description": "An investigative narrative that dives into the waste embedded in our daily lives—and shows how individuals and communities are making a real difference for health, prosperity, quality of life and the fight against climate change, by a Pulitzer Prize winning journalistWhat happens to our trash? Why are our oceans filling with plastic? Do we really waste 40 percent of our food 65 percent of our energy? Waste is truly our biggest problem, and solving our inherent trashiness can fix our economy, our energy costs, our traffic jams, and help slow climate change—all while making us healthier, happier and more prosperous. This story-driven and in-depth exploration of the pervasive yet hard-to-see wastefulness that permeates our daily lives illuminates the ways in which we've been duped into accepting absolutely insane levels of waste as normal . Total Garbage also tells the story of individuals and communities who are finding the way back from waste, and showing us that our choices truly matter and make a difference.Our big environmental challenges – climate, energy, plastic pollution, deforestation, toxic emissions—are often framed as problems too big for any one person to solve. Too big even for hope. But when viewed as symptoms of a single greater problem—the epic levels of trash and waste we produce daily--the way forward is clear. Waste is the one problem individuals can positively impact—and not just on the planet, but also on our wallets, our health, and national and energy security. The challenge is seeing our epic wastefulness clearly.Total Garbage will shine a light on the absurdity of the systems that all of us use daily and take for granted--and it will help both individuals and communities make meaningful changes toward better lives and a cleaner, greener world.",
  "genres": [
    "Nonfiction",
    "Environment",
    "Science",
    "Audiobook",
    "Science Nature",
    "Sustainability",
    "Nature"
  ],
  "author": "Edward Humes",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/182484409-total-garbage"
}