{
  "title": "Advanced Statistics in Research: Reading, Understanding, and Writing Up Data Analysis Results",
  "description": "Advanced Statistics in Reading, Understanding, and Writing Up Data Analysis Results is the simple, nontechnical introduction to the most complex multivariate statistics presented in empirical research articles. wwwStatsInResearch.com, is a companion website that provides free sample chapters, exercises, and PowerPoint slides for students and teachers. A free 600-item test bank is available to instructors. Advanced Statistics in Research does not show how to perform statistical procedures--it shows how to read , understand , and interpret them, as they are typically presented in journal articles and research reports. It demystifies the sophisticated statistics that stop most readers multiple regression, logistic regression, discriminant analysis, ANOVA, ANCOVA, MANOVA, factor analysis, path analysis, structural equation modeling, meta-analysis--and more. Advanced Statistics in Research assumes that you have never had a course in statistics. It begins at the beginning, with research design, central tendency, variability, z scores, and the normal curve. You will learn (or re-learn) the big-three results that are common to most statistical significance, confidence intervals, and effect size. Step-by-step, each chapter gently builds on earlier concepts. Matrix algebra is avoided, and complex topics are explained using simple, easy-to-understand examples . Need help writing up your results? Advanced Statistics in Research shows how data-analysis results can be summarized in text, tables, and figures according to APA format. You will see how to present the basics (e.g., means and standard deviations) as well as the advanced (e.g., factor patterns, post-hoc tests, path models, and more). Advanced Statistics in Research is appropriate as a textbook for graduate students and upper-level undergraduates (see supplementary materials at StatsInResearch.com). It also serves as a handy shelf reference for investigators and all consumers of research.",
  "genres": [],
  "author": "Larry Hatcher",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/18264364-advanced-statistics-in-research"
}