{
  "title": "King of Pain - The Descent",
  "description": "The King of Pain, \"The Descent\" is Volume One of the series, A Journey to Hell & Back Through the Mind's Eye. This is the haunting \"(and often disturbing)\" story of a nameless, faceless character caught in the grip of nihilism and horrific self-destruction.Once you open the first page and enter into his mind, you are sucked right into the horror and madness. You are invited into the character's twisted and tormented soul, where you'll experience evil and atrocities unspeakable. Always accompanied by his faithful Russian Blue cat \"\"Uncle Joey,\"\" they make their way through a maze or sordid characters, many who wish him only further destruction, while a select few are there to help him escape, including Father Corbin, a rogue priest with special spiritual insight and abilities.Encounter angels and demons, experience the end of the world and enter the character's soul, where he comes face-to-face with the ultimate archenemy. Will he make it out of his nightmarish world of insanity? Or will his enemies triumph and drag his soul to hell? That and much more in Volume 1 of The King of Pain, A Journey to Hell & Back Through The Mind's Eye - \"The Descent\"This is the story of physical and invisible torment; hell on earth and hell inside the soul; hell imagined and hell manifested in reality by the force of hatred and rage.This volume introduces a nameless, faceless character that calls himself The King of Pain. Comfortable in the horrid hideout known as Hell House, we see that he's trapped in a deadly web of self destruction at the hands of what he calls life-juice, powders and pebbles, the latter consumed via a crystal pipe he refers to as 'The Lady.'While initially he feels sly and in control, the lies, self-deception, evil deeds and debauchery prick his soul with relentless waves of guilt, remorse and shame. These, for their part, produce a deep hopelessness that breeds more putrid thoughts and emotions, all of which point toward inevitable destruction and eternal perdition. The increasing rage in his heart therefore becomes the 'fuel' he uses to create macabre 'theories' and horrific visions of murder and unbridled bloodshed.With \"'Uncle Joey, '\" at his side, he travels through the dregs of humanity and finds solace in all that is filthy and deplorable; the junkie ecosystem, a throng of parasitic people feeding off each other in that ominous Building #1, the abode of a certain old man named Ralphy, known by all as \"The Cockroach Prince.\"As the maze of characters gets more dangerous and some seek to destroy him, there are players behind the scenes that believe he can overcome, including his eccentric mother Marina, an unknown yet benevolent ghost, Father Corbin, an unconventional priest with unique spiritual abilities and insight, and Slade, the Indian Warrior who tries to introduce him to the purging ceremonies of his people.The character's only human support comes from friends like Jim, a half-white, half-Cherokee freight train of violence and frantic drug consumption; Martin, the chronically-addicted former mob boss and city overlord, and Jonathon, a newly-orphaned youth who has given up on life.But time is running out. As the character's self destruction breeds greater psychological suffering, the visions turn darker and more sinister; demonic apparitions appear in his Mind's Eye and even in tangible reality. He is catapulted into the center of his existence where he comes face to face with the ultimate archenemy.Sometimes Reality, Is The Hardest Thing to Face",
  "genres": [],
  "author": "Robert Dave Johnston",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18250700-king-of-pain---the-descent"
}