{
  "title": "Children of Paradise",
  "description": "In this beautifully imagined novel, based on the horrific true events at Jim Jones's utopian commune in Guyana, the acclaimed novelist, playwright and poet Fred D'Aguiar returns to the land of his youth, interweaving magical realism and shocking history into a story that resonates with love, faith, oppression, and sacrifice in which a mother and daughter attempt to break free with the help of an unlikely ally, an extraordinary gorillaThe commune was meant to shepherd them to Paradise. Joyce and her young daughter, Trina, have followed a charismatic preacher from California to the jungles of Guyana, along with nearly a thousand others of God's chosen people, where they have built a communist utopia based on a rigid order and unceasing loyalty. When Trina, playing too close to the cage holding the commune's pet gorilla, Adam, is attacked, everyone believes she has been killed. That night, the preacher dramatically \"revives\" her-an act that transforms Trina into a symbol of the commune's righteousness and its leader's extraordinary, God-like power.But Trina's resurrection is both a blessing and a curse for Joyce. Life in the compound has become precarious since she rejected the preacher's sexual advances. The danger has only grown since her skepticism of the commune's harsh mandates and punishments have become increasingly known. To save herself and Trina from the inevitable mass suicides that the commune has already begun to rehearse, she attempts a daring escape, aided by the local boat captain that loves her, and the most unlikely of prisoners-the extraordinary Adam.Told with a sweeping perspective in lush prose, shimmering with magic, and devastating in its clarity, Children of Paradise is a brilliant and evocative exploration of oppression-of both mind and body-and of the liberating power of storytelling.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Cults",
    "Religion",
    "Literary Fiction",
    "Crime",
    "Historical"
  ],
  "author": "Fred D'Aguiar",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/18263394-children-of-paradise"
}