{
  "title": "This Skin Was Once Mine and Other Disturbances",
  "description": "A brand-new collection of four intense, claustrophobic and terrifying horror tales from the Bram Stoker Award®-nominated and Splatterpunk Award-winning author of Things Have Gotten Worse Since We Last Spoke .Four devastating tales from a master of modern horror...This Skin Was Once MineWhen her father dies under mysterious circumstances, Jillian Finch finds herself grieving the man she idolized while struggling to feel comfortable in the childhood home she was sent away from nearly twenty years ago by her venomous mother. Then Jillian discovers a dark secret in her family's past--a secret that will threaten to undo everything she has ever known to be true about her beloved father and, more importantly, herself. It's only natural to hurt the things we love the most...Seedling A young man’s father calls him early in the morning to say that his mother has passed away. He arrives home to find his mother's body still in the house. Struggling to process what has happened he notices a small black wound appear on his wrist—the inside of the wound as black as onyx and as seemingly limitless as the cosmos. He is even more unsettled when he discovers his father is cursed with the same affliction. The young man becomes obsessed with his father’s new wounds, exploring the boundless insides and tethering himself to the black threads that curl from inside his poor father...PrickleTwo old men revive a cruel game with devastating consequences...All the Parts of You That Won't Easily BurnEnoch Leadbetter goes to buy a knife for his husband to use at a forthcoming dinner party. He encounters a strange shopkeeper who draws him into an intoxicating new obsession and sets him on a path towards mutilation and destruction...",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Queer",
    "Adult",
    "LGBT",
    "Audiobook"
  ],
  "author": "Eric LaRocca",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/182506465-this-skin-was-once-mine-and-other-disturbances"
}