{
  "title": "The Loremaster Legacy",
  "description": "In a distant future, there is a world on the fringes of human exploration, a planet that hangs in a doorway between universes. On Terran starmaps it is known as Ceril VII; to its residents it is Kulthea, the Shadow World.This is a barbaric world where magic competes against brute force of arms, where political intrigue can be found within every realm, and where warfare between neighbor countries is commonplace. A few fight against the chaos, led by the Loremasters. But there are other players: gods with very real powers for good and evil, and other beings—formidable wielders of magical and mental abilities. Among the latter are the mysterious Dragonlords, elder beings who can take the form of men. Meanwhile, other forces encourage a descent into darkness. Counted among these are the terrifying Priests and Messengers of the Iron Wind.Then there are the Navigators, who aid in travel and exploration across the treacherous planet. But some believe these guides really only seek the artifacts of the ancient Essaence Lords, the long-extinct race who predate the current inhabitants of this world. It is said that the Lords possessed magic far greater than the mightiest sorcerers of the current day… and something else: technology. Certain groups of the Elves have been experimenting with technology of their own, building mechanical devices and vehicles that fly in the air. Others call this meddling with machines to be dangerous blasphemy, and that it was the cause of the fall of the Essaence Lords. But perhaps the greatest threat of all to the Shadow World is the very energy that grants the gift of magic; the inhabitants call the manifestations of this the Flows of Essaence. When these flows build up to a critical point, they burst into storms that not only disrupt mundane weather and the powers of those using magic, but also rip open portals to other places and other planes, allowing unspeakable creatures to enter.This planet’s energy field seems unique in the galaxy, and it has drawn some attention from the Terran Empire. But, unaware of these outside observers, the Shadow World residents are facing their own crisis, and a looming disaster that may spill over to the galaxy beyond.Struggling to save their world are a few survivors of the ancient race, and a handful of young men and women just discovering their unusual gifts, and a heavy legacy laid upon them, the Legacy of the Loremasters.",
  "genres": [
    "Fantasy"
  ],
  "author": "Terry K. Amthor",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/18250139-the-loremaster-legacy"
}