{
  "title": "Meditation - Deep and Blissful (with Seven Guided Meditations): How to Still the Mind's Compulsive Thinking, Let Go of Upset, Tap Into the Juice and Meditate at a Whole New Level",
  "description": "This book comes with seven guided meditations as audio downloads — your free gift with purchase! Details inside.Newcomer or Experienced Meditator? This book is designed for both. For the newcomer, it has practical guidelines with everything you need to know, as well as a comprehensive selection of excellent techniques to choose from (along with step-by-step instructions). You'll come away with techniques you love and that really work for you.For anyone who’s tried meditation and found the experience disappointing — nothing was happening or your mind just wouldn’t stop — this book gives you powerful insights into the reasons why people can become frustrated and discouraged, the obstacles to moving into higher states, and shows you how to navigate your way through. Even the long-seasoned meditator will come away with new realizations and techniques.The Three EssentialsThere are three essentials to really rich, deep, satisfying meditation. Understanding these paves the way for you to move into deeper, more blissful meditative states.Essential #1 - Understanding the MindOne of the obstacles we face in meditation is the endless stream of thoughts and words, that voice in our head that likes to talk (and talk), our tireless companion, the mind. Once you understand how the mind operates — what it’s trying to accomplish and why it keeps switching on during your meditation — you're better able to put it on standby and move into deeper states.Essential #2 - Understanding Emotion In meditation, what's alive in you is what comes up — including any problems you're facing and your feelings about them. This book shows you how to work with charged emotion, how to bring it into the light of awareness, within the container of meditation, and be with it in such a way that it dissolves on its own. This not only feels good — it's such a welcomed relief — but it leaves you serene and centered — in the perfect place for meditation.Essential #3 - The Right Techniques (for You)Sometimes, if you're having problems meditating — if your experience in meditation is shallow or scattery — it's not you, it's your technique. As a unique individual, certain meditation techniques will resonate with you — meaning they'll really work — while others may not. This book gives you a comprehensive selection of excellent techniques such that by the time you finish the book, you’ll have a set of techniques — your personal playlist, your custom program — that you love and that really work for you.With techniques that work for you and the insight necessary to work with the mind and emotions, you have the essentials you need to really tap into the juice (more on that later) and enjoy truly beautiful, deep and blissful meditation.",
  "genres": [
    "Self Help",
    "Nonfiction"
  ],
  "author": "Sharon Rose Summers",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/18251006-meditation---deep-and-blissful-with-seven-guided-meditations"
}