{
  "title": "Salazar",
  "description": "‘Combines the appeal of a colourful and fresh lead character with an intriguing Parisian setting at a fascinating moment in time. A promising debut.’Chris Ewan, author of Safe House and Dead Line‘An intelligent, moody novel, brimming over with well-drawn characters and unexpected insights. But more than anything else, Lynch gives us a Paris that feels real; his knowledge of the city in that particular time is staggeringly evocative, and makes Salazar an exceptional novel.’Heath Lowrance, author of City of Heretics and The Bastard Hand‘Superbly evoking the atmosphere of 1930s Paris, Salazar is a taut and engaging mystery novel from a great new writer. Lynch has created a classic anti-hero. Still carrying the scars of war, he’s the kind of man driven to do the right thing, regardless of the cost to himself in this engrossing debut novel.’Nick Quantrill, author of Broken Dreams and The Late Greats‘An absorbing twist on the hardboiled detective. Lynch has invented a whole new Paris-noir in the dissolute 1930s.’Gary Corby, author of The Pericles Commission and The Ionia SanctionParis. 1930. An English detective haunted by his experiences of the Great War, Salazar wiles away the days playing chess and taking on as little work as possible. When the alluring Marie Poncelet hires him to find a missing man, Gustave Marty, it's a case he'll soon wish he'd refused.Because finding a missing man isn't anything like finding a man who doesn't want to be found. And Gustave Marty has covered his tracks with a smokescreen that will push Salazar beyond the limits of physical endurance and to the edge of insanity.As he's drawn ever deeper into the shadowy underbelly of the City of Light, Salazar's closed, structured world is blown apart by the arrival of a friend from his pre-war youth, the beautiful Megan Fitzwilliam, whose tenderness and love of life is a stark contrast to the brutal violence that lies within him.When that violence threatens to engulf them both, Salazar must seek redemption or lose that which has finally made his life worth living.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Crime",
    "Fiction"
  ],
  "author": "Seth Lynch",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18269424-salazar"
}