{
  "title": "An Alcoholic Husband - a Story of Love and Hope. The extraordinary true story of one woman's journey, married to a loveable rogue",
  "description": "http://www.amazon.com/dp/B007OHZFX4NOTE: This Book is an alternate cover edition of ASIN B007OHZFX4 How do you live with an alcoholic husband or partner?That was the question I asked myself when I realised that the man I'd married was an alcoholic. I'd had no previous exerience of alcoholism, and had no idea how debilitating it can be, not only for the alcoholic, but for anyone who has to live with him (or her). I should have had a stable, normal, and possibly boring life. So how did it all go so wrong? I decided to write my story for my own benefit, but then I thought that there could be others out there who also have an alcoholic in their life who is causing them a great deal of heartache, and they might benefit from reading my story, so I decided to publish it. I shed a lot of tears as I re-lived the heartache and turmoil of my \"previous life\", which started when I met Jo, a charismatic, recovering alcoholic and drug addict, who wasn't really recovering at all. I married him without my parents knowing, despite the fact that I was a well educated, intelligent young woman who should have known better. This is the story of our 7 years together, and how, after years of living in fear, and being dragged all round the country, I finally managed \"My Great Escape\". A trip that took myself and my 3 young daughters, including a babe in arms, on a journey from one side of Australia to the other, just to be free of him. This is also a story of how I managed to survive the 7 years, living with an alcoholic who was often violent, and come out of it relatively normal and unscathed. It tells of the emotional roller coaster ride of being torn between trying to help the person you love get better, and looking after yourself and your children. And the huge dilemma of whether you should stay or go. This book offers hope for anyone who's in a similar situation, or knows someone who is, because it is possible to survive if you're married to an alcoholic - I know, because I did. I'm sure you'll enjoy my story. You may get frustrated in parts, wondering why I kept on going back, and you'll probably feel like shaking me, but I did what I believed I needed to do at the time, so please excuse me for that. I hope that you'll be encouraged by reading this story, especially if you're living with an alcoholic or an abusive partner.",
  "genres": [],
  "author": "Carol Mills",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/18270773-an-alcoholic-husband---a-story-of-love-and-hope-the-extraordinary-true"
}