{
  "title": "Snow-Kissed",
  "description": "Romantic Times calls Laura Florand's writing \"sensuous and sumptuous\", awarding her their Seal of Excellence, and NPR says it's \"explosive, sensual . . . and utterly sweet\".Now the internationally bestselling author of The Chocolate Thief takes us to a snow-kissed Christmas cabin for this heart-wrenching tale of love, loss, forgiveness—and hope.Voted the Biggest Tearjerker of the Year in the annual AAR reader poll (you were warned). Named one of the best books of 2013 by Dear Author and Romance Novels for Feminists. DABWAHA nominee (Dear Author Bitchery Writing Award for Hellagood Authors).Once they had been the happiest couple in the world. Once serious, restrained Kurt had fallen hard for a laughing, easy-going woman who filled their lives with joy.But when loss struck them, Kai went down under the avalanche of grief. She threw their marriage away, and she left him, fleeing the world for this cabin high in the mountains.Now, as the two find themselves snowbound over Christmas, Kurt has to convince his wife that while she may have lost everything else, she never lost him. Now he has to show her the true strength of one man’s love.Praise for Laura Florand and her novels“Emotionally intense.” – Publishers Weekly starred review \"Gorgeous, brave, heart-breakingly beautiful, and written with astonishing insights into grief.\" -- Ruthie Knox, USA Today bestselling author“So romantic and sexy.” – USAToday.com“Sensuous and sumptuous.” – RT Book Reviews Seal of Excellence“Explosive, sensual . . . and utterly sweet.” – NPR“Gorgeously written, in that way that sort of creeps through my entire body and makes me shiver with delight.” – Dear Author\"I love, love Laura Florand's writing! Deeply emotional, delightfully sensual, deliciously sumptuous. Give yourself a treat and buy this book.\" -- Virginia Kantra, NYT bestselling author",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Novella",
    "Adult",
    "Christmas",
    "Holiday"
  ],
  "author": "Laura Florand",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/18269829-snow-kissed"
}