{
  "title": "Few Are Chosen",
  "description": "Readers of science fiction dystopia comedy books who also like portal fantasy, with aspects of found family will (hopefully) enjoy the dry sarcastic humour and satire of this series. There are dark sections and some gallows humour, but this is, for the most part, a light sci fi, hope punk, novel. A man chosen by destiny. The wrong man. Meet The Pan of coward, unwilling adventurer and, by some miracle, K’Barth’s longest surviving outlaw. He just wants a quiet life so working as getaway driver is probably a bad career move. Then he falls in love at first sight with a woman he hasn't even met who comes from an alternative reality. That’s when things really begin to get complicated. Meet Ruth she’s the Chosen One, destined to play a pivotal role in saving K’Barth from a cruel dictator. She’s never heard of K’Barth, though. She’s a public relations executive from London and she’s totally unaware of the chaos about to hit her life. Meet Lord power hungry psychopath on the brink of world domination. He wants to cement his hold on K'Barth by kidnapping the Chosen One and forcing her to marry him. Only one person is standing in his someone who doesn’t even realise it, The Pan of Hamgee. For The Pan, and Ruth, that’s a deadly problem. Few Are Chosen is the first book in a complete, finished series ; the K'Barthan Series, comprising four dystopian humorous science fiction books. It is set in a contemporary dystopia, in a parallel reality but there is some futuristic technology. This book ends in a cliff hanger and for full enjoyment readers are strongly advised to read the series in order, continuing the story with The Wrong Stuff, K'Barthan Part 2 (green cover) after reading this one. If cliffhangers really do your nut, it might be worth buying the box set for the single, really long book experience. A quick word with the Q - What made you write this series?A – If you want the honest answer I wrote it for me. As a reader, I love British satire and humor (or humour). I love wit; funny epic fantasy series like the Discworld novels and comedic sci fi like Douglas Adams. I like sff and speculative fiction, I like adventure and action and a gripping tale that zips along quickly, I like genre mash ups and I love an angsty dystopian world. However, the best science fiction and fantasy stories, for me, are funny. I aim to write comedy in the tradition of all the great humorous British authors. I like to aim high. I wanted protagonists people could love and empathise with, mavericks, misfit characters, real people ... except they're not all people obviously, some of them are other alien (ish) species. This book is about misfit heroes and heroines winning the day, it’s about good versus evil even when the good guys are on different sides. It's dystopian science fiction fantasy action - it's dystopia but it's comedy, it's sci-fi but it's planet-based. You'll find all sorts of quirky characters and interesting alien from 6ft Swamp Things with antennae to cute furry creatures like the Blurpons, with their fluffy ears, big button eyes and penchant for extreme violence. Q - Should the books be read in order?A - Yes otherwise the character development – and some of the technology – will make less sense! This is how they go.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Humor",
    "Speculative Fiction",
    "Young Adult"
  ],
  "author": "M.T. McGuire",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/10109634-few-are-chosen"
}