{
  "title": "Body of Jewels: The Story of a Genie, a Cult, and a Forbidden Love",
  "description": "In a world shrouded in darkness and deceit, Alex, a fiercely independent and solitary soul, discovers that even he can't escape the tangled webs of fate and desire. When his enigmatic sparring partner, Claudia, vanishes without a trace, he is thrust into a dangerous game of shadows, uncovering a sinister his own father, Cornelius, is the puppet master behind her disappearance.Driven by a reluctant friendship that had begun to blossom against all odds, Alex embarks on a perilous quest to save Claudia. Desperate and determined, he steals the magical genie Layla from his father's grasp, hoping her mystical powers can aid him in his search for answers. But Layla has her own agenda—she yearns for the day when she can fulfill Alex's three wishes and finally be free from the shackles of her servitude.As their reluctant alliance deepens, Alex grapples with conflicting emotions. Will he accept Layla's assistance, risking the vulnerability of relying on another? Can he trust her enough to navigate the treacherous path ahead and uncover the truth that lies in the heart of his father's cult? With each passing moment, their relationship grows, and the lines between duty, desire, and destiny blur.Haunted by the looming prospect of losing Layla once her obligations are fulfilled, Alex confronts his deepest fears and grapples with the choices that will shape their shared future. Their relationship teeters on a knife's edge as they navigate treacherous paths, facing their insecurities and the imminent dangers that threaten to tear them apart. In this enthralling tale of fantasy, romance, and suspense, Alex and Layla must unravel secrets, defy darkness, and save Claudia, while ultimately discovering the true power of trust, love, and sacrifice.",
  "genres": [
    "Fantasy"
  ],
  "author": "Abby McCormick",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/182655148-body-of-jewels"
}