{
  "title": "Great Catherine: The Life of Catherine the Great, Empress of Russia",
  "description": "From the moment the fourteen-year-old Princess Sophia of Anhalt-Zerbst agreed to marry the heir to the Russian throne, she was mired in a quicksand of intrigue. Precociously intelligent, self-confident, and attractive but with a stubborn, wayward streak, Sophia withstood a degree of emotional battering that would have broken a weaker spirit until at last she emerged, triumphant over her many enemies, as Empress Catherine II of Russia. Her achievements as empress were prodigious. She brought vast new lands under Russian rule. She raised the prestige of Russia in Europe. She began the process of imposing legal and political order on the chaos she inherited from her predecessors. Yet few historical figures have been so enthusiastically vilified as Catherine the Great. Whispers that she had ordered her husband's murder grew to murmurs that she was an immoral woman and finally to shouts that she was a depraved, lust-crazed nymphomaniac. With deft mastery of historical narrative and an unsurpassed ability to make the past live again, Carolly Erickson uncovers the real woman behind the tarnished image―an indomitable, feisty, often visionary ruler who, in an age of caveats and constraints, blithely went her own way. Great Catherine reveals the complexities of this great ruler's nature, her craving for love, her insecurities, the inevitable sorrows and disappointments of a strong empress who dared not share her power with any man yet longed to be led and guided by a loving consort. Great Catherine is a fresh portrait of an infamous historical figure, one that reveals how Catherine's flawed triumph guaranteed her posthumous fame and enhanced the might and renown of Russia for generations to come.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Russia",
    "Historical",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Carolly Erickson",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/182682.Great_Catherine"
}