{
  "title": "The Seventh Season",
  "description": "THE WORD OF GOD AGAINST THE WILL OF ROMEIn 67AD, the adventurous young scribe of one of the Apostles flees the siege of Caesarea on a ship sailing for Greece. He is bound by oath to protect the Word of his master, no matter what fate, pirates or the gods of Olympus have in store for him.Onboard, Johanan meets two people who will change his life and the course of history. The first is a Roman General appointed to organize the Olympic Games at which the Emperor Nero will compete. The second is Dido, an enigmatic young woman from Alexandria who is carrying a cargo of secrets. To uncover the truth about her violent past, Johanan must first prove himself worthy of her trust.The Seventh Season takes readers on a thrilling journey through the ancient world, and fans of Robert Graves and Mary Renault will get swept up in this epic adventure. In his commentary, Kit Hudson calls The Seventh Season ‘…a remarkable adventure story in the classic tradition with heroes, emperors and the obligatory sibyl all playing their part. This story shares as much with Herodotus and Homer as it does with the New Testament…’ The word of God...Set against the backdrop of The Jewish War (66-70AD), The Seventh Season illuminates the beginnings of Christianity and explores the origins of some of the greatest teachings in biblical history.The will of Rome...Johanan’s epic sea voyage ends in Corinth where Nero is conducting his infamous tour of Greece. When the Emperor decrees that the dangerous new religion must be extinguised, Johanan faces the greatest challenge of his life.The fight for love...Dido and Johanan share a hatred of Rome and she becomes something of a fantasy to him. But while his thoughts are filled with idle romance her heart is set on revenge against Nero, forcing Johanan to choose between destroying Rome... or defending the Word.",
  "genres": [
    "Historical Fiction",
    "Christian Fiction"
  ],
  "author": "Emmanuel of Samaria",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/18271049-the-seventh-season"
}