{
  "title": "Bumpy Roads",
  "description": "Librarian note: This is an alternate cover edition for ASIN B00E88U03M.Hurrying to the old bridge that crossed Yellow Creek, Courtney stepped to the side as a car came up behind her. The bridge was only wide enough for one car and even foot traffic had to climb up on the narrow ledge for safety. The car slowed and the driver’s side window rolled down. A familiar face greeted Courtney.“Hey, Courtney, how about a ride?” he asked.She shook her head. “No, thanks, I’m good,” she said. “It’s only a few more blocks.”The driver looked up to the sky. “You won’t make it before the storm hits,” he argued. “Come on, I’ll feel guilty all night if I leave you here.”She smiled. “Okay, if you put it that way,” she agreed, jogging over to the passenger side of the car and letting herself in.The door lock clicked as she buckled her seatbelt and she looked up in surprise. “It does that automatically,” the driver said with an apologetic shrug.Courtney scooted against the door and grasped the handle. “You know, I think I’ll just walk anyway,” she said, pulling against the handle.But the door didn’t open. She tried it again, but it was still locked tight.“Child locks,” the driver said, a smile on his face. “You can’t get out until I let you out.”She pressed the window button, but it also stayed in place. “Listen, I don’t want to be in this car,” she said firmly. “Now please let me out or I’m going to scream.”He chuckled softly, leaned forward and placed his hand against her cheek, rubbing it intimately. “If you scream, no one will hear you,” he said, as he slipped his hand down to her neck. “But you can do it if you like. I always love to hear a girl’s scream.”For ten years, young girls have been disappearing from the streets of Freeport and the surrounding towns. Can Mary solve the mystery before Clarissa is the next victim?",
  "genres": [
    "Paranormal",
    "Mystery",
    "Romance",
    "Ghosts",
    "Fiction",
    "Paranormal Romance",
    "Cozy Mystery"
  ],
  "author": "Terri Reid",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/18271313-bumpy-roads"
}