{
  "title": "Her First Submission",
  "description": "Kathryn is just an ordinary young woman, trapped in a dead end job waiting tables at a low-rent strip club, saddled with college debt and a useless bachelor's degree in philosophy. When a sleazy acquaintance from her past comes back into the picture Kathryn finds herself recruited by a high end BDSM club, a den of iniquity the likes of which she's never seen. Appalled and intrigued in equal measure, Kathryn takes the job on one condition: that she will never take part in the... activities. It's only when a handsome, mysterious and wealthy client appears with an offer she can't refuse, an offer that could free her from all her troubles, that she decides to break her own most sacred rule and delve into the dark, alluring world of submission and domination. There she discovers the delicious and terrifying attraction of abandoning control to her Master...Her First Submission includes BDSM, anal sex, spanking, oral sex, light bondage and elements of reluctant consent as part of a Dominant/submissive relationship.Excerpt:\"Yes, Master,\" she purred, savoring the tight little shiver between her legs. Just uttering the word made her pussy clench, and she realized the anger was all but gone. In its place was a strange sense of anticipation; a delicious but unnerving sense of inevitability. It was too late to back out now, she thought, and with that acceptance of the situation came an unexpected benefit. She was actually looking forward to sleeping with the man calmly surveying her body. Master must have noticed something in the way her body moved as she spoke. Standing behind her he reached down, hooked his fingers beneath Kathryn's tight latex skirt and ran his fingertips along the puffy, moist lips of her pussy. She gasped lightly at his touch, and pressed herself toward his hand. \"You're already wet, Kathryn. Can you tell me what arouses you?\" His fingers dipped between her lips, slipping deep inside, and when he removed them he held his glistening hand inches from Kathryn's face. She could smell her sweet juice on him, and had to fight a sudden urge to lick his fingers clean. \"It's your name, Master.\" her voice shuddered a little as she spoke. \"I can't explain it, but when I say the word I feel a little... buzz, I guess. Like you're holding a vibrator to my clit. I... I kinda like it.\"Master smiled. \"That's good, Kathryn. It makes me happy to see your pussy get so wet for me. Many girls enjoy addressing their dominants by an honorary title. It tends to help them release control of the situation and enjoy it on a deeper level. I think you'll find this is just the first of many new things you'll learn about yourself tonight. Lick.\"Kathryn bowed her head forward and delicately ran her tongue over Master's fingers. They tasted incredible. As long as she could remember she'd been fascinated by the taste of her own pussy. Whenever she played with herself she always coated her fingers with her own honey and drew it across her lips, and the opportunity to do the same with the fingers of a strong, beautiful man drove her crazy. There was more, though. She realized her arousal stemmed from the order itself. He told her to do something, and she did it. A tight little pulse of warmth deep within her whispered this new, delightful discovery: it's so simple. You can abandon control. You can enjoy his commands. Give in to his will.",
  "genres": [
    "BDSM",
    "Erotica",
    "Adult",
    "Romance",
    "Short Stories"
  ],
  "author": "Aya Fukunishi",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/18272489-her-first-submission"
}