{
  "title": "Bound by a Red Thread",
  "description": "Dear Author,Do you see this guy? He’s The Worst. Truly. Literally. He’s a hot jock, yeah, but he’s also a bully. A very, very terrible bully. He calls non-jock guys fairies. He kicks students. He yells at teachers. He even beat his ex-girlfriend. He’s about to get expelled. He’s about to get kicked from the football team. He’s a school enemy, hell, even every kid’s enemy. He’s the most useless specimen I’ve ever seen.His notoriety is widespread. Many bad rumors circulate around him. Mostly bad— the rest just seem like a sick joke gone overboard. The most sickening rumor about him is that he’s actually being sold by his own father as a prostitute. I mean, cliché much, right?But then one night when I was on my way back from a sneaky yet steamy rendezvous with my friend (with benefits, of course), I saw him in a narrow alley near a red-light district. With some man’s cock in his mouth, no less! And whoa, if he wasn’t skilled. I was glued in my spot until he was done— I even forgot to hide myself. What surprised me was that he got some big money for it! So the rumor that he was a prostitute was true, after all?But then, after the man was gone, I saw him spit on the ground with clear distaste on his face. And then our eyes met! In that instant I could see his pained, sad anger as clear as an aquarium. And just in that fleeting moment, the red string had tied me.What do you think I should do? What do you think he would do to me? Should I stay away? Or should I be one of those mainstream heroes, destined to be with him? Oh God, please not the latter. I’m sane, gay, and ordinary enough to be a hero for a problematic school jerk. Well… but maybe a blowjob like that could make me reconsider… if his fist didn’t get me first.Photo Description: A young man, around nineteen, leans against a brick wall, wearing a red, sleeveless, half-zip hoodie with the hood up and the zipper pulled down. His arms are crossed, and his arm muscles are large. His face is tilted slightly towards the camera, with an unreadable look in his eyes that goes with the blank set of his face.This story was written as a part of the M/M Romance Group's \"Love Has No Boundaries\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Short Stories",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Young Adult"
  ],
  "author": "Ann   Anderson",
  "average_rating": "2.93",
  "url": "https://www.goodreads.com/book/show/18272118-bound-by-a-red-thread"
}