{
  "title": "Cowboy 6 Pack",
  "description": "Six Smokin’ Hot Cowboy Novels by Six of Today’s Hottest Cowboy AuthorsCOWBOY HEAT (Hell Yeah! #1) by Sable HunterAron McCoy has sworn off women - except for sex. When Libby Fontaine arrives at Aron's Tebow Ranch, she is determined to cram a lifetime of living into a few short months. The doctor has told her she can't count on her remission from leukemia being a permanent one. Their attraction to one another is instantaneous and overwhelming. But when Aron finds out Libby is innocent - he backs off. He has nothing to offer a girl who deserves white lace and promises. Then Aron catches Libby pleasuring herself in his stock tank and hears her cry out his name - and the heat is on.COWBOY JACKPOT: CHRISTMAS (Cowboy Jackpot #1) by Randi AlexanderAward Winning Novella: A lucky first kiss in front of a Las Vegas slot machine pays off big for bull rider Boone Hancock and college student Gigi Colberg-Staub. An intense attraction develops, they spend a hot night in each other’s arms, but a mistaken communication sends Gigi storming out of Boone’s life. He recognizes his deep feelings for her, but is it too late to win her back?HER FATED COWBOY (Harland County #1) by Donna MichaelsUnruly cowboys and the women who tame them. Widower and software CEO, Cole McCall fills his days with computer codes and his free time working the family’s cattle ranch. Blaming himself for his wife’s death, he’s become hard and bitter. When L.A. cop Jordan Masters Ryan, his visiting former neighbor, sets out to delete the firewall around his heart, he discovers there’s no protection against the Jordan virus. Though she understands his pain and reawakens his soul, will it be enough for Cole to overcome his past and embrace their fated hearts?RIDE OF HER LIFE (Buckle Bunnies #1) by Paige TylerThis ride lasts a lot longer than eight seconds.Barrel rider Daisy Hollins has run into bronc riders Sawyer Jones and Beau Monroe quite a few times on the rodeo circuit. She’s flirted with them, but things have never gone any further than that. However, when she runs into the two hot cowboys in the hotel bar at the Rodeo Finals in Las Vegas, there’s a different vibe in the air. When the flirting starts this time, it doesn't stop, and Daisy goes upstairs with both of them for a completely different kind of rodeo ride.SEX ED COWBOY STYLE (Ugly Stick Saloon #1) by Myla JacksonKendall's 21, legal and ready to be more than friends with cowboy Ed Judson. To get his attention, she asks him to show her what makes a cowboy hot. Ed promised Kendall's brother he'd keep an eye on his little sister. Ed's certain Sex Education lessons aren't what big brother had in mind. He struggles to keep his word, while giving Kendall what she wants—Sex Ed.COWBOY UP (Sweet Shop #1) by Melissa SchroederLinda Wheeler is back in her little hometown after leaving Dallas flat broke. Her only choice is to work on the dude ranch she co-owns with her old crush Nicodemus McCabe. Nic had always tried to ignore his attraction to Linda but it is getting harder by the minute. Fudge and shared erotic dreams dissolve the barriers, but will they be able to take a chance on love or will old prejudices and fears cause them to lose everything?",
  "genres": [
    "Romance",
    "Anthologies",
    "Westerns",
    "Contemporary Romance",
    "Adult",
    "Erotica"
  ],
  "author": "Randi Alexander",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/18271665-cowboy-6-pack"
}