{
  "title": "The Sleepy Teen Cheerleader",
  "description": "Stefan is a foreign exchange student who has hit the jackpot. His host family includes eighteen year old Tasha, pretty blonde cheerleader and the hottest girl in school. After Stefan discovers just how heavy a sleeper Tasha is he can't help but take advantage of the passed out teen. One night, when his host parents are out on a date, he slips into the schoolgirl's room with impure thoughts on his mind. Just how far will he dare to go with the unconscious girl and does the sleeping beauty have a surprise for Stefan?WARNING: This 4800 word story contains explicit sexual references, oral sex, dubious consent, sleep sex, somnophilia themes and enough sleepy orgasms to blow your mind!Excerpt: \"...My fingers felt the edge of her blanket and slipped underneath, across the smooth clean cotton of her sheets. My hand reached the upper surface of her mattress and paused again, feeling the hotter air under her covers, heated by her body. Soon I would be past the point of no return but I was powerless to stop myself by this stage, I had to explore her body.Pushing forward my fingers felt bare flesh under the blanket and I snatched my hand back slightly, fighting a sudden panic that arose. It was her arm, I had just touched her bare arm. My heart eventually stopped pounding in my ears when she made no movement at all. I moved my hand back towards her, lifting it slightly to avoid touching her bare skin lest it tickle her or something.Just past and above her arm my fingers came into contact with the material of her shirt and I felt the warm surface rising and falling in time with her sleeping breaths. I traced my fingers upwards and felt the gentle rising of the shirt where her breasts strained against it. My cock was rock hard in my pants with the knowledge that I had my fingers on the fleshy tit of the hottest girl in school...\"",
  "genres": [
    "Erotica",
    "Short Stories"
  ],
  "author": "Scarlett Skyes",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/18273202-the-sleepy-teen-cheerleader"
}