{
  "title": "Silent No More",
  "description": "Updated cover edition found here.She thought silence was her best option...until the past threatened to ruin her future.Shannon Taylor has it all: great friends, her dream career, a loving fiancé, and a best friend that's like the sister she never had. Life couldn’t get any better—or so she thought. Just when you think you have it all, add in a little betrayal and a few lies and you have the perfect mixture for a storm, strong enough to send you spiraling into a life full of unknowns—or could that have been the point? When traveling down the wrong path sometimes we need to be blown into a different direction. Now unsure of everything she had planned for herself, Shannon is on a mission to forget, but what she isn’t expecting to run into is the arrogant, womanizing, control freak that clearly thinks he’s a gift to all women. That may be for most women, but not this one. Meet Nicholas Lockhart. He’s sexy, domineering, and has a temper that is easily triggered, but those things are a must when in the business environment that he is. To be successful means to be the best, the alpha, controlling all others. Meeting a woman who can turn his world upside down is not in the cards, not part of the plan. Why have one woman when there are so many appetizing ones to taste? A renowned eligible bachelor is the person he likes to be, that is until the defiant, redhead turns his head and puts him in his place. Their quick and intense passion takes them both by surprise, eliciting a relationship neither expected. When her past collides with her present, Shannon is forced to confront it head on, tangling her in a web of lies and twisted truths that soon leave both bare and vulnerable. Sometimes the only option is to be silent no more…",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Abuse",
    "Suspense"
  ],
  "author": "N.E. Henderson",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/18271328-silent-no-more"
}