{
  "title": "Glimmer in the Shadow",
  "description": "The city of Cuthaine burns, the smoke rises into the night sky as carrion crows fly in to feast on the corpses. Malbeck’s army marches towards the city of Finarth, the shadow of the Forsworn in its wake, suffocating anything of light under its cowl of death and destruction. \tA gathering of heroes has begun, brought together to combat this mighty force, which if not stopped, will continue its path of destruction, blanketing the lands of Kraawn in darkness.  Tuvallis, once a soldier, now a mountain man hiding from his past, finds himself on a path to redemption where his sword, and courage, will face the menacing threat.  Hagar the ogrillion, half-orc and half-ogre, follows his heart, soon finding himself entrenched in war, fighting not just the evil that he hates, but also the very nature and prejudices towards what he is, bearing all the way a mantle of courage and hope rarely found in men, let alone his race. Allindrian the half-elf blade singer, Fil Tanray, soldier of Finarth, Kiln, the legendary swordsman and commander of the Finarthian army, and many others, join their steel and magic with the remaining might of the free world that has converged on Finarth, the place where they will make the stand against the Dark One.  Jonas Kanrene, cavalier to Shyann, completed his first mission, but at what cost? Men and women died along the way, but King Kromm, of Tarsis, and his family, was plucked from Malbeck’s clawed fist and brought to Finarth, the place where they will make their stand against the darkness of the Forsworn. Jonas himself must face an internal threat of such magnitude that it either kills him, or changes him forever.  The pounding of orc boots echo off the walls of Finarth as sixty thousand howling monsters stand before the city walls. Heroes’ gather, knights and soldiers prepare for war, ordinary farmers lift pitted swords dusty from idleness. But will it be enough to face the might of the Forsworn and their general, the one who carries the Sham Cemar, the ancient elven book of magic?  The people’s hope lies in the gathering of heroes. A gathering, whose combined courage and strength must be enough to defeat the Dark One. If not, then all is lost.",
  "genres": [
    "Fantasy"
  ],
  "author": "Jason L. McWhirter",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18275557-glimmer-in-the-shadow"
}