{
  "title": ": الطبعة العربية لكتاب: عالم المادة.. وعلاقته بالسلعة النهائية",
  "description": "في الوقت الذي يصارع فيه العالم ارتفاع أسعار الغذاء والطاقة وتغير المناخ، يقدم كتاب عالم المادة نظرة عميقة لبعض العوامل المساهمة التي تقف خلف هذه التحديات. وقد أضـــاف ظهور مستهلكين جدد في الصين، والهند، وروسيا، والشرق الأوسط منافسة شرسة أخرى على الموارد الطبيعية حتى أصبحت أمرًا واقعًا لدى العالم المتقدم. ونظرًا لأن كل شيء نستهلكه يشتمل على استخدام المعادن أو الطاقة أو الزراعة، فقد أصبحت \"أساليب حياتنا\" التي تستخدم التقنيات العالية أكثر اعتمادًا على الإمداد الكافي بتلك المواد الخام التي نحصل عليها من كوكب الأرض، ونقوم باستخدامها لكي نجعل حياتنا أكثر راحة أو أكثر إنتاجية أو أكثر سهولة في إدارتها. وقد أدى تأثير زيادة الطلب العالمي على السلع إلى ارتفاع أسعار المواد الخام بداية من البترول، والنحاس وانتهاء بالذرة، والقمح؛ مما أجبر المستهلكين على الإنفاق بشكل أكبر من أجل الحصول على الكثير من\"ضروريات\" الحياة، من رغيف الخبز إلى فواتير الكهرباء. ومنذ انتشار هذا الانتعاش في السلع، انتقلت الموضوعات الخاصة بالسلع من الصفحات الأخيرة إلى الصفحات الأولى من الصحف مع المزيد والمزيد من المقالات التي تقدم بيانات حول أسعار الغذاء والطاقة، والتحذيرات من التغير الرهيب في المناخ، واحتياطي الطاقة، واحتياجات الصين إلى المزيد من المواد الخام. ولا تعد هذه الفترة من ارتفاع أسعار النفط والغذاء مرحلة عابرة؛ حيث وصل الإمداد بالكثير من الموارد الطبيعية الرئيسية إلى الحد الأقصى بغض النظر عن تكاليفها الحقيقية. ويرسم كتاب عالم المادة ملامح العلاقة بين المواد الخام والمستهلك، ويظهر كيف أنها ترتبط بكل شخص، وبكل يوم: الآن وأكثر كثيرًا من أي وقت مضى منذ الهزة الأخيرة غير المسبوقة في أسعار النفط منذ ثلاثة عقود تقريبًا. وبنظرة خاصة وعميقة نحو هذا الانتعاش ‘النادر’، يعرض هذا الكتاب كيف أن زيادة قيمة السلع تؤثر على المستهلكين والمستثمرين، بأساليب نحن في بداية طريقنا لفهمها. المؤلف في سطور عمل كيفين موريسون Kevin Morrison عمل صحفيًا لمدة 17 عاماً، في صحيفة فاينانشيال تايمز Financial Times، ووكالة رويترز Reuters، وصحيفة سيدني مورنينج هيرالد Sydney Morning Herald، والآن يعمل مع أرجوس ميديا Argus Media، إلى جانب مساهمته في بعض أعمـال النشـر مثل موقع BaseMetals.com (وهو موقع يقدم كل ما يتعلق بالمعادن الرئيسية من أخبار وتقـارير إلى جانب أسعارها في السوق). وخلال تلك الفترة، قام بالتغطية الإعلامية لبزوغ نجم الشركات المعتمدة على الانترنت وأفوله. وقضـي معظم هذا العقد في الكتابة عن رواج السلع العالمية، وعن نشوء قطاع تجارة انبعاث غاز الكربون (وهو مدخل إداري يستخدم للتحكم في التلوث عن طريق تقديم حوافز اقتصادية للشركات مقابل محاولات التقليل من انبعاثات الملوثات) بصحيفة فاينانشيال تايمز في لندن وأرجوس. وأثناء هذا العقد سافر موريسون حول العالم للقاء المزارعين، وعمال المناجم، ووزراء النفط، والخبراء الماليين، وعلماء البيئة، والمحامين، والمستشارين السياسيين. وتعكس موضوعات هذا الكتاب خبراته خلال هذه الفترة، التي عبرت أثناءها السلع الحدود إلى رحابة العالم أجمع.",
  "genres": [],
  "author": "كيفين موريسون",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18275838"
}