{
  "title": ": الولايات المتحدة الامريكية فى الألفية الثالثة",
  "description": "يمثِّل مؤلفا هذا الكتاب جون سي. كورنبلم ودايتر كرونزوكر صوتين أطلسيين يجريان حوارًا مزدوجًا مع الولايات المتحدة الأمريكية عندما ينظران إلى رئيسها الرابع والأربعين باراك أوباما باعتباره تكملة للأسطورة الكبرى لبلد الاحتمالات المفتوحة اللامحدودة؛ حيث يقومان برصد وتحليل مشروع أوباما من أجل إعادة اكتشاف الولايات المتحدة الأمريكية في ثوب جديد مختلف وأفضل. فهل يستطيع أول رئيس أفروأمريكي أن يبني الجسور بين عناصر مجتمع متعدد الثقافات وشديد التنوع مثل المجتمع الأمريكي، وأن يقود السفينة ببصيرة ثاقبة تستشرف عالم الغد.. أم سيضل الطريق في زحام تركة من الأزمات والعوائق خلَّفتها السياسة القديمة والاقتصاد المريض؟\"في هذا الكتاب المهم، يستدعى لنا اثنان من الخبراء الحقيقيين الأمةَ الأمريكية بكل قوتها القادرة على التغيير، والانفتاح على المستقبل. وهذه مسألة مهمة للغاية لنا جميعًا.\"الصحفي ريتشارد فون فايتسزيكر\"يُعدّ هذا الكتاب فرزًا دقيقًا لكل مقومات الدولة العظمى التي تنفرد بقيادة العالم حتى الآن على الأقل في فترة تاريخية محددة. ولذلك، يترك هذا الكتاب للقارئ مهمة الحكم الذي يراه بعد أن اطلع على كل تفاصيل وحيثيات المسألة الأمريكية بفضل الصحافة السياسية التي يعرضها المؤلفان كما يجب أن تكون\".نيقولا ليبنجر-كاميلر، رئيس شركة ترومبف جروب\"على الرغم من أن ألمانيا لا تدين بالفضل لأي دولة أخرى في العالم مثلما تدين بالفضل للولايات المتحدة الأمريكية، إلا أننا نجدها تتخذ موقفًا نقديًّا حادًّا من الأمريكيين بالذات، ولا ندري لماذا؟ ولهذا، تتمثل المفارقة هنا في أن جون سي. كورنبلم ودايتر كرونزوكر لا يجيبان عن هذا السؤال الحرج فحسب، وإنما يسلِّطان المزيد من الأضواء الكاشفة على مظاهر تغيُّر مسار التعامل مع الأمريكيين في عهد أوباما نحو وجهة جديدة تتسم بالتقدير والاستحسان، سواء على صعيد التطورات الراهنة أو التوقعات التي يحملها المستقبل\".هانز أولاف هينكيل، أستاذ بجامعة مانهايم ورئيس سابق لاتحاد الصناعات الألمانية\"استطاعت الولايات المتحدة الأمريكية بفضل ما تمتلك من قدرة فريدة من نوعها على التغيير والتجديد في أوقات التحولات الكبرى أن تحتفظ لنفسها بقوة جبارة متنامية ساعدتها على التحكم في مصير العالم لأسباب كثيرة ومختلفة، سواء كانت ظاهرة أم باطنة، إلا أنها في كل الأحوال مسألة محيِّرة ومربكة للغاية. ومن هنا، تأتي أهمية الرؤى التي يُبَلْوِرها ويُجسِّدها مؤلفا هذا الكتاب بشكل عميق ومؤثر للكشف عن أسرار هذه الدينامية والحيوية المدهشة التي تتسم بها الولايات المتحدة الأمريكية.\"إيكارت فون كلادن عضو البرلمان الاتحادي، والمتحدث السياسي باسم الجناح الاتحادي في الحزب الديمقراطي\"إلى أين تتجه القوة العالمية العظمى في ظل حكم رئيسها الجديد؟ وكيف تتحرك؟ للإجابة عن هذين السؤالين المهمين، نحتاج إلى الإنصات جيدًا إلى آراء اثنين من الخبراء العليمين ببواطن الأمور فيما يخص الشأن الأمريكي.\"الصحفية ماريتا سلومكا\"لقد اجتمع لهذا الكتاب القيِّم معارف وخبرات اثنين من أفضل وأقدر المراقبين للسياسة الأطلسية حتى يضعا نُصب أعيننا المهمة الأمريكية بكل أبعادها وملامحها. فضلًا عن أن جون سي. كورنبلم يُعدّ أحد أكثر العقول أصالة واطلاعًا في مجال الدبلوماسية الأمريكية، كما يُعدّ دايتر كرونزوكر من أشهر الصحفيين الذين قدَّموا للقراء تحقيقات مذهلة تكشف خبايا العالم الجديد. ولذلك، يقدِّم هذا الكتاب الرائع الكثير من الرؤى والمضامين والإشارات التي تبعث على التأمل، كما يُعدّ مرجعًا لا غنى عن قراءته والاستهداء به لكل من يريد الحديث عن العلاقات الألمانية الأمريكية.\"جاري سميث ، مدير عام الأكاديمية الأمريكية ببرلين.",
  "genres": [],
  "author": "جون كورنبالم",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/18275834"
}