{
  "title": "Celtic Tempest",
  "description": "Sometimes when the idea of love is shunned because of preconceived notions, pain and suffering ensue, taking the lovers down pathways that ultimately still lead them to each other. \n\n\nIn Fourteenth Century England, landless knights are forced to obey the ruthless monarch without question. Sir Andrew Brandham, knight of the Realm and captain of the Elite Guard of Ragnorsen Keep is called to do just that. When his best friend, Sir Erik Ragnorsen is commanded to nullify his marriage to the beautiful Rhianna Du Montefort because they have yet to produce an heir, Sir Andrew accompanies him to do battle with the will of the king. Erik is being forced to marry the daughter of a Scottish Laird in order to form a tenuous Peace between the Highlanders and England. The idea of divorcing his beloved wife to marry a loathsome Scot is beyond Erik’s vow of obedience and honor. He is imprisoned for his impulsive disobedience and Drew is left to form a scheme to save his friend. When he sees the Scottish lass who has been chosen for Sir Erik, he is instantly drawn to her and while his plan unfolds to aid Erik, Drew forms a friendship with Bronwyn, daughter of the Laird and High Chief of the Clan MacCollum. \nBronwyn MacCollum was raised in the Highlands, where the past is steeped in traditions of the “Old Ways”. A long time ago, Bronwyn had a vision of her intended, but realizing he was an Englishman, she vowed to change her destiny. The English were always the enemies of her people and she would not bring danger to her beloved clan. Only, she becomes a pawn in the sadistic game of the King of England and Robert the Bruce and is being forced to marry an English knight after all. Upon seeing the man she is betrothed to, she knew her vision had been false because he looked nothing like the man who had invaded her dreams since childhood. With vehement disregard for the king’s decree, she declares her hatred for Sir Erik Ragnorsen and would rather risk war than to marry him. Only, when she meets Sir Erik’s personal guard, Bronwyn realizes that sometimes you cannot fight what is destined from the start. Sir Andrew Brandham was familiar; more than familiar. He was the man of her visions and nothing she could do could make her deny it. \nBronwyn and Drew are filled with distrust and betrayal seeps into both of their hearts. They suffer through many storms that batter their hearts and souls like rocks at the edge of the tempestuous sea. Can their love survive the lies and heartache they are each guilty of? Can Bronwyn escape the Destiny and the pull of the Old Ways and create a path without Drew or will love help them both to embrace the course Destiny has chosen?",
  "genres": [],
  "author": "Ria Cantrell",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/18275902-celtic-tempest"
}