{
  "title": "Floral Folklore: The Forgotten Tales Behind Nature’s Most Enchanting Plants",
  "description": "Why do buttercups glow when held beneath your chin? Why are bluebells known as fairy phones? Why are foxgloves sometimes given the ominous name ‘Deadman’s Bellows’? And what is the true meaning of a rose? Discover the fascinating folklore behind more than 40 of nature’s most beautiful flora and fauna, and learn how you can apply their timeless teachings to modern day life, and embrace the ritual of getting out into nature.  Often forgotten but always intriguing, humans have given meanings and stories to plants and flowers for thousands of years. From myths of Ancient Greek Gods who pecked out the eyes of anyone who moved the sacred but thorny Peony plant, to 19th century Victorian tales of superstition that saw flowers foreshadow love, life, and death, you’ll never look at bunch of flowers in the same way again! With details on the origins of the folklore behind each plant, and a beautiful ritual to help you better connect with the teaching each plant has to offer, this is the perfect gift for foragers, gardeners, and budding horticulturists looking to develop their knowledge of plants beyond the exterior. From the old wife’s tale that sage thrives in the garden of a woman who rules her household (and husband!) firmly, to poppies growing in places where blood has been shed, learn the meanings and stories Tulips / Sunflowers / Orchids / Lily of the Valley / Basil / Bay / Lotus / Mint / Mulberry / Daffodil / Hyacinth / Rose / Rosemary / Parsley / Nightshade / Ragwort / Red Clover / Solomon’s Seal / Yarrow / Lavender / Cistus (Rock Rose) / Aconite / Violet / Cowslip / Hawthorn blossom / Stitchwort / Valerian …and more! Including common plants found all over the world, and traditional herbs and flowers used in medicines for thousands of years, this is a truly unique and fascinating exploration of floral folklore from around the world.",
  "genres": [
    "Nonfiction",
    "Folklore",
    "Nature",
    "History",
    "Science",
    "Mythology",
    "Witchcraft"
  ],
  "author": "Alison Davies",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/182762012-floral-folklore"
}