{
  "title": "A Trail of Crumbs to Creative Freedom",
  "description": "Writing a novel is hard, beyond just technical problems. Toxic ideas about the need for a muse, or how writing requires forcing yourself to produce, cause pointless suffering. A Trail of Crumbs to Creative Freedom proposes a more playful approach to creative writing, with a focus on having fun.Part narrative but full of wise advice, the book describes the trauma and creative recovery of the author, a bipolar novelist. After a severe manic episode, she sinks into a depression and block so deep, she cannot enjoy writing anymore.She wants to go back in time – to experience again the creative rush of writing her first novel. She tries to write another, but the effort is painful. She imagines a trail leading back to when writing was fun.This situation sparks insights about the mental game of novel writing, the nature and source of creativity, and the need to unlearn mental practices that impede writing.Topics include writing for love of the art, summoning creativity, ending self-abuse, getting unstuck, and replacing guilt with freedom. The key theme is rediscovering the childhood excitement of playful exploration.However, unlearning punishing myths takes time. The author at first blames her mood medication for her creative block but, unable to quit, searches for another way to rediscover joy in writing. A long struggle begins.The title is based on the need of the writer to go back to being creative again, the longing for any kind of direction – even a “trail of crumbs.” Her resolution to write anyway leads her through a series of emotional hurdles and finally, to finishing a second novel.Meanwhile, changes occur in how she views writing and she records them as she goes. The product of all of her insights is here. Each chapter is a part of the long sought trail. However, there is a surprise; the trail the author discovers leads her not back – but forward.",
  "genres": [],
  "author": "L.E. Henderson",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/18275756-a-trail-of-crumbs-to-creative-freedom"
}