{
  "title": "Rough Sex",
  "description": "This story picks up where \"The Sleepy Teen Cheerleader\" left off. Not only does sexy young cheerleader Tasha condone Stefan's use of her body, she actually loves it. When her parents are out of town they plan a crazy weekend of sleep sex and Stefan soon realises he can get pretty rough with the heavy sleeping girl and she won't be able to protest! WARNING: This 4800 word story contains explicit somnophilia themes including sleeping sex, sleeping blowjob, sleeping deep throat, sleeping face fucking, and all round rough sex with a passed out teen virgin.Excerpt: \"...Thus began the most magical period of my life. By the time we went back to school on the following Monday we were an item, finding every opportunity we could between classes to make out and grope each other without getting caught by teachers. My classmates began to treat me like a living legend, Tasha having rebuffed the advances of all the guys who normally end up dating the cheerleaders. Standing in the hallways with her body pressed close to mine the whole world dissolved around me and I was routinely lost in her crystal blue eyes.It was harder to show our affection around the Miller household. We didn't dare do anything while her parents were home, lest they do something drastic like have me deported. It seemed like every time we got a spare moment outside of school, something came up or interrupted us. I was as horny as, well, the eighteen year old guy that I was and after a couple of weeks running around like this I was practically bouncing off the walls with lust for her.That was the state of mind I was in when Mr Miller told us that he had, in a raffle, won travel to and two night's accommodation in another city so he and his wife would be away the following weekend. Thoughts raced through my head regarding all the things Tasha and I could do while they were away but my wildest dreams paled in comparison to what she suggested when we had a chance to plan our time together.\"I want you to pop my cherry while I'm asleep, asleep for real... and film it so we can keep the memory forever.\"Who was I to argue?...\"",
  "genres": [],
  "author": "Scarlett Skyes",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/18274208-rough-sex"
}