{
  "title": "Out for Blood",
  "description": "National Revealer’s Clark Kelly carved out his killer career as Hollywood’s most-feared gossip columnist by exploiting mankind’s most ancient vulnerability:“Everyone’s got a secret…and someone’s dying to tell it!”Clark never reveals his to-die-for secret!NEWS FLASH:Dude’s a vampire!CUE SCARY MUSIC …our undead gossip guru flies the night skies to spy on Hollywood’s hottest stars—then inks about their bedroom kinks! Imagine our studly, urbane journalist jotting notes as he hovers outside Scarlett Johansson’s bedroom window, or peeks into Tom Cruise’s “bachelor pad.”Star secrets…?This vampire BITES!And what’s sexier than vampires, ladies? Just ask smokin’ hot starlet/tabloid terror TayLo Logan—this Wild Child gets crazy with badboy Clark because his bite makes her blood boil!Then it’s LIGHTS…CAMERA… ACTION! …But not in a good way: Vampire Boy and Tabloid Train Wreck TayLo unwittingly end up stars of a sizzling sex tape—destined for worldwide display on the notorious vampire fan sex site, FANGBANGING.COM.Still, the duo’s beyond-the-grave love story simmers away as Clark rips the lid off a murder coverup—then discovers a murderous plot against TayLo!DANGER!! Can Clark stop a stalker who wants to drain his lover dry? Or wreak revenge on TinselTown billion-heiress Roma Kane for her poisonous plot to paralyze TayLo—and her career? Can he foil a murder cabal so evil it feeds stars’ pets to coyotes?AND THEN…talk about the plot thickening! Roma’s billionaire granddaddy, mogul Montague Kane, taking a breather from the nymphet “nannies” paid to play his naughty high-chair games, springs a back-stab surprise—buying out Clark’s beloved National Revealer.Suddenly, “deadline” takes on a whole new meaningTriggered by vengeful fury, Clark goes “rogue vampire!”Evil is punished…and the sun shines once more when he creates a Hollywood happy ending that makes everyone (undeads included) a STAR!Hold the front page! Because Clark Kelly’s…Out For Blood!",
  "genres": [
    "Paranormal",
    "Vampires"
  ],
  "author": "Mike    Walker",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/18276002-out-for-blood"
}