{
  "title": "Sombras Vivas",
  "description": "No primeiro livro, Jacob Reckless correu contra o tempo para impedir que seu irmão, Will, se transformasse em um goyl - uma terrível criatura de pedra. Mais uma vez no Mundo do Espelho, neste segundo livro da série Reckless Jacob precisa se libertar de uma maldição que em poucos meses lhe custará a vida. Depois de tentar diferentes formas de magia, sua última opção é uma lendária balestra, capaz de dizimar exércitos, mas também de salvar aqueles que realmente precisam.Já faz quase um ano que Jacob Reckless conseguiu salvar seu irmão Will de ser transformado em goyl - uma criatura fria e violenta, com pele de pedra e olhos dourados. Desde que conheceu o Mundo do Espelho, uma terra em que os personagens dos contos de fadas convivem com os humanos e revelam seu lado mais sombrio e ameaçador, o jovem passou a frequentá-lo cada vez mais, fazendo dali a sua verdadeira casa. Mas tinha sido a primeira vez que alguém de sua família tinha chegado até lá - e ainda por cima entrado em apuros. No fim, o preço por livrar o irmão do perigo acabou sendo muito alto: ele teve que pronunciar o nome da Fada Escura, e agora uma mariposa amaldiçoada repousa em seu peito, esperando até que consiga mordê-lo seis vezes, para então voltar a ter vida, retornar para sua dona e levar consigo a vida de Jacob.Mas em algum lugar no Mundo do Espelho deve haver um remédio. Jacob já tentou A Maçã que Tudo Cura, a Fonte da Eterna Juventude, o sangue de gênio engarrafado... E, aparentemente, só perdeu tempo. Sua última esperança é uma antiga lenda sobre uma balestra, que, quando usada com ódio, é capaz de destruir exércitos inteiros com uma só flecha, e, quando usada com amor, pode curar quem estiver à beira da morte.Só essa arma poderá salvá-lo, mas ele não é o único que está à sua procura e por isso não será nada fácil encontrá-la: Jacob, junto com sua companheira Fux, terá de ser mais rápido que o goyl Nerron, o Bastardo, que tem apenas um objetivo: provar que é o melhor caçador de tesouros de todos os reinos. Já para o jovem, não se trata de ser ou não o melhor - ele está prestes a decidir o seu destino.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Adventure",
    "Audiobook",
    "Magic",
    "Fairy Tales"
  ],
  "author": "Cornelia Funke",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/18277577-sombras-vivas"
}