{
  "title": "The Breaking",
  "description": "From the authors of the Glass Towers Trilogy, we bring you:Her Power, His Shame--The Breaking.‘It wasn't his heart she was after, she wanted his soul.’Independent and feisty thirty-seven year old Wren Poe, a self-made executive, doesn’t take orders from anyone--especially men. Everything is on her terms in the boardroom and in the bedroom. Owning a successful marketing firm in Seattle has afforded her luxuries and independence. Though beautiful Wren may seem to have it all; success, money, power, and a quirky best friend, the one thing she doesn’t have--is love. But then Wren isn’t the type of woman who wants to find love…not until the day she walks into Greenlee Athletics that is. To add to matters, Wren has spent almost an entire lifetime trying to forget a tragic past and recently an undeniable presence that has thrown Wren's life for a loop.Talon Greenlee; thirty-nine years old, tall, dark and handsome…has secrets and pain from his past that have fueled his drive for success. As a result, his career is in high gear training professional athletes at his upscale Sports Training Facility. Talon is rich, mysterious and hot as hell and despite his dark past, Talon is the perfect man. The catch? He is unavailable until he rids himself of his flaky girlfriend April.Their attraction is unmistakable... but Wren is soon to find out, that attraction comes with a heavy price. Something she could never have foreseen.As Talon hires Wren Poe to market Greenlee Athletics new facility in San Francisco, can they continue to deny the sexual charge that exists between them. Can they keep it professional? Or, do they give in to the fire that has ignited the passion that lies between them. While they openly explore each other in the bedroom…they quickly discover their lives have already intersected in the past, unbeknownst to them, they share a past that made it inevitable that their paths would eventually cross. With fate in the driver’s seat, are either one ready to deal with the truths from their past and the long forgotten emotions and pain that they unwittingly share. Does this budding romance stand a chance? Torn between their past that drives them and their future that fuels their passion, join Wren and Talon on their journey in this three part series. This book is intended for mature audiences. Suggest 18+ due to some explicit language and sexual situations.Book One of a three part series.Book Two, Relentless Pursuit coming early September 2013.Book Three, The Trifecta",
  "genres": [
    "Romance",
    "Contemporary Romance"
  ],
  "author": "Adler",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/18277182-the-breaking"
}