{
  "title": "The Dragon's Mage",
  "description": "A Fantasy Menage (MFM) story with elements of shapeshifting.A Dragon always recognizes his mate.When a young dragon is betrayed and left to die among the humans, and a pretty mage in hiding sacrifices herself to save her family, both end up in the hands of the magnull. Morgan is drawn to the sick young man and recognizes he is dragon in human form. Determined their captors would not kill such a creature she hides what he is until she can give him what he needs: The magic in her blood. The dragon does escape but he takes Morgan with him.Fearful of taking his frail human mate home while his betrayer is still masked, he decides to call on the help of their most dangerous Dragon.After a Dragon has reached adulthood very little can kill him except loneliness and Despair. This dragon, the oldest unmated dragon alive, is known as the Dragon Executioner. He is Eben Kinkaid. While Ladon is going through his Molt (his transition into adult status) he wants Eben to protect his mage.Though Eben thinks Ladon foolish to believe a human could be a dragon’s mate, he has been too long without hope and must see for himself. He meets Morgan and recognizes her for what she is: The mate he has been waiting for.Morgan, determined to get back to her young siblings before they run into trouble, is not exactly thrilled to be claimed as a dragon’s mate. Only now she has two to contend with; two incredibly dangerous dragon men who can heat her up with one look from dragon gold eyes.Mated to two dragons, her powers over the elements and her longevity are enhanced by dragon fire. Now they must face a powerful dark mage to rescue her family, and if that's not enough, they still have to find the dragon who betrayed Ladon to the humans.All of this while dealing with a mating heat that burns hotter than dragon fire.",
  "genres": [
    "Fantasy",
    "Menage",
    "Dragons",
    "Paranormal",
    "Shapeshifters",
    "Magic",
    "Romance"
  ],
  "author": "Kelly Lucille",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/18278188-the-dragon-s-mage"
}