{
  "title": "الطبعة العربية لكتاب: نافذة على الأعمال في: الصين",
  "description": "الطبعة العربية لكتاب: نافذة على الأعمال في: الصين •\tالمؤلف: جوناثان روفيدالناشر: مجموعة النيل العربيةباعتبار أن الصين دولة منفتحة بصورة متزايدة أمام الاستثمارات الأجنبية التي يمكنها الانتشار والتوسعفي هذا السوق الاستهلاكي الضخم الصاعد الواعد،تمثِّل فرصة تجارية عظيمة. ومع ذلك، فالسؤال الذي يطرح نفسه بإلحاح هو كيف يتأكد أصحاب الأعمال التجارية ويضمنون أن يجدوا في الصين الظروف المواتية المثلى لتحقيق النجاح المنشود؟ والإجابة التي يقدِّمها هذا الكتاب عبارة عن إلقاء نظرة عامة كاشفة على التقدم الذي تحقق بالفعل في الصين قبل خوض أصحاب هذه الأعمال تجربة الدخول إلى هذا السوق.في ضوء التجارب والخبرات والدروس والنتائج المستفادة من واقع الحياة العملية للشركات التي دخلتإلى حلبة المنافسة في مجال الأعمال التجارية بالصين، يقدم هذا الكتاب خلاصة ما أحرزت من نجاح وما واجهت من إخفاق في تسيير أعمالها على كل المستويات في هذا السوق التنافسي الصعب.تتناول فصول الكتاب الموضوعات الآتية:• الاستثمار الداخلي والخارجي.• الصين ومنظمة التجارة العالمية.• الحكومة والإدارة الصينية.• إدارة المخاطر في الصين.• إدارة الملكية الفكرية.• إدارة المشاريع المشتركة.• حسابات البنوك وصرف العملات الأجنبية.• قانون المشاريع المشتركة.• دراسات حالة عن الصناعة والتجارة وخدمات التموين.بفضل الإسهامات التي حظي بها هذا الكتاب من شركة KPMG وبنك HSBC ومجموعة آروب Arup ومجلس الأعمال البريطاني الصيني، استطاع أن يغطي الموضوعات الرئيسية والجوهرية للاستثمار والتشريعات والقوانين وإدارة المخاطر والوعي الثقافي فضلاً عن تقديم دروس فريدة مستفادة نابعة من تجارب الشركات التي أحرزت نجاحًا بالفعل أو صادفت مشاكل وصعوبات في الدخول إلى واحد من أكثر الاقتصادات إثارةعلى مستوى العالم.جوناثان ريوفيد مؤلف هذا الكتاب: شخص ذو خبرة عميقة وطويلة بالصين؛ حيث سبق له أن عمل خبيرًا اقتصاديًّا، ومستثمرًا، ومستشارًا لتطوير مؤسسة دولية ثم مؤلفًا مشاركًا ومحررًا لعناوين كثيرة في مؤسسة كوجان بيدج للنشر، منها:\"العمل في الخارج\" و\"إدارة مخاطر الأعمال\" و\"دليل الثروة الشخصية: كيف تدير شركتك، ومتى تطرح أسهمها في البورصة؟\".",
  "genres": [],
  "author": "جوناثان روفيد",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/18278009"
}