{
  "title": "Guilty Pleasures",
  "description": "Gorgeous, narcissistic, self-absorbed Lance Packhard is a sex therapist specializing in Awakenings, helping anorgasmic women find sexual fulfillment.Lance’s spare time is dedicated to the cult of his body and writing a how-not-to book entitled Sexual Secrets of a Sexual Surrogate. His personal life consists of Sunday tea with his grandmother and a monthly night out with his best friend, George. Oh, and no sex, none whatsoever.When a wealthy, ruthless mother offers him an enormous sum to seduce and impregnate her thirty-six-year-old daughter, Millicent Deafly, a debt-ridden Lance hesitantly agrees.However, Millicent is not into sex, and definitely not into Lance. She’s chosen the other end of the sensuality spectrum and is heavily into food. She is bright, bouncy and joyous, uninhibitedly plump, natural, and completely dedicated to her palate. The only way Lance will get her attention is if he dabs soy sauce on his pulse points.Determined to get close to her, Lance creates an alter ego—sweetly shy Wilfred Pecklise—and takes a job at Millicent’s dinner club, Guilty Pleasures.Guilty Pleasures caters to the flamboyant and the eccentric: supermodels pigging out, trash-metal rock stars with penis-piercings and their loving grannies, the widows of billionaires, and many more oddities.Lance finds himself immersed in a sensuous world of scents, tastes, and color, and befriended by Serge Moreno—a homosexual black dwarf who has had a colorful life as a prostitute in Istanbul, a fluffer in skin flicks in Vegas, and is now a celebrity chef in London.Ironically, Lance isn’t just failing to seduce Millie, but falling madly in love with her.Balancing the two lives of Lance and Wilfred becomes next to impossible when his geeky best friend, George, suddenly marries and decides to hold the reception at Guilty Pleasures. Will the truth be uncovered?",
  "genres": [
    "Erotica",
    "Romance",
    "Contemporary"
  ],
  "author": "Manuela Cardiga",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/18277772-guilty-pleasures"
}