{
  "title": "Redefining Realness: My Path to Womanhood, Identity, Love  So Much More",
  "description": "In a landmark book, an extraordinary young woman recounts her coming-of-age as a transgender teen—a deeply personal and empowering portrait of self-revelation, adversity, and heroism.In 2011, Marie Claire magazine published a profile of Janet Mock in which she publicly stepped forward for the first time as a trans woman. Since then, Mock has gone from covering the red carpet for People.com to advocating for all those who live within the shadows of society. Redefining Realness offers a bold new perspective on being young, multiracial, economically challenged, and transgender in America.Welcomed into the world as her parents’ firstborn son, Mock set out early on to be her own person—no simple feat for a young person like herself. She struggled as the smart, determined child in a deeply loving, yet ill-equipped family that lacked money, education, and resources. Mock had to navigate her way through her teen years without parental guidance but luckily with a few close friends and mentors she overcame extremely daunting hurdles.This powerful memoir follows Mock’s quest for identity, from her early gender conviction to a turbulent adolescence in Honolulu that found her transitioning through the halls of her school, self-medicating with hormones at fifteen, and flying across the world for sex reassignment surgery at just eighteen. Ever resilient, Mock emerged with a scholarship to college and moved to New York City, where she earned her masters degree, basked in the success of an enviable career, and told no one about her past.It wasn’t until Mock fell for a man who called her the woman of his dreams that she felt ready to finally tell her story, becoming a fierce advocate for girls like herself. A profound statement of affirmation from a courageous woman, Redefining Realness shows as never before what it means to be a woman today and how to be yourself when you don’t fit the mold created for you.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "LGBT",
    "Feminism",
    "Queer",
    "Biography",
    "Gender"
  ],
  "author": "Janet Mock",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/18280706-redefining-realness"
}