{
  "title": "Still Life with Bread Crumbs",
  "description": "NEW YORK TIMES BESTSELLERA superb love story from Anna Quindlen, the #1 New York Times bestselling author of Rise and Shine, Blessings, and A Short Guide to a Happy Life  Still Life with Bread Crumbs begins with an imagined gunshot and ends with a new tin roof. Between the two is a wry and knowing portrait of Rebecca Winter, a photographer whose work made her an unlikely heroine for many women. Her career is now descendent, her bank balance shaky, and she has fled the city for the middle of nowhere. There she discovers, in a tree stand with a roofer named Jim Bates, that what she sees through a camera lens is not all there is to life.   Brilliantly written, powerfully observed, Still Life with Bread Crumbs is a deeply moving and often very funny story of unexpected love, and a stunningly crafted journey into the life of a woman, her heart, her mind, her days, as she discovers that life is a story with many levels, a story that is longer and more exciting than she ever imagined.\nLook for special features inside. Join the Random House Reader’s Circle for author chats and more.\n\n“There comes a moment in every novelist’s career when she . . . ventures into new territory, breaking free into a marriage of tone and style, of plot and characterization, that’s utterly her own. Anna Quindlen’s marvelous romantic comedy of manners is just such a book. . . . Taken as a whole, Quindlen’s writings represent a generous and moving interrogation of women’s experience across the lines of class and race. [Still Life with Bread Crumbs] proves all the more moving because of its light, sophisticated humor. Quindlen’s least overtly political novel, it packs perhaps the most serious punch. . . . Quindlen has delivered a novel that will have staying power all its own.”—The New York Times Book Review  “[A] wise tale about second chances, starting over, and going after what is most important in life.”—Minneapolis Star Tribune“Quindlen’s astute observations . . . are the sorts of details every writer and reader lives for.”\n—Chicago Tribune\n“[Anna] Quindlen’s seventh novel offers the literary equivalent of comfort food. . . . She still has her finger firmly planted on the pulse of her generation.”—NPR“Enchanting . . . [The protagonist’s] photographs are celebrated for turning the ‘minutiae of women’s lives into unforgettable images,’ and Quindlen does the same here with her enveloping, sure-handed storytelling.”—People“Charming . . . a hot cup of tea of a story, smooth and comforting about the vulnerabilities of growing older . . . a pleasure.”—USA Today  “With spare, elegant prose, [Quindlen] crafts a poignant glimpse into the inner life of an aging woman who discovers that reality contains much more color than her own celebrated black-and-white images.”—Library Journal   “Quindlen has always excelled at capturing telling details in a story, and she does so again in this quiet, powerful novel, showing the charged emotions that teem beneath the surface of daily life.”—Publishers Weekly   “Quindlen presents instantly recognizable characters who may be appealingly warm and nonthreatening, but that only serves to drive home her potent message that it’s never too late to embrace life’s second chances.”—Booklist   “Profound . . . engaging.”—Kirkus ReviewsFrom the Trade Paperback edition.",
  "genres": [
    "Fiction",
    "Book Club",
    "Romance",
    "Contemporary",
    "Chick Lit",
    "Adult Fiction",
    "Adult"
  ],
  "author": "Anna Quindlen",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/18283140-still-life-with-bread-crumbs"
}