{
  "title": "Pilgrim's Wilderness: A True Story of Faith and Madness on the Alaska Frontier",
  "description": "Into the Wild meets Helter Skelter in this riveting true story of a modern-day homesteading family in the deepest reaches of the Alaskan wilderness – and of the chilling secrets of its maniacal, spellbinding patriarch. When Papa Pilgrim appeared in the Alaska frontier outpost of McCarthy with his wife and fifteen children in tow, his new neighbors had little idea of the trouble to come. The Pilgrim Family presented themselves as a shining example of the homespun Christian ideal, with their proud piety and beautiful old-timey music, but their true story ran dark and deep. Within weeks, Papa had bulldozed a road through the mountains to the new family home at an abandoned copper mine, sparking a tense confrontation with the National Park Service and forcing his ghost town neighbors to take sides in an ever-more volatile battle over where a citizen’s rights end and the government’s power begins. In Pilgrim’s Wilderness, veteran Alaska journalist Tom Kizzia unfolds the remarkable, at times harrowing, story of a charismatic spinner of American myths who was not what he seemed, the townspeople caught in his thrall, and the family he brought to the brink of ruin. As Kizzia discovered, Papa Pilgrim was in fact the son of a rich Texas family with ties to Hoover’s FBI and strange, oblique connections to the Kennedy assassination and the movie stars of Easy Rider. And as his fight with the government in Alaska grew more intense, the turmoil in his brood made it increasingly difficult to tell whether his children were messianic followers or hostages in desperate need of rescue. In this powerful piece of Americana, written with uncommon grace and high drama, Kizzia uses his unparalleled access to capture an era-defining clash between environmentalists and pioneers ignited by a mesmerizing sociopath who held a town and a family captive",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Religion",
    "History",
    "Biography",
    "Crime",
    "Audiobook"
  ],
  "author": "Tom Kizzia",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/18281413-pilgrim-s-wilderness"
}