{
  "title": "Regine's Book: A Teen Girl's Last Words",
  "description": "Regine Stokke could have just given up. Instead, she started a blog and turned her fight against leukemia into a source of vitality, power, and beauty. Through music, photography, writing, and time spent with loved ones, she made the most of her life. She was a typical teenager with an amazing will to live, and the lessons she learned have relevance to us all.“Seventeen-year-old Regine began a blog to document and share her experience after being diagnosed with leukemia in 2008. . . . Her writing is honest and raw, insightful and inspiring. . . . Her obsession with rock music and attending concerts saturates the text as it does her short life, and her original poems and artistic photographs add extra dimension to what is sure to be an inspiring read for a new audience for this moving title.”–Booklist“Stokke’s openness and honesty. . . are the chief draw; readers will feel as though they have truly come to know her. . . . it’s a rare, valuable window into life with a terminal illness.”—Publishers Weekly “In direct, emotionally open prose, Regine describes the details of cancer treatment, her optimism and frustrations, her excitement about rock music, and her relationships with friends and family. . . . Regine's voice is matter-of-fact and honest, with a tone that is occasionally raw. . . . A heartfelt and visually appealing window into Regine's last year.”–Kirkus Reviews “With a moving and honest voice, she takes readers along on her journey from diagnosis to despair to acceptance. . . . readers will find themselves rooting for Regine until the end.”–School Library Journal “There is no tale of end-of-life romance or melodrama in Regine's memoir, just an honest portrayal of a child struggling to come to terms with something every human being will one day face. What makes her memoir so valuable is the message that she keeps coming back to. . . 'Face your fear. Accept your war. It is what it is.' In other words. . . 'Live.'\"–Voice of Youth Advocates* A Junior Library Guild Selection* ForeWord Reviews Book of the Year Winner* YALSA Quick Picks Nominee",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "True Story",
    "Photography",
    "Teen",
    "Scandinavian Literature"
  ],
  "author": "Regine Stokke",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/18281727-regine-s-book"
}