{
  "title": "Combat Jump: The Young Men Who Led the Assault into Fortress Europe, July 1943",
  "description": "The hair-raising, frontline account of the first American airborne invasion of World War II and of the young paratroopers who risked their lives for freedom By 1943, the war in Europe had reached a turning point. General Dwight Eisenhower was given orders to invade Sicily and head north. To achieve this, Ike had a new weapon: U.S. paratroopers. Their mission was to seize the approaches to the invasion beaches and to hold off German attacks. \"Combat Jump tells the little-known story of these paratroopers and how they changed the American way of war. It takes readers on their journey from civilians to citizen soldiers, through training in the United States and later in North Africa, and then shows their daring jump into the darkness over enemy-held Sicily.By first light on D-day, July 10, 1943, it looked as if the mission would fail. Inexperienced pilots, lost or blown off course, dropped 80 percent of the troopers from one to sixty-five miles from their targets. The American commander, James Gavin, landed so far from his objective that he was not even sure he was in Sicily. Arthur Gorham, commanding 500 men of the First Battalion, encountered two surprises when the sun came up. He and just over 100 of his men were the only GIs -- out of 3,400 dropped -- near their objective. He also discovered that the Germans on Sicily had tanks. The lightly armed paratroopers, with their rifles and hand grenades, were not equipped to take on the forty-ton panzers. But against all odds, they did. The costly lessons they learned shaped the war in Europe, for without Sicily, there might have been no airborne invasion of France in June 1944.\"Combat Jump recounts the extraordinarycontributions these young men made when their country called them to war, and it tells a classic tale of military action and remarkable courage.",
  "genres": [
    "History",
    "Military History",
    "World War II",
    "Nonfiction",
    "Military Fiction"
  ],
  "author": "Ed Ruggero",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/1093698.Combat_Jump"
}