{
  "title": "Not So Innocently Abroad: Official State Department Tour or Sinister Government Plot to Disappear Me?",
  "description": "From award-winning actor and playwright Ken Richters comes this original, irreverent, and funny travel memoir of his month-long U.S. State Department goodwill tour of Russia and Ukraine as Mark Twain. After spending more than 30 years performing as Mark Twain, satirizing every government official and politician within earshot, American actor and playwright Ken Richters got a call from the U.S. Department of State asking him to leave the country for the former Soviet Union, causing the author to wonder if the proposed trip was an official State Department goodwill tour, or sinister government plot by one of the many politicians and government officials he offended during his career (including seven U.S. senators, fifteen past and present members of Congress, twenty-six state governors, countless local politicians from all fifty states and a sitting justice of the United States Supreme Court). Were they working to have him permanently disappeared? Originally scheduled for two shows in Moscow, the mission was extended for nearly a month to retrace Twain's travels in Eastern Europe. The book chronicles performance stops in Moscow, Kiev, Odessa, Simferopol, Sevastopol, and the Livadia Palace in Yalta--almost causing a diplomatic incident involving the Russian Black Sea Fleet. Other highlights include hallucinating on a road trip to Crimea, seeing a naked Oprah Winfrey and matryoshka doll-juggling monkey riding shotgun after self-medicating in an attempt to cure the Crimean Croup. You'll enjoy reading how Richters unknowingly made the same observation about the beauty of Ukrainian women that caused Vice President Joe Biden public ridicule, and how that elevated Richters to a Ukrainian media cause celebré.",
  "genres": [],
  "author": "Ken Richters",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/18285685-not-so-innocently-abroad"
}