{
  "title": "Knight Blindness",
  "description": "Given a choice between the pleasant life you knew centuries ago or the possibility of all you want in an uncertain new world, which would you choose? Two men torn through time find themselves in the modern but alien world. Old enemies, one hunting the other,one discovering love, both fighting private battles to survive. Book 3 of The Knights in Time Series Ready for battle, Medieval English knight, Stephen Palmer, charges into the French enemy’s cavalry line. Heeding a warning given months before, he hesitates as he comes face-to-face with the knight in the warning. Struck down in the year 1356, he finds himself landing in the year 2013. Grievously wounded, he’s taken to a nearby hospital. Confused by the new world surrounding him, he attempts to convince the staff he’s from another time, only to find they think him mad. Rescued by friends, who, to his surprise, have also come through time, he must find a way to function in this odd modern England. He is quickly enchanted by the kind Esme Crippen, the young woman hired to tutor him. She too is enchanted by him. Tempted to deepen the relationship, she hesitates thinking him adorable, but mad. He must discover the means for getting her to believe the truth, all the while, unknown to him, he didn’t come forward in time alone. The enemy knight has also traveled to 2013. French noble, Roger Marchand, doesn’t question why the English knight who charged him hesitated. That fraction of a pause gave him the advantage needed and he brought his sword down upon the Englishman’s helmet hard, unhorsing the knight. He moved to finish the Englishman off when the world changed in a rush of sensations as he is ripped through time. Seeking a reason for the terrible event, he enters a nearby chapel. There, thinking God has chosen him for a quest to turn French defeat that day in 1356 to victory, he sets out to find the English knight. The man he is convinced holds the key to time. If he returns to the day of the battle, he can warn his king of mistakes that snatched victory from them.",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical Romance",
    "Science Fiction",
    "Fantasy",
    "Amazon",
    "Time Travel Romance"
  ],
  "author": "Chris Karlsen",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/18287244-knight-blindness"
}