{
  "title": "Atonement",
  "description": "This is the fourth book in The Heart of Stone collection. It is essential to read the first three books in this series before reading this volume.Reading order:IncinerationToleranceResolutionAtonementYou would think after eight years in a relationship, that you would know your partner inside out. Ava Fox thought that… How wrong she was.When Mason’s secrets start exploding around them both, threatening their lives along with their marriage, Ava finds herself doubting everything Mason ever was or is. She once again comes to rely on her inner strength, her outer strength and her sheer fortitude to make it through life, but this time Mason’s secrets and lies have buried deep, caused a pain so raw and brutal that Ava is unsure whether their relationship can ever find its way back to how it was.It’s time for Ava to face up to Mason’s deceits. Mason Fox has hated his secret life ever since Ava stepped into his life eight years ago, knowing how painful her past was, he kept his secret buried and hidden so deep that he thought he was safe from exposure… How wrong he was.He once again finds himself in the centre of not only a battle of strength and force to save his wife’s life, but a fight to save his marriage. His lies and deceptions have caused a breach so wide in his relationship with Ava that finding a way back needs more than just courage and determination.It’s time for Mason to atone for his sins.Sometimes, love is just that little bit too unforgiving.This book contains strong language, violence and drug abuse. It also contains explicit sexual scenes, including a ménage à trois in the formation of F/M/M. This scene is contained within Chapter 10; if this content offends you, please feel free to skip the chapter as it contains no relevance to the storyline.And of course, as always, this book contains one hell of an alpha male….",
  "genres": [
    "Romance",
    "Erotica",
    "Menage",
    "Dark",
    "Adult Fiction"
  ],
  "author": "D.H. Sidebottom",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/18287029-atonement"
}