{
  "title": "التخطيط الاستراتيجي القومي",
  "description": "اهتم هذا الكاتب بتأسيس وطرح مفاهيم جديدة للتخطيـط الاستراتيجي القومـي { الاقتصادي ، الاجتماعي ، السياسي ، العلاقات الدولية ، الانتاج العلمي والتقني ، كما طور مفاهيماً جديدة للتغيير الاستراتيجي تتناسب ومتطلبات الاداء القومي ، وذلك كمحاولة للمساهمة في سد العجز في الفكر الاستراتيجي المتعلق بالدولة ، حيث يأتي معظم الاهتمام بالادارة الاستراتيجية للمنظمات في عالمنا العربي والافريقي دون اهتمام بالجانب القومي .اهتم الكتاب أيضاً بتوضيح العلاقة بين التخطيط الاستراتيجي ، المصالح الوطنية والامن القومي ، وقد اقتضي ذلك تحقيق التناسق بين كل من اساليب التحليل الاستراتيجي ، الغايات القومية المنبثقة عن الاستراتيجية وعناصر القوة الشاملة للامن القومي والتنظيم الإداري لآلية التخطيط الاستراتيجي القومي . بناء عليه قمت بتطوير اسلوب التحليل المعروف بتحليل PEST حتى يكون مناسباً للوضع المشار إليه ، واطلقت علي التحليل بوضعه الجديد اسم تحليل الاوضاع القومية: SIMPEST . كما تضمن الكتاب تحديد خطوات الادارة الاستراتيجة للدولة في المجالات الفرعية المختلفة السياسية والاجتماعية والاقتصادية .. الخ ، بما يجعلها تتناسب ومتطلبات المصالح الوطنية بما في ذلك مطلوبات الامن القومي ، كما طرح رؤية متكاملة للتنظيم الاداري لآلية التخطيط الاستراتيجي .نرجو ان يشكل نقطة انطلاق للباحثين والمفكرين للنقد والتحليل في سبيل بناء الفكر في هذا المجال الحيوي المهم http://www.arabnilegroup.com/----------يحتوي كتاب التخطيط الاستراتيجي القومي على 17 فصلاً موزعة على ثلاثة أبواب ، يتناول الباب الاول : المفهوم العام للتخطيط الاستراتيجي ، ويتناول الباب الثاني : التخطيط الاستراتيجي القومي المتخصص ( تحليل البيئة الدولية ، التخطيط الاستراتيجي الاقتصادي ، السياسي ، العلاقات الدولية ، الاعلام والمعلومات ، الاجتماعي الثقافي ، الموارد البشرية ، التخطيط الاستراتيجي للانتاج العلمي والتكنولوجي ، أضافة إلى التخطيط الاستراتيجي للأمن القومي ) ؛ ويتناول الباب الثالث : تطبيقات عملية في دراسة عن التخطيط الاستراتيجي على مستوى الشركات الصناعية ؛ ونموذج آخر لتطبيق التخطيط الاستراتيجي في القطاع الحكومي ؛ ويتوج الكتاب بشرح لآلية الجهاز التي يتناول عمليات التخطيط الاستراتيجي القومي على مستوى الدولة والتي يمكن تسميتها بالعقل القومي .",
  "genres": [],
  "author": "محمد حسين أبو صالح",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/18295757"
}