{
  "title": "Academy of Love",
  "description": "Cassianna Baxter leaves behind a glamorous teaching career in Italy to return to her alma mater in the majestic Virginia countryside, The Lewiston Academy for Girls. But this time she returns to her old boarding school not as a student, but as the Deputy Headmistress.No sooner does she arrive at the Academy than she walks smack into sexy Lawrence Taylor, her first love and ex lover. Now he’s the Director of the Equestrian Center and Chairman of the Board and they will be working side by side. Their attraction is intense and undeniable, sparks fly when they succumb to torrid temptation.Twelve years prior, Cassianna had stayed on at the Academy after graduation to pursue her dream of making the Equestrian Olympic Team with Lawrence as her trainer, but he was much more than that. Their love sizzled until he broke her heart when he left her with no explanation. She abandoned her riding dreams and left the Academy with no plans to ever return.When the two lovers are reunited at the Academy, they discover their attraction is unrelenting and sex even hotter than before. Conflicted by her deep sexual desire for him burned by their painful past, Cassianna convinces herself to give into their passion. Just once. No strings attached. But the sex is way too good to walk away from but she cannot get over the fact that Lawrence left her years ago and she struggles to protect her heart at all costs.He’s been looking for her ever since he was forced to leave her and now that she is back at the Academy--- he must win her back. And not just in his bed.Reader Alert!Cassianna and Lawrence play with fire when they reunite and and find out the sex is red hot. Careful! Don’t get burned as you turn the pages of their sexyTo My There is nothing quite as exciting as a first love and nothing quite as painful as it’s ending. It’s a theme I think many readers can relate to in the heroine and the hero of this story, Cassianna and Lawrence. And the proper girl’s boarding school is something I can relate to from first hand experience. And I can assure you there is nothing prim and proper about what goes on between Lawrence and Cassianna at the Academy!What happens when ex lovers meet years later -- will the attraction burn as hot? Or will it be scorching?About the A die hard romantic and former wedding planner, Kate has been writing stories about romance, from the sensual to the super sexy, since she was in college. When she’s not writing or reading romance, which she does a lot of, she can be found on the tennis court - yes, there’s even “love” in that game too! And she found a sport she can play and still wear a dress. Born in England, Kate now lives in Arizona with her wonderful, sexy, and very patient husband. Kate enjoys traveling and dreaming up new exciting stories. She’d love to hear from you.Excerpt“What are you doing here at the Academy?” Lawrence demanded from the doorway, his gaze intense and the tension in him showing through his taut neck muscles.“Me! What am I doing here?” she stammered. “I think I should be asking you the same thing.”“I work here,” Lawrence flashed back, his eyes flecked with gold and full of fire.“I work here too!”The lines in his brow furrowed. “Since when?” His voice rising, as he stood up even taller, filling the doorway with his strength.“Since four hours ago when I arrived at this school. And don’t you yell at me!” Cassianna gulped for air, as she sputtered angrily, “I should be yelling at you, you’re the one that ran off and left me.”“I’m the one that ran off?” He clenched the muscles in his neck while sparks flashed in his eyes.“I waited for you and you never came back.” As Cassianna spoke the angry words, she noticed his posture softened slightly, his shoulders easing, but his muscular chest contracted with each heavy breath, betraying his mood.He moved towards her in one quick stride.He was inches from her. Cassianna could",
  "genres": [
    "Romance"
  ],
  "author": "Kate Deveaux",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/18293209-academy-of-love"
}