{
  "title": "The Orientalist: Solving the Mystery of a Strange and Dangerous Life",
  "description": "'Mixing memory with desire, this marvelous and original book once more reminds us of ways through which the imagination becomes a refuge from the uncontrollable cruelties of reality.' Part history, part cultural biography, and part literary mystery, The Orientalist traces the life of Lev Nussimbaum, a Jew who transformed himself into a Muslim prince and became a best-selling author in Nazi Germany. Born in 1905 to a wealthy family in the oil-boom city of Baku, at the edge of the czarist empire, Lev escaped the Russian Revolution in a camel caravan. He found refuge in Germany, where, writing under the names Essad Bey and Kurban Said, his remarkable books about Islam, desert adventures, and global revolution, became celebrated across fascist Europe. His enduring masterpiece, Ali and Nino—a story of love across ethnic and religious boundaries, published on the eve of the Holocaust—is still in print today. But Lev's life grew wilder than his wildest stories. He married an international heiress who had no idea of his true identity—until she divorced him in a tabloid scandal. His closest friend in New York, George Sylvester Viereck—also a friend of both Freud's and Einstein's—was arrested as the leading Nazi agent in the United States. Lev was invited to be Mussolini's official biographer—until the Fascists discovered his \"true\" identity. Under house arrest in the Amalfi cliff town of Positano, Lev wrote his last book—discovered in a half a dozen notebooks never before read by anyone—helped by a mysterious half-German salon hostess, an Algerian weapons-smuggler, and the poet Ezra Pound. Tom Reiss spent five years tracking down secret police records, love letters, diaries, and the deathbed notebooks. Beginning with a yearlong investigation for The New Yorker, he pursued Lev's story across ten countries and found himself caught up in encounters as dramatic and surreal, and sometimes as heartbreaking, as his subject's life. Reiss's quest for the truth buffets him from one weird character to the next: from the last heir of the Ottoman throne to a rock opera-composing baroness in an Austrian castle, to an aging starlet in a Hollywood bungalow full of cats and turtles. As he tracks down the pieces of Lev Nussimbaum's deliberately obscured life, Reiss discovers a series of shadowy worlds—of European pan-Islamists, nihilist assassins, anti-Nazi book smugglers, Baku oil barons, Jewish Orientalists—that have also been forgotten. The result is a thoroughly unexpected picture of the twentieth century—of the origins of our ideas about race and religious self-definition, and of the roots of modern fanaticism and terrorism. Written with grace and infused with wonder, The Orientalist is an astonishing book.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Russia",
    "Germany",
    "Jewish",
    "Travel"
  ],
  "author": "Tom Reiss",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/109378.The_Orientalist"
}