{
  "title": "By Degrees",
  "description": "Alternate cover edition of ASIN B00ECBS5OQNew York Times and USA Today Bestselling Author, Elle Casey, brings readers the New Adult Romance By Degrees.Celebrities all suffer from the same disease. I call it the create-your-own-reality disease. Most of them start out normal, like you and me, but somewhere along the way they lose sight of up and down, left and right, and then eventually right and wrong. It's my job to fix that.Who hires me, Scarlett Barnes, otherwise known as ‘The Normalizer’? Agents usually. Producers sometimes. They know they can trust me to be professional, discreet, and above all, not personally involved with my clients. I come in, I take over their lives, and I get them back on track. Help them remember what it's like to be an average Joe.My latest job acquisition? His friends call him Tear-It-Up Kilgour, but I just call him Tarin - lead singer and guitarist for the band By Degrees. I have thirty days to get his butt back on planet earth before he loses his record deal, his movie contract, and possibly even his life. I've never failed so far, and I don't plan on failing this time either, even if Tarin has other ideas.Content Warning: This is a New Adult Romance, perhaps not suitable for younger readers due to foul language, sexual situations, drug use, and obnoxious rock-n-roll musicians.A message from Elle about this book: Every time I read another story about a Hollywood star or famous musician going off the deep end, I wonder how they got there. How it was that all the people around them weren’t able to or willing to stop it from happening. It must be easy when a person has more money than he or she can ever spend and people hanging around are leeches, for a person’s view of reality to get really skewed; and that’s a real shame for these talented people who have so much to share with the world. For years I’ve imagined this great job I could have where I’d hang out with celebrities who’ve lost track of the real world (the place where my readers and I live) and get them re-oriented, re-focused on what matters … clean the garbage out of their heads and their lives. Then of course, I couldn’t get that thought out of my head until I wrote a book about it, so here it is! By Degrees. The title of the book is actually the slogan of the Scottish clan Kilgour, something I learned on a trip I made there in the year this book was written.",
  "genres": [
    "Romance",
    "New Adult",
    "Music",
    "Contemporary",
    "Musicians",
    "Humor",
    "Adult"
  ],
  "author": "Elle Casey",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/18290664-by-degrees"
}