{
  "title": "If It Takes All Summer: The Battle of Spotsylvania",
  "description": "The termination of the war and the fate of the Union hung in the balance in May of 1864 as Robert E. Lee's Army of Northern Virginia and Ulysses S. Grant's Army of the Potomac clashed in the Virginia countryside--first in the battle of the Wilderness, where the Federal army sustained greater losses than at Chancellorsville, and then further south in the vicinity of Spotsylvania Courthouse, where Grant sought to cut Lee's troops off from the Confederate capital of Richmond.This is the first book-length examination of the pivotal Spotsylvania campaign of 7-21 May. Drawing on extensive research in manuscript collections across the country and an exhaustive reading of the available literature, William Matter sets the strategic stage for the campaign before turning to a detailed description of tactical movements. He offers abundant fresh material on race from the Wilderness to Spotsylvania, the role of Federal and Confederate calvary, Emory Upton's brilliantly conceived Union assault on 10 May, and the bitter clash on 19 May at the Harris farm. Throughout the book, Matter assesses each side's successes, failures, and lost opportunities and sketches portraits of the principal commanders.The centerpiece of the narrative is a meticulous and dramatic treatment of the horrific encounter in the salient that formed the Confederate center on 12 May. There the campaign reached its crisis, as soldiers waged perhaps the longest and most desperate fight of the entire war for possession of the Bloody Angle--a fight so savage that trees were literally shot to pieces by musket fire. Matter's sure command of a mass of often-conflicting testimony enables him to present by far the clearest account to date of this immensely complex phase of the battle.Rigorously researched, effectively presented, and well supported by maps, this book is a model tactical study that accords long overdue attention to the Spotsylvania campaign. It will quickly take its place in the front rank of military studies of the Civil War.",
  "genres": [
    "Civil War",
    "History",
    "American Civil War",
    "Civil War Eastern Theater",
    "Military History",
    "Overland Campaign",
    "Civil War History"
  ],
  "author": "William D. Matter",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/1093752.If_It_Takes_All_Summer"
}