{
  "title": "Acts of God",
  "description": "The human race. You have to love it and wish it well and not preach or think you have any reason to think you are better than anyone else. Amen. Good-bye. Peace . . .\n Master short story writer Ellen Gilchrist, winner of the National Book Award, returns with her first story collection in over eight years. In Acts of God, she has crafted ten different scenarios in which people dealing with forces beyond their control somehow manage to survive, persevere, and triumph, even if it is only a triumph of the will. For Marie James, a teenager from Fayetteville, Arkansas, the future changes when she joins a group of friends in their effort to find survivors among the debris left when a tornado destroys a neighboring town. For Philipa, a woman blessed with beauty and love and a life without care, the decision she makes to take control of her fate is perhaps the easiest she has ever made. As she writes to Charles, her husband and lifetime partner, “Nothing is of value except to have lived well and to die without pain.” For Eli Naylor, left orphaned by a flood, there comes an understanding that sometimes out of tragedy can come the greatest good, as he finds a life and a future in a most unexpected place. In one way or another, all of these people are fighters and believers, survivors who find the strength to go on when faced with the truth of their mortality, and they are given vivid life in these stories, told with Ellen Gilchrist’s clear-eyed optimism and salty sense of humor. As a critic in the Washington Post wrote in reviewing one of the author’s earlier works, “To say that Ellen Gilchrist can write is to say that Placido Domingo can sing. All you have to do is listen.\"",
  "genres": [
    "Short Stories",
    "Fiction",
    "Southern",
    "Contemporary",
    "Literary Fiction",
    "American"
  ],
  "author": "Ellen Gilchrist",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/18293425-acts-of-god"
}