{
  "title": "Inheritance: How Our Genes Change Our Lives—and Our Lives Change Our Genes",
  "description": "Award-winning physician and New York Times bestselling author Sharon Moalem, MD, PhD, reveals how genetic breakthroughs are completely transforming our understanding of both the world and our lives.InheritanceConventional wisdom dictates that our genetic destiny is fixed at conception. But Dr. Moalem's groundbreaking book shows us that the human genome is far more fluid and fascinating than your ninth grade biology teacher ever imagined. By bringing us to the bedside of his unique and complex patients, he masterfully demonstrates what rare genetic conditions can teach us all about our own health and well-being.In the brave new world we're rapidly rocketing into, genetic knowledge has become absolutely crucial. Inheritance provides an indispensable roadmap for this journey by teaching -Why you may have recovered from the psychological trauma caused by childhood bullying-but your genes may remain scarred for life.-How fructose is the sugar that makes fruits sweet-but if you have certain genes, consuming it can buy you a one-way trip to the coroner's office.-Why ingesting common painkillers is like dosing yourself repeatedly with morphine-if you have a certain set of genes.-How insurance companies legally use your genetic data to predict the risk of disability for you and your children-and how that impacts the coverage decisions they make for your family.-How to have the single most important conversation with your doctor-one that can save your life.And -Why people with rare genetic conditions hold the keys to medical problems affecting millions.In this trailblazing book, Dr. Moalem employs his wide-ranging and entertaining interdisciplinary approach to science and medicine-- explaining how art, history, superheroes, sex workers, and sports stars all help us understand the impact of our lives on our genes, and our genes on our lives. Inheritance will profoundly alter how you view your genes, your health--and your life.",
  "genres": [
    "Science",
    "Nonfiction",
    "Genetics",
    "Health",
    "Biology",
    "Medicine",
    "Medical"
  ],
  "author": "Sharon  Moalem",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/18296148-inheritance"
}