{
  "title": "Yes Ma'am",
  "description": "A collection of six arse-spanking, wrist-binding, whip-wielding tales of female domination.Lying in WaitCadet Luke Porter is the least successful army recruit in the squadron. The butt of his comrade’s jokes, his reputation badly needs improving, and he is desperate to do well in the ‘seek and rescue’ exercise he’s about to embark upon. Some of his female counterparts, however, have other plans, and are determined to find out just how far Luke will go to improve his standing within the regiment.BlackHe is intoxicated by the woman in black. He can’t explain why he needs to see her, why he willingly does precisely what she tells him to do, or why she has such an effect on him, as she sits him in the backroom of a private club and weaves her web of control. He is beginning to think he has sold his soul to the devil herself.Dear ClaireAli has secretly lusted over Rick, her best friend’s lover, for a long time. At least she thought it was a secret. When her friend, Claire, asks her to take coffee into Rick as he lies in bed, it appears that Claire has left Ali a gift wrapped present; her boyfriend, shackled, blindfold and helpless. Amazed by Claire’s generosity, Ali doesn’t know where to start, until she sees the neat sentence tattooed on Rick’s arse, “If I don’t obey my mistress, I will be punished.”‘Don’t You, Emma?’In a delicious corruption of Lee’s longed for fantasy, his lover, Daisy, arranges for them to share another woman. Rather than enjoying a full-on threesome, however, Lee finds himself forced to sit and observe his partner perform all the chastisements she normally saves just for him upon a girl called Emma. A girl, it seems, who can withstand the punishments Daisy dishes out with far more self control than Lee has ever managed. Simply sitting in an armchair has never been so difficult.Not Taking the TubeVenting his frustration on the nearest official, at being delayed yet again by London’s Underground system, the harassed businessman finds his complaints aren’t received in quite the way he’d expected. The petite guard upon whom he directs his anger has just about had enough of the constant string of complaints from the commuters she tries to help. Swiftly turning the tables on her latest assailant, she releases her own pent up anger quickly, sexily, and with the expert use of her surprised companion’s black leather belt.Rachel’s Twisted TaleImprisoned in a bare room, high at the top of an old house, totally naked – her long golden plait wrapped around her body – Rachel waits. She waits for her mistress gaoler to punish her for being perfect. She waits for Tom, her secret lover, to climb in through the window and fuck her senseless. Rachel knows he could free her. He could help her escape the agonies and humiliations she endures, but she doesn’t want to be saved. Rachel needs to stay. Rapunzel never suffered like this.",
  "genres": [
    "BDSM",
    "Erotica"
  ],
  "author": "Kay Jaybee",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/10940238-yes-ma-am"
}