{
  "title": "City of Savages",
  "description": "It’s been nearly two decades since the Red Allies first attacked New York, and Manhattan is now a prisoner-of-war camp, ruled by Warden Rolladin and her brutal, impulsive warlords. For 17-year-old Skyler Miller, Manhattan is a cage that keeps her from the world beyond the city’s borders. But for Sky’s 16-year-old sister, Phee, the P.O.W. camp is a dangerous playground of possibility, and the only home she’d ever want.When Sky and Phee discover their mom’s hidden journal from the outbreak of the war, they both realize there’s more to Manhattan—and their mother—than either of them had ever imagined. And after a group of strangers arrives at the annual P.O.W. census, the girls begin to uncover the island’s long-kept secrets. The strangers hail from England, a country supposedly destroyed by the Red Allies, and Rolladin’s lies about Manhattan’s captivity begin to unravel.Hungry for the truth, the sisters set a series of events in motion that ends in the death of one of Rolladin’s guards. Now they’re outlaws, forced to join the strange Englishmen on an escape mission through Manhattan. Their flight takes them into subways haunted by cannibals, into the arms of a sadistic cult in the city’s Meatpacking District, and, through the pages of their mom’s old journal, into the island’s dark and shocking past. Sky and Phee are dependent on each other, and their ragged posse, for survival, but as their feelings grow toward the handsome English boy Ryder, love and jealousy threaten to break them apart.While primarily a thriller, City of Savages is also a story about the many meanings of sisterhood, told across two generations of New York women—those who survived a terrible tragedy, and those who were raised to live in its aftermath.",
  "genres": [
    "Dystopia",
    "Young Adult",
    "Science Fiction",
    "Post Apocalyptic",
    "Fiction",
    "Thriller",
    "Adventure"
  ],
  "author": "Lee   Kelly",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/18300869-city-of-savages"
}