{
  "title": "Boob Envy",
  "description": "On my daughters 8th birthday in November 2010, at the age of 35, I was diagnosed with stage 3A Invasive Ductal Carcinoma. In normal-person-terms, that's breast cancer. It was advanced, aggressive, and scary as HELL. I had NO CLUE. I wasn't sick. I wasn't aware of it. I didn't have any sixth sense. When the lump was found-I mourned. I knew my life was going to go straight downhill. Quickly. Things moved so fast-within the week I was admitted to the hospital and was having a bilateral radical mastectomy. I had lymph nodes removed; I lost a chunk of my chest wall muscle; and worst of all I awoke without my double D's :(After getting over 12,500 hits on my CaringBridge journal and MUCH encouragement from friends and family, here it is. The whole naked story. I want the whole world to know the hell of cancer, and raise AWARENESS. Inform EVERYONE I can and get it all off my chest. (Haha-literally!)I found myself looking for ANY source of information for someone in my predicament-a married, young(ish) Mom of three kids, ages 8, 4, and 10. I work full time, I know NOTHING about breast cancer, I am lower middle class. I live in a small community and do not have the resources that exist in large cities. I read lots of books from celebrity stories to self-published non-fiction. I looked for support groups tailored for people my age...my stage of life. No luck. I searched the internet for sites that were a perfect 'fit'. Found maaaaaaybe one. Possibly two. But nothing \"WOW! That's me!\"I have been subjected to MUCH pain and agony...and have been scared shitless. But I came through the other side. I’m still HERE. This book will hopefully shed some light on the whole breast cancer experience for other women. I tell all the grim details.... from my mammogram diagnosis (holy FUCK---are they SURE????) all the way through to my new foobies {fake boobies}. I am 100% honest in my accounts, and hold NOTHING back. There is a lot of \"too much information\" and a lot of make-you-squirm. In it I discuss every test I had. Every procedure I had. Every medicine I tried. Every side effect. Everyday life while living with my cancer. If I can help/inform/give peace of mind to at least ONE person....then I went through this hell for a reason.My name is Shelly, and I am a SURVIVOR. Now I know what you're thinking....oh, cripes...another annoying breast cancer survivor-telling us all to support the cause, race for the cure, blah blah blah-blah-blah. Well, not quite. Actually...not at all. I am a normal woman, from a normal city in Wisconsin, with a very abnormal family, dealing with REAL LIFE struggles. I'm not famous (yet! lol) and I do not have a sugar coated story to tell about how going through cancer really changed my life for the better or how I am just so thankful to have had this horrible thing happen to me. F*CK THAT. I am the Mom of three (count them T-H-R-E-E) kids, two of which are high maintenance…forget that….all THREE of them are high maintenance! Throw in some autism and some celiac disease and some ADHD….and THEY ARE cRaZy!!!!! As you can imagine life on a normal basis is hectic, but once we added cancer to the mix....holy balls. Routine went right out the window. Parenting went right out the window. Survival became the day to day focus. Finding the strength to feed them or make meals; finding the strength to guide or discipline; asking for help with the things I was physically unable to do. i.e. driving the kids to school; grocery shopping; helping the kids with their homework...all impossible.Luckily, I am married to my best friend, Andy, and have been since 1999. We have been together over half of our lives already. No small feat, since we're only 37! We have lived through and survived so many obstacles. You'll have to read the damn book to find out what they are! Anyhow-there is absolutely NO WAY I could have gotten through the last few years without him. He has picked up when I was unable to go on. He has been SO STRONG...for me, the kids, our family, our friends. He took over as a single parent in our house when all I could do was lay in bed for days on end. See, not only am I a cancer survivor.....I made it through LIFE during cancer, and THAT folks is a freakin' miracle. That is the true definition of a survivor....so f*ck off and DIE cancer. I'm DONE with you.",
  "genres": [],
  "author": "Shelly (Knowlton) Jones",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/18301415-boob-envy"
}