{
  "title": "Royal Obsession",
  "description": "Shadow Assassins, Book One: Radical separatists, created at the onset of the Great Conflict, have been made obsolete by years of peace. They live in their subterranean Shadow Maze and only emerge when it's time to breed. For Varrik, that time is now.Varrik, current leader of the Shadow Assassins, knows his people are on the verge of extinction. If they cannot adapt, they will die. Yet if his son were a direct descendant of the High Queen it would secure a place for future generations. Protecting his people is his first priority, so Varrik assembles a hunting party and kidnaps the royal twins. He is determined to claim the eldest for his own.Echo, the younger princess, knows her pampered sister will never survive the sexual appetites of their virile captor. Echo doesn't understand the powerful attraction she feels for Varrik, but drawing his attention is a far better choice than allowing him to overwhelm her twin. She doesn't expect to find him fascinating or to crave the demanding passion he ignites. Can a dominating warrior and his willing captive bring light to the Shadow Maze?Note to Readers: This book contains detailed descriptions of sizzling passion only suitable for mature readers.From Cyndi: I introduced Shadow Assassins clear back in Taken by Storm. Tal mentions, almost in passing, that his mother was killed by one. Years passed as the concept churned away in the back of my mind. Who were the Shadow Assassins and what became of them after the Great Conflict? As I answered these questions, Royal Obsession was born. Then it became apparent that I didn't have one new book; I had a new series. Royal Obsession is part paranormal romance, part capture fantasy. It's hot and unapologetically sexual. Varrik simply wouldn't be tamed and Echo was more than happy to revel in his carnality. Though this story has sci-fi elements, it's less space opera than my previous books. It's always risky when an author shifts gears, but I hope you enjoy the new series!",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Paranormal",
    "Romance",
    "Aliens",
    "Erotica",
    "Paranormal Romance"
  ],
  "author": "Cyndi Friberg",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/18299919-royal-obsession"
}