{
  "title": "Romancing Sal Gabrini 1",
  "description": "Gemma Jones once thought Sal Gabrini could be a keeper. He was, in truth, the man of her dreams. But after she didn’t hear from him when he had promised to stay in touch, she wasn’t thinking about him either. Even when she travels to his turf, to Seattle, to attend a stuffy lawyer’s convention, she’s bound and determined not to give Sal a second thought. The fact that she had refused his sexual advances probably had everything to do with why he didn’t follow up with her, and she understands that. But that understanding only makes her all the more determined to keep him at arm’s length. She might have been known for her slamming body, but that didn’t mean she wants the man of her dreams to only want her for that body.But the convention turns out to be so boring that Trina, her friend and business partner, encourages her to give the man a call. If nothing else he can show her the town and ramp down the boredom, her friend insists. So against her better judgment, Gemma phones him. When he doesn’t return her voice mail message later that night, she wants to kick herself for even bothering.Hunky businessman Sal Gabrini arrives back in town after a trip to Jersey. When he sees where the gorgeously exotic Gemma Jones has left him a message, he realizes how much he actually misses her. He shows up at her hotel, catching her off guard, and that one proactive move takes the pair of would-be lovers on the most tumultuous, yet sexually and emotionally gratifying rollercoaster ride of their lives.Sal has to decide if he is willing to risk it all for the love of a good woman, and Gemma has to decide if a player like Sal Gabrini can ever truly change and become the man she will need him to be. Their tempers flare, their personalities clash, but their love for each other becomes the cornerstone that could actually make their relationship work.In the first book by bestselling author Mallory Monroe that focuses on Tommy’s younger brother Sal, ROMANCING SAL GABRINI is an interracial romance that takes the readers on a compelling journey of love, sex, and tears.",
  "genres": [
    "Interracial Romance",
    "Romance"
  ],
  "author": "Mallory Monroe",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/18304767-romancing-sal-gabrini-1"
}