{
  "title": "Legacy of the Living",
  "description": "In Book One, Jay pulled the town of Newaygo together, helped a National Guard unit, executed a rogue preacher bent on pulling the newly-formed community apart, and was named interim governor for the State of Michigan. Along the way he accumulated three girlfriends while making sure his young children survived.Book Two continues on, beginning with the aftermath of a devastating zombie attack. As the town mourns the loss of many of their near and dear ones, Jay and his military personnel are faced with the chilling discovery that the zombies have evolved—have become even more clever and cunning. And they seem to be focusing their attacks on the children of the survivors!Jay knows that in order to survive the influx of the multitudes of undead hordes, as well as the anticipated attacks by the Shadow Government, he must be ready. He does not intend to lose any more of his people. Under his direction, Newaygo’s ever-expanding group of survivors dig in and begin rebuilding. Their numbers have increased to the point that nearby Fremont is cleared and designated a new home for incoming survivors. Master Sergeant Darin Trask begins intense weapons training of Jay’s people, including Jay’s girls.Jay doesn’t plan on merely surviving–he will take this battle to them! His intentions become a reality when he is joined by Major Robinson and elements of the 9th Special Forces Group and those of the 162nd SOAR.The Shadow Government continues with their machinations in support of their New World Order Eugenics plan. Dr. Lynch, under the direction of a handful of world leaders, will sacrifice anything and everyone in his way in order to achieve their goal. Realizing that something is very wrong at the CDC, Dr. Samuel Thomas escapes with vital information. Can he make it through the devastated, war-torn countryside and find someone who can use this knowledge—to save the United States of America—and the world?Meanwhile, the Reaper and his new apprentice, Travis, embark on a mission to reduce the ranks of the dead. They are assisted in their efforts by a lesbian biker gang, led by Chief Biker Alethea. Several groups of survivors are encountered, including the disabled and autistic heroes of Clear Haven Rehabilitation Clinic. They battle to save the newborns of nearby Mercy Hospital, even as they are about to be overrun by hundreds of thousands of zombies.",
  "genres": [
    "Zombies",
    "Horror"
  ],
  "author": "Sean Liebling",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/18305045-legacy-of-the-living"
}