{
  "title": "His Perfect Sweetness",
  "description": "18 year old school girl Krista Wyatt knew poverty. After her Daddy passed away she and Mom struggled to make ends meet, and it was only when her Mom went to work for the enigmatic millionaire Jack Ryland that Krista could finally achieve her dream of a college education. The fact that Jack and Mom fell in love and married was just the icing on the cake. However, Krista's new wealthy lifestyle is threatened by the discovery that Jack made an... unusual demand in his prenuptial agreement. A demand that only Krista can meet: Daddy needs a baby, and only his wife's daughter's fertile womb can give it to him.This 8,500 word short story contains explicit descriptions of sex between an 18 year old virgin schoolgirl stepdaughter and the man who married her mother. It contains scenes including oral sex, face fucking, deep throat, orgasm denial, domination, submission, virgin sex, breeding and impregnation fantasies, and spanking. It is intended only for the enjoyment of adults. Excerpt:\"Do you want me to fill you up, sweetness? Do you want me to spread your little pussy and put my baby in your belly?\" His hands reached down between us. With one he lifted my pick camisole up to my breasts, and he used the other to guide the wet, juicy head of his cock firmly into my belly button. He poked me gently, then moved the tip around the rim of my navel, teasing me with it. As he moved I saw a glistening line of come cover my belly, and as he pulled his beautiful tool away from me it stretched, connecting my stomach with the tip of his cock until it finally dripped to my legs. \"Yes please. I need you inside me.\" My words came out in a breathless whisper, catching when he pressed that perfect thing against me once again. Without another word he slid his hands up my sides, lifting the silky pink camisole from my body and over my head. He dropped it to the floor, and for the first time he got a good look at my small, pert breasts and the hard pink nubs of my nipples.",
  "genres": [],
  "author": "Aya Fukunishi",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/18306144-his-perfect-sweetness"
}