{
  "title": "I Loved a Paedophile - The Seduction Abduction and Liberation",
  "description": "When Lisa Turner was 12 ½ she met her music teacher for the first time. He spent over 2 years seducing and grooming her. At the age of 15 he abducted her and kept her as a house prisoner for 5 years until she finally managed to escape when she was 20.This is her personal story of her experiences. But unlike many of the “misery lit” books this is a more considered account. Rather than labelling herself as a victim or survivor, and her abuser as a monster, she explains the complexities of how such a situation could come about.Please note this book contains detailed descriptions of a sexual nature. She’s being very intimate and baring all.The book answers all the most common questions that she gets asked. Questions like:The seduction: How did it start? What was the attraction? Did your friends, parents, teachers know? When did you first start having sex? How do paedophiles groom their victims? How can you spot if your child is being groomed by a paedophile?The abduction: How did he get you from your home in Australia to London? How did he keep you locked up? What was your daily life like? What did your teachers think? What was his hold over you? Why didn’t you leave? How often did he rape you?The liberation: How did you get out? What happened when you left? What happened after you left? Did you ever see him again? How did it affect you? How did you recover? How did you learn to forgive? How did you turn your life around?There are three levels on which you can read this book:1. Just enjoy the story. The extraordinary events themselves make a riveting read.2. Gain understanding into how paedophiles groom and manipulate their victims and into abusive relationships and why it is so very hard for the victims to leave.3. Read it to heal your own past trauma.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Lisa Turner",
  "average_rating": "3.22",
  "url": "https://www.goodreads.com/book/show/18307183-i-loved-a-paedophile---the-seduction-abduction-and-liberation"
}