{
  "title": "The Breakers Series #1-3",
  "description": "In the Breakers series, humanity faces not one apocalypse, but two: first a lethal pandemic, then a war against those who made the virus. This collection includes the first three books and is over 1000 pages (350,000 words) of post-apocalyptic survival.BREAKERS (Book 1)In New York, Walt Lawson is about to lose his girlfriend Vanessa. In Los Angeles, Raymond and Mia James are about to lose their house. Within days, none of it will matter. A plague tears across the world, reducing New York to an open grave and LA to a chaotic wilderness of violence and fires. Civilization comes to an abrupt stop.Just as the survivors begin to adapt to the aftermath, Walt learns the virus that ended humanity wasn't created by humans. It was inflicted from outside. The colonists who sent it are ready to finish the job--and Earth's survivors may be too few and too weak to resist.MELT DOWN (Book 2)In upstate Idaho, Ness Hook is run out of his mom's house by his bullying brother Shawn. In Redding, California, Tristan Carter is graduating college, but with no job and no prospects, she'll have to move back in with her parents.Then the world ends: first with a virus, then with an alien invasion.Ness and Shawn take to the mountains to fight a guerrilla against the attackers. In California, Tristan and Alden are taken prisoner. Separated from her brother, Tristan crosses the ruins of America to track him down. She will stop at nothing to get Alden back--but her fellow survivors prove even more dangerous than the monsters who broke the world.KNIFEPOINT (Book 3)Raina was just a girl when the plague came. She survived. Her parents didn't. Neither did the world. As civilization fell, she took to the ruins of Los Angeles, eating whatever she could catch.After two years alone, she's found and adopted by a fisherman and his wife. Their makeshift family lives a quiet life--until a man named Karslaw sails in from Catalina Island with an army of conquerors. Driven by visions of empire, he executes Raina's new father as a traitor and takes her mother captive.But Karslaw's people aren't the only ones vying for control of the ruined land. As violence wracks the city, Raina joins a rebellion against Karslaw's rule. She will stop at nothing to free her mother--and to have her revenge.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Dystopia",
    "Post Apocalyptic",
    "Amazon",
    "Apocalyptic",
    "Fantasy"
  ],
  "author": "Edward W. Robertson",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/18308283-the-breakers-series-1-3"
}