{
  "title": "Expeditionen: Min kärlekshistoria",
  "description": "Juli 1897. Ingenjör Andrées expedition ger sig iväg i en vätgasballong med riktning Nordpolen. En djärv idé, chanslös från start. Snart befinner sig tre män, med minimala kunskaper om arktiska förhållanden, mitt i en vit mardröm.I trettiotre år undrar en kvinna vart hennes fästman tog vägen. År 1930 hittas männen på en öde glaciärö i ishavet. Deras infrusna dagbok meddelar: nödlandning på isen efter tre dagar i luften. I månader drar de sina flera hundra kilo tunga slädar och försöker ta sig tillbaka till fast mark. På Vitön upphör plötsligt alla anteckningar.I över hundra år har läkare, polarhistoriker, författare och journalister försökt lösa gåtan vad som hände på Vitön. Varför dog expeditionsmedlemmarna innan de ens packat upp slädarna, med varma kläder ouppackade, med matkonserver oöppnade, med tre fungerande gevär och lådvis av ammunition?I Expeditionen. Min kärlekshistoria letar författaren och läkaren Bea Uusma efter sanningen om expeditionens öde. Hon gräver i arkiv och i polartrakternas permafrusna jordlager. Hon reser i Arktis och till Nordpolen. Hon träffar efterlevande, rättsläkare, osteologer, kriminaltekniker och brottsplatsutredare och söker svar i laboratorieprov, packlistor och i det enda som finns kvar av Andrée själv några nagelfragment som fastnat längst in i hans handskar.Resultatet är inte enbart en bok som kullkastar gamla teorier och ger nya svar på vad som egentligen hände. Berättelsen om världens mest misslyckade polarexpedition rymmer även en konsertpianist vars händer inte kan sluta skaka och en spådam i en cykelkällare i Bredäng. Men det är också en historia om Bea själv. Varför blir en ovanligt bekväm person som hatar att frysa besatt av en hundra år gammal polarexpedition och ägnar sitt liv åt att följa i dess igensnöade fotspår? Ständigt på rätt plats, men i fel tid.Expeditionen. Min kärlekshistoria ges samtidigt ut i två utföranden: en textbok i mjukband och en påkostad illustrerad utgåva med foton, teckningar, kartor och ett omfångsrikt extramaterial.",
  "genres": [
    "Nonfiction",
    "History",
    "Swedish Literature",
    "Biography",
    "Historical",
    "Travel",
    "Adventure"
  ],
  "author": "Bea Uusma",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/18310467-expeditionen"
}