{
  "title": "We, The Watched",
  "description": "An amnesiac struggles to conform in a surveillance society where the government keeps a Watched list of its own citizens.\"Fueled by a brilliantly nebulous backdrop, this briskly paced, action-packed novel is undeniably a page-turner of the highest order... A deeply allegorical and powerfully thought-provoking dystopian must-read.\" - Kirkus ReviewsSeven wakes in a forest outside the capital of a nation he doesn't recognize. When he enters the city, he discovers a surveillance society with no separation between Church and State. Those who rebel are called Heretics and face execution. Seven’s blank-slate perspective lets him see through the government's propaganda, but attracts the eyes of the Guard.The debut novel by Adam Bender exposes a current political issue in an exciting science fiction adventure, carrying on the tradition of dystopian classics 1984 by George Orwell and Fahrenheit 451 by Ray Bradbury, as well as more recent blockbuster novels like The Hunger Games by Suzanne Collins.\"The dialog was excellent and the situations seemed driven by curiosity, which is a great way to pull you into an adventure. The detail of the forest and every part of the book helped me visualize the world and kept me submersed in the story. The author captures the imagination of the reader creating an addicting story.\" -- Readers Favorite\"There's action, romance, and social commentary woven into a brilliant story with an amazing plot twist near the end ... It's science fiction in the way that Orwell's 1984 or Fahrenheit 451 by Ray Bradbury dystopian novels are considered science fiction ... The writing is nearly on par with these geniuses of the written word.\" -- The American ChronicleContinue Seven's adventure in Divided We Fall by Adam Bender.",
  "genres": [
    "Dystopia",
    "Fiction",
    "Science Fiction"
  ],
  "author": "Adam Bender",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/18308883-we-the-watched"
}