{
  "title": "The ADHD Explosion: Myths, Medication, Money, and Today's Push for Performance",
  "description": "Attention-deficit/hyperactivity disorder (ADHD) is one of the most controversial and misunderstood medical conditions today. With skyrocketing rates of diagnosis and medication treatment, it has generated a firestorm of controversy. Alarming questions have been raised about ADHD in recent years, *Why are one in nine children and adolescents in the U.S. now diagnosed with ADHD, with projected rates still rising?*Why are nearly 70% of those diagnosed with ADHD prescribed medication?*What is causing the fast-rising diagnosis and medication of adults ? And why are over a quarter of all college students using stimulants for academic performance?*In some southern states, why are boys over 9 years old diagnosed at rates of almost one in three?*Can we trust the stories we read and hear about ADHD, even in major media outlets?*What is driving the current ADHD explosion--is it parents, doctors, schools, culture, the healthcare system, or Big Pharma? And will it end?Stephen Hinshaw, a distinguished psychologist, and Richard Scheffler, an eminent health economist, uniquely blend clinical wisdom, current science, medical and school policy, and global trends to debunk myths and set the record straight in The ADHD Explosion . They describe the origins of ADHD and its huge costs to society; the science behind its causes as well as medication and behavioral treatment; and the variation in diagnosis and treatment across the U.S. Dealing directly with stimulants as \"smart pills,\" they describe the epidemic of medicalization, arguing that accurate diagnosis and well-monitored care could ease the staggering economic burden linked to ADHD.In innovative ways, they unravel the many poignant issues facing children, teachers, clinicians, and family members who contend with ADHD each day. The recommendations they make can improve the quality of life for those touched by ADHD and potentially improve the productivity and safety of all society.",
  "genres": [
    "Psychology",
    "Adhd",
    "Nonfiction",
    "Health",
    "Mental Health"
  ],
  "author": "Stephen P. Hinshaw",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/18311213-the-adhd-explosion"
}