{
  "title": "The 40s: The Story of a Decade",
  "description": "This captivating anthology gathers historic  New Yorker  pieces from a decade of trauma and upheaval—as well as the years when  The New Yorker  came of age, with pieces by Elizabeth Bishop, Langston Hughes, Joseph Mitchell, Vladimir Nabokov, and George Orwell, alongside original reflections on the 1940s by some of today’s finest writers. In this enthralling book, contributions from the great writers who graced  The New Yorker ’s pages are placed in historical context by the magazine’s current writers. Included in this volume are seminal profiles of the decade’s most fascinating Albert Einstein, Walt Disney, and Eleanor Roosevelt. Here are classics in John Hersey’s account of the heroism of a young naval lieutenant named John F. Kennedy; Rebecca West’s harrowing visit to a lynching trial in South Carolina; and Joseph Mitchell’s imperishable portrait of New York’s foremost dive bar, McSorley’s. This volume also provides vital, seldom-reprinted criticism, as well as an extraordinary selection of short stories by such writers as Shirley Jackson and John Cheever. Represented too are the great poets of the decade, from William Carlos Williams to Langston Hughes. To complete the panorama, today’s  New Yorker  staff look back on the decade through contemporary eyes.  The 40 The Story of a Decade  is a rich and surprising cultural portrait that evokes the past while keeping it vibrantly present.Including contributions by  W. H. Auden • Elizabeth Bishop • John Cheever • Janet Flanner • John Hersey • Langston Hughes • Shirley Jackson • A. J. Liebling • William Maxwell • Carson McCullers • Joseph Mitchell • Vladimir Nabokov • Ogden Nash • John O’Hara • George Orwell • V. S. Pritchett • Lillian Ross • Stephen Spender • Lionel Trilling • Rebecca West • E. B. White • Williams Carlos Williams • Edmund Wilson And featuring new perspectives by  Joan Acocella • Hilton Als • Dan Chiasson • David Denby • Jill Lepore • Louis Menand • Susan Orlean • George Packer • David Remnick • Alex Ross • Peter Schjeldahl • Zadie Smith • Judith Thurman",
  "genres": [
    "History",
    "Nonfiction",
    "Essays",
    "Short Stories",
    "Journalism",
    "World War II",
    "Anthologies"
  ],
  "author": "The New Yorker",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/18310234-the-40s"
}