{
  "title": "Gailene's Vow",
  "description": "GAILENE'S VOW is the delicious, but tormenting tale of two women as they become vampires. Gailene must rise from devastation, rage, and vengeance in 1790s rural England, leaving her human family, to become a powerful vampire matriarch in fledgling 1800s America. Two centuries later, college coed, Zondra, discovers she's the leader of her grandmother's empire when she begins turning, though never bitten. Gailene's story unfolds to Zondra through their familial blood, revealing a tragic destiny, but poignant love both women have for Jeremiah. He lives in anguish while preparing Zondra to protect her new family against the retribution of Gailene's creator.***SZEJNA'S REVENGE, book two of the ORIGINAL BLOOD series, will launch in October.***5* Mr. Land's (ORIGINAL BLOOD) is captivating. His writing is forceful, drawing the reader in to be a participant. I felt like I lived every scene, experiencing every event, feeling breathless at the sensual and remarkable love that spans lifetimes. A stellar book, one you should add to your to be read pile. His bold take on vampires is so original that one has to read this book, like drinking aged wine, taking small sips a little at a time, to discern its bouquet. Review by Gloria Lakritz - Senior Reviewer and review Chair for the Paranormal Romance Guild5* (ORIGINAL BLOOD) It's indeed original. Stuart Land shows such love for one of horror's icons. The audaciousness is wonderful and so mesmerizing. It's a fine book, written with style, dignity and class. Barry Eysman-TN5 STARS isn't enough for ORIGINAL BLOOD! A terrific book. Attention to historic detail & descriptive words are outstanding. Character development is pure perfection! Michael Phelps-FLA5* I have to admit, ORIGINAL BLOOD not only held my attention, it gripped me. As in, I couldn't close the damned thing to go get some sleep. It's just simply a powerful read. Charles Burke - Author, The Business Owner's Quantum Cash Pump",
  "genres": [],
  "author": "Stuart Land",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/10944569-gailene-s-vow"
}