{
  "title": "Jet Set: The People, the Planes, the Glamour, and the Romance in Aviation's Glory Years",
  "description": "In October 1958, Pan American World Airways began making regularly scheduled flights between New York and Paris, courtesy of its newly minted wonder jet, the Boeing 707. Almost overnight, the moneyed celebrities of the era made Europe their playground. At the same time, the dream of international travel came true for thousands of ordinary Americans who longed to emulate the “jet set” lifestyle.   Bestselling author and Vanity Fair contributor William Stadiem brings that Jet Age dream to life again in the first-ever book about the glamorous decade when Americans took to the skies in massive numbers as never before, with the rich and famous elbowing their way to the front of the line. Dishy anecdotes and finely rendered character sketches re-create the world of luxurious airplanes, exclusive destinations, and beautiful, wealthy trendsetters who turned transatlantic travel into an inalienable right. It was the age of Camelot and “Come Fly with Me,” Grace Kelly at the Prince’s Palace in Monaco, and Mary Quant miniskirts on the streets of Swinging London. Men still wore hats, stewardesses showed plenty of leg, and the beach at Saint-Tropez was just a seven-hour flight away. Jet Set reads like a who’s who of the fabulous and well connected, from the swashbuckling “skycoons” who launched the jet fleet to the playboys, moguls, and financiers who kept it flying. Among the bold-face names on the passenger manifest: Juan Trippe, the Yale-educated WASP with the Spanish-sounding name who parlayed his fraternity contacts into a tiny airmail route that became the world’s largest airline, Pan Am; couturier to the stars Oleg Cassini, the Kennedy administration’s “Secretary of Style,” and his social climbing brother Igor, who became the most powerful gossip columnist in America—then lost it all in one of the juiciest scandals of the century; Temple Fielding, the high-rolling high priest of travel guides, and his budget-conscious rival Arthur Frommer; Conrad Hilton, the New Mexico cowboy who built the most powerful luxury hotel chain on earth; and Mary Wells Lawrence, the queen bee of Madison Avenue whose suggestive ads for Braniff and other airlines brought sex appeal to the skies.    Like a superfueled episode of Mad Men, Jet Set evokes a time long gone but still vibrant in American memory. This is a rollicking, sexy romp through the ring-a-ding glory years of air travel, when escape was the ultimate aphrodisiac and the smiles were as wide as the aisles.  Praise for Jet Set “Aeronautics history, high times from the 1950s and ’60s, incredibly versatile name-dropping (from Mrs. John Jacob Astor to Christine Keeler of the Profumo scandal) and Sinatra’s ‘Come Fly With Me’ as a kind of theme song [all] connected to the glamorous days of air travel.”—Janet Maslin, The New York Times\n \n “What a book William Stadium has written. . . . The Kennedys, the Rat Pack, Frank Sinatra, and early financiers like Eddie Gilbert are dealt with in depth. . . . I lived intimately through it all in the ’50s, ’60s, ’70s, ’80s, and ’90s and I am yet to find a mistake in author Stadiem’s amazing book. Order it now. All the players are here.”—Liz Smith, syndicated columnist\n \n “William Stadiem sexes up the glory days of aviation in Jet Set. Fly me!”—Vanity Fair\n \n “William Stadiem’s Jet Set takes you where no modern airliner can: to a time . . . when the means of travel was as exotic as the destination, and sometimes more so.”—Town & Country",
  "genres": [
    "Nonfiction",
    "History",
    "Aviation",
    "Travel",
    "American History",
    "Business",
    "Historical"
  ],
  "author": "William Stadiem",
  "average_rating": "3.16",
  "url": "https://www.goodreads.com/book/show/18310177-jet-set"
}