{
  "title": "Fierce Patriot: The Tangled Lives of William Tecumseh Sherman",
  "description": "NATIONAL BESTSELLERWilliam Tecumseh Sherman was more than just one of our greatest generals. Fierce Patriot is a bold, revisionist portrait of how this iconic and enigmatic figure exerted an outsize impact on the American landscape—and the American character. America’s first “celebrity” general, William Tecumseh Sherman was a man of many faces. Some were exalted in the public eye, others known only to his intimates. In this bold, revisionist portrait, Robert L. O’Connell captures the man in full for the first time. From his early exploits in Florida, through his brilliant but tempestuous generalship during the Civil War, to his postwar career as a key player in the building of the transcontinental railroad, Sherman was, as O’Connell puts it, the “human embodiment of Manifest Destiny.” Here is Sherman the military strategist, a master of logistics with an uncanny grasp of terrain and brilliant sense of timing. Then there is “Uncle Billy,” Sherman’s public persona, a charismatic hero to his troops and quotable catnip to the newspaper writers of his day. Here, too, is the private Sherman, whose appetite for women, parties, and the high life of the New York theater complicated his already turbulent marriage. Warrior, family man, American icon, William Tecumseh Sherman has finally found a biographer worthy of his protean gifts. A masterful character study whose myriad insights are leavened with its author’s trademark wit, Fierce Patriot will stand as the essential book on Sherman for decades to come.Praise for Fierce Patriot “A superb examination of the many facets of the iconic Union general.” —General David Petraeus “Sherman’s standing in American history is formidable. . . . It is hard to imagine any other biography capturing it all in such a concise and enlightening fashion.” — National Review “A sharply drawn and propulsive march through the tortured psyche of the man.” — The Wall Street Journal “[O’Connell’s] narrative of the March to the Sea is perhaps the best I have ever read.” —Jonathan Yardley, The Washington Post “A surprising, clever, wise, and powerful book.” —Evan Thomas, author of Ike’s Bluff",
  "genres": [
    "History",
    "Biography",
    "Civil War",
    "Nonfiction",
    "American History",
    "American Civil War",
    "Military Fiction"
  ],
  "author": "Robert L. O'Connell",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/18310279-fierce-patriot"
}