{
  "title": "Devious Desires",
  "description": "Publication Date: August 8, 2013Desire can be a dangerous drug, potently powerful and difficult to resist. Place such pleasurable possibilities in the hands of a supernatural, and you have a recipe for, shall we say, decadent disaster...Sustenance: An Erotic Short: My inner beast prowled inside of me, purring with anticipation as I gazed out, hidden, at the unsuspecting young woman reclining so peacefully in the place she wasn't supposed to be. Sparing her was not an option, for the beast was already entranced by her intoxicating scent, and his will could not be denied...Salivate: An Erotic Short: The icy blue of his gaze was overwhelming, bathing my body in a possessive light that set my nerves on fire. Moonlight washed over the forest glen, suffusing the chiseled planes of his body in an otherworldly glow, glinting off of the fangs that had begun to emerge from his mouth before my terrified stare. He was dangerously beautiful, and I wondered, nay, feared if I would be able to withstand the passions of a werewolf...Carnal Kisses: Seduced by the Succubus: Tobias had traversed through my dreams for a multitude of nights, driving me mad with lustful fascination. Oh, how desperately I desired to feast on his flesh, to introduce him to the erotic pleasures a body could experience. I would have him, for the force of my need could not be denied...Centerpiece: An Erotic Short: Fueled by a hunger born of self imposed sleep, Lenora's desires had blossomed into a desperate desire to feed. Tonight, awakened once more after decades of denial, Lenora would feast. Her immortal progeny had secured for her a mortal prize for her triumphant return to the nighttime world of their society, and with the highest of appreciation she would not let him go to waste...Deprivation: An Erotic Short: *an erotic vampire short story*She was the perfect pick, a delectable dessert that would satisfy a hunger that had burned within my body for days and days...Acquiescence: He was here.I could sense him all around me, his intoxicating scent permeating every inch of my bedroom. It surrounded me and seeped into my skin, decadent and utterly dangerous. I knew the price I would have to pay, the promises that must be honored when one called upon an Incubus for aid. He would take what was owed to him, and I found myself unable to control the shivers that swept wickedly throughout my body at the thought...",
  "genres": [
    "Erotica"
  ],
  "author": "Lucinda Lovington",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18310964-devious-desires"
}