{
  "title": "Bad Guys",
  "description": "“Fans of the crime caper will rejoice” that Linwood Barclay is back with the hilarious follow-up to his “riotously funny and irreverent” debut, in which paranoid pop Zack Walker plotted to transplant his city-savvy wife and two teenage kids to the tranquillity of the burbs–where planned communities prevail and fathers rest easy. Well, not quite…and now the Walkers have moved home only to find themselves living in the precarious crosshairs of urban sprawl once again, and Zack can’t help but be worried–really worried–that just around the corner lurks the presence of some really bad guys.Zack is back, and much to his family’s relief, the work-at-home science-fiction writer has left the house to take a job as a features writer for the city paper. But now that Zack’s incessant plotting can no longer be hatched from the comforts of his own home, he must be ever more vigilant to outwit the evil at large, whether in the suburbs, the city, or his own imagination. Zack is ready…or so he thinks.While researching his first feature article, Zack stumbles upon a real-life crime scene, but what seems like an ordinary hit-and-run may actually be a homicide linked to a gang that’s been burglarizing Crandall’s high-end shops. Suddenly Zack finds himself at the center of a violent crime wave and destined for a confrontation with Barbie Bullock, an unsettling figure infamous in the crime syndicate for his ruthless business tactics and peculiar proclivity for collecting dolls.And all is not quiet on the home front either. Zack’s protective instincts launch into overdrive when he discovers that his daughter’s rejected suitor has been tracing her every step and may harbor a much more ominous motivation than winning a Saturday night date. Nor does his son’s strange behavior and recent friendship with a creepy computer recluse inspire joy in a father’s heart. As worlds begin to collide and boundaries between family and foe blur, Zack goes on the attack, and heaven help the bad guys when this resourceful father comes to make good on a deal gone bad.From the Hardcover edition.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Crime",
    "Canada",
    "Humor"
  ],
  "author": "Linwood Barclay",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/1832204.Bad_Guys"
}