{
  "title": "Why Do Dogs Drink Out of the Toilet?: 101 of the Most Perplexing Questions Answered About Canine Conundrums, Medical Mysteries & Befuddling Behaviors",
  "description": "Because They're Dogs! That's why dogs drink out of the toilet. That's why they bark when you're on the phone, smell each other's behinds, go crazy when they see the letter carrier, jump up to say hello and roll in stuff that stinks. Everything they do makes perfect canine sense to dogs. And after you read Why Do Dogs Drink out of the Toilet? , it will make perfect sense to you, too. Award-winning pet experts Dr. Marty Becker and Gina Spadafori take you on a trip into the canine mind. And it's not at all a scary place. . . . Dogs live to smell, to feel good, to clarify their relationship with other dogs (and with us), to love, to laugh. When you start looking at the world their way, everything falls into place. Of course they drink out of the toilet—the water is fresher. Sniffing another dog's behind is just like reading their resume, except you know nothing is made up. Barking at the letter carrier makes him go away—every single time! And rolling in stinky stuff just smells like heaven. (Because what smells heavenly is, after all, a matter of taste.) The better you understand dogs, the easier it is to love the pooch on your couch. Find out why hunting dogs don't mind suppressing their basic instinct, how assistance dogs for the blind get their job done, why little dogs like to mix it up with big dogs, and everything you always wanted to know about canine sex but were afraid to ask. You'll also find the answers to questions that tend to tickle your How do dogs get into dog shows? Which breeds are made in America? Do some dogs really have dreadlocks? Do all dogs need a backyard? How did Lassie always find her way home? You've got questions? This book's got answers.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Dogs"
  ],
  "author": "Marty Becker",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/183122.Why_Do_Dogs_Drink_Out_of_the_Toilet_"
}