{
  "title": "Stella! Mother of Modern Acting",
  "description": "(Applause Books). Arthur Miller decided to become a playwright after seeing her perform with the Group Theater. Marlon Brando attributed his acting to her genius as a teacher. Theater critic Robert Brustein calls her the greatest acting teacher in America. At the turn of the 20th century by which time acting had hardly evolved since classical Greece Stella Adler became a child star of the Yiddish stage in New York, where she was being groomed to refine acting craft and eventually help pioneer its modern gold standard: method acting. Stella's emphasis on experiencing a role through the actions in the given circumstances of the work directs actors toward a deep sociological understanding of the imagined characters: their social class, geographic upbringing, biography, which enlarges the actor's creative choices. Always \"onstage,\" Stella's flamboyant personality disguised a deep sense of not belonging. Her unrealized dream of becoming a movie star chafed against an unflagging commitment to the transformative power of art. From her Depression-era plays with the Group Theatre to freedom fighting during WWII, Stella used her notoriety as a tool for change. For this book, Sheana Ochoa worked alongside Irene Gilbert, Stella's friend of 30 years, who provided Ochoa with a trove of Stella's personal and pedagogical materials, and Ochoa interviewed Stella's entire living family, including her daughter Ellen; her colleagues and friends, from Arthur Miller to Karl Malden; and her students from Robert De Niro to Mark Ruffalo. Unearthing countless unpublished letters and interviews, private audio recordings, Stella's extensive FBI file, class videos and private audio recordings, Ochoa's biography introduces one of the most under recognized, yet most influential luminaries of the 20th century.",
  "genres": [
    "Biography",
    "Art",
    "Nonfiction"
  ],
  "author": "Sheana Ochoa",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/18318774-stella-mother-of-modern-acting"
}