{
  "title": "In Your Element: Ancient Wisdom for Modern Times",
  "description": "Unravel the secrets of who you are and discover the secrets to better health and emotional wellbeing. Are you seeking to understand yourself and others better? If, so In Your Element can provide you with easy to understand and practical tools to aid you in that quest. It is a simple truth that people are different and the inbuilt questionnaire allows you to quickly and easily discover your type. One of the secrets to happiness is recognising and accepting that there are different personality types. Knowing what makes you tick is important, so you don’t end up being a square peg in a round hole. You can apply this knowledge to your lifestyle choices, career path and when seeking a life partner as well as for more harmonious relationships at work, home and play.Trying to be someone you are not is stressful and a common cause of unhappiness. Taking this theme further, the authors connect personality typing with cutting edge research from the medical field that now acknowledges there is a link between emotional disharmony and disease. This is in fact ancient wisdom and forms the basis of modern naturopathic philosophy where body, mind, heart and spirit are all interwoven and relevant. Author Linn Wiggins brings this into a modern context by explaining how specific plant remedies such as flower essences can positively affect lasting change for the better in your mood and attitudes. She also reveals how various foods affect each personality type and non-restrictive, easy to understand guidelines on how to eat according to your type for an improved sense of physical and emotional well wellbeing. Understanding others allows you to work with (not against) them and play to their inherent strengths. Authentic, harmonious relationships are based on understanding where others are coming from and being able to speak their language, not just your own. This is true in all relationships, be it with your boss, teacher, children, spouse, lover, neighbour, friends or colleagues. Rather than try to change people, this book gives you valuable insights on how to best communicate with others, and encourage and guide them towards areas where they are more likely to shine and succeed. While the best selling book “How to win friends and influence people” appeals to extroverts, and “Quiet” by Susan Cain showcases the gifts of introverts, In Your Element explores how both extroverts and introverts operate, for a fuller picture. It also looks at other time honoured personality systems including the Myers-Briggs system and the work of David Kiersey. Author Michael White distills this complex information into four easily remembered Australian animals and their immediately recognisable personality traits in a way that appeals to beginners and experts alike.Both authors are gifted lecturers and recognised experts in their respective fields of personality typing and natural health. By combining their experience and skills they have created an easy to understand, unique and comprehensive system that can be used every day in all relationships; business and personal; in the classroom, the boardroom, the office, the clinic and at home – for marriage, parenting, leadership, sales, human resources, mentoring, learning and healing.",
  "genres": [
    "Self Help"
  ],
  "author": "Michael White",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/18317629-in-your-element"
}