{
  "title": "Cosmogonic Marbles",
  "description": "In the endless Cosmoses that exist in the Multi-verse (with equally endless possibilities) the adventures of two brothers, on an Earth where all myths are real and on our own dull magicless Earth, don’t amount to a hill of beans (except in the Cosmoses where they do amount to hills of beans …but that’s another novel).In this story Philip Philips, a failed businessman, and his twin brother James, are unwilling participants in a battle of Good versus Evil when a mysterious gateway is opened by a minor God from a Dark-Age twin Earth.It should have been James Philips who was found by the Dark Stranger and transported by an inter-dimensional being in the guise of a Womble to the Dark-Age Earth filled with every magical creature imaginable. But, as Fate would have it, it’s Philip, the useless one, who ends up leading a group of misfits across Medieval England to mount rescues, battle Hobgoblins and generally save the World(s).James Philips meanwhile is stuck on dull, magicless, Earth in his old college, Botolf-almost-Oxford, which he discovers is staffed solely by men dedicated to the protection of our Earth from the paranormal. His old mentor, now living in a video recording, introduces him to an array of strange allies, as London, England and the World face an ‘alien’ invasion of swords and sorcery.Others are caught up in the events of the inter-cosmic connection between two Earths; Vortigern the King has been bred for conquest and now his eyes are on our world. He brings with his armies many wizards, who themselves have gained an eye for the throne.Sam, a young boy from West London has been sent through the gateway to the dark world of magic where he meets Snodrod and the children of an enslaved village, their only wish to get back to their homes; but they face enormous challenges … not least, Dragon-shaped ones.The story, as told here in the first Chronicle of Botolf, takes place simultaneously in both Earths, where the connection between worlds has a strange echoing effect on every character.Will the world be saved? Can the Wrong man do the job? Is this a rhetorical question?All will be answered in this comedy/fantasy/mock-u-history tale.Steve Downesp.s. There’s also a sarcastic Oak Tree in there somewhere.",
  "genres": [
    "Humor",
    "Fantasy"
  ],
  "author": "Steve Downes",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/18326190-cosmogonic-marbles"
}