{
  "title": "Invented August: An Imperfect Escape to Capri",
  "description": "THE VERY ACHE THAT BONDS THEM WILL TEAR THEM APARTWhen Lily, a chic menswear designer, is offered a photo editorial in Italy, she invites her best friends to join her on the Isle of Capri for a dream escape from husbands and children. Friends for over 12 years, wives of golf buddies, these six are bravely enduring their marriages with a Doris Day morality. But it’s 1979 in swinging L.A., where the stigma of divorce has all but dissolved. They head off with the best of intentions, so sure that they will find Renewal. Each has reason to crave LILY , a peacemaker and born storyteller, honors her marriage to an emotional tyrant although clearly beaten down. GRACE , a model, as striking as she is opinionated, is a devoted wife but remains bravely unfulfilled. PENN , a prim, dutiful perfectionist, ignores her husband’s frequent and extended cocktail meetings as if their church attendance will bring transformation. DEEDEE , a bodacious bombshell, a brassiere-fitting specialist, grows weary of her immature husband who despises his stepdaughter and mother-in-law. CAT , a self-absorbed dreamer, grasps for purpose, railing against her traditional Italian husband and his meddlesome, dominating mother. AMELIA , a beauty, nurturing and resilient, chooses the security of marriage while resenting her husband’s philandering. Their mutual expectation of renewal—rekindled patience for flawed spouses and unruly children—warps violently given Capri’s temptations. Two factions four seduced by the balm of exotic male attention while emboldened by anonymity, versus pristine Lily and hypercritical Grace. The conflict escalates; the friendship unravels. The wives return to face their newly determined husbands. Not long thereafter, a serious occasion wrenches an obligatory promise from each forcing them back to Capri to face the consequences of their blunders—including a secret brutal crime.",
  "genres": [],
  "author": "Melissa Farnsworth",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/18324811-invented-august"
}