{
  "title": "Malicious History: An investigation into King James VI of Scotland, I of England, and his place in the History of Witch Hunts.",
  "description": "In the summer of 1590, shortly after returning from Denmark with his new Queen, James VI of Scotland later James I of England, made the decision to attend the trials of several accused witches from the small kirk of North Berwick. The accused attempted to murder James by using witchcraft to sink the ship upon which he had journeyed. James was well known for his curiosity and intellect. This was an opportunity that he could not pass up and so, he attended the trials. This single act would forever change how James would be viewed for centuries to come. Thereafter, James was linked to witch hysteria and steadily gained the reputation of a witch persecutor. According to many historians, James' attendance of the trials was the beginning of the revitalization of witch hysteria, which had been dying out over the last twenty years of English history. He gained the reputation of an obsessed king determined to find and persecute witches. This seems to be the accepted place for James in history. However, it leaves several unanswered questions. Is this image of James as a witch hunter an accurate portrayal? Is his reputation based on available evidence or imagination? If his reputation is undeserved, then how and why did it develop in such a manner? Finally, what evidence is there to contradict those beliefs? This thesis attempts to explore James' place in history as a witch hunter and the truthfulness of his given reputation. Chapter One presents evidence concerning James' reign in Scotland. Chapter Two explores his authorship of Daemonologie in the Form of a Dialogue. Chapter Three investigates James' influence on the creation of the statutes against witchcraft. Chapter Four focuses on how contemporary writers misconstrued James' involvement in witch hysteria. Chapter Five questions the trials, public sentiments and political actions revolving around witchcraft. Chapter Six reviews the history of the Statute of 1604.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "A c Vines",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/18325877-malicious-history"
}