{
  "title": "Arsenic and Clam Chowder: Murder in Gilded Age New York",
  "description": "Arsenic and Clam Chowder recounts the sensational 1896 murder trial of Mary Alice Livingston, a member of one of the most prestigious families in New York, who was accused of murdering her own mother, Evelina Bliss. The bizarre instrument of death, an arsenic-laced pail of clam chowder, had been delivered to the victim by her ten-year-old granddaughter, and Livingston was arrested in her mourning clothes immediately after attending her mother's funeral. In addition to being the mother of four out-of-wedlock children, the last born in prison while she was awaiting trial, Livingston faced the possibility of being the first woman to be executed in New York's new-fangled electric chair, and all these lurid details made her arrest and trial the central focus of an all-out circulation war then underway between Joseph Pulitzer's World and Randolph Hearst's Journal.The story is set against the electric backdrop of Gilded Age Manhattan. The arrival of skyscrapers, automobiles, motion pictures, and other modern marvels in the 1890s was transforming urban life with breathtaking speed, just as the battles of reformers against vice, police corruption, and Tammany Hall were transforming the city's political life. The aspiring politician Teddy Roosevelt, the prolific inventor Thomas Edison, bon vivant Diamond Jim Brady, and his companion Lillian Russell were among Gotham's larger-than-life personalities, and they all played cameo roles in the dramatic story of Mary Alice Livingston and her arsenic-laced clam chowder. In addition to telling a ripping good story, the book addresses a number of social and legal issues, among them capital punishment, equal rights for women, societal sexual standards, inheritance laws in regard to murder, gender bias of juries, and the meaning of \"beyond a reasonable doubt.\"",
  "genres": [
    "True Crime",
    "History",
    "Nonfiction",
    "Crime"
  ],
  "author": "James D. Livingston",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/10946350-arsenic-and-clam-chowder"
}