{
  "title": "What the **** is Normal?!",
  "description": "What do you do when you’re labeled abnormal in a world obsessed with normality? In a world where wrinkles are practically illegal, going bald is cause for mental breakdown, and women over size ten are encouraged to shoot themselves, what the **** do you do if you’re, gasp. . .  disabled? Francesca was diagnosed with cerebral palsy when she was two years old, and her parents were gravely told that she would never lead a \"normal\" life. After a happy childhood filled with tree climbing, mischief, and little regard for her bit of palsy, Francesca arrived at high school with a confidence verging on indestructible, only to be turned into a miserable and insecure wreck. Luckily for her, salvation came from Grange Hill, a stand-up comedy workshop, and a passionate love affair replete with scintillating conversation. After one particularly mind-blowing chat, Francesca realized she had the power to stop judging herself by society’s unhealthy standards and create her own. So she did. This powerful new perspective changed her entire life forever. Whatever body you’re born into, the pressure to be \"normal\" is everywhere. But have you ever met a normal person? What do they look like? Where do they live? What do they eat for breakfast? And what the **** does normal mean anyway? What the **** is Normal?! is a very funny, very moving celebration and exploration of learning to be happy with who you are. Neither an autobiography nor a self-help book, it’s a powerful and political call-to-arms that rails against the relentless media bombardment of what is culturally perceived as \"normal.\" Francesca equipped herself with the tools to stick two shaky fingers up to society’s unrealistic and damaging expectations, and with this book, she hopes to help more people to do the same. The wobbly revolution starts here.",
  "genres": [
    "Nonfiction",
    "Disability",
    "Biography",
    "Memoir",
    "Humor",
    "Comedy",
    "Biography Memoir"
  ],
  "author": "Francesca Martínez",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/18332154-what-the-is-normal"
}