{
  "title": "Given Away, A Sicilian Upbringing",
  "description": "In Sicily, 1935 a four-year child walks away from her loving family, her mother, her sister and an infant brother, with a great-aunt for a vacation.She spends the next eight years of her life absent from their lives. It was not abduction nor was it an adoption. Tina lives in a one-room house in one of the poorest regions of Sicily. She sleeps between a loving aunt and a deranged uncle. She shares her breakfast with goats and chickens while living in the shadow of fascism. The child grows up while WW II ravages the town. Her school is taken over by the Germans and the things like bread and eggs that were once plentiful, no longer exist. Less than 25 kilometers away her family leads a very different life. After eight years, she returns home to find her childhood interrupted again. This time sickness, warfare and destruction are her enemies. In wartime Europe, childhood does not exist. The child witnesses and experiences many disturbing things from her uncouth, unsanitary living conditions to the failed paratroopers dangling from trees during the allied invasion.Tina is a survivor. She is able to forgive those who took so much away from her. Her spirit trumps over adversity during the war times within and around her. As she grows older, she struggles to keep the harsh realities of World War II and abandonment at a distance through her sense of humor, imagination and determination.By the age of 15, her fate is sealed, again, without her permission. To gain passage to America she must accept the role as a war bride. A tyrannical, overbearing, bootlegging aunt in America arranges the match. Tina must live under her roof and her rules until her citizenship is secure.Given Away, A Sicilian Upbringing, is a novel inspired by true events.",
  "genres": [
    "World War II",
    "Historical"
  ],
  "author": "Marianna Randazzo",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/18331988-given-away-a-sicilian-upbringing"
}