{
  "title": "الطبعة العربية لكتاب \"الصفقات القذرة\"",
  "description": "الطبعة العربية لكتاب \"الصفقات القذرة\" •\tالمؤلف: بيتر ليللي•\tالناشر: مجموعة النيل العربيةيجري غسل أكثر من 1.5 تريليون دولار من الأموال \"القذرة\"، ويتم نقلها في جميع أنحاء العالم سنويًا على يد عصابات الجريمة المنظمة التي تجني أرباحًا تفوق في حجمها كثيرًا من اقتصادات الدول المتقدمة، والمثير للدهشة أن كل التسهيلات التي تلزم لغسل الأموال يمكن شراؤها عبر الإنترنت. ويرسم كتاب \"الصفقات القذرة\" صورة للحجم والنطاق المخيفين لعمليات غسل الأموال العالمية واختراقها لكيانات الأعمال المشروعة في العالم. إن بيتر ليللي يزيح الغطاء عن هذا العالم السفلي المخيف .. عالم الرذيلة والإجرام، ويميط اللثام عن الكيفية التي تقوض بها التنظيمات الإجرامية والجماعات الإرهابية – بما لها من درجة عالية من التنظيم والتعقيد – دعائم دول كثيرة، ونظمها المالية وحكوماتها، ومنظمات الأعمال فيها. يزخر الكتاب بقصص وحقائق وأرقام لا تصدق،وقد تم تنقيحه بصورة وافية وهو يضم معلومات عن: • تمويل الإرهاب الدولي. • الجماعات الإجرامية الرئيسية محليًا ودوليًا. • تأثير شبكة الإنترنت و\"غسل الأموال إلكترونيًا\". • استراتيجيات مكافحة غسل الأموال المتعلقة بكافة أنواع الأعمال. إن كتاب \"الصفقات القذرة\" – الذي يروي قصصًا مروعة ومذهلة – يعد أول كتاب يبين كيف يجري غسل عائدات الجريمة المنظمة العالمية في أنحاء النظام المصرفي العالمي لتخرج منه ناصعة البياض لا تشوبها شائبة وتستقر في النهاية في حسابك المصرفي أو جيبك. عمل بيتر ليللي في مجال منع واكتشاف والتحقيق في أموال جرائم الأعمال وغسل الأموال العالمية على مدى عشرين عامًا، شغل خلالها عددًا كبيرًا من المناصب القيادية. وهو يقدم الآن استشارات إلى كثير من المنظمات حول سبل مكافحة هذه المشكلات المتنامية من خلال شركته بروكسيمال كونسالتتج Proximal Consulting، وكثيرًا ما توجه له الدعوة لإلقاء محاضرات في مؤسسات دولية كما يقدم أيضًا مساهمات قيّمة إلى وسائل الإعلام الإخبارية المطبوعة والتليفزيونية مثل محطة بي.بي. سي BBC وسي إن إن CNN الإخباريتين. وبيتر ليللي هو أيضًا مؤلف كتاب \"الاختراق والهجوم وإساءة الاستخدام\"، الصادر عن كوجان بيدج",
  "genres": [],
  "author": "بيتر ليللي",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/18334468"
}