{
  "title": "Accidental Love",
  "description": "You will be drawn into the Anthony family & fall in love with each member.\nAdopted at an early age, Jin Anthony seems to have everything. His job in the medical profession affords him a lifestyle of luxury, he's well liked by everyone, and he always seems to be in control. To those on the outside, it looks as though Jin's living the American dream.Hailing from a more humble background, Mei-Ling is a beautiful holistic healer who can't speak a word of English.Jin and Mei-Ling's worlds, and cultures, collide when their paths cross at a medical convention. And while this chance encounter seems insignificant at first, it quickly blossoms into a once in a lifetime love.But finding true love is never without obstacles...Can Mei-Ling finally fill the void that's been missing in Jin's life for an eternity?Or will her father put an end to their passions before things go to far? As the story progresses, we can't help but become sucked into the intricate and beautiful world of Jin and Mei-Ling. You will feel a firestorm of emotions, including a newfound belief that perseverance is oftentimes the heart's greatest triumph.>>>This Story Is Fresh & Satisfying With Unexpected Twists...You Will Fall In Love With Each Member Of The Anthony FamilyIt's a heartwarming short story that will have you cheering.>>> This Book Will Fill Your Void & Longing For A Good Love StoryBe taken on a fascinating and inspiring journey.>>> A Personal Note From Author, Harmony BryceHarmony Bryce is a true romantic and loves spreading her \"feel good\" feelings in her writings. She writes contemporary romance books sprinkled with love, laughter and some unexpected surprises.Harmony adores flavorful cups of tea, opportunity shopping, and buying unique vintage and antique bric-a-brac to showcase her deep love of everything vintage. Her big loves are her family, spending time with life long friends, loving her pets and making the most of what life has to offer.",
  "genres": [
    "Contemporary Romance"
  ],
  "author": "Harmony Bryce",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/18335602-accidental-love"
}