{
  "title": "Toda la sangre",
  "description": "Nunca olvidaré el ruido que hacían los tambores de los concheros en la noche, mientras intentaba conciliar el sueño en un viejo edificio de la calle de Donceles. Me parecía una advertencia debajo hay una ciudad que late y respira, con dioses que no han muerto; rindámosle tributo, porque un día ese mundo regresará... Es imposible dormir a un costado del Templo Mayor sin recibir el influjo de esas piedras milenarias, de las voces que susurran desde las ruinas durante la madrugada. Mi mente se puso a imaginar una historia para conjurar el insomnio que me provocaba esa invocación al lado antiguo y misterioso de la urbe. Quería entender de dónde venimos, y por qué es difícil reconciliarnos con nuestro origen prehispánico; en especial con los sacrificios humanos que practicaron los aztecas. Esta novela une pasado y presente en una misma trama los cuchillos de obsidiana que arrancaron corazones, los indigentes que pululan en las calles del Centro, las construcciones coloniales con fachada de tezontle, los edificios de concreto abandonados al borde de grandes avenidas, las publicaciones sensacionalistas y su lenguaje de violencia, las ventanas arqueológicas que relatan un esplendor perdido; un acertijo cuyo personaje principal es la Ciudad de México, el lugar donde cualquier situación es posible. Arqueólogos convertidos en detectives, vagabundos ataviados con pieles humanas, túneles secretos y catacumbas bajo el asfalto de la urbe, y un asesino ritual con una misión apocalíptica. Toda la sangre es un thriller sobre el universo de los mitos y el ámbito de lo “real”; ambos se necesitan porque se alimentan mutuamente. En medio estamos nosotros, marionetas de fuerzas que intuimos y preferimos ignorar. Hasta que el ruido de los tambores llega a nuestra puerta. (Bernardo Esquinca)",
  "genres": [
    "Horror",
    "Fiction",
    "Crime",
    "Spanish Literature"
  ],
  "author": "Bernardo Esquinca",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18334121-toda-la-sangre"
}