{
  "title": "To Woo A Warrior",
  "description": "It was common knowledge that Hadleigh Valhalla was a complete failure when it came to men. Too blood thirsty. Too tall at 6.6ft and without a coy bone in her too voluptuous body. If there had been a ‘fun, flirty and feminine’ test she would have failed it hands down. Thankfully she was much more suited to her role as an Enforcer, protecting her magically enhanced eccentric extended family on a daily basis from all kinds of nasties. It was a job she loved, much preferring to be out there beheading the baddies than dating any day of the week … much less stressful.Except now there’s a new threat in town. Great Aunt Alma, the family match maker has returned to the fold and set her sights squarely on all the singletons. Hadleigh will do anything she has to in order to avoid Alma’s matchmaking manoeuvres even if that means signing on as the newest member of the hit reality TV show ‘Paranormal Exterminators.’ Vaughn, Captain of the Goddess Maat’s elite warriors has a mission, to find and annihilate any and all magical beings that threaten to tilt the scales of justice into chaos. A paranormal reality TV show provides the perfect cover. But there’s trouble on set. Their only female cast member has gone missing and they need a replacement fast. Enter Hadleigh Valhalla, the most luscious thing on two legs he’s seen in a century. From the moment he sets eyes on her he’s determined to make her his.There’s only one problem, Hadleigh insists she has a strict no dating policy. Claiming she’d rather be fighting than flirting.A series of mishaps means it’s a race against time for Vaughn and Hadleigh to discover just who is targeting the show and stop them before someone gets seriously hurt or dead. While doing so Vaughn intends to teach Hadleigh to break all the rules and prove to her she is just as much woman as she is warrior. His warrior. His woman.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Fantasy",
    "Humor",
    "Urban Fantasy",
    "Magic"
  ],
  "author": "Jane Cousins",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/18339276-to-woo-a-warrior"
}