{
  "title": "The adventures of Catrine and the Devil",
  "description": "When a young Danish girl by the name of Catrine discovers the unseen spiritual world, she follows a demon to the end of the world in order to challenge the devil. Subsequently, when the devil, in the most unlikely and unfortunate scenario, becomes the trophy of the young huntress of adventures, the devil discovers that there is a human hell, far worse than his own hell. In Denmark the devil is suddenly subjected to pathetic, vain, and juvenile a hell which changes his perspective about humans in the future. However, it appears that the devil has lost more than just a bet when he was defeated by Catrine. The loss of the devil’s power and freedom made him realize that he has dug up his own grave. Hence, the more that he resisted the Danish dimension, the more that he was sucked into it, and subsequently, the more oppressed that he became. The tyranny of the absurd puny human world which the devil experiences throughout the Danish consciousness of vanity, turns the devil into something that he never was before: A good loving Dane. Moreover, the devil with his reason and moral virtue is faced with real evil core, which is hiding in the dungeons of the Danish psyche. Danish life and Danish culture, just as Danish food and Danish jokes are imposed on the devil by his new master, Catrine, and by her fellow Danes. The conclusion that ‘The devil is not that bad’ is simply replaced by the typical Danish sports of making fun of the devil and/or by making the devil suffer. The edifying of the devil, however, is not met without difficulties, for it appears that just as the Danes cannot be slightly tamed by the civilized world, so can’t the devil be entirely tamed by the Danish vain world. Humor becomes the key sense in the disentanglement of this everlasting stalemate. The devil is the muse, for he becomes the source of Catrine’s childish fun, whereas Catrine’s fun, adversely, is the source of the devil’s misery. The devil, however, is very disappointed that the old saying ‘Nobody can really defeat the devil’ has suddenly been replaced by the saying, ‘Nobody can really defeat Catrine’. The Danish reality, hence, is the devil’s worst nightmare. Nevertheless, the issue of conformism and adaptation to Danish society stirs the reader’s curiosity as for the order of the Danes, and as for the mystery which shrouds the dark secrets of Danish society. The readers discovers soon that the devil is the allegory of the individual in Denmark, and that unlike Danish society, the devil is truly not that bad. Despite the humor, the reader cannot help oneself feeling sorry for the devil. In this satire, there has been a preliminary attempt to challenge the norms and conventions of Danish society. While the devil is about to become human because of the perfect goodness/badness of the Danes, it may seem as if Danish society is about to become mythological because of the vanities and absurdities which are associated with the devil. But both the devil and Danish society agree on the issue of non existence. Danish society does not believe that such a creature as the devil really exists. Equally, the devil does not believe that such a vain, puny, and irking society does really exist. But they both experience each other, and they both interact and counteract each other. Danish society and the devil both oscillate between self denial and confession, between seriousness and humor, and between pleasure and pain. The impossibility that the predator would become the prey, or that the victimizer would become the victim, is now a sad reality for the devil.",
  "genres": [],
  "author": "Stephan Attia",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18338315-the-adventures-of-catrine-and-the-devil"
}