{
  "title": "Leannán",
  "description": "The Path which Destiny Beckons...After bidding farewell to her homeland of Ireland once more, Aislinn courageously returns to Italy to accept the offer presented her by the sophisticated male vampire, Niccolò, to reside with him in the beautiful Renaissance city of Florence.She is anxious to learn from him of his more compassionate and less primeval lifestyle as a vampire. Finally, never will she have to kill again to satisfy her blood lust!But, will it really be as simple as all that?Aislinn is disheartened when it does not go as effortlessly as she had hoped, and she must deal with killing again, even if it was by accident. Then, once she finally has that mastered, she must struggle against another sort of lust overwhelming her every time she is with her latest young male blood servant. Fearing she will make a mistake and lose herself to his charms, Aislinn hastily sends him away.Niccolò also introduces her to a more cultured life, showing her things and taking her places she would have never seen. After visiting Sanguelascivia, an erotic club with courtesans who cater to vampires, she takes on a female blood servant so that she will not be under the temptation of a man. They grow close— in every way imaginable. Being with Giuliana at least offers Aislinn some gratification from her persistently all-consuming sexual needs, until the day she can be reunited with her soul mate— soon, she prays. She focuses her efforts on searching the city for the man she is convinced is the reincarnate of her lost love, Donovan— the very reason she returned to Italy. She tracks him down by his scent and he begins courting her ardently. Aislinn is quickly becoming rapt by his charms and is more than ready to succumb to his seductive touch. But is she absolutely sure it is him, after all, or is she only making yet another serious misjudgment?And then to make matters more confusing, Aislinn begins having recurring dreams and fantasies about Voljidaar, her dark and alluring creator from the land of cold and snow with his long pale hair and penetrating ice blue eyes, amongst his other even more desirable features... If only she knew for certain the correct path, the one to which her true fate summons. Anam Céile Chronicles is a series which centers around true love, soul mates, self-discovery, loss, vampires, lust, and the faith in reincarnation set in the lush backdrops of rugged Ireland, beautiful, culturally rich Venice and Florence, Italy, and Morocco, amongst others. It can be read alone or in conjunction with the series.Books in the Anam Céile Chronicles, listed in order:Cailín, Book IDonovan's Struggle (Erotic Novella)The Awakening of Celeste (Erotic Novella) The Falling of Katja (Erotic Novelette) The Sins of Zahrah (Erotic Novella) Soeis, Book IIThe Submission of Giuliana (Erotic Novella)La Amore di Vincenzo (Erotic Novella)Leannán, Book III The Seduction of Gretchen (Erotic Novella)The Turning of Niccolò (Erotic Novella) May 1st, 2014*** Warning: Contains Steamy Erotic Content. Intended Only for Readers over the Age of Eighteen Years!",
  "genres": [
    "Paranormal Romance"
  ],
  "author": "Rosalind Scarlett",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/18336748-leann-n"
}