{
  "title": "The adventures of Catrine and the Devil II",
  "description": "The adventures of Catrine and the Devil II begin with a mutiny. The demons are upset and sickened by the devil’s soft Danish behavior and good heart. But when the devil is dragged to the end of the world to be condemned, Catrine comes to his rescue. However, things begin to get very complicated when they return to Denmark. The devil lives in a tormenting limbo of paradoxes. His social status and chocolate heart are the causes of his personality disorder, emotional distress, and eternal dissatisfaction. Catrine reveals to the devil the dark Danish secret that the only way for real happiness in Denmark is by becoming a Dane. The devil, however, discovers afterwards that it is not sufficient to be born a Dane in order to be accepted in Danish society. The social classifications of a real Dane, a perfect Dane, an ordinary Dane, and a new Dane, makes the devil determined to become a Perfect Dane, as he always aspire higher towards God. Although the devil earns the epithets ‘More Danish than the Danes’ and ‘More Dane than the Danes’ because of his eccentric behavior, he is not yet accepted as equal in Danish society. After the devil’s reincarnation as a Dane in a very foul way, the devil realizes that a long battle is ahead of him in order to be as equal in title as his twin perfect Danish brother, Jens Jensen. But the devil’s good Danish family, The Jensen family, is trying to help the devil to conform to Danish society. But there is more that the devil discovers about the Danes and about their real dream, which is similar to his dream. Thus, in this funny satire the devil learns that the Danes have a plan to topple down God the almighty and take over the universe. However, on the cost of assimilation to Danish society, the devil himself schemes to join the Danes’ master plan, until God is vanquished. Thereupon the devil plans to break free and retrieve his power over hell until he usurps world domination. But the devil discovers soon that signing a contract with the Danes is worse than signing a contract with the devil, and that such a commitment has some monstrous cultural and mental consequences. The devil’s inevitable transformation to a Dane takes its toll, and the devil begins to conform to Danish society against his free will, and against his rooted natural evil. Catrine helps the devil to become a Dane all the way from his confession before priest Peter Petersen, to the insemination into Jenna Jensen, by Doctor Claus Clausen. This satire is filled with the vibrancy of an adolescent and facetious humor which lampoons the imbalance between the collective and the individual in Danish society.",
  "genres": [],
  "author": "Stephan Attia",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18338328-the-adventures-of-catrine-and-the-devil-ii"
}