{
  "title": "The Wooden Prince",
  "description": "The automa Pinocchio has always been duty-bound to serve in the floating palace of Venice's emperor. So when Pinocchio finds himself locked in a trunk and delivered to a new master-a wanted criminal and alchemist named Geppetto-he is curious about everything around him. But most curious is the way Pinocchio seems to be changing from a wooden servant into a living, human boy. Before Geppetto and Pinocchio can uncover the mystery surrounding the automa's transformation, Pinocchio is stolen away. Determined to find Geppetto again, Pinocchio begins a harrowing journey across the Empire, where danger in the form of half-beast outlaws and winged airmen abounds for a lost automa. Meanwhile, Princess Lazuli, the daughter of the ruler of a magical kingdom called Abaton, is also on a quest through the emperor's territory. Her father, Prester John, has been captured by the Venetian Empire, and Lazuli is desperate to rescue him. With the emperor's airmen closing in fast, Lazuli learns the only hope for saving her father-and her beloved home-lies in Pinocchio and Geppetto. In a masterful reimagining of Pinocchio, John Claude Bemis weaves an enchanting, thrilling adventure for middle-grade readers in the first installment in the Out of Abaton duology. Praise for The Wooden Prince \"Wow! John Claude Bemis hides new magic in old stories.\" -- Tom Angleberger, New York Times best-selling author of the Origami Yoda series \"Young readers will find this reimagined adventure an exhilarating and insightful journey.\" -- Kirkus Reviews \"Pinocchio gets a new look in this curious, complex novel of betrayal, rebellion, and loyalty. . .the world-building is impressive, and the captivating setting will likely attract fantasy, steampunk, and adventure fans alike.\" -- Bulletin of the Center for Children's Books \"Flying lions, fiery salamanders, chimera, sylphs, gnomes, men with wings, and an enormous sea monster all play roles in this fantastical retelling of Pinocchio.\" -- School Library Journal \"Pinocchio's growth is sometimes uncomfortable, sometimes heartwarming, and bound to entrance readers.\" -- Booklist",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Retellings",
    "Steampunk",
    "Fairy Tales",
    "Fiction",
    "Adventure"
  ],
  "author": "John Claude Bemis",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/18336985-the-wooden-prince"
}