{
  "title": "Thunderstruck & Other Stories",
  "description": "From the author of the beloved novel The Giant’s House—finalist for the National Book Award—comes a beautiful new story collection, her first in twenty years. Laced through with the humor, the empathy, and the rare and magical descriptive powers that have led Elizabeth McCracken’s fiction to be hailed as “exquisite” (The New York Times Book Review), “funny and heartbreaking” (The Boston Globe), and “a true marvel” (San Francisco Chronicle), these nine vibrant stories navigate the fragile space between love and loneliness. In “Property,” selected by Geraldine Brooks for The Best American Short Stories, a young scholar, grieving the sudden death of his wife, decides to refurbish the Maine rental house they were to share together by removing his landlord’s possessions. In “Peter Elroy: A Documentary by Ian Casey,” the household of a successful filmmaker is visited years later by his famous first subject, whose trust he betrayed. In “The Lost & Found Department of Greater Boston,” the manager of a grocery store becomes fixated on the famous case of a missing local woman, and on the fate of the teenage son she left behind. And in the unforgettable title story, a family makes a quixotic decision to flee to Paris for a summer, only to find their lives altered in an unimaginable way by their teenage daughter’s risky behavior.   In Elizabeth McCracken’s universe, heartache is always interwoven with strange, charmed moments of joy—an unexpected conversation with small children, the gift of a parrot with a bad French accent—that remind us of the wonder and mystery of being alive. Thunderstruck & Other Stories shows this inimitable writer working at the full height of her powers.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Literary Fiction",
    "Contemporary",
    "Book Club",
    "Audiobook",
    "Adult Fiction"
  ],
  "author": "Elizabeth McCracken",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/18339643-thunderstruck-other-stories"
}