{
  "title": "The Secret",
  "description": "When four friends explore a nearby cave, something very strange, a transformation of sorts, begins to occur in one of them. Soon afterward, he leaves town, but while he is away a creature of some type begins killing at random, feeding off of his victims like a werewolf. Determined to find the killer, the group of friends set out on a quest that leads them to an unlikely source and into a well designed trap for which they are not prepared.Excerpt:It was a cold night and an old man was walking down the street that led to the town’s pub. “Who’s there?” the man asked. He had heard some sharp steps behind him. The old man spun around and saw a cloaked figure coming towards him. The man quickened his pace. When he looked back, the figure was catching up with him. The old man made a quick turn, went into an alley, and hid behind a dustbin. He wanted to confront the person but he couldn’t. The very air seemed to be inflicting fear into his body. The figure stopped in the parking lot a little ahead of the alley. The old man closed his eyes, wishing that whoever it was would leave him alone. The figure turned and floated towards the old man. The old man’s heart began to beat faster. He wanted to yell, to call out for help, but no sound came from his mouth. With determination, he got up and ran away, but the alley he was in was a dead end. He had nowhere else to run. There was no way he could climb the brick wall in front of him.Another attack had taken place but this time in Colville.******The four of them had reached the butcher’s shop and they all went in.“Good day, George,” said Susan as she smiled at the butcher.“Same to you, miss,” the man smiled back.Everything was going the same way it always did. Anya was looking outside from the shop’s windows as people passed by. Eric was examining the scales placed on one of the shelves. Carl should have been with Eric, telling him to get a new socially acceptable hobby, but this time around Carl was looking at a very large piece of meat placed on the counter. He slowly walked towards it. The smell was unbearable. It was attracting Carl and he watched as his own hands picked up the meat.“Carl, what the…!” yelled Eric.Carl looked at him and then at the piece of raw meat into which he was biting. He threw it away in disgust, his mouth full of blood.“Come on,” said Eric, and he walked Carl out of the shop.Susan paid the shocked butcher. “He hasn’t been feeling well,” she said as the butcher forced a smile. “Anyway, thank you for the meat, George.”Anya looked at Susan and both of them walked out of the shop without saying a word to each other.",
  "genres": [],
  "author": "A.J",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18340775-the-secret"
}