{
  "title": "Viminy Crowe's Comic Book",
  "description": "When chubby, geeky Wylder Wallace spills lunch on cool and aloof Addy Crowe at Toronto's Comicon, she dashes to the bathroom, leaving behind the latest issue of her uncle's steampunk comic FLYNN GOSTER in GOLD RUSH TRAIN . Wylder, a fan of the Flynn comics, opens this new one eagerly, astounded to see the girl who was just yelling at him inside the comic. Fascinated, he follows Addy into the bathroom, and the adventure begins...     Is there a personality conflict? Oh, yes. Addy wants to go home; Wylder wants to stay and explore the world of Viminy Crowe's comic book. Do things go wrong? You bet they do, from the very start, when Addy loses her pet rat, Catnip, and almost gets shot by a Red Rider. All the while the actual comic book story is going on around them. The train carries a fortune from the Yukon goldfields, and both dashing Flynn Goster (hero of a thousand disguises and thief extraordinaire) and villainous Professor Aldous Lickpenny (criminal genius, aided by malevolent robots but somewhat hampered by doltish nephew Nevins) have plans to steal the gold. There's romance too -- Flynn's old flame, the brilliant aviatrix, Isadora Fortuna, is traveling across Canada with her balloon, and her strangely familiar protégée Nelly Day. Addy and Wylder navigate the story with the aid of the comic book itself. Every page turn sends them to a different setting, from the Banff Springs Hotel to an alligator-wrestling arena in Florida. But when they finally find a portal back to the real world, catastrophe follows ... A hilarious thrill-ride of a story that will have kids laughing and on the edge of their seats with every turn of the page.",
  "genres": [
    "Fantasy",
    "Adventure",
    "Graphic Novels",
    "Steampunk",
    "Humor",
    "Childrens",
    "Middle Grade"
  ],
  "author": "Marthe Jocelyn",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/18339935-viminy-crowe-s-comic-book"
}