{
  "title": "John Muir and the Ice That Started a Fire: How A Visionary And The Glaciers Of Alaska Changed America",
  "description": "A dual biography of two of the most compelling elements in the narrative of wild America, John Muir and Alaska.John Muir was a fascinating man who was many inventor, scientist, revolutionary, druid (a modern day Celtic priest), husband, son, father and friend, and a shining son of the Scottish Enlightenment -- both in temperament and intellect.  Kim Heacox, author of The Only Kayak, bring us a story that evolves as Muir’s life did, from one of outdoor adventure into one of ecological guardianship---Muir went from impassioned author to leading activist. The book is not just an engaging and dramatic profile of Muir, but an expose on glaciers, and their importance in the world today. Muir shows us how one person changed America, helped it embrace its wilderness, and in turn, gave us a better world. December 2014 will mark the 100th anniversary of Muir’s death. Muir died of a broken heart, some say, when Congress voted to approve the building of Hetch Hetchy Dam in Yosemite National Park. Perhaps in the greatest piece of environmental symbolism in the U.S. in a long time, on the California ballot this November is a measure to dismantle the Hetch Hetchy Dam. Muir’s legacy is that he reordered our priorities and contributed to a new scientific revolution that was picked up a generation later by Aldo Leopold and Rachel Carson, and is championed today by influential writers like E.O. Wilson and Jared Diamond. Heacox will take us into how Muir changed our world, advanced the science of glaciology and popularized geology. How he got people out there . How he gave America a new vision of Alaska, and of itself.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Science",
    "Biography Memoir",
    "Environment",
    "Nature"
  ],
  "author": "Kim Heacox",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/18341848-john-muir-and-the-ice-that-started-a-fire"
}