{
  "title": "Wanted",
  "description": "NEW YORK TIMES BESTSELLERFor fans of Fifty Shades of Grey, Bared to You, and Release Me comes an all-new series of three enigmatic and powerful men, and the striking women who can bring them to their knees.  He is everything I crave, all I desperately want—and he is everything I can’t have.  Evan Black embodies my every fantasy. He is brilliant, fierce, and devastatingly handsome. But he is also headstrong, dangerous, and burdened with secrets.    My family warned me to stay away, that I could never handle Evan’s dark dealings or scarred past. Maybe I should have listened. Maybe I should have run. But our desire is undeniable, and some temptations you just can’t fight.   And from the moment we touch—the passion between us consuming us both—I know that I will never be the same.  This edition includes excerpts from J. Kenner's Say My Name and Release Me.  Wanted is intended for mature audiences.Praise for Wanted\n \n “If you’re looking for a steamy new erotic series, Wanted is just the book.”—Harlequin Junkie\n \n “This is one of the best books in this genre I have read this year.”—KT Book Reviews\n \n “Wanted by J. Kenner is the whole package! A toe-curling smokin’ hot read, full of incredible characters and a brilliant storyline that you won’t be able to get enough of. I can’t wait for the next book in this series. . . . I’m hooked!”—Flirty & Dirty Book Blog\n \n “J. Kenner has written an edgy storyline that will fascinate and keep you wondering.”—The Reading Cafe\n \n “Suffice it to say, I was hooked in the first few chapters. It was hot, it was sexy, and it really shows that J. Kenner knows how to write in this genre. I can’t wait to get my hands on Heated, the next book in the series, and see whose hands get on whom. Enjoy!”—Eager Reader\n \n “I loved this story! It had substance, lovable characters, and unexpected discoveries. And the love between Evan and Angelina was passionate, explosive, and utterly wonderful.”—Part of That World\n \n “I don’t know if I have enough adjectives to describe the hotness of this book. . . . Julie Kenner writes a heck of a story and I am definitely a fan!”—About That Story\n \n “J. Kenner writes a compelling erotic story about two people with many secrets. . . . Whenever Evan and Angie are together, the air sizzles with tension.”—Cocktails and Books\n \n “Wanted is another J. Kenner masterpiece. . . . This was an intriguing look at self-discovery and forbidden love all wrapped into a neat little action suspense package. There was plenty of sexual tension and eventually action. Evan was hot, hot, hot! Together, they were combustible. But can we expect anything less from J. Kenner?”—Reading Haven",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "BDSM",
    "Adult",
    "Erotic Romance",
    "Contemporary"
  ],
  "author": "J. Kenner",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/18343370-wanted"
}