{
  "title": "Sister Satellite",
  "description": "In Sister Satellite Cathryn Cofell writes with power and a hard-earned, wide-ranging scope. As poet Oliver de la Paz writes, \"the language of Cofell's debut collection shimmers in amplitudes of love.\" Love, yes, but hers is an engaged love that won't let us go easily. Her poems provide an answer to the politics and pressures of our times, as Cofell wrests the microphone for herself, turns up the volume and the heat and writes about women's lives and bodies in lines which are funny, bold, defiant, angry and celebratory. Married love and unvoiced lust, pregnancy, miscarriage, adoption, abortion and aging all figure into the mix. And Cofell writes her version of the truth bravely. \"The only hard part about the abortion / was getting the car to start,\" she tells us in the poem \"Her Religion.\" She also writes movingly about families (\"When I do arrive it will be coffee all day hot in the pot / spoiled milk in the fridge / twin beds bunk beds bags on the floor\" from \"Getting Home\") and about just how fragile our time is on this planet. In Cofell's vision, even a brain tumor can bless us with new vision and tenderness: \"I will stay. Here. / I will lay by my lay. / From the behind of my heart.\" As Kelly Cherry says, \"Every woman should read this book. So should every man.\" Sample poem: Appeal for Eclipse Enough about the damn moon. Bulimic bitch, four fits of clothes, all that cellulite and she still prances, still tries to light up the sky when he wants only to be dark, to be Johnny Cash and strum the train ride right out of her. Enough from the poets, the artists, the astronomers. Quit coveting her behind his back. She needs to learn the ways of a docile woman, to be viewed askew from inside a cardboard box, her trashy peep show ass puppeted from the earth, strung up behind the sun curtained by this ring of fire.",
  "genres": [],
  "author": "Cathryn Cofell",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18343935-sister-satellite"
}