{
  "title": "It's Complicated: The Social Lives of Networked Teens",
  "description": "“boyd’s new book is layered and smart . . . It’s Complicated will update your mind.”—Alissa Quart, New York Times Book Review “A fascinating, well-researched and (mostly) reassuring look at how today's tech-savvy teenagers are using social media.”— People “The briefest possible summary? The kids are all right, but society isn’t.”—Andrew Leonard, Salon What is new about how teenagers communicate through services such as Facebook, Twitter, and Instagram? Do social media affect the quality of teens’ lives? In this eye-opening book, youth culture and technology expert danah boyd uncovers some of the major myths regarding teens' use of social media. She explores tropes about identity, privacy, safety, danger, and bullying. Ultimately, boyd argues that society fails young people when paternalism and protectionism hinder teenagers’ ability to become informed, thoughtful, and engaged citizens through their online interactions. Yet despite an environment of rampant fear-mongering, boyd finds that teens often find ways to engage and to develop a sense of identity.Boyd’s conclusions are essential reading not only for parents, teachers, and others who work with teens but also for anyone interested in the impact of emerging technologies on society, culture, and commerce in years to come. Offering insights gleaned from more than a decade of original fieldwork interviewing teenagers across the United States, boyd concludes reassuringly that the kids are all right. At the same time, she acknowledges that coming to terms with life in a networked era is not easy or obvious. In a technologically mediated world, life is bound to be complicated.",
  "genres": [
    "Nonfiction",
    "Parenting",
    "Technology",
    "Education",
    "Psychology",
    "Sociology",
    "Adult"
  ],
  "author": "Danah Boyd",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/18342787-it-s-complicated"
}