{
  "title": "The Clan MacDougall Series",
  "description": "Meet the honorable, fierce, and loyal men of The Clan MacDougall and the beautiful women who captured thier hearts.\n\n\nLaiden's Daughter (Clan MacDougall #1)\n\nShe believes men are not honorable nor are they kind-until she meets one that changes her heart forever. Betrayed by lies told before her birth, Aishlinn is raised by a harsh and cruel stepfather. Her life is forever changed one horrifying night when she is forced to flee England for the safety of the Scottish Highlands. Rescued by a fierce band of highland warriors, Aishlinn soon learns that honorable men do exist. She finds a strength she never knew she possessed and it will be tested to the limits when she is forced to make a heart-wrenching decision… allow the English to kill those she loves, or surrender for the crime she committed. \n\n\nShe is everything he never knew he wanted in a woman….\n\n\nAs a fierce highland warrior, Duncan McEwan has survived numerous battles, bed countless women, and survived a horrific storm at sea. He has scaled mountains and even survived hand-to-claw battle with a cat-o’mountain. But none of that could have prepared him for how his life forever changed one fateful spring day when he rescued a lass from a freezing stream. He will do anything to keep her as his own and will risk everything to keep her out of the hands of the English.\n\n\n\n\nFindley's Lass (Clan MacDougall #2)\n\n\n\nShe had won his heart without trying… and he can only pray for the chance to give her his.\n\n\nWhen Findley McKenna returns after his battle with the English to offer Maggy Boyle a home amongst his clan, he finds only death and destruction instead of the young widow who has stolen his heart. The only thing left of her home is the burned out hut and decaying bodies of the auld people Maggy has taken care of for the past three years. With only a prayer, his Highlander heart, and a bit of bloodied plaid to cling to, Findley will crawl through hell if he must, in order to find Maggy and her sons and avenge the massacre before him. She had won his heart without trying, and he can only pray for the chance to give her his.\n\n\nHow can she place her trust or her heart in the hands of a man she barely knows and maintain her freedom and keep her secrets hidden?\n\n\nMaggy has secrets, and her own hell to crawl through, before she can give her trust or heart to any man. Fearful that the uncle of her late husband will force her into a marriage with another cold and vindictive man, she goes into hiding to keep her true identity secret and her adopted sons together. After her home is destroyed and her young son kidnapped, those secrets begin to unravel, one agonizing thread at a time. How can she place her trust or her heart in the hands of a man she barely knows and still maintain her freedom and keep her secrets hidden? Findley McKenna is her last vestige of hope at keeping both.\n\n\n\n\nWee William's Woman (Clan MacDougall #3)\n\nThey call him Wee William. Though he stands nearly seven feet tall, with arms and legs the size of tree trunks and hands as big as buckets, there is nothing wee about him. His scowl alone is enough to make most men's bones rattle with fear. And women, rather than swooning, tend to run in the opposite direction.\nThe giant Highlander is a self-proclaimed bachelor who has sworn for years that there isn't a woman in all of Scotland worth shaving his beard for, and for good reason. Years ago, after a bonny young lass broke his heart and left his dignity in shreds, he swore never again to put it in such peril. As a testament to his sincerity, he vowed never again to shave his beard.\nThen he met her. In a single heartbeat, Wee William was lost. Forever lost to a brown-haired beauty with gray-blue eyes brimming with tears - a woman in need.",
  "genres": [],
  "author": "Suzan Tisdale",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/18349522-the-clan-macdougall-series"
}