{
  "title": "The Essential Guide to Writing a Novel: A Complete and Concise Manual for Fiction Writers",
  "description": "The New York Times Book Review said James Thayer's \"writing is smooth and clear. It wastes no words, and it has a rhythm that only confident stylists achieve.\" The Essential Guide to Writing a Novel is a practical, step-by-step manual on how to craft your novel. The Essential Guide presents a set of tools for large issues such a story development and scene construction (Kirkus Reviews said Thayer's novels are \"superbly crafted,\") and it also examines techniques that will make your sentence-by-sentence writing shine \"Thayer's prose is clear and clean,\" said the Seattle Times. How do the masters do it? The Essential Guide shows you the techniques of writers such as John Grisham, Maeve Binchy, Jeffery Deaver, and Charles Dickens. What makes their novels hard to put down? How do Mario Puzo, Sinclair Lewis, Patricia Cornwell and Tom Wolfe make their stories so riveting and their prose so good? The Essential Guide sets out their techniques in concise detail. Just beginning your novel? Or in the middle of the novel and needing some guidance? The Essential Guide to Writing a Novel will show you the way. Among the many The six traits necessary for a successful protagonist and three more traits that will make him or her stand out. Twenty-two techniques that will make your character's dialogue compelling. Creating dynamic settings that advance the story. Point of view-a critical skill--made easy. Five pace-killers and how to avoid them. Plotting the novel using the advantage shift. Constructing scenes to propel the reader to the next scene. \"Thayer writes a vivid tale,\" the Cleveland Plain Dealer said. In The Essential Guide to Writing a Novel, he'll help you write your own vivid tale.",
  "genres": [
    "Writing",
    "Nonfiction"
  ],
  "author": "James Stewart Thayer",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/10952699-the-essential-guide-to-writing-a-novel"
}