{
  "title": "Dealing With Discipline",
  "description": "Eleanor Villiers, now Lady Hyde and originally a reluctant wife to Lord Edwin, has realized that she has fallen in love with her husband without the reassurance that he loves her back. It's literally the very situation she'd wanted to avoid by marrying a man who loved her more than she loved him, so that she wouldn't turn into the miserable, neglected wife that her mother was. Being rather stubborn and spirited, Eleanor begins to try out various tactics to discover her husband's true feelings towards her, only to find that she knows very little about love. Unfortunately her antics somehow seem to constantly lead her into situations where disciplinary measures become necessary, and Edwin's spankings remain as exciting as they are painful.Meanwhile, Irene has married Eleanor's brother Hugh Stanley, Viscount Petersham, even though she's in love with another man and has been since childhood. Her mother has reassured her that within the ton it is perfectly acceptable to marry one man and be another's mistress, as long as she gives her husband the requisite heirs. On their honeymoon to Hugh's estates, Irene finds her emotions becoming increasingly confused she becomes more and more fond of her husband - is it possible to love two men at once? Under his gentle care and approval (and away from the overbearing presence of her mother) her true self begins to emerge out in the countryside, unfortunately leading to some unsafe behavior on her part which requires Hugh's immediate attention. He never wanted a rebellious wife who would need constant discipline, but he doesn't hesitate to mete it out when necessary. As the ladies struggle with their notions of love, the men struggle with the hot and cold temperaments of their wives, and all of them wonder if, and how, they can make their marriages work. Be warned: This book contains explicit erotic scenes, some bondage and toys, quite a few spankings, and some seriously sexy alpha males who firmly believe in being the head of the household (as was the case during the Victorian time period). Dealing With Discipline is approximately 100,600 words.",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "BDSM",
    "Erotica",
    "Regency",
    "Adult"
  ],
  "author": "Golden Angel",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/18362866-dealing-with-discipline"
}