{
  "title": "Betrayed",
  "description": "\"What would you do......  If everything you've known your entire life is a lie. Would you curl up in a ball and cry or would you be so pissed you run like hell? Well, the day I woke up in the woods naked as a jail bird craving blood it finally hit me I wasn't completely human. I say completely because I happen to also be some kind of were animal. So that was the day I decided to run like hell. Don't get me wrong I'm not weak or afraid. I'm an FBI agent for Christ's sake, and not just any FBI agent, I work in the SID's branch, Species Intelligence Department. We are the judge, jury, and executioners of all little bad supernaturals. A couple days ago me and a partner almost died from executing and execution warrant. After that is when I found out everyone has been lying to me since the day I was born. So, I didn't run because I'm scared, I ran because I'm pissed and if I see any of them again there's no telling what I'll do. I forgot to introduce myself, my names Jessica Barnes and I'm off to reinvent myself and forget this craziness ever happened.\" Follow Jessi in this new and exciting series as she struggles to learn a whole new life and comes to terms with the new her. She traveled to the last place anyone would have ever thought she'd be. Two years went by and Jessi has finally found her place in her new home. For once in her life she's happy, relaxed, and having the best days of her life. She's made new friends and even considers the old rancher she's working for to be the father she never had. But, good things don't last forever. Just as she thinks she's in the clear and nothing bad will ever happen again she runs, literally, right into the biggest ass she's ever met. Nic, the rancher’s son. As time goes by and she's stuck with the old ranchers impossible overbearing son she can't quite figure out if she hates him or loves him. Just when she starts to think she might love him her past comes back to bite her right on her ass. What's a little drama without a family reunion.",
  "genres": [
    "Paranormal",
    "Urban Fantasy",
    "Romance",
    "Shapeshifters",
    "Vampires",
    "Paranormal Romance"
  ],
  "author": "Melissa Jupp",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/18362992-betrayed"
}