{
  "title": "Spank Me, Mr. Darcy",
  "description": "Netherfield, infamous for its debauched parties of excess and luxury, has a new Master. After finagling an invitation to the ball, Elizabeth Bennet is introduced to the powerful and prideful Mr. Darcy, while her sister Jane has captivated the new owner, Mr. Bingley. Having contented herself with the pleasurable caresses of her best friend, Charlotte Lucas, Elizabeth is intrigued with the sensuality she finds at Netherfield. But it isn’t until her sister Jane istaken ill and Elizabeth stays at Netherfield to nurse her back to health that she finds the dungeons of Netherfield and the man in the black mask who becomes her Master.By the time she leaves Netherfield, Elizabeth will have become disenchanted with her childhood playmate and obsessed with Mr. Darcy, her Master, who has told her that she would be more marriageable as a Netherfield submissive than as a curious virgin. Elizabeth holds on to her affront at his callous regard for her until Charlotte marries Mr. Collins and Jane is discarded by Mr.Bingley. Unwilling to save herself for a man who'll make a good match and determined not to suffer Jane's heartbreak, when she meets Mr. Darcy again at Rosings Park, she decides to become his slave and offers him her virginity. But when she finds out that her cruel Master has destroyed Jane’s chance at marriage with Mr. Bingley, she rejects Mr. Darcy – even as he reluctantly proposes marriage to her. It isn’t until he saves her sister Lydia’s reputation and brings Jane and Bingley together, that Elizabeth realizes that she loves him. If he still loves her, she would be most willing to take her punishment for rejecting him – and live happily ever after Lissa Trevor has her stilettos firmly entrenched in the romance community. A frequent reader at Manhattan's Between The Covers events, Lissa also created an erotic story template for Coliloquy's ValEntwined promotion that allowed readers to download a personalized ebook starring themselves and their significant other. Her novella Wild Oats, features a time traveling, wild night of fulfilling sexual fantasies that the heroine was too afraid to experience the first time around. You can find her at http://lissatrevor.wordpress.com/",
  "genres": [
    "Romance",
    "Adult",
    "Fiction",
    "Historical Romance",
    "BDSM",
    "Erotic Romance",
    "Erotica"
  ],
  "author": "Lissa Trevor",
  "average_rating": "2.97",
  "url": "https://www.goodreads.com/book/show/18361626-spank-me-mr-darcy"
}