{
  "title": "The Odd Tales of an Old Man",
  "description": "Connor Woods is tired of being pushed around. He is tired of dragging his space cadet of a younger brother around with him because his mother treats him more like a babysitter than a son. To make matters worse, out of the blue, she wants to introduce him to her estranged father who is wasting away in a nursing home from cancer.When he and his brother, Sean, meet their Grandpa Lingus for the first time, the introduction is awkward to say the least. Lingus turns out to be a nasty curmudgeon who punctuates his insults with forced small talk. But, for reasons unclear to Connor, his mother believes that it is important for him and his brother to get to know this cantankerous old man.During the compulsory visits, Grandpa Lingus launches into a series of terrifying tall tales. After some initial resistance, Connor becomes immersed in the horrifying cautionary tales taking place in the bogs of Ireland, the Black Forest of World War II Germany, the pre-Katrina New Orleans voodoo scene, and the suburbs of New York.Connor begins to realize that he can relate to the protagonists in the tall tales and his grandfather actually understands him more than anyone he knows. In the process, Connor discovers the reason for his mother’s estrangement from her father, shattering his assumptions and giving him a new appreciation for the importance of family. However, as Connor begins to question whether his grandpa’s tall tales are really only tales, he has a brush with one of the tale’s ghastly characters, causing him to question the direction of his life. But is it too late?“Beautifully written,” Pulitzer Prize Nominee and Emmy Award Winner, John Ford Noonan“I fell deeply in love with this story,” Author, catt dahman“A fascinating tale of facing the past,” 5/5 stars, Michael Dunford, The Midwest Book Review “The end of the book had an unexpected and eerie twist,” Ellen Feld, Award-Winning Author, The Feathered Quill“The stories were fascinating,” Readers’ Favorite “I was intrigued with the boys’ interaction with their grandfather,” Kam Aures, Rebecca’s Reads",
  "genres": [],
  "author": "Edward P. Cardillo",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/18360456-the-odd-tales-of-an-old-man"
}