{
  "title": "Small Town Girl",
  "description": "Ex-country musician Flynn Clinton retires from the road for the challenge of raising his two boys in his old hometown, but the talented, sexy waitress who thinks she runs his new coffee shop has the means to carve what remains of his future into coffee grounds unless he finds some way of offering her the career he’s given up.After the death of his ex-wife and the accident that ruins his guitar-picking hand, musician/songwriter Flynn Clinton downsizes from Billboard fame and the wild life of the Nashville music scene he loves too much. He ends up in his hometown of Northfork, North Carolina, where he hopes to make a success of the Stardust Café, and raise his pre-teen sons in the unchanging security of small town life—if he can pry them away from his yuppie parents. All he has to do is convert his bad boy persona into the kind of daddy his boys need, and find a quiet, maternal woman to help raise them.Instead of finding peace and quiet in the mountains, he runs into Joella Sanderson—a former beauty queen and a sexily talented singer who belongs on the top of the music charts, except she claims her first boyfriend ruined her taste for the stage, and the last ruined her taste for lying, cheating music men. So now Jo serves coffee in the Stardust Café, singing funny ditties to make her handsome new boss laugh, and hoping one of her creative ideas will produce the revenue the town needs in time to save her mama’s health and her sister’s marriage. In the process, she transforms Flynn Clinton’s secure world into a colorful madhouse, luring him dangerously close to the glamorous brink that stole his life once before.Fully believing Joella belongs in the world he’s just left, Flint throws all of his powerful connections—and the heart he doesn’t dare touch again—into helping her develop her music, until the day Northfork’s only industry closes, threatening the future of the town and their families. Now, the irresistible Joella must push the immovable Flint into letting music back into his life to save the town, and in the ensuing battle, the Stardust Café explodes with laughter, tears, catastrophe, and love.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Fiction"
  ],
  "author": "Patricia Rice",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/18364941-small-town-girl"
}