{
  "title": "Not Sure Boys",
  "description": "Not Sure Boys features three gay young adult stories about growing up on Massachusetts' North Shore. The stories stand alone yet overlap to culminate in one steamy ending. There’s plenty to laugh about with these characters, but their stories also prove genuine and touching as the characters try to make their way in this confusing world. Whether you're gay or straight, you'll find something to relate to.Three Gay Coming of Age Shorts That Read as Individual Stories Yet OverlapThe stories include:Wacky Packages, a gay young adult story (1970s style)What's he supposed to do when his mom tells him it's wrong to think his best friend is handsome?It's the 1970s when summers should just be about trading Wacky Pack cards, playing baseball, and wondering what you're going to be when you grow up, and not about lusting after your best friend's older brother. Singing a bastardized version of ABBA’s latest hit into a hairbrush while standing in front of the mirror may get Robby just what he’s been asking, \"Can I see your bum Fernando?\"Where Derek Van Lies, gay boys or not so gay boys?At nineteen she is the biggest fan of the rising country singer in her sleepy affluent town.Meet Susan, a developmentally-challenged teen living with her parents and bagging groceries at Market Basket. Her life revolves around everything associated with her idol, Derek Van, but when he takes her to the Topsfield Fair and she tries to seduce him, Susan suspects something is wrong. Could he be a \"homosapien\"?Livin’ on the Not Sure, a gay young adult story that grows into a hot gay romance m/m taleCan the gay guy really get the hot, straight jock into bed?Robby’s done just that, but Jamie is hopelessly straight. Still, during the sultry summer of 1984 they’re hooking up, and not just once in a while but until Robby goes away to college in September. Decades pass before they meet up again. Despite Jamie’s having lived the straight-life, is there still a spark? Is it too late for him to change?Gay Romance M/M Has Never Seen Such QualityNot Sure Boys is a funny yet tender collection of interrelated shorts about coming to terms with love under some not-so-accepting circumstances. The conflicts and dilemmas that arise in these stories are something every reader will find familiar and relatable.",
  "genres": [
    "M M Romance",
    "LGBT",
    "Romance"
  ],
  "author": "Rick Bettencourt",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/18364997-not-sure-boys"
}