{
  "title": "On the Way Home",
  "description": "\"Dangerous, steamy, intense and emotional all in one fell swoop...Skye Warren definitely knows how to infuse just the right amount of high speed energy and intensity, to mix with the emotional side of things, to make a well rounded complete story.\" - Fictional Candy Clint For eight months I've been deep under cover as a special operator in the Army. On the plane ride home, all I want is a hot shower and a long sleep. But a Dear John text message leaves me stranded. I need a ride and a place to stay, and the pretty stewardess is more than willing. Della It's supposed to be a simple trade--the passenger in seat 34B for my sister. But the sexy soldier is more than I can handle in all the best ways. He trusts me, but I can't save him. No one can. Sometimes trouble has a way of following you home. **************** On the Way Home is a full-length new adult romantic suspense novel intended for readers over eighteen. Fair Contains a hot army hero who knows how to follow orders. \"On the Way Home has so many aspects that I love in a suspense, steamy sex, ruthless crime bosses, a military leading male, and dark, gritty, and twisty romance. I highly recommend this to readers that enjoy their romance with a dark, edgy, and suspenseful twist.\" - Tattooed Book Review \"Clint is a sexy solider with a few secrets, Della is a gal that has a dark past with a few secrets of her own. Together they steam up the sheets and keep you on the edge of your seat.\" - Red's Hot Reads “The book is also full of suspense, if you can’t read it all the way through in one sitting at the beach or pool you will be thinking about the characters and the situations until you can finish. It keeps you going till the end. Della has to make some big sacrifices to save the ones she loves. The idea of choosing family or the love of your life is compelling and heartbreaking.” – Red Cheeks Reads “So Clint and Della have to be the hottest pick me up at the airport and bring me home to kink me hookup ever…I loved On the Way Home!” – She Hearts Books “Skye Warren has created a unique romantic suspense that edges on the dark side but is safe for lighter readers as well. With a good balance of sexual heat and story, this book delivers.” – Guilty Indulgence Book Club",
  "genres": [
    "New Adult",
    "Military Fiction",
    "BDSM",
    "Erotica",
    "Romantic Suspense",
    "Romance",
    "Dark"
  ],
  "author": "Skye Warren",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/18364344-on-the-way-home"
}