{
  "title": "Seizing Fate",
  "description": "And you thought Emmy’s life was a hot mess before…Jack’s gone off to Arizona with his brother, but for how long? Emmy doesn’t have a clue. In his place, though, is Zachary. The whiny, miserable, alpha wolf–boy who is more than ready to take on the duty of her mate/boyfriend — if she’d let him, that is. But the last thing Emmy wants is to deal with a boy who believes that the world should fall solely at his feet whenever he demands it.But hey, at least her step–douche is gone, and her life is back to an almost normal sense, right?Wrong again, Emmy’s life will never again be normal…With her Uncle Prick in town and her best friend acting as secretive as ever, Emmy finds new challenges to overcome — challenges that no seventeen–year–old girl should ever have to deal with. For one thing, what is up with her dream–liaison status anyway? What does it mean, really? And why does her little brother have to go through it too? And then there’s her mom. The lady is acting a tad bit odd, to put it nicely. After all these years, she finally wants to step up and be a parental figure? Heck no! Emmy’s definitely not copacetic with that idea. But with the bad, there’s got to be some good out there for her somewhere, right?Add in the wolves, witches, drama, and lots of kisses and you get Emmy the Extraordinaire, the girl with strawberry–colored hair, and a chip on her shoulder. She’s finally on her way to finding out what her life and her future both have in store for her, even if the road to getting there is nowhere near as easy as she hoped it would be. But Emmy is tough, and more than ready to take on life with her bare hands. It’s just too bad she’s madly, desperately, insanely in love with a boy who insists on making her life both a miserable hell and utter perfection at the same time.",
  "genres": [
    "Young Adult"
  ],
  "author": "Heather Van Fleet",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/18365237-seizing-fate"
}