{
  "title": "The Devil Inside the Beltway",
  "description": "Michael J. Daugherty, author and CEO of LabMD in Atlanta, Georgia, uncovers and details an extraordinary government surveillance story that compromised national security and invaded the privacy of tens of millions of online users worldwide. Unbelievable from beginning to end, you'll be shocked at what is really going on behind every closed door in Washington. A riveting true political thriller, the pace is breathless, the arguments compelling, and the iron will of Daugherty transforms him from government prey to government whistleblower.The Devil Inside the Beltway is a compelling true story that begins when an aggressive security surveillance company, with retired General Wesley Clark on its advisory board, magically acquires the private health information of thousands of LabMD's patients. This company, Tiversa, campaigns for a \"fee\" from LabMD to \"remedy\" the problem. When Michael J. Daugherty refuses to pay, Tiversa follows up by handing the file over to the FTC. Daugherty reveals that the company was already working with Dartmouth, having received a significant portion of a $24,000,000 grant from Homeland Security, to surveil for files. The reason for the investigation was this: Peer to peer software companies have back doors built into their technology that allows for illicit and unapproved file sharing. When individual work stations are accessed, as in the case of LabMD, proprietary information can be taken. Tiversa, as part of their assignment, acquired over 14 million files, financial, medical and military data during their search. Daugherty's book documents a frighteningly systematic and dishonest investigation by one of the US Government's most important agencies. The consequences of their actions will have a chilling effect on Americans and their businesses for years.",
  "genres": [
    "Nonfiction",
    "Politics",
    "History"
  ],
  "author": "Michael J. Daugherty",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/18369327-the-devil-inside-the-beltway"
}