{
  "title": "The Exile",
  "description": "The EXILE - LIES OF LESSER GODS - BOOK ONE\nIs he Humanity’s last hope or the herald of their destruction?Birthed from out of a nightmare void, Gralyre's only memory is that of an execution - his own.Thrust into the middle of a war between the last of humanity and the tyrant who rules them, Gralyre struggles to survive a world that is foreign to him, where even his name is forbidden and to carry a sword bears a death sentence.In a land where madness and tyranny rule is Gralyre an insidious weapon of the evil usurper, Doaphin, or the last hope of mankind?Doaphin has tried to infiltrate spies into the human resistance before, but the rebel sorceress, Catrian, can easily spy the evil within their souls. But Gralyre's hidden past tells no tales. Could the taint of the usurper be hidden within his missing memories?\"I am not a spy!\"Catrian would kill him for the danger he poses, save that Gralyre has magic, a resource desperately needed in these dark days as Doaphin wages war against the last bastions of Humanity. Can she find a way to trust him?\"We are all susceptible to loneliness, Cat.\"Catrian can see Gralyre as he is now, a good and honourable man, but there is no telling who he has been in the past or who he holds allegiance to. Searching within his mind for Doaphin's evil influence, at his deepest thoughts and desires, she sees Gralyre's regard for her growing. Catrian dares not succumb to her feelings  for they might cause her hesitate when she most needs to act swiftly and decisively.Can Gralyre trust himself to aid in the battle for Humanity’s survival when a worm of evil could be burrowing within the dark, empty places of his mind?Pursued by Doaphin's creatures, mistrusted by the Rebels and plagued by his mysterious nightmares, Gralyre must find a way to survive when his past could be a dangerous viper awakening to destroy those he has sworn to protect.",
  "genres": [
    "Fantasy"
  ],
  "author": "L.G.A. McIntyre",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/18369049-the-exile"
}