{
  "title": "The Cambridge Encyclopedia of the English Language",
  "description": "English is arguably the nearest thing we have to a world language, and yet it is a language with a wealth of varieties, dialects, and traditions, all developing in different ways and at different speeds. This book is a superbly written and illustrated exploration of the history, structure, and use of English throughout the world. World-renowned linguist and author, David Crystal, explores the many facets and varieties of the English language, bringing life to this large and complex subject. He begins with the origins of English in Anglo-Saxon times and follows the growth of the language to the present. Every major English-speaking country is included, and the book abounds with insights into how English evolved and how it works. The author pays particular attention to the use of language in literature and how it permeates humor. He allows language to \"speak for itself\" by using quotations, photographs, newspaper clippings, poems, advertisements, cartoons, and many other types of illustrative material that vividly complement his narrative. Author Crystal systematically covers the structural features of English, and includes a complete description of grammar, a summary of pronunciation and writing systems, and a thorough treatment of the size and complexity of vocabulary. He explains technical aspects in simple and accessible terms and includes a glossary to assist the reader with unclear language terminology. Highly visual with striking color illustrations, panels and boxed features throughout, this book is fascinating reading for the widest possible audience. David Crystal is the author of The Cambridge Encyclopedia of Language (CUP, 1987) and the editor of The Cambridge Encyclopedia (CUP, 1990, 1994).",
  "genres": [
    "Linguistics",
    "Language",
    "Reference",
    "Nonfiction",
    "History",
    "Writing",
    "Textbooks"
  ],
  "author": "David Crystal",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/1836897.The_Cambridge_Encyclopedia_of_the_English_Language"
}