{
  "title": "Lo subterráneo",
  "description": "En algún momento de 2011 alguien me preguntó “¿Por qué Lo subterráneo?” Es decir, ¿por qué elegirla como una de las dos obras seleccionadas para la primera Convocatoria Nueva Historieta de Cuadritos? No tenía una respuesta estrictamente racional para dar. Lo cual, bien mirado, acompañaba muy bien una historieta acerca de lo que está arraigado en el interior de sus protagonistas. Pero no había elegido la historia de Daniel Perrotta y Emmanuel Enríquez por capricho. Lo hice por intuición. Porque en las siete u ocho páginas de muestra que esos dos desconocidos enviaron a la casilla del sitio había algo.Con el correr de los años y las lecturas, el periodista cultural aprende a confiar en ese instinto que permite identificar algunas producciones culturales que tienen algo distinto, esas que lo empujan a uno a leer (y reflexionar, sentir y escribir) con avidez.Lo subterráneo era (es) una historieta distinta. Una que pretende ser fantástica o de ciencia ficción o que incluso podría presentarse como una de terror. Sin dejar de ser todo eso, también es otra cosa. Es una historia que habla de miedos ocultos tras una rutina segura, de deseos sepultados por el tedio cotidiano y el supuesto buen hacer. Trata del miedo al deseo, también, que es uno de los grandes obstáculos que enfrenta el ser humano. En definitiva, habla de hacerse cargo de quién es cada uno.Por eso Lo subterráneo es una gran historia fantástica. En su momento no sabía precisar por qué. Tampoco había nada en la sinopsis que revelara el nudo temático de su relato. Pero bastaba verla para saber que tenía algo. Los meses me fueron mostrando qué.Desde luego, ya en las primeras páginas se adivinaba la solidez del guión, el buen planteo de las escenas y buena mano para contar el interior de los personajes sin necesidad de apelar a bloques de texto incómodos. Había un dibujo diferente, también, que destacaba en el clima general, gracias al modo muy particular de colorear las viñetas que utilizó Enríquez. El método de coloreado –que después descubrí que era muy distinto al que habitualmente empleaba la dupla- fue clave para seleccionar la obra. Los toques de color ligeramente desencajados sugerían que había algo fuera de lugar en esa plaza de Flores que se desplomaba sobre sí misma, algo que excedía el propio derrumbe y la aparición de una posible civilización subterránea.Ese desplazamiento, se hizo notorio con el correr de las páginas, también se aplica a la trama. Porque el centro de la historia no está en su protagonista y ni siquiera en la civilización oculta. Allí hay un acierto notable. Narrada por quien atraviesa su ordalía reveladora, la trama hubiese resultado más bien sosa. Contada como lo hacen los autores, gana en espesor y permite una lectura mucho más intensa y compleja.Vuelvo al comienzo: algunos años atrás, no hubiera podido decir por qué elegía esta historia. El instinto me decía que Lo subterráneo era ideal para acompañar Contratiempos, de Érica Villar, que subirla al sitio cada sábado era la decisión correcta. Dos meses después de que se publicara la primera página, la intuición se fue transformando en certeza. Perrotta y Enríquez no sólo trabajaban cada entrega semanal como auténticos profesionales, sino que la historia iba creciendo en intriga y profundidad. Lentamente aparecieron los simbolismos, dosificados con astucia. Aparecieron las dobles páginas de composición impactante. Y se reveló, sobre todo, una historia impresionante.Algunos autores nóveles echan mano de elementos misteriosos e inexplicables como modo de tapar baches de guión o insuficiencias de la idea inicial. Estos muchachos no. Estos autores, jóvenes y todo, tenían bien claro desde el comienzo qué contar y cómo, qué querían decir al narrar lo que narraron y dibujar lo que dibujaron. La civilización subterránea no es parafernalia ni mera excusa narrativa. Sus rituales son sangre, son vida y son alma de esta historia.Estoy orgulloso de haber brindado el espacio para la primera publicación de Lo subterráneo. Estoy honrado de escribir el prólogo para su primera edición en papel. Estoy, además, convencido de los méritos de la historia que me capturó en cuanto leí sus primeras páginas. Porque ya estaba todo ahí. Un mundo derrumbándose y dando paso a lo que subyace.",
  "genres": [
    "Graphic Novels"
  ],
  "author": "Daniel Perrotta",
  "average_rating": "2.88",
  "url": "https://www.goodreads.com/book/show/18368572-lo-subterr-neo"
}