{
  "title": "Illicit Affairs",
  "description": "Illicit AffairsIllicit Affairs is a compilation of three erotic tales with women giving into their darkest desires and pursuing the forbidden. Unexpected Journey - Jo MatthewsSarah thought she met her soulmate in Mitch Chandler. High school sweethearts, they married right after graduation. Eight years later, he is a stranger to her and their marriage is on the rocks. In a halfhearted attempt to placate her, Mitch suggests a trip to Hawaii, but schedules a business meeting to write off the expense.Aaron Johnson, Mitch’s friend and business partner, agrees to help with the presentation and plans are made for all three to go. What happens when Mitch backs out at the last minute to spend a romantic weekend with his secretary, forcing Aaron’s hand so that he has to accompany Sarah alone?Will an innocent friendship turn into something more as Aaron’s attraction for Sarah grows? How will Sarah manage when she realizes that Aaron is awakening feelings in her that she’s never felt before? The sexual tension burns hot as these two embark on an unexpected journey that neither are prepared for.Hot Summer Nights - Bec RoseAnnie Murphy had the picture perfect life. A beautiful home, a wonderful son, and a husband who adored her. It was every woman’s dream until her husband of over twenty years came out of the closet, leaving her a forty-five year old divorcee struggling to regain her confidence. Needing a distraction, she agrees to allow her son’s friend, Jamie, to spend the summer at her house while working as an intern. When Jamie, the cute female intern she’d been expecting turns out to be Jaime, the hot male intern with abs to drool over, it kicks Annie’s fantasies into overdrive. When she realizes that her desires are not one sided, it’s more than the temperature that causes some hot summer nights.Second Chances - NJ ColeCalla Moretti married her college sweetheart, Bill. Married life was great at first, but as his career had her dropping out of college and moving away from her family and friends, Calla struggled with her role as a wife and homemaker. Stress due to infertility and Bill’s affairs, had the marriage on the brink of failure. When she drives home in the middle of a thunderstorm and spots first a broken down motorcycle, then the sexy rider, she decides to take a chance and offer him assistance. Realizing fate brought her together with a man who could give her the one thing her husband couldn’t—a baby—Calla decides to take a chance. One romantic night, one big lie, will it save her marriage or fill her heart with more emptiness? Will this be the answer to her prayers? In life, are there truly second chances?",
  "genres": [
    "Erotica"
  ],
  "author": "Jo Matthews",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/18371043-illicit-affairs"
}