{
  "title": "Incomplete Nature: How Mind Emerged from Matter",
  "description": "As physicists work toward completing a theory of the universe and biologists unravel the molecular complexity of life, a glaring incompleteness in this scientific vision becomes apparent. The \"Theory of Everything\" that appears to be emerging includes everything but us: the feelings, meanings, consciousness, and purposes that make us (and many of our animal cousins) what we are. These most immediate and incontrovertible phenomena are left unexplained by the natural sciences because they lack the physical properties—such as mass, momentum, charge, and location—that are assumed to be necessary for something to have physical consequences in the world. This is an unacceptable omission. We need a \"theory of everything\" that does not leave it absurd that we exist.Incomplete Nature begins by accepting what other theories try to deny: that, although mental contents do indeed lack these material-energetic properties, they are still entirely products of physical processes and have an unprecedented kind of causal power that is unlike anything that physics and chemistry alone have so far explained. Paradoxically, it is the intrinsic incompleteness of these semiotic and teleological phenomena that is the source of their unique form of physical influence in the world. Incomplete Nature meticulously traces the emergence of this special causal capacity from simple thermodynamics to self-organizing dynamics to living and mental dynamics, and it demonstrates how specific absences (or constraints) play the critical causal role in the organization of physical processes that generate these properties.The book's radically challenging conclusion is that we are made of these specific absenses—such stuff as dreams are made on—and that what is not immediately present can be as physically potent as that which is. It offers a figure/background shift that shows how even meanings and values can be understood as legitimate components of the physical world.",
  "genres": [
    "Science",
    "Philosophy",
    "Nonfiction",
    "Psychology",
    "Neuroscience",
    "Biology",
    "Evolution"
  ],
  "author": "Terrence W. Deacon",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/10955059-incomplete-nature"
}