{
  "title": "The Right Thing",
  "description": "On a scorching August day in 1963, seven-year-old Annie Banks meets the girl who will become her best friend. Skinny, outspoken Starr Dukes and her wandering preacher father may not be accepted by polite society in Jackson, Mississippi, but Annie and Starr are too busy sharing secrets and playing elaborate games of Queen for a Day to care. Then, as suddenly as she appeared in Annie's life, Starr disappears.Annie grows up to follow the path ordained for pretty, well-to-do Jackson women--marrying an ambitious lawyer, filling her days with shopping and charity work. She barely recognizes Starr when they meet twenty-seven years after that first fateful summer, but the bond formed so long ago quickly reemerges. Starr, pregnant by a powerful married man who wants her to get out of town, has nowhere to turn. And Annie, determined not to fail her friend this time, agrees to drive Starr to New Orleans to get money she's owed.During the eventful road trip that follows, Annie will confront the gap between friendship and responsibility; between her safe, ordered existence and the dreams she's grown accustomed to denying.Moving, witty, and beautifully told, The Right Thing is a story of love and courage, the powerful impact of friendship, and the small acts that can anchor a life--or, with a little luck, steer it in the right direction at last.\"Mix Fannie Flagg, Rebecca Wells, Kathryn Stockett, then add just a dash of Flannery O'Connor, and you'll wind up with the wholly original voice that is Amy Conner's. In this deceptively breezy novel of Southern women and the disaster and triumph of long-term friendships (not to mention racetracks and horses), Ms. Conner has staked a claim to her own Southern turf.\" --Bret Lott, New York Times bestselling author of Jewel\"This riveting debut novel shows how true friendship can span a social gulf and endure even across a chasm of time. The Right Thing is a page-turner that gripped me from the beginning.\" --Anna Jean Mayhew, author of The Dry Grass of August\"Before you read this book, make some coffee, grab the chocolate, sit down in front of the fire, and don't plan on getting up for a long, lovely time.\" --Cathy Lamb, author of If You Could See What I See\"Amy Connor has combined all of the right elements to make The Right Thing a fantastic read. She's written a touching story about a woman's search for herself and the endurance of a childhood friendship, outlined it in humor, and delivered it with beautiful prose. A wonderful debut!\" -- Mary Simses, author of The Irresistible Blueberry Bake Shop & Café\"Told with natural Southern lyricism, and full of surprises both quirky and heartfelt, The Right Thing is a compassionate reminder about how every choice at every fork in the road has the power to change the rest of our lives-- sometimes far better than we ever could have imagined.\" -- Kaya McLaren, author of How I Came to Sparkle Again",
  "genres": [
    "Fiction",
    "Southern",
    "Book Club",
    "Adult",
    "Historical Fiction",
    "Womens Fiction",
    "Contemporary"
  ],
  "author": "Amy Conner",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/18371384-the-right-thing"
}