{
  "title": "Dead End Girl  The Misadventures of Meghan Foster Part Two",
  "description": "Welcome back to the crazy.I'm back... and this time? I'm not slinging canned goods, I'm slinging drinks. The very best, in my humble opinion. I can lend you a sympathetic ear, a kind word of advice and the fun? Along with my fellow bartender and co-conspirator - we bring it.I'm an unknown entity on an island in the middle of nowhere, waiting for the one person who's very presence can make my little heart go pitter-pat. Unfortunately, my love life has hit a bit of a snag lately. Forces much bigger than me are at work, ripping the very delicate line between good and evil. One woman stands at the apex, staring down the inevitable, the fate of all mankind hanging in the balance. Did I mention that woman is me? Man, I need a drink...Excerpt:He’s staring at me. I’m staring back. That all too familiar tickle in the back of my brain is back. I don’t want to hear it. I don’t want to have this discussion. He sighs loudly, running his fingers through his dark hair before regarding me again.“Never mind. Just cool it with the fun, Ok? If people want drinks, give them drinks. If they want to talk, talk to them…that’s fine. Just…no crazy stuff, Ok?”“Define ‘crazy stuff’.” I command with a bemused smirk.“Strip poker, forcing shots on people, dancing on the bar, wardrobe malfunctions, conga lines, naked limbo, lap dances, wet T shirt contests, thong shooting, beer bottle bingo, strip shuffleboard, and no midget tossing…”“Ok…that was just once and he wanted to do it.” I point my finger at him to emphasize my words. He of course ignores me, and continues.“No squirting bar patrons with whipped cream, chocolate sauce or any other type of condiment. No ‘hide the cherry’, no body finger painting, no beer pong, no ‘Tower of Power’, no Jell-O wrestling, or anything else that involves Jell-O, jelly, jam or marmalade, no spin the bottle and no human horsey rides. You think you can handle that?”Well, that pretty much covered everything…Oh! Except suck and blow…Maybe we could still…“And no suck and blow.”Damn.",
  "genres": [],
  "author": "Anlyn Hansell",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18370279-dead-end-girl-the-misadventures-of-meghan-foster-part-two"
}