{
  "title": "Down by the River",
  "description": "\"A charming portrait of the Smokies, their people, and a wonderful way of life.\" --Deborah Smith, New York Times bestselling authorSet against the backdrop of Tennessee's breathtaking Smoky Mountains, Lin Stepp's Down By the River is a warm-hearted novel that proves it's never too late--or too early--for a fresh start. . .While on a visit to the Smokies, Grace Conley makes a stunning she's going to walk away from her busy life in Nashville to move to tiny Townsend and open a bed and breakfast. There's a beautiful old inn for sale along the Little River that will do perfectly. Of course, Grace's family is scandalized. After all, she's a middle-aged widow! And as a career homemaker, she's always been available for babysitting, chauffeuring, and generally being the peacemaker among her grown children. Has Grace lost her mind? She begins to wonder the same thing once she finds herself attracted to the local ladies' man. But the surprises don't stop there. . .To further complicate her move, Grace's daughter, Margaret, has grudgingly come to live with her. Having just graduated from college, remote Townsend is not where she envisions her future. Yet the handsome young minister next door is convinced he and Margaret are meant for each other. As life choices abound, soon both women will discover that the biggest decisions require confidence, a sense of humor--and a deep, abiding faith.Praise for Lin Stepp and her Smoky Mountain Novels\"I've finally come across someone that believes in all the things that I do. . .love, family, faith, intrigue, mystery, loyalty, romance, and a great love for our beloved Smoky Mountains.\" –Dolly Parton\"A wonderful, new Southern voice.\" --Joan Medlicott, author of the bestselling The Ladies of Covington series",
  "genres": [
    "Romance",
    "Christian Fiction",
    "Christian",
    "Fiction",
    "Contemporary"
  ],
  "author": "Lin Stepp",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/18371372-down-by-the-river"
}