{
  "title": "War of Gods Box Set",
  "description": "Box set featuring all four novels in the bestselling War of Gods paranormal romance series.Damian's OracleCaught in the war between the White and Black Gods, Sofia and her rare gift bring victory to he who grabs her first. Her difficult transition from human to oracle forces her into a new world, where she struggles in her role as Damian’s mate and to help a mysterious man who’s supposed to be dead. Featured in USA Today in March 2012Damian's AssassinAfter thousands of years as the White God’s right hand man and chief assassin, Dustin no longer believes in the human capacity for good, until he meets sweet, sunny Bianca, a Natural whose gift of healing will change not only his fate, but the fates of everyone around them. Damian's ImmortalJule has his powers stripped by the Watchers. They give him an impossible mission: find the mysterious Magician before she reopens the gateway between the realms. Afraid of her own powers, the Magician has lived a near-prisoner of someone determined to use her magic to destroy the human world. She must choose between helping Jule and remaining loyal to the man she views as her father.The Grey GodThe Grey God Darian can’t quite shake off the dark streak remaining after the thousands of years he spent enslaved by evil – or the memory of how the only woman he loved betrayed him. When given a second chance at life and love, Darian struggles to leave his past behind, before it destroys his future. The warrior destined to become his mate, Jenn, is accustomed to fighting – and defeating – dangerous men. But Darian isn’t just another powerful man, he’s immune to her mind reading talent and completely unpredictable, a trait sure to get anyone near him killed. Jenn feels trapped between the wild god and his enemies, who learn her fate long before Darian does. Rather than embrace her destiny at his side, Jenn defies it in an attempt to protect him and her own heart.",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Amazon",
    "Young Adult",
    "Fantasy"
  ],
  "author": "Lizzy Ford",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/18369813-war-of-gods-box-set"
}