{
  "title": "The Angel of Vengeance - The Most Gruesome Series on the Market",
  "description": "Summary:In a dim lighted cell, a man has awakened to find himself surrounded by the most unimaginable and barbaric things that not even his worst nightmare could conjure up. His captor, Seth Coker, takes the man on a journey into his twisted world of vengeance. A world that runs parallel with the horrors that could only be found in the deepest and darkest parts of hell. A world that bestows a wrath of chaos upon the wicked of our society that have fallen through the cracks of the judicial system. Seth wasn’t born a vigilante, nor did he seek out the role-- it sought him out.  A portion of our society feels that rapists, molesters, murderers and abusers should have rights, and anything beyond the normal punishment of confinement would be cruel and inhumane. Seth knows that the innocent are left without justice, while the wicked are roaming our streets without any remorse about the cruel and inhumane punishment that they bestow upon others. Offering up heart-pumping tales of revenge, suspense and horror in all its guises, this book is filled with dark humor, political incorrectness, gruesome and sadistic acts from beginning to end. Be warned-- this one will compel the meek to crawl into the fetal position and suck their thumb.- Originality –From the sheer ingenuity of the story to the appropriateness of the punishments makes this one of the most original story lines on the market. - Gruesome and Horrifying –This book is not for the meek. Seth will take you on a journey through his twisted world of vengeance that is filled with the most gruesome and horrifying things imaginable and unimaginable.- Cruel and Unusual –If you like filthy sick, over the top sadistic inhumane acts of revenge that stagger the mind, this book will not disappoint.- Dark Humor –If you like gore and dark humor, this book will make you laugh and gag at the same time.- Suspense –From front to back, The Angel of Vengeance is filled with one intense moment after another that is interwoven in a story line filled with humor. From the horrifying punishments of the mind and flesh to Seth’s unpredictable persona, it will keep you turning the page. - Politically Incorrect –If you’re a P.C. type person, do not read this book.- Disturbing –So disturbing that it was difficult for my editor to stomach the content.- Fascinating -The punishments that Seth bestows on deserving criminals are not only very sadistic and gruesome, but cleverly inventive, unusual and shocking as well.- Mind Rape -The sick and twisted images in this book will be implanted into your mind, causing your brain to feel it has been assaulted. ** Sold Exclusively on Amazon **-",
  "genres": [
    "Horror",
    "Splatterpunk",
    "Dark",
    "Adult",
    "Thriller"
  ],
  "author": "Wade H. Garrett",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/18371853-the-angel-of-vengeance---the-most-gruesome-series-on-the-market"
}