{
  "title": "Baby Girl",
  "description": "This is the first book in a series of three in the life of Erik Ead. Erik is a psychiatrist. He rides a motorcycle in a Motorcycle Club. He is tattooed. He is confident to the point of perceived arrogance. Erik does not believe in love and he doesn’t live in a mansion -he rides a motorcycle in a MC. He does not have an airplane. Erik is extremely confident, real, and knows what he wants. He wants a woman to submit; with no commitment for love. Erik will settle for nothing less than owning Kelli.Kelli is a college graduate scheduled to go to a university at the end of the summer. She meets Erik, who is older than she is. Immediately she is intrigued by him. Kelli has never been in a relationship at all. Kelli has spent her life being promiscuous, and using men for sex. Kelli, after meeting Erik, wants to do nothing but please him. Kelli doesn’t quite understand why, and waits on Erik to explain to her why she is the way she is, and what to do next .\"Love isn't real. Love is what people say to you so they can keep fucking you. So they can keep your interest. I don't want lies. I want my ass slapped, my hair pulled, and treated like a little whore.\" – Kelli with an “I”When these two begin to spend time together, things begin to change; personalities, interests, and the need for affection. What happens is something that must be experienced by the reader. This book is, again, not watered down. This book has tremendous depth to those that are looking to find it. It will, upon completion, allow you into the minds, hearts, and heads of people as they develop a D/s relationship.Again, if you have always wondered about what a Dominant/submissive relationship is all about – less the airplanes, mansions, and billions, read Baby Girl. It’s real, it’s raw, and it’s got the hottest, steamiest real sex you can imagine.Plan on being up all night.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Contemporary",
    "Dark",
    "Erotic Romance",
    "College"
  ],
  "author": "Scott Hildreth",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/18373868-baby-girl"
}