{
  "title": "The Statues that Walked: Unraveling the Mystery of Easter Island",
  "description": "The monumental statues of Easter Island, both so magisterial and so forlorn, gazing out in their imposing rows over the island’s barren landscape, have been the source of great mystery ever since the island was first discovered by Europeans on Easter Sunday 1722. How could the ancient people who inhabited this tiny speck of land, the most remote in the vast expanse of the Pacific islands, have built such monumental works? No such astonishing numbers of massive statues are found anywhere else in the Pacific. How could the islanders possibly have moved so many multi-ton monoliths from the quarry inland, where they were carved, to their posts along the coastline? And most intriguing and vexing of all, if the island once boasted a culture developed and sophisticated enough to have produced such marvelous edifices, what happened to that culture? Why was the island the Europeans encountered a sparsely populated wasteland? The prevailing accounts of the island’s history tell a story of self-inflicted devastation: a glaring case of eco-suicide. The island was dominated by a powerful chiefdom that promulgated a cult of statue making, exercising a ruthless hold on the island’s people and rapaciously destroying the environment, cutting down a lush palm forest that once blanketed the island in order to construct contraptions for moving more and more statues, which grew larger and larger. As the population swelled in order to sustain the statue cult, growing well beyond the island’s agricultural capacity, a vicious cycle of warfare broke out between opposing groups, and the culture ultimately suffered a dramatic collapse. When Terry Hunt and Carl Lipo began carrying out archaeological studies on the island in 2001, they fully expected to find evidence supporting these accounts. Instead, revelation after revelation uncovered a very different truth. In this lively and fascinating account of Hunt and Lipo’s definitive solution to the mystery of what really happened on the island, they introduce the striking series of archaeological discoveries they made, and the path-breaking findings of others, which led them to compelling new answers to the most perplexing questions about the history of the island. Far from irresponsible environmental destroyers, they show, the Easter Islanders were remarkably inventive environmental stewards, devising ingenious methods to enhance the island’s agricultural capacity. They did not devastate the palm forest, and the culture did not descend into brutal violence. Perhaps most surprising of all, the making and moving of their enormous statutes did not require a bloated population or tax their precious resources; their statue building was actually integral to their ability to achieve a delicate balance of sustainability. The Easter Islanders, it turns out, offer us an impressive record of masterful environmental management rich with lessons for confronting the daunting environmental challenges of our own time. Shattering the conventional wisdom, Hunt and Lipo’s ironclad case for a radically different understanding of the story of this most mysterious place is scientific discovery at its very best.",
  "genres": [
    "History",
    "Nonfiction",
    "Anthropology",
    "Science",
    "Archaeology",
    "Audiobook",
    "Sociology"
  ],
  "author": "Terry L. Hunt",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/10955304-the-statues-that-walked"
}