{
  "title": "Schizophrenia - Who Cares? A Father's Story",
  "description": "Better known as a travel writer rather than a mental health care campaigner, the author of the original Rough Guide To France and The Rough Guide to Paris tells the moving story of his son's – and thus his own – twenty-year struggle with schizophrenia. Tim Salmon believes passionately that it needed to be told, for the “outside” world – and he includes many of the professionals in that – know little of the daily reality of living with schizophrenia. He dedicates this frank, no-holds-barred account to all those who find themselves in the same boat, both sufferers and relatives, all of whom, once this bizarre illness strikes, find themselves thrown into a chaotic situation that is always bewildering and often as downright terrifying as it is heartbreaking. His story includes his dealings with the mental health care services, “a pretty shameful record of incompetence, buck-passing and lack of communication and co-ordination” and the mental health charities, whom he has not spared – “for in their devotion to the sloppy, evasive language of political correctness, they have dangerously underplayed the seriousness of real mental illness like schizophrenia”.‘Impressive, moving, disturbing.' Salley Vickers, author of Miss Garnet’s Angel, The Other Side of You, The Cleaner of Chartres'A riveting read, a proper page-turner. Reduced me, on occasion, to both tears and laughter. We could do better than this.' Nina Bawden, novelist, author of The Birds on the Trees.‘I would recommend this book for care coordinators and those interested in more responsive and engaged services.’ Leonard Fagin Honorary Senior Lecturer, University College London, and Consultant Psychiatrist, The Psychiatrist 'A thought-provoking and brutally honest personal account of a father’s struggle through the development of his son, Jeremy’s, paranoid schizophrenia… I thoroughly enjoyed this book and found it very difficult to put down.’ Declan Hyland, Royal College of Psychiatry Student Associate NewsletterABOUT THE COVER: \"I'd like particularly to thank and pay to tribute to my friend, Adam Grieve. He is a talented artist, who has kindly contributed one of his images for us to use as the cover of this book. He is a very courageous man who has kept up his work as a painter and sculptor while himself battling for many years against the difficulties and distress caused by schizophrenia.\" Tim Salmon, August, 2013",
  "genres": [
    "Mental Health",
    "Psychology",
    "Nonfiction"
  ],
  "author": "Tim Salmon",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/18373994-schizophrenia---who-cares-a-father-s-story"
}