{
  "title": "The Good Spy: The Life and Death of Robert Ames",
  "description": "The Good Spy is Pulitzer Prize-winning biographer Kai Bird’s compelling portrait of the remarkable life and death of one of the most important operatives in CIA history – a man who, had he lived, might have helped heal the rift between Arabs and the West. On April 18, 1983, a bomb exploded outside the American Embassy in Beirut, killing 63 people.  The attack was a geopolitical turning point. It marked the beginning of Hezbollah as a political force, but even more important, it eliminated America’s most influential and effective intelligence officer in the Middle East – CIA operative Robert Ames.  What set Ames apart from his peers was his extraordinary ability to form deep, meaningful connections with key Arab intelligence figures. Some operatives relied on threats and subterfuge, but Ames worked by building friendships and emphasizing shared values – never more notably than with Yasir Arafat’s charismatic intelligence chief and heir apparent Ali Hassan Salameh (aka “The Red Prince”). Ames’ deepening relationship with Salameh held the potential for a lasting peace.  Within a few years, though, both men were killed by assassins, and America’s relations with the Arab world began heading down a path that culminated in 9/11, the War on Terror, and the current fog of mistrust. Bird, who as a child lived in the Beirut Embassy and knew Ames as a neighbor when he was twelve years old, spent years researching The Good Spy.  Not only does the book draw on hours of interviews with Ames’ widow, and quotes from hundreds of Ames’ private letters, it’s woven from interviews with scores of current and former American, Israeli, and Palestinian intelligence officers as well as other players in the Middle East “Great Game.” What emerges is a masterpiece-level narrative of the making of a CIA officer, a uniquely insightful history of twentieth-century conflict in the Middle East, and an absorbing hour-by-hour account of the Beirut Embassy bombing.  Even more impressive, Bird draws on his reporter’s skills to deliver a full dossier on the bombers and expose the shocking truth of where the attack’s mastermind resides today.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Espionage",
    "Politics",
    "Biography Memoir",
    "War"
  ],
  "author": "Kai Bird",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/18373198-the-good-spy"
}