{
  "title": "Basketball Junkie",
  "description": "I was dead for thirty seconds.That's what the cop in Fall River told me. When the EMTs found me, there was a needle in my arm and a packet of heroin in the front seat.At basketball-crazy Durfee High School in Fall River, Massachusetts, junior guard Chris Herren carried his family's and the city's dreams on his skinny frame. His grandfather, father, and older brother had created their own sports legends in a declining city; he was the last, best hope for a career beyond the shuttered mills and factories. Herren was heavily recruited by major universities, chosen as a McDonald's All-American, featured in a Sports Illustrated cover story, and at just seventeen years old became the central figure in Fall River Dreams, an acclaimed book about the 1994 Durfee team's quest for the state championship.Leaving Fall River for college, Herren starred on Jerry Tarkanian's Fresno State Bulldogs team of talented misfits, which included future NBA players as well as future convicted felons. His gritty, tattooed, hip-hop persona drew the ire of rival fans and more national attention: Rolling Stone profiled him, 60 Minutes interviewed him, and the Denver Nuggets drafted him. When the Boston Celtics acquired his contract, he lived the dream of every Massachusetts kid—but off the court Herren was secretly crumbling, as his alcohol and drug use escalated and his life spiraled out of control.Twenty years later, Chris Herren was married to his high-school sweetheart, the father of three young children, and a heroin junkie. His basketball career was over, consumed by addictions; he had no job, no skills, and was a sadly familiar figure to those in Fall River who remembered him as a boy, now prowling the streets he once ruled, looking for a fix. One day, for a time he cannot remember, he would die.In his own words, Chris Herren tells how he nearly lost everything and everyone he loved, and how he found a way back to life. Powerful, honest, and dramatic, Basketball Junkie is a remarkable memoir, harrowing in its descent, and heartening in its return.",
  "genres": [
    "Memoir",
    "Sports",
    "Basketball",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "School"
  ],
  "author": "Chris Herren",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/10956467-basketball-junkie"
}