{
  "title": "The Teacher's Guide to Student Mental Health",
  "description": "From ADHD to schizophrenia and everything in between, what teachers need to know about their students’ mental health. Twenty percent of children and adolescents have a mental health disorder and in five percent, the disorder is severe. Chances are that every classroom in America will have at least one student who has a mental health disorder, possibly even in the severe range. These students often have symptoms that interfere with their ability to learn. From Ontario, Canada to California, school districts and state Boards of Education are recognizing the importance of comprehensive approaches to student mental health that include teacher education.By understanding child and adolescent mental health issues, general education and special education teachers have additional tools to provide the most successful educational environment for their students. But where can a teacher turn to get reliable information on what they need to know?Here, William Dikel, MD, a board-certified child and adolescent psychiatrist, who serves as a consultant to school districts nationwide, answers the call with a comprehensive, teacher-focused guide to student mental health. From anxiety and depression to ADHD, autism spectrum disorders, behavior disorders, substance use disorders, and psychoses, this practical book provides essential information on how mental health disorders are diagnosed and treated, how they tend to manifest at school, and how they affect students’ emotions, behaviors, and ability to learn. It explains why traditional behavioral interventions are often unsuccessful, and describes effective classroom interventions that teachers can use to provide optimal educational experiences.Teachers will learn the differences between normal child and adolescent behaviors and behaviors that reflect underlying mental health disorders, and will recognize where these behaviors fall on a spectrum, ranging from behavioral (planned, volitional acts that clearly have a function) to the clinical (where a mental health disorder is causing the behavior).They will also learn how to communicate effectively with their school teams (and student families) to ensure that school mental health staff (psychologists, social workers, counselors, and nurses) will be able to provide appropriate interventions for students in need. Administrators will learn the importance of creating a district mental health plan that clearly defines the roles of teachers, mental health staff, principals, and others, with the goal of establishing a seamless system of coordinated professionals all working to meet the student’s needs.Finally, the book profiles successful programs, provided both by school districts and in collaboration with community mental health professionals, including Response to Intervention (RTI), Positive Behavioral Interventions and Supports (PBIS), social-emotional learning, and school-linked mental health services.Based on the author’s thirty years of experience providing consultation to teachers in settings varying from general education classrooms to self-contained special education programs for severely emotionally disturbed students, this book will be an invaluable guide for parents, school principals, special education directors, school social workers, counselors, psychologists, and nurses.",
  "genres": [
    "Nonfiction",
    "Teaching"
  ],
  "author": "William Dikel MD",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/18378041-the-teacher-s-guide-to-student-mental-health"
}