{
  "title": "Building a Better Teacher: How Teaching Works",
  "description": "A 2014 New York Times Book Review Notable Book We’ve all had great teachers who opened new worlds, maybe even changed our lives. What made them so great? Everyone agrees that a great teacher can have an enormous impact. Yet we still don't know what, precisely, makes a teacher great. Is it a matter of natural-born charisma? Or does exceptional teaching require something more? Building a Better Teacher introduces a new generation of educators exploring the intricate science underlying their art. A former principal studies the country’s star teachers and discovers a set of common techniques that help children pay attention. Two math teachers videotape a year of lessons and develop an approach that has nine-year-olds writing sophisticated mathematical proofs. A former high school teacher works with a top English instructor to pinpoint the key interactions a teacher must foster to initiate a rich classroom discussion. Through their stories, and the hilarious and heartbreaking theater that unfolds in the classroom every day, Elizabeth Green takes us on a journey into the heart of a profession that impacts every child in America. What happens in the classroom of a great teacher? Opening with a moment-by-moment portrait of an everyday math lesson―a drama of urgent decisions and artful maneuvers― Building a Better Teacher demonstrates the unexpected complexity of teaching. Green focuses on the questions that really matter: How do we prepare teachers and what should they know before they enter the classroom? How does one get young minds to reason, conjecture, prove, and understand? What are the keys to good discipline? Incorporating new research from cognitive psychologists and education specialists as well as intrepid classroom entrepreneurs, Green provides a new way for parents to judge what their children need in the classroom and considers how to scale good ideas. Ultimately, Green discovers that good teaching is a skill. A skill that can be taught. A provocative and hopeful book, Building a Better Teacher shows that legendary teachers are more than inspiring; they are perhaps the greatest craftspeople of all.",
  "genres": [
    "Education",
    "Nonfiction",
    "Teaching",
    "Parenting",
    "History",
    "School",
    "Research"
  ],
  "author": "Elizabeth   Green",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/18377959-building-a-better-teacher"
}