{
  "title": "Snakes, Sunrises, and Shakespeare: How Evolution Shapes Our Loves and Fears",
  "description": "Our breath catches and we jump in fear at the sight of a snake. We pause and marvel at the sublime beauty of a sunrise. These reactions are no accident; in fact, many of our human responses to nature are steeped in our deep evolutionary past―we fear snakes because of the danger of venom or constriction, and we welcome the assurances of the sunrise as the predatory dangers of the dark night disappear. Many of our aesthetic preferences―from the kinds of gardens we build to the foods we enjoy and the entertainment we seek―are the lingering result of natural selection.In this ambitious and unusual work, evolutionary biologist Gordon H. Orians explores the role of evolution in human responses to the environment, beginning with why we have emotions and ending with evolutionary approaches to aesthetics. Orians reveals how our emotional lives today are shaped by decisions our ancestors made centuries ago on African savannas as they selected places to live, sought food and safety, and socialized in small hunter-gatherer groups.  During this time our likes and dislikes became wired in our brains, as the appropriate responses to the environment meant the difference between survival or death. His rich analysis explains why we mimic the tropical savannas of our ancestors in our parks and gardens, why we are simultaneously attracted to danger and approach it cautiously, and how paying close attention to nature’s sounds has resulted in us being an unusually musical species.  We also learn why we have developed discriminating palates for wine, and why we have strong reactions to some odors, and why we enjoy classifying almost everything.By applying biological perspectives ranging from Darwin to current neuroscience to analyses of our aesthetic preferences for landscapes, sounds, smells, plants, and animals, Snakes, Sunrises, and Shakespeare transforms how we view our experience of the natural world and how we relate to each other.",
  "genres": [
    "Science",
    "Psychology",
    "Nonfiction",
    "Evolution",
    "Anthropology",
    "History",
    "Biology"
  ],
  "author": "Gordon H. Orians",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/18377826-snakes-sunrises-and-shakespeare"
}