{
  "title": "Bijou",
  "description": "Out of printThe Mannequin series is an exciting erotic romance journey that gives readers an intimate look into the not-so-glamorous sides of the fashion and modelling industries. This book contains explicit content and is not intended for younger readers! Everything seems to be going Elodie's way now that her modelling career is finally taking off. She's booking all of the best campaigns, shooting the most prestigious editorials and strutting down the most elusive runways. With her perfect boyfriend at her side, she should feel as if she's on top of the world. So why does she feel so unsatisfied? Continue on with Elodie's story as she faces the ups and downs of her fast-paced life. With rapid changes meeting her at every turn, will she be able to stay strong and persevere? Or will the broken girl inside of her cause her to flounder? Filled with all of the fashionable drama and outrageous characters that are mainstays in Elodie's life, \"Bijou\" is an exciting tale about growing up, surviving hardships and learning to love.' to 'The Mannequin series is an exciting erotic romance journey that gives readers an intimate look into the not-so-glamorous sides of the fashion and modelling industries. This book contains explicit content and is not intended for younger readers! Everything seems to be going Elodie's way now that her modelling career is finally taking off. She's booking all of the best campaigns, shooting the most prestigious editorials and strutting down the most elusive runways. With her perfect boyfriend at her side, she should feel as if she's on top of the world. So why does she feel so unsatisfied? Continue on with Elodie's story as she faces the ups and downs of her fast-paced life. With rapid changes meeting her at every turn, will she be able to stay strong and persevere? Or will the broken girl inside of her cause her to flounder? Filled with all of the fashionable drama and outrageous characters that are mainstays in Elodie's life, \"Bijou\" is an exciting tale about growing up, surviving hardships and learning to love.",
  "genres": [],
  "author": "Olivia Besse-Whitaker",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/18374975-bijou"
}