{
  "title": "Eros and Magic in the Renaissance",
  "description": "It is a widespread prejudice of modern, scientific society that \"magic\" is merely a ludicrous amalgam of recipes and methods derived from primitive and erroneous notions about nature. Eros and Magic in the Renaissance challenges this view, providing an in-depth scholarly explanation of the workings of magic and showing that magic continues to exist in an altered form even today.Renaissance magic, according to Ioan Couliano, was a scientifically plausible attempt to manipulate individuals and groups based on a knowledge of motivations, particularly erotic motivations. Its key principle was that everyone (and in a sense everything) could be influenced by appeal to sexual desire. In addition, the magician relied on a profound knowledge of the art of memory to manipulate the imaginations of his subjects. In these respects, Couliano suggests, magic is the precursor of the modern psychological and sociological sciences, and the magician is the distant ancestor of the psychoanalyst and the advertising and publicity agent.In the course of his study, Couliano examines in detail the ideas of such writers as Giordano Bruno, Marsilio Ficino, and Pico della Mirandola and illuminates many aspects of Renaissance culture, including heresy, medicine, astrology, alchemy, courtly love, the influence of classical mythology, and even the role of fashion in clothing.Just as science gives the present age its ruling myth, so magic gave a ruling myth to the Renaissance. Because magic relied upon the use of images, and images were repressed and banned in the Reformation and subsequent history, magic was replaced by exact science and modern technology and eventually forgotten. Couliano's remarkable scholarship helps us to recover much of its original significance and will interest a wide audience in the humanities and social sciences.",
  "genres": [
    "History",
    "Philosophy",
    "Religion",
    "Nonfiction",
    "Magic",
    "Mythology",
    "Occult"
  ],
  "author": "Ioan Petru Culianu",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/1011154.Eros_and_Magic_in_the_Renaissance"
}