{
  "title": "Think, Act, and Invest Like Warren Buffett  (Investasi0",
  "description": "Jika Anda ingin menciptakan produk konsumen masa depan yang tersebar di seluruh dunia, Steve Jobs adalah teladan ideal yang layak diikuti. Jika Anda berencana ingin menjadi pemain golf yang hebat, Anda mungkin harus mengandalkan Arnold Palmer atau Jack Nicklaus. Nah, jika target Anda adalah mengungguli investor lain dan mencapai tujuan finansial dalam hidup, apa yang harus Anda lakukan? Ayo berpikir, bertindak, dan berinvestasi seperti yang dilakukan investor terbaik: Warren Buffett. Meskipun Anda tidak dapat berinvestasi persis seperti yang dilakukannya, buku Think, Act, and Invest Like Warren Buffett benar-benar memberikan pendekatan berinvestasi yang mantap, bijak, dan sehat berdasarkan nasihat strategi investasi dari Warren Buffett. Dalam buku Think, Act, and Invest Like Warren Buffett, Swedroe memberikan pengetahuan mendasar yang Anda perlukan untuk: - Mengembangkan rencana finansial agar Anda dapat membuat keputusan rasional dengan landasan konsisten - Menentukan tingkat risiko yang tepat bagi Anda, dan mengalokasikan aset Anda dengan sesuai - Membangun portofolio berbiaya rendah, dengan pajak efisien, dan melakukan diversifikasi secara global - Mengelola portofolio Anda dengan menyeimbangkannya secara periodik guna menjaga tingkat risiko tetap sesuai.Editor's NoteBuku Think, Act, and Invest Like Warren Buffett dirancang untuk menjelaskan cara menggunakan suatu prinsip dasar yang dapat membantu Anda mengungguli sejumlah besar investor dan meningkatkan peluang untuk mencapai tujuan finansial dan tujuan hidup Anda. Larry E. Swedroe adalah pimpinan dan Direktur Penelitian BAM Alliance. Ia juga menempati posisi tingkat eksekutif di Prudential Home Mortgage, Citicorp, and CBS. Sepanjang tahun, Swedroe sering menjadi pembicara pada konferensi keuangan dan menulis blog “Wise Investing” di CBSNews.com.",
  "genres": [
    "Finance",
    "Nonfiction",
    "Money",
    "Business",
    "Personal Finance",
    "Self Help",
    "Economics"
  ],
  "author": "Larry E. Swedroe",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/18377494-think-act-and-invest-like-warren-buffett-investasi0"
}