{
  "title": "A Broken Hallelujah: Rock and Roll, Redemption, and the Life of Leonard Cohen",
  "description": "Brings to life a passionate poet-turned-musician and what compels him and his work.Why is it that Leonard Cohen receives the sort of reverence we reserve for a precious few living artists? Why are his songs, three or four decades after their original release, suddenly gracing the charts, blockbuster movie sound tracks, and television singing competitions? And why is it that while most of his contemporaries are either long dead or engaged in uninspired nostalgia tours, Cohen is at the peak of his powers and popularity?These are the questions at the heart of A Broken Hallelujah, a meditation on the singer, his music, and the ideas and beliefs at its core. Granted extraordinary access to Cohen’s personal papers, Liel Leibovitz examines the intricacies of the man whose performing career began with a crippling bout of stage fright, yet who, only a few years later, tamed a rowdy crowd on the Isle of Wight, preventing further violence; the artist who had gone from a successful world tour and a movie star girlfriend to a long residency in a remote Zen retreat; and the rare spiritual seeker for whom the principles of traditional Judaism, the tenets of Zen Buddhism, and the iconography of Christianity all align. The portrait that emerges is that of an artist attuned to notions of justice, lust, longing, loneliness, and redemption, and possessing the sort of voice and vision commonly reserved only for the prophets.More than just an account of Cohen’s life, A Broken Hallelujah is an intimate look at the artist that is as emotionally astute as it is philosophically observant. Delving into the sources and meaning of Cohen’s work, Leibovitz beautifully illuminates what Cohen is telling us and why we listen so intensely.",
  "genres": [
    "Biography",
    "Music",
    "Nonfiction",
    "Memoir",
    "History",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Liel Leibovitz",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/18377960-a-broken-hallelujah"
}