{
  "title": "Saving Italy: The Race to Rescue a Nation's Treasures from the Nazis",
  "description": "From the author of the #1 New York Times bestseller The Monuments Men.When Hitler's armies occupied Italy in 1943, they also seized control of mankind's greatest cultural treasures. As they had done throughout Europe, the Nazis could now plunder the masterpieces of the Renaissance, the treasures of the Vatican, and the antiquities of the Roman Empire. On the eve of the Allied invasion, General Dwight Eisenhower empowered a new kind of soldier to protect these historic riches. In May 1944 two unlikely American heroes--artist Deane Keller and scholar Fred Hartt--embarked from Naples on the treasure hunt of a lifetime, tracking billions of dollars of missing art, including works by Michelangelo, Donatello, Titian, Caravaggio, and Botticelli. With the German army retreating up the Italian peninsula, orders came from the highest levels of the Nazi government to transport truckloads of art north across the border into the Reich. Standing in the way was General Karl Wolff, a top-level Nazi officer. As German forces blew up the magnificent bridges of Florence, General Wolff commandeered the great collections of the Uffizi Gallery and Pitti Palace, later risking his life to negotiate a secret Nazi surrender with American spymaster Allen Dulles.Brilliantly researched and vividly written, the New York Times bestselling Saving Italy brings readers from Milan and the near destruction of The Last Supper to the inner sanctum of the Vatican and behind closed doors with the preeminent Allied and Axis leaders: Roosevelt, Eisenhower, and Churchill; Hitler, Goring, and Himmler.An unforgettable story of epic thievery and political intrigue, Saving Italy is a testament to heroism on behalf of art, culture, and history.",
  "genres": [
    "History",
    "Nonfiction",
    "Art",
    "World War II",
    "Italy",
    "War",
    "Art History"
  ],
  "author": "Robert M. Edsel",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/18378004-saving-italy"
}