{
  "title": "Adventures of an Air Force Wife",
  "description": "Have you ever wondered what it would be like to be a military wife? Did you know that young military families often struggle to survive on military pay? Read the book to learn more about the adventures and struggles of an 18 year old Air Force wife. If being a young military wife wasn't difficult enough, add a baby to the family. The adventures begin at Chanute Air Force Base in Rantoul, Illinois where the family of three lived in their first apartment. An overflowing bathtub, a missing hamster, and some too close neighbors added to the mayhem. To make life even more exciting, the young family was forced to leave their \"comfort zone\" in the midwest and relocate to cold, snowy Minot, North Dakota. Can you imagine moving 1,400 miles from home in the middle of winter at tender age of 18? Arriving in a far off northern tier state with no home, no furniture, and not much money presented many unique challenges. Share the adventures as a young mother daydreams about the rich people who shopped at the former fur store she lived above. Did she find any forgotten fur coats in the vault at Van de Streek Furs? This book details a young family's struggle to survive the brutal North Dakota winters, and creatively live on an airman's pay. Have you ever gone dumpster diving to provide for your family? The adventures take place in the '70s, before cell phones and the internet. Remember CB radios? In the '70s, they were a great way to communicate and meet new people. Would you entrust the care of your baby to someone you met on the CB radio? Read about the family's move to the coveted base housing, which came with a new set of rules and problems. Have you ever thought about joining the military or marrying a service member? Then this is the book for you! This book is an interesting read for current or former military wives, who will be able to relate to the challenges of living from paycheck to paycheck. You haven't shopped until you have waited in line at the commissary for an hour or more on payday! Learn the story behind the slogan, \"Why not Minot? Freezin' is the reason. Ice is nice\".",
  "genres": [],
  "author": "Becky Corwin-Adams",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/18388180-adventures-of-an-air-force-wife"
}