{
  "title": "Breaking Cursed Bonds",
  "description": "Thaddeus Riley was one of the most important people in his nephew Jeremy's life-an eccentric old man passionate about the mysteries of the past. Then, one night Uncle Thaddeus tells Jeremy of an ancient journal that holds untold secrets about his family history. That same night, the journal is stolen and the old man murdered in his home. Days later in Memphis, Tennessee, Emilie de Gourgues discovers an ancient journal telling of a curse that has loomed over her family for centuries. The journal tells stories of French seamen, Florida tribes, and ancient ceremonies once held in the darkness of a world that she knows little of. Haunted by the mystery of her mother's death when Emilie was still a child, the gifted empath vows to break the curse before it destroys any more of the family she loves. In their quest to find answers, Emilie de Gourgues and Jeremy Laughton cross paths in New Orleans. The two are instantly drawn to one another, helpless to fight their attraction as the mystery of the de Gourgues' curse draws them both deeper into a world of voodoo, superstition, and darkness. Travel with Emilie and Jeremy from Memphis to New Orleans, then Florida to France, as they search for the answers to their Cursed Bonds. Breaking Cursed Bonds is book one in the serial Curses & Secrets about the three de Gourgues siblings who live in Memphis and struggle to survive their world filled with supernatural forces and evil foes. Scarred after losing their mother while young children, they are raised by Nina the devout Christian house cook, and their emotionally absent father, Pierre de Gourgues. In book one and two, the eldest brother Robert, reveals his dark side and turns up the heat at the family table. In the first book, Emilie discovers her paranormal power's strength while tracking down the source of a deadly curse that has shadowed her family for generations. The story revealed in an old book instigates her search for answers. Her research brings her to the edge - even voodoo - while searching for answers. She falls in love with Jeremy Laughton and together they go from Memphis to New Orleans - from Florida to France - to break the curse. They go to the extreme and burn the ancient bones, but is it enough to save the family from future deaths? Will an old ceremony save them all?",
  "genres": [],
  "author": "Elisabeth Zguta",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/18386642-breaking-cursed-bonds"
}