{
  "title": "A Terrible Thing Happened: A Story for Children Who Have Witnessed Violence or Trauma",
  "description": "A gently told and tenderly illustrated story for children who have witnessed any kind of violent or traumatic episode, including physical abuse, school or gang violence, accidents, homicide, suicide, and natural disasters such as floods or fire.Sherman Smith saw the most terrible thing happen. At first he tried to forget about it, but soon something inside him started to bother him. He felt nervous for no reason. Sometimes his stomach hurt. He had bad dreams. And he started to feel angry and do mean things, which got him in trouble. Then he met Ms. Maple, who helped him talk about the terrible thing that he had tried to forget. Now Sherman is feeling much better.Children who have witnessed violence or other traumatic incidents are at surprisingly greater risk for committing violence in the future than are children who have actually been involved in such events. The event might be a car accident, domestic or school violence, suicide, or a natural disaster such as a tornado, flood, or fire. Regardless of the type of incident, child witnesses often react by trying to forget or ignore the experience. When their feelings are pushed underground in this manner, these children may begin to feel bad in ways they don’t understand, and become angry as a result of feeling bad. It is this anger that can give way to violence.Caring adults can make all the difference by helping children talk about and understand the experience. An afterword by Sasha J. Mudlaff written for parents and other caregivers offers extensive suggestions for helping traumatized children, including a list of other sources that focus on specific events.",
  "genres": [
    "Picture Books",
    "Childrens",
    "Mental Health",
    "Emotion",
    "Counselling",
    "Parenting",
    "Animals"
  ],
  "author": "Margaret M. Holmes",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/1095833.A_Terrible_Thing_Happened"
}