{
  "title": "Breaking Free: True Stories of Girls Who Escaped Modern Slavery",
  "description": "Somaly Mam was born in the forests of Cambodia in the early 1970’s and sold into sexual slavery by her “grandfather” before she was even twelve years old.Maria Suarez came to America from Mexico when she was fifteen with her family. She went on a job interview to be a maid. When she got inside, her “interviewer” locked the door and told her he owned her body from that moment on.Minh Dang was born in San Jose, California. Her house was always neat and there were bright rose bushes in her front yard. Nobody knew that behind closed doors her parents were raping and abusing her from the time she was three years old. Soon they started selling her body to neighbors as well.These three women could easily have been voiceless victims, lost to the horrors of their own histories. Instead, they not only fought their way out of sexual slavery, they have each become leading advocates and activists in the anti-trafficking movement.Somaly Mam began her work simply, by supplying condoms and soap to the enslaved girls. Soon she was taking girls into her own home and helping them learn a trade. Eventually, a foundation was born where young women, rescued from the sex trade, could begin new lives for themselves. Maria is a counselor for abused women in California and speaks all over the globe about her experiences and empowering women to speak out for their rights. She is also busy starting the Maria Suarez Foundation, dedicated to Prevention, Rescue and Restoration of survivors. Minh is getting her Master’s in social work and has worked as executive director of Don’t Sell Bodies with actress Jada Pinkett Smith. Minh writes and speaks internationally about what it’s like to be a survivor and on learning how to love fearlessly for the first time.Breaking Free: True Stories of Girls Who Escaped Slavery, by award-winning author Abby Sher, recounts these women’s incredible journeys from sex slave to survivor to savior— but it doesn’t stop there. The book delves even deeper into the horrors of human trafficking, an issue at the forefront of global outreach and activism.With help from Somaly, Maria, Minh, and many other survivors and counselors, Sher tells the riveting story of what it means to be liberated from sexual trafficking and find the trust and conviction to help educate new survivors.Remarkable, timely, and incredibly inspiring, Breaking Free, will strike a chord with all young readers as it recounts the stories of these courageous young women who, instead of running from their pasts, choose to help those still caught in the system. It sends the powerful message that, even in the most tragic circumstances, the unwavering hope and compassion of the human spirit can and will shine through.The book has already been hailed by activists and educators as a powerful tool for the classroom and beyond. Breaking Free Teacher’s Guides are available for educators to incorporate the book into their lesson plans and include questions and exercises aligned to the Common Core.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Abuse",
    "Memoir",
    "History",
    "Social Issues",
    "True Crime"
  ],
  "author": "Abby Sher",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/18381760-breaking-free"
}