{
  "title": "Fierce Dawn",
  "description": "To celebrate the June 29th \"Dollars & The Definitive Guide to Self-publishing Success\" Bestseller For a Day event, Bonus Buy \"Fierce Dawn\" is priced down to just 99 cents! Plus, get a chance to win a brand, new KINDLE!Simply purchase \"Dollars & The Definitive Guide to Self-publishing Success,\" and \"Fierce Dawn\" on June 29th then head to BestsellerForaDay.com, fill out the form on the sidebar and you'll also be entered to win a brand new KINDLE!Don't miss the other Bestseller For a Day Bonus \"30 Pieces of Silver\" by Carolyn McCray (#1 Kindle Bestseller Men's Adventure) and \"A Walk In The Snark\" by Rachel Thompson! Both are discounted to 99 cents as well for this amazing Indie Book Collective event.  (This is not an Amazon promotion so please contact Bestsellerforaday.com with any questions.)#FierceDawn on Twitter. Tune in!\"Intensely satisfying!\"-Carolyn McCrayKindle Bestselling author, 30 Pieces of Silver~Snarling teeth, glowing eyes. Someone--something--is after her.The man who haunts her dreams enters her reality, claiming she's transforming into a changeling--not quite immortal but no longer human.Battle lines are drawn and blood spills as the two fight not only for her life, but for mankind's as well.~More Reviews\"Conspiracy, vampires, human changelings? I dare you to put this fresh take on the genre down!\"-ParaYourNormal, 5 stars\"A stunning premier to a series with huge potential. I'm hooked!\"-Your Need To Read, 5 starsCharlaine Harris and Sherrilyn Kenyon fans will devour this one.** for Historical Fantasy, search \"Irish Moon\" by Amber Scott** for Light Paranormal, grab \"Play Fling\" by Amber Scott** for more ParaRealm, try \"Love Lust\" by Amber ScottSign up for her newsletter at AmberScottBooks.com to get in on exclusives, signed ebooks, extras and more.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Vampires",
    "Urban Fantasy",
    "Angels",
    "Fiction"
  ],
  "author": "Amber Scott",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/10958339-fierce-dawn"
}