{
  "title": "I Choose You",
  "description": "Trevillo Nelson is a different kind of billionaire. He wears that sharp business suit, but it sure as hell doesn’t fit. He does things on his own terms and lives by his own rules. A man of singular tastes, this thirty-two year old, oversexed demon doesn’t do young chicks. Are you single, free and disengaged? Sorry, he’s not into you. Are you off the market? Well, he’s most certainly attracted. And best believe he’ll seduce your underwear right down to your ankles, leaving you no choice but to give in.That’s how the real estate mogul has always lived his life—backwards. But everything takes a drastic turn, both for better and for worse, when twenty-five year old interior designer, Krissan Kingston, walks into his office… Precious savior, it’s Angel versus Demon. Krissan Kingston is carefree, selfish, and unconcerned with the complexities of life. She lives each day as it is given, uses men for her own sexual pleaures, and then discards them without a second thought. She believes life and people are overrated, so she strides through life with a shrug and a “whatever”. Right out of the blue on a normal workday, Krissan Kingston gets summoned to her elusive boss’s office. She enters… …takes one look at the intimidating man with searing, azure-blue eyes and sees only one thing: Danger. But instead of running in the opposite direction, she runs straight to him, crashing, colliding, exploding, not knowing who’s more hazardous to whom:  Him to her, or her to him?When temptations arise and they are both tested, they both fail. And before they can even begin to forgive each other, to work it out, those mistakes erupt in their faces, throwing both their lives to the threat of death. Will either of them be able to crawl out of their tumultuous relationship unscathed? Alive, even? Will they be able to look past all their ugliness and make it work somehow? This is Trevillo and Krissan’s story, the third and final book of the Billionaire Brothers series.",
  "genres": [
    "Romance",
    "Contemporary",
    "Love",
    "Contemporary Romance"
  ],
  "author": "S. Ann Cole",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/18379475-i-choose-you"
}