{
  "title": "Hinter verzauberten Fenstern",
  "description": "Gleich hinter dem ersten Türchen lauert eine Riesenenttäuschung, zumindest auf den ersten Blick. Eigentlich hat sich Julia das ja ohnehin schon gedacht, als Mama für ihren kleinen, schleimigen Bruder Olli den wunderschönen Adventskalender mit Schokoladenfiguren aus der Tasche zog und ihr, nur weil sie mit neun Jahren angeblich zu alt für Schokoladengeschenke ist, nur ein lächerlicher Kalender aus Papier mit einem glitzernden Haus vorne drauf übrig bleibt. Und dann verbirgt sich hinter dem ersten Türchen auch tatsächlich ein alberner Dachboden voller Gerümpel! Aber trotzdem: Irgend etwas ist besonderes an dem Geschenk der Mutter. Und wirklich entdeckt Julia, dass ihr Adventskalenderhaus voller Leben und voller Geschichten mit Königen, Lügnern, Zwergen und verlorenen Geheimnissen steckt, in die sie selbst eintauchen und hineinspazieren kann. Und das wird auch für Leser zu einem echten, kunterbunten Vorweihnachts-Vergnügen. [image] Richtig bekannt wurde die 47-jährige Illustratorin Cornelia Funke erst, als sie vom Zeichenstift an die Computer-Tastatur überwechselte und phantastische Kinderbücher für Kinder und Erwachsene schrieb. Drachenreiter, Herr der Diebe, Tintenblut und Tintenherz legen hiervon beredtes Zeugnis ab. Hinter verzauberten Fenstern hat im Vergleich zu diesen Mega-Sellern vielleicht die kleinere, stillere Geschichte, ist aber nicht weniger phantasievoll als diese. Und auch hier kommt zum Tragen, dass Funke als Zeichnerin angefangen hat: denn sie zeichnet ihre literarischen Bilder derart lebendig und warm, dass man ihr selbst die größte Fiktion dankbar glauben will. Hinter verzauberten Fenstern ist ein wundervoll leises, märchenhaftes Buch, bei dem sich dem Leser hinter jeder Seite eine neue Welt eröffnet. Wie bei einem guten Adventskalender eben -- und vor allem bei solchen, die nicht aus Schokolade sind und auf den ersten Blick etwas enttäuschend wirken. Schade ist da nur, dass es statt 24 nur 16 Kapitel gibt. Ab 8 Jahren. --Stefan Kellerer",
  "genres": [
    "Fantasy",
    "Christmas",
    "Childrens",
    "German Literature",
    "Fiction",
    "Middle Grade",
    "Audiobook"
  ],
  "author": "Cornelia Funke",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/1839462.Hinter_verzauberten_Fenstern"
}