{
  "title": "How to Build Self-Esteem and Be Confident: Overcome Fears, Break Habits, Be Successful and Happy",
  "description": "Would YOU like to live a Rich and Fulfilled life? Is it time to Empower Yourself and take Control of your Emotions? Proven FACT: Most of us sabotage our success & happiness! This Inspirational book can help you to: Be Positive, Believe in Yourself and Achieve Peak Performance. This book has received great reviews from: Best selling authors, Clinical Psychologists, Media personnel, Entrepreneurs, Business Executives, Wellness coaches and people from all walks of life (few mentioned in the editorial reviews section on Amazon.com). About Author >> Maddy Malhotra is an International Motivational Speaker and Success Coach. He is a regular guest on radio and has been interviewed by stations worldwide including the BBC. He’s done motivational shows for well-being TV channels and has been featured in several national newspapers and health magazines. His life story has inspired hundreds of thousands worldwide. He lives in the UK and is involved in several Charity/non-profit projects. Maddy is passionate for helping people to achieve Success, Happiness and Self-Love. Maddy says >> I have shared the philosophies and principles which have been followed by every successful person and their roots can also be found in ancient wisdom. I have applied and lived these myself and my clients have benefited from it. I don’t want anyone to feel unworthy, unlovable, or incapable so I have revealed some very important facts which can help you live a happier and fulfilled life. These secrets affect every area of our lives every single day but are not taught at school and are rarely a part of parenting! This became the biggest reason for me to write this book and create seminars and home study course. “High Self esteem (self-belief), a fearless Positive Mind, Confidence in Your Abilities, Effective Habits and Clear Goals – are essential to create a Prosperous and Happy life” From the back cover >> “We need a Positive Self-Image for Career or Business Success, Ideal Body and Happy Relationships. ” Many hours and much money are spent every year in the pursuit of getting thinner, richer, more confident, ‘better’ jobs and fulfilling relationships. And yet we never quite seem to achieve what we desperately seek and we can’t seem to keep hold of it when we do. Why is this? Quite simply we sabotage our own efforts with ‘limiting beliefs’ about our capabilities and our worth. In this Easy to read and Practical book Maddy Malhotra aims to help us change that forever. If you have ever failed to achieve something you set out to do or achieved it and then lost it afterwards, this is the book for you. Learn why and how your beliefs are holding you back, what you can do about it and how You Can build Belief in Yourself. You have nothing to lose and everything to gain (including those elusive goals)! FACT: ‘They’ didn’t teach us the principles of success and happiness! This book can help you achieve >> More Time for Yourself, Happy Relationships, Clear & Effective Goal setting, Financial Success, Emotional Intelligence, Leadership Skills, Self Empowerment, Create a Positive Attitude, Mental Toughness, Positive Behaviour, Decision Making Skills, Inner Motivation, Self Love, Inner-Peace, Effective Parenting, Understanding 'How Life Works', High Self-Esteem, Boost / Increase Confidence, Overcome / Get rid of Fears, Break Bad Habits & develop new like the world class achievers, Be Successful, Be Happy, Be Peaceful, Forgiveness and daily Gratitude. If you like Stephen Covey’s Seven Habits of Highly Effective People or Brian Tracy’s books or the Chicken Soup for the Soul series (Jack Canfield), then you’ll like this too! Some readers of this book, who had read ‘The Secret’, realised why the ‘law of attraction’ didn’t work for them! You can read Maddy’s inspirational life story and his humanitarian projects at CoachMaddy.com Like many, you can also benefit from his personal development articles, media interviews, and blog.",
  "genres": [
    "Personal Development",
    "Self Help"
  ],
  "author": "Maddy Malhotra",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/18393593-how-to-build-self-esteem-and-be-confident"
}