{
  "title": "Adaptations: From Short Story to Big Screen: 35 Great Stories That Have Inspired Great Films",
  "description": "An Eclectic Collection of Fiction That Inspired Film\nMemento, All About Eve, Rear Window, Rashomon, and 2001: A Space Odyssey are all well-known and much-loved movies, but what is perhaps a lesser-known fact is that all of them began their lives as short stories. Adaptations gathers together 35 pieces that have been the basis for films, many from giants of American literature (Hemingway, Fitzgerald) and many that have not been in print for decades (the stories that inspired Bringing Up Baby, Meet John Doe, and All About Eve).Categorized by genre, and featuring movies by master directors such as Steven Spielberg, Stanley Kubrick, Robert Altman, Frank Capra, and John Ford, as well as relative newcomers such as Chris Eyre and Christopher Nolan, Adaptations offers insight into the process of turning a short story into a screenplay, one that, when successful, doesn’t take drastic liberties with the text upon which it is based, but doesn’t mirror its source material too closely either. The stories and movies featured in Adaptations include: - Philip K. Dick’s “The Minority Report,” which became the 2002 blockbuster directed by Steven Spielberg and starring Tom Cruise- “The Harvey Pekar Name Story” by reclusive graphic artist Harvey Pekar, whose life was the inspiration for American Splendor, winner of the 2003 Sundance Grand Jury Prize- Hagar Wilde’s “Bringing Up Baby,” the basis of the classic film Bringing Up Baby, anthologized here for the first time ever- “The Swimmer” by John Cheever, an example of a highly regarded story that many feared might prove unadaptable•The predecessor to the beloved holiday classic A Christmas Story, “Red Ryder Nails the Hammond Kid” by Jean ShepherdWhether you’re a fiction reader or a film buff, Adaptations is your behind-the-scenes look at the sometimes difficult, sometimes brilliantly successful process from the printed page to the big screen.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Film",
    "Anthologies",
    "Writing",
    "School",
    "Audiobook"
  ],
  "author": "Stephanie Harrison",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/183947.Adaptations"
}