{
  "title": "Delayed Penalty",
  "description": "All choices have consequences, only sometimes they’re . . . delayed.Cortland Nash fled Dartmouth to avoid being arrested for murder, but his best friend, Ford Delgado, is in danger. Cort returns, prepared to keep his head down, and do whatever it takes to keep Ford breathing, but when he finds a beautiful young woman out in the snow, frozen in fear, his plans change. He needs to make sure she’s safe—even if the greatest danger is him.Akira Hayashi never thought she’d overcome her fear of men, but the care of an experienced Dom helped her achieve so much more. She’s embraced her submissive side, and found her strength as the captain of the Dartmouth Cobras’ Ice Girls. There’s nothing she can’t do—except function when she’s mugged in a parking lot. The intimidating stranger who rescues her makes her feel things she never thought possible. The only problem is his connection with Ford, a man she’ll hate forever because she refuses to feel anything else.With the constant threats from the crime lord he once called “Dad,” Ford Delgado has no room in his life for love. Unfortunately, Akira already has his heart—which is split in two when he discovers Cort is dating her. The betrayal has him lashing out, trying to move on, to grow as a Dom, and free himself from Kingsley’s criminal empire. He tries to forget what Akira means to him, but one look into her eyes shows him the last thing she needs is for him to let her go.WarningThis e-book contains material not suitable for readers under 18. There are situations involving sex and violence and extreme emotions as a result. It also contains scenes that some may find objectionable, including BDSM and other rather enjoyable practices. As the characters are prone to exploring their sexuality, it is advised that readers be prepared to see some lines blurred. Or erased….Author takes no responsibility for nonexistent lines. ;)Author’s Note: The Cobras series has a continuing arc about the franchise, players, and previous relationships. Some plots continue through the series and may involve more than the main ménage. The series is best read in order.",
  "genres": [
    "BDSM",
    "Menage",
    "Erotica",
    "Romance",
    "Sports",
    "Hockey",
    "Contemporary"
  ],
  "author": "Bianca Sommerland",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/18392433-delayed-penalty"
}