{
  "title": "Childhood",
  "description": "Thomas MacMillan is 40, an orphan, an heir, a laboratory technician, an autodidact of esoteric intellectual appetites, as he writes this interrogation of the past disguised as a letter to his absent lover. Like Andre Alexis, both Thomas's restlessly sexual mother, Katarina, and his courtly mentor, Henry Wing, were born in Trinidad and resettled in Canada. Their unconventional lifelong relationship is both the deepest mystery and the central fact of Thomas's life, the creature in the center of his heart and the heart of this fictional memoir, the beast he walks around and around, prods with questions and tries to fix with lists of explanations and attributes. From his quasi-scientific attempts to understand the past, the nature of love in general and theirs in particular, Alexis derives some entertaining narrative quirks, including Thomas's notes, graphs, and footnotes in the text, letting paragraphs elide into nothingness as questions of motivation remain unresolved. After Thomas's grandmother dies, an event it takes him the better part of a day to discern, his footloose mother appears to claim her son, accompanied by a lover who abandons both on the road to Montreal. Mother and son seek refuge in the Ottawa home of the deliciously eccentric Henry Wing, a stock trader with a home laboratory and a gigantic library, who may or may not be Thomas's biological father. By the end of this gently funny and genuinely original little novel, we come to understand that what first seems linear and picaresque is actually a perfect circle, as Katarina goes home to die in her mother's bed and Thomas comes to inhabit Henry's wayward style of scholarship and his patient, distant style of loving. A debut this sly and satisfying promises fine things to come. --Joyce Thompson",
  "genres": [
    "Fiction",
    "Canada",
    "Literary Fiction",
    "Contemporary",
    "Adult Fiction",
    "Adult"
  ],
  "author": "André Alexis",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/18397052-childhood"
}