{
  "title": "This Love's Not for Sale",
  "description": "Alternate cover image for ASIN: B00FJE9026 Revised edition.Written for mature audiences and contains kinky graphic sexual encounters & profanity, bondage & discipline, domination and submission, loads of steamy verbosity, and an alpha male that'll irk you, irritate you, then finally make you quiver, laugh and swoon.I command. You obey. Always. Am I clear? Tucker wants Lilliana’s land and her panties in his trophy case, and more to the point – her submission. She wants nothing to do with his BS, but it's his domination that she can't resist... When the brutally honest and arrogant real estate mogul who is used to getting his way in all things meets the thirty-something year old opinionated and guarded dental hygienist, their chemistry and physical attraction to one another is undeniable. Realizing that Lilliana has inherited a large tract of land and is sitting on a real estate goldmine, Tucker sets his sights on trying to obtain her acreage at any cost - even if it means deceiving and buying his way into her heart. But Lilliana has no interest in falling in love or being pursued by a certain attractive yet overly-confident alpha male interested in her property and she can't be bought.Lilliana’s quick wit and no BS attitude throw the domineering Tucker into a tailspin. But she has a way of bringing out his humor and his hidden soft side. Tucker on the other hand knows just how to bring out her submissiveness. Just when things are heating up and he starts to fall for her, she discovers where his true motivations lie, tearing her heart in two and forcing her to seek sweet revenge the only way she knows how - by giving in to his deepest fantasy and toying with his emotions.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Erotic Romance",
    "Adult"
  ],
  "author": "Ella Dominguez",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/18398392-this-love-s-not-for-sale"
}