{
  "title": "Loco",
  "description": "The hard driven, ambitious delta force operator is immune to women. His heart has been destroyed by a treacherous woman and the unexpected loss of his family. These events have driven him nearly into insanity. The hard knocks in life propel him into grasping his emotions, his thoughts, and his physical condition. He focused on his goal. Loco doesn’t allow any type of distractions or obstacles to stop him. His actions and recklessness have earned him his nickname, Loco.The Infinite power, Razer 8 operatives, are united and linked for infinity. His team mates recognize his pain, anger, and strength is derived from the intense impotency he feels from his loss.The unexpected mission and unexpected encounter with his soul mate, tests his strength. His mind, heart, and soul recognize his love even before the actual encounter. The ruthless criminals threaten to harm his soul mate, pushing and transforming him into a fearless warrior.Delicious Taste“Mr De Leon, I’m sorry for your loss,” conveys Officer Taylor. He observes Roberto’s dazed vacant stare. “The police department is doing everything in its power to investigate. We don’t have any evidence or motive for your family’s death. The car explosion was an accident. It was simply unusual and bizarre.”“Officer Taylor, I want the police department to keep me informed of any new evidence,” replies Roberto, glancing over at the officer. This is a fucking nightmare! I can’t believe that someone intentionally tampered with my parents’ car to kill them and my only brother. I’m going to get to the bottom of this, fumes Roberto. He stands ready to run to the only comfort he has. He runs to Jennifer. I know that I’ll feel a little better when I’m with Jennifer. She’s my love. She’ll be pleased and surprised to see me, muses Roberto. “I will be returning to base,” states Roberto. “I don’t know when I’ll return, since I was accepted to a special department. I plan on staying in the military for a while.”“Mr. De Leon, we will advise you on any new developments,” replies Officer Taylor, nodding. Roberto nods and walks out of the office. I need to see Jen. I’m hurting so deeply. I know that I’ll feel a little better when I get a chance to hug Jen, he thinks. He strides down the hall and out of the police department. He walks over to his car and drives straight to Jennifer’s home. I know that she hasn’t a clue that I’m home. I can’t wait to see her huge smile, thinks Roberto. He wipes a tear that rolls down his face from anger and grief. Damn it! I can’t cry. I have to stay strong because I need to make arrangements for the funeral after I see Jen. Yeah, I know she’ll want to go with me. I need her so badly. Roberto parks the car and walks up the walkway, glancing inside through the window. Hell, no! Fucking hell, no! This is surreal! Jennifer is with another bastard and really going at it! Roberto sees red as he walks up to the door. He bangs on the door enraged. His anger and hurt is excruciating. I can’t believe this! Damn, is this a punishment? This is too much! I’ve lost my family and now my girl! he thinks. Yeah, I want to see her face when she sees me and realizes that I saw her! Then I’m gone!Jennifer pulls away, startled and concerned. “Wow, who can that be? My parents left for a few days, Adam,” says Jennifer. She grabs Adam’s shirt and pulls it on. “Damn, Adam! We’re making love in the living room for anyone to see us!” says Jennifer. “We should’ve gone to my bedroom. Goodness only knows who saw us.” “Sweetie, it’s probably the UPS guy,” laughs Adam. “He only saw your sweet ass.” Jennifer laughs, shaking her head. “I’ll be right back,” says Jennifer. She leans down for a kiss. Roberto bangs on the door again, livid! Damn whore! To think that I thought she was my future, my dreams, my everything! he fumes.Jennifer walks over to the door, impatient to return to Adam. She opens the door, ready to blow off whoever it is. “Stop banging on my door!” yells Jennifer. “No worries, Jen. I’ll never bang on your door again!” yells Roberto. “Just take your trashy ass back to that bastard and bang him!” He walks backwards, glaring at her. Jennifer blinks, startled to see Roberto. Omg, it’s my Roberto! Oh wow! He caught me! Now what? “Babe, he doesn’t mean anything to me,” says Jennifer. Stepping outside, she closes the door.“Yeah, right! I never touched you! I wanted to respect you and wait for our wedding night! I loved you! I’m done, and gone!” states Roberto, standing straight and proud. He glares at her, registering her surprise and her shameless apology. Yeah, she didn’t love me. She wanted my parents’ money. I can see that now, he thinks. He turns and walks to his car. He doesn’t listen to her explanations. He heads straight to make arrangements for the burials. The next few days pass quickly and Roberto goes through the days in a robotic daze.  A few years, later Roberto is walking into the new classroom to meet his new team. Damn, I’m so excited! He thinks. He walks in and nods to the guys in the room. He takes a seat, turning to watch the Commanding Officer for the Delta Force enter the classroom. “Good morning, Officers,” says Commander Knight. He stands straight in front of the room. “I want to welcome you to the new Delta Force team. The name Razer was selected because you will be able to raze any entity, country, or structure in the world.”Commander Knight observes each team operative. He needs to register their commitment, excitement and aspiration. “The agency believes each one of you will be the best operative in the world, in your field of expertise. Every single officer on this team was selected because of his outstanding skills, education, and physical condition. Each operative has a special talent or ability that will be honed to excellence. Each of you will undergo an extensive training that will take you high into the realms of the infinite power. Your training starts now!” The eight operatives stand straight, proud, and anxious to start the next phase in their military career. Each one has a reason, a dream, and need to be a Delta Force operative.  Months later, the eight operatives are celebrating their accomplishments. Their training is over. Each one has excelled in every facet of their training. Their bond is strong, absolute, and invincible.“Damn! Damn! We’re a whole unit and we’re the infinite power!” says Panther, taking a drink of his whiskey. He grins, contemplating his new tattoo. “Dudes, I’m going to get this tattoo as a symbol of the Infinity. This represents to me the unity and infinite power that we have. We've worked hard to accomplish our goal and complete this bond.”“Yeah, I agree with Panther,” voices Phantom, nodding. “We should make the promise of being united and linked for infinity.”“Damn! That sounds sweet,” says Bulldog, nodding. “Hell, yeah! I’m in.”“That sounds incredible! I love the idea. We should all have the double infinity symbol tattoo that Panther is getting. This will be our symbol of being united and linked for infinity. Hell, yeah! We’re the infinite power!” says Redfox, nodding. He looks over at the rest of the operatives. “Damn, yes!” says Loco, solemnly.“I’m in,” says Ghost in a soft low tone. “You don’t have to ask me twice,” voices Thunder, nodding. He looks over at his twin, raising an eyebrow. He mentally transmits, you’re in, right?“Absolutely! Show us the tat,” says Lightning, growling. Panther roars with pleasure. He gets the image from his wallet. “This tat will be our evidence and commitment to being united and linked for infinity,” he says. “Damn! That’s a sweet tat,” says Bulldog, grinning. “Let’s go now, on this first day of being an official Delta Force. Now we’re official, Razer 8 Delta Force Operatives,” says Redfox, grinning. “Hell, yes! We’re officially Infinity to one other!,” roars Panther. Infinity is the name taken by Razer 8, the Special Delta Force operators. The infinite power Razer 8 team operators are an offensive team working against the drug cartel, drug dealers, and all types of terrorist groups. The U.S. Delta Force Special Operations Unit, organized for the conduct of missions, requires that the Delta Force team be highly adaptable and completely self-sufficient. These men know that they can rely on one another when they have no one else. This is their new family!",
  "genres": [
    "Romance",
    "Paranormal",
    "M M Romance",
    "Amazon",
    "Romantic Suspense",
    "Suspense",
    "Military Fiction"
  ],
  "author": "P.T. Macias",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/18398122-loco"
}