{
  "title": "Sunan Ibn Majah",
  "description": "هو من أَجَلّ كتب ابن ماجه وأعظمها وأبقاها على الزمان، وبها عُرِف واشتُهِر.وهو سادس الكتب الستة على القول المشهور؛ إذ كان المتقدمون يعدّون الكتب الأصول خمسة: الصحيحين، وسنن أبي داود، والترمذي، والنسائي، ثم ألحق بها سنن ابن ماجه.وإنما قُدِّم على غيره من الكتب؛ لما فيه من الجوانب التي تفضل به على غيره، ولما فيه من الزوائد على الكتب الخمسة الأصول، ولما فيه من الفقه وحسن الترتيب، وجَودة سَوق الأحاديث واختصار المتون.كما يمتاز سنن ابن ماجه بدقة الترتيب وكثرة الأبواب، وتناسبها مع ما اشتملت عليه من الفقه، وعدد كتبه (37) كتاباً، وعدد أبوابه (1500) باباً.قال الحافظ ابن حجر: كتابه في السنن جامعٌ جيّدٌ كثيرُ الأبواب والغرائب.وقد رَتّب ابنُ ماجه سننَهُ على الكتب والأبواب الفقهية، وقد أحسن وأجاد حينما بدأها بباب اتباع سنة رسول الله صلى الله عليه وسلم، وساق فيه الأحاديث الدالّةَ على حُجّية السنة، ووجوب اتباعها والعمل بها.وسنن ابن ماجه منها: الصحيح، والحسن، والضعيف، بل والمنكر والموضوع على قلة. ومهما يكن من شيء، فالأحاديث الموضوعة قليلة بالنسبة إلى جملة أحاديث الكتاب، التي تزيد عن أربعة آلاف حديث، فهي لم تَغُضّ من قيمة الكتاب، فسنن ابن ماجه أصل من أصول السنة، وينبوع من ينابيعها.ويبلغ عدد أحاديثه (4341) حديثاً، منها (3002) حديثاً وردت في الكتب الخمسة أو بعضها، أما زياداته على الخمسة فهي (1339) حديثاً، منها (428) حديثاً صحيحاً، و(613) حديثاً ضعيفاً، و(99) حديثاً ما بين واهية الإسناد أو منكرة موضوعة.والإمام ابن ماجه هو: محمد بن يزيد بن ماجه الرَبعي القَزويني، أبو عبد الله، أحد الأئمة في علم الحديث، من أهل قَزوين، ولد سنة (209ﻫ)، رحل إلى البصرة وبغداد والشام ومصر والحجاز والرَي في طلب الحديث، وتوفي سنة (273ﻫ)، له (تفسير القرآن) وكتاب في (تاريخ قَزوِين).بيانات الطبعة الأصلية: طبع هذا الكتاب عن الطبعة الأصلية المعتمدة المطبوعة في مطبعة عيسى البابي الحلبي وشركاه بمصر سنة 1373ﻫ-1954م، بتحقيق العلامة محمد فؤاد عبد الباقي.http://www.daralnawader.com/books/boo...رابط التحميل:http://www.riyadhalelm.com/book/9/8_s...",
  "genres": [
    "Islam",
    "Religion"
  ],
  "author": "ابن ماجه",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/18395646-sunan-ibn-majah"
}