{
  "title": "The Truth About Love",
  "description": "When New York Times bestselling author Stephanie Laurens created the Cynsters, a phenomenon was born. Bold, passionate, and possessive, the Cynster men let nothing stand in their way when it comes to claiming the women of their hearts. Now, Stephanie Laurens has written her most romantic and powerful novel to date, one that dares tell The Truth About Love.Gerrard Debbington is one of the chosen few -- the gentlemen who've learned their social and amorous skills at the feet of the masters. Handsome and wealthy, protégé and brother-in-law of Vane Cynster, Gerrard is part of the charmed Cynster family circle. One of the most eligible gentlemen in the ton, Gerrard is constantly besieged by offers from London's most sought-after beauties, but as the ton's foremost artistic lion, there's only one offer he wants to accept -- the chance to paint the fantastical but seldom-seen gardens of reclusive Lord Tregonning's Hellebore Hall.That chance is dangled before Gerrard, but to grasp it he must fulfill Lord Tregonning's demand that he also create an open and honest portrait of the man's daughter. Gerrard loathes the idea of wasting his time and talents on some simpering miss, but with no alternative, he agrees ...Only to discover that Jacqueline Tregonning inspires him as no other lady has. Certainly she is beautiful, but Gerrard is stunned by the deep emotions she stirs and is captivated by her passionate nature and innate goodness. He is soon convinced that Jacqueline is the soul mate he needs as his wife.But something is horribly wrong at Hellebore Hall. Evil lurks in the beautiful gardens and along the rambling pathways. And that evil reaches out to ensnare Jacqueline, trapping her in a web of insidious whispers -- whispers that paint her as a double murderess.The rumors are false, but someone is actively spreading them. Convinced that Jacqueline is innocent of all wrongdoing, Gerrard is confident his portrait will open others' eyes to the truth he sees, but when a long-dead body is discovered in the gardens, the campaign to blame Jacqueline escalates -- Gerrard and she are running out of time. The days they spend together lead to nights of sweeping passion -- and Gerrard vows to move heaven and earth to protect the woman who, for him, personifies the truth about love.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Regency",
    "Historical Fiction",
    "Fiction",
    "Regency Romance"
  ],
  "author": "Stephanie Laurens",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/1839511.The_Truth_About_Love"
}