{
  "title": "L'Extraordinaire Voyage du fakir qui était resté coincé dans une armoire Ikea",
  "description": "Le premier mot que prononça l'Indien Ajatashatru Lavash Patel en arrivant en France fut un mot suédois. Un comble !Ikea.Voilà ce qu'il prononça à mi-voix.Cela dit, il referma la porte de la vieille Mercedes rouge et patienta, les mains posées comme un enfant sage sur ses genoux soyeux.Le conducteur de taxi, qui n'était pas sûr d'avoir bien entendu, se retourna vers son client, ce qui eut pour effet de faire craquer les petites billes en bois de son couvre-siège.Il vit sur la banquette arrière de son véhicule un homme d'âge moyen, grand, sec et noueux comme un arbre, le visage mat et barré d'une gigantesque moustache. De petits trous, séquelles d'une acné virulente, parsemaient ses joues creuses. Il avait plusieurs anneaux dans les oreilles et sur les lèvres, comme s'il avait voulu refermer tout cela après usage à la manière d'une fermeture Éclair. Oh, le joli système ! pensa Gustave Palourde, qui vit là un fantastique remède contre les papotages incessants de sa femme.Le costume en soie grise et brillante de l'homme, sa cravate rouge, qu'il n'avait pas pris la peine de nouer mais d'épingler, et sa chemise blanche, le tout horriblement froissé, témoignaient de nombreuses heures d'avion. Mais étrangement, il n'avait pas de bagage.Soit il est hindou, soit il a un sacré traumatisme crânien, pensa le chauffeur en voyant le gros turban blanc qui entourait la tête de son client. Mais son visage mat et barré d'une gigantesque moustache le faisait plutôt pencher pour un hindou.- Ikea ?- Ikea, répéta l'Indien en laissant traîner la dernière voyelle.- Lequel ? Heu... What Ikea ? bafouilla Gustave qui se sentait aussi à l'aise en anglais qu'un chien sur une patinoire.Son passager haussa les épaules comme pour dire qu'il s'en fichait. Djeustikea, répéta-t-il, dontmatazeoanezatbetasiutyayazeparijan. C'est à peu près ce qu'entendit le conducteur, une suite confuse de gazouillis palataux incompréhensibles. Mais gazouillis palataux ou pas, en trente ans de métier passés chez Taxis Gitans, c'était bien la première fois qu'un client fraîchement débarqué du terminal 2C de l'aéroport Charles-de-Gaulle lui demandait de le conduire dans un magasin de meubles. Car il n'avait pas souvenir qu'Ikea ait récemment ouvert une chaîne d'hôtels à son nom.Gustave en avait eu des requêtes insolites, mais celle-là décrochait le coquetier. Si ce gars-là venait vraiment d'Inde, alors il avait payé une petite fortune et passé huit heures dans un avion, tout cela dans le seul but de venir acheter des étagères Billy ou un fauteuil Poäng. Chapeau !",
  "genres": [
    "Fiction",
    "Humor",
    "France",
    "Contemporary",
    "Roman",
    "Adventure",
    "Novels"
  ],
  "author": "Romain Puértolas",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/18399092-l-extraordinaire-voyage-du-fakir-qui-tait-rest-coinc-dans-une-armoire"
}