{
  "title": "The New Age of Russia: Occult and Esoteric Dimensions",
  "description": "This book grew in part out of the research conference \"The Occult in 20th Century Russia. Metaphysical Roots of Soviet Civilization,\" which was held in Berlin 2007, organized by Birgit Menzel. From the blurb: Occult and esoteric ideas became deeply embedded in Russian culture long before the Bolshevik Revolution. After the Revolution, occult ideas were manifested in literature, the humanities and the sciences as well. Although the Soviet government discouraged and eventually prohibited metaphysical speculation, that same government used the Occult for its own purposes and even funded research on it. In Stalin's time, occultism disappeared from public view, but it revived clandestinely in the post-Stalin Thaw and became a truly popular phenomenon in post-Soviet Russia. From cosmism to shamanism, from space exploration to Kabbalah, from neo-paganism to science fiction, the field is wide. Everyone interested in the occult and esoteric will appreciate this book, because it documents their continued importance in Russia and raises new issues for research and discussion. From the contents: Julia Mannherz: The Occult and Popular Entertainment; Konstantin Burmistrov: The History of Esotericism; Oleg Shishkin: The Occultist Aleksandr Barchenko; Markus Osterrieder: From Synarchy to Shambhala; Michael Hagemeister: Konstantin Tsiolkovskii and the Occult Roots; Birgit Menzel: Occult and Esoteric Movements; Leonid Heller: Away from the Globe; Marlene Laruelle: The Intellectual Experience of Cosmism; Demyan Belyaev: Occult and Esoteric Doctrines; Mark Sedgwick: Occult Dissident Culture; Marina Aptekman: Through an Occult Prism; Bernice Glatzer Rosenthal: Occultism as a Response to a Spiritual Crisis.",
  "genres": [
    "Nonfiction",
    "Russia",
    "Occult"
  ],
  "author": "Birgit Menzel",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/18402061-the-new-age-of-russia"
}