{
  "title": "Parley After Life - DIY Guide to Death and other Taxes",
  "description": "A bizarre fantasy that tries to piece together what happens to a young man after his untimely death places him in dark exile.When you die before you’re supposed to, sometimes you end up in a strange, in-between place. At least that’s where the unnamed narrator finds himself after a mysterious accident places him in the pathway of a pooch named Parley. Turns out, the Grim Reaper only uses his black cape as a ruse; Parley is actually his true form. And with that knowledge, readers are quickly catapulted into the outlandish, slightly off-kilter explanation of what happens to people in this version of purgatory. They’re not meant to be there, so they’ve got to find a way to pass the time. The book’s main character—though he’s never truly named, he earns the nickname Wit because of his sense of humor—is understandably puzzled by his predicament and filled with a strong desire to go home. In his often disturbing yet oddly endearing first novel, Miller creates a kind of “Jabberwocky”-style story in which fans of strange, Seuss-ian characters—“Pillow is the goddess of Lost Sleep. Don’t let her yawn on you or you’ll be snoring for a hundred years; or until a passing virgin kisses you”—will feel right at home. Readers never get terribly comfortable with the characters Wit meets, and they’re probably not supposed to; this is the afterlife, after all. Yet the story is so whimsically told that the Through the Looking Glass frivolity starts to make a strange sort of sense. Miller’s work here might be inspired by his own son’s untimely death, and his grief is palpable. In the author’s estimation, young men, especially those in their teens, should not die; their move into maturity is reflected in Wit’s slow understanding of the alternate world he now lives in and how he copes with the oddness of everything around him. Take this small exchange: “The whale started again, ‘I came here when I was a boy, like you, but already as big as a bus. Who wants to swim in skim milk?! So the first thing I did was to try to get back by beaching myself. I didn’t even realize you can’t die here.’ ” At times, dialogue can be excessive... but for the right adventurous reader, this trek off the beaten path will yield wonderful results.",
  "genres": [
    "Fantasy"
  ],
  "author": "Robby Miller",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/18400878-parley-after-life---diy-guide-to-death-and-other-taxes"
}