{
  "title": "The Waking Dark",
  "description": "The Waking Dark is “a horror story worthy of Stephen King” (Booklist) and “a book you won’t soon forget” (Cassandra Clare, author of the Mortal Instruments series)—perfect for readers of Gillian Flynn and Rick Yancey.   They called it the killing day. Twelve people murdered, in the space of a few hours, their killers also all dead by their own hand . . . except one. And that one has no answers to offer the shattered town.   Something is waking in the sleepy town of Oleander, Kansas—something dark and hungry that lives in the flat earth and the open sky, in the vengeful hearts of its upstanding citizens. As the town begins a descent into blood and madness, five survivors of the killing day are the only ones who can stop Oleander from destroying itself.   They have nothing in common. They have nothing left to lose. And they have no way out. Which means they have no choice but to stand and fight, to face the darkness in their town—and in themselves.“Suspense, chills, gasps—all that and a gem-like writing style that will make you shiver with beauty and horror. A book you won’t soon forget.” —Cassandra Clare, author of the bestselling Mortal Instruments series and Infernal Devices trilogy“Twisted, pulse-pounding, shocking, and very, very scary. With The Waking Dark, Robin Wasserman conjures vintage Stephen King as she peers into the dark heart of a nightmare America, where violence and evil lurk behind the golden glow of small-town life, and new terrors arrive by the hour. A superb horror story that is by turns visceral and lyrical, heartrending and heart-stopping.” —Libba Bray, bestselling author of the Gemma Doyle trilogy and the Diviners series   “This book has the combination of mystery and fright that I love. So many twists and shocks, I nearly jumped out of my chair several times! Trust me—this is a true chiller. Not to be missed!” —R. L. Stine   “A thriller dark and beautiful and—yes—achingly romantic at every unexpected twist and turn. Astounding.” —Lauren Myracle, New York Times bestselling author of The Infinite Moment of Us and Bliss   “Wild, nihilistic madness that will get true horror fans raising their pitchforks and torches in frenzied glee. Wasserman writes as if hooked up to IVs of Stephen King and John Carpenter's spiked blood.” —Daniel Kraus, author of Rotters and Scowler\"Great dialogue and intriguing subplots add to the action-packed story . . . the suspense doesn’t let up until the final pages.\" —School Library Journal, Starred ReviewFrom the Hardcover edition.",
  "genres": [
    "Horror",
    "Young Adult",
    "Mystery",
    "Thriller",
    "Fiction",
    "Science Fiction",
    "Suspense"
  ],
  "author": "Robin Wasserman",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/18401162-the-waking-dark"
}