{
  "title": "The Hyperscape Project -Book One",
  "description": "⭐️⭐️⭐️⭐️⭐️ \"An action-packed, fun and intelligent adventure into the unknown.\" - YourBookAuthors.comEnemy activity had fallen into an eerie calm, but everyone felt the coming storm—a terrible storm, poised to unleash its fury upon the galaxy. It seemed as though the entire universe was holding its breath. Waiting. Whether waiting for the salvation of mankind or its demise was yet unclear.He set out to prove a theory. Now he’s racing to save the galaxy from his mistake.Along with his newly found, rag-tag band of alien friends, Nick Bannon battles to keep his devastating technology out of the hands of the biomechanoid race known as the Mok’tu.Nick is flung to a distant world when his hyperspace experiment goes awry. Technology can always be used for good or evil and now his peaceful experiment could become a horrific weapon of a malicious alien race. Every species in the galaxy is in danger of total annihilation and it may take one man’s greatest sacrifice to stop it.Full 86,000 word space opera novel! Official Website: TheHyperspaceProject.comSci-fi, Space Opera, Nanites, Hyperspace, Aliens, First Contact, Action, Adventure, Fun, Series, scifi, robot, mechanoid, prophecy, queen, battle, stargate, red shirts, takei, battle ⭐️⭐️⭐️⭐️⭐️ I found \"The Hyperspace Project\" to be an immensely enjoyable read. I kept picturing Harrison Ford, but with the Indiana Jones personality, but in a Blade Runner world as Nick Bannon. The pacing was great, Swan did an awesome job giving just enough desription of the new technology and alien races without dragging the story into a grinding halt. The story had a feel good sense that I got from watching \"Guardians of the Galaxy\" - where you get to know the characters to the point where you actually want to meet themand have a few drinks at a dive bar to hear more stories.The dialogue and writing were top notch - and it was clear that this story was thought out before Swan committed it to paper. With all of the rehashes (really - can we do a Spiderman reboot just one more time please.....) it is nice to meet some new characters in a new adventure - and it doesn't have to end here, since Swan already has book two on the shelves.Highly recommend this book for lovers of sci fi!!!\" - Nathan Merceron⭐️⭐️⭐️⭐️⭐️ \"5 star sci-fi adventure - this book is FUN. The start of a new series, Book 1 : Awakenings does not disappoint. It has all the elements I desire in a good space adventure story - a reluctant hero fumbling his/her way through new alien space, interesting and unique aliens, exciting twists and turns, a good overall plot and a whole lot of fun. I am right on board the Hyperspace wagon, eagerly awaiting book 2, which means book 1 gets the OMGMOAR 5 star award from Tracing The Stars.\" -TracingTheStars.com ⭐️⭐️⭐️⭐️⭐️ \"A lost Queen. An ancient prophecy. Worlds caught in an interstellar war between two malevolent alien races. Hyperspace, Nanites, Biomechanoids with a mysterious past. The Hyperspace Project is non-stop action and lots of fun.\" -John S.⭐️⭐️⭐️⭐️⭐️ \"I really enjoyed this book. There is a lot of action, but it's well balanced. If you like Star Trek or shows like Stargate, then I think you'll like this book. Fun characters and a story that flows well. Some good futuristic science too. (Nanites, hyperspace, gadgets etc.) I only wish that the second book was already available. There is also an interesting extra chapter that can be unlocked with clues from the book. That added an extra bit of fun to it as well.\" -Sara, BestIndieBooks.com",
  "genres": [
    "Science Fiction",
    "Aliens",
    "Adventure"
  ],
  "author": "Donald Swan",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/18401100-the-hyperscape-project--book-one"
}