{
  "title": "Cuma ya da Pasifik Arafı",
  "description": "\" Fransız edebiyatının en büyük yaratıcılarından olan Michel Tournier’nin başyapıtını sunuyoruz bu kez. Tournier yaşadığımız hayata anlam verebilmek için hikâyelere ihtiyacımız olduğunu düşünen ve kolektiflik kazanmış hikâyeler denebilecek mitosları da ciddiye alan bir yazar. Temel kaygısı Batı kültürünün temel mitoslarını dönüştürerek bambaşka anlamlandırma ve yaşama imkânlarına işaret etmek! Yazdığı bu ilk romanda ise Batı modernliğinin “girişimci birey” kültünü, “vahşileri ve doğayı uygarlaştıran beyaz adam” imgesini, “üretim, tüketim” tapınmasını ve “zaman, düzen, disiplin” kaygısını en özlü biçimde ifade eden Robinson mitini paramparça ederek, heyecan verici bir doğa/düşünce sentezini muştulayan çok farklı bir mitoloji inşa ediyor. Cuma ya da Pasifik Arafı Spinoza’dan Lévi-Strauss’a, Hegel’den Sartre’a bir dizi düşünüre atıflar içeren bir düşünce romanı olmasına karşılık bir macera romanı kadar da sürükleyici. Felsefenin edebiyatla da düşünülebileceğini gösteren müthiş bir örnek. Düştüğü adada Batı kültürünü minyatür boyutlarda yeniden kuran Robinson’un, önce doğanın, sonra da kendine köle yaptığı ‘vahşi’ Cuma’nın “başkalık”larıyla yüzyüze gelmesi anlatılırken, bütün bir tarih Cuma’nın kahkahalarıyla yeniden yazılıyor aslında. Batı akılcılığının ipliği pazara çıkarılırken “başka” türlü düşünmenin ne denli mümkün ve gerekli olduğu gösteriliyor. Bu nefis romanı ve Deleuze’ün yazdığı sonsözü dikkatle, tekrar tekrar okuyalım ve kendimize şu soruları soralım: Hayatımızda hem bireysel hem de toplumsal anlamda “başkaları” var mı gerçekten? Başkalarının olmadığı, olsa bile dikkate alınmadığı, ezildiği, yok sayıldığı bir hayat dayatılmıyor mu bizlere? Başkası yoksa ben var mıyım? Ayrıntı Yayınları olarak Cuma’yı yayınlamaktan özel bir haz duyduğumuzu belirtiyor; edebiyata inanan ve sahici soruların peşinde olan herkese tereddütsüz öneriyoruz... \"",
  "genres": [
    "Fiction",
    "France",
    "Classics",
    "French Literature",
    "Novels",
    "Roman",
    "Philosophy"
  ],
  "author": "Michel Tournier",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/18403422-cuma-ya-da-pasifik-araf"
}