{
  "title": "Cutting Teeth",
  "description": "One of the most anticipated debut novels of 2014, Cutting Teeth takes place one late-summer weekend as a group of thirty-something couples gather at a shabby beach house on Long Island, their young children in tow.They include Nicole, the neurotic hostess terrified by internet rumors that something big and bad is going to happen in New York City that week; stay-at-home dad Rip, grappling with the reality that his careerist wife will likely deny him a second child, forcing him to disrupt the life he loves; Allie, one half of a two-mom family, and an ambitious artist, facing her ambivalence toward family life; Tiffany, comfortable with her amazing body but not so comfortable in the upper-middle class world the other characters were born into; and Leigh, a blue blood secretly facing financial ruin and dependent on Tenzin, the magical Tibetan nanny everyone else covets. These tensions build, burn, and collide over the course of the weekend, culminating in a scene in which the ultimate rule of the group is broken. Cutting Teeth captures the complex dilemmas of early mid-life—the vicissitudes of friendship, of romantic and familial love, and of sex. It confronts class tension, status hunger, and the unease of being in possession of life's greatest bounty while still wondering, is this as good as it gets? And, perhaps most of all, Julia Fierro’s thought-provoking debut explores the all-consuming love we feel for those we need most, and the sacrifice and self-compromise that underpins that love. All this is packed into a page-turning, character-driven novel that crackles with life and unexpected twists and turns that will keep readers glued as they cringe and laugh with compassion, incredulousness, and, most of all, self-recognition. Cutting Teeth is a warm, whip-smart and unpretentious literary novel, perfect for readers of Tom Perrotta and Meg Wolitzer.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Chick Lit",
    "Parenting",
    "Family",
    "Book Club"
  ],
  "author": "Julia Fierro",
  "average_rating": "2.95",
  "url": "https://www.goodreads.com/book/show/18404251-cutting-teeth"
}