{
  "title": "The Victorian City: Everyday Life in Dickens' London",
  "description": "From the New York Times bestselling and critically acclaimed author of The Invention of Murder , an extraordinary, revelatory portrait of everyday life on the streets of Dickens' London.The nineteenth century was a time of unprecedented change, and nowhere was this more apparent than London. In only a few decades, the capital grew from a compact Regency town into a sprawling metropolis of 6.5 million inhabitants, the largest city the world had ever seen. Technology―railways, street-lighting, and sewers―transformed both the city and the experience of city-living, as London expanded in every direction. Now Judith Flanders, one of Britain's foremost social historians, explores the world portrayed so vividly in Dickens' novels, showing life on the streets of London in colorful, fascinating detail.From the moment Charles Dickens, the century's best-loved English novelist and London's greatest observer, arrived in the city in 1822, he obsessively walked its streets, recording its pleasures, curiosities and cruelties. Now, with him, Judith Flanders leads us through the markets, transport systems, sewers, rivers, slums, alleys, cemeteries, gin palaces, chop-houses and entertainment emporia of Dickens' London, to reveal the Victorian capital in all its variety, vibrancy, and squalor. From the colorful cries of street-sellers to the uncomfortable reality of travel by omnibus, to the many uses for the body parts of dead horses and the unimaginably grueling working days of hawker children, no detail is too small, or too strange. No one who reads Judith Flanders's meticulously researched, captivatingly written The Victorian City will ever view London in the same light again.",
  "genres": [
    "History",
    "Nonfiction",
    "Victorian",
    "Research",
    "British Literature",
    "Audiobook",
    "Historical"
  ],
  "author": "Judith Flanders",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/18404216-the-victorian-city"
}