{
  "title": "Dear Mr. Ted",
  "description": "This is the complete Dear Teddy Series. Dear Mr. Ted, contains all four books.Dear Teddy Book One -Little boy little boy,Curled in a ball.I know your secrets,I know them allI write in my journal as much as I can. I talk to Mr. Ted. He is my only friend. He understands when the bad man comes. He holds my hand when I have nightmares and my mummy doesn't hear me cry. Mr. Ted doesn’t tell. He won’t say when my daddy hurts me. He keeps my secrets and my stories. I love Mr. Ted. He is the only one who loves me back.Mr. Ted.I keep falling asleep. Bad things happen. I get sore all the time. But I don’t know why. My mum says it’s a demon. Because I got evil. Please make me be good....Where does an abused child turn when he has no one to talk to? Believing that he is evil and meant to be a victim, he tells his horrific journey to his only friend, Mr. Ted. The boy is five. In his own words through the compelling pages of his journal, he writes in terrific detail of unspeakable abuse forced upon him by his parents. Through manipulation and control, he is moulded into a creation of their own design. Fear follows close behind in the guise of the “bad man.”His voice is no longer silent.Telling Teddy Book Two-Mr. Ted. I love you very much.I love my Mr. Ted. He is all mine and he is magic. He keeps me safe from the bad man. I hug him all tight. We sit on the floor by the fire. I don't be allowed to sit on the chairs. I am too evil.Me and Mr. Ted like to write stories. He tells me what to write. Then I draw the pictures about it and we make it all nice. I put it in my scrap book. My Nan bought me the scrap book. It is big and has lots of pages. It has a car on the front and my name.Stupid Boy Book Three -Stupid Boy, the sequel to the #1 ranked book, Dear Teddy and Telling Teddy.” I am a stupid boy, with stupid hair and stupid clothes. I am always stupid, forever. My badness comes out and makes it all stupid. I don’t tell Mr. Ted though. He is my friend. We go outside and we get to play. We chop up all the bad people with our swords. We play with Andrew too. He is magic, he is invisible. He doesn’t know that I am Stupid Boy. Nobody ever wants Stupid Boy.”Stupid Boy is the third instalment of Dear Teddy, and continues the pain-filled journey of a seven-year old boy through his horrific childhood of abuse. In his own words, he shows you his scars and tells you the lies that he believes; every page an accounting of the deliberate destruction of a child by those he loves and the strangers he is forced to please.His gentle spirit will reach out and amaze you with its strength. Wrap your arms around him as he opens his heart once more and shares his life with you.His story continues…Goodbye Teddy Book Four -This journey has been an odd one; I didn’t even know I was on it. Dear Teddy was born out of a conversation with my therapist at the time, a way for the child to speak after so many years of silence and being locked away in the dark. Once I gave him a pen and told him it was okay for him to talk, he didn’t stop. He had so much to say, and he did.Goodbye Teddy is the fourth and final book in the Dear Teddy series, as with the previous books; it is told through the eyes of the child. He asks you to walk with him as he shows you his world. This is a tale of child abuse in all forms. Every page takes you through the horrific events and the ways he came to survive them. It shows you the betrayal by those very people that should have protected him; his mother and father.Listen as he shares his secrets, his fears, his hopes and dreams. Laugh with him, cry with him, but don’t stop or close your eyes.ExcerptI sit on the cushions. I look at my dad’s bottle of petrol. Maybe I can drink it. It is poison. My dad says it is. He shouts when my brother plays in there. Because there is lots of things and it is poison and can make him die and go to heaven. I look at it lots of times. Maybe I can drink it all",
  "genres": [
    "Abuse",
    "Family"
  ],
  "author": "J.D. Stockholm",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/18403275-dear-mr-ted"
}