{
  "title": "Three Rings",
  "description": "There is Blood In The WaterA dream can become a nightmare in a matter of moments, and Ivyanne Court is living proof of this. She thought choosing between three potential husbands she was indifferent to was the worst thing that could happen to her, but she was so very wrong. Choosing between two she cares deeply for is that much worse. Especially when there’s a chance that one moment of irresponsibility has already predetermined her future. Hands tied, heart bound, still mourning the loss of her best friend, Ivyanne cannot believe that having her unspoken wish granted could cause so much misery among those closest to her. The mers are no longer looking to the queen for guidance, or the princess for her decision- but the moon, for they believe that what it reveals as it wanes will illuminate Ivyanne’s path, whether she agrees, or not, for as tides sculpt the sand, the moon shapes their kingdom.But is it that simple? Is a heart divided, merely a heart in denial?In the distance, hidden in shadow but forever watching, someone thinks it is. Someone is convinced that the princess has created conflict in her heart, and will find resolution only by stepping into his arms instead. But he knows she will not listen to him and a quest begins, a journey from The Great Barrier Reef to the Antarctic Ocean, seeking allies to assist him, creating division within the kingdom for the first time in one thousand years. He believes that the moon’s power is dwarfed by his own, and if the princess can’t find a way to rule the men she thinks that she loves out of her heart, that he is going to take them out of her life any way he can. His whole life, other people have drawn the lines in the sand, but now, he is carving his own, deep enough to draw blood.Three Rings sees a shift in the mer way of thinking, but for a kingdom that was previously the pinnacle of perfection, this will be a jarring lesson to learn and will resonate from the community they have claimed as their own, to the furthest reaches of the Mediterranean, drawing fresh souls to Seaview, fresh jealousies, fresh insecurities, and fresh wounds. For what lies beneath is power previously unimagined, and one man is about to bend it to his will.This is book 2 of a trilogy.",
  "genres": [
    "Fantasy",
    "Mermaids",
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Adult"
  ],
  "author": "S.K. Munt",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/18402451-three-rings"
}