{
  "title": "الأتراك في مصر وتراثهم الثقافي",
  "description": "* نبذة دار الشروق :الأتراك في مصر وتراثهم الثقافي ثمرة جهود ودراسة تجاوزت الأربعين عامًا، يبحث فيه المؤلفُ كيف تَشَكّل الوجه أو النموذج «المصري العثماني» نتيجة لتطور القاهرة الذي كان يحاكي إستانبول في البداية، ويستعرض المؤلفُ في هذا الكتاب الكيفية التي وصل بها إلينا نتاج تلك الثقافة وتأثيراتها المختلفة. ففي ظل المدارس الحديثة التي أقيمت والكتب التركية العديدة التي طبعتها المطبعة حظيت الثقافة التركية العثمانية في مصر بإعجاب الصفوة الناشئة من أهالي البلاد المتحدثين بالعربية، فضلًا عن القادمين من خارج مصر ممن كانوا يتحدثون التركية. وهذا هو ما أدى إلى ظهور الوجه الثقافي «المصري العثماني» إلى جانب الوجه الثقافي «التركي العثماني» في مصر. فالكتاب كما نرى أول عملٍ يتناول الأتراك الذين عاشوا في مصر والوجود الثقافي التركي المتطور هناك، ويتناول النتاج المدون الذي وَصَلَنا من تلك الثقافة وآثارها.أكمل الدين إحسان أوغلي قاهري المولد والنشأة وأحد الوجوه البارزة في بحوث التاريخ والثقافة والعلوم؛ فقد عمل عضوًا للتدريس وباحثًا في عدد من الجامعات في تركيا ومصر وأوربا وأمريكا، وتم تعيينه في سنة 1980م ليكون أول مدير عام لمركز الأبحاث للتاريخ والفنون والثقافة الإسلامية (إرسيكا) التابع لمنظمة المؤتمر الإسلامي. وكان أثناء عمله في هذا المركز وتأسيسه له يواصل أعماله الأكاديمية؛ فقد أسس في سنة 1984م قسم تاريخ العلوم في كلية الآداب بجامعة إستانبول، وأنشأ في سنة 1989م جمعية تاريخ العلوم التركية. وهو عضو في العديد من المؤسسات الأكاديمية الدولية ومنها «الأكاديمية الأوربية» (Academia Europaea)، وعضو مراسل بمجمع اللغة العربية في القاهرة، وكان رئيسًا للاتحاد العالمي لتاريخ العلوم وفلسفتها (IUHPS).ويعتبر البروفسور أكمل الدين إحسان أوغلي أول أمين عام منتخب يأتي على رأس منظمة المؤتمر الإسلامي في سنة 2005م. وهناك العديد من الأعمال التي تحمل اسمه بين كتب ومقالات وبحوث، وبعض هذه الأعمال كُتب بثلاث لغات، كما أشرفَ على العديد من البحوث والدراسات، وجرتْ ترجمة بعض أعماله إلى لغاتٍ شرقية وغربية.وقد حصل هذا الكتاب في طبعته العربية الأولى على جائزة خادم الحرمين الشريفين الملك عبد الله بن عبد العزيز للترجمة لعام 2008م",
  "genres": [
    "History"
  ],
  "author": "Ekmeleddin İhsanoğlu",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/10962538"
}