{
  "title": "Not for Everyday Use: A Memoir",
  "description": "\"Nunez ponders the cultural, racial, familial, social, and personal experiences that led to what she ultimately understands was a deeply loving union between her parents. A beautifully written exploration of the complexities of marriage and family life.\"--\nBooklist\n (starred review)\"Through her thoughtful and articulate writing, Nunez offers a valuable perspective on the racism that she experienced, even in America, and the damage the Catholic Church does to women who follow the 'no artificial birth control' rule. Recommended for memoir enthusiasts and readers interested in Caribbean literature.\"--\nLibrary Journal\n\"A celebration of understanding and empathy.\"--Chicago Center for Literature and Photography“Not for Everyday Use is a gorgeous tapestry of mourning and redemption. Nunez is an astonishing writer, approaching the page with both skill and heart. Her memories are well-deep and love-strong. With insights that are both sharp and tender, this is a memoir that will change the way you understand your family, and the world.”--Tayari Jones, author of Silver Sparrow\"Elizabeth Nunez has written a book about love: love of family, love of place, love of literature, and even the love of human flaws. Not for Everyday Use manages to be a memoir rich with tenderness that doesn't shy away from pain and loss. Reading this book was like sitting with a dear friend for a long conversation and only later realizing I'd been in the presence of a true artist. It's not easy to sound casual but attain the profound yet somehow Nunez pulls it off, page after page.\"--Victor LaValle, author of The Devil in Silver“Elizabeth Nunez, in a clear, unsentimental, hard-hitting, and direct voice, skillfully structures the story of a mixed-race Portuguese and Trinidadian Roman Catholic family around the preparations for her mother’s funeral...At the heart of this story is the relationship between a mother and a daughter, a daughter who leaves home as a young girl to continue her education and make her life in the United States of America. Some of the most poignant moments are those in which the author describes her feelings of belonging and not belonging to ‘home.’ This is a story that will speak both to Caribbean people ‘at home’ and those who have left to make their home elsewhere.”--Lawrence Scott, author of Light Falling on BambooTracing the four days from the moment she gets the call that every immigrant fears to the burial of her mother, Elizabeth Nunez tells the haunting story of her lifelong struggle to cope with the consequences of the \"sterner stuff\" of her parents' ambitions for their children and her mother's seemingly unbreakable conviction that displays of affection are not for everyday use.But Nunez sympathizes with her parents, whose happiness is constrained by the oppressive strictures of colonialism, by the Catholic Church’s prohibition of artificial birth control which her mother obeys, terrified by the threat of eternal damnation (her mother gets pregnant fourteen times: nine live births and five miscarriages which almost kill her), and by what Malcolm Gladwell refers to as the “privilege of skin color” in his mother’s Caribbean island homeland where “the brown-skinned classes...came to fetishize their lightness.” Still, a fierce love holds this family together, and the passionate, though complex, love Nunez’s parents have for each other will remind readers of the passion between the aging lovers in Gabriel García Márquez’s Love in the Time of Cholera. Written in exquisite prose by a writer the New York Times Book Review calls “a master at pacing and plotting,” Not for Everyday Use is a page-turner that readers will find impossible to put down.",
  "genres": [
    "Memoir",
    "Nonfiction"
  ],
  "author": "Elizabeth Nunez",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/18406097-not-for-everyday-use"
}