{
  "title": "Valerie Solanas: The Defiant Life of the Woman Who Wrote SCUM",
  "description": "Too drastic, too crazy, too \"out there,\" too early, too late, too damaged, too much—Valerie Solanas has been dismissed but never forgotten. She has become, unwittingly, a figurehead for women's unexpressed rage, and stands at the center of many worlds. She inhabited Andy Warhol's Factory scene, circulated among feminists and the countercultural underground, charged men money for conversation, despised \"daddy's girls,\" and outlined a vision for radical gender dystopia.Known for shooting Andy Warhol in 1968 and for writing the polemical diatribe SCUM [Society for Cutting Up Men] Manifesto, Solanas is one of the most famous women of her era. SCUM Manifesto--which predicted ATMs, test-tube babies, the Internet, and artificial insemination long before they existed--has sold more copies, and has been translated into more languages, than nearly all other feminist texts of its time.Shockingly little work has interrogated Solanas's life. This book is the first biography about Solanas, including original interviews with family, friends (and enemies), and numerous living Warhol associates. It reveals surprising details about her life: the children nearly no one knew she had, her drive for control over her own writing and copyright, and her elusive personal and professional relationships.Valerie Solanas addresses how this era changed the world and depicts an iconic figure whose life is at once tragic and remarkable.“Solanas lived a life generally relegated by society to the margins: poor, female, queer, crazy. … Fahs resists the impulse of speculation, the desire to turn Solanas into a comedic or tragic tableau. … Fahs situates Solanas in a larger culture and society that helps us to understand the complexities of her character and actions. … Valerie Solanas is a biography of a compelling, charismatic, contemptible, and incorrigible woman. It is a biography of the effects of class in the United States on one woman’s life. It is also the biography of an artist.” –Julie Enszer, Lambda Literary Review Breanne Fahs is an associate professor of women and gender studies at Arizona State University, a practicing clinical psychologist, and the author of Performing Sex and The Moral Panics of Sexuality.",
  "genres": [
    "Biography",
    "Feminism",
    "Nonfiction",
    "History",
    "Biography Memoir",
    "Art",
    "Politics"
  ],
  "author": "Breanne Fahs",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/18406247-valerie-solanas"
}