{
  "title": "Tomlinson Hill: The Remarkable Story of Two Families Who Share the Tomlinson Name - One White, One Black",
  "description": "Tomlinson Hill is the stunning story of two families—one white, one black—who trace their roots to a slave plantation that bears their name. Internationally recognized for his work as a fearless war correspondent, award-winning journalist Chris Tomlinson grew up hearing stories about his family’s abandoned cotton plantation in Falls County, Texas. Most of the tales lionized his white ancestors for pioneering along the Brazos River. His grandfather often said the family’s slaves loved them so much that they also took Tomlinson as their last name. LaDainian Tomlinson, football great and former running back for the San Diego Chargers, spent part of his childhood playing on the same land that his black ancestors had worked as slaves. As a child, LaDainian believed the Hill was named after his family. Not until he was old enough to read an historical plaque did he realize that the Hill was named for his ancestor’s slaveholders.A masterpiece of authentic American history, Tomlinson Hill traces the true and very revealing story of these two families. From the beginning in 1854— when the first Tomlinson, a white woman, arrived—to 2007, when the last Tomlinson, LaDainian’s father, left,  the book unflinchingly explores the history of race and bigotry in Texas. Along the way it also manages to disclose a great many untruths that are latent in the unsettling and complex story of America.Tomlinson Hill is also the basis for a film and an interactive web project. The award-winning film, which airs on PBS, concentrates on present-day Marlin, Texas and how the community struggles with poverty and the legacy of race today,  and is accompanied by an interactive web site called Voice of Marlin, which stores the oral histories collected along the way. Chris Tomlinson has used the reporting skills he honed as a highly respected reporter covering ethnic violence in Africa and the Middle East to fashion a perfect microcosm of America’s own ethnic strife. The economic inequality, political shenanigans, cruelty and racism—both subtle and overt—that informs the history of Tomlinson Hill also live on in many ways to this very day in our country as a whole. The author has used his impressive credentials and honest humanity to create a classic work of American history that will take its place alongside the timeless work of our finest historians",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Memoir",
    "Biography",
    "Civil War",
    "African American"
  ],
  "author": "Chris  Tomlinson",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/18404319-tomlinson-hill"
}