{
  "title": "Burning Down the House: The End of Juvenile Prison",
  "description": "The nationally acclaimed “engrossing, disturbing, at times heartbreaking” (Van Jones) book that shines a harsh light on the abusive world of juvenile prisons, by the award-winning journalist“Nell Bernstein’s book could be for juvenile justice what Rachel Carson’s book was for the environmental movement.” —Andrew Cohen, correspondent, ABC NewsWhen teenagers scuffle during a basketball game, they are typically benched. But when Brian got into it on the court, he and his rival were sprayed in the face at close range with a chemical similar to Mace, denied a shower for twenty-four hours, and then locked in solitary confinement for a month. One in three American children will be arrested by the time they are twenty-three, and many will spend time locked inside horrific detention centers that defy everything we know about what motivates young people to change. In what the San Francisco Chronicle calls “an epic work of investigative journalism that lays bare our nation’s brutal and counterproductive juvenile prisons and is a clarion call to bring our children home,” Nell Bernstein eloquently argues that there is no right way to lock up a child. The very act of isolation denies children the thing that is most essential to their growth and positive relationships with caring adults. Bernstein introduces us to youth across the nation who have suffered violence and psychological torture at the hands of the state. She presents these youths all as fully realized people, not victims. As they describe in their own voices their fight to maintain their humanity and protect their individuality in environments that would deny both, these young people offer a hopeful alternative to the doomed effort to reform a system that should only be dismantled. Interwoven with these heartrending stories is reporting on innovative programs that provide effective alternatives to putting children behind bars. A landmark book, Burning Down the House sparked a national conversation about our inhumane and ineffectual juvenile prisons, and ultimately makes the radical argument that the only path to justice is for state-run detention centers to be abolished completely.",
  "genres": [
    "Nonfiction",
    "Social Justice",
    "Politics",
    "Sociology",
    "History",
    "Education",
    "Crime"
  ],
  "author": "Nell Bernstein",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/18406423-burning-down-the-house"
}