{
  "title": "Above the East China Sea",
  "description": "A Seattle Times Best Book of the YearIn her most ambitious, moving, and provocative novel to date, Sarah Bird makes a stunning departure. Above the East China Sea tells the entwined stories of two teenaged girls, an American and an Okinawan, whose lives are connected across seventy years by the shared experience of profound loss, the enduring strength of an ancient culture, and the redeeming power of family love.Luz James, a contemporary U.S. Air Force brat, lives with her strictly-by-the-rules sergeant mother at Kadena Air Base in Okianawa. Luz’s older sister, her best friend and emotional center, has just been killed in the Afghan war. Unmoored by her sister’s death and a lifetime of constant moving from base to base, Luz turns for the comfort her service-hardened mother cannot offer to the “Smokinawans,” the “waste cases,” who gather to get high every night in a deserted cove. When even pills, one-hitters, Cuervo Gold, and a growing crush on Jake Furusato aren’t enough to soften the unbearable edge, the desolate girl contemplates taking her own life.In 1945, Tamiko Kokuba, along with two hundred of her classmates, is plucked out of her elite girls’ high school and trained to work in the Imperial Army’s horrific cave hospitals. With defeat certain, Tamiko finds herself squeezed between the occupying Japanese and the invading Americans. She believes she has lost her entire family, as well as the island paradise she so loved, and, like Luz, she aches with a desire to be reunited with her beloved sister.On an island where the spirits of the dead are part of life and your entire clan waits for you in the afterworld, suicide offers Tamiko the promise of peace. As Luz tracks down the story of her own Okinawan grandmother, she discovers that, if she surrenders to the most un brat impulse and allows herself to connect completely with a place and its people, the ancestral spirits will save not only Tamiko but her as well.Propelled by a riveting narrative and set at the very epicenter of the headline-grabbing clash now emerging between the great powers, Above the East China Sea is at once a remarkable chronicle of how war shapes the lives of conquerors as well as the conquered and a deeply moving account of family, friendship, and love that transcends time.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Japan",
    "Historical",
    "Asia",
    "Book Club",
    "War"
  ],
  "author": "Sarah Bird",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/18404382-above-the-east-china-sea"
}