{
  "title": "The Moon Before Morning",
  "description": "“Merwin’s masterfully refined, meditative poems stem from his dwelling mindfully in one beloved place and handling words as though they are seeds, flowers, stones, and water… Merwin has attained a transcendent and transformative elevation of beaming perception, exquisite balance, and clarifying beauty.”— Booklist, starred review of The Moon before Morning \"In his personal anonymity, his strict individuated manner, his defense of the earth, and his heartache at time's passing, Merwin has become instantly recognizable on the page.\"—Helen Vendler, The New York Review of Books \"W.S. Merwin's legacy is unquestionably his best and most fierce poems are moody, visionary compositions that dive into the unconscious and the seeds of existence with an inwardness and scrutiny unique in American poetry.\"— Poetry \"Merwin [is] fresh and awake with a simplicity that can only be called wisdom.\"— Publishers Weekly , starred review An elaboration and response to his Pulitzer Prize-winning The Shadow of Sirius , W.S. Merwin examines everything from minute flowers to oceanic destruction, and weaves our complex relationship with the natural world with his own youth, memory, and intense engagement with the passing of days. With considered reverence, subtle might, and generous poetic imagination, Merwin presents a masterful and gorgeous collection. From \"Wild Oats\": All the beads have gonefrom the old stringand the string does not miss them I needed my mistakesin their own orderto get me here In my youth I believed in somewhere elseI put faith in travelnow I am becoming my own tree W.S. Merwin is one of the country's best-selling poets. He served as Poet Laureate of the United States, and his three most recent poetry collections each received a major award, including the Pulitzer Prize, the National Book Award, and the Bobbitt Award from the Library of Congress. He lives in Hawaii.",
  "genres": [
    "Poetry",
    "Nature",
    "Adult",
    "Nonfiction"
  ],
  "author": "W.S. Merwin",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/18406120-the-moon-before-morning"
}