{
  "title": "The Boy in the Band",
  "description": "This book is intended for a mature audience 18+ It contains strong language, sex and references to drug use.Let me introduce us...Sylvie Smith – that’s me. Head A&R girl at Artemis Records. Girl about town, with a thing for boys in bands. I have the perfect job – if you like to fuck up-and-coming rock stars, which I do, probably more often than I should. I have a crazy beautiful life and it’s more than a little complicated right now.Blake Nelson – my current nemesis. Frontman for The Flood, the band I’m in the process of getting signed. The guy I’m obsessively thinking about NOT fucking, pretty much all the time. Why? Well he may be to die for, but he hates me and I hate him right back. He thinks I destroyed his best friend. The ghosts of our pasts are such vicious things. They don’t stop me from wanting him though. Wanting boys like him is in my blood.Chris Kavanagh – my long term fuck-buddy. Lead singer of Vertigo, the band who just cleaned up at The Brits. Chris Kavanagh, playboy of the rock world, who just got voted sixth sexiest man on the planet. Chris Kavanagh who told me that love was for suckers. Well hell, it seems he only went and got suckered himself. By who? I’ll give you one guess.This is the thing. Love just isn’t for me. I’m fine with my fucking. I’m never going to fall in love. EVER. I’m not going to let Chris Kavanagh wear me down, nor give Blake Nelson the satisfaction of seeing that I want him. I don’t have to explain myself, or change myself for anyone.Blake Nelson is just THE BOY IN THE BAND. My day job. I’m not going to let him turn my world upside down with those lethal eyes, the ‘fuck me’ voice or his devastating smile.You know what they say about best laid plans. So aren’t you just a little bit intrigued, like me, to see how all this plays out?",
  "genres": [
    "New Adult",
    "Music",
    "Romance",
    "Contemporary Romance",
    "Musicians",
    "Contemporary"
  ],
  "author": "N.J. Frost",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/18427412-the-boy-in-the-band"
}