{
  "title": "The Best Horror of the Year: Volume Six",
  "description": "“The oldest and strongest emotion of mankind is fear, and the oldest and strongest kind of fear is fear of the unknown.”—H. P. LovecraftThis statement was true when H. P. Lovecraft first wrote it at the beginning of the twentieth century, and it remains true at the beginning of the twenty-first century. The only thing that has changed is what is unknown.With each passing year, science, technology, and the march of time shine light into the craggy corners of the universe, making the fears of an earlier generation seem quaint. But this “light” creates its own shadows. The Best Horror of the Year, edited by Ellen Datlow, chronicles these shifting shadows. It is a catalog of terror, fear, and unpleasantness, as articulated by today’s most challenging and exciting writers.The best horror writers of today do the same thing that horror writers of a hundred years ago did. They tell good stories—stories that scare us. And when these writers tell really good stories that really scare us, Ellen Datlow notices. She’s been noticing for more than a quarter century. For twenty-one years, she coedited The Year’s Best Fantasy and Horror, and for the last six years, she’s edited this series. In addition to this monumental cataloging of the best, she has edited hundreds of other horror anthologies and won numerous awards, including the Hugo, Bram Stoker, and World Fantasy awards.More than any other editor or critic, Ellen Datlow has charted the shadowy abyss of horror fiction. Join her on this journey into the dark parts of the human heart . . . either for the first time . . . or once again.Skyhorse Publishing, under our Night Shade and Talos imprints, is proud to publish a broad range of titles for readers interested in science fiction (space opera, time travel, hard SF, alien invasion, near-future dystopia), fantasy (grimdark, sword and sorcery, contemporary urban fantasy, steampunk, alternative history), and horror (zombies, vampires, and the occult and supernatural), and much more. While not every title we publish becomes a New York Times bestseller, a national bestseller, or a Hugo or Nebula award-winner, we are committed to publishing quality books from a diverse group of authors.",
  "genres": [
    "Horror",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Fantasy",
    "Short Story Collection",
    "Collections"
  ],
  "author": "Ellen Datlow",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/18406579-the-best-horror-of-the-year"
}