{
  "title": "Learning from the Left: Children's Literature, the Cold War, and Radical Politics in the United States",
  "description": "At the height of the Cold War, dozens of radical and progressive writers, illustrators, editors, librarians, booksellers, and teachers cooperated to create and disseminate children's books that challenged the status quo. Learning from the Left provides the first historic overview of their work. Spanning from the 1920s, when both children's book publishing and American Communism were becoming significant on the American scene, to the late 1960s, when youth who had been raised on many of the books in this study unequivocally rejected the values of the Cold War, Learning from the Left shows how \"radical\" values and ideas that have now become mainstream (including cooperation, interracial friendship, critical thinking, the dignity of labor, feminism, and the history of marginalized people), were communicated to children in repressive times. A range of popular and critically acclaimed children's books, many by former teachers and others who had been blacklisted because of their political beliefs, made commonplace the ideas that McCarthyism tended to call \"subversive.\" These books, about history, science, and contemporary social conditions-as well as imaginative works, science fiction, and popular girls' mystery series-were readily available to children: most could be found in public and school libraries, and some could even be purchased in classrooms through book clubs that catered to educational audiences. Drawing upon extensive interviews, archival research, and hundreds of children's books published from the 1920s through the 1970s, Learning from the Left offers a history of the children's book in light of the history of the history of the Left, and a new perspective on the links between the Old Left of the 1930s and the New Left of the 1960s.Winner of the Grace Abbott Book Prize of the Society for the History of Children and Youth",
  "genres": [
    "History",
    "Literary Criticism",
    "Nonfiction",
    "Childrens",
    "Politics",
    "Academic"
  ],
  "author": "Julia L. Mickenberg",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/184171.Learning_from_the_Left"
}