{
  "title": "Der Turm",
  "description": "Spannung und Melancholie – das sind die Hauptzutaten des düsteren Gerichtes, das Stephen King seinen treuen Lesern im Laufe von dreißig Jahren in sieben Gängen serviert hat. Jetzt endlich liegt der abschließende Band der Saga um den Dunklen Turm vor, in dem Roland ans Ziel seiner langen Reise gelangt und alle offenen Fragen beantwortet werden. Wirklich alle?  Die Ankunft des Widersachers Mordred im ersten Teil des Buches wirft ihren Schatten über die ganzen 1.000 Seiten. Dass sich King dabei ebenso metaphorisch wie im Wortsinn einer Geburtsszene bedient, gehört zu den Höhepunkten der ganzen Serie. Der zweite Teil ist von zahlreichen Einzelheiten und Abschweifungen geprägt, die die Geduld mancher Leser auf eine harte Probe stellen mögen. Die im Rückblick erzählte Lebensgeschichte eines Telepathen ist allerdings eindeutig ein Highlight des Romans.  Endgültig in das Land der metafiction begibt sich der dritte Teil: Hier greift der Autor selbst -- nicht zum ersten Mal im Dunklen Turm -- in die Romanhandlung ein, und zwar nicht etwa nur in Form von erläuternden Einschüben, sondern durchaus in Person; die literarische Postmoderne hat auch Stephen King eingeholt. Teil Vier beginnt mit einer Verfolgungsjagd, die einem H. P. Lovecraft zur Ehre gereicht hätte, und schließt mit einem – vermutlich absichtlich – unharmonischen Ende.  Stephen King hat selbst geäußert, dass die Saga um den Dunklen Turm seine Fähigkeiten als Schriftsteller gelegentlich zu übersteigen drohte. Besonders auf die letzten drei Bände trifft das zu, sie laufen ihm nicht selten etwas aus dem Ruder. Trotzdem bleibt ein positiver Gesamteindruck zurück, denn Kings stets präsente Ironie und seine gekonnte Selbstbezüglichkeit heben dieses Großwerk weit über das Niveau gewöhnlicher Abenteuergeschichten hinaus. Was sich von der Qualität der Übersetzung leider nicht behaupten lässt ... --Felix Darwin",
  "genres": [
    "Fantasy",
    "Fiction",
    "Horror",
    "Science Fiction",
    "Audiobook",
    "Westerns",
    "Adventure"
  ],
  "author": "Stephen        King",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/1842131.Der_Turm"
}