{
  "title": "The After",
  "description": "New Year’s came and went, and with it went America. Now all that remains is... THE AFTER.When a grassroots “Stoppage” movement succeeds in banning money, the civilized world quickly crumbles as looters and rioters claim for themselves the products that can no longer be bought. Within days gas stations run out of fuel, truck drivers abandon their freight on the side of the road, and trains stop running. Even airplanes begin to crash on the landing strips of airports as cascading power outages sweep over the nation leaving air traffic control towers to go dark. Last of all, the phones go dead and the local TV and radio stations stop broadcasting as their backup power runs out.Those who manage to endure the first few days only succeed in postponing their suffering. Without a supply chain of new goods coming into the cities the remaining supplies dwindle rapidly. Governors call upon the National Guard to keep the peace, but amidst the chaos of hundreds of thousands of people clamoring for food and supplies the military units disband almost as quickly as they arrive. Now, with no rule of law, all that anyone has is what they can secure for themselves and are able to defend. THE AFTER are the journal entries of a teenage boy who manages to escape the city with his family to find shelter in a cabin in northern Wisconsin. His journals are discovered in the late spring of “Year None” during a routine census conducted by the Inventory Takers from the recently reestablished, nearby town of Lake Lowery. Inside they find that his testament is more than just a simple retelling of one family’s struggle to survive in a hostile new world. For written in his diary is also a secret. One so powerful that it could undermine all that Lake Lowery has endeavored to do in its attempt to restore a sense of order in their community. It is a secret that, if revealed, could destroy the last known refuge of hope left in THE AFTER. THE AFTER is Leot Felton’s premier Social Science Fiction novel. Written as a first person diary narrative from the prospective of a teenage boy, the expectation is that it will prove to be an easy read for those who long for strong character development in their Young Adult literature. With each entry, our protagonist begins a short new chapter that intimately journals a character driven account of a common struggle set in an uncommon world.",
  "genres": [],
  "author": "Leot Felton",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/18407044-the-after"
}