{
  "title": "White Christmas: The Story of an American Song",
  "description": "When Irving Berlin first conceived the song \"White Christmas,\" he envisioned it as a \"throwaway\" -- a satirical novelty number for a vaudeville-style stage revue. By the time Bing Crosby introduced the tune in the winter of 1942, it had evolved into something far grander: the stately yuletide ballad that would become the world's all-time top-selling and most widely recorded song.  In this vividly written narrative, Jody Rosen provides both the fascinating story behind the making of America's favorite Christmas carol and a cultural history of the nation that embraced it. Berlin, the Russian-Jewish immigrant who became his adopted country's greatest pop troubadour, had written his magnum opus -- what one commentator has called a \"holiday Moby-Dick\" -- a timeless song that resonates with some of the deepest themes in American culture: yearning for a mythic New England past, belief in the magic of the \"merry and bright\" Christmas season, longing for the havens of home and hearth. Today, the song endures not just as an icon of the national Christmas celebration but as the artistic and commercial peak of the golden age of popular song, a symbol of the values and strivings of the World War II generation, and of the saga of Jewish-American assimilation. With insight and wit, Rosen probes the song's musical roots, uncovering its surprising connections to the tradition of blackface minstrelsy and exploring its unique place in popular culture through six decades of recordings by everyone from Bing Crosby to Elvis Presley to *NSYNC. White Christmas chronicles the song's legacy from jaunty ragtime-era Tin Pan Alley to the elegant world of midcentury Broadway and Hollywood, from the hardscrabble streets where Irving Berlin was reared to the battlefields of World War II where American GIs made \"White Christmas\" their wartime anthem, and from the Victorian American past that the song evokes to the twenty-first-century present where Berlin's masterpiece lives on as a kind of secular hymn.",
  "genres": [
    "Nonfiction",
    "Music",
    "Christmas",
    "History",
    "Holiday"
  ],
  "author": "Jody Rosen",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/1842619.White_Christmas"
}