{
  "title": "Backlund: From All-American Boy to Professional Wrestling's World Champion",
  "description": "Bob Backlund began life as a poor farm boy in the little village of Princeton, Minnesota, with a population of just over 2,000 people. He was a below-average student with a lackluster work ethic and a bad attitude, who hung with the wrong crowd and made a lot of bad choices. He was a kid whose life was headed for disaster—until a local coach took interest in him, suggested that he take up amateur wrestling, and offered to work with him if he promised to stay out of trouble.It was in North Dakota that Bob Backlund had the first of several chance encounters that would shape his destiny. While working out at the YMCA gymnasium in Fargo, North Dakota, where he wrestled for North Dakota State, Backlund met a well-known professional wrestler, “Superstar” Billy Graham. The men talked, and at Graham’s suggestion, Backlund was inspired to pursue a career in professional wrestling.Less than five years from that day, on February 20, 1978, Backlund would find himself halfway across the country, standing in the middle of the ring at Madison Square Garden with his hand raised in victory as the newly crowned World Wide Wrestling Federation Heavyweight Champion. The man Backlund pinned for the championship that night was none other than Superstar Billy Graham.Featuring contributions from Bruno Sammartino, Harley Race, Terry Funk, Pat Patterson, Ken Patera, Sergeant Slaughter, The Magnificent Muraco, George “The Animal” Steele, “Mr. USA” Tony Atlas, The Iron Sheik, and many others, this book tells the incredible story of the life and nearly forty-year career of one of the most famous men to ever grace the squared circle.Skyhorse Publishing, as well as our Sports Publishing imprint, is proud to publish a broad range of books for readers interested in sports—books about baseball, pro football, college football, pro and college basketball, hockey, or soccer, we have a book about your sport or your team.In addition to books on popular team sports, we also publish books for a wide variety of athletes and sports enthusiasts, including books on running, cycling, horseback riding, swimming, tennis, martial arts, golf, camping, hiking, aviation, boating, and so much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to publishing books on subjects that are sometimes overlooked by other publishers and to authors whose work might not otherwise find a home.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Sports",
    "Memoir"
  ],
  "author": "Bob Backlund",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/18406528-backlund"
}