{
  "title": "The Diaries of Robins toys",
  "description": "The Diaries of Robins toys is a five star award winning books, box set nominated by Snazal Awards for Best Children books for 2013. Diaries of Robin’s toys tell the stories of second hand toys which Grand dad buys for his Grandson Robin. Grand dad has a magical power to make the toys tell their own stories and they soon discover that the older the toy, the more interesting its story is. Titles in Robins toys box set includes: Roger The Reindeer, Geraldo The Giraffe, Leon The Lion, Gavin The Gorilla and Snuffles, Taffy The Rabbit, Clarence The Camel, Donkey Hoo-Tee, Carlos The Cod, Carla The Cow, Bertie The Bee. This book is similar to wimpy kids and toy story books.About the Toys:Roger the Reindeer:When Roger started to tell Robin and Grandad his story he admitted that he had problems with reading. So he never bothered to read labels. That was alright until he left home and then the trouble started. After his problems with giant rhubarb he became determined to learn to read properly and that landed him the best Reindeer job of all. Geraldo the Giraffe:Geraldo was another great buy for Robin he had a very interesting story to tell and a great explanation about giraffes and sore throats. He was also getting bored with his simple diet of leaves so he tried an experiment with people food. That brought its own problems but what happened helped Robin’s friend Caroline with her own difficulties.Leon the Lion:When Robin bought Leon the Lion from the car-boot sale, he expected him to be fierce and scary but that could not have been further from the truth. Just how did the King of the Jungle turn into the King of the Jingle? Well you will have to read the book to find out!Gavin the Gorilla and Snuffles:Robin did not know much about Gorillas until he bought Gavin. He thought that they were all about chest thumping and making loud noises. He thought they were fierce and scary and that little dogs like Snuffles were cute and cuddly. He soon found out that this was not always so. When Gavin the Gorilla was being picked on, who do you think came to the rescue?Taffy the Rabbit:Taffy was a Welsh rabbit and can you guess what his favourite sport was? Yes thats right, it was Rugby. It was his ambition in life to watch Wales play England but how could he ever save up enough to buy the ticket? What Robin learned from Taffy really helped his scout group, but how?Clarence the Camel:Camels were unusual on the car-boot sale and fortunately Robin could afford to buy Clarence, but Clarence was not the perfect Camel. In fact at first he thought that he was very fast and a bit too clever. It took a hard lesson in life to learn what grown-ups call humility but learning that lesson brought him a great reward.Donkey Hoo-Tee:Before Robin first chose Donkey Hoo-Tee he could not imagine what life was like for a donkey on the Plains of Spain. Well he soon found out that it was very hard work. That was until the day he won something which would change his life forever, but it took a very special man to help him to do it. How strange that they both had the same name.Carlos the Cod:Although most fish live in big shoals do they all have to do the same things? And is that such a good idea? Have you ever wondered what fish do in a big aquarium? Well Carlos the cod told Robin that they watch people. And what a funny lot those people are and what strange habits they have got.Carla the Cow:When Robin bought Carla the Cow from Petes Treats stall at the car-boot sale, he was warned that she was moody and selfish but he bought her anyway. He soon found out that the other cows did not like her but when she realised this she made a real effort to fit in with the herd but how did she do it?Bertie the Bee:Robin went to the car-boot sale to buy something which could fly, something like an aeroplane or a helicopter. He did not imagine that he would go home with something which could fly and make honey as well! He soon learned so much about bees that he was really glad that he had bought Bertie.",
  "genres": [],
  "author": "Ken Lake",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/18410471-the-diaries-of-robins-toys"
}