{
  "title": "Unholy Ghost: Writers on Depression",
  "description": "Unholy Ghost is a unique collection of essays about depression that, in the spirit of William Styron's Darkness Visible, finds vivid expression for an elusive illness suffered by more than one in five Americans today. Unlike any other memoir of depression, however, Unholy Ghost includes many voices and depicts the most complete portrait of the illness. Lauren Slater eloquently describes her own perilous experience as a pregnant woman on antidepressant medication. Susanna Kaysen, writing for the first time about depression since Girl, Interrupted, criticizes herself and others for making too much of the illness. Larry McMurtry recounts the despair that descended after his quadruple bypass surgery. Meri Danquah describes the challenges of racism and depression. Ann Beattie sees melancholy as a consequence of her writing life. And Donald Hall lovingly remembers the \"moody seesaw\" of his relationship with his wife, Jane Kenyon.The collection also includes an illuminating series of companion pieces. Russell Banks's and Chase Twichell's essays represent husbandand-wife perspectives on depression; Rose Styron's contribution about her husband's struggle with melancholy is paired with an excerpt from William Styron's Darkness Visible; and the book's editor, Nell Casey, juxtaposes her own essay about seeing her sister through her depression with Maud Casey's account of this experience. These companion pieces portray the complicated bond -- a constant grasp for mutual understandingforged by depressives and their family members.With an introduction by Kay Redfield Jamison, Unholy Ghost allows the bewildering experience of depression to be adequately and beautifully rendered. The twenty-two stories that make up this book will offer solace and enlightenment to all readers.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Mental Health",
    "Essays",
    "Memoir",
    "Mental Illness",
    "Writing"
  ],
  "author": "Nell Casey",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/184120.Unholy_Ghost"
}