{
  "title": "The Witch-Hunt Narrative: Politics, Psychology, and the Sexual Abuse of Children",
  "description": "In the 1980s, a series of child sex abuse cases rocked the United States. The most famous case was the 1984 McMartin preschool case, but there were a number of others as well. By the latter part of the decade, the assumption was widespread that child sex abuse had become a serious problem in America. Yet within a few years, the concern about it died down considerably. The failure to convict anyone in the McMartin case and a widely publicized appellate decision in New Jersey that freed an accused molester had turned the dominant narrative on its head. In the early 1990s, a new narrative with remarkable staying power the child sex abuse cases were symptomatic of a 'moral panic' that had produced a witch hunt. A central claim in this new witch hunt narrative was that the children who testified were not reliable and easily swayed by prosecutorial suggestion. In time, the notion that child sex abuse was a product of sensationalized over-reporting and far less endemic thanoriginally thought became the new common sense.But did the new witch hunt narrative accurately represent reality? As Ross Cheit demonstrates in his exhaustive account of child sex abuse cases in the past two and a half decades, purveyors of the witch hunt narrative never did the hard work of examining court records in the many cases that reached the courts throughout the nation. Instead, they treated a couple of cases as representative and concluded that the issue was blown far out of proportion. Drawing on years of research into cases in a number of states, Cheit shows that the issue had not been blown out of proportion at all. In fact, child sex abuse convictions were regular occurrences, and the crime occurred far more frequently than conventional wisdom would have us believe. Cheit's aim is not to simply prove the narrative wrong, however. He also shows how a narrative based on empirically thin evidence became a theory with real social force, and how that theory stood at odds with a far more grim reality. The belief thatthe charge of child sex abuse was typically a hoax also left us unprepared to deal with the far greater scandal of child sex abuse in the Catholic Church, which, incidentally, has served to substantiate Cheit's thesis about the pervasiveness of the problem. In sum, The Witch-Hunt Narrative is a magisterial and empirically powerful account of the social dynamics that led to the denial of widespread human tragedy.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Conspiracy Theories",
    "History",
    "The United States Of America",
    "Social Science"
  ],
  "author": "Ross E. Cheit",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/18427487-the-witch-hunt-narrative"
}