{
  "title": "Ricochet: Riding a Wave of Hope with the Dog Who Inspires Millions",
  "description": "Ride the wave of hope with Ricochet – the only SURFice dog™ in the world who chose her own purpose! She surfs with children with special needs, people with disabilities, wounded warriors, and veterans with PTSD as an assistive aid and intuitive muse, healing hearts and souls on every wave.This tears-to-triumph story takes readers behind the TV and video sensation and shares the true journey that went from promise to disappointment before ultimately finding life's purpose. The gorgeous golden retriever Ricochet seemed destined to be a service dog from the moment she was born. She approached her training with boundless energy and surpassed every other dog in her Puppy Prodigy training class. Unfortunately, her love for chasing birds could prove dangerous, for those she would assist. Fifteen months into her training, Ricochet was released, leaving a frustrated owner and a dog without a direction. Yet through a twist of fate, Judy realized that flunking out of school wasn't the end of the world—and in fact, could be the beginning of a new one. Once Judy learned to let go and let Ricochet be who she really was, they found her true calling as a SURFice dog.Ricochet's story is one of synchronicity, our interconnectedness, and opening ourselves to life's 'paws'ibilities. Embracing her true calling, Ricochet began to help others, including those with traumatic brain injuries, post-traumatic stress, and physical disabilities, raising hundreds of thousands of dollars for charitable causes and inspiring people to believe in themselves. Ricochet does more than steady the she offers hope, comfort, healing, and a reason to keep fighting. What gives this story such extraordinary potential to become a publishing sensation? Ricochet is the only SURFice dog in the world, there is no other story quite like it!",
  "genres": [
    "Dogs",
    "Animals",
    "Nonfiction",
    "Memoir",
    "Inspirational"
  ],
  "author": "Judy Fridono",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/18432177-ricochet"
}