{
  "title": "Trial by Ice and Fire",
  "description": "Clinton McKinzie has carved out his own unique territory with suspense novels that blend the heart-pounding thrills of extreme mountain climbing with gripping legal intrigue. “One of the strongest debuts of the year” raved the Chicago Tribune about his debut novel, The Edge of Justice, which was hailed as “action-packed…a page-turner” by USA Today. Now the acclaimed author of The Edge of Justice and Point of Law ratchets up the suspense yet again with a third high-altitude thriller where Antonio Burns--climber, lover, brother, and cop--returns, and walks into a world of glamour, obsession, and terror.Haunted by a reputation he earned by killing three men under questionable circumstances, Antonio Burns finds himself scorned by good cops and admired by bad ones. Unable to shake the tag of “QuickDraw,” Burns has stepped closer to the edge of society while still doing the job he’s paid to do and loving a woman who doesn’t understand him--and may not want him anymore. And with his charismatic but dangerously antisocial brother, Roberto, in trouble with the law, Burns has to manage his loyalties carefully: He is a cop. ’Berto is a fugitive. And they’d die for one another. When Burns is sent to protect Wyoming prosecutor Cali Morrow, a former ski racer being threatened by a stalker, it seems like an easy job. But Cali is the beautiful daughter of one of America’s hottest movie stars, and the stalker may well be a man working on Burns’s side of the law. Antonio has a hard time resisting the woman he’s supposed to be protecting--and stomaching the social swirl of those who make Jackson Hole their playground. With the feds closing in on his brother, Burns can feel his own personal lifeline slipping out of his grasp--until he himself becomes the target of a madman.Trial by Ice and Fire combines extreme menace with extreme action--from a breathless ski adventure down a near-vertical ice chute to a night climb up the Grand Teton above the Snake River. In this powerhouse of a thriller, Clinton McKinzie brings us characters who are living on the edge, a plot that delivers one body-slamming surprise after another, and a novel that is his most fully realized and exciting to date.",
  "genres": [
    "Mystery"
  ],
  "author": "Clinton McKinzie",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/1096575.Trial_by_Ice_and_Fire"
}