{
  "title": "Star Wars: Jedi Trial",
  "description": "“Within twenty-four standard hours we will sit firmly astride the communications link that connects the worlds of the Republic. . . . Our control will be a dagger thrust directly at Coruscant. This is the move that will win the war for us.”\nWith these ominous words, Pors Tonith, ruthless minion of Count Dooku, declares the fate of the Republic sealed. Commanding a Separatist invasion force more than one million strong, the cunning financier-turned-warrior lays siege to the planet Praesitlyn, home of the strategic intergalactic communications center that is key to the Republic’s survival in the Clone Wars. Left unchallenged, this decisive strike could indeed pave the way for the toppling of more Republic worlds . . . and ultimate victory for the Separatists. Retaliation must be swift and certain.But engaging the enemy throughout the galaxy has already stretched Supreme Chancellor Palpatine’s armies to the limit. There is no choice but to move against the surging waves of invading battle-droids on Praesitlyn with only a small contingent of clone soldiers. Commanding them will be Jedi Master Nejaa Halcyon–hand-picked by the Council for the do-or-die mission. And at his side, skilled young starfighter pilot Anakin Skywalker, a promising young Jedi Padawan eager to be freed of the bonds of apprenticeship–and to be awarded the title of Jedi Knight.Shoulder to shoulder with a rogue Republic army officer and his battle-hardened crew, a hulking Rondian mercenary with an insatiable taste for combat, and a duo of ready-for-anything soldiers, the Jedi generals take to the skies and the punishing desert terrain of occupied Praesitlyn–to bring the battle to the Separatist forces. Already outnumbered and outgunned, when confronted with an enemy ultimatum that could lead to the massacre of innocents, they may also be out of options. Unless Anakin Skywalker can strike a crucial balance between the wisdom born of the Force . . . and the instincts of a born warrior.\n\n\n\nFrom the Hardcover edition.",
  "genres": [
    "Star Wars",
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Adventure",
    "War",
    "Space Opera"
  ],
  "author": "David Sherman",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/184279.Star_Wars"
}