{
  "title": "Good Morning, World!",
  "description": "Mom's Choice Award Winner!Readers' Favorite International Award Winner!  Glide gently into the beautiful morning with Baby Thomas and his grandpa. The sun is shining brightly through the wide window and the flowers, trees, birds, and other creatures have already started their day. Brilliant colors of the dawning day wake up the park, and Baby Thomas is ready for a walk. While walking in the park with his grandpa, they see the same things but from a different perspective. Baby Thomas wants to hug the wonderful world around him, but his grandpa has a different opinion. In this book, young readers will easily connect to the wonders of nature and unforgettable characters, playfully interacting with each other. Join happy Baby Thomas and his grandpa for a walk and have a delightful, uplifting morning!  Mrs. D. (Olga D'Agostino), author of children's books and member of SCBWI, grew up in western Ukraine, where she finished Lviv business college. She immigrated to the United States in 1992 with her two small daughters and for years worked in her own business. She speaks a few languages fluently and loves reading, writing, gardening, and traveling. Her children's books Carlo the Mouse on Vacation, The Trees Have Hearts, The City Kittens and the Old House Cat, and Carlo the Mouse, Book 1: Too Many Rules for One Little Mouse, are available in print on Amazon and Barnes & Noble, and as e-books for most popular e-devices. The full series of Carlo the Mouse and her new books The Mysterious Life Inside a Closet and Who Is Most Important in the Fridge? are coming soon. Mrs. D. lives in Smithville, New Jersey, with her husband, Patrick, and adorable Nyda the cat. For updates on Mrs. D.'s future books, please visit her websites: www.mrsdbooks.net or www.mrsdbooks.com.",
  "genres": [
    "Childrens"
  ],
  "author": "Mrs. D.",
  "average_rating": "4.86",
  "url": "https://www.goodreads.com/book/show/18428903-good-morning-world"
}