{
  "title": "Klaus Fuchs the Man Who Stole the Atom B",
  "description": "‘Moss went to great pains to study all the documents relating to Fuchs and interviewed everyone who had contact with him. His spy thriller is better than fiction.’ - LONDON REVIEW OF BOOKS German-born Klaus Fuchs escaped the Nazi regime in 1933 and sought refuge in Britain. Regarded as a genius, the introverted physics student hid his communist beliefs from his peers. The scientist’s brilliance led to his recruitment, by the British, to develop the secret atom bomb project. At this point, Fuchs turned spy and began to pass on nuclear research secrets to the Soviet Regime. As time passed, the refugee’s sense of loyalty to his friends and Britain led to him to doubt his actions and he reported less information to Russia. The British arrested Fuchs in 1950, after the FBI had decoded his Soviet messages. In August 1988, the Russians acknowledged for the first time the key role that Fuchs played in the building of their first atomic bomb. Norman Moss gives detailed insight into Fuchs’ extraordinary story, examining his role in the most momentous historical development of this century, his contacts with the Soviet intelligence apparatus, his friendships, the twists and turns of his mind and conscience, and the intelligence work that led to his arrest. Fuchs’s dilemmas reflect some of the fundamental moral and political conflicts of our time. Recommended for fans of Ben Macintyre and John le Carre. Norman Moss is a writer, journalist and broadcaster. Other highly acclaimed titles by the author include Men Who Play the Story of the Hydrogen Bomb ; A British/American Dictionary ; The Pleasures of Deception ; and The Politics of Uranium . Praise for Norman ‘Admirable… It tells an extraordinary story clearly and well, and with just enough analysis to provoke thought’ NEW SCIENTIST ‘A compelling story' INDEPENDENT ‘It probes deeply… well worth reading’ NEW YORK TIMES Men Who Play The Story of the Hydrogen Bomb ‘An important book’ Guardian ‘Full of illumination… fascinating’ New Yorker The Pleasures of Deception ‘Skilful and entertaining’ Sunday Telegraph",
  "genres": [
    "History"
  ],
  "author": "Norman Moss",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/1011222.Klaus_Fuchs_the_Man_Who_Stole_the_Atom_B"
}