{
  "title": "The Demon Under the Microscope: From Battlefield Hospitals to Nazi Labs, One Doctor's Heroic Search for the World's First Miracle Drug",
  "description": "The Nazis discovered it. The Allies won the war with it. It conquered diseases, changed laws, and single-handedly launched the era of antibiotics. This incredible discovery was sulfa, the first antibiotic. In The Demon Under the Microscope , Thomas Hager chronicles the dramatic history of the drug that shaped modern medicine.Sulfa saved millions of lives—among them those of Winston Churchill and Franklin Delano Roosevelt Jr.—but its real effects are even more far reaching. Sulfa changed the way new drugs were developed, approved, and sold; transformed the way doctors treated patients; and ushered in the era of modern medicine. The very concept that chemicals created in a lab could cure disease revolutionized medicine, taking it from the treatment of symptoms and discomfort to the eradication of the root cause of illness.A strange and colorful story, The Demon Under the Microscope illuminates the vivid characters, corporate strategy, individual idealism, careful planning, lucky breaks, cynicism, heroism, greed, hard work, and the central (though mistaken) idea that brought sulfa to the world. This is a fascinating scientific tale with all the excitement and intrigue of a great suspense novel.For thousands of years, humans had sought medicines with which they could defeat contagion, and they had slowly, painstakingly, won a few some vaccines to ward off disease, a handful of antitoxins. A drug or two was available that could stop parasitic diseases once they hit, tropical maladies like malaria and sleeping sickness. But the great killers of Europe, North America, and most of Asia—pneumonia, plague, tuberculosis, diphtheria, cholera, meningitis—were caused not by parasites but by bacteria, much smaller, far different microorganisms. By 1931, nothing on earth could stop a bacterial infection once it started. . . .But all that was about to change. . . . —from The Demon Under the Microscope",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Medicine",
    "Medical",
    "Audiobook",
    "Biology"
  ],
  "author": "Thomas Hager",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/184327.The_Demon_Under_the_Microscope"
}