{
  "title": "Uncle Scrooge and Donald Duck: The Son of the Sun",
  "description": "Great howling crashwagons! The Richest Duck in the World is back and so are noisy nephew Donald, wunderkinder Huey, Dewey, and Louie, and rascally richnik Flintheart Glomgold! Because you asked for it, we re proud to present our first complete, chronological book of Duck adventures by modern fan favorite Don Rosa following in the footsteps of Disney legend Carl Barks with an exciting, lovingly detailed style all his own!Rosa, among the world s most beloved modern cartoonists, launched his Barksian career in 1987. Famed for his prizewinning Life and Times of Scrooge McDuck (Will Eisner Comic Industry Award, 1995: Best Serialized Story), Rosa wrote and drew a whopping twodecades worth of ripping Scrooge and Donald yarns!Rosa s Duck canon has also won him an additional Eisner Award (1997: Best Artist/Writer, Humor); the Bill Finger Award for Excellence in Comic Book Writing (2013); and the Frankfurt Book Fair s International Grand Prize (2005), among other major international honors.Standout stories in our first Uncle Scrooge and Donald Duck book include The Son of the Sun, Scrooge s and Flintheart s epic battle for Inca gold; Crocodile Collector, Donald s pursuit of a roguish rare reptile; and Last Sled to Dawson, Rosa s sequel to Barks classic Back to the Klondike featuring the return of Scrooge s old flame, Glittering Goldie O Gilt! Uhoh... Cash Flow brings back the Beagle Boys, too!Presented with sparkling color and a rich archive of Rosa s cover art and behind-the-scenes factoids, these Duckburg epics are getting a definitive, comprehensive North American edition for the very first time at a bargain price worthy of Scrooge himself!\"",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Humor",
    "Fiction",
    "Adventure",
    "Comic Book",
    "Graphic Novels Comics"
  ],
  "author": "Don Rosa",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/18444220-uncle-scrooge-and-donald-duck"
}