{
  "title": "Tales of the Booga Dooga Land - The HORUS",
  "description": "In the enchanted Booga Dooga Land is a little Pixie Town, where Pickwick, a little Pixie lives with his delightful smiling OctoDoll. Right from the time the OcotDoll had come alive by inadvertantly breaking the \"Code of Dollus\", Pickwick & the OctoDoll had been repeatedly thrust into life and death situations, where they had to battle formidable adversaries to save other creatures of the Booga Dooga Land, as well as even Pixie Town, the Silver Mountains and the entire Booga Dooga Land. Pickwick and the OctoDoll, rose to the occasion each time, and valiantly entered the fray even at the cost of their own lives, and used incredible \"Plans\" which only they could have made, to overcome their formidable adversaries and win the day. Like other creatures such as the Wormus, the Idearoolus Blick, Harky the Shark, and Wilful the wicked flowerfish, this tale also introduces a villainous adversary endowed with evil traits and seemingly insurmountable magical powers! Pickwick and the OctoDoll who had gone for a picnic to the incredible beautiful \"Valley of the Singing Grass\" were frozen by the Horus into statues and were on the verge of being gobbled up by the Horus, when they were rescued in the nick of time by the Silver Dragon! While all this action was going on, and while the Horus determinedly, followed them up to the Silver Dragon's cave high up in the Silver Mountains where they had taken refuge, even more original and exciting creatures like \"In\" and \"Quisitive\" as well as \"Trans\" and \"Lucent\" emerged in the Booga Dooga Forest. Finally the Horus was overcome just a moment before he would have crushed our heroes and gobbled them up. The Horus turns into .... aha .. that would be telling .. suffice it to say that this tale is so enchanting that the entire family will be delighted and will surely want to read it all together ....",
  "genres": [],
  "author": "Deepak Menon",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/18443923-tales-of-the-booga-dooga-land---the-horus"
}