{
  "title": "'Shattered Nerves': Doctors, Patients, and Depression in Victorian England",
  "description": "No Victorian portrait of nervous breakdown is more celebrated than John Stuart Mill's description of his own crisis recounted in his Autobiography. But Mill was only the most notable British Victorian to suffer from shattered nerves, for depression appears again and again in nineteenth-century history and literature, among men and women of all classes. It was a problem that doctors struggled to understand and treat--largely unsuccessfully. Their debates over the nature of depression, Janet Oppenheim writes, offer us a unique window on the Victorian mind. In Shattered Nerves, Oppenheim looks at how British doctors and patients tried to make sense of depression in an era of limited psychological knowledge and intense social prejudices. Ranging from the dawn of the Victorian era to the First World War, she draws on letters, memoirs, medical reports, literature, and many other sources to paint a detailed portrait of the slowly evolving knowledge of mental illness. She reveals how a host of nerve specialists searched for the physical causes of mental depression--even the term nervous breakdown came from the belief that mental health depended on maintaining supplies of nerve force, much like recharging a battery. Especially interesting are her rich descriptions of the impact of Victorian prejudices on the ways in which doctors and patients viewed depression. Overwork and worries about money and other manly responsibilities were seen as acceptable causes of nervous collapse among men--in contrast to the range of sexual causes, including masturbation, which Victorian doctors frequently found at the root of male mental illness. Women, it was assumed, were naturally prone to hysteria and depression--and if they made the mistake of competing with men or pursuing higher education, then mental derangement was sure to follow. On the other hand, Oppenheim also reveals a number of surprises about Victorian medical thinking: For instance, even though Freud's revolution went largely ignored in Britain before the First World War, many physicians considered sexual abstinence to be unhealthy. She also points out that anorexia nervosa was identified as early as 1873 and was extensively discussed before the turn of the century. The nineteenth century was a critical period in the evolution of modern thought about the mind and the body, an era when medical knowledge grew rapidly but human psychology remained enigmatic. In exploring how Victorians addressed this problem, Shattered Nerves provides valuable insight into the way they saw their world.",
  "genres": [
    "History",
    "Psychology",
    "Research",
    "Victorian"
  ],
  "author": "Janet Oppenheim",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/1844106._Shattered_Nerves_"
}