{
  "title": "The Challenger Launch Decision: Risky Technology, Culture, and Deviance at NASA",
  "description": "When the Space Shuttle Challenger exploded on January 28, 1986, millions of Americans became bound together in a single, historic moment. Many still vividly remember exactly where they were and what they were doing when they heard about the tragedy. In The Challenger Launch Decision, Diane Vaughan recreates the steps leading up to that fateful decision, contradicting conventional interpretations to prove that what occurred at NASA was not skulduggery or misconduct but a disastrous mistake.Journalists and investigators have historically cited production problems and managerial wrong-doing as the reasons behind the disaster. The Presidential Commission uncovered a flawed decision-making process at the space agency as well, citing a well-documented history of problems with the O-ring and a dramatic last-minute protest by engineers over the Solid Rocket Boosters as evidence of managerial neglect. Why did NASA managers, who not only had all the information prior to the launch but also were warned against it, decide to proceed? In retelling how the decision unfolded through the eyes of the managers and the engineers, Vaughan uncovers an incremental descent into poor judgment, supported by a culture of high-risk technology. She reveals how and why NASA insiders, when repeatedly faced with evidence that something was wrong, normalized the deviance so that it became acceptable to them. No safety rules were broken. No single individual was at fault. Instead, the cause of the disaster is a story not of evil but of the banality of organizational life. This powerful work explains why the Challenger tragedy must be reexamined and offers an unexpected warning about the hidden hazards of living in this technological age.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Space",
    "Leadership",
    "Engineering",
    "Sociology"
  ],
  "author": "Diane Vaughan",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/1844138.The_Challenger_Launch_Decision"
}