{
  "title": "Remembering the Bones",
  "description": "Georgina Danforth Witley has never felt she has led anything but an ordinary life. But here she is on her way to meet the Queen. Born on April 21, 1926, the exact same day as Her Majesty, Queen Elizabeth II, Georgie is one of 99 privileged Commonwealth subjects invited to an 80th-birthday lunch at Buckingham Palace. All she has to do is drive two hours to the airport and board the plane for London. Except that in her excited state, Georgie drives her car off the road, tumbling hood over trunk into a thickly wooded ravine. Thrown from the car, injured and unable to move but desperately hopeful that someone will find her, she must rely on her strength, her full store of family memories, her no-nonsense wit and a recitation of the names of the bones in her body—a long-forgotten exercise from childhood that reminds her she is still very much alive. As Georgina lies stranded and helpless, she reflects on her role as a daughter, mother, sister, wife and widow; she casts back over family histories, lost loves and painful secrets. What has it all amounted to?Frances Itani has given us an insightful, moving and beautifully written novel, fanciful and profound by turns. Remembering the Bones goes deeply into the life of an ordinary person who, in her instincts to survive, becomes extraordinary. Grand Dan sat with her head bowed while she listened to the memories of a lineup of colleagues and patients, and then she laughed with a sudden, short bark. It was as if she was telling them that they knew nothing of Dr. Matthias Danforth, whom she had loved. She had held him between her thighs; she had run her hand down the muscles of his back; she was the one who made King Edward cake the way he liked it, with walnuts ground into the icing. . . . She was the one whose skin, under his tracing fingers, had turned to silk.—From Remembering the Bones",
  "genres": [
    "Fiction",
    "Canada",
    "Book Club",
    "Contemporary",
    "Historical Fiction",
    "Canadian Literature",
    "Family"
  ],
  "author": "Frances Itani",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/1844690.Remembering_the_Bones"
}