{
  "title": "Her Royal Seduction",
  "description": "After a poverty stricken woman accidentally kills the first born son of the King of Denmark, she soon finds herself blackmailed into marriage by the very man who witnessed her commit the crime: her victim's younger brother.Nicknamed for the ashes she acquired during her chimney sweeping days, twenty-three year old Cinder has been living alone in a one bedroom rundown cottage in her small village in Hadenville, Denmark since she was twelve years old. For years, she hunted the woods and forests for food and has committed numerous acts of thievery within the village in order to survive.While in search of game near the king’s palace one night, she comes across Willem, a known drunkard and apprentice to the king, who accuses her of trespassing. To keep from dying at his hands like so many maiden’s have before her, a fearful Cinder runs for her life, but is caught by Willem who assaults her. They tussle before she pierces his heart with her sword and rolls his body into the flowing rivers at the far end of the forest. When she hears the Sheriff and his men searching for Willem and the girl he was chasing, Cinder dashes off into the night unscathed.The next day, she learns the king has offered a reward for any information regarding Prince Willem’s death and panics. Taken aback by this previously unknown information, Cinder concludes that Willem was the illegitimate son of the king and his first mistress. Figuring the residents have already begun making false accusations against one another in the hopes of receiving compensation, she remembers that someone saw her in the forest and may have witnessed the murder.Believing her fate will soon be sealed by this nameless, faceless stranger, Cinder travels to the village square for one last act of thievery after a month of laying low and learns of the king’s plan to invite all maiden’s between the ages of 18-25 to take part in a mating game with his other son, the very handsome and regal Prince Norvack. The goal is to find him a wife for his twenty-seventh birthday. Though intrigued by the proposition and benefits, she ultimately refuses to sign up for the game, fearing that being too close to the royal family will indeed expose her crime.A rejected Norvack later confronts her at her cottage and confesses that he has been in love with her since they were children, hoping she feels the same. When she rebuffs his advances, he angrily admits that he was the one in the forest the night she killed his brother, but agrees to keep her safe in exchange for her hand in marriage. She reluctantly agrees after much debate, and soon thereafter moves into the palace.On the night of their wedding, Norvack is sent into battle with the King of England and falls from his horse, injuring his back. Now his wife, Cinder must care for him and as a result, begins to see a different side of the roguish prince. Realizing she’s falling in love, she becomes more vulnerable to his advances and forms an unbreakable bond between them.But when the Sheriff gets wind of Cinder's crime, will he allow them to live happily ever after? Or ultimately ruin their chances by exposing her truth to the king, sealing her deadly fate?This book is intended for mature audiences.",
  "genres": [
    "Erotic Romance"
  ],
  "author": "Kiki Leach",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/18457563-her-royal-seduction"
}