{
  "title": "Butterfly",
  "description": "“The delicate silver filigree butterfly around my neck had been a gift from Hugh … I told myself it was a talisman that would prevent any harm coming to me. But I couldn’t have been more wrong.”The opening night of Georgia’s exhibition is a flop. It’s stinking hot, sales are down and her husband Hugh is stuck in Wellington, four hundred miles away.Then Georgia meets Xavier Bishop, who tells her he’s an old friend of Hugh’s. His unexpected behaviour – and Georgia’s unexpected response – trigger a series of events that leaves Georgia wondering if she’s made a big mistake marrying Hugh. Things only get worse when Georgia goes to talk to her best friend Willa – who turns out to have been keeping secrets of her own. Until she confronts both Hugh and Willa, Georgia has no way of knowing what the truth is. But both of them are being frustratingly evasive ...About the series What happens when everything you believe about love, sex and fidelity is turned on its head?When American artist Georgia Daniels marries handsome, sexy lawyer Hugh Fraser and moves to the other side of the world with him, the fairy tale she thought she was buying into soon transforms into a complex web of secrets and uncertainty. Ghosts from Hugh’s past surface, making her realize he’s not the shy, innocent guy she thought he was. Her best friend Willa turns out to have secrets of her own that leave Georgia out on a limb when she needs someone she can trust. And every time she thinks she has it all figured out, she gets a call from her estranged mother, whose well meaning attempts to deal with the past and restore their relationship just leave Georgia even more confused.The Butterfly series takes up where traditional romance novels leave off – exploring love in a way that is edgy, challenging and sometimes painfully real – and coming to conclusions as unexpected as they are perfect.This story unfolds over the course of four novels, each in three parts. This book is Part 1 of the first novel.",
  "genres": [],
  "author": "Violet Gregory",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18456053-butterfly"
}