{
  "title": "Ghost",
  "description": "Ghost is an old-fashioned Southern boy fighting hard to forget his pain. He’s forced to protect his Mama and sister from their abusive Pa. Ghost is strong, silent, and soft spoken. He works hard against all obstacles and hurt. Ghost grows up to become a Delta Force. He meets and falls for a hot Latina who sets him on fire! She captures his soul and brightens his world. He would do anything to protect her. Duty calls and he’s forced to leave her unprotected. The unspeakable happens! Ghost calls on Infinity. Infinity aids to extract his woman from the clutches of a soulless prostitution mob. Time is running out!Delicious TasteGhost drives down Andrea’s street in his black new pickup. He parks a few houses down. He leaves the truck running. He leans back into his seat, gripping the steering wheel. He’s wearing black sunglasses.Damn, I don’t like where my sweet Darlin lives. Those bastards down the street are up to no good, thinks Nathan. He grabs his cell and quickly texts Andrea that he’s waiting. “Ghost this is a bad part of Los Angles. We need to hurry. We need to leave as soon as she’s here,” says Loco. He has his shades on and looks down the corner at the hoods gathering around a table, drinking. “Where does she live?”“She lives down the street on the right in that yellow house. The one across from the hoods,” replies Nathan. A few yards away from Nathan are some young boys playing with the basketball. They look at Nathan and his truck. Andrea leaves her house and walks down the steps. She’s carrying her bag. She’s wearing her cute red dress, sexy black sandals and her shiny black hair loose down her back. She stops on the sidewalk. She grabs her sunglasses out of her purse and quickly slides them on. She looks down the street and smiles. Oh yeah, my Baby is waiting, she thinks.* * *Marcos takes a drink of his Corona. He’s a handsome young man that’s used to having the girls fall at his feet. He’s wearing crisp cotton grey slacks with a white fitted shirt, and black shoes. He has one leg on top of bench. His buddies surround him, playing cards on the table. . He looks at the house across the street. Yeah, I have to talk to her. I need to get her into my arms. She’s a sweet pussy, thinks Marcos. He continues to wait for Andrea to step out of her house. Damn yes, Andrea just came out of her house. This is my sweet opportunity to talk to her. Marcos leaves his buddies and strides across the street towards Andrea.“Andrea you look beautiful,” says Marcos, smiling. He has his Corona in his hand. “When are you going to talk to me? I want to take you out.” He stands on the curb, looking at her. He licks his lips. “Andrea you have me crazy for you.” Andrea turns to look at him and turns away. She starts striding quickly down the street towards Nathan. Marcos sees her walk away and this infuriates him. What’s her fucking problem? Does she think she’s too good for me, thinks Marcos. He throws his Corona in the ground and starts following her with determination. That pussy is going to be mine. The boss wants her. She will bring in lots of money. I already have a list of clients waiting for her.Andrea walks quickly, trying to reach Nathan. Damn I have to ignore him. I’m almost there, thinks Andrea, anxiously. She bites her lower lip with fear. Damn I’m so glad that my Baby is here. He’s so big and strong.Marcos runs after her and grasps her arm. “Fucking bitch, what’s wrong with you! You’re always ignoring me. You think you’re too good for me!” yells Marcos. He pulls her close to him, glaring down at her. Andrea yells with fear, her eyes expand. She trembles, her complexion turn white. She moves to take his hand off of her. “Let me go Marcos!” she yells.* * * “There she is, my Darlin girl,” whispers Nathan, smiling. He glances over at Loco. “Yeah that’s her,” says Loco, laughing at Nathan. “Yeah brother your pussy whipped.”Nathan watches her stop and slides her glasses on. He then watches Marcos walk over to her. Nathan grasps the steering wheel with anger. “What the fuck does that asshole want with her,” says Nathan. He watches closely to see if she’s going to talk to him. Oh yeah, she’s not giving him the time of day, thinks Nathan. He smiles, and then he sees red when he sees him run after her and grabs her arm. “That son of bitch!” yells Nathan. He jumps out of the truck. He sprints the few yards down the street, pounding into the asphalt, towards Andrea. His heart pounds hard in his chest, full of anger, anxiety, and the extreme urgency to get her away from him. He reaches Andrea and pulls her away from him. “Mother fucker what in the hell do you think you’re doing. Don’t touch my woman,” growls Nathan. He glares down at Marcos. “Hot Dang! Whup his ass!” yells Loco. He jumps out of the truck and runs after him. He stops right behind them. He watches Marcos buddies start to run over. Oh hell this is going to get ugly, he thinks. They’re only six. Yeah it’ll take only a few minutes to calm these assholes down.Loco looks at them line up behind Marcos. Hmm these pups are going to get their ass whup, he thinks. Loco grins at them.“Puto (male whore), she’s your woman, and since when? The last time I checked this pussy didn’t have an owner,” says Marcos, smirking. Yeah I love this, this pussy has an owner. Now I’m going to enjoy taking her form him, thinks Marcos.“Fucking asshole, don’t every talk to her or about her like that! She’s a lady!” yells Nathan, turning red. He’s blood boils with anger.“Darlin go to my truck,” says Nathan, softly to Andrea. Not losing sight of Marcos. “I’ll be there in a few.”Andrea is shaking with fear. Omg Marcos is crazy. He’s so vulgar, thinks Andrea. She strides quickly to the truck, gripping her bag tight. She opens the door, throws her bag in the rear seat, and slides into the middle of the bench seat. She stares at them, trembling with fear. She moves a strand of hair from her eyes and sets it behind her ear. She whips the tears from her eyes biting her lower lip. Omg, what if my Baby wasn’t here to protect me. He would have taken me, she thinks, shuddering.Andreas’s little brother Raul stands near the bushes hiding. He’s shaking with fear. That mean Marcos wants my sister Andrea. I’m so scared of him. Who are these huge men? That white man is picking up my sister Andrea, thinks Raul.Loco is ready to fight, he monitors their actions. These bastards don’t know who they’re messing with, he thinks.Nathan takes a few steps forward and stops right in front of Marcos face. He looks down and glares at him enraged. “Fucking asshole, I’m going to tell you once. I’m going to kill you if you go near her again. Don’t ever look or touch her again,” says Nathan, softly. He grinds his jaw, the muscle flexing from the pressure. Nathan is a good eight inches taller than Marcos. He towers over all of his buddies. He’s an imposing man. Marcos buddies eye Nathan and then glance over at Loco. Loco stands with his feet spread out and ready to fight. His huge hands are fisted. He smiles at them and winks. Oh yeah, they’re going to be my girlfriends, thinks Loco. “Puto, I’m telling you now, I’m taking her from you,” growls Marcos. He stares Nathan down. “Don’t look away because I will kill you.”“You’re dead,” growls Nathan. “You gay mother fucker,” yells Marcos, smirking. “I’m ready anytime to fuck you. You’re going to me my puto.” “You little roach, you really want to die,” growls Nathan. His growl vibrates deep in his throat.  “I’m going to kill you!” yells Marcos. Marcos pulls out his blade and takes a stab at Nathan. Nathan quickly grabs his hand and twists it behind him. He pulls Marcos arm up his back. Nathan wraps his arm around his neck and pulls him against his chest. He forces Marcos to release the blade. “Fucking roach, I’m going to whup your ass. Yeah I’m looking forward to ass whupping time,” whispers Nathan.Loco quickly kicks the blade and glares at Marcos buddies. Then he grins and winks at them. Nathan pulls his arm further up and hears the bone crack.Marcos yells out in pain and sways from the pain.Nathan grins at Marcos buddies. “Music to my ears,” whispers Nathan. He shoves Marcos into his buddies.Marcos buddies move to catch him. They glare at Nathan and Loco. They’re too scared to even try to fight them. One yells at Nathan. “Gringo (white guy) we’re going to hunt you down and kill you. That pussy is ours,” yells a tall thin bastard. Nathan glares at him and walks over to him. He picks him up by his shirt and slams him against fence. “I will teach you fuckers some manners. You will never refer to my woman like that,” whispers Nathan. He swings back and punches him the mouth. The thin bastard head swings back into the fence. His lower lip splits and starts to bleed. Nathan throws him down the ground.He turns to glare at the other hoods. They quickly drag Marcos and the thin bastard to the house. Nathan looks over at Raul hiding behind the bushes. He looks him straight in the eyes. Nathan slightly nods his head. Raul smiles at Nathan. He then stands, trembling from fear, and runs home.Available now to preorderhttp://www.smashwords.com/books/view/...",
  "genres": [],
  "author": "P.T. Macias",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/18457173-ghost"
}