{
  "title": "Rapture",
  "description": "Triktapic, the deadly dark elf assassin, has been restored by the Forest Lords to his rightful place as king of the Elven realm. Now, he must face his former comrades as he attempts to stop Lorsan, king of the dark elves, from enslaving the human race. Lorsan has already begun distributing Rapture, the irresistible drink that destroys those who unknowingly become addicted to it. Will Cassie, his Chosen, be able to give Trik the strength he needs to face his dark past?Meanwhile, Cassie’s best friend, Elora, is in a fight for her own life. Elora, her mother, Lisa, and a small band of light elves have traveled deep into the dark elf realm in hopes of rescuing Cassie and Trik. But their mission quickly turns into a battle for their own lives as they are surrounded by Lorsan and his warriors. Though outnumbered ten to one, the humans and elves fight heroically. They fight for a King once lost but now found. They fight for the human realm that doesn’t yet know it is in need of saving. They fight for love; a love that has already been discovered and a love that is waiting to be revealed. Despite their valiant efforts, the band is captured and held captive by the dark elf king.The peaceful world that Cassie and Elora knew is long gone, shattered by their realization that elves walk secretly among them, and are bent on their destruction. Soon, each of the girls will be forced to choose her own path. Cassie must decide to which world she belongs and Elora must decide if she will fight for a warrior hell-bent on keeping her from his side.Two species, human and elf, stand on the precipice of war, united in one goal; shatter the dark elf king’s plan, and unite a divided race under the rule of the one true King.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Paranormal",
    "Fae",
    "Paranormal Romance",
    "Elves"
  ],
  "author": "Quinn Loftis",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/18457506-rapture"
}