{
  "title": "And a Child Will Lead Them",
  "description": "A new Pope, a world in social and political chaos, and a young singer and songwriter who has his unbelief tested as his big mouth accidentally propels him towards global superstardom. These are the ingredients of this thought provoking, tongue-in-cheek debut novel.Seventeen-year-old Julian Monk never expected to be a famous singer, but when opportunity strikes, he strikes back and throws himself headfirst into that new, exciting world of record deals, TV interviews and screaming fan girls.His band mates are rather less enthusiastic about that new life they never really asked for. Dealing with their newly acquired fame and fortune is one thing; dealing with Julian is quite another. His sudden and unexpected metamorphosis from the shy and timid creature they have known all their lives into a surprisingly charismatic public speaker and global superstar takes everyone aback, and when Julian sets off on a very public crusade to replace faith and bigotry with reason and compassion, he raises more than just a few eyebrows. He raises hell, and his friends are no longer having any of it.Meanwhile at the Vatican, a former televangelist is elected Pope. Hell-bent on transforming the Church into a modern, ‘hip’ institution, Pius XIII is giving his PR advisor a headache or two. Intrigued by Julian’s radical way of inspiring some people while antagonizing others – including his own friends – simply by preaching love and understanding, the new pope can’t help but wonder where he heard that storyline before. They say God has a plan for every man, but this man has a plan of his own - and it involves a teenage atheist pop star.Idolism is a quirky, tongue-in-cheek novel for the religious skeptic, shedding light on the differences and similarities between religion and stardom.",
  "genres": [
    "Young Adult"
  ],
  "author": "Marcus Herzig",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/18456249-and-a-child-will-lead-them"
}