{
  "title": "Gatsby's Smile",
  "description": "Gatsby's Smile is a psychological thriller/murder mystery.A police psychiatrist's Imaginary Friend from childhood reappears and, in order to save future victims' lives, persuades the grieving doc to murder all the suspects in a mysterious serial killer case.Dr Morana 'Moody' Blue, fears she's begun to manifest the symptoms of schizophrenia because Maro, the Imaginary Friend she had as a child, has reappeared – all grown up. Morana is aware that Maro's appearance is a subconscious manifestation of her recent grief as she's just suffered a miscarriage; but intellectually understanding your grief doesn't make dealing with it any emotionally easier. She knows, too, that schizophrenia tends to run in families – and her mother is positively psychotic.Estranged from her unrequited love, the father of her lost baby, Police Chief Harry Black, Morana is nevertheless drawn into Harry's investigation of the murders of two young women discovered wide-eyed, naked, their pubic hair shaved – but without a single murderous mark upon their perfect bodies. Suspiciously, though, when Morana witnesses the grisly murder of a third girl, she chases the murderer into the woods only to be found, the next morning, covered in the dead girl's blood and clutching the weapon that killed her.Morana believes then that the murderer is trying to frame her and so must be someone she knows. Someone close. Her deductions garner four suspects: misogynistic Harry himself; Harry's mysterious new coke-addled sidekick DS Young; Robert the secretive Police Coroner with a penchant for nyotaimori geishas; and Doc the local GP/Police doctor who, she discovers, hasn't as gentle a bedside manner as he ought to have.The four suspects themselves, however, gather evidence enough to believe that Morana herself is responsible for the serial murders: her clutching the murder weapon aside, no witnesses come forward to corroborate her story about the killer hightailing it from the murder scene – and she seems to be losing her mind: she's unpredictable these days; she's abusive, violent even, and she's talking to herself a lot… out loud.In the face of Harry's rising fury, DS Young's amusement, Robert's conspicuous pity and Doc's simmering resentment, though, Morana does what she does best: by analysing the corpses and crime scenes, she slips inside the psyche of the murderer and, subconsciously manipulated by Maro, Morana finally determines that in order to save the lives of more potential murder victims she must physically eliminate the all murder suspects… one by one.",
  "genres": [
    "Thriller",
    "Fiction",
    "Psychological Thriller",
    "Crime",
    "Mystery Thriller",
    "Mystery"
  ],
  "author": "Morana Blue",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/18459045-gatsby-s-smile"
}