{
  "title": "1636: The Devil's Opera",
  "description": "A new addition to the multiple New York Times best-selling Ring of Fire series. After carving a place for itself in war-torn 17th century Europe, citizens of the modern town of Grantville, West Virginia take on a murderous conspiracy of operatic proportions in Magdeburg, the capital of the United States of Europe.New York Times Best Selling SeriesEric Flint and David Carrico serve up the latest entry inthe best-selling alternate history saga of them all, the Ring of Fire!It is the year 1636. The United States of Europe, the newnation formed by an alliance between the Swedish king Gustavus Adolphus and theWest Virginians hurled back in time by a cosmic accident, is on the verge ofcivil war.&nbsp; His brain injured in the warwith Poland, the USE's emperor Gustavus Adolphus is no longer in command. EnterSwedish chancellor Oxenstierna, a leader of aristocratic reaction againstdemocracy.&nbsp; His goal:&nbsp; to assemble the forces of the hideboundruling class in Berlin and drown the revolution in a bloodbath. In Magdeburg, thecapital of the USE, Mike Stearns' wife Rebecca Abrabanel is organizing popularresistance to Oxenstierna's plot. As part of the resistance, the Americanmusician Marla Linder and her company of down-time musical partners are stagingan opera that will celebrate the struggle against oppression. PrincessKristina, the heir to the USE's throne, is now residing in Magdeburg and isgiving them her support and encouragement. But another plot isunderway--this one right in the heart of the capital itself, and with murder asits method. The only people standing in the way are a crippled boy and theboxing champion who befriended him, and an unlikely pair of policemen. Can theAmerican detective Byron Chieske and his down-timer partner Gotthilf Hochthwart the killers before they succeed in their goal?About Eric Flint’s Ring of Fire series:“This alternate history series is…a landmark…”—Booklist“[Eric] Flint's 1632 universe seems to be inspiring a whole new crop of gifted alternate historians.”—Booklist“…reads like a technothriller set in the age of the Medicis…”—Publishers Weekly",
  "genres": [
    "Alternate History",
    "Science Fiction",
    "Time Travel",
    "Fiction",
    "Fantasy",
    "Historical Fiction",
    "Historical"
  ],
  "author": "Eric Flint",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/18460849-1636"
}