{
  "title": "Kilty Pleasure",
  "description": "The line between lust and hate is often blurred...The McLaughlins, Book 2After being ditched at the altar over a year ago, Deputy Colin McLaughlin is fine with being single. Despite the fact that nearly every eligible female on the island wants him, he isn't looking for love. But something stirs his blood when Hailey starts showing up more on the island. And it's not just the conviction that the apple doesn't fall far from her troublemaking, drugged-out family tree. His frustration mounts that even after she ruined his twin brother's life, the desire he's felt for her since high school still simmers. Hailey Alexander knows her past is littered with mistakes. She's done her best to make amends and move on, but a certain Scottish-born deputy doesn't seem in any hurry to forgive or forget. More than just fighting the attraction that's compromising their hearts, they face a new threat from Hailey's past that may threaten her life.  Contains sexy Scottish men living in America. The occasional kilt. A hero deputy who can't forgive or forget, and a nurse immune to bullshit. Angry kisses. Scalding sex. And a drugged-out stalker ex to keep these two on their toes. EXCERPT\"You're deliberately provoking me, Hailey.\"\"Oh, is that what I'm doing?\" The car sped up as she hit the accelerator.\"And might I point out you're now legally speeding?\"\"Point it out all you want, Deputy. Your ass is off duty and hitching a ride.\"He wasn't really worried about the speed of the car right now, rarely would he pull someone over for a few miles above the speedlimit--Charles Richland being the exception.He shifted in his seat and turned to look at her.Her lips were pursed, her cute little nose lifted in the air, and her breathing seemed a little uneven. She was angry, but there wassomething else there. Something else that had the blood in his bodystirring.Sliding a quick gaze down her body, he lingered briefly on the curveof her breasts and then the golden thigh peeking out below her denimshorts.She must've sensed his gaze because she stiffened and drew in another deep breath that had her chest rising.\"Stop checking me out.\"That knocked the wind right out of him. \"What did you say?\"\"You heard me, Colin. Do you think I'm stupid?\" The look she shot him showed overly bright brown eyes that shone with anger and heat. \"Itoccurred to me why your bitterness focuses mostly on me. Why you can beso damn cruel when it's outside your personality.\"His teeth snapped together. \"Oh, please do enlighten me.\"\"Because you're attracted to me.\"She said it so casually, so matter-of-factly, that again he struggled to breathe.\"Am I?\" Somehow he kept his tone bored. Steady.\"Yeah. You are. And you would've been much happier if I were somefugly chick you could just happily hate and ignore from a distance.\"\"That's complete shite.\"\"It's really not and you know it. In fact, you've always been attracted to me, Colin McLaughlin.\"All right, he'd bloody well had enough.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Enemies To Lovers",
    "Family",
    "Amazon",
    "Second Chance"
  ],
  "author": "Shelli Stevens",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/18459973-kilty-pleasure"
}