{
  "title": "Beautiful Illusions",
  "description": "Beautiful Illusions - a page-turning, sexy, and very contemporary adult romance novel. VERY contemporary.Beautiful Illusions is a Cinderella Romance With a Twist - and what a twist it is!Attorney Iris Snowe drinks too much, eats too much, and spends too much. Her sex life has been as spectacularly unsuccessful as her law practice, so she spends her evenings in her tiny apartment watching bad TV, talking to her cat, and rescuing pit bulls.And her name might be Iris, but it should be Jade. As in jaded, which is how she feels about romance and men in general. So, when a gorgeous and sexy stranger appears in her law office on Monday morning, after a one-night stand the previous Saturday, she doesn't think that he is coming to see her because he is interested. She just figures that she left something behind in the room and he is enough of a gentleman to deliver it to her.How wrong she is. As it turns out, Ryan Gallagher not only looks like a Ralph Lauren model come to life, but is also fabulously wealthy, as he is the son of a prominent billionaire.In other words, light years out of Iris' league. And completely into her, in more ways than one.And so begins the erotic Cinderella romance of her life, with a man who truly loves her. And oh, if it could just be that simple. But, of course, it's not -the fairy tale is fractured, as it is marred by obsession, jealousy, and dark secrets that Ryan has desperately sought to conceal and repress. It turns out that, behind those magnificent green eyes, lies the memories of a past that nobody should ever have to experience. Nobody. But when his past becomes his present, his secrets come to light.And one of those secrets just might be deadly...This is a full-length novel, approximately 100,000 words. Story continues in Deeper Illusions.Don't miss the exciting conclusion to the trilogy! Estimated publication date is September 23!",
  "genres": [
    "Romance",
    "Erotica",
    "Fiction",
    "Contemporary Romance",
    "Amazon",
    "M F Romance",
    "Erotic Romance"
  ],
  "author": "Annie Jocoby",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/18461625-beautiful-illusions"
}