{
  "title": "The McGilley Trilogy",
  "description": "Rumors had circulated for years in the Lexington area about horse breeders Brett, Colin and Donovan McGilley, especially about the activities that went on above their popular night club, Casey’s. Kayla Holden was at Casey’s to celebrate her twenty-sixth birthday and in the mood to do something wild and crazy and what could be wilder and crazier than enticing sexy, older Brett McGilley into inviting her upstairs for an up close and personal look at the sexual activities she had heard so much about. Even though Brett was attracted to Kayla, his taste for spanking and exhibitionism was not for someone so young and inexperienced. But Brett had no idea just how determined Kayla was to not only explore his sexual kinks, but to do so only with him.Colin McGilley had fallen for his best friend’s wife, Olivia Hammond, the moment he met her and when Doug asked him to help gift her with a ménage on her birthday, he couldn’t resist. The next three years, Colin carried the guilt of Doug’s sudden death that next day while Olivia struggled with grief. But Olivia’s need to find another Master to give her what she so badly craved sent her to Colin, this time asking more from him than friendship.Donovan McGilley has struggled with his quick temper ever since his rescue from the Iraqi’s seven years ago, his worry over preferring rough sex keeping him from seeking a relationship outside of the few women who liked sex hard and usually with two men at their private club. But when veterinarian, Anna Kingston saves one of his beloved mares and he see signs of abuse on her body, he simply couldn’t turn her down when she approaches him to explore the sexual fantasies that had led to ending her marriage.Meet the McGilley Brothers who like their sex kinky and on their terms, but try to do the right thing by turning down the women brave enough to take them on. Women who refuse to take no for an answer.",
  "genres": [
    "Romance"
  ],
  "author": "B.J. Wane",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/18461273-the-mcgilley-trilogy"
}