{
  "title": "Crazy Little Thing Called Lust: Simone Part 2",
  "description": "After the revelations that sprang forth after her one night stand, Simone feels both betrayed and guilty as hell in the aftermath. When Zane calls her, looking to take her out again, what can she say apart from, ‘Get real! And while you’re at it, get lost!’But when Zane refuses to take her rejection and forces her to listen to his unorthodox tale, he sets Simone on to a path she never imagined impossible.With her life changing about her, only her friends can keep her grounded.But does she want to have her feet planted firmly on the ground?Or is she ready for adventure?Even if that adventure means her becoming something that goes against her every principle. 20,500 wordsCrazy Little Thing Called Lust is the SECOND novella in Simone's FOUR part story.Reading Fall Into LoveCrazy Little Thing Called LustAll That GlittersCan Be GoldOver 400 pages of Naughty Nookiness!ExcerptLetting my finger drift along the line of those ripped muscles, I’m having too much fun to realize that his eyes have opened and that he’s watching me with amusement. The instant I do, I blush. Christ, being a strawberry blonde is a killer sometimes.“You know what you’re starting, right?”His voice is usually deep, but this early morning rumble sets me on fire.An unfortunate turn of phrase for someone in my circumstances, but hey, it’s the truth.“Very aware,” I retort, and continue to trail my finger over his flesh, taking particular pleasure in rubbing the line of his obliques. Yum.He grabs my hand and curls upright, in a move that has each muscular square of his stomach curling and tautening. “Let’s clean up, first.”For a moment, I wonder if I stink. And then, I remember two things. Christ, this isn’t a romance story. Morning breath does exist in this world, as does the garlic-rich spaghetti sauce we both consumed last night. Because of that, I’m not offended and jump up and run to the bathroom. Stuffing my toothpaste-loaded toothbrush into my mouth, I jump in the shower for a quick wash. And squeal, when an equally toothbrush-touting Zane pops in front of me.Until now and unlike myself, he’s always respected my privacy. Somehow, I know this marks the start of the demise of privacy as I know it.",
  "genres": [
    "Erotica",
    "Contemporary Romance",
    "Short Stories",
    "Romance",
    "Menage",
    "Chick Lit"
  ],
  "author": "Serena Akeroyd",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/18460748-crazy-little-thing-called-lust"
}