{
  "title": "Tres tristes tigres",
  "description": "Ciertas novelas de horror y de intriga llevan la indicación, muchas veces apócrifa, de que no deben leerse de noche. Tres tristes tigres tendría que cruzar una banda sobre la cubierta que diga Debe leerse de noche, porque el libro es una celebración de la noche. En una nota biográfica, Guillermo Cabrera Infante declaró que aunque podía reclamar legalmente la propiedad de su tierra natal (él asegura tener una abuela india) decidió regalarla a la erosión histórica y emigrar. Fue al final del éxodo cuando descubrió varios de sus amores, de sus obsesiones, de sus temas: La Habana, el inglés, la literatura, la jerga de la ciudad, las habaneras, el cine de día, la música total, los autos viajando y \"también la nostalgia y la noche\".La noche insular y urbana, habanera, es el protagonista de la novela y todas las noches quieren fundirse o se funden en la sola, larga noche del libro, que al final comienza a amanecer, lenta y reveladora. Y aunque Tres tristes tigres (el título viene de un trabalenguas infantil cubano) semeja una colección de camafeos (no de retratos) de Dorian Gray, sus personajes no son estos hombres y mujeres, ni siquiera las \"desventuras de unos pocos\" en los que vio \"una historia, el mito\". Sus héroes son la nostalgia, la literatura, la ciudad, la música y la noche y, a veces, esa forma actual de arte que parece reunirlas en una sola cosa: el cine. El único villano es la traición, pero no el delito humano, comprendido y perdonado, sino ese fatal crimen de lesa literatura que es la traducción y el libro termina en realidad con una inscripción doblemente dantesca: la palabra tradittori escrita en el sueño.G. Cabrera Infante nació el 22 de abril de 1929 en Gibara, provincia de Oriente, Cuba. En 1941 emigró a La Habana con sus padres. Comenzó a escribir en 1947 y abandonando los estudios y una soñada carrera médica trabajó en muchos oficios o en un solo oficio repetido. En 1950 ingresó en la escuela de periodismo local. En 1952 fue detenido y multado por publicar un cuento que contenía \"English profanities\". En 1953 se casó por primera vez. En 1954 comenzó a escribir con el seudónimo de G. Caín la crítica de cine en Carteles, semanario popular del que sería jefe de redacción en 1957. Ganó premios y menciones literarias con sus cuentos y fundó la Cinemateca de Cuba, que presidió de 1951 a 1956. En 1959 fue dirigente de la cultura oficial, directivo del Instituto del Cine y director del magazine literario Lunes de Revolución desde su fundación hasta su clausura en 1961. A fines de ese año se casó con al actriz Miriam Gómez. En 1962 viajó a Bélgica como agregado cultural. En 1965 regresó a Cuba a los funerales de su madre, renunció a la diplomacia y volvió a Europa. Publicó el volumen de relatos Así en la paz como en la guerra, las novelas Tres tristes tigres, que obtuvo en 1964 el Premio Biblioteca Breve (Seiz Barral, 1967) y La Habana Para un Infante Difunto, la recopilación de críticas cinematográficas Un oficio del siglo XX, el libro narrativo unitario Vista del amanecer en el Trópico, la colección de artículos y ensayos O y el inclasificable volumen de piezas experimentales Exorcismos de esti(l)o. Posteriormente publicó un conjunto de cinco extensos ensayos sobre sendad figuras del cine norteamericano, bajo el título de Arcadia todas las noches, reunió sus escritos de tema cubano en el volumen Mea Cuba, escribió en inglés el libro sobre el tabaco Holy Smoke y dio a conocer los textos narrativos Delito por bailar el chachachá y Ella cantaba boleros (este último, procedente de Tres tristes tigres) y la recopilación de escritos de crítica cinematográfica Cine o sardina.En diciembre de 1997 obtuvo el premio Cervantes y en 2001 el premio Unión Latina por el conjunto de su obra. Murió en Londres en 2005.",
  "genres": [
    "Fiction",
    "Spanish Literature",
    "Literature",
    "Latin American",
    "Novels",
    "Latin American Literature",
    "Classics"
  ],
  "author": "Guillermo Cabrera Infante",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/18459606-tres-tristes-tigres"
}