{
  "title": "Melt Zone",
  "description": "ASIN B00CKDPU4G moved to the most recent edition hereRAPID ANTARCTIC ICE MELT... A HUNT ACROSS EUROPE... A DECADES-OLD NAZI MYTH... Following on from Tipping Point and Impact Point, Robert Spire is thrust into his latest fast-paced, Antarctic-themed, action-packed adventure-thriller.In 1938, the German New Swabia Expedition left Hamburg for Antarctica aboard the MS Schwabenland. The secret expedition arrived at the Princess Martha Coast, in an area which had been claimed by Norway as Dronning Maud Land, and began charting the region. Nazi German marker darts were dropped along the coast to mark out the new territory...75 years later, satellite photographs of Eastern Antarctica reveal something startling has started to occur...RAPID ANTARCTIC ICE MELT...Just before Europe's Envisat satellite malfunctions, it photographs a mysterious melt zone during a fly-over of Eastern Antarctica. Following analysis of the photographs, the UKs GLENCOM - Global Environmental Command - Unit, sends three of its climatologists to investigate, but as they analyse the site, a vast crevasse opens in the ice, swallowing them up. They survive the fall, but make a startling and lethal discovery.A HUNT ACROSS EUROPE...GLENCOM agent and environmental lawyer, Robert Spire, has his Austrian skiing holiday interrupted following the discovery, and is tasked to investigate a Cologne-based company that appears to be linked to the events unfolding in Antarctica. Things soon take a sinister turn, as clues lead him to the discovery of a 70 year-old Nazi document. For Spire, the knowledge he now possesses can only lead to one thing - certain death, as he is pursued relentlessly across Eastern Europe.A DECADES-OLD NAZI MYTH...With Spire missing, and a second search and rescue operation to the melt zone going disastrously wrong, GLENCOM organise a third expedition to the region, this time with the assistance of Russian cryoscientist and glaciologist Professor Irina Lopintova. If Spire makes it back to England alive, he will face his most daunting challenge yet, an expedition to the melt zone to discover what lies buried beneath the ice.",
  "genres": [
    "Thriller",
    "Adventure"
  ],
  "author": "Simon Rosser",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/18460389-melt-zone"
}