{
  "title": "Seres mitológicos argentinos",
  "description": "Lejos de ser una superstición, el mito es un relato verdadero, con un fuerte anclaje en la cultura. Tal como lo confirman los actuales estudios del imaginario, el hombre, más que un animal racional, es un animal simbólico. Al igual que el arte, el mito recorta un fragmento de la vida y apela a la máscara para iluminar el lado oculto de las cosas, las claves del sentido y de eso que llamamos realidad.Adolfo Colombres caracteriza y clasifica en este libro quinientos seres sobrenaturales argentinos, tanto del ámbito indígena, al que pertenece la gran mayoría, como del criollo. Están las deidades que dieron origen al mundo y a los astros, crearon al hombre, las plantas y los animales. También las que enseñaron costumbres valiosas, preservan la naturaleza, protegen a las mujeres y los niños, provocan o curan enfermedades. Dioses como la Pachamama y Nguenechén, personajes legendarios como el Pombero, el Llastay, la mula Ánima, la Llorona o el Futre, junto con los pocos que heredamos de Occidente: las Brujas, el Lobisón, el Basilisco y el Familiar. A fines de sistematizar la lectura, se incluye al final una lista de estos seres, según su ámbito cultural de pertenencia, la que se recomienda como guía a quienes deseen abordar un mundo simbólico determinado.No existe en América un libro tan exhaustivo y profundo sobre la mitología de un país, cualidad que se refuerza con las ochenta y siete magníficas ilustraciones de Luis Scafati, que dan una forma visual a muchos seres que nadie había representado hasta hoy. La respuesta del público y de la crítica así lo reconoció, al parecer, en el año 2000, con su primera edición. Esta segunda edición viene revisada y enriquecida con nuevos personajes.Cabe aclarar que los seres mitológicos no son cosa del pasado. Siguen estando muy presentes en el imaginario popular de nuestro país y, en buena parte, también de los países vecinos, donde son aún capaces de maravillar y estremecer.",
  "genres": [
    "Mythology"
  ],
  "author": "Adolfo Colombres",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/18461348-seres-mitol-gicos-argentinos"
}