{
  "title": "Beautifully Wounded",
  "description": "Sometimes the only way to salvation... is to take a leap of faith.What would you do if you had no place to go and no one you could trust?\"The lyrics are about you, Lena,\" he confessed, and I watched his mouth as the tip of his tongue moistened his lips before he leaned his head down. Then those beautiful lips were on mine, soft, tender at first, then his tongue glided over my lips, breaking the seal. My pulse throbbed and quickened as his tongue swirled around mine. Taking and controlling, and... and I wanted this, needed his touch. I went limp in his embrace, and the heat rose under my skin, my body vibrated against his strong powerful one. Was this really happening?\" Jackson Beaumont prides himself on being a nature-loving, guitar-strumming, carefree sort of guy. When the mysterious Lena Benton walks into his bar looking scared and defeated, it's not something he can ignore. He's immediately consumed by concern for her and driven by his desire to help. She's just so beautiful. So wounded.   After being shuffled from one foster home to another growing up, Lena Benton dreamt of finding her prince charming. When the captivating Troy Harington sweeps her off her feet shortly after high school graduation, she's certain she's found her happiness. Unfortunately, Troy's true colors surface shortly after their marriage and things turn ugly. Lena only has one choice. She has to leave him. She has to run...   Lena's escape has brought her to Jackson, and he clearly wants to be there for her, but can she trust anyone again after what she's gone through? And will Jackson be able to help her heal without losing his heart?18+ due to sexual content and mature subject matter.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Abuse",
    "New Adult",
    "Amazon",
    "Adult"
  ],
  "author": "Susan Griscom",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/18459791-beautifully-wounded"
}