{
  "title": "Baking with Julia: Sift, Knead, Flute, Flour, and Savor...",
  "description": "Nothing promises pleasure more readily than the words \"freshly baked.\" And nothing says magnum opus as definitively as Baking with Julia, which offers the dedicated home cook, whether a novice or seasoned veteran, a unique distillation of the baker's art.Baking with Julia is not only a book full of glorious recipes but also one that continues Julia's teaching tradition. Here, basic techniques come alive and are made easily comprehensible in recipes that demonstrate the myriad ways of raising dough, glazing cakes, and decorating crusts. This is the resource you'll turn to again and again for all your baking needs. With Baking with Julia in your cookbook library, you can become a master baker.And there's no better time to be baking than now. Quality baking today is more varied, more exciting, and simply more authentic than ever before. Baking with Julia celebrates this tremendous range with enticing recipes that marry sophisticated European techniques to American tastes and ingredients. With creative flair, napoleons are layered with tropical fruits, pumpkin and cranberries are kneaded into bread doughs, and a tart is topped with sweet stewed onions. Along the way, step-by-step photographs demonstrate the basic building blocks of the pastry and bread baker's repertoire, and from this firm foundation fancy takes flight.Baking with Julia presents an extraordinary assemblage of talent, knowledge, and artistry from the new generation of bakers whose vision is so much a part of this book. The list of contributors reads like a Who's Who of today's master bakers, including Flo Braker, Steve Sullivan, Marcel Desaulniers, Nick Malgieri, Alice Medrich, Nancy Silverton, Martha Stewart, and a host of bright new talents such as Jeffrey Alford and Naomi Duguid.With nearly two hundred recipes, and half as many pages of tantalizing full-color photographs, this incomparable kitchen companion goes far beyond what most cookbooks offer. More than fifty pages of illustrated reference sections define basic terms and techniques, and explain the hows and whys of batters and doughs to take you effortlessly through the essential techniques. If you've never made flaky pie crust, your first no-fail experience is at hand. If you've never baked bread, that most satisfying and sensual pleasure awaits the turn of a page. With recipes for breads, pastries, cookies, and cakes—from chocolate to cheesecake, from miniature gems to multi-tiered masterpieces—this cookbook is a total immersion experience in the wonder of home baking.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Foodie",
    "Reference",
    "Culinary"
  ],
  "author": "Julia Child",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/184649.Baking_with_Julia"
}