{
  "title": "Enemy Among Us",
  "description": "Marcus Remalliond awakens on a hilltop overlooking a battle with a fuzzy head and an arrow embedded in his shoulder; he dispatches the archer who attacks him and begins to rush down to join the fray when it hits him, he doesn’t know which side he belongs to or even who he is!‘Enemy Among Us’ introduces the world of Larcurion, and the nations of Escrania and Traevinia. The war between the rival nations has been going on for nearly three centuries. Amid this backdrop of conflict, Marcus thrust into a world he can no longer remember.He encounters Nathan, a name from his past and self-professed best friend, who begins filling in some of the gaps. Nathan and Marcus begin the long return trek ‘home’ to Traevinia with the rest of the soldiers through wilderness, traverse the cursed mountain Nargonlythe, and encounter dangers and monsters of Traevinian myth along the way. Marcus begins to learn about Larcurion, and the two warring nations of Escrania and Traevinia: their histories, their religion, their conflicts.All the while, Marcus is struggling to reconnect with who he is; desperate to fit in. Something’s wrong though; some of Marcus’s memories coming to the surface don’t jibe with what he’s learning of who “he is”. He remembers a lost love, friends from his past, and bits and pieces that don’t seem to fit with what Nathan and the Traevinians are telling him. He was trained to be a weapon for the Traevinian king Keiten, to strike out at the heart of the nation of Escrania. He’ll spread chaos and fear along with the rest of his division- the Masks. This sounds right, but if that’s so, why does everything feel so strange to him?What’s true, where does he belong, and can he figure all of this out before it’s too late? What makes a hero, is it his past, or is it the choices he makes of his life? These are the questions that Marcus must answer for himself all while trying to stay alive.",
  "genres": [],
  "author": "Kevin  Hamilton",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/18464514-enemy-among-us"
}