{
  "title": "The Gardens of the Dead",
  "description": "A gripping new tale of intrigue from a “John le Carré in the making” (Daily Telegraph, London)  William Brodrick’s extraordinary new thriller, like its predecessor The Sixth Lamentation, focuses again on Father Anselm, a barrister turned monk who finds himself at the center of a mystery involving family, the long tentacles of deception and the healing power of retribution.  When Elizabeth Glendinning, Q.C., dies of heart failure while making a desperate phone call to the police, her colleagues and family are devastated and mystified. What was she doing in east London at the time of her death, and what was she trying to tell the police in her last phone call? After her funeral, her son, Nicholas, Inspector Cartwright, the officer she was trying to call, and Father Anselm, Elizabeth’s former colleague, all receive packages about a case from years earlier: Regina v. Riley. The package also includes mysterious newspaper clippings about the accidental drowning of John Bradshaw, who just happens to be the son of the principal witness in the case. Why is Elizabeth still following the case? And what does she want the three people to do with the information she has sent them?  The germ of the story lies in events that occurred many years earlier when Anselm Duffy, Q.C., had won a rather difficult case by asking a question of the key witness: the question, right in every aspect for winning the case, turns out to have been fatally, critically, the wrong one. The acquitted man wreaks havoc in a number of lives and his net finally enmeshes those who had so cleverly defended him in court. Anselm Duffy's own life is changed radically as he becomes aware of the full repercussions of his performance in court. His inner voice won't let him rest, finally nudging him to abandon the silk for the robe. It is Father Anselm, whose story is patterned on circumstances in the author's own life, who asks the riveting questions in the novel: What is justice? What is innocence? And what, ultimately, is evil? As Father Anselm’s begins to make sense of Elizabeth’s directives from her grave, as it were, he discovers the complexity of truth and its lethal power.  Psychologically complex and suspenseful, The Gardens of the Dead reveals the inner workings of the courts of England through the unfolding of a richly rewarding story, and through characters who become unforgettable in their struggles with evil and the possibility of redemption. BACKCOVER: Praise for The Gardens of the Dead “Brodrick…weaves exciting shadowy drama with deep characterization.” —GQ (UK)  “The Gardens of the Dead has gravity and grace, as well as a powerful atmosphere of creeping dread.” —Time out (UK)  “A tense and compelling investigation into a mystery that ends up with answers far more revealing and profound than appear in most thrillers.” —Gateway (UK)",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "British Literature",
    "Religion",
    "Historical Fiction",
    "Mystery Thriller"
  ],
  "author": "William Brodrick",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/184631.The_Gardens_of_the_Dead"
}