{
  "title": "A History of the American People",
  "description": "\"As majestic in its scope as the country it celebrates. [Johnson's] theme is the men and women, prominent and unknown, whose energy, vision, courage and confidence shaped a great nation. It is a compelling antidote to those who regard the future with pessimism.\"— Henry A. Kissinger Paul Johnson's prize-winning classic, A History of the American People , is an in-depth portrait of the American people covering every aspect of U.S. history—from politics to the arts. \"The creation of the United States of America is the greatest of all human adventures,\" begins Paul Johnson's remarkable work. \"No other national story holds such tremendous lessons, for the American people themselves and for the rest of mankind.\" In A History of the American People , historian Johnson presents an in-depth portrait of American history from the first colonial settlements to the Clinton administration. This is the story of the men and women who shaped and led the nation and the ordinary people who collectively created its unique character. Littered with letters, diaries, and recorded conversations, it details the origins of their struggles for independence and nationhood, their heroic efforts and sacrifices to deal with the 'organic sin’ of slavery and the preservation of the Union to its explosive economic growth and emergence as a world power. Johnson discusses contemporary topics such as the politics of racism, education, the power of the press, political correctness, the growth of litigation, and the influence of women throughout history. Sometimes controversial and always provocative, A History of the American People is one author’s challenging and unique interpretation of American history. Johnson’s views of individuals, events, themes, and issues are original, critical, and in the end admiring, for he is, above all, a strong believer in the history and the destiny of the American people.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Politics",
    "American",
    "Historical",
    "Reference"
  ],
  "author": "Paul  Johnson",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/184630.A_History_of_the_American_People"
}