{
  "title": "The Fall of the Governor: Part Two",
  "description": "The fourth book and epic finale to Robert Kirkman's New York Times bestselling series: The Walking Dead: The Fall of the Governor – Part Two!The Walking Dead original novel series, set in the universe of Robert Kirkman's iconic comic book, comes to a shattering conclusion with The Fall of the Governor – Part Two. From co-authors Kirkman, creator of the Eisner Award-winning comic as well as executive producer of AMC's blockbuster TV series, and Jay Bonansinga, Stoker Award-finalist and internationally acclaimed author, comes this stunning finale to their ambitious chronicle of human survival amid the plague of undead, which began with The Walking Dead: Rise of the Governor.In Rise of the Governor, uber-villain Philip Blake journeyed from his humble beginnings directly into the dark heart of the zombie apocalypse, and became the self-proclaimed leader of a small town called Woodbury. In The Road to Woodbury, an innocent traveler named Lilly Caul wound up in the terrifying thrall of Phillip Blake’s twisted, violent dictatorship within Woodbury’s ever tightening barricades. In The Fall of the Governor – Part One, Philip Blake finally revealed himself to be the true monster that he is, and the battle lines were drawn between the Governor and the desperate, beleaguered inhabitants of a nearby prison.Now, in The Fall of the Governor Part Two, the Governor’s dark journey reaches its shocking, heartrending conclusion. In a roller coaster finale, war breaks out, all of the plot lines from the previous three novels converge, tensions boil over into unthinkable mayhem, and the dark destinies of those few left standing are sealed in a series of stunning twists.",
  "genres": [
    "Horror",
    "Zombies",
    "Fiction",
    "Dystopia",
    "Post Apocalyptic",
    "Audiobook",
    "Fantasy"
  ],
  "author": "Robert Kirkman",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/18465522-the-fall-of-the-governor"
}