{
  "title": "Pole Position",
  "description": "*** The entire Awakening Sophy series is now available in Awakening Sophy: The Boxed Set Books 1-6 (Includes a Special Bonus Story) for the low price of $3.99 ***The Highly Anticipated Sequel to the Amazon Number 2 Best Seller Triple Delight!Best Selling Author Bianca James At Her Best!It was only intended to be a fun way to stay in shape. Nothing serious. At least that’s how it started, when Sophy first enrolled at the Pole Dancing school.Then an exhilarating offer to perform at an exclusive, underground Wall Street “Gentlemen’s” club is made. A once in a lifetime opportunity to do something many women secretly fantasize about but would never do, even if they did have the chance.Parker, the obscenely wealthy golden boy of Wall Street happens to be at the club that night and becomes enamored with Sophy from the moment he lays eyes on her. He can have his choice of women, but only one ignites the raw passion within him.At first, Sophy dismisses Parker’s generous proposal for a private performance. Then she starts to think about how she might make the most of the opportunity to fulfill yet another deeply erotic fantasy.Another smoking hot, erotic and sex charged story from Amazon Best-Selling erotica author, Bianca James.Although this is Part Four of a series, the books can be read in any order. Stranger Addiction (Part One) is available for a limited time, at only 99 cents<br>Here’s what a few of readers had to say about Stranger Addiction …Sizzling hot!!!!\" 5 Stars - Goodreads\"One of those short, hot secret books you sneak in every once in a while. I really liked it but don't tell anybody.\" 4 Stars - Goodreads\"I loved this. It's really classy erotica with well rounded characters and a super plausible plot.\" 5 Stars - Amazon Review\"This story took me to a place in my mind that you will want to be. Can't wait for the next book.\" 5 Stars - Amazon Review** Warning: This highly erotic, 16,500 word story, is suitable for adults only (18+) as it contains many explicit sex scenes between consenting adults, sex fantasies, graphic language, elements of BDSM, oral sex, spanking, rough sex and anal play **",
  "genres": [],
  "author": "Bianca  James",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/18467106-pole-position"
}