{
  "title": "High as the Horses' Bridles",
  "description": "A Washington Post Top 50 of 2014 Fiction pickA Wall Street Journal Book of the Year, selected by Phil KlayElectric Literature 2014: Year of the DebutA Largehearted Boy Favorite Novel of 2014Slaughterhouse 90210's Most Rapturous Book of 2014Vol. 1 Brooklyn A Year of Favorites: Jason Diamond picksCalled \"powerful and unflinching\" by Column McCann in The New York Times Book Review, \"something of a miracle\" by Ron Charles in the Washington Post, and named a must read by The Millions, Time Out, New York Magazine, and Grantland; Scott Cheshire's debut is a \"great new American epic\" (Philipp Meyer) about a father and son finding their way back to each other.\"Deeply Imagined\"—The New York Times / \"Daring and Brilliant\"—Ron Charles, Washington Post / \"Vivid\"—Elle / \"One of the finest novels you will read this year.\"—FlavorwireIt's 1980 at a crowded amphitheater in Queens, New York and a nervous Josiah Laudermilk, age 12, is about to step to the stage while thousands of believers wait to hear him, the boy preaching prodigy, pour forth. Suddenly, as if a switch had been flipped, Josiah's nerves shake away and his words come rushing out, his whole body fills to the brim with the certainty of a strange apocalyptic vision. But is it true prophecy or just a young believer's imagination running wild? Decades later when Josiah (now Josie) is grown and has long since left the church, he returns to Queens to care for his father who, day by day, is losing his grip on reality. Barreling through the old neighborhood, memories of the past--of his childhood friend Issy, of his first love, of the mother he has yet to properly mourn--overwhelm him at every turn. When he arrives at his family's old house, he's completely unprepared for what he finds. How far back must one man journey to heal a broken bond between father and son?In rhapsodic language steeped in the oral tradition of American evangelism, Scott Cheshire brings us under his spell. Remarkable in scale--moving from 1980 Queens, to sunny present-day California, to a tent revival in nineteenth century rural Kentucky--and shot-through with the power and danger of belief and the love that binds generations, High as the Horses' Bridles is a bold, heartbreaking debut from a big new American voice.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Literature",
    "American",
    "Religion",
    "Historical Fiction"
  ],
  "author": "Scott Cheshire",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/18465587-high-as-the-horses-bridles"
}