{
  "title": "My Lunches with Orson: Conversations between Henry Jaglom and Orson Welles",
  "description": "Based on long-lost recordings between Orson Welles and Henry Jaglom, My Lunches with Orson presents a set of riveting and revealing conversations with America's great cultural provocateur.There have long been rumors of a lost cache of tapes containing private conversations between Orson Welles and his friend the director Henry Jaglom, recorded over regular lunches in the years before Welles died. The tapes, gathering dust in a garage, did indeed exist, and this book reveals for the first time what they contain.Here is Welles as he has never been seen before: talking intimately, disclosing personal secrets, reflecting on the highs and lows of his astonishing career, the people he knew―FDR, Winston Churchill, Charlie Chaplin, Marlene Dietrich, Laurence Olivier, David Selznick, Rita Hayworth, and more―and the many disappointments of his last years. This is the great director unplugged, free to be irreverent and worse―sexist, homophobic, racist, or none of the above― because he was nothing if not a fabulator and provocateur. Ranging from politics to literature to the shortcomings of his friends and the many films he was still eager to launch, Welles is at once cynical and romantic, sentimental and raunchy, but never boring and always wickedly funny.Edited by Peter Biskind, America's foremost film historian, My Lunches with Orson reveals one of the giants of the twentieth century, a man struggling with reversals, bitter and angry, desperate for one last triumph, but crackling with wit and a restless intelligence. This is as close as we will get to the real Welles―if such a creature ever existed.",
  "genres": [
    "Film",
    "Nonfiction",
    "Biography",
    "Media Tie In",
    "History",
    "Memoir",
    "Biography Memoir"
  ],
  "author": "Peter Biskind",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/18465511-my-lunches-with-orson"
}