{
  "title": "Uncertain Justice: The Roberts Court and the Constitution",
  "description": "Harvard Law School scholars Laurence Tribe and Joshua Matz reveal how Chief Justice John Roberts is shaking the foundation of our nation’s laws in Uncertain The Roberts Court and the Constitution .From Citizens United to its momentous rulings regarding Obamacare and gay marriage, the Supreme Court under Chief Justice John Roberts has profoundly affected American life. Yet the court remains a mysterious institution, and the motivations of the nine men and women who serve for life are often obscure. Now, in Uncertain Justice , Laurence Tribe and Joshua Matz show the surprising extent to which the Roberts Court is revising the meaning of our Constitution.Political gridlock, cultural change, and technological progress mean that the court’s decisions on key topics―including free speech, privacy, voting rights, and presidential power―could be uniquely durable. Acutely aware of their opportunity, the justices are rewriting critical aspects of constitutional law and redrawing the ground rules of American government. Tribe―one of the country’s leading constitutional lawyers―and Matz dig deeply into the court’s rulings, stepping beyond tired debates over judicial “activism” to draw out hidden meanings and silent battles. The undercurrents they reveal suggest a strikingly different vision for the future of our country, one that is sure to be hotly debated.Filled with original insights and compelling human stories, Uncertain Justice illuminates the most colorful story of all―how the Supreme Court and the Constitution frame the way we live.“Marvelous…Tribe and Matz’s insights are illuminating…. [They] offer well-crafted overviews of key cases decided by the Roberts Court … [and] chart the Supreme Court’s conservative path, clarifying complex cases in accessible terms.”― The Chicago Tribune“Well-written and highly readable…The strength of the book is its painstaking explanation of all sides of the critical cases, giving full voice and weight to conservative and liberal views alike.”― The Washington Post",
  "genres": [
    "Nonfiction",
    "Politics",
    "Law",
    "History",
    "Audiobook",
    "Political Science",
    "United States"
  ],
  "author": "Laurence H. Tribe",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/18465581-uncertain-justice"
}