{
  "title": "The Black Eagle Inn",
  "description": "The Black Eagle Inn is an old established restaurant and part of a family farm business in the sleepy Bavarian countryside outside of Heimkirchen. Childless Anna Stockmann has fought hard to make it her own and keep it running through WWII. The family is divided by rivalry between family members since her own youth but at the heart of this story one of Anna’s nephews, Markus, owns her heart and another nephew, Lukas, owns her ear, while her husband Herbert is still missing-in-action. Religion dictates life in Heimkirchen's enclosed Catholic community that was almost unaffected by the fighting in the war. Anna’s brother Hans-Ulrich is involved in the church as well as in post war party politics. He finds that the new generation, his own off spring, are not functioning as well as the older one would like. Bitter conflicts arise in the new forming Germany and the family members all need to decide how to respond to the challenges ahead. How does a Nation recover from its collective shame, how does it rebuild itself into a modern state and deal with its horrendous past and the difficult path ahead? Restructuring of the political landscape & the influence of religion are strong themes in this historical family saga & post war drama set in Germany 1940 - 1976. This is war fiction without immediate war, it is literary history about Germany after the Nazi rule with gay, racial, religious and feminist themes, describing the way one family experiences the forward move of a shamed Nation. Fischer tells a great family saga with war in the far background and weaves the political and religious into the personal with belated or indirect impact of war on people.",
  "genres": [
    "Historical Fiction",
    "Germany",
    "Politics",
    "Religion",
    "World History",
    "Historical",
    "World War II"
  ],
  "author": "Christoph Fischer",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/18468588-the-black-eagle-inn"
}