{
  "title": "Love Reborn",
  "description": "Nanach, a three and a half thousand year old vampire, is part of an ancient Council in charge of guiding and protecting humanity throughout the ages. While the vampires manage to survive by taking a little from many, they are strictly forbidden to kill any of their victims, unless sanctioned by The Council. Soon Nanach learns that her true love has once again been reborn into this world and immediately rushes to his side—only to discover that he is an aging rock star whose presence has been hidden from her for years by an unknown enemy. Having lost her love to death so many times in the past, from his murder during battle in ancient Egypt to his execution during the Spanish Inquisition to his succumbing to the plague following the French Revolution, Nanach is determined to ensure they are together this time...forever. But there is an ancient force that threatens Nanach's eternal happiness—a force that has systematically wiped out all those closest to her since the time of her vampiric turning. Can Nanach find and destroy her enemy before her love succumbs to death once again?Each and every single one of those encounters ends with his untimely death, through the manipulation of an unidentified foe. She still has to discover the who or why of it all, so when her long time associate, P, shows his deformed face, she is sure glad to see him.Dave, then again, is experiencing troubles of his own. His marriage is on the brink of breaking up when into his life walks this beautiful woman, available and to say willing would be a blunt understatement. On top of it all it turns out she is one of the undead (though when he dares to call her that she is more than a little annoyed).Meeting his true love should have subsequently resulted in the onset of eternal happiness, but the introduction of this splendid creature is followed by that of her blood thirsty, power mad pursuers, who are not only out to spoil his latest gig in London, but to end his life in the nastiest possible way.Some of the newly united couple’s oldest Egyptian allies turn out to hold a very ancient grudge indeed. During their centuries long pursuit of Nanach and Dave, they have managed to set powerful forces to their hand and slaughtered anyone crossing their path without impunity. This time Nanach and her companions come very close to buckling under their enemy’s malice, if it were not for their one flaw, their own conceit.",
  "genres": [],
  "author": "Tamara Zeegers",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/18469800-love-reborn"
}