{
  "title": "Into Hertfordshire",
  "description": "Enter the world of Fitzwilliam Darcy, landed gentleman, scholar, and very eligible bachelor, whose engaging and enthusiastic friend, Mr. Bingley, has acquired a new manor. Darcy accompanies his friend into the wilds of Hertfordshire, where each of them encounters the lady who will change his life. Follow the beginnings of a story that will take Darcy from the heights of wealth and status, to the depths of pain and self-condemnation, and, ultimately, to the safe haven of the love and respect of his heart’s mistress.This lovingly crafted companion to Jane Austen’s Pride and Prejudice will give her fans a feeling of homecoming, and a chance to see this beloved story from a new perspective, all the while immersed in the endearing world of Regency England Austen so masterfully created. Darcy’s Tale was written first for the readers who were enchanted by the original and wanted the chance to return, to learn more about one of the most popular characters in English literature. But it is also for those new to the Pride & Prejudice saga: Darcy was a wealthy, well-intentioned, intelligent, and educated man; how on Earth did he become so thoroughly tangled by his acquaintance with Miss Elizabeth Bennet? She, too, is among that rarefied firmament of favourite English characters: her pert manners, quick wit, and quiet beauty made her a strong, independent figure of a woman who was over a hundred years ahead of her time. The clash of their personalities and the nearly constant misunderstanding between them, founded on an unfortunate first impression, has delighted readers for two hundred years.This, then, is a new view of their first year as seen through Darcy’s eyes, and written by a man who insisted both that Darcy should be true to Austen’s vision of him, and that he should be a man throughout: wrong, perhaps at times, but always prepared to stand up and do what he saw as necessary and right, especially when he found himself to be in the wrong.Darcy’s Tale is written in the richly textured style of Regency English, and even the most demanding Austen fan will find little here to cavil with—but they will certainly find many new thoughts, perceptions, and interpretations to revel in.Volume 1 takes Darcy to Hertfordshire and the beginnings of his relationship with Elizabeth. In Volume 2: Into Kent, the two meet again at Rosings, the estate of Darcy’s Aunt Catherine. In Volume 3: Back Home, Darcy’s many trials and labours are concluded, and he finds his true place in life, at last.",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Regency",
    "Fiction",
    "Historical",
    "Historical Romance",
    "Retellings"
  ],
  "author": "Stanley Michael Hurd",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/18470455-into-hertfordshire"
}