{
  "title": "Papyrus: The Plant that Changed the World: From Ancient Egypt to Today's Water Wars",
  "description": "At the center of the most vital human-plant relationship in history, Papyrus evokes the mysteries of the ancient world while holding the key to the world's wetlands and atmospheric stability. From ancient Pharos to 21st Century water wars, papyrus is a unique plant that is still one of the fastest growing plant species on earth. It produces its own \"soil\"-a peaty, matrix that floats on water-and its stems inspired the fluted columns of the ancient Greeks. In ancient Egypt, the papyrus bounty from the Nile delta provided not just paper for record keeping-instrumental to the development of civilization-but food, fuel and boats. Disastrous weather in the 6th Century caused famines and plagues that almost wiped out civilization in the west, but it was papyrus paper in scrolls and codices that kept the record of our early days and allowed the thread of history to remain unbroken. The sworn enemy of oblivion and the guardian of our immortality it came to our rescue then and will again.Today, it is not just a curious relic of our ancient past, but a rescuing force for modern ecological and societal blight. In an ironic twist, Egypt is faced with enormous pollution loads that forces them to import food supplies, and yet papyrus is one of the most effective and efficient natural pollution filters known to man. Papyrus was the key in stemming the devastation to the Sea of Galilee and Jordan River from raging peat fires (that last for years), heavy metal pollution in the Zambezi River Copperbelt and the papyrus laden shores of Lake Victoria-which provides water to more than 30 million people-will be crucial as the global drying of the climate continues. 8 page insert, illustrations throughout.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Nature",
    "Plants",
    "Egypt",
    "Biology"
  ],
  "author": "John Gaudet",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/18476767-papyrus"
}