{
  "title": "Providence",
  "description": "The eldest of ten children on a dirt-poor farm, Becky trudges through life as a full-time babysitter, trying to avoid her father's periodic violent rages. When the family's barn burns down, her father lays the blame on Becky, and her own mother tells her to run for it. Run she does, hopping into an empty freight car. There, in a duffel bag, Becky finds an abandoned baby girl, only hours old. After years of tending to her siblings, sixteen-year-old Becky knows just what a baby needs. This baby needs a mother. With no mother around, Becky decides, at least temporarily, this baby needs her. When Becky hops off the train in a small Georgia town, it's with baby \"Georgia\" in her arms. When she meets Rosie, an eccentric thrift-shop owner, who comes to value and love Becky as no one ever has, Becky rashly claims the baby as her own. Not everyone in town is as welcoming as Rosie, though. Many suspect Becky and her baby are not what they seem. Among the doubters is a beautiful, reclusive woman with her own terrible loss and a long history with Rosie. As Becky's life becomes entangled with the lives of the people in town, including a handsome boy who suspects Becky is hiding something from her past, she finds her secrets more difficult to keep. Becky should grab the baby and run, but her newfound home and job with Rosie have given Becky the family she's never known. Despite her guilt over leaving her mother alone, she is happy for the first time. But it's a happiness not meant to last. When the truth comes out, Becky has the biggest decision of her life to make. Should she run away again? Should she stay--and fight? Or lie? What does the future hold for Becky and Georgia? With a greatness of heart and a stubborn insistence on hope found in few novels of any genre, Providence proves that home is where you find it, love is an active verb, and family is more than just a word.\"When 16-year-old Becky Miller rescues an abandoned newborn, a nontraditional family is born, attracting other warm-hearted women into its folds. Reading Providence is like cozying up with longtime friends in front of a homey fire.\" -- Sherry Shahan , author of Skin and Bones (Albert Whitman & Co.)\"A beautifully written tale about trying to make the right choice when there might not be one.\" -- Wendy Mass , author of A Mango-Shaped Space (Little Brown Books for Young Readers)",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Fiction",
    "Coming Of Age",
    "Teen",
    "Realistic Fiction",
    "Romance"
  ],
  "author": "Lisa Colozza Cocca",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/18475525-providence"
}