{
  "title": "Come Undone",
  "description": "The daughter of a rock legend, Layla Prince doesn’t want to be involved in the music scene. She grew up around it, and it’s caused her nothing but heartbreak. But when her roommate, and self-professed Sensible Overdrive groupie, begs her to go to one of the band’s local shows, Layla agrees. After all, it’s just one night. Just a few hours and then she can return to finals and trying to come up with an excuse to stay the hell away from home this summer.But the moment Jude Logan, Sensible Overdrive’s gorgeous front man, does his customary pull-an-audience-member-on-stage move, Layla is screwed. Because he picks her, and when he shoves a mic under her lips, she messes up—instead of telling him to piss off, she sings. And Jude discovers that she's exactly what he's been looking for. Now, Jude wants her. Not for his bed but for his band—at least until after the summer and he’s attracted a new label. Realizing this is the temporary escape she desperately needs, Layla agrees to spend summer break with Sensible Overdrive, but with a warning: her being with the band doesn’t mean she’s . . . \"with\" the band. Still, as much as she attempts to convince herself that she doesn’t give two effs about Jude, or his band, or who he screws, or the way he looks on stage without his shirt on, Layla finds herself being dragged into the very scene she’s tried so hard to stay away from. And though she and Jude have promised that their relationship is nothing but professional, the attraction between them is unavoidable, lyrical—and it’s too damn impossible to resist. When the music is over, will Layla be able to go back to who she was, to life without Jude Logan? Or has she come completely undone?COME UNDONE is a New Adult contemporary novel that's recommended for 17+. It will be released in December 2013.",
  "genres": [
    "New Adult",
    "Romance",
    "Adult",
    "Contemporary Romance",
    "Contemporary",
    "Music"
  ],
  "author": "Mila Hale",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/18475524-come-undone"
}