{
  "title": "Changing His Game",
  "description": "*Warning: Changing His Game is a stand-alone novel. This book is for mature readers ages 18 and up. It contains sex, sex, and more sex with a porn star. It briefly touches on M/F/M and M/F/F. Adult Films. XXX Movies. Porn.These are the kind of movies I've never planned to watch. It was a taboo topic where I grew up. As a kid I had only heard of it in passing. In middle school my parents would talk about my creepy uncle Frank and how he should look for a job instead of watching \"those movies\" all day. In High School boys thought it was funny to ask my friends and me to star in the amateur adult films they were making. In college most of my guy friends watched them, but I never had. When I moved to California that changed.After surprising my fiancé at home and catching him screwing another woman, I hopped in my car and started driving. I was running away from my old life and I needed a change. I remembered my friend Tawny inviting me to visit her in Los Angeles, so that's where I went.I didn’t find Tawny when I got there, but I did find her gorgeous roommate, Jared. Our friendship started out rough, but he gave me a place to stay and helped me get back on my feet. He became my best friend. My best friend who millions of women happened to lust over.Jared plays by a different set of rules, where anything goes. His lifestyle is unlike anything I’ve ever witnessed before and it scares me. When you live your life on the edge, eventually you'll fall over. I didn't want to see that happen to him.At night he’s just Jared, my Jared, and I’ll deny it to anyone who asks, but I’m completely in love with him. During the day he’s Brandon Boner, and the world is in love with him.Oh yeah, did I mention he’s a porn star?",
  "genres": [
    "Romance",
    "Erotica",
    "New Adult",
    "Contemporary Romance",
    "Contemporary",
    "Menage",
    "Friends To Lovers"
  ],
  "author": "Justine Elvira",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/18480475-changing-his-game"
}