{
  "title": "Dangerous Creatures",
  "description": "Dangerous Creatures is a new series set in the world of the #1 bestselling Beautiful Creatures series (NOW A MAJOR FILM) by Kami Garcia and Margaret Stohl.Some loves are cursed . . . others are dangerous.Ridley Duchannes will be the first to tell you that she's a bad girl. She's Dark. She's a Siren. You can never trust her, or even yourself when she's around. Lucky for her, Wesley 'Link' Lincoln can never seem to remember that; quarter Incubus or not, his heart is Mortal when it comes to Ridley. When Link heads to New York City to start a music career, Ridley goes along for the ride-and she has her own reasons. As if leaving small-town Gatlin for the big city, trying to form a band, and surviving life with a partially reformed Siren isn't hard enough already, Link soon learns he has a price on his head that no Caster or Mortal can ever pay.Kami Garcia and Margaret Stohl are back and casting another magical spell. Their signature mixture of mystery, suspense, and romance, along with a dash of fun and danger, will pull fans in and leave them begging for more.Praise for The Beautiful Creatures 'Watch out Twilight and Hunger Games' The Guardian'Move over Twilight, there's a new supernatural saga in town.' E!'A hauntingly delicious dark fantasy' - Cassandra Clare, New York Times bestselling author of City of Bones'Gorgeously crafted, atmospheric, and original' Melissa Marr, New York Times bestselling author of Wicked Lovely'Smart, textured and romantic' Kirkus Reviews'This novel has been generating Twilight-level buzz.' Teen VogueAbout the Kami Garcia (@kamigarcia) and Margaret Stohl (@mstohl) are the authors of the New York Times bestselling Beautiful Creatures Beautiful Creatures, Beautiful Darkness, Beautiful Chaos, and Beautiful Redemption. Kami and Margie live with their families in Maryland and Los Angeles, respectively. They invite you to visit them online at www.beautifulcreaturesthebook.comAvailable in The Beautiful Creatures Beautiful Creatures (Book 1)Beautiful Darkness (Book 2)Beautiful Chaos (Book 3)Beautiful Redemption (Book 4)Exclusive ebook novellas Dream DarkDangerous Dream",
  "genres": [
    "Young Adult",
    "Fantasy",
    "Paranormal",
    "Romance",
    "Magic",
    "Supernatural",
    "Fiction"
  ],
  "author": "Kami Garcia",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/18478946-dangerous-creatures"
}