{
  "title": "Novels, 1926-1929",
  "description": "The Library of America edition of the novels of William Faulkner culminates with this volume presenting his first four, each newly edited, and, in many cases, restored with passages that were altered or (in the case of Mosquitoes) expurgated by the original publishers. This is Faulkner as he was meant to be read.In these four novels we can track Faulkner's extraordinary evolution as, over the course of a few years, he discovers and masters the mode and matter of his greatest works. Soldiers' Pay (1926) expresses the disillusionment provoked by World War I through its account of the postwar experiences of homecoming soldiers, including a severely wounded R.A.F. pilot, in a style of restless experimentation. In Mosquitoes (1927), a raucous satire of artistic poseurs, many of them modeled after acquaintances of Faulkner in New Orleans, he continues to try out a range of stylistic approaches as he chronicles an ill-fated cruise on Lake Pontchartrain.With the sprawling Flags in the Dust (published in truncated form in 1929 as Sartoris), Faulkner began his exploration of the mythical region of Mississippi that was to provide the setting for most of his subsequent fiction. Drawing on family history from the Civil War and after, and establishing many characters who recur in his later books, Flags in the Dust marks the crucial turning point in Faulkner's evolution as a novelist.The volume concludes with Faulkner's masterpiece, The Sound and the Fury (1929). This multilayered telling of the decline of the Compson clan over three generations, with its complex mix of narrative voices and its poignant sense of isolation and suffering within a family, is one of the most stunningly original American novels.",
  "genres": [
    "Fiction",
    "American",
    "Classics",
    "Literature",
    "Novels",
    "20th Century"
  ],
  "author": "William Faulkner",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/10976.Novels_1926_1929"
}