{
  "title": "El retorno de Gryal",
  "description": "Gryal, joven capitán de la Milicia de Barcelona, mantenía unidilio secreto con Lorette de Castilla, la hija de su general.Sin embargo, el romance se truncó cuando Gryal fue traicionado por sus superiores y enviado a una misión suicida en el Norte de Italia. Allí, en una aldea bárbara llamada Pueblo Rojo, la bruja Zahameda debía terminar con su vida; pero Gryal escapó para sufrir una terrible maldición: dormir de día y despertar de noche, incapaz de ver de nuevo la luz del sol. Aunque ni siquiera la maldición frenó suanhelo, al enfrentar grandes peligros y vivir emocionantes aventuras con tal de reunirse con su amada.Hoy, casi dos años después de su desaparición, el arduo viaje continúa, pero ya nadie duda de su supervivencia. Se le conoce como El Amante de la Luna y sus rivales le dan caza por temor a su regreso. Cazarecompensas, milicianos y otros enemigos siguen su rastro, y en Barcelona tiembla el joven general Fortuna, enamorado también de Lorette y presa de la envidia que siente por Gryal. Nada detiene al maldito,acompañado de sus amigos Ergon, Perla y Barramar, y de su temible y leal manada de lobos.El retorno de Gryal, de Jordi Balaguer, cierra con brillo «El Amante de la Luna», la saga histórico-fantástica más original de la reciente narrativa hispana, y dibuja un épico punto fi nal en la peripecia de cada uno de sus múltiples personajes. Una trama coral de magia y envidia, lucha y sangre; un relato cargado de aventuras, amor y traición.Lo que se ha dicho de La maldición de Gryal (el amante de la luna libros I y II):El libro que cierra la saga histórico-fantástica más original de la reciente narrativa hispana.«El autor desarrolla un mecanismo de vigorosoritmo que ayuda a que las páginas vuelen entre nuestros dedos... La lírica es sobresaliente y un obsequio para los sentidos.» Fantasymundo «Una fantasía épica más que recomendable, que bebe de novelas clásicas de aventuras, con todo lo que hace grande a este tipo de novelas (...) El libro es una maravilla, lleno de lirismo, sentimientos y pasiones a raudales.» La espada en la tinta «Toro Mítico nos trae una fantástica aventura épica, con saborcillo a las series de antes, a caballo entre La Princesa Prometida, Lady Halcón y Los Tres Mosqueteros.»Paperblog «La habilidad e imaginación de Jordi Balaguer despuntan y sorprenden gratamente, pergeñando una historia contundente a la vez que novedosa. Esa savia nueva tan difícil de encontrar hoy en día.»Alberto García Arocas",
  "genres": [],
  "author": "Jordi Balaguer",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/18484493-el-retorno-de-gryal"
}