{
  "title": "The Groundbreaking",
  "description": "Nine lives. Nine stories. One last, best hope. But will they find it in time? The introductory volume to the Love Under Construction Series, this quick read introduces you to the major characters in the series. The books within the series are not stand-alone, and reading this one will help the reader understand them better. All other books in this series are full-length novels. This volume is free!Meet the Walters family of Louisville, Kentucky, and their extended family and friends. This introductory volume introduces the reader to the major characters in the series and gives some insight into what makes them who they are in a series of vignettes from their pasts. From Tony, the owner of the family construction business who's still dealing with his mentally-unstable ex-wife, to Steve, his attorney who also owns a security firm (and a BDSM club too) while he holds everyone at arms-length, to a widow, Nikki, who thinks her life is pretty well over, there's plenty of drama, fun, and white-hot, sex-filled romance to keep readers entertained for hours. There's Kelly, working in the insurance industry while no one knows her past; Jose, a former cage fighter-turned-personal security specialist; and Molly, a woman spurned in the worst of ways. Laura's clothes cover a painful secret that could get her killed, and Peyton, the wholesome boy next door, struggles with an injury from his service in Kandahar. And don't forget Vic, Tony's cousin and the manager of the construction company's Lexington office, who's six feet and eight inches of the hottest Italian the United States was lucky enough to find on their shores. This introductory work introduces readers to the major characters in the series and is a quick read; the four volumes to follow are full-length novels. None of the volumes are stand-alone and are written to be read in order to get the most enjoyment from them. Use The Groundbreaking as your portal - jump in and find out who lives, who dies, and who finds the love of their life. It's a rollicking good time, between the sheets and out!",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Deanndra Hall",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/18486675-the-groundbreaking"
}