{
  "title": "William Faulkner: Novels 1942–1954",
  "description": "The years 1942 to 1954 saw William Faulkner’s rise to literary celebrity—sought after by Hollywood, lionized by the critics, awarded a Nobel Prize in 1950 and the Pulitzer and National Book Award for 1954. But, despite his success, he was plagued by depression and alcohol and haunted by a sense that he had more to achieve—and a finite amount of time and energy to achieve it.This Library of America volume collects the novels written during this crucial period; defying the odds, Faulkner continued to break new ground in American fiction. He delved deeper into themes of race and religion and furthered his experiments with fictional structure and narrative voice. These newly restored texts, based on Faulkner’s manuscripts, typescripts, and proof sheets, are free of the changes introduced by the original editors and are faithful to the author’s intentions.Go Down, Moses (1942) is a haunting novel made up of seven related stories that explore the intertwined lives of black, white, and Indian inhabitants of Yoknapatawpha County. It includes “The Bear,” one of the most famous works in all American fiction, with its evocation of “the wilderness, the big woods, bigger and older than any recorded document.”Characters from Go Down, Moses reappear in Intruder in the Dust (1948). Part detective novel, part morality tale, it is a compassionate story of a black man on trial and the growing moral awareness of a southern white boy.Requiem for a Nun (1951) is a sequel to Sanctuary. With an unusual structure combining novel and play, it tells the fate of the passionate, haunted Temple Drake and the murder case through which she achieves a tortured redemption. Prose interludes condense millennia of local history into a swirling counterpoint.In A Fable (1954), a recasting of the Christ story set during World War I, Faulkner wanted to “try to tell what I had found in my lifetime of truth in some important way before I had to put the pen down and die.” The novel, which earned a Pulitzer Prize, is both an anguished spiritual parable and a drama of mutiny, betrayal, and violence in the barracks and on the battlefields.",
  "genres": [
    "Fiction",
    "American",
    "Literature",
    "Classics",
    "20th Century",
    "Novels",
    "Collections"
  ],
  "author": "William Faulkner",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/10980.William_Faulkner"
}