{
  "title": "Left for Dead: A Young Man's Search for Justice for the USS Indianapolis",
  "description": "For fans of sea battles, adventures, and war stories like Unbroken , this is the incredible true story of a boy who helps to bring closure to the survivors of the tragic sinking of the USS Indianapolis, and helps exonerate the ship’s captain fifty years later. Hunter Scott first learned about the sinking of the USS Indianapolis by watching the movie Jaws when he was just eleven-years-old. This was fifty years after the ship had sunk, throwing more than 1,000 men into shark-infested waters—a long fifty years in which justice still had not been served.                It was just after midnight on July 30, 1945 when the USS Indianapolis was torpedoed by a Japanese submarine. Those who survived the fiery sinking—some injured, many without life jackets—struggled to stay afloat as they waited for rescue. But the United States Navy did not even know they were missing. As time went on, the Navy needed a scapegoat for this disaster. So it court-martialed the captain for “hazarding” his ship. The survivors of the Indianapolis knew that their captain was not to blame. For fifty years they worked to clear his name, even after his untimely death.But the navy would not budge—not until Hunter entered the picture. His history fair project on the Indianapolis soon became a crusade to restore the captain’s good name and the honor of the men who served under him.Praise for Left for Dead :Christopher Award WinnerAn ALA-YALSA Best Nonfiction for Young Adults Book“Compelling, dreadful, and amazing.”— VOYA “This exciting, life-affirming book about war heroics and justice . . . proves without question the impact one student can have on history.”— Booklist“Well written and well documented … this excellent presentation fills a void in most World War II collections “— School Library Journal “Young readers . . . will no doubt be inspired by the youth’s tenacity—and by the valor of those who served on the Indianapolis .”— The Horn Book",
  "genres": [
    "Nonfiction",
    "History",
    "World War II",
    "War",
    "School",
    "Historical",
    "Biography"
  ],
  "author": "Pete Nelson",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/109802.Left_for_Dead"
}