{
  "title": "Godbothering",
  "description": "Justice is blind … and therefore, it misses much.When Kaya Rae Smyth, Private First Class, comes home from Iraq in a casket with a suicide label, her mother raises a host of objections. The details are damning – a right-handed shot from a left-handed woman, evidence callously destroyed, hints of a cover-up – but the army plays dumb. The Feds refuse to get involved. The media isn’t interested.But there’s still someone Sharon Smyth can Ask for help.Three someones, in fact.I.No one in Seattle’s Chinatown knows that Lei Gong is over a thousand years old; he keeps a quiet import shop that deliberately discourages customers, and utterly conceals his true nature. In his boyhood, the gods ordained him to pursue and punish all who are guilty of undetected transgressions – but with the help of an Iranian astrologer, he’s learned enough strength and magic to refuse the Asking.II.Balthazar the astrologer is older still. In millennia past he paid tribute to the Christ child, and calculated the intent of the stars for kings. Later, the church called him a saint – a discoverer of hidden knowledge, but today he works as a lawyer, moonlighting out of St. Mary’s University in San Antonio, Texas. Between the classes he teaches, he toils to free those unjustly imprisoned as part of the Rendition project, a thankless and endless task that confounds even his considerable powers.III.Last and most terrible of all is Alecto, a fury whose wrath once ended the world. (As she’ll be the first to tell you, it was utterly exhausting.) Now she hides in obscurity, diving for sponges in Tarpon Springs, Florida, and lazily flirting with tourists while she listens to the old men gossip in Greek. It’s much more pleasant than upending the universe.* * *Perhaps it is sympathy that compels Lei Gong to send the grieving mother to Alecto. Perhaps it is madness, or perhaps he’s not so immune to the Asking as he believes; but when Sharon Smyth appears in his shop and demands justice, his attempt to turn her away only partly succeeds. The woman leaves with half an envelope, and scrawled on the back is the fury’s name and location.But an eye for an eye, and the world goes blind…",
  "genres": [],
  "author": "Cherie Priest",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/18489451-godbothering"
}