{
  "title": "Lamia: A Witch",
  "description": "In this rich, stunningly erotic novel, it is 16th-century France, where Lamia, a beautiful and passionate witch, lives as an outcast—shunned and feared by the world. Her mother was burned at the stake, and though her father is said to be the devil, he will not be able to save her from the Holy Church’s threat of fiery death.But in the arcane world of alchemy and medieval magic that casts strange spells, destiny brings Lamia three powerful patrons. Enchanted by her spirit and aroused by her erotic charm, they become her devoted servants and determined protectors: Marco Cellini, a wealthy Italian merchant, has a hoard of gold that is matched only by his knowledge of the dark arts. Giles de Sade, a young French nobleman, is willing to betray his class and his conscience to make her his. And Ghanim, a handsome Moor, has experiences in the occult that extend to making magical love to her.Together, Lamia and her trio of entranced admirers must brave the perils and persecutions of a pitiless Church and a superstitious world to shield her from being pressed closer and closer to the flames. But ultimately it is the strength of her own courage and supernatural skills, and the enticements of her infinitely seductive sexuality that must tip the balance in the struggle between accursed Good and blessed Evil. It is a struggle that Lamia will do anything to win, not only to save herself, but to wreak the ultimate vengeance on those who would destroy her and all her kind.In this romantic, imaginative work, as spellbinding as the netherworld novels of Anne Rice, Georgia Taylor takes us deep into a long-lost dark age. And in Lamia, wild, wicked, and demonically desirable, she has created a heroine who takes her place as the most irresistibly attractive enchantress ever to cast her singular spell on the reader. Filled with rich historical atmosphere, superbly drawn characters, deeds of high adventure, sultry sensuality, and chilling suspense, this dazzling tour de force bewitches.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Fantasy"
  ],
  "author": "Georgia Taylor",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/1848757.Lamia"
}