{
  "title": "Death: Been There. Done That.",
  "description": "What happens to us when we die? This is THE SINGLE question that Every human being ponders once they have the capability to contemplate! Do we have an actual soul? Is there truly a Heaven and a hell? If so, how do we get to Heaven? How do we avoid hell? What is the purpose of this life? Of the myriad of faiths, how do we know which one to choose?!... There are countless factors throughout life that can, and do, determine peoples' stance regarding this matter. When there are people scattered all over this earth who have an unyielding conviction for their beliefs, who is right and who is wrong?... In the end, no one will know these answers until The End of their life story. Therefore, faith is what it comes down to. Well, this is true for the majority of those who are living. The majority. After all, there are a handful of Blessed souls who have been given a second chance! August 18th, 2001, I died in a motorcycle wreck. I Thank God Every Day for bestowing the Wisdom to me that He did!... I urge you to pay close attention to what I tell you here! You Do go to one or the other of those ETERNAL destinations after you cease to live in your mortal body! You could say that I was given the answer key to life. That which is the most important test Anyone Has taken, Is presently taking, or Will take in their Entire Existence!!! Yet you do not know me, who am I to listen to? Who is Anyone to listen to, for that matter?! Everyone demands proof. Claims being delivered without evidence are chalked up as mere opinions by any stranger who is recieving those words. This is what I humbly ask of you...read my testimony, but pray for God to reveal Himself to you before doing so. No one person can convince another of Anything! But God will respond to you if and when you put forth the effort to communicate with Him! He Is Omniscient, or All-Knowing. He Is Omnipresent, or Everywhere at All times. And He Is Omnipotent, All-Powerful! He Is God, The Creator of All Things! Why not say Hi?! You Will know Him. You Will know Jesus. But you could be dead ANY second after reading these words!... Trust me. You do Not want to wait until that time to know Him! If so, it will be too late.",
  "genres": [],
  "author": "Michael     Jackson",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18488793-death"
}