{
  "title": "Love Me",
  "description": "Sometimes a groupie’s heart craves the wrong rock star…Lindsey Parker’s entire life changed the night a wayward sperm decided she should become a mother. Unfortunately, she’s not sure who fathered her child one wild winter night on Sole Regret’s tour bus. Ostracized by her community, shunned by her family, and abandoned by her friends, Lindsey seeks help from the band member who put her in this desperate position. She hopes her baby’s father is Owen Mitchell—Sole Regret’s sweetheart of a bass player, who took her in when she had nowhere else to go. He’d make an excellent dad, a loving, supportive husband, and he’s gorgeous to boot, but he currently loves another woman. Can Lindsey convince her favorite rock star to love her instead?But not all rock stars are in a band…Sergeant Chad Mitchell’s entire life changed the day he triggered an explosive device. He lost more than his leg and his brilliant bomb-sniffing dog on that battlefield. When Chad opens his eyes to an ethereal beauty’s smiling face, he’s sure that he has died and gone to heaven. But can angels get pregnant? He soon discovers that Lindsey is no angel, but he can’t help being drawn to the one person who doesn’t look at him and compare what’s left to his former glory. She admires him for who his is now. Too bad her heart belongs to his rock star little brother. Can Chad convince his favorite groupie to love him instead?Lindsey agrees to help Chad recover at home, but due to their undeniable attraction to each other, close quarters lead to compromising positions. Together they provide the emotional support the other needs to forge onward to their uncertain futures. But when Lindsey finally discovers who fathered her baby, will that inescapable reality end her time with Chad, or be their true beginning?",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Erotica",
    "Erotic Romance",
    "Music",
    "Musicians",
    "Fiction"
  ],
  "author": "Olivia Cunning",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/18490415-love-me"
}