{
  "title": "Cinderella Geek",
  "description": "(Grades 7 and up) Sixteen and a geek. Delores Chimayo wants to cross over to the other side. Pretty, popular, and a social success is everything she's not. And now she has a plan, ten steps to gain stardom and erase geekdom. But even the best made plans can take some disastrous turns and come out in a way never expected.Maybe that's because she has a few working against her. A stepmom, who Delores secretly calls Cruella, seems to criticize her every move; a sister, Eileen, a preppy cheerleader who at thirteen has already had four boyfriends; and Sheila Thompson, the queen of snobs. She will stop at nothing to gain popularity, and that includes stomping out the competition like Delores.Adding to outside distractions is her home life that's far from idyllic. Delores' dad is doing rescue work thousands of miles away in Ecuador. Her mother passed away when Delores was only twelve. That leaves Grandma Jordan and Aunt Gloria in her corner. They serve up plenty of support.Somehow, with friends like Trey, Lucy, and Penelope, Delores manages to work through her plan, tweaking and adjusting details along the way. Venturing on the other side doesn't turn out to be as sweet a victory as Delores might have guessed, but there are attractive points. Like Griffin Montgomery, the hottie who every girl, including Sheila, would love to have as a boyfriend.It's a duel between the geeks and the populars. Eventually, Delores has to decide what is important enough to fight for and manage to find a happily-ever-after ending in Cinderella Geek, a modern-day fairy tale for teens.CINDERELLA GEEK is part of Jennkrist's series of modern fairytales. Jennkrist is the pen name for author Kathryn Long who writes mysteries, such as WHIPS, CUFFS, AND LITTLE BROWN BOXES and OKLAHOMA'S GOLD.Also available in this series ... NOT SO SNOW WHITEMy name is Winter Snow and I have a secret....Winter Snow is having a bad year ... her dad mysteriously disappears, she has a serious identity crisis with an immerging case of supernatural ability invading her behavior, and a pack of bullies to make her feel like the biggest freak in school. To add to her confusion, she meets and falls for a boy who seems to have some secrets of his own. When a twisted fairytale book about Snow White falls into her hands, events seem to take a course of their own as she solves the mystery of her true identity and struggles to find her dad. Of course, Winter has a little help from her friends and a tiny magical muse she calls Duane. As she predicts, life couldn't become more exciting ... or could it?And ... ALICE IN REALITYLAND\"Someone asked me once … if I could have one gift, just one, and it could be mine forever to share with whomever I wanted … what would I want? I didn't even have to think beyond a second about it. I want happiness. Just to be happy. Happy being me. Yeah, that's the gift I'd like.\"Alice Patelli is too tall, too clumsy, too shy, too weirdly everything that's unpopular. She has one good friend and lots of optimism. But is that enough to turn life around and make her happy?It takes getting hit in the head with a ball and dreaming of a strangely scary and wonderful world to give Alice the chance to make life and love what it should be. Perfectly happy.",
  "genres": [
    "Fairy Tales",
    "Young Adult",
    "Retellings",
    "Contemporary",
    "Fairy Tale Retellings"
  ],
  "author": "K. Sean Jennkrist",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/10980452-cinderella-geek"
}