{
  "title": "Novels 1936–1940: Absalom, Absalom! / The Unvanquished / If I Forget Thee, Jerusalem / The Hamlet",
  "description": "The four novels in this Library of America collection show Faulkner at the height of his powers and fully demonstrate the range of his genius. They explore the tragic and comic aspects of a South haunted by its past and uncertain of its future.In the intricate, spellbinding masterpiece Absalom, Absalom! (1936), Quentin Compson descends into a vortex of images, voices, passions, and doomed desires as he and his Harvard roommate re-create the story of Thomas Sutpen and the insane ambitions, romantic hopes, and distortions of honor and conscience that trap Sutpen and those around him, until their grief and pride and fate become the inescapable and unbearable legacy of a past that is not dead and not even past.In seven episodes, The Unvanquished (1938) recounts the ordeals and triumphs of the Sartoris family during and after the Civil War as seen through the maturing consciousness of young Bayard Sartoris. The indomitable Granny Millard, the honor-driven patriarch Colonel Sartoris, the quick-witted and inventive Ringo, the ferociously heroic Drusilla, and the scheming, mendacious Ab Snopes embody the inheritance that Bayard must reconcile with a new, but diminished, South.If I Forget Thee, Jerusalem (published in 1939 as The Wild Palms) tells of desperate lovers fleeing convention and of a convict escaping the chaos of passion. In “The Wild Palms,” an emotional and geographic odyssey ends in a Mississippi coastal town. In counterpoint, “Old Man” recounts the adventures of an inarticulate “tall convict” swept to freedom by a raging Mississippi flood, but who then fights to return to his simple prison life.In The Hamlet (1940), the first book of the great Snopes family trilogy, the outrageous scheming energy of Flem Snopes and his relatives is vividly and hilariously juxtaposed with the fragile communal customs of Frenchman’s Bend. Here are Ike Snopes, in love with a cow, the sexual adventures of Eula Varner Snopes, and the wild saturnalia of the spotted horses auction, a comic masterpiece.The Library of America edition of Faulkner’s work publishes for the first time new, corrected texts of The Unvanquished, If I Forget Thee, Jerusalem, and The Hamlet. (The corrected text of Absalom, Absalom! was published by Random House in 1986.) Manuscripts, typescripts, galleys, and published editions have been collated to produce versions that are faithful to Faulkner’s intentions and free of the changes introduced by subsequent editors.",
  "genres": [
    "Fiction",
    "Literature",
    "American",
    "Classics",
    "Novels",
    "20th Century",
    "Southern Gothic"
  ],
  "author": "William Faulkner",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/10981.Novels_1936_1940"
}