{
  "title": "A Summer of Drowning",
  "description": "A terrifying and dream-like new novel from one of our greatest contemporary writers. At a critical point in her career, painter Angelika Rossdal suddenly moves to Kvaloya, a small island deep in the Arctic Circle, to dedicate herself to the solitary pursuit of her craft. With her, she brings her young daughter, Liv, who grows up isolated and unable or unwilling to make friends her own age, spending much of her time alone, or with an elderly neighbour, Kyrre Jonsson, who beguiles her with old folk tales and stories about trolls, mermaids and -- crucially for the events that unfold in the summer of her eighteenth year -- about the huldra, a wild spirit who appears in the form of an irresistibly beautiful girl, to lure young men to their doom. Now twenty-eight, Liv looks back on her life and particularly to that summer when two boys drowned under mysterious circumstances in the still moonlit waters off the shores of Kvaloya. Were the deaths accidental, or were the boys, as Kyrre believes, lured to their deaths by a malevolent spirit? To begin with, Liv dismisses the old man's stories as fantasy, but as the summer continues and events take an even darker turn, she comes to believe that something supernatural is happening on the island. But is it? Or is Liv, a lonely girl who has spent her entire life in the shadow of her beautiful, gifted mother, slowly beginning to lose touch with reality? Set in the white nights of an Arctic summer, the novel has the heightened, hallucinogenic atmosphere of a dream, but culminates in a moment of profound horror. Intensely imagined and exquisitely written, A Summer of Drowning is a play of dark and light, of looking and seeing, that will hold and haunt every reader.",
  "genres": [
    "Fiction",
    "Horror",
    "Magical Realism",
    "Literary Fiction",
    "Novels",
    "Contemporary",
    "Mystery"
  ],
  "author": "John Burnside",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/10980811-a-summer-of-drowning"
}