{
  "title": "The Rhythm Section",
  "description": "The debut of an extraordinary new author – a novel of how a woman, pushed over the edge by the violent deaths of her family, survives only by taking other identities.Stephanie Patrick’s world was destroyed by the Atlantic aircrash. Falling into a downward spiral of prostitution, drugs and drink, she is picked up by a journalist who has discovered that it was a bomb that caused the crash. And it is his murder that pulls her out of herself.The Rhythm Section is not a thriller about the hunt for a terrorist, although that is the path Stephanie takes, and it’s not a story about revenge, although justice for her family is her initial motivation. Rather, The Rhythm Section is the story of Stephanie’s attempt to reclaim herself. She has to rediscover who she is through a series of roles that she is forced to play; she is never herself. As a prostitute, she is Lisa, the chemical blonde. Later, she is Petra Reuter, German anarchist turned mercenary terrorist. Sometimes, she is Marina Gaudenzi, a Swiss businesswoman, or she’s Susan Branch, an American student, or Elizabeth Shepherd, an English management consultant.But whoever she is, she’s never herself because her life depends on her being someone else. This is the way she is trained by the intelligence service that recruits her, but it’s also the way she’s taught herself to be; being someone else has always worked for her and so it does now, until she begins to fall in love for the first time with Frank White. This undermines her completely and poses new questions: which of the many people she has become is the one to have fallen in love? Stephanie? Petra? Or one of the others? With whom has Frank fallen in love? Marina? Or the real Stephanie? More than anything, The Rhythm Section is about a catastrophic crisis of identity.",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Mystery Thriller",
    "Book Club",
    "Audiobook",
    "Suspense"
  ],
  "author": "Mark Burnell",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/1098095.The_Rhythm_Section"
}