{
  "title": "Speak Now: Marriage Equality on Trial",
  "description": "A renowned legal scholar tells the definitive story of the trial that will stand as the most potent argument for marriage equality.In 2008, California voters passed Proposition 8, rescinding the right of same-sex couples to marry in the state. Advocates for marriage equality were outraged. Still, major gay-rights groups opposed a federal challenge to the law, warning that it would be dangerously premature. A loss could set the movement back for decades. A small group of activists, however, refused to wait. They turned to corporate lawyers Ted Olson and David Boies—best known for arguing opposite sides of Bush v. Gore—who filed a groundbreaking federal suit against the law.A distinguished constitutional law scholar, Kenji Yoshino was also a newly married gay man who at first felt ambivalent about the suit. Nonetheless, he recognized that Chief Judge Vaughn Walker’s decision to hold a trial in the case was momentous. Boies and Olson rose to the occasion, deftly deploying arguments that LGBT advocates had honed through years of litigation and debate. Reading the 3,000-page transcript, Yoshino discovered a shining civil rights document—the most rigorous and compelling exploration he had seen of the nature of marriage, the political status of gays and lesbians, the ideal circumstances for raising children, and the inability of direct democracy to protect fundamental rights. After that tense twelve-day trial, Walker issued a resounding and historic ruling: California’s exclusion of same-sex couples from civil marriage violated the U.S. Constitution. In June 2013, the United States Supreme Court denied the final appeal in Hollingsworth v. Perry, leaving same-sex couples in California free to marry.Drawing on interviews with lawyers and witnesses on both sides of the case, Yoshino takes us deep inside the trial. He brings the legal arguments to life, not only through his account of the case, but also by sharing his own story of finding love, marrying, and having children. Vivid, compassionate, and beautifully written, Speak Now is both a nuanced and authoritative account of a landmark trial, and a testament to how the clash of proofs in our judicial process can force debates to the ultimate level of clarity.",
  "genres": [
    "Nonfiction",
    "LGBT",
    "Law",
    "History",
    "Politics",
    "Queer",
    "Social Justice"
  ],
  "author": "Kenji Yoshino",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/18490776-speak-now"
}