{
  "title": "Ditching the Dream",
  "description": "Author's Note: I wrote this book as a dare and intended it to be a standalone. It was written with an \"ambiguous\" ending. I expected to get raked over the coals for this story, but readers wanted more. They wanted to know more about Jack Stevens, they wanted to know what happened afterward... So, then I wrote a book about Jack Stevens (Not In My Wildest Dreams, Book 2 in the Dream Series). Various characters continued to come to life in my head, and before I knew it, I had a 6 book series, each featuring different characters.Enjoy Book 1.Thank you. ~~~~~~~~~~~~~~~Elizabeth Fairchild (42) is living the seemingly perfect life in Napa California. She married her college sweetheart right out of college and had her first child before her first anniversary. But now that the children are away at college, Elizabeth, who had always been \"someone else\" (a daughter, a student, a wife, a mother) now doesn't know who she is. She's forgotten what fires her passions.Her husband is 'wonderful'; provides her with everything she needs and more. She doesn't want a divorce, but she needs to figure out who she is. So, she leaves him a note, and leaves her home and goes to New York City, where she doesn't know anyone. She wants to find a place to live, get a job, and pay her bills. She's never had to do any of that and wonders if that's what she'd been missing in her life.When Elizabeth talks to her husband, Greg, a few days later he gives her a \"hall pass\" to 'sow her wild oats.'She certainly didn't leave her husband to find another man, but Elizabeth soon finds herself involved with two: Jack Stevens and Kevin Parker.Jack is older. He has heart-stopping good looks, is wildly successful, and is very much in control of everything around him - especially Elizabeth.Kevin is younger. He is carefree with a heart of gold and loves Elizabeth's moxie.While Elizabeth's old life still calls to her, she also finds what she needs in New York. But which dream will she choose?WARNING: This book contains subject material of an adult nature intended for readers over the age of 18.",
  "genres": [
    "Romance",
    "BDSM",
    "Erotica",
    "Menage",
    "Erotic Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Isabelle Peterson",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/18498420-ditching-the-dream"
}