{
  "title": "Spaces of Hope",
  "description": "As the twentieth century drew to a close, the rich were getting richer; power was concentrating within huge corporations; vast tracts of the earth were being laid waste; three quarters of the earth's population had no control over its destiny and no claim to basic rights. There was nothing new in this. What was new was the virtual absence of any political will to do anything about it. Spaces of Hope takes issue with this.David Harvey brings an exciting perspective to two of the principal themes of contemporary social globalization and the body. Exploring the uneven geographical development of late-twentieth-century capitalism, and placing the working body in relation to this new geography, he finds in Marx's writings a wealth of relevant analysis and theoretical insight. In order to make much-needed changes, Harvey maintains, we need to become the architects of a different living and working environment and to learn to bridge the micro-scale of the body and the personal and the macro-scale of global political economy.Utopian movements have for centuries tried to construct a just society. Harvey looks at their history to ask why they failed and what the ideas behind them might still have to offer. His devastating description of the existing urban environment (Baltimore is his case study) fuels his argument that we can and must use the force of utopian imagining against all who say \"there is no alternative.\" He outlines a new kind of utopian thought, which he calls dialectical utopianism, and refocuses our attention on possible designs for a more equitable world of work and living with nature. If any political ideology or plan is to work, he argues, it must take account of our human qualities. Finally, Harvey dares to sketch a very personal utopian vision in an appendix, one that leaves no doubt about his own geography of hope.",
  "genres": [
    "Geography",
    "Politics",
    "Philosophy",
    "Nonfiction",
    "Economics",
    "Sociology",
    "Urban Studies"
  ],
  "author": "David Harvey",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/184941.Spaces_of_Hope"
}