{
  "title": "Rebirth",
  "description": "There are Pretenders among us, geniuses with the ability to become anyone they want to be. In 1983 a corporation known as The Centre isolated a young Pretender named Jarod and exploited his genius for their ‘research. Then, one day, their Pretender ran away…Written by the creators of the cult-hit TV show The Pretender – Rebirth is a slick mystery thriller about a brilliant human chameleon named Jarod who after escaping from the notorious Centre, plunges headlong into his newfound freedom. While also discovering the joys and intricacies of everyday life with the pure wonderment of the man/child he is, Jarod uses his unequaled abilities to literally become anyone he wants to be (a surgeon, a pilot, a physicist, etc.) as well as his dazzling mind over muscle vigilante-like skills to bring down the powerful and corrupt and protect those who can’t defend themselves. All the while he must stay a step ahead of his relentless pursuers from The Centre. First and foremost is the sexiest woman on the planet, the complex, bitch-on-wheels, Miss Parker who wants him recaptured at any cost – alive - preferably. Parker is a deliciously cunning woman Jarod has known since childhood and theirs is a truly multifaceted cat and mouse relationship - one driven by Jarod who holds the key to the emotional secrets at her very core, secrets that fuel her relentless drive to recapture him. Then there is Sydney, Jarod’s surrogate father figure and psychologist who raised and nurtured his genius for The Centre’s disreputable purposes. To Jarod, Syd is both friend and foe, confidante and captor, counselor and betrayer. But Syd’s calm paternal connection to Jarod remains strong, often in conflict with The Centre agenda.Jarod senses Sydney holds the emotional keys to his core – the truth about his past and the identity of the parents he was stolen from and whom he longs to reunite with. In Rebirth, Jarod employs multiple sophisticated pretends in his quest to save one missing boy and hundreds of other innocent lives hanging in the balance at the hands of multi-national corporate terrorists and mercenaries. Rebirth is at once an enthralling tale of one man’s exploration of life around him, intricate suspenseful mystery and intense edge-of-your-seat thrill ride – that captures and reignites the cult hit TV series for both loyal fans of the show and new readers alike. There are Pretenders among us…",
  "genres": [
    "Mystery",
    "Fiction",
    "Science Fiction",
    "Tv",
    "Mystery Thriller",
    "Thriller"
  ],
  "author": "Steven Long Mitchell",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/18500525-rebirth"
}