{
  "title": "Immoral: Tales of a Vampire Hunter",
  "description": "Immoral is the first book in the Tales of a Vampire Hunter series—richly imagined, sexy, paranormal romance thrillers filled with heartbreaking betrayals, stunning consequences, and unexpected romance.Star-crossed lovers threatened by dangerous secrets . . . but no secret stays hidden foreverA VAMPIRE HUNTER BREAKING ALL THE RULESIn a time when humans are captivated by imaginary vampires, real ones hide among you, kept in check by vampire hunters like me. Falling for the mysterious vampire girl is crazy, but my forbidden passions compel me to make my own rules. The black sheep of my family, I’ve never been much of a rule follower anyway.Will she stand by me when we're entangled in a web of lies, death, and immoral desires that stretch across time and threaten everyone we love? Does she hold the key that will unlock dark secrets that could free us both from our tormented pasts? Will she surrender to the love that burns between us when even my kiss could cost her life?A VAMPIRE DESPERATE FOR ANSWERSFrom the moment we meet, I see the dangerous and damaged soul inside the charismatic vampire hunter—so much like my own. I cannot resist him, and soon I need him as surely as I need my heart to beat. I know to love him is to die, but I cannot imagine life without him.Compelled to follow a twisted trail of mystery and deceit that takes us from Chicago to Paris, how much will he risk for me when the shocking truth of our pasts threatens to destroy everything he thought he knew about vampire hunters and vampires? Will he face the horror of his past to save us when our families join forces to keep us apart? Or will our obsessive desire for one another kill us first?THE TRUTH MIGHT KILL THEM, BUT FIRST THEY'LL HAVE TO SURVIVE EACH OTHER",
  "genres": [
    "Vampires",
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Fantasy",
    "Erotica",
    "Urban Fantasy"
  ],
  "author": "Zander Vyne",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/18500819-immoral"
}