{
  "title": "A Glory Days Production",
  "description": "**2014 Fan Favorite Award from Evocative Book Reviews****2014 Favorite Rocker Award from Evocative Book Reviews**A Glory Days Production...Sing To MeAs a child, I’d dreamed of singing, but a tragic attack left me without a voice. Currently, I take pictures of those in the spotlight. My time up front has passed. I’m happy with what I do. But when my BFF wants to take me to meet her brother’s band, I find out that I want that spotlight more and more since meeting the band, Glory Days. With a little hope, I vision a happier life. Only to be shot down again, when my past reminds me I am nothing but Mary Montclair, freelance photographer.Save MeThe threat still remains.Someone is stalking me. The phone calls continued and the knowledge that someone out there wanted to hurt me was still present as we start the newest tour for Glory Days. Touring with Ash was a dream come true and with my newfound voice, I was ready to blossom. I was ready to sing. When my stalker attacks my best friend, I have to put trust in my new family. Eventually, when the monster makes himself known, Ash is there to save me.Just like he said he would. Deliver MeAfter the birth of our daughter, Ash must complete the European tour with Glory Days, leaving me home alone with my best friend for company. Between the constant harassment of Justin Rembrandt, the whacked out record executive and Ash’s estranged mother, I must try to figure out the tangled web that my life has now become.When both of those people want more from me, than I’m willing to give, I am thrust into the role of victim, yet again. My desire to have a family for my child brings the problems of Ash’s childhood to the forefront. His inability to tell me about his past hurts and I have to beg him for answers. Unfortunately, I find out the hard way that what he’s been telling me all along is the truth.",
  "genres": [
    "Musicians"
  ],
  "author": "Theresa Hissong",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/18501921-a-glory-days-production"
}