{
  "title": "Skirmishes",
  "description": "The answers Captain Jonathon \"Coop\" Cooper and the crew of the Ivoire seek lie in the Boneyards. But they must wait for Boss and her team to dive it, explore the wrecks, and piece together what happened in that faraway place. Boss loves the challenge. Thousands of ships, centuries of history, all play to her strengths. In her absence, she trusts Coop to defend the Nine Planets Alliance against the Enterran Empire. But an encounter from Coop's recent past shows up to haunt him, an encounter he never told Boss about, an encounter that could threaten her future, his life, and the fragile peace between the Alliance and the Empire. Rusch's handling of the mystery and adventure is stellar, and the whole tale proves quite entertaining. -Booklist Online on Diving into the Wreck This is classic sci-fi, a well-told tale of dangerous exploration. The first-person narration makes the reader an eyewitness to the vast, silent realms of deep space, where even the smallest error will bring disaster. Compellingly human and technically absorbing, the suspense builds to fevered intensity, culminating in an explosive yet plausible conclusion. -RT Book Reviews Top Pick on Diving into the Wreck Rusch delivers a page-turning space adventure while contemplating the ethics of scientists and governments working together on future tech. -Publisher's Weekly on Diving into the Wreck Rusch keeps the science accessible, the cultures intriguing, and the characters engaging. For anyone needing to add to their science fiction library, keep an eye out for this. -Josh Vogt, Speculative Fiction Examiner.com on City of Ruins Filled with well-defined characters who confront a variety of ethical and moral dilemmas, Rusch's third Diving Universe novel is classic space opera, with richly detailed worldbuilding and lots of drama. -RT Book Reviews on Boneyards",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Science Fiction Fantasy",
    "Audiobook",
    "Space",
    "Time Travel"
  ],
  "author": "Kristine Kathryn Rusch",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/18499765-skirmishes"
}