{
  "title": "The Girl from the Well",
  "description": "\" [A] Stephen Kinglike horror story...A chilling, bloody ghost story that resonates .\"― Kirkus From the highly acclaimed author of the Bone Witch trilogy comes a chilling story of a Japanese ghost looking for vengeance and the boy who has no choice but to trust her, lauded as a \"a fantastically creepy story sure to keep readers up at night\" (RT Book Reviews) I am where dead children go. Okiku is a lonely soul. She has wandered the world for centuries, freeing the spirits of the murdered-dead. Once a victim herself, she now takes the lives of killers with the vengeance they're due. But releasing innocent ghosts from their ethereal tethers does not bring Okiku peace. Still she drifts on. Such is her existence, until she meets Tark. Evil writhes beneath the moody teen's skin, trapped by a series of intricate tattoos. While his neighbors fear him, Okiku knows the boy is not a monster. Tark needs to be freed from the malevolence that clings to him. There's just one  if the demon dies, so does its host. Suspenseful and creepy, The Girl from the Well is perfect for readers looking for Praise for The Girl from the Well \"There's a superior creep factor that is pervasive in every lyrical word of Chupeco's debut, and it's perfect for teens who enjoy traditional horror movies...the story is solidly scary and well worth the read .\" ― Booklist \"Chupeco makes a powerful debut with this unsettling ghost story...told in a marvelously disjointed fashion from Okiku's numbers-obsessed point of view, this story unfolds with creepy imagery and an intimate appreciation for Japanese horror, myth, and legend .\" ― Publishers Weekly STARRED review \"It hit all the right horror notes with me, and I absolutely recommend it to fans looking for a good scare . \" ― The Book Smugglers",
  "genres": [
    "Horror",
    "Young Adult",
    "Fantasy",
    "Paranormal",
    "Ghosts",
    "Fiction",
    "Mystery"
  ],
  "author": "Rin Chupeco",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/18509623-the-girl-from-the-well"
}