{
  "title": "Pictures, Lies and Promises",
  "description": "The pictures in Nicole's mind are paving her way to a future filled with promises and hope but with a relentless serial killer hot on her trail, will she be able to weave her way through the web of lies set out before her? As Dylan and Bradley continue to hide Nicole and her daughter, they find survival is more than just existence. Surrendering all that they thought was important, they promise to protect the two girls, no matter what the cost. In risking it all, they learn what it means to live, but do they have what it takes to stay alive? \"Pictures, Lies & Promises is a tension-fuelled read. Readers will be held captive by the world and drama that Tiffany Carmouche creates. The epic suspense, teamed with a whole lot of heat, transforms this amazing series into a scorching-hot read.\" Bex - Bex 'n' Books \"What a fantastic novel! There were several times that I had to remind myself to breathe! Pictures, Lies & Promises is jam packed with absolutely everything that makes a really good read! Every character & scene is written with such emotion and detail, you totally feel as if you are living the story. There are so many moments where my heart was thumping through my chest & just as many times I felt like it may have stopped beating. There are so many different aspects to this story & so many different directions it could take. You will be left on the edge of your seat...and possibly with a few tears on your cheek.\" Nikki Wilson \"Tiffany Carmouche has done it again! Pictures, Lies & Promises continues the dangerous battle that is waged by Dylan and Bradley to protect Nicole, the woman that they both love, from an obsessive serial killer. This story is a nail-biter ... suspenseful, sexy, scary and surprising, right up to the end; complete with, of course, another cliff-hanger!\" Teri McGill \"I think my heart just stopped!! WOW!!! Tiffany Carmouche is one of my favorite authors, and my favorite in the drama/suspense genera, but she truly outdid herself with Pictures, Lies and Promises! I picked up this book last night and finished it today. This is one of those books you just cannot put down! Tiffany's books are completely addicting and leave you wanting more after they have come to an end. Pictures, Lies and Promises picks up exactly where Becoming Invisible leaves off. From the very first page you are sitting on the edge of your seat, completely captivated and biting your nails waiting to find out what is about to unfold and praying that it will have a happy ending. The lives of Nicole, Dylan, Jessica and Brad are thrown upside down in the very first book and being a part of their journey is an extremely emotional roller coaster! You will find yourself laughing, crying, yelling and ready to throw your book or e-reader. Tiffany has such a talent for writing! She is able to describe her characters, their emotions and surroundings in such amazing detail that you feel as if you are right there with them! Thank you Tiffany for another master piece! I can't wait to find out what is in store for your amazing characters!\" Vicki Lake\"",
  "genres": [],
  "author": "Tiffany Carmouche",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/18513664-pictures-lies-and-promises"
}