{
  "title": "Chasing Serenity",
  "description": "“I loved this book! The hero is a tatted up Irish rugby player who has traveled to the states to play for college. Like the heroine he has a tragic past and when Autumn and Declan meet sparks fly! Nice to read a book that is anything but predictable.” —Kele Moon, author of the Battered Hearts series“This book explores emotional heartache, but on different levels. It’s not just about romantic love, but about the love of family (and “family” takes on a whole new meaning. It encompasses friends, too). From disconnect to possible re-connect. From old scars that refuse to heal, to potential emotional mending. You’ll feel it, deep.” —Maryse Black, Maryse’s Book Blog“When I read the first book, Chasing Serenity, I had a bone deep knowing that Eden Butler was a special author. Her ability to pull you into her stories - the world that she creates, the characters that she molds, and her ability to immerse you into the emotions of those characters – is nothing short of spectacular.” —Mean Girls Luv BooksGraduate student Autumn McShane has had her share of heartbreak.She’s been abandoned and betrayed and she lost her beloved mother in a tragic car accident five months ago.That loss damaged her body and fractured her spirit but she’s learning to recover, until her ex-boyfriend returns to town, intent on making her life miserable.Declan Fraser hates her ex as much as Autumn does, but the last thing she needs is to put her trust in the hands of another man, especially one like his hard body and lulling Irish accent makes more than a few girls weak-kneed. The talented rugby player is rude and sarcastic, with tattooed, muscular arms and a cocky attitude, but he's the only one who can help Autumn win an ill-advised bet that, if lost, could cost her more than she's willing to pay.The reluctant alliance between Declan and Autumn stirs up cravings she doesn't want to admit, but Declan is a hard man to resist. Just when Autumn starts letting down her carefully constructed walls to the sexy bad boy, he betrays her when she needs him most. Autumn suspects Declan has secrets, and she is determined to uncover what drove him away from her, even if that means fraternizing with the enemy. But will the truth return Declan to her arms or add to the scars on her heart?",
  "genres": [
    "New Adult",
    "Romance",
    "College",
    "Sports",
    "Contemporary Romance",
    "Contemporary",
    "Sports Romance"
  ],
  "author": "Eden Butler",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/18513705-chasing-serenity"
}