{
  "title": "All That Remains",
  "description": "I hope I have found a selection of stories that will cause the reader to smile or chuckle or even feel a little sad or afraid. I have found zombies, vampires, monsters, demons, Lovecraftian lore, ghosts, and other beasties that ‘go bump in the night’. More than anything, I wanted to share some stories about loneliness and despair and show that the stories can be as frightening as any monster story. I hope the reader finds these stories bittersweet and thought provoking.R.J. Spears is a new author. He has Sanctuary available: a witty, tender, scary book about zombies and the attempt of the survivors to regain a semblance of morality and ethics. He is currently at work on a sequel.TL Decay is an award-winning poet and writer of horror, sci-fi, and romance. His work appears in various anthologies, and he has several novels available. Other Worlds is available as a science fiction collection. Scotty Schrier is a horror writer with J Ellington Ashton Press and has released his first novel Jode Unforgiven, a novel about demons and justice. His story for this book invokes some New Orleans-styled voodoo. Scotty also has a zombie book available.Susan Simone is the author of Silent Heart, a novel that defies any genre. Susan enjoys combining elements from all genres and writing emotional, brave stories that are fanciful, mysterious, and sometimes creepy. Her next novel is due to be released soon.Mark Woods, a prolific reviewer, recently began submitting his short stories, only to find that presses were hungry for them. Writing in a beautiful UK voice, Mark has shared a sad and haunting story. His stories appear in various anthologies.Nick Hatfield writes in a very unusual way, clipped and bare, and he never adds a word that isn’t needed. With his streamlines style, he presents several stories that remind the reader of The Twilight Zone because nothing is as it seems. Heart wrenching, his work is brutally frightening.catt dahman is a prolific writer for Severed Press and J Ellington Ashton. With seventeen books published, she finds short stories to be one of the biggest challenges in writing.Christopher D Abbott is, by trade, a mystery writer. Luckily for us, he is venturing outside his usual and into the world of dark dreams and bumps in the night. Sir Laurence Dies is a murder mystery written in a lovely English voice and is popular internationally.Paul Flewitt: Rock and Roller turned dad and writer, Paul is an up and coming author who is never traditional, breaks every rule, and leaves a reader genuinely afraid. He is the author of Poor Jeffery.Patti Geesey is swears she isn’t a horror writer and we nod and go on. If she doesn’t write horror, in her view, I would hate to know what really scares her.",
  "genres": [],
  "author": "Catt Dahman",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/18513788-all-that-remains"
}