{
  "title": "A Great Sage and A Rascal Named Doku",
  "description": "A Manuscript on Prosperity. For those who have just begun, for those in-between and for those who have tried everything and failed.\"A Great Sage and a Rascal named - Doku is uplifting, enriching and deeply thought provoking. A must read for all those who are interested in living a life overflowing with abundance\".~T. Harv Eker -  Author, #1 NY Times Bestseller Secrets of the Millionaire Mind\"This book gives you a proven, practical, step-by-step process to develop the essential \"prosperity consciousness\" that leads to wealth.\"~Brian Tracy - Author, Million Dollar Habits\"A rare abundance parable that pairs a recommendation of owning up to one's own greatness yet applying that greatness in continual and joyful service to others, and many other complimentary wisdoms to live a life of inner and outer wealth.\"~Kerul Kassel, Ph.D - Award winning author of Stop Procrastinating Now and Productive ProcrastinationThis self help book effortlessly introduces you to deep eastern concepts in the form of a witty, delectable and charming parable. Nestled high up in the mountains, in an ashram, a Master educates (draws out from within the student) innate wisdom already present in every human being. These concepts which are inspirational and motivational have stood the test of time, not for centuries but millennia.Kindly click on the \"Look Inside\" feature which lets you browse through the Table of Contents and the first few chapters for FREE.In this book you will discover the following and much, much - How Spiritual Life and Wealth are truly joined at the hip- A deadly sliver of doubt that shreds your dreams, drives and ambitions to pieces- How to make money, it has nothing to do with Wall Street, gold, real estate, sales or marketing- The virus that corrupts the pristine operating system you were born with and how to kill it- An answer to the question \"How do I go beyond forgiveness?\", liberating you instantly- Success in one sentence, the twin peaks of failure and the art of getting the right answers- How can I exercising without moving; the role that food, clarity, creativity & sound play in your life- What is fear and how do I overcome it?- Do Soul Mates Exist and how do I get out of bad relationships?- How to see through the illusion called time management?- Gardening your consciousness, is happiness possible?- The ultimate secret, few know this, and even fewer know how to use it effectivelyBy understanding and embracing these simple yet profound concepts, those all over the world can easily achieve happiness, wealth and success without breaking their backs, ruining their health or ending up in a mental asylum.This book is meant for people of all ages and all cultures, who regularly ask themselves this question - How do I become a millionaire or how do I get rich? Many have commented on the fact that this book is worth many times the price it's being so sold for.About the AuthorVivek Rajan Vivek has been researching life and people for close to 20 years. He is an engineer, tinkerer, inventor, teacher, mentor, investor, learner, believer, observer and author. He has traveled extensively the world over and loves the open road; he genuinely likes people, loves good food and good music. He enjoys working with those who are sincerely looking for a better way to live, from all walks of life , all over the world, empowering them, to raise their consciousness to the next level.",
  "genres": [
    "Self Help"
  ],
  "author": "Vivek Rajan Vivek",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/18514604-a-great-sage-and-a-rascal-named-doku"
}