{
  "title": "The Return of the Ancient Ones",
  "description": "Second in The Chronicles of Illúmaril series, author Gary Caplan's The Return of the Ancient Ones is a distinct tale that illustrates how one's fiercest enemy can become one's most aggressive ally.Winner 2012 NABE Pinnacle Book Award in Fantasy andWINNER 2011 Indie Excellence Award in Fantasy Category andFinalist 2011 International Book Awards in Fantasy Sci-Fi categoryAs dramatic as it is playful and sublime, Caplan has a knack at weaving the enchanted world of fantasy into the tension of a good old-fashioned cloak and dagger thriller. His incredible instinct for action rests on a spellbinding prose, yet what distinguishes his work in this genre is his ability to consider an otherworld culture as it reaches its pinnacle, rather than upon its downfall. In thirty-one chapters with titles like \"Tyl University and the Academy of Spellweaving Arts,\" \"Back to the Order of the Platinum Griffon and Duty,\" and \"End Game,\" readers are reintroduced to Illúmaril, a land that patiently awaits its heir apparent. Once hidden on Earth, Gideon Finelen, as a birthright, holds the legacy that he and his ancestors are the only ones who can use the Sword of Order. Gideon's advisors, Tauri Ragan and Lord Talmor, hold great hope in Gideon and his Companions of the Sword of Order, but it is their enemy's enemy that first instigates a bold move. And while the Darkspawn have no intention of giving up their power, the return of Thatos and his twelve evil sorceror generals from their ancient, watery graves disperses the Darkspawn's allegiance to temporarily help the armies of the Free Peoples against Thatos, his mercenaries, and other chaos warriors. For Gideon, the quixotic irony in all of this is that Darkspawn leadership is just as fixed on revenge as it is with maintaining its stronghold over Illúmaril. As he pits foe against foe to claim Illúmaril, the Sword of Order has a chance to triumph over Chaos.",
  "genres": [],
  "author": "Gary Caplan",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/10985578-the-return-of-the-ancient-ones"
}