{
  "title": "When Adam Lacroft Met Death",
  "description": "Death, in the form of a sexy, capricious twenty-something woman, offers a teenage boy a questionable way to win back his life in 19-year-old author’s debut novel. Adam Lacroft is a carefree seventeen-year-old, in love, with a perfect slacker future in front of him--until a reckless driver crashes into his car and threatens to take all of that away. When Adam wakes-up in an empty white room, a cute girl sitting by his side giggles and explains to him that he is now dead. Coquettish and border-line psychotic , the girl produces a few demonstrations that scare Adam and verify the reality of his state of being. A proper introduction is then made and Adam Lacroft meets Death herself. Death, however, tells Adam he may call her Eve.Feeling sympathy (or is it something else?) for Adam, Eve strikes-up a deal with him: if he can find and kill the driver who caused his accident within three days, Adam gets to turn 18 and find his natural end some other time. Having no clue of what to do next, Adam confides is rather strange predicament in his friend Erica and, together, they begin searching for the man who caused the accident. Their mission is unconscionable enough, but as Adam and Erica find-out more about their target, they find less of Eve’s version of the events ring true. Death is spoiled and condescending and, despite seeming to have a crush on Adam, is constantly setting him up to fail. Although written for Young Adult readers by this author who is a Young Adult himself, When Adam Lacroft Met Death is also a story for those who are intrigued by mysteries surrounding death. Death has many times been portrayed as a human being (The Book Thief, Death Takes a Holiday and Meet Joe Black, among others), with the fascinating idea of death as an entity you can speak to and anger. Written by a teenager, When Adam Lacroft Met Death has a narrator that, like many teenage boys, is genuinely uninformed and immature. In lively opposition to this tone, the book is, above all else, a tale about corruption of character and ideals and lives spiraling out of control in a desperate attempt to survive.",
  "genres": [],
  "author": "Carlos Paolini",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/18514653-when-adam-lacroft-met-death"
}