{
  "title": "The Beauty Game",
  "description": "When talented copywriter Zoe Diamond first enters the plush offices of global beauty empire Visage D’Or she doesn’t know her day cream from her night cream. She has no idea about the signs of ageing and she thinks uplift is a type of Wonderbra: she wouldn’t know an active ingredient if it landed on her face. Zoe learns fast that beauty means pain, truth means legal lies and miracle creams make beautiful profits. As she struggles to write fiction about fine lines and anti-ageing ingredients she’s manipulated and betrayed by charming words and false promises; what’s more dangerous is that Zoe finds herself overwhelmed, and seduced, by the powerful man behind it all. When the director of Visage D’Or kills himself days before the launch of their new wonder cream, Promise, she is catapulted towards the ruthless centre of a million-dollar business and uncovers the vile secret the French beauty giant is trying to hide; the real business behind the beauty game, that of making a profit. Zoe is surrounded by corruption and scandal but is offered a means of escape when Leo, a handsome conservationist for whom she instantly falls, enlists her to expose the dubious practices of Visage D’Or and the devastation they are causing - all in the name of beauty - in his beloved Africa. Zoe must put her career, and ultimately her life, on the line in order to uncover the ugly truth about beauty. The Beauty Game is the debut novel by Michaela Day which draws on her extensive experience working in the beauty industry; a shocking and witty exposé, many of the characters are based upon the people Michaela worked with and the situations that she witnessed first-hand as a beauty creative director. Day reveals the manipulative undercover world of beauty advertising, lifting the lid on the realities of how the industry really works, including false advertising and excessive photoshopping. Day wants to help re-educate young girls to feel less pressurised to conform to stereotypical ideals of beauty, to learn to embrace their own image and simply be themselves. As someone who knows every trick in the trade and who has played the beauty game herself, Michaela Day’s is a powerful and insightful message that’s certain to appeal to women everywhere.",
  "genres": [],
  "author": "Michaela Day",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/18514493-the-beauty-game"
}