{
  "title": "Devil Let Me Go",
  "description": "Containing thirteen stories of intrigue and fear, Devil Let Me Go is the first short story collection from emerging new horror talent, Nathan Robinson, author of the acclaimed Starers, published by Severed Press. The world has ended, but an old man discovers he’s not so alone in ‘The House that Creak’d.’A wronged gangster finds himself beaten, battered and bruised and in the deepest of trouble, can he find his way off ‘Top of the Heap?’ A lonely widow is given a reason for being after a horrific natural disaster, but this gift is not all its ‘Crack’d’ up to be. Two men meet on a dark and rainy night; one sane, one insane and together on a lonely road that leads to a battle beyond life for love in a destination that is ‘Not That Way Home.’ If you love your child how far would you go to protect them? When their life is in the balance would it matter if they’re ‘In One Form or Another?’ Lupo is the most despicable of villains, but what would you do ‘If you ever meet a girl named Maisie Mae?’ What would a girl do to keep her man? Beth asks, what is love? She knows how far she’d go, so ‘Eat your Heart out Lorena.’ It’s time to pack up for the last time, don’t leave anything behind; you’ll need plenty of ‘Banana Boxes’ to help you on your way. He’s waiting, he wants something you cherish and he can’t leave without it. Meet a strange stranger that calls himself ‘Brian of the Night.’ He’s the last person you’d want to meet. Three lifelong friends on a holiday of a lifetime stumble upon a body, soon they’ll discover why he waited so long in ‘The Skeleton Tree.’ A deadly army rises up during the night shift; all ‘The Chicken in Black’ wants to do is get to the other side. It might be the time for giving, but it’s still ‘Colder than Hell up here.’ Everybody will believe, the world has been turned upside down. Something has ‘Fallen.’ Each tale takes the reader into the dark heart of humanity and beyond.Includes artwork not included in the Kindle edition.",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Zombies",
    "Anthologies"
  ],
  "author": "Nathan Robinson",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/18515218-devil-let-me-go"
}