{
  "title": "آخر ما قالته لي",
  "description": "مجموعة قصصية من 13 قصة قصيرة اجتماعية مستوحاة من نظرة الكاتبتين للواقع و المقدمة تشرح لك كيفية التكنيك و الانسجام الذي قد يحدث بين قلمين ليجمعلهما مندمجين كقلم واحدمن قصة آخر ما قالته لي \"- تعرفي لو الراجل بيقلّع مراته الدبلة بنفسه ساعة الطلاق ، كانت نص حالات الطلاق ، لاء نصها إيه ، كانت أغلب حالات الطلاق محصلتش .. قالتها بعدما سحبت أنا من إصبعها خاتما إشترته مؤخرا لاراه ، كانت تنفث دخان سيجارتها إلى أعلى ، تعلمت التدخين و أشياء أخرى كثيره بعد طلاقها ، و تعلمت أنا أن أستمع إليها دون أن أرد ، فهي لم تعد تحتمل أي شيء ، أصبحت نفسيتها أكثر هشاشة و كنت أظن الزواج قد جعلها أقوى ، و لكن ما حدث أنه أفقدها حتى القدرة على التوازن ..\"\"، لعل أصعب ما يمكننا رؤيته في وجه أي إنسان ، هو الضحك و دموع الألم لم تنشف بعد ! الذي خلّد بيكاسّو عبر القرون ..و في الموناليزا .. هو الذي مزق قلبي عندما وجدته في وجه صديقتي التي تفوق الموناليزا جمالاً و رقة .. و ما أصعب عذاب الضمير ! قتلت ابنها و دمّرت بيتها و زوجها بناءاً على حدسٍ أنثوي غبيّ ! رباه ما فعلت تلك المرأة في نفسها ! \"آخر ما قالته لي ، هي العمل الذي يحمل الكتاب إسمه ، و هي قصة إجتماعية تسلط الضوء على شعور المرأة إذا ما تعرضت للخيانة الزوجية ، إلا أن بطلة القصة لم تستسلم لما يمكن أن تشعر به غيرها في تلك الحالة ، و لكنها فكرت في الإنتقام ، بقدر ما كان ذلك موجعا لها و بقدر ما ترددت ، إلا أنها تشعر أنه لا سبيل لرد كرامتها سوى أن تنتقم ، فهل كانت محقة ..في الكتاب أيضاً أكثر من قصة \"أترك قلمي جانبا .. دقات الساعة التي تعلن عن بدء دورة جديدة للساعة التالية تفقدني تركيزي .. أصاب بالهلع من مجرد أن أذكر أنني لم أنم منذ 54 ساعة مضت ، لم يعد النوم يغريني فالكوابيس التي تلاحقني قد ارهقتني أكثر مما فعل الصحو المتواصل ، جرعات الكافئين المكثفة لم تزدني إلا توترا و ضغطا على أعصابي .. أبحث عن حالة ثالثة بين الصحو و النوم .. بين الواقع و الأحلام أشعر بأن حالتي تزداد سوءا يوما بعد يوم .. أي واقع اجتماعي قد أحل بي .. إنني في إقامة جبرية أنا من فرضها على نفسي \" ربما هو الحب \"لازلت في نظر الجميع إمرأه ثلاثينية رائعة ، و قد صرحت لي أمي أن تلك نعمة قدرها لي الله ، لبعوضني نعمة الأمومة ، صرخت فيها ، أخبرتها أنني كنت سأكون أكثر سعادة لو أن لي طفلا ، طفلا واحدا ، حتى لو زاد وزني عن الطنين ، و لكنني ام ..\" سنة حلوة يا جميل \"و أبقى أنا في النهاية لوحدي ، أو مع من سأبقيه لوحده ، لماذا ذرفتما الدموع يا والدَي ؟ فلن يدرك الميّت إن تنبّه أحدهم إلى وفاته ساعتها أو يومها أو ما إلى ذلك .. و لن يكترث بالتأكيد إلى الأحاديث المشفقة عليه و على ميتته تلك التي ستحكى في عزاءه الذي بالطبع لن يضيره إن أقيم أم لم يقام .. \" زوجة الأستاذ فلان \"يصاب العشاق بالطمع المفرط ..أوليست حقيقة اليوم هي أمل أمس ؟ ، و لكنها ستصير غدا ماضيا لا يشبعني ، يوم رأيتك لم أكن أتمنى أكثر من أن تبقى لمزيد من الوقت ، و ها أنا اليوم أرى في مرافقتك الصامته لي ، و التي سبقت و اخذتني إلى السماء السابعة ، شيئا ناقصا ، لم يكتمل إلا في ذلك اليوم \" و قصص أخرى هي : الأماكن - يا ما قلبي في بعدك تاه - يوم من عمري - سارة - حكايات - روح هند - حكاية من أربع زوايا - لا أحد سيعزي بالميت",
  "genres": [],
  "author": "منى عبد الفتاح",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/18515719"
}