{
  "title": "The Positive Trait Thesaurus: A Writer's Guide to Character Attributes",
  "description": "Character creation can be hard, but it’s about to get a lot easier. Inside The Positive Trait Thesaurus, you’ll find:* A large selection of attributes to choose from when building a personality profile. Each entry lists possible causes for why a trait might emerge, along with associated attitudes, behaviors, thoughts, and emotions * Real character examples from literature, film, or television to show how an attribute drives actions and decisions, influences goals, and steers relationships* Advice on using positive traits to immediately hook readers while avoiding common personality pitfalls* Insight on human needs and morality, and how each determines the strengths that emerge in heroes and villains alike* Information on the key role positive attributes play within the character arc, and how they’re vital to overcoming fatal flaws and achieving success * Downloadable tools for organizing a character’s attributes and providing a deeper understanding of his past, his needs, and the emotional wounds he must overcomeIf you find character creation difficult or worry that your cast members all seem the same, The Positive Trait Thesaurus is brimming with ideas to help you develop one-of-a-kind, dynamic characters that readers will love. Extensively indexed, with entries written in a user-friendly list format, this brainstorming resource is perfect for any character creation project.“In these brilliantly conceived, superbly organized and astonishingly thorough volumes, Angela Ackerman and Becca Puglisi have created an invaluable resource for writers and storytellers. Whether you are searching for new and unique ways to add and define characters, or brainstorming methods for revealing those characters without resorting to clichés, it is hard to imagine two more powerful tools for adding depth and dimension to your screenplays, novels or plays.”- Michael Hauge, Hollywood script consultant and story expert, author of Writing Screenplays That Sell and Selling Your Story in 60 Seconds: The Guaranteed Way to Get Your Screenplay or Novel Read",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference",
    "Research",
    "Crafts",
    "Psychology",
    "Language"
  ],
  "author": "Angela Ackerman",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/18517268-the-positive-trait-thesaurus"
}