{
  "title": "Lenin Lives Next Door: Marriage, Martinis, and Mayhem in Moscow",
  "description": "NEXT GENERATION Indie Book Awards, 2014Finalist: Travel/Travel GuidesFinalist: Humor/ComedyNATIONAL INDIE EXCELLENCE AWARDSFinalist: Comedy-HumorFinalist: TravelTHE INTERNATIONAL BOOK AWARDSFinalist: Fiction: GeneralFinalist: Best New Fiction“You have to really want to go to Russia. A brief visit involves a lot of paperwork, and, if you want to hang around for any length of time, they make you take a leprosy test.” \tFor American writer, Imperial Russian enthusiast, and veteran expatriate, Jennifer Eremeeva, this is just one of many observations about Russia, where she has lived for twenty years with “HRH” her “Handsome Russian Husband,” (although there are days when she thinks of him as her “Horrible Russian Husband”) and their daughter, Velvet. When Jennifer quits her job to write full time, she’s inspired by the grey dingy building across the courtyard, which houses a research institute dedicated to preserving Vladimir Lenin’s embalmed corpse. The result is LENIN LIVES NEXT DOOR.\tBased on Eremeeva’s two decades in Russia, LENIN LIVES NEXT DOOR knits together vignettes of cross-cultural and expatriate life with sharp observation, colorful historical background, and engaging humor. Each thematic chapter is an anecdotal exploration of an aspect of life in today’s Russia, told with the help of a recurring cast of delightful Russian and expatriate characters. LENIN LIVES NEXT DOOR introduces readers to Russians in their everyday milieux: at their dachas, in three-day traffic jams, and celebrating their 300+ public and professional holidays with mayonnaise-based salads. LENIN LIVES NEXT DOOR is Russia with just enough air let out of its tires!",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Humor",
    "Travel",
    "Russia",
    "Biography"
  ],
  "author": "Jennifer Eremeeva",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/18517734-lenin-lives-next-door"
}