{
  "title": "To Sail a Darkling Sea",
  "description": "BOOK II IN THE BLACK TIDE RISING SERIES FROM THE NEW YORK TIMES BEST-SELLING AUTHOR. Sequel to Under a Graveyard Sky. A family of survivors fights back against a zombie plague that has brought down civilization. A World Cloaked in DarknessWith human civilization annihilated by a biological zombie plague, a rag-tag fleet of yachts and freighters known as Wolf Squadron scours the Atlantic, searching for survivors. Within every abandoned liner and carrier lurks a potential horde, safety can never be taken for granted, and death and turning into one of the enemy is only a moment away.The Candle FlickersYet every ship and town holds the flickering hope of survivors. One and two from lifeboats, a dozen from a fishing village, a few hundred wrenched by fury and fire from a ship that once housed thousands...Light a FlameNow Wolf Squadron must take on another massive challenge: clear the assault carrier USS Iwo Jima of infected before the trapped Marines and sailors succumb to starvation. If Wolf Squadron can accomplish that task, an even tougher trial waits: an apocalyptic battle to win a new dawn for humanity. The war for civilization begins as the boats of the Wolf Squadron become a beacon of hope on a Darkling Sea.About John Ringo:“[Ringo’s work is] peopled with three-dimensional characters and spiced with personal drama as well as tactical finesse.” —Library Journal“. . . Explosive. . . . fans. . .will appreciate Ringo’s lively narrative and flavorful characters.” —Publishers Weekly“. . .practically impossible not to read in one sitting . . . exceedingly impressive . . . executed with skill, verve, and wit.” —Booklist“Crackerjack storytelling.” —Starlog",
  "genres": [
    "Science Fiction",
    "Zombies",
    "Horror",
    "Fiction",
    "Post Apocalyptic",
    "Fantasy",
    "Military Fiction"
  ],
  "author": "John Ringo",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/18518538-to-sail-a-darkling-sea"
}