{
  "title": "The Dogmen",
  "description": "For three hundred years the stories about a strange creature living in the north woods of Michigan have surfaced time and again. It is reported to be a man like beast with glowing red eyes and a head like a wolf, which can walk and run upright. These were just stories told around campfires thought Jerry Mathews a biologist with the US Department of Forestry. That was until the attacks began.  Nothing Jerry had learned at the university could have prepared him to face the beast that defied identification by known animal species. Nothing except an old Huron Indian man and the legends and tales he had grown up with. The following is an excerpt from The Dogmen. Joe sat down in a chair in the shade removing his wide brimmed hat and wiping the sweat from his forehead. “What is on your mind Jerry”? “You know these forests around here better than anyone, Jerry said. You have hunted and guided here all your life. I suspect you know just about every stream and tree. Your knowledge would go a long way in trying to hunt down this animal we are looking for”. Joe cast a suspicious look at Jerry saying, “Animal it is now, not wolf? Sounds to me as if you are not to certain what you are trailing son”. Jerry looked at the ground avoiding Joe’s eyes. “Truth is I am not so sure anymore”. “I don’t think a half crippled up old trapper is going to be a lot of help. True I know this area like my property here, but I wouldn’t be able to walk more than a mile the way I get along these days. You need a young man if you are looking for a guide”. “That is just it, Jerry replied looking Joe in the eye. I do need a guide, but I need what you know. Jerry hesitated a moment before saying, you know more than you are letting on”. Joe took his old brier pipe from his shirt pocket and started to pack it. “I told you what I thought the other night. It is the Dogman. I know that sounds like an old Indian telling you a children’s story but it is a fact. We have had the Dogman in our ancestral stories for as far back as I remember. Back in the 1980’s I heard that a radio station here somewhere reported a Dogman. A few days later it was said to be a hoax. In the weeks that followed there were others who claimed to have seen something. But it was all talked away as a practical joke, urban legend. But it was a Dogman, not the original report, but those that followed”. “Why do you say you know it was”? “I seen it, Joe said. The legend is true. Don’t let any of these government people tell you otherwise. They covered up the truth because they fear what the Dogman represents a spirit being that they know nothing about”. Joe struck a match and lit his pipe drawing hard until the cloud of tobacco smoke surrounded him.  “Okay, Jerry said, so what is the reason for this sudden anomaly to occur”? Joe puffed at his pipe a few times then he pointed to the trees across the river from his place. “See those trees; they are perhaps forty years old now. I remember when their big brothers stood there. All of the forest here is young now. All of the big trees were taken away back in the seventy’s. Back then there was a lot of cutting around here. Greedy men saw an opportunity to take more than they needed. I think that is why the Dogman was called back then”. “Called, Jerry asked? What do you mean called”? “He can be called by those who belong to his clan, Joe said. I heard a story as a boy of a Dogman who was called to scare the white people. It was before I was born maybe fifty or sixty years. But my father told the story of how the dogman ran along beside a team of horses pulling a buggy. He said the white farmer was so scared he went back south and abandoned his homestead. You may have noticed out in the forest here and there, old homestead farms that have been empty many years. The Dogman scared them away”. “Okay, for the sake of argument lets say that such a creature can be called upon. If that were the case then who is the man doing the calling”? Joe shook his head, “that I cannot say. He is not alone, he would have help this one doing the calling. He would need help. He needs help willing to serve him”. Jerry thought a moment then asked, “Why would he need help”? “The spirit creature is just that a spirit, Joe said. To become the Dogman he needs a human form he can work through”. Jerry actually chuckled before catching himself. “You mean like the movie wolf man. This creature is a human being that is being transformed into this monster. Joe I want to respect your belief but a wolf man”? “You can call it whatever you wish. I know, I have seen it with these old eyes. My people have talked about it in whispers for centuries. You can think what you will, but they do exist”. Sometimes the lines between legend and truth disappear when our sense of reality has nowhere else to go.",
  "genres": [],
  "author": "T.R. Wallace",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/18518445-the-dogmen"
}