{
  "title": "Time and the River: Brunei Darussalam 1947 - 2000",
  "description": "With the same nostalgic resonance consistent throughout, the book takes you through the shifting sands of time - including the birth of his people and his own childhood on the river, the instrumental role his father, Sultan Omar Ali Saifuddien, played in maintaining Brunei's independence, and his own entry into the life of 'officialdom' in the Government, steering the country by his brother's side to where she is today. In recounting history, the gritty bits are not sidestepped. He talks about Brunei's dilemma in the tug-of-war between the Malaysian Federation and the fight to keep together as a nation, the rebellion in 1962 involving a terrifying midnight siege on the Istana and the 1963 \"Konfrontasi\" inspired by communist extremists. The description of the devastation of the world wars and their global effects are atmospheric - first, World War II, and then the Cold War which was the casus belli of the turmoil and unstable conditions in South East Asia. What makes his side of the story interesting is that he, being in Foreign Affairs and then a Minister, was in the thick of it at the time. Although the book consigns a lot of chapters to political history, \"Time and the River\" is no didactic political tome. Instead, it is a simple book, a \"sweet\" (as one reader comments) collection of reminiscences and introspective musings taken from the colourful journey of a Prince's life. Of course, there are the fun sections too that tell of carefree days at Sandhurst, UK, when he was a longhaired teen in the Swinging Sixties. You can almost hear the rock and roll in the background as he takes you through the fashion and the fast cars of Carnaby Street. \"Time and the River\" is no plodder. Flowing like the current of the river from whence its inspiration was drawn, the prose moves with a pace described by another reader as, \"a page turner.\" - Helena Hon, Brunei Press",
  "genres": [],
  "author": "Mohamed Bolkiah",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/10986320-time-and-the-river"
}