{
  "title": "How To Cook in a Jiffy Even If You Have Never Boiled an Egg Before",
  "description": "Never boiled an egg before but want to learn the magic art of cooking? Then don’t leave home without this Survival Cookbook: “How to Cook in a Jiffy-even if you have never boiled an egg before”.The Book recounts, with wit and humour, the author’s own semi-autobiographical experiences of participating in “finding me a meal ritual…….(and) bumbling about in the wonderlands of cooking” in London, where he was pursuing for four years an LLB (Honours) degree as well as Legal Practice Course (LPC) Diploma.Where this book scores over other “How To” cookbooks is in the manner in which it treats no question as “too stupid”. Its next USP is its very logical and structured approach in which it follows a step by step “graduation” process.You start with some very basic cooking techniques such as how to break, poach, fry, boil (and peel) an egg, learn how to handle chicken, vegetables and fish and then “graduate” to making such “complicated” recipes as cheese omelette, vegetables au gratin, baked chicken or French Onion Soup.Most uniquely, the book teaches the concept of “sequencing and parallel processing” in cooking that should enable busy people to create a 3-4 course meal in less than 30 minutes.The book is fun and entertaining to read. The photographs used in the book are all taken by the author himself, in natural light, without using any inedible garnish or props, and of the dishes that were made right in his kitchen. These are just meant to illustrate how exactly the dish would look like if you prepared them yourself, the author assures.This book is highly recommended for all those young people who are about to start their University education and are going to live by themselves, probably for the first time in their lives, in self-catered dorms, hostels, halls of residence, apartments, whatever. They either starve themselves or survive on fast food--- sandwiches from supermarkets, instant noodles that you can have straightaway (that you don't even need to boil) etc etc…. In the process, they become deficient in vitamins, minerals, proteins and a lot of other good stuff, which is not really a good state to be in when you need to muster all your resources for excelling in your chosen courses of study.Next, the book is addressed to all those newly employed people who are about to start their careers in Mumbai, Dubai, Singapore, London, New York or elsewhere and who need to set up some very basic cooking facilities in their apartments. They have their dreams. They work hard, they would like to play hard too, but work related pressures are such that surviving on take-aways becomes the norm and sometimes even the preferred option. They, however, neither have the time nor the inclination to bother with anything but a very simple Survival Course in Cooking, which is what this book ventures to provide.The third category could be that of the single moms or dads who suddenly realize the need to acquire some basic culinary skills FAST.Finally, this book addresses the needs of the small but growing tribe of campers, and those opting to stay in self-service apartments, while on tours and vacations, who too wish to acquire somewhat decent skills in cooking.So be it healthy college cooking, or cooking for a single person or even outdoor cooking---this book promises to help you survive all situations by teaching you how to cook literally in a jiffy.",
  "genres": [],
  "author": "Prasenjeet Kumar",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/18521124-how-to-cook-in-a-jiffy-even-if-you-have-never-boiled-an-egg-before"
}