{
  "title": "Anything You Want",
  "description": "Blurb:Sydney Blake thought she had the ideal life. A dashing, successful husband and dream home were all she ever wanted. But everything wasn’t as perfect as she believed. When Sydney catches her husband, Roger, screwing another woman, Sydney files for divorce and falls into a deep depression. Her only friend, Alexandra, does everything she can to cheer Sydney up. Lexi even suggests a weekend getaway and ‘sex with a random stranger’ to get over her slimy cheating husband’s ways. But Sydney has always believed in marriage and everything it stands for. Besides, she wasn’t even divorced yet and Sydney still hoped that Roger and she would reconcile. It became apparent Roger would never change and Sydney needed to go somewhere far away from her small town for a little while. Little did she know, she was destined to be a guest at the extravagant River Jewel Resort. After meeting the charming manager of the beautiful hotel, Mark Willburn, Sydney might just learn to let down her guard and find more than she ever knew she needed.Excerpt: Sydney sat on an opulent lounge chair and berated herself for enjoying the comfortable piece of furniture. It sure beat the furniture she had at home. Home? She didn’t have a home anymore. She’d packed everything, broken her lease, and high-tailed it out of town. For what? A one way trip to the fanciest loony bin she’d ever seen? How could she have been so stupid? She could feel the fingers of despair and defeat clawing up her spine. What had she done?“Ms. Hartman?” The abrupt sound of a man’s voice caused Sydney to flinch. She hadn’t heard him approach, and it was unsettling the way people popped out of thin air at the River Jewel Resort. “Please come with me.”The man held out his arm for her to hold onto, but Sydney paid no attention to it. “Where are we going?” The nervousness in her voice was hard to disguise, and he smiled before he answered.“We’re going to my office.”“Alone?”“Yes. Will that be a problem?”“No, but just so you know I have a black-belt in karate.”“Really?” The man suppressed a snicker. “Well, that’s interesting to say the least, but I assure you your amazing karate skills will not be needed.”Sydney didn’t really know karate, but this guy couldn’t know everything about her. Could he?His name was on the office door, Mark Willburn. Now she could put a name to the too handsome, snide, and a bit unnerving man. His obviously expensive suit fit him like a second skin, and he moved with prowess like she’d never seen. Though he’d been a bit condescending, words poured from his lips like warm honey whenever he spoke.Mark offered her a seat in front of his enormous desk and sat in the chair beside hers. Though the chairs were comfortable, she sat with apprehension, eyeing the door and ready to run. “Why are you sitting there? Shouldn’t you sit behind your desk?”“Would you rather I sat behind my desk, Ms. Hartman? I will do whatever you like.”These people and their pleasing ways grated on her already exposed nerves. “Sit wherever you like, Mr. Willburn. It is none of my concern as long as you do your job.”“Well, I like to be close to our guests when they need to speak with me. I find it to be a more friendly way of doing business. Wouldn’t you agree?”“That’s not for me to decide. I care nothing about your business, whatever that may be. I want nothing to do with this fancily decorated romping palace. All I want to do is leave. I’d like my car and my luggage now.”“Why may I ask are you so adamant about leaving? Were you treated badly? Was the room horrible? Was it not everything you desire?” His voice flowed over her like a welcoming, warm bubble bath, and she fought to keep from sinking into its depths His mere gaze raised gooseflesh along her arms and lit her core on fire with need. What the hell was wrong with her? Barely single and as soon as some smart-dressed man comes along, Sydney imagines him on top of her, kissing a trail across her stomach with that mouth of his. She bit her bottom lip wishing it was him nibbling, kissing, tasting her.She mentally chided herself for the outfit she’d chosen to wear, a thin, silk shift of a dress that didn’t cover as much as she’d wanted it to right then. Braless as she was, surely he had seen her nipples rise into hard peaks when he touched her hand. How mortifying! Her divorce wasn’t even final, and just being near this man had her creaming her panties like a common street whore.“Ms. Hartman?”“Sydney, my name is Sydney.”“Very well, Sydney. Why don’t you just tell me what the problem is so we may remedy the situation?” Mark stood and went to a fully-stocked bar taking up the length of one wall in his office. “You look and sound like you could you use a stiff one. What’ll it be?”Had he really just said that? Could this get any weirder? “Tequila on ice, please.”",
  "genres": [
    "Novella",
    "Romance",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Madison Sevier",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/18519710-anything-you-want"
}