{
  "title": "Narcolepsy",
  "description": "The fight to save the Eurozone from financial ruin escalates over four days in this fast-paced thriller.It starts out like any other Thursday. In Geneva, Christine Lamontagne CEO of the World Bank, is desperately trying to negotiate a Chinese bailout of failing Eurozone banks. She fails, because the Chinese believe as she does; the situation is hopeless without significant new sources of funding. Meanwhile in London, Myles Saldana, an analyst for the World Bank, runs a financial model that shows that Spain’s central bank is essentially bankrupt. He knows that the news will spread like wildfire through the financial markets because no one will be able to stop the chain of central bank failures that’s coming. His boss, Arnold Minter, sees that the head of the Italian central bank has been killed in a suspicious automobile accident. He immediately calls Lamontagne to tell her the news: this means that the “2% list” is complete. “Genady was the last one,” he says. Minter calls Myles into his office and tells him he’s sending him a file called the 2% list as “insurance.” And then commandos break in, guns blazing, and it ceases being like any other Thursday. In the space of three minutes, Minter is killed, and the commandos realise that Myles Saldana has been given the secret 2% list. Myles barely evades the commandos chasing him desperately trying to secure the list. Saldana escapes the office, only to be pursued to his flat, where a deadly confrontation with a “policeman” convinces him that he has to leave London and fast. He can’t trust anyone and he can’t go to the authorities, so he boards a Eurostar to Paris one step ahead of his pursuers and the authorities.By Friday the financial markets are in turmoil, as news of Spain’s default becomes known. In Geneva, Lamontagne reaches out to a mysterious financier named “Hugo” to confirm that the so-called 2% list is complete, and to confirm a meeting on Sunday to engineer a rescue of certain Eurozone banks. In Paris, Myles has linked up with Zoe Cruz, a beautiful young heiress who has a not-so-secret crush on him. As he discovers that the “2% list” contains the names of high ranking bankers and law enforcement officials, he is again confronted by armed men determined to kill him. He begins to wonder – are the list and the turmoil in the financial markets connected? And then it dawns on him – if he survives the weekend, will the markets be able to open on Monday? Narcolepsy is the fast-paced thriller from established author Eric James Fullilove. Fullilove delves into a financial underworld where those who are really in charge of the banks are not their CEOs. Narcolepsy unravels expeditiously over four days; it is a surging thriller which charts the dark and duplicitous events which will lead to a new world order where corruption will be commonplace. The sequel to the book is due out at the end of 2013 and will pick up where Narcolepsy left off.",
  "genres": [
    "Thriller",
    "Fiction"
  ],
  "author": "Eric James Fullilove",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/18522178-narcolepsy"
}