{
  "title": "Taken by the Cops",
  "description": "Serena's sexual adventures continue as she runs out of gas in the desert and two horny cops come to her rescue. Strip searched and given a full body-cavity search should have her outraged, but instead she's wanting more. This SHORT STORY is suitable for 18+ only. It features hot, public sex, a menage a trois, anal play and more!As she dug in her purse, he continued to question her. \"Have you been drinking this evening?\"She shook her head and handed him the required documents. \"No, sir.\"\"Well, when we find someone asleep on the side of the road, it's standard procedure to run through a few tests. Please step out of the car.\"Rolling her eyes, she opened the door and stepped out. The officer could have smelled alcohol on her breath if she'd been drinking, so there was no reason for him to suspect it. Her high heels wobbled in the gravel on the shoulder of the road and she put her hand on the roof of the car to stabilize herself.The officer glanced at his partner who had come around from the passenger side of the car. \"She seems a bit unstable on her feet.\"\"That's because of my shoes,\" she argued, stepping out of them. She held her arms out to show she didn't need support. \"See, now I'm fine.\"\"We'll need to run a few tests, regardless. Now, come around to the back of your car.\"She followed the two men, wishing she weren't traveling alone. In spite of the fact they were cops, they were easily twice her size, and she'd heard stories about women who got stopped late at night. Just the thought of what they could do to her sent shivers coursing over her skin, although her nipples tightened in excitement.Her tank top clung like a second skin, so she knew they could see her major headlight problem as she stood in the beams from their car. She wished she could pull her cut-offs out of her butt crack to be more comfortable, but she wasn't about to do anything like that with them watching.\"Put your hands on the trunk of your car,\" the first officer ordered.As she turned her back on them to do so, she asked, \"Why? I wasn't doing anything. I was sitting in my car waiting for gas.\"\"Is someone bringing you a gas can?\"\"No. My phone couldn't find a signal so I didn't call anyone.\"\"All right then, put your hands on the trunk like you were told.\" He stepped up behind her and kicked at her ankles. \"Spread your feet apart.\"She did, grimacing at the sharp rocks cutting into her soles.The officer handed his flashlight to his partner and, with both hands, began to pat down her body. At first his actions seemed routine, moving his palms over her sides and between her breasts, but then he cupped them both and squeezed.She jumped in suprise. Her breasts swelled in his hands, and her nipples tightened even more. Without a bra on, there was nothing but a thin layer of fabric between his hands and her skin. The warmth of his palms heated her, burning a trail when they moved down her front.One hand tried to slide beneath the waistband of her shorts, but they were too tight. He tore at the button and yanked the zipper open.\"What are you doing?\" she cried.",
  "genres": [
    "Erotica",
    "Menage",
    "Short Stories",
    "Contemporary",
    "Adult",
    "M F M"
  ],
  "author": "Roxy Jacobs",
  "average_rating": "2.83",
  "url": "https://www.goodreads.com/book/show/10989094-taken-by-the-cops"
}