{
  "title": "Her Russian Protector Boxed Set: Volume 1",
  "description": "Three ridiculously sexy Russian hunks wrapped up in one volume!*This boxed set includes the first three bestselling books in the Her Russian Protector series: IVAN, DIMITRI and YURI.*IVAN (Her Russian Protector #1)Desperate to find her sister, Erin goes to the only man in Houston who can help her--Ivan Markovic. The intimidating, tattooed Russian operates one of the most elite mixed-martial arts training centers in the world but it's his shadowy past and reputed connections with Houston's underworld that interest her most.To find her sister, she'll need the help of her big, scary Russian protector--but asking for help from a man like Ivan carries a steep price, one that might just include her heart.DIMITRI (Her Russian Protector #2)Refusing to lose her brother to the violent Hermanos street gang, Benny turns to Dimitri, the dead sexy Russian who lives in the apartment above her family's bakery. He's the only man tough enough to get through to Johnny and save him from a life in prison--or worse.There's nothing Dimitri won't do for Benny, even if it means dealing with her troublemaking brother. He quickly realizes that it's not just Johnny and his thug friends that pose a threat to Benny. A shady real estate developer needs to buy her bakery to secure a multi-million dollar deal and he'll stop at nothing to make her sell.Threatened from all sides, Benny finds safety in Dimitri's strong arms--and in his bed. Her big, sexy Russian has no intention of ever letting her go--and he'll brave the fires of hell before he lets anyone harm her.YURI (Her Russian Protector #3)While clawing her way out of Houston's worst neighborhood, Lena vowed to never let any man have power over her. After a lifetime of broken promises from her criminal father and a mother who abandoned her, Lena believes that love makes you vulnerable. She's never been tempted to test that belief...until Yuri.Sexy as sin and with a dark reputation, Russian billionaire Yuri Novakovsky survived a miserable childhood of poverty and neglect to ascend the pinnacle of success. He enjoys the perks of his massive wealth without much thought to the consequences...until Lena.When Lena's father and cousin blunder into an international art theft operation, Yuri seizes his chance to be her protector. But when past misdeeds catch up with him and threaten Lena's safety, Yuri puts her love and trust in him to the test.He'll prove he's the man she needs--a man she can depend upon and trust--one sensual, wicked kiss at a time.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Anthologies",
    "Amazon",
    "Erotica",
    "Romantic Suspense"
  ],
  "author": "Roxie Rivera",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/18522340-her-russian-protector-boxed-set"
}