{
  "title": "¿La izquierda contra la Ilustración?",
  "description": "La izquierda —socialista, comunista, anarquista— siempre se ha sentido heredera del legado de la Ilustración y de la Revolución francesa. Ahora parte de ella reniega de él. Influida por un confuso pensamiento posmoderno —con Heidegger y Foucault como grandes maestros—, no se da cuenta de que sus críticas a la Ilustración son las mismas que las de los contrailustrados, reaccionarios y ultraconservadores.\"Por izquierda designamos aquí, de manera deliberadamente amplia —escribe la autora—, al conjunto de posiciones portadoras explícitamente de proyectos de subversión del orden existente (político, social, económico) en favor de los oprimidos desde la Revolución francesa. Muy a menudo, los oprimidos se distribuyen en el discurso de las izquierdas en tres grupos principales: en primer lugar, las víctimas económicas del sistema de dominación (los proletarios, los explotados, la clase obrera); a continuación, las víctimas sexuales (las mujeres, los homosexuales); finalmente, las víctimas raciales (los pueblos colonizados, las minorías étnicas, los inmigrantes). La preocupación por la opresión socioeconómica es la señal más destacada de las ideologías de izquierda, pero las otras dos están presentes tanto en los textos como en las luchas concretas desde el siglo XVIII: aquí no serán consideradas como secundarias\".Stéphanie Roza (1979) es filósofa, doctora en filosofía, profesora en la universidad de Montpellier, investigadora en el CNRS. Está especializada en la Ilustración, en la filosofía de la Revolución francesa y en los orígenes del socialismo en los siglos XVII y XVIII. Es autora de los libros Comment l’utopie est devenue un programme politique (Classiques Garnier, 2015), ¿La izquierda contra la Ilustración? (Fayard, 2020) y Lumières de la Gauche (Éditions de la Sorbonne, 2022), que será publicado próximamente en esta colección. Es autora de los epílogos al Diccionario de ateos de Sylvain Maréchal y al Código de la naturaleza de Morelly, de próxima publicación, ambos en la colección 'Los ilustrados'.",
  "genres": [],
  "author": "Stephanie Roza",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/185213360-la-izquierda-contra-la-ilustraci-n"
}