{
  "title": "Return to Sender",
  "description": "Follow up to Letters to Nowhere, an Amazon #1 Bestseller in teen sports fiction!IMPORTANT! Note from the author—Karen and Jordan's story will continue in shorter installments with more frequent releases. If you haven't already, please check out the full length novel, LETTERS TO NOWHERE to read how the story began.ABOUT RETURN TO SENDER (Letters to Nowhere Volume 2)If only summer could last forever…Karen and Jordan might be out in the open with their relationship, but that doesn't make it any easier for them to face events looming in the future. Like Jordan leaving for college halfway across the country. Or Karen's win at a big international gymnastics competition setting the bar high for her future and adding pressure like she's never experienced before. But when Nina Jones (aka-US Gymnastics Dictator), makes plans for Karen and teammate Stevie to train at a gymnastics camp for a month—the same camp where Jordan coaches—romantic summer interludes replace their fears of being apart. Both Jordan and Karen know that when fall comes, some very tough decisions will have to be made, but for now, it’s stolen kisses, racing hearts, and whispered words.EXCERPT FROM RETURN TO SENDERCHAPTER ONE~KAREN~Bars.If I had to pick one event I’d rather not begin with during my very first senior international competition, it would be uneven bars. So naturally, that’s exactly where Team USA is starting for Day One of the Pan American championships.I’m leaning over the chalk bowl, reminding myself to breathe, and watching my oldest teammate, Stevie Davis, warm up her routine when Coach Bentley comes up behind me, resting his hands on my shoulders.“Words of wisdom,” he says.I inhale and nod, staring straight ahead. I could use a few notes from the former World Champion.“Enjoy it while you can,” Bentley says.I turn around, my forehead wrinkling. “What?”He cracks a smile, but his focus is one hundred percent devoted to Stevie, who’s finishing up her routine. “The National Team committee wants you here for the experience. If you screw up, it’s no big deal, but after this—”“I get the veteran label.” I swallow back the fear and shake out my arms.Bentley rushes up to the competition stage as Stevie lands her dismount. Each of the four pieces of equipment gets its own podium to sit on so the crowd has a good view of each performance. Of course this set up only happens at major elite gymnastics competition. He’s right beside her, giving corrections and advice quietly, making large gestures with his hands. I pace in front of the chalk bowl, blowing air through my cheeks. It’ll be fine. I’m gonna nail it and then no UCLA this month. No leaving Jordan.Focus. Boys out. Gymnastics in.My gaze travels up the stands until I spot Blair and Ellen, my younger teammates who train at my gym in St. Louis. They’ve already won their competition. The junior teams competed this morning. Both are wearing identical warm-ups and have gold medals hanging around their necks.I really want a gold medal. My stomach cramps up. I rub my knuckles over the front of my blue and white Team USA leotard, making sure not to ruin the perfect chalk-job I did on my grips. Brazil is hot and the food is weird. We’ve been here two weeks and my digestive system is just now going back to normal. Hopefully, I can get through a bar routine without an emergency run to the bathroom.The Canadians over on floor exercise are stirring up loud cheers from the full-house crowd and there’s a Brazilian gymnast on vault whose name is screamed from the stands at least once a minute. We aren’t the favorites here. Though we are favored to win. It gets a bit uncomfortable when those two things don’t line up.I wish my parents were here. I wish they were alive to witness this. My lawyer father often walked into courtrooms with half the room hating his guts. He’d have the perfect joke about this crowd’s animosity toward Team USA to loosen me up. Or he’d reference some rock band from his time that I’ve never heard of, but were apparently famous for “sticking it to the man,” and lecture me about how they performed despite negativity because they believed in their music so strongly. And then I’d Google image search the band and ask when I’d be allowed to tattoo my body to show my passion for gymnastics.My chest tightens, thinking about my parents. Thinking about all the conversations that we won’t have.God, I miss them. Alicia, another Team USA member, finishes her warm-up bar routine, signaling that it’s my turn to charge up the steps. Bentley’s already adjusting the bars to my settings, chalking the high bar for me. He gives me a nod and I jump into my mount.I haven’t competed up on a podium in nearly a year and never for a crowd this big and diverse.While swinging through my circling skills to a handstand on the low bar, I’m thinking about Bentley’s words of wisdom. Enjoy it while you can. But what does that mean? What am I going to feel at the next meet? More pressure, more nerves? Will I want to hold back and not go for more amplitude and height out of fear of falling on my face?I catch my release from low bar to high bar perfectly and after changing my grip in preparation for my new release move, a layout Jaeger, I decide my method of enjoying the moment means going full-out and taking this release as high as I possibly can.Coach Bentley is positioned underneath me. This new skill still makes him nervous, though he hides it very well. I swing under the bar, my back and hips leading the way at first, my toes flying past my coach and heading toward the high arena ceilings. I release the bar, flipping high above it, giving me tons of time to see the bar and reach for it.I reach.And reach.My fingertips make contact with the high bar and then just as quickly, they’ve slipped off and my body is heading for the deep blue sea of mats beneath the uneven bars.",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Romance",
    "Sports",
    "New Adult",
    "High School"
  ],
  "author": "Julie Cross",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/18524333-return-to-sender"
}