{
  "title": "How the Rama Empire disappeared 10,000 years ago : 3 magical tales from the Ramayana",
  "description": "● 10,000 years ago, a cataclysm nearly destroyed the entire planet ! (Worldwide geological evidence of this cataclysm is unmistakable.)● This cataclysm laid waste to dozens of super civilizations whose level of technological attainment far surpasses that of our own. (Archaeologists all over the world are still stumbling upon exotically engineered artefacts, some of which are hundreds of millions of years old !)Based on exciting new scientific research that points to the existence of technologically advanced civilizations in the distant past and some obvious clues within the Ramayana itself, the author provides a thrilling retelling of a few magical episodes from the Ramayana in what is claimed to be the first non fiction version that portrays the Rama Empire as a technologically advanced society and ... for the first time in modern literary history ... also offers a plausible solution to the long standing mystery of the disappearance of the entire Rama empire which occured around 10,000 years ago. A brief synopsis of the Ramayana  - The very first Ramayana - the Moola Ramayana - was believed to have been written by one of the gods of the Trinity - Vishnu - in his incarnation as Hayagriva. Incredibly, this version was written long before the incidents of the Ramayana even took place ! The Ramayana is the true story of Prince Rama - believed to be one of the incarnations of Vishnu. His aging father, King Dasharatha, bound by a promise to his second queen, Rama's stepmother, sends Rama into exile so that his stepbrother, Bharata, could be crowned the King. Rama's wife, Sita and his other stepbrother, Lakshmana voluntarily chooses to join Rama in exile. In addition to the hardships in exile, Rama had to face and prevail over the demon king Ravana's forces who were creating havoc in the region. In a cruel twist of fate, Ravana manages to take Sita hostage thus setting the stage for a horrendous final battle that literally shook the earth and heavens through the sheer ferocity of the destructive forces of sorcery and technology that were unleashed.",
  "genres": [
    "India",
    "Nonfiction"
  ],
  "author": "Lakshmi Hayagriva",
  "average_rating": "2.33",
  "url": "https://www.goodreads.com/book/show/18523472-how-the-rama-empire-disappeared-10-000-years-ago"
}