{
  "title": "Rethinking Debussy",
  "description": "Composer, pianist, and critic Claude Debussy's musical aesthetic represents the single most powerful influence on international musical developments during the long fin de siècle period. The development of Debussy's musical language and style was affected by the international political pressures of his time, beginning with the Franco-Prussian War of 1871 and the rise of the new Republic in France, and was also related to the contemporary philosophical conceptualization of what constituted art. The Debussy idiom exemplifies the ways in which various disciplines - musical, literary, artistic, philosophical, and psychological - can be incorporated into a single, highly-integrated artistic conception. Rethinking Debussy draws together separate areas of Debussy research into a lucid perspective that reveals the full significance of the composer's music and thought in relation to the broader cultural, intellectual, and artistic issues of the twentieth century.Ranging from new biographical information to detailed interpretations of Debussy's music, the volume offers significant multidisciplinary insight into Debussy's music and musical life, as well as the composer's influence on the artistic developments that followed. Chapters \"Russian Imprints in Debussy's Piano Music\"; \"Music as Encoder of the Unconscious in Pelléas et Mélisande \"; \"An Artist High and Low, or Debussy and Money\"; \"Debussy's Ideal Pelléas and the Limits of Authorial Intent\"; \"Debussy in Toward Early Modernist Hearing in the United States\"; and more.Rethinking Debussy will appeal to students and scholars of French music, opera, and modernism, and literary and French studies scholars, particularly concerned with Symbolism and theatre. General readers will be drawn to the book as well, particularly to chapters focusing on Debussy's finances, dramatic works, and reception.",
  "genres": [
    "Music"
  ],
  "author": "Elliott Antokoletz",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/10990421-rethinking-debussy"
}