{
  "title": "Become Courageous Abeba: A Story of Love, Loss, War and Hope",
  "description": "A mother’s love knows no boundaries. Abeba Habtu is met with war, poverty, domestic violence, and terrible human rights violations, yet she remains strong for the sake of her children. Her life is a testament to just what a mother is willing to endure for her children. This is true in any time and place, even Eritrea, Africa, where death and unjust imprisonment is all too familiar. The tiny country has fought for its independence and survival for many decades. It’s sometimes called the “North Korea of Africa” due to its human rights violations and lack of international media presence. You’ve probably never heard of it because it ranks dead last on the World Press Freedom Index. Abeba was born in this war-torn country. She was forced to marry an abusive older man. She has run from bullets and seen bombs fall from the sky, lost loved ones, been thrown into prison, and then escaped the country with her two youngest sons. Abeba is now in Germany where she is battling cancer. “Despite all my hardships, I am blessed and remain hopeful for the future,” Abeba says. “Sometimes my story is hard to stomach, but I believe it may inspire others who are struggling through domestic violence, are stuck in a seemingly powerless situation, or battling life-threatening illness.”Why this book with its accompanying risk? Abeba's amazing story demanded to be told. It gives voice to domestic violence, human rights violations, and gender inequality. But it doesn't beg for sympathy. It offers hope and inspiration in the face of injustice and cruelty. Read BECOME COURAGEOUS ABEBA and get an inside look into an extraordinary life in a country that has kept the world out for decades.This story is autobiographical fiction. It is based on Abeba’s life, but names, places, and some events have been changed in order to protect the family and add to the reader’s experience.",
  "genres": [],
  "author": "Abeba Habtu",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/18523801-become-courageous-abeba"
}