{
  "title": "Rockstar Romance Boxed Set",
  "description": "Sizzling romance that rocks!From sinfully hot guitarists to wildly aggressive, dominant heavy-metal rockers, these are the bad boys of the music industry. This special collection brings you 12 of the hottest rockstar romance stories ever told from many of your favorite authors.Now get a DOZEN novels and novellas all featuring deliciously naughty rock stars by the hottest New York Times, USA Today, Amazon and Barnes & Noble bestselling authors in the rock & roll romance genre all together in one amazing boxed set.So, bring your lighter and get ready to toss your panties on stage!\nMeeting Trouble\n by Emme Rollins - Sabrina can’t believe her luck—she’s always dreamed of front row seats to see her favorite band, “Trouble,” but when she bumps into lead singer, Rob Burns, and he invites her backstage, she finds herself hoping her luck doesn’t run out—and that maybe, just maybe, all her dreams will come true.\nWicked\n by Arabella Quinn - Second chances don’t always come knocking... When Lena reunites with Alex Lavigne, gorgeous lead guitarist with the sexy tattoos and nimble fingers, passions ignite...but she’ll learn the hard way that loving a bad boy rock star is never easy.ROCKED: DEX & BECCA, compilation of Hard Rocked, Deep Rocked & Well Rocked by Clara Bayard - With music in her blood, Becca’s new job with Dream Defiled is a chance of a lifetime. But the irresistible pull of troubled bass player, Dex, raises the stakes for the plus-size beauty, and could be the start of something wonderful, or the end of everything she’s worked for.\nHard Rock Arrangement\n by Ava Lore - Chronic loser Rebecca Alton lands a job as the fake-girlfriend (read: 24/7 babysitter) of the music world's current heartthrob and wild child, Carter Hudson, but it's Kent--her boss, Carter's older brother and bassist for Carter's band--that catches her eye and the ensuing white hot attraction may just be too much to keep under wraps! Originally published as a four-part serial \"Rock Arrangement:\"\nExclusive Interview\n\nExclusive Contract\n\nExclusive Access\n\nExclusive Engagement\n\nRock Hard\n by Adriana Hunter - When they meet face to face, sparks fly, and the room is charged with electric, undeniable heat. A mixture of pain and pleasure, where history means something and instant attraction is remembered and perhaps rekindled. Can Gage look beyond the past and ever see Kate as anything but a cold heart-breaker who abandoned him?\nMarooned with the Rock Star\n by Dawn Steele - Rebecca Hall never thought she would be marooned on a deserted island with the guy she hates most in the world, gorgeous rock star Kurt Taylor, until the fates throw them together to sink, swim or perish.\nRock & Roll Curves\n by D. H. Cameron - Darcy loved rock & roll but she never thought she could attract a rock star until Gage Tucker, lead singer of Dark Fire Love, walked into her life and proved that some men, even rock stars, love a girl with curves.\nCury Girls Rock\n by Virginia Wade/Ashlee Alexander - From the moment Brandi and rocker Ax Stevenson meet, sparks fly and libidos explode, as they find themselves hopelessly attracted; yet, in this climate of self-destruction, lust, and insanity, can two soulmates find the courage to surmount all obstacles and be together?\nAll Access\n by Karolyn James - Chasing Cross lead singer, Johnnie, has a major career decision to make and it doesn't include meeting a woman who doesn't know who he is... and it definitely doesn't include falling for her and turning his rockstar world upside down with romance.\nRocking Her Curves\n by Aubrey Rose - When rock star Asher meets Trixie, he's smitten by her curves - but she's the lead singer for his opening band: strictly off-limits. Then their paths collide - literally! - and they're forced to look temptation in the face...\nThe Rock Star And The Girl From The Coffee Shop\n by Terry Towers - Hanna is small town girl just trying to make a living serving coffee at the local coffee shop, but all that changes when a car accident brings rock legend, Bo Savage, into her life. She quickly comes to realize that being the girlfriend of a rock star is harder than expected as she's pulled into a world of sex, drugs and rock and roll.New Sensation & Run to You by Clare Cole - Down on her luck and working two jobs to make ends meet, curvy redhead reporter Amy Reid's life is turned upside down when she is swept off her feet by international rock superstar Rick Borrell.",
  "genres": [
    "Romance",
    "Anthologies",
    "Music",
    "Erotica",
    "Contemporary Romance",
    "Musicians",
    "New Adult"
  ],
  "author": "Emme Rollins",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/18522988-rockstar-romance-boxed-set"
}