{
  "title": "The Reddington Scandal",
  "description": "When Phoebe’s brother-in-law catches the notorious rake Lord Fenton in his home late at night, half-dressed and obviously attempting escape, he flies into a rage, threatening to kill both his wife and Lord Fenton. In a desperate measure to avert bloodshed, Phoebe claims she is Lord Fenton’s lover, thereby forcing him to take her as his wife to avoid a scandal.Knowing full well a philanderer like Teddy Fenton could never remain faithful, Phoebe insists upon separate bedrooms, resolving to resist his charm rather than fall in love and face the pain of his inevitable infidelity. Her handsome husband respects her request for a marriage in name only, but his marital dominance manifests itself in other ways. She soon learns that while he will not force her to his bed, Teddy is more than willing to take her over his knee and spank her bare bottom when her behavior warrants it.Doubting his ability to stay faithful and not wishing to replicate his parents’ miserable existence, Teddy had never intended to take a wife, until he was forced to marry the lovely Phoebe Fletcher and everything changed. Suddenly other women hold no allure for him, and he wants nothing more than to win the affection of his new bride. But just when it seems he might succeed, secrets from her past threaten to destroy their chance at happiness. Can this couple come to love one another as befits a man and wife, or will their marriage end in scandal after all?Includes special bonus story Disobedience at the Dressmaker'sPublisher’s Note: The Reddington Scandal is an erotic romance novel that includes both consensual and non-consensual spankings, anal play, graphic sexual scenes, and more. If such material offends you, please don’t buy this book.",
  "genres": [
    "Historical",
    "Romance",
    "Historical Romance",
    "BDSM",
    "Regency",
    "Erotica",
    "Novella"
  ],
  "author": "Renee Rose",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/18523150-the-reddington-scandal"
}