{
  "title": "Sebastian's Way: The Pathfinder",
  "description": "In a dark age of unending war and violence, one young warrior opposes a mighty king to forge a new path to peace…During the savage Frankish-Saxon wars, the moving force of his age, Karl der Grosse, King Charlemagne, fights and rules like the pagan enemies he seeks to conquer. But in the long shadow of war and genocide, a spark of enlightenment grows, and the king turns to learned men to help him lead his empire to prosperity.One of these men is the unlikely young warrior Sebastian. Raised in an isolated fortress on the wild Saxon border, Sebastian balances his time in the training yard with hours teaching himself to read, seeking answers to the great mysteries of life during an age when such pastimes were scorned by fighting men. Sebastian’s unique combination of skills endears him to Charlemagne and to the ladies of the king's court, though the only woman to hold his heart is forbidden to him. As the king determines to surround himself with men who can both fight and think beyond the fighting, Sebastian becomes one of the privileged few to hold the king’s ear.But the favor of the king does not come without a cost. As Charlemagne's vassals grapple for power, there are some who will do anything to see Sebastian fall from grace, including his ruthless cousin Konrad, whose hatred and jealousy threaten to destroy everything Sebastian holds dear. And as Sebastian increasingly finds himself at odds with the king’s brutal methods of domination and vengeance, his ingrained sense of honor and integrity lead him to the edge of treason, perilously pitting himself against the most powerful man of his age.This fast-paced adventure story brings Charlemagne's realm to life as the vicious Christian-pagan wars of the eighth century decide the fate of Europe. Filled with action, intrigue, and romance, Sebastian's Way is a riveting and colorful recreation of the world of Europe’s greatest medieval monarch.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "George Steger",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/18523548-sebastian-s-way"
}