{
  "title": "The Shadow Sorceress",
  "description": "L.E. Modesitt, Jr. has developed a wide readership with his popular fantasy novels set in the universe of Recluce. With more than a million copies in print, he continues to build a substantial audience with each new volume. He widened that audience with the first three-volume Spellsong Cycle set in a compelling and imaginative world where music is the vehicle for the creation and wielding of magic. He now returns to that universe for a new cycle of tales starring a new heroine who must face a series of deadly political and military threats.The Shadow Sorceress continues the story begun in the first Spellsong Cycle but focuses on the challenges facing Secca, now a young Sorceress. She is thrust into a position of power and responsibility when her mentor, Anna, the legendary Sorceress Protector of Defalk and the heroine of the original trilogy, dies unexpectedly before Secca's training as a master magic wielder is anywhere near complete.Despite her reservations concerning the skills and strength of her ruler, Secca must immediately take command of all her magical resources to help suppress internal dissension in a neighboring province. Then she must rally potential allies to lift the naval siege laid on Nordwei by the Sea Priests, who bring with them a new kind of drumming magic that threatens the balance of power in the world, portending danger and destruction not imagined for decades.Secca learns to fight battles effectively using sorcerous skills she has never used before, all while leading an army for the first time. She must master diplomacy in order to save her ruler and his kingdom, form alliances with unfriendly potential allies and mediate power struggles among ambitious and disparate societies. At the same time, she discovers the unexpected potential for love and companionship in a world where few men are wise enough to value women as anything more than wives, mistresses or mothers.Coping with it all, Secca proves herself more than just a quick study, but a woman with a limitless capacity for courage, personal growth and fearless commitment to survival and fighting the good fight.The Shadow Sorceress is the first book of the second Spellsong cycle and the fourth book set in Erde, the world of musical magic.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Epic Fantasy",
    "Magic",
    "High Fantasy",
    "Science Fiction"
  ],
  "author": "L.E. Modesitt Jr.",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/185252.The_Shadow_Sorceress"
}