{
  "title": "An Invisible Thread: The War in the Orion Arm",
  "description": "By the year 3335, Earth has expanded its sphere of influence out beyond the solar system. Interstellar trade with alien species is commonplace, as is competition with other advanced, sentient species for resources in deep space. Constantly changing vantage points provide a wild ride and a thrilling view of future Earth. Metropolises that cover North America's continental shelves, body-implanted wetware, faster-than-light travel, and contact with alien lifeforms have caused a sea-change in Earth culture and the average human's thoughts about life, religion, and even ancient history. An Invisible Thread is a chronicle of a critical period in Earth's future history powered by Byzantine political machinations, visions of violent combat on exotic worlds, and contact with bizarre, alien lifeforms. The compelling stories of vulnerable, flawed, heroic and tragic characters are related through an adventure both intimate in its perspective and galactic in its overall scope.Erin Broctrup, a 19-year-old high school graduate, decides to sign up for a tour with the Earth Exploration and Expansion Fleet. The plan is to help catalogue planetary resources and map alien worlds in an adventurous move designed to net her some unique life experience and a free ride at a government school of higher learning, but she gets far more than she bargained for when all-out, interstellar war breaks out.Mammoth, lobster-shelled, multitentacled Mraenine, a yuvynn member of an experimental cross-species fighting unit within the Earth's Battle Fleet, has bravely signed up for recon and combat on the farthest borders of his planetismal group's sphere of influence. Earth has entered into a unique alliance with his people's governmental ruling body.But humans and yuvynn aren't the only species vying for planetary claims in the so-called Fertile Arc of the Orion Arm. Lives will be lost, bodies shattered, and psyches indelibly altered in the struggle for dominance out on the border. As corporate entities and world-spanning governments strain to take by force what they presume they can obtain, the lives of common citizens get swept up in the programs, policies and politics of interstellar expansion.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Robert Lee Wolfe",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/18527183-an-invisible-thread"
}