{
  "title": "On the Run: Fugitive Life in an American City",
  "description": "Forty years in, the War on Drugs has done almost nothing to prevent drugs from being sold or used, but it has nonetheless created a little-known surveillance state in America’s most disadvantaged neighborhoods. Arrest quotas and high-tech surveillance techniques criminalize entire blocks, and transform the very associations that should stabilize young lives―family, relationships, jobs―into liabilities, as the police use such relationships to track down suspects, demand information, and threaten consequences.Alice Goffman spent six years living in one such neighborhood in Philadelphia, and her close observations and often harrowing stories reveal the pernicious effects of this pervasive policing. Goffman introduces us to an unforgettable cast of young African American men who are caught up in this web of warrants and surveillance―some of them small-time drug dealers, others just ordinary guys dealing with limited choices. All find the web of presumed criminality, built as it is on the very associations and friendships that make up a life, nearly impossible to escape. We watch as the pleasures of summer-evening stoop-sitting are shattered by the arrival of a carful of cops looking to serve a warrant; we watch―and can’t help but be shocked―as teenagers teach their younger siblings and cousins how to run from the police (and, crucially, to keep away from friends and family so they can stay hidden); and we see, over and over, the relentless toll that the presumption of criminality takes on families―and futures.While not denying the problems of the drug trade, and the violence that often accompanies it, through her gripping accounts of daily life in the forgotten neighborhoods of America's cities, Goffman makes it impossible for us to ignore the very real human costs of our failed response―the blighting of entire neighborhoods, and the needless sacrifice of whole generations.",
  "genres": [
    "Nonfiction",
    "Sociology",
    "Anthropology",
    "Politics",
    "Race",
    "Ethnography",
    "Crime"
  ],
  "author": "Alice Goffman",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/18526889-on-the-run"
}