{
  "title": "Love Never Dies: How to Reconnect and Make Peace with the Deceased",
  "description": "Find out why  the world has fallen in love with Love Never Dies , the no. 1 international bestselling book by famed relationship therapist, author and media personality Dr. Jamie Turndorf, aka Dr. Love.Famed relationship therapist, author and media personality Dr. Jamie Turndorf -- known worldwide as Dr. Love -- shares the amazing true story of her spiritual reconnection with her beloved deceased husband, internationally renowned former Jesuit priest Emile Jean Pin. Discovering for herself that  relationships don't end in death , Jamie recounts her remarkable experience where, through the depths of her grief after Jean's sudden passing, her husband made known his continued presence--and undying love. Drawing on these personal encounters, Jamie has created a  ground breaking new form of grief therapy  that combines her  acclaimed conflict-resolution techniques  with after-death communication. The   an unprecedented method that enables the bereaved to reconnect, resolve unfinished business, and make peace with the deceased. Filled with dozens of examples of spirit contact and communication,  this book eliminates any doubt about life after death  and shows that contact is ongoing. Loved ones in spirit don't just linger briefly before going to \"heaven\" and disappearing from your life. Rather, heaven is a state, not a place, and your loved ones have an eternity to support you and heal any issues left behind when they passed on. Come to recognize the numerous signs from spirit that you may have been missing.  Learn to trust yourself and the process that's right for you --not a shortened, artificial grief period prescribed by conventional doctors. Practice techniques for heightening your senses, expanding your awareness, and entering an open state, culminating in Jamie's method for Dialoguing with the Departed.  When connection and love live on, fear is banished and relationships can grow and heal as never before. Begin opening your mind and your heart today!",
  "genres": [
    "Spirituality"
  ],
  "author": "Jamie Turndorf",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/18527676-love-never-dies"
}