{
  "title": "Pills and Starships",
  "description": "In this richly imagined dystopic future brought by global warming, seventeen-year-old Nat and her hacker brother Sam have come by ship to the Big Island of Hawaii for their parents' Final Week. The few Americans who still live well also live long—so long that older adults bow out not by natural means but by buying death contracts from the corporates who now run the disintegrating society by keeping the people happy through a constant diet of \"pharma.\" Nat's family is spending their pharma-guided last week at a luxury resort complex called the Twilight Island Acropolis.Deeply conflicted about her parents' decision, Nat spends her time keeping a record of everything her family does in the company-supplied diary that came in the hotel's care package. While Nat attempts to come to terms with her impending parentless future, Sam begins to discover cracks in the corporates' agenda and eventually rebels against the company his parents have hired to handle their last days. Nat has to choose a side. Does she let her parents go gently into that good night, or does she turn against the system and try to break them out?But the deck is stacked against Nat and Sam: in this oppressive environment, water and food are scarce, mass human migrations are constant, and new babies are illegal. As the week nears its end, Nat rushes to protect herself and her younger brother from the corporates while also forging a path toward a future that offers the hope of redemption for humanity. This page-turning first YA novel by critically acclaimed author Lydia Millet is stylish and dark and yet deeply hopeful, bringing Millet's characteristic humor and style to a new generation of young readers.",
  "genres": [
    "Young Adult",
    "Dystopia",
    "Science Fiction",
    "Fiction",
    "Post Apocalyptic",
    "Audiobook",
    "Speculative Fiction"
  ],
  "author": "Lydia Millet",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/18528033-pills-and-starships"
}