{
  "title": "Love Letter Collection",
  "description": "A TIMELESS ROMANCE ANTHOLOGY: LOVE LETTER COLLECTION: Readers will love this collection of six novellas—three contemporary and three historical—all with one thing in common: Romance.In MAGGIE'S SONG, a charming story by Karey White, Maggie Jensen is part of a trio of best friends with Lucas and Dan. Together, they own and run Wild Country Hiking Tours. When Lucas returns to the company after getting his college degree, Maggie realizes that the crush she had on him as a teenager has now blossomed into so much more. But Lucas still treats her as one of the guys, and Maggie worries that if she tells him her real feelings, their relationship will be damaged forever.In JUST FLY, Krista Lynne Jensen's captivating novella, Wren is faced with the devastating news of her grandfather's death. But when her mom finds a mysterious letter from a woman named Dot in Seattle, Wren decides to visit the woman herself to deliver the news in person. Wren learns of the bucket list Dot and Gramps had put together with the help of Dot's grandson, Seth, and Dot challenges Wren to take her grandfather's place in completing the list. Before the week of adventure is over, Seth has impressed Wren in more ways than one. But is that enough to overcome Wren's fear of losing those she loves?HOW TO REWRITE A LOVE LETTER, an enthralling novella by Diane Darcy, high school teacher Julie Ashburn believes she’ll never live the “event” down in which she wrote her true feelings in a love letter to Principal Dane Parker, and he laughed out loud, mocking her. Now that her honors English students want to write love letters for the school fundraiser, Dane turns down the idea flat. Julie tries to convince him that it was her students’ idea and not any sort of payback. But when a student writes a fake love letter from the principal to Julie, everything gets even more mixed up, and both Julie and Dane are caught up in a series of misunderstandings that might be impossible to sort out.In Sarah M. Eden’s delightful story, A THOUSAND WORDS, Shannon Ryan has been waiting half a year to be reunited with her fiance, Patrick, with only the letters between them keeping their relationship alive. He finally sends for her after securing a good job with the Sidney newspaper, and she can’t wait to be reunited with him, swept up in his arms and thoroughly kissed. And of course, married as soon as possible. But when she arrives at the train station, there is no Patrick waiting for her. Shannon must discover if the man she loves still has feelings for her.BETWEEN THE LINES is a sweet romance by Annette Lyon. Jane Martin is intelligent but extremely shy, especially around men. When the Aid and Cultural Society proposes a letter-writing program, Jane signs up, hoping she can find true friendship. The program doesn’t run as smoothly as expected, and unknown to Jane, one of the men in her city becomes her writing friend. Thomas Allred has always known shy and quiet Jane, but reading her letters written to his secret persona, opens his eyes to what an amazing woman she is. The only trouble is, Jane doesn’t know that the man who she is falling in love with through letters is also Thomas, the man who is falling in love with her in person.In the enchanting novella, BLACKBERRY HOLLOW, by Heather B. Moore, Lucy Quinn travels to England to inspect her inherited estate. Unfortunately, as a resident of New York and nearly engaged, Lucy needs put the house on the market. But first, she wants to learn more about her ancestors. What she doesn’t expect is Calvin Bevans, the man living next door. The two families have been divided by a misunderstanding decades old, and when Lucy discovers a set of love letters, she learns the truth. As Calvin helps her unravel the hidden secrets between the two families, Lucy finds that she has more reasons to stay in England than to return to New York.",
  "genres": [
    "Romance",
    "Clean Romance",
    "Contemporary",
    "Novella",
    "Anthologies",
    "Historical",
    "Short Stories"
  ],
  "author": "Karey White",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/18535050-love-letter-collection"
}