{
  "title": "Fate of a Royal",
  "description": "“You will go to Rathe University, live among the giftless and those of light magic. You, Knight Deveraux, will learn to coexist.”I’ve never heard more wasted words in my life. Then again, the gifted counsel never did have much to say that wasn’t. The only members amongst them who speak a thing worth listening to are my parents, the King and Queen of the Stygian’s, the people of Dark Magic.Unfortunately for me and my brothers, they’ve chosen to play nice instead of sinking their talons into anyone who dares demand a thing from their heirs. In this instance at least.Every gifted is forced to leave our realm behind after graduation to spend the next four years in a world that isn’t ours, while pretending it’s enough for those with something deeper clawing beneath their skin.It isn’t. Not by a long shot, and while it’s as boring as I thought it would be, we find ways to entertain ourselves.A little Fae Dust, the power of persuasion, and it’s a party worthy of a royal … or four.That was fun the first year, but it’s my second now, and the minute I got back to campus, I knew it would be worse than before. I felt it, that pull buried beneath my skin, the whisper of a warning deep in my mind I could hear but couldn’t reach.It starts with a human party and ends with a nightmare.A five foot, white haired one.With eyes like ice and a body begging to be bitten, she’s a problem.A giftless one.That’s right, she’s human.Worthless.And if the shadow circling my soul is telling me what I think it is … she belongs to it.My new obsession … is my fated mate.But there is no way the fates would give me, a Lord of Rathe, a heir to the throne of dark magic, a giftless girl.I’ll prove they got it wrong.That she’s not mine.If I’m lucky, I’ll destroy her in the process.",
  "genres": [
    "Fantasy",
    "Dark Romance",
    "Romance",
    "Paranormal",
    "Dark",
    "Fantasy Romance",
    "Enemies To Lovers"
  ],
  "author": "Meagan Brandy",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/185358293-fate-of-a-royal"
}