{
  "title": "All Wrapped Up: Volume 1",
  "description": "Four exceptional authors, four enticing stories. Wrap yourself up in the heat of the best in erotic romance from Changeling Press.Angela Knight ― Blood ServiceThe hunter and the hunted. Best selling author Angela Knight brings you vampire bounty hunters that sizzle.Adiva Mayhew is a spy―and a damn good one. But now she's running for her life from a deadly bounty hunter―who's also a vampire. General Borian Tang has offered a high reward for her capture, and the man known only as Vigilante apparently means to collect. When Vigilante catches up to her, she soon finds all he wants to do is take her―over and over again. And as she yields to his seductive domination, Adiva finds she wouldn't have it any other way. Trouble is, Tang is still determined to capture her, and there are other bounty hunters eager to claim the reward.Ann Jacobs ― BrandedA distant planet―a man on a path of discovery and a tortured woman. Author Ann Jacobs explores sexual healing.Cole Callender, an entrepreneur with an eye to the future, branded a sexual deviant under Earth laws, adopts Obsidion as his future. Cole will build more than just a safe haven for Doms and subs practicing BDSM―Cole thinks in terms of community, and the future of Obsidion as a world.Amber―a sub with a death wish. She's barely escaped a cruel Dom with her life. The scars she's left with, both inside and out, may be permanent. Now she wants nothing more than to be Cole's loving slave. Cole sees beyond her scars, but is his love enough to help Amber learn to live again?Dakota Cassidy ― Slave School DropoutTwo shapeshifting cats plus one kinky cupboard equals author Dakota Cassidy's humorous slant on BDSM.Nyla is a cat. So is Lucas. Nyla is an Egyptian Mau, descendant of the Goddess Bast. Lucas. isn't. In fact, he's a tomcat. Unlikely lifemates at best. Lucas is also a sexual Dominant who enjoys just a smidge of rocky road with his bedroom pleasures.But Nyla's never considered herself submissive. No one is the boss of her. Oh, and it never hurts to mention that Nyla's family is a snobbish, upper crust bunch of shifters who will probably want nothing more than to see to it that Lucas and Nyla's newly acquired lifemate status is revoked by the lifemate council.Kate Hill ― Tainted KissesA primeval vampire, a woman intent in saving her village at all costs and a bargain. Author Kate Hill journeys into the ultimate surrender.Dancing with the devil. Pure Evil. Stolen from his mother's womb by the very creature responsible for her death, Etlu was raised to destroy without mercy and sate his lust like an animal. Yet, peering through villagers' windows in the dark of night, he sees men and women sharing unfamiliar pleasures and longs to understand.Meets pure good. Niabi uses her powers in defense of the weak. When Etlu's army of Viking warriors devastates a village she's sworn to protect, Niabi's only choice is to strike a bargain with Etlu―the humans' lives in exchange for her complete surrender to his desires. Can she find anything in him worth saving?",
  "genres": [
    "Romance",
    "Anthologies",
    "Paranormal Romance",
    "BDSM",
    "Erotica",
    "Paranormal",
    "Vampires"
  ],
  "author": "Angela Knight",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/185352.All_Wrapped_Up"
}