{
  "title": "Gender and Equality in Muslim Family Law: Justice and Ethics in the Islamic Legal Tradition",
  "description": "Dante is one of the towering figures of medieval European literature. Yet many riddles and questions about him persist. By re-reading Dante with an open mind, Barbara Reynolds made remarkable discoveries and unlocked previously hidden secrets about this greatest of Florentine poets. A fundamental enigma has tantalised readers of the 'Commedia' for seven centuries. Who was the leader prophesied by Virgil and Beatrice to bring peace to the world? Many attempts have been made to identify him, but none has seemed conclusive - until now. As well as proposing a solution to the famous prophecies, this lively, engaging and elegantly-written biography contains a provocative new idea in virtually every chapter. Dr Reynolds' research indicates that Dante smoked cannabis to reach new heights of creativity. That Beatrice, Dante's great love, was not who most scholars think she was. That Dante was a talented public speaker, who created a quite new form of poetic art, holding audiences spellbound. Above all, Reynolds views Dante as one of the greatest spin-doctors of Western civilization. His aim was not to preach an interesting parable about punishments for sin and rewards for virtue. It was to use poetry to change the politics of the age, and unite Europe around the secular authority of an Emperor. To promote this idea, which dominated his writings from his exile onwards, Dante combined it with a dramatic presentation of the Christian belief in Hell, Purgatory and Heaven. Vividly told in the first person, with a colour and immediacy derived from the pop art of street narrators - now made to seem respectable by its use of classical predecessors like Virgil - this extraordinary journey through the three realms was always profoundly political in intent. Dante here comes alive as never irate, opinionated, settling scores - a man of mutifaceted gifts and extraordinary genius, whose role as an interpreter of world history makes him more than ever relevant to the new millennium.",
  "genres": [
    "Gender",
    "Islam"
  ],
  "author": "Lena Larsen",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18543087-gender-and-equality-in-muslim-family-law"
}