{
  "title": "Mexican Cook Book",
  "description": "I really love this cookbook! It's one that makes you feel as though the author is in the kitchen with you, explaining a bit about each recipe and what you may see as you go about preparing. There was an interesting discussion thread on [...] egarding authentic Mexican and to my mind this book is an unsung hero of la Cocina Mexicana! The book has recipes for stuffed kohlrabi, corn tortillas filled with chard, avocado soup, etc. plus all the typical rice, beans, tamales, chile rellenos, frozen desserts, etc. with variations galore! Poblanos stuffed with corn is a particular summertime favorite that is neither battered nor fried. In fact, if you like to buy fresh ingredients at farmers' markets you can pretty much find a good recipe in this book. Another favorite I like to make is albondigas con arroz Mexicana (meatballs with Mexican rice) which we have as often as spaghetti and meatballs nowadays. And guess what? The meat, bread crumbs, etc. can all be mixed in the food processor! Cooked tomato sauce is also a bit easier to prepare than Italian marinara and it always amazes me how the same ingredients can taste so different because Mexican cooks \"fry\" their pureed sauces in hot fat (I use oil, but lard anyone?) rather than sauteeing the mire poix in oil before adding the tomatoes. Ms. Style will tell you that home cooks in Mexico do not prepare mole or tortilla dough from scratch, they get help from the store. But American cooks WANT to start from the basic ingredients, so she happily breaks it all down. I would love to serve her roasted turkey with sausage and plantain stuffing for Thanksgiving one year, but I know my family is not quite that adventurous! It was one of the most satisfying days in the kitchen I've ever spent the last time I made this delicious dinner for my partner and me. It's a perfectly good reason to buy and serve turkey outside of the holiday season.",
  "genres": [],
  "author": "Sue Style",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/1855209.Mexican_Cook_Book"
}