{
  "title": "Destroyed",
  "description": "Only one woman has ever refused him…and she’s the only one he wants.Now that he’s successful beyond his wildest dreams with his band Oblivion, Simon Kagan is happy to enjoy his all-access pass to the groupie train. After getting more fists in the ribs than hugs growing up, he discovers having a warm female in his bed is an easy way to escape the loneliness.Until Margo.From the moment the classy, buttoned up violinist entered his sphere, he knew she was different. After one amazing night in the studio, he feels like he’s finally connected with someone on a deeper level—only to have her walk away without a backward glance.As a member of the Boston Symphony orchestra, Margo Reece’s life revolves around the regimented structure of a second chair violinist. But Simon’s uncanny ability to crawl into a song and create a smoky, sin-filled experience translated into the hottest night of her life. She walked away afterward because that’s what she was supposed to do.And Margo always does what she’s supposed to.Until Simon.When she’s called on again to blend her sound with Oblivion’s, she has to make the decision to play it safe or let her wild side free. Especially when her first meeting with Simon shows that sometimes rigidly contained passions create the most dangerous sparks…WARNING: Oblivion is a band of highs and lows. The individual members find a special kind of magic when they're together...take that away and things can go very bad. DESTROYED is a very fitting title for the next phase in their evolution.The next few books are going to have a lot of happiness and a lot of heartache. We hope you come along for the ride. We love this band and will give them their happily ever after. It just might take until FUSED to get there.Cliffhanger warnings apply for DESTROYED.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Music",
    "Contemporary",
    "Musicians",
    "Erotica",
    "Erotic Romance"
  ],
  "author": "Cari Quinn",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/18531341-destroyed"
}