{
  "title": "The Bishop's Tale",
  "description": "\"MAY GOD STRIKE ME DOWN WITHIN THE HOUR!\"To the guests at the mourning feast for Thomas Chaucer, the last words of Sir Clement Sharpe had been enough to damn him in the eyes of God. Detested by all who knew him, his final blasphemy had turned even God's anger against him and his death would be a lesson well-remembered. None among them would ever forget the sight of God striking down a sinning man, and each would keep in their heart the need to honor God's charity and love in all the hours of their lives.But the crafty Dame Frevisse and cunning Bishop Beaufort suspect that there may be an all-too-mortal hand at work in Sir Clement's death. If their suspicions can be proved, then the only lesson to be learned is the bleakest secret of the blackest heart.PRAISE FOR THE BISHOP'S TALE\"The setting for another tale of mystery, intrigue, jealousy and ambition, well drawn, well paced, and a pleasure to read.\" - Historical Novels Review\"Rich period detail, canny characterization, and a lively plot should endear Sister Frevisse and her tales to anyone who enjoys historical mysteries.\" - Minneapolis Star Tribune\"Truly this is a winter's tale, wintry in setting and in themes. The most powerful emotions are chilled and Cool authority, icy determination, cold despair - these are stronger than the widow's stormy, self-pitying grief, the petulant anger of a pair of young lovers, the heat of a proud man's anger, and the fiery rash which clutches and kills him.\" - Jeanne M. Jacobson, Drood Review of MysteryPRAISE FOR THE SISTER FREVISSE MEDIEVAL MYSTERY SERIES\"Frazer is writing one of the most consistently excellent historical series in print today.\" - Murder Ink\"Frazer successfully captures the essence of 15th century England - the sights, smells, and sounds fill the pages, drawing us in as we become immersed in the language, manners, and customs of a far off time and place.\" - Rendezvous\"Dame Frevisse, the pious and perspective nun gives focus to this sober series... [Frazer] shows a meticulous detail that speaks of trustworthy scholarship and a sympathetic imagination.\" - New York Times Book Review\"Once you begin to read this series, you will want to follow your new friends to the end of their personal story.\" - Cross Point Book Reviews\"Exquisitely written... A superbly researched medieval mystery series!\" - Publisher's Weekly\"Everything about it bespeaks quality and care... Frazer draws us into a medieval village in England with a story of lust, greed, and murder.\" - St. Paul Pioneer PressA Romantic Times Top Pick.Twice nominated for the Minnesota Book Award.Twice nominated for the Edgar Award.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Fiction",
    "Medieval",
    "Historical",
    "British Literature"
  ],
  "author": "Margaret Frazer",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/185646.The_Bishop_s_Tale"
}