{
  "title": "The Fate of Africa: A History of Fifty Years of Independence",
  "description": "\"The fortunes of Africa have changed dramatically in the fifty years since the independence era began. As Europe's colonial powers withdrew, dozens of new states were launched amid much jubilation and to the world's applause. African leaders stepped forward with energy and enthusiasm to tackle the problems of development and nation-building, boldly proclaiming their hopes of establishing new societies that might offer inspiration to the world at large. The circumstances seemed auspicious. Independence came in the midst of an economic boom. On the world stage, African states excited the attention of the world's rival power blocs; in the Cold War era, the position that each newly independent state adopted in its relations with the West or the East was viewed as a matter of crucial importance. Africa was considered too valuable a prize to lose.\" \"Today, Africa is spoken of only in pessimistic terms. The sum of its misfortunes - its wars, its despotisms, its corruption, its droughts - is truly daunting. No other area of the world arouses such a sense of foreboding. Few states have managed to escape the downward spiral: Botswana stands out as a unique example of an enduring multi-party democracy; South Africa, after narrowly avoiding revolution, has emerged in the post-apartheid era as a well-managed democratic state. But most African countries are effectively bankrupt, prone to civil strife, subject to dictatorial rule, weighted down by debt, and heavily dependent on Western assistance for survival.\" \"So what went wrong? What happened to this vast continent, so rich in resources, culture and history, to bring it so close to destitution and despair in the space of two generations?\" Focusing on the key personalities, events and themes of the independence era, Martin Meredith's narrative history seeks to explore and explain the myriad problems that Africa has faced in the past half-century, and faces still. The Fate of Africa is essential reading for anyone seeking to understand how it came to this — and what, if anything, is to be done.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "World History",
    "Economics",
    "Africa",
    "Travel"
  ],
  "author": "Martin Meredith",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/185540.The_Fate_of_Africa"
}