{
  "title": "April's Rain",
  "description": "In book four of the Tucker series, it has been eight years since the death of Tucker's best friend, Ella, and she is struggling to manage their rebellious, self-destructive granddaughter, April. When April accidently kills her boyfriend during an attempted rape, Tucker, with the help of Judge Jack, secretly sends April away to Spirit Lake, a remote wilderness treatment facility for girls in the mountains of east Tennessee. While at Spirit Lake, April lies about who her family is and what kind of upbringing she had, painting herself to be a socialite. She ignores Tucker's letters that attempt to build a bridge between them. When the residents and staff at Spirit Lake confront April about her lies and hateful attitude, she runs away and gets lost in the Smokey Mountain National Forest. Meanwhile, March, Tucker's grandson and April's brother who has been missing for eight years, is found half-dead beside a river in east Tennessee. When he finally regains consciousness in the hospital, he discovers he is blind and has amnesia. In his darkness and lostness, he tries to find the missing pieces that will help him make sense of his life. Before the members of this family can heal the fractures of their pasts, they will have to face the twin-headed dragon that has dogged each of them for eight Guilt and Regret. Will they find the healing that forgiveness can bring? Will God help them find each other before it's too late? In the vivid language that fans of the Tucker series have come to expect, author David Johnson grabs you by the lapels of your jacket and shoves you into the lives of the characters you've come to love. The most expansive of all the Tucker books, \"April's Rain\" is a white-water-ride that will leave you exhausted and thrilled.",
  "genres": [
    "Fiction",
    "Audiobook",
    "Christian",
    "Historical Fiction",
    "Contemporary",
    "Adult Fiction"
  ],
  "author": "David  Johnson",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/18568772-april-s-rain"
}