{
  "title": "The Preacher, the Politician, and the Playboy",
  "description": "The Preacher Isaiah Morrison is a man after God’s heart. Even though his wife divorced him, he continues to preach and declare the goodness of the Lord, content to spend the rest of his life as a bachelor, Lord willing.Ramona Verse is still healing from her own divorce when, desperate to earn some money after her ex-husband took nearly everything from her, she applies for a job managing the charitable contributions of Pastor Isaiah Morrison. She never expected to have immediate chemistry with her new boss.Isaiah is equally surprised by his strong attraction to the secretive Miss Verse. But are the wounds of their pasts too deep to overcome?  The Politician As mayor of Cincinnati, Eric Morrison has plenty of issues to deal with, but perhaps none as delicate as the drinking habits of his wife, Linda. When she hits a football superstar while driving drunk, Eric tries to cover it up.Not long after, Linda gives her life to Christ and gives up drinking altogether. Eric is thrilled. But when she tells him that she wants to use their cut of his father’s fortune to start an organization to help recovering alcoholics rebuild their lives, he rejects the idea, convinced that it will jeopardize his chances at being elected governor of Ohio.When a blackmailer demanding ten million dollars threatens to expose photos from the accident, Eric must decide whether he will stand up for the truth his father taught him or sell his soul for public office.  The Playboy After a very public argument over child support payments, the mother of Shawn Morrison’s third child is found dead. The police bring Shawn in for questioning, and he soon finds himself in the fight of his life. Desperate for help, he turns to the brother who disowned him—and to Lily, the ex-fiancée who left him because of his many infidelities.Lily wanted nothing to with Shawn, but she has since been born again, and she feels compelled to help her lost love.Will stepping back into Shawn’s world prove to be too much for Lily to handle? Or will her forgiving heart and Christian witness finally help Shawn turn back to God in his darkest hour?",
  "genres": [],
  "author": "Vanessa Miller",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/18569335-the-preacher-the-politician-and-the-playboy"
}