{
  "title": "Book of Shadows",
  "description": "\"Most people know intuitively that when you fall in love the world is full of magic. What they don't know is that when you discover the universe is full of magic, you fall in love with the world.\"When high-powered Manhattan lawyer Phyllis Curott began exploring Witchcraft, she discovered a spiritual movement that defied all stereotypes. Encountering neither satanic rites nor eccentric spinsters, she came to know a clandestine religion of the Goddess that had been forced into hiding over the course of history. Book of Shadows recounts Curott's remarkable initiation into Wicca (meaning \"wise one\") and shares her insights as a high priestess of an elegant, ancient spirituality that celebrates the magic of being alive.An Ivy-league graduate and promising lawyer, Curott was a typical young woman in her twenties, determined to forge a law career within the burgeoning, male-dominated music industry. But when she began having prophetic dreams and mysterious visions of ancient female figures and unfamiliar symbols, she discovered an unexpected world of magic and began searching for a rational explanation. When her friend Sophia--a practicing Witch--suggested having her cards read by a Wiccan High Priestess, Curott instinctively dismissed the idea, but then forced her natural skepticism aside on the chance that this age-old practice might help her understand the unusual occurrences in her life.Thus begins her journey into the magical world of Witchcraft, a religion originally practiced by priestesses, shamans, and healers that empowers our lives by working with the natural cycles of nature. Fascinated by this pre-Judeo-Christian religion that honors women as the embodiment of the Goddess and emphasizes respect and love for the natural world, Curott began attending a local coven's weekly circle to learn the sacred arts. Her Book of Shadows chronicles her ascent to the position of Wiccan High Priestess and her efforts to reconcile her newfound spirituality with her struggles as a woman rising through the ranks of the corporate world. Along the way, Curott relates the history of Witchcraft and shares many traditional Wiccan practices, such as casting a circle, drawing down the Goddess, harnessing the powers of the natural world, and casting spells for health, prosperity, and love.Engagingly written and rich with detailed rituals and techniques, this inspirational book traces a modern woman's spiritual journey into a realm of extraordinary experience and enlightenment. Book of Shadows provides us with the keys to discover an enchanted world of divine empowerment so as to unlock the power that lies within us all",
  "genres": [
    "Nonfiction",
    "Spirituality",
    "Wicca",
    "Witchcraft",
    "Paganism",
    "Memoir",
    "Biography"
  ],
  "author": "Phyllis Curott",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/185690.Book_of_Shadows"
}