{
  "title": "The Phantom",
  "description": "All Three Books in The Phantom Series!Book One ~ Stevie-girl and the Phantom matter who dares you, no matter what lures you, do not go in the spooky old house . . .What would you do if a phantom needed your help?When a small planes crashes behind Jase’s rural home, strange things begin to happen. But no one believes him. After all, there’s no such thing as a ghost, right? Then he sees his pretty, quiet schoolmate, Stevie-girl, about to enter the legendary haunted house, and he knows if anyone can help him solve the mystery, she’s the one.Book Two ~ Stevie-girl and the Phantom freaks, and phantoms inhabit the abandoned elementary school. Would you go inside to help out a friend?Stevie asks Jase to help her find out why the ghost of a girl keeps appearing in her mirror. They think it has something to do with the new student at their school, a boy who has Tourette syndrome. Both the new kid and the new phantom seem to need some kind of help. When the new kid falls prey to the school bullies, Stevie knows they must act. But will they be too late, or will a tragic moment in their school’s history be repeated on Halloween night?Book Three ~ Stevie-girl and the Phantom of Crybaby and her best friend, Jase, are phantom magnets. Whenever they are together, the doorway between this world and the next swings slightly open.The summer his parents treat them to a camping trip in New Mexico, the two friends can’t wait to visit the legendary Crybaby Bridge. Right away, they hear the crying baby. Is it a phantom, or is someone playing tricks on them?As the two friends scour the campgrounds for answers, they discover that phantoms are not the only secrets the nearby town has kept hidden for over 60 years. They also discover things about each other, and about Stevie’s family history,that will force their relationship to a whole new level—a level from which there may be no return.",
  "genres": [],
  "author": "Ann Swann",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/18569013-the-phantom"
}