{
  "title": "The Boy's Tale",
  "description": "SUFFER THE LITTLE CHILDREN...\"Sanctuary! In God's name you must give it!\"A dark lady rides back into the life of Dame Frevisse, bearing with her two small boys haunted by the touch of death and scandal. Nine men lie dead on the road behind them, victims of the grim fate which relentlessly pursues them. Some seek to turn them away, but when they request sanctuary Frevisse is bound by her holy oaths to grant it.But in welcoming them within the walls of St. Frideswide, has Dame Frevisse allowed death to stalk the nunnery's halls? When she begins to untangle the mystery of these strange guests, the truth she discovers may be enough to doom them all. Forced to keep secrets better left untold even from the nuns of her own order, Frevisse is caught in a crucible between faith and duty.To learn the boy's name is to be drawn into a conspiracy of shame. To hear the boy's tale is to face death.PRAISE FOR THE BOY'S TALE\"Frazer's writing is both erudite and vivid, and she has the ability to bring characters to life within a strong, clear story.\" - The Drood Review of Mystery\"Seeing events through the eyes of small children not understanding royal politics was an especially pleasing part of experiencing this story.\" - Books 'n Bytes\"Frazer starts to glow. Each action is a natural progression. Each character has wants, needs, and desires. The mystery is engaging. It brought tears to my eyes.\" - Epinions.com\"This fast-paced historical mystery comes complete with a surprise ending - one that will hopefully lead to another Tale of mystery and intrigue.\" - Affaire de CoeurPRAISE FOR THE SISTER FREVISSE MEDIEVAL MYSTERY SERIES\"This series is full of the richness of the fifteenth century, handled with the care it deserves. Margaret Frazer's tales are charmingly and intelligently contrived.\" - Minneapolis Star Tribune\"Accurate period detail, adroit characterization, and lively dialogue add to the pleasure.\" - Publishers Weekly\"Sister Frevisse is a stalwart, appealing sleuth.\" - Mostly Murder\"Truly shocking scenes and psychological twists.\" - Mystery Loves Company\"Frazer uses her extensive knowledge of the period to create an unusual plot ... appealing characters and crisp writing.\" - Los Angeles TimesTwice nominated for the Minnesota Book Award.Twice nominated for the Edgar Award.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Historical",
    "Medieval",
    "Fiction",
    "British Literature"
  ],
  "author": "Margaret Frazer",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/185628.The_Boy_s_Tale"
}