{
  "title": "The Outlaw's Tale",
  "description": "ACT OF MERCY, ACT OF MURDERLeaving the safety of her nunnery walls behind, Dame Frevisse is drawn into an unholy web of treachery and deceit. Waylaid on the King's Highway by a band of outlaws, Frevisse is shocked to discover that their leader is her long-lost cousin Nicholas. When he pleads with her to help him obtain a pardon for his crimes, she finds herself trapped between the harsh edicts of the law and the mercy of her vows.But even as she struggles to restore his fortunes, Frevisse must fight to save his soul... and his life. Before the outlaw's tale can be told, the saintly nun will find herself trapped in a manor house of murder, caught between the holy passions of the heart and the sinful greeds of man.PRAISE FOR THE OUTLAW'S TALE\"A tale well told, filled with intrigue and spiced with romance and rogues.\" - School Library Journal\"...a meticulous recreation of not only how people lived more than five hundred years ago, but how they loved, suffered and sinned. Just the thing for anybody who usually disparages the genre to show how well it can be done, in the right hands.\" - Myshelf.com\"Dame Frevisse is well-born, well-educated, and not at all afraid to stick her inquisitive nose into anything which just does not seem right.\" - Tower Books Mystery NewsletterPRAISE FOR THE SISTER FREVISSE MEDIEVAL MYSTERY SERIES\"Frazer's writing is both erudite and vivid, and she has the ability to bring characters to life within a strong, clear story.\" - Drood Review of Mystery\"This series is full of the richness of the fifteenth century, handled with the care it deserves. Margaret Frazer's tales are charmingly and intelligently contrived.\" - Minneapolis Star Tribune\"Accurate period detail, adroit characterization, and lively dialogue add to the pleasure.\" - Publishers WeeklyA Romantic Times Top Pick.Twice nominated for the Minnesota Book Award.Twice nominated for the Edgar Award.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Medieval",
    "Historical Mystery",
    "Fiction",
    "Historical",
    "Crime"
  ],
  "author": "Margaret Frazer",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/185652.The_Outlaw_s_Tale"
}