{
  "title": "The Murderer's Tale",
  "description": "THROUGH A MURDERER'S EYES...Caught under the tyrannical thumb of her new prioress, Dame Frevisse finds welcome relief in leaving St. Frideswide nunnery on pilgrimage. But the road brings with it unwelcome The wealthy Lionel Knyvet has been possessed by a foul demon. Seeking relief from the horrific terrors visited upon his body each fortnight, Lionel has dragged his entire household on an endless pilgrimage across the breadth and length of England. Frevisse wants nothing more than the peaceful bliss of travel, but must instead endure the incessant chattering of a mob.Lionel's possession, however, may only mask a darker sin. When the pilgrims make their way to the manor house at Minster Lovell, Frevisse begins to unwind the bitter poisons of jealousy and betrayal eating at the hearts of both Lionel and his brother Giles. Against her will, the innocent nun is drawn into the vilest depths of the human soul and there she unlocks the mysteries of a blackened heart. But even when the truth comes out, can justice be done? The pure of heart will find no peace when murder and death come knocking at the manor's door...PRAISE FOR THE MURDERER'S TALE\"Frazer has created the most despicable villain since Iago.\" - Patricia W. Julius, Detective as Historian\"Historical readers will be charmed with the story; feminists will be delighted with the strong female characters. Ellis Peters has a worthy successor in Margaret Frazer.\" - Meritorious Mysteries\"Expertly captures the flavor of the period with vivid descriptions and creates dimensional characters true to the times.\" - Rendezvous\"A diabolically smooth and logical frame-up... Frazer springs substantial surprises. A moving portrait of how afflictions torment body and mind and a meditation on selfless friendship. It's a treat, with memorable characters and a thoughtful, bittersweet ending.\" - S.M. Tyson, The Armchair DetectivePRAISE FOR THE SISTER FREVISSE MYSTERIES\"Within the graceful prose rhythms that have garnered her two Edgar nominations, Frazer's tale of 15th-century nun Dame Frevisse transports the reader to a medieval England made vivid and a world of emotions as familiar then as now.\" - Publisher's Weekly\"Mystery... Suspense... Frazer executes with audacity and ingenuity.\" - Kirkus Reviews\"Margaret Frazer is on a rip. Each book is better and stronger than the last, and it's almost a privilege to be on the journey as the skillful Frazer takes her heroine, Dame Frevisse, all over Britain solving crimes.\" - Aunt Agatha's\"There is action aplenty and intrigue in abundance.\" - Historical Novels ReviewA Romantic Times Top Pick.Twice nominated for the Minnesota Book Award.Twice nominated for the Edgar Award.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Historical",
    "Medieval",
    "Fiction",
    "Crime"
  ],
  "author": "Margaret Frazer",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/185645.The_Murderer_s_Tale"
}