{
  "title": "The Prioress' Tale",
  "description": "DARK CORRUPTION AND THE PENITENCE OF DEATH...Under the harsh hand of its newly elected prioress, St. Frideswide's has become a place of deadly sin. The corruption has grown subtly and slowly, but it has found fertile soil in the rage and greed of Domina Alys, who has turned the priory into a boarding house for her relatives, the Godfreys. Dame Frevisse is horrified to discover that the modest stores of the priory - desperately needed if the nuns are to survive the coming winter - are being completely consumed by the rapacious Godfrey clan.But the Godfreys bring with them more immediate Torture. Madness. Kidnapping. Murder. The sanctuary of the cloister has been violated and even the holy rites of the nuns have been ripped apart.Despite the growing crisis, Frevisse's best efforts to save the nunnery from itself are met with scorn and torment as bitter hatreds and old rivalries turn nun against nun. Suspicion, paranoia, and despair clutch the cloister's heart. If Frevisse cannot unlock the riddles of penitence for her prioress and for herself, then St. Frideswide's may be no more...NOMINATED FOR THE 1998 EDGAR AWARDPRAISE FOR THE PRIORESS' TALE\"When this series debuted, its publisher hailed Frazer as the logical successor to Ellis Peters... With a number of strong books already under her belt, Frazer may actually make her publisher's dream come true.\" - Star Tribune\"Often chastised for her disobedience and made to do penance, Sister Frevisse's curious nature still wins out as she uses logic and her intelligence to sleuth with the best of them.\" - Rendezvous\"Frazer is writing one of the most consistently excellent historical series in print today.\" - Murder Ink\"Clearly, the setting is the star here, and Frazer is generous with her details of abbey life.\" - Publishers Weekly\"Margaret Frazer continues her splendid series of medieval mysteries... She has a sure grasp of the realities of medieval Its careless cruelty, effortless hypocrisy - particularly in matters of religion - and its disregard for women who could wield influence only in the most indirect ways.\" - MLB NewsPRAISE FOR THE SISTER FREVISSE MEDIEVAL MYSTERY SERIES\"A smooth and absorbing saga of conspiracy and treachery in 15th-century England...\" - Publishers Weekly\"Margaret Frazer has quietly claimed her place as one of the preeminent writers of historical crime fiction, delivering the whole package - a good mystery, wonderful characters, and a fascinating period of history... Her novels are a dream to read.\" - Aunt Agatha's Newsletter\"Exciting writing, colorful characters, and historical accuracy.\" - St. Paul Pioneer Press\"The setting brims with historical details... A brilliant study of human nature... Ms. Frazer reveals her genius... Highly recommended.\" - Historical Novels Review\"Mystery... Suspense... Frazer executes with audacity and ingenuity.\" - Kirkus ReviewsA Romantic Times Top Pick.Twice nominated for the Minnesota Book Award.Twice nominated for the Edgar Award.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Medieval",
    "Historical",
    "Fiction",
    "Crime"
  ],
  "author": "Margaret Frazer",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/185651.The_Prioress_Tale"
}