{
  "title": "India's Agony Over Religion",
  "description": "Presents the contemporary religious crisis in India, providing historical perspective and focusing on the crises in Punjab, Kashmir, and Ayodhya.\"It is comprehensive in its approach to the contemporary crises. I found it to be an extremely interesting book to read.\" -- Ramchandra Gandhi\"It is precisely Larson's competence in classical indology that permitted him to explain so lucidly and perceptively the present Indian situation--and also to encompass so clearly the religious developments during the six periods he distinguishes in India's past.\" --Andre Padoux\"The stunning December 6, 1992 event of the destruction of Babri Masjid in Ayodhya, and the chaos that ensued, pinpointed the 'agony' that is the subject of this book. The perspective that Larson employs to unpack and analyze that agony is not the social sciences (sociology, anthropology, political science--although insights from these fields are in constant use throughout the book), but rather the perspective of one who thoroughly knows the cultural history of South Asia and allows the history and philosophy of religions to confirm fundamental experiences and enduring expressions cumulative for more than four thousand years in the subcontinent. We begin at the beginning, in prehistory no less, and work from there to build an understanding of a great cumulative, multilayered, densely configured civilization.\" -- David M. KnipeMany of ancient India's religious traditions are alive in modern India, and many of these religious traditions are in conflict with one another regarding the future of India. Even the so-called \"secular state\" is deeply pervaded by religious sentiments growing out of the Neo-Hindu nationalist movement of Gandhi and Nehru. A careful analysis of the current religious scene when placed in its proper long-term historical perspective raises interesting questions about the nature and future of religion not only in India but elsewhere as well.\"This book is an impressive achievement. It ranges widely in time, reaching from the present back to the Indus Valley Civilization, and it weaves a wide and impressive number of secondary works together to offer a new interpretive framework through which to understand India's present level of religious conflict.\" -- Robert D. Baird",
  "genres": [
    "India"
  ],
  "author": "Gerald James Larson",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/1099344.India_s_Agony_Over_Religion"
}