{
  "title": "Keeper of Dreams: Short Fiction",
  "description": "This huge collection of short stories by one of science fiction's most beloved and popular writers is sure to please his millions of fans. Keeper of Dreams contains 22 stories written since 1990.From the opening science fiction tale, \"The Elephants of Poznan,\" we see the hand of a master at work making a familiar idea new, strange, and wonderful. \"Angles\" takes a sideways look at alternate universes. \"Geriatric Ward\" is published here for the first time; it was originally written for the legendary Last Dangerous Visions.Keeper of Dreams contains science fiction, fantasy, and several of Card's mainstream fiction works. Included are two tales from the Alvin Maker universe, \"Grinning Man\" and \"The Yazoo Queen.\"In addition to the stories, this book features new introductions by Orson Scott Card for each story, with commentary on his life and work. With the earlier Maps in a Mirror, this collection is a definitive retrospective of the short fiction career of the writer that the Houston Post called \"the best writer science fiction has to offer.\"• Preface (Keeper of Dreams) • essay by Orson Scott Card• The Elephants of Poznan • (2000)• Atlantis • (1992)• Geriatric Ward• Heal Thyself • (1999)• Space Boy • juvenile • (2006)• Angles • (2002)• Vessel • (1999)• Dust • (2002)• Homeless in Hell • (2002)• In the Dragon's House • (2003)• Inventing Lovers on the Phone • (2003)• Waterbaby • (2000)• Keeper of Lost Dreams • (2004)• Missed• 50 WPM • (2002)• Feed the Baby of Love • (1991)• Grinning Man • [The Alvin Maker Saga] • (1998)• The Yazoo Queen • [The Alvin Maker Saga] • (2003)• Notes on the Mormon Stories • essay by Orson Scott Card• Christmas at Helaman's House• Neighbors• God Plays Fair Once Too Often• Worthy to Be One of Us",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fantasy",
    "Fiction",
    "Anthologies",
    "Science Fiction Fantasy",
    "Audiobook"
  ],
  "author": "Orson Scott Card",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/1856301.Keeper_of_Dreams"
}