{
  "title": "Voices from S-21: Terror and History in Pol Pot's Secret Prison",
  "description": "The horrific torture and execution of hundreds of thousands of Cambodians by Pol Pot's Khmer Rouge during the 1970s is one of the century's major human disasters. David Chandler, a world-renowned historian of Cambodia, examines the Khmer Rouge phenomenon by focusing on one of its key institutions, the secret prison outside Phnom Penh known by the code name \"S-21.\" The facility was an interrogation center where more than 14,000 \"enemies\" were questioned, tortured, and made to confess to counterrevolutionary crimes. Fewer than a dozen prisoners left S-21 alive.During the Democratic Kampuchea (DK) era, the existence of S-21 was known only to those inside it and a few high-ranking Khmer Rouge officials. When invading Vietnamese troops discovered the prison in 1979, murdered bodies lay strewn about and instruments of torture were still in place. An extensive archive containing photographs of victims, cadre notebooks, and DK publications was also found. Chandler utilizes evidence from the S-21 archive as well as materials that have surfaced elsewhere in Phnom Penh. He also interviews survivors of S-21 and former workers from the prison.Documenting the violence and terror that took place within S-21 is only part of Chandler's story. Equally important is his attempt to understand what happened there in terms that might be useful to survivors, historians, and the rest of us. Chandler discusses the \"culture of obedience\" and its attendant dehumanization, citing parallels between the Khmer Rouge executions and the Moscow Show Trails of the 1930s, Nazi genocide, Indonesian massacres in 1965-66, the Argentine military's use of torture in the 1970s, and the recent mass killings in Bosnia and Rwanda. In each of these instances, Chandler shows how turning victims into \"others\" in a manner that was systematically devaluing and racialist made it easier to mistreat and kill them. More than a chronicle of Khmer Rouge barbarism, Voices from S-21 is also a judicious examination of the psychological dimensions of state-sponsored terrorism that conditions human beings to commit acts of unspeakable brutality.",
  "genres": [
    "History",
    "Nonfiction",
    "Asia",
    "Biography",
    "Politics",
    "True Crime",
    "War"
  ],
  "author": "David P. Chandler",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/185676.Voices_from_S_21"
}