{
  "title": "High: The Way of an Eagle",
  "description": "IMAGINE FLYING OUT OF YOUR WINDOW WITHOUT YOUR CLASSMATES KNOWING..\"INTO AN INTENSELY BEAUTIFUL AND HAUNTINGLY MYSTERIOUS WORLD...\"SIXTEEN YEAR-OLD VERONA LAMBERTI thinks that \"poofing\" out of her body and flying out the classroom window would be a whole lot cooler if her eagle flights didn't end with people she cares about being maimed or murdered.On top of dealing with the horrors in her real world: a newly broken family, a move to Jamestown, Virginia, a place which feels like light-years from her real home in New York City, and a new school where she's been virtually invisible for months, now she's got to deal with seeing and experiencing horrors in another realm. A mysterious realm where demons push humans to commit atrocities. Things go from bad to worse when the horrors in that dark realm start to come true in the real world.WHO CAN VERONA TELL THAT A CRIPPLING CAR WRECK, A SENSELESS SUICIDE AND BRUTAL MURDER ARE ALL CONNECTED?Who can she trust with the truth about her eagle visions?And then there are the creepy notes and phone calls: warnings that escalate to death threats. Death threats that become all too real when the demon prince unleashes his minions on Verona.When everything seems to connect to her super-hot new boyfriend, Verona is determined to discover the truth before it kills her. Or anyone else she loves.Discover a biblically-inspired force that traces back to the Old Testament, Native American legend, the Middle Ages, and even Abraham Lincoln's death, armed with supernatural powers to fight demon-infested killers.When everything seems to connect to her super-hot new boyfriend, Verona is determined to discover the truth before it kills her. Or anyone else she loves.LAUGH OUT LOUD WITH VERONA AND HER FRIENDS, EXPERIENCE NEW LOVE, AND HOLD YOUR BREATH IN TERROR!In HIGH: The Way of an Eagle, you'll dive with Verona through excruciating loss and soar with her...",
  "genres": [],
  "author": "Charlene Quiram",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/18580065-high"
}