{
  "title": "Damage Control: A Memoir of Outlandish Privilege, Loss, and Redemption",
  "description": "A powerful, blazingly honest memoir about a gay man and his larger than life, Cuban mother finding each other and reconciling after years of estrangement. When Sergei, a psychotherapist, discovers that his mother is terminally ill, he decides to leave his practice and his life in Paris to be by her side. In the process of adopting a child himself, he does not want her to die thinking that one of her children hated her, and he hopes to understand and make peace with this complicated woman before it is too late.Alternating between Dollsie’s last months as she battles pancreatic cancer, and poignant, often hilarious (and at times shocking) scenes from Sergei’s childhood, DAMAGE CONTROL is a tale of outlandish excess; of wildly glamorous and entitled lives lived above the fray - and in deep denial.This memoir a fascinating look at a woman whose life has been one of great entitlement and disilluisonment, grandiosity, seduction and self-destruction. a woman brought up in pre-Castro Cuba in a mythical paradise steeped in privilege and aristocracy, and her subsequent years in New York and Switzerland, her efforts to lead a glamorous life and pass the myth on to her children, while coping with feelings of longing and frustration that ultimately lead her to destroy everything that she has been taught to want and expect out of life and has desperately attempted to construct for her and her children. From the mountain village of Gstaad, Switzerland, to New York, Miami and Cuba, the memoir explores the emotional and geographical landscapes of a mother and son whose lives are revealed to be poignant parallels. After avoiding his narcissistic mother for a lifetime, seeking shelter from her rage, Sergei comes face-to-face with Dollsie as she confronts mortality. Through his own experiences as a gay man journeying through the joys and perils of his generation, coming out in the early eighties in the deathly shadow of HIV and AIDS, and his years as an activist and therapist in the field, Sergei helps his mother come to terms with her guilt, her regrets and her fear of dying.DAMAGE CONTROL is ultimately a rendering of the cycle of life; saying goodbye to a parent so you can say hello to a child, and finding grace and forgiveness through a mother’s love.",
  "genres": [],
  "author": "Sergei Boissier",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/18579911-damage-control"
}