{
  "title": "Apprivoisé",
  "description": "This is a bundle of all the novels in the Apprivoisé trilogy.DISHABILLEAlex Marchand doesn't know how to do things by half, even when on medication to control his impulsiveness. It's a struggle he's had since childhood. When he falls, he falls hard and he falls fast. Luckily, he found a girl as foolish as Dahlia Warwick, a woman who has codependency down to an art. Dishabille is a novel that gives the reader the hearts and flowers they expect and only the palest of pink bottoms. Arden explores the subject of BDSM with readers who may not quite be ready for a safeword.Dahlia and Alex, two people with limited experience in exploring what they desire, discover a new definition of romance while finding their way together. Dishabille spanks the genre of romance, but delivers the happily ever after.Dishabille is a love story for those who want it a little bit rougher.MORPHOSESMorphoses is a novel of transitions. It starts where Dishabille left off and it includes two of the more minor characters from that novel. The title itself gives the reader a hint into Miranda's kink. While a good bit of the story revolves around Miranda indulging this, there's another transformation that is taking Nicholas kicking and screaming into a normal functioning sexual relationship. By the end you will love Miranda and Nick as much as Dahlia and Alex.Morphoses is a love story for those who are ready for a bit more than just a spanking.FORCE MAJEURE Force Majeure takes us on a lustful journey of near obsession, past the normal niceties of sex and romance, and into the intricate mind of Jeff Rainier. A mind both complex and simple. He knows the rules, but doesn't always want to understand them.Evan Monroe was looking for more in her life, but was unconvinced there was such a thing. She was bored, and unnecessarily jaded. But, she'd try anything once; twice if you begged.Jeff Rainier turned out to be a force that was almost too hard for her to handle.Force Majeure is a novel that tries to define love, but only confuses the matter.",
  "genres": [
    "BDSM",
    "Erotica"
  ],
  "author": "Arden Aoide",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/18580829-apprivois"
}