{
  "title": "Confiteor",
  "description": "Barcelone années cinquante, le jeune Adrià grandit dans un vaste appartement ombreux, entre un père qui veut faire de lui un humaniste polyglotte et une mère qui le destine à une carrière de violoniste virtuose. Brillant, solitaire et docile, le garçon essaie de satisfaire au mieux les ambitions démesurées dont il est dépositaire, jusqu'au jour où il entrevoit la provenance douteuse de la fortune familiale, issue d'un magasin d'antiquités extorquées sans vergogne. Un demi-siècle plus tard, juste avant que sa mémoire ne l'abandonne, Adrià tente de mettre en forme l'histoire familiale dont un violon d'exception, une médaille et un linge de table souillé constituent les tragiques emblèmes. De fait, la révélation progressive ressaisit la funeste histoire européenne et plonge ses racines aux sources du mal. De l'Inquisition à la dictature espagnole et à l'Allemagne nazie, d'Anvers à la Cité du Vatican, vies et destins se répondent pour converger vers Auschwitz-Birkenau, épicentre de l'abjection totale. Confiteor défie les lois de la narration pour ordonner un chaos magistral et emplir de musique une cathédrale profane. Sara, la femme tant aimée, est la destinataire de cet immense récit relayé par Bernat, l'ami envié et envieux dont la présence éclaire jusqu'à l'instant où s'anéantit toute conscience. Alors le lecteur peut embrasser l'itinéraire d'un enfant sans amour, puis l'affliction d'un adulte sans dieu, aux prises avec le Mal souverain qui, à travers les siècles, dépose en chacun la possibilité de l'inhumain - à quoi répond ici la soif de beauté, de connaissance et de pardon, seuls viatiques, peut-être, pour récuser si peu que ce soit l'enfer sur la terre.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Spain",
    "Spanish Literature",
    "Novels",
    "Literature",
    "Contemporary"
  ],
  "author": "Jaume Cabré",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/18580457-confiteor"
}