{
  "title": "Happily Ever Afterlife",
  "description": "Revisit your favorite childhood fairy tales…with a paranormal twist. Eight classic stories rewritten by eight talented authors with one common theme, they all feature the undead. From angels to vampires and ghosts to zombies, you'll be sure to fall in love with the classics all over again and quickly learn that even the undead can have a happily ever after.In the Belly of the Wolf by Amanda CarmanDon't talk to strangers. Don't stray from the path. If you do, the wolf will eat you. Once swallowed, you will be trapped forever in the dark and musty limbo of the belly of the wolf, a larger and more crowded world than you ever suspected. You can't blame him, though. After all, wolves will be wolves.The Glass Coffin by Emmalyn GreysonWhen Marianna's stepmother betrays her by having her turned into a vampire, she must flee home and the love of her life. Darren, her werewolf lover, believes he's found a cure. Will it lead to heartache or happily ever after?Hans and the Best Day Ever by G.L. JacksonAfter a seven-year apprenticeship with the Boss Lady, Hans decides it’s time to go home. Accompanied by Gabe, the two boys make their way back to the house in the woods where they hope to find Hans’ mother. Gabe is never at a loss for words but Hans is always quick to act on what might either be a fantastic idea…or the worst idea ever.The Baron and the Firebird by J.A. CampbellIn the depths of the Russian wilderness, Baron Pyotr Vasilyev does his best to care for his people but his long years weigh heavily and he’s beginning to lose his taste for life. The only things that keep him going are his devotion to duty and his magical cherries. When his cherries go missing the thief turns out to be the Firebird. The desire to hear her sing one last time drives him through the centuries.Clara and the Coon by M.K. BoiseClara is born the height of a quarter–an abomination to the village of Fankfret. Left to die in a teapot on the outskirts of town, she learns that her story is far from over. Getting eaten by a raccoon is just the beginning.Blood Borne Pathogen by Shoshanah HollJavier is too young to be waiting for death, but in the hospital battling late-stage AIDs there isn't room for much else in his mind. A mysterious woman begins visiting him and they form a strange friendship. Aurora only comes to visit after the sun goes down, leaving long before dawn. On the Day of the Dead, they both face the choice between life, death...and what comes after.In Spite of Fire by Tilly BoscottAlice's husband, Henry, died, leaving her to wander the world alone, searching for a way to bring him back. When she stumbles upon village gossip describing a place where ghosts dwell, she sets off to find her lost love. Instead of her husband, she discovers a ghost with eyes of fire, keen on the contents of a ragged tree. Alice clambers into an adventure of fear, darkness and true love.The Angel by Troy LambertAbel is a poor urchin, trying to survive on the streets with only his wits to protect him and a tiny garden of struggling flowers to bring him pleasure. Zach is a young boy struggling in the fight of his life against the blight of cancer who wants to see the flowers of spring one last time. It seems inevitable that these young souls will soon leave the earth. But what awaits them in the beyond?",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Fairy Tales",
    "Anthologies"
  ],
  "author": "J.A.  Campbell",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/18583408-happily-ever-afterlife"
}