{
  "title": "Sleepy Hollow: Rise Headless and Ride",
  "description": "NOTE: This E-Book edition INCLUDES \"THE LEGEND OF SLEEPY HOLLOW\" by Washington Irving (full text)!\"May I present the Last Descendant of Ichabod Crane...\"JASON CRANE just turned seventeen years old.He's a STAR WARS fan and a history geek. He doesn't believe in ghosts or the afterlife. He doesn't believe in psychic powers or tarot cards. He doesn't believe in the Headless Horseman.But Sleepy Hollow will change all that. Because Jason Crane has a heritage to claim. Jason Crane has a Gift to discover. And Jason Crane has an old enemy who will RISE HEADLESS AND RIDE.When Jason's grandmother Eliza Merrick says she has a surprise, Jason always worries. The old lady loves cemeteries and genealogies, grave-rubbings and dusty libraries. This time, though, she's bought an ancient house on a hill above Sleepy Hollow. Eliza has made some new friends in the town, including Hadewych Van Brunt, last descendant of Brom Bones of Irving's Legend. She and Hadewych have a Proposal for Jason, an adventure which will involve a tomb, an exhumation, and a treasure lost for over two hundred years...THE JASON CRANE SERIES re-invents and re-imagines classic American ghost literature. Two books take place in Sleepy Hollow, the next two take the cast to Salem (\"The House of the Seven Gables\" and the infamous witch trials), and the next two take place in haunted Washington D.C. and Baltimore (\"The Fall of the House of Usher\" and other works of Edgar Allen Poe.)The series is set in and among the real-life sights and Halloween events of the modern-day locations. Perfect for planning Halloween tourism! Every place mentioned exists for you to explore: Gory Brook Road, the Tarrytown Lighthouse, the ruin of the Horseman Bridge, the grave of Washington Irving, Patriot's Park, Philipsburg Manor and the haunted Burying Ground of the Old Dutch Church.This eBook edition includes an online MAP of the sights mentioned in the story so that you can follow along or plan a trip. Step into the REAL village of Sleepy Hollow and the world of Jason Crane!Enjoy the Ride!Coming next:Jason Crane: Book Two \"Make for the Bridge\"",
  "genres": [
    "Horror",
    "Paranormal",
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Thriller",
    "Supernatural"
  ],
  "author": "Richard Gleaves",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/18586140-sleepy-hollow"
}