{
  "title": "Mary Dyer Illuminated",
  "description": "Mary Barrett Dyer, 1611-1660, was comely, dignified, admired for her intellect, and known in the court of King Charles. But how did she become infamous in England and America as a heretic who gave birth to a monster? Was she responsible for curses falling on colonial New England in the form of great earthquakes, signs in the heavens, and plagues? What possessed the ultra-righteous Governor John Winthrop to exhume her baby before one hundred gawkers, revile her in his books, and try to annex Rhode Island to get its exiles back under Boston’s control? In Mary Dyer Illuminated, follow William and Mary Dyer from the plague streets and royal courts of London to the wilderness of America where they co-founded the first democracy of the New World 135 years before the Declaration of Independence. They were only getting started. In the second of two volumes, Mary For Such a Time as This, the Dyers return to war-torn England and lay a foundation for liberty that resonates in the 21st century. Why did beautiful, wealthy Mary Dyer deliberately give up her six children, husband, and privileged lifestyle to suffer prison and death on the gallows? The two novels are compelling, provocative, and brilliantly written, blending historical fact and fiction to produce a thoroughly beautiful work you won't want to put down. The author has reconstructed a forgotten world by researching the culture, religions, and politics of England and America, personal relationships, enemies, and even the events of nature, to discover who they were. ***** “Mary Barrett Dyer is one of very few 17th-century women who are remembered today. She is usually described as a Quaker hanged in the cause of religious freedom, but genealogists and historians know there is much more to her. Christy K Robinson brings the Dyers to vivid life for the rest of us, weaving superb fiction with what is known into a penetrating novel. Robinson’s research is flawless, and her engaging characters invite you into their brilliantly imagined world. Brava!” – Jo Ann Butler, author of Rebel Puritan trilogy. Key Mary Barrett Dyer, Anne Hutchinson, John Winthrop, civil disobedience, Great Migration, 17th century, William Dyre, Boston, Rhode Island, England, St Martin-in-the-Fields, Westminster, Reverend John Cotton",
  "genres": [
    "Historical Fiction",
    "17th Century"
  ],
  "author": "Christy K. Robinson",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/18583990-mary-dyer-illuminated"
}