{
  "title": "When Goblins Rage",
  "description": "Third in an ongoing Dark Heroic Fantasy series, 'When Goblins Rage' continues where 'Duel at Grimwood Creek' left off, promising more unrelenting action, oddball mages, and a foul-mouthed wisecracking heroine tougher than a hardboiled egg. Following in the footsteps of Conan, Drizzt, the Gray Mouser, Elric, Druss, and many more heroes of Sword and Sorcery, the elf called Nysta will carve her own epic path.And that path will be bloody.---The feel of the two handles in her fists helped ease the panic, but didn't do much to quell the rising dread as a muted crack sounded in her ears and the shadows exploded above her head, dropping the goblin down onto her shoulders like a sack of potatoes.He landed with a gleeful squeak, small razor hissing through the air to nestle in the crook of her neck just below her ear.The cold threat of the blade on her skin made her freeze and she let her breath slither through her teeth in frustration as the goblin giggled in her ear. A droplet of sweat squeezed from her pores and slithered down the edge of the blade.“Bloodhand!” He cried with childish delight. “It Quietly here. You surprised? I bet you not see me up here.”Unsure of the little creature's intentions, and deeply aware of the fickle nature of goblins, she didn't move. Managed to keep her voice even as she drawled; “Yeah, feller. You sure got the drop on me.”---Sometimes hate comes in small packages...In the months following the murder of her husband and the brutal trail of vengeance she left behind, the elf called Nysta has struggled with her desire to leave the Deadlands and head north beyond the Wall. Now the Grey Jackets, Rule’s most fanatic of soldiers, have followed her from the ruins of Grimwood Creek and they'd like nothing more than to see her dead.Turning to the relative safety of an ancient fort in the shadow of the vampire-haunted mountains called the Bloods, the elf finds herself in the company of a mercenary thirsting to test his skills against her own.And, as if that wasn’t enough to contend with, hot on her heels is an army of goblins.Goblins who appear to want nothing more than to send her screaming into the arms of their god for an eternity of suffering.Looks like everyone wants the Shadowed Halls to open above her head. But what they never counted on was that when death’s gates open, Nysta wouldn’t be entering them alone. She’ll be taking everyone with her.Provided, of course, she can rid her mind of the awful fog which seems to be trying to drown her mind…",
  "genres": [
    "Fantasy"
  ],
  "author": "Lucas Thorn",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/18583390-when-goblins-rage"
}