{
  "title": "Cursed: The Complete Series, #1-3",
  "description": "This boxset includes all books in the series; Verity, Clarity, Adversity and Purity. Verity (Cursed, #1)Sixteen-year-old Perdita Rivers has spent her entire sheltered life being told what to do. Lately, she’s felt ready for a change, and the universe seems to agree. Her new best friend’s brother is the boy of Perdita’s dreams. Literally. Even though he plays hot and cold, she’s sure there’s more to it, but she’s kind of distracted by the sense she’s being followed - not to mention the rumours of wild animal sightings that seem to mean more to her new crush’s family than they should. Perdy’s on a mission to find the truth, but maybe the truth is the danger she should hide from, after all.Clarity (Cursed, #2)Perdita’s still dealing with the consequences of her actions when her enemies change their targets with no warning, but it’s the unexpected betrayal of those closest to her that hurts the most. When her world shifts beneath her, Perdy has to figure out how to stay standing without losing any more of herself to the werewolves.Nathan’s watching everyone pull away from him, but he can’t control his destiny. He’s trying to protect his loved ones, but something always seems to get in the way. A public attack has everyone talking about wolves, and all eyes are on his family. His grandfather has lost his mind, and Nathan’s caught in the crossfire, but all of his choices will cost him a sacrifice. One way or another.Nobody’s watching Amelia… Big mistake.Adversity (Cursed, #2.5)Kali is the seventh of seventh, both blessed and cursed. With a father willing to sell her, and a life already mapped out for her, she’s desperate for an escape. But her way out can only come from the most unavailable person she knows, and stealing happiness comes with a price that many generations will bear.Amelia’s haunted by disturbingly vivid dreams about a gypsy girl but ignored by everyone else in her life. She’s desperate to prove herself. To show everyone she can help. So when her brother and best friend display the influence of the curse on their free will—or lack of it—and a spirit warns of Perdita’s fast approaching death, she knows she has to do something. Yet she can’t ignore that something huge is happening to her too, and her journey leads her back to where it all began, but not everyone wants her help, after all.Purity (Cursed, #3)Perdita’s life has gone back to normal in all of the worst ways, while Nathan doesn’t even recognise himself anymore. Still, they’re both trying to make do the best way they know how.But when they finally catch sight of that flicker of light at the end of the tunnel, Vin plays his final, most deadly, hand.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Paranormal",
    "Supernatural",
    "Amazon",
    "Collections",
    "Werewolves"
  ],
  "author": "Claire Farrell",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/18589218-cursed"
}