{
  "title": "Ancient Aliens and the Lost Islands: Through the Wormhole",
  "description": "Does Earth have portals to an extraterrestrial world? Do these portals lead to the legendary island paradise where the old grow young again? Our ancestors believed in a physical place that promised health, happiness, and immortality. Today we consider the old legends to be myths, nothing more than sailor’s fish stories. Yet some of the most prominent names in history devoted their entire lives to searching for the lost island of paradise — and they found it.One or more islands were hidden on the other side of a portal, or wormhole, which made the islands accessible to Earth. Extraterrestrials such as the Nordics and giants lived among us on both sides of the wormhole. They traveled from their world to ours and exposed our ancestors to advanced technology that we had no words for, except to call it magic.We described magic boats, magic mirrors, people with magical powers, and other wonders that seemed beyond belief. The magic was nothing more than motorboats, radios, computers, electricity, voice activated GPS systems, remote controls, prosthetic limbs, advanced medicine, revolving castles, and cloaking technology. We’ve already achieved most of this magic ourselves. The extraterrestrial visitors had even unlocked the secrets of aging, and for awhile our ancestors had access to it.On the other side of the wormhole, we saw a sun that was different from our own, and cities or castles suspended in the air. These extraterrestrial cities were described as being \"not on Earth.\" Time flowed differently and you didn’t come back to Earth in the same year that you left it. Historic documents all around the world spelled it out for us.Sometimes the otherworlders took the role of leaders, teaching us and guiding us. Sometimes they took the role of gods who bickered among themselves, or took sides in our battles, sometimes helping us, and other times causing strife. We embraced these beings until humans spread out over the world, and one by one the visitors left. One visitor gave a parting speech, and then ascended up into the air in his vehicle, and disappeared into the clouds.Apparently we rose up against some of the ancient aliens, and we even targeted them with the witch hunts. We sent the message that they were no longer welcome here, and those we didn’t kill retreated back through their wormholes, closing up most of the wormholes behind them. Those who were willing to adapt were embraced, and merged into our society permanently.A few portals remained, however, even into the 1900s, and humans not only found them, they visited \"paradise\" and came back to tell the tale. The most compelling clues come from the Native American peacemaker Hiawatha, the Norse gods, and a race of magical people known as the Tuatha dé Danann of Ireland and surrounding regions.Ancient Aliens and the Lost Islands: Through the Wormhole follows the clues that were left behind, and attempts to piece it all back together. What did the portals look like? What did humans see on the other side? Is there any correlation between these ancient aliens, and the extraterrestrials who are flying the skies today? What unsolved mysteries can we explain with these portals? Has our own science unlocked any of the answers? Do alien portals to paradise still exist?",
  "genres": [
    "Aliens",
    "Paranormal",
    "Historical"
  ],
  "author": "Lars Bergen",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/18589899-ancient-aliens-and-the-lost-islands"
}