{
  "title": "Skater Boy",
  "description": "ADULT CONTEMPORARY ROMANCE“Don’t judge a book by the cover. Skater Boy is an amazing touching heartfelt read. It took me by surprise with the level of depth this book has.” – Scandalous Book Blog** Sometimes it takes a broken person to make you whole **For 25 year old attorney, Hindley Hagen, life is all about staying one step ahead of the game. Avoiding surprises and keeping people at a distance is the only way she has to protect herself from the painful scars of her past.When she is offered a new position at her prestigious Austin law firm as sports agent for pro skateboarder, Rory Gregor, she’s ready for the new challenge, but completely unprepared for the man who captures her heart. Suddenly, Hindley is thrust into a world where protecting all their secrets could cost her everything—her family, her career, maybe even her life. Professional skateboarder and X Games royalty, Rory Gregor knows what it’s like to be at the top. But after years of bad decisions and one-night-stands, he’s working hard for a comeback he never anticipated. Hiring a new agent may be what his team thinks he needs to rebuild his career, but what if it costs him his heart in the process? Just when he thinks he’s posed for success, secrets from his past threaten to ruin his chance for gold and a new love.In a sport where trust means everything, this time it may not be enough.SKATER BOY is not a standalone book. You can read the conclusion to Rory and Hindley’s story in MY SKATER BOY, Book 2 in the X-Treme Boys Series, available now.** NOTE: SKATER BOY contains adult material and language and is intended for readers over 18 years old.**X-TREME BOYS SERIES READING LIST** SKATER BOY, Book 1 MY SKATER BOY, Book 2 (Hindley and Rory - Books 1 & 2 complete their story) MOTO BOY, Book 3 MY MOTO BOY, Book 4 (Dana and Peter - Books 3 & 4 complete their story)Amazon US: http://bit.ly/AmazonUSSkaterBoyAmazon UK: http://bit.ly/AmazonUKSkaterBoyAmazon AU: http://bit.ly/AmazonAUSkaterBoyAmazon CA: http://bit.ly/AmazonCASkaterBoyiBooks: http://bit.ly/iBooksSkaterBoyB&N: http://bit.ly/BNSkaterBoyWEBSITE: www.kaymanis.comFACEBOOK: www.facebook.com/kaymanisauthor2TWITTER: www.twitter.com/kaymanisINSTAGRAM: www.instagram.com/kaymanis",
  "genres": [
    "Romance",
    "Sports",
    "New Adult",
    "Sports Romance",
    "Amazon",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Kay Manis",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/18590182-skater-boy"
}