{
  "title": "Water and Fire",
  "description": "A steamy contemporary medical romance involving a sexy doctor, a naughty nurse, a midwife on a mission and a mysterious predator in Albany, Western Australia. Working as a student midwife in an Australian country hospital is never easy, but Belinda finds more trouble than most.There's the intern doctor who follows her around like an overgrown puppy, the dangerous local wildlife and her own secrets she must keep. When she finds herself without a place to live, what else can possibly go wrong? Or is it time for something to go right? A tiny taste of what's in store:I touched my fingers to his shoulder to steady myself before reaching for my drink. His face split in a wide grin beneath his ocean-deep eyes. \"I think you've had enough. What'll you give me for it?\"I shrugged. \"What do you want?\" His smile shrank, becoming more thoughtful. \"You could start with a kiss.\"I looked into those yearning, deep-water eyes of a man who seemed all fire. It's been a long time, but I think I still remember how. I cautiously placed my hands on the sides of his face and touched my lips to his. His mouth was open, so the draught of his breath cooled my lips for the briefest moment before I pulled away. \"F*** that!\" He strode to the coffee table and clunked the glasses down. His hands were empty for barely a moment before they were splayed warmly on my back. \"Belinda. That's not a kiss.\"I moved with him as he pulled me closer, one of his hands travelling up to the back of my neck as the other drifted down to the small of my back. I leaned in closer still. He bowed his head as I tilted mine up. I wet my lips and parted them, feeling fear for the first time. Perhaps I have forgotten how to do this. This is a stupid idea.  He pressed his mouth to mine, layering our lips as we shared a breath. His smiling blue eyes drooped to show blue-veined lids as his tongue stroked mine. I haven't forgotten. This is new and I'm going to...I'm going to...His shoulders were smooth beneath my questing fingers, his lips warm and responsive as I deepened my kiss. I felt his chuckle rumble through both of us, though I couldn't see him with my eyes closed. He tasted of whiskey with a hint of chocolate and I wanted more...\"Now that's a kiss.\" Ocean's Gift series This book is a stand-alone prequel to the Ocean's Gift series, which currently includes:\nOcean's Gift (Book 1) \n  \nOcean's Infiltrator (Book 2) \n  \nWater and Fire",
  "genres": [
    "Romance",
    "Fantasy",
    "Paranormal",
    "Contemporary Romance",
    "Mermaids",
    "Paranormal Romance",
    "Australia"
  ],
  "author": "Demelza Carlton",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/18593080-water-and-fire"
}