{
  "title": "Visions of a Better World: Howard Thurman's Pilgrimage to India and the Origins of African American Nonviolence",
  "description": "In 1935, at the height of his powers, Howard Thurman, one of the most influential African American religious thinkers of the twentieth century, took a pivotal trip to India that would forever change him—and that would ultimately shape the course of the civil rights movement in the United States.   When Thurman (1899–1981) became the first African American to meet with Mahatma Gandhi, he found himself called upon to create a new version of American Christianity, one that eschewed self-imposed racial and religious boundaries, and equipped itself to confront the enormous social injustices that plagued the United States during this period. Gandhi’s philosophy and practice of satyagraha, or “soul force,” would have a momentous impact on Thurman, showing him the effectiveness of nonviolent resistance.   After the journey to India, Thurman’s distinctly American translation of satyagraha into a Black Christian context became one of the key inspirations for the civil rights movement, fulfilling Gandhi’s prescient words that “it may be through the Negroes that the unadulterated message of nonviolence will be delivered to the world.” Thurman went on to found one of the first explicitly interracial congregations in the United States and to deeply influence an entire generation of black ministers—among them Martin Luther King Jr.   Visions of a Better World depicts a visionary leader at a transformative moment in his life. Drawing from previously untapped archival material and obscurely published works, Quinton Dixie and Peter Eisenstadt explore, for the first time, Thurman’s development into a towering theologian who would profoundly affect American Christianity—and American history.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "African American",
    "Religion",
    "Spirituality",
    "India"
  ],
  "author": "Quinton Dixie",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/18590573-visions-of-a-better-world"
}