{
  "title": "Rotten Legend",
  "description": "Welcome to the Burkville Institution, the home of a variety of residents ranging from recovering drug addicts and alcoholics, to other more serious mental disorders, who will most likely never return to society. Early this morning, hours before sunrise, Cyrus is being led to the Infirmary where he will receive the final injection of an experimental virus which is hoped to cure his Schizophrenia. He has suffered enough in this life, has been forgotten by his family, and hopes this voluntary treatment will erase the suffering from his painful childhood memories, along with improving his chance for positive future endeavors.After returning to bed following the treatment, he is awakened in a cold sweat, with searing pain erupting inside his head. He is able to rise to his feet, and stand just long enough to stagger over in the moonlight of his small room to the desk where his Bible rests. He receives a shocking prophecy just before he collapses into convulsions on the floor.Chaos erupts when his “treatment” becomes highly contagious and begins to run rampant through the Institution. Violent cannibalistic behaviors ensue, while the creator of the treatment, Dr. Cho, along with the head of security, Gibson Hart, struggle to contain the outbreak, while also fighting to stay alive. Time is running out.In a small apartment in downtown Greensboro, Chase is trying to relax with some television and beer, when a shocking message on the TV relays an Emergency Broadcast Report of a chemical spill; along with an unusual warning to lock all doors and stay inside. Soon an unwelcome visit by a neighbor becomes Chase’s first step into a world that will soon be turned upside down.Not far away, Attics has just returned to his underground bunker from a successful hunting trip. He is merrily unloading the harvest and is processing the meat, completely unaware of the outbreak that is occurring not far away at Burkville. Not that it matters too much though, because Atticus and the Infected may just have more in common than anyone could have imagined.Rotten Legend combines gruesome horror, intense action, and the disturbing drama of unlikely relationships between survivors in a collapsing world. Enter a place where the survivors must question who is more dangerous; the Infected or themselves?",
  "genres": [
    "Horror",
    "Zombies"
  ],
  "author": "Sylvan Kills",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/18592214-rotten-legend"
}