{
  "title": "Work",
  "description": "By itself, this is a book about work, but it s also more than that. It complements a diagram of the different positions and dynamics that make up the economy that necessitates work. Together, the book and diagram outline an analysis of what it is, how it works, how we might dis- mantle it. And the book, the diagram, and the analysis are all outgrowths of something more a movement of people determined to fight it. So this book isn t just an attempt to describe reality but also a tool with which to change it. If any of the words or illustrations resonate with you, don t leave them trapped on these pages write them on the wall, shout them over the intercom at your former workplace, change them as you see fit and release them into the world. You can find poster versions of many of the illustrations at crimethinc.com/work for this purpose. This project is the combined effort of a group of people who have already spent many years in pitched struggle against capitalism. What qualifies us to write this? Some of us used to be students or pizza deliverers or dishwashers; others still are construction workers or graphic designers or civic-minded criminals. But all of us have lived under capitalism since we were born, and that makes us experts on it. The same goes for you. No one has to have a degree in economics to understand what s it s enough to get a paycheck or a pink slip and pay attention. We re suspicious of the experts who get their credentials from on high, who have incentives to minimize things that are obvious to everyone else. Like every attempt to construct a scale model of the world, this one is bound to be partial in both senses of the word. To present the whole story, it would have to be as vast as history. There s no way to be unbiased, our positions and values inevitably influence what we include and what we leave out. What we offer here is simply one perspective from our side of the counter and our side of the barricades. If it lines up with yours, let s do something about it. better ashes than dustCrimethInc. Workers Collective",
  "genres": [
    "Politics",
    "Nonfiction",
    "Economics",
    "Philosophy",
    "Anarchism",
    "Labor",
    "Comics"
  ],
  "author": "CrimethInc. Ex-Workers' Collective",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/10998908-work"
}