{
  "title": "Another Rock Star",
  "description": "Reed Lang has been called a lot of things in his life. Freak. Faggot. Queer. Now he's called...famous. He was born to sing; it's his obsession and salvation. But you can sing like an angel and dance with the devil and never get close to breaking into the big leagues of the cutthroat music business. With his one in a million voice, and more than a few strokes of luck, he happens to grab the attention of the right movers and shakers at the right time. Now he's earned the chance to live out a lot of people's secret dream - to Be a Rock Star. There's always the fantasy of fame and success: maybe pretty boys and hunks lining up to bang at your door. Maybe shopping sprees and red carpets. Maybe artistic freedom and getting paid for doing what you love most in the world. Now, though, it's time to work harder than ever. He's landed a major label deal and scored two hit singles. It's time to hire the backing band, shoot the videos, and head out on the highway. But what happens on stage is only half the show.You couldn't throw together a more diverse group of topnotch musicians than Reed, Shane, Kayla, Fred, Meghan and Rudy. But exhilarating performances, entertaining extracurricular activities, and excruciating travel on the \"bouncy bus\" forge a bond they'll never forget as they crisscross the country. They come to know each other in ways that only a traveling band can understand. And as the tour grinds on, sometimes the euphoric energy of the concerts can't be contained and passions collide. Secrets crumble. Reed doesn't know what to make of it when the tantalizing stage chemistry he shares with the enigmatic, and sometimes truly dangerous guitarist, Shane, takes on a life of its own. Shane probably hooks up with more women than Reed picks up men, and the fact that none of that matters on stage, that they only seem to have eyes for each other, adds fuel to the fire for the fans. It's like a show within a show. But just how hot will the complex fire between the singer and the guitar player burn, on stage and off? What's been hiding behind the walls, and what happens as they start to fall? Some lessons you can only learn the hard way. And even then there's still the \"real world\" waiting for them when they get off the bus for the last time... Underneath it all, maybe Reed will discover there's more to life than being another rock star.",
  "genres": [
    "M M Romance",
    "Romance",
    "Music",
    "Contemporary",
    "Musicians"
  ],
  "author": "Paula Coots",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/18592047-another-rock-star"
}