{
  "title": "The Alpha-Bet",
  "description": "Christy Cross is gorgeous, athletic, a college student, a black belt in Taekwondo, and works at a coffee shop. Christy is sexually frustrated. Christy had one sexual encounter in her life - as a senior in high school. The experience went so wrong that she has abstained from sex for years - until now. One of Christy's problems is her drinking - she drinks a lot. In a drunken stupor with a friend in a bar, she made a bet. Christy takes making bets seriously, and will go to any length to win one. Any length.She made a bet that she could screw her way through the alphabet - and she has the summer to complete it. From A-Z. As if this weren't difficult enough, she has to do it in alphabetical order. She is able to use first or last names to check a letter off the list, but she must have sex to do so.What happens is not what she or anyone else expects. Armed with her back pack of necessities, she works her way from one letter to the next, trying to make her way to \"Z\". Christy quickly finds that she is an alpha-female, she has an insatiable desire to have sex, and she doesn't take any sh*t from anyone, male or female. Her alpha-female escapades get her into a lot of situations that other females can only dream about, sexually speaking. Along the way, she encounters the police, hipsters, druggies, other college students, Asian gangsters, asshats, assh*les, bikers, and some new friends.This romp, after the seventh chapter, is one sex scene in almost every other chapter. It, again, is not for the meek.. This is a very funny, somewhat graphic, and always entertaining novel. It is laugh-out-loud funny, not in parts - in whole. It is erotica, fiction, and humorous. it is funny (to some) The sex is descriptive, raw, and unreal. If you enjoyed Beats Hard Rock Harlets, and Strings you'll love this read. If you liked Unattainable, Aching to Exhale, or Viper's run, you may not like this. If you are easily offended, do not read this book. If you are not easily offended, read it at your own risk.It is entertaining. Very. If you have a sense of humor, and aren't sexually offended.WARNING**CAUTION**WARNING**CAUTION**WARNING**CAUTIONThis book is NOT a conventional romance novel. It is a humorous erotica. It is laugh out loud funny from beginning to end and It is HOT. It depicts a woman that is an Alpha female, and she is attempting to resolve her inner issues sexually...in ways you can only imagine.This book has dirty, raunchy, descriptive sex. It has one night stands, hook-ups, FWB situations, DP, FFM, MMF, internet dating, etc. If you are not prepared for these types of scenes, DO NOT read this book. This book is not for everyone. It is HOT and it is FUNNY. You will laugh out loud in almost every scene.Have fun, Christy is....",
  "genres": [
    "Erotica",
    "Humor",
    "Romance",
    "Contemporary",
    "College",
    "Chick Lit"
  ],
  "author": "Scott Hildreth",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/18590677-the-alpha-bet"
}