{
  "title": "Breaking Bad: 530 gramos (de papel) para serieadictos no rehabilitados",
  "description": "«A estas alturas, decir que Breaking Bad es una de las mejores series de la televisión de todos los tiempos no es ninguna novedad. Aclamada por el público y la crítica, la historia de Walter White se ha situado como un hito de la producción contemporánea y nos ha convertido a muchos, temporada tras temporada, en adictos irrecuperables. De modo que teníamos que dedicarle un volumen en nuestra colección de libros sobre las mejores series de la televisión y su relevancia en la cultura contemporánea. Para este volumen hemos contando con una veintena de autores que analizan la serie desde el ámbito de la teoría de la comunicación, la sociología, la política, la literatura, la filosofía, el periodismo o la historiografía de las drogas. Entre ellos Vince Gilligan, creador de Breaking Bad, que nos ofrece una amplísima y extraordinaria entrevista inédita en nuestro idioma. A él se suman escritores de prestigio, reconocidos pensadores y expertos de la pequeña pantalla y los grandes relatos. Un libro que trata sobre Breaking Bad y otras series que también adoramos como Los Sopranos o The Wire, Breaking Bad y esa mosca que podría echarlo todo a perder, Breaking Bad y las verdaderas fronteras de la vida, Breaking Bad y la química del poder, Breaking Bad y la materia de las decisiones, Breaking Bad y el Doctor Jekyll, Breaking Bad y Mr. Hyde, Breaking Bad y un irrepetible color azul, Breaking Bad y el sonido de nuestro propio desierto interior, Breaking Bad y la cocina fusión de la ética, Breaking Bad y el día a día del rodaje de Breaking Bad, Breaking Bad y los clones de Fausto, Breaking Bad y la enfermedad que a todos nos aqueja, Breaking Bad and meth, Breaking Bad and death, Breaking Bad and life… Un libro imprescindible que deberían leer hasta los camellos.» Autores: Vince Gilligan (creador de la serie) • Chuck Klosterman • Enrique Vila-Matas • Iván de los Ríos • Greg Littman",
  "genres": [
    "Nonfiction"
  ],
  "author": "Sergio Cobo",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/18596429-breaking-bad"
}