{
  "title": "The Bill of the Century: The Epic Battle for the Civil Rights Act",
  "description": "The Civil Rights Act of 1964 was the single most important piece of legislation passed by Congress in American history. This one law so dramatically altered American society that, looking back, it seems preordained-as Everett Dirksen, the GOP leader in the Senate and a key supporter of the bill, said, “no force is more powerful than an idea whose time has come.” But there was nothing predestined about the victory: a phalanx of powerful senators, pledging to “fight to the death” for segregation, launched the longest filibuster in American history to defeat it.The bill's passage has often been credited to the political leadership of President Lyndon Johnson, or the moral force of Martin Luther King. Yet as Clay Risen shows, the battle for the Civil Rights Act was a story much bigger than those two men. It was a broad, epic struggle, a sweeping tale of unceasing grassroots activism, ringing speeches, backroom deal-making and finally, hand-to-hand legislative combat. The larger-than-life cast of characters ranges from Senate lions like Mike Mansfield and Strom Thurmond to NAACP lobbyist Charles Mitchell, called “the 101st senator” for his Capitol Hill clout, and industrialist J. Irwin Miller, who helped mobilize a powerful religious coalition for the bill. The \"idea whose time had come\" would never have arrived without pressure from the streets and shrewd leadership in Congress--all captured in Risen's vivid narrative.This critical turning point in American history has never been thoroughly explored in a full-length account. Now, New York Times editor and acclaimed author Clay Risen delivers the full story, in all its complexity and drama.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "American History",
    "Race",
    "African American",
    "Social Justice"
  ],
  "author": "Clay Risen",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/18594400-the-bill-of-the-century"
}