{
  "title": "Unreasonable Men: Theodore Roosevelt and the Republican Rebels Who Created Progressive Politics",
  "description": "\"As Michael Wolraich argues in his sharp, streamlined new book, Unreasonable Men, it was 'the greatest period of political change in American history.'\" -Washington Post, 50 Notable Works of NonfictionAt the turn of the twentieth century, the Republican Party stood at the brink of an internal civil war. After a devastating financial crisis, furious voters sent a new breed of politician to Washington. These young Republican firebrands, led by \"Fighting Bob\" La Follette of Wisconsin, vowed to overthrow the party leaders and purge Wall Street's corrupting influence from Washington. Their opponents called them \"radicals,\" and \"fanatics.\" They called themselves Progressives.President Theodore Roosevelt disapproved of La Follette's confrontational methods. Fearful of splitting the party, he compromised with the conservative House Speaker, \"Uncle Joe\" Cannon, to pass modest reforms. But as La Follette's crusade gathered momentum, the country polarized, and the middle ground melted away. Three years after the end of his presidency, Roosevelt embraced La Follette's militant tactics and went to war against the Republican establishment, bringing him face to face with his handpicked successor, William Taft. Their epic battle shattered the Republican Party and permanently realigned the electorate, dividing the country into two camps: Progressive and Conservative.Unreasonable Men takes us into the heart of the epic power struggle that created the progressive movement and defined modern American politics. Recounting the fateful clash between the pragmatic Roosevelt and the radical La Follette, Wolraich's riveting narrative reveals how a few Republican insurgents broke the conservative chokehold on Congress and initiated the greatest period of political change in America's history.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "American History",
    "Biography",
    "Presidents",
    "Book Club"
  ],
  "author": "Michael Wolraich",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/18594434-unreasonable-men"
}