{
  "title": "Infinitesimal: How a Dangerous Mathematical Theory Shaped the Modern World",
  "description": "On August 10, 1632, five men in flowing black robes convened in a somber Roman palazzo to pass judgment on a deceptively simple proposition: that a continuous line is composed of distinct and infinitely tiny parts. With the stroke of a pen the Jesuit fathers banned the doctrine of infinitesimals, announcing that it could never be taught or even mentioned. The concept was deemed dangerous and subversive, a threat to the belief that the world was an orderly place, governed by a strict and unchanging set of rules. If infinitesimals were ever accepted, the Jesuits feared, the entire world would be plunged into chaos.In Infinitesimal, the award-winning historian Amir Alexander exposes the deep-seated reasons behind the rulings of the Jesuits and shows how the doctrine persisted, becoming the foundation of calculus and much of modern mathematics and technology. Indeed, not everyone agreed with the Jesuits. Philosophers, scientists, and mathematicians across Europe embraced infinitesimals as the key to scientific progress, freedom of thought, and a more tolerant society. As Alexander reveals, it wasn't long before the two camps set off on a war that pitted Europe's forces of hierarchy and order against those of pluralism and change.The story takes us from the bloody battlefields of Europe's religious wars and the English Civil War and into the lives of the greatest mathematicians and philosophers of the day, including Galileo and Isaac Newton, Cardinal Bellarmine and Thomas Hobbes, and Christopher Clavius and John Wallis. In Italy, the defeat of the infinitely small signaled an end to that land's reign as the cultural heart of Europe, and in England, the triumph of infinitesimals helped launch the island nation on a course that would make it the world's first modern state.From the imperial cities of Germany to the green hills of Surrey, from the papal palace in Rome to the halls of the Royal Society of London, Alexander demonstrates how a disagreement over a mathematical concept became a contest over the heavens and the earth. The legitimacy of popes and kings, as well as our beliefs in human liberty and progressive science, were at stake-the soul of the modern world hinged on the infinitesimal.",
  "genres": [
    "History",
    "Science",
    "Mathematics",
    "Nonfiction",
    "Philosophy",
    "History Of Science",
    "Religion"
  ],
  "author": "Amir Alexander",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/18593597-infinitesimal"
}