{
  "title": "Sleepwalkers",
  "description": "In an empire ruled by sex, threats, and mind control, a young genius struggles to free his people – until he’s captured and brainwashed himself. Under the influence of the sadistic General Hawthorne, he will betray everything and everyone he loved most. But Paul Medina has a secret even he doesn’t know; and one day it will cause him to wake up, literally buried under a mountain of enemies. Then this sheltered young scientist must try to hide his new status and free his colleagues from the General’s control.But that’s only the start of Paul’s struggle. While he was still a sleepwalker, he brainwashed his own wife; and now Shara is out there somewhere trying to take down the last of the Resistance. At the top of her “Wanted” list is Wizard, a hacker whose mind is much more agile than her body. Enslaved, Wizard might bring down the last of the Resistance; but free, she might help save them all.Sleepwalkers is an erotic novel of mingled hope and horror, destruction and restoration, guilt and forgiveness. None of its characters leave the story unchanged.Now here are some reviews from the Erotic Mind Control community:This novel is proof positive that the old rules don't apply. This self-published novel rivals any science fiction I have ever read for quality and entertainment value....Epic. Sorry, that did it. I'm out of superlative adjectives now. If this novel had been on the shelves in the SF section at Barnes and Noble 10 years ago or so, I gladly would have shelled out five or ten bucks cash for it. -Baltimore RogersThis story is a work of art that was apparently inspired by one of the author's lifelong fantasies, and her efforts to novelize that fantasy have produced, in my opinion, one of the all-time masterpieces of the genre. -ApollyonHeartbreakingly beautiful, and optimistic in a way little else in the genre manages. A tour de force that is both a work of art and hot as hell. Congratulations to Ms. Cantatis. -AaronhaltWhile 'Sleepwalkers' is in no way a stroke story, even the few erotic scenes have a ton of dramatic weight to them, every chapter's been a delight to read, and stayed with me far longer than most \"stroke\" stories have, inspired me to no end from characterization to the depth of research that thrall's put into the inner workings, and that's telling. -Uzobono",
  "genres": [],
  "author": "A. Regina Cantatis",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/18595025-sleepwalkers"
}