{
  "title": "Total Life Coaching: 50+ Life Lessons, Skills, and Techniques to Enhance Your Practice . . . and Your Life",
  "description": "It is an interactive experience in which you will find recipes for living your life more authentically, as well as master time-honored lessons that you can bring to your coaching clients. Regardless of the personal coaching techniques or skills you may have learned, you may still not be the most effective coach you can become. This book will help you move closer to that goal.Life coaching is more than a collection of techniques and skills. It is more than something you do. Life coaching reflects who you are-it is your authentic being in action.Readers of Pat Williams's and Deborah Davis's book, Therapist as Life Coach, know Pat to be a gifted life coach and passionate teacher. Here Pat and colleague and writer, Lloyd J. Thomas, build on this earlier book and share a unique insight into the coaching process, which shows you precisely how to enhance your professional practices through practical and effective life coaching. It also empowers you to change your own lives through use of the practical information and philosophy presented here.Total Life Coaching is organized into a series of 50 life lessons, and is designed to be either read cover-to-cover or dipped into, as needed, for assistance when conducting a coaching session. Keeping life's processes on the \"message and lesson\" level makes living and life coaching much easier and more enjoyable. Total Life Coaching guides you step-by-step through the complex process of learning and coaching these fifty important lessons. The lessons are organized into 8 sections: Creating a Personal Identity; Coaching Spirituality and Life Purpose; Coaching Communication Skills; Living Life with Integrity; Success: Clients Achieving their Potential; Coaching Cognitive Skills; Creating High-Quality Relationships; Understanding Your Past to Create a Desired Future.Each lesson is presented as a structured recipe and includes:The life lessonThe messages contained within the lessonCoaching objectives for your clients regarding the lessonWhat you need to know about the lesson to provide the framework for coaching itCoaching methods, exercises, questions, and language for bringing each lesson to your clientsSample coaching conversations that exemplify the coach-client dialogue for the coaching of the lesson.",
  "genres": [],
  "author": "Patrick  Williams",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/1011374.Total_Life_Coaching"
}