{
  "title": "Just A Small Town Girl",
  "description": "\"You know how it is, right? You're a small town girl. Everyone knows your business. Everyone knows your damage. Sometimes it just feels good to have something that nobody else knows about. Something that doesn't get discussed and analyzed and picked over by the world and his goddamn wife.\"Lacie Jones finished college with a pile of student loans, a comprehensive knowledge of Shakespearean dick jokes and no idea what she wanted to do with her life. Her plans to write the next great American novel quickly fall apart as she spends more and more time stuck behind the counter of her father's antique store, and she's losing hope of ever getting out and making it on her own. A popped Achilles tendon stole star position Clayton McNeal’s football scholarship, and even his back-up plan to be a carpenter fell apart when the bottom dropped out of the housing market. It's dropped out of his double-wide trailer, too, and if something doesn't change soon, he's going to end up homeless. On top of that, his love life has degenerated to the point where he's doing the walk of shame through the same neighborhoods every week and his friend Steve's latest 'business proposition' looks like the kind of thing that can land a guy in a whole heap of trouble. When he answers a job application for a small antique store he's startled to find the girl he knew only as 'Lindsay' working behind the counter. She's secretive, closed-off and stubborn, but even she can't deny that there's something there. And one-night stands have a hell of way of coming back to bite you. Just a Small Town Girl is the debut novel by romance author Jessica Pine, and this sweet, new adult romantic comedy is recommended for ages 17+ due to mature content.",
  "genres": [
    "New Adult",
    "Contemporary Romance",
    "Amazon"
  ],
  "author": "Jessica Pine",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/18597701-just-a-small-town-girl"
}