{
  "title": "The Bride Stripped Bare By Her Bachelors, Even",
  "description": "This is a wonderful comic novel, about philosophy, the nature of art, the beauty of the ordinary, and about quirky, complete, night & day victims of obsessive-compulsive disorder. Two charming, over-anxious, germ-phobic friends, Isaac and Greg take a road trip from Boston to Philadelphia. They are both obsessed with Marcel Duchamp, his art and his ideas, and thus the destination has to be the largest collection of Duchamp in the world, The Philadelphia Art Museum, the actual place \"The Bride Stripped Bare by Her Bachelors, Even\" was to be delivered when it was cracked and broken in shipment. The piece is sometimes known as The Large Glass, and today it sits in the middle of a large gallery proudly displayed in its broken state which Duchamp repaired and then certified had been his intention all along.The two men are driven in a rented disinfected Winnebago by Kelly, a beautiful art scholar who smells like a mixture of lemons and fresh sawdust. They intend to pick up an ancient chocolate grinder, an exact working sculptural copy of one used in a Duchamp painting. Isaac intends to grind his own pure chocolate, which will prevent the build-up or arterial plaque, because his mother died of a stroke. Every action has its own suitable reaction, and then some. Isaac hopes eventually to overcome his devotion to his many obsessions and to re-enter the world, evidently his version of the real world. He is not an unreliable narrator, he is a hyper-reliable narrator, consumed by his own attention and thrilled with the connections he sees everywhere all at once. Of course when he finally gets to the museum he must dress-up as a woman to visit the collection.",
  "genres": [
    "Fiction",
    "Novels",
    "Contemporary",
    "Art"
  ],
  "author": "Chris F. Westbury",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/18596523-the-bride-stripped-bare-by-her-bachelors-even"
}