{
  "title": "Forever & Always",
  "description": "WARNING: I don't write about fairy tales and as much as I love Disney... I don't promise my readers or guarantee my characters a 'Happy Ever After...' Happy endings are harmonious but they're not always real life. I'm a sucker for bittersweet endings so please prepare yourself for one of them before purchasing one of my novels. Hearts and flowers won't be found in my writing and neither will perfect conclusions to my stories.Newly revised & edited on: 20/12/2015***This is the second and final instalment in the 'Always & Forever' series.***Always & Forever Series:#1 Always & Forever#2 Forever & AlwaysShe’s mine.She belongs to me.I will never let her go.I will destroy anyone who tries to take her from me.I will annihilate those who try and come between us.I will protect her with my life.Even if it means sacrificing my own... - JakeJake's possessive ways and intense nature used to scare me but now... I don't know anything different. I've become so used to raging fires, volcanic disruptions and earth shattering amounts of heartache. He's still the man I fell in love with but I no longer recognise the girl that Jake rescued several months ago. I don't know where to find her or how I'm supposed to start searching for the girl I used to be. The truth is... I'm lost and while Jake wasn't looking, someone else might have found me... - BethanyFind out what happens next in the breath-taking conclusion to Jake and Bethany’s tumultuous love story. Forever and Always will captivate, shock, amaze and enthral as you find out if true love has the strength to conquer all.Excerpt: “You are mine.” He growls directly into my ear, walking forwards until my back meets with the wall behind me. “You’ve always been mine and you will be forever. Bethany… if you don’t understand that by now then it means you don’t understand me. No matter what you do, no matter how hard you try to push me away... I won’t let it happen. I can’t let you go. I just can’t. You are the one thing in this world that matters to me and I am never, ever going to give up on that. You belong to me and I’m going to make sure you never forget it.” - Jake*** This New Adult romance novel contains mature themes, scenes of violence, strong language and sexual citations. It is recommended for readers 18+ ***",
  "genres": [],
  "author": "Lauren  Crossley",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/18600068-forever-always"
}