{
  "title": "Love and Decay, Vol. One",
  "description": "Zombies- as if that wasn’t enough to ruin any girl’s dream of a happily ever after.A vaccination gone oh so wrong and a huge portion of the world’s population was turned into Zombies. Reagan Willow is forced out of her home when her parents become casualties of the horrid Zombie Apocalypse. With the help of her best friend Haley, they’ve become somewhat of experts on surviving the dangers of a world thrust into chaos and decay. Reagan and Haley are on a vague mission to find somewhere safe to live out the remainders of their terrifying life when they stumble upon the Parkers, a pack of brothers that seem to have the survival thing down in a much more efficient and successful way than Reagan could ever have imagined. They are also protecting their eight year old sister, Page, and will do anything to keep her safe. The brothers decide that Reagan and Haley need help with being kept safe as well, and as a group they set off to find the Zombie-free utopia Reagan is dreaming of.Zombies are a daily problem, constantly threatening the lives of their group, but they’re not the only peril on the journey ahead. Militia groups of power hungry men are also a constant concern. And settlements of paranoid, suspicious people turn out to be just as hazardous. Danger looms over every inch of the way, but Reagan, Haley and the Parkers are determined to get to their goal and remain together. Soon the Parkers become more to Reagan than just traveling companions and more than friendship starts to develop between her and Hendrix, the second oldest brother. But at the end of the world, nothing can be as simple as life and death. Now, Reagan is going to have to schedule falling in love between hunting and surviving. Hopefully she can last long enough to find out if true love can still exist when everything else has started to fall apart.Love and Decay, Volume One, is a compilation of the first six episodes in a twelve episode season. It is a Dystopian Romance Novella Series about Zombies, the end of the world and finding someone to share it with.This story takes place over multiple episodes, with a release date every two weeks. Each episode is approximately 20,000 words.",
  "genres": [
    "Zombies",
    "Romance",
    "Young Adult",
    "Paranormal",
    "Dystopia",
    "Horror",
    "Post Apocalyptic"
  ],
  "author": "Rachel Higginson",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/18596633-love-and-decay-vol-one"
}