{
  "title": "Wrong Girl",
  "description": "WARNING: I don't write about fairy tales and as much as I love Disney... I don't promise my readers or guarantee my characters a 'Happy Ever After...' Happy endings are harmonious but they're not always real life. I'm a sucker for bittersweet endings so please prepare yourself for one of them before purchasing one of my novels. Hearts and flowers won't be found in my writing and neither will perfect conclusions to my stories.This book is the first in the 'Wrong Girl' series.\"You don’t think I know how messed up this is? You think I don't know how sick and twisted it is of me to want you? I know this is wrong. I know I shouldn't even be thinking about you in this way but that doesn't change the fact that I do! Samantha, I want you every second of every minute of every day and it’s killing me. I can't stay away from you anymore, I just can't do it. I need you and I know you feel the same way about me. We belong together and nothing you say or do is going to convince me otherwise. When I’m with her... I’m aching for you, I physically hurt because I can't be with you and I don't know what the hell I'm supposed to do to make this right! The idea of never being able to have you is making me crazy. You're driving me insane and I'm seriously close to losing my mind if you tell me I can't have one more night with you. You’re not the wrong girl, Samantha, she is.” – Zack.“There are roughly seven billion people in the world. Seven billion people and I’ve somehow managed to fall in love with the only person I can’t have. The only man on this earth who I can’t be with and who I should never, ever want. He’s my soul mate, my saviour and the only man I need. He’s also my sister’s fiancé.” - Samantha.Samantha is 23 and broken. She’s always been the one and only disappointment within her superficial and judgemental family. Over the years she’s given up on the idea of pleasing them, the only one who’s ever treated her fairly is Rachel and that’s why she doesn’t mind when all of the praise and glory is bestowed upon her older and extremely beautiful sister. She has never envied Rachel before… until now.Samantha feels something for her sister’s fiancé from the first moment that she sees him. He’s kind, gentle, unbelievably gorgeous and incredibly off-limits. She knows she shouldn’t want him but no matter what she does she can’t seem to get him out of her head. Of course all of the guilt and emotional torment that she’s dealing with is pointless because he doesn’t feel the same way about her… does he?Zack doesn’t understand the indescribable, overwhelming connection that he feels to his fiancé’s younger sister. At first he convinces himself that he only feels sorry for her, he doesn’t understand why the family he’s marrying into treat her like an outcast. He’s determined to find out what happened to this girl to make her so introverted and distrustful but even Rachel advises him to leave well alone. How long can Samantha and Zack deny what they’re feeling and stay away from one another? And will he still be there for her after he discovers her dark secret, one that she’s concealed for sixteen years?Decisions must be made and hearts will inevitably be broken when Zack is forced to make his choice. He’s always believed his attraction for Samantha to be wrong and he has come to despise himself for wanting the wrong girl but what if his own fiancé might just be the wrong girl for him?Wrong Girl is a story about forbidden love, envy, passion and heartache, a story about two people who fall in love in the very worst of circumstances.*** This New Adult romance novel contains mature themes, strong language, sexual citations and possible triggers regarding sexual abuse that may distress some readers. It is recommend for readers 18+***",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "Contemporary",
    "Abuse"
  ],
  "author": "Lauren  Crossley",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/18600070-wrong-girl"
}