{
  "title": "Fabulous Hell: A Novel",
  "description": "An Excerpt \"You might as well live.\"-Dorothy Parker AUGUST 1, 1991 The positive test result is given to me by a volunteer in the county clinic in Santa Rosa, California. I am also given a selection of handouts, including information on safe sex, support groups, and proper diet. I am told to limit my alcohol consumption to two ounces per week. I am urged to seek counseling. I am invited to stay and speak with a social worker. I decline. Numbly I exit through a rear door. I cannot face the people in the waiting room. They know. Upon being informed of the news, Mom insists on traveling from Huntington Beach every other week for two months. I do not want her. She has minimal maternal instincts. I do not trust her. Mom has hastily prepared a Durable Power of Attorney for Health Care, which I sign, and seen to it that I am written out of my grandparents' will in order to protect the estate from the Powers That Be should I fall ill. \"You know that I will always take care of you,\" she tells me. I do not. By her fourth visit our strained relationship falls into disrepair. We do not speak for many months. I'm glad to be rid of her. I work as a waiter at a gay resort in Guerneville, on the Russian River. I fuck the manager at the time of interview in order to get the job. My subsequent diagnosis has done little to calm my promiscuity. I wear shorts as part of my uniform. I don't bother to protect myself from hands of vacationing fags who behave like the crazed teenagers in Palm Springs Weekend , starring Troy Donahue and Connie Stevens. Tips are great. Much of my expendable income is spent on cocaine and carousing. I am sexually active, with little sense of responsibility, and free of guilt. I don't care. I nightly drink eight weeks' worth of my alcohol allotment. I don't care. TANG Food and beverage of my childhood are strange and wonderful things. Twinkies are lighter than air and have creme filling. Wonder Bread is light as well. I like it less for the taste and more for the way it makes little balls of dough when you squish it. These balls are handy for throwing at my little brother. Poor Mark is always getting pelted with things. Steve likes to throw plu",
  "genres": [
    "Fiction"
  ],
  "author": "Craig Curtis",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/1859814.Fabulous_Hell"
}