{
  "title": "Griffith Review 42: Once Upon a Time in Oz",
  "description": "Once upon a time — and the story begins. Fairy tales endure because their messages still speak as strongly and clearly to people today as they ever did — hidden within the metaphoric codes of princes, witches, curses and towers, insurmountable tasks, elaborate tests and exaggerated trials. We all have the same dragons in our psyche, as Ursula K Le Guin once said. Fairy tales tell us it is possible to face these dragons, these ogres of our darkest imaginings, and triumph over them. Australia is a story as well as a place. The Aboriginal place was telling itself for at least those sixty-thousand years, while outside Australia existed only in the imaginations of people in the northern hemisphere, a Great South Land below the equator. The shocking, defining moment in 1788 when the First Fleet landed fractured the backbone of the story, and set off a whole galaxy of further plots and subplots that continue to play out.Wherever people go they carry their personal and cultural stories with them. We have inherited the stories of Europe, the tales of the brothers Grimm and the Bible that came in the memories and books of settlers over the past two hundred years, and we are increasingly integrating the stories of other cultures and civilisations in this region. In Once Upon a Time in Oz, Griffith REVIEW holds up an enchanted mirror to explore the role of fairy and folk tales across cultures in this country, and creates new ones. For many, coming to Australia meant leaving centuries of fairy tales, myths and legends behind and falling painfully onto the hard and naked ground. How did immigrants re-weave a cushion of stories encompassing the new narratives of place? What are the tales that preoccupy, entertain and guide the culture today in the land of Oz? How did they make their way here? What has happened to them over time? Once Upon a Time in Oz presents new stories by renowned writers including Cate Kennedy, Arnold Zable, Ali Alizadeh, Tony Birch, Marion Halligan, Margo Lanagan and Bruce Pascoe. Other writers including Kate Forsyth, Michelle Law, Jane Sullivan, Lucy Sussex and John Bryson examine through essay and memoir some of the mysteries of storytelling. And David Rowe takes us Down the Abbott Hole in a cartoon essay. Once Upon a Time in Oz features Carmel Bird as contributing editor.",
  "genres": [
    "Essays",
    "Journal"
  ],
  "author": "Julianne Schultz",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/18605095-griffith-review-42"
}