{
  "title": "Boundaries: A Love Story",
  "description": "A novel about abandonment and passion, chronicling an imprudent but profound love, a maelstrom of family secrets, and a tragedy . . . This East Coast-West Coast tale tracks the conflicts between individual desire and societal expectations, weaving together the secrets, tragedies, and clandestine affairs of two families, one living in Maine, the other in California.In the summer of 1980, sixteen-year-old Kaia Matheson travels from her home in Berkeley to a small island off of Cape Cod for a family vacation. Kaia hopes to confront her divorced mother, Jean, about abandoning her in California, ostensibly to pursue a high-powered career in New York. However, Jean remains aloof and offers no apology for leaving Kaia in the custody of her controlling, alcoholic father. Intrigued by her rugged and intelligent cousin, Mark Karadonis, Kaia turns to him for companionship. Despite his misgivings, Mark is irresistibly attracted to his young cousin.When Mark arrives in Berkeley to start law school, the two cousins' involvement deepens. Kaia's father enters a relationship with Chandi Gupta, a lawyer who handles cases of child neglect and abandonment. Through Chandi, Kaia becomes interested in children's rights and a legal career. Eventually a devastating secret is revealed that threatens to unravel the lives of Kaia and Mark.\"Boundaries: A Love Story will have you torn between lingering over the beautifully crafted prose and rushing ahead to discover how several absorbing questions are resolved. The story of Kaia and Mark and the difficult decisions they face will lead you to think about the novel long after you've read the last page.\" --Susan Samuels Drake, Author, Fields of Courage and Wandering Amazed\"Intriguing and touching, a beautiful story.\" --Bharti Kirchner, Author, Darjeeling and Tulip Season: A Mitra Basu MysteryChristine Z. Mason has published award-winning short fiction as well as numerous articles and book reviews. She is the author of a children's book, The Mystery of Nan Madol.Christine graduated from UCLA with a degree in English Literature and served in the Peace Corps in Micronesia as an art and photography instructor. She subsequently earned her J.D. at the University of California, Davis, and practiced appellate and constitutional law. She lives with her husband in the Santa Cruz Mountains in Northern California; they have a son and a daughter.",
  "genres": [
    "Chick Lit",
    "Fiction",
    "Romance"
  ],
  "author": "Christine Z. Mason",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/18604376-boundaries"
}