{
  "title": "Nameless, Blameless Reproduction",
  "description": "When I get the call, I just know. Can I just answer barely awake and go back to sleep or do I need to be up in a flash? Some of it is the intuition that comes with getting calls in the dead of the night over many years. It's the languid pace of a person's voice with a bothersome question, the timid entry phrase, \"I'm sorry to bother you with this...\" Or it's the fear and panic in the voice of the person on the other end of the line, the short demands with panting in between. The phone rings at three a.m. The caller says, \"We need you in OR four, NOW!\" I don't bother to ask. I just slam down the phone and I'm awake. In an instant, I'm in OR four. I'm called to assist with a cesarean delivery. In forty seconds, the baby is delivered. The other obstetrician and I close without saying much. We close and inspect every layer in detail. There's a steady flow to closing the patient's abdomen. I'm a little tired, but each step prompts another and before long we are at the skin. Afterwards, the doctor thanks me for helping because it can be hard to find help on a case, \"You know given the mother's condition.\" I just nod. This doctor is known to take the moms with HIV. Shortly after surgery, when the mom dies leaving no verifiable next of kin for her newborn daughter, the baby becomes an orphan. Sensing an opportunity to do something in a situation far greater than herself, the ob-gyn, engaged in her own battle with infertility and undiagnosed depression, endeavors to adopt the little girl. A gay man who lost his partner to HIV, the ob-gyn's brother connects her with an attorney specializing in adoption for non-traditional families. Desperate and driven, the ob-gyn fosters the infant and names her Hope. The brother moves in to help welcome the new baby home. Hope soon becomes ill, giving the new mom and uncle what seems to be an insurmountable obstacle. With not much to go on bunt the slimmest of chances, the siblings move ever forward, determined to see that the newest edition to their family lives. In so doing, they open up a healing process that just may save their own lives as well. Intentionally refraining from naming her main characters, JACH MD's debut explores this highly charged, emotional terrain without labels. In doing so, she precludes the blame and judgment so often associated both socially and personally with issues like this and instead puts her laser focus on this transformative human journey-and does so to stunning effect. Transcending stereotypes and ascending to a higher plane of understanding and acceptance, Nameless, Blameless Reproduction is a miraculous tale of healing that is as spellbinding as it is inspiring.",
  "genres": [],
  "author": "J.A.C.H.",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/18607812-nameless-blameless-reproduction"
}