{
  "title": "The Transformation of the World: A Global History of the Nineteenth Century",
  "description": "A monumental history of the nineteenth century, The Transformation of the World offers a panoramic and multifaceted portrait of a world in transition. Jurgen Osterhammel, an eminent scholar who has been called the Braudel of the nineteenth century, moves beyond conventional Eurocentric and chronological accounts of the era, presenting instead a truly global history of breathtaking scope and towering erudition. He examines the powerful and complex forces that drove global change during the \"long nineteenth century,\" taking readers from New York to New Delhi, from the Latin American revolutions to the Taiping Rebellion, from the perils and promise of Europe's transatlantic labor markets to the hardships endured by nomadic, tribal peoples across the planet. Osterhammel describes a world increasingly networked by the telegraph, the steamship, and the railways. He explores the changing relationship between human beings and nature, looks at the importance of cities, explains the role slavery and its abolition played in the emergence of new nations, challenges the widely held belief that the nineteenth century witnessed the triumph of the nation-state, and much more.This is the highly anticipated English edition of the spectacularly successful and critically acclaimed German book, which is also being translated into Chinese, Polish, Russian, and French. Indispensable for any historian, \"The Transformation of the World\" sheds important new light on this momentous epoch, showing how the nineteenth century paved the way for the global catastrophes of the twentieth century, yet how it also gave rise to pacifism, liberalism, the trade union, and a host of other crucial developments.\"",
  "genres": [
    "History",
    "Nonfiction",
    "World History",
    "19th Century",
    "Economics",
    "European History",
    "Politics"
  ],
  "author": "Jürgen Osterhammel",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/18607841-the-transformation-of-the-world"
}