{
  "title": "Stalking Aidan",
  "description": "In a past life Irish-born Aidan was the minder to notorious gang boss Frankie Lamond. Aidan was thrown into prison when he shot Lamond’s intended assassin in a disastrous shooting that not only left Lamond with a fatal spinal injury but also his girlfriend, and Aidan’s mistress, gunned down. Now fresh out of prison after serving eight years for his involvement in the shooting, Aidan plans to get his life back on track; his priorities lay with making amends with his family and attempting to be reunited with his nine-year-old son. Unbeknown to Aidan, sinister forces have something altogether different in mind.As he begins to settle back into life outside of prison, Aidan becomes certain he’s being followed and he convinces himself that his fate lies in the hands of someone who knows all about his past life. Events begin to spiral out of control; his flat is robbed and then a bomb goes off in his car seriously harming Terry, the son of Verdi, a tenacious woman Aidan has begun a sordid affair with. His thoughts are confirmed - someone out there is after one thing; revenge. He is forced to return to gangland, the one part of his life he thought he had turned his back on. Aidan is offered the security of a safe house and a minder, but when his minder disappears his life is thrust back into the gangster underworld and his family are, against his wishes, dragged in amongst the drama. Events take a turn for the worse and a murder enquiry ensues. If Aidan learnt one thing from his time in gangland, it’s to handle things himself, but for a man living in fear of returning to prison, it’s a dangerous road to take. But one that is necessary.Set in modern day London, Stalking Aidan is the fast-paced gangster novel from J.M. Shorney. The book explores traditional themes of the gangster genre; violence, sex, revenge, family loyalties and psychological warfare. The story is told from the point of view of the bad guys as opposed to the good guys, and the story follows the life of Aidan, a man haunted by his past and living with guilt. The idea that mind-games can be just as damaging as physical violence is a powerful theme.",
  "genres": [],
  "author": "J.M Shorney",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/18605021-stalking-aidan"
}