{
  "title": "Age of the Soul: A New Way of Living from Your Soul",
  "description": "Age of the Soul: A New Way of Living from Your Soul is your transformative guide to a new way of living from the unlimited power of your soul. It shows us how spirituality and our perspective of life are evolving and what this world is becoming. God speaks directly to you, the reader, showing us how suffering is a choice we make and how we can change this world to peace, love and harmony in one generation. Age of the Soul helps you enhance healing, intuition, relationships, visions and spiritual communication. Topics addressed include soul-based living, chakras, channeling, children, prophecy and The Exchange: an evolved practice of soul-to-soul communion. Learn The Five Accomplishments to heal limiting beliefs and emotional blocks, become one with your soul and God, and experience enlightenment.You will strengthen, enliven and align all facets of your life with your soul. Whether you are becoming acquainted with spirituality or have been on 'the path', you will leap forward.Jason Nelson is a defining voice of soul-based living. For over a decade he has helped thousands of people through his international programs connect more deeply with their soul to heal, channel, intuit and manifest their life purpose. His books, including Age of the Soul and Empower Our Children, bring you a direct experience with God, whereby, the simple act of reading them helps you to begin noticing the spiritual forces in your life even more.\"My soul was activated on my twenty-fifth birthday. God's presence filled me and words that weren't mine poured onto a journal, revealing universal lessons, prophecies and my purpose. God asked me to help humanity discover the true power of their souls. I said yes... and years later, I was asked to write this book using the same process of divine communication. This book helps me daily to deepen my own connection with God and my soul. Your life will be forever changed!\" Jason Nelson",
  "genres": [],
  "author": "Jason  Nelson",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18601507-age-of-the-soul"
}