{
  "title": "Ich und die anderen",
  "description": "\"Ich und die anderen ist herkömmliche Romanliteratur vom Feinsten und doch genauso phantastisch wie die vorangegangenen Bücher, nur dass der Autor uns diesmal in die reiche, fremde und manchmal Furcht erregende Landschaft der Seele entführt\", schreibt Barbara Quick im San Francisco Chronicle. Die \"vorangegangenen Bücher\" -- das sind Matt Ruffs wundervolle Erfolgsromane Fool on the Hill und G.A.S., und das schöne an diesem Zitat ist die Feststellung, dass Ruffs neustes Werk zwar nicht phantastisch, aber trotzdem großartig ist - für gewöhnlich argumentiert das Feuilleton andersherum.  Andy Gage hat ein sehr grundlegendes Problem: Er hört Stimmen! Natürlich führen wir alle gelegentlich mehr oder minder ausführliche Dialoge in unseren Gedanken -- wenn uns Gewissensbisse plagen oder ein wichtiges Gespräch bevorsteht. Aber Andy teilt seine Gedankenwelt gleich mit Dutzenden von Seelen, die ihn in den unpassendsten Momenten auch mal in die zweite Reihe verdrängen und die Kontrolle über seinen Körper übernehmen. Mit psychiatrischer Hilfe ist es Andy in den letzten beiden Jahren gelungen, ein gewisses seelisches Gleichgewicht zu finden und ein ansatzweise normales Leben zu führen. Zusammen mit Doktor Grey hat er einen Zeitplan entwickelt, der es allen seinen unterschiedlichen Persönlichkeiten ermöglicht, in der \"Realität\" zu leben und sich dort zu verwirklichen.  Andys Leben verändert sich radikal, als er Julie Sivik kennen lernt. Julie betreibt eine Softwarefirma namens \"Reality Factory\". Ihr wird schnell klar, dass ein Mensch mit Multiplen Persönlichkeitsstörungen der ideale Berater bei ihren Projekten sein könnte, und sie bietet dem sonderbaren jungen Mann einen Job an. Andy fühlt sich in der \"Reality Factory\" auch sichtlich wohl -- bis Julie eines Tages Penny Driver einstellt, eine Frau, die in ihrem Kopf ebenfalls nicht alleine ist. Gemeinsam versuchen Julie und Andy, ihr einen Weg zu weisen, wie sie damit umgehen kann. Allerdings hat Andy nicht damit gerechnet, dass dabei auch sein peinlich genau strukturiertes Leben durcheinander geraten könnte ...  Seit dem eindrücklichen Roman Hannah und die Anderen von Adriana Stern gab es kein Buch mehr, dass sich so überzeugend mit Multiplen Persönlichkeitsstörungen auseinander setzt. Matt Ruff hat sich eines sensiblen Themas angenommen und daraus -- durchaus respektvoll und mit trockenem Humor -- große Literatur gemacht. Mit diesem Roman hat er endgültig bewiesen, dass er in keine Genre-Schublade gehört. Hoffen wir, dass wir auf sein nächstes Buch nicht wieder sechs Jahre warten müssen. --Hannes Riffel",
  "genres": [
    "Fantasy",
    "Fiction",
    "Mystery",
    "Psychology",
    "Book Club",
    "Mental Health",
    "Novels"
  ],
  "author": "Matt Ruff",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/1861491.Ich_und_die_anderen"
}