{
  "title": "The Billionaire's Game ~ Kade",
  "description": "With his professional football career over due to a tragic accident, billionaire Kade Harrison takes on the task of solving a mystery for his brother-in-law and friend, Max Hamilton. Without his former career to fill every minute of the day, Kade's looking for something to challenge him--now that he's lost the career that had meant everything to him. But what starts out as a simple favor soon becomes a whole lot more than he bargained for when the woman he's seeking slips away from him every time he gets close to finding her. When Kade does finally corner her, things start to get even more complicated. Asha Paritala is nothing like he expected, and the female he had tracked down as a favor for Max soon becomes a woman he wants for his very own, a woman who makes protective and highly predatory instincts he didn't know he had flare to life inside him. Kade soon discovers that he wants Asha's total surrender to the desire and passion that vibrates intensely between the two of them, but he also wants her trust, the one thing Asha's history makes it difficult for her to give. Can Kade convince her that some things are worth risking it all? Caught between two worlds, Asha Paritala is homeless, broke and damaged from a life of abuse and neglect. Born of an American mother and an Indian immigrant father, Asha was raised as an Indian woman by a foster family after the death of her natural parents when she was little more than a baby. She's spent her entire life under the control of others until finally breaking free two years earlier, and she's determined to keep her freedom, even if it means she has to struggle to survive. But when she meets Kade Harrison, her resolve is tested. After Kade helps her through a bad situation, she finds herself beginning to trust Kade as she's never trusted a man before. Kade is everything she always thought a man should be, but can she lose herself in him completely when she knows she's damaged and confused. And is it really possible that she could be a lost sibling to two people like Max Hamilton and Maddie Hudson? Asha is tempted by the possibility of family, and the irresistible lure of a man like Kade Harrison. Can a woman caught between two cultures, so flawed and so backward, really reach out and take what she wants, or will the instinct to run from the pain of her past destroy the hope of happiness for her future? This is a complete novel with no cliffhangers. 18+ due to sexual situations and graphic language.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Erotica",
    "Audiobook",
    "Adult",
    "Abuse"
  ],
  "author": "J.S. Scott",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/18614153-the-billionaire-s-game-kade"
}