{
  "title": "A Divine Life",
  "description": "***Contains explicit sexual content (including multiple partners and gender pairings) and mature situations which could be trigger-inducing for some readers.***Over the past year of being Jayden Masterson’s collared submissive, Catherine O’Chancey has worked through the mental terrors left behind by her old Dom — or at least she thinks she has. To celebrate their collaring anniversary, Jayden organizes a special day, during which her final fantasies will be realized and her limits tested. Will it prove to be more than she can handle? Can she endure the erotic onslaught her mind and body will experience and survive unscathed?While Catherine faces these dark shadows and pleasurable highs, Jayden will find his own inner strength being tested, too. He has come to realize that, somewhere along the way, Catherine has taken possession of his heart, mind, and body. Now, he faces his biggest challenge ever; he must let go of all his submissives but one: his jewel, Catherine. Can he leave his philandering ways behind? Has he made the ultimate mistake by putting his jewel into the hands of others? Will his gift to Catherine wind up costing him the one thing that has ever meant something real to him?Jayden has helped Catherine heal from past wrongs and chase away the nightmares. In return, Catherine has shown him what it means to care for someone beyond mere sexual gratification. Their strengthening bond as Master and submissive has paved the way for deeper emotions — if they can find the courage to open up to each other.Join Catherine and Jayden for an emotion packed weekend that could forever change the future of their relationship. This could be their best chance at love, but first both Dom and sub must gain control over the one thing they can’t put in a collar: their deepest doubts and fears. For this kind of healing, the necessary treatment must be mutually given. Is it too late to erase some old scars?",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "Contemporary",
    "Dark",
    "Menage"
  ],
  "author": "R.E. Hargrave",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/18618600-a-divine-life"
}