{
  "title": "Frankie's Angel: A Child's Tale of Loss and Recovery",
  "description": "Seven-year-old Frankie awakens the morning after her mother's surgery to learn a horrible truth from her father: \"Mommy didn't make it.\" Frankie's life turns upside down as the house fills with visitors, a funeral is held, and Mommy lies in a satin coffin wearing a dress she'd never be caught-well, dead, wearing. It's powder blue! All wrong, wrong, wrong! Sadness envelops Frankie. She listens to children playing in the neighborhood, instead of joining them. She stays in her room, coloring, or reading, or otherwise drowning herself in grief. Withdrawn and heavy-hearted, Frankie spends more and more time alone, both at home and at her new school. Luckily, a novice guardian is soaking in a hot tub when her number is called. \"Hey you're up,\" She is told she's been assigned to Frankie, and almost immediately the angel is on the case. She lingered in Rome a while before reporting to duty, but, she'll tell you her excuse about that later. As she flies down she asks herself: how does a virtuous schoolgirl cope with crushing loneliness after losing her flamboyant mother? She already knows all, our seven-year-old, Franciska, I mean - Frankie does it by journaling-and by inventing me a mischievous imaginary friend, and guardian angel, Not to brag, but, my direct honesty and quirky humor liberates the bewildered child as she forges through her identity crises, but am I imaginary, or real? Either truth - adventure, compassion, irreverence and setting goals for the future while rejoining childhood, bring life back to the red-headed girl with no mother. Remember, I'm an Angel not a saint, so when Frankie's housekeeper, Veronica, calls Frankie a devil - watch out - her candy apples don't cure, and her dumplings don't rise. And you want to talk about facial hair? Veronica could now braid the hair that comes out of her warts. Pay attention. Like I said: I'm an angel, not a saint.",
  "genres": [],
  "author": "Lisa Dekis",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18616505-frankie-s-angel"
}