{
  "title": "Darlings of Darkness",
  "description": "10 thrilling full length vampire novels in one volume10 sexy heroes.10 strong heroines.All for FREE!10 bestselling novels by 10 bestselling authors. This is ten complete novels from some of today's most exciting authors.A star-studded anthology of thrilling, action-packed and totally swoon-worthy first books from ten different vampire series by your favorite women authors.Book 1 – Blurb: A werewolf with an unusual power is forced to face the monsters of her past and the uncertainty of the future after a dangerous vampire awakens the darkness within her.ONCE BITTEN by bestselling author Trina M. Lee of the bestselling Alexa O'Brien Huntress series.Book 2 – Blurb: His precious touch could prove deadly…CRUSH by bestselling author Chrissy Peebles of more than ten novels including the popular series The Apocalypse Infection Unleashed Series and The Ruby Ring Saga.Book 3 – Blurb: After the inexplicable disappearance of Lilly Taylor's parents, she has no choice but to move to Canada where she unravels some frightening yet intriguing family secrets...RAVEN by bestselling author Suzy Turner. Suzy Turner of The Raven Saga trilogy and The Morgan Sisters series as well as a chick lit novel entitled Forever Fredless.Book 4 – Blurb: An unhappy vampire gets a second chance to be mortal in this dark, yet often humorous tale of creatures at war.VAMPIRES RULE by bestselling author K. C. Blake. She’s the author of two other exciting series which include Bait, Crushed, and Witch Hunt.Book 5 – Blurb: It lurks in the dead of night…BLUR by bestselling author Kristen MiddletonBook 6 – Blurb: Rayea is a daughter of Satan, and a vampire. But the good thing is…she’s on our side.THE VAMPIRE FROM HELL by bestselling author Ally Thomas. Her books have been on the Top 100 bestsellers list in Fantasy at Amazon since 2011.Book 7 – Blurb: Sixteen-year-old vampire Tessa's throwback human genes make her an outcast in her world, but fate and near death teaches her that who you are on the inside is more important that what you on the outside.VAMPIRE IN DENIAL by bestselling author Dale MayerBook 8 – Blurb: A reclusive hybrid vampire is forced to reacquaint herself with the human world in order to rid herself of an accidental slave problem.THIRST by bestselling author Claire Farrell, author of over a dozen speculative fiction novels.Book 9 – Blurb: Sarah reads her grandfather's journal in stunned disbelief. What was once her grandfather's responsibility has passed to her father and now to her. She has become the Warden. Her life will never be the same.THE VAMPIRE’S WARDEN by S.J. WrightBook 10 – Blurb: What if courage was your only option?COURAGE RUNS RED by bestselling author W.J. May",
  "genres": [
    "Paranormal",
    "Anthologies",
    "Horror",
    "Vampires",
    "Fantasy",
    "Romance",
    "Supernatural"
  ],
  "author": "Trina M. Lee",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/18621331-darlings-of-darkness"
}