{
  "title": "The Infamous Ellen James",
  "description": "Meet twenty-eight year old Ellen James. A sarcastic, feisty, foul-mouthed ER Nurse. She is snarky, sassy, and sometimes crudely inappropriate. After a terrible breakup with her fiancé, Ellen has promised herself that she will never make the mistake of falling for another man again… and physicians, well she’s more than written them off.Once she meets sexy Trauma Surgeon, Dr. Trent Hamilton, this promise is unbelievably hard to keep. This too-hot-for-Ellen's-own-good man is undeniably sexy and down-right irresistible. He leaves her breathless, speechless, and irritatingly turned on. He makes her fantasize about him in all kinds of dirty, inappropriate ways.With the help of her obnoxious, and often times hilarious best friend Amy, Ellen will find herself in several crazy, embarrassing situations. This is a story of friendship, love and how one very sarcastic woman can find the strength to pick up the pieces after having her heart broken. In her first novel, N.A. Alcorn provides interesting takes on the word vagina, while giving you a reason to re-think your next visit to the Emergency Room. This book is bound to make you laugh, smile, and provide you with enough sarcasm to choke your grandmother. No, N.A. doesn’t want anything bad to happen to your Grandma Ruth, but she does want you to strongly consider re-naming your vibrator after a guy who’s at the top of your spank bank rotation. Be prepared for dripping juice-boxes, awkward pelvic thrusting, and a little suspense to keep your snatch on edge. Warning: This novel contains explicit sex, profanity and far too much vaginal humor. This novel is not meant for anti-fornicators, up-tight prudes, or virgins who refuse to go to Pound Town.",
  "genres": [
    "Romance",
    "Humor",
    "Contemporary",
    "Contemporary Romance",
    "Adult",
    "Chick Lit",
    "New Adult"
  ],
  "author": "N.A. Alcorn",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/18620442-the-infamous-ellen-james"
}