{
  "title": "Best Man",
  "description": "In a poetically stripped down prose, author Colby Cuppernull presents three linked short stories about the thin line dividing hope from fear and the ways in which the people and landscapes surrounding us shape us for better or for worse. Best Man tells the story of Ethan Hager, who must decide whether his decision to stay in his small hometown in upstate New York to protect his troubled mother and younger brother is a noble sacrifice or simply a convenient excuse for not facing his own fears about what lies beyond the mountains. In the three stories comprising Best Man, we see Ethan as a child, a teenager, and an adult. In each story, a decision must be made that will forever alter Ethan’s life. Cuppernull elegantly explores Ethan’s descent into hardened bitterness and its impact on the people who love him most while compassionately presenting Ethan’s personal struggle and frustration.\"Colby Cuppernull’s...going somewhere, and I’m betting he goes fast. Don’t believe me? Read for yourself.\"– Steve DavenportAuthor of Overpass (2012), Murder on Gasoline Lake (2008), and Uncontainable Noise (2006)http://gasolinelake.com/“In Best Man, Colby Cuppernull speaks through a realism that delivers a sense of both loss and grace. These three loosely related stories are an aesthetic high wire act and often just as astonishing in their balance and depth. Although Ethan in “Happy Birthday” ends in a place of confusion, anger, and sadness, there’s a certain subtle humor woven into scenes as well—a quiet appreciation for the absurdity that always seems to accompany trouble. “I Don’t Speak French” also invokes absurdity while luxuriating in immersive concrete details. The title story, “Best Man,” does all of this with a Carverian fatalism. Sure, Ethan can make different decisions, but we know he won’t. And we get the impression that, deep down, he knows it, too. Reading Best Man might make you want to revisit Frederick Exley, Richard Ford, Denis Johnson, Carver. Mostly, it’ll make you want more from this amazing writer.”– Michael DavisAuthor of Gravity (2009)“The voice in this young writer's three interconnected tales utters forth in stark longing and the warmth of desperate grasps. Cuppernull's stories are evidence of an earnestly talented young writer, one whose prose teeters about the border of desperation and angst before traipsing through that which is both familiar in its forlorn elegy and distinctly personal in its sincerity.” – Bayo OjikutuAuthor of Free Burning and 47th Street Black Best Man comes with an introduction from Steve Davenport, a full-length interview with Colby Cuppernull, and a teachers’ guide.",
  "genres": [],
  "author": "Colby Cuppernull",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18621225-best-man"
}