{
  "title": "Swept Away for Christmas",
  "description": "Christmas isn’t always snow-covered with a frosty chill in the air. Sometimes it’s sandy beaches with balmy breezes. And sometimes we find love in the most unexpected places, a place like Starfish Shores. Here Comes McBride by Tanya Michaels Shelby James has only truly loved one man — but Finn McBride broke her heart when emotional baggage from his past came between them. Now, Shelby is serving as maid of honor at a beach wedding where Finn is the best man. Will reuniting with Finn be a Christmas miracle, or the worst mistake she's ever made? Two Hearts a Leaping by MJ Fredrick After a break-up with her high school sweetheart, Harley Blume retreats to her brother's home in Starfish Shores to lick her wounds and figure out what she's doing next. But her brother is in the Coast Guard reserves and heading out of town, leaving her in the care of Liam Channing, his best friend since they played college football together. She's never been able to keep her tongue in her mouth when good-looking, easy-going Liam is around. How is she going to find her way if she can't keep her balance? Crusin’ for a Kiss by Trish Milburn When Avery Phillips loses her magazine job right before Christmas, she heads back home to Starfish Shores to spend the holidays with the grandparents who raised her. The plan is to hit the job search hard so that she has a new position when the New Year arrives. What isn’t part of the plan is heading up a remodeling effort at her family’s beach motel or falling for the man helping to save the business into which her grandparents put a lifetime of work. As Christmas draws closer, will Avery stick to the original plan to leave town again or take a chance with Luke Taylor and a new life she never expected?",
  "genres": [
    "Christmas",
    "Romance",
    "Anthologies",
    "Contemporary"
  ],
  "author": "M.J. Fredrick",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/18620943-swept-away-for-christmas"
}