{
  "title": "Duke Betrayed",
  "description": "The Thresl  Thresls are rare shapeshifting creatures that can only be born on one planet in the universe. In order to transform from beast to man they have to bond with a human mate. Once transformed they are forever bound to the one they've chosen, however, sometimes what should be an automatic process turns into a traumatic event.While mates and enemies battle for the good of the Thresls, the cat creatures themselves will ultimately have to decide if they want a planet of pure bred shifters or if they can make room for their half-bred children and stubborn human mates. Duke Betrayed by Amber Kell Book five in the The Thresl Chronicles seriesIf you loved Zuri's Zargonnii Warrior by C.L. Scholey and Possessing Providence by Angela Castle, then you will not be able to put down this absolute treat!When Duke Hellbur is accused of treason against his people, he bonds with medic Balaze to keep his human form and prove his innocence.When Duke Hellbur is accused of smuggling Thresls and selling them off to interested buyers, he undertakes a trip to prove his innocence. In order to retain his humanity, Hellbur bonds with a medic named Balaze…who didn’t exactly give his assent to the binding of their souls.Balaze admired the duke whenever he visited the castle, but finding someone attractive and wanting to be theirs for eternity aren’t the same thing. After surviving the death of his first Thresl mate, Balaze isn’t exactly eager to go through that pain again. However, the duke doesn’t take no for answer.Those who are guilty will have to be uncovered if the two men ever plan on finding peace with each other. When Hellbur and Balaze go off on an interplanetary adventure, can they find common ground or will their enemies tear them apart?Amber Kell About the   Amber is one of those quiet people they always tell you to watch out for. She lives in Seattle with her husband, two sons, two cats and one extremely stupid dog.",
  "genres": [
    "Science Fiction",
    "M M Romance",
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Fantasy",
    "Aliens"
  ],
  "author": "Amber Kell",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/18620760-duke-betrayed"
}