{
  "title": "The Price of Politics",
  "description": "<I>The Price of Politics </I>chronicles the inside story of how President Obama and the U.S. Congress tried, and failed, to restore the American economy and set it on a course to fiscal stability. It spans the three and a half tumultuous years beginning just before Obama’s inauguration in early 2009 and lasting through the summer of 2012. <BR><BR>Woodward pierces the secretive world of Washington policymaking once again, with a close-up story crafted from meeting notes, documents, working papers and interviews with key players, including President Obama and House Speaker John Boehner. <BR><BR>At the center of <I>The Price of Politics </I>is a high-stakes personal and political struggle between the president and the speaker. <I>The Price of Politics </I>takes the reader through the electric 44 days during the summer of 2011 with day-by-day, often hour-by-hour, accounts as the two attempt a “grand bargain” to cut entitlement spending and increase tax revenue. <BR><BR>As they struggled through the most intense moments of the crisis, each contended with powerful conflicts in his own party. At the prospect of serious budget cuts, Obama told Woodward, “Our friends on the left would howl and act as if we had dismantled the New Deal.” In the House, Boehner was looking over his shoulder, worrying that his second-in-command, Majority Leader Eric Cantor, was undermining him in concert with extreme conservative House members and others with ties to the anti-tax Tea Party. At the same time, Boehner described the president as “moaning and groaning and whining and demanding. Threatening. He was pretty desperate.” <BR><BR><I>The Price of Politics </I>shows why the grand bargain was never reached, and how the president, the speaker and the Congress settled for stopgap measures that delayed any serious deficit reduction until 2013. <BR><BR>With extensive documentation and firsthand accounts, Woodward reveals how the broken relationship between the White House and Capitol Hill drove the U.S. economy to the edge of the fiscal cliff, where it remains.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Economics",
    "American History",
    "Political Science",
    "Audiobook"
  ],
  "author": "Bob Woodward",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/18623099-the-price-of-politics"
}