{
  "title": "Resolution",
  "description": "Resolution picks up exactly where Saviour left us all hanging! Having left an abusive marriage at 45, Lauren can hardly believe that she has found Gabe, a 35 year old blonde buff sex god, their instant chemistry has convinced him that that he wants to change his serial shagging ways and to make what they have found permanent, he knows that he loves Lauren but relationships are a whole new concept to him and he doesn't always get it right. Lauren, still reeling from the abuse she has suffered at the hands of her ex husband is not convinced that jumping straight into another marriage is the right thing for her, despite how much she loves Gabe, the sex is amazing, they have no problems there, with Gabe she is growing in confidence and trying things in the bedroom (and every where else) that she never even considered during her marriage but they have known each other for just 10 short weeks and already they have been through enough drama to last a lifetime. Lauren has once again been beaten and humiliated by her soon to be ex-Husband, Gabe has revealed he was sexually abused by his Step-Mother as a teenager, and Gabe’s ex is threatening to stop him seeing his daughter. Will Lauren listen to taunts from jealous exes and her own self doubt; or will the love (and lust) Lauren has found in Gabe’s arms be enough for her to let go of her painful past to build a future with Gabe. Resolution is the conclusion of Gabe and Laurens story, it will take you on a roller coaster of emotions, with some steamy and erotic sex scenes, just to keep your pulse racing, like Saviour, some scenes are gut wrenching, it will have you laughing, crying and wanting to not only hug Gabe and Lauren but also wanting to shake some sense into them. Buckle up and enjoy the ride.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Drama",
    "Abuse",
    "Erotic Romance",
    "Adult Fiction"
  ],
  "author": "Lesley  Jones",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/18622672-resolution"
}