{
  "title": "Mães e Filhas com História",
  "description": "O amor entre uma mãe e uma filha pode ser vivido e sentido de diferentes formas. Pode ser um amor incondicional. Um amor abnegado. Um amor cúmplice, baseado na mais profunda amizade. Um amor temeroso ou respeitador. Castrador ou potenciador. Foi na procura destas diferentes formas de amor que Fátima Lopes enveredou pela História, para descobrir estas Mães e Filhas.Catarina de Bragança foi Rainha de Inglaterra, mas sempre viveu na sombra da sua poderosa e demasiado exigente mãe Luísa de Gusmão. Beatriz será um peão nas mãos da sua mãe Leonor Teles cuja principal lição que deixou à filha foi que se deve conquistar o poder, sem olhar a meios. D. Maria II assistiu ao sofrimento da sua adorada mãe, maltratada pelo marido e jurou a si própria não seguir o seu exemplo. Seria uma mulher independente e teria um casamento feliz e respeitoso. D. Mariana Raimunda e a Marquesa de Távora partilhavam uma fé profunda, mas nem esta as livrou, a elas e aos seus, do terrível destino que tiveram. Catarina de Áustria é Rainha de Portugal, mulher de poder, austera, que nunca esqueceu os terríveis anos de cativeiro vividos ao lado da sua mãe, Joana a Louca, no Mosteiro de Tordesilhas. Filipa de Lencastre, mãe da Ínclita Geração, fez questão de educar os filhos na fé e em valores fortes. Isabel sua filha irá honrar a sua memória ao se tornar na distinta Duquesa de Borgonha. Sissi, Imperatriz da Áustria e da Hungria viu os seus filhos serem afastados de si por uma sogra controladora. Apenas a última filha Maria Valéria viveu a seu lado e tornou-se na sua verdadeira obsessão. A história da czarina da Rússia Alexandra e da sua filha Anastasia é marcada pela tragédia. Já Maria Antonieta confessava em surdina o medo que sentia da sua mãe a imperatriz Maria Teresa. Para Catarina de Médicis os filhos eram armas para atingir os seus objectivos. Margarida a sua filha aprende bem a lição e ela própria não hesita em colocar o seu corpo ao serviço da política.Depois dos seus anteriores bestsellers, a autora e apresentadora de televisão Fátima Lopes regressa à escrita de forma surpreendente. Uma visita à História, que nos permite ficar a conhecer cada uma destas mulheres, no seu papel menos conhecido e explorado, o de mães e filhas. Um relato emotivo e intimista de uma autora que reconhece sem dúvidas que o seu maior papel nesta vida é ser mãe.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Fátima Lopes",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/18623225-m-es-e-filhas-com-hist-ria"
}