{
  "title": "The Blood and Light Series",
  "description": "This contains all SIX novels and two shorts of the Blood & Light Vampire Series.Blood & Light (book #1)Smoke & Mirrors (book #2)Oil & Water (book #3)Clarity & Reason (book #4Grace & Beauty (book #5)Hope & Faith (book #6)PLUS two bonus shortsBirth of a VampireWill and WonderRue lives in the quiet little town of Calvary, Minnesota with her brother Kai, and her parents, Grace and William. Calvary is a beautiful place, with no crime, no drama and nestled along the great lakes. It is surrounded in lush forests, quiet, safe, everything you could ever wish for…or is it?As Rue approaches her 17th birthday she is plagued with one problem, a very big one. Her Mother, Grace, has fallen ill. It is not a disease that can easily be fixed with medication, it is one of the mind. Grace has been admitted to Rolling River Asylum and once she is gone, Rue’s perfect world starts to crumble around her. Everything she has known is suddenly taken from her and with it her feeling of safety is dissolved.Desperate to pull Rue out of her depression, her brother talks her into going to a party at the Graph house, home to Johnathan Graph, a boy Rue has always felt a strong connection to, but never acted on it. Once she is at the party she reconnects with Johnathan and is shocked at how her feelings seem to be so strong for him, but with one touch Rue has a terrifying vision and it sets everything into motion.Soon after her revelation at the party, Grace and William suddenly disappear and with their absence two strangers, that of Joshua and Samantha Barrington, enter into Rue’s life. They come as protectors, not only to her, but to everyone she loves. Without them she would be lost, but with them she is reminded of how much she does not know. There is a war coming, a war that threatens everything she loves, everything she knows or ever will know. She is forced to face the truth about herself and about her family’s history, a truth that stems back to the beginning of time and that of the vampire.Rewrite history through the eyes of the immortal.",
  "genres": [
    "Paranormal"
  ],
  "author": "Rue Volley",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/18628483-the-blood-and-light-series"
}