{
  "title": "Sharing Sean: A Novel",
  "description": "Not all women read bridal magazines, shop for dates on the Internet, and covet the letters M, R, and S in front of their names. Some women aren't looking for love or even fidelity -- just for a man who'll play by her rules. In the smart, wry, and entertaining debut novel Sharing Sean , Frances Pye introduces four such women in their late thirties -- with no time, or desire, for an exclusively committed relationship -- and the unintended consequences that result when they hatch a bold plan to share one Mr. Right. Singles Lily, Terry, Jules, and Mara meet for Sunday brunch at least once a month and grumble about how hard it is to find a man who'll meet their individual needs. Lily longs for two or three nights a week of uncomplicated, but passionate, sex; Terry wants an affectionate and reliable stand-in father figure for her teenage son; Jules is looking for some no-strings-attached sperm to fulfill her dream ofbecoming a mother; and Mara, a widow, needs a little intrigue and fun to help her begin to let go of the bittersweet memories of her late husband. They're each equally frustrated until Sean wanders into Lily's life. The owner of a small construction company, Sean is stunningly good-looking and great in bed. Initially, he even agrees to Lily's terms for a relationship. But ultimately he is left longing for more than just sex, and when he presses her for a real commitment, Lily dumps him. But over one of their long Sunday brunches, it begins to dawn on the four friends that Sean could give each of them exactly what they need from a man. So, Lily muses, why don't they all share him? Audacious and unconventional, their plan is downright scandalous -- and all the more brilliant if they can pull it off without Sean's knowledge. Trouble is, even though these attractive, resourceful women think they can offer him everything he wants -- sex, admiration, friendship, children -- sometimes a man just doesn't want to be the object of so many desires, and so many women, each with her own hidden agenda. Captivating, insightful, and always unpredictable, Frances Pye's Sharing Sean is an irresistible tale of modern-day relationships that no reader will easily forget.",
  "genres": [
    "Chick Lit",
    "Romance"
  ],
  "author": "Frances Pye",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/1862698.Sharing_Sean"
}