{
  "title": "Razzle Dazzle",
  "description": "Gin &    The 1920’s are filled with gin, jazz, and the promise of easy money. When the young and innocent Jack heads to Hollywood with his best friend and lover – he believes that everything will be magical for them. They just need to stick together, no matter what.  The celluloid kingdom demands a hefty price from all who want a piece of the dream. Sacrifices must be made if you want to be a part of the glitz and glamour. Flappers, screen idols and the men behind the star-making machine all conspire to interfere with Jack’s happiness. Along the way, many of Hollywood’s players discover that unfortunately, sometimes dreams do come true.    Razzle Dazzle by Morticia Knight   Book two in the Gin & Jazz series  Jack is on the verge of silent film stardom, but Hollywood glory won’t heal his broken heart. But the seductive screen idol—Roman Pasquale—sweeps Jack away, and makes him his own. Will Roman’s obsessive love finally bring Jack true happiness?  Jack is devastated by the loss of Nick, his best friend and lover. His only other friend, new Hollywood star Trixie Fox, comes to his rescue. What he doesn’t know, is that she’s also helping Roman Pasquale in his carefully planned seduction of the shy and innocent Jack.  Suave film screen idol—Roman Pasquale—has been obsessed by Jack Stone from the moment he spotted him at a Global Studios party. He will stop at nothing until the golden-haired young man belongs to him. An expert at getting what he wants, Roman plans every wicked word, look and move to bring him closer to achieving his prize.  Jack is on the brink of stardom, and can’t believe that his movie star crush, Roman Pasquale, is taking an interest in him. But he resists the older, more sophisticated man’s attempts at seducing him. After all, he still loves Nick, and just isn’t ready to try again with anyone else. But when Roman turns on the charm, Jack is tempted. Can Roman replace Nick in Jack’s heart? Or is the magical world of the great Roman Pasquale all an illusion? Morticia Knight  About the   Erotic Romance author Morticia Knight enjoys a good saucy tale, with MM and MMF pairings. Since she loves several genres, you may find your heroes in a contemporary, historical, paranormal or sci-fi setting. One of her passions is bringing people's fantasies to life on the page, because life is too short for even one boring moment. Her stories are volcanic in heat, deep in emotion, and sprinkled with doses of humor.",
  "genres": [
    "M M Romance",
    "Historical Romance"
  ],
  "author": "Morticia Knight",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18625835-razzle-dazzle"
}