{
  "title": "The Wish Series Boxed Set",
  "description": "Get three stories in one boxed set from #1 NY Times Bestselling Author Barbara Freethy (Includes 1 Novella & 2 Novels)  Fans of Nora Roberts, Susan Mallery and Kristin Hannah will enjoy these emotionally compelling and romantic stories about wishes and the power of love.  A Secret Wish  One night in San Francisco, three women make a birthday. Liz is turning thirty. A successful nurse, she has a good career, but no man to share her life. All her friends are married, and she's alone, still trying to outrun a tragedy from her past. Then she meets a handsome stranger.  Angela, a member of a large, loving Italian family, is facing thirty-five with no baby in the nursery. Eight years of infertility treatments have put a strain on her marriage. Will she have to choose between her husband and having a child? When she is mugged by an unexpected assailant her life takes a new turn.  Carole, a corporate wife, is staring down forty candles. Having grown up poor, she worked hard to get ahead, but when her kids bail on her birthday, and she discovers her husband with another woman, she realizes that she may have nothing at all. She goes back to where it all began, the mother she left behind, and the man whose heart she once broke.  Three women, three birthdays and one unforgettable night that will change their lives forever.  Just A Wish Away  Bestselling Author Barbara Freethy, takes us back to the beach in an emotional love story between two best friends who have been separated for a very long time.  Alexa Parker and Braden Elliott fell in love when they were twelve years old. On a summer day, while searching for sea glass on the beaches of Washington State, they discovered an unusually shaped bottle. The ever-imaginative Alexa declared it a genie's bottle. Popping the cork, they were surprised by a rogue wave that sprayed them with a fine, cool mist. Closing their eyes, they each made a wish …  Before their love had a chance to grow, life, family and tragedy separated the two best friends. Now fifteen years later, Alexa returns to Sand Harbor after her aunt is injured in a mysterious break-in at her antique store. Braden is also back, but he's not the innocent boy Alexa remembers. His military service has left him with physical and emotional scars.  Can the sweet love of youth be recaptured by two now cynical souls? Can solving the mystery of the past bring them to a new future? Or will it take a wish, maybe two …  When Wishes Collide  In a moment of desperation two strangers make a wish, only to discover that sometimes a wish can take you down an unexpected path … straight toward a life-changing love.  Adrianna Cavello’s life changed in an instant when a break-in at her restaurant took the life of her boyfriend and left her too traumatized to return to work. Months later, with everything she’s ever wanted on the line, Adrianna makes a wish by tossing a coin into a fountain known for making miracles.  Wyatt Randall is also in need of a miracle. Two years earlier, his ex-wife kidnapped their daughter, and Wyatt is desperate to find his little girl. A new lead raises his hopes, but quickly fizzles out. When his coin clashes with another, he sees what little hope he has flying away.  Adrianna and Wyatt soon learn that they have more in common than two coins that collided. In fighting for the lives they lost, they must learn how to trust each other and how to love again. Only then will they discover that meeting each other might not be what they wished for, but exactly what they need.",
  "genres": [
    "Romance",
    "Contemporary Romance"
  ],
  "author": "Barbara Freethy",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/18627797-the-wish-series-boxed-set"
}