{
  "title": "The Absurd Demise of Poulnabrone",
  "description": "\"'Face facts, will you,' she kept telling me... 'What happens here means nothing and never will.'\"Cornelius Conlon has been forever growing old. Born at the turn of the 20th century, he has lived through a lifetime of madness, and now must witness his towns demise. He preaches, writes, loves and obsesses – of the darkness of the tunnels, of the dangers of the Folly, of the weather – but few pay heed. Deeply frustrated, his daughter, Lily, worries for him, but to many in Poulnabrone, he is simply, Con 'The Loon,' the man who stands on his soap box by the church, his face a cloud of beard and prognostication, his cane pointing as he delivers a sermon.Lily Conlon clings to her mourning. The cracks in the walls of her home run through her heart. Caring for her father brings both comfort and angst, but it is her daughter, Tara, that exercises her, so that she rails at her modern notions and pagan ways. Free spirited, Tara knows what she loves. She's a striking girl, and everyone is drawn to her, for it is as though she has \"appeared from the earth and remained speckled, splashed with the freckles of mud that produced her variegated complexion, her colours yet to blend with the work of the summer sun.\" The drawstrings of her heart bind her, bringing both joy and misery and nightmares that come \"too concrete, too sudden\". She listens to her grandfather, and sees that the town's troubles are intimately woven in the lives of its inhabitants.Known variously as \"The Leaning Town of Poulnabrone\" and \"Ireland's answer to Pisa\", Poulnabrone is falling asunder. Its walls are riven with cracks and mould, its streets punctured and torn. Like Cornelius, young Malachy understands, but his mind is as fractured as the streets of the town, and greater forces are at play. Vain, and with eyes both \"vacant and diffuse\", Malachy doesn't know how to feel. His parents tell him he's \"had the luxury to be born twice\", but he feels he's yet to be born. Overwhelmed by an arbitrary moment of violence, he turns inwards and ultimately on the town itself. The bonds of history are the walls of a river, fraying and broken, loose beneath the earth; an absurd demise beckons.At once both melancholic and magical, The Absurd Demise of Poulnabrone is the debut novel of author Liam Howley. Part comedy, part elegy, and often hallucinatory, it is both a humorous meditation and a dark rendering of a tragic story. Beautifully crafted and with stunning prose, it is essential reading for anyone seeking to understand the predicaments of our times.",
  "genres": [
    "Ireland",
    "Fiction"
  ],
  "author": "Liam Howley",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/18626307-the-absurd-demise-of-poulnabrone"
}