{
  "title": "The Master and Margarita",
  "description": "No ISBNOn a hot spring afternoon in Moscow, a poet and an editor are discussing the non-existence of Jesus. A polite, foreign gentleman interrupts their debate, claiming to have known Jesus in person and to have been present when he was condemned by Pontius Pilate. Moreover, he predicts the editor’s death – a bizarre accident which happens exactly as the foreigner foretells. The Devil has arrived in Moscow and, along with his demons and a large black cat, he carves a trail of chaos and destruction through Soviet society. He exposes the hypocrisy and greed of those around him, their willingness to inform on neighbours, their urgent scrabble for power and their fear for themselves. One man seems different: a writer known as ‘the master’ who, in despair, has burned his unpublished novel about Pontius Pilate and has been incarcerated in an asylum. His lover, the passionate, courageous Margarita, will do anything to save him – including serving the Devil himself.‘This book is absorbing, brilliant slapstick, and looks deep into the heart of fantasy and longing’THE SUNDAY TIMESWriting The Master and Margarita in secret between 1928 and 1940, through the period of Stalin’s purges, Bulgakov was already deemed anti-Soviet; his plays were banned, and he had few illusions that anyone would publish this highly satirical work. Like his main character, he destroyed a draft in despair. Yet, as the Devil tells the master, in a phrase which went on to become a watchword of hope: ‘Manuscripts don’t burn’. In 1966-7, more than 25 years after Bulgakov’s death, The Master and Margarita was published with relatively minor cuts. Smuggled past the censors, its subversive message, dark humour and lyrical force combined to make it an instant success and a beacon of optimism and freedom that spread through Russia and the world. Peter Suart’s dramatic illustrations provide a fitting accompaniment to what is one of our members’ most requested titles.‘One of the blazing masterpieces of the 20th century’THE TIMES",
  "genres": [
    "Fiction",
    "Russia",
    "Fantasy",
    "Russian Literature",
    "Magical Realism",
    "Literature",
    "Novels"
  ],
  "author": "Mikhail Bulgakov",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/11005047-the-master-and-margarita"
}