{
  "title": "Kellie's Diary Decay of Innocence",
  "description": "A series of diary entries through the eyes of a little girl as she tries to survive the end of the world. \"Surrealistic and haunting, this story gets under the skin like a virulent infection... Jenner's slightly twisted yet subtle narrative as seen through Kellie's innocent eyes is compelling...\" - George Wier, Mystery Author \"Be prepared... it is quite sad seeing all the death and destruction through a child's eyes, but I'm telling you it is worth it in the end.\" - Blood, Sweat & Books \"The simple style this story is presented in sometimes tricks you into taking it at face value; but it's the reading between the lines that gives you the full sense of horror in the world around the main character.\" - Amazon Reviewer \"zombie\" This book is entirely from the viewpoint of a little girl writing to her diary. You meet Kellie, a bright and inquisitive young girl living the typical suburban life with her family; she goes to school, complains about lunch, and thinks boys are gross. She also writes daily entries into her diary, whom she calls \"Barbie.\" However, her world is turned upside down when a strange illness takes over the city. During a massive outbreak, Kellie finds herself completely alone and stranded at school. She must find her way out and figure out how to get home, braving the dangers of the \"monsters\" that have taken over... all the while telling \"Barbie\" what is going on and what she's thinking. Follow Kellie's journey as she ventures out into the world, braving dangers of all kinds, both natural and unnatural, expected and surprising. She must learn to survive based on her own wits, and she will also learn which instincts she should trust. This is the novel version of the best-selling horror and zombie graphic novel series, with a lot of additional content not in the graphic novels. It includes \"Sarah's Despair,\" \"Dr. Crane,\" and more.",
  "genres": [
    "Horror",
    "Zombies"
  ],
  "author": "Thomas  Jenner",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/18629516-kellie-s-diary-decay-of-innocence"
}