{
  "title": "The Red Circle: My Life in the Navy SEAL Sniper Corps and How I Trained America's Deadliest Marksmen",
  "description": "The Red My Life in the Navy SEAL Sniper Corps and How I Trained America's Deadliest Marksmen\"If you want to know what makes up the DNA of a Navy SEAL and have a behind-the-scenes look at the best sniper program in the world, then 'hold 1 right for wind' and read The Red Circle .\"-Chris Kyle, SEAL Team Three Chief and bestselling author of American SniperBrandon Webb's experiences in the world's most elite sniper corps are the stuff of legend. From his grueling years of training in Naval Special Operations to his combat tours in the Persian Gulf and Afghanistan, The Red Circle provides a rare and riveting look at the inner workings of the U.S. military through the eyes of a covert operations specialist.\"Impressive and well-written... The Red Circle is a great book.\"-Howard E. Wasdin, Navy SEAL and bestselling author of SEAL Team SixYet it is Webb's distinguished second career as a lead instructor for the shadowy \"sniper cell\" and Course Manager of the Navy SEAL Sniper Program that trained some of America's finest and deadliest warriors-including Marcus Luttrell and Chris Kyle-that makes his story so compelling. From his days as a student going through the sniper course to his hair-raising close calls with Taliban and al Qaeda forces in the northern Afghanistan to his vivid account of designing new sniper standards and training some of the most accomplished snipers of the twenty-first century, Webb reveals how the Special Operations warriors at the forefront of today's military are forged.\"A recounting of the hellish mental and physical tests required to earn a SEAL's trident pin.\"- San Diego Union-TribuneThis edition of the book is the deluxe, tall rack mass market paperback.",
  "genres": [
    "Military Fiction",
    "Nonfiction",
    "Biography",
    "War",
    "History",
    "Military History",
    "Memoir"
  ],
  "author": "Brandon Webb",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/18630475-the-red-circle"
}