{
  "title": "Live",
  "description": "Mary Ann Rivers kicks off a new contemporary romance series—sure to please readers of Ruthie Knox, Kristan Higgins, and Jill Shalvis—where love can be found unexpectedly.   If there’s an upside to unemployment, Destiny Burnside may have found it. Job searching at her local library in Lakefield, Ohio, gives her plenty of time to ogle the hottest man she has ever laid eyes the sexy wood-carver who’s restoring the building. But as the rejection letters pile up, Destiny finds an unexpected shoulder to cry on. With his rich Welsh accent, Hefin Thomas stirs Destiny so completely that, even though he’s leaving soon, she lets herself believe the memory of his scorching kisses will be enough.    Hefin can’t help but notice the slender, confident woman with ginger hair who returns each day, so hopeful and determined. So when the tears start to fall, his silence—penance for a failed marriage—finally cracks. Once he’s touched her, what Hefin wants is to take her back to Wales and hold her forever. But Destiny’s roots run too deep. What they both need is each other—to learn how to live and love again.Advance praise for Live \n \n“Sizzling, sweet, and superbly written, Live is a marvelous love story.”—New York Times bestselling author Grace Burrowes“A beautiful, aching exploration of love, family, and loss—highly recommended!”—USA Today bestselling author Ruthie Knox   Praise for The Story Guy by Mary Ann Rivers   “In just over 100 pages, debut author Mary Ann Rivers gives us a powerful love story.”—USA Today  “A beautiful and affecting contemporary romance.”—Library Journal“I just finished it and as I’m sitting here jotting down thoughts for the A review, I’m crying and smiling.”—Dear Author“A sparkling gem of sweet emotion!”—New York Times bestselling author Carly Phillips   “A beautiful love story full of sly wit, slow kisses, and heart-punching truths. I can’t recommend Mary Ann Rivers highly enough.”—Ruthie Knox, USA Today bestselling author of Along Came Trouble   “In The Story Guy, Mary Ann Rivers writes a compelling story about finding love in the unlikeliest places. I was hooked from the first page.”—Elise Sax, author of An Affair to DismemberIncludes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Adult",
    "Chick Lit",
    "Loveswept"
  ],
  "author": "Mary Ann Rivers",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/18630722-live"
}