{
  "title": "Arcana: The Maiden",
  "description": "The High Priestess and her consort, the Magician, have stripped away all vestiges of technology and cast the world of Wade into a magical dark age. In order to further their aims of domination, the evil pair murders sixteen-year-old Bianca’s family and captures her, intending to use her ethereal blood to wake a powerful spirit and rule the universe. Three years later, Bianca breaks the sacred circle and allows an outside force to free her from her imprisonment in an evil place that the people of Wade call The Tower. When she wakes in the rebel encampment, Bianca finds herself faced with the boy she had thought dead and the Hierophant, who offers her something no one else has—a choice about her own destiny. Driven by a want to help the rebel forces and the need to be close to Jonathan, Bianca makes a courageous decision, with a little guidance from the true Goddess, and vows to end the High Priestess’ rule over Wade. Developing from a helpless captive to a strong leader, her only distraction is forcing Jonathan to choose between her and Angel, the sex-kitten daughter of a visiting coven leader. Unfortunately, it is a hard lesson learned when the devil plays her for a fool, and her distrust in her own magic allows a traitor to make the Hanged Man Coven vulnerable.Jonathan’s betrayal and the death of one of their own, sends Bianca fleeing from the hardships of her new life. Following the path of the Goddess, she learns the secret of the Wheel of Life and gains a valuable tool from the Hermit that reveals more than she had feared. With no choice left but to fight, Bianca and her people march into battle against the High Priestess’ forces. The journey is far from easy and proves that even the descendant of a Goddess can falter. On the verge of greatness or failure, Bianca must face down her darkest fears or die.",
  "genres": [],
  "author": "Catherine Stovall",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/18629810-arcana"
}