{
  "title": "Crash and Burn",
  "description": "Crash.....a crash ended it all and started it all. Dina Fowler is attending college with her long time best friend Maggie Lawson. Life is good and carefree. Until the crash that changed it all. Her freshman year ends with the loss of her parents in a car accident, spiraling Dina into a deep depression. Secluding herself as she picks up the pieces to her life, slowly she finds the only person she has left is Maggie. Chance encounters sometimes make the most incredible moments, other times they crash and burn. A chance encounter brings Michael barreling into a lost and vulnerable Dina's life. Playing on every weakness she has, he weasels his way into her heart. Slow build up to the hell that was soon to become Dina's daily nightmare. Her parents are gone. She wants out but has no idea how to escape her new reality. Can she find her way out? Or will she be lost completely burning in her own personal hell? Dear Reader, Broken. Battered. Not defeated. This is not a pretty story, wrapped in a nice package. This is a real story. Parts of this story are my very own. Defeated by the hands and words of a man, I am no more. This is a story of how easily the warning signs are overlooked. An outsider can easily say, “How do women stay in abusive relationships?” They don’t understand, it starts in little ways, a slow build up, by the time you are aware, it can be too late. This is a story centered around an abusive relationship and the fight to get out. If you don't like real situations (this happens every day to more women then you realize) then skip this book and move on to Restore My Heart and the others, which are not like this story. This is real and its raw so this is your warning before you buy and read.",
  "genres": [
    "Romance",
    "Contemporary",
    "New Adult",
    "Contemporary Romance",
    "Short Stories",
    "Dark",
    "Erotica"
  ],
  "author": "Chelsea Camaron",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/18630525-crash-and-burn"
}