{
  "title": "Oz: The Complete Collection",
  "description": "Although most children today are introduced to the world of Oz through the classic 1939 movie, L. Frank Baum has been captivating the hearts of the young, and not so young, for over a hundred years.This delightful compilation includes all fifteen books written by L. Frank Baum:The Wonderful Wizard of OzThe Marvelous Land of OzOzma of OzDorothy and the Wizard in OzThe Road to OzThe Emerald City of OzThe Patchwork Girl Of OzLittle Wizard Stories of OzTik-Tok of OzThe Scarecrow Of OzRinkitink In OzThe Lost Princess Of OzThe Tin Woodman Of OzThe Magic of OzGlinda Of OzPerhaps there is no better, or fitting, introduction one could give to this compilation than the author's note that Baum himself writes in his very first book, \"The Wonderful Wizard of Oz.\" Here he reveals the true intention of his work. Folklore, legends, myths and fairy tales have followed childhood through the ages, for every healthy youngster has a wholesome and instinctive love for stories fantastic, marvelous and manifestly unreal. The winged fairies of Grimm and Andersen have brought more happiness to childish hearts than all other human creations. Yet the old time fairy tale, having served for generations, may now be classed as \"historical\" in the children's library; for the time has come for a series of newer \"wonder tales\" in which the stereotyped genie, dwarf and fairy are eliminated, together with all the horrible and blood-curdling incidents devised by their authors to point a fearsome moral to each tale. Modern education includes morality; therefore the modern child seeks only entertainment in its wonder tales and gladly dispenses with all disagreeable incident. Having this thought in mind, the story of \"The Wonderful Wizard of Oz\" was written solely to please children of today. It aspires to being a modernized fairy tale, in which the wonderment and joy are retained and the heartaches and nightmares are left out.",
  "genres": [
    "Fantasy",
    "Classics",
    "Fiction",
    "Childrens",
    "Adventure",
    "Young Adult",
    "Literature"
  ],
  "author": "L. Frank Baum",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/18634109-oz"
}