{
  "title": "Change Up",
  "description": "In Patch Up and Fix Up you had Skye and Duke’s story. Now, it’s time for Derek and Kate to find their path.  He fights for the people he loves.She fights against love.Kate Andrews is starting her second year of college in Seattle. She is happy to leave Chicago and her dysfunctional family behind to be with her friends again. Growing up she thought that her parents' loveless marriage was all her father’s fault, but that summer she discovered that things are so much more complicated in life and love. Her mother is bipolar. That doesn’t mean her father isn’t unfaithful, nor does he support her and her choices. Additionally, he isn't a great father or husband, but it brings a new perspective in her life; the way she envisions love.Derek Williams graduated college a few months ago, and while he moved back in again with his single mother and teenage brother, he never thought that he would be struggling with two crappy jobs. He is not succeeding in either of his jobs or in his countless plans for the future. Instead, he’s trying to bring back his brother and set him on a straight path, while trying to avoid the wrong crowd hounding him, thanks to his brother. Together with fighting his mother on her lack of support in their family, this all has caused chaos.  “Yes, my life is a fucking mess. I have nothing for that girl who deserves everything, and yet I still can’t just sit on my ass and wait for the next asshole to pursue her.‘' — DEREKBoth of them are very different. Their upbringing is opposite; their vision of love and life contrast, and yet …  “I want to open up to it, open up to the possibility of heartbreak even if I’m scared to death. I’m ready to change up.'' — KATEThey’re both still hung up on each other. They can’t forget that one night they shared months ago, can’t ignore their attraction and quickly maturing love.They match in every way that matters, but time and time again their respective families are getting in the way.  \"He’s the commitment kind while I’m anti-commitment.\" — KATEAre they willing to fight for each other? Is Kate ready to risk her comfort and everything else for love? Is Derek prepared to chose which battles are worth fighting for?  “It’s never been friendship, and it’ll never be.’’ — DEREK",
  "genres": [],
  "author": "Stephanie Witter",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18633426-change-up"
}