{
  "title": "En medio de extrañas víctimas",
  "description": "Rodrigo es un burócrata joven que fácilmente podría pertenecer a lo que Strindberg llamó «el club de los jóvenes viejos». Sus días pasan sin mayores aspavientos en un museo de la Ciudad de México hasta que Cecilia, la secretaria que le hacía la vida imposible, le desliza una nota que simplemente dice «Acepto». Esa tarde Rodrigo se enterará de que alguien le ha propuesto matrimonio a Cecilia en nombre suyo, y la inercia que rige sus días no le deja más opción que casarse. A partir de ahí se desencadena una siniestra odisea en la que pierde su trabajo y pasa el rato espiando a una gallina que deambula por el terreno baldío contiguo a su departamento. De manera paralela un académico y escritor español, Marcelo Valente, viaja a una pequeña comunidad situada en México, llamada Los Girasoles, para pasar un sabático investigando sobre Richard Foret, un misterioso escritor, boxeador y artista, que encontró en México aquello que buscó durante toda su vida: un trágico desenlace «a la altura de su megalomanía». Los Girasoles se convierte en un centro neurálgico en el que las vidas de los personajes encuentran su destino entre «los más absurdos accidentes» y situaciones tan esotéricas como las sesiones hipnóticas —inducidas mediante la ingesta de orina de una hermosa adolescente— en las que un grupo de aventureros definirá «el futuro del arte». La risa, definida por Slavoj Žižek como «la metástasis del goce», es la herramienta fundamental utilizada en la primera novela de Daniel Saldaña París para desnudar ese «escándalo hiriente» que es la civilización. Con buen humor pero sin concesiones, la incomprensión que los personajes sienten ante un mundo que constantemente les recuerda, no siempre de las formas más sutiles, sus incapacidades y su medianía, es dejada al descubierto por el autor con una prosa que avanza a un ritmo furibundo meciéndose a lo largo y ancho de todo el idioma español. DANIEL SALDAÑA PARÍS (Ciudad de México, 1984) escribe narrativa y poesía. Es autor del libro de poemas La máquina autobiográfica (Bonobos Editores, 2012) y creador del Método Universal de Poesía Derivada. Ha sido becario del FONCA en los programas Jóvenes Creadores (2006-2007) y Residencias Artísticas (2012), así como de la Fundación para las Letras Mexicanas (2007-2009). En 2012 antologó y prologó Doce en punto. Poesía chilena reciente y Un nuevo modo. Antología de narrativa mexicana actual, ambos editados por la UNAM. Trabaja como editor y vive en la colonia Narvarte.",
  "genres": [
    "Fiction",
    "Novels",
    "Literary Fiction",
    "Literature",
    "Latin American Literature",
    "Book Club",
    "Spanish Literature"
  ],
  "author": "Daniel Saldaña París",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/18633212-en-medio-de-extra-as-v-ctimas"
}