{
  "title": "Something Radiates",
  "description": "Baton Rouge 1989Sarah Stevens is awakened by a sharp crack of lightning and a howling wind that’s railing against her little frame house and rushing through the hall to her room. Sarah leaps up and runs to the living room, stopping short when she sees her front door standing wide open – a door she’s certain she bolted and locked. Fighting against the battering wind and rain, Sarah calls to her teenage sons, Quincy and Daniel, and the three finally force the door shut.Then the boys discover their father’s wristwatch on the floor – the watch he was never without. But their father, Dietrich Peters, disappeared two years ago, after Sarah left him to escape fourteen years of abuse.Now Sarah fears that Dietrich is back.Wouldn’t it be just like him to do something this crazy to scare her back into submission? Didn’t Dietrich insist when he married Sarah that she belonged to him forever because he’d taken her to God? Hadn’t he vowed repeatedly to never – NEVER, EVER – let her go?And hasn’t Sarah been dreaming of a white-haired man trying to warn her about something she can’t understand, something to do with Dietrich?With her life suddenly tumbling once again into a state of dread, Sarah meets hunky carpenter Johnny Trahan and surprises herself with the depths of her feelings for him, passions she’d always longed for but doubted she’d find. But her feelings also enrage Dietrich. His intrusions grow ever more threatening while Sarah’s dreams take on a horrifying intensity, causing her to doubt her own sanity. Resolved to have the love and life she deserves, Sarah plunges into a life-and-death conflict with Dietrich that crosses several state boundaries and numerous realms of reality, forcing her to revisit her abused past, absorb the teachings of Timothy Leary, Carlos Castaneda, Carl Jung, and Zen Buddhism, and hone her own psychic skills, all culminating in a frightening and powerful climax near the peak of the Continental Divide.",
  "genres": [],
  "author": "Brenda Marie Smith",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/18634363-something-radiates"
}