{
  "title": "Exiles",
  "description": "The only extant play by the great Irish novelist, Exiles is of interest both for its autobiographical content and for formal reasons. In the characters and their circumstances details of Joyce's life are evident. The main character, Richard Rowan, the moody, tormented writer who is at odds with both his wife and the parochial Irish society around him, is clearly a portrait of Joyce himself. The character of Rowan's wife, Bertha, is certainly influenced by Joyce's lover and later wife, Nora Barnacle, with whom he left Ireland and lived a seminomadic existence in Zurich, Rome, Trieste, and Paris. As in real life, the play depicts the couple with a young son and, like Joyce, Rowan has returned to Ireland because of his mother's illness and subsequent death.One can also detect hints of Joyce's interest in Nietzsche in Rowan's flawed pursuit of total individual freedom despite the stifling morals of Irish society. Though wrestling with guilt over his own infidelities, Rowan insists on this personal liberty, not only for himself but for his wife as well, who he knows is tempted by his cousin's amorous overtures.Joyce's decision to express himself in the form of a play no doubt reflects his long admiration of the Norwegian playwright Henrik Ibsen. In the tense dialogue, the largely interior drama focused on the characters' relationships, the undertones of guilt, and the longing for freedom one sees similarities with Ibsen's themes. Also the spare, understated writing style - so unlike Joyce's exuberant, playful, and experimental use of language in his novels - shows the influence of Ibsen's \"naked drama\" (as Joyce described Ibsen's style in a published review). Above all, Joyce emulated the Scandinavian master in making the central issue of his drama the conflict between individual freedom and a demanding, judgmental society. In Exiles the protagonists struggle with the choice between living in defiance of the rigid conventions of Irish society or exile from their homeland.Though lesser-known, Exiles, written after Portrait of the Artist as a Young Man and while Joyce was working on Ulysses, provides interesting insights into the development of the creative gifts of a literary genius.",
  "genres": [
    "Plays",
    "Drama",
    "Fiction",
    "Classics",
    "Irish Literature",
    "Ireland",
    "Theatre"
  ],
  "author": "James Joyce",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/11007.Exiles"
}