{
  "title": "Location, Location, Damnation",
  "description": "\"Trev Irwin didn’t believe in ghosts, which made it something of a shock when he saw one.\"Working as an estate agent in the town of Brackenford isn’t the hardest job in the world – just ask Trev Irwin. He knows the market inside out, house prices are steady, and the only competition in the office is Barry, who has all the wit and charm of a mouth ulcer.But there are other forces at work in Brackenford besides the unquenchable desire of grannies to buy bungalows, as Trev discovers when he witnesses a shadowy entity possess a man in a local café. A man who goes straight home and murders his wife and her lover. With a cricket bat.A lifelong sceptic of the paranormal, Trev is still trying to rationalise these events when he discovers that his own grandfather is rather more than the curmudgeonly whisky-enthusiast he appears to be. The old man is also Brackenford’s Custodian, a role which requires him to keep the peace among the town’s supernatural residents, and he believes that Trev can help him.Trev disagrees; but when he inadvertently foils an assassination attempt on Brackenford’s most famous resident, the slick supermarket tycoon Alastair Kolley, he finds that he’s upgraded his status from “potential collateral damage” to “target” in the eyes of the bad guys. But who are the bad guys? Is it the tabloid-reading ghouls who live in the sewers? The werewolf self-help group that meets in the church hall? Or the local lord of the manor, who looks pretty sprightly for a man who’s over 150 years old? Trev hasn’t a clue, and the only help he’s got comes from a septuagenarian, a puritanical Victorian ghost, and the world’s most sarcastic cat.Yep – he’s basically screwed.",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Paranormal",
    "Werewolves",
    "Ghosts",
    "Urban",
    "Vampires"
  ],
  "author": "Nick Moseley",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/18634299-location-location-damnation"
}