{
  "title": "Johnny Carson",
  "description": "A revealing and incisive account of the King of Late Night at the height of his fame and power, by his lawyer, wingman, fixer, and closest confidant From 1962 until 1992, Johnny Carson hosted The Tonight Show and permeated the American consciousness. In the ’70s and ’80s he was the country’s highest-paid entertainer and its most enigmatic. He was notoriously inscrutable, as mercurial (and sometimes cruel) off-camera as he was charming and hilarious onstage. During the apex of his reign, Carson’s longtime lawyer and best friend was Henry Bushkin, who now shows us Johnny Carson with a breathtaking clarity and depth that nobody else could. From the moment in 1970 when Carson hired Bushkin (who was just twenty-seven) until the moment eighteen years later when they parted ways, the author witnessed and often took part in a string of escapades that still retain their power to surprise and fascinate us. One of Bushkin’s first assignments was helping Carson break into a posh Manhattan apartment to gather evidence of his wife’s infidelity. More than once, Bushkin helped his client avoid entanglements with the mob. Of course, Carson’s adventures weren’t all so sordid. He hosted Ronald Reagan’s inaugural concert as a favor to the new president, and he prevented a drunken Dean Martin from appearing onstage that evening. Carson socialized with Frank Sinatra, Jack Lemmon, Jimmy Stewart, Kirk Douglas, and dozens of other boldface names who populate this atmospheric and propulsive chronicle of the King of Late Night and his world. But this memoir isn’t just dishy. It is a tautly rendered and remarkably nuanced portrait of Carson, revealing not only how he truly was, but why. Bushkin explains why Carson, a voracious (and very talented) womanizer, felt he always had to be married; why he loathed small talk even as he excelled at it; why he couldn’t visit his son in the hospital and wouldn’t attend his mother’s funeral; and much more. Bushkin’s account is by turns shocking, poignant, and uproarious — written with a novelist’s eye for detail, a screenwriter’s ear for dialogue, and a knack for comic timing that Carson himself would relish. Johnny Carson unveils not only the hidden Carson, but also the raucous, star-studded world he ruled.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Biography Memoir",
    "Memoir",
    "Audiobook",
    "Tv",
    "Humor"
  ],
  "author": "Henry Bushkin",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/18634797-johnny-carson"
}