{
  "title": "North of Normal: A Memoir of My Wilderness Childhood, My Unusual Family, and How I Survived Both",
  "description": "Sex, drugs, and . . . bug stew? In the vein of The Glass Castle and Wild, Cea Sunrise Person’s compelling memoir of a childhood spent with her dysfunctional counter-culture family in the Canadian wilderness—a searing story of physical, emotional, and psychological survival. In the late 1960s, riding the crest of the counterculture movement, Cea’s family left a comfortable existence in California to live off the land in the Canadian wilderness. But unlike most commune dwellers of the time, the Persons weren’t trying to build a new society—they wanted to escape civilization altogether. Led by Cea’s grandfather Dick, they lived a pot-smoking, free-loving, clothing-optional life under a canvas tipi without running water, electricity, or heat for the bitter winters. Living out her grandparents’ dream with her teenage mother Michelle, young Cea knew little of the world beyond her forest. She spent her summers playing nude in the meadow and her winters snowshoeing behind the grandfather she idolized. Despite fierce storms, food shortages, and the occasional drug-and-sex-infused party for visitors, it seemed to be a mostly happy existence. For Michelle, however, now long separated from Cea’s father, there was one crucial element a man. When Cea was five, Michelle took her on the road with a new boyfriend. As the trio set upon a series of ill-fated adventures, Cea began to question both her highly unusual world and the hedonistic woman at the centre of it—questions that eventually evolved into an all-consuming search for a more normal life. Finally, in her early teens, Cea realized she would have to make a choice as drastic as the one her grandparents once had in order to save herself. While a successful international modeling career offered her a way out of the wilderness, Cea discovered that this new world was in its own way daunting and full of challenges. Containing twenty-four intimate black-and-white family photos, North of Normal is Cea’s funny, shocking, heartbreaking, and triumphant tale of self-discovery and acceptance, adversity, and strength that will leave no reader unmoved.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Book Club",
    "Biography",
    "Biography Memoir",
    "Canada",
    "Audiobook"
  ],
  "author": "Cea Sunrise Person",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/18635097-north-of-normal"
}