{
  "title": "Hypothesis",
  "description": "\"I am the master of my fate; I am the captain of my soul...'College sophomore Gabrielle Bridge is falling for the wrong guy. She should be smarter than that, but on her defense, he was wearing the most surprising disguise.The physics student's greatest ambition is to win the Nobel prize one day. But with an absentee father and an alcoholic mother, she knows her chances alone, are next to zero. To achieve her goal, she tries to recruit her current crush, the brilliant Toby Harker, as a partner.Sadly her big stupid mouth lands her pretty but dumb William Wyseman, instead. This unfortunate pairing though turns out to be enchanting -literally.William is a wizard, magic is real.There is a secret world hidden in plain sight, a world at war with Sekeem Soulless a sorcerer powerful enough to destroy it all. William, unable to beat Sekeem with his powers was trying to find in science a human weapon to stop him. And it turns out that Gabrielle might be what he needs: she is immune to magic.Gabrielle makes a pact with William: Studying her immunity in order to defeat Sekeem. In return William will give her exclusive access to the secrets of his species so she can reveal it to the whole world. The Nobel will be hers with this breakthrough. But they need to work quickly before Sekeem kills her with his bare hands if magic won't do. Gabrielle will learn the mysteries of magic. However, her most shocking discoveries will be about herself.Filled with science, romance, nerdy humor, and family drama, The Hekapolis Trilogy transports the reader on an tumultuous passionate journey of love, pain and control. Science meets magic, in this New Adult love story for geek lovers and all audiences that are looking for a fresh love story with a smart girl protagonist.*Includes the first chapter of The Hekapolis Trilogy #2: Experiment*Want to be the first one to know when the sequels are ready and get a lower special price? Join my newsletter.We will also be doing regular giveaways with exclusive short stories, content, clues and outlines that didn't make it onto the books.JOIN TODAY HERE!http://eepurl.com/baul6HFor playlists,songs and casting dreams like our facebook page: https://www.facebook.com/pages/Hypoth...",
  "genres": [
    "Romance"
  ],
  "author": "Ana Bastow",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/18641261-hypothesis"
}