{
  "title": "Ecology or Catastrophe: The Life of Murray Bookchin",
  "description": "Murray Bookchin was not only one of the most significant and influential environmental philosophers of the twentieth century--he was also one of the most prescient. From industrial agriculture to nuclear radiation, Bookchin has been at the forefront of every major ecological issue since the very beginning, often proposing a solution before most people even recognized there was a problem.Ecology or The Life of Murray Bookchin is the first biography of this groundbreaking environmental and political thinker. Author Janet Biehl worked as his collaborator and copyeditor for 19 years, editing his every word. Thanks to her extensive personal history with Bookchin as well as her access to his papers and archival research, Ecology or Catastrophe offers unique insight into his personal and professional life. Founder of the social ecology movement, Bookchin first started raising environmental issues in 1952. He foresaw global warming in the 1960s and even then argued that we should look into renewable energy sources as an alternative to fossil fuels. Wary of pesticides and other chemicals used in industrial agriculture, he was also an early advocate of small-scale organic farming, which has developed into the present locavore movement and the revival of organic markets. Even Occupy can trace the origins of its leaderless structure and general assemblies to thenonhierarchical organizational form Bookchin developed as a libertarian socialist.Bookchin believed that social and ecological issues were deeply intertwined. Convinced that capitalism pushes businesses to maximize profits and ignore humanist concerns, he argued that eco-crises could be resolved by a new social arrangement. His solution was Communalism, a new form of libertarian socialism that he developed. An optimist and utopian, Bookchin believed in the potentiality for human beings to use reason to solve all social and ecological problems.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Politics",
    "Environment",
    "Philosophy",
    "Ecology"
  ],
  "author": "Janet Biehl",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/18635335-ecology-or-catastrophe"
}