{
  "title": "Losing Dad, Paranoid Schizophrenia: A Family's Search for Hope",
  "description": "Silver award recipient of IBPA's prestigious Benjamin Franklin book award in the category of psychology, Losing Dad, Paranoid Schizophrenia: A Family's Search for Hope is the compelling true story of a family's struggle with the sudden onset of their father's severe mental illness after his fifty-third birthday. Lacking an understanding of Joseph’s condition, the family is left to deal with his upsetting transformation and subsequent homelessness. The perspectives of his three children, his spouse, and his own distorted reality combine to offer readers a glimpse of a world that will either feel hauntingly familiar or dramatically eye-opening. With so many recent tragedies involving individuals with untreated severe mental illness, families, doctors, and police are often blamed for not doing enough. The solution, however, is rarely simple. Losing Dad poignantly shows the effects of inadequate treatment for those living with a severe mental illness in America. Losing Dad not only features Joseph's harrowing -- and still ongoing -- flight from reality, but also valuable information about severe mental illness, a crippling disease that affects 1 in 17. Bonus: provides a list of resources, a discussion of current mental health laws, and exclusive family member interviews with several family members. Ideal for book clubs, reading discussion questions are included. The Foreword written by Xavier Amador,Ph.D., Founder, LEAP Institute and Author, I am Not Sick, I Don't Need Help! (Vida Press 2012) also explains anosognosia. A portion of proceeds from sales of Losing Dad will go to NAMI-OC, an affiliate of the National Alliance on Mental Illness, a nonprofit dedicated to improving lives of individuals and families affected by mental illness.",
  "genres": [
    "Mental Health",
    "Memoir",
    "Psychology",
    "Nonfiction",
    "Mental Illness",
    "Biography",
    "Psychiatry"
  ],
  "author": "Amanda LaPera",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/18637668-losing-dad-paranoid-schizophrenia"
}