{
  "title": "Cristofori's Dream",
  "description": "In a magical quest for a Christmas miracle, he did not understand the power with which he played . . .When Christopher Russo was in middle school and struggling with an unhappy home life, his artist-mother gave him one of many secret family treasures entrusted to him: an ancient diary unearthed from the mountains of her ancestral Austria. “Use the Book,” she implored him one fateful night. “It will save you.” To escape their monstrous father, if only in their minds, Chris and his younger sister turned to their faith and added a fantasy story called FOREVER CHRISTMAS; a Victorian-era Dream World inspired by all the art and artifacts—the sacred and the unholy—so influential in their lives. But after a deadly legacy claimed his mother and his first true love abandoned him, Chris tossed aside his “childish” beliefs, turned to science for solutions, then rewrote the story to fit his enlightened views—and settle old scores with all who have hurt him. But the Book is steeped in Christmas legends, holds a dark secret, and an even darker power that takes control during the Holy Season of Magic. And when his story came to life . . . .One year later, another holiday season approaches. Chris, now a high school freshman, is battling his sister’s failing health, his treasure-seeking father who doesn’t “believe” in doctors, and his guilt for a terrible tragedy—all the while haunted once more by visions from the Dream World that he can no longer deny exists. Despite all the misfortune, there is one last hope still echoing in his mother’s words: a permanent escape to that Dream World where they’ll be free of neglect, illness, and shame. But Chris must confront all of his creations—the sacred and the unholy—if he wants to recapture all the love he once knew, and save his sister from the legacy that relentlessly stalks her.Beware the power of science, and the Holy Season of Magic. Because it really does matter what you believe, especially this time of the year . . . .",
  "genres": [
    "Christmas",
    "Time Travel"
  ],
  "author": "Robert Italia",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/18648892-cristofori-s-dream"
}