{
  "title": "Die Haarteppichknüpfer",
  "description": "Das Buch schildert anfangs die Zustände auf einem Planeten in einer nicht näher bestimmten Zukunft: die am höchsten angesehe Kaste ist die der \"Haarteppichknüpfer\", einer Art Weber, die aus dem Haar ihrer Frauen und Töchter einen Teppich weben; und das mit solch einer Kunstfertigkeit und Knotendichte, daß an deren Lebensende gerademal ein Teppich vollendet ist, mit dessen Verkauf das Überleben der Familie wieder für eine Generation gesichert ist. Der Käufer aller Teppiche des Planeten ist der Kaiser, gottgleich und unsterblich, für dessen Palast die unbezahlbaren Kunstgegenstände bestimmt sind. Die Perspektive wechselt, und plötzlich findet sich der Leser im Orbit des Planeten wieder. Dort befindet sich ein Expeditionsraumschiff, das in diesen bisher unbekannten Sektor der Galaxie vorgedrungen ist und dessen Pilot nun beschließt auf dem Planeten zu landen um mehr Informationen zu sammeln. Kurz nach seiner Ankunft wird er jedoch gefangengenommen, denn er verbreitet die \"ketzerische\" Nachricht, der Kaiser sei schon seit langem gestürzt und die Rebellen hätten die Menschen von ihrem Joch befreit. Dies paßt natürlich überhaupt nicht ins Weltbild der Einheimischen, denn für die Festigung der Macht des Kaisers sorgen planetenweit umherwandernde Priester ... doch vor seinem Verschwinden kann der Pilot noch eine Mitteilung über die Haarteppiche an sein Schiff schicken. Nach einiger Zeit wird die Suche nach ihm aufgegeben und die Sache mit den Teppichen wäre nur eine Kuriosität geblieben, wenn nicht Hunderte anderer Planeten entdeckt worden wären, auf denen das gleiche faszinierende Handwerk weit verbreitet ist. Doch in dem Palast des Kaisers -- der in der Tat gestürzt wurde -- wird kein einziger dieser Teppiche gefunden und immer noch holen Schiffe die fertiggestellten Produkte ab. Was also geschieht mit den Teppichen? Die Antwort wird am Ende des Buches offenbart, doch bis dahin erfährt man noch viel mehr Hintergründe: die Geschehnisse, die zum Sturz des Kaisers führten, genauso wie Einblicke in die Kultur des Planeten ... und immer wieder nimmt die Handlung überraschende Wendungen. Urteil: Mit seinem Erstlingswerk zeigt Eschbach, daß die deutsche SF nicht tot ist. Die von ihm entworfene Welt ist ebenso äußerst ergreifend wie fremdartig, und das ohne irgendwelche spektakulären Action-Einlagen oder Super-Aliens. Durch andauernde Sprünge in Erzählperspektive sowie Zeitlinie weiß der Autor den Leser bis zum Ende zu fesseln, bis schließlich die vielen Mosaike ein großes Bild ergeben ... auch wenn die Auflösung und einige andere Aspekte vielleicht mehr mit Fantasy als mit Science Fiction zu tun haben. Alles in allem wirklich empfehlenswert, besonders weil sich die Story erfrischend vom Durchschnitt abhebt. --Oliver Faulhaber",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Short Stories",
    "German Literature",
    "Science Fiction Fantasy",
    "Speculative Fiction"
  ],
  "author": "Andreas Eschbach",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/1864677.Die_Haarteppichkn_pfer"
}