{
  "title": "Smurf",
  "description": "The storylines tend to be simple tales of bold adventure. The cast has a simple structure as almost all the characters look essentially alike — male, very short (just \"three apples tall\"), with blue skin, white trousers with a hole for their short tails, white hat in the style of a Phrygian cap, and some additional accessory that identifies each one's personality. (For instance, Handy Smurf wears overalls instead of the standard trousers, a brimmed hat, and a pencil above his ear). Smurfs can walk and run, but often move by skipping on both feet. They love to eat smilax leaves, whose berries the smurfs naturally call smurfberries.The male Smurfs almost never appear without their hats, which leaves a mystery amongst the fans as to whether they have hair or not. The animated series canon state that they may be one episode of the Hanna-Barbera cartoon has Greedy Smurf removing his chef's hat to give Papa Smurf a pie he had concealed under it, revealing a bald head. Another episode, St. Smurf and the Dragon, shows Hefty Smurf's hat rising up off his bald head briefly as he and others slide to a stop. Both Papa Smurf and Grandpa Smurf have full beards and hair visibly coming from under their hats above the earline. In The Smurfs and the Magic Flute, a Smurf took off his hat briefly for a polite gesture.In the comics, the last page of first album Les Schtroumpfs noirs (The Black Smurfs) shows Papa Smurf's hat blown off by an explosion, revealing his completely bald head (which may simply be due to old age). In Le Schtroumpfeur de Bijoux (The Jewel Smurfer), Jokey Smurf gets very angry and defensive when a human tells him he should take off his hat.The smurfs fulfill simple archetypes of everyday Lazy Smurf, Grouchy Smurf, Brainy Smurf, and so on. All smurfs but Papa, Baby, Nanny and Grandpa are said to be 100 years old, and there are normally 100 smurfs (but this number increases as new smurf characters smurflings, Nanny, etc).",
  "genres": [
    "Komik",
    "Comics"
  ],
  "author": "Peyo",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/1864252.Smurf"
}