{
  "title": "Romance Super Bundle",
  "description": "Ten full-length romance novels (Contemporary, Romantic Suspense & Historical) by ten of your favorite authors for one low price!Touched by Death - Dale MayerDeath had touched anthropologist Jade Hansen in Haiti once before, costing her an unborn child and perhaps her very sanity. A year later, determined to face her own issues, she returns to recover the bodies of an American family from a mass grave-only to find the grave holds more than expected-and Jade finds herself confronting death and terror once again. And the man who unexpectedly awakens her heart is right in the middle of it all.There's Only Been You - Donna Marie RogersTwo weeks after Mike Andrews disappeared from her life, Sara Jamison discovered she was an unwed pregnant teenager. With the love and support of her annoyingly alpha-male family, she's made a good life for herself and her young son. Sure, she works too hard and her social life is nonexistent, but for the most part, she's content-until the day Mike walks into her bakery and back into her life.Stardust Miracle - Edie RamerBecky Diedrich is the cheesemaker's daughter, the minister's wife, the good sister. What she's not is her own woman, what she can't be is a mother. And then she catches her husband with another woman, and she moves in with her sister, and she starts to see sparkles. And this is just the beginning...Meant for Her - Amy GametA fiery homicide leaves Navy investigator Hank Jared with just two clues: an encrypted message and a name, Julie X. Trueblood. Shadows surround Julie, and Hank finds the perfect place to hide her, right by his side at his sister's wedding. Now he just needs to remember their relationship is all an act.Rogue's Hostage - Linda McLaughlinMara Dupre is taken captive by a French and Indian War party that attacked her cabin and killed her husband. She longs for her freedom, but her captor has other ideas. Lt. Jacques Corbeau's desire for his hostage threatens what little honor he has left. Will Mara find her way home, or realize she is already there?Sleight of Hand - Kate KellySuspected of stealing half a million dollars of original paintings, Chance Spencer can't afford to have the FBI delve into his covert past. When one agent tries to put him behind bars, Chance coerces the real thief's daughter into helping him flush her wily father out of hiding. But his plan quickly deteriorates when the stakes for his freedom soar. How can he ruthlessly use the woman with whom he's falling in love?August Unknown - Pamela FryerShe doesn't know what happened the night of the storm, why she was walking along the highway without ID, or why she has a fading tan line on her wedding ring finger, but a dark and terrifying presence haunts the edge of her memory. Before she can start a new life with the wonderful man who came to her rescue, she must remember what in her past might take her away from him.Love, Lies and a Double Shot of Deception - Lois WinstonLife has delivered one sucker punch after another to Emma Wadsworth. The poor little rich girl is the ultimate poster child for \"Money Can't Buy Happiness\"-even if she's no longer a child. So when Philadelphia's most beloved citizen becomes the city's most notorious criminal, she needs to do a lot more than clear her name if she wants to save her budding romance with the billionaire hunk someone is willing to kill for.Hard Target - Barbara PhinneySgt. Dawna Atkinson has worked hard for her embassy posting, even while taking the blame for a shared indiscretion with her instructor, Tay Hastings. But when her embassy is bombed and Tay arrives to assist, she is forced to trust Tay or risk the lives of everyone around them.Jesse's Brother - Wendy ElyOne woman, two men: a single summer to choose between them. Sacrificing a summer to fix her relationship with her mother and find out what's troubling her father isn't so bad...right? Wrong. First comes Noah. Then comes Jesse. Will Samantha be able to choose between the men before their secret crushes her?",
  "genres": [
    "Romance",
    "Anthologies",
    "Contemporary Romance",
    "Fiction",
    "Historical Romance",
    "Amazon",
    "Contemporary"
  ],
  "author": "Dale Mayer",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/18652132-romance-super-bundle"
}