{
  "title": "Unraveled",
  "description": "Eight original tales of passion from eight bestselling authors...YOURS TO TAKE by USA Today Bestselling Author Cathryn FoxRevenge takes on a sexy twist when a powerhouse lawyer is stripped of her control and held captive by the handsome multi-millionaire she once took down in the courtroom.YIELD TO ME by Sarah CastilleAn ambitious MMA fighter struggles to resist her attraction to the dangerously sexy fight coach who awakens in her secret erotic desires that could destroy her fighting career.COMPLETE ABANDON by NY Times Bestselling Author Julia KentSix months after having her baby, Laura finds that her sex life has unraveled, even as her BDSM fantasies heat up her eReader. Puzzled and frustrated, her partners Mike and Dylan resort to a little spying—and what they find on her eReader ties someone in knots...but it won't be them. When their best friends take the baby for an overnight, Mike and Dylan show Laura just how alpha they can both be, as Laura surrenders herself to them with complete abandon.THREE LITTLE WORDS by Lauren HawkeyeTwo years ago serious law student broke wild child Adele Cavanaugh’s heart. Now, just as Adele is struggling to rebuild her life after the night where everything went wrong, Mal is thrown back into her life... and she meets Dorian Marshall, the sexy Australian lead singer of Three Little Words, a bad boy with a soft spot for her. Mal and Dorian are roommates and friends.... but how can Adele choose just one when they both help to ease her pain?TAKEN BY STORM by USA Today Bestselling Author Opal CarewJessica doesn't like to take risks, but when she's almost run over by a red hot rock musician named Storm on his motorcycle, she realizes that some risks are worth taking.HOW TO CHOOSE A COWBOY by Daire St. DenisWhen Tessa Savage is forced to choose between two hunky cowboys while vacationing at the Lazy L Dude Ranch, she finds herself at a loss; the Marlborough Man look-a-like or the fun-loving exhibitionist. Help Tessa decide in this smokin’ hot interactive taleTHE VAMPIRE DESIGN by USA Today Bestselling Author Vivi AnnaA naive young artist travels through Europe searching for the most infamous painter ever to live… and who also happens to be a 300 year old vampire.ANYTHING HE WANTS: ATONEMENT by NY Times Bestselling Author Sara FawkesJeremiah and Lucy have been through the fire and barely escaped with their lives, but can their love survive the real world?",
  "genres": [
    "Erotica",
    "BDSM",
    "Romance",
    "Anthologies",
    "Contemporary",
    "Menage",
    "Contemporary Romance"
  ],
  "author": "Sara Fawkes",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/18652108-unraveled"
}