{
  "title": "The Music of Fantasy Cinema",
  "description": "Fantasy has had a modern resurgence in cinema due largely to the success of superhero narratives and the two major fantasy series, the Lord of the Rings and Harry Potter. Often regarded as mere escapism, works of both literature and cinema wishing to be taken seriously by the public, by critics and by academics have tended to shelter under the euphemistic umbrella of Magic Realism and, until very recently, there has been a general lack of serious academic work concerned with fantasy as a genre. This volume explores the way in which music and sound articulate the fantastic in cinema and contribute to the creation of fantasy narratives. Apart from the accusation of frivolous escapism that attaches itself to the fantasy genre, another issue is the lack of a single and simple definition of what fantasy is: the consensus of academic opinion appears to be that fantasy invokes the magical within its narratives as the means by which to achieve what would be impossible in our own reality, as compared to sci-fi's as-yet unknown technologies and horror's dark and deadly supernatural forces. Fantasy remains problematic, however, because it defies many of the conventional mechanisms by which genre is defined such as setting, mood and audience. In a way quite unlike its co-genres, fantasy moves with infinite flexibility between locations - the world (almost) as we know it, historical, futuristic or mythic locations; between moods - heroic, epic, magical; and between audiences - children, teens, adults. In English-language cinema, it encompasses the grand mythic narratives of Lord of the Rings, Legend and The Seventh Voyage of Sinbad, the heroic narratives of Superman, Flash Gordon and Indiana Jones and the magical narratives of Labyrinth, Edward Scissorhands and the Harry Potter series, to name just some of films that typify the variety that the genre offers. What these films all have in common is a requirement that the audience accepts the a fundamental break with reality within the diegesis of the filmic narrative, and embraces magic in its many and various forms, sometimes benign, sometimes not. This volume examines music in fantasy cinema across a broad historical perspective, from Bernard Herrmann's scores for Ray Harryhausen, through the popular music scores of the 1980s to contemporary scores for films such as The Mummy and the Harry Potter series, allowing the reader to see not only the way that the musical strategies of fantasy scoring have changed over time but also to appreciate the inventiveness of composers such as Bernard Herrmann, John Williams, Jerry Goldsmith, Danny Elfman and Elliot Goldenthal, and popular musicians such as Queen and David Bowie in evoking the mythic, the magical and the monstrous in their music for fantasy film.",
  "genres": [],
  "author": "Janet K. Halfyard",
  "average_rating": "2.50",
  "url": "https://www.goodreads.com/book/show/18654752-the-music-of-fantasy-cinema"
}