{
  "title": "The Age of Kali: Indian Travels and Encounters",
  "description": "William Dalrymple has proved himself to be one of the most perceptive and enjoyable travel writers of the 1990s. His first book, In Xanadu, became an instant backpacker's classic, winning a stream of literary prizes. City of Djinns and From the Holy Mountain soon followed, to universal critical praise. Yet it is India that Dalrymple continues to return to in his travels, and his fourth book, The Age of Kali, is his most reflective book to date.  The result of 10 year's living and traveling throughout the Indian subcontinent, The Age of Kali emerges from Dalrymple's uneasy sense that the region is slipping into the most fearsome of all epochs in ancient Hindu cosmology: \"the Kali Yug, the Age of Kali, the lowest possible throw, an epoch of strife, corruption, darkness, and disintegration.\" \"The brilliance of this book lies in its refusal to reflect any cultural pessimism. Dalrymple's love for the subcontinent, and his feel for its diverse cultural identity, comes across in every page, which makes its chronicles of political corruption, ethnic violence, and social disintegration all the more poignant. The scope of the book is particularly impressive, from the vivid opening chapters portraying the lawless caste violence of Bihar, to interviews with the drug barons on the North-West Frontier, and Dalrymple's extraordinary encounter with the Tamil Tigers in Sri Lanka. Some of the most fascinating sections of the book are Dalrymple's interviews with Imran Khan and Benazir Bhutto in Pakistan, which read like nonfiction companion pieces to Salman Rushdie's bitterly satirical Shame. The Age of Kali is a dark, disturbing book that takes the pulse of a continent facing some tough questions. --Jerry Brotton, Amazon.co.uk",
  "genres": [
    "Travel",
    "India",
    "Nonfiction",
    "History",
    "Travelogue",
    "Asia",
    "Essays"
  ],
  "author": "William Dalrymple",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/186538.The_Age_of_Kali"
}