{
  "title": "I Put A Spell On You, A Halloween Anthology",
  "description": "Codi GaryDeana Sawyer has been cursed with bad luck for most of her life, but this Halloween, she's got a plan to change it! However, her night doesn't go exactly as planned; her attempt at red hair dye comes out a shocking pink, her costume is so tight she's bursting at the seams, and to top it all off, Finn Meyers, the guy who broke her heart in high school, is back and hotter than ever! Deana doesn't think her night could get any worse until a knife weilding maniac attacks her...and suddenly, the only place she feels safe is in Finn's arms.Jaclyn HatcherWith their show on the verge of cancellation, amateur ghost hunters Casey Taylor and her sister, Abby, are scrambling to boost ratings. Though Raiders of the Haunted House has yet to see an actual ghost, Casey doesn't mind the lack of close encounters. The only thing that scares her more than things that go bump in the night is her massive crush on the show's sexy producer, Luke Mason. When her sister not only books the most haunted place on earth, but decides to put Luke in front of the camera with Casey, she finds out that she wasn't the only one hiding their true feelings. But when a malevolent spirit marks her for death, Casey and Luke find themselves fighting more than their attraction for each other. They need to survive the night...or else it wont just be the show that gets cancelled April OglesbeeAstrid, a guardian of fate and a sufferer of extreme social anxiety, has lived most of her life on the edge of her duties. Wouldn't it figure then that the man who's life she's supposed to usher to a close, on All Hallow's Eve no less, turns out to be the same rockstar she's been crushing on? When she finally works up the courage to do her duty, she discovers there’s more than just a job between them. So, she has two choices: overcome her social anxiety and offer the man of her dreams the opportunity to become something else...with her...or offer him his fate--death. The problem is...maybe he’ll choose death.",
  "genres": [],
  "author": "April Oglesbee",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/18657105-i-put-a-spell-on-you-a-halloween-anthology"
}