{
  "title": "Power Games",
  "description": "Welcome to the future of America. Land of chaos and home of the ambitious...A botched assassination on the eve of Election Day throws the routine transfer of presidential authority on its head and shuts down the Federal Government.With Congress and the Supreme Court locked in a constitutional standoff, rabble-rousing state governors fueling the fire and shadowy opportunists pulling strings, the nation teeters on the verge of a Second Civil War.As the politicos play their games and lose control, the scourge of 21st century hyper-war is unleashed upon a shattered nation. Fancy speeches aside, the lives of millions will not ride on the politicians and generals, but on the shoulders of the pawns they tossed into the meat grinder.Pawns like Sergeant Major John Brown, a hard charging paratrooper, who’s about as political as a potato, yet incites a second revolution. Or young Sophie Kampbell, a social justice crusader, who despises violence in every form until tragedy shoves her into the arms of the mysterious “Freedom Brigade” militias.Power Games is the first installment in the epic Enduring Unity military thriller series. If you like Red Storm Rising by Tom Clancy or Red Phoenix by Larry Bond, then you'll love this explosive adventure packed with constant thrills, twists and high stakes from cover to cover.Q&A with Richard How would you describe Power Games in one sentence?Well, I’d say an Amazon reviewer summed up the tale much better than I ever “A 21st century remake of Dr. Strangelove.”So what’s your political agenda? Is this story right or left wing propaganda?Like the first US Civil War, politics has little to do with the fighting. Once blood is shed, once that terrible genie of violence comes out of the bottle, how do you switch off the self-feeding cycle of fear and revenge? This is a story of extremism run wild and the young men and women that must put out the fire; not about politics.Where’d you get the idea for The Operation Enduring Unity series?Like most authors, I write what I want to read. If you aren’t passionate about your work and don’t get sucked into your fantasy world, how can you expect readers to be? So I set out to create a grand military thriller about large-scale, modern combined arms warfare, in the vein of my favorite writers, Tom Clancy, Ralph Peters and Harold Coyle. I ached to read realistic military fiction that covered everything from the rhetoric-stained halls of power to the full-spectrum of air, land and sea warfighters, as well as the innocents and war profiteers in between.Of course, that required a realistic backstory. That’s where things got interesting and unique. Total war in the near future against Russia or China just seemed too implausible, which left only one real threat to America- itself. From there, the political maneuverings, the collapse of the Federal Government and the crisis of faith for fighters took center stage and dominated the story.Lincoln said it best in his Lyceum Address, 22 years before the first Civil “All the armies of Europe, Asia, and Africa combined, with all the treasure of the earth (our own excepted) in their military chest, with a Bonaparte for a commander, could not by force take a drink from the Ohio River or make a track on the Blue Ridge Mountains in a trial of a thousand years.At what point then is the approach of danger to be expected? I If it ever reach us, it must spring up amongst us; it cannot come from abroad. If destruction be our lot then we must ourselves be its author and finisher. As a nation of freemen we must live through all time or die by suicide.”",
  "genres": [
    "Military Fiction",
    "Action",
    "War"
  ],
  "author": "R.A. Peters",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/18657210-power-games"
}