{
  "title": "Girls Are Gone",
  "description": "A women's prison: Not the place you expect to meet life-long friends. But four women of varying ages, ethnicities and backgrounds, serving time for a range of crimes, become unlikely allies when they plan a risky endeavor -- breaking out of the medium security prison. They plot and strategize every detail for months and finally the big day comes, but one of the four doesn't show up. After waiting as long as possible, the trio decides they have to leave. Their plan works flawlessly and the women make their way to a small town where the ex-husband of one of the women helps them get forged documents to assume new identities and forever hide who they were. The three escapees commit to help each other re-build their lives and protect their new identies and back stories. Pretty soon they stop looking over their shoulders and settle into their new surroundings. The women do feel a longing for their previous lives and the friends and family they left behind, but they must remind each other that their pasts are forever gone. They are also haunted by abandoning the fourth woman who planned to join them in the escape -- what happened to her that day? Fast forward two years: the fourth woman, the one who didn't show up on the day of the escape, arrives in town. She got out early for good behavior and remembered the destination they had all agreed upon. Is she there to re-connect with the women with whom she bonded in prison? Is she resentful that they abadoned her? Is she there to settle the score? The others, with everything to lose, including their freedom, walk on egg shells to figure out her agenda. Soon, fault lines appear, alliances shift and suspicions abound. This taut, psychological novel is filled with unforgettable characters whose fates and friendships are uncertain through the very end.",
  "genres": [],
  "author": "Marta Acosta",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/18656174-girls-are-gone"
}