{
  "title": "The Book of Good Practices Vol. I: Learning Mindfulness and Self-Awareness",
  "description": "The Book of Good Practices is a collection of the most powerful and effective methods, both modern and ancient, for learning the most fundamental and important human abilities, as verified by both traditional use and modern neurological and brain studies.We have tried to select information that will provide significant skills of use to virtually everyone and of assistance in nearly all activities, such as increased resilience and energy, improved concentration and memory, more happiness, clearer goals, and better communication.The Book of Good Practices helps provide you the means and methods to change your life as you see fit by using these techniques to help you determine what you want to change, and then create a plan of action to enable that change.In general, we have tried to avoid jargon derived from specific traditions and attempted to keep historical and background information to a minimum, while striving to provide clear behavioral instructions for developing specific, concrete skills. This is a book about how to do things. We have tried to make it as difficult as possible for you to reject the material in this book out of prejudice against one tradition or another. If we have been successful, you will see that the only way truly to evaluate the practices in this book is to try them for yourself.The EBook version of The Book of Good Practices is divided up into three volumes:Volume I: Learning Mindfulness and Self-AwarenessIntroductionAttention: Observances and AbstentionsRelaxation and StretchesMetabolism and FastingBreathingSense WithdrawalConcentrationAttention II – MindfulnessLoving Kindness and Compassion MeditationsAppendix I – Suggested Programs of StudyAppendix II –Additional ResourcesAbout the AuthorsVolume II: Neurological Skills for Well-Being and ExcellenceIntroductionChanging HabitsBeliefs and ValuesDecision Making and Goal SettingMaintaining and Improving Brain FunctionHemispheric ExercisesPeripheral VisionPain Control TechniquesLearning and Mnemonic TechniquesDreaming and Dream WorkAppendix I – Suggested Programs of StudyAppendix II –Additional ResourcesAbout the AuthorsVolume III: How to Empower Yourself and Influence OthersIntroductionSensory ProcessingAnchoringTrance and Trance Induction MethodsSensory Processing II – Sensory Sub-ModalitiesSensory Processing III – Sensory ImaginationSensory Processing IV – The Classical Elements and Subtle EnergyLanguage Patterns: Clear Thinking, Communication, and TranceSensory AcuityPacing and RapportPatterns for ChangeAppendix I – Suggested Programs of StudyAppendix II –Additional ResourcesAbout the AuthorsThe print version of The Book of Good Practices (available sometime in 2014) will be arranged with the chapters in a slightly different order and will be contained all in one volume.",
  "genres": [],
  "author": "Bill Whitcomb",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/18656935-the-book-of-good-practices-vol-i"
}