{
  "title": "Perfect Kind of Trouble",
  "description": "Sometimes when perfect falls apart, a little trouble fixes everything . . . Twenty-one-year-old Kayla Turner has lost everything. After spending most of her life taking care of her ailing mother, she just wants to spot a glimmer of light at the end of the tunnel. So when her late father-a man she barely knew-leaves her an inheritance, she finally breathes a sigh of relief . . . until she learns the inheritance comes with strings. Strings in the form of handsome playboy Daren Ackwood, her father's protage. To see any of her inheritance, she's forced to team up with him. From his expensive car to those sexy dimples, Kayla's seen his type before. But Daren isn't who he seems to be . . . Struggling to make amends for his family's mistakes, Daren has a life more Oliver Twist than Richie Rich these days. He's beyond grateful that James Turner included him in his will, but working with Turner's princess of a daughter to fulfill his cryptic last wish is making Daren wonder if being broke is really so bad. Still, she's just as beautiful as she is stubborn, and the more time he spends with Kayla, the less it feels right being without her. Soon Daren and Kayla begin to wonder if maybe the best gift Kayla's dad could have left them . . . was each other. Praise for Best Kind of \"By turns humorous and heartbreaking, Best Kind Of Broken has become one of my favorites!\" -- Cora Carmack, New York Times bestselling author \"You'll fall for Pixie and Levi, just like I did!\" -- Jennifer L. Armentrout (J. Lynn), #1 New York Times bestselling author \"Tangled with friendship, history and heartbreak - not to mention a huge dose of humor - Chelsea Fine's New Adult novel is not to be missed! Beyond an incredibly HOT read, Pixie and Levi's longing for each other will have you rooting for them till the very end.\" -- Jay Crownover, New York Times bestselling author \"Chelsea Fine's style is witty, visceral and fresh. All I wanted to do was crawl inside this book and live with the characters. \" -- Chelsea M. Cameron, New York Times bestselling author",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Chick Lit",
    "Adult",
    "Humor"
  ],
  "author": "Chelsea Fine",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18656446-perfect-kind-of-trouble"
}