{
  "title": "Homespun Christmas",
  "description": "I truly enjoyed working on this book. It enabled me to focus on my passion for knitting and crocheting, and come up with the perfect Christmas story!Myka Solis loved Independence, New Mexico, but their town was dying and there seemed to be no way of reversing that slide. The auto parts plant had closed its doors and now Independence needed a miracle. In the midst of this chaos, Joshua Nez, the town's former bad boy, returns. The handsome Navajo architect has returned to bury his father. Myka and Josh had grown up next door to each other - but worlds apart. She was as much a part of Independence as the Fall Crafts Festival with complimentary hay rides. He was the outsider - the one whose dreams were destined to lead him away. Although he's fallen on hard times, and his architectural firm was forced to close its doors, Josh's confidence is unshakable. He knows he'll be back on top of the world again - but while he's back home he wants to help the girl - now a woman - who was always out of reach - his one lost love. Both have had their dreams shattered by forces greater than them. Josh not only lost his company, he lost his father. Myka's loss was equally tragic, her husband was killed in an accident just footsteps away from where she worked. Now they need to find the courage to try again - for themselves and their town. Using Myka's circle of crafts people and Josh's experience as a businessman, they work together to give Independence a fighting chance. Their town is filled with talented people, those skilled in the Rio Grande arts and traditions of the Southwest, like weaving, spinning, and woodcrafts. Yet roadblocks await around every bend - a missing will from a dead benefactor means the loss of vital rail service to their community, and an unexpected shortage of unprocessed wool - their company's life's blood - poses an even bigger danger to their fledgling company. Working together to surmount whatever stands in their way, the two give Independence new life. Yet although Myka's damaged heart finds comfort in Joshua's steadfast presence, she knows that Joshua will eventually have to leave, and she may never recover from this final blow. Joshua's feelings for Myka run deep, but to pursue his own dreams he knows he'll eventually have to forsake their small town. They're totally wrong for each other. He wants the brass ring - that measure of success that brings respect and always eluded his hard working father, a janitor at the auto plant. She wants a quiet, ordinary life in the town she loves. As Handmade in Independence - their fledgling company - slowly brings the town back from extinction, ambition and lost dreams collide. Homespun Christmas is a terrific story about the will to succeed, even when the odds are against you.",
  "genres": [
    "Christmas"
  ],
  "author": "Aimée Thurlo",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/18657001-homespun-christmas"
}