{
  "title": "Trailer Park Princess",
  "description": "!!!!!!! Make sure if you bought this before 12/27/13, UPDATE IT! New Edited Version available!!!!!! Book One of The Switching Tracks SeriesRory is a simple girl in a simple world. It wouldn’t take much to make her happy, but that’s a goal she gave up on long ago. Now her only goal is to simply, survive. Rory used to count down the days until she could leave, but now with a younger brother in tow, it would be hard she could never leave him. Rory is trapped in the Trailer Park like a princess in her tower, with her mother playing the big bad drunken fire breathing dragon. The dream of her knight coming to save her faded away about the same time her goals changed. Feeling useless and angry Rory starts her new school and gets trampled by none other than Monroe Falls Golden Boy Tobias West. She finds herself seeing him as the knight she dreamed of, though she believes it to be just that, a dream. Tobias (Toby) is Mr. Popular/ Mr. Perfect/ Mr. Money in the bank. He is too high on the social ladder to step down to her level. Or was he? Toby was smitten with Rory. Toby’s ex, Ashley refuses to lose out to trailer park trash, and Rory finds herself the fuel to Ashley’s new found hate. On top of Monroe Falls High School drama, Rory still has to deal with her drunken mother and needy brother. She doesn’t have time for childish games. Reality hits Rory hard when her mother brings home a ticking time bomb for a bed mate and the need for that shiny knight becomes real. Rome appears like she conjured him up out of thin air with magical powers, and instantly becomes her best friend. He seems to always be around when she needs someone to talk to and seems to always know just how to fix it. (Did I mention he is drop dead beautiful?) Two knights in shining armor? Nope!! That doesn’t happen, not in fairy tales, and definitely not in real life. Rory finds herself realizing there is a thin line between relationships and friendships lines that are starting to blur. Toby is getting ready to leave for college, Ashley’s nonstop meanness, and Rome showing up can Rory handle the pressure? Her old friend reality takes another whack at her, causing her dread and despair to take over. Rory is questioning herself and its wrecking havoc on the strong girl she’s always considered herself to be. Has her poor choices doomed her to life in the trailer park or will she be able to exceed even her own expectations? Will she ever realize she is truly a princess worthy of getting her prince? Or will she simply survive? How does Rory’s story end?  This book is suited best for readers over the age of 17 due to sexual content and some language. As well as a few different types of abuse that is rarely talked about. (Verbal, Mental, and to some extent sexual and psychical)http://www.amazon.com/Trailer-Park-Pr...",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary Romance",
    "Abuse",
    "New Adult",
    "High School",
    "Young Adult Romance"
  ],
  "author": "Delia Steele",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/18660357-trailer-park-princess"
}