{
  "title": "Womb Wisdom: Awakening the Creative and Forgotten Powers of the Feminine",
  "description": "Tools to awaken the creative powers of the womb• Contains exercises to open the womb’s energetic pathways, release toxic emotions, and harness creative potential• Reveals how the womb’s energies are crucial for the spiritual shift of 2012: birthing a new civilization• Shows how the awakened womb can also bring about male spiritual transformation• Includes 45-minute CD to help awaken creative energiesIn the past and in present-day indigenous traditions, women have known that the womb houses the greatest power a woman possesses: the power to create on all levels. Utilized in the process of giving birth, this power of creation can also be tapped in the birth of projects, careers, personal healing, spirituality, and relationships. However, because the womb stores the energetic imprint of every intimate encounter--loving or not--the creative voice of the womb is often muffled or absent altogether, affecting the emotional, mental, and spiritual health of women and their relationships.Drawing on sacred traditions from ancient India, Tibet, Egypt, Gnostic Christianity, and Judaism, the practice of Womb Wisdom empowers women to become aware of the intuitive voice of the womb outside of pregnancy and the moon cycle to unlock this potent inner source for creativity, birthing the new conscious children, spiritual growth, and transformation not only for themselves but also for their male partners. The authors include exercises to clear the past, release toxic emotions, open the womb’s energetic pathways, activate the sacred sensual self, bring balance to relationships, and harness creative potential. Including intimate, individual stories of women experiencing the opening of the womb, this book also explores the forgotten sacred sites of the womb around the world as well as how the womb’s energies are crucial to birth a new civilization in the spiritual shift of 2012. The accompanying 45-minute CD includes a soundscape to assist in the awakening of these creative forces.",
  "genres": [
    "Spirituality",
    "Nonfiction",
    "Health"
  ],
  "author": "Anaiya Sophia",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/10114311-womb-wisdom"
}