{
  "title": "Revealed: The Missing Years",
  "description": "From New York Times and USA Today bestselling author Aleatha Romig, comes the suspenseful thrilling conclusion of a powerful series about secrets and deception, passion and love, and choices and consequences. The third companion, BEHIND HIS EYES CONVICTED, became the unexpected fourth novel of the Consequences Series,  The Missing Years is...\"The captivating missing piece that completes one of the most intricate, enthralling, andsuspenseful stories I've ever read.\"  - Vilma's Book Blog Readers saw what happened on that fateful afternoon at the Rawlings Estate and heard about the aftermath. This fourth novel of the series is told through the men in Claire Nichols' life and fills in the gap of time that was only previously mentioned. Like dominoes falling in a line, REVEALED allows readers to experience the shocking repercussions one by one, and witness their effect on everyone in the game.  Share the struggle as Anthony Rawlings fights for what is his, as the crashing consequences of his past threatens to change his world forever. Join Harrison Baldwin as he discovers the truth that threatens his beliefs, and John Vandersol as he come to terms with his revelations. Witness as Phillip Roach decides with whom his loyalties lie, and Brent Simmons demonstrates the meaning of friendship--no matter the cost. Readers of this series survived the Consequences, learned the Truth, and know who wasConvicted. Is that all?\"Hell to the NO!  The Missing Years fills in more blanks than you could haveimagined.\"-  Schmexy Girl Book BlogDo not assume that Tony and Claire's story is complete, because beyond the conclusion of Convicted there is more to be REVEALED!**This novel has been retitled. You can find Behind His Eyes Convicted now titled REVEALED. It is the same story. New cover and title. Not a word of the story was changed.",
  "genres": [
    "Romance",
    "Dark",
    "Dark Romance",
    "Suspense",
    "Contemporary Romance",
    "Contemporary",
    "Adult"
  ],
  "author": "Aleatha Romig",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/18660520-revealed"
}