{
  "title": "Anatomy of a Ponzi: Scams Past and Present",
  "description": "Is Your Money Safe?  Many investors faced financial ruin after investing in Ponzi Schemes with Madoff, Stanford and Wall Street crooks, often unknowingly through complex feeder fund arrangements. You may be invested in one of these Ponzi schemes through your mutual fund, pension or retirement funds, yet not even know it.Most of the all-time 10 biggest Ponzi schemes collapsed during the 2008 financial crisis, but the worst is yet to come. Experienced investors and industry professionals alike will be caught in the carnage. Today's volatile financial markets and uncertain political climate are exactly the right conditions for a Ponzi scheme collapse, and unwitting investors will be left holding the bag. But there is a way to avoid disaster--if you know what to look for. Learn how to spot Ponzi scheme red flags and keep your money safe. Many innocent victims suffered financial ruin by not knowing the warning signs until it was too late. Don't be a victim.You'll learn the tricks Bernard Madoff, Scott Rothstein, and others used to defraud investors for years, and the mistakes that ultimately exposed them. Get Anatomy of a Ponzi today and keep your investments safe! What is a Ponzi Scheme? Read Anatomy of a Ponzi Scheme and discover real-life Ponzi scheme examples including Charles Ponzi, Bernie Madoff, Scott Rothstein and others. You can learn how to invest in stocks,investment funds, real estate and other assets, but you won't be successful unless you also learn how to spot fraud. Colleen Cross also writes mystery thrillers. Her two bestseller series are financial and legal thrillers and cozy mysteries that will keep you guessing and turning pages. Find out more at www.colleencross.com and sign up for her twice-yearly newsletter to get the latest on her new releases.",
  "genres": [
    "Nonfiction",
    "Finance",
    "Business",
    "True Crime",
    "History",
    "Crime",
    "Audiobook"
  ],
  "author": "Colleen Cross",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/18660642-anatomy-of-a-ponzi"
}