{
  "title": "Behind His Eyes: Truth",
  "description": "CONSEQUENCES SERIES READING COMPANION:Book # 2.5 of the Consequences series: From New York Times and USA Today bestselling author Aleatha Romig comes the much-anticipated second companion to the suspenseful thriller about secrets and deception, passion and love, and choices and consequences.Truth is relative.By delivering the consequences, Anthony has proven he is a man of his word. With one promise complete, he must face the truth of his emotions regarding Claire Nichols. Is it too late? Can a man who had never been forgiven accept forgiveness? Can that man forgive? Not a total re-write, this companion explores the thoughts of the man who discovers that the truth is not always what it seems. Secrets exposed.As past sins and motivations are revealed, Behind His Eyes Truth explores the recurring questions: What was Tony thinking? Who can he trust? Through significant scenes and behind-the-scenes moments, learn how Tony’s well-designed existence is incomplete. The acquisition of a soul. Experience the journey into the mind of the man who slowly realizes that there is more to life than money and power. Witness his thoughts as his control is not only challenged but lost, and as he comes to terms with the new truth.  For the avid reader of the Consequences series, it is recommended that this companion be read after Consequences, Truth, Convicted, Revealed, and Behind His Eyes Consequences. Behind His Eyes Truth, for more insight into the man who: “Once upon a time, signed a napkin that he knew was a contract. As an esteemed businessman, he forgot one very important rule. He forgot to read the fine print. It wasn’t an acquisition to own another person as he’d previously assumed. It was an agreement to acquire a soul.”—Aleatha Romig, CONVICTED",
  "genres": [
    "Romance",
    "Dark",
    "Dark Romance",
    "Erotica",
    "Contemporary",
    "Adult",
    "Suspense"
  ],
  "author": "Aleatha Romig",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/18660519-behind-his-eyes"
}