{
  "title": "The Storms That Fated Us",
  "description": "As Tia Deltoro’s 23rd birthday approaches, she looks forward to meeting up with her old high school friends and hitting the ski slopes. What was supposed to be a relaxing weekend getaway ̶ staying in a beautiful cottage overlooking the mountains ̶ turns out to be a hellish nightmare when Tia unmistakably recognizes the person delivering their firewood. It has been five years since Tia graduated from New Holston High, yet she remains emotionally shackled to her past, or more specifically ex-best friend Carson Rodriguez, the man holding the bundle of firewood. When he accuses Tia for setting up their chance meeting she fires back running him off. Unfortunately for these two former friends, Mother Nature decides to show them an intervention they’ll never forget! The drastic shift in weather conditions causes Carson to return and wait out the horrific weather conditions in the confinements of the cottage with Tia.While the storm rages outside, the two distance themselves to opposite sides of the living room for their own protection. Tia keeps herself distracted by looking at the old high school yearbooks that were packed in preparation for planning the upcoming reunion. Through a series of flashbacks, the memories come flooding back. She can't help but wonder how things could have gone differently if her ex-boyfriend Evan didn’t always lure her back into his corrupting grasp or Carson’s on-again-off-again girlfriend Erin hadn't been so conniving. In the end all of the jealousy, secrets, and lies ultimately severed the ties that held their four year friendship together. With the strong winds from this blizzard of mass destruction leveling their only means of shelter one window and roof tile at a time, only one question remains ̶ will Tia and Carson be able to put aside their anger towards each other long enough to survive another storm?",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance"
  ],
  "author": "JP Summers",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/18664259-the-storms-that-fated-us"
}