{
  "title": "Messages From The Ancient Ones: Year Three",
  "description": "Welcome to a Remarkable Collection of Timeless Wisdom in this published collection of the third full year of public communications from The Ancient Ones. Introducing, The Ancient Ones: “We are eternal beings of non-physical form. We make up a group of three, forming a council, for the guidance of Mankind, back to their original design as men and women. Our purpose is to assist everyone who is interested to develop their divine inner guidance, to direct themselves toward a humanity that is once again sacred and connected as One, in true camaraderie.” These masters share transformative truths about: - Self Mastery; - Prosperity; - Health and Energy; - Creativity; - Life Purpose “Wake up from the slumber that this ego-dominated world has put you in. Take charge of your life, and participate with humanity to overthrow the prison of your mind. Become an activist for a future where life is celebrated, real love is shared, and individuality is encouraged within the entirety of the whole. True expression is found within your heart. Open wide.” – The Ancient Ones Book Sections: Preface Introduction: The Ancient Ones The Messages: 1 - Cooperation 2 - Assurance 3 - Persistence 4 - Community 5 - Inner Guidance 6 - Accord 7 - Collaboration 8 - Responsibility 9 - Example 10 - Intention 11 - Unconditional Love 12 - Your Life’s Garden 13 - Empathy 14 - Discernment 15 - Equivalence 16 - Mystical Mind 17 - Signs of Nature 18 - Help or Harm? 19 - Back to Nature 20 - Abundance 21 - Ideas 22 - Reincarnation 23 - Activation of Blueprint 24 - Create a Better Life 25 - Make Your Voice Heard 26 - Love or Fear 27 - Change 28 - Everything is Good 29 - What Are You Afraid Of? 30 - Mature Wisdom 31 - Harvesting 32 - Where Are You Creating From? 33 - Manifestation 34 - Creatorship 35 - Be Fertile Soil 36 - Positive Emotion 37 - Character 38 - Divine Expression 39 - Agreement 40 - Sociality 41 - Honesty 42 - Time 43 - True Power 44 - Activism 45 - Peace 46 - Play 47 - Connection 48 - Praise 49 - Experiential Living 50 - In Love 51 - Well-being Afterword by The Ancient Ones This book contains the foundational wisdom to create a life of direction, purpose and meaning. It is my honor to share these messages with you. Stacey Stephens Author",
  "genres": [],
  "author": "Stacey Stephens",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18664177-messages-from-the-ancient-ones"
}