{
  "title": "A Gentleman's Game",
  "description": "Tara Chace may be the most dangerous woman alive. She can seduce you into believing she’s the woman of your dreams—or kill you with the icy efficiency of an executioner. As the new head of Special Operations for British Intelligence, she no longer has to court death in the field—she wants to.Throw away the old rules, the old school, the old-boy network. The world of international espionage is about to learn the hard way that spying is no longer merely…A Gentleman's GameGreg Rucka’s electrifying thrillers have pushed the boundaries of suspense fiction to where few have dared to go. Now, in A Gentleman’s Game , one of the genre’s most fearless writers brings readers of international espionage his mostfearless heroine a no-holds-barred woman who’s as lethal as an assassin’s bullet.When an unthinkable act of terror devastates London, nothing will stop Tara Chace from hunting down those responsible. Her job is stop the terrorists before they strike a second time. To succeed, she’ll do anything and everything it takes. She’ll have to kill again.Only this time the personal stakes will be higher than ever before. For the terrorist counterstrike will require that Tara allow herself to be used as bait by the government she serves. This time she’s turning her very life into a weapon that can be used only once. But as she and her former mentor race toward destiny at a remote terrorist training camp in Saudi Arabia, Tara begins to question just who’s pulling the trigger—and who’s the real enemy. In this new kind of war, betrayal can take any form...including one’s duty to queen and country.Based on the graphic novel series that won the coveted Eisner Award, A Gentleman’s Game is an electrifyingly realistic, headline-stealing thriller with an unforgettable protagonist—one who redefines every rule she doesn’t shatter.",
  "genres": [
    "Fiction",
    "Thriller",
    "Espionage",
    "Mystery",
    "Suspense",
    "Mystery Thriller",
    "Action"
  ],
  "author": "Greg Rucka",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/110135.A_Gentleman_s_Game"
}