{
  "title": "#Girlboss",
  "description": "‘In the New York Times bestseller that the Washington Post called \"Lean In for misfits,\" Sophia Amoruso shares how she went from dumpster diving to founding one of the fastest-growing retailers in the world. Sophia Amoruso spent her teens hitchhiking, committing petty theft, and scrounging in dumpsters for leftover bagels. By age twenty-two she had dropped out of school, and was broke, directionless, and checking IDs in the lobby of an art school— a job she’d taken for the health insurance. It was in that lobby that Sophia decided to start selling vintage clothes on eBay. Flash forward ten years to today, and she’s the founder and executive chairman of Nasty Gal, a $250-million-plus fashion retailer with more than four hundred employees. Sophia was never a typical CEO, or a typical anything, and she’s written #GIRLBOSS for other girls like her: outsiders (and insiders) seeking a unique path to success, even when that path is windy as all hell and lined with naysayers. #GIRLBOSS proves that being successful isn’t about where you went to college or how popular you were in high school. It’s about trusting your instincts and following your gut; knowing which rules to follow and which to break; when to button up and when to let your freak flag fly.' to 'In the New York Times bestseller that the Washington Post called \"Lean In for misfits,\" Sophia Amoruso shares how she went from dumpster diving to founding one of the fastest-growing retailers in the world Sophia Amoruso spent her teens hitchhiking, committing petty theft, and scrounging in dumpsters for leftover bagels. By age twenty-two she had dropped out of school, and was broke, directionless, and checking IDs in the lobby of an art school—a job she’d taken for the health insurance. It was in that lobby that Sophia decided to start selling vintage clothes on eBay. Flash forward ten years to today, and she’s the founder and executive chairman of Nasty Gal, a $250-million-plus fashion retailer with more than four hundred employees. Sophia was never a typical CEO, or a typical anything, and she’s written #GIRLBOSS for other girls like her: outsiders (and insiders) seeking a unique path to success, even when that path is windy as all hell and lined with naysayers. #GIRLBOSS proves that being successful isn’t about where you went to college or how popular you were in high school. It’s about trusting your instincts and following your gut; knowing which rules to follow and which to break; when to button up and when to let your freak flag fly.'",
  "genres": [
    "Nonfiction",
    "Business",
    "Memoir",
    "Feminism",
    "Self Help",
    "Biography",
    "Audiobook"
  ],
  "author": "Sophia Amoruso",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/18667945-girlboss"
}