{
  "title": "A Troublesome Inheritance: Genes, Race and Human History",
  "description": "Drawing on startling new evidence from the human genome, an explosive new account of the genetic basis of race and its role in the human story Fewer ideas have been more toxic or harmful than the idea of the biological reality of race, and with it the idea that humans of different races are biologically different from one another. For this understandable reason, the idea has been banished from polite academic conversation. Arguing that race is more than just a social construct can get a scholar run out of town, or at least off campus, on a rail. Human evolution, the consensus view insists, ended in prehistory. Inconveniently, as Nicholas Wade argues in A Troublesome Inheritance, the consensus view cannot be right. And in fact, we know that populations have changed in the past few thousand years—to be lactose tolerant, for example, and to survive at high altitudes. Race is not a bright-line distinction; by definition it means that the more human populations are kept apart, the more they evolve their own distinct traits under the selective pressure known as Darwinian evolution. For many thousands of years, most human populations stayed where they were and grew distinct, not just in outward appearance but in deeper senses as well. Wade, the longtime journalist covering genetic advances for The New York Times, draws widely on the work of scientists who have made crucial breakthroughs in establishing the reality of recent human evolution. The most provocative claims in this book involve the genetic basis of human social habits. What we might call middle-class social traits—thrift, docility, nonviolence—have been slowly but surely inculcated genetically within agrarian societies, Wade argues. These “values” obviously had a strong cultural component, but Wade points to evidence that agrarian societies evolved away from hunter-gatherer societies in some crucial respects. Also controversial are his findings regarding the genetic basis of traits we associate with intelligence, such as literacy and numeracy, in certain ethnic populations, including the Chinese and Ashkenazi Jews. Wade believes deeply in the fundamental equality of all human peoples. He also believes that science is best served by pursuing the truth without fear, and if his mission to arrive at a coherent summa of what the new genetic science does and does not tell us about race and human history leads straight into a minefield, then so be it. This will not be the last word on the subject, but it will begin a powerful and overdue conversation.",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Evolution",
    "Anthropology",
    "Biology",
    "Genetics"
  ],
  "author": "Nicholas Wade",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/18667960-a-troublesome-inheritance"
}