{
  "title": "The Greatship",
  "description": "Since the beginning of the universe, the giant starship wandered the emptiest reaches of space, without crew or course, much less any clear purpose. But humans found the relic outside the Milky Way, and after taking possession, they named their prize the Great Ship and embarked on a bold voyage through the galaxy’s civilized hearts.Larger than worlds, the Great Ship is laced with caverns and oceans, scenes of exalted beauty and corners where no creature has ever stood. Habitats can be created for every intelligent species, provided that the passengers can pay for the honor of a berth, and the human captains make the rules and dispense the justice in what soon becomes thousands of alien species joined a wild, unpredictable journey.The first Great Ship story was \"The Remoras\", published in 1994 by THE MAGAZINE OF FANTASY AND SCIENCE FICTION. All but the most recent titles in the series have been included in this volume, arranged in a rough chronological order, each story partly rewritten to capture the author’s growing expertise in the starship. New material has been added to bridge the centuries, hopefully enriching the resident confusion.Robert Reed is the author of a dozen science fiction novels, including two titles about the Great Ship: MARROW and THE WELL OF STARS, both from Tor Books. He has also published more than two hundred shorter works, winning a Hugo in 2007 for his novella, \"A Billion Eves\". Reed is a long-term resident of Lincoln, Nebraska.Contents:Alone (2010)Hoop-of-Benzene (2006)Mere (2004)The Remoras (1994)Rococo (2006)River of the Queen (2004)Night of Time (2003)Aeon's Child (1995)The Caldera of Good Fortune (2007)Camouflage (2005)The Man with the Golden Balloon (2008)Hatch (2007)",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Space Opera",
    "Short Stories",
    "Collections",
    "Novels"
  ],
  "author": "Robert Reed",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/18668102-the-greatship"
}