{
  "title": "Blue Collar Conservatives: Recommitting to an America That Works",
  "description": "“In the summer of 2014, Trump asked me to stop by his office the next time I was in Manhattan... When we walked into his office, he was sitting behind his desk holding a copy of my book Blue Collar Conservatives that I had published that spring. The first thing he said was, 'I read your book.'I laughed. 'The hell you read my book.'Trump shot back, 'I did; it was great!'So I quizzed him on the message in my book – that the great middle of America was hollowing out as a result of big-government policies that were helping the elites but leaving blue-collar families behind. And to my great surprise, Trump passed my test with flying colors.We discussed the problems facing Middle America – specifically the implications of unfettered globalization on American manufacturing and its effect on wages for blue-collar families.The real estate mogul not only got it, he was as upset as I was that these families were being left behind. He said he might run for president and, if he did, he wanted to take that message to the American voter – and did he ever.”—Rick Santorum, The Philadelphia Inquirer“This is a serious book… [Rick Santorum] has seen ghost towns (including some in his home state) where trade policies, in his opinion, have hurt more than helped the economy. Therein lies a big part of Mr. Santorum’s recipe for GOP Campaigns should emphasize jobs and the needs of the employee…”— The Washington Times\"In Blue Collar Recommitting to an America That Works , Santorum urges the Republican Party to refocus on working Americans.”— U.S. News & World ReportBefore Donald Trump successfully mobilized millions of blue collar Americans with his campaign to reclaim America, Rick Santorum was trying to convince his fellow Republicans that it was time to return to the party’s original the values of “blue collar conservatives.”In this powerful book that helped inspire President-Elect Trump’s winning message to voters, Santorum calls out Republican establishment leaders for pandering to business owners at the expense of everyone else. Republicans need to regain the trust of the hard-working members of every family, church, and community across America whose most immediate problems are lack of jobs and opportunity. No more pandering. No more ignoring those left behind by globalization. No more broken promises to the frustrated middle class.We're entering a brand new era of conservative politics—and Rick Santorum's Blue Collar Conservatives shows us the way forward.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Social Issues",
    "Economics"
  ],
  "author": "Rick Santorum",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/18668154-blue-collar-conservatives"
}