{
  "title": "Sector Seven",
  "description": "ASIN B00EL3ZFCK moved to the most recent edition hereIn 1998 after a group a cyber terrorists known as \"Fredrik's Army\" used a massive network of hijacked servers to take down the United States' \"unbreakable\" encryption codes and after Al-Qaeda's numerous terrorism attacks all over the world, the United Nations formed a secret seventh sector to make sure that terrorists threats that slipped through the cracks of intelligence agencies would be neutralized before they came to fruition. At the same time scientists from all over the world began understanding how to accelerate the brain's processes. These new discoveries provide a unique but dangerous opportunity. Find young orphaned or abandoned children and subject them to the new learning techniques in order to create super soldiers who can solve problems the rest of the world can't. In 2000 to help prevent more cyber attacks from occurring, the United States unleashes The Barrier Code, a massive encryption that not only morphs into other encryptions but also is able to track and eliminate any attacks that it finds. This moment is the first time in history that acountry implements artificial intelligence as a weapon to defend terrorism. Instead of becoming his father's protege, Peter Fredrik has spent that last three years in hiding on the streets of Toronto, waiting for a chance to avenge his father's death at the hands of the US government. Suddenly someone is interested in his services, but for what reason? Fourteen year old, Zachary Johnson has woken up in a hospital bed, his body is covered in third degree burns. He is notified that his family is dead...from shotgun blasts and a slit throat. He then notices the police officer standing in the entrance to his room. He is notified that he is under investigation for their deaths. David Skiles has spent years rotting away in solitary confinement, he feels The Faction has left him to die alone. Then his fate swerves in a new direction, The Faction is requesting him again, but for a reason he cannot understand. Sector Seven is a story of multiple journeys being weaved into a single fate that will alter the political universe, and the reemergence of a brotherhood that threatens the very fabric of society.",
  "genres": [],
  "author": "Matthew Spychala",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/18667324-sector-seven"
}