{
  "title": "Josh & Hannah",
  "description": "New Adult 92K words / suitable for 18+AN ALPHA-MALE IN THE MAKINGJosh Turner wants Hannah more than life itself. She's perfect and new . . . but she's a McIntyre. She's from the richest family in the county, and he's a Turner, from the wrong side of the proverbial tracks. And to make matters worse, there's no love lost between their families. EXCERPT: Hannah tried to stay away from the fence that separated the McIntyre and Turner lands. But every afternoon, she took the four-wheeler and drove the fence line. She did this for days and never saw anyone. And then on Friday, she hit pay dirt. Josh was working twenty feet over the fence line.He glanced up and nerves tightened in her belly as he approached. He stood on the opposite side of the barbed wire, his eyes running over her. His words were short. “I’m thinking this can’t be a coincidence, princess.” She stayed silent too long as she tried to think of a response that wouldn’t completely humiliate her and he remonstrated, “I kind of had the idea I’d already made myself plain. Maybe you didn’t understand?” His words were low and she heard the controlled anger.\t“I’m sorry,” she apologized.Josh stared at her, and then in a rush of movement, his booted foot stepped on the second rung of barbed-wire and forced it down as he simultaneously pulled up the third rung, and that easily, in a move that ranchers had been using for decades, he bent down and slid unscathed through the treacherous wire.He pulled his gloves off, cut the engine and stood over her. He was so close she could smell the delicious aroma from the sweat that drenched his shirt.Her eyes started to slip closed in an agony of arousal. They flew open when his fingers landed on her chin. His nostrils flared.“Hannah baby, we have to get this straight between us. Maybe I should have spelled it out better. I've told you about my father. He’s always drunk. He’s in and out of jail--all the time. The sheriff watches me like a hawk because he thinks I’m just like him.” He caressed her gently in direct contrast to the fierceness of his voice. “Now what do you think the sheriff would do if I suddenly took up with the fifteen-year-old town princess?” He gave her a moment to digest his words. “You need to stay away from me. Don’t make this harder on me than it already is. You don’t know what it’s doing to me--knowing I can have you, but I can’t.” His fingers became caressing. “You understand?” His eyes tangled with hers until an agonized look crossed his features and he bit out, “Repeat after me, princess. Josh wants me.”Shock hit her system and she gasped. His fingers slipped into her hair. “I’m serious. Repeat it. Josh wants me.”“Josh, please—““Now!” he barked and she jumped.“Josh w-wants me.” “Josh wants me so bad his guts are tied in knots of constant pain,” he pounded the words. His eyes seared into hers and she tried to answer. “Josh wants me s-so bad--\" It was impossible and her words died.His fingers twisted through her hair. He continued to punch out his words in third person. “He thinks about me constantly.” His gaze ran over her lips. “He lives from one hour to the next for the day he can sink into me.”Hannah was lacerated by his words. At the same time, pleasure infiltrated her system. He was telling her the truth.He continued in a biting tone, “But I don’t want Josh to go to prison.”She trembled. “Say it,” he bit out.A single tear escaped. “Say it,” he growled, even as his thumb shot out and wiped it away.Hannah took a breath. “I d-don’t want Josh to go to p-prison.”His hands lifted and he took a step back.“Good girl,\" he praised. \"Do us both a favor and remember that the next time you come looking for me. Repeat it to yourself if it helps. I’m serious, Hannah. You may feel grown-up, you may even know what you want, but the State of Texas doesn’t agree with you.” His tone softened. “You have to have mercy on me, princess. There’s only so much I can take before I’ll snap.\"",
  "genres": [
    "Romance",
    "New Adult",
    "High School",
    "Contemporary Romance",
    "Contemporary",
    "Young Adult",
    "College"
  ],
  "author": "Lynda Chance",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/18668290-josh-hannah"
}