{
  "title": "The Black Rainbow",
  "description": "In a tranquil, magical land filled with people who turn the colors of the rainbow at the age of five, a seventh child is born to the king and queen. After five years the young boy is ready to assume his true rainbow color, only to receive the shock of his young life. Every child in the Rainbow Kingdom follows a preordained path and order upon their fifth first children turn red; second children turn orange; and the siblings who follow turn, in order of birth, yellow, green, blue, indigo, and violet. The seventh child imparts upon a family the ability to create their own powerful and protective rainbow that is stronger than any other in the land. The newest prince, however, is not violet. He is black. Despite the queen’s proclamations that her son is harmless, the high council votes that to keep the kingdom safe they must sequester him in an isolated castle of his own, far away from his family and the kingdom. Heartbroken, his mother reminds the boy that she loves him unconditionally and to never forget that. Finally, thirteen years later, she is able to sneak away from the castle, past their guards, to see her son. She tells him that he is not alone, that there was once one other—a young girl born entirely white, a girl now known as the Lone-wolf Witch Rainbow. When it comes time that they must say goodbye, she reminds him again of her undying love for him, and what happens next is too extraordinary to believe… A story of courage and the power of unconditional love, Daniel Ekine’s debut is as exciting as it is esteem building. Pushing the limits of the imagination as he conjures a world of magic and love, Ekine examines the harmful effects of stereotypes and judging others by their looks rather than their hearts. Inspired by the idea that one atom of love is more powerful than one million atoms of hate, The Black Rainbow will teach children to embrace differences and that they have the power to choose how to change their world.",
  "genres": [],
  "author": "Daniel Ekine",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18673695-the-black-rainbow"
}