{
  "title": "Ensam i Berlin",
  "description": "Året är 1940 och i huset på Jablonskistrasse 55 i Berlin bor en samling småskurkar, råbarkade SS-män, horor, en pensionerad domare och romanens huvudpersoner: verkmästarparet Otto och Anna Quangel. Här bor också en gammal ensam judisk dam, vars liv får ett fasansfullt slut.Otto och Anna är skötsamma och tystlåtna - ett strävsamt arbetarklasspar. Men när de nås av beskedet att deras son stupat i kriget ter sig livet plötsligt meningslöst. Så småningom inleder de en modig, om än patetisk, kamp mot nazismen som ger deras tillvaro ett nytt innehåll. På olika platser runtom i Berlin lägger de ut hundratals handtextade kort som manar till motstånd, kort som kan plockas upp av vem som helst.Den karriärhungrige kommissarie Escherich skyr inga ansträngningar för att hitta de skyldiga bakom de handskrivna lapparna och kommer paret allt närmare. Jakten utvecklas till en katt-och-råtta-lek som pågår under mer än två års tid med både komiska och skräckfyllda scener.HANS FALLADA föddes 1893. Trots censur och politisk förföljelse valde han att stanna i Tyskland under kriget och räknas numera som en av landets verkligt betydelsefulla 1900-talsförfattare. Han dog 1947, några månader innan Ensam i Berlin (Jeder stirbt für sich allein) publicerades. Berättelsen är baserad på Falladas egna erfarenheter under nazismen och skrevs på några få veckor hösten 1946.\"det är en enastående roman, skriven med den inlevelse och det patos som gör att en många gånger berättad historia - den om den tyska nazismens förtryck och brutalitet - får ny skärpa.\"Kaj Schueler, Svenska Dagbladet\"En gripande berättelse om civilkurage och moral, andlöst spännande som en thriller.\"Ingalill Mosander, Aftonbladet\"Primo Levi hävdade att Ensam i Berlin är det bästa som någonsin skrivits om det tyska motståndet och jag garanterar de otaliga läsare denna roman förtjänar, att det inte är någon överdrift.\"Ragnar Strömberg, Aftonbladet",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Germany",
    "War",
    "German Literature",
    "Classics",
    "World War II"
  ],
  "author": "Hans Fallada",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/18670686-ensam-i-berlin"
}