{
  "title": "Gilgamesh in the 21st Century: A Personal Quest to Understand Mortality",
  "description": "\"Must I die?\" asked Gilgamesh. Forty five centuries later, we're still asking the same question. Science writer Paul Bracken embarks on a lighthearted assessment of the human condition, to explore what it means to be mortal, and what our fate may be. This scientific reimagining of the ancient Gilgamesh quest delves into a multitude of topics including the origin of life, the workings of the human mind, and the possibilities for life prolongation.  The ancient Gilgamesh was so distraught at the death of his friend Enkidu, and so sickened by the knowledge that he too would die, that he rebelled against his fate and set out on a search for salvation. Likewise, at the age of eleven, Bracken wondered if there might be a way to bring his grandfather back from the dead and has been pondering this question ever since. Is death a problem to be solved, or is it an essential aspect of our humanity?\"We human beings instinctively resist the notion of personal extinction. In his thoughtful and hugely readable Gilgamesh in the 21st Century, Paul Bracken canters effortlessly through an amazing range of science to help put this fraught human proclivity in perspective, both for himself and for us.\" -- IAN TATTERSALL, American Museum of Natural History, New York City.\"In his Gilgamesh in the 21st Century Paul Bracken mixes ancient myth, modern science, and science fiction futurism on an intellectual quest to explore the meaning of human existence by confronting and challenging the inevitability of mortality. This is both a highly personal inquiry into the uniquely human knowledge of personal finitude and its implications for human psychology and culture, and a scientifically motivated investigation into the dreams and schemes to extend life. He even unsentimentally speculates about a future without human death and how these immortals might look back on our Age of Death. In his search for physical immortality we are given glimpses of innumerable ways that people confront this destiny and how some are attempting to understand the science of its relentless clockwork in hopes of outwitting it. In the end mortality stands unmoved, but we have a renewed appreciation of how this distinctly human knowledge and our ubiquitous antipathy to its inevitability have defined our humanity.\" -- Professor TERRENCE W. DEACON, Chair, Department of Anthropology, University of California, Berkeley.",
  "genres": [
    "Science",
    "Anthropology",
    "Nonfiction"
  ],
  "author": "Paul  Bracken",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/18674173-gilgamesh-in-the-21st-century"
}