{
  "title": "Trust Me",
  "description": "This is not your typical New Adult Romance and weighs on a darker and more erotic side to the New Adult genre. This book is intended for Adults 18 and over due to graphic scenes involving sex, language, rape, violence, drinking and drugs Full length novel with an HEA ending.Carrie Beckett knew fear. Pain, Anger, Terror…she also knew Trust.After escaping a fate that is worse than death Carrie and Noah settle in Gig Harbor with the taste of freedom on the tip of their tongues. Years of abuse so severe, left them both wounded, careful but stronger than life gave them credit for. They knew to trust one another above all things, promising then and there they would never look back...The summer before her final year at UW Carrie agrees to a date with her long time crush who happens to be her brother Noah’s best friend Chad Blake. The tattooed and sexy as sin front-man for rock band Thick as Thieves and the crowned King of Gig Harbor’s bad boys, Chad is a known for a good time, great music, killer tats and a sweet goodbye the morning after... as long as the girl knows the score. Everything he is, is everything Noah wants her far away from. Chad has wanted his best friends sister since she was eighteen but stayed away after Noah warned him that Carrie was off limits. Having been burned in the past, Chad focused on his day job as a tattoo artist and his dream of making it big with his band Thick as Thieves; keeping his bed warm until he had the chance to get Carrie Beckett there and never let her leave. Noah sheltered Carrie as best he could, keeping her as far from his personal life and Chad Blake as he could. He wanted nothing but happiness and freedom for the sister he watched suffer day in and day out.But Carrie is innocent and smart, strong willed with a sassy mouth, all the things Chad loves about her and refuses to deny himself of anymore.Risking it all on a whim, he shows up and asks Carrie to go “All In” and betray her brother for a chance to be together.Carrie is brought into the world of parties, concerts, fangirls and sex- that force her to face the memories of her past in order to move on with Chad as her future.Knowing that love is a reward, trust, a gift, Carrie and Chad fall with a passion so strong, it threatens to break them both. They will battle back all the bad things in life for just a second of good and all the insecurities will come to an explosive head that may just destroy them both",
  "genres": [
    "New Adult",
    "Romance",
    "Music",
    "Abuse",
    "Contemporary Romance",
    "Contemporary",
    "Dark"
  ],
  "author": "Melanie  Walker",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/18668296-trust-me"
}