{
  "title": "All Pure - Poems of Passion - A tribute to Omar Khayyam",
  "description": "\"All Pure\" is a book of fine structured verse. The author was inspired by Gerald Fitzgerald, the Englishman who was a scholar of Persian, and the great Sufi Saint, Philosopher, Mathematician, Omar Khayyam whose scattered quatrains were collected by Fitzgerald, translated into English and published in his immortal work \" The Rubiyyat of Omar Khayyam\". One day, without giving any conscious thought to writing poetry, the author suddenly sat down and wrote his first quatrain. And then there was a fountain within him which flowed and flowed and the result was this hauntingly beautiful original literary work in English. In this bouquet of verses the author has beautifully captured the ethos of middle eastern philosophy & mysticism, which is that very essence of life, which is invisible and often beyond the understanding of human intellect. It is the domain of the soul, beyond the tangible, 'ALL PURE' and 'ALL POTENT'. It is an ocean, into which the reader will be drawn to dive deep and discover treasures, enchanting beyond compare. One can not but quote a little of the editorial review written by Mark Sykes, Chief Editor of Minerva Press in 1999. These are very moving and sincere poems which would bring pleasure and a sharing of experience to the reader. They relate indeed structurally to the quatrains of the Rubaiyyat; but they are original, more so than Fitzgerald, who basically created an original work based on Khayyam; the work here under consideration goes several steps further. It is impossible to consider Khayyam without echoing some of the cadences of Fritz Gerald ,but here we have an original work that yet manages to achieve a similar mood. They are melodic, well-structured and essentially meaningful verses that make, in each quatrain, one emotional statement and makes it convincingly. The verse marches confidently and successfully across the page. The volume has a powerful unity; it has the strength to stand foursquare on its own feet despite its parentage. The poetry is suffused with a sense of what Gerard Manley Hopkins called \"the beauty of things \"; the poems fall into the readers consciousness like quiet jewels. There is a feeling of straightforward, shared experience that is meaningfully communicated to the reader and a deeply felt and effectively communicated spiritual dimension. We believe that Deepak Menon's verse should be brought to a wider global audience. While the audience for fine verse is selective, it is a considerable constituency, and one which is not too difficult to access through the many magazines throughout the English speaking world which are prepared to review new work and recommend it to their readerships. It has been very rewarding to encounter the work of Deepak Menon; when Minerva Press established its New Delhi branch, it was precisely in the hopes of attracting just this kind of quality writing. UNQUOTE This is a work of the highest literary quality and will be read and re-read for generations to come.",
  "genres": [],
  "author": "Deepak Menon",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18673598-all-pure---poems-of-passion---a-tribute-to-omar-khayyam"
}