{
  "title": "Dancing for the Devil: One Woman's Dramatic and Divine Rescue from the Sex Industry",
  "description": "An explosive memoir of transformation from a high-end stripper and escort who hit rock-bottom, turned to God, and left the sex trade to found Eve’s Angels, a ministry reaching out to women in the sex industry.Growing up as the daughter of an NCAA Championship-winning basketball coach and a stay-at-home mom, Anny Donewald had a seemingly blessed childhood. Then, at thirteen, one of her father’s players sexually abused her, and Donewald embarked on a path toward self-destruction.When Donewald was convinced to compete in an amateur night at a strip club, she found herself drawn into a world of drugs, money, and flesh peddlers in Michigan and Chicago—and eventually Las Vegas’ hottest XXX clubs. But the fantasy of fistfuls of hundred dollar bills quickly turned to the reality of bloodstains on bathroom floors and nights with customers in presidential suites at luxurious hotels. At an emotional breaking point and pondering the termination of her unborn son, Anny reached the gates of her personal hell. There, she found God.Then, this long-legged, fiery blonde fought to free herself from the sex trade, and, by the healing grace of God, launched her non-profit, Eve’s Angels, which reaches out to girls who want out of the sex trade.Dancing for the Devil takes an in-depth look at Anny’s struggles and sheds a new insider’s light on the horrible reality of the sex industry from someone who’s seen the worst of it. This captivating memoir shows how women from all walks of life find themselves trapped by the sex trade and, most importantly, explains how they can get out, start over, and find the love of Christ. Courageous and unforgettable, Dancing for the Devil is a heartbreaking story of darkness, grace, and, ultimately, redemption.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Christian",
    "Christianity",
    "Autobiography",
    "Biography",
    "Christian Non Fiction"
  ],
  "author": "Anny Donewald",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/18668459-dancing-for-the-devil"
}