{
  "title": "Holding On",
  "description": "This novel contains material that is not suitable for individuals under the age of 18. Content includes: drug use, explicit language, violence, rape, and other scenarios with content that readers may find offensive. Please use caution when deciding on this book, as every reader has the right to understand the product before purchase.This book is one of two and does not contain an exact HEA as the reader may expect, yet.“You are mine. You’ve been mine since you took those training wheels off that pink bike of yours and fell at my feet. Never even cried, you didn’t. Just sat on my lap trusting that I had you. Well I have you now, baby. You’re grown up, you’re a woman, and you’re mine. Mine.” That’s Shame. My brothers best friend and the Vice President of Lights of Peril MC. Along with my best friend Sadey, we’ve all grown up together. I don’t have a memory that isn’t surrounded by the four of us. Years together as friends and often times in the face of adversity has led Shame, Hem, Mace, and Sadey to share their lives together now as adults.Sadey and Mace have been best friends since they were five years old. As a child, teenager, and then young woman, Sadey longed for Hem to notice her. As years passed, she vowed to save all of herself for him with the hope that one day he would see her as the woman she was turning herself into, not just the child he remembers.Mace and Hem are siblings that grew up in a small town in the Midwest. Sharing the same mother, Mace’s father refuses to accept Hem as his own, leading him to a life similar to that of his biological father. Hem never set out to be President of the Lights of Peril Motorcycle Club, but when he left home at 17 to find the acceptance he was so desperate for, he ended up finding Doc. After Doc's passing Hem was determined to lead Peril into a clean existence. The story is about love, heartache, and tragedy. Sometimes we search our whole lives for something we think we are missing, only to find out what we had with us is what we were looking for all along.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "Abuse",
    "Dark",
    "Motorcycle"
  ],
  "author": "A.C. Bextor",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/18669246-holding-on"
}