{
  "title": "Restored Christianity",
  "description": "Restored Christianity, co-authored by a Christian counselor and an historian of early Christianity, integrates historical analysis with an in-depth examination of the current state of Christian belief toward restoring the earliest known, foundational beliefs of Christianity and applying those restored beliefs to contemporary life in order to bring healing to the aspects of today's church that can be detrimental to its members or may keep non-believers away. The authors don't shy away from controversy, challenging both the Church, and individual Christians and non-Christians, to evaluate currently held beliefs and embrace an intimate relationship with God. The authors confront current beliefs about such topics as the nature of God, the mysteries of God, the intention and use of the Bible, the meaning of faith, the sovereignty of God, our purpose, suffering, and the efficacy of prayer. The authors use Paul's letters for their evaluations, based on these documents standing as the earliest known Christian writings. According to the authors, \"It became apparent to us that historical knowledge is vital for understanding Christianity, both at the time of its conception as well as today. At the same time, we have witnessed how some of the present-day beliefs espoused by the Church have wounded its members, and given those individuals outside of the Church a negative impression of Christ's character. We wrote this book with the hope of planting a seed that could grow and blossom into a renewed understanding and experiencing of a deep, intimate relationship with Jesus Christ.\" The 2nd Edition adds 200 pages of information, including a new chapter devoted to prayer. It is like getting two books in one. According to William Houser, Ph.D., author of Who Is This Jesus Christ?, \"Restored Christianity may be likened to a purifying process, where the authors, like patient jewelers, heat and purify their material until all the dross has been removed and the simple precious metal remains. Of course, their project and scope is giant in size: finding the elemental core of the Holy Scriptures after separating out centuries of wrongful, if well-intentioned, interpretations which have reduced the pure and simple content of God's Word and Will. The authors work in tandem, one dealing with the linguistic and historic roots of the original Bible writings, and the other setting them in a context of Christian living for today. The effort works, and is gratifyingly successful in helping the earnest reader understand God's intentions, His plans and hopes, and greatest of all, His unconditional love for humankind represented forever by the incarnation and sacrifice of His own Son, Jesus Christ. This is not a Reformed work, or a Protestant work, or a Catholic work, this is a Christian work and is refreshingly focused on the Gospel basics that ignited the world when the Good News was first preached in its truest and most earnest forms to a desperate world.\" Dr. Colin Harris, Professor Emeritus of Religion, states, \"The serious reader...will be led on a theological and historical journey that will both inform and sharpen the perspective for participating in what I'm sure will be one of the major conversations of the twenty-first century. It is an excellent and systematic treatment of central areas of theological concern - a unique blending of rigorous historical/critical scholarship, careful and penetrating analysis of...theological themes and concepts, and creative application to contemporary human experience through a wholesome partnership of theology, philosophy, and psychology. A careful and attentive reader will be rewarded with a new window, or \"lens,\" through which to see and think about concepts that have been a part of religious life for a long time. A reader who has not been around church much will find a challengingly and refreshingly sensible presentation of Christian faith with an appeal not unlike C. S. Lewis' Mere Christ",
  "genres": [],
  "author": "Donna E. Lane",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/18673976-restored-christianity"
}