{
  "title": "When the Clock Strikes Thirteen",
  "description": "Seven lesbian paranormal short stories.Midnight Messages (Lois Cloarec Hart)Luce Sheppard can't ignore it any longer. She has to make a decision and time grows short. But refusing to make a decision is a decision, and she retires to bed, prepared to accept the results of her non-decision. That night an unexpected midnight visitor lands on her doorstep. Keira Keller, a distraught teenager, has lost her way home after a disastrous party. Luce steps in to help and in doing so receives answers to questions she didn't know she'd asked.Batteries Not Included (L.T. Smith)Alex Stevens is a workaholic and a loner. Nothing and nobody can get past the cool exterior and solitary walls she has painstakingly created.Until one night in October. One night that makes her step back and reassess what it means to be alive.Lost and Found (Emma Weimann)Laura Sullivan flees to her grandparents' old cottage to escape the haunting memories of finding her brother in bed with her girlfriend. But even in rural Ireland, tranquility is easier to find than peace--especially when she meets an otherworldly being that leaves her a reminder she didn't count on.Chrysalis (Joan Arling)Tara is a nice little girl. Her friends, on the other hand, are... peculiar... A breeze of a story. Or the other way 'round.Sisters of the Moon (Diane Marina)The week before Halloween, Nicole joins her friends on a local ghost tour. In addition to visiting spooky sights and haunted grounds, she meets an enticing woman who makes her spine tingle. Who is the mysterious stranger? And how will the encounter end?Wolf Moon (Erzabet Bishop)Seeking diversion from her job as a bookstore manager, Lindsay goes to a Halloween party at a convention center—and finds much more than she bargained for.Werewolf Detective Taggert responds to a bomb threat at the convention center. An explosive situation, especially when raw chemistry hits them full force.Can Lindsay open her heart and accept the fierce love of a red-hot shifter, or will they go their separate ways?Love Bites (R.G. Emanuelle)New Orleans. Vampires. Jodi goes to the former and finds the latter. She feels a mysterious pull that leads her to The Big Easy and to freedom, passion, and the startling revelation of what having too many daiquiris can make her do.",
  "genres": [
    "Fantasy",
    "Lesbian",
    "Horror",
    "LGBT",
    "Short Stories",
    "Anthologies",
    "Urban Fantasy"
  ],
  "author": "Astrid Ohletz",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/18681662-when-the-clock-strikes-thirteen"
}