{
  "title": "Vanished from Dust",
  "description": "A CHILL RUNS THROUGH HIS SKIN AS THE PHANTOM APPEARS.HE SEES THEM EVERYWHERE . . . Eric Stark is not insane. Or at least he doesn’t think so. He wishes everyone in Dust, Texas felt the same way. But that’s not going to happen since the whole town thinks he’s crazy. Why didn’t he keep his mouth shut? No one understands. Eric is alone as he battles his sanity in a town of tormenters. Suddenly a new friendship emerges after the new kid, Kyle Barrett, moves to town.Eric reluctantly reveals his secret. Is it a curse or a gift? He isn’t certain, but with Kyle by his side he finds the courage to seek the truth.They soon realize that something sinister is descending on the residents of Dust.Is it caused by Eric’s phantoms or is it something else? Is it connected to the mysterious death of hundreds of townspeople over sixty years ago? One thing is certain—only Eric and Kyle can save them.They set out on a heart-pounding adventure and find themselves transported to a disturbed and deserted version of their small southern town. They quickly discover that this new world has mysteries of its own to uncover. What they find could prove more than they bargained for, and it only leads to more questions. Eric and Kyle must face a horrifying fact—they may never get out alive.“We’re gonna die here,” Kyle muttered. “I don’t believe that,” Eric said. “And neither do you.” Will they survive their encounter with these dark and mysterious beings? Will they find a way back home? Or will they be lost forever? The Vanished from Dust series is perfect for anyone who craves a hair-raising thriller packed with mystery and suspense. This paranormal story for young adults can be compared to Stand by Me, mixed with Odd Thomas, and a twist of The Dark Tower.",
  "genres": [
    "Young Adult",
    "Thriller",
    "Mystery",
    "Audiobook",
    "Suspense",
    "Paranormal"
  ],
  "author": "Shea Norwood",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/18683373-vanished-from-dust"
}