{
  "title": "Battered",
  "description": "Toxic Thoughts is true story series about adversity and resilience.Running around a basement looking for a safe place to hide from a wild eyed step-witch wielding a pair of scissors wasn't a life I ever imagined or wanted.I'm Jacynta Roth. I wasn't born into a dysfunctional family. I was the sixth child in a loving household ... but that was long before my widowed father developed a dysfunctional relationship with the married woman next door. At age four, I lost my dying mother to cancer. For two years my twelve year old brother and thirteen year old sister played Mom and Dad to us younger four siblings, while my father was stationed at various air force bases away from home. Just before my sixth birthday, my father Ned and his best friend packed up our families, and drove five hundred miles to start a new life. On the morning of my sixth birthday, my friend and I, while spying though a fence hole, witnessed a woman assaulting two boys. That's the moment I realized how lucky I was. We didn't tell anyone. All the adults were focused on the upcoming housewarming party for my poor lonely Dad, Ned Roth. He's quite the catch, with all his fancy new furniture and state of the art appliances but he's never home long enough to make start a romance with a decent woman. At my Dad's party he meets and develops an affair with a woman and eventually tells us that a new housekeeper, named Irma, is moving in. To my horror it's the same woman I spied on through the fence and she has her two battered boys in tow. Eventually Irma's \"dead\" husband surfaces and approaches me to help him kidnap his two sons from a woman the courts will soon label an unfit mother.Yes, I survived. I'm the Jacynta Roth who saw the new neighbor beat her kids. I'm the girl who thought it wasn’t my problem, until she left her husband and moved in with us. Now her ex-husband is bugging me to help get his two kids back. Life sucks. My sister has vanished and the new step-witch is trying to get rid of us one by one. I wonder who’s next?",
  "genres": [
    "Self Help"
  ],
  "author": "Juanita Ray",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/18684130-battered"
}