{
  "title": "Cyborgs: More Than Machines",
  "description": "Please note, this bundled anthology contains previously released titles:C791 - Machines aren't supposed to feel, but this cyborg can't help falling in love.F814 - She thought herself a robot, defective and unique among her kind, until he taught her how to live again.B785 - When cyborg intelligence meets sensual robotics, circuit boards sizzle.C791 Assigned as a specimen collector for a captured cyborg, Chloe is intrigued by the machine disguised as a man. Kidnapped during his daring escape, he shows her that despite the chip in his brain, his humanity is not completely lost.Formerly known as unit X109GI, Joe is on a quest to discover his origin. While he doesn't find the answers he's looking for, he does discover that affection and lust aren't just for humans. But when it comes to a battle between logic and love, which side will the cybernetic organism--once a man--choose?Evaluating his feelings will have to wait though because the military isn't done with Joe. But their threats against him pale in comparison before the shocking discovery of project C791, the revelation of which stuns the rebel cyborgs--and ignites a fury for vengeance.F814 F814 exists to serve the humans until they decide to terminate her. An instinct for survival makes her fight, but when she achieves freedom, she discovers she cannot throw off the chains of habit. Everything changes when another flesh covered droid arrives, a cyborg he calls himself, who teaches her she is more than a machine.Solus hates humanity, and even though he was born as a flawed human, he strives to eradicate all traces of it from his persona--until he meets F814. Meeting and touching her releases something in him. Has him yearning for things he doesn't understand. Makes him long for...affection.Before he can learn to love though, he must first tackle the task of reminding F814 that she is more than the sum of her mechanical parts. But of course, when dealing with an illogical thing like emotions, there is no sure plan for success.B785 Einstein was probably the only cyborg in existence with no interest in the opposite sex, until he discovered B785. With her sensual nature and quirky sense of humor, she draws this cybernetic geek out of his scientific shell and teaches him the one thing he's never understood - passion.Tired of being a slave to the military, Bonnie went to sleep one day with the intention of never waking up, but she didn't count on a cybernetic prince charming bringing her back to life. Coming to terms with her past isn't easy, but harder still is the realization that even a bionic princess can fall in love.However, all fairy tales have a villain, and despite the fact the military wrote them both off as a loss, they soon discover they'll need to fight to have their happily ever after.",
  "genres": [
    "Paranormal",
    "Romance",
    "Science Fiction",
    "Fantasy",
    "Science Fiction Romance",
    "Paranormal Romance",
    "Adult"
  ],
  "author": "Eve Langlais",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/18681836-cyborgs"
}