{
  "title": "Contested Democracy: Freedom, Race, and Power in American History",
  "description": "With essays on U.S. history ranging from the American Revolution to the dawn of the twenty-first century, Contested Democracy illuminates struggles waged over freedom and citizenship throughout the American past. Guided by a commitment to democratic citizenship and responsible scholarship, the contributors to this volume insist that rigorous engagement with history is essential to a vital democracy, particularly amid the current erosion of human rights and civil liberties within the United States and abroad. Emphasizing the contradictory ways in which freedom has developed within the United States and in the exercise of American power abroad, these essays probe challenges to American democracy through conflicts shaped by race, slavery, gender, citizenship, political economy, immigration, law, empire, and the idea of the nation state.In this volume, writers demonstrate how opposition to the expansion of democracy has shaped the American tradition as much as movements for social and political change. By foregrounding those who have been marginalized in U.S society as well as the powerful, these historians and scholars argue for an alternative vision of American freedom that confronts the limitations, failings, and contradictions of U.S. power. Their work provides crucial insight into the role of the United States in this latest age of American empire and the importance of different and oppositional visions of American democracy and freedom.At a time of intense disillusionment with U.S. politics and of increasing awareness of the costs of empire, these contributors argue that responsible historical scholarship can challenge the blatant manipulation of discourses on freedom. They call for careful and conscientious scholarship not only to illuminate contemporary problems but also to act as a bulwark against mythmaking in the service of cynical political ends.",
  "genres": [
    "History"
  ],
  "author": "Manisha Sinha",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1001402.Contested_Democracy"
}