{
  "title": "Queen of Deception",
  "description": "Queen of Deception is the first novel by Danish royal author Trine Villemann. It’s a scandalous tale which focuses on the death bed regrets of the Queen of a small anonymous northern European kingdom, as well as the self destructive escapades of the country’s Crown Prince Franz. Queen of Deception offers an unedifying glimpse of life behind the Palace walls, where the cancer stricken monarch, a victim of the most horrifying cruelty, has sacrificed her own happiness in order to fulfill her royal duty. Prince Franz is determined not to follow in his mother’s footsteps.Sensitive and weak Franz is a reluctant heir to the throne. After a miserable childhood, living in fear of his strict and violent father, Duke Alfonso, and ignored by his cold mother, Franz fights tooth and nail to avoid his royal responsibilities. He seeks solace in alcohol, drugs and casual sex, and alarms his minders by surrounding himself with a sometimes criminal entourage. Franz falls in love with a nurse, but his desire to marry her is thwarted by the Palace and he ends up succcumbing to a highly ambitious foreign commoner called Vicki. In her final days, the Queen realises that the web of deception she has spun is about to undermine the very institution that she has sacrificed everything to protect.Trine Villemann has earned a reputation as a controversial critic of Denmark’s Royal Family. Her first book, 1015 Copenhagen K, which exposed Crown Princess Mary’s in-laws as being a family of dysfunctional freeloaders, was a best seller in Denmark. Her second book, the King and Queen of Greenland, argued that Crown Prince Frederik and his Australian wife should go on an apprenticeship to Greenland so that they could prepare for the day when they would inherit the throne from Denmark’s Queen Margrethe. When Queen of Deception was first published in Danish in February 2012, it was critically well received, as “a rivetting and entertaining read.”--",
  "genres": [],
  "author": "Trine Villemann",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/18684935-queen-of-deception"
}