{
  "title": "Chasing the Storm",
  "description": "A gripping, high-octane thriller from debut author Martin Molsted!What do you get when you take one dose of high-level gangsters, one dose of corrupted politicians, add to the cocktail a missing ship and then blend it with an unstoppable Russian journalist, an awesome hacker and a former elite soldier who’s become an alcoholic, fed-up office rat?You get Chasing the Storm!While in Hamburg, lawyer and former elite soldier Torgrim Rygg witnesses the assassination attempt on Marko Marin, a Russian journalist investigating the disappearance of a ship ostensibly carrying timber bound for Algiers. He gets drawn into a world of conspiracies, cover-ups and the relentless search for a missing ship. Disenchanted with his mundane office-life, he agrees to help Mr. Marin, and together with Marin’s girlfriend, Lena, and their hacker, Sasha, he sets out on a journey to discover the truth about the missing ship.Their truth-seeking kicks off a series of life-threatening events and a relentless race against time to foil whoever is behind the disappearance of the ship, the Alpensturm. Their revelation puts not only their own lives at risk but the safety of the whole world ……Great characters, Exotic locations, a dash of Mystery, a tad of Romance and a lot of Thrilling high-octane action!************************BASED ON REAL EVENTS!************************Pre-Release Praise for Chasing The Storm:\"I think this is the best eBook I've ever read! […] THE END!!!! Oh I could never have predicted something like that. Brilliant. Really!!! Excellent book! Really well written…\"\"-Niyati.\"Martin Mölsted’s CHASING THE STORM is a thriller that grabs you from the first sentence in the book. It is a formidable work of fiction full of rage, great humour and definitely packed with energy. The pace is murderous, and that over four continents.\"-Akinyi Yimbo.[…]I left characterisation ‘till last because it is one of the deepest I’ve read in the last couple of years. I’m talking about the layers upon layers of understanding that come from not missing one beat to add to the characters’ dimensions. In addition to the usual physical and emotional tiers, you get the ethnic diversity, and within it the class, origin, background, and all these elements are beautifully interwoven. […]Five shiny stars from me.\"-Ella Medler.Based on Real Events:In 2009 the ship MV Arctic Sea was hijacked in the Baltic Sea. Following intense media scrutiny, Russian commandos seized the ship a month later. Though Russia still claims that the ship carried timber destined for Algeria, many observers assume that the actual cargo was military-related, and that the mission was thwarted by Israeli forces.… But what did really happen?Chasing The Storm is a thriller about the hijacking of a Russian ship in the Baltic, and the search by a Russian journalist and a Norwegian oilman for the truth. The events have been fictionalized but may be closer to what really happened in the Baltic than any speculative journalism.With its timely subject matter and intricate storyline, Chasing The Storm is reminiscent of recent Scandinavian Crime Fiction and popular international conspiracy thrillers.Read The Sample or Buy Now!",
  "genres": [
    "Thriller",
    "Amazon",
    "Fiction",
    "Suspense",
    "Mystery"
  ],
  "author": "Martin Molsted",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/18686006-chasing-the-storm"
}