{
  "title": "Sanguis City",
  "description": "**For mature audiences only due to graphic sex, language and violence.**The End was not a Zombie apocalypse but a Vampire one.Ever wonder what happens after the world ends?Lilanoir Rue did, a mere by product of the destruction, she never knew what happened before hand either. No longer just a human with fangs, she is banished from the only place she called home, the Human Reservation. She wipes her tears and never looks back. In a world gone dead, life has never been so good, for some. While others live in chaos, the chosen call Sanguis City home. The rich and powerful found a way to survive The End and enjoy every minute of it, for eternity. On the brink of a gruesome death from starvation, disease or a hungry zombie, humans flock there to sell their blood for peace and security. The city of blood, made for and by vampires, welcomes Noir; her kind are in high demand. New vampires, the ones who bought immortality, need a loyal workforce. Neither Human nor Vampire, Bleeders take care of the city in the daylight. Draining humans by day and dating Vampires at night leaves Noir little time to think about her past, or much else, until it finds her. Noir never dreamed her fangs would be the ticket to the good life, but three years in the city has earned her a promising future, career and, just maybe, a love life. But when she falls for her charmingly sexy Professor, an Authentic Vampire, she also falls into a web of nightmares. Does she really know anything about the real Vampires or about the city she now calls home? Unable to escape painful memories, she uncovers more than her own secrets. Quickly her dystopian paradise starts crashing down around her, and some secrets just won't stay dead, and others are bound to kill her before finals week. Ending up in bed with a monster, in more ways than one, might not be as bad as she had imagined.",
  "genres": [
    "Paranormal",
    "Vampires",
    "Paranormal Romance",
    "Romance",
    "Supernatural",
    "Dystopia"
  ],
  "author": "Morgan Jane Mitchell",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/18684997-sanguis-city"
}