{
  "title": "All That Glitters... : Simone Part 3",
  "description": "With Mona gradually realizing that life is a fickle mistress, she knows she has choices to make. Choices that will change her future forever. And regardless of the chaotic tangle of her affair with Zane, she still wants and needs him to be a part of her present.But with news of their affair having hit the gossip columns, Mona knows there’s little to no chance of that happening. Where once the future was bright, now it’s bleak until the remarkable occurs. A stranger who’s not so strange turns up at her door and offers her an alternative path.To Mona, being a kept woman was as unorthodox as could be, but what Zane’s husband, Jake Harris, suggests makes less sense than Martians taking over NYC. In fact, he might as well propose that she turn green.But for Zane, is she willing to do the unthinkable?Is she willing to take on sex god no. 2 to retain no. 1? 34.000 wordsAll That Glitters is the THIRD novella in Simone's FOUR part story.Reading Fall Into LoveCrazy Little Thing Called LustAll That GlittersCan Be GoldOver 400 pages of Naughty Nookiness!ExcerptSome might think Zane’s a jerk. After all, he has or had the best of both worlds for a short time, at any rate. Jake, me – he got his rocks off at both ends. But inside, Zane’s head is in a muddle and I don’t know what he has to do to clarify what he needs to do to unravel it all.“It’ll all be okay, won’t it, Zane?” I ask, feeling uncertain and insecure, where moments ago I’d been feeling the complete opposite. It’s a stupid question, but one that pops out of my mouth regardless.“Of course, honey,” he murmurs, his voice as molten as the endearment he just uttered. It isn’t a trite, throw-away of course , either. He means it. And even though nothing in our conversation warrants it, and even though I don’t know where it came from, it gives me the strength to “Are you going to say goodbye to me soon?”His silence makes me choke up, but it’s soon cut through with a sigh. “No. I can’t.”“Why can’t you?”I wish I could see his face. Look into his eyes, study his features and make an analysis. But I’m just relying on the subtle nuances in his tone, and the picture I’m painting isn’t complete. In fact, it paints more questions than it answers...",
  "genres": [
    "Erotica",
    "Menage",
    "Contemporary Romance",
    "Romance",
    "Short Stories",
    "Novella",
    "Chick Lit"
  ],
  "author": "Serena Akeroyd",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/18685969-all-that-glitters"
}