{
  "title": "Love Has No Boundaries Anthology: Volume 9",
  "description": "The stories you are about to read celebrate love, sex and romance between men. They are a product of the Love Has No Boundaries promotion sponsored by the Goodreads M/M Romance Group, and each anthology is published as a gift to you.What Is Love Has No Boundaries?The Goodreads M/M Romance Group invited members to choose a photo and pen a letter asking for a short M/M romance story inspired by the image; authors from the group were then encouraged to select a letter and write an original tale. The result was an outpouring of creativity that shone a spotlight on the special bond between M/M romance writers and the people who love what they produce.Nearly 190 stories were submitted and have now been published as a twelve volume set with two additional bonus volumes, titled Love Has No Boundaries. This edition is Volume 9.Words of CautionThe stories in this collection may contain sexually explicit content and are intended for adult readers. They may also contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that the reader review the General Information section before each story for story tags as well as for content warnings.Stories in Volume 9:JACKSON’S LAW by Vanessa NorthEPIMELIAD by Adara O’HareDEEP IN THE COUNT by Madison ParkerFIRE AND WATER by Kate PavelleTHE PRICE OF SILENCE by Kate PavelleTEN YEAR H-ITCH by PelaamRESISTANCE by Joe PettyIN THE LONELY SEA by Arielle PierceMIDNIGHT MUFFINS by Erica PikeCREELING THE BRIDEGROOM by Neil S. PlakcyTHE MISSING PIECES by Wt PraterLOST IN THE ECHO by Jack L. PykeTHE MENAGERIE by Ithra ReyesSHOOTING THE CURL by Madeleine RibbonFOUR SEASONS WITH YOU by May RidgeRADIO LOVE SONG by J. RocciTHE BRAT WHISPERER by J.A. RockROUTINE WATCH by Gina A. RogersFROM DON TO DOM by Naaju Rorrete",
  "genres": [
    "BDSM",
    "Contemporary",
    "Short Stories",
    "LGBT",
    "Menage",
    "M M M",
    "Adult"
  ],
  "author": "Erica Pike",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/18685770-love-has-no-boundaries-anthology"
}