{
  "title": "Curse of the Beast",
  "description": "A dark shadow stalks the night, watching her—waiting to claim what is his.Seventeen-year-old Tayla Jonas longs for a simple life, but after a traumatizing family loss, she is forced to be both mother and sister to her cousins while caring for her mentally unstable aunt. Moving to her grandma’s quiet town of Cody, Wyoming, Tayla finds some normalcy with her quirky green activist friend, Chel, who spends no time converting her to vegetarianism.A few weeks into her new school, Tayla catches the eye of Kyle Harrington—the high school quarterback and resident millionaire—who can seduce any girl with his charismatic charm, including Tayla. But Kyle is anything but what he seems.Walking through City Park, Tayla is unaware that an ancient curse has her in its crosshairs. The silver moonlight illuminates the path to her van, sprinkling shadows like evil twinkling eyes. Tayla’s skin prickles, and she turns. Something—or someone—is watching her.A powerful werewolf steps from the shadows. An iridescent blue chord shoots from him and slams into her stomach, dissolving instantly. Pain wracks her body, and she tries to scramble to safety, but his silver eyes freeze her in place as the curse binds them together. The chord settles deep inside her body, coiling with dread around her heart.Dismayed by the prospect of a werewolf for a shadow, Tayla fears for the safety of her friends and family. How will she keep the werewolf’s insatiable hunger in check? Her plans for a vegetarian lifestyle quickly dwindle away, and Tayla wrestles to fit her frazzled life back together—piece by piece. But what she didn’t expect was her attraction to the werewolf or the power of the full moon.Will Tayla be strong enough to survive the Curse of the Beast? Or will it consume her like so many before? Find out in the first installment of this unique retelling of Beauty and the Beast.",
  "genres": [
    "Young Adult",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Werewolves",
    "Paranormal Romance",
    "Fairy Tales"
  ],
  "author": "Ashley Lavering",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/18685715-curse-of-the-beast"
}