{
  "title": "Magic after Dark",
  "description": "Dive into six different worlds of vampires, demons, fae, fairy godmothers, mages, and all things magic. Prepare for a wild ride, whether you're looking for nail-biting drama, mystery, intense action, humor, new breeds of paranormals, or passionate romance. Indulge in this amazing boxed set from 6 bestselling urban fantasy authors:SM Reine - Sacrificed in ShadowMarie Hall - Crimson Night, DarkDeanna Chase - Influential MagicDanielle Monsch - Fairy Tales and Ever AftersKate Danley - Maggie for HireDannika Dark - SterlingSACRIFICED IN SHADOW (Ascension #1) by SM ReineLincoln Marshall is a small-town deputy with a very big problem. Six members of his church have been found dead, killed by a rogue werewolf. He'll have to make a deal with the Devil to save victims that have gone missing -- maybe literally. Elise Kavanagh, preternatural investigator and exorcist, is the expert when it comes to violent deaths at the jaws of evil. She's also among the most powerful demons that Hell has spawned. Elise jumps at Lincoln's case, and it's not just because of his down-home charm. Someone's laid a trap for her in Northgate, and she wants to find out who.... CRIMSON NIGHT by Marie Hall Welcome one and all to Carnival Diabolique- my name is Pandora, and I'm a Nephilim. What does that mean? I'm half demon, what's my other name? Lust. But I'm not all bad. I fight for light, for goodness and truth. But people are starting to disappear and lately I've felt a dark presence lurking around me. I think it might be a death priest and that's really bad. This should have been easy, me killing fanged freaks, getting rid of my pesky priest problem, but I'm about to be betrayed by the one person I thought I could trust with my life and before the night is through I'll be covered in crimson... -Dark Urban FantasyINFLUENTIAL MAGIC by Deanna Chase Welcome to the Crescent City, the home of Willow Rhoswen, faery and magical baker extraordinaire. While fighting for her life, Willow is caught between two gorgeous men as she navigates the corruption of a powerful vampire organization and her own supernatural government agency.FAIRY TALES AND EVER AFTERS by Danielle MonschIf you like your fairy tales just a little twisted, this is the series for you! Three tales follow our fairy godmothers as they figure out ways to help the damsels - and mansels - in distress, all the while making sure every couple gets their happily ever after. MAGGIE FOR HIRE by Kate Danley When monsters appear on earth, Maggie MacKay is on the job. No one is better at hauling the creepy crawlies back where they belong… no one except her dad, who disappeared mysteriously in the middle of an assignment. When an elf named Killian shows up with a gig, Maggie finds herself at the center of a plot to turn the earth into a vampire playground. The only hope for survival is tracking down two missing statues and a secret that disappeared with Maggie's father.Warning: This book contains cussing, brawling, and unladylike behavior. Proceed with caution. STERLING (Mageri #1) by Dannika Dark Follow the journey of a young woman's claim to immortality and her own identity. Zoë Merrick's human life ends when she is brutally attacked by a Mage who gives her the gift of immortality. She soon discovers they are not magicians, but powerful beings who can manipulate energy. Justus De Gradi steps forward to act as her Ghuardian, teaching her how to fight to protect the light within her. Will she learn to accept her fate and trust those around her? Urban Fantasy Romance Series.",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Urban Fantasy",
    "Paranormal Romance",
    "Anthologies",
    "Romance",
    "Magic"
  ],
  "author": "S.M. Reine",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/18685558-magic-after-dark"
}