{
  "title": "The Wedding Winger",
  "description": "Sly Remington has a plan. And it does not involve falling in love with his high school crush, the literal girl next door. But sometimes, fate makes plans of its own...Pro hockey has always been my destiny. And now that I’m right wing for the Wilcox Wombats? It’s my past and present… but I’m not so sure if it’s my future. I’m on the older side now, as hockey stars go, and I’m starting to worry about my lack of a backup plan.The issue?I’m no rocket scientist. Hockey’s what I’m good at. Sure, I graduated high school (with the help of my ultimate high school crush, Clara Connor, who was literally the girl next door.) And I got through college because everyone there was pretty invested in keeping me on the ice.Now?I’m working on the next phase of my life, but I can’t pretend I’ve got much faith that it’ll work out. I know who I am and what I’m good at. The same thing the women I date an athlete. Period.But when my little brother drops the bomb of his engagement and Mom insists I come home solo, everything gets thrown into question. Not because Mom doesn't want me bringing a puck bunny to the wedding, but because she's got a matchmaking master plan up her sleeve.And guess who she has in mind? None other than my HS tutor, Clara Connor, the newly divorced single mom living right next door. Did I mention she has a five-year-old daughter who’s better at getting my goat than my little brother on his best day?Clara is a scientist now, and she’s got a lot on her plate already. So when Mom thrusts us together repeatedly, I do my best to be a good guy. Standup. Respectable. Friendly.The thing is, Clara still gets under my skin. And when she tells me she had a crush on me back then too, and that maybe she still does?The gloves are off.",
  "genres": [
    "Hockey",
    "Sports",
    "Sports Romance",
    "Contemporary",
    "Romance",
    "Second Chance",
    "Second Chance Romance"
  ],
  "author": "Delancey Stewart",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/186852785-the-wedding-winger"
}