{
  "title": "Rebecca's Lost Journals",
  "description": "Includes Rebecca’s Lost Journals #1-4 (The Seduction, The Contract, His Submissive, My Master)and The Master UndoneIn this stand alone collection connected to the Best Selling Inside Out Series, you meet Rebecca Mason, the intriguing woman who penned an erotic journal that changed everyone’s life it touched. This is her story, in her words.....Rebecca’s Lost Journals.....Rebecca Mason has known heartache and sorrow in her life, losing everyone she loves. She’s on her own in San Francisco, lost in every way, until she dares to make the decision to chase her dream of working in the art world. It is then that he meets a rich, seductively powerful man who will become the Master she never knew she wanted and change her life forever. He will lead her on a dark, passionate journey where pain is pleasure and pleasure is pain, and where every limit she once had is no more. In this man, she will find solace to her pain, an escape from the ache inside her. And in him, she will discover a darkness she may never escape.Bonus Story included:Master Undone in his POV... I told him goodbye, and I will not call him. I know if I do, it will be my undoing, and I'll once again be caught up in his spell. I will once again be . . . lost. In her private journals, Rebecca laid bare her soul, revealing her obsession for the one man whose erotic demands captivated her imagination--and enslaved her forever. Now, with Rebecca no longer in his life \"he\" is lost, questioning everything he thought he knew about himself and about control he holds in such high regard. One women will reach out to heal him and then turn away, leaving him haunted. She is nothing he thought he wanted and somehow everything he needs. He tells himself to forget her but he cannot escape his desire for her. He has to have more...",
  "genres": [
    "Erotica",
    "BDSM",
    "Romance",
    "Erotic Romance",
    "Contemporary",
    "Contemporary Romance",
    "Suspense"
  ],
  "author": "Lisa Renee Jones",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/18689788-rebecca-s-lost-journals"
}