{
  "title": "Shaken: A Story of Emotional Abuse and Depression",
  "description": "\"A very important book. Shaken will prove to be invaluable' -International best selling author Jean SassonInspired by experience, Connelly bravely takes us on a journey into the loneliness and despair of depression while in the midst of an emotionally abusive relationship. Having had anxieties since childhood, nothing was to prepare her for the violent convulsions and hours of un-controllable sobbing that had started to take over her life, as the stress and trauma of psychological abuse manifested itself in the form of major depressive disorder, severe panic disorder and anxiety with Ocd. Shaken is the story of one woman’s journey with deteriorating mental health while under the control of an emotional abuser. It serves to acknowledge that any form of psychological abuse at any severity is unacceptable and shows just how quickly the trauma of such can give birth to a variety of mental health issues. Separated by sections of comprehensive reference and checklist material to inform readers about the signs of emotional abuse and depression, as well as advice for friends as well as sufferers, Shaken digs deep into the heart of a woman who hopes to dispel the ignorance and lack of understanding regarding both issues by using her own experiences as an example. A stark, honest and well written read from the pen of an emotional abuse survivor.* 'Mental and emotional abuse is a problem that more often than not gets swept under the rug for a variety of reasons. Kerry Connelly shakes out that rug in Shaken!* -Reader's Favorite*Highly readable, a very important book that both abusers and the abused should read. Connelly's book will guide the way for the abused to safely leave their abuser, and to heal. If you are being abused, or know someone who is being abused, I recommend that you buy this book. Connelly's SHAKEN will prove to be invaluable' International best selling author JEAN SASSON (Princess: A true story of life behind the veil in Saudi Arabia)",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Mental Illness",
    "Mental Health",
    "Biography"
  ],
  "author": "Kerry   Connelly",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/18688398-shaken"
}