{
  "title": "The Deans' Bible, Five Purdue Women and Their Quest for Equality",
  "description": "Like pearls threaded one-by-one to form a necklace, five women successors nurtured students on the Purdue University campus in America’s heartland during the 1930s to 1990s. Individually, each became a legendary dean of women or dean of students. Collectively, they wove a sisterhood of mutual support with their common, often thwarted, pursuit of human freedoms. \tDorothy C. Stratton, Helen B. Schleman, M. Beverley Stone, Barbara I. Cook, and Betty M. Nelson shaped avenues and attitudes for women and became conduits for change fostering opportunities for all people. They were loved by students and revered by colleagues. The women were respected throughout the United States as founding leaders of the Women’s Reserve of the Coast Guard (SPARS), frontrunners in the National Association of Women Deans and Counselors, and as pivotal members of Presidential Committees in the Kennedy and Nixon administrations. \tThe Deans’ Bible sings of America on a university campus and beyond. During the Depression aviatrix Amelia Earhart and renowned motion study engineer of Cheaper by the Dozen fame Lillian Gilbreth advised and taught at Purdue befriending Dorothy Stratton and Helen Schleman. The novel-like book gives a spirited account of SPARS, directed by Captain Dorothy Stratton. The story rolls through the “picture-perfect,” suppressive 1950s, the awakening sixties, women’s liberation, Title IX, 1980s AIDS and alcohol, the changing mores for the disabled, and sails into the twenty-first century as a Coast Guard Cutter is named after Dorothy Stratton and commissioned by First Lady Michelle Obama.\tAs each woman succeeded the other forming a five-dean friendship, they knitted their bond with a secret symbol—a Bible. Originally possessed by Purdue’s first part-time Dean of Women Carolyn Shoemaker, the Bible was handed down from dean to dean with favorite passages marked.  The word bible means “guidebook.” The Deans’ Bible is just that, brimming with courageous women who led by example living their convictions.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Angie Klink",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/18688641-the-deans-bible-five-purdue-women-and-their-quest-for-equality"
}