{
  "title": "Amor en llamas",
  "description": "Una joven torturada por la culpa y un hombre víctima de un misterioso maleficio desafían al pasado por estar juntos, en esta explosiva y original novela romántica paranormal ambientada en el Londres victoriano.Miranda Ellis es una belleza pelirroja, dinámica e inteligente, que esconde un terrible secreto. Marcada desde la cuna por un don poderoso e indomable, está convencida de haber causado la ruina de su familia. Para sobrevivir, decide hacerse pasar por un pilluelo más de los muchos que merodean por las callejuelas del Londres victoriano. Pero todo cambia cuando la obligan a contraer matrimonio con el misterioso lord Benjamin Archer, un hombre muy temido que oculta su rostro tras una máscara.Aunque Archer debería protegerla del maleficio que pesa sobre él, es incapaz de resistirse a la chispa que se prende cuando la conoce. En contra de todo lo esperado, Miranda sucumbirá a la intensa atracción que comparten y, poco a poco, descubrirá la ternura que su esposo alberga en su interior. Pero cuando Archer se convierte en el principal sospechoso de una serie de muertes, Miranda se verá tentada de indagar en su pasado para salvarlo y tendrá que adentrarse en un mundo de magia tenebrosa, donde ella podría ser la siguiente víctima.«Evocadora y profundamente romántica.» Nalini Singh«Callihan demuestra tener un gran talento para crear tensión sexual y tramas inesperadas. Al final, ambas cosas se mezclan de forma brillante.» Diana Gabaldon«La Bella y la Bestia mezclada con El fantasma de la ópera (con toques de Carrie y mucha mitología egipcia) en esta apasionante y contagiosa historia, cocinada a fuego lento, de una sensualidad incendiaria y con una heroína que lo arriesga todo para salvar al hombre que ama.» Library Journal",
  "genres": [
    "Romance",
    "Fantasy",
    "Paranormal",
    "Paranormal Romance",
    "Historical Romance",
    "Historical",
    "Steampunk"
  ],
  "author": "Kristen Callihan",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/18691321-amor-en-llamas"
}