{
  "title": "Charles and Edward: A Modern Day Pretty Woman",
  "description": "A tale of true love. When two souls meet on a chance encounter, they didn't know that it would be a day that would change both of their lives for ever. Set in the modern day in the years leading up to the Olympics and the Diamond Jubilee of 2012, this is a very modern love story with a unusual twist. Across the class divide that separates the extremely wealthy from the common man in modern day England two men meet and form a most unlikely bond. True love has no barriers and can strike anyone anywhere when they least expect it. Once felt it will stop you in your tracks and all you will be able to think about is the object of your affections. Edward is a humble young man from south London, born into a poverty stricken and mixed up family with no hope of a good future. With a disappearing single mother addicted to drugs, abused as a child. Adopted at a young age due to a traumatic childhood, trying hard to make a better life for himself anyway he possible can. Dreaming of a future with infinite possibilities where dreams can come true if you wish hard enough. One day he meets his knight in shinning armour, a member of the British aristocracy who comes into his life and turns it around to become the stuff dreams are made of. A chance encounter leading to a lasting love affair that will change his life for ever. Set in London amidst the hustle and bustle of Mayfair, St James, Knightsbridge, Belgravia. Edward finds himself whisked up into a world beyond his imagining. The best restaurants and finest hotels in London are a big part of his new life. No more Butlins in Skegness for Edward as he starts to be taken to, New York, Paris, Amsterdam Italy and the South of France. Places he had only seen in magazines now become his holiday destinations. From the glamour of the upper east side in New York, to the sheer luxury of Provence in the South of France, to the beauty of southern Italy in Positano, Ravello and Capri, he starts to live the life he had always dreamed about. Will events change Edward? Can he remain the humble young man he was when his affair with a member of the British aristocracy starts? Or will he become changed by getting caught up in all the glamour and luxury and lose himself amongst the finer things in life? All is revealed in this love story that crosses the class divide. A Belle De Jour meets Pretty Woman for the 21st century. Like the love letters between Prince Edward and Wallace Simpson before they become the Duke and Duchess of Kent mixed in with Diary Of A Manhattan Call Girl. A tale with a message and underlying morality. Can you really have everything you want without paying a price? Is it really worth it to gain the world if you lose yourself and the morals you have been brought up with? Sometimes laugh out loud funny, other times heart rendering, sad, uplifting, light hearted, fun, at turns even very sobering with a interwoven message of morals and staying true to oneself. Not just a story with out meaning, as you read you will find yourself vividly imagining what you would do and encouraging Edward to be true to his word and himself. When sometimes enough is never enough and the more you have the more you want, life has a way of teaching you the lessons you need to learn.",
  "genres": [
    "M M Romance",
    "Romance"
  ],
  "author": "Beau Garçon De La Nuit",
  "average_rating": "2.82",
  "url": "https://www.goodreads.com/book/show/18690439-charles-and-edward"
}