{
  "title": "A World to Win",
  "description": "A World to Win is the seventh book of the epic historical narrative in Upton Sinclair's World's End Lanny Budd series. This spellbinding book covers the period or 1940-1942 following the Nazi partial occupation of France and the formation of the Vichy government. Lanny Budd, the protagonist in this classic series is the debonair, suave and wealthy American peace lover. He is intimately connected to every powerful political and military figure on the European continent and the corridors of power in the United States. As a renowned art expert as his camouflage, he is secretly Presidential Agent 103 for President Roosevelt. The story opens with Lanny meeting with the French leaders, politically and militarily, following the German occupation of Paris. He flies to London and meets with his closest friend Rick, a left wing journalist, and finds himself in the middle of the horrendous bombing of London by the German Luftwaffe. Winston Churchill is now the undisputed leader of the British Empire and determined to defeat the Nazi's, after years of appeasement by the ruling aristocrats and politicians in Britain. Lanny is \"in the loop\" as Rudolph Hess is tricked by British intelligence services into descending into Scotland in a misguided attempt to prevent an all out German-British war. Lanny is captured by French underground patriots who believe he is a Nazi agent and has a harrowing escape. Ironically, he is attempting to give money to this underground resistance movement when he is captured. By itself this part of the story is compelling and clearly illustrates Lanny's cleverness, ingenuity and persuasiveness in the face of grave personal danger. In his most dangerous mission as a presidential agent, Lanny is briefed on the development of the Atomic Bomb project headed by Albert Einstein himself. On his mission to Germany to ferret out German advancements in developing the bomb, Lanny's plane crashes in the arctic waters off the coast of Newfoundland and he is severely injured. A long recuperation follows. A fabulous around the world cruise follows Lanny's long hospitalization. The cruise aboard the yacht Oriole is owned by a wealthy Baltimore man who wants Lanny to marry his daughter Lizbeth. Lizbeth, her father and Lanny are startled to learn at the last minute before the yacht sails that her cousin, Laurel Creston will be joining the cruise. The reader will remember Laurel as the anti-Nazi journalist whom Lanny ingeniously help to escape the Gestapo in Dragon's Harvest. On December 7, 1941 the Oriole is anchored off the coast of Hong Kong as the Japanese bomb Pearl Harbor. As I mentioned in my review of Dragon's Harvest, you the reader were going to meet the future Mrs. Lanny Budd. Read how the astrological warning by a Rumanian living in Germany predicted several years earlier that Lanny would die in Hong Kong almost comes about. It almost comes true but Lanny and Laurel narrowly escape a besieged Hong Kong with a laborious journey through China, war-torn Yenan to find themselves guests of Stalin in friendly Russia. This book concludes with a lengthy interview between Stalin and Lanny. Follow all of the characters that make for Lanny's extended families. From Beauty Budd and her wonderful husband, Parsifal Dingle, Robbie Budd, Rick and Nina, Rosemary, Irma and \"Ceddy\" and the rest of the rich cast of wonderful characters we have grown to love from the very beginning with World's End. A World to Win captures that period in world's history that is must reading. No one can describe the times like Upton Sinclair has done with these classics. The best is yet to come with Presidential Mission, One Clear Call, O' Shepherd Speak! and The Return of Lanny Budd. Please visit our website coming soon at: www.uptonsinclair-lannybudd-completeh.... There you can order any or all of the Lanny Budd series books at 20%, 25% and 30% off with free shipping.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Classics",
    "Literature"
  ],
  "author": "Upton Sinclair",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/11019960-a-world-to-win"
}