{
  "title": "The Scorched Earth",
  "description": "New York Times bestselling author and acclaimed video game writer Drew Karpyshyn returns with the second novel in an original epic fantasy series—perfect for fans of Terry Goodkind, Peter V. Brett, and Brandon Sanderson—about four young people who will either save the world or bring about its destruction. The Children of Fire—four mortals touched by the power of Chaos—each embody one aspect of a banished and fallen immortal Keegan, the wizard; Scythe, the warrior; Cassandra, the prophet; Vaaler, the king. Now grown to adulthood, the Children are in search of the ancient Talismans that can stop the return of Daemron the Slayer, ancient enemy of the Old Gods. But in acquiring Daemron’s Ring, they’ve left in their wake death, destruction, and a queen bent on revenge. For the discovery of the Talismans has unleashed a flood of Chaos magic on the land—and now their strength will be tested and their faith tried as never before. Beset on all sides by both mortal and supernatural enemies, they race to find Daemron’s Sword, the last of the ancient Talismans, before the entire mortal world is engulfed in the flames of war and Chaos that will herald the return of the Slayer. Praise for Drew Karpyshyn’s Children of Fire “This energetic epic revitalizes the traditional fantasy quest with tragic heroes, evocative imagery, and sweeping conflict. . . . An intricately layered adventure.” — Publishers Weekly (starred review) “A rousing quest fantasy . . . a fast-paced action-packed good and evil thriller.” — SFRevu “Thoroughly entertaining . . . an engrossing story that’s easy to dive into and hard to leave.” — Roqoo Depot “Gripping and compelling . . . a spellbinding epic told with masterly craft.” —Tracy Hickman, New York Times bestselling co-author of the Dragonlance and Death Gate series",
  "genres": [
    "Fantasy",
    "Epic Fantasy",
    "High Fantasy",
    "Magic",
    "Science Fiction",
    "Dark Fantasy",
    "Fiction"
  ],
  "author": "Drew Karpyshyn",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/18691009-the-scorched-earth"
}