{
  "title": "Capital: The Eruption of Delhi",
  "description": "A portrait of Delhi and its new elites—and a story of global capitalism unbound Commonwealth Prize–winning author Rana Dasgupta examines one of the most important trends of our time: the growth of the global elite. Since the economic liberalization of 1991, wealth has poured into India, and especially into Delhi. Capital bears witness to the extraordinary transmogrification of India’s capital city, charting its emergence from a rural backwater to the center of the new Indian middle class. No other city on earth better embodies the breakneck, radically disruptive nature of the global economy’s growth over the past twenty years. India has not become a new America, though. It more closely resembles post–Soviet Russia with its culture of tremendous excess and undercurrents of gangsterism. But more than anything else, India’s capital, Delhi, is an avatar for capitalism unbound. Capital is an intimate portrait of this very distinct place as well as a parable for where we are all headed. In the style of V. S. Naipaul’s now classic personal journeys, Dasgupta travels through Delhi to meet with extraordinary characters who mostly hail from what Indians call the new Indian middle class, but they are the elites, by any measure. We first meet Rakesh, a young man from a north Indian merchant family whose business has increased in value by billions of dollars in recent years. As Dasgupta interviews him by his mammoth glass home perched beside pools built for a Delhi sultan centuries before, the nightly party of the new Indian middle class begins. To return home, Dasgupta must cross the city, where crowds of Delhi’s workers, migrants from the countryside, sleep on pavements. The contrast is astonishing.  In a series of extraordinary meetings that reveals the attitudes, lives, hopes, and dreams of this new class, Dasgupta meets with a fashion designer, a tech entrepreneur, a young CEO, a woman who has devoted her life to helping Delhi’s forgotten poor—and many others. Together they comprise a generation on the cusp, like that of fin-de-siècle Paris, and who they are says a tremendous amount about what the world will look like in the twenty-first century.",
  "genres": [
    "India",
    "Nonfiction",
    "History",
    "Economics",
    "Travel",
    "Asia",
    "Indian Literature"
  ],
  "author": "Rana Dasgupta",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/18693636-capital"
}