{
  "title": "Fragile Empire: How Russia Fell In and Out of Love with Vladimir Putin",
  "description": "A lively, inside account of Putin’s years of rule and the impending crisis that threatens his tsar-like regime “A beautifully written and very lively study of Russia that argues that the political order created by Vladimir Putin is stagnating—undermined by corruption and a failure to modernise economically.”—Gideon Rachman, Financial Times “Ben Judah, a young freelance writer, paints a more journalistic—and more passionate—picture in Fragile Empire . He shuttles to and fro across Russia’s vast terrain, finding criminals, liars, fascists and crooked politicians, as well as the occasional saintly figure.”— The Economist From Kaliningrad on the Baltic to the Russian Far East, journalist Ben Judah has travelled throughout Russia and the former Soviet republics, conducting extensive interviews with President Vladimir Putin’s friends, foes, and colleagues, government officials, business tycoons, mobsters, and ordinary Russian citizens. Fragile Empire is the fruit of Judah’s thorough a probing assessment of Putin’s rise to power and what it has meant for Russia and her people. Despite a propaganda program intent on maintaining the cliché of stability, Putin’s regime was suddenly confronted in December 2011 by a highly public protest movement that told a different side of the story. Judah argues that Putinism has brought economic growth to Russia but also weaker institutions, and this contradiction leads to instability. The author explores both Putin’s successes and his failed promises, taking into account the impact of a new middle class and a new generation, the Internet, social activism, and globalization on the president’s impending leadership crisis. Can Russia avoid the crisis of Putinism? Judah offers original and up-to-the-minute answers.",
  "genres": [
    "Politics",
    "Russia",
    "History",
    "Nonfiction",
    "Journalism",
    "Political Science",
    "Biography"
  ],
  "author": "Ben Judah",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/18693413-fragile-empire"
}