{
  "title": "The Most Dangerous Book: The Battle for James Joyce's Ulysses",
  "description": "For more than a decade, the book that literary critics now consider the most important novel in the English language was illegal to own, sell, advertise or purchase in most of the English-speaking world. James Joyce’s big blue book, Ulysses, ushered in the modernist era and changed the novel for all time. But the genius of Ulysses was also its danger: it omitted absolutely nothing. All of the minutiae of Leopold Bloom’s day, including its unspeakable details, unfold with careful precision in its pages. The New York Society for the Suppression of Vice immediately banned the novel as \"obscene, lewd, and lascivious.” Joyce, along with some of the most important publishers and writers of his era, had to fight for years to win the freedom to publish it. The Most Dangerous Book tells the remarkable story surrounding Ulysses, from the first stirrings of Joyce’s inspiration in 1904 to its landmark federal obscenity trial in 1933.   Literary historian Kevin Birmingham follows Joyce’s years as a young writer, his feverish work on his literary masterpiece, and his ardent love affair with Nora Barnacle, the model for Molly Bloom. Joyce and Nora socialized with literary greats like Ezra Pound, Ernest Hemingway, T. S. Eliot and Sylvia Beach. Their support helped Joyce fight an array of anti-vice crusaders while his book was disguised and smuggled, pirated and burned in the United States and Britain. The long struggle for publication added to the growing pressures of Joyce’s deteriorating eyesight, finances and home life.   Salvation finally came from the partnership of Bennett Cerf, the cofounder of Random House, and Morris Ernst, a dogged civil liberties lawyer and founder of the ACLU. With their stewardship, the case ultimately rested on the literary merit of Joyce’s master work. The sixty-year-old judicial practices governing obscenity in the United States were overturned because a federal judge could get inside Molly Bloom’s head.   Birmingham’s archival work brings to light new information about both Joyce and the story surrounding Ulysses. Written for ardent Joyceans as well as novices who want to get to the heart of the greatest novel of the twentieth century, The Most Dangerous Book is a gripping examination of how the world came to say yes to Ulysses.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Books About Books",
    "Literary Criticism",
    "Literature",
    "Criticism"
  ],
  "author": "Kevin Birmingham",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/18693899-the-most-dangerous-book"
}