{
  "title": "Shocked: Adventures in Bringing Back the Recently Dead",
  "description": "Not too long ago, there was no coming back from death. But now, with revolutionary medical advances, death has become just another serious complication.As a young medical student, Dr. David Casarett was inspired by the story of a two-year-old girl named Michelle Funk. Michelle fell into a creek and was underwater for over an hour. When she was found she wasn’t breathing, and her pupils were fixed and dilated. That drowning should have been fatal. But after three hours of persistent work, a team of doctors and nurses was able to bring her back. It was a miracle.If Michelle could come back after three hours of being dead, what about twelve hours? Or twenty-four? What would it take to revive someone who had been frozen for one thousand years? And what does blurring the line between “life” and “death” mean for society?In Shocked , Casarett chronicles his exploration of the cutting edge of resuscitation and reveals just how far science has come. He begins in the eighteenth century, when early attempts at resuscitation involved public displays of barrel rolling, horseback riding (sort of), and blowing smoke up the patient’s various orifices. He then takes us inside a sophisticated cryonics facility in the Arizona desert, a darkroom full of hibernating lemurs in North Carolina, and a laboratory that puts mice into a state of suspended animation. The result is a spectacular tour of the bizarre world of doctors, engineers, animal biologists, and cryogenics enthusiasts trying to bring the recently dead back to life.Fascinating, thought-provoking, and (believe it or not) funny, Shocked is perfect for those looking for a prequel—and a sequel—to Mary Roach’s Stiff, or for anyone who likes to ponder the ultimate questions of life and death.",
  "genres": [
    "Nonfiction",
    "Science",
    "Medical",
    "Medicine",
    "History",
    "Death",
    "Audiobook"
  ],
  "author": "David Casarett",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/18693686-shocked"
}