{
  "title": "Sanaaq: An Inuit Novel",
  "description": "Sanaaq is an intimate story of an Inuit family negotiating the changes brought into their community by the coming of the qallunaat, the white people, in the mid-nineteenth century. Composed in 48 episodes, it recounts the daily life of Sanaaq, a strong and outspoken young widow, her daughter Qumaq, and their small semi-nomadic community in northern Quebec. Here they live their lives hunting seal, repairing their kayak, and gathering mussels under blue sea ice before the tide comes in. These are ordinary extraordinary lives: marriages are made and unmade, children are born and named, violence appears in the form of a fearful husband or a hungry polar bear. Here the spirit world is alive and relations with non-humans are never taken lightly. And under it all, the growing intrusion of the qallunaat and the battle for souls between the Catholic and Anglican missionaries threatens to forever change the way of life of Sanaaq and her young family.About the translation:In the early 1950s, Mitiarjuk Nappaaluk was asked by a priest working in Kangiqsujuaq in northern Quebec to write down some Inuttitut phrases to assist him in the study of the language. At the age of twenty-two, Nappaaluk began writing but did not stop at mere phrases. She invented a group of characters and events and, over the next twenty years, wrote the first Inuit novel, simultaneously reinventing the novel form.Due in part to the perseverance of French anthropologist Bernard Saladin d’Anglure, Sanaaq was first published in syllabic Inuttitut in 1987. His French translation appeared in 2002. This English translation now brings this cornerstone of Inuit literature to Anglophone readers and scholars.",
  "genres": [
    "Indigenous",
    "Fiction",
    "Canada",
    "Historical Fiction",
    "Classics",
    "Native American",
    "20th Century"
  ],
  "author": "Mitiarjuk Nappaaluk",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/18693201-sanaaq"
}