{
  "title": "The Mockingbird Next Door: Life with Harper Lee",
  "description": "To Kill a Mockingbird by Harper Lee is one of the best loved novels of the twentieth century. But for the last fifty years, the novel’s celebrated author, Harper Lee, has said almost nothing on the record. Journalists have trekked to her hometown of Monroeville, Alabama, where Harper Lee, known to her friends as Nelle, has lived with her sister, Alice, for decades, trying and failing to get an interview with the author. But in 2001, the Lee sisters opened their door to Chicago Tribune journalist Marja Mills. It was the beginning of a long conversation—and a great friendship. In 2004, with the Lees’ blessing, Mills moved into the house next door to the sisters. She spent the next eighteen months there, sharing coffee at McDonalds and trips to the Laundromat with Nelle, feeding the ducks and going out for catfish supper with the sisters, and exploring all over lower Alabama with the Lees’ inner circle of friends. Nelle shared her love of history, literature, and the Southern way of life with Mills, as well as her keen sense of how journalism should be practiced. As the sisters decided to let Mills tell their story, Nelle helped make sure she was getting the story—and the South—right. Alice, the keeper of the Lee family history, shared the stories of their family. The Mockingbird Next Door is the story of Mills’s friendship with the Lee sisters. It is a testament to the great intelligence, sharp wit, and tremendous storytelling power of these two women, especially that of Nelle. Mills was given a rare opportunity to know Nelle Harper Lee, to be part of the Lees’ life in Alabama, and to hear them reflect on their upbringing, their corner of the Deep South, how To Kill a Mockingbird affected their lives, and why Nelle Harper Lee chose to never write another novel.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Book Club",
    "Biography Memoir",
    "History",
    "Books About Books"
  ],
  "author": "Marja Mills",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/18693728-the-mockingbird-next-door"
}