{
  "title": "Elisha Magus",
  "description": "Elisha, a barber-surgeon from the poorest streets of benighted fourteenth-century London, has come a long way from home. He was always skilled at his work—but skill alone could not protect him, on the day that disaster left his family ruined and Elisha himself wrongly accused of murder. With no way out, Elisha accepted the offer of Lucius, a haughty physician, to avoid a trial by serving under Lucius as a battle surgeon of the king’s army at the front lines of an unjust war .   Elisha worked night and day, both tending to the wounded soldiers and protecting them from the physician’s experiments. Even so, he soon found that he had a talent for a surprising and deadly sort of magic, and was drawn into the clandestine world of sorcery by the enchanting young witch Brigit—who had baffling ties to his past, and ambitious plans for his future. But even Brigit did not understand the terrible power Elisha could wield, until the day he was forced to embrace it and end the war...by killing the king.   Now, Elisha has become a wanted man—not only of those who’d hate and fear him, but of those who’d seek to woo his support. Because beneath the politics of court and castle are those of power in its purest form: magic. And the players in that deeper game are stranger and more terrifying than Elisha could ever have imagined.   There are the magi, those who have grasped the secrets of affinity and knowledge to manipulate mind and matter, always working behind the scenes. There are indivisi, thought mad by the rest of the magical world: those so devoted to their subject of study that they have become “indivisible” from it, and whose influence in their realm is wondrous beyond even the dreams of “normal” magi. And then there are—there may be—the necromancers, whose methods, motives, and very existence remain mysterious, except to know that where the rumors of their passing go, death follows.   But death follows Elisha, too.   First with his exceptional medical skill, and then with something more, Elisha has always fought against the darkness of his world. Yet as he begins a journey to help rebuild the country he shattered, will he be able to overcome the darkness inside himself?",
  "genres": [
    "Fantasy",
    "Fiction",
    "Magic",
    "Historical Fiction",
    "Historical"
  ],
  "author": "E.C. Ambrose",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/18693602-elisha-magus"
}