{
  "title": "The Ways of the Dead",
  "description": "\"An exciting first novel that echoes the best writing of Pete Hamill and George Pelecanos, mixed with bit of  The Wire  and  True Detective .\"—The Miami HeraldThe electrifying first novel in a new crime series from a veteran Washington, D.C., reporterSarah Reese, the teenage daughter of a powerful Washington, D.C. judge, is dead, her body discovered in a slum in the shadow of the Capitol. Though the police promptly arrest three local black kids, newspaper reporter Sully Carter suspects there’s more to the case. Reese’s slaying might be related to a string of cold cases the police barely investigated, among them the recent disappearance of a gorgeous university student.A journalist brought home from war-torn Bosnia and hobbled by loss, rage, and alcohol, Sully encounters a city rife with its own brand of treachery and intrigue. Weaving through D.C.’s broad avenues and shady backstreets on his Ducati 916 motorcycle, Sully comes to know not just the city’s pristine monuments of power but the blighted neighborhoods beyond the reach of the Metro. With the city clamoring for a conviction, Sully pursues the truth about the murders—all against pressure from government officials, police brass, suspicious locals, and even his own bosses at the paper.A wry, street-smart hero with a serious authority problem, Sully delves into a deeply layered mystery, revealing vivid portraits of the nation’s capital from the highest corridors of power to D.C.’s seedy underbelly, where violence and corruption reign supreme—and where Sully must confront the back-breaking line between what you think and what you know, and what you know and what you can print. Inspired by the real-life 1990s Princeton Place murders and set in the last glory days of the American newspaper, The Ways of the Dead is a wickedly entertaining story of race, crime, the law, and the power of the media. Neely Tucker delivers a flawless rendering of a fast-paced, scoop-driven newsroom—investigative journalism at its grittiest.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Mystery Thriller",
    "Suspense",
    "Book Club"
  ],
  "author": "Neely Tucker",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/18693836-the-ways-of-the-dead"
}