{
  "title": "Big Girls Do It: Volumes 1-4",
  "description": "Enjoy all four of the Big Girls Do It stories in one volume, with special expanded scenes available only in this collection!\nBig Girls Do It Better\nGorgeous, rock-star guys like Chase Delany don't go for girls like me. They go for supermodels and actresses, skinny-girls who never eat and spend all day working out. I'm not that girl. So when he locked his fiery brown eyes on me for the first time, I couldn't quite believe it was really happening to me. It was the second night I spent with him that I'll never forget. The Long Drive Home (bonus short story)\nBig Girls Do It Wetter\nChase went to New York...without me. It was only one night, one delicious, sinful night, but it awakened something within me, and now, with him gone, I have no one to satiate my sudden, ferocious hunger. Then I woke up one day and looked at someone near and dear to me in a whole new light. And my world was rocked once again.\nBig Girls Do It Wilder\nI'm going. Going to New York City to be with gorgeous, mysterious, rockstar Chase Delany seemed like a crazy dream, a fantasy come true. The bright lights and music, and his tight, sexy leather pants called to me...and I answered. Chase might want more and I just might give it to him, if I could only forget what I started with Jeff back in Detroit.I thought I had my love life all figured out, I thought I knew what I wanted, and then things went and changed on me all over again...\nBig Girls Do It On Top\nI fled New York with my heart breaking and a million questions. Foremost in my mind was whether Jeff would even see me after the colossal mess that New York turned out to be. I discovered the answer, but that only spawned even more questions, many of the yes or no variety...",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "Contemporary",
    "Amazon",
    "Fiction",
    "Anthologies"
  ],
  "author": "Jasinda Wilder",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/18698203-big-girls-do-it"
}