{
  "title": "Diary of the Dark Years, 1940-1944: Collaboration, Resistance, and Daily Life in Occupied Paris",
  "description": "Jean Guéhenno's Diary of the Dark Years, 1940-1945 is the most oft-quoted piece of testimony on life in occupied France. A sharply observed record of day-to-day life under Nazi rule in Paris and a bitter commentary on literary life in those years, it has also been called \"a remarkable essay on courage and cowardice\" (Caroline Moorehead, Wall Street Journal). Here, David Ball provides not only the first English-translation of this important historical document, but also the first ever annotated, corrected edition. Guéhenno was a well-known political and cultural critic, left-wing but not communist, and uncompromisingly anti-fascist. Unlike most French writers during the Occupation, he refused to pen a word for a publishing industry under Nazi control. He expressed his intellectual, moral, and emotional resistance in this diary: his shame at the Vichy government's collaboration with Nazi Germany, his contempt for its falsely patriotic reactionary ideology, his outrage at its anti-Semitism and its vilification of the Republic it had abolished, his horror at its increasingly savage repression and his disgust with his fellow intellectuals who kept on blithely writing about art and culture as if the Occupation did not exist - not to mention those who praised their new masters in prose and poetry. Also a teacher of French literature, he constantly observed the young people he taught, sometimes saddened by their conformism but always passionately trying to inspire them with the values of the French cultural tradition he loved. Guéhenno's diary often includes his own reflections on the great texts he is teaching, instilling them with special meaning in the context of the Occupation. Complete with meticulous notes and a biographical index, Ball's edition of Guéhenno's epic diary offers readers a deeper understanding not only of the diarist's cultural allusions, but also of the dramatic, historic events through which he lived.",
  "genres": [
    "History",
    "France",
    "Nonfiction",
    "World War II",
    "War",
    "20th Century",
    "Memoir"
  ],
  "author": "Jean Guéhenno",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/18695441-diary-of-the-dark-years-1940-1944"
}