{
  "title": "The Sharing Spoon",
  "description": "A Christmas star shines brightly in the Western skies, bringing hope, love, and miracles in three unforgettable stories of romance trimmed with the holiday traditions of Native America. The Sharing SpoonCynthia intends to show her inner-city classroom that Santa does not forget about children. For Kyle Bear Soldier, donating part of his fortune is not just about giving money away, but about offering the hope that helped him rise from a dirt-poor childhood on a reservation. Can two people from different worlds make miracles happen if they share the same dream? The Wolf and the LambAs Christmas 1879 approaches, Boston-bred Emily Lambert arrives in the wilds of the Dakota Territory to find that her mail-order husband has died and left two young daughters for her to raise. While guarding his heart, gunslinger Wolf Morsette, himself an outcast, reluctantly takes the trio under-wing. With only the promise of the season to bolster their spirits, a fragile group sets out on a heart-wrenching journey across the frigid prairie in search of a welcoming home where love, acceptance, and new beginnings prove there is always room at the inn. The Twelfth MoonSergeant Luke Tracker is a confirmed career-army man, and he's only dropping in for the holidays to make his sister, Frances, happy for a while. He'll spend a few days with their family, enjoy a dose of traditional celebrations, play Santa at the school where Frances teaches-easy.Hope Spencer has no idea that her friend Frances is about to play Mistletoe Matchmaker. Until she lands on Luke Tracker's knee. Bestselling author Kathleen Eagle set aside a gratifying seventeen-year teaching career on a North Dakota Indian reservation to become a full-time novelist. The Lakota Sioux heritage of her husband-and thus of their three children-has inspired many of her stories. Among her other honors, she has received Romance Writers of America's prestigious RITA Award.",
  "genres": [
    "Christmas",
    "Native American",
    "Historical",
    "Contemporary Romance",
    "Anthologies"
  ],
  "author": "Kathleen Eagle",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/18701441-the-sharing-spoon"
}