{
  "title": "Trans Bodies, Trans Selves: A Resource for the Transgender Community",
  "description": "There is no one way to be transgender. Transgender and gender non-conforming people have many different ways of understanding their gender identities. Only recently have sex and gender been thought of as separate concepts, and we have learned that sex (traditionally thought of as physical or biological) is as variable as gender (traditionally thought of as social). While trans people share many common experiences, there is immense diversity within trans communities. There are an estimated 700,000 transgendered individuals in the US and 15 million worldwide. Even still, there's been a notable lack of organized information for this sizable group. Trans Bodies, Trans Selves is a revolutionary resource-a comprehensive, reader-friendly guide for transgender people, with each chapter written by transgender or genderqueer authors. Inspired by Our Bodies, Ourselves, the classic and powerful compendium written for and by women, Trans Bodies, Trans Selves is widely accessible to the transgender population, providing authoritative information in an inclusive and respectful way and representing the collective knowledge base of dozens of influential experts. Each chapter takes the reader through an important transgender issue, such as race, religion, employment, medical and surgical transition, mental health topics, relationships, sexuality, parenthood, arts and culture, and many more. Anonymous quotes and testimonials from transgender people who have been surveyed about their experiences are woven throughout, adding compelling, personal voices to every page. In this unique way, hundreds of viewpoints from throughout the community have united to create this strong and pioneering book. It is a welcoming place for transgender and gender-questioning people, their partners and families, students, professors, guidance counselors, and others to look for up-to-date information on transgender life.",
  "genres": [
    "Nonfiction",
    "Queer",
    "Gender",
    "LGBT",
    "Transgender",
    "Psychology",
    "Health"
  ],
  "author": "Laura Erickson-Schroth",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/18695382-trans-bodies-trans-selves"
}