{
  "title": "A Second Chance for Christmas",
  "description": "When Nathan Wyler’s adored wife Emily dies tragically in a car accident in December his entire world collapses around him. He immerses himself in work, doing everything he can to escape the grief and ends up neglecting his young son, Stefan, in the process - alienating himself from everybody he loves. Things are made worse still by Emily’s father, Xavier, who blames his son-in-law for the death of his brilliant young daughter.As the years pass, Stefan is denied contact with his grandparents and starved of his father’s affections. As a result he becomes increasingly close to Kate, a substitute teacher at his school. An understanding and gentle woman, Kate is quick to identify the impact of Nathan’s selfish actions on his young son. As her bond with the Stefan flourishes, she visits Nathan at work in an attempt to make him aware of the emotional strain he’s been inflicting on the innocent boy. Preparing herself for a tempestuous encounter with Nathan, Kate is shocked to instead find a vulnerable, grief-stricken figure desperate to be saved, and a potent mutual attraction becomes clear to them both. Nathan finds solace in the calming influence of this mysterious young woman, and, with her help, begins to reconcile his relationship with Stefan. Unbeknownst to him, Kate even brokers a successful meeting with Emily’s father and the two settle their differences over Christmas dinner. All may not be as it seems with Kate though, as Nathan slowly begins to piece together the feeling of familiarity he had experienced when they first met. As her good deeds continue and Christmas draws closer, the Wyler family begin to realise that she may not be who she claims to be. But who else could this ethereal samaritan be, and why does she seem so familiar to Nathan?",
  "genres": [],
  "author": "Nashin Sadeer",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/18695749-a-second-chance-for-christmas"
}