{
  "title": "Blood Red",
  "description": "Rosamund is an Earth Master in the Schwarzwald, the ancient Black Forest of Germany. Since the age of ten, she has lived with her teacher, the Hunt Master and Earth Magician of the Schwarzwald Foresters, a man she calls “Papa.” Her adoptive Papa rescued her after her original Earth Master teacher, an old woman who lived alone in a small cottage in the forest, was brutally murdered by werewolves. Rosa herself barely escaped, and this terrifying incident molded the course of her future. For like her fellow Earth Masters of the Schwarzwald Lodge, Rosa is not a healer. Instead, her talents lead her on the more violent path of protection and defense— “cleansing” the Earth and protecting its gentle fae creatures from those evil beings who seek to do them harm. And so Rosa becomes the first woman Hunt Master and the scourge of evil creatures, with a deadly specialty in werewolves and all shape­shifters. While visiting with a Fire Master—a friend of her mentor from the Schwarzwald Lodge— Rosa meets a pair of Elemental Magicians from Hungary who have come looking for help. They suspect that there is a dark power responsible for a string of murders happening in the remote countryside of Transylvania, but they have no proof. Rosa agrees to help them, but there is a catch: one of the two men asking for aid is a hereditary werewolf. Rosa has been taught that there are three kinds of werewolves. There are those, like the one that had murdered her teacher, who transform themselves by use of dark magic, and also those who have been infected by the bite of these magical werewolves—these poor victims have no control over their transforma­tive powers. Yet, there is a third kind: those who have been born with the ability to trans­form at will. Some insist that certain of these hereditary werewolves are benign. But Rosa has never encountered a benign werewolf! Can she trust this Hungarian werewolf? Or is the Hunter destined to become the Hunted?",
  "genres": [
    "Fantasy",
    "Fiction",
    "Fairy Tales",
    "Magic",
    "Paranormal",
    "Historical Fiction",
    "Werewolves"
  ],
  "author": "Mercedes Lackey",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/18693942-blood-red"
}