{
  "title": "Neptune: Allied Invasion of Europe and the D-Day Landings",
  "description": "Seventy years ago, more than six thousand Allied ships carried more than a million soldiers across the English Channel to a fifty-mile-wide strip of the Normandy coast in German-occupied France. It was the greatest sea-borne assault in human history. The code names given to the beaches where the ships landed the soldiers have become immortal: Gold, Juno, Sword, Utah, and especially Omaha, the scene of almost unimaginable human tragedy. The sea of crosses in the cemetery sitting today atop a bluff overlooking the beaches recalls to us its cost. Most accounts of this epic story begin with the landings on the morning of June 6, 1944. In fact, however, D-Day was the culmination of months and years of planning and intense debate. In the dark days after the evacuation of Dunkirk in the summer of 1940, British officials and, soon enough, their American counterparts, began to consider how, and, where, and especially when, they could re-enter the European Continent in force. The Americans, led by U.S. Army Chief of Staff General George C. Marshall, wanted to invade as soon as possible; the British, personified by their redoubtable prime minister, Winston Churchill, were convinced that a premature landing would be disastrous. The often-sharp negotiations between the English-speaking allies led them first to North Africa, then into Sicily, then Italy. Only in the spring of 1943, did the Combined Chiefs of Staff commit themselves to an invasion of northern France. The code name for this invasion was Overlord, but everything that came before, including the landings themselves and the supply system that made it possible for the invaders to stay there, was code-named Neptune. Craig L. Symonds now offers the complete story of this Olympian effort, involving transports, escorts, gunfire support ships, and landing craft of every possible size and function. The obstacles to success were many. In addition to divergent strategic views and cultural frictions, the Anglo-Americans had to overcome German U-boats, Russian impatience, fierce competition for insufficient shipping, training disasters, and a thousand other impediments, including logistical bottlenecks and disinformation schemes. Symonds includes vivid portraits of the key decision-makers, from Franklin Roosevelt and Churchill, to Marshall, Dwight Eisenhower, and Admiral Sir Bertram Ramsay, who commanded the naval element of the invasion. Indeed, the critical role of the naval forces--British and American, Coast Guard and Navy--is central throughout. In the end, as Symonds shows in this gripping account of D-Day, success depended mostly on the men themselves: the junior officers and enlisted men who drove the landing craft, cleared the mines, seized the beaches and assailed the bluffs behind them, securing the foothold for the eventual campaign to Berlin, and the end of the most terrible war in human history.",
  "genres": [
    "History",
    "World War II",
    "Nonfiction",
    "Military Fiction",
    "Military History",
    "War",
    "20th Century"
  ],
  "author": "Craig L. Symonds",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/18699144-neptune"
}