{
  "title": "Book from the Ground: From Point to Point",
  "description": "A book without words, recounting a day in the life of an office worker, told completely in the symbols, icons, and logos of modern life. Twenty years ago I made Book from the Sky, a book of illegible Chinese characters that no one could read. Now I have created Book from the Ground, a book that anyone can read.--Xu BingFollowing his classic work Book from the Sky, the Chinese artist Xu Bing presents a new graphic novel--one composed entirely of symbols and icons that are universally understood. Xu Bing spent seven years gathering materials, experimenting, revising, and arranging thousands of pictograms to construct the narrative of Book from the Ground. The result is a readable story without words, an account of twenty-four hours in the life of \"Mr. Black,\" a typical urban white-collar worker.Our protagonist's day begins with wake-up calls from a nearby bird and his bedside alarm clock; it continues through tooth-brushing, coffee-making, TV-watching, and cat-feeding. He commutes to his job on the subway, works in his office, ponders various fast-food options for lunch, waits in line for the bathroom, daydreams, sends flowers, socializes after work, goes home, kills a mosquito, goes to bed, sleeps, and gets up the next morning to do it all over again. His day is recounted with meticulous and intimate detail, and reads like a postmodern, post-textual riff on James Joyce's account of Bloom's peregrinations in Ulysses. But Xu Bing's narrative, using an exclusively visual language, could be published anywhere, without translation or explication; anyone with experience in contemporary life--anyone who has internalized the icons and logos of modernity, from smiley faces to transit maps to menus--can understand it.",
  "genres": [
    "Fiction",
    "Art",
    "Graphic Novels",
    "Poetry",
    "China",
    "Comics",
    "Sequential Art"
  ],
  "author": "Xu Bing",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/18699225-book-from-the-ground"
}