{
  "title": "The Tragic Fate of Moritz Tot",
  "description": "The novel was originally published in 2008 in Serbia, where it was shortlisted for the Serbian Academy of Sciences and Arts annual best novel award.It opens with the narrative of former punk rocker Moritz Tot, who, following an unexpected call from the Employment Office, becomes a prompter for the Budapest Opera. He finds himself in a bewildering situation as he tries to cope on stage while sitting in a small, rudimentary wooden box, realizing that the text of Puccini’s Turandot is in Italian of which he can not speak a word. As it progresses, Moritz's story grows even more bizarre and assumes elements of a thriller when a mysterious stranger enters the \"scene\" and begins to pursue him, monitoring his every move. In the second narrative, which runs parallel to Moritz's story, Tobias Keller is put on trial for \"having connected the Extraordinary Activity Device to the faculty of his free will with the intention of exerting his influence on subject Moritz Tot\". While switching between the two narratives, we begin to understand how the two story-lines and their characters are linked.As the plot in Moritz's world develops in the atmospheric style of Kafka and Bulgakov (as critics have described it), Tobias Keller discusses with the Disciplinary Committee the life path of Motitz Tot, which consequently causes them to debate over age-old questions concerning the human condition, such as the issue of determinism vs. free will, moral responsibility, faith vs. religion (making references to Hume, Kant, Kierkegaard, etc.). All this eventually builds up to an unexpected conclusion where all the pieces of the puzzle finally come together and the connection between the two storylines is fully elucidated.The Tragic Fate of Moritz Tot offers not only an intricate plot line and the pull of a suspense thriller, but it also provides serious reading material for the philosophically minded reader seeking a layered work with multiple subtexts.",
  "genres": [
    "Fiction",
    "Novels"
  ],
  "author": "Dana Todorović",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/18694064-the-tragic-fate-of-moritz-tot"
}