{
  "title": "Ghost Stories",
  "description": "A couple on their way to Tucson for a family reunion approaches a deserted town. Car troubles force them to stop and with no cell service they walk through town in hopes that it isn’t as abandoned as it seems. On their way they meet up with Sam, an elderly gentleman, and quite likely the last living resident. After using his phone to call for a tow the couple, Adam and Renee, find that they are stranded for the night and to pass the time they decide to explore. Sam warns against it and tells them that they should head out of town now…before it’s too late. Adam and Renee don’t heed the warning and it isn’t long before they find out what a grave mistake they’ve made. Death surrounds the town and not everything is as it seems. It will take every ounce of resolve they possess in order to survive until they can be rescued, and fate is not on their side.Four friends head up a dark and desolate road that cuts a winding path through overgrown woods on their way to a forgotten place that once prompted laughs and good times, but now only commands death and sorrow. When they pull into the weed choked parking lot, Sierra has her doubts about the place, but she along with friends Brandon and Mark, are there to support their friend Kelly. Years ago her sister died brutally at the park and justice wasn’t served. It’s Kelly’s hope to say goodbye to her sister and leave the past behind her. However, something still lives in the park, and the last thing it’s seeking is a good time. The four friends find their belated wake of Kelly’s sister interrupted by strange happenings and echoes from a vengeful spirit who will stop at nothing to achieve its revenge. What starts out as a night of remembrance turns into a night of hell and not everyone will make it out.When Mia’s uncle, a writer, decides to rent the keeper’s quarters at a purportedly haunted lighthouse a mile off the northeast coast to use as a muse to his writing, he sends her and two of her friends out to take a look. While it’s important that they determine that the structure is sound enough to live in, Mia’s uncle also wants to know that it is genuinely haunted. Ignoring warnings from the captain of the ferry that transported them out to the forsaken islet, Mia, Brian and Lisa disembark to find that the stories didn’t do the house justice. From the start they are tormented by doors that open, close and lock on their own, haunting apparitions, icy chills and a malevolent spirit the likes of which none of them have ever seen before. However, when the entity captures the body of one of the friends, it becomes a battle of survival for all.",
  "genres": [
    "Horror"
  ],
  "author": "Sherlyn Colgrove",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/18709756-ghost-stories"
}