{
  "title": "The Aventures of Alys in Wondyr Lond: Alice's Adventures in Wonderland in Middle English",
  "description": "Middle English is the name commonly given to the forms of English current from about 1100 to roughly 1500, between pre-Conquest Old English, which is hardly intelligible today without special study, and the early modern English of Shakespeare and his contemporaries. Of course it changed considerably during that period, and different dialects existed in various geographical areas. The form of Middle English used in this translation is for the most part the East Midland and London dialect of writers like Chaucer in the fourteenth century, which is the direct ancestor of our modern standard form of English. It is not hard to read with a little practice, but an extensive glossary has been provided to assist the reader where necessary. Imagining what Londoners of the fourteenth or fifteenth centuries might have made of Lewis Carroll's \"Alice's Adventures in Wonderland\" provides a historical perspective not only on Chaucer's fourteenth century and Carroll's nineteenth, but on our own time as well. The self-opinionated Victorian child whose delightfully illogical adventures down the rabbit-hole are so contrary to the order and regularity of her life in the waking world receives an education in \"otherness\" that is both a critique of contemporary society and an enjoyable children's fairytale. Adapting this to a medieval milieu has required changes not only of language but of costume and customs as well. While we have sought to keep both text and illustrations as close as possible to Carroll's and Tenniel's originals, it is probably the differences that will be of most interest. Following Chaucer's practice in his fiction, Carroll's prose has been translated into Middle English verse. In the illustrations Alice wears the sort of clothes a child of roughly equivalent social standing might have worn. Dodos and flamingoes were unknown in medieval England, but Phoenix and swans will do instead. Judges did not wear wigs, but Serjeants at law were distinguished by the coif. Parodies of medieval poetry replace some of Carroll's parodies of poems Alice gets wrong, poems Victorian children may have been taught. Puns on tail and tale are possible in Middle English, but those on tea and on tortoise are not; suitable substitutes have however been found. Carroll's \"Laughing and Grief,\" for \"Latin and Greek,\" have become the \"Wlaffyng and Gristbitunge\" which seemed to a fourteenth-century author to describe the uncouth dialects of the North which he could not appreciate. The Caterpillar's hookah has become an alembic, for the medieval Catirpel has been turned into an alchemist searching for the philosopher's stone that will change base metals into gold. Notions of physics, geography, and astronomy altered radically between Chaucer's time and Carroll's, to say nothing of our own. A medieval Alice's education would have been rather different from her Victorian counterpart's. She can teach the Duchess something of the Ptolemaic, but not the Copernican, system of astronomy. She has learnt some Latin from her brother's \"donat,\" or elementary textbook written by Aelius Donatus as long ago as the fourth century AD. She may not have lived as much under the sea as the Mokke Se-Tortus has, where the school he went to unnecessarily offered \"wasschyng\" as an extra, but she can be surprised by his strange versions of the medieval course of education the Trivium and Quadrivium. The so-called \"Middle\" Ages seemed entirely modern to those who lived in them, but at this distance it may not be easy to appreciate what life and mental attitudes were like so long ago. So how should one read a translation into Middle English of Alice's Adventures in Wonderland? As the King advised the White Rabbit, about to read out, aloud, from a paper picked up on the court room floor, \"Begin at the beginning, ... go on till you come to the end: then stop.\" And if at first sight there does not appear to be \"an atom of meaning in it,\" closer inspection may reveal so",
  "genres": [
    "Fantasy",
    "Fiction",
    "Childrens",
    "Classics",
    "Audiobook",
    "Adventure",
    "Middle Grade"
  ],
  "author": "Lewis Carroll",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/18702017-the-aventures-of-alys-in-wondyr-lond"
}