{
  "title": "Denying Heaven",
  "description": "The third book in the Room 103 series--Bulk’s story Love triangles… nasty things! Especially if one of the trio is dead. Bulk fell in love at sixteen. Shona was his heart, his soul, the meaning of his life. Then she was killed… suddenly, horrifically and brutally. He never had the chance to say goodbye, never had the chance to tell her how much he loved her. How much he breathed for her and how much her pregnancy with his child energized his life to the point of a motivation he had never experienced before. Seven long, lonely, painful and comatose years later, Spirit, a guitarist for River’s Ink, takes Bulk’s shit, wraps it up and sucks it dry. She takes his grief and kicks it to the curb. She fights against him, with him and for him. She wants him; she needs him and God, if he doesn’t need her right the hell back. She’s everything Shona was; fun, full of live and so utterly breath taking she steals his breath with every smile, every word that leaves her pretty lips and each naughty twinkle in her eye. But is Spirit what he actually needs to revive his life? When Spirit’s secrets, a face from her past and her uncontrollable addiction to drugs and alcohol show their ugly heads, will Bulk shake his head and declare a final ‘No’ to life, or will he hold her tight, pull her close and fight her demons with her? Will their fight for each other resurrect their deceased souls or will it invite the Devil to finally, once and for all, swallow them whole? Out of suffering have emerged the strongest souls; the most massive characters are sealed with scars. Khalil Gibran This book contains explicit sex scenes, strong language, violence and substance abuse… oh, and one hell of an alpha male. It is recommended that tissues are on stand-by and a shoulder is available to cry on.",
  "genres": [
    "Romance",
    "Erotica",
    "Music",
    "Contemporary Romance",
    "Abuse",
    "Musicians",
    "New Adult"
  ],
  "author": "D.H. Sidebottom",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/18704932-denying-heaven"
}