{
  "title": "Untold",
  "description": "A modern, magical twist on the Gothic Romance and Girl Detective genres, the Lynburn Legacy books will appeal to fans of both Beautiful Creatures and the Mortal Instruments series. Reviewers have praised the take-charge heroine and the spellbinding romance.\"A sparkling fantasy that will make you laugh and break your heart.\" --Cassandra Clare, New York Times bestselling authorIt's time to choose sides. . . .In this second book in the Lynburn Legacy, the sorcerous roots of Sorry-in-the-Vale have been exposed. No one in the town is safe, and a decision must be made: pay the sorcerers' blood sacrifice, or fight. Will the townspeople (magical and not) become \"owned\" by the sorcerers who believe it is their right to rule? If Kami Glass has anything to say about it, evil will not win. Despite having given up her own piece of magic, she is determined to do everything she can to make a difference. And whether they want to or not, her circle of friends (and potential boyfriends) will not be able to help but go along with her unusual tactics.Sarah Rees Brennan's darkly humorous take on Gothic romace makes it hard to put this book down. As co-author with Cassandra Clare on the bestselling Bane Chronicles, Sarah Rees Brennan has mastered the art of the page turner.\"A darkly funny, deliciously thrilling Gothic.\" --Kelley Armstrong, New York Times bestselling author\"Readers will laugh, shiver, and maybe even swoon over this modern Gothic novel.\" --Melissa Marr, New York Times bestselling author\"Breathtaking--a compulsive, rocketing read.\"--Tamora Pierce, New York Times bestselling author\"Captures the reader with true magic.\"--Esther Friesner, author of Nobody's Princess\"A laugh-out-loud delight.\" --Publishers WeeklyFrom the Hardcover edition.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Paranormal",
    "Romance",
    "Magic",
    "Urban Fantasy",
    "Gothic"
  ],
  "author": "Sarah Rees Brennan",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/18710297-untold"
}