{
  "title": "Crown of Slaves",
  "description": "A NEW SERIES SET IN THE \"HONORVERSE\" OF HONOR HARRINGTONThe Star Kingdom's ally Erewhon is growing increasingly restive in the alliance because the new High Ridge regime ignores its needs. Added to the longstanding problem of a slave labor planet controlled by hostile Mesans in Erewhon's stellar backyard, which High Ridge refuses to deal with, the recent assassination of the Solarian League's most prominent voice of public conscience indicates the growing danger of political instability in the Solarian League—which is also close to Erewhon.In desperation, Queen Elizabeth tries to defuse the situation by sending a private mission to Erewhon led by Captain Zilwicki, accompanied by one of her nieces. When they arrive on Erewhon, however, Manticore's envoys find themselves in a mess. Not only do they encounter one of the Republic of Haven's most capable agents—Victor Cachat—but they also discover that the Solarian League's military delegation seems up to its neck in skullduggery.And, just to put the icing on the cake, the radical freed slave organization, the Audubon Ballroom, is also on the scene—led by its notorious and ruthless assassin, Jeremy X.At the publisher's request, this title is sold without DRM (Digital Rights Management).With over seven million copies of his books in print and seventeen titles on the New York Times bestseller list, David Weber is the science fiction publishing phenomenon of the new millennium. In the hugely popular Honor Harrington series, the spirit of C.S. Forester’s Horatio Hornblower and Patrick O’Brian’s Master and Commander lives on–into the galactic future. Books in the Honor Harrington series have appeared on seventeen best seller lists, including those of The Wall Street Journal, The New York Times, and USA Today. While Weber is best known for his spirited, modern‑minded space operas, he is also the creator of the Oath of Swords fantasy series and the Dahak science fiction saga. Weber has also engaged in a steady stream of bestselling collaborations, including his Starfire series with Steve White, which produced the New York Times bestseller The Shiva Option among others. Weber’s collaboration with alternate history master Eric Flint led to the bestselling 1634: The Baltic War, and his planetary adventure novels with military science fiction ace and multiple national best‑seller John Ringo includes the blockbusters March to the Stars and We Few. Finally, Weber’s teaming with Linda Evans produced the bestselling Multiverse series. David Weber makes his home in South Carolina with his wife and children.Eric Flint is a new master of science fiction. His alternate-history novel 1632 received lavish critical praise from all directions and enjoyed high sales. The sequel, 1633, written in collaboration with David Weber, has also been highly praised and popular. His first novel, Mother of Demons, was picked by Science Fiction Chronicle as a best novel of the year. He has also shown a powerful gift for humorous fantasy adventure with Forward the Mage and The Philosophical Strangler, which Booklist described as \"Monty Python let loose in Tolkien's Middle Earth.\" With David Drake he has collaborated on five novels in the popular \"Belisarius\" series, and is working on the sixth, The Dance of Time.",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Military Fiction",
    "Military Science Fiction",
    "Science Fiction Fantasy",
    "Space"
  ],
  "author": "David Weber",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/18704384-crown-of-slaves"
}