{
  "title": "Detox, Big Time! 11 guidlines for Boundless health. Fatigue, pain, weight problems...STOP.",
  "description": "Librarian's note: This is an alternate cover edition for ASIN B00F1I95WA.Why a detox diet is an essential solution against the outside aggressions of the modern world filled with stress and pollution ?Health: it is a question of choice ! Whether you want: - An accessible and efficient diet to boost your immune system on a long term basis. - To lose weight in a healthy way, by taking away pain. In this guidebook you will find a simple and sound method to get you started. The ancients knew that it was good to regularly purify oneself by dieting or fasting. The religions have even made this one of their cornerstones. But what is left of it today? Nowadays however, more than any other time, our bodies are subject to constant aggressions found in the air, water, and food, as well as on a psychological level (repeated stress). Our bodies endlessly accumulate toxins, without being able to eliminate them….or not sufficiently. And if this generalized \"clogging\" would be the well-known breeding-ground of our civilization’s disease? This is a plausible hypothesis that has been taken over by more and more doctors and researchers from all the countries; they have been alarmed by the exponential expansion of this scourge. The Spring diet is a well-known diet and certainly the most efficient detox diet. This will be partly covered in this book. Needless to say, the practice of cellular detoxination needs to be integrated in our daily lives. This is what this book has to offer: a healthy and efficient detox method, that is adjustable to your liking and to the different seasons. This detox diet is based on cutting-edge research on nutrition, and is natural and accessible to all. Other things you will find in this book, amongst other things:What foods to avoid or to treat yourself with?The huge benefit of food rotation (this is a key element for having a healthy and anti-inflammatory diet).What is the best water that \"cleanses\" your body, and how to obtain it.How to eliminate stress in 3 minutes ( a not well-known method even though it has been proven scientifically for its benefits).The most useful and accessible supplements ( to regenerate the liver, kidneys and intestines and other).A recap chart is presented at the end of this book with numerous examples of recipes and food rotations…Caroline Benson gives you her knowledge and her 15 year experience and research in nutrition and health. This book is an all inclusive manual of well- being at a price of a coffee….. The preface is written by Christine Van Hoof, a dietician and coach. \"Our health is more important than gold\" said Caïus Cornelius Gallus in the 1st century BC. So, what are you waiting for to take responsibility for your health? The E-ditions MeM",
  "genres": [],
  "author": "Caroline Benson",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/18711641-detox-big-time-11-guidlines-for-boundless-health-fatigue-pain-weigh"
}