{
  "title": "Love Among the Chickens",
  "description": "From the Publisher After seeing his friend Stanley Featherstonehaugh Ukridge for the first time in years, Jeremy Garnet is dragged along on holiday to Ukridge's new chicken farm in Dorset. Hilarious situations abound with Garnet's troublesome courting of a girl living nearby and the struggles on the farm, which are worsened by Ukridge's bizarre business ideas and methods. This was Wodehouse's first novel published in the United States, and the only one to feature the recurring character Stanley Featherstonehaugh Ukridge. Biography Pelham Grenville Wodehouse was born in 1881 in Guildford, the son of a civil servant, and educated at Dulwich College. He spent a brief period working for the Hong Kong and Shanghai Bank before abandoning finance for writing, earning a living by journalism and selling stories to magazines. An enormously popular and prolific writer, he produced about 100 books. In Jeeves, the ever resourceful \"gentleman's personal gentleman\", and the good-hearted young blunderer Bertie Wooster, he created two of the best known and best loved characters in twentieth century literature. Their exploits, first collected in Carry On, Jeeves, were chronicled in fourteen books, and have been repeatedly adapted for television, radio and the stage. Wodehouse also created many other comic figures, notably Lord Emsworth, the Hon. Galahad Threepwood, Psmith and the numerous members of the Drones Club. He was part-author and writer of fifteen straight plays and 250 lyrics for some 30 msical comedies. The Times hailed him as a \"comic genius recognized in his lifetime as a classic and an old master of farce.\" P. G. Wodehouse said, \"I believe there are two ways of writing novels. One is mine, making a sort of musical comedy without music and ignoring real life altogether; the other is going right deep down into life and not caring a damn ....\" Wodehouse married in 1914 and took American citizenship in 1955. He was created a Knight of the British Empire in the 1975 New",
  "genres": [
    "Fiction",
    "Humor",
    "Classics",
    "Audiobook",
    "Comedy",
    "Romance",
    "British Literature"
  ],
  "author": "P.G. Wodehouse",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/11022290-love-among-the-chickens"
}