{
  "title": "What Hath God Wrought: The Transformation of America, 1815 - 1848",
  "description": "The Oxford History of the United States is by far the most respected multi-volume history of our nation. In this Pulitzer prize-winning, critically acclaimed addition to the series, historian Daniel Walker Howe illuminates the period from the battle of New Orleans to the end of the Mexican-American War, an era when the United States expanded to the Pacific and won control over the richest part of the North American continent.A panoramic narrative, What Hath God Wrought portrays revolutionary improvements in transportation and communications that accelerated the extension of the American empire. Railroads, canals, newspapers, and the telegraph dramatically lowered travel times and spurred the spread of information. These innovations prompted the emergence of mass political parties and stimulated America's economic development from an overwhelmingly rural country to a diversified economy in which commerce and industry took their place alongside agriculture. In his story, the author weaves together political and military events with social, economic, and cultural history. Howe examines the rise of Andrew Jackson and his Democratic party, but contends that John Quincy Adams and other Whigs--advocates of public education and economic integration, defenders of the rights of Indians, women, and African-Americans--were the true prophets of America's future. In addition, Howe reveals the power of religion to shape many aspects of American life during this period, including slavery and antislavery, women's rights and other reform movements, politics, education, and literature. Howe's story of American expansion culminates in the bitterly controversial but brilliantly executed war waged against Mexico to gain California and Texas for the United States.Winner of the New-York Historical Society American History Book PrizeFinalist, 2007 National Book Critics Circle Award for NonfictionThe Oxford History of the United StatesThe Oxford History of the United States is the most respected multi-volume history of our nation. The series includes three Pulitzer Prize winners, a New York Times bestseller, and winners of the Bancroft and Parkman Prizes. The Atlantic Monthly has praised it as \"the most distinguished series in American historical scholarship,\" a series that \"synthesizes a generation's worth of historical inquiry and knowledge into one literally state-of-the-art book.\" Conceived under the general editorship of C. Vann Woodward and Richard Hofstadter, and now under the editorship of David M. Kennedy, this renowned series blends social, political, economic, cultural, diplomatic, and military history into coherent and vividly written narrative.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Politics",
    "American",
    "19th Century",
    "Audiobook"
  ],
  "author": "Daniel Walker Howe",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/1102243.What_Hath_God_Wrought"
}