{
  "title": "Jamie's Poop Gas, Parsnips, Pants and Romance",
  "description": "Are you asking this question?\"What kinda book title is that?\"Or this?\"And why are those words even in the same sentence?\"Well, in the not-so-distant future, Poop Gas, Parsnips and Pants were our only hope, three critical ingredients of the most unlikely invention that ever was. A genius invention that everyone needed, but nobody wanted and it would have sunk without trace had it not been for the belief of a 13 year-old scientist, the ingenuity of local residents and the utter desperation of millions of British people trying to survive the coldest November on record without power. With oil supplies exhausted and only six weeks worth of gas left, science mad teenager, Jamie Gumthorpe, declares to his cold and hungry family that he may have just invented the answer to the world’s energy crisis. Standing in his kitchen early one Sunday morning, and wearing a pair of Wind Regeneration Pants over his jeans, Jamie explains that they can absorb poop gas and turn it into usable energy.\"Oh come on!\"I hear you cry. (That’s also what his family said by the way.)I kid you not, and if you just hold your horses for a second, I’ll explain how it works. The Pants are filled with charcoal, not just any old charcoal you understand, but charcoal made from frazzling dozens of parsnips into fine particles. These particles absorb your room-clearers and transfer them through a tube into a handy metal canister, which is then used to power a turbine compressor to produce electricity. Simples!\"Hang on a minute!\"Oh, what now?\"How does your poop gas get through your jeans and into the pants then?\"Do you really want that much detailed information before you’ve even downloaded the book? You do?...ok, but it’s technical, so don’t say I didn’t warn you.Your jockie-burners pass through the porous fibres of your clothes in a millisecond (that’s why you get a horrid smell seconds after you’ve done one) but Wind Regeneration Pants are made from non-porous material and trap the escaping gases as they are drawn in through a small, polyester mesh inlet, positioned next to your fume cabinet, before absorbing them into the fine particles of charcoal.\"What's a fume cabinet?\"Download the book.\"How long is a millisecond?\"Download the book!\"Where's the romance?\"Down load the...eh? What romance?\"Er, it's in the title.\"Ahh...yes, the romance. It still amazes me that Jamie even had the time. But Chloe was different; she was the first girl he’d ever spoken to, apart from his sister, and definitely the first girl that had ever fancied him. Love was in the air, but would it be overpowered by the vile smell of bottom burps lingering above Great Britain? Would Jamie be able to convince his family, friends, classmates and teachers to recycle their bunshakers to save our glorious nation? And what happened when the Prime Minister offered a £100,000 reward for the best energy ideas? Someone tried to steal Jamie’s Pants, that’s what happened!Any questions?\"Yes, you seem to know rather a lot of ways to describe a fart.\"I do, and there are over one hundred others in the book but I only use the FART word once; so good luck finding",
  "genres": [],
  "author": "Stephen Wray",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18710299-jamie-s-poop-gas-parsnips-pants-and-romance"
}