{
  "title": "The New Oxford American Dictionary",
  "description": "An American dictionary--in the Oxford tradition. Produced by Oxford's U.S. Dictionaries Program, and drawing on the expertise of scores of American scholars and advisors, The New Oxford American Dictionary sets the standard of excellence for lexicography in this country. Here is the most accurate and richly descriptive picture of American English ever offered in any dictionary. Oxford's American editors drew on our 200-million-word databank of contemporary North American English, plus the unrivaled citation files of the world-renowned Oxford English Dictionary. We started with American evidence--an unparalleled resource unique to Oxford. Our staff logged more than 50 editor-years, checking every entry and every definition. Oxford's ongoing North American Reading Program, begun in the early 1980s, keeps our lexicographers in touch with fresh evidence of our language and usage--in novels and newspapers, in public records and magazines. To provide unprecedented clarity, the entries are organized around core meanings, eliminating clutter and confusion, especially in longer entries. Rather than a litany of numbered senses, the structure of each entry plainly shows the major meaning or meanings of the word, plus any related senses, supplemented by illustrative, in-context examples of actual usage. In short, The New Oxford American Dictionary is designed to serve the user clearly, simply, and quickly, with a full measure of information value and precise guidance. Truly a revolution in the art and craft of dictionary-making, The New Oxford American Dictionary provides the in-depth and up-to-date coverage that all users need and expect--for reading and study, for technical terms, for language guidance. It continues the tradition of scholarship and lexicographic excellence that are the hallmarks of every Oxford dictionary.",
  "genres": [
    "Reference",
    "Nonfiction",
    "Dictionaries",
    "Unfinished",
    "Language",
    "Education",
    "Amazon"
  ],
  "author": "Oxford University Press",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/18715598-the-new-oxford-american-dictionary"
}