{
  "title": "You & Yours",
  "description": "In You and Yours, Naomi Shihab Nye continues her conversation with ordinary people whose lives become, through her empathetic use of poetic language, extraordinary. Nye writes of local life in her inner-city Texas neighborhood, about rural schools and urban communities she’s visited in this country, as well as the daily rituals of Jews and Palestinians who live in the war-torn Middle East.\nThe Day\nI missed the day on which it was said others should not have certain weapons, but we could. Not only could, but should, and do. I missed that day. Was I sleeping? I might have been digging in the yard, doing something small and slow as usual. Or maybe I wasn’t born yet. What about all the other people who aren’t born? Who will tell them?Balancing direct language with a suggestive “aslantness,” Nye probes the fragile connection between language and meaning. She never shies from the challenge of trying to name the mysterious logic of childhood or speak truth to power in the face of the horrors of war. She understands our lives are marked by tragedy, inequity, and misunderstanding, and that our best chance of surviving our losses and shortcomings is to maintain a heightened awareness of the sacred in all things.Naomi Shihab Nye, poet, editor, anthologist, is a recipient of writing fellowships from the Lannan and Guggenheim foundations. Nye’s work has been featured on PBS poetry specials including NOW with Bill Moyers, The Language of Life with Bill Moyers, and The United States of Poetry. She has traveled abroad as a visiting writer on three Arts America tours sponsored by the United States Information Agency. In 2001 she received a presidential appointment to the National Council of the National Endowment for the Humanities. She lives in San Antonio, Texas.",
  "genres": [
    "Poetry",
    "Nonfiction",
    "Humanities"
  ],
  "author": "Naomi Shihab Nye",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/187145.You_Yours"
}