{
  "title": "Girls Are Players",
  "description": "Jessica Norton is a villain in the body of a gorgeous, rich, college girl. She cheats, lies, plays with people’s feelings, and purposely breaks unsuspecting hearts to avenge a personal loss. She’s the kind of girl people love to hate—even if it’s just because she has it all. Except . . . she doesn’t have it all. What she wants most is the love of her high school sweetheart, Taylor Drennon, the guy who got away, the one who left without telling her why and caused all her bitterness.Not surprisingly, Jessica’s evil has made her a pariah. Alone, without friends or Taylor’s love, her college life is a nightmare. She’s haunted by her own mistakes and drowning in lack of direction. Something needs to change. So when the first opportunity to turn her life around presents itself, she takes it. Home for Christmas break, Jessica runs into Taylor. His unexpected friendliness seems like an invitation to rekindle their love. Inspired by a drastic idea that will both distance her from her heinous reputation and pull her closer to Taylor, she decides to transfer to OSU where he attends under a football scholarship.Confident she can regain his heart, Jessica reenters Taylor’s life with a splash. Failing to naturally lure him closer, she is then forced to rely on her old games and underhanded scheming. Though Jessica’s heart is in the right place, it is hidden from Taylor by her blunders. More than once their powerful chemistry takes control, leading Jessica to believe she’s winning. But, it’s a hot and cold affair, and she’s not the only one to blame for their stormy love. If Jessica can only coax Taylor into explaining why he doesn’t want her, maybe she could finally walk away from him for good, maybe she could finally be happy.",
  "genres": [
    "New Adult",
    "Romance",
    "Second Chance",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Ingrid Seymour",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/18713327-girls-are-players"
}