{
  "title": "Open Veins of Latin America: Five Centuries of the Pillage of a Continent",
  "description": "Since its U.S. debut almost fifty years ago, this brilliant text has set a new standard for historical scholarship of Latin America. It is also an outstanding political economy, a social and cultural narrative of the highest quality, and perhaps the finest description of primitive capital accumulation since Marx.Rather than chronology, geography, or political successions, Eduardo Galeano has organized the various facets of Latin American history according to the patterns of five centuries of exploitation. Thus he is concerned with gold and silver, cacao and cotton, rubber and coffee, fruit, hides and wool, petroleum, iron, nickel, manganese, copper, aluminum ore, nitrates, and tin. These are the veins which he traces through the body of the entire continent, up to the Rio Grande and throughout the Caribbean, and all the way to their open ends where they empty into the coffers of wealth in the United States and Europe.Weaving fact and imagery into a rich tapestry, Galeano fuses scientific analysis with the passions of a plundered and suffering people. An immense gathering of materials is framed with a vigorous style that never falters in its command of themes. All readers interested in great historical, economic, political, and social writing will find a singular analytical achievement, and an overwhelming narrative that makes history speak, unforgettably.This classic is now further honored by Isabel Allende’s inspiring introduction. Universally recognized as one of the most important writers of our time, Allende once again contributes her talents to literature, to political principles, and to enlightenment.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Economics",
    "Latin American",
    "Spanish Literature",
    "Latin American History"
  ],
  "author": "Eduardo Galeano",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/187149.Open_Veins_of_Latin_America"
}