{
  "title": "Punk Princesses",
  "description": "~From New Author Veronica Lyons Comes an Absolutely Perfect Lesbian Erotic Romance Filled with Sizzling Sex, Drugs, and Rock-n-Roll!~ She's a good girl who's desperate for a gig and willing to venture into uncharted territory...Out of money and in desperate need of a well paying gig, conservative Christian/Country guitarist Sadie DiSantos auditions for one of the hottest, upcoming bands in Atlanta, an all female punk rock band named The Sirens. Despite her shy demeanor and inexperience performing with rocker groups, The Sirens lead singer, the electrifying, free spirited, and tattoo covered Rhea Taylor, allows her sub in with the band. When Sadie accepts Rhea's offer to join The Sirens full time, she enters into a music charged world filled with passion, drugs, money, VIP parties, and lots of steamy, band mate romance she never thought possible. She's a rocker babe who calls the shots and knows how to get a rowdy crowd into the palm of her hand...After hearing the quiet and reserved Sadie DiSantos audition for a spot in her band, Rhea Taylor can't her get Sadie's gifted musical ability, virtuosic guitar technique, and alternative beautify out of her mind.When a seven-figure offer comes in from a major music production company to sign The Sirens, she quickly accepts the offer and makes the gifted Sadie her new lead guitarist. Rhea knows she can have any woman or man she desires, and now has her eyes set on a new challenge, her new bi-curious lead guitarist. However, history has taught her that fooling around inside the band can destroy the group's chemistry, hurt feelings, and even cause it to entirely fall apart. She is soon confronted with the decision to control her lust and rise to the top of the charts, or fulfill her primal desires and potentially destroy the band she worked so hard to create. Punk Princesses is Intended for a Mature Audience and Contains Graphic Language, Drug and Alcohol Use, and Lesbian Erotica.",
  "genres": [
    "Music",
    "Erotic Romance",
    "Erotica"
  ],
  "author": "Veronica Lyons",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/18715639-punk-princesses"
}