{
  "title": "Personal Experiences",
  "description": "Elleny Barker and Trevor McHale have loved each other since the second grade. Growing up in a small Georgia town, they had the same group of friends and they all had dreams of leaving Richland. Elle’s life was perfect; going to the perfect college, had the perfect life plan of becoming a doctor and had the perfect boyfriend going to college on a full ride football scholarship. Until the day Elle’s life was turned upside down; making a decision that she thought would be the best for both her and Trevor, she turned to the one man she thought would be willing to help her, Trevor’s best friend, Willie “Bear” Jackson. Seventeen years later; Elleny ,is a changed woman,and it's not a good change. She has locked her heart away and refuses to give it to anyone. Then it happened, a millionaire, whose company just bought out the local plant where Elle’s husband is a foreman moves into town; or should I say BACK into town; turns out that it’s Trevor McHale. Secrets have kept them apart for seventeen years; will they end up keeping them apart for the rest of their lives? Life teaches us harsh lessons; Personal Experiences teach us life’s true meaning. WarningThis e-book contains sexually explicit scenes and adult language and may be considered offensive to some readers. And are intended for sale to adults ONLY, as defined by the laws of the country in which you made your purchase. Please store your files wisely, where they cannot be accessed by under-aged readers.Please be advised as part of this story the main character endures spousal abuse before escaping and setting off into a new life and grows to overcomes her past. Some scenes contain some graphic, dark scenes that are not for the light-hearted; including rape. Readers discretion advised.(Contains: Adult language, sexual MF participation, some violence and explicit scenes of arousal).",
  "genres": [
    "Dark",
    "Abuse",
    "New Adult",
    "Romance",
    "Contemporary Romance",
    "Second Chance",
    "Contemporary"
  ],
  "author": "Tracy Lee",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/18715205-personal-experiences"
}