{
  "title": "Healing with the Medicine of the Prophet",
  "description": "Healing with the Medicine of the Prophet (Peace be upon him) is the panacea for those in search of good health. It is a magnificient work that is a treasure for every Muslim household. Although it was written by the author, Ibn Al-Qayyim, over six hundered and fifty year ago, it is an extremely timely work for our generation in which health and natural health care products have become an important aspect of the lives of so many.The author presents the guidance of the Prophet (Peace be upon him) in dealing with variety of health issues, including treatment of the Qur'an and Sunnah are the main sources of Islamic lifestyle, it only stands to reason that they should likewise be referred to in the matters of health as he presents verses of the Qur'an, and statements of the Prophet (Peace be upon him) as his main reference in these issues of health and medicines. The final chapters of this work include an extremely beneficial glossary of remedies, herbs, foods and other natural substances that aid in the journey towards better health.Healing with the medicine of the Prophet (Peace be upon him) is an invaluable reference guide for the Muslims of every land and every generation. May Allah bestow His mercy and blessing upon the author, Ibn Al-Qayyim, for surely his work will be cherished thorughout time.***Arabic Below:\"كتاب الطب النبوي يتضمن فصول نافعة في هديه صلى الله عليه وسلم في الطب الذي تطبب به، ووصفه لغيره حيث يبين الكاتب فيه الحكمة التي تعجز عقول أكبر الأطباء عن الوصول إليها، أما مضمونه فقد جاء على النحو التالي: تقسيم الأمراض، ومراتب الغذاء، أنواع علاج النبي صلى الله عليه وسلم للمرض، العلاج بالأدوية الطبية، هدي النبي صلى الله في الطاعون وعلاجه، داء الاستسقاء وعلاجه، علاج الجرح، علاج عرق النسا، هدي النبي صلى الله عليه وسلم في علاج الصداع والشقيقة وأسباب الصداع وفوائد الحناء، هدي النبي في العلاج العام لكل شكوى بالرقية الإلهية... هدي النبي في علاج الأورام والخراجات التي تبرأ بالبط والبزل... هدي النبي في علاج الكرب والهمّ والغمّ والحزن، هدي النبي في إصلاح الطعام الذي يقع فيه الذباب... الخ\"",
  "genres": [
    "Islam",
    "Religion",
    "Nonfiction",
    "Health",
    "Science",
    "Medicine",
    "Medical"
  ],
  "author": "Ibn Qayyim al-Jawziyya",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/18715670-healing-with-the-medicine-of-the-prophet"
}