{
  "title": "Improper",
  "description": "Improper Pursuits Victorian Boston is full of proper etiquette, sweet innocence and cold marriage beds. Newly widowed, Lynette Edwardmoore views another round of socially dictated marriage less than appealing.Nigel Spencer is the one man who might just change her mind. On the surface, he is polished and practiced in the gentlemanly arts but there is something lurking in his eyes that tells a much different story.Dark whispers of forbidden pleasures fuel a growing need to escape the strict dictates of her chaperones. It is a dangerous pursuit to discover what happens in those rooms where society loses its hold and nature takes over.In a sensual, highly erotic journey, Nigel opens Lynette's eyes to the pleasures to be found in sharing, where watching your partner receive pleasure at the hands of another is a scintillating pleasure few are brave enough to experience.As his lover, and perhaps as his wife, Nigel will offer Lynette a world full of erotic experiences. He has but one rule: first and last, Lynette will always be his. If she is brave enough to say yes…Note: This tale features scenes with multiple partners, shared partners, spanking, and voyeurism. Not for the faint at heart, but definitely for those who want to raise their heartrate!Improper Lessons Being a schoolmarm in 1886 means looking the part. Evelyn knows that well and has never deviated from the path of the strict and somber.Until she walked into a supply closet and saw her new employer consorting with his lover. But it was hard to condemn the lovers when her heart raced and her body breathed to life like it never had before.Brenton Ashton should have left his little schoolmarm in chaste peace but the innocent curiosity of her sensuous gaze told him she didn't want that. No, burning right there was desire that the right man could unleash and he just couldn't stop thinking about being the man to set her free.All love begins as lust. When human nature is aroused, the fire never dies, it only recedes until the right tinder is applied. When Brenton takes over her \"education\", Evelyn discovers that the improper lessons are far better than any she has ever received. Behind locked doors, lust mingles with love and only pleasure matters. But more is at stake than either initially realize.Note: This tale features scenes of ménage a trois, shared partners, spanking, and voyeurism. Not for the faint at heart, but definitely for those who want to raise their heartrate!",
  "genres": [
    "Erotica",
    "Erotic Romance"
  ],
  "author": "Dawn Ryder",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1871646.Improper"
}