{
  "title": "Finding Home",
  "description": "Emily never thought someone like Tyler could possess such peace. But there he stood looking at that girl with a look of pure contentment. His newfound mouthpiece from heaven. And it hit Emily if Carrie ever finally gave in and went with Tyler that everything she had known and was promised would be null and voided. Carrie had the capability to make Tyler feel his human side. Nothing had ever scared Emily before, until Tyler met Carrie, and she would do anything to make sure they never happen.Carrie Emison never believed in demons, ghouls, or things that go bump in the night. Tyler Castleman never believed in love. Imagine their surprise when they discovered each other.Eighteen-year-old Carrie denied her attraction for nineteen-year-old Tyler for as long as she possibly could, but in time they formed a connection that felt almost unworldly. From the day he first laid eyes on her, the charismatic, and reclusive Tyler had been consumed with Carrie, a big-hearted and frustrating girl—who Tyler loved beyond reason. The only problem with that was Tyler had no right to love. After all, love is a foreign concept to a demon.Things are complicated by the fact that Tyler was not only a demon, but the prince of an elite band of demons. His life had already been laid out for him, and Carrie didn’t fit into those plans at all. Carrie was a complication. A complication Tyler was not willing to give up. Tyler was ready to fight and turn his back on everything he knew to be with her.Carrie wasn’t so easily convinced. With Tyler, Carrie found isolation, unbearable pain, and that happily ever afters do not exist. However, she also never felt more alive. After a tragic accident, Carrie faced a hard decision. Did she endure it all for the sake of love? Or was the price of sin more than she could afford?",
  "genres": [
    "Paranormal",
    "Young Adult",
    "Horror"
  ],
  "author": "J.W.  Phillips",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/18718606-finding-home"
}