{
  "title": "Four Eyes Were Never Better Than Two",
  "description": "Kelly Coleman Potter, once known in inner circles as Smelly Kelly, doesn’t see things like most of us do. This could be due to the nearsightedness that presented itself in third grade when she became known as four-eyed Smelly Kelly, but it’s not. According to her high school Journalism teacher, Potter has a unique perspective and outlook on life. She still doesn’t know if that was a compliment or an insult – or perhaps, just a nice way to say she’s weird. In this collection of essays, Four Eyes Were Never Better Than Two…and other observations, Potter offers a candid look at the human condition with tales recounting the past and present. From her younger days of dreaming about being a Dallas Cowboy cheerleader so she could own pom-poms to sex education taught by a Joyce Dewitt look-alike, Potter confesses all – including the ironic account of throwing up on a dog named Ralph. No stranger to embarrassment, she writes of cold sores that require an exorcism and the torture that was seventh grade gym class, capturing the angst, humiliation, and absurdity in those moments that often define us as individuals. Observations include: desperation can make a person do some pretty stupid things like answering a personal ad, hot wax is best left in the hands of a professional if you value your lips, and nothing is so surprising as the man who claims to hate dancing busting a move in a hospital recovery room. Even if you’ve never had to admit in a public setting that you’re having your period, passed out at the eye doctor’s office, or had an illogical fear of a lawn mower, Potter’s self-deprecating wit and sometimes bizarre sense of humor will make you glad these things only happen on sit-coms… or to her.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Humor"
  ],
  "author": "Kelly Coleman Potter",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/18717298-four-eyes-were-never-better-than-two"
}