{
  "title": "War of the Gods",
  "description": "Seven-year-old Justin is an ordinary little boy. He dreams of living in a world full of mythical creatures and thrilling adventures, similar to those that he studies at school in Greek mythology. Then, one day, his mother brings home a chimera box. When he asks her what this word ‘chimera’ means, he learns that it is derived from Greek mythology, describing anything perceived as widely imaginative. A naturally shy boy, Justin is initially wary of the box, but his wariness soon turns to intrigue, and on a dull, rainy day, he finds the confidence to step into the box. On stepping inside, Justin enters a magical world which exceeds even his wildest imagination. He travels to dangerous lands and comes face to face with terrifying creatures. His journey in this new found world is made alongside, and under the guidance of, faithful Greek goddess Gaea. Gaea has no doubt of Justin’s great skills and helps him to believe in himself in order to prepare for his most challenging battle of all; confronting and fighting Hades, Cronus and Cyclops, in order to fulfill the prophecy and save all the trapped and defenseless gods from the wrath of Zeus and Jupiter. Justin must face his fears and find the courage to endure many struggles and battles. Together Justin and Gaea must defeat evil - the fate of the gods lays in their hands. A wonderful tale of bravery, determination and aspiration, War of the Gods explores a child’s dream of becoming the greatest Greco-Roman warrior that ever lived. Throughout his journey Justin becomes a stronger person, not only physically, but emotionally and mentally, and he learns that he is able to accomplish any goal with hard work, dedication and perseverance. War of the Gods is the first book in the Chimera Box Series, in which each book in the series follows the journey of a different child stepping into the magical chimera box; a special vessel which allows a child’s creativity and imagination to flourish, enabling them to transform into a different character. In order for this transformation to take place, the child must find their hero within. The chimera box will grant each child the ability to go anywhere and become anyone or anything their heart desires; a place where dreams come alive and where there are no boundaries to what voyage a child can go on. War of the Gods was written by Justine Borrego with the help of her nine-year-old twin sons Juan and Marco Borrego. The trio were motivated by their passions for writing and taking on projects together. What originally began as short paragraphs of writing, evolved into the first book in the Chimera Box Series. Written in an un-intimidating style, the book is accessible to children from the age of five to ten. The power of the imagination is a powerful theme throughout the book and the Borrego’s hope to motivate and encourage children to not only use their imagination, but also to allow their creativity and resourcefulness to emerge in their real lives, by setting high goals and standards for themselves.",
  "genres": [
    "Childrens",
    "Greek Mythology"
  ],
  "author": "Justine Borrego",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/18716254-war-of-the-gods"
}