{
  "title": "A Nation Under Our Feet: Black Political Struggles in the Rural South from Slavery to the Great Migration",
  "description": "This is the epic story of how African-Americans, in the six decades following slavery, transformed themselves into a political people--an embryonic black nation. As Steven Hahn demonstrates, rural African-Americans were central political actors in the great events of disunion, emancipation, and nation-building. At the same time, Hahn asks us to think in more expansive ways about the nature and boundaries of politics and political practice.Emphasizing the importance of kinship, labor, and networks of communication, A Nation under Our Feet explores the political relations and sensibilities that developed under slavery and shows how they set the stage for grassroots mobilization. Hahn introduces us to local leaders, and shows how political communities were built, defended, and rebuilt. He also identifies the quest for self-governance as an essential goal of black politics across the rural South, from contests for local power during Reconstruction, to emigrationism, biracial electoral alliances, social separatism, and, eventually, migration.Hahn suggests that Garveyism and other popular forms of black nationalism absorbed and elaborated these earlier struggles, thus linking the first generation of migrants to the urban North with those who remained in the South. He offers a new framework--looking out from slavery--to understand twentieth-century forms of black political consciousness as well as emerging battles for civil rights. It is a powerful story, told here for the first time, and one that presents both an inspiring and a troubling perspective on American democracy.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Race",
    "Politics",
    "Grad School",
    "Civil War"
  ],
  "author": "Steven Hahn",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/110244.A_Nation_Under_Our_Feet"
}