{
  "title": "Sail Away With Me",
  "description": "Jody Carter, recently divorced single mom lives in the quaint seaside town with her twelve year old son, and her recently widowed father. After Jody’s divorce from her college sweetheart, Ryan, she and her three best girl friends decide she needs to lighten up. Along with her friends, Lauren, the glamorous ex model divorcee, Cricket the worry wart, and Doreen, who is more comfortable in gumboots than high heels, Jody books a girl’s holiday aboard the Pearl of the Sea for a week of fun in the sun on a Caribbean cruise.But before the four friends ever set foot aboard the cruise ship, Jody’s shoe gets stuck in the ship’s gangway and a hunky celebrity saves it from falling to the depths of the sea. Jody can feel the sparks between them but she has sworn off men after her divorce from Ryan.The hunky man and shoe rescuer is Taggart Keith, a celebrity and best selling author of self help books. He falls for Jody the moment he meets her. He’s a man used to getting what he wants and pursues Jody. Despite her undeniable attraction to Taggart, the last thing Jody needs is to complicate her life in just seven short days, but that’s exactly what happens when she falls for the dashing Taggart Keith. She worries that his jet set lifestyle won’t mix with her small town single mom life once the cruise is over and the fact she has no room in her life for a man and especially a man who dreams big like Taggart. She’s had enough of dreamers with her ex husband Ryan.The cruise becomes more than they both bargained for when their attraction sizzles. Is it full steam ahead for Taggart and Jody?Reader Alert!Jody’s gun shy of Taggart’s charms until she is swept away in a sensational seductive shipboard romance! It’s love overboard for Jody and Taggart.To My All bets are off when you embark on a cruise. Is it something in the balmy sea air, the promise of exotic locales or those wonderful tropical drinks? For Jody, could it be the dashing celebrity guest on board? Join Jody and Taggart as they set sail on a romantic adventure, full steam ahead.About the A die hard romantic and former wedding planner, Kate has been writing stories about romance, from the sensual to the super sexy, since she was in college. When she’s not writing or reading romance she can be found on the tennis court - yes, there’s even “love” in that game too! Finally a sport she can play and still wear a dress. Born in England, Kate now lives in Arizona with her wonderful, sexy husband. Kate enjoys traveling and dreaming up new exciting stories. She’d love to hear from you.ExcerptOnce out on the Promenade Deck, their station leader instructed them to put on their life vests for the safety drill. Cricket needed no instruction and had hers on before Jody could even get her straps undone. At first attempt Jody put the vest on backwards, then flipped it around forwards and did up all the straps. The bulky collar reminded her of the collars Queen Elizabeth I wore; only this one was a most unflattering, brilliant orange. She could barely move in the bulky life jacket and was getting hotter by the minute in the muggy Miami air. It was getting claustrophobic with all the passengers standing so close together. Quietly, she slipped away in search of fresh air and looked out into the harbor.“Hi, there.” A deep voice interrupted her solitude.It was him. Her shoe rescuer!“Hi.” Jody smiled politely, squinting into the bright sun and into his intense deep blue eyes.“I’m Taggart Keith.” He extended his hand. “We weren’t properly introduced on the gangway.”His handshake was firm and strong. “Nice to meet you, Taggart. I’m Jody…Jody…Carter,” she said, tripping over her words, suddenly self-conscious. “And thank you again for catching my…”She was interrupted by the instructor’s booming megaphone. “You can take your vests off now and return to your activities. Thank you for your participation.”“Thank goodness,” Jody sai",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Kate Deveaux",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/18721156-sail-away-with-me"
}