{
  "title": "Blue Into The Rip",
  "description": "The #1 Amazon Bestseller in time-travel and military science fiction! HOME IS 400 YEARS AWAYA Rip in the fabric of time, a far-flung globally warmed future, a flooded Earth and the only remainder of civilisation—a militaristic organisation living underneath 'Desert Amazon'... Getting back home was the only thing that mattered to messed up, mixed race teenager, Blue (named after his stupid, googly blue eyes) - and that was the problem—home was over four hundred years in the past. But how does a lowly cadet in a military academy living in a post-apocalyptic future achieve such a goal, especially with the distractions of girls, pilot training, spacewalks and his almost constant unpopularity? The more Blue found out about this flooded, gung-ho and annoying future, about himself—who and what he was (was he even human?)—and the equally disturbing and shocking truth about his parents, the more he realised getting home was the only solution. Wasn't it?If Blue knew one thing, it was that he would at least try.WHAT READERS ARE SAYING ABOUT BLUE INTO THE RIP\"An amazing read and Kev Heritage's writing is superb and unique...I definitely recommend this book to sci-fi adventure readers!\"  Girl In The Woods \"Hands-down one of the most creative YA books I've read in a long time.\" - Reading For Pleasure \"Fast paced, intriguing, thought provoking, character driven science fiction. I loved it.\" - The Written Universe \"A fun, addictive read from page one.\" - 40 West Media \"K.J.Heritage seems to understand that you don't need to go 'over the top' in order to make contact with the human heart.\" - The Underground Treehouse \"It captivated me from the beginning and held me prisoner to the end!\" - Author Alliance \"This is one of those books and I was awake into the early hours reading. Young Adult time travel at its best.\" - A Woman's Wisdom \"I was drawn in hook, line and sinker...an amazing story and a great ending.\" - Bookaholic Babe \"A winner from the very beginning...an excellent piece of science-fiction that can be enjoyed by adults as well as teenagers.\"- My Writer's Cramp \"The Rip? Awesome!\" - Just Blogging \"All the ingredients for a great scifi teen read...Highly enjoyable.\" - Liz Loves Books YA \"Fun, heartwarming, made me want to turn the pages faster\" - The Book Tart",
  "genres": [
    "Science Fiction",
    "Time Travel",
    "Young Adult"
  ],
  "author": "K.J. Heritage",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/18722363-blue-into-the-rip"
}