{
  "title": "The Garden of Darkness",
  "description": "The Garden of Darkness explores the journey of four children who, after surviving a disease that seems to infect all but one adult, hope to find meaning by joining forces with this sole remaining grownup who says he possesses a cure. These children discover, however, that the greatest meaning of all lies in the friendships they forge during the journey itself. This groundbreaking Young Adult novel shaded with despair like that in The Road and hope and renewal like that found in The Hunger Games shows the courage, tenacity and, finally, love necessary to create a new world from the ashes of the old.Their families dead from the pandemic SitkaAZ13, known as Pest, 15-year-old cheerleader Clare and 13-year-old chess club member Jem, an unlikely pair, are thrown together and realize that, if either of them wishes to reach adulthood, they must find a cure.A shadowy adult broadcasting on the radio to all orphaned children promises just that — to cure children once they grow into Pest, then to feed them and to care for them.  Or does this adult have something else in mind?  Against a hostile landscape of rotting cities and of a countryside infected by corpses and roamed by voracious diseased survivors, Jem and Clare make their bid for life and, with their group of fellow child-travelers growing, embark on a journey to find the grownup they believe holds the cure. Their only weapon is Clare’s dog, Bear.But Clare and Jem, as well as their followers, are hampered by the knowledge that everything in this new child-led world had become suspect—the love of diseased adults, alliances, trust, hope. As Clare and Jem learn to stitch wounds, skin deer and survive in the ashes of the old world perhaps it is no surprise that they begin to find that friendship is as redemptive as anything they seek—that friendship has its own kind of healing power. And, at the end of their journey, in the face of the ultimate betrayal, they discover that out of friendship can come love.",
  "genres": [
    "Young Adult",
    "Dystopia",
    "Science Fiction",
    "Post Apocalyptic",
    "Teen",
    "Survival"
  ],
  "author": "Gillian Murray Kendall",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/18723171-the-garden-of-darkness"
}