{
  "title": "Rethinking Andrew Wyeth",
  "description": "Andrew Wyeth is one of the best loved and most widely recognized artists in American history, yet for much of his career he was reviled by the art world’s critical elite. Rethinking Andrew Wyeth reevaluates Wyeth and his place in American art, trying to reconcile these two opposing images of the man and his work.In addition to surveying the American critical reception of Wyeth’s art over the seven decades of his career, David Cateforis brings together a collection of essays featuring new critical and scholarly responses to the artist. Donald Kuspit’s compelling psycho-philosophical interpretation of Wyeth exemplifies the possibility of new approaches to understanding his work that move beyond the Wyeth “curse,” as do those of the other contributors to this volume―from the close analysis of Wyeth’s technical means offered by Joyce Hill Stoner, to the adventuresome interpretive readings of individual Wyeth paintings advanced by Alexander Nemerov and Randall C. Griffin, the considerations of Wyeth’s critical reception in historical context offered by Wanda M. Corn and Katie Robinson Edwards, and the connections of Wyeth to other canonical artists such as Francine Weiss’s comparison of him to Robert Frost and Patricia Junker’s linkage of Wyeth and Marcel Duchamp.Rethinking Andrew Wyeth includes an appendix with data from visitor surveys conducted at the Wyeth retrospectives in San Francisco in 1973 and Philadelphia in 2006. Illustrated throughout with both iconic and lesser-known examples of Wyeth’s work, this book will appeal to academic, museum, and popular audiences seeking a deeper understanding and appreciation of Andrew Wyeth’s art through its critical reception and interpretation.  Edited by David Cateforis, with essays by David Cateforis, Wanda M. Corn, Katie Robinson Edwards, Randall C. Griffin, Patricia Junker, Donald Kuspit, Alexander Nemerov, Joyce Hill Stoner, and Francine Weiss.This volume’s release coincides with an exhibition at the National Gallery of Art in Washington, D.C. in 2014, Andrew Looking Out, Looking In .",
  "genres": [
    "Art"
  ],
  "author": "David Cateforis",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/18723614-rethinking-andrew-wyeth"
}