{
  "title": "Part Wild: One Woman's Journey with a Creature Caught Between the Worlds of Wolves and Dogs",
  "description": "Part Wild is the unforgettable story of Ceiridwen Terrill's journey with a creature whose heart is divided between her bond to one woman and her need to roam free. When Terrill adopts a wolfdog—part husky, part gray wolf—named Inyo to be her protector and fellow traveler, she is drawn to Inyo’s spark of wildness; compelled by the great responsibility, even danger, that accompanies the allure of the wild; and transformed by theextraordinary love she shares with Inyo, who teaches Terrill how to carve out a place for herself in the world.Over almost four years, Terrill and Inyo’s adventures veer between hilarious and heartbreaking. There are peaceful weekends spent hiking in snowy foothills, mirthful romps through dirty laundry, joyful adoptions of dog companions, and clashes brought on by the stress of caring for Inyo, insatiable without the stimulation of a life lived outdoors. Forced to move and accommodate the complaints of fearful neighbors and the desires of her space-craving wolfdog, Terrill must confront the reality of what she has done by trying to tame a part-wild animal.Driven to understand the differences between dogs and wolves, Terrill spent five years interviewing genetics experts, wolf biologists, dog trainers, and wolf rescuers in the United States, Germany, Hungary, Sweden, and Russia. The fascinating results of her investigation make Part Wild as informative as it is moving.A gifted writer able to capture the grace and power of the natural world, the complexity of scientific ideas, and the pulse of the human experience,Terrill has written a bittersweet memoir of the beauty and tragedy that comes from living with a measure of wildness.",
  "genres": [
    "Nonfiction",
    "Dogs",
    "Animals",
    "Memoir",
    "Nature",
    "Biography",
    "Travel"
  ],
  "author": "Ceiridwen Terrill",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/11026154-part-wild"
}