{
  "title": "Cop of the Year",
  "description": "NEW YORK TIMES bestselling author Kathryn Shay writes fascinating, realistic contemporary romances. Her specialty is troubled teenagers. A teacher in a public school for years, she knows kids and the men and women who teach them!\"In COP OF THE YEAR master storyteller Kathryn Shay pens an emotionally powerful tale that leaves you breathless. Woven into this riveting plot are wonderfully written characters that grab your heart and don't let go. Bravo Ms. Shay!\" RT Book Reviews***Winner of Best Superromance of the Year, the Golden Leaf Award and the Desert Quill Award as well as numerous 5 star ratings from reviewers.***The last thing by-the-book Captain Mitch Lansing wants to do is work in a high school classroom to improve relationships between at risk kids and the police department. Mostly, he doesn’t want to deal with teenagers. But when he meets unorthodox teacher, Cassie Smith, his world goes off kilter. So does Cassie’s. She's totally against all he stands for, so why is it she finds herself attracted to him? The further they go into the year, the more they’re drawn to each other. And the more the kids also come to care about Mitch. However, because of his past in Vietnam, he tries to distance himself from everybody. He can’t, and he must learn to accept Cassie and her kids into his life. With several highly emotional scenes and deeply moving situations, this story will go straight to your heart.Praise for COP OF THE YEAR:“Kathryn Shay writes from the heart! Her stories are about real people with real lives. You will laugh and cry with her characters. COP OF THE YEAR is sure to be one of the best books to hit the shelves this year!” The Literary Times“Prepare yourself for a fabulous emotional ride that will have you reaching for the tissues and leave you with a renewed sense of hope.” Genie Romex Reviews“Kathryn Shay has penned a most unusual novel. The teacher/cop relationship feels natural enough, and the dialogue is a standout. But oddly enough, though I found the romance to be satisfying, it's the secondary characters of the kids I remember most from the story. The teenage pregnancies, the gang involvement, the drug usage all are a part of today's high school scene, but Shay makes this a story of hope, not despair. The ending almost brought me to tears. Three cheers!” The Romance Reader“Ms. Shay writes a strong and compelling dissertation on a very real and complicated social issue of our time, weaving in an unforgettable, touching love story.” Old Book Barn GazetteIf you like books about cop romances, teacher romances and teacher student relationships, be sure to read the rest of this high powered series, BECAUSE IT’S CHRISTMAS, COUNT ON ME, BETWEEN TWO WORLDS and IF YOU WERE MINE.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Amazon",
    "Love Story",
    "New York"
  ],
  "author": "Kathryn Shay",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/18723342-cop-of-the-year"
}