{
  "title": "The Yanks Are Starving: A Novel of the Bonus Army",
  "description": "Two armies. One flag. No honor.The darkest day in American history.Former political journalist Glen Craney has enthralled readers with novels set during the medieval crusades and Scottish wars of independence. Now the award-winning author turns to World War I and the Great Depression, bringing to life the little-known story of the Bonus March of 1932, which culminated in a shocking clash between thousands of homeless veterans and U.S. Army regulars on the streets of the nation's capital.Mired in the Great Depression, the United States teeters on the brink of revolution. And the nation holds its collective breath as a rail-riding hobo from Portland leads 20,000 World War I veterans on a desperate quest for justice to the steps of the U.S. Capitol. -- Foreword Book-of-the-Year Finalist Historical Fiction -- indieBRAG Medallion -- Chaucer Award Finalist for Historical FictionThis timely epic evokes the historical novels of Jeff Shaara as it sweeps across three decades with eight Americans from different backgrounds who survive the fighting in France and come together again, fourteen years later, to determine the fate of a country threatened by communism and fascism: -- Herbert Hoover, the beleaguered president. -- Douglas MacArthur, the ambitious general. -- Pelham Glassford, the compassionate police chief. -- Walter Waters, the troubled leader of the Bonus veterans. -- Floyd Gibbons, the war correspondent and famous radio broadcaster. -- Joe Angelo, the Italian-American who is George Patton's orderly. -- Ozzie Taylor, the street musician turned Harlem Hellfighter. -- Anna Raber, the Mennonite nurse.We follow these men and women from the Boxer Rebellion in China to the Plain of West Point, from the persecution of conscientious objectors in the Midwest to the horrors of the Marne in France, and from the Hoovervilles of the heartland to the pitiful encampment in the bowels of the District of Columbia.Here is an alarming portrayal of the political intrigue and government betrayal that ignited the only violent conflict between two American armies under the same flag.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "American",
    "War",
    "World War I"
  ],
  "author": "Glen Craney",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/18730971-the-yanks-are-starving"
}