{
  "title": "David's Gift",
  "description": "Barry and Susan Nelson's firstborn, David, is one of those very rare children who gets bored after having mastered quantum mechanics by his ninth birthday. Raising him in the Christian faith, they soon find that he is asking piercing theological questions concerning evolution vs Creation, and that they need expert help in providing him with answers. In the same way they sought out college professors to tutor him in advanced mathematics and physics, they turn to their church's pastor, who is both a medical doctor and a Doctor of Philosophy. Rev. Johnson's incredibly detailed discussions with David examine every facet of the debate. David's Gift is a fictional tale of an absolutely non-fiction issue, addressed comprehensively by an author who clearly has a deep understanding of what he refers to as Evolutionized Creation. There is, Keller contends in the Introduction, no reason to abandon your Creationist beliefs, especially not when the science so clearly supports the reality of a Creator.A story of new faith, lost faith renewed and the staggering complexity and ineradicable beauty of a perfect Creation. HG Keller was born in a small Nebraska town where he spent the first 38 years as a Medical Technologist, an engineer and sales assistant. He moved to Virginia to work as a sales representative and after 22 years retired and moved to Colorado to live closer to his children and grandchildren. Throughout his life he has studied evolutionary science and biology. He has wrestled with the idea of a creator and the theory of neo-Darwinism. He has been waiting for someone to come along and resolve the mystery of human creation. David's Gift is an effort to put forth ideas on how it all could have happened. Contact Mr. Keller at Davidsgift771@gmail.com with your thoughts about this book and find out about his next literary project.",
  "genres": [],
  "author": "H.G. Keller",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/18734356-david-s-gift"
}