{
  "title": "Walls",
  "description": "THIS IS THE OLD BETA EDITION: INTERESTED READERS SHOULD CLICK ON THE EDITIONS WITH THE BLACK & WHITE COVER PHOTO! Thanks, Alex.Walls is the breakout new psychological suspense novel from author Alex Jones, and is the first of three psychological thrillers making up The Identity Trilogy. Jones’ insight into the inner conflicts and erotic fantasies of his four main characters opens our eyes to the tragic world of trauma and abuse, its frightening effects on the human mind, and the resiliency and spirit of those who manage to survive.Psychologist Dan Whitney and his wife Michelle, an emergency room nurse, live an otherwise unspectacular life in suburban Detroit. To help inject some new life back into their marriage, they decide upon a somewhat unconventional resort hotel in Palm Springs as the setting for their romantic getaway. But their plan starts to unravel slowly almost as soon as they arrive when they are presented with a series of unexpected roadblocks. All seems lost when mechanical problems suddenly cause their hotel room to be unavailable. Luckily, their vacation is saved at the last minute by Philippe Morel, the hotel’s wealthy and personable owner, who invites them to spend the rest of their vacation at the opulent estate he shares with his enigmatic wife, Francesca. Dan’s initial relief is short-lived and he becomes increasingly suspicious of Philippe’s motives. Too late, he realizes that Philippe has been playing him against Michelle in a sinister plan to meet his own sadistic needs. A plan that creates not only an immense rift in Dan’s marriage, but puts their lives in peril. Will Dan be able to find a way to rescue his marriage to Michelle? Will they be able to find a way to work together to survive Philippe’s manipulation, and break free from his seductive web of blackmail and deceit? More importantly, will they be able to find a way to escape with their lives?",
  "genres": [],
  "author": "Alex    Jones",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/18732882-walls"
}