{
  "title": "House Rules",
  "description": "A compelling, at times horrifying work that is impossible to put down, House Rules will stand beside Running With Scissors and The Glass Castle as a memoir that cracks open the shell of a desperately dysfunctional family with impressive grace and humour.Rachel Sontag grew up the daughter of a well-liked doctor in an upper middle class suburb of Chicago. The view from outside couldn’t have been more perfect. But within the walls of the family home, Rachel’s life was controlled and indeed terrorized by her father’s serious depression. In prose that is both precise and rich, Rachel’s childhood experience unfolds in a chronological recounting that shows how her father became more and more disturbed as Rachel grew up.A visceral and wrenching exploration of the impact of a damaged psyche on those nearest to him, House Rules will keep you reading even when you most wish you could look away.In the middle of the night, Dad sent Mom to wake me. In my pajamas, I sat across from them in the living room. I was sure Grandma had died and I remember deciding to stay strong when Dad told me. “What did you say to her?” he asked. His elbows rested in his lap.“What do you mean?”“You spent a good half hour alone in that hospital room. What did you talk about?”“I don’t know, Dad”“What do you mean, you don’t know? You know. You know exactly what you talked to her about.”“You talked about me, Rachel.”“No. I didn’t.”“To my own mother?”. . . . I wondered how he’d been with Mom, how she’d missed the signs. He couldn’t have just turned crazy all of a sudden. I wondered if his own father had infected him with anger. But mostly, I wanted to know what he saw in me that caused him to break up inside. Was it in my being born or in my growing up?--from House Rules",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Abuse",
    "Psychology",
    "Mental Health",
    "Biography",
    "Mental Illness"
  ],
  "author": "Rachel Sontag",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/1873726.House_Rules"
}