{
  "title": "The Shell Game [Hardcover] Steve Alten",
  "description": "From the Publisher The events of September 11th, 2001,the invasion of Iraq,the threat of radical Islam,an impending showdown with Iran. What do these situations have in common? Oil. And the world is running out. The SHELL GAME is far more than a thriller, it is a MUST-READ cautionary tale that exposes the next 9/11 event a deception that will lead to a retaliatory chemical weapons strike on Iran and the terrorist elements the regime supports. Though the novel is written as fiction, it is filled with all-too-real details provided by insiders in the oil industry, military, and Middle Eastern affairs that extrapolates real events from the past and present that will lead us down a path of self-destruction.Unless we stop the insanity now! Product Description The story opens in 2007 when two CIA spooks meet with an American Colonel in military intelligence. The war is going badly, and President Bush, who steadfastly refuses to back down, remains unchallenged at home as Democrats and Republicans continue to toss verbal grenades positioning themselves for the 2008 elections. Meanwhile, Iran s pursuit of nuclear energy will yield enriched uranium within five years, uranium that can be used to manufacture suitcase nukes. The United States military is too drained to invade Iran, and a preemptive strike is out of the question,unless a nuclear detonation were to occur in an American city, the enriched uranium traced back to Iran. A U.S. reprisal would strike a death-blow against radical Islam, quell the insurgent violence in Iraq,and yield more oil. Yes, the cost is unthinkable but if we sit back and do nothing then one day a dozen suitcase bombs could go off in a dozen American cities bringing with it anarchy and the collapse of Western civilization. December 2011: Ashley Ace Futrell is an oil expert working for PetroConsultants, married to Kelli Doyle, a former National Security Advisor and one of the CIA spooks from the opening scene. When Kelli threatens to expose the plot, Ace finds his existence hurtling down a rabbit s hole of deceit where the orchestrated lies of the powerful few could lead to the darkest days of human existence, and the death knell for billions.",
  "genres": [
    "Fiction",
    "Thriller",
    "Suspense",
    "Audiobook",
    "Science Fiction",
    "Politics"
  ],
  "author": "Steve Alten",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/1873536.The_Shell_Game_Hardcover_Steve_Alten"
}