{
  "title": "A Tale of Two Murders: Passion and Power in Seventeenth-Century France",
  "description": "As scandalous as any modern-day celebrity murder trial, the “Giroux affair” was a maelstrom of intrigue, encompassing daggers, poison, adultery, archenemies, servants, royalty, and legal proceedings that reached the pinnacle of seventeenth-century French society. In 1638 Philippe Giroux, a judge in the highest royal court of Burgundy, allegedly murdered his equally powerful cousin, Pierre Baillet, and Baillet’s valet, Philibert Neugot. The murders were all the more shocking because they were surrounded by accusations (particularly that Giroux had been carrying on a passionate affair with Baillet’s wife), conspiracy theories (including allegations that Giroux tried to poison his mother-in-law), and unexplained deaths (Giroux’s wife and her physician died under suspicious circumstances). The trial lasted from 1639 until 1643 and came to involve many of the most distinguished and influential men in France, among them the prince of Condé, Henri II Bourbon; the prime minister, Cardinal Richelieu; and King Louis XIII. James R. Farr reveals the Giroux affair not only as a riveting murder mystery but also as an illuminating point of entry into the dynamics of power, justice, and law in seventeenth-century France. Drawing on the voluminous trial records, Farr uses Giroux’s experience in the court system to trace the mechanisms of power—both the formal power vested by law in judicial officials and the informal power exerted by the nobility through patron-client relationships. He does not take a position on Giroux’s guilt or innocence. Instead, he allows readers to draw their own conclusions about who did what to whom on that ill-fated evening in 1638.",
  "genres": [
    "History",
    "France",
    "Crime",
    "Nonfiction",
    "Read For School"
  ],
  "author": "James R. Farr",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/1873376.A_Tale_of_Two_Murders"
}