{
  "title": "A Maine Christmas...or Two - A Duet",
  "description": "A Maine Christmas…Or Two 180 pages - EstimatedThis book contains two brand new, steamy, contemporary romance Christmas stories from NY Times and USA Today Bestselling author J.S. Scott and Cali MacKay.Although these stories are connected to both authors’ current series, they are easily stand-alone reads with no cliff hangers. The Billionaire’s Angel by J.S. Scott - Considered an eccentric beast by most of the residents in Amesport, Maine, Billionaire Grady Sinclair stays isolated on his private peninsula in a grand mansion most people are afraid to approach. The arrangement suits Grady just fine, until a fearless angel lands on his doorstep, making him painfully aware of how lonely he really is, and how much he wants to keep the fiery blonde cherub for his very own. But will he have to become the monster the townspeople believe him to be in order to get his Christmas wish?Emily Ashworth needs money, and plenty of it. As director of the Youth Center of Amesport, she either finds the funds she needs to supply Christmas presents and other items she needs to purchase to give the kids of Amesport a Christmas, or they won’t have one at all. Desperate, she ventures to the Amesport Peninsula to ask the wealthiest person in the area to provide a Christmas for her misplaced, abused, or troubled kids, and to help keep the doors of the much-needed refuge open. Emily is shocked when she meets Grady, and surprisingly more attracted to him than she has ever been to any man. He might have seemed like a barbarian in the beginning, but Emily quickly learns that Grady is nothing like she’d imagined. Was the monster of Amesport truly the very devil, or just a lonely man who needs the gift of love for Christmas? A Mermaid Isle Christmas by Cali MacKay – Once Aidan Nordson made his fortune, he was finally able to leave behind the world that left him broken and scarred. Escaping to Mermaid Isle, all he wants is to be left alone to live his life and deal with his demons, but when a blizzard hits and strands Chloe Madison at his door, the gorgeous and feisty brunette stirs feelings in him he’d rather push away. Forced together by fate and circumstance, can Aidan let go of the past that haunts him so he can learn to love again or will the storm in his heart swallow him in its darkness?Note: These are steamy romances and suitable for readers 18+ due to graphic language and sexual content.",
  "genres": [
    "Romance",
    "Christmas",
    "Anthologies",
    "Novella",
    "Erotica",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "J.S. Scott",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/18735056-a-maine-christmas-or-two---a-duet"
}