{
  "title": "The Morrow Secrets",
  "description": "‘The Morrow Secrets’ is a fantasy adventure story written for readers who love delving into the world of mystery, suspense, imagination and make-believe. It is the first book in a series about Tallitha Mouldson, a headstrong girl caught up in the sinister web of her eccentric family, the powerful Morrow dynasty. This fantasy saga is set in an alternative world and begins in a strange, rambling house called Winderling Spires in the land of Wycham Elva. The Morrow Secrets is an epic tale of dark forces, with a beguiling mystery to be solved, an exciting yarn of deception with frightening twists and wicked turns. The story has weird, whimsical characters, some motivated by wicked intent. They lurk round corners... watching Tallitha and luring her further into the dreadful secret....It is a story of the heroine’s fight against the evil forces that have shaped the past and still surround her present. Tallitha is determined to unearth the family secret and so begins her breath-taking adventure, exploring the forbidden floors of the bizarre old house and discovering a number of intriguing clues which lead her ever further into the heart of the mystery. During her quest, Tallitha discovers she has inherited strange paranormal powers, passed down the female line of the Morrow clan. With the help of her eccentric cousin Esmerelda, Tallitha escapes the clutches of her suffocating family and makes her way across the dangerous terrain of Wycham Elva into the wilderness and the dark world of Breedoor. Accompanied by her brother and cousins she learns more about the mysterious past of the Morrow family, she forges new allegiances, endures terrifying challenges and encounters the strange creatures of the underground kingdom. Eventually she reaches the haunting castle of Hellstone Tors and the awesome truth about her family is laid bare........",
  "genres": [
    "Fantasy",
    "Mystery",
    "Young Adult",
    "Gothic",
    "Adventure",
    "Fiction"
  ],
  "author": "Susan    McNally",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/18740361-the-morrow-secrets"
}