{
  "title": "Colorado Promise",
  "description": "Colorado PromiseBook One in the Front Range series – Historical Western RomanceIn this passionate sweet Western Historical Romance, author Charlene Whitman introduces Emma Bradshaw—a high-society young woman from New York, who is forced to move out to the untamed Front Range in Colorado and finds that true love can withstand all the dangers the West can throw at her.Greeley, Colorado, in 1875 is a town built on a promise . . .. . . but to Emma it is a desert prison in the middle of a hostile and dusty prairie. Emma had hoped to go to Vassar College, to pursue her dreams of becoming a botanical illustrator. But when her father, struck with “Western fever” moves the family out West, Emma’s dreams are shattered. Her only consolation is that her childhood friend, handsome Randall Turnbull, has moved to Greeley to work for his railroad baron father. Her heart sparked by his comforting presence, she hopes Randall will fall in love with her and marry her.But promises often turn bitter . . .. . . as Lucas Rawlings, veterinarian and horse lover, well knows. Lucas has lived on the Front Range for three years at Sarah Banks’s horse ranch, after stumbling down from the Rockies consumed with grief. Since losing his precious wife and baby in childbirth, he doesn’t think his heart can bear ever loving again. But Sarah, a half-Cheyenne with a medicine woman for a grandmother, has a vision showing it’s time Lucas married again. He scoffs until he rescues Emma in a sudden hailstorm and their lives become intricately entwined.Emma must choose—and fight—for the man she loves, at the risk of all she loves . . .Emma yearns for the comfort and familiarity of Randall’s company, but Lucas’s easy confidence and gentle ways snag her heart. Facing a new life beset by grasshoppers, drought, and blizzards is hard enough. But when murderous ranchers try to force Sarah off her land, and her brother takes up dangerous company, the lives of her family and the man she’s come to love are threatened. It will take a miracle—and the strength and promises of true love—to come through unscathed in this untamed land.Colorado Promise is the first book in the Front Range series—a rich full-length novel full of sweet, heartwarming, and chaste romance. Watch for Colorado Hope and Colorado Dream in 2014!",
  "genres": [
    "Romance",
    "Historical Romance",
    "Westerns",
    "Historical Fiction",
    "Historical"
  ],
  "author": "Charlene Whitman",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/18740250-colorado-promise"
}