{
  "title": "Come Little Children",
  "description": "A hidden town. A paranormal rumor. A family secret. The Nolan morgue is more than just an ordinary funeral home. When their newest employee uncovers a supernatural conspiracy connected to a string of child murders, she must use every shred of her intelligence to stop a new breed of serial killer and escape the morgue alive. Full Synopsis: “There are strange things done in the midnight sun...”After moving to the Yukon for her first job since graduating from college, Camilla Carleton—a young mortician with a curious mind and a peculiar sense of fashion—thinks she’s found a place where she belongs. The residence is beautiful. The pay is decent. The work is rewarding.  But the Nolan Morgue is more than just an ordinary funeral parlor. Within twenty-four hours of arriving, Camilla discovers the mutilated body of a six-year-old boy in the backyard of her new home: soaking wet, stitched up like an autopsy cadaver—and still alive. When her employers refuse to address the incident, she takes matters into her own hands and starts scouring the town for information.The consequences are catastrophic. A rumor involving paranormal activity connects the funeral home to a violent history of child murders, and when a shocking religious conspiracy is exposed, it triggers a horrific chain of events that threatens the entire town. Now, trapped in a hellish nightmare outside the realms of reason and science, Camilla must come to terms with her own dark past while struggling to outsmart a serial killer, save her family, and escape the morgue alive.Set against the ghostly backdrop of the Yukon wilderness, Come Little Children possesses a rich supply of chilling imagery, memorable characters, and incisive nightmares. Packed with horror and dappled with equal parts humor and romance, this gripping supernatural thriller ensnares readers all the way from its eerie start to its explosive, heart-pounding climax.",
  "genres": [
    "Horror",
    "Fiction",
    "Mystery",
    "Adult"
  ],
  "author": "D. Melhoff",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/18741537-come-little-children"
}