{
  "title": "The Riverside Trilogy: Box Set",
  "description": "The complete Riverside Trilogy Over 212K Words & 845 Pages Get to know Drake & Molly in Kitchen Affairs, Kitchen Scandals, and Kitchen Promises. Kitchen Affairs: Drake Stagliano is a high maintenance man from a wealthy empire family in Chicago. He managers The Riverside Hotel/Restaurant where he only expects the absolute best. With a past filled with being used and heartbreak, the last thing he expects is to find a woman he can't control himself around... a chef intern. Molly Woods is not your typical 23 year old. She's in her last semester of culinary school and interning at Drake's restaurant. She's closed dating off her list - her only priorities are finishing school & her 4 year old daughter. When Molly is pursued by Drake, she does everything she can to deny the chemistry and sexual tension. However, that doesn't last long & she finds herself completely mad over him. When an intimate video goes public, Molly's internship and credibility is threatened. She's lusts for the one man she's been able to connect with after the sudden death of her late fiancé - but can Drake hold on for the emotional ride? Molly will need to let go of her past in order let Drake in. Fall in love with this steamy, funny, & romantic story of two people who find each other just when they both need someone the most. Kitchen Scandals: She finally found the one... but he has a hidden secret. Could this be the breaking point for Molly? Has she endured too much? Drake and Molly had instant chemistry in Kitchen Affairs, but when secrets go all wrong, their relationship will be tested, feelings get hurt, and limits will be reached. Someone interferes with their relationship, keeping them distant and longing for answers in all the wrong places. Some people are not who they seem... leaving a betrayal of lies crashing down on them. Can they recover their once intense, sensual chemistry? Will love be enough? Secrets, betrayals, and scandals... Chicago's hottest couple, Molly & Drake, go through big changes, hidden secrets, and tragedies. Kitchen Promises: Nothing ever comes easy for Molly Woods. Faced with past fears, heartache, & limits… Can she make promises to the one man she can’t get enough of? Can she promise him forever…? With new obstacles, Molly must make a decision. Drake Stagliano always gets what he wants. But with a new threat, how far will he go to make sure Molly is his forever? When new secrets are revealed, Drake must take matters into his own hands. Can they make forever happen? Or will promises be made that can’t be kept…? *Contains Mature Adult Content. Recommended for 18+ Only. Strong language and sexual content are apparent.*",
  "genres": [
    "Romance",
    "Contemporary Romance"
  ],
  "author": "Brooke Cumberland",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18740692-the-riverside-trilogy"
}