{
  "title": "Billionaire Bad Boys of Romance Boxed Set",
  "description": "Love your book boyfriends filthy rich, devastatingly beautiful & irresistibly bad? From betrayals and obsessions to secrets and seductions, this exclusive billionaire romance boxed set will possess you and leave you panting for more. Featuring stories from some of today's most popular New York Times, USA Today, Amazon, and Barnes and Noble bestselling authors, including Tawny Taylor, Ava Lore, Selena Kitt, Terry Towers and Anna Antonia. Grab this sizzling collection before it's too late. Ten scorching billionaire romances, OVER 335,000 total words for ONLY 99 cents! LIMITED TIME ONLY! (REGULAR PRICE: $9.99) The Billionaire's Muse by Ava Lore: When struggling artist Sadie MacElroy attempts to pay back eccentric billionaire Malcolm Ward for a broken vase, Malcolm decides he wants her: in front of his camera, under his brush, and in his bed. The CEO and the Girl from the Coffee Shop by Terry Towers: Coffee shop hostess, Beth Wilmington, is shocked when one of her customers, sexy billionaire Gabriel Reynolds, offers her a job as a live-in housekeeper. She takes the job, but fears only trouble can ensue. Yes, Mr. Collins by Anna Antonia (writing as Charlotte deCorte): Brilliant, yet demanding, billionaire boss Mr. Collins will stop at nothing to get his assistant Natasha Reynolds under this thumb and in his bed. My Rockstar Billionaire by Amy Aday: Belle travels to an island resort and meets sexy and mysterious Ricky, who won't take no for an answer. Will she learn to trust again and learn his secrets? Heidi and the Kaiser by Selena Kitt: When wanna-be designer Heidi accidentally stains fashion mogul Warren Kaiser's pants, she gets two things she didn't expect--a spanking and a job. Gloria's Secret by Nelle L'Amour: Gloria Long, the world's largest retailer of lingerie, succumbs to the charms of billionaire advertising guru Jaime Zander, but her own dark secret threatens her empire, their relationship, and her life. Make You Mine by Tawny Taylor: To keep her job, Daryl Laroche must find the perfect new client for her employer and the sexy, rich and enigmatic Tevin Page fits the bill. But before he signs the contract, he issues one deliciously tempting demand... Trapped into a Marriage by Dez Burke: Blackmailed into marriage to rich, gorgeous, Nick Vitale, Keyonna Hayes is determined to teach him a thing or two about love. Soon intrigue, heartbreak, and betrayal ensue, and the two fight to regain a love that was always destined to be theirs. The Art of Catching a Greek Billionaire by Marian Tee: Schoolteacher Mairi Tanner is not a gold digger, she just knows what she wants her Mr. Right to be--handsome, Greek, and oh, a billionaire, too! Is that so bad? What He Wants by Tawny Taylor: Billionaire Shane Trant always gets what he wants. He wants Bristol Deatrich, but only complete possession of her mind and body will satisfy him.",
  "genres": [
    "Romance",
    "Erotica",
    "Anthologies",
    "Contemporary Romance",
    "BDSM",
    "Amazon",
    "Adult"
  ],
  "author": "Selena Kitt",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/18740460-billionaire-bad-boys-of-romance-boxed-set"
}