{
  "title": "Supernatural Six: Box Set",
  "description": "Secret powers, genies, mermaids, angels, vampires and demons. There’s something for every paranormal enthusiast. Supernatural Six brings you six novels from six authors who know how to raise the stakes and tame the darkness.________________________ Duality by Elle Casey (New York Times Bestselling Author) - Malcolm's had a problem for as long as he can remember. No matter where he goes or what he does, he leaves misery in his wake. But then Rae shows up in his life, and everything changes. Darkness cleaves to light. Anger yields to joy. The question is whether she'll be his salvation or his destruction.  Three Wishes by Juli Alexander - Not every seventeen-year-old girl works part time granting wishes, but when you’re a genie, you have obligations. Jen finally gets a shot as a drummer in her brother’s band. Just when it’s looking good for her, Leo Fuller shows up, and this bad boy genie’ s after more than just her drummer gig. Atlantis Riptide by Allie Burton - Teen runaway Pearl craves anonymity, but when she saves a toddler from drowning she draws attention to her special water skills. Unknown to her, a war rages under the ocean and each side wants to use her powers for their cause. Pearl must choose her own destiny—ignore the churning seas or swim into battle. Lash by L.G. Castillo - Banished angel Lash seeks to redeem himself by protecting Naomi, a woman who has lost her faith. But when danger threatens — and his passion for her swells — will he choose his cherished home or his heart? The Emerald Talisman by Brenda Pandos - Julia Parker would trade her ability to feel others emotions in a heartbeat, especially half the boys in school. When a vampire hunter rescues her before she's devoured by a bloodthirsty stalker, Julia discovers no one is safe. Unsure how to help, she seeks the advice of a psychic, only to find out she alone is the key to stopping the madness, problem is it'll require her rescuer's life. Static by Tawny Stokes - Salem, a teenage groupie for the punk band Malice, gets more than she bargained for after a night of partying with the band--a headache, a stomachache and a sickness that's turning her into something inhuman. Only Trevor, the roadie, can help her navigate her new world of danger, darkness, and love.",
  "genres": [
    "Anthologies",
    "Paranormal",
    "Fantasy"
  ],
  "author": "Elle Casey",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/18740351-supernatural-six"
}