{
  "title": "Extraordinary You: A Woman's Guide to Having it All",
  "description": "If you’re reading my book, there’s a very good chance that you’re looking for change in your life. So to make sure you get the most benefit out of the information on every page, here’s how I suggest you go about reading it. Firstly, make a commitment to read the entire book from cover to cover and set a date by which you want to have it finished.Buy yourself a wealth creation and goal setting journal, which we will call your Wealth Creation Journal (you’ll learn more about this in Chapter 1).Every chapter contains a series of exercises and questions that I strongly encourage you to complete as you go. You can complete the exercises in your Wealth Creation Goal Setting Journal, but if you have the printed version of this book, I have also left space within these pages if you’d prefer to write your answers there.Finish every exercise in each chapter before moving onto the next if you really want to live an EXTRAORDINARY life! You may find that some of the personal development exercises and actions you decide to take will challenge you and push you out of your comfort zone. This is a positive and very normal part of introducing changes to your life because it means you are growing and getting closer to the result you want. So push through these ‘growing pains’ and don’t give up.If you are having major relationship troubles, family issues, poor health, ongoing financial crises or other turmoil then you may feel that this book is too optimistic, or not, for you. I encourage you to make sure you are getting enough support, maybe therapy or counselling but keep reading. There may be simple techniques mentioned that help you shift your mindset so you understand that while things may not look like they are heading in the right direction in your life yet, there are tools you can use to plan and design your future.Keep looking forward at the great things that are possible in your life so that when times are tough you have a vision to keep you optimistic about your future goals.And finally, ENJOY YOURSELF! Learning should be fun, not a chore, so get creative and have some fun!",
  "genres": [
    "Self Help",
    "Business"
  ],
  "author": "Megan Wolfenden",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/18743383-extraordinary-you"
}