{
  "title": "Jonathan’s Locket",
  "description": "Orphaned Jonathan Palmer is a fifteen year old stow away on a ship back in 1794 on route to England to find his real birth-mom. He has no idea he is on the doomed ship which was a part of the fleet that crashed into the reef on Grand Cayman which became known as the Wreck of the Ten Sails. Jonathan was not lucky enough to survive the wreck along with eight other sailors. Problem was, no one ever knew he was on the ship and was not listed in the ships log.Some say these ships were cursed from the start. Two centuries later strange sightings of ghost ships, screams , and eerie lights appear off Grand Cayman’s east end. Brandon Wallace, a troubled teen seems to be having strange encounters lately in the sea where he is befriended by a mystical sea turtle who can communicate telepathically with him and leads him to the site where Jonathan’s body drowned . Brandon must help to release Jonathan’s spirit to the other side as his body is bound by a locket that must be released. This task proves to be only more dangerous for Brandon as one of his friends has other plans for him. Excerpt: “We sail at 0600. The Convert shall be in the lead, followed by the other merchant ships: William and Elizabeth, the Moorhall, the Ludlow, the Britannia, the Richard, the Nancy, the Eagle, the Sally, and the Fortune.” Once the ships were boarded, the Union Jack was raised on the Convert. Everyone aboard pledged their allegiance to the royal flag. “Weigh Anchor!” While Jonathan hid, Peter stood on deck waiting for the traditional boarding ceremonies to finish. He grew anxious for the boarding protocol to end. I need to sneak down into the inner hold to release that poor boy from his temporary confinement, he mused. God help me if they find out I have helped this boy stow away. Peter wasn't just worried about Jonathan, though. He also worried about the condition of the rough seas ahead. Unknowingly, he had put himself and Jonathan right into the path of serious danger.",
  "genres": [
    "Historical Fiction",
    "Young Adult"
  ],
  "author": "Lorraine Carey",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/18744878-jonathan-s-locket"
}