{
  "title": "A Linguagem Secreta das Flores",
  "description": "Victoria Jones tem medo do contacto físico. Tem medo das palavras, as suas e as dos outros. Sobretudo, tem medo de amar e de ser amada. Há apenas um lugar onde todos os seus medos se esfumam no silêncio e na paz: o seu pequeno jardim secreto, num recanto de um parque público de São Francisco. É nesse refúgio que cuida das flores e se sente em casa. Foi Elizabeth, a única mãe verdadeira que conheceu na sua vida, que a iniciou na arte da linguagem secreta das flores. Para Victoria é simples resumir a sua vida através das flores: a lavanda para a indiferença, os cardos para a misantropia, e a rosa branca para a solidão. Abandonada ainda em bebé, passou a infância a saltitar de uma família adoptiva para outra. Agora, aos dezoito anos, está largada à sua sorte, sem um lugar a que chamar casa. Até ao dia em que uma florista descobre o talento de Victoria para as flores e lhe oferece trabalho. Rapidamente os seus arranjos florais passam a ser dos mais procurados da cidade, porque comunicam emoções, oferecem felicidade e curam a alma.Apesar da magia e beleza que espalha em seu redor, Victoria continua sem esperança de encontrar um remédio que cure as suas feridas. Tudo muda quando conhece Grant, um jovem misterioso que também conhece a linguagem secreta das flores e parece saber tudo sobre ela. Só Grant parece ser capaz de aceder ao coração de Victoria, bem trancado dentro de um compartimento secreto. Este encontro obriga a jovem mulher a recordar um segredo do seu passado e a decidir se vale a pena arriscar tudo em troca de uma segunda possibilidade de ser feliz. Um romance comovente e redentor sobre o significado das flores, e o poder da família e do amor.",
  "genres": [
    "Fiction",
    "Book Club",
    "Romance",
    "Contemporary",
    "Adult Fiction",
    "Audiobook",
    "Adult"
  ],
  "author": "Vanessa Diffenbaugh",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/11029554-a-linguagem-secreta-das-flores"
}