{
  "title": "Because of Luke",
  "description": "Music, love and sibling rivalry…all Because of Luke.Three years ago, Shannon was a wild child. Parties, boys. You name it, she did it. But she's changed and the only way to truly turn things around is to finish college and hop on a plane to…anywhere else. Until an unexpected encounter throws her off track.Sheila’s been covering for her big sister for as long as she can remember. Now it’s her turn. But her rebellious plans don’t include small-town fun. She’s got her eye on something better—a group of budding rock stars and a summer-long tour. In the middle of the sisters lands Luke, a determined college student who’s pretty sure he just met his soul mate. But loyalty to his big brother means leaving her behind to go on a three-month tour with his band. Desperate to get over the girl, he soon becomes entranced with the groupie who’s come along for the ride only to find he’ll have to make a tough choice—and not without breaking some hearts along the way.Please Note: Because of Luke is a bittersweet tale that begins in the Summer of 1991. This book is New Adult Contemporary Fiction and does not contain a HEA. While it may be read alone, those who are interested in the futures of remaining characters may consider it a cliffhanger. The next book in the series is a companion novel that picks up where this one leaves off. This book contains profanity, alcohol and drug use, and explicit sex scenes. It is intended for individuals 18+.NetGalley ARCs are available until March 8, 2014. Please note, all digital galleys are uncorrected proofs and may contain minor errors. The text may also differ slightly from the published version. For a limited time, professional reviewers who receive ARCs via NetGalley may request the final copy.",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary Romance",
    "Music"
  ],
  "author": "F.X. Scully",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/18745300-because-of-luke"
}