{
  "title": "Ziemiomorze",
  "description": "Po raz pierwszy w jednym tomie!„Ziemiomorze” Ursuli K. Le Guin to jeden z najznakomitszych cykli literatury fantasy, porównywany z dziełami J.R.R. Tolkiena czy C.S. Lewisa. Opisuje malowniczy świat pełen wysp, smoków i tajemnic, w którym najważniejsza jest równowaga między tworzącymi go siłami. Głównym bohaterem serii jest czarnoksiężnik Ged; poszczególne części opowiadają jego losy – od najmłodszych lat i pierwszych kroków stawianych w świecie magii, aż po czasy gdy zaczęła się ona stawać niebezpiecznym narzędziem w rękach zła. Ged, którego Ziemiomorze na zawsze zapamięta jako Krogulca, zostaje wysłany na wyspę Roke, aby tam zgłębiać czarnoksięską sztukę. Jest obdarzony niezwykłymi magicznymi zdolnościami, więc po latach nauki zostaje Arcymagiem, który będzie musiał pomóc Najwyższej Kapłance Archipelagu – Tenar – uciec z labiryntu ciemności. Niestety, wraz z upływem lat równowaga Ziemiomorza zacznie się chwiać coraz bardziej, a prawdziwa magia i pradawne zwyczaje coraz częściej wykorzystywane będą przez mroczne siły zła i śmierci…Saga o Ziemiomorzu to opowieść o dojrzewaniu, o wyzbywaniu się młodzieńczej pychy i ducha rywalizacji, dorastaniu do wewnętrznej harmonii i mądrości, ale też zrozumienia ograniczoności ludzkich działań. Im większa moc i im większa władza, tym większa odpowiedzialność – przestrzega Le Guin.„Wysokie obcasy”Potrzebowałam sześciu książek i trzydziestu lat życia, by opowiedzieć historię Geda i Tenar. W tym czasie nieustannie dowiadywałam się czegoś nowego o krainach i ludach Ziemiomorza – bo wszystkie przygody i odkrycia bohaterów były też moimi przygodami i odkryciami. (…) I oto wreszcie macie przed sobą ukończoną historię. Oby lektura sprawiła wam równie wielką przyjemność, jak mnie jej pisanie!Ursula K. Le GuinUrsula K. Le Guin urodziła się 21 października 1929 r. w Berkeley. Jej książki stały się klasyką nie tylko fantastyki. To już kanon literatury pięknej – analizowany, poddawany badaniom literackim, antropologicznym i psychoanalitycznym. Pisze dla dorosłych, młodzieży i dla dzieci. Jest autorką scenariuszy filmowych i esejów oraz tekstów piosenek. Została uhonorowana wszelkimi możliwymi nagrodami przyznawanymi twórcom science fiction i fantasy, z Nebulą, Hugo i World Fantasy Award na czele. Amerykańska Biblioteka Kongresu określiła ją mianem Żyjącej Legendy wśród pisarzy. Od 1958 roku mieszka w Portland w stanie Oregon.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Classics",
    "Dragons",
    "Young Adult",
    "High Fantasy",
    "Science Fiction"
  ],
  "author": "Ursula K. Le Guin",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/18743631-ziemiomorze"
}