{
  "title": "A Fantasy Christmas",
  "description": "A Fantasy Christmas is an exciting collection of romantic stories by best selling authors Cindy C Bennett, Stephanie Fowers, and Sherry Gammon. You'll find Elves, Greek gods and witches! *Halfling by Cindy C Bennett Banished from the South Pole, Kara tries to carve out a new life among the elves of the North. It’s not easy with a secret to protect—a secret she's cursed with by the unusual circumstances of her heritage: half-elf, half-fairy. In the North, she’s assigned to work with Seb on a special project. He's the most gorgeous elf she’s ever seen - and the orneriest. As if being banished wasn’t punishment enough. Seb introduces her to Trystin, a fairy from the nearby fairy forest. Trystin discerns her secret right away and promises to teach her how to use the powers given to her by the very thing she’s fighting to keep hidden. *Aphrodite by Stephanie Fowers Nothing is simple for Aphrodite’s daughter, especially love. Scorned by society in regency England, Affry longs for romance. Upon encountering a dashing nobleman at her aunty's Christmas' ball, Affry gets caught in a lovely intrigue with disastrous results. Worse, she wins the interest of the gods. Now the furies of the underworld and Hades himself are after her. When all is fair in war, Affry must use love as her weapon—but only for the one who’s stolen her heart. *Loving Marigold by Sherry Gammon Young Marigold Yarrow has a secret. She’s also in love with Jack Mahoney. In the middle of her ninth grade year, Jack's family up and moves to Port Fare, New York, leaving the small town of Sugar Maple, West Virginia - and Marigold - far behind. Nine years later Jack and Marigold meet again. They join forces to weed out the shady Abbott boys. The unscrupulous brothers are illegally selling moonshine near her home on Sugar Maple Ridge. And they'll do anything to get Marigold to leave the ridge. Anything. But this time it could be magic that tears Jack and Marigold apart.",
  "genres": [
    "Fantasy",
    "Christmas",
    "Romance"
  ],
  "author": "Stephanie Fowers",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/18748884-a-fantasy-christmas"
}