{
  "title": "Love on the Edge: Going Too Far and Forget You",
  "description": "From “a tremendously talented writer with a real gift for developing relationships between her characters” (Romantic Times)—an omnibus edition of her acclaimed romantic teen dramas Going Too Far and Forget You. In Going Too Far, rebel high school senior Meg has to spend her spring break riding along with a police officer on his nightshift patrol as punishment for getting busted for trespassing and underage drinking. Rookie cop, John After, is only two years older than Meg, and a former classmate to boot. He has nothing but contempt for her childish rebellion, and Meg in turn has nothing but contempt for Officer After's straight-laced, by-the-book attitude. But Meg has her reasons for lashing out, and John has his reasons for his need for law and order. And they're about to discover that they have a lot more in common than either one of them could have dreamed... In Forget You, Zoey’s life in her Florida beach resort town is happy and organized. She’s the captain of her high school swim team, and she works for her dad at his popular water park. Then her dad has an affair, and her mother has a breakdown. When Zoey begins a relationship with a hot lifeguard, she feels stable, and everything is still under control. Until she has a car accident that she can’t remember. She should have been with her boyfriend that night, but he doesn’t seem to know anything about the accident—and he doesn’t seem to care. The person who does care, is Doug, Zoey’s handsome arch-enemy who saved her from the wreckage. As Zoey begins to piece together what happened that night, she finds her sense of control over her life was only an illusion. And she inches closer to discovering the darkest secret of all: why Doug has fallen in love with her.",
  "genres": [
    "Romance",
    "Young Adult",
    "Fiction",
    "Young Adult Romance"
  ],
  "author": "Jennifer Echols",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/11030109-love-on-the-edge"
}