{
  "title": "Christmas Romance: The Best Christmas Short Romances of 2013",
  "description": "Four Sweet Christmas stories from your favorite romance authors to warm your heart for the holidays.The Christmas Wreath - Angela Ford: Annie Dixon’s love for nature and her hometown of Glenville has her driven to find a way to keep the tree farm from outsiders. When the bank grants sixty days before the tree farm is listed for public sale, Annie and her friends devise a plan to finance the buy. The death of Annie’s childhood friend brings Detective Ryder Harris back to Glenville. A child in his eyes, he always called her ‘Sweet Annie’. Now he sees her differently. Annie never admitted she had a big crush for Ryder. Now that familiar flutter in her heart is back. Annie knows Ryder won’t settle in Glenville. And is Ryder really back for his sister’s funeral or is he connected to the town resort’s sudden disappearance of their manager? For the first time in many years, Ryder is excited about the holidays. Will the magic of Christmas forever connect these two hearts Central Bark at Christmas — Jennifer Conner — When Tennyson’s boyfriend left her for her best friend from high-school, all Tennyson received in the break up was her dog. She’s sworn off men and now is rebuilding her life. The only thing Par does is work. He barely has time to do anything he wants for himself other than take his dog to the dog park. When Par and Tennyson find an abandoned dog at the park named Duke, will they find room in their hearts to take him in? And can this Christmas season weave some special magic for the two of them? Halo's Wish — Sharon Kleve — Halo Ann Carlyle wishes for a home, family, and a boat-load of pets. What she gets is a bruised hip, a lump on the head, a broken ankle, and her new yellow Honda Civic is demolished. Rich McFarland, a sexy veterinarian, keeps showing up in the most unexpected places, promising everything she's ever wanted.Halo believes she only has time to pursue her career as a pet detective and must ignore her growing attraction to achieve her dreams. Will Halo trust her heart, and find a way to get both before Christmas? Christmas Hope — Casey Dawes — Clara Misowski is convinced Sam Richards’ cheese making operation would be a perfect stop for her culinary tour group. He’s adamantly opposed to anything to do with a group of women on his farm. Can she convince him to open his heart to company, Christmas, and maybe even her?",
  "genres": [
    "Romance",
    "Christmas",
    "Anthologies",
    "Amazon",
    "Holiday",
    "Contemporary Romance"
  ],
  "author": "Danica Winters",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/18749222-christmas-romance"
}