{
  "title": "The Z Contingency",
  "description": "What if one of the world's top virologists predicts that a deadly virus will mutate into a highly contagious form causing people to turn into zombies? What if he creates the virus with intentions of making a cure, only to have it stolen before he can finish his work? Enter an agent working for a secret government agency whose mission is to protect U.S. interests. But when terrorists threaten his family, will revenge cause him to stray from his primary mission? Will the fate of the U.S. lie in the hands of a network of Zombie Apocalypse preparedness groups whose loyalties are not always clear?Gary Ecks, a world-renowned scientist with an uncanny knack for predicting outbreaks of viral hemorrhagic fevers has a terrifying realization that one of these viruses will soon mutate into something that seemingly kills its victims, but actually brings them to a near death state, allowing them to move about and further spread the virus. He foresaw the arrival of a virus that could start the zombie apocalypse.In an attempt to prevent the start of a zombie apocalypse, Gary believes he needs to create a vaccine before the virus naturally appears, so he needs the help of a colleague at the Centers for Disease Control and Prevention in Atlanta, Natalie Wyler, to help create the very virus he predicted. She had pioneered a method to create viruses with specific genetic sequences.Something convinces Natalie to help him in spite of every fiber in her being screaming out against it, but the two scientists are prevented from starting work on the vaccine.Little do they know that their activity at the CDC has also been flagged by a secretive shadow government organization. But what is their true agenda? Will they help stop a zombie virus outbreak, or act on a hidden agenda?Further complications arise as the lab goes on furlough, separating Gary and Natalie while they each return to their hometowns, leaving the lab and the virus samples unattended.A series of events leads Gary on a mission to find Natalie, and the goal to develop a vaccine becomes one to hunt for a cure.",
  "genres": [
    "Zombies"
  ],
  "author": "W.I. Eganson",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/18749214-the-z-contingency"
}