{
  "title": "Living in Sin",
  "description": "**This story contains graphic sexual content and strong language. Intended for mature audiences only.**  Jace Jamison is every woman’s fantasy. He’s a mysterious businessman willing to sweep you off your feet, a tattooed bad boy from the wrong side of the tracks, and a sexy friend you want to take that next step with. Jace is everything and anything you want him to be. He’s a highly paid escort.   But nobody knows who Jace really is; the man whose dad abandoned him, whose brother was killed, and who had to take care of his mom at a young age. At the age of nineteen, he was living in Sin City, ready for a life away from stress and struggle.   Adrienne has been having a sexual drought since she broke up with her boyfriend. Even then she wasn’t getting fully satisfied. Being an event planner, she’s constantly working at numerous events. Several times she’s seen a man she can only refer to as the God-like creature at her work functions. He’s devastatingly handsome, tall, and has beautiful eyes, but he’s always with a different woman. The last thing she needs is another player in her life. After a few chance encounters with Jace, her best friend convinces her to just get some good sex out of him and not worry about who she’s seen him with. But what happens when she finds out that he isn’t dating these women because he wants to, but because he’s paid to? Keeping his job a secret from Adrienne seems easy at first, but when she begins meeting people he knows in his escort life, and they begin getting closer, he knows he has to tell her before someone else does. When their worlds entwine, and confessions are made, will they be able to work through it? Will she be able to push aside his sins and focus on the good in him? Will Jace get what he’s never had? A woman who wants him despite what he’s done. Or will living in sin cost him what he never knew he wanted? *An erotic, contemporary romance* *Book one in a series, but can be read as a standalone.*--As it's been mentioned a lot, I want to warn you of the first chapter. For some people, it's hot and amazing, and they love it! For others, it's shocking and not for them. However, don't let it scare you away, it's not like that the whole way through. Others who were taken aback by it, ended up giving it 5 stars.It is an erotic book though, so there will be adult situations. ;)--",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "Menage",
    "Contemporary",
    "New Adult",
    "Erotic Romance"
  ],
  "author": "Isabel Lucero",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/18751818-living-in-sin"
}