{
  "title": "Write! Stop Waiting, Start Writing. A Step-By-Step Guide to Turn What You Know Into a Book",
  "description": "If you’ve ever thought about writing a book, then this Amazon #1 bestselling book is for you.If you've ever wondered how to grow your reach or increase your visibility and credibility then this might be exactly what you've been looking for. There's never been a better time to publish and Write! shows you how to take your ideas, your knowledge, your expertise, and your experience, and put them into your first (or next) non-fiction book.This is a guidebook for smart people who don’t necessarily think of themselves as writers, but who want to write; want to become a published author. It's especially for you if you want to share your message or grow a business (or maybe both). You feel drawn to write a book but you're not sure if you have the time, or how and where to start.Or maybe you've written a book already and the results weren't quite what you expected. You want to do it right this time.This book is your complete step-by-step guide to writing a non-fiction book.Write! is designed to deliver:• Absolute clarity on what you should write. Getting clear on this gets you out of overwhelm and makes finishing your book feel very real and completely achievable.• Concrete ideas for going beyond the book. Maybe you want to grow your business, start a speaking career, or just find a way to tell your story to more people?• An outline of how much it will cost if you want to self-publish – and some creative ideas for you to fund those costs (even before you write a word).• Your full book outline. You'll design a flow that makes sense to your reader, and a way of organising your content that connects with your reader. It isn’t quite writing by numbers but once you have this the writing part will be easy.• A complete set of strategies to stay focused when you start to write. You'll be able to banish writer’s block forever, work out how and when to write around your job and personal life (we're all busy!) and actually finish the book.• The formula for a bestselling book title – there are no guarantees, but model success and you're more likely to achieve it.• The foundation for your book launch – figure out your marketing messages, what to say so that you hold attention, and how to connect with people who will help support you and build the buzz when it comes time to launch.If you’ve ever thought about writing a book but don’t know how, or don’t even know if you can, or if it's right for you, then this book will give you a vision of what's possible, show you how to create a flow and structure that really works, and give you the confidence to start and the self-assurance to finish.Your world will change when you realise how much value there is in what you know and how many lives you can touch. Half a day working through the content in this action guide might just make the difference between writing a book ‘someday’, and creating something you can hold in your hands tomorrow.",
  "genres": [
    "Writing",
    "Nonfiction"
  ],
  "author": "Cathy Presland",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/18752579-write-stop-waiting-start-writing-a-step-by-step-guide-to-turn-what-yo"
}