{
  "title": "Broken",
  "description": "Fate lands Ayma and Colton together in the senior year. Ayma is from a rich community, member of the geek squad, and an easy target for the popular kids at her school. Colton was and is the guy all the girls want and who the other guys in school want to be like. After spending two years in a juvenile prison, he is back at Bay Shore for his senior year. Will love finally conquer all ? Who I am, who I’m not, and who I want to be can probably describe a large majority of teens in high school. Assumptions will constantly be made based on what you look like, who your friends are, what type of clothes you wear, your name, and anything else that has to do with your past, your family’s past, or anything else that makes you who you are. Meet Ayma, Colton, Tabby, Brady, Reagan, Ash, and Kennedy. They each have their own story to tell. Many assume they know them based on their outside, but what you see is totally different from who they really are. Broken; Book One of the Assumption Series centers on Ayma and Colton. It follows them through the first half of their senior year in high school. One where life should be exciting, fun, and happy…but sadly it isn’t always like that. Ayma comes from wealthy divorced parents. Her mother has made her life a living hell from the time she was born and named. Her life has been planned and designed to make her a replica of her mother; a socialite living on Bay Shore. Ayma is trying to break that mold. She wants to be nothing like her mother, but really doesn’t know who or what she wants to be. She has her limited friends, but lots of nemesis’, low on the social ladder, and a name that will haunt her forever. Then along comes Colton; he is what everyone wants or wants to be like. Colton is the opposite of Ayma, he’s not rich, has a supportive family, tons of people who want to be his friend, but Colton feels he is damaged at best. He has a past, one that includes time in jail. Ayma and Colton seem to balance each other out, they aren’t supposed to be together, they are complete opposites, but yet the attraction is one they can’t fight for long…will his past catch up and tear them apart or will they be able to pull through all the obstacles that were created to break them. Broken is how both of them feel. Can they help each other to fix the broken pieces of their lives or will unforeseen circumstances keep their lives forever shattered.",
  "genres": [
    "Young Adult",
    "Young Adult Romance"
  ],
  "author": "Izzibella Beau",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/18754411-broken"
}