{
  "title": "The Stars Change",
  "description": "On the brink of interstellar war, life (and sex) continues. Humans, aliens, and modified humans gather at the University of All Worlds in search of knowledge... and self-knowledge... but the first bomb has fallen and the fate of this multicultural, multispecies mecca is in question. A thought-provoking work on sexuality and the connections between people--whether male or female, human or alien--The Stars Change is part space opera, part literary mosaic of story, poem, and art. The Stars an erotic science fiction novel-in-stories. On a South Asian-settled university planet, tensions are rising, and as they reach the brink of interstellar war, life (and sex) continues. Humans, aliens, and modified humans gather at the University of All Worlds in search of knowledge... and self-knowledge... but the first bomb has fallen and the fate of this multicultural, multispecies mecca is in question. Some people will seek solace in physical contact, some will look for spiritual answers, while others will find their strength in community, family, and love. Some will rush home to make love to their wife. Or wives. Or husbands. Or indeterminate gender human and/or alien partners. Others will be forced to decide where they stand -- what is worth fighting for, or maybe even worth dying for. In The Stars Change, author Mary Anne Mohanraj presents a multi-layered, thought-provoking, and far-reaching work on sexuality and the connections between people--whether male or female, human or alien. The Stars Change is part space opera, part literary mosaic of story, poem, and art. It is fitting that a book that emphasizes the power of community was funded through Kickstarter. Begun as a project entitled \"Demi Monde,\" The Stars Change is the result of the money raised by supporters that went to pay for not only the art and illustrations in the book, but the author's time, allowing her to focus on writing for that crucial interval. About the Mary Anne Mohanraj is the author of Bodies in Motion, Sri Lankan-American linked stories (HarperCollins), as well as Silence and the Word, The Best of Strange Horizons (ed.), Aqua Erotica (ed.), and The Poet's Journey (a children's fantasy picture book). Bodies in Motion was a finalist for the Asian-American Book Awards and has been translated into six languages. Mohanraj received an Illinois Arts Council Fellowship in Prose (2006). Mohanraj lives in Chicago, where she teaches creative writing and post-colonial literature at the University of Illinois; she also taught at the Clarion workshop in 2008. She is a graduate of Clarion West, and holds an MFA and a Ph.D. in creative writing.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "LGBT",
    "Queer",
    "Erotica",
    "Romance",
    "Speculative Fiction"
  ],
  "author": "Mary Anne Mohanraj",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/18754952-the-stars-change"
}