{
  "title": "Managing Humans: Biting and Humorous Tales of a Software Engineering Manager",
  "description": "In this fourth edition of the bestselling business book Managing Humans, author Michael Lopp continues to draw leadership advice from some of the most important software companies of our modern age. Educational stories from companies such as Apple, Slack, and Pinterest detail the experiences of bright software engineers in an ever-changing industry. This revised edition of Managing Humans expands on the previous editions’ explorations of management essentials including handling stress, building diverse teams, running inclusive meetings, and how to lead in times of crisis. The education of a great leader never stops, and Lopp applies crucial insights to help continue your never-ending leadership education. Whether it is approaching a myriad of engineering personalities or handling unexpected conflict, you will come away with the wisdom to handle any team situation. The engineering culture of a company can determine the difference between a product’s ultimate success or failure. Managing Humans is here to guide managers and aspiring managers into the intimidating world of people and their vastly different personalities. Handle conflict, infuse innovation into your approach, and be the most confident manager you can be after reading this book. “It is so satisfying to read the work of an author who articulates something we know, but can’t put our finger on, and then answers the excitement of fresh revelation with useful solutions or a frame to think about what we’ve just learned―all done in a breezy, knowing prose, that invites you to constantly write margin notes to capture the new thinking it invites.” John Dickerson, author, CBS News correspondent",
  "genres": [
    "Management",
    "Leadership",
    "Business",
    "Nonfiction",
    "Technology",
    "Programming",
    "Software"
  ],
  "author": "Michael Lopp",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/18757946-managing-humans"
}