{
  "title": "My Lady Series Bundle",
  "description": "My Lady Series Bundle (1-5) includes:My Lady CompelledMy Lady EnslavedMy Lady CaptiveMy Lady TakenMy Lady EnthralledMy Lady CompelledLady Gabriella St. John is purchased, from a scandalous \"wives sale,\" by her long-ago admirer and now ex-spy the Duke of Kitteridge.Lord Kitteridge intends to command and seduce his newly purchased lady away from her too strict English morals. Erotic passions battle amid adventure when Lady Gabriella's husband returns, trying to steal her back. Old secrets are revealed and launch the Archangels into a new mission to save Lady Gabriella. My Lady EnslavedCaptured between her deadly twin sister and Lord Ravenscar, Chloe finds herself kidnapped into darkness.The coldly handsome and sexually arrogant Ravenscar refuses to believe Chloe's claims of mistaken identity as he propels her into the heady realm of submission. This dramatic and carnal adventure finds ex-spy Lord Harrison Ravenscar out for revenge. My Lady CaptiveLord Wyndham Hawkenge risks everything trying to save Lady Orelan from the hedonistic clutches of an old revival, Alexei Tropov. Orelan and Wyndham become ensnared within the decadent halls of Valcourt . . . unwilling players in Alexei's wicked games as Wyndham battles wits and danger trying free the young widow, Orelan. My Lady TakenThe Duke of Sutherlin's spying career is over and the time has arrived for him to marry. But Radford isn't certain he can find a hot-blooded lady like his ex-spying friends from the Archangels have. Never daunted, he concocts a plan to find a passionate woman to marry by betting himself in marriage on the books at White's. He is a Duke after all. What he doesn't expect is the feminine artifice of Lady Nia O'Shea when she sets her witty, seductive, and scheming sights on him. But all is not what it seems in this erotic adventure My Lady Enthralled This is an erotic romance chiller and not for the faint of heart. Saxonhurst embarks on a dark and very dangerous adventure. He travels overseas, but from mischance, he becomes noticed by the depraved followers of a hedonistic cult. They covet his long river of maple-brown colored hair and his unwilling sexuality for their perverted ceremonies . . . Sexual sacrifices orchestrated by their evil leader, Lord Hellion. Saxon struggles to save both his life and beautiful Joelle's life. Joelle who was captured with him in the salacious web. Yet, they will fight any way they can, trying desperately to gain their freedom.",
  "genres": [
    "Historical Romance",
    "Regency"
  ],
  "author": "Shirl Anders",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/18757019-my-lady-series-bundle"
}