{
  "title": "The Poet Who Watched The Whole Parade",
  "description": "Jay Floyd is many things: a father, a husband, a brother, a son, a poet, musician, and so much more. The Poet Who Watched the Whole Parade, the personal memoirs of Jay Floyd, digs deep into his childhood with chapters of spiritual reflection between each shared memory. The author dissects the people and moments that crafted his psyche within its pages (39,466 words). This book explodes with laughs and tears, family, friends, pimps and the occasional psychological diagnosis. Every character has their own chapter, with poetic personal reflections sandwiched between.Born Jason Edward Floyd in Cleveland, OH in 1976, Jay Floyd was the younger of two brothers, raised by a mother nearly forty years old at his birth; he absorbed a unique blend of generational perspectives, as well as intense tragedies. From his uncle's cocaine overdose, his brother's murder, finding his mother's dead body alone in her apartment, even reconciling with his father and then losing him again to a stomach ulcer, he was diagnosed with Post-Traumatic Stress Disorder (PTSD), but still believes there is hope for the future. Jay explains that although he has gone through so many devastating losses, he is finding a way to wrap himself in the love and lessons he has received throughout his life, as well as liberating from the emotional threads that kept him bound to his past.The Poet Who Watched the Whole Parade is based on a concept that life, for each of us, is a parade and we all witness figures coming into our lives, large and colorful and then we see them pass by, realizing how human and frail they always were. Jay wrote this book not only for himself, but for the ones he has lost. He tells their story to honor their memories and to stress the importance of what comes from these losses. His message is that love is how we heal and who we are, because to give love is to be human. We are all one and we are all participants in this parade called life.This book allows readers to not only walk with Jay Floyd through his spiritual journey, but also explore the lessons of their own parade. Readers of all ages will relate to this book because we all have had losses in our lives, but it is through healing that we grow.",
  "genres": [],
  "author": "Jay Floyd",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/18758887-the-poet-who-watched-the-whole-parade"
}