{
  "title": "To Hold The Sun",
  "description": "An award winning book that can change your life!This delightful and engaging story outlines the experiences of a young, poor, and disillusioned reporter who is enticed to do a series of articles about Paul, an unconventional philosopher and motivational speaker. In lieu of payment, he gets to travel to and dive on Roatan, arguably one of the most beautiful, pristine islands in the Caribbean. Through a series of meetings, the reporter gets to know Paul's innermost philosophies. He learns an alternate way of living from a man who strives to perfect handstands on a dock and practices the art of happiness. The author developed the book as a guide to help his children live their lives in a way that would allow them to enjoy the journey. Drawing on wildly diverse disciplines including stoicism, neuroscience, skepticism, behavioral economics, and spirituality; the reader is taken on a journey that exposes the author's philosophy of life. He demonstrates that happiness is indeed a choice. All places detailed on Roatan exist and are more beautiful than described. Photos are by kind permission of Shawn Jackson.\"So much more than just an original, engaging, and consistently entertaining story, 'To Hold The Sun' can be viewed by the reader as a kind of guide or blueprint to live life in a way that would enable an appreciation of the journey and not just the destination. An expertly crafted work from beginning to end, 'To Hold The Sun' is enthusiastically recommended reading and will prove an enduringly popular addition to community library collections!\"-- Midwest Book ReviewChas describes the spiritual warrior's journey in way that makes you want to come along, roll up your sleeves, and do the work required to become the best version of you there is!-- Timber Hawkeye, Buddhist Boot Camp",
  "genres": [
    "Self Help",
    "Philosophy",
    "Nonfiction",
    "Spirituality",
    "Metaphysics"
  ],
  "author": "Chas Watkins",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/18757195-to-hold-the-sun"
}