{
  "title": "Maggie Mae",
  "description": "July 4th 2005, Maggie's wedding day was the happiest day of her life, the most painful day of her life and the day she died three times.Maggie lives as a recluse in the home that she and her dead husband, Jimmy, built together. It's all she has left of him. She has her friends, but has turned her back on the world and any possibility of spending her life with another man.Five years after Jimmy's tragic death, Maggie's world is once again turned upside down when the last hold she has to her husband, their home, is destroyed. Maggie is thrown into the path of a man, the only man, that can bring her back to life. Elk Bend Chief of Police Michael Rogers is there to help her pick up the pieces and move on.Rafferty, a close friend, has loved Maggie for years. He has been waiting for her to get over the loss of her husband and knows that in time she will be with him.Rafferty has inserted himself into Maggie's life so deeply that she doesn't see his obsessive behavior. She doesn't realize that she has been stalked by Rafferty even before the death of her husband, or the danger that Rafferty represents to her. Maggie is his and he will do whatever he has to in order to keep her.Will Maggie be able to start a new life with Michael? Or will she be so consumed with the fear of losing him that she is paralyzed to move forward with her new life?Will Rafferty have the power over Maggie to extinguish any feelings she has for Michael? Or will he destroy her trying to wrestle her away from her fate with another man?This book will make the readers weep uncontrollably when they read about the tragic murder of Maggie's husband, Jimmy, and laugh with the interations of Maggie and her friends. They will take a journey into the life of the characters that will make them escape and feel the wonder of love transcending death.",
  "genres": [
    "Paranormal Romance",
    "Ghosts"
  ],
  "author": "Sandy Wolters",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/11032373-maggie-mae"
}