{
  "title": "Evil Eyes Sea",
  "description": "-The Best Graphic Novels of 2024, The Guardian-Best Graphic Novels for Adults 2024, American Library AssociationThis fictional graphic novel narrates a mystery story set in Istanbul before the 1995-96 elections. The story takes place against a background of political propaganda; a conservative party is rising to power using religion to appeal to voters cynically.   The main protagonists, Ece and Meltem, are engineering students at Bosphorus University and in financial distress. Ece and Meltem fantasize about having the powerful gaze of Medusa and amuse themselves with efforts to move objects with their eyes. They also share a passion for scuba diving as members of the Student Diving Club.   While on a diving expedition in the Bosphorus Strait, they witness a freak accident underwater. Did Ece and Meltem’s evil eye cause the accident? Their investigation leads them to a search for truth and a treasure hidden under the Bosphorus. But their hopes of solving their financial troubles become entangled with political corruption, and they must make grim decisions while navigating a climate of chauvinism, patriarchy, religious pressure, and economic instability. The evolving events threaten their friendship, ethical values, and even their lives—as well as the future of their country.-The Best Graphic Novels of 2024, The Guardian-Best Graphic Novels for Adults 2024, American Library Association“There’s less time for contemplation in Özge Samancı’s 90s-set Evil Eyes Sea (Uncivilized Books), which sees two Istanbul students investigate the death of a friend who plunged into the Bosphorus in a Cadillac. It’s a fine mix of Tintin-style adventure and social commentary, complete with smelly dorm rooms, puffed-up gangsters and Scuba diving.”—The Guardian“It's a book that’s never quite what you expect, and its power as a narrative is not of a sudden explosion, but of a quiet storm.”—The Comics Journal“Try as they might, Ece and Meltem, students in 1990s Istanbul, can’t get over the underwater accident they witnessed. Wrangling with the misogyny of college life a­nd the chain of an upcoming election, eventually, they realize that maybe they shouldn’t.”—The New York Times, Book Review“In this rambunctious murder mystery set in 1990s Turkey, Samancı (Dare to Disappoint) contrasts a playful and vibrant visual style with deadly serious themes.”—Publishers Weekly“As entertaining as it is exposing, Samanci’s sophomore title is an exquisite, multilayered showpiece confronting gender inequity, religious manipulations, political corruption, and the gray zones of morals and ethics—gray zones necessary for survival.”—Booklist, STARRED REVIEW\"Evil Eyes Sea is a work that turns its powerful, Medusa-like gaze on womanhood, corruption, and moral responsibility while still being an entertaining, fast-paced read. Taking the plunge into its watery depths is a rewarding experience.”—The Third Coast Review“Scuba meets stone cold corruption in EVIL EYES SEA.”—The Beat“As one might expect from Samanci, it is still really fun and funny, while treating its serious subjects with dignity.”—Women Write about Comics“Despite the heavy themes, there’s humor in [Samanci’s] drawings and dialogue — moments of levity in otherwise dismal circumstances.” —Northwestern Magazine“It’s a beautiful mix of humor, tragedy, and heart.”—Murder and Mayhem",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Mystery",
    "Graphic Novels Comics",
    "Fiction"
  ],
  "author": "Ozge   Samanci",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/187622866-evil-eyes-sea"
}