{
  "title": "Worst Fears Realized",
  "description": "He's not a man to dwell on the past, but Stone Barrington has no choice but to rattle old skeletons when people close to him start dying and he has little to go on but the suspicion that the killer may be someone he once knew. The trip down memory lane isn't all bad though, for it reunites Stone with his ex-partner, Dino Bacchetti—now head of detectives in the nineteenth precinct.Trying to find a brilliant killer in a sea of old faces is difficult enough without Stone's former love, Arrington, now Mrs. Vance Calder, resurfacing too—especially when she sets off her own fireworks by coming nose to nose with his latest flame, a Mafia princess named Dolce, as beautiful as she is dangerous.Caught on a thrill ride of a case that tests him as none has done before, Stone races to find a twisted madman with a taste for blood vengeance. Can he find him before his worst fears are realized?Librarian's note: the characters, settings and other information for the first 25 books in the series are complete as best possible (corrections are welcome!) for: #1, New York Dead, 1991; #2, Dirt, 1996; #3, Dead in the Water, 1997; #4, Swimming to Catalina, 1998; #5, Worst Fears Realized, 1999; #6, L.A. Dead, 2000; #7, Cold Paradise, 2001; #8, The Short Forever, 2002; #9, Dirty Work, 2003; #10, Reckless Abandon, 2004; #11, Two Dollar Bill, 2004; #12. Dark Harbor, 2006; #13, Fresh Disasters, 2007; #14, Shoot Him if He Runs, 2007; #15, Hot Mahogany, 2008; #16, Loitering with Intent, 2009; #17, Kisser, 2009; #18, Lucid Intervals, 2010; #19, Strategic Moves, 2010; #20, Bel-Air Dead, 2011; #21, Son of Stone, 2011; #22, D.C. Dead, 2011; #23, Unnatural Acts, 2012; #24, Severe Clear, 2012; and #25, Collateral Damage, 2012.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Suspense",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Stuart Woods",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/187648.Worst_Fears_Realized"
}