{
  "title": "Island of Dreams",
  "description": "\"My family has been forced to live like an island with no political party, president, or official language. We are not of any \"new world\" Columbus discovered. We are not Dominican enough or American enough to call either place home. We live and love with one foot on the ground and one foot in the sea.\" This is how Jasminne Mendez describes what it was like for her to grow up a Dominican American military brat. Always feeling like a foreigner in both lands because people want to know \"where you from,\" and \"how do you know Spanish?\" In \"Island of Dreams,\" author Jasminne Mendez, addresses these questions and their complicated answers in a multi-genre memoir that effortlessly blends poems and short stories to offer a glimpse into the challenges, joys, hopes, fears and disappointments she and her family faced being Dominican in America. Her work explores everything from the love/hate relationship she had with her hair and her mother, to the many memorable but sometimes unpleasant family vacations and holidays she shared with her parents, siblings, primos, tios, y tias. These captivating stories and poems are about family, food, love, culture, self-discovery, assimilation, and the American dream. They are about a young girl who respects the richness and abundance of her cultural history, but who struggles to form her own identity because her Dominican values conflict with her American self and all she wants to do is find a place to call home. Join memoir-writer Jasminne Mendez in this luscious recalling of her family's multi-faceted sojourn of family ties and their meaning, glorious cooking and eating, belonging and not belonging, and so many other complicated forays into the storied past. Sarah Cortez, author, \"Walking Growing Up Hispanic in Houston.\" Jasminne builds bridges between many worlds. Her potent voice conjures images of the Dominican Republican, Texas, Houston, the world. I've had the pleasure of seeing her perform in person. She is amazing in 3D. Actually, she performs in 6D-adding spirit, whimsy, and the future. She code-switches so brilliantly that you don't notice that she has jumped from Spanish to English to Spanglish to universal themes and back. Her work not only stands up on the page but takes on new meaning with potency, shattering barriers, breaking borders. This book will boggle your mind and thrill you. Tony Diaz, \"El Librotraficante,\" founder of Nuestra Latino Writers Having Their Say",
  "genres": [],
  "author": "Jasminne Mendez",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/18771789-island-of-dreams"
}