{
  "title": "The Debate on the Constitution, Part 1: Federalist and Anti-Federalist Speeches, Articles, and Letters During the Struggle over Ratification: September 1787 to February 1788",
  "description": "In this Library of America volume (and its companion) is captured, on a scale unmatched by any previous collection, the extraordinary energy and eloquence of our first national political campaign.When the Constitutional Convention in Philadelphia ended its secret proceedings on September 17, 1787, few Americans were prepared for the document that emerged. Instead of revising the Articles of Confederation, the framers had created a fundamentally new national plan that placed over the states a supreme government with broad powers. They proposed to submit it to conventions in each state, elected “by the People thereof,” for ratification.Immediately, a fierce storm of argument broke. Federalist supporters, Antifederalist opponents, and seekers of a middle ground strove to balance public order and personal liberty as they praised, condemned, challenged, and analyzed the new Constitution.Assembled here in chronological order are hundreds of newspaper articles, pamphlets, speeches, and private letters written or delivered in the aftermath of the Constitutional Convention. Along with familiar figures like Franklin, Madison, Patrick Henry, Jefferson, and Washington, scores of less famous citizens are represented, all speaking clearly and passionately about government. The most famous writings of the ratification struggle—the Federalist essays of Hamilton and Madison—are placed in their original context, alongside the arguments of able antagonists, such as “Brutus” and the “Federal Farmer.”Part One includes press polemics and private commentaries from September 1787 to January 1788. That autumn, powerful arguments were made against the new charter by Virginian George Mason and the still-unidentified “Federal Farmer,” while in New York newspapers, the Federalist essays initiated a brilliant defense. Dozens of speeches from the state ratifying conventions show how the “draft of a plan, nothing but a dead letter,” in Madison’s words, had “life and validity…breathed into it by the voice of the people.” Included are the conventions in Pennsylvania, where James Wilson confronted the democratic skepticism of those representing the western frontier, and in Massachusetts, where John Hancock and Samuel Adams forged a crucial compromise that saved the country from years of political convulsion.Informative notes, biographical profiles of all writers, speakers, and recipients, and a detailed chronology of relevant events from 1774 to 1804 provide fascinating background. A general index allows readers to follow specific topics, and an appendix includes the Declaration of Independence, the Articles of Confederation, and the Constitution (with all amendments).",
  "genres": [
    "History",
    "Politics",
    "American History",
    "Nonfiction",
    "Philosophy",
    "Law",
    "American Revolution"
  ],
  "author": "Benjamin Franklin",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/110342.The_Debate_on_the_Constitution_Part_1"
}