{
  "title": "Labor's Untold Story: The Adventure Story of the Battles, Betrayals and Victories of American Working Men and Women",
  "description": "Fundamentally, labor's story is the story of the American people. To view it narrowly, to concentrate on the history of specific trade unions or on the careers of individuals and their rivalries, would be to miss the point that the great forces which have swept the American people into action have been the very forces that have also molded labor. Trade unionism was born as an effective national movement amid the great convulsion of the Civil War and the fight for black freedom... Labor suffered under depressions which spurred the whole American people into movement in the seventies, in the eighties, and in the nineties. It reached its greatest heights when it joined hands with farmers, small businessmen, and the black people in the epic Populist revolts of the 1890's and later in the triumph that was the New Deal. For labor has never lived in isolation or progressed without allies. Always it has been in the main stream of American life,... Labor's story, by its very nature, is synchronized at every turn with the growth and development of American monopoly. Its great leap forward into industrial unionism was an answering action to the development of trusts and great industrial empires. Labor's grievances, in fact the very conditions of its life, have been imposed by its great antagonist, that combination of industrial and financial power often known as Wall Street. The mind and actions of William H. Sylvis, the iron molder who founded the first effective national labor organization, can scarcely be understood without also an understanding of the genius and cunning of his contemporary, John D. Rockefeller, father of the modern trust. In the long view of history the machinations of J. P. Morgan, merging banking and industrial capital as he threw together ever larger combinations of corporate power controlled by fewer and fewer men, may have governed the course of American labor more than the plans of Samuel Gompers",
  "genres": [
    "History",
    "Labor",
    "Nonfiction",
    "Politics",
    "School",
    "American History"
  ],
  "author": "Richard O. Boyer",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/187725.Labor_s_Untold_Story"
}