{
  "title": "Beyond Control",
  "description": "Gabby Sullivan learns in college that some things are impossible to control, and whenever life has spun out of control bad things seem to happen. She promises herself that she’ll stay a safe distance from the top three culprits: sex, love, relationships.But some things are beyond control…Gabby handles her mom’s death and brother’s sudden abandonment just about as well as anyone could at the age of twelve. Left feeling alone, she finishes high school, developing a bit of a wild streak, and lives like there’s no tomorrow. That is until an illness stops her in her tracks. Learning to control life around her becomes her comfort. With a visible scar that reminds her and the world that she beat the odds, it’s impossible for her to put everything behind her, no matter how hard she tries.Right out of college she begins working at her family’s company and buries herself in the safety of the corporate world. No extra time, no life, no relationships. It’s safe to say she might be a little demanding and overly ambitious, but she’s got everything under control, just how she likes it.Jason’s been trying to piece his life together after a personal tragedy, only it’s not working. He’s thrown himself into his work, but he’s only becoming angrier. He’ll never forgive himself and doesn’t expect anyone else to either.When the back of his vehicle is clipped by an obnoxious limo driver he can’t wait to let the driver have it until he hears Gabby’s voice coming from inside the sedan. There’s something soothing about it, something familiar.The moment she sees him, she knows her life will never be the same. But she doesn’t know why. He’s everything she said she never wanted. He’s cocky, arrogant, and infuriating. With his dazzling amber eyes, dark hair and chiseled features she can hardly remember where she’s going, let alone where she’s been and maybe that’s a good thing. She begins to let him show her what life could be, if she really lived it.Neither wants their past to define their future, but sometimes destiny has something else in store. It’s only as their love grows and secrets are revealed that they realize a devastating connection from their past might actually tear them apart.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "Amazon",
    "Chick Lit",
    "Contemporary",
    "Fiction"
  ],
  "author": "Karice Bolton",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/18770539-beyond-control"
}