{
  "title": "Entre o Amor e o Sacrifício",
  "description": "Kate Miler não era exatamente uma jovem normal. Ela era uma garota solitária que se sentia estranha e diferente. Havia sido misteriosamente abandonada em um orfanato quando era um bebê prematuro, com poucas chances de sobrevivência. Se não bastasse ter a capacidade de presenciar criaturas perversas e entidades demoníacas, sofria constantes pesadelos inexplicáveis que, sempre a levavam à morte. Filha adotiva de um jovem casal, eles se mudavam constantemente, no entanto, Kate sabia que esta era só uma desculpa para fugirem novamente de uma cidade para outra, ela só não sabia a razão pela qual os pais mentiam. Aliás, essa seria a sua terceira adoção, pois, suas famílias antecedentes haviam sido brutalmente assassinadas, enquanto Kate ainda era criança e por algum mistério, só ela havia sobrevivido, mesmo estando presente em meio aos ataques. Aos dezenove anos, em uma nova cidade, ela conhece um grupo de jovens misteriosos com poderes sobrenaturais que são responsáveis a desempenharem estranhas e secretas missões, entre eles, está um rapaz bonito e ardiloso que vive confrontando-a e não larga do pé dela. Mesmo seduzida pelo seu sorriso cativante e sentindo uma forte conexão por ele, Kate tenta afastá-lo de diversas maneiras, porém, não consegue evitá-lo e uma atração inevitável surge entre os dois. Cansada de fugir e sentir medo, ela decide embarcar em uma jornada em busca da verdade, contando com a ajuda de seus novos amigos, para descobrirem quem, e o que, realmente ela é. Kate só não imagina que por traz de todo este mistério que envolve a sua vida, existe uma disputa entre seres sobrenaturais do mais alto escalão que habitam mundos místicos e desconhecidos pela raça humana, e que a recompensa dessa batalha a ser conquistada seria nada menos do que ela.",
  "genres": [],
  "author": "Gisele de Assis",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/18771605-entre-o-amor-e-o-sacrif-cio"
}