{
  "title": "The Bingo Queens of Oneida: How Two Moms Started Tribal Gaming in Wisconsin",
  "description": "Before Indian casinos sprouted up around the country, a few enterprising tribes got their start in gambling by opening bingo parlors. A group of women on the Oneida Indian Reservation just outside Green Bay, Wisconsin, introduced bingo in 1976 simply to pay a few bills. Bingo not only paid the light bill at the struggling civic center but was soon financing vital health and housing services for tribal elderly and poor.While militant Indian activists often dominated national headlines in the 1970s, these church-going Oneida women were the unsung catalysts behind bingo’s rising prominence as a sovereignty issue in the Oneida Nation. The bingo moms were just trying to take care of the kids in the community.The Bingo Queens of How Two Moms Started Tribal Gaming tells the story through the eyes of Sandra Ninham and Alma Webster, the Oneida women who had the idea for a bingo operation run by the tribe to benefit the entire tribe. Bingo became the tribe’s first moneymaker on a reservation where about half the population was living in poverty.Author Mike Hoeft traces the historical struggles of the Oneida―one of six nations of the Iroquois, or Haudenosaunee, confederacy―from their alliance with America during the Revolutionary War to their journey to Wisconsin. He also details the lives of inspirational tribal members who worked alongside Ninham and Webster, and also those who were positively affected by their efforts.The women-run bingo hall helped revitalize an indigenous culture on the brink of being lost. The Bingo Queens of Oneida is the story of not only how one game helped revive the Oneida economy but also how one game strengthened the Oneida community.",
  "genres": [
    "Nonfiction",
    "History",
    "Native American"
  ],
  "author": "Mike Hoeft",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/18774395-the-bingo-queens-of-oneida"
}