{
  "title": "Lonely Woman",
  "description": "Replete with madwomen, murderers, musicians, and mystics, \"Lonely Woman\" dramatically interweaves the lives of five women. It remains Takako Takahashi's most sustained and multifaceted fictional realization of her concept of \"loneliness.\" Her fiction typically features a woman for whom dreams and fantasies, crime, madness, sexual deviance, or occult pursuits serve as a temporary release from her society's definitions of female identity. The combination of surrealist, feminist, and religious themes in Takahashi's work makes it unique among that of modern Japanese women writers.The five individually titled short stories that constitute \"Lonely Woman\" are linked by certain characters, themes, and plot elements. In the first story, \"Lonely Woman,\" a series of arson incidents in her neighborhood causes a nihilistic young woman to become fascinated with the psychology of the person who perpetrated the crimes. Her fantasies of the euphoric pleasure of setting a fire heighten her awareness of her own violent tendencies. \"The Oracle\" portrays a young widow who becomes convinced, through several disturbing dreams, that her late husband was unfaithful to her. She devises a cruel, ritualistic act as a strategy for defusing her sense of helpless rage. In \"Foxfire,\" a store clerk has a series of encounters with sly, seductive youngsters and is revitalized by her discovery of the criminal and sexual impulses that lurk beneath their innocent fa?ades. In \"The Suspended Bridge,\" a bored housewife's passion is rekindled when a man with whom she once had a sadomasochistic relationship reenters her life. \"Strange Affinities\" recasts crime, madness, and \"amour fou\" as catalysts of a process of spiritual enlightenment: an old woman searches for an elusive man who seems to embody the bliss of self-renunciation.",
  "genres": [
    "Japan",
    "Short Stories",
    "Fiction",
    "Japanese Literature",
    "Asia",
    "Asian Literature",
    "Womens"
  ],
  "author": "Takako Takahashi",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/1877114.Lonely_Woman"
}