{
  "title": "Sybil Exposed: The Extraordinary Story Behind the Famous Multiple Personality Case",
  "description": "Sybil: a name that conjures up enduring fascination for legions of obsessed fans who followed the nonfiction blockbuster from 1973 and the TV movie based on it—starring Sally Field and Joanne Woodward—about a woman named Sybil with sixteen different personalities. Sybil became both a pop phenomenon and a revolutionary force in the psychotherapy industry. The book rocketed multiple personality disorder (MPD) into public consciousness and played a major role in having the diagnosis added to the psychiatric bible, Diagnostic and Statistical Manual of Mental Disorders. But what do we really know about how Sybil came to be? In her news-breaking book Sybil Exposed, journalist Debbie Nathan gives proof that the allegedly true story was largely fabricated. The actual identity of Sybil (Shirley Mason) has been available for some years, as has the idea that the book might have been exaggerated. But in Sybil Exposed, Nathan reveals what really powered the legend: a trio of women—the willing patient, her ambitious shrink, and the imaginative journalist who spun their story into bestseller gold. From horrendously irresponsible therapeutic practices—Sybil’s psychiatrist often brought an electroshock machine to Sybil’s apartment and climbed into bed with her while administering the treatment— to calculated business decisions (under an entity they named Sybil, Inc., the women signed a contract designating a three-way split of profits from the book and its spin-offs, including board games, tee shirts, and dolls), the story Nathan unfurls is full of over-the-top behavior. Sybil’s psychiatrist, driven by undisciplined idealism and galloping professional ambition, subjected the young woman to years of antipsychotics, psychedelics, uppers, and downers, including an untold number of injections with Pentothal, once known as “truth serum” but now widely recognized to provoke fantasies. It was during these “treatments” that Sybil produced rambling, garbled, and probably “false-memory”–based narratives of the hideous child abuse that her psychiatrist said caused her MPD. Sybil Exposed uses investigative journalism to tell a fascinating tale that reads like fiction but is fact. Nathan has followed an enormous trail of papers, records, photos, and tapes to unearth the lives and passions of these three women. The Sybil archive became available to the public only recently, and Nathan examined all of it and provides proof that the story was an elaborate fraud—albeit one that the perpetrators may have half-believed. Before Sybil was published, there had been fewer than 200 known cases of MPD; within just a few years after, more than 40,000 people would be diagnosed with it. Set across the twentieth century and rooted in a time when few professional roles were available to women, this is a story of corrosive sexism, unchecked ambition, and shaky theories of psychoanalysis exuberantly and drastically practiced. It is the story of how one modest young woman’s life turned psychiatry on its head and radically changed the course of therapy, and our culture, as well.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Biography",
    "Mental Health",
    "History",
    "Science",
    "Mental Illness"
  ],
  "author": "Debbie Nathan",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/11034297-sybil-exposed"
}