{
  "title": "29 Dimes: A Love Story",
  "description": "One summer. Seven hearts. 29 Dimes. It wasn't your typical LA summer. No one could've predicted what happened that day in Silver Lake. It was a summer of passion, confusion, and growth. One hot, crazy summer. Seven hungry hearts. 29 Dimes. Award-winning, prolific writer Randolph Randy Camp creates a moving, tender love story amid a wild, crazy summer as Teki, Ronnie, Pepe, Brittany, Kalib, Tip, and Valerie each will have an experience that will shape and change their young lives forever. Valerie has the kind of natural beauty that belongs on magazine covers. All the guys in Silver Lake dream about her. One guy will get lucky this summer and win her heart. Pepe's mouth has always gotten him into trouble. A talented street poet, will Pepe's provocative, 'in your face' anthem 'Hear My Echo!' get him into trouble at this summer's Silver Lake street festival? Teki will be the first to admit that she's certainly not your typical Chinese girl. A gifted musical prodigy, Teki once got kicked out of a prestigious music academy for rocking a reggae rhythm instead of the required Beethoven tune at her classical piano recital. Now, at seventeen, Teki fronts an all-girl progressive reggae band in Silver Lake. Kalib is a young Armenian computer whiz who is hoping to win Valerie's heart this summer. Carrying the agonizing weight of his family's dark past on his shoulders, Kalib believes that Valerie's love could wash away all of that pain, if only he could somehow convince her to go out with him. A gifted storyteller, Randolph Randy Camp offers the reader a realistic glimpse of contemporary life in the Los Angeles community of Silver Lake. If you still believe that love can happen to the most unlikely people and that love still can be found in the most unusual place then Randolph Randy Camp's '29 Dimes: A Love Story' is for you. One summer. Seven hearts. 29 Dimes.",
  "genres": [],
  "author": "Randolph Randy Camp",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/18773219-29-dimes"
}