{
  "title": "Scratch",
  "description": "An unexpected reminder of his past prompts Jim Cooper, a 33 year-old Glaswegian call centre worker, to make a big decision. He’s going back to adulthood ground-zero - no job, no debt, no, er, home, and starting again. Maybe this time he can do it right and get the girl. The fact that the girl is already married and living in another country and her Bruce Lee obsessed dad apparently wants to turn Jim into his latest pet are only two of the obstacles he faces.Given Jim's forward planning skills don’t extend beyond praying and having panic attacks, it isn’t surprising that he soon finds himself living with his parents and working for minimum wage, in the same pub he worked in when he was 18. What is unexpected is Paula Fraser walking through the pub’s door for the first time in 12 years.What’s even more surprising is that Paula admits she still loves Jim. But yes, she’s married, and no, she won't cheat on her husband. She'll tell him the marriage is over. Soon. When the time is right. As soon as her husband's sick grandfather gets better - or fatally worse.And so, Jim and Paula embark on the tricky business of not having an affair, and not telling anyone they know that they’re not having an affair. As Jim reflects, ‘If not being physically intimate with her in any way and denying to everyone we knew that anything was going on between us was the best way to prove I loved her, then that’s what I would do.’Scratch is an un-sanitised, emotionally honest and hilariously candid story about what it is to grow up as opposed to simply change age, as told by a man who doesn’t know what any of those words mean.Word 98,000By the same You Love Me Tomorrow - some musicians wait a lifetime for a record deal. Bryan Rivers waited three days longer.Will You Love Me Tomorrow is a comedy about death, depression, grief, loss, friendship, family, haircuts and the music business. A Selection of Meats and Cheeses - Twelve short stories from Danny Gillan. Some sad, some funny, some serious some silly, some poignant and some pointless.",
  "genres": [
    "Fiction",
    "Romance",
    "Humor",
    "Contemporary"
  ],
  "author": "Danny Gillan",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/11033984-scratch"
}