{
  "title": "Rise",
  "description": "\"I’d come to a place of realizing that even if only for a time, Attie’s existence was heavily dependent upon my ability to protect her and shine light in her direction. At the same time, I had to give her enough room to live her own life. I also knew the connection was fragile and that as I navigated the space just outside her world, if her life were to start to spin out of control, I wouldn’t be able to come closer and intervene without causing more damage. I understood that I was created to be a part of her life, but only at a safe distance.Our universe, the one that seemed to only include us, was about to be hurled into an entirely new solar system.\"---Attie Reed has finally found some happiness after the accident that took her mother’s and best friend’s lives and nearly destroyed hers. But that doesn’t mean life is going to get easier. She may not have nighttime monsters to fight, but her world is about to spin wildly out of orbit.In the captivating, highly anticipated sequel to Stefne Miller’s Salvaged, Attie is faced with the challenge of fitting in at a new school while figuring out her next steps. Riley continues to fight with her and for her as she encounters difficult battles. He has been her protection, but he can’t protect her forever.When Attie’s father finally comes back into her life, she is faced with her most difficult decision yet: to stay in Oklahoma and keep the life she has made or return to New York to repair her relationship with her father and allow herself to heal. What happens will define who she is and who she will become. Can she fight this battle alone and Rise? Or will she continue to fall out of orbit and be lost forever?---Copies available now via author website. Available nationally (via Amazon and book stores) June 21, 2011",
  "genres": [
    "Romance",
    "Christian Fiction",
    "Chick Lit",
    "Young Adult"
  ],
  "author": "Stefne Miller",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/11034895-rise"
}