{
  "title": "Michael Jackson, Inc.: The Rise, Fall, and Rebirth of a Billion-Dollar Empire",
  "description": "The surprising rags-to-riches-to-rags-to-riches story of how Michael Jackson grew a billion-dollar business.Michael Jackson is known by many as the greatest entertainer of all time, but he was also a revolutionary when it came to business. In addition to famously buying the Beatles' publishing catalogue, Jackson was one of the first pop stars to launch his own clothing line, record label, sneakers, and video games—creating a fundamental shift in the monetization of fame and paving the way for entertainer-entrepreneurs like Jay Z and Diddy. All told, Jackson earned more than $1.1 billion in his solo career, and the assets he built in life have earned more than $700 million in the five years since his death—more than any other solo music act over that time.Michael Jackson, Inc. reveals the incredible rise, fall, and rise again of Michael Jackson's fortune—driven by the unmatched perfectionism of the King of Pop. Forbes senior editor Zack O'Malley Greenburg uncovers never-before-told stories from interviews with more than 100 people, including music industry veterans Berry Gordy, John Branca, and Walter Yetnikoff; artists 50 Cent, Sheryl Crow, and Jon Bon Jovi; and members of the Jackson family. Other insights come from court documents and Jackson's private notes, some of them previously unpublished. Through Greenburg's novelistic telling, a clear picture emerges of Jackson's early years, his rise to international superstardom, his decline—fueled by demons internal and external, as well as the dissolution of the team that helped him execute his best business moves—and, finally, his financial life after death.Underlying Jackson's unique history is the complex but universal tale of the effects of wealth and fame on the human psyche. A valuable case study for generations of entertainers to come and for anyone interested in show business, Michael Jackson, Inc. tells the story of a man whose financial feats, once obscured by his late-life travails, have become an enduring legacy.",
  "genres": [
    "Biography",
    "Music",
    "Nonfiction",
    "Business",
    "History",
    "Audiobook"
  ],
  "author": "Zack O'Malley Greenburg",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/18774970-michael-jackson-inc"
}