{
  "title": "The Awakening of Miss Prim",
  "description": "In this #1 international bestseller, a young woman leaves everything behind to work as a librarian in a remote French village, where she finds her outlook on life and love challenged in every way.When Miss Prim, an independent, accomplished young woman, reads an ad in the newspaper seeking a feminine spirit to work as a librarian in the lush countryside of France, she finds herself compelled to apply. Little does she know what kind of world she is about to step into.Miss Prim dutifully accepts the job and begins organizing her employer's vast library. A knowledgeable, mysterious gentleman with very specific opinions about life, he challenges Miss Prim's seemingly unshakeable disposition. And as she becomes familiar with the other townspeople, she begins to realize that the surprising lifestyle of the town awakens amazement, perplexity, and even disdain in her. For in this tiny corner of the world, a flourishing colony of exiles have settled into a simple, rural existence, living around great literature, intellectual discussions, family, and sweet indulgences. Their peculiar and unconventional ways slowly test Miss Prim's most intimate ideas and fears as well as her most profound convictions. She quickly comes to realize that her advanced degrees did little to prepare her for the lessons she's being taught the least of which is a lesson in love.Set against a backdrop of steaming cups of tea, freshly baked cakes, warm fires, and lovely company, The Awakening of Miss Prim is a delightful, thought-provoking, and sensitive novel that gives rise to theories about love and companionship, education, and the beauty of every passing moment.",
  "genres": [
    "Fiction",
    "Romance",
    "Book Club",
    "Contemporary",
    "Books About Books",
    "Novels",
    "Adult Fiction"
  ],
  "author": "Natalia Sanmartín Fenollera",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/18774984-the-awakening-of-miss-prim"
}