{
  "title": "Conform: Exposing the Truth About Schools",
  "description": "PUBLIC EDUCATION IS NEVER MENTIONED IN THE CONSTITUTION. WHY? BECAUSE OUR FOUNDERS KNEW THAT IT WAS AN ISSUE FOR STATE AND LOCAL GOVERNMENTS--NOT THE FEDERAL ONE.It's not a coincidence that the more the federal government has inserted itself into public education over the years, the worse our kids have fared. Washington dangles millions of dollars in front of states and then tells them what they have to do to get it. It's backdoor nationalization of education--and it's leading us to ruin.In Conform , Glenn Beck presents a well-reasoned, fact-based analysis that proves it's not more money our schools need--it's a complete refocusing of their priorities and a total restructuring of their relationship with the federal government. In the process, he dismantles many of the common myths and talking points that are often heard by those who want to protect the status quo.Critics of the current system are just \"TEACHER BASHERS\" ...Teachers' unions put KIDS FIRST ...Homeschooled kids SUFFER  both ACADEMICALLY  and SOCIALLY ... \"LOCAL CONTROL\" is an excuse to protect MEDIOCRITY ... COMMON CORE  is \"RIGOROUS\" and \"STATE LED\" ...Critics of Common Core are just CONSPIRACY THEORISTS ...Elementary school teachers need TENURE ...We CAN'T REFORM schools until we ERADICATE POVERTY ... SCHOOL CHOICE takes money away from PUBLIC SCHOOLS ... CHARTER SCHOOLS  perform poorly relative to public schools.There is no issue more important to America's future than education. The fact that we've yielded control over it to powerful unions and ideologically driven elitists is inexcusable. We are failing ourselves, our children, and our country. Conform gives parents the facts they need to take back the debate and help usher in a new era of education built around the commonsense principles of choice, freedom, and accountability.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Education",
    "History",
    "Government",
    "Audiobook",
    "Political Science"
  ],
  "author": "Glenn Beck",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/18775111-conform"
}