{
  "title": "Hothouse: The Art of Survival and the Survival of Art at America's Most Celebrated Publishing House, Farrar, Straus, and Giroux",
  "description": "A national bestseller, Hothouse is a “wonderful” ( New York Review of Books ), “valuable” ( The New Yorker ), cultural history, “a ripping read about the eminent publishing house Farrar, Straus & Giroux” ( The Boston Globe ).Farrar, Straus & Giroux is arguably the most influential publishing house of the modern era. Home to an unrivaled twenty-five Nobel Prize winners and generation-defining authors like Tom Wolfe, Joan Didion, Philip Roth, and Jonathan Franzen, it’s a cultural institution whose importance approaches that of The New York Times . But FSG is no ivory tower—and its untold story is as engrossing as many of the great novels it has published.Boris Kachka reveals the era and the city that built FSG through the stories of two founder-owner Roger Straus, the black sheep of his German-Jewish family, and the reticent, closeted editor Robert Giroux, who rose from working-class New Jersey to discover the novelists and poets who helped define American culture. Giroux became one of T.S. Eliot’s best friends and played caretaker to manic-depressive geniuses like Robert Lowell, John Berryman, and Jack Kerouac. Straus, the showman, made Susan Sontag a star, kept Edmund Wilson out of prison, and turned Isaac Bashevis Singer into a Nobelist.After giving us a fresh perspective on the postwar authors we thought we knew, Kachka exposes how elite publishing works today. He gets inside the editorial meetings where writers’ fates are decided; he captures the adrenaline rush of bidding wars for top talent; and he lifts the lid on the high-stakes pursuit of that rarest commodity, public attention—including a fly-on-the-wall account of the confrontation between Oprah Winfrey and Jonathan Franzen.Hothouse is the product of five years of research and nearly 200 interviews by a veteran New York magazine writer. It shares “a thrilling look at the heyday of the publishing industry” ( Entertainment Weekly ) and illuminates the vital intellectual center of the American Century.",
  "genres": [
    "Nonfiction",
    "Books About Books",
    "History",
    "Biography",
    "Writing",
    "Memoir",
    "New York"
  ],
  "author": "Boris Kachka",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/18775379-hothouse"
}