{
  "title": "Vertigo 42",
  "description": "In her latest Richard Jury mystery, Martha Grimes delivers the newest addition to the bestselling series The Washington Post calls “literate, lyrical, funny, funky, discursive, bizarre.” The inimitable Scotland Yard Superintendent returns, now with a tip of the derby to Alfred Hitchcock’s Vertigo.Richard Jury is meeting Tom Williamson at Vertigo 42, a bar on the forty-second floor of an office building in London’s financial district. Despite inconclusive evidence, Tom is convinced his wife, Tess, was murdered seventeen years ago. The inspector in charge of the case was sure Tess’s death was accidental—a direct result of vertigo—but the official police inquiry is still an open verdict and Jury agrees to re-examine the case.Jury learns that a nine-year-old girl fell to her death five years before Tess at the same country house in Devon where Tess died. The girl had been a guest at a party Tess was giving for six children. Jury seeks out the five surviving party guests, who are now adults, hoping they can shed light on this bizarre coincidence.Meanwhile, an elegantly dressed woman falls to her death from the tower of a cottage near the pub where Jury and his cronies are dining one night. Then the dead woman’s estranged husband is killed as well. Four deaths—two in the past, two that occur on the pages of this intricate, compelling novel—keep Richard Jury and his sidekick Sergeant Wiggins running from their homes in Islington to the countryside in Devon and to London as they try to figure out if the deaths were accidental or not. And, if they are connected.Witty, well-written, with literary references from Thomas Hardy to Yeats, Vertigo 42 is a pitch perfect, page-turning novel from a mystery writer at the top of her game.",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Mystery Thriller",
    "British Literature",
    "Audiobook",
    "Adult"
  ],
  "author": "Martha Grimes",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/18775347-vertigo-42"
}