{
  "title": "Soldier Girls: The Battles of Three Women at Home and at War",
  "description": "From an award-winning, \"meticulously observant\" (The New Yorker), and \"masterful\" (Booklist) writer comes a groundbreaking account of three women deployed to Afghanistan and Iraq, and how their military service affected their friendship, their personal lives, and their families.America has been continuously at war since the fall of 2001. This has been a matter of bitter political debate, of course, but what is incontestable is that a sizable percentage of American soldiers sent overseas in this era have been women. The experience in the American military is, it's safe to say, quite different from that of men. Surrounded and far outnumbered by men, embedded in a male culture, looked upon as both alien and desirable, women have experiences of special interest.In Soldier Girls, Helen Thorpe follows the lives of three women over twelve years on their paths to the military, overseas to combat, and back home, and then overseas again for two of them. These women, who are quite different in every way, become friends, and we watch their interaction and also what happens when they are separated. We see their families, their lovers, their spouses, their children. We see them work extremely hard, deal with the attentions of men on base and in war zones, and struggle to stay connected to their families back home. We see some of them drink too much, have illicit affairs, and react to the deaths of fellow soldiers. And we see what happens to one of them when the truck she is driving hits an explosive in the road, blowing it up. She survives, but her life may never be the same again.Deeply reported, beautifully written, and powerfully moving, Soldier Girls is truly groundbreaking.",
  "genres": [
    "Nonfiction",
    "Military Fiction",
    "History",
    "Biography",
    "War",
    "Book Club",
    "Audiobook"
  ],
  "author": "Helen Thorpe",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/18775423-soldier-girls"
}