{
  "title": "The Forks Over Knives Plan: How to Transition to the Life-Saving, Whole-Food, Plant-Based Diet",
  "description": "From the creators of the groundbreaking documentary (and bestselling book) Forks Over Knives comes a four-week plan, showing anyone how to transition to a delicious whole-food, plant-based diet.The trailblazing film Forks Over Knives exposed an entirely new generation to the whole-food, plant-based nutrition revolution and inspired thousands to want to transform their diets, and their lives. With so many people looking for change, the outstanding question became, &#8220;How can we put these dietary ideas into practice?&#8221; That&#8217;s what authors Alona Pulde and Matthew Lederman reveal in The Forks Over Knives Plan: The 4-Week Guide to Whole-Food, Plant-Based Health&#8212;a clear, easy-to-follow plan that outlines the steps to take each week to transform your diet by cutting out animal-based and processed foods.Forks Over Knives is a leading authority in the &#8220;food as medicine&#8221; movement, showing how simple dietary changes are proven to prevent, and even reverse, chronic disease such as type-2 diabetes and heart disease and improve your overall health. This is no fad diet; the Forks Over Knives program is backed by original research and has received rave reviews from physicians like Dr. Sanjay Gupta and Dr. Mehmet Oz, to athletes like pro football star Arian Foster and pro basketball player Steve Nash, to healthy lifestyle pioneers like Alicia Silverstone, to name a few. Whether you&#8217;re already a convert and just want a dietary reboot, or you are trying a plant-based diet for the first time, The Forks Over Knives Plan makes it easier than ever to transition into this new way of eating.",
  "genres": [
    "Nonfiction",
    "Cookbooks",
    "Health",
    "Cooking",
    "Food",
    "Nutrition",
    "Vegan"
  ],
  "author": "Alona Pulde",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/18775239-the-forks-over-knives-plan"
}