{
  "title": "American Unexceptionalism: The Everyman and the Suburban Novel after 9/11",
  "description": "American Unexceptionalism examines a constellation of post-9/11 novels that revolve around white middle-class male suburbanites, thus following a tradition established by writers such as John Updike and John Cheever. Focusing closely on recent works by Richard Ford, Chang-Rae Lee, Jonathan Franzen, Philip Roth, Anne Tyler, Gish Jen, A. M. Homes, and others, Kathy Knapp demonstrates that these authors revisit this well-trod turf and revive the familiar everyman character in order to reconsider and reshape American middle-class experience in the wake of the 9/11 attacks and their ongoing aftermath.The novels in question all take place in the sprawling terrain that stretches out beyond the Twin Towers―the postwar suburbs that since the end of World War II have served, like the Twin Towers themselves, as a powerful advertisement of dominance to people around the globe, by projecting an image of prosperity and family values. These suburban tales and their everyman protagonists grapple, however indirectly, with the implications of the apparent decline of the economic, geopolitical, and moral authority of the United States. In the context of perceived decay and diminishing influence, these novels actively counteract the narrative of American exceptionalism frequently peddled in the wake of 9/11.If suburban fiction has historically been faulted for its limited vision, this newest iteration has developed a depth of field that self-consciously folds the personal into the political, encompasses the have-nots along with the haves, and takes in the past when it imagines the future, all in order to forge a community of readers who are now accountable to the larger world. American Unexceptionalism traces the trajectory by which recent suburban fiction overturns the values of individualism, private property ownership, and competition that originally provided its foundation. In doing so, the novels examined here offer readers new and flexible ways to imagine being and belonging in a setting no longer characterized by stasis, but by flux.",
  "genres": [],
  "author": "Kathy Knapp",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/18777932-american-unexceptionalism"
}