{
  "title": "Confessions of a Fat Marathoner",
  "description": "Running sucks. Take it from me.Thin people think it sucks too but they don’t have an ass like mine or twin double-D’s to control.My name is Kristina Burkey and this is my book. It started as my blog when I was training for the Boston Marathon in 2011. It became a grown-up book after I had crossed that most prestigious of finish lines and wondered to myself, “Well, NOW what?”You see, most people take a few years to build up to a marathon. Boston was my fourth race EVER inside of 2 years. I guess I jumped ahead. So I went back. And I did my first 5k a year later. Then a 10k. Then I tried to get faster so I wasn’t always looking at everyone’s back or being followed by a giant bus ordered to pick up the people who can’t finish.Confessions of a Fat Marathoner is my journey through a lifetime of being overweight and my decision to change my fate. In these pages I run, I eat, I complain. I learn about running, I push my fat body past its comfort zone (WAY past). I remove the limitations I was only putting on myself, and I dig around to try and find the reason why I was hanging onto the weight. Now don’t get all excited. This isn’t one of those books. I’m still fat. Sometimes there’s more to a journey like mine than just getting “fat to fit.”Also, if you think this is another piece of inspirational fluff, think again. Along with all my stories about the weird crap (and occasional wild animal) I see while I’m on training runs and the odd people I meet, I will randomly go off on subjects like, “Why don’t they make exercise clothes for fat people? Don’t we need them the most?” and “Why are you snooty salesgirls so rude to me? So what if you think I can’t fit in your clothes? Are you or are you not still getting your paycheck?” and the unfortunate practice of prejudice.Plus, there is the deliciously cringe-worthy subject of the truth about running. Every smelly, sweaty, steaming, gory, squishy, burning detail. It’s all here. You’re welcome. So grab your favorite snack, find a fresh, un-used Port-o-Potty, strap in and read my adventures. They say a journey of 1,000 miles (or 26.2) starts with a single step.Here’s mine.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography Memoir",
    "Health"
  ],
  "author": "Kristina Burkey",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/18777424-confessions-of-a-fat-marathoner"
}