{
  "title": "Flowers of the Sea",
  "description": "Flowers of the SeaThirteen Stories and Two NovellasbyReggie OliverThis sixth collection of ‘strange stories’ by Reggie Oliver follows the award winning Mrs Midnight (2011). Oliver’s variety of subject matter, wit, characterisation and stylistic elegance are on display, as is his gift for telling a good story. The rivalry between two former MI5 members in a seaside town escalates into something deeply sinister and mysterious. . . . The one-time assistant to a musical genius is dying in early nineteenth-century Vienna and cannot escape his obsession with their last collaboration. . . . In Weimar Germany a mass murderer is awaiting his execution with perplexing eagerness. . . . There are two novellas in this collec-tion. ‘Lord of the Fleas’ is a study of a sinister eighteenth-century architect, told through various documents, including an unpublished fragment of Boswell’s Life of Dr Johnson, and a series of increasingly desperate letters from a young woman to her cousin in the style of the epistolary novels of Fanny Burney. The other novella, ‘A Child’s Problem’, inspired by a painting in the Tate Gallery by Richard Dadd, was nominated for ‘best novella’ in the Shirley Jackson Awards of 2012.Reggie Oliver is an English playwright, biographer and writer of ghost stories. His work has appeared in a number of anthologies, including the Year’s Best Fantasy and Horror and The Mammoth Book of Best New Horror.Flowers of the Sea contains: ‘Introduction’ by Michael Dirda, ‘A Child’s Problem’, ‘Striding Edge’, ‘Hand to Mouth’, ‘Singing Blood’, ‘Flowers of the Sea’, ‘Lord of the Fleas’, ‘Didman’s Corner’, ‘The Posthumous Messiah’, ‘Charm’, ‘Between Four Yews’, ‘The Spooks of Shellborough’, ‘Süssmayr’s Requiem’, ‘Come Into My Parlour’, ‘Lightning’, ‘Waving to the Boats’, ‘Author’s Note’.Flowers of the Sea is a sewn hardback book of 388 + x pages with decorated boards, silk ribbon marker, head and tailbands, and d/w. Also available as an ebook.",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Weird Fiction",
    "Fantasy"
  ],
  "author": "Reggie Oliver",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/18776865-flowers-of-the-sea"
}