{
  "title": "The Lost Book of Alexander the Great",
  "description": "A Reconstruction of Ptolemy I’s History of Alexander’s Conquests , a Primary Source Cited in Later Books That Disappeared More Than One Thousand Years AgoAlexander the Great is well known as one of the first great empire builders of the ancient world. Among those fellow Macedonian officers who accompanied Alexander in his epic conquests from Greece to India was Ptolemy Lagides. Ptolemy served alongside Alexander from the Persian defeat at the Battle of Issus in modern-day Turkey and the journey to find the oracle that proclaimed Alexander to be Zeus incarnate, to the Battle of the Hydaspes River in 326 BC that opened India to the West. Following Alexander’s death, Ptolemy gained control of Egypt where he founded the dynasty in his name, created the great library of Alexandria, and was patron of the mathematician Euclid. Sometime during his rule in Egypt, Ptolemy wrote a history of Alexander’s conquests. Although it is probable that Ptolemy enhanced his own importance, sources indicate that it was regarded as an accurate and even-handed account of the campaigns of Alexander. However, Ptolemy’s book was lost—perhaps with the destruction of the library he founded—and not even an original fragment has survived. His book, however, was acknowledged as a primary source of information for later Roman historians.In The Lost Book of Alexander the Great , Andrew Young explores the world of ancient writings about the Macedonian leader in order to determine whether any of Ptolemy’s writings can be recovered. Inspired by Stephen Greenblatt’s distinguished biography of Shakespeare, Will in the World , and written for the general reader, the author uses literary forensics to suggest which parts of later books about Alexander the Great, most notably the account by Arrian of Nicomedia, might be the words of Ptolemy. In addition to separating later Roman sensibilities from the original Greek of Ptolemy, the author re-creates the famous library of Alexandria, and takes the reader along on Alexander’s conquests as closely as we can to how Ptolemy may have recounted them.",
  "genres": [],
  "author": "Andrew      Young",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/18778048-the-lost-book-of-alexander-the-great"
}