{
  "title": "The Second Amendment",
  "description": "By the president of the prestigious Brennan Center for Justice at New York University School of Law, the life story of the most controversial, volatile, misunderstood provision of the Bill of RightsAt a time of renewed debate over guns in America, what does the Second Amendment mean? This book looks at history to provide some surprising, illuminating answers.The Amendment was written to calm public fear that the new national government would crush the state militias made up of all (white) adult men—who were required to own a gun to serve. Waldman recounts the raucous public debate that has surrounded the amendment from its inception to the present. As the country spread to the Western frontier, violence spread too. But through it all, gun control was abundant. In the 20th century, with Prohibition and gangsterism, the first federal control laws were passed. In all four separate times the Supreme Court ruled against a constitutional right to own a gun.The present debate picked up in the 1970s—part of a backlash to the liberal 1960s and a resurgence of libertarianism. A newly radicalized NRA entered the campaign to oppose gun control and elevate the status of an obscure constitutional provision. In 2008, in a case that reached the Court after a focused drive by conservative lawyers, the U.S. Supreme Court ruled for the first time that the Constitution protects an individual right to gun ownership. Famous for his theory of “originalism,” Justice Antonin Scalia twisted it in this instance to base his argument on contemporary conditions.In The Second Amendment: A Biography, Michael Waldman shows that our view of the amendment is set, at each stage, not by a pristine constitutional text, but by the push and pull, the rough and tumble of political advocacy and public agitation.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Law",
    "American History",
    "Philosophy",
    "Political Science"
  ],
  "author": "Michael Waldman",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/18778874-the-second-amendment"
}