{
  "title": "Settler Common Sense: Queerness and Everyday Colonialism in the American Renaissance",
  "description": "In Settler Common Sense , Mark Rifkin explores how canonical American writers take part in the legacy of displacing Native Americans. Although the books he focuses on are not about Indians, they serve as examples of what Rifkin calls “settler common sense,” taking for granted the legal and political structure through which Native peoples continue to be dispossessed. In analyzing Nathaniel Hawthorne’s House of the Seven Gables , Rifkin shows how the novel draws on Lockean theory in support of small-scale landholding and alternative practices of homemaking. The book invokes white settlers in southern Maine as the basis for its ethics of improvement, eliding the persistent presence of Wabanaki peoples in their homeland. Rifkin suggests that Henry David Thoreau’s Walden critiques property ownership as a form of perpetual debt. Thoreau’s vision of autoerotic withdrawal into the wilderness, though, depends on recasting spaces from which Native peoples have been dispossessed as places of non-Native regeneration. As against the turn to “nature,” Herman Melville’s Pierre presents the city as a perversely pleasurable place to escape from inequities of land ownership in the country. Rifkin demonstrates how this account of urban possibility overlooks the fact that the explosive growth of Manhattan in the nineteenth century was possible only because of the extensive and progressive displacement of Iroquois peoples upstate. Rifkin reveals how these texts’ queer imaginings rely on treating settler notions of place and personhood as self-evident, erasing the advancing expropriation and occupation of Native lands. Further, he investigates the ways that contemporary queer ethics and politics take such ongoing colonial dynamics as an unexamined framework in developing ideas of freedom and justice.",
  "genres": [
    "Nonfiction",
    "Academic",
    "LGBT"
  ],
  "author": "Mark Rifkin",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/18778025-settler-common-sense"
}