{
  "title": "Evil of Love",
  "description": "“I can’t take it! I’ve been craving you ever since I saw you the other day. I haven’t stopped thinking about you since you disappeared ten years ago! I need you Steph. I’m sorry…” ~ Eric SutherlandStephanie Wilcox never saw it coming after giving up that life ten years ago of constantly being verbally and emotionally abused by her drunken father. She didn’t run, but when she left, she never looked back. Forced by her abusive father to live with her Aunt Elizabeth, she had to leave behind the one person that had shown her true love. In her mind, Eric Sutherland, deserved so much more and being with her would only bring him down. She never stopped loving the sun-kissed boy who held her hand and touched her kindly.It was years later when Stephanie met Travis Barnes, a young self-made billionaire who swooped in and helped mend some of her loneliness. However, after marrying Travis, he began to show who he really was and he was the type of man she was accustomed to, after growing up with an abusive father, and regardless of his flaws she still loves him. After all, why would she deserve any better?Eric broke, his kindness, his pure heart, it all fell apart that day Stephanie left. He did all he could to reach her, but it was hopeless. All the sadness, anger, and sorrow built up inside him over time and no one could replace the love he had for Stephanie. Fighting has been his outlet and now as a well-known UFC undefeated fighter, his career is all he has, but no matter how hard he tries to forget her, he can’t. Ten years later he comes face to face with those large brown eyes that belong to the one girl he’s always loved and everything changes. This time he won’t let her get away.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "Abuse",
    "Fighters"
  ],
  "author": "N.L. Echeverria",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/18781527-evil-of-love"
}