{
  "title": "Limoncello Yellow",
  "description": "From USA TODAY Bestselling Author Traci Andrighetti...Francesca \"Franki\" Amato is a tough-talking rookie cop in Austin, Texas—until an unfortunate 911 call involving her boyfriend, Vince, and a German female wrestler convinces her once and for all that she just isn't cut out for a life on the police force. So Franki makes the snap decision to move to New Orleans to work at her friend Veronica's detective agency, Private Chicks, Inc. But Franki's hopes for a more stable life are soon dashed when Private Chicks is hired by the prime suspect in a murder case to find out what really happened to a beautiful young boutique manager who was found strangled to death with a cheap yellow scarf. When she's not investigating, Franki is hoping to seduce handsome bank executive Bradley Hartmann, but most of her time is spent dodging date offers from a string of \"good Italian boys\"—make that not-so-good aging Italian men—that her meddlesome Sicilian grandma has recruited as marriage candidates. As Mardi Gras approaches and the mystery of the murdered shop girl gets more complicated, Franki must decipher the odd ramblings of a Voodoo priestess to solve both the murder and the mystery of her own love life.FRANKI AMATO MYSTERIES:Limoncello Yellow (book 1)Prugnolino Purple (spring short story 1.5)Prosecco Pink (book 2)Rosolio Red (holiday short story 2.5)Amaretto Amber (book 3)Fragolino Fuchsia (Rome short story 3.5)Campari Crimson (book 4)Cannellino Caramel (holiday short story 4.5)Galliano Gold (book 5)Cremoncello Cream (Sicily short story 5.5)\"Andrighetti’s dialogue is genuine yet uproarious, and her glowing characters animatedly leap off the page. Her sparkling wit keeps the hijinks brimming with merriment.\" —Long Island Book Reviews\"Traci Andrighetti's Franki Amato Mysteries have me tickled pink! Her smart, sassy heroine, wacky cast of characters, and vividly original settings had me glued to the page. I can’t wait to read more from this author!\" —Gemma Halliday, New York Times bestselling author\"Traci's writing is sharp and funny; the world she paints leaps off the page and makes the reader laugh out loud…. A thoroughly enjoyable voice in fiction!\" —Kristin Harmel, Internationally bestselling novelist (The Sweetness of Forgetting)",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Cozy",
    "Contemporary",
    "Humor",
    "Chick Lit"
  ],
  "author": "Traci Andrighetti",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/18780294-limoncello-yellow"
}