{
  "title": "Boot Camp Bride",
  "description": "Take an up-for-anything rookie reporter. Add a world-weary photojournalist. Put them together . . . light the blue touch paper and stand well back! Posing as a bride-to-be, Charlee Montague goes undercover at a boot camp for brides on the Norfolk coast to photograph supermodel Anastasia Markova. At Charlee’s side and posing as her fiancé, is Rafael Ffinch award winning photographer and survivor of a kidnap attempt in Columbia. He’s in no mood to cut inexperienced Charlee any slack and has made it plain that once the investigation is over, their partnership - and fake engagement - will be terminated, too. Soon Charlee has more questions than answers. What's the real reason behind Ffinch's interest in the boot camp? How is it connected to his kidnap in Columbia? In setting out to uncover the truth, Charlee puts herself in danger ...And, as the investigation draws to a close, she wonders if she’ll be able to hand back the family engagement ring and walk away from Rafa Ffinch without a backward glance.Reviews for Boot Camp BrideA touch of Sophie Kinsella, a smidgen of Jilly Cooper, yet totally Lizzie Lamb! Adrienne VaughanThis book is above the average contemporary romance for me - the reason why? It's intelligent as well as wildly romantic. IndiaEntertaining with comedic elements throughout, the pace of this well written tale rattles along at a good rate with sexual tension building from the start. Georgia Rose (Vine Voice)Boot Camp Bride, however, is no straightforward Rom-Com. Ffinch has a sinister past, and hidden agenda. In cold and dark mid-winter, he drives them in his VW Camper Van into danger and menace at the isolated Boot Camp on the edge of the Norfolk marshes. Mags CullingfordUndeterred by the alpha male, she managed to fight him with wit and stubbornness. Lizzie Lamb’s characters and style of writing sparkle in Boot Camp Bride. This romantic comedy is classic it is the equivalent of comfort food and a good night out with friends. Lady Bracknell Boot Camp Bride is a well written and very amusing romance novel which would be ideal for a holiday read or a long winter night in front of the fire. Catherine",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary",
    "Mystery",
    "Romantic Comedy",
    "Contemporary Romance"
  ],
  "author": "Lizzie Lamb",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/18779783-boot-camp-bride"
}