{
  "title": "The Karolina Diaries -Book 1 - The $100,000 call girl",
  "description": "A short story about Karolina was included in some of my compilations. Now Karolina tells her whole story in these diaries!! This is book 1 What do get for $100,000? What do I give for $100,000? Well that’s a story. The answer is...I mean. You want details? Later. You wonder what I can possibly do to you, to anyone, that could be so...valuable? Am I special? Yes, I am, and I have had no complaints: not from men, or women. Well, not recently anyway. When I was starting out? Well, that was a different time. My name is - well, never mind, at this point - let me tell you the story - you decide. My name and my value. After all, you are the customer: you get to decide. I am still at that convenient age, if you want me to be 14, I can do that; or the proverbial co-ed; or the new, young business woman looking for a powerful partner; or the powerful young business woman, willing to dominate. I can offer it all. It’s a good age. Lucrative. I go out, meet a man or a woman, never a group. We talk, and I explain my situation, offer possibilities, and we go back to his or her place or a reputable hotel. If there is trouble, Rose has people who take care of it. If there is not a problem (which is usually more the case), I take my money or whatever has been offered in exchange and go on my way. Through Rose, I met my friend, and then when he left, I met the man who stayed at the Cap Estel. As I said I am at a good age: I told you didn’t I? Young. I have the right figure: curvy if you like, tight if you like, innocent if you like. Strong if need be. As you'll see. I have learned to read people well. But it’s no guarantee. The ones with deep, hidden needs who are aware of their own desires, have practiced hiding and controlling the outward signs: they are difficult, and dangerous. The inexperienced, although they try to show nothing on the outside? Well, you can feel their desires all the way across a room. The others? The desperate, the lonely, the dominators, the masochists? They are easier, obvious, if you know the signs. I know the signs. Today then, we are in the business district. Banks, mortgage lenders, insurance companies, corporate head offices: towers and towers of them. I linger in the lobby that serves three towers. I study notices and directories. I have on a business suit with a skirt, just a little shorter than need be, heels a little higher than need be, and a leather case. I look vulnerable, new, and lost. It’s an act. It’s an art. I see two men make an approach, but stop when an older man passes in front of them and orders them to follow. A boss. The men glance at me as they hurry away. Another man tries an approach, but loses his nerve and walks by. Finally it’s a woman: an older, serious, well put-together woman who approaches: 'Are you lost? Can I help you?' 'I don’t think I am lost. I am looking for Dunbridge and Dunbridge.' 'Yes. They are on the 15th floor of tower B. The elevator is over there.' 'Thank you.' I move to walk away, with signals trailing. 'So you’re a lawyer?' And right there, we are an item. On amazon at http://www.amazon.com/dp/B00GM4WPX8",
  "genres": [],
  "author": "Germaine Gibson",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/18799352-the-karolina-diaries--book-1---the-100-000-call-girl"
}