{
  "title": "Novels 1930-1935: As I Lay Dying / Sanctuary / Light in August / Pylon",
  "description": "Between 1930 and 1935, William Faulkner came into full possession of the genius and creativity that made him one of America’s finest writers of the twentieth century. The four novels in this Library of America collection display an astonishing range of characters and treatments in his Depression-era fiction.As I Lay Dying (1930) is a combination of comedy, horror, and compassion, a narrative woven from the inarticulate desires of a peasant family in conflict. It presents the conscious, unconscious, and sometimes hallucinatory impressions of the husband, daughter, and four sons of Addie Bundren, the long-suffering matriarch of her rural Mississippi clan, as the family marches her body through fire and flood to its grave in town.Sanctuary (1931) is a novel of sex and social class, of collapsed gentility and amoral justice, that moves from the back roads of Mississippi and the fleshpots of Memphis to the courthouse of Jefferson and the appalling spectacle of popular vengeance. With its fascinating portraits of Popeye, a sadistic gangster and rapist, and Temple Drake, a debutante with an affinity for evil, it offers a horrific and sometimes comically macabre vision of modern life.Light in August (1932) incorporates Faulkner’s religious vision of the hopeful stubbornness of ordinary life. The guileless Lena Grove, in search of the father of her unborn child; the disgraced minister Gail Hightower, who dreams of Confederate cavalry charges; Byron Bunch, who thought working Saturdays would keep a man out of trouble, and the desperate, enigmatic Joe Christmas, consumed by his mixed ancestry—all find their lives entangled in the inexorable succession of love, birth, and death.Pylon (1935), a tale of barnstorming aviators in the carnival atmosphere of an air show in a southern city, examines the bonds of desire and loyalty among three men and a woman, all characters without a past. Dramatizing what, in accepting his Nobel Prize, Faulkner called “the human heart in conflict with itself,” it illustrates how he became one of the great humanists of twentieth-century literature.The Library of America edition of Faulkner’s work publishes, for the first time, new, corrected texts of these four works. Manuscripts, typescripts, galleys, and published editions have been collated to produce versions that are free of the changes introduced by the original editors and that are faithful to Faulkner’s intentions.",
  "genres": [
    "Fiction",
    "Classics",
    "Literature",
    "American",
    "Novels",
    "20th Century",
    "Southern Gothic"
  ],
  "author": "William Faulkner",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/18788.Novels_1930_1935"
}