{
  "title": "Inflight Science: A Guide to the World from Your Airplane Window",
  "description": "“With this book in hand, we have all we need to set off on our next flight with our eyes open to the sheer wonder of what is involved.” —Alain de Botton, author of A Week at the Airport, in the Mail on Sunday “Imagine Leonardo da Vinci seated next to you on an airplane. . . . Brian Clegg attempts to restore something of the lost wonder of air travel . . . even as Leonardo, so fascinated by science, might have done . . . leav[ing] his readers improved for the journey and filled with a renewed sense of curiosity toward the wonders out their window.”—Wall Street Journal“An eye-spy book for adults . . . fitting into that publishing niche somewhere between hard science and Schott’s Miscellany that was so successfully exploited by books such as The Cloudspotter’s Guide.” —London Times Book of the WeekEvery moment of your airplane journey is an opportunity to experience science in action—Inflight Science will be your guide. Brian Clegg explains the ever-changing view from your window seat and suggests entertaining experiments to calculate how far away you are from distant objects and the population of the towns you fly over. You'll learn why the coastline is infinite in length, the cause of thunderstorms, and why there's absolutely no chance of getting stuck on an airline vacuum toilet!Packed full of amazing insights from physics, chemistry, engineering, geography, and more, Inflight Science is a voyage of scientific discovery perfect for any journey.Brian Clegg is the author of several popular science titles, including Before the Big Bang and the forthcoming How to Build a Time Machine (2011), both from St. Martin's Press.",
  "genres": [
    "Science",
    "Nonfiction",
    "Popular Science",
    "Aviation",
    "Travel",
    "Technology",
    "Physics"
  ],
  "author": "Brian Clegg",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/11037656-inflight-science"
}