{
  "title": "The Geography of Love",
  "description": "“If I had given it much thought, I might have hesitated to marry a man for whom at the age of 45 much of the past was too painful to consider--for either of us. Truthfully, thought had little to do with it.  Instinct did--the instinct to seize a sure and ebullient happiness or go down trying.”\nFalling in love is arguably the greatest risk and leap of faith any of us take.  There’s no guarantee for future happiness, no protection from the ugly scars of the past, no shield from tragedy--this powerful memoir reminds us why we bother.At a lakeside café in the summer of 1988, 31-year-old Glenda Burgess is sitting across from 44-year-old Kenneth Grunzweig and falling in love. Then Ken confesses that he has already been widowed twice, under harrowing circumstances. This tragic past, the age difference, Ken’s emotionally scarred teenage daughter--all might be enough to send anyone running, but Glenda believed in her instincts, believed more than anything that this lovely, generous man would shape her life. And Ken, who with his heartbreaking losses had long said that he’d given up on love, came to share a sense of their romantic destiny. The two embark on the sort of love affair that many of us don’t believe exist anymore--a grand romance that buoys them through the birth of two kids and fifteen magical years of marriage until tragedy strikes again in the form of a shadowy spot on Ken’s lung. The journey that follows will test their resilience and strengthen their devotion.The Geography of Love is a book about believing in first instincts and second chances.It is a poignant exploration of the depths of the human heart and our ability to love and to trust no matter the obstacles.It is a reminder that “real” life is always richer, stranger, and more extraordinary than fiction.It is the most moving love story you’ll read this year.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Romance",
    "Autobiography",
    "Biography Memoir",
    "Relationships"
  ],
  "author": "Glenda Burgess",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/1878675.The_Geography_of_Love"
}