{
  "title": "Any Way You Slice It",
  "description": "A lucky shot on the ice, the hot hockey player who melts it, and her dad's ban on all things rink related could mean the chance of a lifetime for Penelope…or land her in the penalty box.Penelope Spaulding just can't catch a break. Between long hours at the family restaurant, homework, and her parents' plans for her future, it's hard to find a spare moment to breathe. But when she laces up her skates and steps on the ice, everything slips away...Racing around the rink allows her to blow off steam after yet another fight with her dad about going to culinary school. So when Jake Gomes, the bad boy who lives down the street, dares her to join the Rink Rats, the local misfit hockey team, she surprises herself and joins in silent defiance of her father and his expectations.The more she plays, the easier it is to keep lying, and soon Pen finds it impossible to come clean. She's sneaking out to practice-and loving every minute of it. It doesn't take long for her to fall in love with hockey…and Jake's not half bad either. But she knows it can't last. As soon as her dad finds out, she'll be benched. For good.She's absolutely not going to tell her parents until she's sure it will be worth the inevitable fight. Not only is she skipping shifts at Slice Pizza while a foodie reality show is on the horizon, but her lies are starting to take their toll on her game. It's only a matter of time before everything falls apart.With the team counting on her and with her relationship with Jake on the line, will she have to sacrifice the thing she wants most for the people she loves? Or can she step up and take her best shot? Kristine Carlson Asselin's debut novel delivers a delightful contemporary young adult story about food and family, doing what you love, and being a sporty girl in a boys world.",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Romance",
    "Hockey",
    "Sports",
    "Sports Romance",
    "Friendship"
  ],
  "author": "Kristine Carlson Asselin",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/18800714-any-way-you-slice-it"
}