{
  "title": "The Politics of Friendship",
  "description": "Influential exploration of the idea of friendship and its political consequences.“O, my friends, there is no friend.” The most influential of contemporary philosophers explores the idea of friendship and its political consequences, past and future. Until relatively recently, Jacques Derrida was seen by many as nothing more than the high priest of Deconstruction, by turns stimulating and fascinating, yet always somewhat disengaged from the central political questions of our time. Or so it seemed. Derrida's “political turn,” marked especially by the appearance of Specters of Marx, has surprised some and delighted others. In The Politics of Friendship Derrida renews and enriches this orientation through an examination of the political history of the idea of friendship pursued down the ages. Derrida's thoughts are haunted throughout the book by the strange and provocative address attributed to Aristotle, “my friends, there is no friend” and its inversions by later philosophers such as Montaigne, Kant, Nietzsche, Schmitt and Blanchot. The exploration allows Derrida to recall and restage the ways in which all the oppositional couples of Western philosophy and political thought—friendship and enmity, private and public life — have become madly and dangerously unstable. At the same time he dissects genealogy itself, the familiar and male-centered notion of fraternity and the virile virtue whose authority has gone unquestioned in our culture of friendship and our models of democracy The future of the political, for Derrida, becomes the future of friends, the invention of a radically new friendship, of a deeper and more inclusive democracy. This remarkable book, his most profoundly important for many years, offers a challenging and inspiring vision of that future.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Theory",
    "Politics",
    "Friendship",
    "Sociology",
    "Academic"
  ],
  "author": "Jacques Derrida",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/187998.The_Politics_of_Friendship"
}