{
  "title": "An Activist Armed With a Camera",
  "description": "An Activist Armed With a Camera will be a self-published 8x10 hardcover book with approximately 100 pages featuring photos I have taken since February 2011. You will get a view into movements and protests over the past three years as seen through my eyes, as well as the story of my personal experiences along the way. The book begins with the Wisconsin Uprising in 2011, when Governor Scott Walker launched an attack on public workers and many other people in the state through his \"budget repair\" bill. The people fought back and we occupied our state Capitol for 3 weeks, and what began with just a few thousand people on the first day turned into 200,000 people marching on our Capitol at one point.Another section of the book will include photos from Occupy Wall Street, when thousands of people converged on the financial district in Lower Manhattan beginning on September 17, 2011 to protest social and economic inequality, among many other issues. I traveled to NYC at the end of September that year and slept in Zuccotti Park for about 10 days, capturing the movement, including the well-known Brooklyn Bridge shutdown where over 700 people were arrested.Also included are images from the on-going Turkish Uprising, which began at the end of May 2013 when a small group of activists occupied Gezi Park in an attempt to keep it from being demolished in order to build a shopping mall in a part of Istanbul where green space is very sparse. The police responded to the protest with tear gas, water cannons, and plastic bullets. This sparked protests all over Turkey, and tens of thousands of people took over Gezi Park, completely halting construction in the park. I traveled there just a week after the protests began, and stayed for two weeks. I then went back again for 10 days in July.An Activist Armed With a Camera will also include images from many other protests, such as the 2012 RNC and DNC, the 2012 NATO protest in Chicago, Occupy 1-year anniversaries in NYC, Chicago, and DC, Occupy Sandy (Hurricane Sandy aftermath/recovery), the March 2013 Marriage Equality protests outside of the Supreme Court, the 3-day March for Education Justice in Chicago, and the Forward on Climate Rally in Washington DC. Help get the book published: http://www.indiegogo.com/projects/pho...http://jennapope.com",
  "genres": [],
  "author": "Jenna Pope",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/18802142-an-activist-armed-with-a-camera"
}