{
  "title": "O Evangelho Segundo Jesus Cristo",
  "description": "Alternate cover edition here\"Já que muitos empreenderam compor uma narração dos factos que entre nós se consumaram, como no-los transmitiram os que desde o princípio foram testemunhas oculares e se tornaram servidores da Palavra, resolvi eu também, depois de tudo ter investigado cuidadosamente desde a origem, expor-tos por escrito e pela sua ordem, ilustre Teófilo, afim de que reconheças a solidez da doutrina em que fostre instruído.\" Lucas, 1, 1-4\"Jesus morre, morre, e já o vai deixando a vida, quando de súbito o céu por cima da sua cabeça se abre de par a par e Deus aparece, vestindo como estivera na barca, e a sua voz ressoa por toda a terra, dizendo, Tu és o meu Filho muito amado, em ti pus toda a minha complacência. Então Jesus compreendeu que viera trazido ao engano como se leva o cordeiro ao sacrifício, que a sua vida fora traçada para morrer assim desde o princípio dos princípios, e, subindo-lhe à lembrança o rio de sangue e de sofrimento que do seu lado irá nascer e alargar toda a terra, clamou para o céu aberto onde Deus sorria, Homens, perdoai-lhe, porque ele não sabe o que fez. Depois, foi morrendo no meio de um sonho, estava em Nazaré e ouvia o pai dizer-lhe, encolhendo os ombros e sorrindo também, Nem eu posso fazer-te todas as perguntas, nem tu podes dar-me todas as respostas. Ainda havia nele um resto de vida quando sentiu que uma esponja embebida em água e vinagre lhe roçava os lábios, e então, olhando para baixo, deu por um homem que se afastava com um balde e uma cana ao ombro. Já não chegou a ver, posta no chão, a tigela negra onde o seu sangue gotejava.\"\"«É a obra mais polémica de José Saramago e aquela que, indirectamente, o levou a sair de Portugal e a refugiar-se na ilha espanhola de Lanzarote. Ficou para a história o desentendimento com o então subsecretário de estado da Cultura Sousa Lara, que considerou o livro ofensivo para a tradição católica portuguesa e o retirou da lista do Prémio Europeu de Literatura. Com um José destroçado por ter fugido e deixado as crianças de Belém nas mãos dos assassinos de Herodes; com uma Maria dobrada e descrita, logo no início do livro, em pleno acto de conhecer homem; com um Jesus temeroso, um Judas generoso, uma Madalena voluptuosa, um Deus vingativo e um Diabo simpático, não era de esperar outra reacção das almas mais sensíveis e mais devotas do catolicismo português. E verdadeiramente viperinas são as várias páginas onde o escritor português se entretém a descrever minuciosamente os nomes e a forma como morreram os mártires dos primeiros séculos do cristianismo. Assim se escreveram os heréticos Evangelhos segundo Saramago, para irritação de muitos e prazer de alguns. Como convém.» (Diário de Notícias, 9 de Outubro de 1998)\"",
  "genres": [
    "Fiction",
    "Religion",
    "Historical Fiction",
    "Portugal",
    "Literature",
    "Portuguese Literature",
    "Nobel Prize"
  ],
  "author": "José Saramago",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/1103769.O_Evangelho_Segundo_Jesus_Cristo"
}