{
  "title": "Be Careful What You Wish For",
  "description": "EDITORIAL REVIEWS\" I don't do the book justice go read it for your self it's worth it! Left me speechless. Love the character, story line, everything\" Jagged Edge Reviews\"I was hooked in this book from beginning to end. This is a very well written book that has humour and romance.\" Geeky Girl Books\"If you like Janet Evanovich's Stephanie Plum I think you will really like Amber Fox - I know I do.\" Martha's BookshelfAmber Fox was hilarious with her tough as nails outer persona and her hysterical one-liners that were frequently laugh out loud funny. I definately recommend picking this book up!!\" The Caffeinated Diva reads...\"Be Careful What You Wish For is a sharp, fast-paced story with intrigue, evil, romance, and humor. Amber Fox is the kind of strong lead female character with a great sarcastic wit that I love to read.\" To Read, Perchance to Dream\"Ms. Hodge has written a funny and suspenseful story much in the style of Evanovich's Stephanie Plum books. The plot is fast moving and the dialogue very witty. The mystery is intriguing and interesting, even to people who have no interest in boxing\" Coffee Time Romance & MoreA recommended read by Kindle Users Forum!PRODUCT DESCRIPTIONFor fans of Janet Evanovich, Kate Johnson, and Gemma Halliday...Armed with cool sarcasm and uncontrollable hair, feisty insurance investigator Amber Fox is back in a new mystery combining murder and mayhem with romance and chicklit...Three deaths.A safety deposit box robbery.The boxing heavyweight champion of the world.Somehow, they're all related, and Amber has to solve a four year old crime to find out why.As she stumbles across a trail of dead bodies and a web of lies spanning both sides of the social divide, it's starting to get personal. Someone thinks Amber's poking her nose in where it's not wanted, sparking off a game of fox and mouse - only this time, Amber's the mouse.Amber's forced to take refuge in the home of her ex-fiancé, Brad Beckett, and now it's not just the case that's hotting up. So is the bedroom...All Levi Carter wanted to be was the boxing heavyweight champion of the world, but at what cost?All Carl Thomas wanted was to be rich, but would his greed be his downfall?All Brad Beckett wants is to get Amber back, but there's a reason for the ex word.Be careful what you wish for...you might just get it.(82,000 words)ABOUT THE AUTHORSibel Hodge has dual British/Turkish Cypriot nationality, dividing her time between Hertfordshire and North Cyprus. She is a qualified personal trainer, sports and massage therapist, and writes freelance feature articles on health, fitness, and various lifetyle subjects. Prior to this, she also worked for Hertfordshire Constabulary for ten years.Her first novel, Fourteen Days Later, was short listed for the Harry Bowling Prize 2008 and received a highly commended by the Yeovil Literary Prize 2009. It is a romantic comedy with a unique infusion of British and Turkish Cypriot culture. Written in a similar style to Sophie Kinsella and Marian Keyes, Fourteen Days Later is My Big Fat Greek Wedding meets Bridget Jones. My Perfect Wedding is the sequel to Fourteen Days Later, although it can be read as a standalone novel.The Fashion Police was a runner up in the Chapter One Promotions Novel Competition 2010 and nominated Best Novel with Romantic Elements 2010 by The Romance Reviews.",
  "genres": [
    "Mystery",
    "Chick Lit",
    "Cozy Mystery",
    "Romance",
    "Mystery Thriller",
    "Humor",
    "Fiction"
  ],
  "author": "Sibel Hodge",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/11037796-be-careful-what-you-wish-for"
}