{
  "title": "Seldom Come By",
  "description": "If you crave epic, adventurous love stories, if Jamie and Claire, Alexander and Tatiana or Nathaniel and Elizabeth mean something to you, then meet Samuel and Rebecca and the iceberg that started it all.  Two years after the sinking of the Titanic, fifteen year-old Rebeca Crowe’s fascination with icebergs leads her to save a shipwrecked survivor, Samuel Dalton, the nineteen-year old son of a Toronto medical family. Love sparks in the crystal cave of an iceberg but is thwarted by an unreasonable father and the Great War that drags Samuel and his brother, Matthew, to the Western Front as medical officers.  Knowing Rebecca is home safe in Newfoundland brings Samuel great comfort. But as the war moves towards its final harrowing days, they both discover that tragedy and terror can strike anywhere, setting their love on an unforeseen path. Only when Samuel and Rebecca can fully come to terms with such devastating loss and their impossible choices can their love soar. With an emotional intensity reminiscent of The Bronze Horseman, Seldom Come By, named after an actual place in Newfoundland, is an unforgettable journey across waves and time and the full spectrum of human emotions.  \"Seldom Come By is a haunting love story set against the windswept coast of Newfoundland. The story draws you in from the opening lines and takes you on a compelling journey across time and continents, through love, loss, heartache and healing. It is a beautiful and memorable story — a great accomplishment and a wonderful read.\" Julie Fison, author of teenage romances in the Hardie Grant 'Smitten' series  \"I read the first chapter of Seldom Come By in the Romance Writers of Australia's Ripping Start Competition and was immediately taken in by the beautiful descriptions, world building and the unique and soulful characterisation. And now that I’ve had the opportunity to read it all, I can say the whole book is wonderful, a real pleasure to read. The quality of writing is excellent and the story atmospheric and intriguing. Brilliant, absolutely beautiful.\" Babette Furster, Romance Writers of Australia, Ripping Start Judge 2013  \"Great job on creating that ‘fogged-in’ atmosphere that Newfoundland is famous for. I have lived that ‘fogged-in’ feeling many times. The iceberg was an amazing scene to experience. That sense of longing and yearning that followed was palpable. And from there the tension and excitement just grew, with scenes that were wrenching, breathtaking and moving.\" Leah Sparkes, native Newfoundlander  \"I loved the style of this book and the blossoming romance between Samuel and Rebecca. Their intense love for each other reminded me of Tatiana and Alexander. This book has a slow build then at a certain point it takes off and it is absolutely gripping. You are on the very edge of you seat. Your mouth is open. I so admire Rebecca — her strength to prevail through heartache and sadness, tragedy and loss, her toughness as a younger woman living in Newfoundland, and then later how she managed to come to terms with everything. Some scenes were particularly moving — tears down my face. This book has it all. I was enthralled. I simply could not put it down!\" Su Sprott, reader  \"Set on the edge of Newfoundland, Seldom Come By tells the love story of shipwreck survivor Samuel Dalton and his rescuer, teenage Rebecca Crowe. The author's breathtaking descriptions of sea and landscapes and the historical setting drew me into the first few pages of the book but the relationships between the characters kept me reading.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Historical",
    "Canada"
  ],
  "author": "Sherryl Caulfield",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/18802700-seldom-come-by"
}