{
  "title": "Wife Maintenance Quarterly",
  "description": "Do you have a wife?Yes, you went ahead and did it, took the plunge and got married. And now, it's too late to give her back and you've realised what an unmitigated disaster the unattended woman makes of everything.Never fearThe marriage guidance writers of the world renowned Institute of spousal correction, Wife Maintenance Quarterly, are here to help. Whether you've got a fat frau, an insolent missus or a lazy wretch of a little woman, we've got just the right insider knowledge on which nuts to tweak to get your capsizing marriage ship-shape and tight as an au pair's briefs.Wife Maintenance Quarterly is primarily intended for new husbands, but it is also of use to old hands looking for tips on how to train and how to get the best out of their wives, singletons who've heard bad things and are afraid of making the plunge and, of course, women themselves looking for advice on how to be the best little wives they can be.*Whatever your marital situation, make room for Wife Maintenance Quarterly on your bookshelf!*Statistics show that at least 1 in 3 adult women can read.Wife Maintenance Quarterly is an adult book and is not suitable for children.Brief background: Wife Maintenance Quarterly is my series all about how to wreck a relationship – the wrecking of which is a damaging force in people’s lives and sours the way that we experience the world (when we’re hurtful and rotten to each other, mostly through lack of respect) but more than that, the WMQ series is about institutionalised misogyny. The books are written from a British perspective, where we have officially fairly good women’s rights (legal equality), although societal gender expectations limit people’s lives in other ways. There are countries in the world where women have no equal rights, and even their very bodies are subject to the laws of the land (informed for the most part by theocratic considerations) and WMQ seeks to challenge that and show misogyny for what it is.",
  "genres": [],
  "author": "Michael Pugh",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/18805340-wife-maintenance-quarterly"
}