{
  "title": "The Sunshine Cruise Company",
  "description": "Susan Frobisher and Julie Wickham are turning sixty. They live in a small Dorset town and have been friends since school. On the surface Susan has it all – a lovely house and a long marriage to accountant Barry. Life has not been so kind to Julie, but now, with several failed businesses and bad relationships behind her, she has found stability: living in a council flat and working in an old people’s home. Then Susan’s world is ripped apart when Barry is found dead in a secret flat – or rather, a sex dungeon. It turns out Barry has been leading a double life as a swinger. He’s run up a fortune in debts and now the bank is going to take Susan’s home.Until, under the influence of an octogenarian gangster named Nails, the women decide that, rather than let the bank take everything Susan has, they’re going to take the bank. With the help of Nails and the thrill-crazy, wheelchair-bound Ethel they pull off the daring robbery, but soon find that getting away with it is not so easy.The Sunshine Cruise Company is a sharp satire on friendship, ageing, the English middle classes and the housing bubble from one of Britain's sharpest and funniest writers.Until, under the influence of an octogenarian gangster named Nails, the women decide that, rather than let the bank take the house, they’re going to take the bank. With the help of several thrill-crazy, wheelchair-bound friends they pull off the daring robbery, but soon find that getting away with it is not so easy. Setting off across Europe, the team pick up a teenage hitchhiker, get entangled with Interpol and the Russian Mafia, and discover that, far from winding down, their lives are only just beginning.",
  "genres": [
    "Fiction",
    "Humor",
    "Crime",
    "Contemporary",
    "Thriller",
    "Audiobook",
    "Comedy"
  ],
  "author": "John Niven",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/18803678-the-sunshine-cruise-company"
}