{
  "title": "Worth It All",
  "description": "**Warning** Trigger scene possibility in this book for anyone who has suffered child abuse or molestation. Due to graphic language and detailed sex scenes, this book is not intended for anyone under the age of 18. A bad decisionA castleLost loveBreesan Maxwell, Morgan Walker and Anna Knight are all living in their own vivid, real-life nightmares, due to an evil creator of the most dangerous drug ever. RyskeWhile pursuing a relationship with her long-lost mother, Breesan hears horrible details about a past that she had no idea existed. Will her tattered psyche survive the chaos? Is her relationship with Marcus strong enough to face these truths? Going against his loves wishes and possibly breaking her recently restored heart, Marcus will do everything in his power to ensure that Breesan is protected. Is he willing to sacrifice their relationship to unearth the truth? Nothing is as it seems.Set out to infiltrate a notorious human trafficking ring, Morgan hopes to find the woman who owns his heart before she's lost for good. Unfortunately after seeing the disgusting operation with his own eyes, his mental health takes a severe blow. A tragic accident, disgusting ploys and another member of the small group of guardians getting injured throws their world into utter chaos. There is nothing left to lose. Hidden inside a filthy, dirt-filled cave, Anna suffers from a Ryske dosing that unearths long-ago hidden memories and reveals truths that she couldn't notice before. She needs help surviving the pain of them. Unfortunately, Waverly isn't the one who she must rely on, because she is slipping into a sleep so deep that she may never awaken again. Could the women's only ally in this hell on earth have ulterior motives for his kindness? Or will he prove that he actually cares the way he claims? Words mean nothing.During the fade, one will lose everything, one will finally be found, and one will be fatally betrayed. Or will they all suffer these fates?In the end, all is revealed, and the hell that it takes to get them there will prove to be Worth It All.",
  "genres": [
    "New Adult",
    "Amazon",
    "Contemporary",
    "Suspense"
  ],
  "author": "Marie Wathen",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/18804298-worth-it-all"
}