{
  "title": "The Productive Person: A how-to guide book filled with productivity hacks & daily schedules for entrepreneurs, students or anyone struggling with work-life balance.",
  "description": "Anyone privileged with the choice of how they spend their time is cursed with a common struggle...work-life balance. Whether you're a student, entrepreneur, or even stay at home parent, dividing your free time between productivity and personal time can be difficult.How do you maximize each hour of productivity so that you are only focused on the task at hand, leaving you free to do other more enjoyable things?And...how do you make sure your free time is truly FREE...free of guilt, free of stress, and free of feeling anxious for not being \"busy\"?Both of these things require practice and can be tough to implement and manage with your already overloaded schedule.In this practical, lighthearted and action-oriented book, James Roper and Chandler Bolt explain how you can be productive with your time without sacrificing your social life and the freedom you cherish.By drawing examples from their time as students, entrepreneurs AND years of coaching student-entrepreneurs, they show the reader how be more productive while also creating more time freedom.In this how to guide, the reader will be given:-Productivity Hacks for becoming instantly more productive -Daily schedules that work perfectly for people who need to get stuff done, but also want to have some \"me\" time too -Prework that will alter their mindset and perspective on how they make decisions -Actionable Steps to create your new productive habits in a hurry But, don't get it twisted...this time management book is not meant to be the end all be all for productivity management. (instead, think of these productivity tips as a whole new set of tools for your productivity tool bag.)The Productive Person is concisely written with your valuable free time in mind, and it teaches time management for entrepreneurs, college students, or anyone who struggles with work-life balance.Don't let your time keep slipping away...take it back, make it productive, and enjoy your new life.",
  "genres": [
    "Productivity",
    "Business",
    "Nonfiction",
    "Self Help",
    "Personal Development"
  ],
  "author": "Chandler Bolt",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/18806612-the-productive-person"
}