{
  "title": "Who Is Davis Spanx?",
  "description": "After being falsely accused of an act he never committed, Davis Spanx is unceremoniously sacked from his job. Fuming over the unfairness of the situation and the lack of respect his boss has shown him, he embarks on a mission, a mission to become a celebrity and spread the message of respect.What follows is one man’s journey of following his dreams and turning his vision into a reality, often with hilarious results. Against all odds, the lowly Melbourne factory worker transforms himself into a worldwide celebrity sensation, proving that you don’t have to possess extraordinary skills to become famous, you just need to have a big heart and believe in yourself.His rise to fame starts when he uses a mariachi band to tell his girlfriend that he got fired - causing him to become an instant YouTube sensation. Channel Six then offers him his own weekly morning TV spot, cementing his celebrity status. Everyone loves Davis and they love his message. Like a duck to water he takes to his new life, and so does his family, who are all happy to support and embarrass him in any way they can.Davis might be an Aussie larrikin full of crazy ideas, but he’s not shy about doing what it takes to get his message out there. With a little help from his mates and his madcap family, he reaches his goal in only a month. But what an action packed month it is.Hold onto your seats because Davis will take you on a wild, wild ride. From the highs of pulling off Australia’s biggest TV special ever, to the lows of facing an army of anti-Davis protestors. He’s in the firing line – literally, with death threats and betrayal shadowing his every move. But whatever he faces, Davis deals with it in his own unique way.This is a story about holding onto your truth in the face of adversity, honouring yourself and others, and most importantly, bringing back the respect. Davis proves that one person can make a difference - if they put their mind to it.",
  "genres": [],
  "author": "L.J. Grandi",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18805986-who-is-davis-spanx"
}