{
  "title": "Moments of Perception",
  "description": "It is necessary to understand these Moments of Perception as a venture unlimited by time or space in order to learn regular, quotidian, usual, unnoticed words, yet those that are likewise exciting, undervalued, and thereby, important for our existence. These moments recorded by the lens of perception, in the conception of the moment, emerging one by one in a person’s heart.Freedom, Music, Speed, Fear depicted individually, but also in mutual interconnections and harmony. Elements which possess shared, but also non-shared characteristics. Items searching for an answer to the singularity, but also to the perversion of human thought. Acumen and yet breaches thereof, while observing the diversity of behavior of the most rational being on Earth.Three texts are inserted among four basic impulses as intense elements which clean the clogged perception receptors. Photographs and music help create this verbal idyll. The photographs are pictures independently inserted in the texts. They are not looking for any concrete point of departure within the text itself. They offer space for a personal junction of fantasy where independently hidden and narrowly singular connections can be found. The music helps create the words and the pictures. It molds a space to relax the strained perception. It supports a more favorable digestion of what is written. It offers chords to experience deep feeling and slows down the reader so he can return to a sentence which he has already read and look at the words once again, but this time from a different angle.The texts are written based on the complication of thoughts and situations in which a person finds himself. Perhaps they will not be understood the first time. This is not the goal. The aim is to fine tune perception onto the wave of reception. Read the text with its musical accompaniment, look at the photographs, reflect while looking out the window and attempt to discover the accordance therein, to stimulate perception of life. This awaits everyone who dives into the reading!",
  "genres": [],
  "author": "Dušan Pytel",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/18811074-moments-of-perception"
}