{
  "title": "Finding Our Way Series Collection",
  "description": "Collection of all three novels at one low price for a limited time! FINDING OUR WAY Derrick Wilson and Justin Parker have been the best friends since middle school. They are both 17 and in their junior year at Chandler High School. Derrick is feeling distant and tired of his own much too perfect family. Justin has become the invisible son in the midst of his parents failing marriage. A drunken night of passion awakens feelings neither ever knew they had. What happens when two best friends cross the boundaries of friendship in drunken passion? Are they able to be happy together? How can keep their secret from their friends? Will they be able to hide their relationship from their parents? To complicate things even further they girlfriends. Being a teenager can difficult. Being gay can be tough. Imagine being both TORMENTED DISCOVERY Justin and Derrick have a secret that they revealed only to their closest friends. They are gay and are now a couple. The story of Justin and Derrick continues as they learn more about being a gay couple in their senior year of high school and the complications that arise from it. Some friends will have their backs while others simply stand on the sidelines. Other friends will be accepting and others will ridicule them. Sometimes love is almost not enough to save a relationship and both Derrick and Justin begin to have their doubts as they watch relationships around them rise and fall. Justin and Derrick both want to have new experiences, new choices and make new friends, which leads to them questioning their own relationship. They soon discover that some of the people they consider friends have their own secrets, some darker than others. The couple begins to see how people react towards homosexuality and just how people want to deal with it and them. DRIFTING Derrick and Justin have been a couple since High School and have been through a lot. They both stuck together even when their friends and family found out about their relationship. When their school found out about them. Struggling with challenge after challenge they have finally made it to College. Living together is a whole new world and being open with their relationship is even more new. As the couple begin to spend every day together they begin to learn about their differences more and more. Can their relationship survive the differences? Can it survive new friends and new romances? Will they begin to find their way together or will they have to find their own ways again?",
  "genres": [
    "LGBT",
    "M M Romance"
  ],
  "author": "Jayson James",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/18811653-finding-our-way-series-collection"
}