{
  "title": "Her Last Whisper",
  "description": "Readers who relish heated passion and chilling suspense love New York Times bestselling author Karen Robards’s acclaimed novels featuring Dr. Charlotte “Charlie” Stone. A heroine with a keen mind for catching killers and a soft heart for bad boys, Charlie is back in this third sizzling paranormal romance thriller.  HER LAST WHISPER   Madness and murder invaded Dr. Charlotte Stone’s life when she was just a girl—and made her a woman determined to save others from the horror she survived. An expert in the psychology of serial killers, she’s faced down more than her share of human monsters. But Charlie can also communicate with the spirits of those who die violently, an extrasensory skill that has helped the FBI bring lethal predators to justice. Now, after narrowly escaping death a second time, Charlie’s ready to step away from the edge . . . before her luck runs out.  Too bad Charlie is too dedicated for her own good—and too devoted to federal agent Tony Bartoli to say no when he asks her to ride shotgun on yet another risky mission. Of course, she already has her hands full with Michael Garland: the handsome, roguish ghost with whom she’s hopelessly in love—a spirit who depends on Charlie to keep him from slipping forever into the dark side of the afterlife. But in the mortal world, beautiful single women are vanishing from Las Vegas hotels at night. All signs indicate that a psychopath is on the prowl in Sin City, and Bartoli’s FBI colleague Lena Kaminsky has reason to fear that her missing sister may be just the killer’s type.   In a town full of fast players and few rules, flushing out a smooth-talking stalker like the Cinderella Killer might be a loser’s game. But for Charlie, the only way to cage her quarry is to plunge back into the homicidal hell she vowed to leave behind—and may not leave alive.Praise for Her Last Whisper\n \n“A tightly written ghostly romantic suspense novel with intriguing supernatural elements and sizzling sexual tension.”—Kirkus Reviews   “An absolute winner . . . explodes with both passion and mystery . . . a tale that will haunt you, providing both thrills and chills.”\n—Bookreporter\n   “Outstanding . . . Robards is truly a master storyteller.”—RT Book ReviewsPraise for Karen Robards  “One of the most popular voices in women’s fiction.”\n—Newsweek\n\n \n “Draw a line between two extremely popular genres, mysteries and romance novels, and in the middle you will find the bestselling Robards. She merges the two worlds like no one else, deftly interlacing plot and passion.”—Albany Times Union",
  "genres": [
    "Romance",
    "Paranormal",
    "Mystery",
    "Romantic Suspense",
    "Suspense",
    "Ghosts",
    "Thriller"
  ],
  "author": "Karen Robards",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/18811377-her-last-whisper"
}