{
  "title": "Washed",
  "description": "\"WASHED\" is a beautiful love story set in London, England, about a single young Christian lady (Cherie Johnson), who at 28 is ready to settle down and wants to find a suitable marriage candidate. But Princess Cherie is not willing to kiss any frogs in her quest to find a Prince. Her best friend believes she has placed her bar way too high for mere mortals? Princess Cherie does not get too much time to worry about being lonely because she has other things on her mind - for one a deep desire to establish her true identity by tracing a deadbeat father she has never known and secondly a demanding career as the head of a successful artiste management company. When Cherie meets a handsome, successful and eligible young man (Gustave Allen), she believes that she may have struck gold. But the course of true love seldom runs smoothly, and Gustave comes with baggage attached, which some might say is payback for his past sins. Unbeknown to Cherie and to Gus, however, their promising future together is threatened by a powerful and deadly common enemy - one who will stop at nothing in a quest for revenge and destruction - one who wields a power so sinister it can only be challenged by tapping into a higher source. And many surprises come into play as the story takes unexpected twists and turns that will delight and intrigue the reader. \"WASHED\" has been hailed as a \"best\" read by some and as essential reading by others. It contains a good measure of romance, humour, suspense, betrayal - evil is demonstrated in its vilest form. It is highly spiritually and emotionally charged, presenting love in all its guises: pure love; unrequited love; unconditional love; conditional (feigned) love and powerful agape love that overcomes all - even the most despicable evil.",
  "genres": [
    "Fiction",
    "Christian Fiction",
    "Christian"
  ],
  "author": "Eugenie Laverne Mitchell",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/18810376-washed"
}