{
  "title": "The Servant Prince",
  "description": "This is now only available under the book title of \"Ice Dragon Tales\" which is the combined books of both \"The Servant Prince\" and \"The Servant King\". Go here: https://www.goodreads.com/book/show/2...Original Blurb:Prince Joron of Blade Rain was kissed by a man he had no idea was King Aric of Claymoor Doom. Of course King Aric had no idea the one he kissed was even a man since Joron was dressed as a woman. Disguised in order to escape the newly crowned king of Blade Rain who just happens to be Joron's brother, Joron is swept off his feet by Aric when he is rescued by him from an assault. Aric is also swept off his feet by the beauty of the \"woman\" and that one amazing kiss. Aric, who is led to believe the beautiful woman he kissed is actually the princess, immediately goes to the king of Blade Rain and offers for the princess’s hand in marriage and his offer is accepted. Unfortunately, King Aric is now betrothed to Liarta, Joron’s sister. But an emergency has King Aric racing home without finding out the mistake he has made and now Joron must ride to Claymoor Doom to renegotiate the offer since Liarta is in love with someone else and does not want to marry King Aric. Imagine Aric’s surprise when he discovers the Prince is the one he thought was the Princess! So Aric does the only thing he can think of. He will release Liarta from her obligation of marriage, but only if Joron takes her place... in the marriage bed.But there are other forces at work as well and those forces are out for Joron’s life. At the death of his father, the former king of Blade Rain, Joron is suddenly the powerful new owner of the Ice Dragon Pass, the only safe route through the Norborne Mountains. There are those who would kill for that kind of power. And they have killed for it before…",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Historical",
    "Romance",
    "M M Fantasy",
    "Gay",
    "LGBT"
  ],
  "author": "Hurri Cosmo",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/18811762-the-servant-prince"
}