{
  "title": "The Ledge",
  "description": "King employs a first person narrator and opens with the protagonist, Stan Norris, in the clutches of Cressner, a wealthy, cruel criminal overlord. Cressner intends to get revenge on Norris, who has been having an affair with his wife. Instead of killing him outright, Cressner reveals his penchant for striking wagers, and offers a chilling if Norris is able to circumnavigate the 5-inch ledge surrounding the multi-story building where Cressner live in his penthouse, he can have his wife and $20,000. If Norris refuses, he'll be framed for heroin possession and never see his lover again. Cressner also reveals that he has done this to six others, three professional athletes who crossed his path and three ordinary people who got into serious debt with Cressner. Not once has Cressner lost the wager.Seemingly without any other choice, Norris accepts the wager and proceeds to make his way carefully around the building's cold, windswept exterior. Norris encounters multiple obstacles, particularly from the wind and an obstinate pigeon. Norris completes the harrowing ordeal, only to discover that Cressner had already murdered his wife. Cressner slyly claims that he never welches on his bets and that, while the heroin has been removed from Norris' car and the money is his for the taking, his wife's fate was sealed before the wager was even made. Enraged, Norris overpowers Cressner's bodyguard and obtains his gun. When Cressner pleads for his life, Norris proposes to spare him if only he is able to complete a trip around the ledge. However, while waiting for Cressner to circumnavigate the building, Norris reveals to the reader that, unlike Cressner, he does sometimes welch on bets, implying that he will kill Cressner, regardless of his potential success on the ledge",
  "genres": [
    "Short Stories",
    "Horror",
    "Fiction",
    "Audiobook",
    "Crime",
    "American",
    "Thriller"
  ],
  "author": "Stephen        King",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/18811972-the-ledge"
}