{
  "title": "Down the Shore",
  "description": "Livia Chadwick is a photographer by day and a self-proclaimed rock-n-roll junkie by night. Her dating life is a lackluster parade of evasive jerks and her boss is an unrelenting nightmare of a human being.What else can a girl do but rent a beach house with her girlfriends and blow off a little steam every weekend? But hey, she’s from Jersey. Barhopping down the shore all season is sort of mandatory.All is going according to plan… until she meets Jack.Jack Tanner is a contractor-turned-musician in a small-town cover band suddenly thrust into the limelight. He’s already had enough of the rock-and-roll lifestyle, and groupies have never been his thing. Then again… there’s a gorgeous brunette in the audience tonight, checking him out with the most incredible green eyes he’s ever seen.She's looking for a fling.He's looking for forever.It’s gonna be one helluva summer.Set in the summer of 1995, DOWN THE SHORE takes the reader on a tour through some of the Jersey shore’s hottest hot spots over one, sleepless, flannel-clad summer.It’s a look back to a time when the music was groundbreaking, the rock clubs were king, and bar bands ruled the world.***Not recommended for anyone under the age of 18, and/or any readers who are slut-shamers, guido sympathizers, beach haters or anti-music. Other people who should walk away from this book Readers who have sticks up their butts about offensive language, those who don't like detailed sex scenes in their stories, idiots who think \"Jersey Shore\" has anything to do with actual New Jerseyans, and anyone who can't appreciate the mother-effing nineties.***READ WHEN YOU’RE IN THE MOOD Light, sexy, funny, romantic, and nostalgic.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "Contemporary",
    "Music",
    "Romantic Comedy",
    "Humor"
  ],
  "author": "T. Torrest",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/18809569-down-the-shore"
}