{
  "title": "Double Trouble",
  "description": "Skye McKenzie goes by the name Mack, as in Mack the Knife. She's tough because she had to be in her line of work as an undercover narcotics agent working the streets of Dallas. As Mack, she's trying to bring down one of the largest drug operations in Texas. She's been under more than she's been in the real world and wonders how she's going to function once this operation is over. She's already decided it will be her last. Of course if someone has their way, it could be her final anything. Mack is sure there's a mole in the department she's working with, and paranoia is her new best friend.When she meets the new supplier for the operation, Stone, Skye realizes she's in trouble. Not only is he hot as hell, but he's also smart. It's lust at first sight for Mack. She's had a long dry spell between the sheets, which makes Stone way too tempting. Since he's working for the other side, though, he's off limits. It's something she has to keep reminding herself over and over again.Stone knew trouble when he saw her, but Mack had her claws in him almost from the beginning. Even from across the room in dim light, Stone could tell she was a good looking woman with a body made for sin. He couldn't have avoided the attraction if he'd tried. Stone didn't put up a fight at all. It was a free country, and a man could look all he wanted. As a cop working undercover, though, Stone would have to take her down along with the Dallas drug operation he had infiltrated when it was all over. That thought sobered him fast enough.Shoved together and hiding out while a rival cartel tried to take over the current one in a turf war, sparks flew between them. One thing led to another, and before long they were acting on their attraction to each other. Now turning Mack in was proving to be a lot harder than it should have been. She pushed drugs on the street, and he was a sworn officer of the law. But then Stone had never planned to fall in love with a drug dealer in the first place.Stone unknowingly puts Mack in danger when they call her handler to check our her claim that she's working undercover as well for the local guys. They end up talking to the mole in the office, and as they lead her away in handcuffs to the patrol car, someone shoots her to keep her quiet. Guilt eats at Stone until he manages to dig up the truth. If Mack lives through surgery, will she ever trust him again? What sort of future could they hope to have when it was based on lies to begin with? Stone plans to convince her to give them a chance and start over, but first, she has to make it through surgery and clear up the Internal Affairs mess they both landed in. Then he plans to take her as far away from Texas as they can get. She just has to pull through.",
  "genres": [],
  "author": "Anna Riviera",
  "average_rating": "4.91",
  "url": "https://www.goodreads.com/book/show/18809830-double-trouble"
}