{
  "title": "Sam and Derek: The Whole Story",
  "description": "Sam Bradford is a down-on-his-luck former Special Forces soldier when he meets Derek Constantine, sexually confused billionaire. Together the two men will play a series of games that bring them ever closer together…and which in the end may be the death of them… Sam’s Reluctant Submission Sam's down to his last five dollars when he meets Derek, who makes him an offer - come to my estate for a manhunt, evade me for two days, and you'll make ten grand...but if I catch you, you surrender your ass to me! Sam's got SERE training and he's pretty sure his straight ass is safe, but anything can happen when the hunt is on... Sam’s Reluctant Submission II: Urban Manhunt In Part I, Sam lost his ass to Derek, but kept something more important – Derek submitted him, but didn’t break him, and that’s what Derek really wanted. Now Derek wants a rematch – fifty grand for an urban manhunt, if Sam evades Derek’s crew…if he doesn’t, it’s four on one and Sam’s ass is toast! Sam’s Reluctant Submission III: Search and Rescue In Part 2, Sam lost his ass to Derek again – and loved it! Which left him wondering if he was gay after all. Maybe a three way with Jake and Eddie will help him figure that out… And when Derek calls Sam to get his help with a search and rescue effort, what sexual sparks might be generated if they clash again in a “threematch”? Sam’s Reluctant Submission IV: Avenging Devils The epic conclusion to the saga of Sam and Derek! When Derek’s dark past rears its head to jeopardize the couple and their friends Jake and Eddie, Sam will have to call on his old Special Forces buddies to do battle with The Factory, a malevolent cartel bent on revenge. Will Sam and Derek rescue Eddie from his kidnappers? Will seeing Sam explore his top side with Eddie make Derek jealous…or make him want Sam to do that to him? Most frightening and dangerous of all, will Derek finally say the L word! BONUS STORY - Eddie’s MMA Submission – the story of Sam’s friends Eddie and Jake Eddie works across the street from Downtown Fight Academy. And he can't stop thinking about Jake, the hot MMA fighter he ran into at the store. When Jake offers to train him, Eddie's ready to throw down in the Octagon. But when Jake has him submitted, and pulls out a weapon you won't see on TV, will Eddie tap out...or take the punishment?",
  "genres": [
    "M M Romance",
    "BDSM",
    "Military Fiction",
    "Erotica",
    "Menage",
    "Contemporary",
    "Gay For You"
  ],
  "author": "Brad Vance",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/18809682-sam-and-derek"
}