{
  "title": "Break Me",
  "description": "Break Me is the second book in Amanda Heath’s Make or Break series. It can be read as a standalone.  “Wes, I don’t know what you want me to say here.” Royal’s voice is broken. Maybe he is broken. Maybe I broke him. Lord knows I’m broken myself. “Don’t say anything,” I start off with. There are so many things I want to tell him. The one thing I want him to know, that I want him, I will never say aloud. “When push comes to shove Royal, you’ll break me. I’d never be the same after you. I’d be a shell of this girl.” His face pales but he doesn’t step away. Something I had planned on. His hands caress my face before he says, “You have that wrong, Wesley. You’ll be the one to break me.”  Wesley Bridges was lost between the living and the dead. She was clinging to her boyfriend, who passed away unexpectedly. She was left with having no way to move on. Her best friends, Annabella and Pierce were too caught up in each other to save her. Even her family turned a blind eye, not able to bear her grief.  Then one day, Royal Sanders walked into her life. Tall, dark and sinfully handsome, but aren’t all the unattainable ones? At first it was nothing. She was asked to tutor him and found he’s different than even she thought. She even turned to Royal when things got too hard. And when she falls for him, she falls hard.  But Royal’s the enemy. A long drawn out hatred brews between her friends and Royal’s. That doesn’t seem important to her, considering she’s still in love with her dead boyfriend. A love triangle between life and death…who will win?  Grief is a powerful emotion but there are several different kinds of grief. Betrayal and heartache are still knocking on her door. Things are about to come crashing down around her. It will definitely break her, but will Royal be enough to save her?",
  "genres": [
    "Romance",
    "New Adult",
    "High School",
    "Young Adult",
    "Contemporary",
    "Contemporary Romance",
    "Death"
  ],
  "author": "Amanda Heath",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/18809509-break-me"
}