{
  "title": "Her Keeper: Part 1",
  "description": "Alternate cover for this ASIN can be found hereThe feud between Rick Andrews and Sara Michaels is legendary and no one ever wants to stand in the line of fire when they go at it. Rick can’t deny the chemistry between him and Sara. Hell, just the thought of her makes him hard. Her intelligence and her spirit intrigue him and, for some unfathomable reason, the need to protect her consumes much of his waking hours and a few of his dreams as well. But she’s too high maintenance. Especially as she holds a long time grudge and knows just how to push his buttons. No way does he want an argument with his woman every time he turns around, no matter how beautiful her face and adorable her ass. Sara Michaels has never forgiven Rick Andrews for humiliating her during her freshman week in college. Now eight years later, their ongoing feud is reaching combustion level, in no small part because of the throbbing his angry, alpha male hotness creates between her thighs. If only he wouldn’t frame his advice in ‘do as I say’ commands, she might be inclined to listen now and then. His dominant attitude just makes her go for the knee-jerk response every time. Only, now Sara has crossed the line and Rick is determined to use the power her transgression grants him to lay down the law in a way she can't escape. This the first part in a series that will unfold over multiple volumes ranging from 10,000 to 20,000 words each. Her Keeper is an erotic romance with explicit sexual content with elements of BDSM. It has a hot cop (two actually), sexy frisking, spanking, cuffing, a crazy, hot proposition yet to come and two people who are stubbornly in love. This is the first instalment and true to a series stops at an interesting moment. The story is 19,000 words and the rest of the book has descriptions and excerpts from other works. Enjoy!",
  "genres": [
    "Romance",
    "Erotica",
    "BDSM",
    "Contemporary Romance",
    "Novella",
    "Contemporary"
  ],
  "author": "Helen Karol",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/18810857-her-keeper"
}