{
  "title": "God on Trial",
  "description": "For the main character of Sabri Bebawi God On Trial, each moment brings a torment of some kind. The character is extremely intelligent and yet disturbed by thoughts that never cease, as well as memories that evoke strong responses, eventually leading to a confusion of time and current reality. Indeed, as time progresses, the confusion grows worse; his reality rarely merges with truth. Paranoia and hallucinations take over his mind and thoughts, provoking dangerous responses on his part.As this deterioration advances, his connection with his wife becomes tenuous in that she is not able to understand the dimensions of his personal reality. He may have little intellectual connection with his wife, but one portion of his thoughts remains largely coherent. In an attempt to gain some recompense for his suffering – and possibly to protect others from similar problems – he wishes to put God on trial. With little sleep or rest, he begins to gather the data needed for such a task even as his life begins to fall apart. His rage against God takes on new proportions as he develops the case; reviewing Holy Scripture, he in fact finds God culpable in the most heinous of crimes against humanity. The case envelops his imaginings, isolating him from those who care about him most.This disturbed man is presented in Bebawi novel as a remarkably compassionate person who has experienced the worst of life in his various ailments. He is certainly representative of much of the reader’s own private questionings of God and the trials that are faced by even the most innocent. Even in the midst of obvious hallucinations, he provides a lucid argument against God, definitely not the ravings of a madman.And yet mental illness is one of his problems, the most prominent one during the action of the novel. Following his thoughts through various mental states, the writing in Bebawi book is chaotic but not confounding; it is more disconcerting in that the reader witnesses the suffering of such a kind and intelligent man in the midst of mania and delusion. Bebawi skillfully leads the reader through the meanderings of his mind and leaves the indelible impression of a man who did not deserve his fate. Too, the writing is obviously sympathetic toward those with mental illness without being condescending or overly dramatic in its representation.By presenting the argument against God within the context of the thoughts of a mentally ill person, Bebawi may be providing a “safe” place for such discussion. Some may dismiss the case that the character is developing as that of delusion, and yet there are those in the novel who find it remarkable. Following the main character as he gathers his information from the various religious texts, the reader may make a similar conclusion. Or, if religious, he or she might simply find a common ground with this man in his suffering and the rage caused by it. Bebawi leaves such a decision up to the reader and his or her conscience.This intricate story is so captivating with such vivid, detailed characters, that readers will fall in love with this book. Even within the space of a short novel, Sabri Bebawi is able to present difficult – and often private – questions of life, God, and reality in the harsh existence of a mentally ill man. Through smooth prose that expresses the man’s desires, Bebawi provides the reader with not necessarily the answer to whether or not God is guilty of crimes against humanity, but rather the context in which to begin answering those questions. The fictional space of the book provides only the beginning of this discussion, and yet it is a powerful beginning.",
  "genres": [
    "Religion"
  ],
  "author": "Sabri Bebawi",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/18813539-god-on-trial"
}