{
  "title": "Servant of Steel",
  "description": "By the author of amazon.com/The-Hungering-Saga-Complet... The Hungering Saga Complete, the beginning of a brand new series!Servant of SteelHaving two of his fingers cut off at an early age hadn't done much to make Xandrith an agreeable fellow. Besides marking him as a pariah and having him shunned by even his own family, it had also hurt. A lot. Being stripped of a few of his fingers and cast out of the Order of Mages had left him bitter and angry, but if there was any consolation to be had it was that he was doing rather well in his new line of work. While perforating people for money might not have been the most noble of callings, it was quite lucrative. Well, it had been quite lucrative.In a conspiracy of fate seemingly beyond his control, Xan soon finds himself facing a dilemma of conscience, and that isn't something he's familiar with. One dilemma leads to another, and before long the mage-turned-assassin finds himself performing more and more honorable deeds. Worse yet, without even attempting to do so he manages to acquire friends and to develop a sense of compassion.As Xan struggles with his burgeoning humanity, a terrible darkness begins to wake in the world. The Order of Mages, once an overbearing power of control, seems to be losing its grip as a terrifying doom of their own creation rises in the north. As if that wasn't enough, the horror brought upon the world by the folly of the mages may only be the precursor to something far more sinister.For more books by Heath Pfaff, have a look at the Servant of Steel (Chaos Awakens 1) amazon.com/Servant-Steel-Chaos-Awaken...Crown of Steel (Chaos Awakens 2) amazon.com/Crown-Steel-Chaos-Awakens-...City of Steel (Chaos Awakens 3) amazon.com/City-Steel-Chaos-Awakens-B...The Hungering Saga Complete amazon.com/The-Hungering-Saga-Complet...The Noble Fool (Hungering Saga 1) amazon.com/The-Noble-Fool-Hungering-e...The Vengeful Malice (Hungering Saga 2) amazon.com/The-Vengeful-Malice-Hunger...The Snow Song (Hungering Saga 3) amazon.com/The-Snow-Song-Hungering-eb...God Ender [SHORT] amazon.com/God-Ender-ebook/dp/B0088GBCL4Seventh [SHORT]  amazon.com/Seventh-The-Marching-Darkn... you for taking interest in an independent writer!  Your support aids us in improving the quality of our final products, and encourages creativity and innovation beyond what the major publication houses will print.  For up to the date information on Heath's latest projects, contests, and inane ramblings follow us on Facebook facebook.com/heathpfaff/",
  "genres": [
    "Fantasy",
    "Amazon",
    "Fiction"
  ],
  "author": "Heath Pfaff",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/18814083-servant-of-steel"
}