{
  "title": "The Underclasman",
  "description": "Never has there seemed a truer instance of you can take the boy out of the country, but you can’t take the country out of the boy–or so one would infer with Bancroft. It was only natural to predict that would be the case. Raised in a small town he had a small town upbringing that instilled in him the small town values and consequently the small town mentality that one would assume he incorporated. Not that this is a bad thing in and of itself, but that’s just not the way things were. On the surface though, he did make the most perfect Stepford Child.Perpetually in step, Bancroft was a line-toer. He also appeared to be a go-alonger who never made waves and was always on time. He said, “yes sir” and “no sir” and “please” and “thank you.” He held doors for old ladies and took his hat off in the house. He never shirked and consistently completed the task at hand without complaining, talking back or grumbling. Not only did he always do his homework which he consistently turned in on time, he also listened in class and raised his hand before speaking because he would never talk out of turn. He made good grades as well. Choir boy, boy scout, hall monitor, teachers aide, band geek, Bancroft was a do-gooder destined for ruin from the get-go.The shock of recognition had set in towards the end of his senior year. That’s when he finally determined that it was time to stop eating exclusively what was put on the plate set in front of you. That’s when he decided that he would try anything once. After all, Mame Dennis put it so succinctly when she said that Life is a banquet and most poor sons of bitches are starving to death–LIVE IT UP.There just had to be more to life than grabbing a chocolate malted at the drive-in or loitering at the bowling alley or sneaking into the picture show to pig out on sour pickles and popcorn. When Bancroft left behind this dusty, ultra-conservative, tiny Texas town that he had called home for the better part of 17 years, he veritably launched. His launchpad was the buckle of the Bible Belt.When he went to college early, it was not so much as to “get a head start”, it was more likely “to get the hell outta Dodge.” As if it were the Resurrection, he was convinced he was going to a better place and, no matter where that was, it had to be an improvement well above the status quo. While in pursuit of an education, even though he knew text books would probably be involved and like-it-or-not he would have to attend at least some classes, he never actually realized to what extent or what kind of education he was going to get or exactly how broad his horizons would eventually become.Although THE SUMMER OF ’42, was a movie favorite of Bancroft’s, (a virgin in every sense of the word), he had never actually considered it a manual to manage one’s own sex life. Besides, if that were the case they sure left out an awful lot of integral footnotes in the appendix. Where were the road signs defining just how quickly things change or how surprisingly partners tag-team and you suddenly find yourself swapped out. Unexpected directions, twists and death-spiral u-turns can alter this journey called life while advancing toward your final destination in the great beyond?Even though events made his college years seem more like BOB & CAROL & TED & ALICE or BOYS IN THE BAND rather than LOVE FINDS ANDY HARDY, the truth is it probably falls somewhere in the middle–which is also where he found himself a great deal of the time. So keep in mind that this will be more like a meatball sandwich on an onion roll with slaw and chili peppers rather than a simple bologna on white with mayo and you’ll be fine. By the way...are you going to eat that pickle?",
  "genres": [],
  "author": "M. Bancroft",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/18812701-the-underclasman"
}