{
  "title": "The Transsexual Empire: The Making of the She-Male",
  "description": "Fifteen years ago, when it was first published, \"The Transsexual Empire\" challenged the medical psychiatric definition of transsexualism as a disease and sex conversion hormones and surgery as the cure. It exposed the antifeminist stereotyping that requires candidates for transsexual surgery to prove themselves by conforming to subjective, outdated and questionable feminine roles and \"passing\" as women. Then as now, defining and treating transsexualism as a medical problem prevents the person experiencing so-called gender dissatisfaction from seeing it in a gender-challenging or feminist framework. Transsexualism goes to the question of what gender is, how to challenge it, and what reinforces gender stereotyping in a role-defined society. In the new introduction to this feminist work, Raymond discusses how these same issues are now debated in the context of transgender. Transgenderism reduces gender resistance to wardrobes, hormones, surgery and posturing - anything but real sexual equality. It assimilates the roles and definitions of masculinity and femininity, often mixing and matching, but never really moving beyond both. In a similar way, transsexualism is thought to be a radical challenge to gender roles, breaking the boundaries of gender and transgressing its rigid lines. But if the transsexual merely exchanges one gender role for another, and if the outcome of such a sex reassignment is to endorse a femininity which, in many transsexuals, becomes a caricature of much that feminists have rejected about many-made femininity, then where is the challenge, the transgression, and the breaking of any real boundaries? This book will be used as a text in women's studies, psychology, sociology, technology and public policy, as well as by medical students, law students, and all who have an interest in feminist issues.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Gender",
    "Transgender",
    "Politics",
    "Queer",
    "LGBT"
  ],
  "author": "Janice G. Raymond",
  "average_rating": "2.90",
  "url": "https://www.goodreads.com/book/show/1001441.The_Transsexual_Empire"
}