{
  "title": "R.I.P. Requiescat In Pace",
  "description": "\"Il primo capitolo di una serie avventurosa e romantica, che promette scintille!\" Glinda Izabel autrice di Shades of Life (Fazi Editore) e blogger presso Atelier dei Libri.Dopo più di duecentocinquant’anni dall’Inquisizione e dalla segreta fondazione dell’Avatara, la terra maledetta che trasforma i morti in Succubi e Incubi non si placa più nemmeno con il Potere del Sangue dei Custodi. Forse l'Apocalisse è ai cancelli e i membri dell'Avatara hanno un piano per impedire al mondo intero il momento della Rivelazione, ma quel progetto prevede qualcosa di terribile. Kaspar Nowak e sua figlia Joanna, da tutti chiamata Asia, dovranno affrontare il ritorno del Male nel cimitero di Cracovia. Per Asia essere una Custode e possedere il Potere del Sangue è una battaglia continua contro una parvenza di vita normale, da mantenere a tutti i costi. Qualcosa non funziona più come dovrebbe e la vita dei Custodi, ma soprattutto quella di Asia, è in serio pericolo. Un modo per porre fine alla maledizione esiste, ma chi dovrebbe metterla in atto brucia dal desiderio di non farlo. Borislav Todorov, affascinante quanto pericoloso Venator dell’Avatara, correrà in soccorso della giovane Joanna, ma i suoi ordini celano segreti inconfessabili, e orrori che il cacciatore non vuole rivelare. L’odio e l’amore che provano l’uno per l’altra divamperà in fuoco e ghiaccio, perché tra loro non esistono mezze misure. Bor tenterà di combattere da solo contro il Male, in qualunque forma decida di svelarsi, purtroppo per lui, però, il Potere del Sangue non può essere ignorato. Per secoli i Custodi hanno protetto la razza umana dalle porte dell'Inferno ma forse, ora, è giunto il momento di spalancarle.",
  "genres": [
    "Horror",
    "Gothic",
    "Fantasy",
    "Urban Fantasy",
    "Romance",
    "Paranormal"
  ],
  "author": "Eilan Moon",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/18817140-r-i-p-requiescat-in-pace"
}