{
  "title": "Read Us or Die",
  "description": "The first official publisher's anthology featuring the exemplary talents of the authors of BLACK BED SHEET BOOKS!\"Black Bed Sheet is not only a publisher of fantastically creative horror books but knows the meaning of heart and integrity....Grabowsky has taken BBS to heights that few could have imagined with his drive, determination and talent, along with the talent in his stable. If you haven't read anything from BBS, it's past time you did but it's never too late! --- Gene Tipton, A SHOT IN THE DARK COMICS\"I had this idea for an anthology. A crazy, outside the box thought that I hoped would at least ignite some interest. Well, it not only ignited, the damn thing drenched the entire office at Black Bed Sheet Books and its publisher Nicholas Grabowsky in a orange and red hue of excitement. This has now become a solid joint effort spanning the many talented authors of Black Bed Sheet Books, highlighting the core value of writing: character depth. When Nick gave me the green light, I began to construct this list of talented writers. Some are veterans of the writing landscape [such as myself], others are brand new and cutting their jagged incisors deep into the skin of the publishing world. My only requirement for the authors became the simple task of all, write a story that has deep characters and emotion.\"A story evolves only so far as the characters propel it. I wanted the characters stripped down to their skeletons. Heroes, villains, somewhere in the middle? Bring them through the emotional grinder, chew them up, spit them out, where will it take the reader? Or, what about a few stories with different spins on such figures as Dracula, Adolph Hitler, the Devil, and Snow White. A few of these stories are dark in nature, or splashed with a form of comic ingenuity. Others are entrenched in history with a different spin that left me squirming in my seat.\"These authors are bright, fresh, talented, comedic, compassionate, and downright scary when they want to be. So sit back, turn off the lights, and read the book. Or die. I wouldn't want that to happen to you, but then again once you step inside our world, anything can happen.Close your eyes.Take a breath.The sounds you hear are real.There is no turning back.Keep reading.Or die.\" --from Introduction by Jason Gehlert--Featuring the talents of- Fred Wiehe - Cinsearae Santiago - Brandon Ford Jessica Lynne Gardner - Lincoln Crisler - Jason Gehlert - William Cook - Reyna Young - Tom Sawyer - K.K. - Rey Otis - Shannon Lee - B.L. Morgan - Tammy Gehlert - S.C. Hayden - Franchisca Weatherman - Jake Istre Patrick James Ryan - Horns - Jason M. Tucker Amity Green - Adam Aresty - Jennifer CaressAnd Nicholas GrabowskyEdited by Jason Gehlert",
  "genres": [],
  "author": "Jason Gehlert",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/18816222-read-us-or-die"
}