{
  "title": "Out of the Dark",
  "description": "He is mine and I am his. I will move every obstacle in my way to remind him. Decebel Anghelescu is one of the strongest Canis lupus on earth, an alpha in his own right. Now that he's found his mate, the fiesty blonde, Jennifer Adams, he could be stronger still, a powerful asset to the Romanian Greys. But he's been crippled by a devastating curse, one cast by an unknown enemy, a witch of incredible power. The spell threatens to dissolve the fragile new bond with the woman that is the other half of his soul. It will take the help of an entire pack to break it, but has too much damage already been done? Meanwhile, injured and alone, Jennifer fights for her life, and it appears to be a losing battle. Now, she has come to terms with her fate, accepting she won't share a life with Decebel...and what a life it would have been. But help comes in the most unexpected form...the discovery of a long-lost healer. The Romanian alpha, Vasile Lupei, will have to use all his resources – including Sally Morgan, the new gypsy healer of the Romanian pack – to battle the witch, lift the curse from Decebel and reunite him with his mate, and solve a mystery that's been surrounding the Romanian pack for 300 years. Editorial Reviews ★★★★★ If they don't make this series into a movie I will be so disappointed. It is very bit as good as the Twilight series and in my personal opinion even better. ~Amazon verified review ★★★★★ Out of the dark, is one of my favorites of the entire series. ~Hope C., Amazon verified review ★★★★★ The series really keeps you on your toes. Then when your done with the book you need the next one or you may go crazy. ~Amazon verified review ★★★★★ These books have the perfect amount of humor, steam, and romance. I’ve read them all a dozen times and will continue coming back to them! ~Sara S., Amazon verified review",
  "genres": [
    "Paranormal",
    "Werewolves",
    "Young Adult",
    "Romance",
    "Fantasy",
    "Shapeshifters",
    "Paranormal Romance"
  ],
  "author": "Quinn Loftis",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/18819342-out-of-the-dark"
}