{
  "title": "The Ten Minute Cognitive Workout: Manage Your Mood and Change Your Life in Ten Minutes a Day",
  "description": "The TEN MINUTE COGNITIVE WORKOUT, Winner of the 2013 San Diego Book Award in the category 'Psychology, Self-Help, Medicine', describes and teaches you a simple, easy to learn, exercise designed to maintain positive mood, reduce stress, and change behavior. This easy exercise increases your self confidence and helps you feel in control of your life. As the title suggests, the exercise requires an investment of only ten minutes a day. Despite its ease of execution, the TEN MINUTE COGNITIVE WORKOUT is surprisingly powerful. It’s based on the principles of Cognitive Behavioral Therapy. What we think directly affects how we feel. Our thoughts govern our emotions. The TEN MINUTE COGNITIVE WORKOUT shows you a simple way to replace negative, irrational, dysfunctional thoughts with positive, rational, functional ones. These new thoughts become internalized and produce positive changes in emotions and behavior.This book provides you with a powerful tool that can manage the stress of everyday life. This tool can also alleviate depression and reduce anxiety. Sleep problems, relationship issues, and parenting concerns are also addressed, as well as issues related to the workplace, education, and skill development. In each of these areas, the book explains an easy, step-by-step method designed to bring about positive changes in mood and behavior. You can attain a new sense of well-being by investing only ten minutes a day in this one simple, effective exercise. Your mood will improve in a positive direction. You’ll feel more calm and in control. You’ll find yourself embracing each and every day. You’ll be feeling more confident, and your confidence will be expressed in your behavior. In time, you can achieve an ongoing state of joy and peace. And it only takes ten minutes a day.The book also contains a bonus section that describes two simple meditation techniques. Interested readers can incorporate meditation and other mindfulness practices into the TEN MINUTE COGNITIVE WORKOUT.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Personal Development"
  ],
  "author": "Peggy D. Snyder",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/18814824-the-ten-minute-cognitive-workout"
}