{
  "title": "Immortal Ops Box Set",
  "description": "Immortal Ops Box Set Books 1-4Paranormal Shifter Military Special Ops RomanceBox Set includes:1. Immortal Ops2. Critical Intelligence3. Radar Deception4. Strategic VulnerabilityImmortal OpsCaptain Lukian Vlakhusha is having issues with his newest target, Peren Matthews. Something about her has left him staring at her picture and wondering what it would be like to touch her soft skin. When the time comes for the team to strike, Lukian senses danger and aborts the mission. He makes an attempt at meeting Peren and is set in his place by an independent young woman who knows what she is, and isn't, looking for in a man.Lukian is having trouble telling Peren that he's what she fears most, a werewolf. Can they make the passion that burns between them last, or will Lukian's condition be too much for Peren?Critical IntelligenceWhen loyalties are questioned and bonds forged, the I-Ops find themselves fighting a war to guard not only their secrets but their lives as well.Missy Carter leads a rather boring, overworked life as a system analyst for the State Department or rather, that's what she lets everyone believe. No, in reality her life is anything but boring. As an agent with the Paranormal Security and Intelligence, she's seen and done it all. Intelligence is her specialty, assassination is her hobby. The only problem is that the things she spies on don't die easily. In fact, some of them were dead to begin with. She's learned to handle anything life can throw at her. That is until the biggest paramilitary pain her ass shows up again. Lucky for him, he's sexy.Roi Majors, second in command of the I-Ops, is having a hard time believing that Intel can only get half the information needed to bring down an underground ring of vampires with big spending backers who are hell bent on creating a race of supernaturals with multiple strands of DNA in them. As the team searches for answers, Roi searches for sexual release. When he finds himself paired with the one woman in the world who seems immune to his self-proclaimed charms, he can't wait to see her to safety and then bid her good riddance. He never counted on falling in love with her. And he sure in the hell never counted on her claiming to be an agent with a branch of the government no human should know about.Radar DeceptionDr. Thaddeus Green survived a werepanther attack long ago, leaving him immortal and a member of the I-Ops team. He's dedicated his life to genetics and to serving his country. After his mutated DNA led to the death of his loved ones, he vowed to never let anyone close to his heart again. Try as he might, Green is unable to stop the mystical pull to the tall, leggy blonde with a sharp tongue and an even worse bite. Thinking Melanie is suffering from mating withdraw, Green is prepared to do what he must to assure her survival, even if it means claiming her for himself, regardless of his need to protect his heart. Little does Green know that fate has been preparing him for Melanie Daly all his unnaturally long life.When ghosts from the past resurface, in ways he never dreamt possible, the normally mild-mannered scientist finds himself drawing on his inner beast and rage to assure his mate and their future are protected.Strategic VulnerabilityHeld prisoner in a remote testing facility in the middle of the Brazilian rain forest, subjected to torture and abuse, shape-shifter and alpha male Wilson Rousseau has long since given up hope of being rescued. Days blend together until he can’t help but long for death. Saved from his isolated hell by a female’s distress call, he feels an instant connection to her.Kimberly thought she was taking a trip to South America to study indigenous plant life. She had no idea she was playing into the hands of a madman whose goal is to create a genetically altered army of super-soldiers. When she finds herself locked in a cell with Wilson, a man who would give his life to save hers, there is an instant attraction. But the dark secrets surrounding their imprisonment may change their lives forever. Can they find a way to beat the odds and be together, or will the madman win?",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Shapeshifters",
    "Fantasy",
    "Amazon",
    "Military Fiction"
  ],
  "author": "Mandy M. Roth",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/18817133-immortal-ops-box-set"
}