{
  "title": "Darc Murders Collection",
  "description": "From the Carolyn McCray, #1 bestselling author in Hard Boiled Mysteries and Police Procedurals, comes The Darc Murder Mystery Collection!Praise for The Darc Murder Mysteries...\"Five stars for an extraordinary hero who senses his way through clues and is seemingly clueless about ordinary give-and-take relationships. a very satisfying, engrossing novel.\"Dot DayAmazon Reviewer\"Very good book with enough twists and turns to make you attached to the book until the end. Nice characters and a goon and interesting story indeed. A real thriller for enthusiasts.\"PedroAmazon ReviewerOverview:Robi Darchmel is no ordinary detective. He's autistic and must overcome his emotional shortcoming to connect with a terrorized young girl to capture the worst serial killer the world has ever seen. The COMPLETED 1st cycle collection includes...\nDevious \n- the prequel short story to 9th CircleDeceived - another prequel short story to 9th Circle\n9th Circle\n - the full-length novel that started it all\n7th Sin\n - the full-length sequel to 9th Circle\nCarnal\n - the bridge short story between 7th Sin and 5th Pentagram\n5th Pentagram\n - the last full-length novel in the 1st cycle\nSinister\n - the \"wrap-up\" short story for the 1st cycleMore Praise for the Darc Murders...\"I loved this book!!! First book I've ever read by these authors... and I thought it was totally amazing. Well written and def kept me on the edge of my seat! Darc had me completely fascinated. Totally unlike any other detective I've ever seen! Being a fan of detective novels, horror and some gore, I found this book right up my alley!! I bought it on a whim but now I def want to see what else they have written!!!\"Andrea SeverinoAmazon Reviewer\"I absolutely loved this series. Ive recommended it to several people. If you visualize what you are reading, the author will walk you through the most unusual and gorry murders. Very unique. I found a new favorite writer!\"Alicia DriesAmazon ReviewerIf you are a fan of characters such as Alex Cross and Hannibal or movies like \"7\" and Saw, The Darc Murder Mystery Collection is sure to shock and satisfy.**If you were looking for more of McCray's crime stories check out her anthology,  it's under \nDown & Dirty\n**If you were looking for her #1 Hard Boiled/Police Procedural series check under \nThe Harbinger Collection\n**If you were looking for McCray's lastest murder mysteries check under \nThe Nursery Rhyme Murders\n and the\n Empty Crib Thriller\n collection.",
  "genres": [
    "Mystery",
    "Thriller",
    "Amazon",
    "Fiction",
    "Mystery Thriller",
    "Horror",
    "Suspense"
  ],
  "author": "Carolyn McCray",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/18817217-darc-murders-collection"
}