{
  "title": "A Pound of Flesh",
  "description": "\"Through a combination of tight, well-structured plots and fully realized characters, Chesser has emerged as one of the top indie writers in the business.\" Joe McKinney - Two-time Bram Stoker Award winner, and bestselling author of the Dead World series.A Pound of Flesh, Book 4 in the Surviving the Zombie Apocalypse, picks up on day 9 where “In Harm’s Surviving the Zombie Apocalypse” left off.Outbreak - Day 9. Reeling from a surprise attack, and with two fires burning out of control, Schriever Air Force Base goes on high alert. Former CDC Scientist Sylvester Fuentes, the apparent target, is killed along with others. Destroyed in the conflagration was the Omega antiserum Fuentes had been working to perfect and just hours prior had tested successfully on one of the recently infected.Meanwhile, returning prematurely from a mission to set off two nukes in the path of an advancing horde of living dead numbering several hundred thousand strong, and with his Delta Force commander Mike Desantos infected and dying from the Omega virus, Cade Grayson is forced to do something no friend should have to do.As the low rumble of the two nuclear detonations signaling the mission’s likely success rolls over Schriever, Delta Force Captain Cade Grayson begins formulating a plan that will send him hurtling on a collision course with the parties responsible for the terrorist attack.Six hundred miles away near Eden, Utah, Duncan Winters hopes to ride out the apocalypse in his brother Logan’s remote compound.In Jackson Hole, Wyoming, the New American capitol, Daymon Bush, former BLM firefighter, bides his time with one burning to find his girlfriend Heidi even if it eventually kills him.Will Cade successfully lobby President Clay and embark on a new mission in order to extract his pound of flesh for the loved ones he has lost?Will Brook and Raven continue to temper themselves against the horrors inherent to their new world?Will Daymon accomplish his goal and survive Jackson Hole?Will Duncan, his brother Logan, and their prepper friends prevail against the human jackals who are taking advantage of the end of days?Will the human race rise up and survive this extinction-level event?",
  "genres": [
    "Zombies",
    "Horror",
    "Apocalyptic",
    "Post Apocalyptic",
    "Dystopia"
  ],
  "author": "Shawn Chesser",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/18815124-a-pound-of-flesh"
}