{
  "title": "Zombie Spring's Trooper Tyree A First Sequel",
  "description": "Zombie Spring's Trooper Tyree is the first sequel to Zombie Spring published in 2012. This sequel continues the perilous adventures of Trooper Tyree and Hettie Younger from the first book's Chapter XII: First Blood LA. In that chapter, two veteran infantrymen were cut off from their unit and trapped in a Motel 6 by a large number of Undead. This was shortly before the H-Bomb was dropped on San Diego and the devastating mega earthquake that followed. These two soldiers, Trooper Tyree and Hettie Younger must survive the ravenous hunger of the Undead and live through the firestorm of man-made and natural disasters that completely destroy LA, while gathering together small bands of trapped infantrymen to rescue some school children just back from a field trip. ZSTT also continues the story of Lieutenant Shasta Maddy and her surviving gun crews that were forced to flee from Fire Base Indio in ZS Chapter XIV, Saga: The Song of Roland. You will discover a little bit more about the crooked politician Ben Arnold and his crusade against Trooper Tyree and his eventual election to the US Senate. Chris, Cowboy Buck Smiley Bellew, General Cartwright Jones, Albie Lincoln and Admiral Dewey round out this cast of interesting characters from the first book. There are many new and interesting characters introduced to ZSTT such as the elite soldiers Bluto, Chopper, Jericho, China and Pig Pen who will appear again in the second and final sequel due out in 2013. The final sequel will be called Zombie Spring's Roland Thomas Type IV, and it will feature Colonel Roland Thomas who was infected and killed in book one. Thomas becomes a Zombie trooper, but one with special abilities: A first of his kind and a game changer in the war against the Dead.To help people decide whether or not they might enjoy this book, I offer a profiler. I’ve never seen it done before on Amazon or Barnes and Noble. Here goes! ZS’s Trooper Tyree is a Zombie Lite version of the Zombie genre. Yes, it has plenty of gore and huge battles, but much of it is meant to be funny, and much of it is meant to teach a little history. It is not a dour world-view of what would happen. The content is centered around happy, upbeat young people, who think they can win out against all odds and maybe make a better life for themselves. If you like happy stories with a little romance interspersed with lots of military blood and guts, then you’re in the right place. So who might or might not enjoy this book? Fans of the movie, The Road, or the TV series, Walking Dead, might consider looking elsewhere for their entertainment because those shows are sad with a world view that all is lost and nothing will ever be the same again. If you liked Zombieland with Woody Harrelson, Abraham Lincoln vs. the Zombies, or Warm Bodies then you are more likely to have a nice evening pouring through these pages. Bruce Campbell, Woody Harrelson, and Brendan Fraser could be characters in this book. Matt Damon, Christian Bale, and Viggo Mortenson are great actors, but I think they’d pass on an offer to star in my series. For youngsters: Mild cursing, but no foul language or nudity. Bloody death and combat situations.",
  "genres": [],
  "author": "Chris Okusako",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/18827779-zombie-spring-s-trooper-tyree-a-first-sequel"
}