{
  "title": "The Devil Drives: A Life of Sir Richard Burton",
  "description": "\"Brilliant. . . . [Brodie's] scholarship is wide and searching, and her understanding of Burton and his wife both deep and wide. She writes with clarity and zest. The result is a first class biography of an exceptional man.\"―J. H. Plumb, New York Times Book Review Starting in a hollowed log of wood―some thousand miles up a river, with an infinitesimal prospect of returning! I ask myself \"Why?\" and the only echo is \"damned fool! . . . the Devil drives!\"So Richard Francis Burton, preparing for an exploration of the lower Congo in 1863, wrote to Monckton Milnes from the African kingdom of Dahomey. His answer, \"the Devil drives,\" applies not only to his geographical discoveries but also to the whole of his turbulent life.Burton was a true man of the Renaissance. He was soldier, explorer, ethnologist, archaeologist, poet, translator, and one of the two or three great linguists of his time. He was also an amateur physician, a botanist, a geologist, a swordsman, and a superb raconteur. He penetrated the sacred Muslim cities of Mecca and Medina at great risk and explored the forbidden city of Harar in Somaliland. He searched for the sources of the White Nile and discovered Lake Tanganyika.Burton's passion was not only for geographical discovery but also for the hidden in man. His enormous erudition on the sexual customs of the East and Africa, long confined by the pruderies of his time, finally found expression in the notes and commentary to his celebrated translation of the unexpurgated Arabian Nights .For this major biography of one of the most baffling heroes of any era, Fawn M. Brodie has drawn on original sources and a newly discovered collection of letters and papers.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Travel",
    "Africa",
    "Biography Memoir",
    "Adventure"
  ],
  "author": "Fawn M. Brodie",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/188291.The_Devil_Drives"
}