{
  "title": "Blank Canvas",
  "description": "Cassie thought she had the perfect costume for her friend's Halloween costume; she would be a living painting. Wearing a plain white coverall and carrying a box of paints, Cassie let her friends entertain themselves all night painting her-everywhere. All that touching and drinking has an effect, leaving her yearning for a more intimate touch, and her fiance, Don, is nowhere to be found. Enter Sonja and a mysterious, who seem to know just what Cassie needs. But when Don unexpectedly turns up at the party, Cassie fears her forbidden encounter will be discovered!+++Cassie drifted back into the house with a fresh beer and went downstairs again after finding the queue for the main floor powder room too long. She knew there was another bathroom in the basement and headed for it, but found a line of people three deep waiting to use that one as well. She decided to stay and wait and chatted up a friend while they awaited their turn. She was in line by herself when Sonja came around the corner and joined her.“Looks like you’ve been having a good time,” Sonja commented, eyeing up the gallery of their friends’ work adorning Cassie’s body. “You look like you’re out to have a good time,” Cassie teased, eyes flitting from Sonja’s breasts to her legs. The little sailor girl dress seemed to have been constructed around Sonja’s hourglass figure while she posed.“I think I could have a couple takers if I wanted.” Sonja put her hand on her cocked hip and ordered Cassie to turn so she could see it all. After Cassie completed a 360, Sonja added, “I’m glad you saved some room for me.”Cassie looked down at the coverall and wondered where her friend might find enough space to do more than add some squiggly lines. “If you can find a spot you’re more than welcome to add something.” Actually, she quite liked the idea of Sonja taking a paintbrush to her.“I know exactly what I want to do.” She knelt down beside Cassie with a quick flash of white satin panties. In that position Sonja’s skirt did not quite meet her stocking tops.Sonja took her hand and pulled her down the hallway and into a child’s playroom. Dolls and blocks were scattered around the floor and Cassie almost twisted her ankle stepping on a Brio block. There was a short, plastic play table with a big bright orange beanbag chair beside it, which Sonja deposited her in when she stumbled. Sonja took the box of paints from Cassie’s waist and set it on the play table.“Ooookkayyy…” Cassie said, giggling. Just what was Sonja up to?“I’m glad you saved the best for last,” Sonja said, uncapping all the paints and taking up the paintbrush. She dipped it into the black, which was nearly depleted, and pushed Cassie back so she was flatter on the beanbag chair. “Now spread your legs,” she ordered. “What are you doing?” Cassie asked, leaning forward so she could look down her own body...",
  "genres": [
    "Adult"
  ],
  "author": "Kirsten McCurran",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/18833697-blank-canvas"
}