{
  "title": "Wolfskin",
  "description": "All young Eyvind ever wanted was to become a great Viking warrior--a Wolfskin--and perform honorable deeds out in the name of his War fathergod, Thor. He can think of no future more glorious. And the chance to make it happen is his when his older brother Ulf is brought the tale of a magical land across the sea, a place where men with courage could go to conquer a land and bring glory to themselves. They set out to find this fabled land and discover a windswept and barren place, but one filled with unexpected beauty and hidden treasures... and a people who are willing to share their bounty.Ulf's new settlement begins in harmony with the natives of the isles led by the gentle king Engus. And Eyvind finds a treasure of his own in the young Nessa, niece of the king, seer, and princess. His life will change forever as she claims his heart for her own.But someone has come along to this new land who is not what he seems. Eyvind's heartfriend, Somerled, the strange and lonely boy Eyvind befriended so long ago has a secret--and his own plans for the future. The blood oath that they swore in childhood binds them in lifelong loyalty, and Somerled is calling in the debt of honor. What he asks might just doom Evyind to kill the only thing that he has ever truly loved.Will the price of honor create the destruction of all that Eyvind holds dear?Critically acclaimed fantasist Juliet Marillier returns with the start of a new fantasy saga, a wonderful love story set amidst high adventure. Wolfskin is a lush tale of the clash between the warlike Norsemen and the mysterious and magical people who live at the top of the world in the land that will become Scotland--and it is the story of the man and woman who forge a bond that will remake their world.",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Historical",
    "Historical Fantasy",
    "Adult"
  ],
  "author": "Juliet Marillier",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/1882830.Wolfskin"
}