{
  "title": "Fate and Fury",
  "description": "Readers in 40 countries voted for the UtopYA 2013 awards! The Grey Wolves Series was voted winner of Best Supernatural Series of the Year! ★★★★★This series is full of hot alpha males and a group of crazy lol funny female BFF's. Seriously people think Chealsa Handler meets Tina Fey, that's how hard I've laughed at times in this series. Fate and fury is book 6!!! If you haven't even read book one STOP reading this now, and go to your nearest kindle/nook site to get started. ~Wine Relaxation and MY Kindle FOR THE LOVE OF ALL THINGS BOOKS!!!! Blog Desdemona, the witch whose evil is only matched by her power, threatens to destroy the Romanian and Serbian packs. The powerful males that would stand against her, including the Alphas, Vasile and Decebel, are trapped in the In Between enduring living nightmares and suffering beyond what any human is capable. If they can't escape soon, they will be driven mad, and their wolves will become feral, overtaking the human's ability to control them once and for all. Peri, the ever-courageous high fae, leads a contingent of female wolves through the rough Carpathian Mountains, searching for a way to break the seal Desdemona has placed upon the veils to the fey realm. If she doesn't, victory against Desdemona will be out of reach. Finally, the high fae council has realized they've sat on the sidelines for far too long. They've sent representatives to the far corners of the globe, meeting with the pack Alphas. The fey must convince the Alphas of every pack to lay aside their petty territorial squabbles and battles of dominance and join the fight against Desdemona if they are to have any chance for survival. But will the wolves be able to swallow their respective pride long enough to unite against the powerful witch?  What readers are  ★★★★★There aren't even words for how much I love this series. Verified Purchase ~TWMissy ★★★★★Quinn you have did it again I read this book in 1 day I could not put it down!!! Verified Purchase ~Reily ★★★★★What words could I possibly put together to describe my sheer enjoyment of this series from the very start with book one. Each book so powerful it draws the reader in further and further into their world until until you reach the last page and mourn the lost of no more pages until Loftis writes the next chapter! Verified Purchase ~Debra",
  "genres": [
    "Paranormal",
    "Young Adult",
    "Fantasy",
    "Werewolves",
    "Romance",
    "Shapeshifters",
    "Paranormal Romance"
  ],
  "author": "Quinn Loftis",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/18831359-fate-and-fury"
}