{
  "title": "Blinde Verführung",
  "description": "- Liebesroman - Die junge Konditorin Marlene ist schon langer Single und wagt nur selten von der grossen Liebe zu traumen. Doch eines Tages, mitten im Sommer, besucht der blinde Kunstler Patrick ihr Cafe und stellt ihr Leben binnen kurzester Zeit grundlich auf den Kopf. Trotz seiner Behinderung ist er ein aufgeschlossener, lebenslustiger Mensch, der Marlenes Zuruckhaltung auf charmante Art umgeht und sie in seine sinnliche, keineswegs dustere Welt entfuhrt. Eine zarte Sommerromanze beginnt, die Marlene in jeder Hinsicht aufbluhen lasst. Ihre von Tag zu Tag wachsende Zuneigung zu Patrick ist wie ein klingender Farbenrausch ... der allerdings nicht ohne Katerstimmung kommt. Die Konkurrenz schlaft nicht, vor allem, wenn diese Konkurrenz ein bildhubsches, zu allem entschlossenes Model ist. Marlene wachst an der Herausforderung, doch am Ende muss sie sich entscheiden, ob die Liebe zu Patrick es wert ist, dafur ihr Leben zu riskieren ... Auszug: Komm rein,\" sagte er schliesslich leise. Du hast dir ein schones Abendessen verdient.\" Patrick legte ihr einen Arm um die Schultern und fuhrte sie in die Kuche. Meine Haushalterin hat schon alles vorbereitet, wir mussen nur noch das Fleisch in die Pfanne hauen und die Beilagen aufwarmen.\" Klingt grossartig,\" sagte Marlene dankbar. Sie legte ihre Handtasche auf die Bar und nahm von Patrick eine Auflaufform mit rohem Gemuse und ein kleines Blech mit Susskartoffelscheiben entgegen. Ein Zettel am Kuhlschrank erklarte, bei welcher Temperatur beides in den Ofen musste. Als das erledigt war, schrieb sie ihre SMS an Kelly und Patrick offnete eine Flasche Wein. Schon, dass du hergefunden hast,\" sagte er und stiess mit ihr an. Finde ich auch,\" erwiderte sie. Tut mir nur leid, dass es so plotzlich kam.\" Er lachelte auf seine unwiderstehliche Art. Das braucht es nicht.\" Er nahm einen Schluck aus seinem Glas und stellte es dann ab. Ehrlich gesagt,\" er zog sie an einer Hand in seine Arme, habe ich das ganze Wochenende uberlegt, wie ich dich moglichst schnell wiedersehen kann.\" Marlenes Herz tat einen Hupfer in ihrer Brust. Gleich darauf neigte Patrick seinen Kopf und erforschte wieder ihr Gesicht, diesmal mit seiner Nasenspitze, den Wangen und seinen uberaus neugierigen Lippen. Noch nie zuvor hatte Marlene sich so umworben gefuhlt. Jede einzelne von Patricks Liebkosungen loste ein leises Schaudern aus, ein warmes, uberaus angenehmes Kribbeln, das vom Scheitel bis zur Sohle und wieder zuruck kroch. Seine Hande hielten sie nur. Kein Streicheln lenkte von den zarten Beruhrungen in ihrem Gesicht ab, und genau so war es perfekt.\"",
  "genres": [],
  "author": "Romana Grimm",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18833793-blinde-verf-hrung"
}