{
  "title": "Dream Weaver",
  "description": "Vampires sparkled through the spotlight. Then, the zombies shambled through. Now, it's time for new immortals. DREAM WEAVER. A beautiful, atmospheric love story that is dark science fiction meets teen fantasy. Nickolas Benedetti is a Dream Weaver, an ancient, arcane and almost immortal race with the power to cull and control memories and dreams. Nick plunges heart-first into tragedy-torn Emari Sweet's dark and nebulous life to save her from herself...And finds his heart irretrievably entangled with hers. Nick leads Emari out of her darkness, but can he save her from the real, living, breathing nightmares have followed him to her doorstep?  5 Star Review by Anne Boling for Readers' FavoriteIf I could only use one word to describe Dream Weaver by Su Williams it would be SUPERB. Luckily I get to use more than one. Dream Weaver is an unusual tale, part YA fantasy, part paranormal, part romance, part horror and part supernatural. When you roll all those genres into one you have a book you can't put down. I started reading this book yesterday afternoon and finished it around 3 this morning. I'm usually a very fast reader but I found I wanted to read slowly to savor the exquisite moments of pleasure this book offers. Dream Weaver is Su Williams' first novel. I certainly hope it is not her last. Dream Weaver could easily be expanded into a whole series of books. The ending is a bit of a cliffhanger, leading me to believe she has more books in mind. I've always been curious about the Nephilim, the descendants of angels and love the idea of an expanded series of books on the topic, even if it is all fiction. This is a series fans of fantasy will not want to miss.",
  "genres": [
    "Young Adult",
    "Paranormal",
    "Fantasy",
    "Amazon",
    "Romance",
    "Young Adult Paranormal",
    "Fiction"
  ],
  "author": "Su Williams",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/18843605-dream-weaver"
}