{
  "title": "The Ripple Trilogy",
  "description": "Get all three books about a girl who can turn invisible, the boy she's crushing on, and the neo-Nazi geneticists after them both. Includes bonus content: Will's Killer Pizza Recipe and a sneak peak at Cidney Swanson's Saving Mars series.Book One: RipplerWhen Samantha Ruiz turns invisible in front of team mates while rafting, she knows something's wrong. According to her knowledgeable friend Will, she's got a rare genetic disorder. Fearing a lifetime sentence as a lab-rat, Sam wants to keep her ability secret. But she also wants to know if there's a connection between dark Nazi experiments on others like her and her own mother's death eight years earlier. At the same time that Sam is sleuthing, she's falling hard for Will. And soon, she'll have to choose between keeping her secrets hidden and keeping Will safe.Book Two: ChameleonSam's troubles are growing. The crush who kissed her seems to have changed his mind. Her BFF thinks Sam is in an abusive relationship. And the evil geneticist who wanted Sam dead now wants her ALIVE. When Sam learns of Helmann's Nazi-like plan to re-establish a Thousand-Year Reign, she's determined to fight him. Along with Will and Mickie, Sam flees to France to meet Sir Walter--their best hope for stopping Helmann's brave new world. But someone invisible follows her to Paris, and now Sam must figure out how to hide from an enemy she can't even see.Book Three: UnfurlAgainst all expectations, Sam has survived attacks by two of Helmann's deadliest assassins. She's alive, but she's far from safe. Helmann is planning a second Holocaust and wants Sam to play a starring role. Will, now separated from Sam by an ocean, seeks a way to prevent Helmann's apocalypse. Along with Sir Walter and Mickie, Will plays a deadly game sneaking into Geneses' facilities, discovering unsettling clues as to Helmann's plans. The clock ticks down as Will and Sam discover just how much they must be willing to sacrifice to stop Helmann. UNFURL, the powerful conclusion to The Ripple Series, will leave fans breathless.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Paranormal",
    "Science Fiction",
    "Romance",
    "Amazon",
    "Fiction"
  ],
  "author": "Cidney Swanson",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/18841307-the-ripple-trilogy"
}