{
  "title": "The Perfect Question",
  "description": "Angeline Fortin explores the world of the MacKintosh clan in this much-requested prequel to her Questions for a Highlander series. Captain Richard MacKintosh returned from Egypt wounded, not only in body but also in spirit, after making a daring getaway from the rebel band that held him and his military unit captive for months. However, though he had escaped, his brother, Vincent; friend, Jason; and the rest of his unit had been retaken. Forced back to England to recover, Richard is determined to use that time to force the government to garner their forces to search all of Egypt if necessary for his brothers-at arms still lost in the desert.He wanted – no, needed! – to spend each waking moment finding the help he needed and nothing was going to make him lose focus on that goal. That was until he ran into an angelic face from his past. One Lady Abygail Merrill. Abby had once been a brash, bossy tomboy who trailed along after him as a child. He had treated her as a friend, as yet another younger brother, but the lovely sophisticated woman he found in her place stirred anything but brotherly feelings.Richard finds in Abby a welcome haven against the storm of disappointment raging around him. A sympathetic ear and a comforting embrace. It becomes too easy to lose himself in her welcoming arms.But like him, Abby has her own demons to overcome before she can be free to love him. An accident years before had left her scarred, her natural self-confidence lost to the scornful eyes and words of the ton. She is but a shadow of the impetuous lass she’d been. However, Richard’s return has roused in Abby possibilities she thought long dead. All the hopes and fantasies that she’d held for most of her life are suddenly alive once more with promise. Richard genuine admiration recalls Abby to the girl she was once was and guides her back to the woman she was meant to be. Abby would do anything for the man she has long loved and knows that if she wants a life of her dreams with Richard, she must first help free him from the past.But once he is free to love her, will there be a future left for them to share?",
  "genres": [
    "Historical",
    "Historical Romance",
    "Romance",
    "Historical Fiction"
  ],
  "author": "Angeline Fortin",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/18839238-the-perfect-question"
}