{
  "title": "A Southern Girl",
  "description": "Set against the exquisite historical backdrop of Charleston's insular South of Broad neighborhood, A Southern Girl is a tale of international adoption and of families lost, then found anew through revelations, courage, and the perseverance of a love without bounds. With two biological sons and a promising career, Coleman Carter seems set to fulfill his promise as a resourceful trial lawyer, devoted husband, and dutiful father until his wife, Elizabeth, champions their adoption of a Korean orphan. This seemingly altruistic mission estranges Coleman's conservative parents and demands that he now embrace the unknown as fully as he has always entrenched himself in the familiar. Elizabeth, a self-proclaimed liberal with a global sense of duty, is eager for the adoption, while Coleman, a scion of the Old South, is at best a reluctant participant. But the arrival of Soo Yun (later called Allie) into the Carter household and the challenging reactions of Coleman's peers and parents awakens in him a broadening sense of responsibility and dedication to his new family that opens his eyes to the subtle racism and exclusionary activities that had dominated his sheltered life. To garner Allie's entrance into Charleston society, Coleman must come to terms with his past and guide Allie toward finding her own origins as the Carters forge a new family identity and confront generations-old fears inherent in Southern traditions of purity and prestige.Deftly told through the distinctive voices of Allie's birth mother, her orphanage nurse, her adoptive mother Elizabeth, and finally Coleman himself, A Southern Girl brings us deeply into Allie's plights--first for her very survival and then for her sense of identity, belonging, and love in her new and not always welcoming culture. In this truly international tale, John Warley guides us through the enclaves of southern privilege in New Hampton, Virginia, and Charleston, the poverty-stricken back alleys of Seoul, South Korea, the jungles of Vietnam, and the stone sidewalks of San Miguel de Allende, Mexico, as the bonds between father and daughter become strong enough to confront the trials of their pasts and present alike.The first release from Pat Conroy's Story River Books, A Southern Girl includes a foreword by New York Times bestselling novelist Therese Ann Fowler.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Southern"
  ],
  "author": "John Warley",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/18841650-a-southern-girl"
}