{
  "title": "Flashlight",
  "description": "Named an NPR Best Book of the Year and Junior Library Guild Selection, this wordless storybook with stunning illustrations aims to lighten the fear of the dark and the noises that come with it.\" Flashlight allows readers to experience the wonder and excitement of nighttime exploration in the woods and wordlessly entices readers to explore the hidden nature outside their own homes.\"— The Busy LibrarianInside the tent it's cozy, but what is going on outside? Is it dark? Is it scary? Not if you have your trusty flashlight!In this charming story, told solely through images, artist Lizi Boyd offers an enchanting exploration of night, nature, and the nocturnal world. One boy's camping adventure gets even better when he shines a light into the shadows and finds all sorts of nighttime creatures, fascinating insects, plants, trees, and streams—all brilliantly illuminated in the beam of his flashlight.Both lyrical and humorous, this visual poem—like the flashlight beam itself—reveals there is magic in the darkness. We just have to look for it.​INSPIRES THE Camping books for kids are usually filled with how-to guides or campfire stories. Flashlight is a unique children's book that captures the special magic of a camp-out through artwork that makes the moonlight-touched backyard forest come to life.SEEK-AND-FIND Though not a typical search-and-find book, Flashlight 's pages reveal beautiful details that readers can return to again and again to study and explore.APPEALING FOR RELUCTANT AND EARLY Wordless stories like Aaron Becker's Journey and complete Wordless Trilogy; David Wiesner's Flotsam , Tuesday , and many other titles; and Tomie dePaola's Pancakes for Breakfast offer young or reluctant readers the chance to explore books in a way that can establish a positive connection to reading.Perfect",
  "genres": [
    "Picture Books",
    "Childrens",
    "Animals",
    "Nature",
    "Fiction",
    "Adventure",
    "Juvenile"
  ],
  "author": "Lizi Boyd",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/18851166-flashlight"
}