{
  "title": "The Wrong Carlos: Anatomy of a Wrongful Execution",
  "description": "In 1989, Texas executed Carlos DeLuna, a poor Hispanic man with childlike intelligence, for the murder of Wanda Lopez, a convenience store clerk. His execution passed unnoticed for years until a team of Columbia Law School faculty and students almost accidentally chose to investigate his case and found that DeLuna almost certainly was innocent. They discovered that no one had cared enough about either the defendant or the victim to make sure the real perpetrator was found. Everything that could go wrong in a criminal case did. This book documents DeLuna's conviction, which was based on a single, nighttime, cross-ethnic eyewitness identification with no corroborating forensic evidence. At his trial, DeLuna's defense, that another man named Carlos had committed the crime, was not taken seriously. The lead prosecutor told the jury that the other Carlos, Carlos Hernandez, was a \"phantom\" of DeLuna's imagination. In upholding the death penalty on appeal, both the state and federal courts concluded the same thing: Carlos Hernandez did not exist.The evidence the Columbia team uncovered reveals that Hernandez not only existed but was well known to the police and prosecutors. He had a long history of violent crimes similar to the one for which DeLuna was executed. Families of both Carloses mistook photos of each for the other, and Hernandez's violence continued after DeLuna was put to death. This book and its website (thewrongcarlos.net) reproduce law-enforcement, crime lab, lawyer, court, social service, media, and witness records, as well as court transcripts, photographs, radio traffic, and audio and videotaped interviews, documenting one of the most comprehensive investigations into a criminal case in U.S. history.The result is eye-opening yet may not be unusual. Faulty eyewitness testimony, shoddy legal representation, and prosecutorial misfeasance continue to put innocent people at risk of execution. The principal investigators conclude with novel suggestions for improving accuracy among the police, prosecutors, forensic scientists, and judges.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Disability Studies",
    "Society",
    "Education",
    "Biography",
    "Crime"
  ],
  "author": "James S. Liebman",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/18847885-the-wrong-carlos"
}