{
  "title": "She Owns the Knight",
  "description": "PG-RATED FUNWhy does she have to travel seven hundred years through time to find a decent guy?Brokenhearted Gillian Corbett finally finds the knight of her dreams...in the past. Unfortunately he’s bossy, overbearing, and...betrothed! Fortunately, he thinks she is his affianced, which keeps her from garderobe duty. Or worse, being hanged as a spy. She knows she has to get back to her own time before his real fiancé shows up and the truth is discovered, but until she finds a way, she’s going to squeeze every bit of enjoyment she can out of this situation. As far as she’s concerned, this is one relationship in which she gets to call the shots, not the other way around. The dowry provided by his betrothed bought him, lock, stock, and barrel. She’ll gladly whip him into shape for the girl who ends up with him. No thanks required. In the meantime, Jillian owns him, and as every twenty-first century girl knows...ownership has its privileges.Why can’t he find a lady who is obedient, submissive...or at least not trying to kill him?After a horrible first marriage that ended badly, Sir Kellen Marshall is determined to protect what is left of his dreams. He needs an heir, an alliance, and a chaste bride who has never loved another. Would that he’d been choosier in his specifications because what he’s ended up with is a loud, bossy, demanding female who will drive him daft at every opportunity. So why does he feel he’d like to lay the world at her feet if she’d simply give him the chance?When modern meets medieval, can there be a happily ever after?# OF PAGES Approximately 440 pages. (110,000 words)  OTHER BOOKS BY DIANE DARCY: Serendipity, She’s Just Right, Once in a Blue Moon, The Christmas Star, A Penny for Your Thoughts.",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical Fiction",
    "Historical Romance",
    "Fantasy",
    "Historical",
    "Medieval"
  ],
  "author": "Diane Darcy",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/18848585-she-owns-the-knight"
}