{
  "title": "In Too Deep",
  "description": "Love small town contemporary romance with an unforgettable cast of characters? Each book in the Due South series contains a sizzling, sexy love story set on an unspoilt, wild island in New Zealand. Meet Piper and West... She vowed never to return. To save her brother from financial ruin, Piper Harland must do the one thing she swore she'd never do-return to the tiny island hometown where Ryan \"West\" Westlake crushed her heart. Piper is tough, resilient and a little wild-much like the remote and beautiful Stewart Island where she grew up. As a cop who's part of the elite New Zealand Police National Dive Squad, bringing the dead back to their families still doesn't stop the guilt she feels over her father's drowning death. Now nine years later she's obligated to return to a hostile community as the outsider, and forced to work with the man who was once her best friend and first lover. She's a risk he can't take. West is an Island man, through and through. As owner of the local pub, he lives and breathes the local community, and sure as hell can't imagine living anywhere else. But most of all he refuses to ever fall for a woman like his flighty mother. He lost Piper once to give her the chance to fulfil her dreams of becoming a cop. But now she's back for an unexpected six week visit to help her brother-his best mate. Maybe West wants her a little bit, maybe he can't resist the temptation to tease and touch her, but can he fall in love with such a flight risk? Saying goodbye for the second time might just destroy them both. Fresh...Seductive...Heart-warming... Everything you want in a contemporary romance-plus enough steaminess to make your toes curl! Intended for mature 18+ aged readers. The Due South Series: Book 1: In Too Deep. Featuring Piper and West. A smoking hot reunion which may lead to a second chance for them both... Book 2: Melting Into You. Featuring Kezia and Ben. Can this widowed single mom and the stubborn but sexy single dad ever make one big happy family? Book 3: Ready To Burn. Featuring Shaye and Del. Two chefs, one workplace where things get seriously overheated-and a sizzling enemies to lovers romance. Book 4: Christmas With You. Featuring Carly and Kip. A New Zealand holiday romance where becoming friends with benefits can sometimes make the sexiest Christmas present of all...",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "New Adult",
    "Fiction",
    "Chick Lit",
    "Adult"
  ],
  "author": "Tracey Alvarez",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/18846728-in-too-deep"
}