{
  "title": "The Life of a Banana",
  "description": "Longlisted for The Baileys Women's Prize for FictionXing Li is what some Chinese people call a banana - yellow on the outside and white on the inside. Although born and raised in London, she never feels like she fits in. When her mother dies, she moves with her older brother to live with venomous Grandma, strange Uncle Ho and Hollywood actress Auntie Mei. Her only friend is Jay - a mixed raced Jamaican boy with a passion for classical music.Then Xing Li's life takes an even harsher turn: the school bullying escalates and her uncle requests she assist him in an unthinkable favour. Her happy childhood becomes a distant memory as her new life is infiltrated with the harsh reality of being an ethnic minority.Consumed by secrets, violence and confusing family relations, Xing Li tries to find hope wherever she can. In order to find her own identity, she must first discover what it means to be both Chinese and British.'PP Wong has blazed a trail for future British Chinese novelists. The Life of a Banana is bursting with original and exciting flavours.' Ben Chu, The Independent, UK 'Life Of A Banana is so refreshingly distinct. Read it, and you will soon find yourself wanting more.'The Daily Mail, UK  'Revealing in its exploration of cultural and generational conflicts and moving in its optimism.' The Guardian, UK 'Speaks volumes...an engaging read.' The Star, Malaysia ‘Impeccably observed, often hilarious, and deeply moving... pitch-perfect.’ David Henry Hwang, Tony Award-winning writer of M.Butterfly ‘Brought back happy memories of Sue Townsend’s Secret Diary of Adrian Mole.’ Lord Wei, House of Lords UK 'I know we are barely halfway through the year but I'm calling it: BEST book of 2014.' Love is a State of Mind 'Wong has created a real barnstormer of a novel that deserves to be on several of the 2014/15 awards lists. It’s definitely getting a place in my Top Ten.' If These Books Could Talk",
  "genres": [
    "Fiction",
    "Young Adult",
    "Contemporary",
    "China",
    "Asian Literature",
    "Book Club",
    "Coming Of Age"
  ],
  "author": "P.P.  Wong",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/18854714-the-life-of-a-banana"
}