{
  "title": "Bayou Heat Collection One",
  "description": "6 Gorgeous Puma Shifters, 6 Sexy Stories...The Bayou Heat Collection One includes the following six bestselling paranormal romance titles by Alexandra Ivy and Laura Wright:RAPHAEL/PARISHBAYON/JEAN-BAPTISTETALON/XAVIERAuthor Note: Each title can be purchased individually or as a box set.120,000 words.A USA Today Bestseller!New Year. New World. New Species.In the depths of the bayous lives a secret race of puma shifters. The creation of a powerful magic, they have lived in peace until the threat of extinction drives them to seek the world beyond their homelands. Now the Pantera must discover the answer to their dying magic and halt an ancient enemy before it can destroy them all. RAPHAELThe brilliant and dangerous diplomat of the Pantera shapeshifters, Raphael has devoted his life to discovering the key to the infertility that is threatening the extinction of his puma race. Creating a vast network of spies worldwide, he never expected to discover that the answer might be beneath his very nose. But when Ashe, a beautiful human female, crosses his path, his most primitive instincts are stirred. Unable to resist, he takes her to his bed, and is shocked when she becomes pregnant with his child. PARISHUntamed and undeniably sexy, Parish, leader of the Pantera hunters, rarely leaves the magic of the Wildlands to deal with the humans he despises. But with the prized and risky Pantera birth on the way, puma shifter, Parish must travel to New Orleans to find and bring back a human doctor. The moment he sees the lovely, talented and all too human Dr. Julia Cabot he cannot resist the wild, potent drive to make her his. Betrayed and destroyed by love, Julia will not let her heart choose her path again. But as she and Parish fight to save the life of an unborn child, a fierce and overwhelming bond develops between them.BAYONCharming, drop-dead gorgeous Hunter Bayon is thirsting for revenge on the enemies who slipped into the Wildlands and attacked Ashe and her vulnerable child. Pledging to track down the cowards, Bayon goes on the hunt, pursuing the humans to a nearby town. But searching their shabby hideaway, he makes a discovery that shocks him to his very soul and might very well destroy the heart of the Pantera.JEAN-BAPTISTETattooed and pierced, sexy Nurturer Jean-Baptiste has been living in utter isolation. His cat is out of control, and the only thing that soothes the beast is a rare mineral he keeps inking into his skin. Until he meets her: Genevieve Burel. The beautiful and buttoned-up female puma is unlike anyone he's ever met. She makes his cat purr, and he knows he must possess her, mate with her. TALONAfter the tragic death of his parents when Talon was young, he’s dedicated his life to protecting the Pantera. To the strikingly gorgeous man, loyalty and honor mean everything. So it’s no surprise that he’s determined to treat Isi Rousseau as the enemy. If the elders believe she is a danger then he will do whatever necessary to prevent her from destroying his beloved Wildlands. But discovering the delicate beauty sleeping in his bed, Talon discovers his noble intentions wavering. The female, with short, jet black hair streaked with blue, and a pair of dark eyes, might act tough, but it’s obvious to him that she’s as desperate as he is for a place to call home. More importantly, her presence is helping keep Ashe and her baby alive. XAVIERThe drop-dead gorgeous leader of the Geeks, Xavier has one goal: find the human male his enemies seek. Devoted to his work, and to the Pantera, there is nothing that can distract him from accomplishing his goal.",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Fantasy",
    "Shapeshifters",
    "Magic",
    "Erotic Romance"
  ],
  "author": "Alexandra Ivy",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/18852524-bayou-heat-collection-one"
}