{
  "title": "Seven Deadly Wonders",
  "description": "Matthew Reilly, the \"New York Times\" bestselling author and \"pedal-to-the-metal action novelist Publishers Weekly, is back in high gear on the greatest treasure hunt of all time -- a headlong race to find the Seven Wonders of the Ancient World. In ancient times, a Golden Capstone was placed atop the Great Pyramid at Giza during a rare solar event called the Tartarus Rotation. Once every 4,500 years, a superhot sunspot -- the Tartarus Sunspot -- aligned itself with Earth and caused immense worldwide flooding and sun-scorching. It is said that when the Capstone sat atop the Great Pyramid, no such flooding or solar damage occurred. And, according to legend, whosoever places the Capstone on the pyramid at the next Tartarus Rotation will gain absolute power over Earth for the next 1,000 years. In 2006, the Tartarus Rotation will come again, but the Capstone is nowhere to be found.With the fate of global dominance hanging in the balance, nearly every world power sends forth its troops to locate the Capstone. Among them are the United States, the European Union, Israel, ruthless terrorists, and one other unusual a coalition of seven smaller nations that have decided that the Capstone is too powerful for any one country to hold.So they band together against all odds and send an eight-man team to take on all the great forces in the chase. Led by an Australian super-soldier named Jack West Jr., the team includes a Canadian professor, two crack Irish commandos (one of whom is female), a Spanish paratrooper, a Jamaican soldier, an Arab commando, and a daredevil New Zealand pilot. And with them always is a little girl named Lily, the ten-year-old daughter of the Oracle of Siwa-- one of only two people in the world who can decode an ancient text that leads to the Capstone.This stalwart group embarks on a global journey filled with booby-trapped mines, stupendous ancient wonders, gigantic evil forces, and adventure beyond imagination.From the Colossus of Rhodes to the Hanging Gardens of Babylon, from the Lighthouse at Alexandria to the Great Pyramid itself, fasten your seatbelts and hang on as the author of Ice Station and Scarecrow takes you on the adventure of your life!",
  "genres": [
    "Thriller",
    "Fiction",
    "Adventure",
    "Action",
    "Mystery",
    "Fantasy",
    "Mystery Thriller"
  ],
  "author": "Matthew Reilly",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/1885794.Seven_Deadly_Wonders"
}