{
  "title": "Tatiana",
  "description": "Arkady Renko, one of the iconic inves­tigators of contemporary fiction, has survived the cultural journey from the Soviet Union to the New Russia, only to find the nation as obsessed with secrecy and brutality as was the old Communist dictatorship. In Tatiana, the melancholy hero— cynical, analytical, and quietly subversive— unravels a mystery as complex and dangerous as modern Russia itself.  The fearless reporter Tatiana Petrovna falls to her death from a sixth-floor window in Moscow the same week that a mob billionaire, Grisha Grigo-renko, is shot and buried with the trappings due a lord. No one else makes the connection, but Arkady is transfixed by the tapes he discovers of Tatiana’s voice describing horrific crimes in words that are at odds with the Kremlin’s official versions.  The trail leads to Kaliningrad, a Cold War “secret city” that is separated by hundreds of miles from the rest of Russia. The more Arkady delves into Tatiana’s past, the more she leads him into a surreal world of wandering sand dunes, abandoned chil­dren, and a notebook written in the personal code of a dead translator. Finally, in a lethal race to uncover what the translator knew, Arkady makes a startling discovery that draws him still deeper into Tatiana’s past—and, paradoxically, into Russia’s future, where bulletproof cars, poets, corruption of the Baltic Fleet, and a butcher for hire combine to give Kaliningrad the “distinction” of having the highest crime rate in Russia.  More than a mystery, Tatiana is Martin Cruz Smith’s most ambitious and politically daring novel since Gorky Park. It is a story rich in character, black humor, and romance, with an insight that is the hallmark of a writer the New York Times has called “endlessly entertaining and deeply serious . . . [not merely] our best writer of suspense, but one of our best writers, period.”",
  "genres": [
    "Mystery",
    "Fiction",
    "Russia",
    "Crime",
    "Thriller",
    "Detective",
    "Mystery Thriller"
  ],
  "author": "Martin Cruz Smith",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/18854564-tatiana"
}