{
  "title": "Second Chance Summer",
  "description": "From the New York Times and USA Today bestselling author of The Love Game and Playing for Keeps is a story of hope and the beauty of getting a second chance at the kind of love that comes once in a lifetime…“You don’t get a love like ours and get to leave it behind.”Kia James was never meant to return to her hometown of Harlan Grove, Alabama… But she has.And Reese Pembleton was definitely not supposed to still be in love with her the way she is him… But he is. Last summer was the summer to end all summers. It was the summer they both fell in too deep to get out, and try as she might, Kia can’t deny that whatever was there between them a year ago is still there. If she’s honest with herself, there’s so much more there than there ever was, but the way her dad walked out six years ago has shattered her belief of that fairytale love every girl craves. Reese isn’t giving up so easily. His biggest mistake was not chasing after Kia the way he wanted to when she upped and left him without a word. Despite what she says, he knows her better than anyone, and he knows she still wants him the way he wants her. And this time, nothing will stop him from getting – and keeping – his girl. But nothing is that easy. When Kia’s dad arrives back in town, family secrets come tumbling out she never realized existed. Everything her mom has ever told her about the reason he left is a lie – but how can she trust the man who, by his own admission, didn’t fight for her as hard as he could have? With her past and present wants and needs colliding, Kia is thrown into the turmoil of the biggest decisions of her life. And she realizes, sometimes a second chance is all you need.",
  "genres": [
    "New Adult",
    "Contemporary",
    "Contemporary Romance",
    "Romance",
    "Young Adult",
    "College",
    "Second Chance Romance"
  ],
  "author": "Emma Hart",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/18856629-second-chance-summer"
}