{
  "title": "A Ship Without A Sail: The Life of Lorenz Hart",
  "description": "An unforgettable portrait of an exuberant yet troubled artist who so enriched the American songbook “Blue Moon, ” “Where or When, ” “The Lady Is a Tramp,” “My Funny Valentine,” “Isn’t It Romantic?,” “My Romance,” “There’s a Small Hotel,” “Falling in Love with Love,” “Bewitched, Bothered and Bewildered”—lyricist Lorenz Hart, together with composer Richard Rodgers, wrote some of the most memorable songs ever created. More than half a century after their collaboration ended, Rodgers & Hart songs are indispensable to the repertoire of nightclub singers everywhere. A Ship Without a Sail is the story of the complicated man who was Lorenz Hart. His lyrics spin with brilliance and sophistication, yet at their core is an unmistakable wistfulness. The sweetness of “My Romance” and “Isn’t It Romantic?” is unsurpassed in American song, but Hart’s lyrics could also be cynical, funny, ironic. He brought a unique wit and elegance to popular music. Larry Hart and Richard Rodgers wrote approximately thirty Broadway musicals and dozens of songs for Hollywood films. At least four of their musicals—On Your Toes, Babes in Arms, The Boys from Syracuse, and Pal Joey— have become classics. But despite their prodigious collaboration, Rodgers and Hart were an odd couple. Rodgers was precise, punctual, heterosexual, handsome, and eager to be accepted by Society. Hart was barely five feet tall, alcoholic, homosexual, and more comfortable in a bar or restaurant than anywhere else. Terrified of solitude, he invariably threw the party and picked up the check. His lyrics are all the more remarkable considering that he never sustained a romantic relationship, living his entire life with his mother, who died only months before he died at age forty-eight. Gary Marmorstein’s revelatory biography includes many of the lyrics that define Hart’s legacy—those clever, touching stanzas that still move us or make us laugh.",
  "genres": [
    "Biography",
    "Music",
    "Nonfiction",
    "History",
    "Music Biography"
  ],
  "author": "Gary Marmorstein",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/18857868-a-ship-without-a-sail"
}