{
  "title": "The Story of You and Me",
  "description": "Alternate cover edition for ASIN B00F9UOO2QMy name's Sophie Priebe and I’m nineteen-years-old. I planned on college, keggers and cute guys—not multiple sclerosis. Yes, my Nana’s had it for decades, but it skipped over my mom. After my diagnosis people treated me differently—so I stopped talking about it and kept it secret. Meanwhile I researched treatments, possible cures—and now I have hope. I traveled thousand of miles to L.A. to find healing: from stem cell studies to alternative medicine like acupuncture and shamanic vision quests. Some treatments could be dangerous: but I’ll try anything because my stakes are high—life and death. I'll risk everything—except for love. I don’t have time for love. But my Nana always told me, “Life, the fates, or God has a funny way of messing with one’s best-laid plans…\" My first night in L.A. I landed in the middle of a campus bar fight and a few beer bottle splinters cut my face. The most beautiful young man I've ever met, Alejandro, took me to the ER, chauffeured me to my new apartment and even washed my beer-drenched hair. He and his friends are Drivers: volunteers who drive students who've partied too hard. My second day I got lost in a dicey part of town and was attacked by gang-bangers. I was lucky—I escaped—this time. While L.A.’s filled with glamour, mansions and celebrities—it’s also infested with folks who would happily take advantage of a new girl. So I hired Alejandro to drive me to my appointments. He became my un-official bodyguard. He took me to healers in beach towns, mountains and deserts. He invited me to BBQs, and included me with his family and friends. He made me laugh again. My heart started cracking open… I wish I had told him my secret. When I discovered—he hadn't yet told me his... A Story of Hope. A Story of Love. A Story of Redemption.",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary Romance",
    "Novella",
    "Young Adult",
    "Contemporary",
    "Disability"
  ],
  "author": "Pamela DuMond",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/18867512-the-story-of-you-and-me"
}