{
  "title": "ESV Gospel Transformation Bible",
  "description": "The apostle Paul summed up his whole ministry as existing \"to testify to the gospel of the grace of God\" (Acts 20:24). That single-minded goal is the heartbeat of the ESV Gospel Transformation Bible. Produced out of the conviction that the Bible is a unified message of God's grace culminating in Jesus, it is a significant new tool to help readers see Christ in all of Scripture, and grace for all of life.The Gospel Transformation Bible features all-new book introductions and gospel-illuminating notes written by a team of over 50 outstanding pastors and scholars. This specially prepared material outlines passage-by-passage God's redemptive purposes of grace that echo all through Scripture and culminate in Christ. The notes not only explain but also apply the text in a grace-centered way. Focusing on heart transformation rather than mere behavior modification, their points of application emphasize the Hows and Whys of practical application to daily living--in short, how the gospel transforms us from the inside out.The Gospel Transformation Bible is available in a wide variety of print and digital formats. Moreover, every print edition comes with free access to the Online Gospel Transformation Bible, hosted at ESVBible.org.The Gospel Transformation Bible will equip both new and seasoned believers with a gospel-centered reading of Scripture, enabling God's people to see that the message of the Bible is a unified one--\"to testify to the gospel of the grace of God.\" Black letter text Double-column, paragraph format Book introductions Gospel transformation study notes Introductory essay Concordance 80,000 cross-references Free access to the Online Gospel Transformation Bible",
  "genres": [
    "Christian",
    "Reference",
    "Religion",
    "Faith",
    "Nonfiction"
  ],
  "author": "Anonymous",
  "average_rating": "4.77",
  "url": "https://www.goodreads.com/book/show/18868339-esv-gospel-transformation-bible"
}