{
  "title": "Never Work Again: Work Less, Earn More and Live Your Freedom",
  "description": "Never Work Work Less, Earn More and Live Your FreedomWelcome to a very different kind of business book.Never Work Again shows you how you can build a successful and profitable business without the long hours and high stress that most entrepreneurs suffer from.Trust me – I’ve been there and it’s not fun. In the months after I started my first business I didn’t know any better. My business was making me ill, but I was too wrapped up in what I was doing to spot the signs let alone to do anything about it. That is until the day I found myself on a London tube train begging a stranger to call me an ambulance and thinking I was going to die. That was my wake-up call. Luckily I got a second chance.That day I realised that life is short and precious and I made a decision that if I pulled through I was going to do things differently. I decided to restructure my business efforts so that I could live life to the full.What I decided to create for myself A business that I could be proud ofThe financial freedom to live the life of my dreamsThe time freedom to do the things I love and to be with the people who matter most to meAnd now I want to help you do the same.After all, deciding to start your own business is something you do because you have a vision of a better life for you and your family. It’s your chance to take control and live life on your terms. And done right it will give you the financial freedom and the time freedom to do the things you love, when you want to do them and with the people who matter most in your life.Never Work Again will show you how to create a great online business that gives you the time to work on your own passions in life.In short, a business that allows you to work less and earn more.Never Work Again shows you how you can easily start your own no-money down virtual online business – a business that will allow you to make money online and quickly achieve both financial freedom and time freedom.All you need to do is choose from a number of simple blueprints and follow the one that’s right for youYou will learn how to create positive habits that will free up your time and allow your business to grow more quickly than you ever thought possibleYou will be able to work from home or work virtually from anywhere on the planet – what’s your favourite city or beach?!And you will learn how to automate and outsource your business, leveraging other people's time for your own benefit so that you can start living the life you really wantBut more than this, Never Work Again explores what it means to live a truly happy and fulfilled life – to really live the life of your dreams. It encourages you to examine your own motivations and desires in order to determine your true purpose and path in life – so you can discover what freedom really means for you.Remember, your time is precious – in fact, it’s the most precious resource that you have.",
  "genres": [
    "Business",
    "Self Help",
    "Personal Development",
    "Nonfiction"
  ],
  "author": "Erlend Bakke",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/18866804-never-work-again"
}