{
  "title": "Wasted Justice",
  "description": "USA Today Bestselling Author DIANE CAPRI Returns!For fans of Lee Child, John Grisham, Jack Reacher and Michael ConnellyJudge Willa Carson - Where Justice Rules!\"Full of thrills and tension - but smart and human too.\"Lee Child , #1 New York Times Bestselling Author of Killing Floor and other Jack Reacher Thrillers\"A welcome surprise. It works from the first page to 'The End'.\" Larry King \"Fast-paced legal thriller...energetic prose...an appealing heroine...clever and capable supporting cast...[that will] keep readers waiting for the next Willa Carson mystery.\" Publisher's Weekly\"...offers tense legal drama with courtroom overtones, twisty plot, and loads of Florida atmosphere. Recommended.\" Library Journal\"Swift pacing and ongoing suspense are always present...Willa is a likable protagonist who uses her political connections for a good cause...Readers should eagerly anticipate the next installment in this series.\" Top Pick, Romantic Times (refers to prior out of print edition)The author of Don't Know Jack and the Hunt for Jack Reacher series does it again!Trey Steam believes his mother was wrongfully convicted of murdering his father in 1972. When no-nonsense Federal Judge Willa Carson is presented with the true facts, she's convinced Billie Jo Steam is innocent. Determined to right the wrongs of a justice system that is too often about the system and too seldom about justice, Willa pulls out all the stops, including the use of genetic testing and her most distinguished political connections, to give Bille Jo back her family and her freedom. But Willa's road to hell is paved with her good intentions and wasted justice. The deeper Willa delves into this old crime and the complex relationships that surround it, the more she uncovers pillars of the community, old hippies now in power, friends and coworkers who will do whatever it takes to keep the past buried -- even if they bury Willa, too. \"Expertise shines on every page!\" Margaret Maron, #1 New York Times Bestselling Author of Judge Deborah Knott MysteriesSue Grafton, Margaret Maron, and John Grisham fans love Judge Willa Carson!Grab your copy today!*formerly titled Kate's Killing",
  "genres": [
    "Mystery",
    "Thriller",
    "Suspense",
    "Legal Thriller",
    "Mystery Thriller",
    "Fiction"
  ],
  "author": "Diane Capri",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/18866786-wasted-justice"
}