{
  "title": "You'll Get Through This: Hope and Help for Your Turbulent Times",
  "description": "We all fear that the depression will never lift, the disappointment will never stop, the pain will never leave. Here in the pits, surrounded by steep walls, we wonder if our gray skies will ever brighten. Though these unprecedented and challenging times may bring a load of uncertainty and fear that feels too heavy to bear, God gives us this You'll Get Through This.In You'll Get Through This, pastor and New York Times bestselling author Max Lucado traces the story of Joseph as told in the book of Genesis. The Bible tells us that Joseph was tossed into a pit by his brothers, sold into slavery, wrongfully imprisoned, forgotten and dismissed. Yet Joseph's story is proof that we can flourish even in this broken world. On his darkest days, Joseph may have thought that the sun would never shine again, but God ultimately used these hardships for a greater purpose.Whether you find yourself in the pit of financial downturn, job loss, health crisis, or relationship stresses, God has a plan and a path forward designed just for you. Max reminds readers God doesn't promise that getting through trials will be quick or painless, but he does use our mess for good.In this book, Max will help Find comfort in the knowledge that you are God's child and God cares deeply for youRemember that God is near you and has never left youLook for hope in each hardship that you faceLean on your loving community in challenging timesTake courage that God will restore even the most painful circumstances and use them for goodEach copy of You'll Get Through This includes thoughtful questions for reflection designed to give you a chance to dive deeper into the hard yet hopeful story of Joseph's perseverance.With the compassion of a pastor, the heart of a storyteller, and the joy of one who has seen what God can do, Max explores the story of Joseph and the truth of Genesis 50:20: what Satan intends for evil, God redeems for good.",
  "genres": [
    "Christian",
    "Nonfiction",
    "Faith",
    "Christian Living",
    "Religion",
    "Christian Non Fiction",
    "Christianity"
  ],
  "author": "Max Lucado",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/18866898-you-ll-get-through-this"
}