{
  "title": "Star Crash",
  "description": "When Planet of the Apes meets Star Trek what's a girl to do?After recon pilot Cora Daniels crash lands on an alien planet she finds herself a prisoner of the a race of birdlike humanoids. Trapped in their zoo she discovers they intend her to mate. To breed. To be part of their human herd.She's placed in a cage with a man - a powerful, virile man, but not just any man - Alexander. Was he her lost love, who'd disappeared so long ago? Here he naked, glistening, a warrior trained by the Flock to fight for their amusement. How could the brilliant man, the tender lover she remembered have become this animal born to dominate and destroy? Was he a pawn of the Flock or would their flight to freedom be a long-sought reunion?\"Obviously reminiscent of Planet of the Apes, STAR CRASH is an interesting romantic science fiction that is at its best when readers obtain insight into the aliens and how they see humans as being beneath them. Fans who appreciate outer space encounters of the first kind will enjoy Elysa Hendricks' entertaining look at comparative anthropology from ET's perspective.\"Harriet Klausner \"This is an excellent science fiction tale. Yes, it is definitely a romance novel but not for the faint of heart. If the reader goes into the story with this in mind I believe that they will truly enjoy the action, suspense and the true grit of the protagonists, I know that I did. I could not put this book down and hope the author will write more stories like this.\" Leslie Tromposch - reviewed for PNR ReviewsA FAMILIAR DESIRECora paced the perimeter of the room, her need for release growing with every step. Earth drug companies would pay dearly for whatever the hell aphrodisiac the Flock used on her. Only the sense that she was being watched kept her from touching herself and relieving the increasing ache. What did it matter? At this rate, she’d ravage whatever abomination entered the room. A subtle snick of sound and the enticing aroma of warm male flesh told her she was no longer alone. The fear that wouldn’t come to her aid before now blossomed in her. She knew that she should look up, should brace herself for an attack, but she couldn’t make herself move. When she found herself quaking like an untried virgin, anger usurped her fear. She sprang up and turned to face whatever the Flock had sent her.Shock froze her. “Alexander,” she whispered.",
  "genres": [
    "Romance",
    "Science Fiction",
    "Science Fiction Romance",
    "Aliens",
    "Futuristic"
  ],
  "author": "Elysa Hendricks",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/18866369-star-crash"
}