{
  "title": "The Aftermath (Paranormal Mystery, Suspense and Drama, Epic Adventure)",
  "description": "Volume 4 of 8 Dilemmas of a Dragonslayer Series Part 1 Destruction’s Edge After narrowly escaping death when Lemore's plan to bond a Diamondscale's loyalty goes horribly wrong, Carison and his one-time companions Janetha and Brice follow Lemore out through secret tunnels to the Averkot Forest. Carison wants nothing more than to kill Lemore now, and if he hadn't lost his weapons in his escape, the Butcher might be dead already. But Lemore might just be the key to getting close enough to the Diamondscale to kill it. Even so, Carison wants nothing to do with any plan Lemore might come up with. He just might not have a choice. And on the far distant border of the Realm, Raven has healed herself. Fel has shown her how. Now she can turn her considerable power to the task of killing Lemore, his dragons, and all of his supporters. Unless memories of who she used to be distract her from the vengeance she has sworn. Part 2 The Trap, Part I Redscale Queen. Her Diamondscale son reigns with her. But Lemore, the man who would be King, has a plan to gain control of the Diamondscale, and the rest of the dragons as well. Paladin Carison Destine is forced to help. For now. Everything has come to this moment. Raven, the sorceress who has combined herself with a Greenscale dragon, has found her way into the Vale of Stone. The Diamondscale is approaching. Carison, and his former friends Janetha and Brice, lay in wait. And there are still others who have come to this place, in this moment that everything will change. Part 3 The Trap, Part II In the midst of the Dragon's Teeth, a twisting maze of monolithic stones, Paladin Carison Destine is losing his chance to kill a monster. Two monsters, in fact. The Diamondscale dragon recently born into the world is here. That monster pales in comparison to the man who made its birth possible. The Butcher Lemore. Those two are about to be the center of a titanic battle involving dragons, men, friends, and enemies. Lemore wants the Diamondscale for himself. Carison knows he can't let that happen. He'll fight to the death to keep it from happening. The trap is sprung. And it will close with lethal force. The only question is on who.",
  "genres": [],
  "author": "Ruth Ford Elward",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18867597-the-aftermath-paranormal-mystery-suspense-and-drama-epic-adventure"
}