{
  "title": "Drachenschiffe über Kenlyn",
  "description": "Eine fantastische Welt voller Geheimnisse; ein Abenteuer wie kein anderes Vor fast tausend Jahren wurde die Welt Te’Ra durch den Kult der Schattenkaiser vernichtet.  Die Überlebenden retteten sich auf den Planeten Kenlyn und ließen sich dort nieder: Menschen, die echsenhaften Draxyll, die katzenartigen Skria und die winzigen, geflügelten Yadi. Heute ist Kenlyn eine Welt der Abenteuer und Geheimnisse, wo mächtige Drachenschiffe am Himmel unter den zwei Monden fliegen und Nexus-Portale weit entfernte Städte miteinander verbinden. Über all das herrscht der Orden der Friedenswächter mit eiserner Hand.Doch es mehren sich die Zeichen, dass der Kult der Schattenkaiser sich wieder aus dem Grab erhoben hat. Und damit gerät ganz Kenlyn in Gefahr.Von alledem ahnt die junge Diebin Endriel noch nichts. Als sie von ihrem Vater ein eigenes Drachenschiff erbt, beschließt sie, ein ehrliches Leben zu beginnen und gründet ein Transportunternehmen. Doch bereits ihr erster Kunde, der junge Mensch Kai, wird nicht nur von den Streitkräften der Friedenswächter gejagt, sondern auch von Agenten des Schattenkults. Ehe Endriel und ihre Mannschaft sich versehen, geraten sie direkt zwischen die Fronten. Während sie versuchen, am Leben zu bleiben, kommen sie Stück für Stück dem Geheimnis näher, das Kai umgibt. Ein Geheimnis, das alles verändern wird... \"Drachenschiffe über Kenlyn\" ist der erste, in sich abgeschlossene Band der dreiteiligen Kenlyn-Chroniken, vom Autoren von Der Schatz der gläsernen Wächter.Eine Hörprobe des ersten Kapitels gibt es hier: http://www.youtube.com/watch?v=KTLTWQ... Stimmen über \"Drachenschiffe über Kenlyn\" \"Drachenschiffe über Kenlyn hat so ziemlich alles, was man sich von einem Roman wünscht, der gekonnt Versatzstücke der SF und Fantasy vermischt. ... begeistert mit Witz und Ideenreichtum, Kenlyn erscheint dem Leser als lebendige, faszinierende Welt.\"(Christian Humberg, Ringbote)\"Verfolgungsjagden, überraschende Wendungen und die perfekte Portion Humor, bringen immer wieder Abwechslung ins Spiel.\"(Oda Plein, SF Radio) Der Autor 1980 in Salzgitter geboren und in ländlicher Beschaulichkeit aufgewachsen, lebt Dane Rahlmeyer heute mit seiner Freundin und zwei Hunden in Bilderlahe, direkt hinterm Mond. Er schreibt seit seinem vierzehnten Lebensjahr. 2001 erhielt er von seiner Heimatstadt Salzgitter ein Stipendium für junge Künstler, was ihn ermutigte seinen Traum wahr zu machen und freier Schriftsteller zu werden.Als solcher schreibt er Romane, Drehbücher, Hörspiele und dreht gelegentlich den einen oder anderen Kurzfilm.Neben dem Schreiben befasst er sich mit den Rätseln des Universums - zum Beispiel mit der Frage, warum der Toast immer auf der Butterseite landet. Weitere Informationen über ihn gibt es auf www.dane-rahlmeyer.de.",
  "genres": [
    "Fantasy",
    "Science Fiction"
  ],
  "author": "Dane Rahlmeyer",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/18873280-drachenschiffe-ber-kenlyn"
}