{
  "title": "Melody of the Heart",
  "description": "As Rolling Stone magazine prepares an issue on successful rock star marriages, they sit down with Brayden and Lily Vanderburg. After all, the two have been a couple since they were fifteen years old. But there is more to the story than meets the eye, and their love took a slight detour before finding happily ever after. Told in flashbacks from the present to the past, Brayden and Lily share the story of their unbreakable love. EXCERPT“So was it love at first sight for you two?” Giovanni asked, leaning in expectantly. Lily tilted her head at me before giggling. “Not exactly.” Giovanni’s dark brows knit together. “Oh?”I couldn’t help the smile that stretched across my face as the familiar memory played in my mind. “I owe my marriage to my lovely wife’s penchant for apple thievery.” Lily sputtered with outrage. “I was not stealing apples. We had just moved in, and I wasn’t sure where our property ended and your grandparents began.”After winking at her, I focused my gaze on Giovanni’s amused one. “The first time I ever laid eyes on Lily was on a Sunday afternoon when I was visiting my grandparents. She was wearing a blue sundress with a satin ribbon in her hair. She could have had the face of an angel, but I wouldn’t have noticed because she had the hem of her dress flipped up to cradle the apples she was picking from my grandparents’ tree. All I could focus on were her long, tanned legs and the brief glimpse I got at what was between them.”“Brayden Michael Vanderburg!” Lily exclaimed. Just hearing her call my full name caused warmth to enter my chest. I loved everything fucking thing about her—I loved the mortified flush that dotted her cheeks, I loved her voice that could change from soothing to sexy within a second, but most of all, I loved that a woman as amazing as she was actually loved me. “I’m just answering the man’s question, sweetheart,” I replied.",
  "genres": [
    "Romance",
    "Music",
    "New Adult",
    "Contemporary Romance",
    "Musicians",
    "Contemporary",
    "Friends To Lovers"
  ],
  "author": "Katie Ashley",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/18872771-melody-of-the-heart"
}