{
  "title": "The House of Grey and Harmonics Bundle",
  "description": "The House of Grey and Harmonics! Two books for one! The House of GreyFantasy, friendship, and fate await you in Collin Earl’s The House of Grey, based on the popular audio fiction by the same name. 14-year-old Monson Grey faces the same challenges that any freshman high school kid would: difficult classes, weird teachers, food fights…girls. Except, Monson Grey is not Monson Grey. At least, when he looks at himself in the mirror, the scarred face staring back is not someone he recognizes. Now he finds himself attending an extraordinary school, the recipient of an incredible scholarship, among ridiculously rich classmates, all with no memory of how he got there or what to expect.All he has from his former life are the flashes of haunting images that plague his dreams and the echoing voices that he hears, but cannot see. Luckily, Monson finds fast friendship in two of his classmates, Casey and Artorius. Little does Monson know, they too carry their own skeletons. Yet, as bizarre events start to unfold around them, Monson wonders what secrets lay buried in his mind or if he will ever be able to share his true fears with his newfound friends.Join our three heroes as they roam the halls of the most prestigious high school in the country, finding love, mystery, and answers to their algebra homework- all while peeling away the layers of Monson’s shadowy past. Author’s Note: The House of Grey was originally a serialized audio fiction. Volume 1 begins the written adaptation of that story told in a six part series. Individual volumes do not contain the complete story.Harmonics: Rise of the MagicianSamantha Montgomery of Academy City 676 always dreamed of life outside of school. Sometimes you have to be careful what you wish for.A rogue weapons manufacturer, a ruthless killer, and a schoolgirl converge as a weapon so advanced it defies the laws of physics is a mere breath away from being unleashed on the world. Now it’s up to Sam and some unexpected allies to keep it out of the wrong hands.Set in our world in the near future, Harmonics: Rise of the Magician follows the life of Samantha Montgomery of Academy City 676, a normal primary education girl, and the actions of MESA, a defense contractor responsible for the world's most advanced weaponry. Elsewhere in other parts of the world, the super governments of United Western Collective and the Jade Empire follow the exploits and dealings of the world's most notorious assassin, a man known only as \"The Magician\". Some consider him a myth, others think of him as a legend, while others still believe he's the world's most brutal slayer of men. Still all look on in awe at any mention of the Magician. With the supposed ability to manipulate his surroundings at will, the world has seen the actions of this man whose purpose and identity remains hidden. They all look for him. The government, the fans, the law enforcement agencies search the world over for him without really knowing how truly dangerous he is...They're about to find out. A school in siege, a weapon so advanced it defies the law of physics, an assassin out for blood, and Samantha caught in the middle. When reality as you know it ceases to be, can you live with the reality yet to come? Join Sam as she discovers for herself how dangerous life outside of school really is.",
  "genres": [],
  "author": "Chris Snelgrove",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/18873739-the-house-of-grey-and-harmonics-bundle"
}