{
  "title": "Angels are Real, Angels Exist; Proof that Angels are to help us, Real stories of Angels encounters, Ordinary people saved by Angels, Guardian Angels and Archangels.",
  "description": "Angels are Real; Angels Exist. Angels don’t necessarily appear in the most dramatic of ways, with wings and halos and harps. Your Guardian Angel can come to you in the most subtle of ways, but they are there all the same. Accounts from thousands of ordinary people testify to that. The proof is out there; Angels exist; Angels are Real. Guardian Angels, Archangels; they come to help, often in the most desperate of circumstances, whether in a whispered voice in your ear, a sudden strong instinct, the touch of an unseen hand, the feeling of arms around you, or the mysterious stranger who comes to your aid and disappears into the night.Reviews - \"Stories that uplift the spirit and tug at the heartstrings. I've re-read bits of it because I was so moved.\" Deedee\"The stories were deeply moving and heart-warming\" LifeisGood\"The stories of the encounters are nothing short of amazing and heart warming. I didn't want to put it down.\" Pearl HartInside the book are stories including the Angel who saves the little girl falling from tower block. “I was falling fast at first and very scared, but then I felt someone hold me like I was a baby.”An angel saves a preacher in dreadful car crash. “I have this strange mark that was just below the seat belt and looked to be the size of a human hand.”A guardian angel helps a grieving woman, “There, standing in front of me was this beautiful 7 foot tall golden Angel.”An angel saves a desperate woman, “I was surrounded by an incredible sapphire blue light and an angel-like figure spoke to me.”Inside are some of these real-life stories..Reviews for 'Angels are Real'\"The stories of the encounters are nothing short of amazing and heart warming. I didn't want to put it down.\" Pearl Hart",
  "genres": [],
  "author": "Tessy Rawlins",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/18873062-angels-are-real-angels-exist-proof-that-angels-are-to-help-us-real-st"
}