{
  "title": "The End Has Come",
  "description": "Famine. Death. War. Pestilence. These are the harbingers of the biblical apocalypse, of the End of the World. In science fiction, the end is triggered by less figurative means: nuclear holocaust, biological warfare/pandemic, ecological disaster, or cosmological cataclysm. But before any catastrophe, there are people who see it coming. During, there are heroes who fight against it. And after, there are the survivors who persevere and try to rebuild. THE APOCALYPSE TRIPTYCH tells their stories. Edited by acclaimed anthologist John Joseph Adams and bestselling author Hugh Howey, THE APOCALYPSE TRIPTYCH is a series of three anthologies of apocalyptic fiction. THE END IS NIGH focuses on life before the apocalypse. THE END IS NOW turns its attention to life during the apocalypse. And THE END HAS COME focuses on life after the apocalypse. THE END HAS COME features all-new, never-before-published works by Hugh Howey, Seanan McGuire, Ken Liu, Carrie Vaughn, Mira Grant, Jamie Ford, Tananarive Due, Jonathan Maberry, Robin Wasserman, Nancy Kress, Charlie Jane Anders, Elizabeth Bear, Ben H. Winters, Scott Sigler, and many others. THE END IS NIGH is about the match. THE END IS NOW is about the conflagration. THE END HAS COME is about what will rise from the ashes.\nCONTENTS\n01 - Carrie Vaughn, Bannerless02 - Megan Arkenberg, Like All Beautiful Places03 - Will McIntosh, Dancing With a Stranger in the Land of Nod04 - Scott Sigler, The Seventh Day of Deer Camp05 - Sarah Langan, Prototype06 - Chris Avellone, Acts of Creation07 - Seanan McGuire, Resistance08 - Leife Shallcross, Wandering Star09 - Ben H. Winters, Heaven Come Down10 - David Wellington, Agent Neutralized11 - Annie Bellet, Goodnight Earth12 - Tananarive Due, Carriers13 - Robin Wasserman, In the Valley of the Shadow of the Promised Land14 - Jamie Ford, The Uncertainty Machine15 - Elizabeth Bear, Margin of Survival16 - Jonathan Maberry, Jingo and the Hammerman17 - Charlie Jane Anders, The Last Movie Ever Made18 - Jake Kerr, The Gray Sunrise19 - Ken Liu, The Gods Have Not Died in Vain20 - Hugh Howey, In the Woods21 - Nancy Kress, Blessings",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Post Apocalyptic",
    "Horror",
    "Anthologies",
    "Fiction",
    "Dystopia"
  ],
  "author": "John Joseph Adams",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/18870662-the-end-has-come"
}