{
  "title": "Hazardous Unions: Two Tales of a Civil War Christmas",
  "description": "Regular ebook price: $3.99 US\nTwin sisters separated by war, bound by love…\nAfter the death of their father, twin sisters Maggie and Matty Becker are forced to take positions with officers’ families at a nearby fort. When the southern states secede, the twins are separated, and they find themselves on opposite sides of America’s bloodiest war.In the south, Maggie travels with the Hamiltons to Bellevue, a plantation in west Tennessee. When Major Hamilton is captured, it is up to Maggie to hold things together and deal with the Union cavalry troop that winters at Bellevue. Racism, politics and a matchmaking stepmother test Maggie’s resourcefulness as she fights for Bellevue, a wounded Confederate officer and the affections of the Union commander.In the north, Matty discovers an incriminating letter in General Worthington’s office, and soon she is on the run. With no one to turn to for help, she drugs the wealthy Colonel Cole Black and marries him, in hopes of getting the letter to his father, the governor of Michigan. But Cole is not happy about being married, and Matty’s life becomes all about survival. \nTwo unforgettable stories of courage, strength and honor.\n**Contains 2 novellas.Editorial Reviews:\"Maggie and Matty Becker will enchant you as they struggle for respect, survival, and love in the Civil War’s troubled time. You’ll sigh with pleasure as you finish each story.\" —Caroline Clemmons, author of Bluebonnet Bride\"Two very talented authors, Alison Bruce and Kat Flannery, teamed up to write Hazardous Union; Two Tales of a Civil War Christmas. It is the story of twin sisters, Matty and Maggie Becker who are separated at the beginning of the Civil War….One major thing ties them to each other—their upbringing by loving and wise parents. As their stories unfold, they are both able to make a difference in the lives of the people they hold dear. They each solve a different mystery and, at the same time, fall in love. They also witness a form of racism within each of the families, reflecting the mores of the north and the south. The characters and the times are well depicted in this short novel. I highly recommend this novel to Civil War enthusiasts and readers who enjoy a well-written historical romance. If you like intrigue, mystery and romance, this book is for you. It will hold your attention and is a quick read that you won’t be able to put down.\" —Katherine Boyer, Tear a Page Blog\"Double your reading pleasure with twin passions—two novellas featuring twins Maggie and Matty, and heroes who’ll steal your heart. Alison Bruce and Kat Flannery penned stories that play on your senses like a sonata. A must read!\" —Jacquie Rogers, award-winning author of Much Ado About Madams\"Hazardous Unions are twin stories about the adventures of two sisters during the Civil War and the dilemmas they get themselves into. Maggie's story, written by Alison Bruce, tells the tale of a Northern young woman who accepts a job as housekeeper to a Southern family…A wonderfully entertaining and well written novella, with engaging characters and appropriate language for the era. Ms. Bruce knows her history. I will be eager to read more of her work. Mattie, by Kat Flannery, is equally delightful. Unlike her sister, Mattie stays in the North working for a Union General…Even in the midst of war and danger and death, love will have its way, as it does with Maggie and Matty.\" —Charlene Raddon, author of To Have and to Hold",
  "genres": [
    "Civil War",
    "Romance"
  ],
  "author": "Alison  Bruce",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/18871310-hazardous-unions"
}