{
  "title": "Any Known Blood",
  "description": "Spanning five generations, sweeping across a century and a half of almost unknown history, this acclaimed and unexpectedly funny novel is the story of a man seeking himself in the mirror of his family's past. There were Canes in Canada before the United States erupted into civil war. Their roots are deep, their legacy is rich, but Langston Cane V knows little of his heritage. He is thirty-eight, divorced, and childless and has just been fired for sabotaging a government official's speech. The eldest son of a white mother and prominent black father, Langston feels more acutely than ever the burden of his illustrious family name and his racially mixed heritage. To be black in a white society is hard enough; to be half-black, half-white is to have no identity at all. Or so Langston believes. After a run-in with his father, Langston takes off for his feisty aunt's house in Baltimore, where he embarks on a remarkable quest for his family's past.It's said that those who forget history are condemned to repeat it, but to Langston, history offers not condemnation but reprieve. For when he stumbles across a treasure trove of family documents, he sets off on a journey through time that will lead him back to the famous antislavery raid on Harpers Ferry, Virginia, and the great-great-grandfather who fought beside John Brown. He rediscovers the long line of relatives who have battled for racial justice, decade after decade. He finds passion, dignity, and courage--and, at last, by unearthing and giving voice to those who came before him, he finds himself.Rich in historical detail and gracefully flowing from the slave trade of nineteenth-century Virginia to the present, Any Known Blood gives life to a story never before told, a story of five generations of a black Canadian family whose tragedies and victories merge with the American experience.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Canada",
    "Book Club",
    "Historical",
    "Race",
    "Canadian Literature"
  ],
  "author": "Lawrence Hill",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/1887035.Any_Known_Blood"
}