{
  "title": "Out of the Storm",
  "description": "[Warning: For Mature Adult Audiences. Contains wording and actions some may deem offensive. Sexually explicit content. Ménage – MFM]In book one of Masters of the Prairie Winds Club: Tobi Stobel’s life is a never-ending string of disasters interrupted by an occasional bit of chaos. The small magazine she works for is looking for any excuse to trim their staff and Tobi is next on the list unless she can land the interview with the sexy owners of Texas’s newest and hottest BDSM club. After a chance encounter with their mother, the interview is scheduled and Tobi is sure fate must have been on a break. With her job hanging in the balance, the little blonde bundle of energy isn’t about to let a little thing like a thunderstorm stand in her way. Kent West can’t decide who he should be the most frustrated with, the annoying reporter that has hounded him and his brother, Kyle, for weeks for an interview or his mother for insisting they grant Tobi Strobel’s request. But the weight of his exasperation swings toward the reporter when he fails to show up. When Kyle brings home a petite stunner and introduces her as the missing reporter, Kent is shocked and beyond pleased. Even soaking wet, the woman is spectacularly beautiful, but there is something else about her that captures both brothers’ interest. Fate hasn’t completely forgotten its grudge against Tobi, and its reluctance to let go not only endangers Tobi, but Kent and Kyle’s mom as well. The West brothers are convinced Tobi is the woman they’ve always dreamed of sharing, but a stalker threatens to snatch her out of their grasp. Keeping the little trouble magnet safe proves to be a challenge for the former Special Forces soldiers, and sometimes all the financial resources in the world aren’t enough to help—it all comes down to luck and timing.",
  "genres": [
    "BDSM",
    "Menage",
    "Erotica",
    "Romance",
    "Erotic Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Avery Gale",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/18875247-out-of-the-storm"
}