{
  "title": "Valkyrie: the North American XB-70: The USA's Ill-fated Supersonic Heavy Bomber",
  "description": "“A fascinating insight into one of the Cold War’s most interesting concept aircraft . . . [with] new information, photographs and first-hand accounts.” —Flypast During the 1950s, plans were being drawn at North American Aviation in Southern California for an incredible Mach-3 strategic bomber. The concept was born as a result of General Curtis LeMay’s desire for a heavy bomber with the weapon load and range of the subsonic B-52 and a top speed in excess of the supersonic medium bomber, the B-58 Hustler. However, in April 1961, Defense Secretary McNamara stopped the production go-ahead for the B-70 because of rapid cost escalation and the USSR’s newfound ability to destroy aircraft at extremely high altitude using either missiles or the new Mig-25 fighter. Nevertheless, in 1963 plans for the production of three high-speed research aircraft were approved and construction proceeded. In September 1964 the first Valkyrie, now re-coded A/V-1, took to the air for the first time and in October went supersonic. This book is the most detailed description of the design, engineering and research that went into this astounding aircraft. It is full of unpublished details, photographs and firsthand accounts from those closely associated with the project. Although never put into full production, this giant six-engined aircraft became famous for its breakthrough technology, and the spectacular images captured on a fatal air-to-air photo shoot when an observing Starfighter collided with Valkyrie A/V-2 which crashed into the Mojave Desert.“Well-illustrated with numerous diagrams and black and white photographs, the book provides an interesting insight into one of the so-called ‘white elephant’ projects of the 1960s.” —Jets Monthly",
  "genres": [
    "History",
    "Aviation",
    "Military Fiction",
    "Nonfiction",
    "Science"
  ],
  "author": "Graham M. Simons",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/18875972-valkyrie"
}