{
  "title": "Britain Begins",
  "description": "The last Ice Age, which came to an end about 12,000 years ago, swept the bands of hunter gatherers from the face of the land that was to become Britain and Ireland, but as the ice sheets retreated and the climate improved so human groups spread slowly northwards, re-colonizing the land that had been laid waste. From that time onwards Britain and Ireland have been continuously inhabited and the resident population has increased from a few hundreds to more than 60 million.Britain Begins is nothing less than the story of the origins of the British and the Irish peoples, from around 10,000BC to the eve of the Norman Conquest. Using the most up to date archaeological evidence together with new work on DNA and other scientific techniques which help us to trace the origins and movements of these early settlers, Barry Cunliffe offers a rich narrative account of the first islanders - who they were, where they came from, and how they interacted one withanother. Underlying this narrative throughout is the story of the sea, which allowed the islanders and their continental neighbours to be in constant contact. The story told by the archaeological evidence, in later periods augmented by historical texts, satisfies our need to know who we are and where we come from. But before the development of the discipline of archaeology, people used what scraps there were, gleaned from Biblical and classical texts, to create a largely mythological origin for the British. Britain Begins also explores the development of these early myths, which show our ancestors attempting to understand their origins.And, as Cunliffe shows, today's archaeologists are driven by the same desire to understand the past - the only real difference is that we have vastly more evidence to work with.",
  "genres": [
    "History",
    "Nonfiction",
    "Archaeology",
    "British Literature",
    "Ireland",
    "Ancient History",
    "Prehistory"
  ],
  "author": "Barry Cunliffe",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/18875650-britain-begins"
}