{
  "title": "Abandon The Established Path? (Paranormal Mystery, Suspense and Drama, Epic Adventure)",
  "description": "Volume 3 of 8 Dilemmas of a Dragonslayer Series Part 1 – Traitors or Friends On their way to stop Butcher Lemore from hatching an evil dragon type thought long extinct, Paladin Carison Destine and Captain of the Bastion Guardsmen Orson were set upon by a murderous pack of Bluescales. Carison's love, Raven, is lost to them a blaze of her own power. She lives, but she has become a force that even she cannot control. Now, with their new ally Janetha Sapphire, a Dragonslayer and also an old friend of Carison's, they are trying to find and reach Lemore before he visits devastation upon the Realm like has never been seen before. And hopefully, at the same time, they will be able to save Raven from herself. But Carison has reason to believe not all of his friends are what they seem. Or who they say. Part 2 - Betrayal Carison Destine is facing the most dangerous task of his dragonslayer career. He and his companions Janetha Sapphire and Captain Orson are planning to attack the Butcher Lemore in his stronghold of dragons. They'll need all the help they can get. Especially now that Raven, sorceress and Carison's lover, has empowered herself with dark power. She may have gone beyond his ability to save her. She may be a greater danger than either Lemore or the dragons. And Carison may be her only hope. Janetha recruits two more dragonslayers to help them. One an old friend, one that Carison has never met. And in the mix of all of these friends and comrades stands a traitor. Someone Carison will never see coming. Until it's too late. Part 3 – The Hatching Paladin Carison Destine has found himself taken prisoner at the hands of people he called friends. Everyone he has ever cared about is either lost to him, or turned traitor. He finds himself tied down in the stronghold of Butcher Lemore, surrounded by dragons of every sort and description. And in the center of them all lays Y'sil'ki, the Redscale female playing hatch mother to the coveted Diamondscale egg that will make Lemore ruler of all dragon kind. Lemore promises to make Carison the Diamondscale's first meal. So as one-time friends and allies look on, Lemore prepares to receive the newborn Diamondscale as its master. But treachery cuts both ways.",
  "genres": [],
  "author": "Ruth Ford Elward",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18877693-abandon-the-established-path-paranormal-mystery-suspense-and-drama-e"
}