{
  "title": "Bittersweet Ending (Paranormal Mystery, Suspense and Drama, Epic Adventure)",
  "description": "Volume 8 of 8 Dilemmas of a Dragonslayer Series Part 1 The Rescue Raven and the Guardsmen are trapped in the Vale of Stone, surrounded by dragons, with no way out. Raven can barely keep them safe even with her abilities. She can't gather them all together and escape without losing most of them in the process. She needs help. Carison, Janetha, and Deacon are stuck in Doricinth with no way to get to Raven in time. Their plan to attack the dragons at the Vale as an organized group has fallen apart. Their idea to use the fireproof Blackscale blood to give them an edge is useless now. Or is it? Is there a way to get to Raven after all? Is there a chance? Whatever the outcome, Lemore has plans of his own. The amulet glows blue. And with a touch of his hand to the Diamondscale E'vira'tor, everything will change. Part 2 Armed and Bloody Raven and what’s left of the Guardsmen have been saved from the Vale of Stone. Now they are regrouping in Doricinth with Carison, Janetha, and Deacon. Their plans are made. It's time to put them into play. But you know what they say. Man plans for his next move while the Provider changes the rules of the game. None of them make it to the Vale of Stone. The fight they were going to look for is coming to them. Lemore has used ancient magic to swap bodies with the Diamondscale. He leads the dragons now. It is time for him to reclaim his Kingdom and conquer the realm. The dragons will follow him anywhere, so long as they think he is their Gi'tro'ro. Lemore is more than willing to play that part so long as it gets him what he wants. But it may be more than playacting. When he suddenly can understand dragon speak, he knows he has gained more than just an invincible body. Carison and Raven are doing all they can to stop the threat Lemore has brought to the Realm. They know it may not be enough. What they don't know, is that not everyone will make it through this fight alive. Part 3 Ending In the remains of the town of Doricinth, Carison and Raven watch as Deacon Winters carries Janetha's lifeless body. Too many friends have been lost already. Now, another is gone. The dragons that Lemore had gathered for his army are either scattered or dead. They will not follow the Diamondscale any longer. Something is different about him, something wrong. He looks like their Gi'tro'ro, but he is another kind of animal altogether. He is the Butcher, Lemore. As Lemore tries to regain his throne through ancient magic and by force, Carison, Raven, and Deacon fight to stop him on the eve of the crescent moon. Everything hinges on this moment. The fate of the Realm is in their hands, as are their own. Each of them knows they may have to die to stop Lemore. And one of them just might.",
  "genres": [],
  "author": "Ruth Ford Elward",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18877660-bittersweet-ending-paranormal-mystery-suspense-and-drama-epic-adventu"
}