{
  "title": "All In Good Time (Paranormal Mystery, Suspense and Drama, Epic Adventure)",
  "description": "Volume 5 of 8 Dilemma's of a Dragonslayer SeriesPart 1Apocalypse StirringAfter losing the Diamondscale to Butcher Lemore, Paladin Carison Destine and Janetha Sapphire seek aid from the Three Kingdoms. A war is coming. If Lemore isn't stopped first, dragons by the dozens, by the hundreds, will swoop down upon the Realm, killing everything in their path.But no help is coming. Carison and Janetha are on their own.They seek out the aid of inventors in the coastal city of Rareborn. Anything they can use to level the field is an advantage that Carison wants to get his hand on.Only, someone is following them. And the agents of Lemore are everywhere.Part 2The Diamondscale's StoryKing Lemore sits on his throne, ruling over the dragons. His intentions to use them as a force against the Three Kingdoms, to take back his throne by force, has been thwarted at every turn by Paladin Carison Destine and the sorceress, Raven. Lemore wants them dead. Needs them dead, if his plans are to ever fall into place.The Diamondscale dragon, Lemore's loyal servant and key to the loyalty of the dragons, is being sent to lure Raven out, and kill her. Raven has faced any number of dragons before, and killed them all with extreme prejudice. She seeks Lemore's life. But she'll have to go through the Diamondscale first.And the Diamondscale dragon has scores of his own to settle.Part 3The Beginning of the EndWar approaches the realm. Racing to Bastion to raise an army to stand against the dragons Butcher Lemore now commands, Carison and his companions become sidetracked in a town called Timberfall. A meeting is about to take place there. A meeting of the Yis.Janetha Sapphire crafts a plan to sneak into the meeting to learn what the Yis are planning. Janetha and Carison and Deacon Winters are agreed, it can't be anything good.Turns out, they're right.Meanwhile, Lemore crafts his plans to take over the old Fourth Kingdom, and from there the entire Realm. His allies have their own plans, ones that stand in Lemore's way. He may rule the dragons. But he's finding out that rule isn't absolute.Which is something he will not tolerate. The Realm will be his. All will bow their knees and heads to him, King Lemore.Or they will all burn to ash.",
  "genres": [],
  "author": "Ruth Ford Elward",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18877673-all-in-good-time-paranormal-mystery-suspense-and-drama-epic-adventure"
}