{
  "title": "Reunion with Death",
  "description": "Laura Shumway couldn’t say why she’d agreed to go on the class reunion trip to Italy. Maybe it was to take stock of her life, or maybe it was just to catch up with old friends, take in the sights, and relax in the beautiful Tuscan countryside. Either way, she knew she’d discover a lot on the trip, about both herself and her former classmates. What she didn’t expect to discover was the dead body of esteemed professor Anthony Gilbert.Gilbert had had a long and illustrious career at the college. Now retired to Italy, he appeared as a surprise guest speaker at the women’s vacation villa, still disarmingly handsome, still charming, but not nearly so eminent in the eyes of Laura’s classmates. As a young professor all those years ago, Gilbert used his position and looks to seduce and then cast aside many of his young and impressionable students, and at least some of the women on this trip had been hurt by his false promises of love. The kind of hurt that runs deep and may have given any number of them a motive for murder.Before the polizia or carabiniere get involved, Laura and a few trusted classmates set out among the vineyards and hills of the Italian Riviera to solve the murder on their own. With the help of some influential locals and good old-fashioned detective work, they’re soon led to the conclusion that one of their classmates might be a killer—and what started as a trip to see how far they’d all come may turn into a stark lesson about just how far one of them would go.About the Author:Sheila Connolly is an Anthony and Agatha Award–nominated author who writes three bestselling cozy mystery series: the Museum Mysteries, the Orchard Mysteries, and the County Cork Mysteries, which includes Buried in a Bog and Scandal in Skibbereen, both New York Times bestsellers. In addition, she has published Once She Knew, a romantic suspense; Reunion with Death, a traditional mystery set in Tuscany; Relatively Dead, a paranormal romance and a New York Times bestseller; and Seeing the Dead, as well as a number of short stories. She lives in Massachusetts with her husband and three cats and travels to Ireland as often as possible.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Cozy",
    "Crime"
  ],
  "author": "Sheila Connolly",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/18877950-reunion-with-death"
}