{
  "title": "Black May: The Epic Story of the Allies' Defeat of the German U-Boats in May 1943",
  "description": "In May 1943, Allied sea and air forces won a stunning, dramatic, and vital victory over the largest and most powerful submarine force ever sent to sea, sinking forty-one German U-boats and damaging thirty-seven others. It was the forty-fifth month of World War II, and by the end of May the Germans were forced to acknowledge defeat and recall almost all of their remaining U-boats from the major traffic lanes of the North Atlantic. At U-Boat Headquarters in Berlin, despondent naval officers spoke of \"Black May.\" It was a defeat from which the German U-boat fleet never recovered.Black May is a triumph of scholarship and narrative, an important work of history, and a great sea story. Acclaimed historian Michael Gannon, author of Operation Drumbeat, has done enormous research and produced the most thoroughly documented study ever done of these battles. In his compelling historical saga, the people are as significant as the technical information.Given the strategic importance of the events of May 1943, it is natural to ask, How did Black May happen and why? Who or what was responsible? Were new Allied tactics adopted or new weapons employed?This book answers those questions and many others. Drawing on original documents in German, British, U.S., and Canadian archives, as well as interviews with surviving participants, Gannon describes the exciting sea and air battles, frequently taking the reader inside the U-boats themselves, aboard British warships, onto the decks of torpedoed merchant ships, and into the cockpits of British and U.S. aircraft.Throughout, Gannon tells the Black May story from both the German and Allied perspectives, often using the actual words of captains and crews. Finally, he allows the reader to \"listen in\" on secretly recorded conversations of captured U-boat men in POW quarters during that same incredible month, giving intimate and moving access to the thoughts and emotions of seamen that is unparalleled in naval literature. Rarely, if ever, has the U-boat war been presented so accurately, so graphically, and so personally as in Black May.",
  "genres": [
    "History",
    "World War II",
    "Nonfiction",
    "Military Fiction",
    "War",
    "Military History",
    "Naval History"
  ],
  "author": "Michael Gannon",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/18879847-black-may"
}