{
  "title": "The Swordmage Trilogy Bundle, Books 1-3: A Magic of Solendrea Series",
  "description": "From slave to swordmage, experience Tiadaria's coming of age journey in a single volume.The Swordmage Trilogy, Books 1-3 of the Magic of Solendrea SeriesThe Swordmage Trilogy follows the adventures of Tiadaria, a girl sold into slavery by her father and rescued from certain death by a retired soldier dying of a mysterious disease. As she discovers her destiny, Tiadaria must battle against some of the most fearsome enemies the Human Imperium has ever known, including the Xarundi Combine and a species once thought extinct.This eBook Bundle Last Swordmage, The Swordmage Trilogy #1The Darkest Hour, The Swordmage Trilogy #2The Pegasus's Lament, The Swordmage Trilogy #3˃˃˃ The Last Swordmage - The Swordmage Trilogy #1, a Magic of Solendrea NovelAs far as bad luck goes, Tiadaria’s has been the stuff of legend. After being sold into slavery by her father and accused of a murder she didn’t commit, she finds herself facing the executioner. The only thing standing between her neck and the sharp edge of the axe is the village Constable.After thirty years of loyal service to the Imperium, Royce has retired to King’s Reach as the village’s Constable. He thought that the frontier town would be the perfect place to rest, relax, and die in peace. He was wrong. With a crooked Magistrate on one hand and a conniving slaver on the other, things are anything but peaceful. To complicate his life even further, the slave with her neck on the block seems to possess the same magic Royce has hidden all his life.Paying off Tiadaria’s bond, Royce takes possession of a slave in a land where slavery is verboten. Now he must teach her to trust him, teach her to fight, and teach her about her unique abilities before they both run out of time. An ancient menace is coming. The Xarundi have returned. They are the most dangerous enemy humanity has ever faced, and they have a thousand years of bloodthirsty vengeance to exact.˃˃˃ The Darkest Hour - The Swordmage Trilogy #2, a Magic of Solendresa NovelWhen an agent from the Imperium Intelligence Service shows up on Tiadaria’s doorstep, he leaves her with unwelcome news. Recovering from their brutal defeat at Dragonfell, the Xarundi are seeking out an ancient and incredibly powerful relic buried in the snow and ice of the Frozen Frontier.Tiadaria travels to the city of Ethergate to seek out an apprentice skilled in magical research. Even with his reluctant help, unearthing information on the relic proves to be almost impossible until a savage turn of events puts them on the right path.Now it’s a race against time through some of the most unforgiving territory on Solendrea to beat the Xarundi to the relic and stop them from unleashing its devastating power on the unsuspecting masses.˃˃˃ The Pegasus's Lament - The Swordmage Trilogy #3, a Magic of Solendrea NovelA desecrated tomb, a missing relic, and cold-blooded murder. The streets of Dragonfell are awash in blood and the King has called on Tiadaria, the last swordmage, and Wynn, her quintessentialist companion, to uncover the nature of the darkness.What they find is more dangerous than they could ever imagine and from a source they’d have never expected. Now Tiadaria must defeat an enemy that knows her almost as well as she knows herself.The survival of the Human Imperium is on the line and time is running out for the last swordmage and everyone she holds dear.",
  "genres": [],
  "author": "Martin Hengst",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/18879237-the-swordmage-trilogy-bundle-books-1-3"
}