{
  "title": "How Will You Measure Your Life?: A thought-provoking approach to measuring life's success",
  "description": "How do you lead a fulfilling life? That profound question animates this book of inspiration and insight from world-class business strategist and bestselling author of The Innovator’s Dilemma, Clayton Christensen.After beating a heart attack, advanced-stage cancer and a stroke in three successive years, the world-renowned innovation expert and author of one of the best selling and most influential business books of all time – The Innovator’s Dilemma – Clayton M. Christensen delivered a short but powerful speech to the Harvard Business School graduating class. He presented a set of personal guidelines that have helped him find meaning and happiness in his life – a challenge even the brightest and most motivated of students find daunting.Akin to The Last Lecture in its revelatory perspective following life-altering events, that speech subsequently became a hugely popular article in the Harvard Business Review and is now a groundbreaking book, putting forth a series of questions and models for success that have long been applied in the world of business, but also can be used to find cogent answers to pressing life questions: How can I be sure that I’ll find satisfaction in my career? How can I be sure that my relationships with my spouse, my family and my close friends become enduring sources of happiness? How can I avoid compromising my integrity (and stay out of jail)?How Will You Measure Your Life? is a highly original, surprising book from a singular business figure. It’s a book sure to inspire and educate readers – companies and individuals, students of business, mid-career professionals, and even parents – the world over.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Business",
    "Personal Development",
    "Psychology",
    "Philosophy",
    "Leadership"
  ],
  "author": "Clayton M. Christensen",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/18876639-how-will-you-measure-your-life"
}