{
  "title": "Dragonslayer and His Sorceress (Paranormal Mystery, Suspense and Drama, Epic Adventure)",
  "description": "Volume 2 of 8 Dilemmas of a Dragonslayer Series Part 1 – Coming Storm Carison Destine, Paladin of the Realm, has agreed to help an old friend prepare the defenses of the Governor's Palace in what was once the Fourth Kingdom. Along with his lover, the beautiful and deadly sorceress Raven, they begin their task, knowing it is only a matter of time before the deposed King Lemore tries to take his throne back by force. An attack on the palace by a Yellowscale dragon leaves Carison's friend poisoned and dying and Carison must find help in the most unlikely of places. And all the while there are rumors from the lips of the dragons themselves that something is coming, something that Carison cannot prepare for... Part 2 - Hidden Dangers Dreams of impending terrors wake Carison Destine from his sleep. As Paladin of the Realm, he has faced untold dangers and always walked away from them, although not always without losing something of himself. The dragons are anxiously awaiting something. Something that will be worse than anything Carison and the Sorceress Raven have ever faced before. They must find out what it is, and stop it if they can. If they don't die trying. Part 3 - There is Death On their way to stop the tyrant Butcher Lemore from raising a dragon army, Paladin Carison Destine, the sorceress Raven, and their friend Captain Orson Malidra are set upon by a group of Bluescale dragons. In the middle of the fight that they are bound to lose, they are saved by a friend. A friend who gives his life for them. His death tips Raven over an emotional cliff, unleashing powers and dangers she had tried so hard to bury within herself. She changes before Carison's eyes. And then leaves. Looking for help in the next town, what they find is rumors that Raven has slaughtered a nearby village. Carison knows it can't be true. But he also knows he has to go to her, to try to bring her back to herself. But at the same time, Butcher Lemore is plotting and scheming to regain his throne. And kill anyone who stands in his way.",
  "genres": [],
  "author": "Ruth Ford Elward",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18877636-dragonslayer-and-his-sorceress-paranormal-mystery-suspense-and-drama"
}