{
  "title": "Forever Together (Paranormal Mystery, Suspense and Drama, Epic Adventure)",
  "description": "Volume 7 of 8 Dilemmas of a Dragonslayer Series Part 1 A Gathering of Dragons Carison has gathered his army. The Bastion Guardsmen march with him, and Deacon Winters, Janetha Sapphire, Wilson, and even the young Galune. All of them together, and Raven with them. She has returned to him a changed woman. Her magics are lost, carved out of her by a terrifying experience of her own making. As far as she knows, the last of her magics were used up in her escape back to Carison. But then how is Carison's arm healing? The small force marches south, and Carison worries it will be too little, too late. Especially when a scout comes racing back with news of the unthinkable. The attack has already begun. And as town’s burn and people die, Carison desperately searches for a way to get in front of the gathering dragons and stop them. By any means necessary. Part 2 Discoveries Raven has learned she still has her magics. Her love for Carison has returned that power to her in a new way. Just in time for her to transprot Carison and Deacon and Janetha into the middle of a group of dragons about to destroy the town of Doricinth. Now, they face Bluescales, and Redscales, and other dragons as well. And worse, a single Blackscale, bigger and more dangerous than all the other dragons put together. Death is in the air. If they survive, there is a secret waiting for them to find. One that might tilt the balance of the coming war. If Lemore and his Diamondscale don't lay waste to everything around them first. Part 3 The Power of Need Blood that won't burn. Carison has stumbled on a unique advantage for him and his friends. The time has nearly come for the final battle. If they cannot stop the dragons from leaving the Vale soon, then there will be no way to keep Lemore's evil from sweeping across the Realm. They have won a minor skirmish with a small horde of dragons. But they have become separated from the Guardsmen. They need to rejoin their forces to face Lemore. Raven volunteers to go back for the Guardsmen, using her magics to transport herself across the spaces between. She arrives back with them to find the Guardsmen under attack by Yis agents. She discovers her abilities have been multiplied, both to kill, and to heal. When Raven tries to move the Guardsmen back to Carison and the others, she makes a deadly error that lands them in the Vale of Stone. Surrounded by dragons. With no way out.",
  "genres": [],
  "author": "Ruth Ford Elward",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18876875-forever-together-paranormal-mystery-suspense-and-drama-epic-adventure"
}