{
  "title": "Vale of Stone and Beyond (Paranormal Mystery, Suspense and Drama, Epic Adventure)",
  "description": "Volume 6 of 8 Dilemmas of a Dragonslayer Series Part 1 Choices Raven will have her revenge on Lemore, if it burns her to ash. She waits in the Dragon's Teeth, watching the Vale of Stone below, waiting for the ally she knows will come. A Greenscale dragon, intelligent enough to know what evil Lemore will spread on the dragons if he is allowed to become King. Her ally does not want to be enslaved. A bargain is struck. Choices. On their way to Bastion, Carison and his companions are followed. They have to make Bastion as soon as possible, and obtain the help they so desperately need before the next crescent moon. But, the person following them needs to be dealt with. Choices. Raven listens to Fel, her constant dragon companion, tell her that she should return to Carison, that her choices are killing her slowly. He worries for her, and encourages her to regain her sanity before it is too late. Choices. In the days leading up to the climactic battle between humans and dragons, good and evil, choices are all they have. And no one can foresee what's coming next. Part 2 All Hope In the harsh mercies of Ka'luna'sen, Raven knows fear and pain. She is near death, with no way to access her considerable powers. Fel is fading from her. She sees no way out. She only knows she must survive, if only to see the Butcher Lemore dead. Carison and his companions have reached Bastion. For all the good it has done them. Governor Theron refuses to go against the orders of the Three Kingdoms. He will not give the Bastion Guardsmen to Carison for the coming battle. And there is less than five days left before the crescent moon and the celestial alignment that will afford them their one and only chance to kill the Diamondscale. Miracles, and last chances, and hope lost. This has been the way of things for Paladin Carison Destine. With new allies and new friends, will nothing change? Part 3 Returning Raven has used the last of her magics to find safety in the only place she knows. She has transported herself to the arms of Carison Destine, Paladin of the Realm, and the man she loves. After being ravaged by a Greenscale dragon, she doesn't know if she's ready to take Carison's physical love. In his arms she finds the comfort she needs. This is love. This is strength. This is what they both need time to give each other. Only, the world is about to be at war. There is no time. There is only danger. Danger and dragons.",
  "genres": [],
  "author": "Ruth Ford Elward",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18877651-vale-of-stone-and-beyond-paranormal-mystery-suspense-and-drama-epic-a"
}