{
  "title": "Get Ogre It",
  "description": "Do you love fairy tales? Have a hunger for shape-shifting lovers? This collection of six erotic fantasies will whet your whistle and melt your Kindle. Dive into works by six of today's hottest erotica authors for a taste of the fantasy genre gone sexy. Get Ogre It: By fan request, a dirty fairy tale involving an ogre. If you enjoyed End's eighteen previous Grimm & Dirty Tales, you will take pleasure in this story of a tailor's boast and the lifestyle choices it leads to, on a fateful trip to New Jersey. Fairy Lore: Brandon's survived the fighting in Afghanistan and upon his return is ready to enjoy reading in his favorite place in the world. It's a spot near his mountain home that he calls Fairy Hollow. However, what he witnesses there will change his life for ever. Eye of Wolf: Dallas left the city of Phoenix to take a break from his werewolf pack and former lover. In Seattle he discovers Jax, and is immediately involved with hated pack politics as Jax is challenged for Alpha and must learn if he will be accepted as the first openly gay pack leader. Lust, Love, and Luck: When called to the aid of a beautiful woman down on her luck, Shamus is surprised to discover that he and Suzanna are destined to be together. Lifetime unions between mystical beings like Shamus and ordinary humans like Suzanna have been unheard of...until now. But the real question is, will Suzanna want him when she discovers that her exciting new lover is actually a leprechaun? Prisoner in the Well: All that glitters is not gold... When Abby discovers a golden tree filled with heavy, intoxicating fruit, she cannot resist its delicate temptations. But when her hunger forces her deeper into the forbidden forest, she quickly loses her way, only to be swept into a dark underworld. But she is not alone. Throughout the years, the lure of the golden tree has served as his only connection to the outside world. Now his trap was set, and all he could do was wait for her to find it. It wouldn't be long before he'd have her, and once he did, he would never let her go. Forest Nymph: Her nimble fingers dared to do it then. They undid the cord of his breeches, and what she saw beneath stole her breath away. It was more than she could’ve expected. Much more. The Forest Nymph had never seen a human before, and when she stumbles upon the bulky form of a fallen warrior, she can’t help but be curious. It’s in her nature to heal, and yet after her magics staunch his bleeding and he lay so quiet on the forest floor, she wants to know more about him. About his body. About how his skin would feel against hers.",
  "genres": [
    "M M Romance"
  ],
  "author": "A. Violet End",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/18877750-get-ogre-it"
}