{
  "title": "The City Center",
  "description": "Embark on an electrifying odyssey into the shadowy heart of Los Angeles City Center, where the facade of utopia hides sinister secrets. Ava Rhodes is about to shatter the illusion and plunge into a world of darkness and revelation. As she unearths the chilling destiny that awaits her and her fellow inhabitants, Ava's desperate flight to the Outside begins. But in the relentless pursuit that follows, Ava faces an agonizing self-preservation or the salvation of her people.In a relentless battle against the iron grip of control and oppression, Ava's journey becomes a symphony of rebellion, danger, and self-discovery.The electrifying saga unfolds across four heart-pounding volumes, each a riveting chapter in Ava's quest for truth and freedom. Join her as she navigates the treacherous depths of a dystopian realm, where the line between hero and villain blurs, and the fate of an entire city rests in her hands. Will Ava rise to the challenge, or will she succumb to the darkness that lurks within? The answers await in this pulse-pounding, suspense-laden series that will leave you breathless and begging for more.Author Simone Pond is also known as Simone DeBlasio.This story is decorated with familiar things, and at its heart contains thrilling characters and heroic journeys. - Revolution SFThe power of this novel actually comes from the world building and the action.\" - Smart Girls Love Sci-fiThe revelations before the conclusion are properly shocking and quite insidious. - SF Crowsnest˃˃˃ Here's what readers are Looking for a new page turner? My eyes are burning because I couldn't put it down. I skipped meals, sleep, yoga, I HAD to finish it.- A friend turned me on to this book, and I couldn't be happier she did. I usually take a long time to finish a book, but blew through The City Center in 2 days. Great story with really good writing. I highly recommend this book.- Fantastic first book in what I hope is a long series. I thoroughly enjoyed this imaginative journey. Ms. Pond struck a great balance between story and character development. Can't wait for more!- You had me up reading much later than I wanted to stay up last night.- You will whip through this book, it is a fast and easy read, and Ava and other characters are fully imagined and instantly enthralling. Can't wait for the next one (there HAS to be a next one, right?!?).- I just finished 'The City Center' and I loved it. I started it on Sunday, brought it to work with me on Monday to read during my lunch hour and finished it Monday night. I was quickly caught up in the characters and had a hard time putting it down until I knew how everything played out. I'm eagerly awaiting the next installment in the series!THE CITY CENTER IS A GOLD MEDAL WINNER OF DYSTOPIAN FICTION",
  "genres": [
    "Dystopia",
    "Science Fiction",
    "Young Adult",
    "Fiction",
    "Post Apocalyptic",
    "Fantasy",
    "Romance"
  ],
  "author": "Simone Pond",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/18881194-the-city-center"
}