{
  "title": "Belle Pearl",
  "description": "\"I have to say that as the conclusion for this series, it was definitely a roller coaster ride! I was shocked, I was surprised, and I was ultimately floored with the turn of events! It was that interesting and unexpected!! I absolutely LOVED this book and devoured every minute.\" --Kawehi Book Blog 5 Stars. \"I've loved Alexandre since book 1. Reading the series from his POV just made me love him more.\" --Nade Ferrabee \"Can Pearl and Alexandre really have their HEA? You must read to find out. But I PROMISE you, it is a truly amazing ride and finale. One you will never see coming! Sam Stettner This book continues from where we left off in Pearl, from Alexandre’s point of view, and continues the story BEYOND Shimmers of Pearl so has a completely different ending than the trilogy. As with the book Pearl, there are many scenes in this novel that do not feature in the first three Pearl books told from Pearl's point of view. Belle Pearl, is the fifth book and the conclusion to Arianne Richmonde’s bestselling books in The Pearl Shades of Pearl, Shadows of Pearl, Shimmers of Pearl, and Pearl; the tumultuous and heart-rending love story between 40-year-old documentary producer, Pearl Robinson, and French Internet billionaire, Alexandre Chevalier, fifteen years her junior. At only twenty-five, Alexandre Chevalier is a billionaire. His social media site, HookedUp, is more popular than Twitter, more global than Facebook. With his devastating looks, alluring charm, and his immense wealth, he has women falling at his feet, desperate for his attention—ex girlfriends and an ex-fiancée who simply cannot let him go. Although his heart is set on only Pearl, she tests him to his limits and proves that she is even more damaged than he first believed. Alexandre’s dark and dysfunctional past makes him crave a normal relationship with Pearl but he soon finds out that she is anything but your average woman. However, he believes that they are both two peas in the same dysfunctional pod, made to ‘dis-function’ together, and is determined to make their union work. But Pearl puts Alexandre in a position where he is made to choose. His loyalties are split, his patience torn. After many trials, misunderstandings, and revelations of dark secrets, their wedding finally ensues and it looks as if their happily ever after is sealed. Until something unforeseen rips their world apart. This is novel #5 - the conclusion to the Pearl Series and is by no means stand-alone. Reading Shades of Pearl Shadows of Pearl Shimmers of Pearl Pearl Belle Pearl",
  "genres": [
    "Erotica",
    "BDSM",
    "Erotic Romance",
    "Contemporary Romance",
    "Romance",
    "Fiction"
  ],
  "author": "Arianne Richmonde",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/18880564-belle-pearl"
}