{
  "title": "Masters at Arms & Nobody's Angel",
  "description": "This is a combined volume that includes the first two books in the bestselling Rescue Me series. MASTERS AT ARMS remains available as a separate FREE download, but the author has combined it with NOBODY'S ANGEL and is offering the combined volume at a significant discount and has removed the second book from being sold separately.BONUS MATERIAL in the March 2014 Kallypso Masters has added the PLAYLIST of music that inspired her as she wrote about the first three couples mentioned in this combined volume, as well as a GLOSSARY OF TERMS and a CAST OF CHARACTERS in these books in the saga.MASTERS AT ARMS (book 0.5) begins the journey of three men, each on a quest for honor, acceptance, and to ease his unspoken pain. Their paths cross at one of the darkest points in their lives. As they try to come to terms with the aftermath--forging an unbreakable bond--will they ever truly become masters of their own fates? Or would fate become masters of them?NOBODY'S ANGEL (book 1): Marc d’Alessio might own a BDSM club with his fellow military veterans, Adam and Damian, but he keeps all women at a distance. When Marc rescues Angelina Giardano from a disastrous first BDSM experience at his club, however, an uncharacteristic attraction leaves him torn between his safe, but lonely world, and a possible future with his angel.Angelina leaves BDSM behind only to have her dreams plagued by her Italian angel in a wolf mask. When she meets Marc at a bar in her hometown, she can’t shake the feeling she knows him, but has no idea why he reminds her of her angel. Marc’s search-and-rescue partner, widower Luke Denton, believes Angelina is the angel his wife promised to send him, convincing Marc she’s meant for Luke. While trying to protect Angelina from her abusive ex, though, Marc once again finds her at the Masters at Arms Club where she turns his safe, controlled world upside down.The books in the ongoing Rescue Me saga are not stand-alone stories and should be read in order. Characters recur to deal with further issues in their lives as the saga continues and each book builds upon all previous ones.CONTENT This story might cause triggers while reading. Please read the Author's Notes at the beginnings of each book in this collection before purchasing. No one under the age of 18 is depicted in criminal acts of incest in this book. The character who suffered this abuse is 19 when her story begins in Masters at Arms.",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Contemporary",
    "Military Fiction",
    "Amazon",
    "Adult"
  ],
  "author": "Kallypso Masters",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/18880706-masters-at-arms-nobody-s-angel"
}