{
  "title": "Others of Edenton: Box Set - New Beginnings, In Too Deep, Shadows Fall, Shadows of the Past",
  "description": "18+ Adult Content- New Beginnings -Jess was tired of being under appreciated in her old pack. She took a chance and moved to Edenton. Slater is her new Alpha. He can't seem to stay away. Neither were looking for someone, but they both found what they needed in each other. There's just one problem. Someone wants control of the pack and he'll stop at nothing to get it. Sassy psychic werewolf, hot Alpha, crazy second- In Too Deep -Fallon is a brilliant tattoo artist with inherent magic. Tired of men and their games, she climbs onto her Harley and leaves her old life behind. Brody is a talented motorcycle mechanic and werewolf stuck in his painful past. It’s just another depressing night until he’s attacked by vampires. Thinking he killed them, he runs into the night and crashes into Fallon. Sparks fly.- Shadows Fall -Amethyst Lakes is a nymph with a problem. She left her ex-boyfriend when he started to smother her. Nothing she says seems to keep him away. Carl needs Amethyst more than he needs to breathe, but she just doesn’t get it. He’ll stop at nothing to make her stay. An old friend and teenage crush will keep her safe until Amethyst can decide how to deal with Carl once and for all.- Shadows of the Past -Amethyst is a nymph with regrets. She moves to Edenton to start over. Hayden is a suspicious Sheriff who hasn't been interested in women in ages. That all changes when one of his officers drags Amethyst into his life. An old Fae nightmare is after Amethyst, he needs her to take his old form. Hayden will stop at nothing to protect Amethyst, but she may be the only one who can stop the Shadow.",
  "genres": [
    "Shapeshifters",
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Vampires",
    "Erotica",
    "Magic"
  ],
  "author": "Brandy L. Rivers",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/18883551-others-of-edenton"
}