{
  "title": "Lone Wolf Rising",
  "description": "Rebecca Winter's life was about to be turned upside down and there was very little she could do about it. She thought she could juggle the responsibilities to her family, school, and her werewolf pack. She really did. That was before she became the new pack alpha; before her entire pack was massacred only days before her first transformation. Now her list of responsibilities has grown and the number of people out to get her, romantically or otherwise, has grown too. Lucian LaMont has a set direction in his life. He planned to work as a supernatural protector until he was 27 and then he would marry his fiancé Felicity, retire and live the dream. That was until Rebecca crossed his path. The spunky new alpha stole his heart at first glance. Now his desire has turned darker and his future does not look as golden as he once thought. Gabriel Black has had a tough couple of years. His father disowned him. He became the leader of the rogue wolves that were banished. And now, he learned that his father was massacred along with the rest of his family and friends from the Arizona Pack. Enough was enough! He decided to take matters into his own hands. That was until he met Rebecca and the sparks flew, literally. The odds were against him, but he finally believed he found his mate. There was just one problem; she had eyes for one of his best friends. Savannah Winters had no idea what her twin sister Rebecca was up to, but she intended to find out. Since their parents’ death ten years ago Rebecca has struggled with depression and anger. She never really got over their untimely demise. Savannah was always able to pull her out of her funk, but things were different this time. Instead of pulling Rebecca out, Savannah was being pulled into the dark underbelly of the paranormal world and when this ends things would never be the same. Rebecca and her friends will have to figure things out while she learns to navigate the dark supernatural world that exists hidden beneath the reality humans created. Around every corner is danger, suspense, romance and intrigue. Rules don't apply to this alpha and very little about the supernatural political landscape will remain the same when she is through with it.",
  "genres": [
    "Paranormal",
    "Vampires",
    "Urban Fantasy",
    "Fantasy",
    "Romance",
    "Werewolves",
    "Supernatural"
  ],
  "author": "Jami Brumfield",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/18885092-lone-wolf-rising"
}