{
  "title": "Utterly Sluttily",
  "description": "Find out why readers are calling it ‘Utterly Entertaining’, ‘Utterly Delightful’, ‘Laugh out loud funny’ and ‘Sizzling Hot’. When Daisy Delaney is dumped at the altar, she has no idea how far reaching the consequences of her subsequent meltdown will be. Hot-footing it on her honeymoon to escape the humiliation and horrors unfolding on YouTube, Daisy decides to reclaim her life and re-write the rules for jilted brides everywhere. In a resort bursting with sun, sea and solid abs, Daisy soon realises that when you shed the ‘good girl’ tag and behave ‘utterly sluttily’ that just about anything can happen. Through steamy encounters and sexual firsts, she embarks on a whirlwind journey of self-discovery, until beautiful stranger, Nathan Carrington, offers her lessons in liberation she’ll never forget. Every holiday has to come to an end, but is the end of the romance just as inevitable? With a new found confidence and love of messy orgasms, as well as an international movement rallying in her defence, Daisy begins to wonder; Does everything happen for a reason? Does every cloud have a silver lining? Is strawberry daiquiri the devil or a bad girl’s best friend? ‘Utterly Sluttily’ is a contemporary, hot erotic romance containing graphic descriptions of sex and is recommended for adult readers. ‘I politely turned down Richard’s offer of a trip to town, watching him tuck his eye-watering foot long back into those transparent shorts before I waved him goodbye. I crawled out of bed, holding my digits as far away from my body as humanly possible, squeezing on the soap and washing them. Several times. I didn’t think I was a prude, but the thought of Richard’s lunch on my fingers made me feel a bit squeamish. I stared at my reflection in the mirror wondering what the hell I’d just done and what other titbits of strange fun I might be exposed to on my holiday. It was already turning out to be a lot more interesting than I'd ever anticipated and I was only three days in!’",
  "genres": [
    "Erotica",
    "Romance",
    "Contemporary",
    "Humor",
    "Erotic Romance"
  ],
  "author": "L.J. Dee",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/18880395-utterly-sluttily"
}