{
  "title": "Jokerman",
  "description": "***** \"Outstanding spy thriller...The action is fabulous, well worthy of a blockbuster movie.\" - Jackie, Amazon reviewer  ***** \"The story... was riveting...[T]he ending was very surprising and one I truly did not expect.\" - RAC, Amazon reviewer  ***** \"An amazing tale... twists, turns and leaves you breathless... A fabulous read\" - Darren Oliver-Jones, Amazon reviewer   John Purkiss, the Ratcatcher, returns   On a summer’s morning in the leafy, well-to-do English county of Surrey, the Home Secretary is conducting a highly secret meeting with a member of MI5, the British Security Service. A sniper takes aim, hits his target, and a chain of events is set in motion that will have momentous repercussions.  John Purkiss is tasked with hunting down rogue spies within SIS, Britain’s overseas intelligence service. So when he’s asked to investigate an assassination suspected to have been the work of an agent within MI5, he refuses. The Security Service can catch its own rats.  Then Purkiss is subject to a violent attack in his own home, an attack which leaves his closest friend near to death. And suddenly he has a personal reason for becoming involved.  Gradually his pursuit of the truth exposes a tortuous conspiracy which reaches deep into the heart of British counterintelligence and the body politic. Forced to enlist the help of an old enemy, a man he’d sworn to kill, and in an atmosphere of increasing paranoia and distrust, Purkiss finds himself doubting the motives of the very people closest to him, as he nears the final, climactic showdown with the killer known as the Jokerman...  Praise for the John Purkiss novels by Tim Stevens  ***** \"Superb spy thriller...The prose is so vivid you can almost feel the action as it takes place...\" - Jeremy Duns, author of The Dark Chronicles  ***** \"A high octane, fast-paced spy thriller... superb and captivating story... a great, heart-pounding read!\" James Masters, Goodreads reviewer  ***** \"[J]oins Lee Child, David Baldacci and John D. MacDonald on my list of great spinners of thrillers.\" Edward F. Corbin, Amazon reviewer  ***** “This innovative thinking man’s thriller will become a classic...” D. V. Kokkinos, Amazon reviewer  ***** \"[T]he new master of the genre.\" FlyGuy, Amazon reviewer",
  "genres": [
    "Espionage"
  ],
  "author": "Tim  Stevens",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/18883019-jokerman"
}