{
  "title": "Water, Peace, and War: Confronting the Global Water Crisis",
  "description": "This pioneering and authoritative study considers the profound impact of the growing global water crunch on international peace and security as well as possible ways to mitigate the crisis. Although water is essential to sustaining life and livelihoods, geostrategist Brahma Chellaney argues that it remains the world’s most underappreciated and undervalued resource. One sobering fact is that the retail price of bottled water is already higher than the international spot price of crude oil. But unlike oil, water has no substitute, raising the specter of water becoming the next flashpoint for conflict.Water war as a concept may not mesh with the conventional construct of warfare, especially for those who plan with tanks, combat planes, and attack submarines as weapons. Yet armies don’t necessarily have to march to battle to seize or defend water resources. Water wars—in a political, diplomatic, or economic sense—are already being waged between riparian neighbors in many parts of the world, fueling cycles of bitter recrimination, exacerbating water challenges, and fostering mistrust that impedes broader regional cooperation and integration. The danger is that these water wars could escalate to armed conflict or further limit already stretched food and energy production.Writing in a direct, nontechnical, and engaging style, Brahma Chellaney draws on a wide range of research from scientific and policy fields to examine the different global linkages between water and peace. Offering a holistic picture and integrated solutions, his book promises to become the recognized authority on the most precious natural resource of this century and how we can secure humankind’s water future.",
  "genres": [
    "Environment",
    "Geology",
    "Politics",
    "Nonfiction",
    "Economics"
  ],
  "author": "Brahma Chellaney",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/18880479-water-peace-and-war"
}