{
  "title": "The Barkeep",
  "description": "2015 Edgar Award NomineeJustin Chase is the perfect barkeep, tending bar as he lives his life, in a state of Zen serenity. At least until Birdie Grackle, a yellow-haired, foul-mouthed alcoholic from Texas, walks into his bar, orders a Mojito, and makes a startling confession.Six years ago Justin’s life was ripped apart when he discovered his mother’s bludgeoned corpse in the foyer of the family home. Now Justin’s father is serving a life sentence and Justin, after a stint in an asylum, drowns his emotions in a pool of inner peace. But when Birdie Grackle claims to be the hit man who murdered Justin’s mother for the money, Justin is hurled back to the emotions, the past, and, most frightening of all, the father he tried to leave behind.Who hired Birdie Grackle to kill Justin’s mother? Was it Annie Overmeyer, the sexy young woman with whom Justin’s father had been having an affair? Was it Justin’s brother, who took advantage of his father’s conviction to take control of the family business? Was it someone from his mother’s secret life, the shocking details of which Justin is only learning now? Or was it maybe his imprisoned father, to whom Justin is suddenly growing dangerously close? For all of Justin’s efforts to banish emotion and attachment from his life, this searing journey into his past affects him in ways he could never have anticipated.As Justin pieces together the truth, a merciless killing machine begins stalking him, leaving a trail of dead in his wake. Someone wants to bury the truth, and maybe Justin, too. As the terror closes in, Justin had better find some answers quick, because the stakes have been raised—his life is on the line and murder is just not Zen.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Crime",
    "Suspense",
    "Audiobook"
  ],
  "author": "William Lashner",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/18882072-the-barkeep"
}