{
  "title": "A War Hero Returns",
  "description": "Another romantic thriller from AWARD WINNING NOVELIST JOHNNY RAY, one of Amazon’s bestselling authors. This MILITARY/CIA romance involves a female war hero who returns to America to face the biggest challenge of her life.    An International romantic thriller from one of Amazon’s bestselling authors. A spellbinding novel with gripping scenes of mesmerizing events that rivet your very soul.     While Suzan Mercer’s father promised in his dying words the land he left her would bring her love, she never anticipated the events involved in the process.  Now, could she balance her new love life with her hidden CIA commitment? Could she?      After serving eight years in the army, Suzan Mercer returns from Afghanistan to Florida as a female war hero–her works as a CIA operative, of course, would always be hidden.  She couldn’t believe her mother had used a power of attorney while she was gone to sell the land her father had left her. After learning her mother also has early onset Alzheimer's and claims to have been taken advantage of by Matt Harris, the billionaire developer involved, Suzan uses her military and CIA training to plot her revenge and to reacquire her land.  Entering a world where high heels replace combat boots and deep red lipstick becomes more deadly than a colt 45, Suzan never anticipated the cost to reacquire her land would be losing her heart. Matt also learns his money and power cannot acquire the one asset he has always lacked in his life as he ventures into untested skies without a golden parachute to save him. Also, would the ghost of his playboy image come back to haunt him?      What others are saying about Johnny Ray’s novels.   Geneva wrote, “Wow, what a story! Powerful yet sensitive.” Patti wrote, “The Author did justice with writing this great book. Thank You! I hope there are more books out there just like this one.” Mandy wrote “A very entertaining read. That gives you everything you could ask for in a romantic suspense thriller.” JT wrote, “If you like romance, and if you like thrillers, you are going to love this romantic thriller.” Anya wrote, “An eBook that I heartily recommend to any that love a bit of love with their suspense.”      Return to the upper right corner to purchase your copy now!",
  "genres": [
    "Contemporary Romance"
  ],
  "author": "Johnny Ray",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/18888128-a-war-hero-returns"
}