{
  "title": "Forsaken",
  "description": "Book #2 in the Ancients of Light SeriesThe Prophecy Will Be Fulfilled...Ancients were created in the beginning of the age of man. The Vampire were birthed by the underworld after mankind’s fall from grace to destroy what remained of God’s people. This threat to Creation was countered with divinely-breathed immortals. The Witch were most effective against the nefarious agenda pursued by the evil ones. An arcane Prophecy proclaims that the divine purpose of the Ancients of Light will be fulfilled, beginning with the rise of the Chosen. Now the Queens will join her…Fire is her Destiny...Ella long ago determined she would not live a life where magic defined her. Feeling no kinship with her Caste, she walked away from the Realm and its conflicts. She found acceptance and fulfillment in her life amongst the mortals and is on the brink of achieving her dreams. Darkness is His Curse...Nicholas is the most revered warrior in the Darks’ army. His personal animosity towards the Light drives his existence and draws him to the one Witch he is set on controlling. Nicholas knows the reasons that Ella never found acceptance within the Fire Caste of Witch and he will use that knowledge to pursue his Dark agenda. When Light and Dark Collide...Despite her origins, Nicholas discovers more in Ella than just a powerful Fire Witch, leading him beyond the Dark evil that has plagued him for eight centuries. Ella disregards the inherent calling of her breed for the only true belonging she has ever experienced, the love she finds with her Dark Vampire. The beginning of the very Prophecy that will save the Light tears the pair apart and the fallout threatens their existence. When two of the most powerful immortals on opposite sides of Realm collide in divinely-inspired fate, neither will escape unscathed. Only when the Forsaken finds grace will Ella and Nicholas be able to fulfill the destiny that has always been meant for them.About the Ancients of Light seriesChosen is the first in the thirteen books of the Ancients of Light series and is only the beginning of a young Witch’s journey toward developing both the strength of character and magic that will be required to fulfill her prophesied role as leader of the Light faction. Revelations of nuances in the Prophecy - facets that were never fully comprehended by the Ancients - will continue in successive stories. The culmination of its true meaning in the destiny of the supernatural world of the Realm will only be revealed when Kaitriana is adequately prepared to lead the Warriors now being called together to champion the Light’s purpose. Familiar characters return for each storyline as the focus turns to a new key couple in every book - a pair that significantly factors into the purpose of Light – however, the story of the Chosen does not end with Book #1. Kaitriana and Lorcan, their growth together as partners in leadership and in love as a couple, will thread through the series as Kaitriana assumes the role that was destined as hers since the beginning.",
  "genres": [
    "Paranormal Romance",
    "Witches",
    "Vampires",
    "Magic",
    "Fantasy",
    "Romance",
    "Paranormal"
  ],
  "author": "Heather Fleener",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/18887805-forsaken"
}