{
  "title": "Staking His Claim",
  "description": "Twenty-one-year-old Elaina Ruiz has only just begun college when she meets Raul Vega for the first time. Recognizing his ruthless intensity for what it is, she doesn’t correct him when he assumes she is an eighteen-year-old freshman.Raul Vega has never met a woman he couldn’t do without. Until he meets Elaina Ruiz and knows she has to belong to him--even if it means waiting for her to grow stood in the circle of young people feeling so emotionally free and happy she was almost delirious with it. She had finally made up her mind to withdraw from nursing school, had gotten over the guilt, and had told her aunt what she planned to do. Much to her surprise, Janie had been one-hundred percent supportive. They had talked for nearly two hours, and Elaina was going to start looking for a job close to the ranch when the hustle and bustle of the holiday season was over.Janie had well and truly convinced her that she and Brian wanted her to stay with them, and for as long as she wanted.Elaina now stood, leaning slightly against the wall, feeling completely free and easy and enjoying the conversation around her and the slight buzz that half a glass of champagne had induced.A small, happy smile on her face, she glanced across the room and her eyes tangled with the dark, intent stare of Raul Vega.Butterflies hit her stomach, and she actually felt her knees get weak. Her smile slipped a bit, and she felt a full-blown blush spread across her cheeks and warm her face.His gaze never left hers as he made his way across the room to where she was standing.She was held enthralled as she watched him approach and briefly acknowledge the people around her, before he simply reached out a hand to her and said, \"Come.\"Her blush deepening, she didn't think to refuse him and put her hand in his, murmuring, \"Excuse me,\" to her circle of new friends.Turning back the way he came, he pulled her with him into the privacy of the study. He shut the door, leaned back against it and crossed his arms over his chest.She turned in a half circle to face him, her heart beating triple time as he stood silently observing her. The beat of the music from the other room bled through the thick wooden door making the enclosed area of the study seem even smaller, shut away from the rest of the party. She couldn't stop the trembling in her fingers, and the champagne glass wobbled precariously.His eyes narrowed in on it. \"You think you should be drinking that?\"She already had enough alcohol running through her system on an empty stomach, and the effort it was taking to hold the liquid still in the glass suddenly seemed more than her nerves could handle. She reached over and set it down on a side table. \"Probably not,\" she agreed mildly.As she turned back, it occurred to her that he was suggesting she shouldn't drink because of her youth, and not because of her nervous state.Once again, she chose not to enlighten him.He spoke, his voice rough but controlled, \"You know sweetheart, I get that you're young. Too young for me. But I think you're old enough to know what you're doing to me.\" The look he gave her was speculative, thoughtful. \"Are you doing it on purpose?\"The question caught her off guard and her breath snarled in her throat. \"No.\"He continued as if she hadn't answered, his voice turning feral, \"I don't think it's escaped your notice that I'm jealous of Trevor. And I think you're using it against me.\"She expelled a shallow pant of air. His disclosure sent an intoxicating blend of heady power and beguiling need through her veins. Her denial came quickly, \"No, I'm not.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Erotica",
    "Contemporary",
    "Westerns",
    "Erotic Romance",
    "Short Stories"
  ],
  "author": "Lynda Chance",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/18889973-staking-his-claim"
}