{
  "title": "Steel Horse Cowboy",
  "description": "Chelsea hadn’t been living her life to the fullest...until her beloved Grandmother Rosie past. A letter she left her granddaughter inspires Chelsea to walk away from the life she had and start living the life she wanted. Even if she wasn’t sure what that was. Leaving her condo in Colorado, stepping down from her high paying job and walking away from her fiancé was just the beginning on her journey to find her true self. Thinking she’d find answers on the road Chelsea found herself following the rodeo circuit.Scotty had never seen a more gorgeous creature before the day he saw her ride up on a horse next to his sister. Auburn hair shining in the sun, skin tight jeans that looked like they had been painted on and sassy, sexy as hell red cowgirl boots in the stirrups topped off her smokin’ country girl appeal. Just so happens a couple months later he would have a chance to get his hands on her as he escorted her down the aisle...of his sisters wedding. Sharing a dance at the reception wasn’t enough of her or her whiskey colored eyes.Not understanding the draw she had to him was confusing. The man was as far from a cowboy as you can get-yet Chelsea still found him to be the sexiest man she’d ever seen. One night of unadulterated passion would haunt her for far longer than she had ever guessed. Living with the longing, the pain and sadness on her own was her doing but would caving into Scotty again leave her healed or leave her hurting once more?Could a motorcycle bring them back together and is it their journey now and not just her own? This novel contains one certified cowgirl searching for her cowboy but stumbling across a hot ass biker man instead. He gives her the road trip of a lifetime and she rides him like a Harley on a bad piece of road!This book is part of a Series but can be read as a stand alone",
  "genres": [],
  "author": "Sidda Lee Rain",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/18889340-steel-horse-cowboy"
}