{
  "title": "Georgetown Academy 1 and 2",
  "description": "FOR A LIMITED TIME ONLY! Get the first two books of the Georgetown Academy series in a special summer bundle! Gossip Girl producer Josh Schwartz calls Georgetown Academy “Smart, sexy and insanely addictive.” Now it’s your turn to get hooked. It’s the beginning of a new political administration. That might not mean much at most high schools, but at Georgetown Academy, Washington D.C.’s most elite prep school, January 20th means new alliances, new flings, and new places to party. For self-proclaimed D.C. royalty Brinley Madison (of those Madisons), the first day of school is all about establishing the social hierarchy and playing the part of perfect political wife to her boyfriend, the outgoing Vice President’s son. Too bad he has a wandering eye that puts Bill Clinton’s to shame. Can she keep him, and her own secret vice, in check? Ellie Walker, Brinley’s best friend, floats through the halls on the arm of golden boy Hunter McKnight. But when her ex-boyfriend, Gabe, returns to town and her Senator mother’s political nemesis is reelected, Ellie’s world is turned upside down.Shy, quiet Evan Hartnett is more into books than beer, and her closet is full of t-shirts and jeans instead of Jason Wu and Jimmy Choo. No one’s ever really noticed her—but she’s been noticing them. When her star rises as an intern at D.C.’s most-watched political news show, she soon finds herself asking what’s secret and what’s fair game. New girl Taryn Reyes is all laid-back, California cool; with a father who’s in line to be the first Hispanic president, she’s ready to dive into the D.C. scene with an open mind. But after her first run-in with dirty politics, she realizes that keeping her integrity intact might be a lot harder than she thinks.With so many new friends and former flames in the mix, things are bound to get a little heated. And while diplomatic immunity might keep the cops away, there’s not much it can do about the press. In a town where one teenage misstep can turn into a national scandal, the students at Georgetown Academy will have to be on their best behavior—or, at least, they’ll have to make the world believe that they are. Because there’s only one rule: whatever you do, don’t get caught. About the AuthorsJessica Koosed Etting and Alyssa Embree Schwartz met the first day of freshman year at the University of Southern California and instantly bonded over their obsessions with Brenda Walsh, Robin Hood: Prince of Thieves and The Babysitters Club books they read growing up. After spending a full year mourning the end of college, they began writing television and feature scripts together. They have set up pilots at ABC, NBC, Fox and CW, and sold films to The Weinstein Company, Happy Madison, Paramount, New Regency, MGM and Alloy Entertainment. They love writing female-centric stories, especially for teen and tween audiences, mainly because they still think they are the 18-year-old girls they were when they first met at USC.http://www.georgetownacademyseries.com",
  "genres": [],
  "author": "Jessica Etting",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/18890576-georgetown-academy-1-and-2"
}