{
  "title": "Black Knights Inc. Boxed Set: Volumes 1-3: Hell on Wheels, In Rides Trouble, Rev It Up",
  "description": "Alternate cover edition can be found hereBehind the facade of their tricked-out motorcycle shop is a covert team comprised of the most elite ex-military specialists.Now, get the first three books in one bundle: Hell on Wheels, In Rides Trouble, and Rev It Up.About the Books in This Bundle1. Hell on WheelsEx-Marine Nate Weller is an expert at keeping his cool, which is how he keeps his feelings for Ali Morgan in check. Sweet, sexy Ali is his best friend's sister...and totally off limits. Ali's never seen anything sexier than Nate straddling his custom Harley-or the flash in his eyes when she tells him she's in trouble. With Nate, her life is in his capable hands--but her heart is another story.2. In Rides TroubleTrouble tends to find Becky Reichert. Like the day ex-SEAL Frank Knight showed up, wanting to use her shop as a cover for his special ops team. Becky prides herself on being able to weld and shoot just as well as the big boys. But while munitions and mayhem are Frank's way of life, the last thing he needs is Becky in the way. Yet it's just his luck when she ends up in a hostage situation. Come hell or high water, he will get her back...3.Rev It UpEx-SEAL Jake \"the Snake\" Sommers was known for striking quickly, quietly, and lethally. That's also how he broke Michelle Carter's heart. It was the only way to keep her safe-from himself. Four years later, Jake wants another chance, but Michelle has never forgiven him. But when her brother ticks off a mobster, she must do the unimaginable: place her life in Jake's hands. And once she does, he'll never let her go...",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Suspense",
    "Military Fiction",
    "Contemporary Romance",
    "Military Romance",
    "Fiction"
  ],
  "author": "Julie Ann Walker",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/18893430-black-knights-inc-boxed-set"
}