{
  "title": "Yang Shen, The God from the West, Book I",
  "description": "Only one man dared fight to defend Shanghai from rebel hordes - the American adventurer who called up a ragtag band of deserters to defeat armies of thousands.\"A master in hell before a minion in Heaven. I'll be a prince in China, and lord over these heathen beggars, or I'll make a great many of them wish they'd better joss - better luck - than to cross my bow.\"Arriving in the midst of the bloodiest civil war in human history, Fletcher Thorson Wood takes up the imperial cause against the \"Christian\" rebels, trains and fights beside native Chinese troops, mandarins, and \"Manilamen,\" builds the most powerful Army in China, and as reward for his achievements grateful Chinese appoint Fletcher a mandarin of high rank, a general, and even honor him with a temple near Shanghai.Yang Shen makes the reader see, feel, and understand the tumult of 1860s China - \"the ships and weapons, the countryside with its intricate network of canals, the arcane maneuverings of Chinese politicians and merchants and the equally complex rivalries among the foreign powers, the squalid bars and brothels whose denizens simply struggled to survive each day, and the equally squalid conditions of the Chinese people in their villages.\"Yang Shen is also about the encounter, sometimes the clash, of Americans and Chinese. More than a historical adventure, this novel recreates times long past, places long lost in China, and long-silent voices of people in America, China, England and the Philippines who lived through cataclysmic events that echo still.[Note: Yang Shen, the God from the West, Book I (2nd Edition) is the same story as Yankee Mandarin (Yankee Mandarin is reduced to bare essentials, removing all the paraphernalia having to do with the print edition, all the Chinese language, and the notes and reading list, but leaving the glossary.)]",
  "genres": [],
  "author": "James Lande",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/18893416-yang-shen-the-god-from-the-west-book-i"
}