{
  "title": "Board Stiff",
  "description": "As director of the Ballantyne Foundation on Sea Pine Island, SC, Elliott Lisbon scratches her detective itch by performing discreet inquiries for Foundation donors. Usually nothing more serious than retrieving a pilfered Pomeranian. Until Jane Hatting, Ballantyne board chair, is accused of murder. The Ballantyne’s reputation tanks, Jane’s headed to a jail cell, and Elliott’s sexy ex is the new lieutenant in town. Armed with moxie and her Mini Coop, Elliott uncovers a trail of blackmail schemes, gambling debts, illicit affairs, and investment scams. But the deeper she digs to clear Jane’s name, the guiltier Jane looks. The closer she gets to the truth, the more treacherous her investigation a brutal attack on her own suspect and the murder of a witness. With victims piling up faster than shells at a clambake, Elliott realizes she’s next on the killer’s list.Part of the Henery Press Mystery Series Collection, if you like one, you'll probably like them all! BOARD STIFF is the first book in the Elliott Lisbon humorous mystery series. To get a preview of Elliott and her adventures, check out SWITCH BACK, the prequel to BOARD STIFF featured in the interconnected mystery novella OTHER PEOPLE’S BAGGAGE.Praise for Kendel’s Elliott Lisbon “Completely entertaining! A solid and satisfying mystery, yes indeed, and the fabulous and funny Elliott Lisbon is a true gem! Engaging, clever and genuinely delightful.” – Hank Phillippi Ryan, Agatha, Anthony and Macavity winning author“Margaritas and blue lump crabcakes, sun-bleached shells and briny air. Kendel Lynn captures the flavor of the South, right down to the delightfully quirky characters in this clever new mystery series. Elli Lisbon is the Stephanie Plum of the the South!” – Krista Davis, New York Times bestselling author of the Domestic Diva Mysteries“A sparkling new voice in traditional mystery.” – New York Times Bestselling Author CJ Lyons“A cross between an educated, upper class Stephanie Plum and a less neurotic Monk. Put this on your list for a great vacation read.” – Lynn Farris, National Mystery Review Examiner at Examiner.com“Elliott is smart and sassy, takes no guff and pulls no punches. Packed with humor, romance, danger and adventure, this is a good mystery full of plot twists and turns, with red herrings a plenty and an ending that I found both surprising and satisfying.” – Cozy Mystery Book Reviews",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Cozy",
    "Amateur Sleuth",
    "Romance",
    "Southern"
  ],
  "author": "Kendel Lynn",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/18895085-board-stiff"
}