{
  "title": "Yoga For Beginners - A Beginners Guide to Yoga Lifestyle, Therapy & Weight Loss",
  "description": "In this comprehensive Yoga guide for the beginners, you'll find:• Step-by-step instructions to set you on your personal explorations with Yoga• 3 Pranayama exercises that can help you lose weight, treat insomnia and blood pressure, eliminate chronic ailments, calm your mind and bring a healthy balance to your life - all at the same time!• 5 simple Yoga poses that can burn-off more calories than that in a banana-split - within no time!• 7 Yogic lifestyle principles that can help you embody the peace and mindfulness like the Mystics• What you don't know WILL hurt you. If you ignore this cautionary information, you'll end up with more health issues than you already have! \nThis book aims at changing your life by changing your entire lifestyle.\nDo you wonder what makes the Yogis and Mystics so peaceful at heart? The same principles that have worked for countless people who've tried to regain a balance between health, diet, body, and mind - are all detailed in this book!Chapter 1 will serve as an informal introduction to Yoga, and its fundamental concepts. It'll make you understand what it's not and what it actually is.Chapter 2 covers the information that every beginner should be aware of. It explains the right way to prepare for a Yoga session and also lists the pre-requisites for Yoga practice.Chapter 3 is a crucial section of this book that shouldn't be missed. It answers the most frequently asked questions, and lists the cautions that you need to bear in mind before getting started with your Yoga practice.Chapter 4 explains the potential of Yoga as an alternative therapy, why it's getting widely accepted by most healthcare practitioners in the country, and how it can benefit you as well.Chapter 5 embarks you on the journey by laying the foundation stone of your Yoga practice - Pranayama. You will learn about what Pranayama is and why it will prove as an amazing therapy for your health issues.Chapter 6 goes further in detail on the topic of Pranayama and teaches you the anatomy of all breathing exercises. There all some cautions mentioned here as well.Chapter 7 gets you going by helping you learn and practice the main postures (Asanas) associated with Yoga, so you can use them to do Pranayama.Chapter 8 is all about the 3 most effective breathing exercises in Pranayama, their benefits and the right way to do them.Chapter 9 focuses on the relationship between Yoga and weight-loss. You'll learn about the important aspects that relate to this concept. It will answer most of your questions on the topic and tell you about the ideal diet that'll complement your Yoga practice.Chapter 10 lays out the Yogic exercises that will make you shred some pounds and get rid of that excess fat. You'll also learn how to practice all the major Asanas (poses) that are proven to make anyone lose weight.",
  "genres": [],
  "author": "Anisha Lee",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/18894366-yoga-for-beginners---a-beginners-guide-to-yoga-lifestyle-therapy-weig"
}