{
  "title": "War Paint",
  "description": "GO WEST YOUNG MAN...George Alwood III, is a spoiled and rich young man who heads west to become a mountain man in 1825. Taken under wing by two experiencedold mountain men, George Alwood the third becomes Bear Killer the mountain man.After a short visit with Shoshoni Indians, Bear Killer finds himself with an unwanted wife and though he resist's, he eventually learns to love her. A cold and hard winter in the mountains brings him closer to his bride, as he learns to live as a mountain man, and just before spring she informs him a child will soon come. Content now, with a canvas shelter, campfire, dried meat, and soon to be family, Bear Killer reflects on his rich and pampered background.After his wife and unborn child are killed by white men, the young mountain man makes a promise to avenge their deaths and he's swept up into a deep sense of rage. He finds, however, the men he is searching for are hard men to pin down and even harder to kill.About the AuthorW.R. Benton is a retired United States military senior non-commissioned officer (E-8). He is a graduate of a number of U.S. Air Force Survival Schools, including Arctic, Water (Sea and Ocean), Mountain, and Jungle survival schools. He spent twelve years teaching parachuting techniques and survival skills to Air Force aircrew members as a Life Support Instructor.Mr. Benton currently works as a freelance Wilderness Survival and Outdoor writer for a number of North American Magazines (Buck Masters, Modern Survival, Big Game Hunt, and many others). He is a published author with six books in print.Reviews:\"War Paint is a blood-thirsty brutal book. It will disappoint those who seek the triumph of good over evil.Outstanding.\"—James Drury, \"The Virginian\".“As a (Senior) Master Sergeant in the US military, W. R. Benton became a man of action and lived the “code of the west,” which is very well reflected in his westerns and especially in his newest, WAR PAINT, an action-packed story of love, struggle, betrayal, and revenge set in the wildness of the Old West. It is a must read for anybody who loves westerns. You will not be able to put the book down.”—Don Bendell, Author of 23 books, including the western Colt series, with over 1.5 million books in print worldwide.“WAR PAINT is for the western reader who wants to read something different, and for the western enthusiast who likes to know there is accuracy and authenticity in them thar pages. It’s an exceptionally good read, excellent plot, beautifully drawn characters, and well sustained from start to finish.”—Mel Hague, Author of Death on a Rope, and others, and Recording Artist of 17 albums“W.R. Benton understands Indians, mountain men, and the fur trade, and puts it all down in a whoppin' good read called War Paint.”—Steven M. Ulmen, Author of Toby Ryker.\"My grandfather was a rancher in Colorado, where I grew up and one of last of the rugged men who were responsible for taming the wild west. He liked Louis L' Amour. He would have loved WR Benton.\"—Robert Woods, actor\"I welcome W.R. Benton to the small fraternity of writers who love the mountain men.\"—Alfred Wallon, Author of “The Promised Land,\" German Western Author",
  "genres": [
    "Westerns"
  ],
  "author": "W.R. Benton",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/18894528-war-paint"
}