{
  "title": "Battles and Leaders of the Civil War: The Battle of Shiloh",
  "description": "*Illustrated *Includes Table of Contents After the American Civil War began in April 1861, Ulysses S. Grant made a meteoric rise to the top of the Union war effort. Illinois. On April 6, 1862 a determined full-force attack from the Confederate Army took place at the Battle of Shiloh; the objective was to destroy the entire Western Union offensive once for all. Over 44,699 Confederate troops led by Albert Sidney Johnston and P.G.T. Beauregard, vigorously attacked five divisions of Grant’s army bivouacked nine miles south at Pittsburgh Landing. Aware of the impending Confederate attack, Union troops sounded the alarm and readied for battle, however, no defensive entrenchment works had been made. The Confederates struck hard and repulsed the Union Army towards the Tennessee River. Grant and Maj. General William T. Sherman were able to rally the troops and make a stand. After receiving reinforcement troops from Maj. Gen. Don Carlos Buell and Maj. Gen. Lew Wallace’s missing division, Grant succeeded in stabilizing the Army of the Tennessee. Confederate General Johnson was killed in the battle on the first day of fighting, and on the second day, Grant launched a costly counter-offensive and pursuit that forced the Confederate Army, now under P.G.T. Beauregard, to retreat to Corinth. The battle was the costliest in the Civil War up until this time, having 23,746 combined Union and Confederate casualties. The carnage at Shiloh demonstrated to both Confederates and Unionists that the Civil War was both very serious and extremely costly. Shiloh was the first battle in the American Civil War with tremendous casualties and Grant received much criticism for keeping the Union Army bivouacked rather than entrenched. As a result, Grant’s superior Maj. Gen Henry Halleck demoted him to second-in-command of a newly formed 120,000-strong Union Army. Grant was ready to resign from command when Maj. Gen. Sherman talked him into remaining in Halleck’s army. Grant would go on to restore his reputation and become the North’s greatest war hero, eventually coming to command all armies and force Lee’s surrender at Appomattox, ending the war for all intents and purposes. After the war, he would write what is considered the best personal memoirs of the war as well. He also wrote an account of the Battle of Shiloh that was eventually published in the well known Battles & Leaders series. This edition of Battles & Leaders of the Civil The Battle of Shiloh is specially formatted with a Table of Contents and pictures of Shiloh’s important commanders.",
  "genres": [
    "Civil War"
  ],
  "author": "Ulysses S. Grant",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/18896795-battles-and-leaders-of-the-civil-war"
}