{
  "title": "Darkness Unleashed",
  "description": "The New York Times bestselling author of the Order of the Blade series, Stephanie Rowe, returns to the haunted recesses of the Underworld, where the most dangerous and unpredictable Calydon of all must face his darkest past and the dangerous, elusive woman who is hiding a secret that he can't afford to discover. Intensely loyal and yet violently unpredictable, immortal warrior Ryland Samuels has one chance to save the soul of the man he owes his life to, but with each passing moment, he spirals closer and closer to the life that once trapped him, a nightmare that has been waiting to reclaim him for almost a thousand years.Ravaged by betrayal and loss, Catherine Taylor is almost out of time to save her daughter from a place so deadly, so haunted, that no one has emerged alive in centuries. The angel of death will not let anything stand in her way, not even the deadly, haunted warrior on a lethal mission. Ryland needs her help desperately, but she needs his even more…and they can't both get what they want.Forbidden heat explodes between the two tormented, isolated souls when they meet, a fiery, sensual connection that threatens everything they hold most dear. Will they survive the passion raging between them? Or will it cost them the one thing each cannot bear to lose?\"Rowe is a paranormal star!\" ~J.R. Ward, NYT Bestselling author of the Black Dagger Brotherhood\"Once more, award winning author Stephanie Rowe pens a winner with DARKNESS UNLEASHED, the seventh book in her amazing ORDER OF THE BLADE series. The eternal battle between good and evil is epitomized in this action-packed, sensual story that will keep you perched on the edge of your seat, eagerly turning pages to discover the outcome…. [DARKNESS UNLEASHED is] one of the best paranormal books I have read this year. Brimming with humor, danger, hunky Calydons, angels, demons, witty banter, sizzling sensuality, surprising plot twists, loyalty, love and revelations, this fast-paced story is one you will not soon forget…You do not want to miss it!\" ~Romancejunkies.com\"Stephanie Rowe has done it again. The Order Of The Blade series is one of the best urban fantasy/paranormal series I have read...Keep them coming!\" ~Alexx Mom Cat's Gateway Book Blog ABOUT THE New York Times and USA Today bestselling author Stephanie Rowe is the author of more than 45 novels, including her popular Order of the Blade and NightHunter paranormal romance series. Stephanie is a four-time nominee of the RITA® Award, the highest award in romance fiction. She has won many awards for her novels, including the prestigious Golden Heart Award. She has received coveted starred reviews from Booklist, and Publishers Weekly has called her work \"[a] genre-twister that will make readers...rabid for more.\" Stephanie also writes a thrilling romantic suspense series set in Alaska. Publisher's Weekly praised the series debut, ICE, as a \"thrilling entry into romantic suspense,\" and Fresh Fiction called ICE an \"edgy, sexy and gripping thriller.\" Equally as intense and sexy are Stephanie's contemporary romance novels.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Fantasy",
    "Vampires",
    "Angels",
    "Erotica"
  ],
  "author": "Stephanie Rowe",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/18892303-darkness-unleashed"
}