{
  "title": "The Passing of the Armies: An Account of the Final Campaign of the Army of the Potomac",
  "description": "For much of the 20th century, Joshua Lawrence Chamberlain's life and career remained mostly obscure, outside of dedicated scholars of the Battle of Gettysburg and alumni and students of Bowdoin College. Colonel Chamberlain had led the 20th Maine regiment at Gettysburg, holding the extreme left of the Union line on Little Round Top, and he continued to rise up the ranks toward the end of the war until he was commanding a brigade and present at the surrender ceremony of the Army of Northern Virginia at Appomattox. After the Civil War, Chamberlain served as Governor of Maine and President of Bowdoin College. Chamberlain had a respectable Civil War career and life, but he had been largely forgotten in the decades after the Civil War, with the focus on more influential commanding generals and their principal subordinates. Then a remarkable thing happened with the 1974 publication of Michael Shaara's The Killer Angels, a Pulitzer Prize winning historical fiction that focuses on the Battle of Gettysburg and its influential generals and leaders. In one fell swoop, Michael Shaara breathed life back into the reputations of men like John Buford and Joshua Chamberlain, cast as the Union heroes of Day 1 and Day 2 respectively that made victory at Gettysburg possible. In the novel, Chamberlain's regiment holds the high ground against a series of desperate Confederate charges, and when they ran out of gunpowder, Chamberlain ordered a brave bayonet charge that drove the Confederates in their front from the fight. With that, the Union's left flank was saved. Thanks to Shaara, Ken Burns' popular Civil War documentary prominently featured Chamberlain's involvement at Gettysburg, and when Shaara's novel was turned into the critically acclaimed 1993 movie Gettysburg, interest in Chamberlain and the 20th Maine swelled. Chamberlain's reputation and role in the Civil War had been completely revived, and the monument to the 20th Maine on Little Round Top became one of the premier tourist spots on the Gettysburg battlefield. Naturally, once more attention was focused on Chamberlain's record, historians started to scrutinize his service and post-war writings, leading to ensuing controversies over just what happened on Little Round Top on July 2, 1863. Furthermore, there still remains debate over Chamberlain's participation during the surrender ceremony of the Army of Northern Virginia at Appomattox. Part of that debate stems from the fact that Chamberlain wrote one of the most descriptive books about the last days of the Civil War, culminating with Lee surrendering to Grant at Appomattox, and what followed it. It's an invaluable resource for historians and anyone interested in the Civil War.",
  "genres": [
    "History",
    "Civil War",
    "American Civil War",
    "Nonfiction",
    "Memoir",
    "Military History",
    "War"
  ],
  "author": "Joshua Lawrence Chamberlain",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/18896767-the-passing-of-the-armies"
}