{
  "title": "Blue Gets His Magic Collar",
  "description": "The Adventures of Blue. The Very Happy Dog: Blue Gets His Magic CollarOnce upon a time in Wibbleton there lived a lovely happy dog called Blue, he lived very happily with his family in a pretty country cottage. He was such a good dog he was allowed to go out on Walks all by himself.Every day the gate was opened and off Blue went on another adventure. Across the field he'd run, through the long grass until he reached the big wooden gate that led to the land of adventures...Everyday a new and exciting thing was about to happen...This is the very first one in the Adventures of Blue children's book series. Blue needs a new collar and it's the strange old man in the vet shop that hands over the collar that is believed to be magic.Well, Blue sets off on another adventure to see just what magic this new collar can come up with.This book and others in the Adventures of Blue series, make excellent bedtime reading as Blue gets up to a new magical adventure every time. They are short stories so don't take long to read but they pack plenty of adventure in at the same time. Although there are plenty of children's books about dogs and lots of other animal books on Kindle, this one is slightly different. Not only does each adventure entail magic of some kind, the character Blue is based on the Authors real dog, also called Blue!..And now you can meet him! That's right; in the book there's a link to a page with lots of pictures of Blue and his lovely younger brother Bailey (They're both Golden Retrievers) as well as a chance for your child to appear in a future book or story!Although these books are primarily aimed at children between around 4 and 8 years, I'm sure children of all ages will enjoy them and hopefully their parents too!These and other adventure books are currently only available on Kindle and are all priced under $2.About the AuthorRonnie James wrote his first children's book back in 2007. It wasn't until he realised the potential to publish his books on Kindle that he started taking this seriously. The Adventures of Blue books are all dog stories inspired by the adventures and mischief his own Golden Retriever, Blue, used to get up to. Passionate about animals and bringing humour and smiles to people's faces, Ronnie is truly passionate about putting only his very best into each carefully crafted book, not to mention the many hours that go into the wonderful illustrations.",
  "genres": [
    "Childrens"
  ],
  "author": "Ronnie James",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/18896899-blue-gets-his-magic-collar"
}