{
  "title": "The Paper: The Life and Death of the New York Herald Tribune",
  "description": "Why did the newspaper with better writing and graphics than any other American daily go to an early grave?Few American newspapers – and perhaps none at all in the view of some students of the craft – have matched the many excellences of the New York Herald Tribune. In the crispness of its writing and editing, the bite of its critics and commentators, the range of its coverage, and the clarity of its typography, the “Trib” (as media people and many of its readers affectionately called it) raised newspapering to an art form. It had an influence and importance out of all proportion to its circulation. Abraham Lincoln valued its support so highly during the Civil War he went to great lengths to retain the allegiance of its co-founder Horace Greeley. And President Eisenhower felt it was so significant a national institution and Republican organ that while in the White House he helped broker the sale of the paper to its last owner, multimillionaire John Hay Whitney.From Karl Marx to Tom Wolfe, its list of staffers and contributors was spectacularly distinguished, including Walter Lippmann, Dorothy Thompson, Virgil Thomson, Eugenia Sheppard, Red Smith, Heywood Broun, Walter Kerr, Homer Bigart, and brothers Joseph and Stewart Alsop. At the close of World War II, the Herald Tribune, which represented the marriage of two newspapers that had done more than any others to create modern daily journalism, was at its apex of power and prestige. Yet just twenty-one years later, its influence still palpable in every newsroom across the nation, the Trib was gone. It is this story – of a great American daily’s rise to international renown and its doomed fight for survival in the world’s media capital – that Richard Kluger tells in this sweeping and fascinating book.It begins in pre-Civil War New York City with two bitter enemies who, between them, practically invented the newspaper as we know it: the Herald's James Gordon Bennett, a cynic who brought aggressive honesty to reporting for the first time, and the Tribune's Greeley, whose passion for social justice and vision of a national destiny made him an American icon and the most widely read polemicist since Tom Paine. These two giant figures loomed above a colorful, intensely competitive age, and with a novelist’s sense of detail and character, Kluger gives us an engaging picture of them and their time. Here are Bennett breaking new ground in 1836 with his extended coverage of the sensational murder of a well-known prostitute near City Hall… the Tribune scooping the War Department on the outcome of the Battle of Antietam in 1862…Greeley going upstate to testify in a libel suit brought against him by James Fenimore Cooper, then rushing back to the city in time to write a hilarious account of the trial for the next morning’s edition…the birth of investigative journalism as the Tribune's editors cracked the coded messages proving that Tilden’s backers tried to fix the presidential election of 1876.After the two papers and their two traditions – political and reportorial – merged early in the twentieth century, the fate of the Herald Tribune became intertwined with that of the pride-driven Reid family and its dynastic rule of the paper. In particular, it is the story of Helen Reid, the social secretary who married the owner’s son and became the paper’s dominant force, and of her two sons, whose fratricidal struggle for control helped bring about its downfall. To try to save it, one of America’s richest men lent his name and fortune as a last wave of staff talent redefined the limits and redesigned the look of U.S. daily journalism.The Tribune story is populated with a Dickensian cast of characters: Ishbel Ross, the dainty little woman who was the best and hardest-working reporter of her time…the acerbic city editor, Stanley Walker, and his successor, L. L. Engelking, who set a standard of city-room fervor and ferocity for a generation of newsmen…Homer Bigart, the stuttering copyboy who became America’s finest and most daring combat correspondent…the beautiful, bitchy, and intensely competitive Marguerite Higgins, who won a Pulitzer Prize by the time she was thirty…as well as modern figures like humorist Art Buchwald, crack drama critic Walter Kerr, straight-from-the gut reporter and columnist Jimmy Breslin, and crack science writer Earl Ubell.Above all, The Paper is a rich and revealing work of social and literary history, and exploration of the “free” in free press, and an elegiac tribute to the fading world of print journalism that spawned and sustained what was, line for line, America’s best newspaper.",
  "genres": [
    "Journalism",
    "History",
    "Nonfiction",
    "Research",
    "Business"
  ],
  "author": "Richard Kluger",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/1104969.The_Paper"
}