{
  "title": "Manstein: Hitler's Greatest General",
  "description": "The first proper biography of Germany's most controversial military hero.The story of the military genius Field Marshal Erich von Manstein chronicles the misguided generation of German generals in the Second World War who claimed they fought for Germany, not for Hitler and National Socialism. The polished, urbane von Manstein was no uncouth Nazi. He persuaded the British writer Liddell Hart to assist in organising his defence during his war crimes trial at Hamburg in 1949. Sentenced to 18 years' imprisonment, he was released after three and then advised the West German government in raising its new army in the 1950s.Manstein was the mastermind who created the plan for the 1940 blitzkrieg that overran France in just six weeks. He played a key role in the invasion of Russia and conquered the Crimea, but failed to rescue the doomed Sixth Army at Stalingrad, his most controversial campaign. Three months after the inevitable failure there, he inflicted a massive defeat on the Red Army at Kharkov in a brilliantly designed a battle that has been studied in military academies ever since.Major-General Mungo Melvin speaks good German and knows Germany well. He has been assisted by the Manstein family, has delved deeply into the military archives and studied many of Manstein's battlefields close at hand. His book is much more than a biography of an extraordinary it describes the dilemmas encountered on operations and highlights the enduring tensions between senior military commanders and their political leaders in the prosecution of strategy.In Germany today, Manstein has become a symbol of the moral corruption of the Wehrmacht, whose commanders' actions enabled Hitler to prosecute a devastating war of conquest and perpetrate the Holocaust. This book reveals the true story of Hitler and his greatest general.",
  "genres": [
    "Biography",
    "History",
    "World War II",
    "Military History",
    "Nonfiction",
    "Military Fiction",
    "Germany"
  ],
  "author": "Mungo Melvin",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/18898515-manstein"
}