{
  "title": "Dreaming of You",
  "description": "Their passion was ignited by a treachery neither of them could have ever foreseen, yet it resulted in a love that was destined to last forever…To secure the wellbeing of her beloved family, Melody Settrington agrees to marry Charles Cavendish, the elderly Earl of Edgington, despite her reservations. However, the innocent young beauty has no idea what her new husband will demand of her, once they are legally wed. It isn’t long however, before Melody discovers that the widowed earl had a purpose in choosing her for his bride, the daughter of an impoverished country baron. Impotent and childless, Charles is in desperate need of an heir, in addition to someone he can force into going along with the heinous scheme he has concocted.Gavin Montrose, son of the wealthy Duke of Rutherford, is as charming as he is handsome. However, unbeknownst to him, he is also the man Charles Cavendish has selected to father his heir. Abducted from the grounds of his family’s country estate, he awakens to find himself in the midst of a nightmare. Assuming that he has been abducted for ransom, Gavin is stunned to learn of his mysterious abductor’s true purpose. To gain his freedom and protect his family from harm, he must father a child he will never meet, with a woman whose name he will never know and whose face he will never see. Desperate to safeguard the people they love, both Melody and Gavin have no choice but to go along with the insanity that has been forced upon them or suffer the unbearable consequences. Compelled to meet in absolute darkness in the bedchamber of an isolated cottage, their identities a fiercely guarded secret, they will develop a bond neither of them had anticipated and discover a passion more powerful than either of them could have possibly imagined. But dare they call it love?Years later, when fate intervenes and Gavin and Melody’s paths inadvertently cross…",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Regency",
    "Historical Fiction",
    "Second Chance",
    "Fiction"
  ],
  "author": "Jennifer McNare",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/18899089-dreaming-of-you"
}