{
  "title": "Forever Alexa",
  "description": "First grade teacher and single mother Alexa Harris is no stranger to struggle, but for once, things are looking up. The school year is over and the lazy days of summer are here. Mini-vacations and relaxing twilight barbeques are on the horizon until Alexa’s free-spirited younger sister vanishes.Ransom calls and death threats force Alexa and her young daughter to flee their quiet home in Maryland. With nowhere else to turn, Alexa seeks the help of Jackson Matthews, Ethan Cooke Security’s Risk Assessment Specialist and the man who broke her heart.With few leads to follow and Abby’s case going cold, Alexa must confess a shocking secret if she and Jackson have any hope of saving her sister from a hell neither could have imagined.The Bodyguards Of L.A. County SeriesBook One: Morgan's Hunter, the story of Morgan and Hunter (ISBN: 9780989569606)Book Two: Falling For Sarah, the story of Sarah and Ethan (ISBN: 9780989569613)Book Three: Hailey's Truth, the story of Hailey and Austin (ISBN: 9780989569620)Book Four: Forever Alexa, the story of Alexa and Jackson (ISBN: 9780989569637)Book Five: Waiting For Wren, the story of Wren and Tucker (ISBN: 9780989569644)Book Six: Justice For Abby, the story of Abby and Jerrod (ISBN: 9780989569651)Book Seven: Saving Sophie, the story of Sophie and Stone (ISBN: 9780989569668)Book Eight: Reagan's Redemption, the story of Reagan and Shane (ISBN: 9780989569675)Book Nine: Answers For Julie, the story of Julie and Chase (ISBN: 9780989569682)Book Ten: Finding Lyla, the story of Lyla and Collin (In Production)While reading the series in order is recommended, it is not necessary. Each story can stand alone with a satisfying conclusion.",
  "genres": [
    "Romantic Suspense",
    "Suspense",
    "Romance",
    "Contemporary",
    "Mystery",
    "Crime",
    "Contemporary Romance"
  ],
  "author": "Cate Beauman",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/18898589-forever-alexa"
}