{
  "title": "The Riddle Of Babi Yar: The True Story Told by a Survivor of the Mass Murders in Kiev, 1941-1943",
  "description": "His name was Ziama – a beautiful Jewish name which he had to change to Russian ‘Zakhar’ in order to conceal his origins. When all Jews were ordered to appear at a gathering point, he didn’t go and persuaded others not to go either. Pretending to be a collaborator for the occupation authorities, he kept on saving lives. He rode his bike to nearby villages to barter goods for his family, at the same time trying to get in touch with partisan units. Like a true ‘blade runner’, he always had a narrow escape until a traitor denounced him. Even then, in the concentration camp, forced to exhume and burn the corpses of those massacred in the first months of the occupation, he didn’t think of death – he thought of freedom. And he led others with him - out from the camp, towards life and a happy future – just a day before their scheduled execution. In the night streets of Kiev, hiding from patrols, they made their way home, to reunite with their families.  A dreamlike story, but a true one. Some say, Ziama never existed and the story is a fiction. To contradict this statement and to prove the authenticity of the described events, I found transcripts of the KGB interrogations of the witnesses and of those guilty of the crimes committed in Babi Yar, Kiev, in 1941-1943. This is the truth the world needs to know. The further in time we are from the Holocaust, the more denial and more lies we encounter.  So that no Jew would ever have to hide under a Gentile name, so that no Jew would ever have his life threatened for the mere fact that he is a Jew – read and spread Ziama’s message to the world. And if the worst happens and History repeats itself – let Ziama’s heroism be an example to all of us how to fight back and not allow anything to destroy us.Here at last, after 70 years, the final truth about Babi Yar.",
  "genres": [
    "Holocaust",
    "Nonfiction",
    "History",
    "World War II",
    "Biography"
  ],
  "author": "Ziama Trubakov",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/18901419-the-riddle-of-babi-yar"
}