{
  "title": "The Reappearance of the Christ",
  "description": "\"In every age I come back to deliver the holy, to destroy the sin of the sinner, to establish righteousness.\" So runs the well-known passage in the Bhagavad Gita (translation by Prabhavananda and Isherwood), giving words to an eternal hope in the human heart. In this book the reappearance of the Christ is recognised as inevitable within the continuity of divine revelation. Not only has God never left Himself without witness, but at definite periods in the history of human evolution, the \"word of God\", the projected potency of His vital life, has manifested in form in order to establish the principles to be demonstrated during the coming cycle. There have been many such messengers over the ages, manifesting through one or another of the great world religions or followed by a new form of religion based on the new revelation. Divine revelation and the periodic appearance of messengers, or Avatars, occur, however, according to cosmic law, when certain conditions exist within the whole scheme affected by, and affecting, every part, large and small. Then a chain of events is set in motion which under law must eventually work out. The part that our little planet Earth plays in this intricate and smoothly functioning system of inter-relationships seems to be of vital importance at this time. The esoteric and planetary significances of the reappearance of the Christ are suggested in this book as underlying causes for His Aquarian service to humanity. This is the beginning and end of an age--the beginning of Aquarius and the end of Pisces--marking also a major turning point in the evolution of human consciousness from individual need to the needs of humanity as a whole, from personal salvation to world service, and from materiality to spirituality. It seems that this climaxing transition must be \"marked\" in both its stages, beginning and end, by the Christ Himself, and a principle anchored in human consciousness, which embodies not only the love or God established for the age of Pisces, but also the new potency for the future, the \"Will\" of God, into which only the Christ is as vet fully and perfectly absorbed. The imminence of the reappearance of the Christ is sensed and expected by many, belonging as He does to all humanity irrespective of differing religious dogma and doctrine. \"He for whom all men wait\" will Himself determine the manner and the timing of His appearance and the area of his work in a way which creates no divisions or separations between men, either religious, social or ideological. Not only does He come as the first Son of God, but as Head of the spiritual Hierarchy, the inner government of the planet. He is, therefore, a great world executive, representing the Kingdom of God, and fulfilling a definite function in the world of men. He is coming to establish through precept and example in world service the principles on which a united, interdependent and interactive world may create its new material systems and spiritual institutions for the new civilisation. Preparation for the second coming is the responsibility of humanity; it is for those who know and accept the imminent return of the Christ to prepare men's minds and hearts to recognise and receive Him, and to create those conditions of balance and spiritual alignment which will ultimately draw Him forth into our midst. For no matter what message or revelation the Christ may embody when He comes, no matter what principle or energy He may anchor on Earth for human use, He is not coming to save humanity from the results of its own sins, but once more to show humanity how to save itself in the new conditions and new opportunities with which the world is faced.",
  "genres": [
    "Spirituality",
    "Religion"
  ],
  "author": "Alice A. Bailey",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/1890078.The_Reappearance_of_the_Christ"
}