{
  "title": "The Cure",
  "description": "EVEN WHEN YOU CHANGE< SOME THINGS REMAINS THE SAME . . .Erin Radkey’s life has altered completely since her Change made her one of the Unbounded. Yet she has learned the hard way that some things never change.Greed. Over the centuries the long-lived Unbounded have divided into two groups, the Emporium who craves money and power and will do anything to achieve its ends, including experimenting on its own people, and the Renegades who protect humanity.Power. Now the Renegades are close to discovering a cure that will save many dying mortals, and the husband of Erin’s closest friend is first in line to receive the formula. But Emporium agents will stop at nothing to destroy the cure—until they realize the research might be exactly the weapon they’ve been searching for.Love. Erin’s new abilities are tested as she and fellow Renegades fight the Emporium in a struggle that soon becomes all too personal, and where lines of loyalty are blurred by relationships of the past. Everything is at risk, including the lives of her friends—and the love of Ritter Langton, the Renegade Unbounded who both infuriates and excites her.From the busy streets of Portland to the jungles of Mexico, The Cure is a page-turning urban fantasy that will keep you riveted until the end.Praise for the UNBOUNDED “Excellent and well written!”I recommend reading the entire series”\"Thoroughly enjoyable”High action and adventure”“Teyla Branton belongs right alongside Patricia Briggs, Kim Harrison, Jennifer Estep, and Kelly Armstrong.”Unbounded Series1. The Change2. The Cure3. Protectors (which contains Ava's Revenge, Mortal Brother, and Set Ablaze)4. The Escape5. The Reckoning6. Lethal Engagement7. The Takeover8. The Avowed9. The Unsworn",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Science Fiction",
    "Romance",
    "Fiction",
    "Supernatural"
  ],
  "author": "Teyla Branton",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/18899385-the-cure"
}