{
  "title": "A Preface to the Nibelungenlied",
  "description": "This book aims to make available the necessary background for an informed reading of the Nibelungenlied, the twelfth-century epic perhaps best known to non-Germans from Wagner's music dramas. Two traditions of scholarly thought exist about the Nibelungenlied. The first sees the poem as a development out of German heroic legend; the second focuses on the work's location in the contemporary literary context at the end of the twelfth century. The first and older school deals with the evolution of the story over time and the question of how short heroic poems attained epic compass in the later Nibelungenlied. The second seeks to interpret the poem in terms of the new emergence of Arthurian romance around 1200. The author attempts to bridge the gap between the two contending schools, suggesting that neither approach precludes the other.Although the Nibelungenlied poet drew the story itself from earlier heroic poems, the author makes clear that the poet absorbed impulses from other types of literature as well.The book is in three parts. Part I discusses literary antecedents, tracing the development of German heroic poetry from the Migration Age on, then describing narrative practice in the twelfth century, in historical and legendary epic on the one hand and romance on the other. Part II analyzes the Nibelungenlied in its immediate literary context, addressing possible sources and narrative innovations. The author relates the story of the poem to the immediatelt antecedent versions of the legend that are now preserved only in the Norse Thidrek's Saga, surveys recent general interpretations, and suggests a literary-historical analysis that can plot the Nibelungenlied more accurately on the literary map of the twelfth century. Part III comprises previously untranslated texts and summaries of source materials bearing on the Nibelungenlied.",
  "genres": [
    "German Literature"
  ],
  "author": "Theodore Murdock Andersson",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1890439.A_Preface_to_the_Nibelungenlied"
}