{
  "title": "Lilith Mercury, Werewolf Hunter Boxed Set, Books #1-3",
  "description": "Looking for some sexy shifters and hot southern nights? This might be the series for you.This is a collection of the first three books in the Lilith Mercury, Werewolf Hunter series. This series focuses on the life of Lilith Mercury, a werewolf Hunter who is also half werewolf. Did I mention there are several sexy men in her life? This story has graphic violence, and graphic sex. It also has a new take on the origins of werewolves and vampires. There are many ups and downs in Lilith's life and much more to come. This series gets hotter as it goes. No werewolves were harmed in the making of this series.This set includes:1. Red2. Object of My Affection3. The Dread MoonRedThis is Book One in the Lilith Mercury Series.Dr. Alfred Moody saved her life, but the werewolf, Marco may hold the key to her heart. She's torn between the man who saved her humanity and the one who makes her want to embrace the beast.NOTE: This series gets hotter as it goes. However, Book One is NOT erotic. Someday Lilith will have a happy ending, but this is only the beginning.WARNING: This book contains graphic language and graphic violence.Object of My AffectionThis is book two in the Lilith Mercury, Werewolf Hunter Series.There was a time when the battle lines were clearly drawn and there would've been no question, no doubts, but that time has passed. Though Lilith is still drawn to the wolfman, Marco, she cannot deny what she feels for her partner, Alfred. She remains torn between a man who was once her enemy and one who is becoming much more than her friend.WARNING: This book contains graphic language, graphic violence, and graphic sex. No werewolves were harmed in the making of this book.The Dread MoonThis is Book Three in the Lilith Mercury Series.Lilith's reputation as the best in the business has spread, and not just to the lycanthrope population. She's been hired to find the original vampire. The vamps want what everyone else wants, equality. However, she will soon realize that the original vampire isn't simply out for blood, or the return of rights to his people ... he wants Lilith too.Warning: This book contains graphic violence, graphic language, and sex with BDSM elements including autoerotic asphyxiation.",
  "genres": [
    "Fantasy",
    "Shapeshifters",
    "Paranormal",
    "Erotica",
    "Paranormal Romance"
  ],
  "author": "Tracey H. Kitts",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/18902848-lilith-mercury-werewolf-hunter-boxed-set-books-1-3"
}