{
  "title": "Gringa",
  "description": "This is the complete Gringa Series, books 1-4 being offered at a discounted price.SERIES DESCRIPTION:I was twenty-one, a sassy college student who took crap from no one. While holidaying in Mexico, I was accosted by Diablo and shot, because the motherfucker mistook me for a spy.I survived, only to encounter him again months later. How’s that for luck?Furious and sick of all that I’d been through because of him, I slapped him, told him to go fuck himself and braced myself for the bullet. He could shoot me – I no longer cared. But, to my surprise, the fucker became fascinated with me and blackmailed me into becoming his woman. He’d slay the entire village that sheltered me, if I rejected his proposal. He was Kong, hairy, tattooed from fingertips to face, with scary ass piercings, blood-shot snake eyes, a ruthless killer and above all, he was my murderer – how could anyone expect me to say yes?To save the village I had to. He took me by force, terrorized me into submission and made me his. To make matters worse, I had to put up with his ruthless, backstabbing family who hated me and wanted to kill me. I despised the bastard and I told him that. Spark flew. Fists too. When the FBI came on the scene and secretly recruited me to help put Diablo behind bars, I was thrilled. I wanted them to throw his ass behind bars, then torment him for the rest of his life like he was doing to me. I was willing to do whatever it took to get him there.But, the more I rejected Diablo, the more he wanted me. At times he wanted to kill me because of my insolence, but other times he just wanted me to love him.I was his Gringa and in an attempt to get my love, he began to change for me. Drastic changes that made me laugh at him at first, then made me curious and even intrigued me. After all, I was an ignored child and as an adult, nobody gave a rat’s ass about me. Here was a man who actually wanted me and was willing to do whatever it took to get me – how the hell could I not be flattered?As the days went by, I found myself drawn to him and I began seeing him differently. When I found out about his past, everything changed. I now wanted to protect my murderer, my tormentor, The Devil of Mexico from the FBI and I was prepared to lie to the Feds, if it meant saving him from them.I was even prepared to go to jail for him.And I did. My days in Mexico were filled with violence, hate, lust and sorrow. It was also filled with laughter, love and passion and most importantly, it taught me that love conquers all. WARNING: This book contains sexual violence, sex scenes, graphic language, drug references, violence and is suitable for mature readers",
  "genres": [],
  "author": "Eve Rabi",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/18908121-gringa"
}