{
  "title": "The Black Book of the American Left: The Collected Conservative Writings",
  "description": "David Horowitz spent the first part of his life in the world of the Communist-progressive left, a politics he inherited from his mother and father, and later in the New Left as one of its founders. When the wreckage he and his comrades had created became clear to him in the mid-1970s, he left. Three decades of second thoughts then made him this movement's principal intellectual antagonist. \"For better or worse,\" as Horowitz writes in the preface to this, the first volume of his collected conservative writings, \"I have been condemned to spend the rest of my days attempting to understand how the left pursues the agendas from which I have separated myself, and why.\"When Horowitz began his odyssey, the left had already escaped the political ghetto to which his parents' generation and his own had been confined. Today, it has become the dominant force in America's academic and media cultures, electing a president and achieving a position from which it can shape America's future. How it achieved its present success and what that success portends are the overarching subjects of Horowitz's conservative writings. Through the unflinching focus of one singularly engaged witness, the identity of a destructive movement that constantly morphs itself in order to conceal its identity and mission becomes disturbingly clear.In Volume I of these writings, \"My Life and Times,\" Horowitz reflects on the years he spent at war with his own country, collaborating with and confronting radical figures like Huey Newton, Tom Hayden and Billy Ayers, as he made his transition from what the writer Paul Berman described as the American left's \"most important theorist\" to its most determined enemy.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "Biography"
  ],
  "author": "David Horowitz",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/18905779-the-black-book-of-the-american-left"
}