{
  "title": "Boom, Bust, Boom: A Story About Copper, the Metal that Runs the World",
  "description": "From “a first-rate writer in the fascinating tradition of Junger and Krakauer” (Jim Harrison, author of Legends of the Fall), a sweeping account of civilization’s complete dependence on copper and what it all means for people, nature, and the global economy.A SWEEPING ACCOUNT OF CIVILIZATION’S COMPLETE DEPENDENCE ON COPPER AND WHAT IT MEANS FOR PEOPLE, NATURE, AND OUR GLOBAL ECONOMY COPPER is a miraculous and contradictory metal, essential to nearly every human enterprise. For most of recorded history, this remarkably pliable and sturdy substance has proven not only did the ancient Romans build their empire on mining copper but Christopher Columbus protected his ships from rot by lining their hulls with it. Today, the metal can be found in every house, car, airplane, cell phone, computer, and home appliance the world over, including in all the new, so-called green technologies. Yet the history of copper extraction and our present relationship with the metal are fraught with profound difficulties. Copper mining causes irrevocable damage to the Earth, releasing arsenic, cyanide, sulfuric acid, and other deadly pollutants into the air and water. And the mines themselves have significant effects on the economies and wellbeing of the communities where they are located. With Red Summer and Fools Rush In, Bill Carter has earned a reputation as an on-the-ground journalist adept at connecting the local elements of a story to its largest consequences. Carter does this again—and brilliantly—in Boom, Bust, Boom, exploring in an entertaining and fact-rich narrative the very human dimension of copper extraction and the colossal implications the industry has for every one of us. Starting in his own backyard in the old mining town of Bisbee, Arizona—where he discovers that the dirt in his garden contains double the acceptable level of arsenic—Bill Carter follows the story of copper to the controversial Grasberg copper mine in Indonesia; to the “ring” at the London Metal Exchange, where a select group of traders buy and sell enormous amounts of the metal; and to an Alaskan salmon run threatened by mining. Boom, Bust, Boom is a highly readable account—part social history, part mining-town exploration, and part environmental investigation. Page by page, Carter blends the personal and the international in a narrative that helps us understand the paradoxical relationship we have with a substance whose necessity to civilization costs the environment and the people who mine it dearly. The result is a work of first-rate journalism that fascinates on every level.",
  "genres": [
    "History",
    "Science",
    "Nonfiction",
    "Environment",
    "Geology",
    "Journalism"
  ],
  "author": "Bill Carter",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/18909650-boom-bust-boom"
}