{
  "title": "Complete Works of Leo Tolstoy",
  "description": "Including:* ALL 12 novels with professional formatting* plus RARE unfinished novels, like 'The Decembrists' which Tolstoy intended to be a sequel to the great 'War and Peace'* brief but informative introductions to all of the novels* Attractive images relating to Tolstoy's life and works throughout the eBook* ALL the short stories that have been translated into English* features a bonus selection of non-fiction texts, including Tolstoy's Journal* ALL of the plays* special Main Character pages for 'War and Peace' and 'Anna Karenina' to aid reading these large novels* improved translations of the short stories, in response to a customer review* includes contents tables for each novel and play, allowing easy navigation around the massive file* UPDATED with a special literary criticism section, with 9 different essays examining Tolstoy's contribution to literature, with works by writers such as Virginia Woolf and William Lyon Phelps* UPDATED with BONUS texts of two biographies on Tolstoy, by his wife and son* UPDATED with the rare play LIVE CORPSE, unpublished in Tolstoy's lifetimeBelieved by many to be the greatest novelist the world has known, the Russian Master's work is of paramount importance. This definitive Edition of Tolstoy's oeuvre has every translated novel, short story, novella and play written by Leo Tolstoy. One of our most popular eBooks - now you can own the great Master of Realist fiction. There is also a front no-nonsense contents table, allowing easy navigation around the enormous file. As with all Delphi Classics, the texts are arranged in chronological order, allowing a scholarly reading and appreciation of Tolstoy's works.Please note: an absolute 'complete works' of Tolstoy is not possible in English due to copyright restrictions on various translations and some texts not being translated into English yet. However, this eBook strives to give customers the most texts possible and contains all of the MAJOR works. As a bonus, a selection of non-fiction texts are available too.ContentsThe Novels and NovellasCHILDHOODBOYHOODYOUTHFAMILY HAPPINESSTHE COSSACKSWAR AND PEACEANNA KARENINATHE DEATH OF IVAN ILYCHTHE KREUTZER SONATA.RESURRECTIONTHE FORGED COUPONHADJI MURADThe Unfinished NovelsTHE DECEMBRISTSA MORNING OF A LANDED PROPRIETORThe Short StoriesLIST OF STORIES IN CHRONOLOGICAL ORDERLIST OF STORIES IN ALPHABETICAL ORDERThe PlaysTHE POWER OF DARKNESSTHE FRUITS OF CULTUREREDEMPTIONTHE CAUSE OF IT ALLTHE FIRST DISTILLERTHE LIGHT SHINES IN DARKNESSLIVE CORPSESelected Non-FictionA CONFESSIONKINGDOM OF GOD IS WITHIN YOUWHAT THEN MUST WE DO?ON THE SIGNIFICANCE OF SCIENCE AND ARTBETHINK YOURSELVES!MOSCOW CENSUSTOLSTOY ON SHAKESPEARETOLSTOY’S JOURNALThe CriticismTOLSTOY THE ARTIST by Ivan PaninTOLSTOY THE PREACHER by Ivan PaninExtract from ‘MY LITERARY PASSIONS’ by William Dean HowellsExtract from ‘ESSAYS ON RUSSIAN NOVELISTS’ by William Lyon PhelpsRUSSIAN ROMANCE by Earl of Evelyn Baring CromerExtracts from ‘A SURVEY OF RUSSIAN LITERATURE’ by Isabel Florence HapgoodExtract from ‘AN OUTLINE OF RUSSIAN LITERATURE’ by Maurice BaringTHE RUSSIAN POINT OF VIEW by Virginia WoolfExtract from ‘PROPHETS OF DISSENT’ by Otto HellerT",
  "genres": [
    "Classics",
    "Literature",
    "Fiction",
    "Collections",
    "Russia",
    "Novels",
    "Cultural"
  ],
  "author": "Leo Tolstoy",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/18911579-complete-works-of-leo-tolstoy"
}