{
  "title": "Intimate Knowledge Part 2",
  "description": "If you like a story with a twist, some suspense and lust, then this story is for you. Can't wait for part 2 Mary 5 stars In Part 1 Raisa and Leo finally meet and Raisa foolishly allowed her guard to slip for a treacherous moment. In Part 2, Leo sees 'she has the look' and vows to make her his. Stating his intentions shockingly bluntly, Raisa flees to find refuge. She discover there is no escape from Leo and especially not from the explosive desire he unleashes. 'You are mine now, Raisa.' A part of her is terrified that might be true. Soon he is planning their future, including an extended trip to Rome. Suddenly, the façade slips as a chance meeting reveals a darker side to Leo and a glimpse into the sorrow that cripples Raisa. Don't miss Part 2 of this exciting new series. Intimate Knowledge Detective & Desires #1 Also released this today Part 2 of the popular Her Keeper Detective & Desires #2 A Fifty Shades and Because You Are Mine fan, but are ready to move on from reading about 20 something virgins and young tortured CEO’s? You will fall in love with this new series of a seasoned vice-cop emotionally crippled by a tragic past and her obsessive younger lover who vows to make her happy, healed and whole. How long can Detective Raisa Gordon resist, Leo Gold, her undercover target? It is one thing to imagine and explore all kinds of hot scenarios in the safe haven of your own head; it is quite another to be in the position of actually having to pay the piper. That is exactly the position Raisa finds herself in when her fantasies start materializing into reality everywhere she turns. One of Gold’s operatives stumbled upon an encrypted file of letters she wrote years ago exploring her deepest darkest taboos. Now, Leo possesses intimate knowledge and is setting out to to satisfy her needs by enacting those taboos one by one. Will the FBI’s plan to use his passion for her to bust the entire Gold operation wide open succeed? Or will Raisa surrender to her treacherous desires? This the first part in a series that will unfold over multiple volumes ranging from 10,000 to 20,000 words each. Intimate Knowledge is an erotic romance with explicit sexual content with elements of BDSM. It has a delectable slow build to consummation",
  "genres": [
    "Erotica",
    "Romance"
  ],
  "author": "Helen Karol",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/18911669-intimate-knowledge-part-2"
}