{
  "title": "Argo: How the CIA and Hollywood Pulled Off the Most Audacious Rescue in History",
  "description": "Argo by Antonio Mendez and Matt Baglio - the declassified CIA story behind the Oscar-winning film\n \n\nWINNER OF 'BEST PICTURE' AT THE ACADEMY AWARDS, THE BAFTAS AND THE GOLDEN GLOBES\n Tehran, November 1979. Militant students stormed the American embassy and held sixty Americans captive for a gruelling 444 days. But until now the CIA has never revealed the twist to the Iran Hostage Crisis: six Americans escaped.\n\nThe escape plot was run by Antonio Mendez, head of the CIA's extraction team and a master of disguise. Mendez came up with an idea so daring and potentially foolish that it seemed destined for Hollywood... and indeed it was. He invented a fake sci-fi film called 'Argo' (from the actual name of the CIA mission, a reference to Jason and the Argonauts). After announcing the production to the movie industry, Mendez put together a team of real 1970s Hollywood actors, directors and producers - along with covert CIA officers. They would travel to revolutionary Iran under a foreign film visa, and while 'scouting locations' throughout the country they would track down the six Americans who were hiding out. After giving them false identities as part of the film crew, they would spirit them back across the border.\n\nOne part 'Ocean's 11' and another part 'Black Hawk Down', Mendez's mind-bogglingly complicated and risky gamble paid off: each escapee was extracted without a shot being fired. Mendez is considered one of the greatest officers in CIA history. The story of this, his greatest mission, has never been told. \n\nNow an acclaimed film directed by and starring Ben Affleck, with Bryan Cranston, Alan Arkin and John Goodman'\n \n\n\nAntonio Mendez was cited by Richard Clarke as one of the top two or three CIA agents in history. His He received the Intelligence Star for his rescue of six Americans from revolutionary Iran, and has received the CIA's Intelligence Medal of Merit and the Trailblazer Medallion. He continues to consult for the CIA. He and his wife, also a famed agent, were technical consultants on the television series 'The Agency' and founding board members of the International Spy Museum in Washington.\n\nMatt Baglio is the author of the New York Times bestseller The Rite: The Making of a Modern Exorcist. His writing appears regularly in the Daily Mail and the Associated Press.",
  "genres": [
    "Nonfiction",
    "History",
    "Audiobook",
    "Politics",
    "Memoir",
    "Biography",
    "Espionage"
  ],
  "author": "Antonio J. Méndez",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/18914242-argo"
}