{
  "title": "Chosen",
  "description": "Named as one of the 50 Self-Published Books Worth Reading in 2014 by Indie AuthorLandBook #1 in the Ancients of Light seriesIn the beginning...there were Vampire. Man’s fall from grace sparked the birth of the Dark creatures from the underworld. To counter the explicit threat to mankind, divinely-created immortals were brought forth. The Witch encompassed seven Castes of power; their magic was most effective against the nefarious agenda pursued by their enemies. Over the thousands of years of war, members of each breed have been swayed to the calling of the other, leaving neither able to claim ultimate victory in its mission. This first book in the Ancients of Light series establishes the foundation for the events that have brought the Realm to its current circumstance and sets the stage for last days within the war of Ancients. A primeval Prophecy culminates in this era, bringing final resolution to the eternal battle that has waged between the Vampire and Witch, the Light and the Dark. The Chosen...Kaitriana’s gift of magic is unrivaled in the Realm. A feisty beauty and descendant of the most powerful Ancient in existence, her birth was foretold ages before her time. Destined to lead the Realm to peace, as she comes to power she is betrayed by her own kind, destroying her birthright and all hope of delivering the Realm from the sinister shadow of the Ancient Darks. Lorcan is a heralded champion, a mighty warlord within the Vampire species. He is part of the faction that abandoned their Dark beginnings and found purpose in the Ancient Light, though his breed has long been estranged from the Witch that ally with them in battle. His animosity towards the magical immortals is personal - his traitorous mother was a Queen within their ranks. Having long since severed all ties with his former kin, his existence remains plagued by repercussions of her treachery and a secret that threatens to be his downfall. An Ancient Prophecy tells that only two in all of creation can banish the Darks and bring peace to the Realm. When Kaitriana miraculously appears seeking his protection, Lorcan will be required to forsake his duty and disregard the dictates of the Ancients to shelter the female. To fulfill her role, Kaitriana must rebuild the alliance between her own species and the Vampire, while inducing her arrogant guardian to confront his true nature. Together they must combat the Ancient Dark and surmount the forces within their own factions that would oppose the Prophecy. Their fates have always been intertwined and only when joined with the strength of the other can they triumph over a blood feud that has shadowed the Light for millennia.About the Ancients of Light seriesChosen is the first in the thirteen books of the Ancients of Light series and is only the beginning of a young Witch’s journey toward developing both the strength of character and magic that will be required to fulfill her prophesied role as leader of the Light faction. Revelations of nuances in the Prophecy - facets that were never fully comprehended by the Ancients - will continue in successive stories. The culmination of its true meaning in the destiny of the supernatural world of the Realm will only be revealed when Kaitriana is adequately prepared to lead the Warriors now being called together to champion the Light’s purpose. Familiar characters return for each storyline as the focus turns to a new key couple in every book - a pair that significantly factors into the purpose of Light – however, the story of the Chosen does not end with Book #1.",
  "genres": [
    "Vampires",
    "Paranormal Romance",
    "Fantasy",
    "Paranormal",
    "Romance",
    "Magic",
    "Witches"
  ],
  "author": "Heather Fleener",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/18912922-chosen"
}