{
  "title": "The Afterglow Trilogy",
  "description": "Take a step through the gate into the Afterglow Trilogy.Contains all three books of the trilogy.Beckoning LightAs Charlotte steps through the gate, she has a strong feeling that nothing will ever be the same again.Moving back to South Carolina after three years away, Charlotte knows she’s going to have to face people from her past and adjust to a new high school, but she’s completely unprepared for what else waits for her in Charleston.Drawn through an old garden gate, Charlotte discovers a hidden world where she meets Calvin, a boy to whom she is inexplicably attracted. As Charlotte is pulled deeper into this hidden world, it’s up to her older brother Kevin to rescue her. The problem is that no matter how hard Kevin tries, the rescue depends upon Charlotte fighting her intense feelings for Calvin while mastering a set of abilities that she has only just discovered she possesses.Perilous LightWould you sacrifice everything for a world you barely knew?A year has passed since Charlotte and Kevin first stepped through the gate into Energo and neither has been able to settle back into a normal life. Charlotte tries to distract herself from thoughts of Calvin with the antics of James and her growing friendship with Liam. Kevin can’t seem to shake his feelings for Samantha as he adjusts to his new identity as a college basketball player.When they unexpectedly return to Energo, both Charlotte and Kevin must face their fears and become the leaders they were always meant to be.Enduring LightFighting darkness takes light.Desperate to save James, Charlotte scours Energo for answers with Calvin and Liam at her side. Kevin and Samantha head to Alaska to find the one item that might destroy Blake, but the search is only the beginning.As time runs out, Charlotte and Kevin discover that keeping Energo from eternal darkness will take a sacrifice no one expects.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Paranormal",
    "Paranormal Romance",
    "Romance"
  ],
  "author": "Alyssa Rose Ivy",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/18915240-the-afterglow-trilogy"
}