{
  "title": "Broken",
  "description": "an alternate cover edition can be found hereAt the tender age of seven, Jess Riley’s parents were ripped out of her life by the Tear, a ripple of white light in the sky which randomly transports people from Earth to alternate realities and distant planets once a year. On the night the Tear first appeared, the Watchers, a mysterious group of men possessing supernatural powers, made their presence known to the leaders of the world, earning their complete trust to deal with the turmoil the Tear caused. Now twenty-two years old, Jess is an agent working for the Watcher Agency searching for a way to bring her parents back home. When the leader of the Watchers, Mason Collier, recruits her to join his team, Jess quickly discovers she is meant to play a major role in sealing the Tear forever. Mason and Jess instantly find themselves drawn to one another but they both resist their mutual attraction for different reasons. Broken by past events in their lives, they each struggle to overcome their fears and find the strength to take a chance on one another. A Disclaimer from the Author:It is not necessary to have read The Watchers Trilogy to read The Watcher Chronicles. But if you are interested in reading The Watchers Trilogy, I would recommend you not read this new series until you have finished Forgiven. What happens at the end of the trilogy is explained fairly early in Broken and I would hate for the ending of Forgiven to be ruined for you.This series is intended for a mature audience. Recommended for ages 17 and older due to sexual situations and adult themes. If I were to use the movie rating system, I would rate this series an R.Reading Order of Watcher Books by Series: The Watchers Trilogy (Ages 13+) The Watcher Chronicles (Ages 17+ due to mature content in books 3 and 4)Caylin’s Story (Ages 13+ – Can be read by younger readers without having to read the Watcher Chronicles)The Redemption Series (Ages 17+ due to mature content in books 3 and 4)Bonus Books (Books which will be written but are not part of the main storyline):  Aiden’s Story (Coming 2014) Alternate Earth Series (Coming 2015)",
  "genres": [
    "Romance",
    "Fantasy",
    "Paranormal",
    "Angels",
    "Paranormal Romance",
    "Audiobook",
    "Young Adult"
  ],
  "author": "S.J. West",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/18915121-broken"
}