{
  "title": "The Darwath Trilogy: The Time of the Dark, The Walls of Air, and The Armies of Daylight",
  "description": "Barbara Hambly’s celebrated trilogy about a murderous force that threatens a far-off magical world and the two ordinary Californians who are drawn into the battle to save mankindAs a student of medieval history, Gil Patterson is a woman familiar with dark stories. She knows the Crusades, the Black Death, and the other horrors of the Middle Ages all too well, but it is another kind of atrocity that has begun to haunt her dreams. She sees forces of evil assaulting a beleaguered kingdom, whose kind people are on the brink of annihilation, and awakes each morning in a cold sweat. In The Time of the Dark, Gil dismisses the dreams until a wizard appears in her apartment. He has crossed into her dimension, passing through the fraying fabric of the universe, to ask her help. For mankind to survive he must protect an infant prince, whom he plans to hide in Gil's world. She is about to get much closer to evil than she ever imagined. In The Walls of Air and The Armies of Daylight, Gil and Rudy know the world is no longer safe and there is nowhere to hide from the Dark. Since the Dark Ones returned, the world has been laid to waste. The land’s wizards have been slaughtered, its cities destroyed, and its people scattered in terror. Few have witnessed more of the destruction than Gil and Rudy, and both of them will need all their strength to survive this final challenge. Ingold, the master wizard, has devised a spell to hide the user from the deathly stare of the Dark, and he intends to use it to strike at their very heart. Finally, Gil, Rudy, and the rest of mankind’s survivors will take the offensive, bringing an end to this terrible war, for better or for worse.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Horror",
    "Magic",
    "Urban Fantasy",
    "Science Fiction",
    "Romance"
  ],
  "author": "Barbara Hambly",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/18912304-the-darwath-trilogy"
}