{
  "title": "Wyrd Worlds",
  "description": "An anthology of short stories by an international collection of science-fiction and fantasy writers, covering a wide range of what is known as speculative fiction, from slices of fantasy and time travel to steampunk and science-fiction. The tales vary widely, yet are all born from the same drive to create, share ideas and above all to entertain:\nTALES OF ERANA: THE BLUE PHIAL by Alexandra Butcher - A short story from the world of 'The Light Beyond the Storm Chronicles'. \n   THE QRIM CHIEFTAIN by Stan Morris - When a haughty princess scorns a barbarian chieftain, her city pays the price. \n   ANTIMATTER ME by Steph Bennion - The experiment had not been a success and now time was running out. Or was it running in? \n   EXPLAIN THAT TO A MARTIAN by Gary Weston - Drinkers sometimes see all kinds of things. But even I wasn't expecting to see a four-eyed Martian in my lounge... \n   THE IMAGINARY INVASION by Ubiquitous Bubba - When our reality is invaded by extra-dimensional beings, imaginary characters may be humanity's only hope. \n   THE GUNS OF NAPOLEON by Peter Lean - A professor of history, a mysterious scientific institute and an impossible painting in a story of time travel. \n   CAUSALITY by Neil Shooter - A dream of desolation and death. How can this end be a beginning? And how can a dream seem so real? \n   NECROMANCER by Emma Faragher - Mal is a necromancer. Now her greatest debt is being called in and her skills are needed. On a murder investigation, no less. \n   KIRA by Ross Harrison - Kira's town has so far survived the destruction wrought by the Government on so many others. But for how much longer? \n   IN THE LAP OF THE GODS by Steph Bennion - There are those who would stop at nothing to keep certain inventions from becoming a reality. \n   MONDAY IMPS by Alexandra Butcher - Have you ever wondered about Mondays? Why is it everything seems to go wrong? There is a simple answer... \n   SEPARATE WARS ON THE SAME STREET by Josh Karaczewski - A new war is being fought on the rooftops and alleyways by men in mech suits. \n   MESRIN STATION by L. L. Watkin - Jan was never an upstanding citizen, but he was never stupid either; and now they are all in more trouble than they thought... \n   HALF-BLOOD by Barbara G. Tarn - Giordano discovers he's a half-blood. His search for his 'real' father will take him farther than he thought.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Short Stories",
    "Anthologies"
  ],
  "author": "Steph Bennion",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/18913511-wyrd-worlds"
}