{
  "title": "V is for Virgin",
  "description": "\"You haven't seen Tralse's website today.\" She said it as a statement, not a question. Without saying another word—apparently there were none to explain the coming horror—Robin surfed over to Tralse's website. Aside from having posted videos from the concert last night of their new song, Kyle had posted a new blog. \"Ten reasons why Virgin Val sucks?\" I screeched. A couple walking past the store looked up, startled, so I bit my tongue to keep from spouting profanities of my own. I clicked on the blog. There was no way to make myself not click on it. The Top Ten Reasons Why Virgin Val Sucks10. She called me a one-hit-wonder.9. She doesn't appreciate the endearing nickname I gave her.8. She makes me write stupid blogs about her at four in the morning.7. She's encouraging people not to have sex.6. She blew me off when I asked her out.5. She has a crush on a douche bag.4. She won't answer any of my calls.3. She's such a tease with her look-but-don't-touch policy.2. I played a whole effing concert just for her and she didn't come even though she told me she would. (You're such a liar!) And the #1 reason why Virgin Val sucks? I still want her anyway.A full minute of silence passed with me simply staring at the computer screen, blinking over and over, hoping that the next time my eyes closed the blog would disappear. \"It's actually very sweet…\" Robin said. \"If you think about it.\"My jaw, which had already fallen slack, hit the floor as I gaped at her. \"Sweet?\" I choked on the word. \"I'm going to KILL him!\"...From the international bestselling YA romance author of Cinder & Ella comes a wildly funny and heart-melting rockstar romance.Kyle Hamilton is the quintessential bad boy, but Val Jensen is not your typical good girl.When Val gets dumped for her decision to stay a virgin until marriage, the nasty breakup goes viral on YouTube, making her the latest internet sensation. After days of ridicule from her peers, Val starts a school-wide campaign to rally support for her cause. She meant to make a statement, but she never dreamed the entire nation would get caught up in the controversy.As if becoming nationally recognized as \"Virgin Val\" isn’t enough, Val’s already hectic life starts to spin wildly out of control when bad boy Kyle Hamilton, lead singer for the hit rock band Tralse, decides to take her abstinence as a personal challenge. How can a girl stay true to herself when this year’s Sexiest Man Alive is doing everything in his power to win her over?V is for Virgin will have you laughing out loud, crying, falling in love, and desperate for more. V is for Virgin is the first book in the Kellywood universe. Then check out book 2, A is for Abstinence, told entirely from Kyle’s point of view!V is for Virgin was a Whitney Award Finalist in 2013 for Best Young Adult Contemporary!Popular tropes to loversRockstar romanceBad Boy/Good Girl",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary",
    "High School",
    "Chick Lit",
    "Contemporary Romance",
    "Humor"
  ],
  "author": "Kelly Oram",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/18912102-v-is-for-virgin"
}