{
  "title": "Witch Avenue Series",
  "description": "All four books in the Amazon Bestselling Witch Avenue Series are now available in one complete set! And don't miss out on a few bonus scenes at the end of the collection.This edition includes: Lonely Souls, Altered Souls, Released Souls, and Shattered SoulsLonely Souls (Witch Avenue #1)Every town has its mysteries. Every avenue has its secrets...Devastated by the loss of her mother, Triss throws herself into uncovering clues surrounding her mother's disappearance. When the Witch Avenue Coven turns their backs on Triss, she realizes she's caught in a world that is ruled by Lonely Souls. But who is controlling them?Recognizing the herbal lore she grew up learning will do little to fight against the underworld, she is relieved when her best friend from childhood, Logan, returns to help her find answers. When they begin uncovering secrets from her family's past, she learns her mother might not have been the only target.But as Triss falls deeply for Logan, she discovers her family isn't the only one with secrets and his may be deadly.Altered Souls (Witch Avenue #2)The realm of Altered Souls brings nothing but unrest, deceit, and pain forcing Triss to come face to face with heartbreak from her past.Facing a betrayal like never before, Triss questions everything she thought she knew about her family, coven, and abilities.With the help of Logan, she embarks on a journey enabling her to confront the dark side of magic and the person who controls it. Realizing Triss's ancestors have been seduced for centuries by the dark side, Triss and Logan must ensure no more in their world fall victim to the realm of Altered Souls, even if that means ending the ones they love.Released Souls (Witch Avenue Series #3)Triss and Logan's love is becoming stronger by the day as they harness the powers between them, but will that make them blind to the evil they're facing?After uncovering startling information about her family, Triss is determined to right the wrongs of her ancestors. Triss and Logan uncover who has infiltrated the covens across the globe, and they realize the plans of the dark side are far more sinister than they'd ever imagined.As the power of this hidden world is exposed, Triss learns her role in the covens. With Logan, Dace and Bakula's assistance, Triss is now able to fully realize the abilities her ancestors have given her.It won't be long until the dark forces regain their strength, especially as their leader, Eben, continues his quest for a power that can never be revoked. Triss must stop him before it is too late.Shattered Souls (Witch Avenue Series #4)The final installment of the Witch Avenue Series.A battle is brewing among the covens...As Triss prepares to defeat the Praedivinus, a new order rises, and this one is far more deadly. Navigating her way through mystic realms, and unknown portals it is up to Triss to recognize real from imagined and stop the two from colliding.",
  "genres": [
    "Paranormal",
    "Mystery",
    "Romance"
  ],
  "author": "Karice Bolton",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/18916210-witch-avenue-series"
}