{
  "title": "Hot & Enchanting",
  "description": "A hot-blooded saga of the De La Cruz familia and their fortunes is centered on romantic relationships of the explosively passionate nature.  Hot & Enchanting, Ricardo Emmanuel De La Cruz is the sexy alpha playboy of la familia and is an attorney. He’s enjoys all the chicas that chase him. They have been chasing him his entire life. Ricky literally runs into Jacqueline Cortez. She’s a bella, shy, and quiet certified public accountant that works for la familia. Jacki turns his world upside down.Jacqueline Cortez has been in love with Ricardo her entire life. She never dreamed that running into him will unleash the amor that she locked up a long time ago. Will she be able to outrun Ricardo and avoid being his next conquest? How long can Jacki resist Ricky’s attention? Is she doomed to fall under his enchantment and into his waiting arms? Why is she pushing me away? Do I repulse her? I have never had a chica react like this. What’s wrong, thinks Ricky.ExcerptRicky is in a hurry getting out of his carro, damn it I’m almost out of time. We have a meeting with the new client and I have to make sure that the contracts are correct before I turn them over for Jose Enrique’s review. Si I hate running behind schedule and I’m always on it. I don’t usually arrive so early at the office, thinks Ricky grabbing his portfolio from his carro. Ricky strides into the hall to get the elevator, missing it, watching the doors close. He stops in shock, damn it, that’s the hermosa muneca from yesterday, thinks Ricky standing, watching her just before the doors close. Wow, I totally missed an opportunity to talk to the muneca. How can I get to know her? I know that she recognizes me. She is looking at me with shock. Yeah, she didn't expect to see me and I sure as hell didn't expect to see her. I need to talk to her outside of the building. I don’t want to cause any issues with la familia’s company employees, ponders Ricky impatiently waiting for the elevator to come down. I know that she works here, but a lot of good that does me. My body won’t calm down, I’m totally awake now. I don’t know what it is about her that provokes these amazing overwhelming reactions.",
  "genres": [
    "Romance"
  ],
  "author": "P.T. Macias",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/18916231-hot-enchanting"
}