{
  "title": "Your Survival Instinct Is Killing You: Retrain Your Brain to Conquer Fear and Build Resilience",
  "description": "Thanks to technology, we live in a world that’s much more comfortable than ever before. But here’s the   our tolerance for discomfort is at an all-time low. And as we wrestle with a sinking “discomfort threshold,” we increasingly find ourselves at the mercy of our primitive instincts and reactions that can perpetuate disease, dysfunction, and impair performance and decision making. Designed to keep us out of danger, our limbic brain’s Survival Instinct controls what we intuitively do to avert injury or death, such as running out of a burning building.   Rarely are we required to recruit this instinct today because seldom do we find ourselves in situations that are truly life-threatening. However, this part of our brain is programmed to naturally and automatically react to even the most benign forms of discomfort and stress as serious threats to our survival.   In this seminal book we learn how the Survival Instinct is the culprit that triggers a person to overeat, prevents the insomniac from sleeping, causes the executive to unravel under pressure, leads travelers to avoid planes or freeways, inflames pain, and due to past heartache, closes down an individual to love.  In all of these cases, their overly-sensitive Survival Instinct is being called into action at the slightest hint of discomfort.  In short, their Survival Instinct is stuck in the “ON” position…with grave consequences.  Your Survival Is Killing You can transform the way you live. Provocative, eye-opening, and surprisingly practical with its gallery of strategies and ideas, this book will show you how to build up your “instinctual muscles” for successfully managing discomfort while taming your overly reactive Survival Instinct. You will learn that the management of discomfort is the single most important skill for the twenty-first century.    This book is, at its heart, a modern guide to survival.",
  "genres": [
    "Psychology",
    "Self Help",
    "Nonfiction",
    "Health",
    "Personal Development",
    "Audiobook",
    "Brain"
  ],
  "author": "Marc Schoen",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/18921383-your-survival-instinct-is-killing-you"
}