{
  "title": "Gather at the Table: The Healing Journey of a Daughter of Slavery and a Son of the Slave Trade",
  "description": "Two people—a black woman and a white man—confront the legacy of slavery and racism head-on  “We embarked on this journey because we believe America must overcome the racial barriers that divide us, the barriers that drive us to strike out at one another out of ignorance and fear. To do nothing is unacceptable.” Sharon Leslie Morgan, a black woman from Chicago’s South Side avoids white people; they scare her. Despite her trepidation, Morgan, a descendent of slaves on both sides of her family, began a journey toward racial reconciliation with Thomas Norman DeWolf, a white man from rural Oregon who descends from the largest slave-trading dynasty in US history. Over a three-year period, the pair traveled thousands of miles, both overseas and through twenty-seven states, visiting ancestral towns, courthouses, cemeteries, plantations, antebellum mansions, and historic sites. They spent time with one another’s families and friends and engaged in deep conversations about how the lingering trauma of slavery shaped their lives.Gather at the Table is the chronicle of DeWolf and Morgan’s journey. Arduous and at times uncomfortable, it lays bare the unhealed wounds of slavery. As DeWolf and Morgan demonstrate, before we can overcome racism we must first acknowledge and understand the damage inherited from the past—which invariably involves confronting painful truths. The result is a revelatory testament to the possibilities that open up when people commit to truth, justice, and reconciliation. DeWolf and Morgan offer readers an inspiring vision and a powerful model for healing individuals and communities.",
  "genres": [
    "History",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Race",
    "Social Justice",
    "Social Issues"
  ],
  "author": "Thomas Norman DeWolf",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/18918274-gather-at-the-table"
}