{
  "title": "Nano Surveillance",
  "description": "With the country on the brink of financial collapse, billionaire and high tech entrepreneur Dave Henson breaks an old personal oath to himself to remain apolitical as he attempts a daring and dangerous mission to save the country. Dave, along with a small group of engineers at his company NSurv, and his old friend and news reporter Dana Cogswell, decide to use NSurv's bio-nano sensor technology to bring a whole new level of transparency between the federal government and the public. In the process they discover and reveal a sinister plot by the President and his administration to secretly drain and transfer the country's wealth and power to foreign entities. While Dave and his team covertly work to change the country's political and economic direction by exposing the corruption in Washington D.C., the President announces his new plans to end global climate change and restore the country's economy. However the President's plans run sinisterly deeper, and include the required use of personal tracking sensors to be installed in every automobile and product sold in the country. If the President's plans become law, Dave is convinced it will destroy the country and provide the government with unfettered surveillance of the public. Dave's team quickly finds itself intertwined in a deadly war with the President and his allies. As the NSurv team works to capture and report the ultimate story to topple the administration and save the country, the President and his allies stop at nothing to protect their self interests and to capture NSurv's new surveillance technology. Risking life and limb, and a rekindled relationship with Dana, Dave remains undeterred while he leads his team forward in accomplishing their mission. Mentally torn, Dave inevitably has to ask the most from Dana. His request, and her decision on how much to sacrifice of herself, tests their new found relationship and holds the key to their ultimate success.",
  "genres": [],
  "author": "Mark   Donovan",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/18924350-nano-surveillance"
}