{
  "title": "Masters of the Word: How Media Shaped History from the Alphabet to the Internet",
  "description": "A “riveting and thoroughly researched” history of language technology’s effect on society across millennia—from Sumerian syntax to social media hashtags (Phil Lapsley).   Writing was born thousands of years ago in Mesopotamia. Spreading to Sumer, and then Egypt, this revolutionary tool allowed rulers to extend their control far and wide, giving rise to the world’s first empires. When Phoenician traders took their alphabet to Greece, literacy’s first boom led to the birth of drama and democracy. In Rome, it helped spell the downfall of the Republic. Later, medieval scriptoria and vernacular bibles gave rise to religious dissent, and with the combination of cheaper paper and Gutenberg’s printing press, the fuse of Reformation was lit.   The Industrial Revolution brought the telegraph and the steam driven printing press, allowing information to move faster and wider than ever before through the invention of the newspaper. But along with radio and television, these new technologies were more easily exploited by the powerful, as seen in Germany, the Soviet Union, even Rwanda, where radio incited genocide.   With the rise of carbon duplicates (Russian samizdat), photocopying (the Pentagon Papers), the internet, social media, and cell phones (the recent Arab Spring) more people have access to communications, making the world more connected than ever before. This “accessible, quite enjoyable, and highly informative read” will change the way you look at technology, history, and power (Booklist).   “[Bernstein] enables us to see what remains the same, even as much has changed.” —Library Journal, “Editors’ Picks”   “It brims with interesting ideas and astonishing connections.” —Phil Lapsley, author of Exploding the The Untold Story of the Teenagers and Outlaws Who Hacked Ma Bell   “[Bernstein’s] narrative is succinct and extremely well sourced. . . . [He] reminds us of a number of technologies whose changed roles are less widely chronicled in conventional histories of the media.” —The Irish Times",
  "genres": [
    "History",
    "Nonfiction",
    "Linguistics",
    "Politics",
    "Language",
    "Technology",
    "Business"
  ],
  "author": "William J. Bernstein",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/18924787-masters-of-the-word"
}