{
  "title": "Three Men and a Bride",
  "description": "From National Bestselling Author Opal Carew, comes the second short story in the erotic THREE series! Her books regularly appear in Amazon's Top 100 Contemporary Romance and Top 100 Erotic lists. THREE hit #15 on Barnes & Noble's overall list. What do you do when you can’t stop lusting after your new husband’s two gorgeous brothers?After a whirlwind romance, newlyweds Drake and Marie return from their honeymoon to begin their life together. Knowing how close Drake is to his two brothers, Marie expected to be nervous about meeting them. What she didn’t expect was the overwhelming lust they stirred in her. Whenever they are around, Marie is left breathless with an all-consuming longing to be taken by all three men...at once.Can she successfully suppress her fantasies of the three brothers making wild, luxuriant love to her, or will she have to endanger her happy marriage by admitting her feelings to Drake?Long-awaited Volume 2 of the erotic THREE series, this is actually the prequel to the original story.Please note that this is a short story.Praise for Opal's books:5 Stars!\"No one writes stories about erotic fantasies better than Opal Carew...Kudos to Opal Carew for another well-written erotic romance. I look forward to where she takes us next.\"Jennifer Porter, Romance Novel News4.5 Stars!\"...there are a lot of twists to this roller coaster ride of a story... A scorcher of a read, I was unable to put this one down.\"Sensual Reads4.5 Kisses!\"another blazing hot romance not to be missed by erotic author Opal Carew. Once I started this book, I just couldn’t put it down... [her] erotic story-writing talent shines through... one wild ride of a book that just whets my appetite for more erotic romance by Opal Carew!\"Victoria, TwoLips Reviews4.5 Blue Ribbons!\"a blazing hot erotic romp... A fabulously fun and stupendously steamy read for a cold winter's night. This one's so hot, you might need to wear oven mitts while you're reading it!\"Romance Junkies4 Cups!\"There is little chance of reading anything more sexually stimulating than a book by Opal Carew.\"Lototy, Coffee Time Romance & More\"Opal Carew is a genius at spinning the most erotic stories by tapping into forbidden fantasies and visiting emotions that bring the characters literally to their knees. A steamy-hot read! WOW!\"Mandy Burns, Fresh Fiction\"Be prepared for an all out sensual feast.... The sex is creative, detailed, and sizzling.... Step outside of the ordinary for something adventuresome….\"Romance Reviews Today",
  "genres": [
    "Menage",
    "Erotica",
    "Romance",
    "Novella",
    "Adult"
  ],
  "author": "Opal Carew",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/18929363-three-men-and-a-bride"
}