{
  "title": "Killer's Art",
  "description": "\"Jungstedt delivers an excellent clammy atmosphere and a constant premonition of weird deaths to come. She's becoming one of Scandinavia's best crime writers, no mean compliment in a crowded field.\"--\"The London Times\" \"After this weekend his well-ordered life would be turned upside-down, but he was the only one who knew what lay ahead. He had formulated the plans over the past six months, and now there was no going back. His twenty-year marriage would be over when Monday arrived.\" It is a cold wintry morning in the picturesque port town of Visby when art dealer Egon Wallin's battered and naked body is found hanging from a gate in the town's old city walls. When the famous painting \"The Dying Dandy\" is stolen in Stockholm, disturbing links to Wallin's murder slowly start to surface, taking the reader into the glittering world of the Swedish art elite and shadowy underground of prostitution and drugs. In this spine-chilling novel, superintendent Anders Knutas is facing one of the toughest investigations in his career. \"Mari Jungstedt creates the special atmosphere of Nordic crime-that land of snow and ice that fires our imagination.\"--Jane Jakeman, \"The Independent\" \"There is an icy dispassionate grip to Jungstedt's writing that recalls Henning Mankell.\"--\"Metro\" \"For some considerable time, cognoscenti of the best Scandinavian crime fiction have been aware that Mari Jungstedt's Inspector Knutas novels are among the most rarefied and satisfying pleasures afforded by the field.\"--Barry Forshaw, author of \"Death in a Cold A Guide to Scandinavian Crime Fiction Writers\" \"Swedish Crime fiction writer, Mari Jungstedt, keeps getting better and better. . . .[\"Killer's Art\"] is a very enjoyable book, excellently written. . .\"--Nordic Bookblog \"\"Killer's Art\" is a classic demonstration of just why Mari Jungstedt is held in such high esteem.\"--CrimeTime, blog \"The \"Killer's Art\" is the fourth book in the Knutas/Berg series--similar to the police procedurals of Peter Robinson. It hasn't been published in the US, which is a pity because it's one of my favorite Swedish series.\"--PopGoesFiction, blog",
  "genres": [
    "Crime",
    "Mystery",
    "Thriller",
    "Fiction",
    "Sweden",
    "Scandinavian Literature",
    "Swedish Literature"
  ],
  "author": "Mari Jungstedt",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/18928182-killer-s-art"
}