{
  "title": "Twelve Worlds",
  "description": "An anthology of short stories by new, independent authors. Author royalties will be donated to Reading is Fundamental, the nation's largest nonprofit children's literacy organization.StoriesBy a Whisker by Kevin O. McLaughlin (3500 words): Someone is siphoning magical energy from the powerful ley nexus at Northshield University in this urban fantasy. Ryan goes to investigate, and gets help from an unexpected quarter.The Accidental Muse by Amy Rose Davis (6200 words): A girl with no memory, a grieving widower, and a sweet-natured boy with strange power live a quiet life in their sheltered Keep until the night a traveling musician arrives at the door. The power of the musician's harp threatens to destroy their family unless one of them can stop it. A tale of gods, muses, mysterious spirits, and the power of love.The Price of Vengeance by Derek J. Canyon (7400 words): In 22nd century Atlanta, Maggie hunts the genetically-engineered dwarf who killed her entire gang.Insomnomancer by J.E. Medrick (3400 words): Witness life through the eyes of a predator. Kyle Hall, barely remarkable in a world of gray faces, is targeted by a very specialized hunter. To the target, it is night after sleepless night. To the Insomnomancer - a game of points and hungry satisfaction.Thump by N.B. Kelly (4650 words): When a hitchhiker becomes part of an impromptu road trip, peace is the last thing that two young men will get out of it.Iron in Shadow by Edward L. Cote (14900 words): The best thief in Rithmoor, the City of Dark Water, goes by the name Slip. He takes on a promising job, but it gets more complicated and dangerous the more he learns about what exactly it is he must do. To avoid certain death at the hands of the Great Magus Dibian, he must risk the wrath of the world's hardest people.Together They Die by Brian Drake (3220 words): A former cop helps a ghost solve her murder.Incubators by Manley Peterson (3200 words): Lost in space, three astronauts struggle to accept their fate aboard a crippled ship. Could a last-minute rescue be all they hoped for?Cube by Coral Russell (4150 words): Luke's family isn't perfect, but they're worth saving. How far would you go to save your family?The Star-Eater by K. Gorman (6000 words): Karin wakes up one day on her starship, realizing her sister has been killed--but not before her sister cursed the murderer. Now she's got a man to kill. And her boss is starting to suspect that she's a little more than human...Man-Maker by B.C. Woods (8050 words): A young boy in a society based entirely around defending itself against zombie-like demons refuses a sacred rite of passage.Daddy Issues by John G. Hartness (4200 words): Vampires, voodoo, zombies and gold-diggers, it's all in a day's work for the boys at Black Knight Investigations. Vampire Private Investigators Jimmy Black and Greg Knightwood are called in to dispose of a zombie in the library, but there's always more than meets the eye where these detectives are concerned. Takes place before the events in Hard Day's Knight.BONUS STORIES!Weird and Wondeful by Tony Lavely (6000 words): Mailira and Marelsa together bring an old Scottish folk tale to life for a young musician.The Light Stream by Jaylin Baer (3060 words): The transition between waking and sleeping, dreaded by some and enjoyed by others, becomes something altogether different for a very select few. Discover one woman's journey into the Light Stream.",
  "genres": [
    "Fantasy"
  ],
  "author": "Derek J. Canyon",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/11052287-twelve-worlds"
}