{
  "title": "Sickness and Cruelty in the Workhouse",
  "description": "SICKNESS AND CRUELTY IN THE WORKHOUSE is the true story of Joseph Rogers, a Victorian workhouse Doctor.Joseph Rogers was a medical officer at two different workhouses in Victorian London. At both workhouses, he encountered conditions which appalled him. He also witnessed the idleness and corruption of those who ran the workhouses, as well as their indifference and cruelty towards the people in their care.As a result, Joseph Rogers became what would now be described as a “whistle blower”. At some risk to his own career, Rogers tried to let the Victorian public (and politicians) know what was going on inside London’s workhouses.In his autobiography, Joseph Rogers left a vivid description of conditions inside the workhouse. SICKNESS AND CRUELTY IN THE WORKHOUSE is an edited version of his autobiography, and will appeal to anybody who is interested in a first hand account of life in a Victorian workhouse, and in the treatment of the poor in Victorian London.From the book:“ ... all my nurses were pauper inmates. The responsible duties they had to perform were remunerated by an amended dietary and a pint of beer. Occasionally for laying out the dead, and for other specially repulsive duties, they had a glass of gin. This was given by the master or matron, but I was expected to sanction the supply.”“ ... the ward used for foul cases ...was in immediate proximity to the tinker's shop. It was altogether unsuitable for the reception of any human being, however degraded he might be; but it had to be used. I remember a poor wretch being admitted with frost-bitten feet, which speedily mortified, rendering the atmosphere of the ward and shop frightfully offensive. At first I was at a loss to know whom to get to go through the offensive duty of waiting on him. At last a little fellow, called Wiseman, undertook the task, the bribe being two pints of beer and some gin daily, with steaks or chops for dinner. Presently the patient was seized with tetanus, and after the most fearful sufferings died. He was followed almost immediately afterwards by poor Wiseman, who had contracted from his patient one of the most malignant forms of blood poisoning that I ever saw.”",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Joseph  Rogers",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/18929649-sickness-and-cruelty-in-the-workhouse"
}