{
  "title": "In the Magician's House",
  "description": "Watch your step, this book doesn't play straight! Neither does the Magician’s house – rooms move around. If you’re the sort of person who needs predictability then pick up another book, curl up and enjoy it. This book won’t mind. But if you’d like to take an active part in a book then stick around. You might be just the reader it has been waiting for. Dreams swirl around in the Magician’s house like dust in the corners of other houses. Little stories get stuck in the crannies. Just for a moment, while you are sweeping, you can find yourself running across a green field, steering an iron horse through twisty roads, or picking ripe strawberries in a bright, warm field. Other times you are transported to different places, so you watch where you step. Some mornings, just getting to breakfast is an adventure. Interactive fiction for ages 10 - 12.'You Say Which Way' books can be read in any order. And the big list of choices makes it easy to find story lines you haven't read yet.Have you read all these 'You Say Which Way' adventures?Dinosaur CanyonDragons RealmDungeon of DoomSecrets of the Singing CaveDeadline DeliveryMystic PortalStranded StarshipOnce Upon an IslandIn the Magician's HousePirate IslandLost in Lion CountryBetween the StarsMovie Mystery MadnessSecrets of Glass MountainVolcano of FireDanger on Dolphin IslandMissing Cat MysteryDuel at DawnIsland of GiantsThe Sorcerer's Maze - Adventure QuizThe Sorcerer's Maze - Jungle TrekThe Sorcerer's Maze - Time MachineOr check out the You Say Which Way sets and save.Four You Say Which Way AdventuresThree You Say Which Way Adventures4 More You Say Which Way AdventuresSci Fi Two Book BundleBest of You Say Which WayThe Sorcerer's Maze CollectionThree Animal AdventuresPast Present Future 3 in 1The You Say Which Way Collection",
  "genres": [
    "Fantasy",
    "Gamebooks",
    "Choose Your Own Adventure",
    "Childrens"
  ],
  "author": "D.M. Potter",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/18922809-in-the-magician-s-house"
}