{
  "title": "Hegemony and Revolution: Antonio Gramsci's Political and Cultural Theory",
  "description": "As a result of his inquiry into the nature of class, culture, and the state, Antonio Gramsci became one of the most influential Marxist theorists. Hegemony and Revolution is the first full-fledged study of Gramsci’s Prison Notebooks in the light of his pre-prison career as a socialist and communist militant and a highly original Marxist intellectual. Walter Adamson shows how Gramsci’s concepts of revolution grew out of his experience with the Turin worker councils of 1919–1920 as well as his experience combatting the Fascist movement. For Gramsci, revolution meant the steady ascension of a mass-based, educated, and organized “collective will,” in which the final seizure of power would be the climax of a broader educative process. Success depended on countering not just the coercive power of the existing economic and political order but also the cultural hegemony of the state. A “counter-hegemony” for Gramsci required the leadership of an organized political party, but at its core lay his conviction that the common people were capable of self-enlightenment and could produce an alternative conception of the world that challenged the prevailing hegemonic culture. Adamson shows how these ideas, which Gramsci developed prior to his imprisonment, led him to a highly original concept of “subaltern” class movements that cohere not just on the basis of economic interest but by virtue of religious, ideological, regional, folkloric, and other sorts of cultural ties as well. These ideas of Gramsci have had enormous influence on a wide variety of subsequent cultural theories including postcolonialism and Foucault-style analyses of discursive practices. Winner of the Society for Italian History’s Howard Marraro Prize, Hegemony and Revolution is an essential resource for scholars of the humanities and social sciences. Walter L. Adamson earned his PhD in the History of Ideas from Brandeis University in 1976. He taught at Whitman College and then at Harvard University as a Mellon Fellow in the Humanities, after which he joined the Emory University faculty in 1978. At Emory he teaches a variety of courses in modern European intellectual history and Italian history from the Risorgimento forward, with particular attention to fascism, nationalism, and imperialism. He is the former Chair of the Emory History Department. Dr. Adamson has authored a number of books including Marx and the Disillusionment of Marxism ; the award-winning Avant-garde From Modernism to Fascism ; and Embattled Modernism’s Resistance to Commodity Culture in Europe .",
  "genres": [
    "Politics",
    "Sociology",
    "Philosophy"
  ],
  "author": "Walter L. Adamson",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/189232.Hegemony_and_Revolution"
}