{
  "title": "Thread Strands: Golden Threads Trilogy",
  "description": "A 5,000-year conflict. Reality is under attack. A mercenary and a wizard are the world’s only chance for survival…20,000 years into our future, Ticca, a young female mercenary, and Lebuin, a new wizard, are in way over their heads. While they’ve escaped a series of deadly traps, the unlikely pair has become directly involved in a 5,000-year conflict spanning past and future that’s being fought by nations, guilds, and gods. When a mercenary nation sends death squads to hunt them down, Ticca and Lebuin must piece together clues to stop the shadowy mercenaries from destroying the alliance kingdoms.As they discover shocking truths about their attackers, themselves, and reality itself, they’ll join with unexpected allies to play a series of deadly games in a race for forbidden knowledge. It’s the only way to prevent a fast-approaching and devastating war.Thread Strands is the second book in an epic fantasy/speculative sci-fi trilogy set in a distant future. If you like mixing medieval with modern and mystic with machine, then you’ll love this fast-paced and entertaining fantasy read.Buy Thread Strands to continue the engrossing complete fantasy and science fiction epic adventure series today!Interview with the AuthorQ - What makes the Golden Threads Trilogy epic series such a bestseller?A - Duke.Maybe not, but he is a very popular character (just ask him). Most likely you are like me, we want to believe magic might be real. We just have to figure it out and the impossible will be in our reach. That is the central element to this epic fantasy and science fiction series. Magic is real, just not exactly what most people believe it to be. Our universe interacts with one of magic and together they blend to make a world of sword & sorcery. A world with Ticca, Lebuin, and yes Duke.I wrote these wondrous adventure books to explore a possible future for Earth. The world in this complete series is our far future, with several unexpected twists. Some astute readers noticed the science fiction elements early and speculated that the epic fantasy adventure was really a stealthy science fiction adventure.To some extent they were right. However, in these books, both the swords and the sorcery are all too real giving you a fun mashup of the fantasy and science fiction genres. I’ve made sure there were plenty of elves, dragons, orcs, and ninjas to satisfy most readers’ needs. However, my take on them overall should be both surprising and fun for you. I won’t spoil the trilogy for you by explaining how. The elements keep adding up to bigger and wider views of the world. The complete series is a reliable page-turner never letting up on the thrilling or wondrous actions of our heroes.Q - What order should I read the books in?A - Good question. I do not mean these books to be read out of order. I’d recommend the following Thread SliversThread StrandsThread SkeinQ - Are these books safe for teens and tweens?A - Absolutely, there is no explicit details or bad words. Adult subjects are there but dealt with in a tween safe way. I made this complete series a fast, fun-ride for adults and teens to live with wizards and warriors! Each of the books has hit the top ten bestsellers list on Kindle for Fantasy and Science Fiction, which isn’t easy.",
  "genres": [
    "Fantasy",
    "Science Fiction"
  ],
  "author": "Leeland Artra",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/18925342-thread-strands"
}