{
  "title": "Phoenix Island",
  "description": "******MILLION-COPY BESTSELLER, NEWLY EDITED AND BACK IN PRINT*******#1 KINDLE (US) BESTSELLER IN ADVENTURE LITERARY FICTION (JAN. 2014)** ONE LONELY ISLAND, ONE TIDAL WAVE, NINE SURVIVORS . . . A tsunami is one of the last things Dr. Andrew Held expects while entertaining guests on Phoenix Island, the tiny, isolated outpost of Washington State he has made his private home. But when a French nuclear bomb test in the South Pacific goes awry, the ensuing tidal wave destroys his island estate and severs all ties to the mainland. The survivors are Andrew Held himself, the brilliant Hungarian-born nuclear physicist who helped create the bombs he now campaigns against. Donald Campbell, steward to Dr. Held but secretly a fugitive from justice, with hungers he can barely contain. Diana Lindgren, the lovely yet emotionally damaged young girl hired to help with the guests, and Rolf Morgan, her Native American boyfriend, impelled by love to follow her to Phoenix in his fishing boat. There's Carlo Minatti, a Hawaiian musician with a winning manner and easygoing style. The sculptor Warren Brock, urbane, hedonistic, openly gay, with a barbed wit that takes no prisoners. Blake and Norma Mansfield, a New York middle-class couple, likeable to everyone but each other. And Felicia Stowe Held -- Andrew's estranged wife -- a ravishing socialite whom he pushed away in a moment always regretted and who has now come seeking divorce. Nine individuals with little in common and histories setting them far apart, yet each with unique, unexpected strengths, virtues, and talents. As hopes of quick rescue dim, their only chance of survival is to bridge their differences, transcend their conflicts, and learn to live in harmony with each other -- and in some cases, with themselves. Part techno-thriller, part romance, part wilderness survival story, part utopian novel, Charlotte Paul's \"Phoenix Island\" sold over a million copies as a mass-market paperback in the late 1970s and 1980s. Now it is reborn in a newly-edited 35th Anniversary Edition. ///////////////////////////////////////////////// Charlotte Paul (1916-1989) led a life marked by the pursuit of numerous careers -- news editor, wife, back-to-the-lander, freelance writer, mother, novelist, rural newspaper proprietor, memoirist, parole board official -- and usually several of these at once. Living mostly in the U.S. Pacific Northwest, with a multi-year stint in Washington, D.C., she spent her final two decades on Lopez Island, one of Washington State's enchanting San Juan Islands. On these she modeled chief locales of what became her most popular novel, \"Phoenix Island.\" ///////////////////////////////////////////////// BISAC SUBJECTS FIC002000 FICTION / Action & AdventureFIC036000 FICTION / Thrillers / TechnologicalFIC028070 FICTION / Science Fiction / Apocalyptic & Post-ApocalypticFIC019000 FICTION / LiterarySOC040000 SOCIAL SCIENCE / Disasters & Disaster ReliefPOL051000 POLITICAL SCIENCE / UtopiasPOL034000 POLITICAL SCIENCE / Peace",
  "genres": [
    "Dystopia",
    "Historical Romance",
    "Adventure",
    "Fiction",
    "Amazon",
    "Survival",
    "Contemporary"
  ],
  "author": "Charlotte Paul",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/18932998-phoenix-island"
}