{
  "title": "Hiding in Plain Sight",
  "description": "This is the prequel to the bestselling series, the Hellion Motorcycle Club.*-*\nReese is on the run from the future her family forced on her.\n Raised in a house of hurt, never learning to trust or love, Reese knows her future will be as bleak as her past if she stays with the abusive crime boss her father sold her to at age 21. Without a clue of how to protect herself, she runs away, desperate for escape. But pursued by the dangerous henchmen sent to find her, she chooses to avoid exposure, and travel the back highways in order to get as far away as possible. When her car breaks down on a desolate country road, should she trust the biker who stops to help, no matter how hot she finds him? With danger close behind, does she have any other choice? \nBrand's future was stolen from him long ago.\n His family cruelly ripped from his life by his country's civil war, Brand has his own painful past to forget ... and his own dangerous secrets to keep. As a rogue member of the Hellion's Motorcycle Club, he has enough on his plate without taking on a stranded damsel in distress. Yet, when the trouble the young beauty is wrapped up in turns out to be much bigger than just a broken down vehicle, Brand feels compelled to help keep her safe ...and close. Can these two damaged souls find a new future together? When the paths of two lost people intersect and their need for each other grows, can Brand and Reese forge a better life for themselves and each other while hiding in plain sight? **Intended for mature audience due to graphic language and detailed sexual situations***-*\nHellion Motorcycle Club\n series:Book 0.5: Hiding in Plain SightBook 1.0: The Possibility of Trey Book 2.0: Reinventing Mel Book 3.0: Taking a DareBook 4.0: A Civilian for SiloBook 5.0: Checkmate With Bishop",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Motorcycle",
    "Erotica",
    "Suspense",
    "New Adult"
  ],
  "author": "J.A. Hornbuckle",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/18931799-hiding-in-plain-sight"
}