{
  "title": "Big Fat Box Set",
  "description": "The SMASH HIT SERIES now a new TV series on SYFY, Reginald The Vampire!This collection contains ALL SIX BOOKS in the Fat Vampire * Fat Vampire* Fat Vampire 2: Tastes Like Chicken* Fat Vampire 3: All You Can Eat* Fat Vampire 4: Harder Better Fatter Stronger* Fat Vampire 5: Fatpocalypse* Fat Vampire 6: Survival of the FattestDESCRIPTION FOR FAT VAMPIRE (BOOK 1 IN THIS 6-BOOK COLLECTION):When overweight treadmill salesman Reginald Baskin finally meets a co-worker who doesn't make fun of him, it's just his own bad luck that tech guy Maurice turns out to be a two thousand-year-old vampire.And when Maurice turns Reginald to save his life, it's just Reginald's own further bad luck that he wakes up to discover he's become the slowest, weakest, most out-of-shape vampire ever born, doomed to \"heal\" to his corpulent self for all of eternity.As Reginald struggles with the downsides of being a fat vampire -- too slow to catch people to feed on, mocked by those he tries to glamour, assaulted by his intended prey and left for undead -- he discovers in himself rare powers that few vampires have… and just in time too, because the Vampire Council might just want his head for being an inferior representative of their race.Fat Vampire is the story of an unlikely hero who, after having an imperfect eternity shoved into his grease-stained hands, must learn to turn the afterlife's lemons into tasty lemon danishes.★★★★★ \"We need more Vampires like Reginald. Not the cliche, pretty tripe trope that they've fallen into. But Vampires \"made from\" real people.\" -- Amanda★★★★★ \"I've never read a series where in the middle of an extremely violent sequence, I'd find myself laughing out loud at something Reginald would say or do. It's this kind of juxtaposition of sci-fi/paranormal and humor that had me hooked from the very first page. Definitely a series worth diving into as it's not your run of the mill vampire scenario. I enjoyed it thoroughly.\" -- Avid Book Lover★★★★★ \"I absolutely, positively, delightfully drank these books dry from start to finish. If you're sick of vampires that sparkle and don't exhibit real-world problems, Reginald and his story are the antidote for you.\" -- The Rev Ari★★★★★ \"Working my way through this series I kept dreading the fact that sooner or later (much too \"sooner\") I'd reach the end of the story. It's an amazingly well-told, often hilarious, very mind-bending saga about humans and vamps - from the vamp viewpoint - without the need to lean on a love interest to get the point across. I LOVE this series and I do wish it could go on forever, but hey...\" -- Theresa★★★★★ \"This is an unusual take on vampires, while leaving most of the normal stuff alone. Vampires still drink blood, still glamour humans, still fry in the sunshine. But it includes humor, witticisms, sex, the creation story, an apocalypse and lots of Cheetos, Pizza, and Coca Cola. It's a bit of horror, and romance, and scifi, and horror, and comedy.\" -- Rolanda GrantFat Vampire is a fresh twist on the tired old undead myth by Johnny B.",
  "genres": [
    "Vampires",
    "Fantasy",
    "Humor",
    "Supernatural",
    "Speculative Fiction"
  ],
  "author": "Johnny B. Truant",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/18935794-big-fat-box-set"
}