{
  "title": "The Runes of Evolution: How the Universe became Self-Aware",
  "description": "How did human beings acquire imaginations that can conjure up untrue possibilities? How did the Universe become self-aware? In The Runes of Evolution , Simon Conway Morris revitalizes the study of evolution from the perspective of convergence, providing us with compelling new evidence to support the mounting scientific view that the history of life is far more predictable than once thought. A leading evolutionary biologist at the University of Cambridge, Conway Morris came into international prominence for his work on the Cambrian explosion (especially fossils of the Burgess Shale) and evolutionary convergence, which is the process whereby organisms not closely related (not monophyletic), independently evolve similar traits as a result of having to adapt to similar environments or ecological niches. In The Runes of Evolution , he illustrates how the ubiquity of convergence hints at an underlying framework whereby many outcomes, not least brains and intelligence, are virtually guaranteed on any Earth-like planet. Conway Morris also emphasizes how much of the complexity of advanced biological systems is inherent in microbial forms. By casting a wider net, The Runes of Evolution explores many neglected evolutionary questions. Some are remarkably general. Why, for example, are convergences such as parasitism, carnivory, and nitrogen fixation in plants concentrated in particular taxonomic hot spots? Why do certain groups have a particular propensity to evolve toward particular states? Some questions lead to unexpected evolutionary If bees sleep (as they do), do they dream? Why is that insect copulating with an orchid? Why have sponges evolved a system of fiber optics? What do mantis shrimps and submarines have in common? If dinosaurs had not gone extinct what would have happened next? Will a saber-toothed cat ever re-evolve? Cona Morris “Even amongst the mammals, let alone the entire tree of life, humans represent one minute twig of a vast (and largely fossilized) arborescence. Every living species is a linear descendant of an immense string of now-vanished ancestors, but evolution itself is the very reverse of linear. Rather it is endlessly exploratory, probing the vast spaces of biological hyperspace. Indeed this book is a celebration of how our world is (and was) populated by a riot of forms, a coruscating tapestry of life.” The Runes of Evolution is the most definitive synthesis of evolutionary convergence to be published to date.",
  "genres": [
    "Science",
    "Evolution",
    "Philosophy",
    "Biology",
    "Nonfiction",
    "History"
  ],
  "author": "Simon Conway Morris",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/18936730-the-runes-of-evolution"
}