{
  "title": "Diario flaite de un vampiro",
  "description": "El protagonista de esta historia se hace vampiro por culpa de unos flaites. Aun así, intenta seguir con su joven estudia en la universidad, tiene Facebook, sale con chicos y chicas y escribe en diarios, cuadernos y mails, sus andanzas y reflexiones en torno a su nuevo mundo.«Aquí hay sangre, sexo y drogas. En parte lo menciono porque es cierto. Y en parte porque suena a la clásica-frase-impresionante sobre algún libro o alguna película, y lo que hace Joannes Lillo acá es justo lo opuesto a lo clásicamente impresionante. Suena contradictorio. Pero este libro se alimenta de su contradicción. Un libro de vampiros que se ríe del género libro de vampiros. Una novela de formación vampírica que se ríe de las típicas novelas de formación donde el héroe aprende algo. Un juego autobiográfico –el vampiro es Joan, Joannes, Johnny– que se ríe de la autobiografía. Una novela que siempre se está escapando de lo que se supone que una novela tiene que ser. Un texto que está narrado con tanta desidia como energía y en el que la vida –o la muerte– huye de cualquier épica posible para en cambio abrazar momentos cotidianos, comunes, pequeños y hermosamente charchas.» Camila Gutiérrez“El joven escritor Joannes Lillo propone una nueva forma de ironizar la nouvelle vampiro, romper el canon del romanticismo, y ejecutar un pacto con la muerte y la escritura”. Diego Ramírez“Un libro fantástico, barroco, sangriento y marginal”. 60WattsSOBRE EL JOANNES LILLO nació en Santiago de Chile en 1989. Fue ganador del Premio Municipal Juegos Literarios Gabriela Mistral 2015 en el género cuento. También obtuvo un premio especial en el Concurso Roberto Bolaño a la Creación Literaria Joven 2014, y la Beca de Creación Literaria del Fondo del Libro del Ministerio de Cultura 2016. Diario flaite de un vampiro es su primera novela, originada en el taller literario Moday Pueblo.",
  "genres": [],
  "author": "Joannes Lillo",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/18932507-diario-flaite-de-un-vampiro"
}