{
  "title": "Summer of '46",
  "description": "Sizzling Explicit Historical Erotica set in the year 1946. A war vet named Clyde and a Rich draft dodger both have their eyes set on the same woman, Frances. A natural redhead who likes to bilk men out of their money while their eyes are drawn to her beauty. Here's a preview for was the summer of 1946 when Clyde walked into Lucky’s. He was in Indiana now, Clyde had been left alone in Chicago to deal with the debts a man named Teddy had racked up playing poker. He figured Teddy might stop in a place like this, and if not maybe Clyde could wash some dishes or serve a few drinks for a hot meal. As Clyde darkened the doorway he spotted Teddy talking to a lovely redhead who was way out his league, she was as pretty as Ann Sheridan. Clyde went to them seated over at the bar, trying to hide his limp as best he could. Trying his best to be Cary Grant, suave and handsome but with more scars. He took a seat next to Teddy, who was trying to be James Cagney without the mettle. “Well, if it isn’t my very best buddy in the whole wide world,” said Clyde.Clyde patted Teddy on the back in the friendliest way he could manage at the time. Teddy winced, and Frances smiled up at Clyde and stuck her hand out.Clyde gently took her hand in his and gave it a peck. “And what might your name be, Lovey?”“Frances, enchanted to meet you.”“Frances my dear, what could such a fine lady such as yourself be doing talking to a gentleman of questionable tastes and desires, like my dear old buddy here?”“Hey Clyde, great to see you again, how about you go scram,” said Teddy.“Surely you don’t mean that, Theodore, after all, you left me in the lurch back in Chicago, I figure the least you could do is buy me and drink and a meal.”The men glared at each other and Frances sat there feeling out of place. She lit a cigarette and Teddy softened his glance as he looked at the beautiful lady sitting next to him. Red fiery hair that seemed to ignite his passions, world war three is going to be about a woman, thought Clyde.Copyright © 2012 Don DracoAll Rights Reserved",
  "genres": [],
  "author": "Don Draco",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/18938640-summer-of-46"
}