{
  "title": "Rambo",
  "description": "The most dangerous man in the world is back. David Morrell’s First Blood introduced Rambo, who joined the ranks of Sherlock Holmes, Tarzan, James Bond, and Harry Potter as an international thriller icon. In this sequel, Rambo is in prison for his one-man war against a small-town police chief. His former commanding officer, Colonel Trautman, arrives with a promise to release him, with two conditions. First, Rambo must return to the Vietnamese prison camp from which he escaped and find the missing Americans rumored to be prisoners there. The second condition? Don’t rescue the prisoners. Only bring back photographs. Under no circumstances engage the enemy. For Rambo, the first part is difficult. But the second is impossible. This novelization and the film have many differences. Read the story that the film could have had, along with David Morrell’s in-depth introduction about Rambo and the book’s background.David Morrell is the award-winning author of First Blood, the novel in which Rambo was created. His numerous other bestsellers include the classic spy trilogy: The Brotherhood of the Rose, the Fraternity of the Stone, and The League of Night and Fog. An Edgar, Anthony, and Macavity nominee, Morrell is a recipient of three prestigious Bram Stoker awards as well as the lifetime-achievement Thriller Master Award from the International Thriller Writers organization.“David Morrell is, to me, the finest thriller writer living today, bar none.”—Steve Berry, New York Times bestselling author of The Columbus Affair “Morrell, an absolute master of the thriller, plays by his own rules and leaves you dazzled.”—Dean Koontz, New York Times bestselling author of 77 Shadow Street“The father of the modern action novel.”—Vince Flynn, New York Times bestselling author of Kill Shot",
  "genres": [
    "Fiction",
    "Thriller",
    "War",
    "Action",
    "Military Fiction",
    "Adventure",
    "Audiobook"
  ],
  "author": "David Morrell",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/18939277-rambo"
}