{
  "title": "No Ceiling, No Walls: What women haven't been told about leadership from career-start to the corporate boardroom",
  "description": "With the right leadership skills, the highest levels of career success are well within reach. Unfortunately, conventional wisdom about leadership won’t get you to the top. Much of it is outdated, incomplete, and ineffective. What you need is...The Missing 33%™!No Ceiling, No Walls takes a fresh, unblinking look at leadership. It identifies the vital missing piece of the leadership equation, describing the \"why\" as well as the \"what\" with specific, actionable information you won't find anywhere • Develop 3 crucial skills seldom taught in leadership programs• Focus on hitting outcomes rather than just doing your job• Speak the Language of Power™ without losing your voice• Cultivate your own greatness while engaging it in others• Create your own career path with help from trailblazing leading womenand more!Organizations that have bought No Ceiling, No Among the organizations that have bought multiple copies of No Ceiling, No Walls for their women AACE International, DePuy (a J&J company), Interpublic Group, Kodak, MassMutual, New York Life, PepsiCo, Professional Women in Healthcare, OfficeMax, Prudential, Sunoco, The MITRE Corporationand many more!Praise for No Ceiling, No Walls“Women at all career levels must incorporate the ideas in this thoughtful book on leadership. The future depends on women acknowledging that there is nothing holding them back from succeeding in business.”Vicki Donlan, author of HER Why It's Time for Women to Lead in America“Colantuono’s book provides thoughtful coaching to women leaders, whether experienced or new to the workforce. Her wise and practical advice is a must-read for individuals who are determined to reach the next level of their careers.\"Anne Szostak, President & CEO of Szostak Partners and former chairman and CEO Fleet Bank Rhode Island\"Informed by her extensive experience , Susan Colantuono offers a refreshingly keen, sophisticated analysis of what women need to do to become leaders. This is a must-read book for women - and men - who want more women in leadership positions in America.\"Evelyn Murphy, author of Getting Why Women Don't Get Paid Like Men and What To Do About It\"No Ceiling, No Walls, is both inspirational and inspired. Practical exercises and tools offer valuable ways women can enhance their leadership skills ? for example, using the language of power to communicate the value they bring. But perhaps what makes this book so smart is the emphasis it puts on business acumen as the way for women to demonstrate that they have the “right stuff” to take on leadership roles. Aside from this being the absolute truth, it certainly makes climbing the corporate ladder more accessible.Be your own coach yourself using No Ceilings, No Walls as a guide.\"Carol Frohlinger, author Nice Girls Just Don't Get It and Her Place at the TableNo Ceiling, No Walls \"is a guide for women who...want to prosper and succeed at a much higher level....a fascinating read with plenty of wisdom to absorb, highly recommended...\"Midwest Book Review (The Business Shelf)No Ceiling, No Walls is the first in our ASK Leading Women™ series. All ASK Leading Women™ books offer inspiring and practical solutions for women as they move from career-start to the C-suite and onto corporate boards. When you ASK Leading Women, you get cutting-edge content, ready-to-apply tools, insights from self-assessments, and examples from successful women who act as your virtual mentors.",
  "genres": [
    "Business",
    "Nonfiction",
    "Leadership"
  ],
  "author": "Susan L. Colantuono",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/18941644-no-ceiling-no-walls"
}