{
  "title": "Law & Disorder",
  "description": "\"At the top of his form.\" –James Patterson\"The FBI's pioneer and master of investigative profiling.\" –Patricia CornwellThe legendary FBI criminal profiler, inspiration for the hit Netflix show Mindhunter, and #1 New York Times bestselling author of The Killer Across the Table and The Killer’s Shadow offers a rare look into the workings not only of the justice system—but of his own heart and mind. Writing with award-winning partner Mark Olshaker for the first time since his retirement, Douglas opens up about his most notorious and baffling cases—and shows what it's like to confront evil in its most monstrous form.No one is better acquainted with the subject of humanity’s most notorious crimes and the wrenching challenges of bringing those criminals to justice than John Douglas, the model for Agent Jack Crawford in The Silence of the Lambs. In this provocative and deeply personal book, the most prominent criminal investigator of our time recounts his twenty-five year FBI career tracking down master criminals, write true crime bestsellers, developing forensic science and the art of criminal profiling, but previously he could never be as forthright as he is in this, his first book since retirement. In his previous works, he wrote only about the guilty; in Law & Disorder, he writes about the guilty, innocents accused, and even innocents convicted as he addresses every law enforcement professional’s worst nightmare: those cases where, for one reason or another, justice was delayed…or even denied.A deep glimpse into the mind of a man who has explored the heart of human darkness, he looks to unlock for his readers the ultimate mystery of depravity and the techniques and approaches that have countered evil in the name of justice throughout his career. “An essential title for those interested in true crime stories, forensic science, or law enforcement.”- Library Journal (starred review)\"At his best describing terrible crimes.\" –\nHouston Chronicle\n\"A real genius.\" –\nEntertainment Weekly\n\"Douglas can claim a rare authenticity regarding the evil that men do.\" -\nKirkus Reviews\n“An essential title for those interested in true crime stories, forensic science, or law enforcement.” -\nLibrary Journal (starred review)",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Audiobook",
    "History",
    "Psychology",
    "Mystery"
  ],
  "author": "John E. Douglas",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/18939194-law-disorder"
}