{
  "title": "The Christmas Token",
  "description": "Determined to escape an unwelcome suitor, Ginny Granger flees to her brother’s home in Eastern Oregon for the holiday season. Reluctantly returning to the community where she spent her childhood years, she plans to relax and enjoy a peaceful visit. Not expecting to encounter the boy she once loved, her exile proves to be anything but restful.  A talented carpenter, Blake Stratton enjoys a simple existence in the small western town of Hardman. With honest work and good friends, his life is nearly perfect, at least until the day Ginny Granger arrives, setting him on his ear and turning his world upside down. Infuriated by her meddling presence, he’s further exasperated to discover she kept a Christmas token he gave her along with his heart the day she left town many years ago.  Love sweet holiday romances set in the splendor of the Victorian era? Don't miss out on the rest of the Hardman Holidays series!  The Christmas Bargain (Book 1) - As owner and manager of the Hardman bank, Luke Granger is a man of responsibility and integrity in the small 1890s Eastern Oregon town. When he calls in a long overdue loan, Luke finds himself reluctantly accepting a bargain in lieu of payment from the shiftless farmer who barters his daughter to settle his debt.  The Christmas Token (Book 2) - Determined to escape an unwelcome suitor, Ginny Granger flees to her brother’s home in Eastern Oregon for the holiday season. Returning to the community where she spent her childhood years, she plans to relax and enjoy a peaceful visit. Not expecting to encounter the boy she once loved, her exile proves to be anything but restful.  The Christmas Calamity (Book 3) - Dependable and solid, Arlan Guthry relishes his orderly life as a banker’s assistant in Hardman, Oregon. His uncluttered world tilts off kilter when the beautiful and enigmatic prestidigitator Alexandra Janowski arrives in town, spinning magic and trouble in her wake as the holiday season approaches.",
  "genres": [
    "Christmas",
    "Romance",
    "Historical Romance",
    "Historical Fiction",
    "Historical",
    "Westerns",
    "Christian Fiction"
  ],
  "author": "Shanna Hatfield",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/18942548-the-christmas-token"
}