{
  "title": "The Rich Boys Club",
  "description": "The Rich Boys Club features 8 steamy erotic romance novels from Helen Cooper.All are complete with no cliffhangers!Included in this set are:1. The Billionaire's BabySophie has been in love with her best friend Ella's brother, Billionaire Maxwell Van Harkel, for years. However Maxwell has turned into a Dr. Jekkyl and Mr. Hyde character. Some days he is great and other days he treats her like she doesn't exist. When Sophie lies to get her own way, she triggers a domino effect and she doesn't know if her life will ever be the same.2. New Beginnings (Sequel to The Billionaire's Baby)Sophie and Max have been in love with each other for years. But Max thought she was off limits because she was his sisters best friend and much younger than him. When they both realize that they want to be together and are in love, they finally get together to start their new life, happy and excited for their new baby to join them.Ella Van Harkel is Max's sister and Sophie's best friend and she has relationship issues of her own. When she decides to join an online dating service, she has no idea that she is being manipulated by people from Max's past.The path of true love never goes smoothly and when Max's ex Alexis comes back to town with explosive news, Sophie isn't sure how to think or feel. She tells Max she wants to learn more about his dark past and as they go down the path of his troubled history, they begin to unleash secrets so dark that neither of them will ever be the same again.3. A Baby For The MillionaireJenny is a recent college grad who one night drunkenly applies for a job she is not qualified for with a fabricated resume. When she gets the job, she decides to see if she can play it off and due to a mistaken identity finds herself in the CEO's office.Hamilton Verona is rich and handsome and is not looking for any trouble but when Jenny walks into his office, he finds himself propositioning her for a position that could change her life.A position that could would find her doing things she had never ever dreamed of.4. The Billionaire's Unlikely BrideElle is single and living in the City with her best friend Brittany. Brittany has a plan to have them both married off to billionaires and Elle can't help but go along.Peter Branford is the young billionaire that Brittany wants Elle to fall in love with but there are a couple of people who don't want to see that happen: Olivia, Peter's icy mother and Elliott Rosewood, Brittany's dad and a figure from Elle's past.5. How To Catch A BillionaireSarah Smith is a recent college grad with dreams to be a big time actress. The only problem is, she can't find an acting job anywhere. So she decides to accept a job at Zoom Corp and uses her acting position to get an executive position.Sarah thinks she has hit the big time until she meets CEO Harry Green, the only problem is she doesn't realize he is the CEO and makes a fool of herself. It's not long before she's out of a job and into Harry's bed. Before long Sarah finds herself falling in love but Harry lets her know in no uncertain terms that he doesn't play for keeps. So Sarah decides to see if she can figure out how to catch a billionaire with the help of her best friend Jane.6. The Millionaire's Assistant7. The Millionaire's Lover8. The Millionaire's GamesLouise goes to spend the weekend in 'The Hamptons' with the Beekman brothers: Ben, David and Richard. She ends up spending the night with one of them and finds herself falling for the wrong brother.",
  "genres": [],
  "author": "Helen    Cooper",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/18941659-the-rich-boys-club"
}