{
  "title": "An Exciting Future",
  "description": "alternate cover edition of ISBN: 9781483977690Lek, the eldest child in a typical rice-farming family, did not hope for anything more than the other girls in her village: work in the fields for a few years; have a few babies; let mum take care of them and go back to work until they had their own children and it was her turn to take care of them. Suddenly, her father died with debts that the family knew nothing about. Lek was twenty and the only one who could prevent foreclosure. However, the only way she knew was to work in a bar in Pattaya. She went as a waitress, but when she became pregnant, things had to change. She had the baby, gave it to her mother and went back to work. However, needing more money now, she drifted into the sex industry. The book relates her her dreams and aspirations. It shows, from Lek's position, what it's like to be an ex-bar girl - the hopes and frustrations and the sceming that are part of her every-day life. One day, she meets a man she likes and he likes her too., and he returns, but real life with a real boyfriend is not as easy as she had dreamed it would be. After all she has been through, can she be a normal girlfriend or wife again? Could she ever trust a man enough? Or would she be better off giving up her dreams and just working in the bar? Lek begins to learn that getting what you want is not always all you hoped for. This second book in the trilogy called 'Behind The Smile - the story of Lek a Bar Girl in Pattaya' explores the characteristics needed by Thai women returning to their village and their foreign husbands if they want to live in an isolated Thai village, where there are none of the trappings of city life. They move back to the village to be with Lek's daughter, other family and old friends, but the villagers are not all as excited about Lek moving back as she is, Her daughter and her mother are delighted. Craig is also happy to live in the village, although it is not at all easy for him as no-one there speaks English and the Internet does not work as well as he was led to believe. Will he be able to make ends meet? Will he be deported? And would Britain allow Lek in if he had no money? Will Lek and Craig manage to live in the village of Baan Suay or will the loneliness, the tedium and the lack of stimulation drive them away or even apart? 'Behind the Smile' refers to the fact that Thailand is known the world over as 'The Land of Smiles'.",
  "genres": [],
  "author": "Owen  Jones",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/18938935-an-exciting-future"
}