{
  "title": "Here Is Where: Discovering America's Great Forgotten History",
  "description": "Here Is Where chronicles Andrew Carroll’s eye-opening – and at times hilarious -- journey across America to find and explore unmarked historic sites where extraordinary moments occurred and remarkable individuals once lived. Sparking the idea for this book was Carroll’s visit to the spot where Abraham Lincoln’s son was saved by the brother of Lincoln’s assassin. Carroll wondered, How many other unmarked places are there where intriguing events have unfolded and that we walk past every day, not realizing their significance? To answer that question, Carroll ultimately trekked to every region of the country -- by car, train, plane, helicopter, bus, bike, and kayak and on foot. Among the things he  *Where in North America the oldest sample of human DNA was discovered * Where America’s deadliest maritime disaster took place, a calamity worse than the fate of the Titanic *Which virtually unknown American scientist saved hundreds of millions of lives *Which famous Prohibition agent was the brother of a notorious gangster *How a 14-year-old farm boy’s brainstorm led to the creation of television Featured prominently in Here Is Where are an abundance of firsts (from the first use of modern anesthesia to the first cremation to the first murder conviction based on forensic evidence); outrages (from riots to massacres to forced sterilizations); and breakthroughs (from the invention, inside a prison, of a revolutionary weapon; to the recovery, deep in the Alaskan tundra, of a super-virus; to the building of the rocket that made possible space travel). Here Is Where is thoroughly entertaining, but it’s also a profound reminder that the places we pass by often harbor amazing secrets and that there are countless other astonishing stories still out there, waiting to be found. Look for Andrew's new book, My Fellow Soldiers.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Historical",
    "Travel",
    "Audiobook",
    "American"
  ],
  "author": "Andrew Carroll",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/18941808-here-is-where"
}