{
  "title": "All the Wrong Reasons",
  "description": "Irelyn Colby is excited to start a new life at college. Granted, her well-to-do grandparents are footing the bill, but that's a sacrifice she's willing to make for the sake of a good education.Although the house she lives in with her mother and special needs cousin is just minutes away from campus, her grandfather insists that she stay in the dorms in order to have the 'total college experience.' Irelyn complies, going home on the weekends to spend time with her family and Dustin, her high school sweetheart. When her new roommates, Bailey and Morgan, share their wild, weekend adventures, Irelyn gets a little jealous. How she longs to break free of the 'good girl, good student' mold and have a little fun. Besides, she'd love to have a funny tale to share with Dustin when she meets him for dinner at her grandparents' country club on Saturday night.But things don't go as planned. The girls take her to a popular bar where a local band plays on Friday nights and Irelyn is captivated by the lead singer, Lucas. She meets him after his set and the sparks fly. Unable to control herself, she spends the night with him only to suffer a huge bout of guilt the next morning. What will she tell Dustin?Bailey convinces Irelyn that it was a fluke - nothing Dustin needs to know about. Morgan urges her to stay away from Lucas. Irelyn agrees, vowing to stay away from Lucas once she retrieves the cell phone she lost that Friday night when she was with him.Unfortunately, Irelyn's plans don't work out very well as she can't seem to stay away from him. She continues to see Lucas, all the while lying to Dustin, and hiding the entire situation from her controlling grandfather.As the lies continue to stack up, topped by confusing feelings, Irelyn must make a decision: Does she stay with Dustin, the sweet, safe boy with a promising future? Or does she follow her heart and run to Lucas, the one who makes her feel real?And what will her grandfather have to say about her choice?",
  "genres": [
    "Romance",
    "New Adult",
    "Young Adult",
    "Contemporary",
    "College",
    "Contemporary Romance",
    "Music"
  ],
  "author": "J.L. Paul",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/11054334-all-the-wrong-reasons"
}