{
  "title": "The Rediscovery of Man: The Complete Short Science Fiction of Cordwainer Smith",
  "description": "The third story in this volume takes place 16,000 years in the future. When you realize that the 33 stories are ordered chronologically, you begin to grasp the scale of Cordwainer Smith's creation. Regimes, technologies, planets, moralities, religions, histories all rise and fall through his millennia.These are futuristic tales told as myth, as legend, as a history of a distant and decayed past. Written in an unadorned voice reminiscent of James Tiptree Jr., Smith's visions are dark and pessimistic, clearly a contrast from the mood of SF in his time; in the 1940s, '50s, and '60s it was still thought that science would cure the ills of humanity. In Smith's tales, space travel takes a horrendous toll on those who pilot the ships through the void. After reaching perfection, the lack of strife stifles humanity to a point of decay and stagnation; the Instrumentality of Mankind arises in order to stir things up. Many stories describe moral dilemmas involving the humanity of the Underpeople, beings evolved from animals into humanlike forms.Stories not to be missed in this collection include \"Scanners Live in Vain\", \"The Dead Lady of Clown Town\", \"Under Old Earth\", \"The Crime and the Glory of Commander Suzdal\", \"Mother Hitton's Littul Kittons\", and the truly disturbing \"A Planet Called Shayol\". Serious SF fans should not pass up the chance to experience Cordwainer Smith's complex, distinctive vision of the far future.--Bonnie BoumanContents:- Introduction by John J. Pierce- Editor’s Introduction by James A. Mann• Stories of the Instrumentality of Mankind- No, No, Not Rogov! (1959)- War No. 81-Q (rewritten version) - Mark Elf (1957)- The Queen of the Afternoon (1978)- Letter to Editor, Fantasy Book (March 9, 1948)- Scanners Live in Vain (1950)- The Lady Who Sailed The Soul (1960)- When the People Fell (1959)- Think Blue, Count Two (1963)- The Colonel Came Back from Nothing-at-All (1979)- The Game of Rat and Dragon (1955)- The Burning of the Brain (1958)- From Gustible’s Planet (1962)- Himself in Anachron- The Crime and the Glory of Commander Suzdal (1964)- Golden the Ship Was — Oh! Oh! Oh! (1959)- The Dead Lady of Clown Town (1964)- Under Old Earth (1966)- Drunkboat (1963)- Mother Hitton’s Littul Kittons (1961)- Alpha Ralpha Boulevard (1961)- The Ballad of Lost C’Mell (1962)- A Planet Named Shayol (1961)- On the Gem Planet [Casher O'Neill] (1963)- On the Storm Planet [Casher O'Neill] (1965)- On the Sand Planet [Casher O'Neill] (1965)- Three to a Given Star [Casher O'Neill] (1965)- Down to a Sunless Sea (1975)• Other Stories- War No. 81-Q (original version) (1928)- Western Science Is So Wonderful (1958)- Nancy (1959)- The Fife of Bodidharma (1959)- Angerhelm (1959)- The Good Friends (1963)Cover art by Jack Gaughan",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Collections",
    "Science Fiction Fantasy",
    "Fantasy"
  ],
  "author": "Cordwainer Smith",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/18948.The_Rediscovery_of_Man"
}