{
  "title": "The Happy Hollisters and the Ice Carnival Mystery",
  "description": "The Happy Hollisters and the Ice Carnival Mystery (#16 in the Happy Hollisters series)A visit from Gram and Gramp Hollister in the Hollister home at Shoreham opens up the opportunity for the five children to go to Canada with their grandparents to see the Mardi Gras and Winter Carnival in Quebec. That, however, is not the only purpose of their trip. Mr. Hollister tells the children that a Christmas gift he had ordered for them has taken overlong in reaching Shoreham and, although he had wanted to keep it a secret, he is now worried about the delay. The gift was a cariole, a French Canadian sleigh, and was to be made by a master sleigh maker in Quebec. He commissions the children to try and solve the mystery of the missing sleigh. The children meet many interesting people and are introduced to the customs and ways of the French Canadians as well as encountering adventure and excitement in their efforts to find the sleigh . . . maker and the sleigh. The crowning glory for the children is their participation in the parade at the Winter Carnival.Again a Hollister story of mystery and adventure, with a setting that will introduce young readers to a different way of life in a most interesting and historic location.First published in 1958, this charming mystery-adventure story, faithfully reproduced, is now available in paperback and eBook for the first time! Written for boys and girls between the ages of six and twelve, The Happy Hollisters are wholesome books, with an accent on humor and good, clean fun. Integrity always pays off and right wins over wrong. Parents, grandparents, and teachers love these books for their healthy celebration of life in simpler times. Kids are thrilled with the fast-paced action and will not want to put them down. The action-packed illustrations make the story – and the Hollister family – so vivid that the reader has a feeling of really sharing in on the adventures of this lovable and interesting family.",
  "genres": [
    "Mystery",
    "Fiction",
    "Childrens",
    "Classics",
    "Juvenile",
    "Chapter Books"
  ],
  "author": "Jerry  West",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/1894570.The_Happy_Hollisters_and_the_Ice_Carnival_Mystery"
}