{
  "title": "Be the Rainbow * Bridge Heaven and Earth:: How-to Manual for Integrating Alternative and Evidence-Based Medicine",
  "description": "Just as the Rainbow connects Heaven and Earth, you can link Faith-based Healing and Mainstream Medicine. This book provides you with a cognitive scaffold that facilitates your mental ability to integrate Alternative Healing methods with those from Evidence-Based Medicine, and thus allowing for the peaceful coexistence of the irrational with the rational. Based on works derived from Carl Jung, William James and Albert Einstein, as well as recent advances in Cognitive Neuroscience, it teaches tools that allow the synergistic benefits arising from combining these two health universes. Most of all, it describes the Ethical Duty to Distinguish and Disclose. This manual is targeted mainly to physicians, to help them learn to work in teams that include Alternative Practitioners. But it is not just for physicians - anyone will benefit from this book filled with nuggets of insight into such topics placebo effect, embodiment, optimism, beauty, relaxation response, creativity, and spirituality.  Combining recent research from Cognitive Neuroscience with wise masters of the past, it explains a way of seeing the world that incorporates both rational thinking and magical thinking.  The fundamental bedrock upon which sits our pyramid of increasing healthcare complexity, is made up of those acts that bring forth comfort, relaxation and trust.  These include the essential healing elements of time, tenderness and touch.  \"The intuitive mind is a sacred gift and the rational mind is a faithful servant. We have created a society that honors the servant and has forgotten the gift.\" - Albert Einstein From the Author After a long and enriching career in science, research and medicine, I felt a persistent need to pull all the different perspectives together.  With the formation of Accountable Care Organizations, I recognized that healthcare will now be incentivized to enhance patient outcomes, rather than to reimburse for single services or products.  Now was time to try to teach my peers and coworkers ways of thinking that would encourage a more collaborative environment, leading to better care for patients.  The new structure could allow for mixed teams of provider types, along with their best practices, to thrive. This ebook cites 'pearls' from philosophers, scientists, artists, and healers - all in an attempt to broaden the view of what we can consider to be 'healing'.  It is only the beginning.  I plan to pull together case histories and illustrative stories for future volumes and teaching workshops.",
  "genres": [],
  "author": "Laura Kragie",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18959729-be-the-rainbow-bridge-heaven-and-earth"
}