{
  "title": "The Trouble Between Us: An Uneasy History of White and Black Women in the Feminist Movement",
  "description": "Inspired by the idealism of the civil rights movement, the women who launched the radical second wave of the feminist movement believed, as a bedrock principle, in universal sisterhood and color-blind democracy. Their hopes, however, were soon dashed. To this day, the failure to create an integrated movement remains a sensitive and contested issue. In The Trouble Between Us , Winifred Breines explores why a racially integrated women's liberation movement did not develop in the United States.Drawing on flyers, letters, newspapers, journals, institutional records, and oral histories, Breines dissects how white and black women's participation in the movements of the 1960s led to the development of separate feminisms. Herself a participant in these events, Breines attempts to reconcile the explicit professions of anti-racism by white feminists with the accusations of mistreatment, ignorance, and neglect by African American feminists. Many radical white women, unable to see beyond their own experiences and idealism, often behaved in unconsciously or abstractly racist ways, despite their passionately anti-racist stance and hard work to develop an interracial movement. As Breines argues, however, white feminists' racism is not the only reason for the absence of an interracial feminist movement. Segregation, black women's interest in the Black Power movement, class differences, and the development of identity politics with an emphasis on \"difference\" were all powerful factorsthat divided white and black women.By the late 1970s and early 1980s white feminists began to understand black feminism's call to include race and class in gender analyses, and black feminists began to give white feminists some credit for their political work. Despite early setbacks, white and black radical feminists eventually developed cross-racial feminist political projects. Their struggle to bridge the racial divide provides a model for all Americans in a multiracial society.",
  "genres": [
    "Feminism",
    "History",
    "Nonfiction",
    "Race",
    "Social Justice",
    "Sociology",
    "American History"
  ],
  "author": "Winifred Breines",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1895561.The_Trouble_Between_Us"
}