{
  "title": "History and Class Consciousness: Studies in Marxist Dialectics",
  "description": "This is the first time one of the most important of Lukacs' early theoretical writings, published in Germany in 1923, has been made available in English. The book consists of a series of essays treating, among other topics, the definition of orthodox Marxism, the question of legality and illegality, Rosa Luxemburg as a Marxist, the changing function of Historic Marxism, class consciousness, and the substantiation and consciousness of the Proletariat. Writing in 1968, on the occasion of the appearance of his collected works, Lukacs evaluated the influence of this book as follows:\"For the historical effect of History and Class Consciousness and also for the actuality of the present time one problem is of decisive importance: alienation, which is here treated for the first time since Marx as the central question of a revolutionary critique of capitalism, and whose historical as well as methodological origins are deeply rooted in Hegelian dialectic. It goes without saying that the problem was omnipresent. A few years after History and Class Consciousness was published, it was moved into the focus of philosophical discussion by Heidegger in his Being and Time, a place which it maintains to this day largely as a result of the position occupied by Sartre and his followers. The philologic question raised by L. Goldmann, who considered Heidegger's work partly as a polemic reply to my (admittedly unnamed) work, need not be discussed here. It suffices today to say that the problem was in the air, particularly if we analyze its background in detail in order to clarify its effect, the mixture of Marxist and Existentialist thought processes, which prevailed especially in France immediately after the Second World War. In this connection priorities, influences, and so on are not particularly significant. What is important is that the alienation of man was recognized and appreciated as the central problem of the time in which we live, by bourgeois as well as proletarian, by politically rightist and leftist thinkers. Thus, History and Class Consciousness exerted a profound effect in the circles of the youthful intelligentsia.\"",
  "genres": [
    "Philosophy",
    "Politics",
    "History",
    "Theory",
    "Nonfiction",
    "Sociology",
    "Economics"
  ],
  "author": "György Lukács",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/189598.History_and_Class_Consciousness"
}