{
  "title": "Trauma Junkie: Memoirs of an Emergency Flight Nurse",
  "description": "\"Trauma Junkie gives us a view over the flight nurse's shoulder from liftoff until the patient is delivered to the hospital and the agonizing minutes in between. These fascinating true stories are impossible to put down.\" -- James M. Betts, MD, Chief of Department of Surgery and Director of Trauma Services, Children's Hospital, Oakland\"An exciting portrayal of emergency nursing.\" -- Library Journal\"Fast-paced nonfiction that reads like an adventure story.\" -- School Library JournalIn Trauma Junkie, readers accompany veteran flight nurse Janice Hudson as she races in response to emergency calls in the San Francisco Bay Area. Her workplace is a cramped California Shock Trauma Air Rescue (CALSTAR) helicopter in which medical personnel try to fix the human carnage wrought by shootings, accidents and natural disasters.In this new and expanded edition, Hudson updates readers on how she and her colleagues have fared since moving on to different medical roles -- including her own battle with multiple sclerosis, which ultimately forced her to give up the job she loved.The new Trauma Junkie also contains several previously unpublished stories, including a new addition to the lineup of \"stupid human tricks\" Hudson witnessed and an all-new chapter describing a call involving the most heartbreaking of a child who didn't make it.Hudson is a natural storyteller who conveys the excitement of her days with calstar -- heroic rescues, tragic deaths and the hilarious incidents that made the tension bearable -- and the deep commitment of her team to keep patients alive in the most perilous situations.For information on California Shock Trauma Air Rescue Ambulances Services please visit www.calstar.org",
  "genres": [
    "Medical",
    "Nonfiction",
    "Memoir",
    "Nursing",
    "Medicine",
    "Science",
    "Health"
  ],
  "author": "Janice Hudson",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/18954940-trauma-junkie"
}