{
  "title": "Love and Revolution: A Political Memoir: People's History of the Greensboro Massacre, Its Setting and Aftermath",
  "description": "On November 3, 1979, members of the Ku Klux Klan drove into an anti-Klan rally in a black housing project in Greensboro, North Carolina and opened fire. They killed five demonstrators and wounded ten. All those killed were anti-racist community and labor leaders.Love and A Political Memoir is both memoir and people's history. It is a factually detailed and passionate account of events surrounding the Greensboro Massacre by a woman intimately connected with the events. The author's husband, a pediatrician who abandoned medicine to work in a textile mill and organize low-wage workers, was among the slain.The activists killed were from Christian, Jewish, African American, and Latino backgrounds; they were César Cauce, Michael Nathan, M.D., William Sampson, Sandra Smith, and James Waller, M.D. All were in Greensboro that day on behalf of the Workers Viewpoint Organization (WVO), part of a New Communist Movement inspired by Marx, Lenin, and Mao Tse-Tung. As the Ku Klux Klan came out of the woodwork during a period of economic downturn in the late seventies, WVO activists took a militant stand against the Klan and its racism.In the aftermath of Greensboro, survivors and concerned citizens faced an uphill battle for justice that eventually uncovered the involvement of official agencies in abetting the attack. At last, a 1985 civil suit found several of the attackers, as well as Greensboro police officers, liable for the wrongful death of Dr. Nathan.The union organizing, the massacre, the coverup of official complicity, and the struggle for justice are all essential moments of this political memoir. Readers become acquainted with a neglected portion of recent U.S. history―the South of the 1970s and 1980s―and with lovers and revolutionaries who did not accept the established order and dared to struggle to change it. Waller explores the meaning and implications of the events for the survival of American democracy.",
  "genres": [
    "History"
  ],
  "author": "Signe Waller",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/1896122.Love_and_Revolution"
}