{
  "title": "Violins of Hope: Violins of the Holocaust--Instruments of Hope and Liberation in Mankind's Darkest Hour",
  "description": "Winner of a National Jewish Book AwardA stirring testament to the strength of the human spirit and the power of music, Violins of Hope tells the remarkable stories of violins played by Jewish musicians during the Holocaust, and the Israeli violin maker dedicated to bringing these inspirational instruments back to life.The violin has formed an important aspect of Jewish culture for centuries, both as a popular instrument with classical Jewish musicians and as a central factor of social life, as in the Klezmer tradition. But during the Holocaust, the violin assumed extraordinary roles within the Jewish community. For some musicians, the instrument was a liberator; for others, it was a savior that spared their lives. For many, the violin provided comfort in mankind's darkest hour, and, in at least one case, helped avenge murdered family members. Above all, the violins of the Holocaust represented strength and optimism for the future.Today, these instruments serve as powerful reminders of an unimaginable experience--they are memorials to those who perished and testaments to those who survived. In this spirit, renowned Israeli violinmaker Amnon Weinstein has devoted the past twenty years to restoring the violins of the Holocaust as a tribute to those who were lost, including four hundred of his own relatives. Behind each of these violins is a uniquely fascinating and inspiring story. Juxtaposing these narratives against one man's harrowing struggle to reconcile his own family's history and the history of his people, this insightful, moving, and achingly human book presents a new way of understanding the Holocaust.",
  "genres": [
    "Nonfiction",
    "History",
    "Holocaust",
    "Music",
    "World War II",
    "Judaism",
    "Biography"
  ],
  "author": "James A. Grymes",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/18950875-violins-of-hope"
}