{
  "title": "The Rediscovery of Man",
  "description": "Cordwainer Smith was one of the original visionaries to think of humanity in terms of thousands of years in the future, spread out across the universe. This brilliant collection, often cited as the first of its kind, explores fundamental questions about ourselves and our treatment of the universe (and other beings) around us and ultimately what it means to be human.Contents: * Cordwainer Smith: The Shaper of Myths (1975) • essay by John J. Pierce [as by J. J. Pierce] * The Instrumentality of Mankind (timeline) (1975) • essay by John J. Pierce * Scanners Live in Vain [The Instrumentality of Mankind] (1950) / novelette by Cordwainer Smith: meet Martel, a human altered to be part machine-a scanner-to be able withstand the trauma space travel has on the body. Despite the stigma placed on him and his kind, he is able to regrasp his humanity to save another; Fantasy Book #6 ’50 * The Lady Who Sailed The Soul [The Instrumentality of Mankind] (1960) / novelette by Cordwainer Smith, Genevieve Linebarger; Galaxy Apr ’60 * The Game of Rat and Dragon [The Instrumentality of Mankind] (1955) / short story by Cordwainer Smith; Galaxy Oct ’55 * The Burning of the Brain [The Instrumentality of Mankind] (1958) / short story by Cordwainer Smith; If Oct ’58 * Golden the Ship Was - Oh! Oh! Oh! [The Instrumentality of Mankind] (1959) / short story by Cordwainer Smith, Genevieve Linebarger; Amazing Apr ’59 * The Crime and the Glory of Commander Suzdal [The Instrumentality of Mankind] (1964) / short story by Cordwainer Smith; Amazing May ’64 * The Dead Lady of Clown Town [The Instrumentality of Mankind] (1964) / novella by Cordwainer Smith: get to know the underpeople-animals genetically altered to exist in human form, to better serve their human owners-and meet D'Joan, a dog-woman who will make readers question who is more human: the animals who simply want to be recognized as having the same right to life, or the people who created them to be inferior; Galaxy Aug ’64 * Under Old Earth [The Instrumentality of Mankind] (1966) / novelette by Cordwainer Smith; Galaxy Feb ’66 * Mother Hitton's Littul Kittons [The Instrumentality of Mankind] (1961) / novelette by Cordwainer Smith; Galaxy Jun ’61 * Alpha Ralpha Boulevard [The Instrumentality of Mankind] (1961) / novelette by Cordwainer Smith; Galaxy Jun ’61 * The Ballad of Lost C'mell [The Instrumentality of Mankind] (1962) / novelette by Cordwainer Smith: the notion of love being the most important equalizer there is, is put into action when an underperson, C'mell, falls in love with Lord Jestocost. Who is to say her love for him is not as valid as any true-born human? She might be of cat descent, but she is all woman!; Galaxy Oct ’62 * A Planet Named Shayol [The Instrumentality of Mankind] (1961) / novelette by Cordwainer Smith: it is an underperson of bull descent, and beings so mutilated and deformed from their original human condition to be now considered demons of a hellish land, who retain and display the most humanity when Mankind commits the most inhumane action of all; Galaxy Oct ’61aka: Paul M. A. Linebarger, Paul Myron Anthony Linebarger, Paul Linebarger, Felix C. Forrest, Carmichael Smith, Kordvejner Smit..",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fiction",
    "Collections",
    "Anthologies",
    "Science Fiction Fantasy",
    "Classics"
  ],
  "author": "Cordwainer Smith",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/18952.The_Rediscovery_of_Man"
}