{
  "title": "The Angel of Hever Castle",
  "description": "The Christmas of 1889 is fast approaching and the members of the Thursday Night Murder Games Club are settling in for some much-deserved relaxation, beginning with a cozy meal at the home of their patroness, Geraldine Bainbridge. But a frantic knock at the door changes everything. Geraldine’s friend Tess has come to beg for their help, explaining that her eighteen year old daughter Anna has run off with a portrait painter named LaRusse Chapman. The two of them have escaped to the countryside of Kent, where LaRusse presides over a colony of gypsy-like and half-starving artists. The group - which espouses any number of shockingly liberal causes, including “free love” – has taken up residence in the dilapidated Hever Castle, the abandoned childhood home of Queen Anne Boleyn.Within hours, Scotland Yard detectives Trevor Welles and Rayley Abrams are headed south on an unofficial mission to bring Anna at least back to London, if not to her senses. But they are scarcely within the crumbling walls of the castle when they realize that the place if far more sinister than they expected. LaRusse Chapman is not merely a seducer of young girls, but a man teetering on the brink of madness. His painting in process, The Angel of Hever Castle, seems to magically change itself each night, with the face of the Madonna morphing from one woman to another. And when Trevor and Rayley encounter a ghostly figure in white on the meadows surrounding the castle, they begin to question their own sanity. Has the spell of Hever Castle engulfed them as well?The Angel of Hever Castle is a Christmas-themed novella and the fifth volume in the City of Mystery series. Fans of the previous books will be happy to see some old friends in cameo appearances – Geraldine’s crusty beau Fleanders returns, as does the mystic Madame Renata, the misguided politician Michael Weaver and his eccentric sister Adelaide.",
  "genres": [
    "Mystery",
    "Christmas",
    "Historical Mystery",
    "Novella",
    "Historical Fiction"
  ],
  "author": "Kim   Wright",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/18966803-the-angel-of-hever-castle"
}