{
  "title": "Crossroads of Freedom: Antietam: The Battle that Changed the Course of the Civil War",
  "description": "The Battle of Antietam, fought on September 17, 1862, was the bloodiest single day in American history, with more than 6,000 soldiers killed--four times the number lost on D-Day, and twice the number killed in the September 11th terrorist attacks. In Crossroads of Freedom, America's most eminent Civil War historian, James M. McPherson, paints a masterful account of this pivotal battle, the events that led up to it, and its aftermath.As McPherson shows, by September 1862 the survival of the United States was in doubt. The Union had suffered a string of defeats, and Robert E. Lee's army was in Maryland, poised to threaten Washington. The British government was openly talking of recognizing the Confederacy and brokering a peace between North and South. Northern armies and voters were demoralized. And Lincoln had shelved his proposed edict of emancipation months before, waiting for a victory that had not come--that some thought would never come.Both Confederate and Union troops knew the war was at a crossroads, that they were marching toward a decisive battle. It came along the ridges and in the woods and cornfields between Antietam Creek and the Potomac River. Valor, misjudgment, and astonishing coincidence all played a role in the outcome. McPherson vividly describes a day of savage fighting in locales that became forever famous--The Cornfield, the Dunkard Church, the West Woods, and Bloody Lane. Lee's battered army escaped to fight another day, but Antietam was a critical victory for the Union. It restored morale in the North and kept Lincoln's party in control of Congress. It crushed Confederate hopes of British intervention. And it freed Lincoln to deliver the Emancipation Proclamation, which instantly changed the character of the war.McPherson brilliantly weaves these strands of diplomatic, political, and military history into a compact, swift-moving narrative that shows why America's bloodiest day is, indeed, a turning point in our history.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American History",
    "American Civil War",
    "Military History",
    "War"
  ],
  "author": "James M. McPherson",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/189657.Crossroads_of_Freedom"
}