{
  "title": "The iCandidate",
  "description": "The award-winning novel that will make you feel good in these tough political times.* Silver Medal - Global Ebook Awards for Fantasy/Contemporary, 2015* Finalist - Montaigne Medal for Most Thought-Provoking Book, 2015* Winner - National Indie Excellence Award for Political Thriller, 2014* Silver Medal- Reader's Favorite Book Awards for Fiction - Drama, 2014When A Traditional Candidate Meets The iCandidate, the Nation Will Never Be the Same!Former Green Beret turned history teacher Michael Bennit likes to inspire his students. After losing a bet to one of his classes, he finds himself running for a seat in the U.S. House of Representatives. Partnering with his students to campaign exclusively on social media, the race turns into a national sensation and a sleazy incumbent fanatical about hanging onto his power becomes desperate to destroy it- at any cost.\"The iCandidate is one of the best books that I have read in a long time and the characters and twists will keep you reading long into the night.\" -- Reviewed by Samantha Rivera for Readers' Favorite\"The idea of an outsider running for Congress and winning is appealing to readers sick of politics as usual.\" -- Amazon Vine Reviewer, based on excerpt\"This is extremely original. I have never read anything like it. I enjoyed the multiple perspectives that I was given. Each one gave a little bit more to the story and made me start to see the plot coming together.\" -- Amazon Vine Reviewer, based on excerptIf you like House of Cards, you’ll enjoy reading how The Michael Bennit Series turns the American political process upside down when the little guy is pitted against the Washington elite set on destroying him to preserve their power in these political dramas.THE iCANDIDATETHE iCONGRESSMANTHE iSPEAKERTHE iAMERICANBuy your copy and start the journey with Michael and his students today!For updates on Mikael Carlson’s new releases, sign up for his newsletter at mikaelcarlson.com.",
  "genres": [
    "Fiction",
    "Politics",
    "Thriller",
    "Contemporary"
  ],
  "author": "Mikael Carlson",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/18965744-the-icandidate"
}