{
  "title": "The Lynching of Peter Wheeler",
  "description": "At 2:21 am on September 8, 1896, authorities in Nova Scotia killed an innocent man. Peter Wheeler -- a \"coloured\" man accused of murdering a white girl -- was strung up under a porch with a slipknot noose. The hanging was state-sanctioned but it was a lynching all the same. Now, a re-examination of his case using modern forensic science reveals one of the greatest miscarriages of justice in Canadian history. On the night of January 27, 1896, 14-year-old Annie Kempton found herself home alone in the picturesque village of Bear River, Nova Scotia. She did not live to see the morning. Shortly after midnight, Annie was assaulted and bludgeoned with a piece of firewood. Her killer slit her throat three times with a kitchen knife then coldly sat and ate a jar of homemade jam before fleeing into the night. The senseless and brutal slaying devastated the town and plunged her parents into a near-suicidal abyss of guilt and grief. At trial, the prosecution's case focused on the inconsistencies in Wheeler's statements, the testimony of two children who placed Peter near the house on the night in question, and the detective's novel analysis of the physical evidence. It was one of the first trials in Canada to use forensic science, albeit poorly. Wheeler's defense team called no witnesses and did little to challenge the evidence presented. The jury deliberated less than two hours before declaring Peter Wheeler guilty of murder. The trial itself was a media sensation; every word was front page news. Several papers each ran their own version of \"Wheeler's confession,\" an admission of guilt supposedly authored by the condemned man. Each rendition tried and failed to make sense of the conflicting timeline. With every new iteration, it became clearer that the case against Wheeler was not as airtight as the detective in charge, Nick Power, and the media had proclaimed. The Lynching of Peter Wheeler is a story of one town's rush to judgment. It is a tale of bigotry and incompetence, arrogance and pseudoscience, fear and misguided vengeance. It is a case study in media distortion, illustrating how the print media can manipulate the truth, destroy reputations, and so thoroughly taint a jury pool, that the notion of a fair trial becomes a statistical impossibility. At the height of the Victorian era, the media created a super villain in the mold of Jack the Ripper, the perfect foil for its other creation, super-sleuth Nick Power. The masterfully constructed narrative was perfect, save for one glaring detail: Peter Wheeler did not kill Annie Kempton.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "History",
    "Canada",
    "Science",
    "Crime",
    "Historical"
  ],
  "author": "Debra Komar",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/18970841-the-lynching-of-peter-wheeler"
}