{
  "title": "The M Word: Conversations about Motherhood",
  "description": "A Dropped Threads-style anthology, assembling original and inspiring works by some of Canada's best younger female writers -- such as Heather Birrell, Saleema Nawaz, Susan Olding, Diana Fitzgerald Bryden, Carrie Snyder, and Alison Pick -- The M Word asks everyday women and writers, some of whom are on the unconventional side of motherhood, to share their emotions and tales of maternity. Whether they are stepmothers or mothers who have experienced abortion, infertility, adoption, or struggles with having more or less children, all these writers are women who have faced down motherhood on the other side of the white picket fence. It is time that motherhood opened its gates to include everyone, not just the picture postcard stories. The M Word is a fabulous collection by a talented author and blogger, which is bound to attract readers from all walks of motherhood. The anthology that presents women's lives as they are really lived, probing the intractable connections between motherhood and womanhood with all necessary complexity and contradiction laid out in a glorious tangle. It is a book whose contents themselves are in disagreement, essays rubbing up against one another in uncomfortable ways. There is no synthesis -- is motherhood an expansive enterprise, or is motherhood a trap? -- except perhaps a general sense that being a mother and not being a mother are each as terrible and wonderful as being alive is. What these essays do show, however, is that in this age of supposed reproductive choice, so many women still don't have the luxury of choosing their mothering story or how it will play out. And those who do exercise choice often still end up contending with judgement or backlash. The essays also make clear that women are not as divided between the mothers and the childless as we might be led to believe. Women's lives are so much more complicated than that. There is mutual ground between the woman who decided to have no more children and the woman who decided to have none at all. A woman with no children also endures a similar kind of scrutiny as the woman who's had many, both of them operating outside of societal norms. A woman who has miscarried longs to be acknowledged for her own beyond-visible mothering experiences, for the baby she held inside her. And while infertility is its own kind of journey, that journey is also just one of so many whose origins lie with the desire for a child.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Memoir",
    "Canada",
    "Feminism",
    "Essays"
  ],
  "author": "Kerry Clare",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/18970847-the-m-word"
}