{
  "title": "Polari",
  "description": "\"Polari,\" from the Italian \"polare\" (\"to talk\") is a coded language, originating in the U.K. and dating as far back as the 16th century. Overheard in outdoor markets, the theatre, fairgrounds, and circuses, it was appropriated by gay men to provide them with cover as well as with a way to assert personal and shared identities. It spread around the English-speaking world via the Royal Navy, the merchant marine, and cruise ships, adding and subverting many foreign-language words -- like polari -- along the way.While \"Polari\" does not employ this jargon or probe its success as a mode of connection between gay men, the language of Barton's poems may be viewed as an effective tool for communicating a sense of history, politics, and aesthetics. Think of \"Polari\" as a cross-sectional scan of a living tree that reveals ring after ring of Barton's experience of language, with the new buds at the tips of its branches adding colour, movement, and ornament.Most of these poems were written using set forms drawn from Robin Skelton's \"The Shapes of our Singing: A Comprehensive Guide of Verse Forms and Metres from Around the World\" (Spokane: Eastern Washington University Press, 2002). While the forms Barton has appropriated are not by themselves the vehicles of a particular sociolect or an anti-language, except, say, of poetry itself, he have nevertheless twisted them to follow the turns of his point of view and aesthetics.When it comes to time, geography, and subject, \"Polari\" covers a lot of ground: from child memories to the frailties and deaths of ageing parents; from Queen Victoria's coronation to the first ascent of Everest; from the October Crisis to the trial of Omar Khadr. The titles of nine poems are borrowed from the Diagram Prize, an award given out by the U.K. magazine, \"The Bookseller,\" for the oddest book title of the year. The titles chosen -- an example is \"Highlights in the History of Concrete\" -- may sound frivolous, even absurd, but the poems are less or more so. The serious nature of their themes being at odds with their titles gives them an engaging tension, and will be read as signature of his particular brand of polari.",
  "genres": [
    "Poetry"
  ],
  "author": "John  Barton",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/18970840-polari"
}