{
  "title": "The Science of Shakespeare: A New Look at the Playwright's Universe",
  "description": "William Shakespeare lived at a time when the medieval world -- a world of magic, astrology, witchcraft, and superstition of all kinds -- was just beginning to give way to more modern ways of thinking. Shakespeare and Galileo were born in the same year, and new ideas about the human body, the earth, and the universe at large were just starting to transform Western thought. Shakespeare was not a scientist -- the word did not even exist in Elizabethan times -- but a handful of scholars are now examining Shakespeare's interest in the scientific discoveries of his time: what he knew, when he knew it, and how he incorporated that knowledge into his work. His plays, poems, and sonnets were not \"about\" science -- but they often reflect scientific ideas, and the more carefully we look at those ideas the better we can appreciate the scope of Shakespeare's achievement. A close reading of Shakespeare's works reveals the depth of his interest in the natural world. Falk examines the world that the playwright and poet lived in, taking a close look at the science of his day -- exploring where and how that knowledge is reflected in Shakespeare's work. He also delves into how other writers and artists of the period were influenced by the revolution in science unfolding around them -- a subject that has received little attention beyond specialized academic works. Throughout the book Falk stops to ask what Shakespeare knew, and how it may have influenced his work. Obviously, Shakespeare was not the Carl Sagan of the Elizabethan Age -- his first commitment was to his stagecraft, not to philosophy or science. However, Falk argues that a close reading of Shakespeare's works reveals the depth of his interest in the natural world, and shows that he was more conscious of the changing conception of the cosmos than we usually imagine. Shakespeare's writing often reflects the scientific ideas of his time -- and the philosophical problems they were raising -- and the more carefully we look at those ideas the better we can appreciate the scope of his achievement. This book is aimed squarely at the lay reader -- those who enjoy Shakespeare's plays and poems for the joy of it, and armchair astronomers and historians who enjoy a trip back in time.",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Theatre",
    "Historical",
    "History Of Science",
    "Science Nature"
  ],
  "author": "Dan Falk",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/18970842-the-science-of-shakespeare"
}