{
  "title": "Low-Hanging Fruit: 77 Eye-Opening Ways to Improve Productivity and Profits",
  "description": "\"There seems to be some perverse human characteristic that likes to make easy things difficult.\"\" --Warren Buffett, CEO, Berkshire HathawayLow-Hanging Fruit is your road map for turning the difficult back into the easy.Editorial Reviews\"Their lively book distills what has worked for their Fortune 100 clients over the past 20 years. They knock over a few sacred cows along the way.\"--Fortune.com\"Here's why you might need to forget what you know about teamwork, excelling, and tradition.\" --Fast Company\"Eden and Long wisely present both the problems and solutions concisely and cleverly.\"--Success Magazine\"In 'Low-Hanging Fruit: 77 Eye-Opening Ways to Improve Productivity and Profits,' authors Terri Long and Jeremy Eden show how incremental but meaningful change boosts productivity and profit.\"--Investor's Business Daily\"CEOs are often far removed from the thousands of processes carried out every day across the complex organizations they lead, resulting in easy growth opportunities missed.\" --Chiefexecutive.net\"This is a punchy, easy-to-read book, with very short chapters, each hammering home some low-hanging fruit that your company can snatch.\" -- Globe and Mail\"This is one of the most practical and immediately actionable guides for business leaders that I have ever seen.\" --Skip Prichard, Leadership Insights\"Amazing new book\" --Olivia Paar-Rud, Quantum Business Insights\"Each chapter is written in a very entertaining way, so you can grasp it and put it right into practice.\"--Financial Spectrum Radio with Bill Kearney\"Does it work? PNC Financial's initial program generated more than 2,400 ideas worth $400 million annually.\" --Dallas Morning News\"You are not going to get bogged down in gobbledygook and confusion. This book is highly educational, informational and entertaining.\" --Money Matters radio with Stu Taylor",
  "genres": [
    "Business",
    "Productivity",
    "Nonfiction",
    "Education",
    "Adult"
  ],
  "author": "Jeremy Eden",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/18972700-low-hanging-fruit"
}