{
  "title": "What They Fought for, 1861-1865",
  "description": "In Battle Cry Of Freedom ,  James M. McPherson presented a fascinating, concise  general history of the defining American conflict. With What They Fought For , he focuses his considerable talents on what motivated the individual soldier to fight. In an exceptional and highly original Civil War analysis, McPherson draws on the letters and diaries of nearly one thousand Union and Confederate soldiers, giving voice to the very men who risked their lives in the conflict. His conclusion that most of them felt a keen sense of patriotic and ideological commitment counters the prevailing belief that Civil War soldiers had little or no idea of what they were fighting for. In their letters home and their diaries--neither of which were subject to censorship--these men were able to comment, in writing, on a wide variety of issues connected with their war experience. Their insights show how deeply felt and strongly held their convictions were and reveal far more careful thought on the ideological issues of the war than has previously been thought to be true. Living only eighty years after the signing of the  Declaration of Independence, Civil War soldiers felt the legacy and responsibility entrusted to them by the Founding Fathers to preserve fragile democracy--be it through secession or union--as something worth dying for. In What They  Fought For , McPherson takes individual voices  and places them in the great and terrible choir of a country divided against itself. The result is both an impressive scholarly tour de force and a lively, highly accessible account of the sentiments  of both Northern and Southern soldiers during the national trauma of the Civil War.",
  "genres": [
    "History",
    "Civil War",
    "American History",
    "Nonfiction",
    "American Civil War",
    "School",
    "War"
  ],
  "author": "James M. McPherson",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/189667.What_They_Fought_for_1861_1865"
}