{
  "title": "The Reserve",
  "description": "Part love story, part murder mystery, set on the cusp of the Second World War, Russell Banks's sharp-witted and deeply engaging new novel raises dangerous questions about class, politics, art, love, and madness—and explores what happens when two powerful personalities, trapped at opposite ends of a social divide, begin to break the rules. Twenty-nine-year-old Vanessa Cole is a wild, stunningly beautiful heiress, the adopted only child of a highly regarded New York brain surgeon and his socialite wife. Twice married, Vanessa has been scandalously linked to any number of rich and famous men. But on the night of July 4, 1936, at her parents' country home in a remote Adirondack Mountain enclave known as The Reserve, two events coincide to permanently alter the course of Vanessa's callow life: her father dies suddenly of a heart attack, and a mysteriously seductive local artist, Jordan Groves, blithely lands his Waco biplane in the pristine waters of the forbidden Upper Lake. . . . Jordan's reputation has preceded him; he is internationally known as much for his exploits and conquests as for his paintings themselves, and, here in the midst of the Great Depression, his leftist loyalties seem suspiciously undercut by his wealth and elite clientele. But for all his worldly swagger, Jordan is as staggered by Vanessa's beauty and charm as she is by his defiant independence. He falls easy prey to her electrifying personality, but it is not long before he discovers that the heiress carries a dark, deeply scarring family secret. Emotionally unstable from the start, and further unhinged by her father's unexpected death, Vanessa begins to spin wildly out of control, manipulating and destroying the lives of all who cross her path. Moving from the secluded beauty of the Adirondack wilderness to the skies above war-torn Spain and Fascist Germany, The Reserve is a clever, incisive, and passionately romantic novel of suspense that adds a new dimension to this acclaimed author's extraordinary repertoire.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Mystery",
    "Historical",
    "Novels",
    "Literary Fiction",
    "Audiobook"
  ],
  "author": "Russell Banks",
  "average_rating": "3.03",
  "url": "https://www.goodreads.com/book/show/1896247.The_Reserve"
}