{
  "title": "A Perfect Spy",
  "description": "The premier spy novelist of our time now gives us his largest and most engrossing work. It is a novel that plumbs the essential nature of espionage itself as it interweaves the story of a secret international manhunt with the unfolding of a secret life — the life of a man of spectacular gifts, nursed on deceit, schooled in betrayal, incapable of love: a perfect spy.The man is Magnus Pym, a senior partner in \"the Firm\" of British intelligence; a man whose boundless charm, energy, and wit so dazzle that no two people have ever perceived him in the same way; a man unknown, really, and perhaps unknowable, even to those closest to him. Especially now.For Magnus Pym has disappeared. His superiors, his colleagues, his friends are baffled. Even his wife (the perfect wife of a perfect spy) is shaken. And while we follow their frenzied attempts to discover Pym's whereabouts — a search that soon galvanizes the espionage communities of both East and West as it continually opens into new labyrinths of mystery, as it unearths a clandestine chain of operations in Washington, Vienna, Prague, London, Berlin — we are drawn simultaneously into a drama even more powerful: the prelude to Pym's disappearance, the story of his education as a spy.It begins with a boyhood lived on an emotional seesaw, marked alternately by extravagance and deprivation, dominated by a man both adored and adoring who educated Pym from birth in the ways of his as yet unchosen profession. The man: Pym's father, a builder of (invariably toppling) empires, a con artist on a grand scale, a charmer who inspires complete loyalty, then wantonly exploits it. And we watch as Pym learns from him to deceive reflexively, learns to master the linked arts of guile and seeming guilelessness, acquires a moral code that equates love with betrayal ... a code that the seventeen-year-old boy draws upon when, as a pawn in one of his father's schemes, he finds himself cut off, alone in Switzerland (\"the spiritual home of all natural spies\"), where he first encounters the men who are to become his lifelong mentors, two men whose conflicting ideals and allegiances only Pym — in his perverse, omnivorous loyalty — could believe compatible.It is these two men — each in his own way tormented, betrayed, and imperiled by Pym's disappearance — who are now orchestrating the pursuit, racing each other and time itself, searching the haunts of Pym's present and past life, stalking his wife, his friends, his lovers, his young son; desperate for clues. Until, as the complex strands of the story converge and the novel is propelled toward its terrifying resolution, the ultimate truth about Pym is revealed.A Perfect Spy is a magnificent novel whose most remarkable achievement is to immerse us at once in two parallel dramas — each totally gripping, the two together producing a force field in which suspense breeds suspense. It is a work that surpasses — in its mesmerizing hold on the reader, its richness of story and character, and its moral resonance — any novel we have yet had from John le Carré.",
  "genres": [
    "Fiction",
    "Espionage",
    "Thriller",
    "Mystery",
    "Spy Thriller",
    "Audiobook",
    "Novels"
  ],
  "author": "John Le Carré",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/1896677.A_Perfect_Spy"
}