{
  "title": "The Walking Tanteek",
  "description": "Gerard, a born-again, hardline priest, runs a ragtag cult of drug addicts and street people. Gerard's twin sister Maggie, coping with the dual demons of alcoholism and spiritual disconnectedness, has attached herself to the cult but chafes under her brother's harsh tutelage. Maggie is haunted by the dogmatism and the us-versus-them mentality of her Catholic training. She wants God to be real, but at the same time mistrusts and resents Him and everyone standing in for Him. The Tanteek (the word is taken from a mis-hearing of a lyric from a Dylan song) is the name Maggie gives to the frantic questioning, uncertainty, and fear of annihilation and hopelessness that dog her every step. He becomes a character, joker, prankster, sitting in an armchair, waiting for her, following her. The unlooked-for arrival of profound love serves as a catalyst for escape, first through an abandoned boy Maggie takes charge of and then through the reappearance of an old college flame. Finding the strength to wrench free of her emotional moorings, Maggie must now grapple for her integrity in the face of fierce opposition from all sides. This is a novel about the attempts of profoundly damaged human beings to find faith in a faith-hostile world. What is faith, and must it be won at the cost of intellectual integrity? Does it demand a life of frigid asceticism in order to ensure its purity, or does it have more to do with learning the prosaic but wrenchingly difficult lessons of how to forgive and reconcile with one's bitterest enemies? This is a narrative/writing of uncommon wit and energy. Characters and conversations jump from the page, are entirely believable and hilarious and apt -- despite the heaviness of the subject matter (which therefore never feels too heavy). It is an honest, heartfelt, yet very intelligent examination of what it is to be spiritual in an aspiritual world.",
  "genres": [
    "Fiction"
  ],
  "author": "Jane  Woods",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/18970850-the-walking-tanteek"
}