{
  "title": "The Teenage Brain: A Neuroscientist's Survival Guide to Raising Adolescents and Young Adults",
  "description": "An internationally respected neurologist offers a revolutionary look at the brains of adolescents, providing surprising insights--including why smart kids often do stupid things--and practical advice for adults and teens.In this groundbreaking, accessible book, Dr. Frances E. Jensen, a mother, teacher, researcher, and internationally known expert in neurology, introduces us to the mystery and magic of the teen brain. One of the first books to focus exclusively on the neurological development of adolescents, The Teenage Brain presents new findings, dispels widespread myths, and provides practical suggestions for negotiating this difficult and dynamic life stage for both adults and adolescents.Interweaving easy-to-follow scientific data with anecdotes drawn from her experiences as a parent, clinician, and public speaker, Dr. Jensen explores adolescent brain functioning and development, including learning and memory, and investigates the impact of influences such as drugs, multitasking, sleep, and stress. The Teenage Brain reveals how: Adolescents may not be as resilient to the effects of drugs as we previously thought. Occasional use of marijuana has been shown to cause lingering memory problems, and long-term use can affect later adulthood I.Q. Multi-tasking causes divided attention and can reduce learning ability. Emotionally stressful situations in adolescence can have permanent effects on mental health, and may lead to higher risk for certain neuropsychiatric disorders such as depression.Rigorous yet accessible, warm yet direct, The Teenage Brain sheds new light on young adults, and provides practical suggestions for how parents, schools, and even the legal system can better help them during this crucial period.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Psychology",
    "Science",
    "Education",
    "Audiobook",
    "Self Help"
  ],
  "author": "Frances E. Jensen",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/18964642-the-teenage-brain"
}