{
  "title": "Merry Chick Lit Celebrate the Season with Six Sassy Shorts",
  "description": "In the spirit of giving, six chick-lit authors \"present\" a charming collection of seasonal shorts sure to inspire holiday cheer-plus love and hope throughout the year, with all proceeds donated to Rocking the Road for a Cure! Featured authors & stories include: Carolyn Ridder Aspenson In \"Santa's Gift,\" journalist Jessica thinks Santa's just a silly myth for children, so when he asks what she most wants for Christmas she tells him the one thing she knows he can't deliver--true love. Or can he...? Sarah Hitchcock In \"The Christmas Lights,\" one competition pits two families against each other...who will win this war? Francine LaSala Pretty Izzy knows exactly what she wants for Christmas: hunky sales manager Jake Harrington wrapped up with a shiny silver bow--and nothing else. Except Santa may have other plans in \"Carol of the Belles.\" Nikki Mahood In \"Spinster Christmas,\" Cara's looking forward to spending Christmas alone until she learns her old--and she believes very gay--crush needs a place to stay. Though it soon becomes clear that while still hot, Ronan isn't gay after all... Holly Martin Ella's dreams of making a better life for her and her daughter seem further away than ever in \"Iced Dreams.\" But as Christmas approaches, and she wishes for a fairy godmother to wave a magic wand to fix her life, things begin to change in ways she never imagined! K.C. Wilder In \"The Mermaid,\" Allie's content to spend Christmas by herself at a vacant beach house to make good on a promise made to her true love lost, Jeff. Until Jeff's gorgeous college roommate Tim crashes in on her with his own promise to keep... So snuggle up near the fire, drink a glass of wine or a cup of cocoa and enjoy these festive holiday shorts, knowing your purchase of this book is helping women with breast cancer.",
  "genres": [
    "Christmas",
    "Romance"
  ],
  "author": "Carolyn Ridder Aspenson",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/18963552-merry-chick-lit-celebrate-the-season-with-six-sassy-shorts"
}