{
  "title": "The Lost Prince",
  "description": "From the Number One Bestselling Author Saxon Andrew comes the first book in his newest series, Star Chase-The Lost Prince. This new series takes place a thousand years in Earth’s future after mankind has moved out into the galaxy. With new Characters and powerful enemies, the series will hook you from the start.The worlds in the Orion Nebula had been planning rebellion against the Galactic Union for more than a hundred years. Now the rebellion has started with a sneak attack against the Royal Family on Euclid. The planetary defenses were temporarily suppressed and the attack on the Royal Palace killed everyone including half of the invaders. But one member of the Royal Family wasn’t in the palace when the invaders struck. The attackers were forced to flee as the Obelisk began defeating the suppression field and began to come back on line. The attacking transports fled the planet but not before two of them were vaporized. Before they left Euclid, they determined that the Prince was no longer on the planet.The Nebula knew that if the Prince was to return to Euclid, the main Obelisk would power all the other Obelisks on the worlds of the Union and the rebellion would be over before it began. Only a member of the Royal Family could power the Obelisks and the Nebula knew that the Prince must be found and eliminated. The Nebula chose their most powerful warrior to find him. There was little chance of the Prince escaping the Dark Officer. He was a High Genetic and possessed unique tracking skills. The only question was how many were going to die before he was successful.What the Nebula and Union didn’t know was that all of them were at risk of being destroyed and the Prince was the only one that could save them. Would they find out in time? The action is nonstop in Star Chase as the Prince runs to save himself and the UnionExcerpt from Star ChaseIan said, “They’ve brought in sixty more ships. We might as well determine where we stand in comparison; prepare to attack.”“Gary, you come in at the center; I’ll go left and Drey you go right. Hit them hard and stay on your edges. Ready…go.”Abby watched Gary fly the ship between two of the battleships and spin the wings. Two blaster beams shot out of the wing tips and the two ships were left burning and drifting in space. Gary yelled, “Thirty more ships have just jumped in; keep them in sight.”Ian flew between a four ship group, spinning the wings as he fired at all four. Two of them were left burning but the other two withstood the hits and turned to pursue. He left normal space for an instant and emerged directly behind the two, giving chase and fired a missile at their thrusters. The missiles hit and the ships blew up in giant explosions that Ian flew over just as eight ships emerged into normal space directly below his path. All eight immediately fired, but only three on the port side hit the fast flying warship. E attempted to drop out of normal space, but failed as two large holes were blown through his port wing.Abby yelled, “Ian’s been hit!”Gary whipped the ship around and went to a brief FTL run and was on the attackers under Ian in a heartbeat. The giant white ship spun and fired a red beam at the eight ships taking aim at E. All eight ships had holes burned through their hulls. Five were left burning and three exploded in massive blasts. “IAN, GET OUT OF HERE!”This review is from: Life Warrior (The Fight for Creation (Book One)) (Kindle Edition) These 13 books (so far) are the best SciFI I've read and my favorite Series.",
  "genres": [
    "Science Fiction",
    "Amazon",
    "Young Adult",
    "Military Fiction"
  ],
  "author": "Saxon Andrew",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18969892-the-lost-prince"
}