{
  "title": "Atlantis beneath the Ice: The Fate of the Lost Continent",
  "description": "Scientific and mythological evidence that Antarctica was once Atlantis  • Reveals how the earth’s crust shifted in 9600 BCE, dragging Atlantis into the polar zone beneath miles of Antarctic ice  • Examines ancient yet highly accurate maps, including the Piri Reis map of 1513, which reveals a pre-glacial Antarctica  • Shows how myths of floods and disaster from around the world all point to a common source  In this completely revised and expanded edition of When the Sky Fell, Rand and Rose Flem-Ath show that 12,000 years ago vast areas of Antarctica were free from ice and home to the kingdom of Atlantis, a proposition that also elegantly solves the mysteries of ice ages and mass extinctions, the simultaneous worldwide rise of agriculture, and the source of devastating prehistoric climate change. Expanding upon Charles Hapgood’s theory of earth crust displacement, which was championed by Albert Einstein, they examine ancient yet highly accurate world maps, including the Piri Reis map of 1513, and show how the earth’s crust shifted in 9600 BCE, dragging Atlantis into the polar zone where it now lies beneath miles of Antarctic ice. From the Cherokee, Haida, and Okanagan of North America to the earliest records of Egypt, Iran, Mexico, and Japan, they reveal that ancient myths of floods, lost island paradises, and visits from advanced godlike peoples from all corners of the globe all point to the same worldwide catastrophe that resulted in Atlantis’s demise. The authors explain how the remaining Atlanteans, amid massive earthquakes and epic floods, evacuated and spread throughout the world, resulting in the birth of the first known civilizations.  Including rare material from the archives of Charles Hapgood, Albert Einstein, and Dwight D. Eisenhower, the Flem-Aths explain how an earth crust displacement could happen again in the future, perhaps in correspondence with high solar activity. With new scientific, genetic, and linguistic evidence in support of Antarctica as the location of long-lost Atlantis, this updated edition convincingly shows that Atlantis was not swallowed by the sea but was entombed beneath miles of polar ice.",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "Rand Flem-Ath",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/18982611-atlantis-beneath-the-ice"
}