{
  "title": "The Little Fairy",
  "description": "ABOUT THE BOOKJudith Weinshall Liberman wrote THE LITTLE FAIRY Iin the early 1980s, but it was not until 2012 that she first published the story. This she did in her book Poems, Lyrics, and Stories, an anthology created in collaboration with her daughter, Dr. Laura Liberman. THE LITTLE FAIRY tells the story of a little boy, Jonathan, who has some endearing He loves books, and he believes in magic. Using one of his magic tricks to select a book at the library, he is surprised - and delighted - to see a live little fairy emerging from the book. Taking the book home, he hopes to spend quality time getting to know the little fairy, but the reaction of members of his family frustrates his plans. Yet, as if by magic, the story has a surprise happy ending.ABOUT THE AUTHORBorn in Israel (then called \"Palestine\"), Judith Weinshall Liberman came to the United States in 1947 to pursue higher education. She earned four American university degrees, including two in law. After settling in the Boston area in 1956, she studied art and creative writing. Beginning in the early 1960s, and for four decades thereafter, Ms. Liberman created numerous series of artworks. Her art has been widely exhibited, and is represented in the collection of museums and other public institutions. During her long career in visual art, Ms. Liberman wrote and published several books. Her book THE BIRD'S LAST SONG (Addison-Wesley, 1976), which she wrote and illustrated, won a citation as one of the \"fabulous books of the year.\" In 2012, she published her second children's book, ICE CREAM SNOW. Judith Weinshall Liberman's archives can be found in the Fine Arts Department of the Boston Public Library and at the Smithsonian Archives of American Art.ABOUT THE ILLUSTRATORIn 2012 Judith Weinshall Liberman decided that THE LITTLE FAIRY would make a lovely children's book if properly illustrated. Since she did not feel that, in light of her deteriorating eyesight, she could do justice to illustrating the book herself, she selected a fine artist, Ms. Gail Davis, to create the illustrations under the author's guidance. Ms. Davis' illustrations for THE LITTLE FAIRY are not only beautiful as works of art, but also capture the spirit of the story and of the characters. Through her rendition of the fairy, Jonathan, the librarian, and members of Jonathan's family, Ms. Davis has created a world that is both enchanting and memorable.",
  "genres": [],
  "author": "Judith Weinshall Liberman",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/18983607-the-little-fairy"
}