{
  "title": "Every Day Is Christmas",
  "description": "From Karen Schaler, the Emmy Award-winning writer of the Netflix romantic comedy A Christmas Prince and Christmas Camp , the Hallmark movie and novel, comes this new Christmas romance for 2023, a heartfelt holiday love story about second chances and believing anything is possible at Christmas…A shrewd money manager at the top of her game, Alexis Taylor is a proud workaholic who “humbugs” Christmas and love. The only holiday tradition Alexis embraces is always breaking up with her boyfriends right before Christmas.But this Christmas, everything changes when Alexis gets a holiday visit of a lifetime. As Alexis’s past, present, and future collide, she’s forced to risk the one thing money can’t buy…her heart.Inspired by Karen Schaler’s beloved Lifetime Christmas movie Every Day Is Christmas and the Charles Dickens classic A Christmas Carol , this heartwarming Christmas romance of self-discovery, forgiveness, and transformation, is filled with heart and hope.This new Christmas love story about redemption, family, and second chances, Every Day Is Christmas is written with Karen’s signature warmth and humor, celebrating the power of true love and Christmas miracles.Bonus Includes exclusive Christmas recipes, holiday activities, and pictures from the movie set.EVERY DAY IS CHRISTMAS is an uplifting, powerful, feel-good Christmas romance novel that will appeal to fans of Christmas romance authors Debbie Macomber, Susan Mallery, Shelia Roberts, and RaeAnne Thayne.5-STAR Readers & Reviewers are Falling in Love with Karen Schaler's Christmas Romance Novels and Her New Christmas Romance for 2023, Every Day Is Christmas !“Karen is one of the most masterful seasonal storytellers writing today with a gift for distilling warmth and magic into profoundly uplifting storylines.” —Rose Hilliard, Executive Editor, Audible Originals“What a wonderful, contemporary twist on Charles Dickens’s classic A Christmas Carol. This is a beautiful story about love, forgiveness, second chances, and the true meaning of Christmas. This is a story to remind us to keep the spirit of Christmas in our hearts, alive and well all year long. Karen Schaler is a favorite author of mine and I highly recommend Every Day is Christmas along with all her other books!” — Karen Cowee, Librarian, Phoenix Public Library\"Karen Schaler writes Christmas romance stories that are bursting with Christmas charm!\" — Jenny Hale, USA Today Bestselling Author“This story is a brilliantly reimagined take on \"A Christmas Carol\". As always Ms. Schaler has written a heartwarming Christmas story, that will surely kick off the holiday season for every reader…This was a fantastic read and I was just sorry to come to the last page. I'd truly love to give more than 5 stars!!” — Anna Maria T, NetGalley“I wasn’t sure how I would feel about a retelling of A Christmas Carol since it’s been done so often but this one has a twist to the story that I loved. I went in with a certain expectation and when the story flipped I was instantly hooked and couldn’t stop reading. Another Christmas Classic and one of my favourite retellings of A Christmas Carol.” —Eric M, NetGalley“Karen Schaler brings the cozy to Christmas in her heartwarming Christmas romance tales of love and joy.” — Nancy Naigle, USA TODAY Bestselling Author“Schaler’s smart, appealing protagonists will keep readers turning the pages, and the plotting is pitch-perfect, leading to an inevitable but charming happily-ever-after.” —Publishers Weekly for Finding Christmas“A wonderfully festive setting… The cast is charming and the atmosphere’s enchanting.” —Publishers Weekly for Christmas Ever After",
  "genres": [
    "Christmas",
    "Romance",
    "Holiday",
    "Fiction",
    "Contemporary",
    "Contemporary Romance",
    "Book Club"
  ],
  "author": "Karen Schaler",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/189801800-every-day-is-christmas"
}