{
  "title": "Jade Calhoun Boxed Set #1-3",
  "description": "From New York Time bestselling author Deanna Chase. This boxed set includes the first three books in the Jade Calhoun Haunted on Bourbon StreetWitches of Bourbon StreetDemons of Bourbon StreetOther books in the of Bourbon StreetShadows of Bourbon StreetIncubus of Bourbon StreetBewitched on Bourbon StreetHexed on Bourbon StreetDragons of Bourbon StreetHaunted on Bourbon Jade loves her new apartment--until a ghost joins her in the shower.When empath Jade Calhoun moves into an apartment above a strip bar on Bourbon Street, she expects life to get interesting. What she doesn't count on is making friends with an exotic dancer, attracting a powerful spirit, and developing feelings for Kane, her sexy landlord.Being an empath has never been easy on Jade's relationships. It's no wonder she keeps her gift a secret. But when the ghost moves from spooking Jade to terrorizing Pyper, the dancer, it's up to Jade to use her unique ability to save her. Except she'll need Kane's help--and he's betrayed her with a secret of his own--to do it. Can she find a way to trust him and herself before Pyper is lost?Witches of Bourbon Jade Calhoun was never fond of her empath abilities. Now she's discovered she has another gift she'd rather not unwrap--magic. But when her mentor, Bea, becomes gravely ill and insists Jade's the only one who can help, she's forced to embrace her witchy side.It's too bad she spent a decade shunning the magical community and never learned to harness her powers. Because time's run out. A trapped spirit has revealed a clue to Jade's long-lost mother. The resident angel has gone rogue and disappeared with Jade's boyfriend, Kane. And if that wasn't enough, her ex appears to be possessed.To save any of them, Jade will need to find a way to control her inner white witch--without succumbing to black magic. Otherwise, she'll lose everything...including her soul.Demons of Bourbon New Orleans coven leader, Jade Calhoun, is embarking on a Hellish mission. Literally. A week ago her ex sacrificed himself to Hell in order to save Jade’s mother. While he suffers, Jade will stop at nothing to bring him home…even if it means working with Lailah, an angel she’s never trusted.But the stakes are raised when Jade discovers her boyfriend, Kane, is marked by a demon. The very same one who tried seducing him right before Jade’s eyes. Now Kane’s life is on the line, and consequently, Jade’s soul is compromised. She’ll need all the help she can get, including Lailah’s, as she fights her way through Hell to save her ex and Kane—and her entire existence.",
  "genres": [
    "Paranormal",
    "Romance",
    "Fantasy",
    "Urban Fantasy",
    "Mystery",
    "Paranormal Romance",
    "Amazon"
  ],
  "author": "Deanna Chase",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/18973746-jade-calhoun-boxed-set-1-3"
}