{
  "title": "Zealot: The Life and Times  of Jesus of Nazareth by Reza Aslan - A 30-minute Chapter-by-Chapter Summary",
  "description": "***REVISED VERSION REPUBLISHED ON DEC 20, 2013. RE-WRITTEN FROM SCRATCH.***With InstaRead Chapter-by-Chapter Summaries, you can get the essence of a book in 30 minutes or less. We read every chapter and summarize it in one or two paragraphs so you can get the information contained in the book at a faster rate.This is an InstaRead Summary of The Life and Times of Jesus of Nazareth by Reza Aslan.Below is a preview of the earlier sections of the Author’s NoteAslan found Jesus during an evangelical youth camp in his sophomore year. He was told the story of Jesus being born as a mortal and innocent man who later became the Christ. Jesus challenged the Jews and they crucified him. His sacrifice and resurrection saved us.An exile of the Iranian revolution, Aslan’s family was no longer religious because Islam was to them a symbol of everything they had lost. Aslan didn’t feel much like a Muslim anyway, being in America. But Jesus was America, and it made his conversion easier. Jesus became his best friend.As he started to share his faith, he began to notice the large distance between the Jesus of the Gospels and the Jesus of history. This intensified when he started to study history of religions in College and realized that the Bible is full of errors and contradictions. This gave him a more critical distance to study the Bible, making him see the real Jesus with clarity. Aslan wrote this book to spread the good news of Jesus of Nazareth, the man – not Jesus the Christ.His arguments are based on two decades of exhaustive research, and he provides any contrary arguments from other sources in notes at the end of the book. He relies mostly on the gospel of Mark and material unique to Matthew and Luke.A.D. is substituted by C.E. (Common Era) and B.C. by B.C.E. (Before Common Era).IntroductionAt a time when many would-be messiahs wandered Roman land, Jesus of Nazareth was mocked by Romans for what they considered apocalyptic rambling and delusions. The Gospels, most likely authored by anonymous writers who never knew Jesus, shed very little light on his life. Rather, they focus on his divine figure.Jesus was a Jew who led a Jewish movement in Palestine, and Rome crucified him for the crime of sedition. Combining these historical facts with reliable historical records sheds a clearer light on his life than do the Jesus was not a gentle shepherd but rather a zealous revolutionary.The Gospels were written after dark times in Rome. Jewish rebellions led to bloodbath and the exile of Jews from Jerusalem. To portray a messiah that Romans would accept, Christians reinterpreted the figure of from a revolutionary Jewish nationalist to a peaceful spiritual leader. This book reclaims the historical, pre-Christianity Jesus by placing him within the correct social, religious and political context of his era. The Jesus that emerges will be much different from what Christianity has portrayed.",
  "genres": [],
  "author": "Instaread Summaries",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/19003810-zealot"
}