{
  "title": "LBJ: The Mastermind of JFK’s Assassination",
  "description": "Lyndon B. Johnson’s flawed personality and character traits were formed when he was a child, and – through his primary enablers, his mother and his wife – grew unchecked for the rest of his life as he suffered severe bouts of manic-depressive illness. The people-manipulation skills he learned at his father’s side and had perfected by the time he graduated from college became the currency he used to barter, steal and finesse his way through the corridors of power on Capitol Hill. These skills, combined with his overpowering manic personality, amoral instincts and thirst for power, allowed him to prosper both financially and politically during his years in Congress. Neither his family nor his employees, aides, associates and cabinet officials would ever confront him on any issue for which he had made up his mind, including the Vietnam War.Unfortunately, his “darker side” included a lifetime struggle with “bipolar (manic-depressive) disorder” which he successfully hid from the public, though not all of his aides. It is the premise of this book that Lyndon Johnson suffered recurrent and progressively stronger bouts of mental collapses during the period of his vice presidency as he planned his ascension to the presidency, purposely undermining Kennedy’s domestic and foreign policy initiatives for the purpose of cleverly saving them for his own legacy. His active involvement with JFK’s assassination will be conclusively shown, including photographic evidence that he knew in advance when and where it would happen. The stunning conclusion of this book is that Lyndon Johnson began planning his takeover – the fulfillment of his life-time dreams – even before being named as the vice presidential nominee in 1960.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Biography",
    "True Crime",
    "Audiobook",
    "American History"
  ],
  "author": "Phillip F. Nelson",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/11056660-lbj"
}