{
  "title": "Olivia, Mourning",
  "description": "Historical Fiction (USA 1840s)Available on Amazon in eBook and paperback.Newly orphaned and forced to live with her brother and the overbearing woman who will soon be his wife, Olivia Killion is determined to gain her independence by inheriting 80 acres of farmland in far off Michigan. Her father’s will bequeathed the land to whichever of his offspring would put in a crop and stake a claim to it. Olivia insists, “I’m sprung off him just as much as Avis or Tobey.”The problem: she’s seventeen, female, and it’s 1841.She has a friend who would make a perfect partner for this endeavor. Mourning Free knows how to run a farm, having worked many years for local farmers. More importantly, Olivia has complete trust in him and no fear of a romantic entanglement developing between them. Mourning will put in the crop for her and she will then help him buy land of his own.The problem: Mourning is black, the orphaned son of runaway slaves, and reluctant to travel and work with a white girl. He especially fears the private agents from the south who patrol the free states, hunting fugitive slaves.Olivia believes she and Mourning can make their partnership work and they set off together. All goes well, despite the drudgery of survival in an isolated log cabin. Incapable of acknowledging her feelings for Mourning, Olivia thinks her biggest problem is her unrequited romantic interest in their young, single neighbor. Then she is betrayed and violated and her world falls apart.Strong-willed, vulnerable, and compassionate, Olivia is a compelling protagonist on a journey to find a way to do the right thing in a world in which so much is wrong.Awards2010 YWO Book of the Year2013 Amazon Breakthrough Novel Award, Quarter-Finalist",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Romance",
    "Adventure",
    "Amazon",
    "Coming Of Age"
  ],
  "author": "Yael Politis",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/18997323-olivia-mourning"
}