{
  "title": "Touching Rune",
  "description": "Rune August embraces her life in New York City in 1894. She has lived again and again through many different time periods but has never found tranquility until she walked into St. Agnes Home for Orphans. In her heart, she believes she has found a place she can call home. She will do everything she can to give the children in the orphanage a better life.When a developer sets his sights on the property she and the children call home, she doesn’t hesitate to fight back - and win. But that win comes at a terrible price... her life… casting her once again into the shadows.Refusing to leave the children unprotected, she watches over and protects them in a different form… as the beloved statue in their center garden. But her time as the children’s guardian angel draws to a close when the orphanage is renovated. Rune finds herself packed away and sold. Her new home is now far away from the familiar streets of New York and the children she loves.Sergei Vasiliev and his best friend and bodyguard, Dimitri Mihailov, run one of the most powerful computer software development companies in the world. Both men carry deep scars from their life on the streets and from living in the world of the ultra-rich. Sergei knows men want him for his power and women want him for his money. Dimitri knows that some men and women would do anything to gain the secrets their company is developing.Their lives change when Sergei purchases a statue for their home outside of Moscow. There is something about the statue of the young woman that touches an unexpected need deep inside both of them.An impulsive purchase and a simple wish will change their lives forever. For anyone who touches Rune learns that love and hope are what makes the world a better place. Can she warm the hearts of two bitter, scarred men before the last petal falls from the Christmas rose that grows in the garden that has become her new home or will she be forever frozen, destined to only love them from afar?",
  "genres": [
    "Menage",
    "Paranormal Romance",
    "Romance",
    "Paranormal",
    "Fantasy",
    "Time Travel",
    "Reverse Harem"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/18995221-touching-rune"
}