{
  "title": "From Tapas to Meze: Small Plates from the Mediterranean",
  "description": "The countries that circle the Mediterranean share more than the sea's azure waters. They share a love of first courses -- tapas from Spain, hors d'oeuvres and entrees from France, Italy's antipasti and primi piatti, mezethes from Greece, and the meze of the Levant and North Africa. These small dishes reflect the region's extraordinary bounty, its reliance on seasonal produce, and its emphasis on straightforward preparation.More than 220 recipes demonstrate both the unity and the variety of Mediterranean cuisine. Olive oil, garlic, tomatoes, eggplant, peppers, onions, and fresh herbs are the foundation of all Mediterranean cooking. But what a tremendous range of flavors and textures emanate from those ingredients!Often one brilliant idea is manipulated differently by each cuisine. Take flat In Spain we find Coca de la Huerta, a summer vegetable flat bread from the Balearic Islands. France offers Provence's Pissaladiere, laced with anchovies, onions, and olives. You're probably familiar with Italy's great flat breads (like Focaccia con Gorgonzola e Pinoli), but have you ever tasted Lahmacun, a Turkish lamb and tomato pizza, spiced with cinnamon, allspice, and cloves?The Mediterranean plays the same game with savory egg pies. You can't enter a tapas bar in Spain without being confronted by some sort of tortilla, the ubiquitous Spanish omelette that appears here with caramelized onions as Tortilla de Cebollas a la Andaluza. In the South of France an omelette might be stuffed with pistou (the French equivalent of Italian pesto), and in Italy you would find the Italian equivalent of the omelette the frittata -- made with roasted sweet peppers. In Greece, the egg has been transformed into a Sfoungato me Kolokithia Apagio, a baked omelette with rice, zucchini, leeks, feta, and mountain herbs. In Tunisia, echoes of the French occupation can be tasted in the ajja, a traditional omelette filled with Tunisia's own spicy merguez sausage.For this authentic collection, Joanne Weir ate her way around the Mediterranean cajoling home cooks and restaurant chefs into surrendering their finest recipes. Throughout the book is a reverence for the Mediterranean practice of hanging out at the table with a glass of wine -- or sherry, or ouzo, or raki -- while nibbling on an assortment of delectable little dishes. Let From Tapas to Meze bring this gracious tradition into your home.From the Hardcover edition.",
  "genres": [
    "Cookbooks",
    "Food",
    "Cooking",
    "Reference"
  ],
  "author": "Joanne Weir",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/189961.From_Tapas_to_Meze"
}