{
  "title": "The McKinnon Legends: Books One-Five",
  "description": "\"Nic, my friend, you think Fate's a bitch? Just wait until you meet her sister Destiny.\" Connor Holden, Earl of FeatherstoneThe McKinnon Legends box set contains the all five installments of the five-volume series The McKinnon Legends. Beginnings are essential to every story, and the McKinnons’ are often driven by fate.The McKinnon The Beginning, the first installment opens in fifteenth-century England and lays the foundation for a family saga spanning centuries. Not your typical knight-in-shining-armor-damsel-in-distress story, The Beginning carries readers along on a journey of intense love, treachery, and a mysterious world in which time and space collide. Unfinished Business, the second installment finds Connor Holden, Earl of Featherstone, squarely in a place he never felt he would ever be—in love with a woman who he doesn’t know how to win. Shades of Grace continues with Cullen McKinnon’s story after his abrupt departure at the end of book one. Living his life in modern-day Texas working as a U.S. Marshal, Cullen finds himself deeply entrenched in a tale of murder, assassination attempts, and mysterious identities.Of Purest Blood is the fourth installment of the McKinnon Legends, and it takes readers on a journey through time and space, jumping between the fifteenth and twenty-first centuries. Gage McKinnon, the current Duke of Seabridge, stands in the middle of his richly appointed study and finds himself torn between his duty to his family and the desires of his heart. How could he desire her and fear what she represents simultaneously? Gage must face the hardest decision of his life: walk away from the love of his life or change his beliefs on how a proper duke and McKinnon man should lead his life.Where in time was Decklyn McKinnon? Readers find out the final pieces to the McKinnon puzzle that was first introduced in The McKinnon The Beginning in James’ fifth installment The Missing One. Decklyn McKinnon, intergalactic cop and strong-arm of the Interstellar Alliance, has been missing from the McKinnon family records since his untimely disappearance in 1523. No one has a clue what could have happened to him leaving the family record silent. Chasing after a serial killer through time and space, Decklyn takes on the biggest gamble of life. Unsure of his time traveling abilities, he doubts that he can save all of the victims, but it’s possible he can save victim number six. Risking it all to save the life of just one woman, he journeys back to Earth 2005.",
  "genres": [],
  "author": "Ranay James",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/18994384-the-mckinnon-legends"
}