{
  "title": "The Road to London",
  "description": "PROUD TO BE DIFFERENT\n'The sky and the ocean crossed your eyes and sank in my heart.'\nEXCERPT from THE ROAD TO LONDON\n\nSECOND EXCERPT from THE ROAD TO LONDON\nSYNOPSISWhen time and place play tricks with your birth, what can you do apart from creating your own imaginary world, then run away from your own creation, to a new life?A boy is born, some time in the recent past, in Milan, Italy, yet backwards when concerned with 'different' sexualities, and Fate wants this boy not only to be of an intellectually and socially dominant nature, but of a sexually and emotionally gay and submissive disposition.Unable to explain himself to himself, unable to relate to the world, this soul creates his own world, through dreams, drugs, alcohol and lies, while from a distant place, a club in London, and maybe from his future, if he ever learns to fly, letters to his beloved My Dear look back at his life in Italy with parallels in a romance yet to be.He tries to be 'normal' and have relationships with girls, he tries to be honest, and open himself up to his love and friend, but life has decided only pain, rejection and suffering should come of it, for the time being at least.But little glimpses into another, maybe possible life, sparkle here and there through his life, his dreams and into his heart....PROFESSIONAL BOOK REVIEWS\"... a truly unique read, a kind of next-level work of literature...\" - \nReaders Favorite\nYou can read the full review clicking here >>> \"Bulla has through vibrant and poetic use of language created a modern day classic!\" ... \"above anything else that I have read this year.\" - \nSelf Publisher's Showcase\nYou can read the full review clicking here >>>\"... remarkably literate\" ... \"a brilliant short novel\" ... \"Highly recommended.\" - \nSan Francisco Book Review\nYou can read the full review clicking here >>>ARTICLES on THE ROAD TO LONDONYou can read a detailed article on Art in The Road to London full review clicking here >>>BLURBA light... A birth... A journey... An escape-not just from the whispering noise of expectations but from the growing awareness of a different life, a different path, a different quest. The greatest love letters are written in prose but bring forth the poet's heart, awakening in the receiver an equal passion-or so the writer hopes. This love letter tells the story of how I reach London, how I reach you, My Dear, how I come to love so deeply, so truly and completely. The journey was not easy, beloved. I faced many ugly trials on this narrow path-but also tests that were... Fun, naughty, spicy and the stuff of memories which will make me smile into my old age, whether you are with me or not. I have no regrets, My Dear, except one... Just one...\nProud to be different.\nFAVOURITE QUOTE POLL",
  "genres": [
    "LGBT",
    "Fiction",
    "M M Romance"
  ],
  "author": "Adriano Bulla",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18990618-the-road-to-london"
}