{
  "title": "Life as a Lie",
  "description": "The year is 1650. This romantic adventure begins in Spain and continues with a long voyage to the Highlands of Scotland. Flora Gastelum, a smart, talented and very strong-willed woman lives in Barcelona. At one time, her life was very comfortable, but then the lies meant to protect her ripple to the surface. Jose, an evil uncle, confesses he murdered her beloved father and a near rape forces her into a life and culture she never dreamed of. Flora is faced with a bleak choice: Stay in Spain living with greed, certain unhappiness and possible death, or take the risk of a new life, continued adventure, and a future unknown.Jose’s son had hoped to marry Flora, but now all he hopes for is revenge, and has vowed to track her to the ends of the earth if need be.Believing her mother to be shallow and unfaithful, as well as fearing for her own life, she leaves her ancestral home with Moray MacLeod, who offers her freedom by taking her to his castle in the Highlands of Scotland. Moray MacLeod, Laird of Clan MacLeod, is a Highlander known for his power and rugged good looks. A strong and virtuous man, he possesses a tender heart when it comes to the people he loves. Bound by honor and intrigue from a promise his dead father made, he hurls himself into danger that threatens his life and the life of the woman he has fallen deeply in love with. Their voyage to Scotland takes them to a small trading port called Vigo. A storm nearly sinks their boat and forces them to dock in need of replenishing supplies. To their surprise, they find Antonio, a six-year-old child who has been missing from Spain. Flora and many others in Barcelona had been near desperate to find him, but after months of searching all hope was lost. Bruised, beaten and badly scarred from a whip, the child finds allies who are willing to care and protect him. An entire clan of fearless warriors bond with Antonio, each man finding a place in their hearts for an orphan child. Flora and Moray find happiness neither one expected, but will the dangers, lies and evil in Spain follow her to Scotland, threatening to destroy the life and country she’s grown to love?Author Bio: Rebecca Perere's extensive world travel and love for historical romance is what prompted her to begin writing. She has spent the last three years honing her craft and choosing exactly the kind of story she wanted to tell. She captivated local newspaper readers with her comic, \"Bad Dog,\" as well as being an accomplished artist. Born and raised in California, she now lives happily with her family in Louisiana, where she is at work on her second novel. keywords: Historical, Sexual, Romance, Scotland, Highlands, Spain, Suspenseful, Family, Love, Trafficking, Vigo, Orphans, Danger, Intense, Funny, Voyage, Sad, Evil",
  "genres": [],
  "author": "Rebecca Perere",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/18989231-life-as-a-lie"
}