{
  "title": "Rhapsody: Child of Blood",
  "description": "Rhapsody is high fantasy, descended from Tolkien's Lord of the Rings through Eddings's Belgariad and Malloreon series, complete with an elf-like people, cannibalistic giants, fire-born demons, and dragons. Inquiring fantasy readers will wonder whether it can live up to such distinguished predecessors. The answer is yes. Haydon's first fantasy is a palpable hit. The three protagonists are well-realized characters whose adventures are by turns hilarious, horrific, and breathtaking. Best of all, though elements are drawn from familiar sources ranging from Norse myth to Mozart's The Magic Flute, Haydon's magic worldbuilding is convincing, consistent, and interesting.  Rhapsody, a young woman trained as a Namer, can attune herself to the vibrations of all things, tap the power of true names, and rename people, changing their basic identities. Her magic lies in music: \"Music is nothing more than the maps through the vibrations that make up all the world. If you have the right map, it will take you wherever you want to go,\" she tells her adoptive brothers. They are \"the Brother,\" a professional assassin able to sense and track the heartbeats of all natives of the doomed Island of Seren, their homeland, and his giant sidekick Grunthor, a green-skinned Sergeant Major who enjoys making jokes, using edged weapons, and honing his cannibalistic palate. Inadvertently, Rhapsody has renamed the Brother Achmed the Snake, breaking his enslavement to Tsoltan the F'dor (a fire-born demon). Tsoltan sends minions in pursuit to rebind Achmed. The three escape into the roots of a World Tree, Sagia, emerging transformed into another country and century. But have they truly escaped the F'dor's evil? And how does all this relate to the prologue's story of Gwydion and Emily, two young lovers brought together across history and then separated by the mysterious Meridion? Like most first volumes, Rhapsody contains a lot of background information and foreshadowing, though Haydon ties up numerous plot lines at the end. The dislocations in time can be confusing, and some readers may find that the very 1990s dialogue clashes with the epic storytelling of the descriptive passages. Overall, however, Rhapsody is a smashing debut that delivers hours of great reading and will have you impatient to read the rest of the series. --Nona Vero",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "High Fantasy",
    "Romance",
    "Science Fiction Fantasy",
    "Magic"
  ],
  "author": "Elizabeth Haydon",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/19002776-rhapsody"
}