{
  "title": "Annihilation",
  "description": "Teen-genius Seamus Robinson is not your typical high school junior. He has sacrificed what is important to most kids his age to pursue his passion for physics. Natural ability and uncommon discipline have allowed him to focus on the development of a dark energy power reactor. Just after his mother leaves on a typical business trip the world is turned upside down when a virus ravages the US and the world. As entire masses of the population are annihilated communication with the remote mother becomes increasingly difficult. When she makes communication from her sanctuary at NASA Ames Research Center in California, she reveals a vaccine just before the Skype video-chat abruptly terminates. Paddrick, his father, decides Seamus, his brother Liam and his sister Grace will be road-tripping it to California to seek the reunification of their family and whatever potential there may be in this vaccine. Gathering supplies locally shows no other living humans until they head to the local big box store. There they find one lone teenage survivor loitering near her lost family’s RV in the parking lot. Sophie’s taken in and joins the family on the trip West.The trip does not go smoothly. The group must contend with a massive wildfire and the devastation it leaves in its path. Travel is arduously slow allowing time for speculation that the fire was a purposeful event, set by other humans. Trying to make up lost time, Paddrick pushes on into the dark night until they slam into a very clearly man-made barricade on the highway meant to disable and deter anyone heading West. While briefly on foot the group encounter a lost boy who can only identify himself by the state from which he came, Colorado. The boy too is taken into the ‘family’ as they make their way eventually to Ames.Once arriving at their destination the world is again turned on their ear when they learn that it is Seamus’ genius and his power reactor research that had brought about the entire family’s vaccination against the government-instigated killer virus, and his work that will be vital to the growing troupe of survivors and their ongoing efforts to persevere.",
  "genres": [
    "Science Fiction",
    "Young Adult",
    "Apocalyptic",
    "Fantasy",
    "Futuristic",
    "Post Apocalyptic"
  ],
  "author": "K.D. McAdams",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/19005098-annihilation"
}