{
  "title": "How to Meditate in Just 2 Minutes: Easy Meditation for Beginners and Experts Alike!",
  "description": "The No.1 Bestseller - get your copy now!You may already know that meditation and mindfulness can increase focus, reduce stress, quiet the mind and improve your health. The problem is that many meditation methods require long hours and intense effort while guides can be heavy and full of complex ideas.So how can  you  use the simple power of meditation to improve your body and mind today, without the jargon?Clearly you need more than just the techniques, you need the right kind of techniques. Not just the ideas behind meditation but a super-simple, step-by-step guide to gently focus your mind in a matter of minutes...not hours.As a bestselling author and well-being coach, I’ve been lucky enough to work with some of the best experts around the world. With input from top practitioners and researchers I discovered easy meditation and mindfulness tactics that can be effortlessly used by everyone, whatever your background.This is “How to Meditate in Just 2 Minutes”... and in just 120 seconds it can improve your body and mind.How to Meditate in 2 Minutes is a simple, easy-to-use guide to focusing your brain and body.Moreover, it gives you the proven scientific benefits of mindfulness without needing to understand complex theories of religion or psychology.Whilst traditional guides can be heavy and difficult to follow, How to Meditate in 2 Minutes is a simple, tactical approach. Perfect for busy people in the modern world.Stressful, nerve-wracking days become a walk in the park when transformed using the right techniques.A busy and cluttered mind becomes focused and clear.Would you like to know the quickest and easiest way to experience the incredible benefits of meditation?Inside “How to Meditate in 2 Minutes” you’ll discover...Click and get your copy of How to Meditate in 2 Minutes now to see you’ve been missing! Meditation, Mindfulness, Sports Pscyhology, Mental Toughness, Mental Training, How to Meditate, Meditation for Beginners and Meditations for Relaxation, Mindfulness, Yoga, Tai Chi and Zen",
  "genres": [
    "Self Help"
  ],
  "author": "Phil Pierce",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/19010024-how-to-meditate-in-just-2-minutes"
}