{
  "title": "The Furies: Violence and Terror in the French and Russian Revolutions.",
  "description": "The great romance and fear of bloody revolution--strange blend of idealism and terror--have been superseded by blind faith in the bloodless expansion of human rights and global capitalism. Flying in the face of history, violence is dismissed as rare, immoral, and counterproductive. Arguing against this pervasive wishful thinking, the distinguished historian Arno J. Mayer revisits the two most tumultuous and influential revolutions of modern the French Revolution of 1789 and the Russian Revolution of 1917.Although these two upheavals arose in different environments, they followed similar courses. The thought and language of Enlightenment France were the glories of western civilization; those of tsarist Russia's intelligentsia were on its margins. Both revolutions began as revolts vowed to fight unreason, injustice, and inequality; both swept away old regimes and defied established religions in societies that were 85% peasant and illiterate; both entailed the terrifying return of repressed vengeance. Contrary to prevalent belief, Mayer argues, ideologies and personalities did not control events. Rather, the tide of violence overwhelmed the political actors who assumed power and were rudderless. Even the best plans could not stem the chaos that at once benefited and swallowed them. Mayer argues that we have ignored an essential part of all the resistances to revolution, both domestic and foreign, which help fuel the spiral of terror.In his sweeping yet close comparison of the world's two transnational revolutions, Mayer follows their unfolding--from the French Declaration of the Rights of Man and the Bolshevik Declaration of the Rights of the Toiling and Exploited Masses; the escalation of the initial violence into the reign of terror of 1793-95 and of 1918-21; the dismemberment of the hegemonic churches and religion of both societies; the \"externalization\" of the terror through the Napoleonic wars; and its \"internalization\" in Soviet Russia in the form of Stalin's \"Terror in One Country.\" Making critical use of theory, old and new, Mayer breaks through unexamined assumptions and prevailing debates about the attributes of these particular revolutions to raise broader and more disturbing questions about the nature of revolutionary violence attending new foundations.",
  "genres": [
    "History",
    "French Revolution",
    "Nonfiction",
    "Politics",
    "Russia",
    "Soviet Union",
    "France"
  ],
  "author": "Arno J. Mayer",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/190073.The_Furies"
}