{
  "title": "A Lady's Honor",
  "description": "Laurie Alice Eakes, winner of the National Reader's Choice Award for Best Regency novel, presents a story rich in historical detail that explores the tension in one woman's life between her desire to love and trust and the security of her ancestral home. Society is concerned about her honor, but Elizabeth must realize her worth doesn't lie in her inheritance.In order to avoid a forced marriage to a dangerous man, Elizabeth Trelawney flees London. An unexpected stranger arrives to help her, and as they elude her pursuers across Cornwall in the night, Elizabeth realizes her rescuer, Rouan Curnow, is familiar.Their differences in social status kept Rouan from pursuing a courtship with the lady his heart wouldn't let him forget. Now because of dangerous smugglers and local murders, the two are plunged into a reckless alliance that rattles Rouan's fledgling faith in God.The closer they get to Bastian Point-Elizabeth's true home-the more she realizes it is the only place she longs to be. Even the sight of its solid structure perched on the cliffs makes her feel safe. Elizabeth is the most likely to inherit Bastian Point if Grandfather never learns she spent the night, however innocently, with a near stranger.As spring warms into summer, Elizabeth finds herself torn between wanting to be the perfect grandchild and her growing love for a man of whom no one will approve as a match for her, a man she knows she shouldn't entirely trust. Unsure whether she is being foolish or following the right path, she sets out with Rouan on a quest to find the true culprit behind the local violence.Their quest leads them to danger, and she must choose whether to follow the man she loves or cling to the safety of her family home.",
  "genres": [
    "Historical Fiction",
    "Christian Fiction",
    "Romance",
    "Historical Romance",
    "Regency",
    "Historical",
    "British Literature"
  ],
  "author": "Laurie Alice Eakes",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/19006208-a-lady-s-honor"
}