{
  "title": "Texas Wanderlust: The Adventures of Dutch Wurzbach (Volume 65)",
  "description": "German immigrant Dutch Wurzbach lived the frontier history of Texas from the arrival of his family in Galveston in 1846 through the Council House Treaty, a stint with the Texas Rangers, service in the Confederate army, and another fifty years in the Lone Star State.Eight-year-old Dutch immigrated to Texas with his family in 1846. After the death of his mother, he worked for a while for Texas Indian agent R. S. Neighbors, then ran away to San Antonio. Over the next few years, he faced Indian attacks, broke mules for the U.S. Army, met Big Foot Wallace and other famous frontiersmen, sojourned at Fort Graham and Fort Inge, and experienced numerous adventures of frontier Texas.At the age of sixteen he joined the Texas Rangers in a campaign against the Commanches in North Texas. Scouting parties, horse races with the Indians, and blizzards all marked this phase of his life. On a trip with a military train heading for California on the \"Jackass Mail\" route across the desert, he participated in a major Indian battle at Maricopa Wells, Arizona. He joined General Crabb's filibustering expedition into Sonora, but after the slaughter of that force, he headed off to search for gold in the and joined the Mexican army in fighting Apaches.Eventually he returned to San Antonio, where he married and began a family. Not one to remain sedentary, when the Civil War began, he joined the Thirty First Texas Cavalry and served in the almost forgotten campaigns waged in Missouri, Arkansas, and Louisiana. Conversion of the regiment into infantry and desertion by their commanding officer led to the men's being sent off to Indian Territory, where freezing temperatures, starvation, and demoralization awaited them before General Taylor took command and marched them back to Louisiana. In the Red River Campaign that followed, the Texans defeated Union General Banks, but Dutch became ill and went blind, a condition that was not cured until 1870, by which time he had returned to San Antonio to raise a family of thirteen children and to live out his years.Dutch Wurzbach died in 1930 at the age of ninety-two, after spending the morning frolicking with his great-grandchildren, including the author of this book.This adventure-filled biography is based on recollections Wurzbach dictated to his daughter in 1915 when he was seventy-eight years old. These twenty-nine printed pages were published by a historical society in San Antonio in 1937 but have not been widely available. Meed has spent several years researching and expanding the memoirs and adding historical background.",
  "genres": [],
  "author": "Douglas V. Meed",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/1902402.Texas_Wanderlust"
}