{
  "title": "Asmodeus: Demon of Lust",
  "description": "When Kai Kelly inherits her estranged grandfather’s estate in Bliss, Idaho, life becomes anything but blissful. The discovery of a beautiful but unusual ring in the attic, leads to much more than she bargained for. Kai may not realize what she has in her possession, but the boys in Hell sure got the message. Lucifer and the six other princes of Hell, existed for several millennium believing that the Ring of Solomon–an object with the power to control demons– had been destroyed. However, the moment Kai slips the ring on her finger, the tremor of it’s power ripples through the underworld. Knowing the ring’s existence could mean the destruction of all demons, Lucifer sends his six princes to earth in search of the ring and it’s bearer. There’s one catch, a demon can’t take the ring from it’s owner, it has to be given willingly…or they have to be dead. Asmodeus, the Demon of Lust, is happy to have another opportunity to visit the mortal world and dally with a human female…or twelve. However, when he arrives on earth, he realizes Lucifer made all the demons mortal in an effort to keep them motivated, focused on their mission and immune from the powers of the ring. When Asmodeus meets Kai along a deserted section of highway in Magic Valley, it’s more than the ring she wears that catches his eye. He plans to woo the ring out from under her but before long, the lines between lust and love blur. When the other members of the brotherhood realize Asmodeus has found the ring, they descend on Bliss, determined to get the ring from Kai at any cost. When Asmodeus is faced with choosing between the brotherhood and his one true love, he realizes the battle for Hell is nothing compared to the battle for her heart.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Demons",
    "Fae",
    "Romance",
    "Urban Fantasy",
    "Magic"
  ],
  "author": "Sara  Humphreys",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/19019944-asmodeus"
}