{
  "title": "Big In Japan",
  "description": "Alice Gailsone was Dyspell, the most dangerous and feared woman in the world. She was infamous for being the second in command of the Purge, the most vile terrorist organization on the planet. At least she was, until she abruptly retired for reasons unknown...Alice Gailsone is now a buyer and trader of rare gemstones with the help of her adopted niece, Allison. She lives a boring, low-key life and does her best to stay out of trouble.At least she did, until she was approached by Alan Tanner, powerful business tycoon by day and dangerous vigilante Blackthorne by night, with an offer she cannot refuse: Put together a team of former super villain- turned-heroes in exchange for access to the one thing on the planet that could save her mother's life.Her first assignment is the Lotus, a deadly assassin for Japan's premiere criminal empire, the Dead Talon. In her way is a powerful corporate giant, an army of trained soldiers, a cult of murderous Kitsune and an unknown force moving in the shadows. To survive, she’ll need to pull everything out of her bag of tricks: guns, magic, cunning and more. Even with a terrifying and destructive power resting just beneath her fingertips, it may not be enough.She is out of practice, out of her element, and running out of time...Big In Japan is the first in a series of Action/Adventure Urban Fantasy novels about the Gailsone family. Join Alice as she deals with mob bosses, mercenaries, magic-related problems, golems, Kitsune, grumpy fortune tellers and the occasional firefight. Follow along as secret plots and sinister forces worm their way out of the shadows to test not only Alice, but the other 'heroes' of the Gailsone universe. A larger plan is unfolding with terrifying implications for the world, and Alice, whether she likes it or not, is stuck smack dab in the middle.",
  "genres": [
    "Urban Fantasy",
    "Superheroes"
  ],
  "author": "Casey Glanders",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/19025700-big-in-japan"
}