{
  "title": "Awakening Sophy: The Boxed Set Books 1-6",
  "description": "The Amazon Best Selling Awakening Sophy Series from award winning author Bianca James is now available in one complete boxed set.The Awakening Sophy Series Features:An Amazon Number 1 Hot New Release in EroticaAn Amazon Number 2 Best Seller in EroricaAll have been Amazon Top 50 Hot New ReleasesThis Hot, Edgy Erotica Boxed Set Includes:Stranger AddictionPublic ObsessionTriple DelightPole PositionMidnight MénageMore Triple Delight (Special Bonus Story)** Warning: This highly erotic, 62,000 word boxed set, is suitable for adults only (18+) as it contains many explicit sex scenes between consenting adults, sex fantasies, graphic language, elements of BDSM, oral sex, spanking, rough sex and anal play **Stranger AddictionIs it wise to share dark, erotic fantasies with a total stranger?Sophy thought it was – Until she found herself blindfolded in a candlelit bedroom with a mysterious stranger approaching, very slowly, up the stairs.Now it’s too late. He’s coming and he knows every sordid detail of her dirty little fantasy.The pretty, yet demure Sophy is about to be awakened in a way she could never have imagined.Public ObsessionSophy was satisfied with her cloistered existence. You couldn’t get hurt again if you kept to yourself. Right?Then The Stranger entered her home, and Sophy.After exposing a highly erotic, insatiable part of her that she had never been aware of, what is she to do?She can try to go back to her old life, but it’s not that easy to put the Genie back into the bottle and when she meets the hard bodied, charismatic and commanding Rick, does she even want to try?Is she really up to the challenge of satisfying her freshly awakened, ravenous appetite for erotic fantasy?Triple DelightIt began as a friendly dinner invitation from her neighbors. Craig, the hot, investment banker and his old college buddy, Luke, the bodybuilding, muscle car driving, inked parolee.Sharing some home cooked French cuisine, a few glasses of wine and a naughty dessert with a couple of guys who come from opposite sides of the track, was the plan for the night.Even the erotic stories that have been melting Sophy’s Kindle recently look tame in comparison to the events that unfold during the evening, as Sophy pushes aside her shy, self-conscious demeanor to explore another smoldering, hot fantasy that has been stoked by her recent escapades.Pole PositionIt was only intended to be a fun way to stay in shape. At least that's how it started, when Sophy first enrolled at the Pole Dancing school.Then an exhilarating offer to perform at an exclusive, underground Wall Street \"Gentlemen's\" club is made. A once in a lifetime opportunity to do something many women secretly fantasize about but would never do, even if they did have the chance.Parker, the obscenely wealthy golden boy of Wall Street happens to be at the club that night and becomes enamored with Sophy from the moment he lays eyes on her. He can have his choice of women, but only one ignites the raw passion within him.At first, Sophy dismisses Parker's generous proposal for a private performance. Then she starts to think about how she might make the most of the opportunity to fulfill yet another deeply erotic fantasy.Midnight MénageIt started out as a girls only night, just Sophy and her hot blond friend, Maddie. A few drinks and a few laughs.That was the plan.Then Craig, the hot Investment Banker from next door pays a visit ...More Triple DelightThe HOT special bonus story!",
  "genres": [
    "BDSM",
    "Erotica",
    "Contemporary Romance"
  ],
  "author": "Bianca  James",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/19030369-awakening-sophy"
}