{
  "title": "Against All Odds",
  "description": "War has kept Admiral Jenetta Carver far from home for twelve years. With the advent of peace, she takes a well-deserved vacation and returns to Earth for a visit before her duties as Military Governor and Supreme Military Commandeer of Region Two prevent such a trip for more years. She picks up her two sisters on the way home and the three women surprise their mom with the unannounced visit.Just a week after arriving home, Jenetta receives word that Region Two has been invaded. No war has been declared, and details are sketchy, but Tsgardi Warriors have landed on at least one planet a hundred light years inside the border and begun rounding up, harassing, and in some cases killing the citizenry. Determined not to let the news interfere with her mother's joy of having her three daughters with her, she doesn't mention the invasion at home, but she's summoned to appear at Space Command Supreme HQ to discuss the situation.As Jenetta begins the trip back to her base, she begins formulating plans and sending orders so that all will be in readiness when she arrives. She's determined to deal with the Tsgardi situation once and for all, and in a manner consistent with the way she dealt with the Milori situation. When an enemy refuses to let you live in peace, the only action you can take is remove their ability to ever wage war against you again. Jenetta doesn't yet know that the Tsgardi thrust into Region Two is just the tip of the lance. Three other interstellar powers have joined the effort to arrogate the new territory before Space Command can move security forces into place. Jenetta's tiny fleet will face an armada a thousand warships strong. It's not just another day at the office. 96,000 Words - 300 Pages",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Space",
    "Military Fiction",
    "Military Science Fiction",
    "Adventure",
    "War"
  ],
  "author": "Thomas DePrima",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/11058730-against-all-odds"
}