{
  "title": "Calmly, Carefully, Completely",
  "description": "***This New Adult book is intended for audiences over the age of 18 due to adult language, sexual content and adult situations*** This is book three of the Reed Brothers series, but it can be read as a stand alone book with no worry you've missed any good parts. Pete I met her on the worst night of her life. She was broken, shaking, and waiting for someone to save her. I am just thankful I got the opportunity to know her. Her dad helped me with some legal trouble I got into, and I volunteered to help out at their camp for children with special needs. Horses, pools, and a tracking bracelet on my ankle. Sounds like a fun week, doesn't it? She was there and she wanted to thank me for my kindness on that awful night. But I want her. I want her more than anything. I think she wants me back, but she needs calm and careful, and I don't know if I can provide that. Reagan Pete saved me. But now it's my turn to return the favor. He's hot, with this tattoos and piercings but, beneath it all, he's crying out for someone to save him too. Can he love me completely? She’s been locked up even longer than he has. Peter Reed is fresh out of jail, fresh out of excuses, and ready for a brand new start. Reagan Caster needs to thank Pete for an act of kindness, but he wants more than just her thanks. Reagan knows how to protect her body, but not her heart. And her traitorous body responds to Pete in a way it hasn't with anyone else. When Pete's innocent flirtation becomes more, Reagan's ready to accept what he has to offer. Pete assumes Reagan needs to be loved carefully and calmly. But Reagan knows she needs to be loved completely.   Can he give her what she needs?",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Contemporary Romance",
    "Abuse",
    "College",
    "Erotica"
  ],
  "author": "Tammy Falkner",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/19033508-calmly-carefully-completely"
}