{
  "title": "Taming Casanova",
  "description": "As the Casanova of the Moretti Men, Kevin Merck spent his life capturing the eye of multiple women. His conquests were legendary. But life isn’t always what it seems. After saving his best friend, Ryan West, with a bone marrow transplant, he became a permanent fixture in the Moretti family. While everyone was getting their lives back, something went terribly wrong. Turning to Dr. Jena Turner for help, he underwent his own personal health crisis in private. Keeping his secret was a risk he was willing to take to protect those he loved most.Kevin spent his days in the gym as a personal trainer and travelled the country as the face of a fitness franchise. Hot and steamy, he had his choice of women in every city. He had never met a woman he couldn’t charm the pants off, until he met the clever and smart mouthed Andi Allen. Her fiery personality and witty comebacks drew him in and wouldn’t let go. After finishing medical school, Andi moved back to LA to be near her brother, Caleb Allen. She had a front row seat for Kevin’s conquests. Affectionately naming him “Deuce”, Andi wouldn’t let him forget his predisposition for multiple partners. Always at each other’s throats, Kevin and Andi set off explosive fireworks each time they crossed paths. If fighting was truly foreplay, these two were in for an amazing ride. But when things seem too good to be true, they often are. People can be gone in the blink of an eye. In a minute, love can be lost and hearts can be broken. The Moretti family is rocked to the core. As they struggle to heal, can they find strength in their bond? Can they turn to each other or will heartbreak tear them apart? Is love enough to save one of their own?Taming Casanova is the fourth book in The Moretti Novels by MJ Carnal.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "M.J. Carnal",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/19034981-taming-casanova"
}