{
  "title": "Edge of Hyperspace",
  "description": "A collection of 10 short stories set in a Galactic Confederation in the far future. This galaxy spanning society thrives on intergalactic trade and these stories are about the people who make that possible. Check out Scott's other titles set in the same SF universe.Running From Customs - The story of Tramp Darvon and his crew as they take on a daring mission that they must complete in a set time period. They have to contend with local authorities, ships in distress, and the stellar nursary that makes the region dangerous to traverse.Beautiful Trouble - Hardened smuggler Hazdon Brenker falls for the story of a young girl seeking revenge on a gangster. He takes the challenging job of stealing the cargo, but revenge is not all the girl is after and it isn’t until the job is over that Brenker learns the truth.Where Legends Begin - Follow young pilot, Ven Zaran, as he struggles with depression and drugs until he find Captain Karnock. Under the Captain’s tutalage, Ven rises to lead pilot when his life is turned on end by a woman. He finds the motivation to get his life in order. As he and his wife are expecting their first child, Ven has a chance to buy a used ship and finally become a captain himself.Test of Command - Customs pilot Stormus Rolfel is up for a promotion. To get it he must pass a test by commanding a patrol mission. While the beacon they are assigned to seems quiet, the patrol sees just about every type of boarding possible. He complets the mission successfully, but will it be enough to get the promotion to Patrol Commander?Overture of Friendship - Ven Zaran takes a break from commanding his own ship to help a business collegue. Alderin Balerio has given Ven plenty of work in the past and they have worked closely. His niece is in trouble and he asks Ven, as a friend, to help. Ven takes the offer of friendship seriously and refuses any money. He and Balerio set out on a rescue mission and turn a business aqaintance into a friendship that will last for years.Race On The Rim - Stormus Rolfel and his longtime friend and fellow customs agent, Jimmed Albanis, board a party space cruiser for some needed R&R. But the cruise doesn’t remain quiet. Pirates, tempted by the potential ransom of a famous passenger, fall on the ship. The pirates never knew what hit them as the two burly customs agents derail their attempt to board and take the cruise liner.Chased By Shadows - A routine delivery for Alluren Beldaras and her crew turns dangers when a mysterious ship shadows them. When they successfully deliver their cargo after a firefight it appears to be over, but whoever was shadowing them is now out for revenge. When her ship is damaged, Captain Beldaras and her crew must use all their skill to make it to the nearest port alive.A Night At Nova Trango - On the first night back at work after losing her mother, Taru must contend with the varied clientele that the Nova Trango Bar gets from the neighboring port. She must handle drunks, rowdy pirates, an elderly regular, plus a lawyer who brings her the long secret identity of who her father was.Seeking Justice - Green skinned Zeccan, Wallivo Haroong, has been on the lamb for seven years. When his ship is laid up for six months, he decides that the time has come to clear his name. He sneaks back to his homeworld and ferrets out the truth of the crash that made him a fugitive and plans his revenge on the classmate who framed him.A Captain At War - Not all is peaceful as Ven Zaran and his associates battle the big corporations in a fight for survival. When Captain Laren d'Borchas is attacked by the forces of a rogue Customs Major, Ven rushes to the rescue only to find out his son was on the ship. He must battle Customs while conducting a rescue operation.",
  "genres": [],
  "author": "Scott Seldon",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/19035963-edge-of-hyperspace"
}