{
  "title": "The Boy Who Harnessed the Wind",
  "description": "When William Kamkwamba was just 14 years old, his family told him that he must leave school and come home to work on the farm – they could no longer afford his fees. This is his story of how he found a way to make a difference, how he brought light to his family and village, and hope to his nation.Malawi is a country battling AIDS, drought and famine, and in 2002, a season of floods followed by the most severe famine in fifty years brought it to its knees. William Kamkwamba's family were farmers, and relied on their maize crop to feed them for the year and bring in money by selling the surplus. But after many lean years, finally there was no more. By Christmas 2001 they were running out of food - with months before they could harvest their crop again.At 14 years old, William had been forced to leave school as there was no money to pay the fees. Borrowing library books to continue his education, William picked up a book in English about energy, with a picture of a wind turbine on the front cover. Fascinated by science and electricity, William decided to build his own. Ridiculed by those around him, exhausted from his work in the fields every day, slowly he built it with scrap metal, old bicycle parts and wood from the blue gum tree.It has changed the world in which William and his family live. Only 2% of Malawi has electricity; and the windmill now powers lightbulbs and a radio at their compound, and he has built more windmills for his school and village.When news of William's invention spread, people from across the globe offered to help him. Soon he was re-enrolled in school and travelling to America to visit wind farms. This is his story - his attempts to teach other Africans to help themselves, one windmill, one lightbulb, at a time.",
  "genres": [
    "Nonfiction",
    "Africa",
    "Memoir",
    "Biography",
    "Science",
    "Book Club",
    "Malawi"
  ],
  "author": "William Kamkwamba",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/19040111-the-boy-who-harnessed-the-wind"
}