{
  "title": "Alcohol Can Be A Gas!: Fueling an Ethanol Revolution for the 21st Century",
  "description": "Alcohol Can Be a Gas! is the only comprehensive book ever written on alcohol fuel production and use for home and farm. Until now, it has been very difficult for farmers, contractors, alternative energy aficionados, those concerned about Peak Oil, and small-scale entrepreneurs to obtain good, accurate information on producing alcohol, or on converting vehicles to run on alcohol fuel. And with all the conflicting news stories about ethanol, the public finds it difficult to sort fact from fiction. This text, which has been reviewed by scientists around the world, is the definitive reference work on alcohol fuel. Alcohol Can Be A Gas! contains 640 8-1/2 by 11 pages, with 514 charts, photos, and illustrations to reinforce the information-dense text. The book is geared for the nonscientific reader, but its 473 endnotes provide the technical foundation behind the accessible prose. A 700-word glossary and a 6300-entry index extend the book's usefulness. This book is the distilled essence of the most pertinent information ever assembled in one place on alcohol fuel, the technology that can help us finally become producers of almost limitless energy, instead of extractors of finite resources. How we produce our energy from here on out will determine how we govern ourselves and how we relate to nature and the environment; it will also create a sea change in where wealth concentrates. It will determine if the future is ruled by a small number of armed dictatorships backed by military and industrial interests (a cabal author David Blume likes to refer to as MegaOilron or the Oilygarchy), or if energy, and therefore power, is held by a diffusion of democratic entities, based on their ingenuity and ability to gather a portion of their daily solar income. As Blume writes in the Introduction to Alcohol Can Be a Gas! : \"Various prospective publishers argued that putting all of this material into one large volume might scare off readers who just want a recipe book of how to make alcohol. They said, 'All this history and politics is fascinating, but aren't you afraid that including it in your how-to book would scare away some buyers?' 'Put it in a separate publication,' their marketing experts said. But in the final analysis, I decided that this book should be a complete tool kit to revolutionize our transportation energy system, combining a broad, sweeping vision with intricate detail. \"I spent four years working on this book with a small team of researchers. I traveled all over the United States in search of the most up-to-date information. In frozen South Dakota, I talked to Orrie Swayze and his farmer and VFW buddies who are taking on the oil companies, and to alcohol combustion engineer and alcohol aviation expert, Jim Behnken. I went to Decatur, Illinois, to see the largest alcohol plant in the U.S., Archer Daniels Midland's 200-million-gallon-per-year plant. My travels also took me to Brazil to document the world's largest alcohol fuel program. \"It took over 25 years to finally get this book to you. It represents the confidence of almost 30 people who collectively loaned more than $250,000 to see this project through. It's the most comprehensive book ever written about alcohol fuel. Its production has been a massive effort that has depended on the cooperation of hundreds of people who contributed both their knowledge and, more importantly, their experiences.\"",
  "genres": [
    "Nonfiction"
  ],
  "author": "David Blume",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/1903134.Alcohol_Can_Be_A_Gas_"
}