{
  "title": "Monasterios: Las biografías desconocidas de los cenobios de España",
  "description": "Incluye más de 500 ilustraciones inéditas, especialmente tratadas para libro electrónico.  Durante siglos los monasterios mantuvieron y divulgaron una parte del saber antiguo, con monjes que copiaban los libros en los scriptoria y enseñaban en sus escuelas; pero también sirvieron para introducir el más depurado racionalismo en la arquitectura, mejorar los sistemas agrícolas de la Antigüedad, dignificar el trabajo manual contra la mentalidad aristocrática que lo despreciaba, dar la pauta para la concepción de las catedrales cuando llegó el auge de las ciudades o inspirar aspectos de la organización fabril en las primeras fases de la Revolución industrial.   En España se han construido centenares de conjuntos monásticos desde la Alta Edad Media hasta casi la actualidad. Este libro ―magníficamente ilustrado por el autor― habla de ellos en profundidad, sin reducirlos a una mera relación de obras maestras, porque para apreciar mejor los grandes monasterios necesitamos conocer los prioratos, las granjas y hasta las villas de recreo o las obras hidráulicas que dependían de ellos. De esta manera, por ejemplo, la apabullante monumentalidad de El Escorial se ve con otros ojos comparada con la humildad del pobrísimo convento del Palancar, levantado en la misma época.  Miguel Sobrino, que ya nos deslumbró con su anterior libro, Catedrales, nos invita en esta ocasión a recorrer los principales monasterios españoles, un patrimonio cercano contemplado a través de un viaje en el que son los propios edificios, su historia, sus anécdotas y su entorno los que hablan por sí mismos.  Miguel Sobrino González (Madrid, 1967) es dibujante y escultor. Ha publicado numerosos artículos sobre arte y arquitectura tanto en libros (El lenguaje de la arquitectura románica, La arquitectura tradicional en tierras de León, El arte del Renacimiento en el territorio burgalés, Palacio árabe de la Alhambra, Itinerarios de Isabel la Católica, En torno a los oficios tradicionales, El arte en el Camino. Un recorrido artístico por el Camino de Santiago) como en medios especializados o divulgativos (Goya, Boletín del Museo Arqueológico Nacional, Loggia, Descubrir el Arte, La Aventura de la Historia, Restauración y Rehabilitación).  En La Esfera de los Libros ha publicado con gran éxito Catedrales. Las biografías desconocidas de los grandes templos de España.  Como ilustrador, ha trabajado para diferentes editoriales y por encargo para varias instituciones como el Instituto del Patrimonio Histórico Español, Instituto Cervantes, Fundación de Cultura Islámica, Museo de las Ferias de Medina del Campo, Museo Arqueológico de Vitoria, Institución Gran Duque de Alba, Fundación Martínez Gómez-Gordo y los ayuntamientos de Madrid, Córdoba y Santo Domingo de la Calzada. Habitualmente imparte clases, conferencias y cursos en universidades y otras instituciones. Junto a Enrique Rabasa, se encarga de la asignatura de Taller de Cantería en la Escuela de Arquitectura de Madrid..",
  "genres": [],
  "author": "Miguel Sobrino",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/19039682-monasterios"
}