{
  "title": "Chained",
  "description": "A shy scientist with no experience outside the lab rescues an enslaved warrior with a shadowed past...Maggie Jordan is not supposed to be having adventures. Her mission is to go to Gaia, a new, unpopulated world, and study the native life forms there. So how come she finds herself in on the female dominated Yonnie Six instead, rescuing a huge, muscular prisoner? The same prisoner she keeps seeing over and over again in her dreams…Kor is a gladiator slave who has spent his life fighting in the savage arenas of the Blood Circuit. He’s got plenty of kills under his belt and more than enough reasons to run as soon as he gets free. But somehow he can’t make himself part from the curvy little female who was brave enough to save him from certain death.But Kor's previous owner isn't too happy with the theft of her expensive slave. To punish Maggie, she implants her with a device that forces her to sexual excesses the shy scientist has never known before—and Kor is the only one who can help her control her new urges.Kor is more than willing to help Maggie satisfy her new sexual hunger but his own appetites are not so easily satiated. For there is a dark secret, a shadow from his past that stalks him and whispers of power beyond belief if only he will give himself over to darkness.Will they find a way to return Maggie to normal? Will Kor admit how he really feels for her? Or with the shadow from his past succeed is tearing them apart?You’ll have to read this Forced Proximity, Enemies to Lovers, Curvy Heroine, Alien Warrior Romance to find out.Author's Note--Bring on the Spicy scenes! When Maggie's implant causes her to need sensual help, Kor is right there to give her exactly what she needs. (You're going to want to read this one in private.) The Brides of the Kindred series has 26 books with more on the way!ClaimedHuntedSoughtFoundRevealedPursuedExiledShadowedChainedDividedDevouredEnhancedCursedEnslavedTargetedForgottenSwitchedUnchartedUnboundSurrenderedVanishedImprisonedTwistedDeceivedStolen Committed",
  "genres": [
    "Romance",
    "Aliens",
    "Science Fiction",
    "Erotica",
    "Paranormal",
    "Science Fiction Romance",
    "Paranormal Romance"
  ],
  "author": "Evangeline Anderson",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/19035622-chained"
}