{
  "title": "The Penny Capitalist",
  "description": "Are you the sort of person who runs out of money on the 25th of every month, has no savings account, and wonders how you’ll ever find the money to get your daughter’s teeth straightened? Then meet James Hester.He and his wife had $70 and a four-year-old Studebaker when they were married in 1955. By 1968 they had a better car, more than their fair share of personal belongings, and $14,000. Then their net worth increased to $300,000. The increase was more than his total salary. They did this while raising three sons and maintaining a comfortable standard of living.Amazing? It certainly is. Lucky? Not at all! James Hester followed a plan—and you can use it every bit as effectively as he did.Originally published in 1979, The Penny Capitalist is now held in 236 libraries worldwide. Copies have been advertised on E-Bay for up to $900. Why republish a 30-plus-year-old book? Markets fluctuate. Human nature hasn’t changed. The opportunities are still out there. Each generation has to learn it all over again. Markets go up and markets go down. When they go down, the average investor panics and sells out at the bottom. When they go up, the average investor waits to see if the rally is real. By the time they decide to buy, the market is topping out. The savvy investor does just the opposite. As Warren Buffett has said, “When people get fearful, I get greedy. When people get greedy, I get fearful.”About The Author:James Hester (aka Algernon Horatio) has been a full professor and research scientist at a large mid-western state university. He is the author of a textbook and numerous scientific articles and monographs. He has served in research and administrative capacities with several federal and state agencies and a state museum. His career as a Penny Capitalist did not result from any grand design but from the imaginative pursuit of offbeat opportunities, or, as he puts it, “the only alternatives open to me.”",
  "genres": [
    "Business"
  ],
  "author": "James J. Hester",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/19047192-the-penny-capitalist"
}