{
  "title": "Forced to Please",
  "description": "Hi guys and girls! This is the final installment of the cop sex stories I’ve been writing. I hope you enjoy it!Natasha Stories xxStanding before me was the man who had been in my mind constantly since the first moment I met him. Even though he was dressed in civilian clothes, a pair of dark jeans and a tight fitting shirt, and carrying a small black backpack, he still looked every inch an officer of the law. Tall, dark-haired, and powerfully built, he was exactly the sort of man that made women weak at the knees . . . and he was having that effect on me now.A few moments before I had known exactly what I was going to say, but words seemed to completely escape me now. I just stood there staring at him.“Hello Lauren,” he said, after he had decided that the silence had gone on longenough.“Oh, hi,” I said, struggling in vain to regain my self-control.He walked in and closed the door, before pulling a small black sleeping mask from his pocket and showing it to me.“Do you know what this is?” he asked.I gave up my feeble attempt to play it cool. I was his. He knew it, and I knew it. There was no point pretending.“It’s a blindfold,” I replied docilely.He smiled at me, that same entrancing smile that I was so helpless against.“That’s right. Do you remember what I said I was going to do to you when I came to visit?”“You . . . you said that you were going to blindfold me?”“That’s right Lauren. What else did I say I was going to do to you?”I remembered very clearly what he had said.“You said you were going to blindfold me . . . and tie me to my bed.”“Correct again Lauren. You’re a very clever girl. But that’s not all I said is it? What else did I say I was going to do to you Lauren?” he asked calmly.“You said . . . that you were going to fuck me over and over again,” I replied, feeling hot and flushed just at the thought of it.“That’s right beautiful girl. That’s exactly what I’m going to do to you.” He looked around for a moment, “Where is your bedroom Lovely?”' Forced to Please' is the final part of the ‘ Forced to Comply ’ erotic bondage story.It includes XXX adult situations such as tied up sex, handcuffs, bondage and domination, being tied to the bed, blindfolded sex, and explicit sex with a cop.If you are into tied up stories, you should scroll up and get 'Forced to Please' today!",
  "genres": [],
  "author": "Natasha Stories",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/19048750-forced-to-please"
}