{
  "title": "Faith Works: How to Live Your Beliefs and Ignite Positive Social Change",
  "description": "Today more than ever, many people are hungry for spirituality and community. But the most powerful and meaningful spirituality shows itself through action. Jim Wallis is the charismatic preacher, activist, and leader of Call to Renewal, a dynamic new movement that is uniting politics and spirituality to ignite social change and overcome poverty. In his timely, exciting new book, he shows us how we can enrich our own lives by serving our communities. Wallis believes that the making of the modern Christian, Muslim, or Jew is through action. A preacher who spends his time working for justice rather than just speaking from a pulpit, Wallis compellingly demonstrates how going out and putting your belief to work is what really counts. Faith shows itself in works—faith works.Named by Time magazine as one of the \"50 Faces for America's Future,\" a regular contributor to NPR, MSNBC, and major newspapers, and editor in chief of Sojourners magazine, Jim Wallis is a well-known media figure. His advice is increasingly sought by leading politicians who want to tap into the growing power of faith-based organizations and the Call to Renewal movement. A lifelong activist, he has been putting his faith to work for more than three decades. His anecdotal, exhilarating, and engaging book is part memoir, part inspirational game plan for transforming our own lives and our society, and part primer on how faith communities are changing neighborhoods. It is filled with dramatic human stories of men and women who will move and inspire us. Faith Works will appeal to religious people looking to bring more meaning to their faith and to spiritually hungry people looking for direction in their lives.",
  "genres": [
    "Religion",
    "Christianity",
    "Nonfiction",
    "Christian",
    "Faith",
    "Spirituality",
    "Christian Living"
  ],
  "author": "Jim Wallis",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/190517.Faith_Works"
}