{
  "title": "The Victors : Eisenhower and His Boys: The Men of World War II",
  "description": "From America’s preeminent military historian, Stephen E. Ambrose, comes the definitive telling of the war in Europe, from D-Day, June 6, 1944, to the end, eleven months later, on May 7, 1945.This authoritative narrative account is drawn by the author himself from his five acclaimed books about that conflict, most particularly from the definitive and comprehensive D-Day and Citizen Soldiers, about which the great Civil War historian James McPherson wrote, “If there is a better book about the experience of GIs who fought in Europe during World War II, I have not read it. Citizen Soldiers captures the fear and exhilaration of combat, the hunger and cold and filth of the foxholes, the small intense world of the individual rifleman as well as the big picture of the European theater in a manner that grips the reader and will not let him go. No one who has not been there can understand what combat is like but Stephen Ambrose brings us closer to an understanding than any other historian has done.”The Victors also includes stories of individual battles, raids, acts of courage and suffering from Pegasus Bridge, an account of the first engagement of D-Day, when a detachment of British airborne troops stormed the German defense forces and paved the way for the Allied invasion; and from Band of Brothers, an account of an American rifle company from the 506th Parachute Infantry Regiment who fought, died, and conquered, from Utah Beach through the Bulge and on to Hitter's Eagle’s Nest in Germany.Stephen Ambrose is also the author of Eisenhower, the greatest work on Dwight Eisenhower, and one of the editors of the Supreme Allied Commander's papers. He describes the momentous decisions about how and where the war was fought, and about the strategies and conduct of the generals and officers who led the invasion and the bloody drive across Europe to Berlin.But, as always with Stephen E. Ambrose, it is the ranks, the ordinary boys and men, who command his attention and his awe. The Victors tells their stories, how citizens became soldiers in the best army in the world. Ambrose draws on thousands of interviews and oral histories from government and private archives, from the high command—Eisenhower, Bradley, Patton—on down through officers and enlisted men, to re-create the last year of the Second World War when the Allied soldiers pushed the Germans out of France, chased them across Germany, and destroyed the Nazi regime.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Military Fiction",
    "Military History",
    "American History"
  ],
  "author": "Stephen E. Ambrose",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/190509.The_Victors_"
}