{
  "title": "سيزيرين",
  "description": "الآن طبعة جديدة هي الاولى مع دار \"دون للنشر\" بغلاف جديد و بمقدمة من الكاتب الكبير الدكتور محمد المخزنجي......يحكي العمل قصة سنوات النيابة والتدريب في حياة الطبيب\" كريم رأفت \"، وهو طبيب مقيم بقسم أمراض النساء والتوليد بإحدي المستشفيات الجامعية بمدينة عربية ما . ويدور العمل في ثلاثة فصول يمثل كل فصل عاماً من اعوام التدريب الثلاث التي يخوضها الطبيب. كل فصل يتكون من ١٥ قصة تناقش قضية معينة ، وبين كل قصة وقصة هناك قصة واحدة طويلة مستمرة علي شكل حلقات بطول الفصل تكون العمود الفقري للفصل. في الفصل الاول ، يبدأ الطبيب تدريبه مع طبيبتين ، الرئيسة الدكتورة ليلي طبيبه ذات همة وضمير ، لكن الاخري الدكتورة وفاء مهملة لعملها لانها ترتكن الي نفوذ احد رجال السلطة في المدينة ، ويكون نتاج هذا ان يوضع الدكتور كريم في مواقف كثيرة بلا ارشاد ولا توجيه حقيقي . من خلال القصص يتعرض هذا الفصل لقضايا فساد المستشفيات الحكومية والشهادات المرضية المزيفة وخرافات الطفل الكامن و علاج العقم باستخدام قطعة الصوف المشبعة بالحيوانات المنوية و تحمية الطلق أثناء الولادة ، ويناقش قضية ختان الاناث وعلاج أورام الرحم الليفية وجراحات استئصال الرحم وحالات الاجهاض المتكرر والمناظير التشخيصية لاسباب العقم و وسائل منع الحمل وتكرار المعاشرة الزوجية في الوطن العربي ، وكذلك علاقات الطبيب بالمريضات والاساتذة والتمريض. أما قصة الفصل المطولة “مريم وعمر” فهي عن الحب بين طبيبين من أطباء الامتياز والعوائق التي تعترض حبهما هذا. في الفصل الثاني ، يعمل الطبيب كريم رأفت تحت اشراف نائب اقدم مصاب بدآء العظمة ، ثم الدكتورة سعدية مسعود أسعد السعد المصابة برهاب الخوف من تحمل المسئولية كنائبة أصغر. يتعرض الفصل لقضايا الامراض النفسية التي قد تصيب البعض في عملهم ولكن تمضي دون تشخيص و تبلد مشاعر بعض الاطباء مع طول الممارسة. و يناقش الفصل ايضا و السمعة السيئة للتمريض المفترى عليه في عالمنا العربي وحقوق المرضي في معرفة تفاصيل مرضهم و فساد بعض شركات الدواء برشوة بعض الاطباء لزيادة مبيعاتها . كما يتعرض الفصل لقضية التعقيم المفقود في غرف العمليات واهمال الاطباء انفسهم في شأنه، وكذلك الاجهاض العمدي ورأي الدين والقانون فيه وابواب الفساد فيه،ثم علاج العقم بالتبني او باساليب غير تقليدية مثل التبرع بالامشاج او الاجنة او تأجير الارحام ،وايضا مشاكل ليلة الدخلة والعقاقير المنشطة جنسيا وقضية الخيانة الزوجية و الممارسات الطبية الخاطئة اثناء الولادة. أما قصة الفصل المطولة \" مدام سونيا” فتحكي عن مافيا الخيوط الجراحية والمضادات الحيوية في المستشفيات الحكومية. في الفصل الثالث ، يصبح الدكتور كريم رأفت هو النائب المسئول عن العنبر وتحت يده نائبين ، سعدية مسعود اسعد السعد وبالمخالفة لكل قواعد التوزيع والتجديد تستمر معه للعام الثاني علي التوالي لتضيف كثير من المشاكل الي عمله ، ثم نائب جديد “عيلاء فراولة” صاحب الحلول العبقرية ومدمن البيض البرشط وهو شخصية به الكثير من الهزل والمرح. يتعرض الفصل لقضايا معاملة المرضي وعلاج المواقف التي تنتج من جهل بعضهم الشديد ، ثم قضايا الزواج الغير شرعي المنتشر من زواج الكاسيت والمحمول والدم و قضية الزواج العرفي وموقف الدين والقانون منه وغياب الرقابة علي عمليات ترقيع غشاء البكارة. ومن القضايا التي يناقشها الفصل الفساد في مجال البحث العلمي والتزوير في البحوث العلمية ، وكذلك استغلال الاساتدة للاطباء الشبان وتسخيرهم للمصالح الشخصية بعيداً عن العمل ، وفوضى الامتحانات الجامعية في كليات الطب وما يشوبها من محاباة وفساد وطائفية وانتقام، ثم الفساد في التعيينات في سلك اعضاء هيئة التدريس ، و فساد العلاج المجاني المدفوع في المستشفيات الحكومية المجانية ومافيا مراكز اطفال الانابيب والفساد في مجال علاج العقم يناقش الفصل ايضا قضية عمل الذكور كأطباء نساء وتوليد وراي الدين فيها وخداع البعض باستغلال اناث كواجهة للعمل ، وكذلك فساد بعض اطباء الامتياز وانحرافهم نتيجة سوء رواتبهم ، والفساد السياسي في هدم المستشفيات للفوز بأصولها. أما قصة الفصل الثالث الممتدة “ القضبان الباردة “ ، فتحكي عن قصة غريبة جرت في السجون من خلال قصة عيادة امراض نساء وتوليد في سجن المدينة.",
  "genres": [
    "Novels",
    "Fiction",
    "Medicine",
    "Literature"
  ],
  "author": "Khaled Zohni",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/19042398"
}