{
  "title": "The Princes in the Tower : Cold Case Re-opened",
  "description": "For centuries one great historical mystery has been capturing the imaginations of the world – the fate of the Princes in the Tower.  Shakespeare casts Richard III as the ultimate villain, murdering his nephews in order to usurp the throne. This has always been the traditional view. In recent years alternative theories have been suggested that let Richard off the hook and lay the blame elsewhere. However, with the recent discovery of Richard’s body in Leicester a whole new wave of interest has been stirred in all things related to Richard III. Was he really the child killer portrayed by Thomas More and William Shakespeare?  In this short book a retired detective reopens this cold case and attempts to piece together the evidence and answer the great mystery about what did happen to the Princes.  Were they really murdered? If so, what happened to the bodies and who did the evil deed? Or were they left unharmed and left to live out their days in peace? Was a changeling offered up in place of Richard, Duke of York by Elizabeth Woodville and was that why Henry VII was so concerned by Perkin Warbeck?  As the author delves deeper into the evidence he finds intriguing facts including doubts about dental evidence used to determine the ages of the skeletons found in the Tower of London, the fact that skeletons were abandoned for years in the Tower after discovery and details of two mysterious coffins buried at Windsor.  In addition, he highlights the key suspect that no historian seems to even contemplate could be responsible for the Princes' disappearance.  Finally he gathers the suspects in one room to reveal what he believes really happened. The question is, do you agree?",
  "genres": [
    "History",
    "Nonfiction",
    "Crime",
    "True Crime",
    "Medieval",
    "Historical",
    "Tudor Period"
  ],
  "author": "Mark Garber",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/19055218-the-princes-in-the-tower"
}