{
  "title": "Menschensöhne",
  "description": "Zwei kurz aufeinander folgende Todesfälle beschäftigen die Mordkommission Reykjaviks unter Kommissar Erlendur Sveinsson: Der pensionierte Lehrer Halldór Svavarsson stirbt in den Flammen, die sein kleines Holzhaus vernichtet haben. Dabei deuten alle Spuren darauf hin, dass er Opfer eines brutalen Mordes wurde. Etwa zur gleichen Zeit begeht der Patient einer Nervenklinik Selbstmord: Daníel, der sich seit mehr als fünfundzwanzig Jahren in psychiatrischer Behandlung befand, war ein ehemaliger Schüler Svavarssons.  In Menschensöhne ermittelt der isländische Kommissar Erlendur Sveinsson in seinem ersten Fall, der weit in die Vergangenheit zurückreicht. Wie beide Todesfälle zusammenhängen und wie es zu erklären ist, dass fast alle Schüler einer früheren Klasse Svavarssons unter mysteriösen Umständen ums Leben gekommen sind, darauf stößt der Polizist erst durch die Hilfe von Pálmi, dem Bruder von Daníel. Doch Pálmi sucht gleichzeitig auf eigene Faust nach den Hintergründen und Hintermännern der mysteriösen Geschichte und begibt sich damit in große Gefahr ...  Eines steht nach dem insgesamt fünften von Arnaldur Indridason auf Deutsch erschienenen Kriminalromanen fest: Das ist Pflichtlektüre für alle Island-Reisende! Erzählerisch eindrucksvoll dringt der Autor tief in die Zerrissenheit des kleinen isländischen Inselvolks ein. Indridasons Geschichten beschreiben zerstörte Existenzen und ihre Verzweiflungstaten. Und fast immer erzählt er gleichzeitig Familiengeschichten, die meist tragisch enden oder die eine dunkle Vergangenheit verborgen halten. Selbst sein Kommissar Sveinsson leidet unter seiner Beziehungslosigkeit und einer gescheiterten Ehe, von der ihm nur eine drogensüchtige und rebellische Tochter geblieben ist.  Arnaldur Indridason stößt wie einst Georges Simenon in seinen Krimis zu einem existenziellen Kern vor. Gute Kriminalromane zeichnen sich vor allem dadurch aus, wie sie Menschen in Grenzsituationen darstellen. Nun erscheinen Indridassons Darstellungen des Lebens auf Island schon selbst als Grenzsituation. Doch Menschensöhne ist überdies eine Geschichte von der Arroganz und Skrupellosigkeit der Mächtigen, die schonungslos dargestellt und in ihrer Unmenschlichkeit entlarvt wird. Indridason zaubert vor diesem Hintergrund zwar letzten Endes eine teilweise unglaubwürdige Geschichte aus dem Hut, dennoch schaudert einem vor dem Zynismus und der Unbelehrbarkeit der Herrschenden, die er mit seiner Parabel entlarvt. -- Christian Koch",
  "genres": [
    "Crime",
    "Thriller",
    "Fiction",
    "Mystery",
    "Detective",
    "Audiobook",
    "Scandinavian Literature"
  ],
  "author": "Arnaldur Indriðason",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/1905888.Menschens_hne"
}