{
  "title": "All Fall Down (Hostage Negotiation Team #1)",
  "description": "When terrorists take Navy SEAL Rafe Kelly's brother, he'll do anything to get him back, but will beautiful hostage negotiator Claire get caught in the crossfire?Ring around the rosy, a pocket full of posies, ashes, ashes we all fall down . . .That simple rhyme turns negotiator Claire Michaels' current hostage situation into an international incident. Claire just wants to help get everyone out safely, but as the crisis escalates she realizes she's dealing with an al-Qaeda operative who has the means to become another bin Laden---with the potential to attack America. Claire has her own personal reasons for wanting to stop al-Qaeda, but time is slipping away as negotiations break down. Can she overcome her scars of the past in order to get the hostage out alive and possibly stop an assault on U.S.national security?Navy SEAL Rafe Kelly is on leave to recover from a knee injury he suffered during his tour in Afghanistan and he doesn't expect to be fighting terrorists on his home turf. But when he is taken hostage and his brother is kidnapped, Rafe teams up with a hostage negotiator in order to stay alive and get his brother back. The terrorist is always one step ahead of them, however, and the situation quickly turns from desperate to deadly. Will Rafe be able to save himself and his country without anyone he loves getting caught in the crossfire?#1 Amazon Bestseller for Action Adventure/Romance**RONE Award Winner for Best Suspense**Other books in the Hostage Negotiation Team Fall Down (Hostage Negotiation Team #1)Falling Slowly (Hostage Negotiation Team #1.5)Ashes Ashes (Hostage Negotiation Team #2)From the Ashes (Hostage Negotiation Team #2.5)Pocket Full of Posies (Hostage Negotiation Team #3)Forget Me Not (Hostage Negotiation Team #3.5)Ring Around the Rosie (Hostage Negotiation Team #4)",
  "genres": [
    "Romance",
    "Suspense",
    "Romantic Suspense",
    "Military Fiction",
    "Thriller",
    "Amazon",
    "Contemporary"
  ],
  "author": "Julie Coulter Bellon",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/19059348-all-fall-down-hostage-negotiation-team-1"
}