{
  "title": "Fractured",
  "description": "What would you do if life gave you a second chance? The night of the accident changed everything... Now, five years on, Rachel's life is crumbling. She lives alone in a tiny flat, working in a dead-end job, desperate with guilt over her best friend's death.She would give anything to turn back the clock. But life doesn't work like that... Does it? The night of the accident was a lucky escape... Now, five years on, Rachel's life is perfect. She has a wonderful fiancé, loving family and friends around her, and the career she always wanted. But why can't Rachel shake the memory of a very different life? Gripping, romantic and heartbreaking, Fractured is a magical love story, set at Christmas, that can two different stories lead to the same happy ending? Reviews for Dani 'A captivating story which packs an emotional punch' Heidi Swain. 'A true love story, written by a mother's heart' Milly Johnson. 'Emotionally intelligent, absorbingly rich... Atkins is a brilliant writer who has created wonderful characters' Daily Mail. 'Powerful. Ruthlessly honest. Hauntingly moving. The characters ripped my heart wide open in this beautiful story about love and loss and heart-rending choices. Dani Atkins does not shy away from asking tough questions, and her answers are ones that will make you weep. Intense and emotional, I loved every moment of it' Kate Furnivall. 'A stunning, heartfelt story of fierce maternal love, sacrifice and second chances' Alice Peterson. 'A beautifully told story about a careless mistake that changes the lives of everyone involved... Deeply moving' Ella Harper. 'A gorgeous story with a perfect ending... Heart-breaking' Faith Hogan. 'A breathless read of hope and resilience... You'll never forget it' Penny Parkes.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Drama",
    "Roman",
    "Contemporary Romance"
  ],
  "author": "Dani Atkins",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/19061544-fractured"
}