{
  "title": "Listen Again: A Momentary History of Pop Music",
  "description": "Arguing that pop music turns on moments rather than movements, the essays in Listen Again pinpoint magic moments from a century of pop eclecticism, looking at artists who fall between genre lines, songs that sponge up influences from everywhere, and studio accidents with unforeseen consequences. Listen Again collects some of the finest presentations from the celebrated Experience Music Project Pop Conference, where journalists, musicians, academics, and other culturemongers come together once each year to stretch the boundaries of pop music culture, criticism, and scholarship. Building a history of pop music out of unexpected instances, critics and musicians delve into topics from the early-twentieth-century black performer Bert Williams’s use of blackface, to the invention of the Delta blues category by a forgotten record collector named James McKune, to an ER cast member’s performance as the Germs’ front man Darby Crash at a Germs reunion show. Cuban music historian Ned Sublette zeroes in on the signature riff of the garage-band staple “Louie, Louie.” David Thomas of the pioneering punk band Pere Ubu honors one of his Ghoulardi, a late-night monster-movie host on Cleveland-area TV in the 1960s. Benjamin Melendez discusses playing in a band, the Ghetto Brothers, that Latinized the Beatles, while leading a South Bronx gang, also called the Ghetto Brothers. Michaelangelo Matos traces the lineage of the hip-hop sample “Apache” to a Burt Lancaster film. Whether reflecting on the ringing freedom of an E chord or the significance of Bill Tate, who performed once in 1981 as Buddy Holocaust and was never heard from again, the essays reveal why Robert Christgau, a founder of rock criticism, has called the EMP Pop Conference “the best thing that’s ever happened to serious consideration of pop music.” Contributors . David Brackett, Franklin Bruno, Daphne Carr, Henry Chalfant, Jeff Chang, Drew Daniel, Robert Fink, Holly George-Warren, Lavinia Greenlaw, Marybeth Hamilton, Jason King, Josh Kun, W. T. Lhamon, Jr., Greil Marcus, Michaelangelo Matos, Benjamin Melendez, Mark Anthony Neal, Ned Sublette, David Thomas, Steve Waksman, Eric Weisbard",
  "genres": [
    "Music"
  ],
  "author": "Eric Weisbard",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/1906249.Listen_Again"
}