{
  "title": "Special Agent: My Life On the Front Lines as a Woman in the FBI",
  "description": "Candice DeLong has been called a real-life Clarice Starling and a female Donnie Brasco. She has been on the front lines of some of the FBIs most gripping and memorable cases, including being chosen as one of the three agents to carry out the manhunt for the Unabomber in Lincoln, Montana. She has tailed terrorists, gone undercover as a gangsters moll, and posed as the madam for a call-girl ring. Now for the first time she reveals the dangers and rewards of being a woman on the front lines of the worlds most powerful law enforcement agency. She traces the unusual career path that led her to crime fighting, and recounts the incredible obstacles she faced as a woman and as a fledgling agent. She takes readers step by step through the profiling process and shows how she helped solve a number of incredible cases. The story of her role as a lead investigator on the notorious Tylenol Murderer case is particularly compelling. Finally, she gives the true, insiders story behind the investigation that led to the arrest of the Unabomberincluding information that the media cant or wont reveal. A remarkable portrait of courage and grace under fire, Special Agent offers a missing chapter to the annals of law enforcement and a dramatic and often funny portrait of an extraordinary woman who has dedicated her heart and soul to the crusade against crime.Candice DeLongs Top Cases: 1. TYMURS-(Bureau acronym for Tylenol Murders)8 victims, 1982. 2. F.A.L.N. Terrorist Organization, 198184. 3. Melissa Ackerman kidnap/rape/murder, 1986Serial child killer Brian Dugan (Illinois). Brian Dugan was the most prolific serial killer Illinois had ever encountered. 4. The Burlington Rapist (Illinois serial rapist), 1984. 5. The Lecherous Landlord was the first and most significant Discrimination in Housing case in the history of the Chicago FBI. 6. Undercover work on UNABOM, including an afternoon with Ted Kaczynski on his arrest day, April 3, 1996.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Biography",
    "Crime",
    "Memoir",
    "History",
    "Audiobook"
  ],
  "author": "Candice Delong",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/190619.Special_Agent"
}