{
  "title": "Erotica Box Set (Hardcore Hookups) 6 Pack",
  "description": "**Warning: Contains pages and pages of hot cheating couples, Sex with strangers, college sex, BBW, Interracial Sex, Fantasy Sex and passionate romance.** **Intended For Mature Audiences. Over 18 only  Deep In The Woods Two couples go on a hike during an unexpected cold weekend in the Big Bear mountains. However, when the two couples end up paired with their friends mate, the increasingly cold conditions call for desperate measures to keep warm- with body heat being their saving grace once they find themselves lost deep in the woods.  Happy Thoughts  A Single woman discovers that she doesn't have to settle for low life men only out for one thing, when she's got a leg-quivering memory that lasts a lifetime. However, memories can only do so much and Linda decides to step back out into an arena that may get her more than she bargained for.  Hide and Get It The power goes out in a hotel during a high school reunion, and a group of classmates decide to play an old game- “Hide-n-go get it.” That was the game they played in high school, at night when the school was closed and all was dark. The object of the game, whoever found a guy or girl hiding first, got to do or request what they wanted from the person they found- sexually.  Fairy Tail A woman's dreams place her in a fantasy world where dwarf-like men and women freely fuck and live in the nude daily. However, in order for the woman to return back to reality and be free from future fairyland dreams, she must have sex with at least one man in fairlyland.  Stranded Desires After several lonely days of living in a hotel following a divorce, a man's temptations get the best of him following a conversation with the help. Dan's wife was a sexy doctor, yet something about her changed amid the rumor at school which cost him his job. Shortly after, the single life started getting to him in the hardest ways, and it seemed like his desires would never be met- until his rescue arrived.  Spring Break Two strangers mistakenly get booked in the last one bedroom condo during Spring Break.",
  "genres": [],
  "author": "Jennifer Key",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/19064057-erotica-box-set-hardcore-hookups-6-pack"
}