{
  "title": "Undercurrents",
  "description": "Trade paperback original, and #2 in the science fiction adventure Orphan’s Legacy series, a saga of spy games and military action on an interplanetary scale. Ace intelligence operative Lt. Jazen Parker must take out a Nazi-like regime on a quarantined space habitat where he’s limited to a War War II technological level and his own smarts, grit and determination.#2 in the hard-hitting military science fiction Orphan’s Legacy series. Ace intelligence operative Lt. Jazen Parker parachutes into Tressel, a planet which resembles Earth in its Paleozoic era, on a mission to bring down the local politicos. He quickly realizes he’s been handed a near-impossible task. Tressel is a politically-quarantined nightmare world with a culture confined to iron rivet technology and a ruling regime a bit to the right of Heinrich Himmler. Jazen’s inclined to abandon this particular hellhole to its ways--that is, until he uncovers a plot afoot that will throw a five hundred-planet alliance into the death-throes of anarchy.So the local Nazis must go. Unfortunately, all Jazen’s got to work with is a handful of rust-bucket tanks, a retread rebellion, and two strong, beautiful women who love him, but think he’s tilting at windmills and is about to get himself killed. What they don’t know is, once committed, Jazen Parker is the best there is when it comes to getting the dirty job done on the ground. It’s the local bullies who are about to be taught a lesson in losing.About Robert “Buettner goes well beyond . . . military science fiction . . . he understands . . . living as a soldier — the boredom punctuated by terror, the constant anxiety and self-doubt, the random chaos that battle always is, and the emotional glue that holds together people who may have nothing in common except absolute responsibility for one another's lives.” —Joe Haldeman, Hugo and Nebula Award-winning author“[O]nce in a while . . . a contemporary author penetrates to the heart of Heinlein's vision . . . to replicate the master's effects. . . . [O]ne such book [is] Robert Buettner's Orphanage .” — The Washington Post“Buettner shows the Heinlein touch.” — Denver Post",
  "genres": [
    "Science Fiction",
    "Military Science Fiction",
    "Fiction",
    "Adventure",
    "Action",
    "Space Opera"
  ],
  "author": "Robert Buettner",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/11060000-undercurrents"
}