{
  "title": "Heaven is Real, Heaven Exists; Proof of Life-after Death; Real stories of Near-death experiences.",
  "description": "Heaven is Real, Heaven Exists; Proof of Life-after Death; Real stories of Near-death experiences.Excerpts;“Words cannot describe the beauty of Heaven. There we find so much peace and happiness.”“All is indescribable beauty.” “There was the most wonderful feeling of bliss. I can only describe it as ecstasy.”Heaven is Real, Heaven exists; Proof of life after death, with real stories of Near-death experiences, true stories of what happens after death.Is Heaven real? This book provides real evidence, from expert research studies of Near-death experiences; true accounts from Doctors of their own Near-death experiences; and the many true stories of real people’s experiences of going to Heaven. Here is the documented proof that Heaven is real and Heaven exists.With remarkable similarity in accounts, the book describes the many true after-death experiences of ordinary people; from Pastors to atheists, children to adults, soldiers to housewives, we find out just what Heaven is like.Says researcher Dr Penny Sartori, many people described ‘travelling through a tunnel, towards a bright light where they saw relatives beckoning them, finding themselves in a beautiful landscape with lush green grass and beautiful flowers. ‘ She says, “Nearly all those who have had NDE’s tell me they no longer fear death, in fact, because of what happened, they are happy to go.”Dr Heidi Horsley writes, after her own NDE, “As I moved toward the light, I had the most euphoric feeling of love and inner peace that I’d ever experienced. It was a place I never wanted to leave.”Gillian MacKenzie, a housewife, describes, “I felt no fear as I went into the tunnel and emerged into the brilliance. There was the most wonderful feeling of bliss. I can only describe it as ecstasy.”Rose Marie Richter, describes, “It was all in a golden, warm loving light..it was full of leaves , flowers, birds, and everything was so colourful...I’ve never been that peaceful and that content and felt so loved.Daniel Ekechukwu writes, “Everything seems to be golden and transparently shining, even the most beautiful flowers. All is indescribable beauty.Crystal McVea, says of her experience, “I had angels, I had God, I fell to my knees in front of him.”True Stories of Near-death experiences.Heaven is for real. True stories of those who went to Heaven and back.Heaven is Real, Heaven Exists; Proof of Life-after Death; Real stories of Near-death experiences. (Book 1)Near Death Experiences; True stories of Near-Death Experiences told by real people. True stories of those who went to Heaven. (Book 2)True Stories of Near-Death Experiences and Afterlife Communication. Heaven is Real; Heaven Exists; Evidence of Life After Death, Proof of the Afterlife. (Heaven is Real; Heaven Exists.) (book 3) After-life Communication. True Stories of After-life Communication. Messages from Heaven. (book 4)Heaven is for real, heaven exists; from those who went to heaven and back, true stories.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Tessy Rawlins",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/19052823-heaven-is-real-heaven-exists-proof-of-life-after-death-real-stories-o"
}