{
  "title": "Wraiths of the Broken Land",
  "description": "Soon to be a major motion picture...the horror western that was considered too epic for the big screen!. A brutal and unflinching tale that takes many of its cues from both cinema and pulp horror, Wraiths of the Broken Land is like no Western you’ve ever seen or read. Desperate to reclaim two kidnapped sisters who were forced into prostitution, the Plugfords storm across the badlands and blast their way through Hell. This gritty, character-driven piece will have you by the throat from the very first page and drag you across sharp rocks for its unrelenting duration. Prepare yourself for a savage Western experience that combines elements of Horror, Noir and Asian ultra-violence. You’ve been warned. Zahler’s debut western novel, A Congregation of Jackals, was nominated for both The Peacemaker award by the Western Fictioneers and The Spur award by the Western Writers of America. Wraiths of the Broken Land promises to be the benchmark for gritty westerns. Zahler has been spearheading the genre's recent surge of popularity, but others quickly joined in to push mainstream penetration for dark Bone Tomahawk written and directed by S. Craig Zahler was quickly followed by The Revenant and Quentin Tarantino's The Hateful Eight, after which Westworld and The Dark Tower entered production, culminating with 20th Century Fox deciding to make Wraiths... their followup to The Martian. The Martian was Fox's top grossing film in 2015, and brutal westerns are currently the hottest emerging genre, so they are reuniting the team of Ridley Scott (director), Drew Goddard (screenwriter), and Aditya Sood, Simon Kinberg, and Michael Schaefer (producers) to bring a story this overwhelming to film. During his interview with Ain’t It Cool News Zahler revealed the impact Wraiths of the Broken Land has already had on “…I had a meeting with him and my agent and they said, ‘Could you do a low budget western?’ I said, ‘Something to pay for out of pocket? I don't think so.' Dallas said, ‘Could you do Wraiths of the Broken Land,’ which is my second western novel and it's incredibly nasty. Like Bone Tomahawk times 10. They asked if I could do that as a movie. I said no, because the story's too long. It would be four movies or a television show. But I said I could write another story that is a rescue/men-on-a-mission sort of thing and that's where Bone Tomahawk came from.” Bone Tomahawk went on to have six award wins and twenty nominations from film festivals and associations. Combined with the film’s popularity as part of Amazon Prime Video it became one of the breakout independent films of 2015. Now take all the accolades for interesting characters and dialogue with shocking violence and imagine them, as Zahler said above, TIMES TEN in Wraiths of the Broken Land. In the tradition of many weird westerns you will be taken to unexpected, unforgettable places.",
  "genres": [
    "Westerns",
    "Horror",
    "Fiction",
    "Historical Fiction",
    "Thriller",
    "Novels",
    "Action"
  ],
  "author": "S. Craig Zahler",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/19073003-wraiths-of-the-broken-land"
}