{
  "title": "Great Political Wit",
  "description": "Famous for his delectably dry humor, Senator Bob Dole brings us the ultimate bipartisan some of his favorite witticisms, hilarious remarks, and wry observations of the great political figures of this century.Bob Dole's political career may not have taken him to the White House, but he did pick up some great stories along the way. In this delightful collection, the longtime United States senator shares his favorite anecdotes, witticisms, and reminiscences.From the campaign trail to the Oval Office, from smoked-filled rooms to the chambers of the Capitol, Bob Dole surveys a century of political wit. There are bon mots from Calvin Coolidge, Winston Churchill, Harry Truman, John F.  Kennedy, and a host of other political figures. Bob Dole introduces each section with mirthful moments from his own experience, displaying the gift for wry humor that has made him such a favorite guest on late-night talk shows.A jovial--and completely bipartisan--compendium, Great Political Wit is a connoisseur's selection of political repartee at its best.Great Political Wit will have readers rolling on both sides of the aisle.Bob Dole is recognized as one of the nation's most prominent political figures of the twentieth century. Known for his effectiveness as a consensus builder in his thirty-five years in Congress, Senator Dole was the longest-serving Republican leader in Senate history. He was also chairman of the Republican National Committee, the 1976 Republican nominee for vice president, and the 1996 Republican nominee for president. He is currently serving as the chairman of the World War II Memorial campaign and as chairman of the International Commission on Missing Persons in Bosnia. Wounded in World War II, Senator Dole was awarded two Purple Hearts and a Bronze Star. He is married to Elizabeth Hanford Dole, president of the American Red Cross, and lives in Washington, D.C.",
  "genres": [
    "Humor",
    "Politics",
    "Nonfiction",
    "History",
    "Biography",
    "Collections"
  ],
  "author": "Bob Dole",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/1906983.Great_Political_Wit"
}