{
  "title": "The Queen's Curse",
  "description": "ASIN B00CMEQD30 moved to the more recent edition4th Edition, revised and edited by M. Jackson and C. Gough, April 2015What if a young female knight is promoted to be the Queen's bodyguard on an important mission? Why her? And what is the Queen hiding?In a country with a cursed justice system, two women; the mysterious Queen Artride and her loyal bodyguard Tirsa, set out on a secretive perilous quest. But time is against them as they only have three weeks to save Tirsa's teenage brother's life, sentenced to hanging for a petty crime.They hope to find the one person, who might just be the only person powerful enough to be able to lift the terrible curse from their land and its people. But this sorceress is said to live somewhere deep within Dochas; the strange uncharted Magical Land from where no one returns.The two women are soon drawn to each other, but can their love ever be?Struggles and questions arise as things get increasingly more difficult: can they trust one another and the magical creatures they meet who seem to have their own problems?And more so; will they ever find the evil sorceress and will she actually be willing to help them, and if so... for what price?Enter the world that is 'The Queen's Curse' and cling to Artride and Tirsa to experience a mind-blowing, heart gripping, psychological fantasy adventure where nothing is certain.\"It's a great fantasy read with a lot more depth and strengths than I had expected. Very good.\" - ChristopherFisherBooks TOP500 Reviewer\"A lyrical captivating fantasy with some beautiful imagery.\"- Rob Ross, author of Juggler's Blade\"A very traditional, spiritual romantic fantasy with strong lesbian/non violence themes\"- Matthew Graybosch, author of Without Bloodshed\"I think her imagination is wonderful and she created some truly beautiful images. She allowed things to grow and didn't rush things that needed space.\" - Erin\"This story is captivating, well written, and the author has put a lot of thought into her characters that of depth, emotions, strength, and vulnerabilities.\" - Angela Crandall\"This book is a very original lesbian fantasy read.\" - Katrina\"A well-constructed sword-and-sorcery novel. It's a worthy read for mature audiences, and fantasy buffs will find this book an enjoyable addition to their collection.\" - Programmer Cat\"The world that Natasja Hellenthal has created is very real, and carefully crafted as is Queen Artride and Tirsa's quest. I loved the developing relationship between the two. It was not rushed and occurred very naturally.\" - Shari SakuraiBest for readers above age 15",
  "genres": [
    "Fantasy",
    "Lesbian",
    "LGBT",
    "Romance",
    "Queer",
    "Lesbian Romance",
    "Adventure"
  ],
  "author": "Natasja Hellenthal",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/19066720-the-queen-s-curse"
}