{
  "title": "Beginnings",
  "description": "An ancient mystery, a lost treasure, a great secret and the search for the most sought after relics in all antiquity. This is one of the most exciting novels I've read in years.\" \"Hammott's writing is solid and the premise intriguing. An entertaining quest filled action adventure.” \"I must say I enjoyed this novel very much. If you like Clive Cussler's Dirk Pitt (His earlier novels), James Rollins or Matthew Reilly, then check it out. \"...a terrific book with a likable protagonist, skilled plotting and interesting characters. This gripping quest for lost artifacts mystery had me hooked from the first chapter.\" WARNING - You will be hooked from the first page! An exciting archaeological thriller spanning more than 2000 years. Beginning with the construction of Solomon's Temple, the Fall of Jerusalem, the creation of the Copper Scrolls and the forming of the Knights Templar and their mysterious tunnelling under the Temple Mount. The story then takes us into the trap-riddled catacombs beneath Rosslyn Chapel, on to Rennes-le-Chateau, into the Tomb and beyond. Tag In the catacombs beneath Rosslyn Chapel, one man finds a secret they have spent centuries searching for.They are coming to claim it. Back Cover A hunt for a treasure becomes a Quest for the truth. 960BC Solomon’s Temple is completed. 70AD Fall of Jerusalem and the Temple Treasure is Lost 1119AD The Knights Templar tunnel under the Temple Mount. Nine years later they find what they have been searching for and return to France. They become the richest and most powerful order the world has known. 1446 Sir William St Clair builds Rosslyn Chapel. 1891 Berenger Sauniere, a penniless priest of the small French village of Rennes-le-Château, discovers a parchment hidden in his church - it turns him into a man of great wealth. 1952 The Copper Scroll is discovered in a cave in Qumran. It is a Treasure map believed to have been written around the time Jerusalem fell. All are connected Part of a Secret buried for centuries. A secret many have been searching for without success. Ancient Families, Secret Orders, innocents wronged. All have suffered. All seek revenge. The Secret will give it to them. They just have to find something that went missing over 2000 years ago. (NEW 2019 Updated and re-editedn version uploaded 12-4-2017) BEGINNINGS is the first book of the Tomb, the Temple, the Treasure and thus continues in book 2 - The Priest's Secret.",
  "genres": [],
  "author": "Ben Hammott",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/19065526-beginnings"
}