{
  "title": "How Long Have You Really Got?",
  "description": "Jay, a 26 year old university graduate working as a grunt in an outsourced inbound call centre and going nowhere fast, has always apologised to the world for existing. With barely any social skills, too much chub round his middle and no luck with women, unless bad luck counts, Jay's life is stuck on hold and his job is hanging by a thread. If only he could sell more Wonder Product 4000s...Em, a 30 year old university graduate working as a team leader in the same company as Jay, has the life he wishes he could have. Confident, sexy and working hard on her escape plan, Em's outlook on life is to decide what she wants and go for it, whether that's her career, her sex life or her dreams. There's no time to waste in this life; how long have you really got?How Long Have You Really Got? is an adult book and is not suitable for children.Brief background: How Long Have You Really Got? is my romance book! It’s about casting off expected ‘gender norms’ because these are damaging to people. The book is about having the freedom to just be yourself and the confidence to go for what you want in this life; not be held back by the fear that people will ridicule you or judge you negatively for doing something that actually hurts nobody. What would the world be like if people just went after what they want? We all know what it’s like now, where, for the most part, we’re repressed and straight-jacketed by the raised eyebrows of people minded to be unkind to us. So this book, partly autobiographical and based on the author’s own life experiences*, shows a microcosm of its opposite – what would it be like if you did go for it? What would life be like if nobody had an opinion on what makes a man or what makes a woman? Why should gender and sexuality define people who are all mortal, all thinking and caring and needing human beings who just want to be happy, understood and loved? *N.B. The book is semi-autobiographical, but it is also heavily fictionalised; no similarities to any actual persons living or dead should be inferred.",
  "genres": [],
  "author": "Michael Pugh",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/19074560-how-long-have-you-really-got"
}