{
  "title": "Through a Tangled Wood",
  "description": "A variety of writers come together to twist traditional fairy tales into unusual and mysterious stories. From Beauty and the Beast, to Hansel and Gretel, to the Ugly Duckling, these stories will be sure to pull you into a fantastical world of princes, romance, and maybe a little science fiction.\"Plan B\" by Katie French. When Nolan is selected as one of the few candidates to work in the Breeders' hospital, he thinks all his troubles are over. Now he can afford precious medicine to save his ailing father. He’s heard of the Breeders’ cruelty, of their inhuman experiments, but he’s sure they’re fabrications. Then he stumbles into the Plan B room and learns how truly awful the Breeders can be. \"Tailless\" by Ariele Sieling. A retelling of the Ugly Duckling, set on a far away planet in an unknown galaxy. While fighting a war with her people's biggest enemy, young Bode struggles to understand why she feels out of place in her community, and why she, unlike her comrades, was born without a tail.\"I Am the Maid\" by Sarah Dalton. A hostile zombie killing Maid Marian meets an ill-behaved ex-soldier Robin in this post-apocalyptic retelling of Robin Hood. When a young girl falls deathly sick, the two are forced to join forces in order to outwit the Sheriff, and the mysterious Guy Gisbon.\"Three Wishes\" by Marijon Braden. When Aladdin rubbed the magic lamp, things went pretty well for him. But a few thousand years later, the world has changed and the genie is old, cranky, and doesn't play fair. Young Alison thinks she's found the answer to all her prayers, but instead finds that having wishes come true isn't all it's cracked up to be.\"Killing Snow White\" by Jamie Campbell. A magical retelling of the story of Snow White, told entirely by the Evil Queen who supposedly tried to poison her. Think Snow White is innocent? Think again.\"A House in the Woods\" by H.S. Stone. At the conclusion of a scavenger hunt for Old World artifacts, Hansel and Gretel find themselves lost on the outskirts of the city after dark. They stumble upon a house in the nearby woods, hoping that they will find help inside, but the house's inhabitant has other ideas.“Flight” by Zoe Cannon. A retelling of Beauty and the Beast. Dragged to the palace at swordpoint, commanded to cure the cursed prince with a kiss, Lucia wants nothing more than to return to her solitary world of books and magical study. But she soon discovers that she and the prince share more in common than she could have imagined… and that the truth behind his curse could destroy—or save—them both.",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Fairy Tales",
    "Anthologies",
    "Young Adult",
    "Retellings",
    "Paranormal"
  ],
  "author": "Jamie  Campbell",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/19075064-through-a-tangled-wood"
}