{
  "title": "The Undead: Book Two, North America",
  "description": "“You don’t turn into a killing machine when it happens. It’s not like you’re Average Joe and then you see a zombie and some light comes on inside your head and all of a sudden you’re this bad-ass motherf**ker who just knows what to do. You’re still a law-abiding, tax paying schmuck who’s just seen his first, real life, honest to God zombie, and you need to change your shorts.”The sequel to The Undead: Book One, Overview looks at the worldwide RVS2 zombie pandemic as it happened in continental North America.Focusing on the emotional reality of life in the Crisis and the conditions on the ground of the new nation, United America, Book Two details the continuing survival of the Western superpower, even as it stares slow, inexorable oblivion in the face.The Undead: Book Two, North America is an adult book and is not suitable for children.Brief background: My zombie series is really about three things. Firstly, it’s about the entertainment that we derive from death, and it examines that quirk that we all have in us, somewhere. The second thing that the zombie series is about, is our reaction to calamity as a species – not calamity like World War One, something that will strain us but not wipe out the species, but rather something that threatens our very existence on this Earth. I’m not sure that we’d all run around in circles screaming and fanning ourselves with our hands, and I know that we wouldn’t just devolve into a mass of raping, killing machines that wanted to wipe each other out for a moment’s more satisfaction or comfort before the end. We’d have those people, but the most of us would be something else again. The third thing that my zombie series tries to do is to present a zombie narrative that could actually happen, to present a zombie apocalypse in as complete and realistic a way as possible. I have been a zombie fan ever since I saw my first zombie movie and so my series, The Undead books one to five are my attempt to do the zombie story justice.",
  "genres": [],
  "author": "Michael Pugh",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/19074502-the-undead"
}