{
  "title": "Seduced by Fur",
  "description": "Publisher’s Note: This book contains the following novellas: “A Little Bit of Fur,” “Piece of Tail,” and “Sexnip.” If you already own these eBooks, please do not purchase this title.  * * *  A Little Bit of Fur  Engaged to be married, full-figured Niccy has resigned herself to a lackluster marriage, both in and out of bed. Just once, though, she wants to experience passion the same way the heroine of one of her favorite books does...by being tied to the bedpost and pleasured by two men.  Finding the men isn't the problem. Neither is the fact that Ian and Chris happen to be the hottest men at Trasola. Sadly for her, they're already mated...to one another.  Will Niccy be left wanting, or will the two men find room in their hearts...and their bed...for a curvaceous woman and her premarital desire?  * * *  Piece of Tail  Gina's got a problem. Okay, she doesn't think it's a problem, but the pride that kicked her to the curb sure does. In fact, she feels purrfect in every way. With curves in all the right places and an attitude that just won't quit, Gina’s got it all. And then some. Now about her tail… In her mind, it's just an added bonus. But in the minds of the various prides, her ability to only grow a tail proves to them that she's not were enough, whereas she’s just a bit too kitty to be considered human. Good thing she's found two men who can't get enough of each other, her, and her tail.  * * *  Sexnip  After being fired, again, for her obsessive-compulsive tendencies related to cleaning, Katerina Pawslowski is on the hunt for a new job. Who knew that having good personal hygiene could be a terminable offense? Maybe keeping half a dozen containers of Clorox wipes always at hand was a bit much… As she’s searching through the paper for a job, an ad from Heart’s Haven Toys catches her eye. Lab Assistant Wanted: assistance with maintaining and cleaning the general lab area. Cleaning! It said cleaning! What better job for a feline shifter with OCD?",
  "genres": [
    "Paranormal",
    "Shapeshifters",
    "Romance"
  ],
  "author": "Celia Kyle",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/19074415-seduced-by-fur"
}