{
  "title": "Death Waltz in Vienna",
  "description": "From one of America's finest historical novelists, author also of 'Cassandra, The Most Beautiful of Priam's A Tale of Troy' Death Waltz in Vienna is a novel of both suspense and romance set in the capital of the old Austro-Hungarian Empire in the years prior to World War I. Army captain Ernst von Falkenburg has just one week to clear himself of charges of treason that will otherwise cost him his life. During this time a romance develops with a beautiful woman who not merely provides him with indispensable assistance – at the risk of her life – but who shows him for the first time that he is capable of love. The action moves across the whole panorama of early 20th century Vienna, taking the reader through elegant salons and low dives, Vienna’s most fashionable brothel and the imperial palace, and climaxes in a duel to the death and an epilogue set in Vienna’s Central Cemetery. THOMAS OCHILTREE (pronounced OH-kul-tree) was born in New York City but grew up in London and studied in the U.S. (Harvard Class of 1970). He is a retired Foreign Service Officer who served in many countries during his 22 years as a U.S. diplomat. Fluent in German, he has long been fascinated with the last years of the Austro-Hungarian Empire --- with its glittering capital Vienna --- the background against which his novel DEATH WALTZ IN VIENNA is set. In addition to devoting himself to his various literary interests, he works part time on line as a translator, translating documents from German, French, Italian and Spanish into English. He does not have a Facebook or Twitter account, but would be glad to receive or respond to any reader comments on his novel at Ochiltreeth@yahoo.com. This was his first novel. A second novel, CASSANDRA, THE MOST BEAUTIFUL OF PRIAM'S DAUGHTERS : A TALE OF TROY, was published in October 2013.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Historical Mystery",
    "Amazon",
    "Historical Romance"
  ],
  "author": "Thomas Ochiltree",
  "average_rating": "3.24",
  "url": "https://www.goodreads.com/book/show/19072354-death-waltz-in-vienna"
}