{
  "title": "Unleashed",
  "description": "Red-blooded werewolves, witchly enchantments, ghostly seductions... explicit adult fiction about things that bang and howl in the night. Eight sizzlingly sensual stories and novellas from bestselling authors of paranormal erotica.Phantom Seduction by Virginia WadeReeling from tragedy, young and talented, Christine Daaé finds herself employed in the chorus at the Paris Opera House. A dark figure draped in a black cloak visits her at night, touching her, initiating her in the ways of pleasure. But, this innocent flirtation with a dangerous monster soon turns hellishly hot, as Christine defies him and submits to a thrilling, yet shocking, form of punishment.Touched by Polly J Adams and Ruby FieldingRuth lives in the Hall with the mysterious Sisters. They have powers, and they have ways of influencing the world. They have ways of getting what they want. When Ruth sees Saul working with the stonemasons on the village church, young, stripped to the waist, fit and tanned, she knows what she wants. And she knows she can have it.The Cursed (An Erotic Adventure) by Carl EastGeraldine is a good witch. At least, she'd like to think she's a good witch. She just has a naughty side to her. She's also not like other witches, as she uses the magic of the mind instead of dark magic. She's recently found a way to get rich quick by getting paid to remove curses and is having the time of her life.Little Red and the Big Bad Wolf: A BBW Paranormal Erotic Fairy Tale by Ellen DominickScarlett's little town is being stalked by a beast. It only preys on young beautiful virgins, so she thinks her curvy body is off the menu. But when she volunteers to sacrifice herself for the sake of her town, she didn't know exactly what she signed up for. This is no ordinary wolf. Werewolf Rafe has found his mate, and he has to take her body or lose control.Bred by the Wolves by Angel WildA dark, wild night... an animal suddenly in the road and Emily swerves to avoid it, striking a tree... What was the animal, and where is it now? Was it a wolf, or... something else?Riding the Big Bad Wolf by Jade K ScottGina has been used, lied to, cheated on and abused. Her whole life, men have done nothing but hurt her, and it's just happened again. With a Red Riding Hood costume the last one in town, she almost decides not to go to the Halloween party she's been invited to, but she's determined not to let her broken heart ruin her favorite holiday. Too much alcohol and a moonlit walk in the woods lead her to meet a gorgeous guy, and he seems nice enough. But Caleb has a dark, dangerous secret, and he just may be the most dangerous guy she's ever met!The Doctor Who Became a Sex Looper by Angelina SpearsDr. Chesterton and his beautiful assistant Karen travel through time to test out their scientific discovery. But when they get stranded in the early 90s and disrupt the space-time continuum, Dr. Chesterton must convince Karen to have sex with his younger self. The fate of the world is in her hands!The Minotaur's Chattel by Alara Branwen and Christie SimsJessa had always lived in darkness, or at least it seemed like it. The only respite she had has the occasional visit from a powerful man that would come to tease and caress her nude body. But one day all that changes...",
  "genres": [],
  "author": "Polly J. Adams",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/19079718-unleashed"
}