{
  "title": "Freedom at Midnight",
  "description": "In this, the most sweeping, powerful and enthralling of their books, the authors of such worldwide best sellers as ls Paris Burning?, Or I'll Dress You in Mourning, and O Jerusalem! have re-created the majestic and tumultuous end of an era, when 400,000,000 people, one fifth of all humanity, claimed their freedom from the greatest empire history has ever known—only to find that the price of freedom was partition, war, riots and murder.Their subject is the eclipse of the British Raj and the birth of an independent India and Pakistan; the violent transformation of that fabled India—the land of maharajas with their palaces, vices, jewels and harems,-their gold-caparisoned elephants and their glittering private armies; the India of KipIing’s army, with its centuries of legendary heroism, its skirmishes along the Khyber Pass of the Northwest Frontier against the fiercest warriors on the globe, the Pathans, its young British officers commanding troops of a dozen races and religions and castes; the India of tiger hunts and pigsticking, of polo and memsahibs, of dazzling-balls and luxurious clubs; the India of astrologers and sadhus, holy men and strange customs; the India that was the heart and soul of an empire—into the new India of Gandhi and Nehru, precursor of the Third World.Their story begins in London on New Year's Day of 1947, when a black Austin brings to the door of 10 Downing Street the man Prime Minister Clement Attlee had selected for the task of cutting England's ties to her proudest possession, her Indian Raj. The choice could not have been more ironic. It fell -on Lord Louis Mountbatten, the great-grandson of Queen Victoria, the empress in whose name the empire had been assembled. The story ends just over a year later, at Allahabad, India, on February 12, 1948, as a man leans from a steam boat to pour into the Ganges the ashes of India's murdered liberator, Mahatma Gandhi. Between those dates the world had changed. An age, the Age of Imperialism, had passed and another had begun. An independent India had been born on a day cursed by the stars; the largest Moslem nation in the world, Pakistan, had come into existence; ten million people had been uprooted and perhaps a quarter of a miIIion killed in the greatest migration in history. At the center of their narrative are major figures of a Nehru, the sensitive politician who prepared for greatness as India's prime minister in a British jail; Jinnah, a Moslem who drank, ate pork and rarely entered a mosque, yet who led 45 million Moslems to nationhood, proclaiming “We shall have lndia divided or lndia destroyed\"; Mountbatten drawing up the plans for India's division, predicting as he did so that one day the Indians would “bitterly regret the decision they are about to take”; Gandhi, the gentle prophet of a revolution, who stirred the masses of the most populous area on earth without raising his voice, and humbled the British empire by refusing all nourishment except water and bicarbonate of soda.Weaving together the lives of people great and small, of statesmen, revolutionaries, politicians, ordinary men and women caught up in the triumph and tragedy of a world in upheaval, Collins and Lapierre have illuminated one of the great dramas of our time. Theirs is a book that brims over with pathos, human tragedy, heroism, excitement, conveying the fever pitch of those hot, terrible, dusty days when an age ended and the soul of a nation found utterance at last. They take the reader from the frenzied debates in the imperial grandeur of the Viceroy’s palace to villages destroyed by massacres and riots; from the sordid slums of Calcutta to the funeral ghats of the Holy City of Benares; from the palaces of bewildered maharajas to the baking roads on which millions of refugees sought a new destiny; from the garden in which Gandhi pledged a fast unto death to bring his countrymen back to reason to the bazaars in which his assassins searched for the weapons with which to kill him; from Delhi's jubilant celebrations of independence to the cruel awakening of a divided subcontinent. . . .",
  "genres": [
    "History",
    "Nonfiction",
    "India",
    "Politics",
    "Historical",
    "Pakistan",
    "Asia"
  ],
  "author": "Larry Collins",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/1106179.Freedom_at_Midnight"
}