{
  "title": "Nobodies: Modern American Slave Labor and the Dark Side of the New Global Economy",
  "description": "Most Americans would be shocked to discover that slavery still exists in the United States. Yet most of us buy goods made by people who aren’t paid for their labor–people who are trapped financially, and often physically. In Nobodies, award-winning journalist John Bowe exposes the outsourcing, corporate chicanery, immigration fraud, and sleights of hand that allow forced labor to continue in the United States while the rest of us notice nothing but the everyday low price at the checkout counter. Based on thorough and often dangerous research, exclusive interviews, and eyewitness accounts, Nobodies/i> takes you inside three illegal workplaces where employees are virtually or literally enslaved. In the fields of Immokalee, Florida, underpaid (and often unpaid) illegal immigrants pick the produce all of us consume, connected by a chain of subcontractors and divisions to such companies as PepsiCo and Tropicana. At the top of the chain are stockholders and politicians; at the bottom is a father of six, one of whose children suffers from leukemia, who entered America only to become the unpaid employee of a labor contractor nicknamed “El Diablo” for his cruelty. In Tulsa, Oklahoma, the John Pickle Company reaped profits for years making pressure tanks used by oil refineries and power plants. Feeling squeezed by foreign competition and government regulations, JPC partnered with an Indian and Kuwaiti firm to import workers from India. Under the guise of a “training program,” fifty-three workers, including college-educated Uday Ludbe, came to the United States, only to have their documents confiscated and to find themselves confined to a factory building. Pickle laid off Americans and paid the Indians three dollars an hour. Saipan, a U.S. commonwealth in the Western Pacific where the author lived for three years, has long been exempted from American immigration controls, tariffs, and federal income tax–a status quo assiduously protected by lobbyist Jack Abramoff and Congressman Tom DeLay. There, garment magnates–selling to clothing giants like the Gap and Target–live in luxury while thousands of foreign factory workers, 90 percent of them female, work sixty-hour weeks for $3.05 an hour and spend weekends trying to trade sex for green cards. The garments they make are allowed to be labeled MADE IN AMERICA.Nobodies is a vivid and powerful work of investigative reporting, but it is also a lively examination of the eternal struggle for power between free people and unfree people. Against the American landscape of shopping mall, outlet stores, and Happy Meals, Bowe reveals how humankind’s darker urges remain alive and well, lingering in the background of every transaction and how understanding them may lead to overcoming them.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Labor",
    "Economics",
    "Cultural",
    "Agriculture",
    "The United States Of America"
  ],
  "author": "John Bowe",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/1908367.Nobodies"
}