{
  "title": "The Seven Hills",
  "description": "Sequel to HANNIBAL'S CHILDREN, this alternate history follows Marcus Scipio, a brilliant young Roman from one of the oldest patrician families, and Titus Norbanus, the ambitious son of a \"new\" Roman family from Gaul, whose skillfully-orchestrated battles are earning him fame and infamy -- depending whose side you're on -- in the Senate and among the Roman people.Set over a hundred years after Hannibal defeated Rome in the Second Punic War, the exiled Romans have returned to Italy and retaken their beloved city of the seven hills. But Rome will never feel safe until Carthage is destroyed. While Norbanus, who fancies himself a new Alexander the Great, expands the Roman Empire and defeats enemies, young Scipio in Alexandria, with the backing of the Egyptian queen, invites \"philosophers\" with scientific and engineering skills to the Alexandrian Library's school to create new inventions, from submarines to telescopes to flying machines, that will transform warfare -- and the world. Sequel to the novel Library Journal called \"a well-researched and vivid alternate history of the rivalry between Rome and Carthage.\"\"Mastering the details of later republican Roman life, Roberts builds a very convincing alternate Rome, full of in triguing characters who pose readers the fun of figuring out their real-life counterparts.\"- Booklist\"{Roberts} is perfectly at home in thesprawl of ancient Rome.\"- Publishers Weeklyon HANNIBAL'S CHILDREN:\"First-rate, intriguing … John Maddox Roberts … proves that he's perfectly at home in the urban sprawl of ancient Rome … He does an admirable job of navigating through a difficult and challenging conceit, providing plenty of reflective material for history buffs while constructing an intriguing story line that pays tribute to the ingenuity of the Romans.”-Publisher’s Weekly“The author of THE KING’S GAMBIT and THE CATILINE CONSPIRACY provides a well-researched and vivid alternate history of the rivalry between Rome and Carthage.”-Library Journal “A fascinating alternate history novel … The Reader is immersed in the culture of Rome.”- Midwest Book Review\"Exciting, provocative, and entertaining … This is far and away the best book I've read by Roberts.\"- Science Fiction Chronicleon the SPQR novels:\"Wonderful … All the wild imaginative stimulation of the best detective fiction.\"- Marion Zimmer Bradley, author of The Mists ofAvalon\"Roberts deftly re-creates his ancient world, constantly re minding the reader that it was a cruel and violent place where people thought and acted a lot differently from us. A double-edged solution perfectly caps a highly entertaining story.\"- Publishers Weekly author bio:John Maddox Roberts is the author of more than 50 books in the mystery, SF and historical genres. His novel SPQR was nominated for the Edgar Award and the series is now up to 13 volumes and 13 languages. He also writes the contemporary Gabe Treloar private eye novels. He lives in Estancia, New Mexico with his wife, Beth, and an indeterminate number of cats.",
  "genres": [
    "Alternate History",
    "Historical Fiction",
    "Fiction"
  ],
  "author": "John Maddox Roberts",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/19080444-the-seven-hills"
}