{
  "title": "Serendipitously Rich: How to Get Delightfully, Delectably, Deliciously Rich (or Anything Else You Want) in 7 Ridiculously Easy Steps",
  "description": "Changing if I am rich to when I am rich has never been simpler . . . or more fun. Refreshingly original and excitingly new, Serendipitously Rich shows you how to stop struggling and how to start getting rich (and everything else you want) . . . with effortless ease and unmitigated joy.* If you've ever wished you were rich, but didn't know where to begin or what to do...then this book is for you.* If you've never wanted to be rich because you feel you are too spiritual, too creative, too aesthetically motivated, too high-minded too whatever, to care about money...then this book is for you.* If you've discovered that you do care about money, but feel guilty, embarrassed, compromised, and like you've \"sold out\" ...and you want to feel good about it, proud of it, and like you are still your genuine, authentic, uncompromised self...then this book is for you.REVIEWS“What a fresh and energizing take on creating the riches you desire. Serendipitously Rich lit a fire in me to live more, dream more, and dare more. I'm giving copies to my closest friends.” – David Finkel, Bestselling Author of The Maui Millionaires\"A Great Read!! Madeleine Kay's Serendipitously Rich provides a very simple, extremely empowering yet seemingly effortless process for getting out of your head, into your heart, and unleashing the magic within you to get whatever you want.\" – Chuck Danes, www.Abundance-and-Happiness.com“What if it really is simpler than you ever thought, easier than you ever imagined, and more fun than you ever dared dream – to get rich (or anything else you want)? Madeleine Kay shows you that this is not only true . . . but that it is so simple, you will kick yourself for not thinking of it before!” – Randy Gilbert, President and CEO of Inside Success Productions, LLCABOUT THE AUTHORMadeleine Kay takes the best of the world of spirit and the world of finances and brings them together in a way that is fun, practical, easy, natural...and ridiculously simple.Madeleine Kay is one of the most popular and unique success and prosperity coaches in the country. The Best Selling Author of Living Serendipitously, she is considered America's leading expert on serendipity and was invited to appear as a Guest Expert on the PBS special series \"Laws of Attraction.\" Profiled in both Who's Who of American Women and Who's Who in the World, \"Madeleine Kay is an expert at helping people live the life they usually only dream of,\" says Napoleon Hill Foundation Executive Director, Don Green.A former successful advertising executive, she now brings the wisdom, passion and playfulness of serendipity sprinkled with her own unique brand of practical, down-to-earth common sense to the world of money and finance to help people get rich … and everything else they want.",
  "genres": [],
  "author": "Madeleine Kay",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/19082032-serendipitously-rich"
}