{
  "title": "The Trifecta",
  "description": "Genre: Adult Contemporary Steamy Romance and Suspense  Her Power, His Shame Trilogy--The Trifecta.  ‘It wasn't his heart she was after, she wanted his soul.’  Independent and feisty Wren Poe, a self-made executive, didn’t used to take orders from anyone--especially men. Everything was on her terms in the boardroom and in the bedroom.  Though beautiful Wren may seem to have it all; success, money, power, and a quirky best friend, the one thing she didn’t have--was love. But then Wren didn’t used to be the type of woman who wanted to find love…not until the day she met Talon Greenlee that is.  Talon Greenlee; tall, dark and handsome…had secrets and pain from his past that have fueled his drive for success. As a result, his career is in high gear but yet he all of the sudden finds that he wants more. He is rich, mysterious and hot-as-hell and despite his dark past, Talon is the perfect man who wants Wren Poe.  Now that Wren and Talon have finally found each other, one particular ghost from both of their pasts has come back to haunt them. Once his intentions are finally revealed, it becomes clear that there are other forces that are hard at work to come between them. But why?  As Wren tries to sort out her feelings for her previously dead fiancee, she comes closer to losing Talon. Torn between her past and her future, it feels like a triangle that is not entirely built out of love but rather something she can’t put her finger on.  Meanwhile, Talon has his own demons to vanquish starting with his ex--April who is unstable and has set her sights back on Talon.  As they find their resolve to remain united and ignore the evil forces trying to come between them, those other forces try one last time to break them apart.  Only their love can save them now.  This book is intended for mature audiences. Suggest 18+ due to some explicit language and sexual situations.  Book One, The Breaking Book Two, Relentless Pursuit Book Three, The Trifecta",
  "genres": [],
  "author": "Adler",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/19084187-the-trifecta"
}