{
  "title": "Kyn: Marak / Vixen / Feral",
  "description": "This book contains the following novellas in the Kyn series: \"Marak\", \"Vixen\", and \"Feral\". The three books of the Kyn series now bundled together for one great price! \"Marak\" She wanted vengeance. He didn't want a wife. One bite changed everything... Maria Ravensford is a woman on a mission. A mission of vengeance. Determined to avenge the death of her young sister at the hands of Rogue vampires, the petite Dhampir takes to the streets to hunt them. Unfortunately things don't go precisely to plan and it's only the arrival of Marak, a darkly handsome Vampire Warrior, that saves her life. Trouble is, the bite that saves her life also takes her fully into the world of the Kyn... where Marak is waiting to claim her. \"Vixen\" The only vampire warrioress in existence Vixen has spent most of her life proving herself in a man's world, but she's never been able to squash some very feminine thoughts where fellow warrior Kalen is concerned. Kalen however, has sworn off love, preferring to deal in lust instead. But a passionate encounter blows their carefully constructed indifference to each other and when Vixen is kidnapped will they be prepared to make the ultimate sacrifice to give their love a chance? \"Feral\" Feral doesn't do babies. Or pixies... So when someone dumps a pixie baby of all things on his doorstep, he does the only thing he can think of. He tries to palm it off on someone else. Unfortunately his neighbour is out of town, leaving her sister, Tessa, to house-sit. Her single and disturbingly attractive sister. Which leaves Feral with a couple of problems, especially when a bunch of pixie ninja wannabe's break into the place and try to steal the baby. Does he turn his back on the pixies, a race he's always hated… or will Tessa cast her own spell on the strong, silent type Kyn Warrior?",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Vampires",
    "Romance"
  ],
  "author": "Mina Carter",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/19079653-kyn"
}