{
  "title": "What I Remember Most",
  "description": "In a new novel rich in grace, warmth, and courage, acclaimed author Cathy Lamb tells of one woman's journey of reinvention in the wake of deep betrayal.Grenadine Scotch Wild has only vague memories of the parents she last saw when she was six years old. But she's never forgotten their final, panicked words to her, urging Grenadine to run. The mystery of their disappearance is just one more frayed strand in a life that has lately begun to unravel completely. One year into her rocky marriage to Covey, a well known investor, he's arrested for fraud and embezzlement. And Grenadine, now a successful collage artist and painter, is facing jail time despite her innocence.With Covey refusing to exonerate her unless she comes back to him, Grenadine once again takes the advice given to her so long ago: she runs. Hiding out in a mountain town in central Oregon until the trial, she finds work as a bartender and as assistant to a furniture-maker who is busy rebuilding his own life. But even far from everything she knew, Grenadine is granted a rare chance, as potentially liberating as it is terrifying--to face down her past, her fears, and live a life as beautiful and colorful as one of her paintings. . .Outstanding Praise For Cathy Lamb And Her NovelsIf You Could See What I See\"Lamb's story is earnest, heartwarming and, at times, heartbreaking.\" --RT Book ReviewsThe First Day Of The Rest Of My Life\"The blending of three or more generations and the secrets they harbor keeps this story moving briskly, culminating in a satisfying ending that makes us believe that despite heartache and angst, there can be such a thing as happily ever after.\" --New York Journal of BooksSuch A Pretty Face\"Stevie's a winning heroine.\" --Publishers WeeklyHenry's SistersAn Indie Next List Notable Book\"A story of strength and reconciliation and change.\" --The Sunday Oregonian\"If you loved Terms of Endearment, the Ya Ya Sisterhood, and Steel Magnolias, you will love Henry's Sisters. Cathy Lamb just keeps getting better and better.\" --The Three Tomatoes Book ClubThe Last Time I Was Me\"Charming.\" --Publishers WeeklyJulia's Chocolates\"Julia's Chocolates is wise, tender, and very funny. In Julia Bennett, Cathy Lamb has created a deeply wonderful character, brave and true. I loved this beguiling novel about love, friendship and the enchantment of really good chocolate.\" --Luanne Rice, New York Times bestselling author",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Womens Fiction",
    "Romance",
    "Book Club",
    "Contemporary",
    "Mystery"
  ],
  "author": "Cathy  Lamb",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/19083246-what-i-remember-most"
}