{
  "title": "Van Gogh Today: Short Stories about Vincent van Gogh",
  "description": "How Van Gogh still touches our daily livesRefreshingly different!Van Gogh's life and work continue to be relevant, generation after generation, inspiring people from all walks of life. In Van Gogh's life there is an aspect that every person living today can relate to and learn from, whether struggling or not. The artist's boundless energy and sheer determination against all odds has been a source of endless inspiration. Not only for his fellow artists, but for all of us.Van Gogh Today contains eight short stories of lives that were touched in some way or another by the artist. They are a reflection of the power of his story, and why Van Gogh remains a timeless inspiration to us all. It is an altogether new genre of books and one that gives us food for thought.The book is not about Van Gogh's paintings, but tells us about the relevance of Van Gogh's life story for seemingly ordinary a young girl, a student, a teacher, an artist, a rapper, a reverend.Van Gogh Today is number 3 of the series Secrets of Van Gogh, written by Kelly Cole Rappleye.Want to read other volumes in the series Secrets of Van Gogh?#1 The 1-Hour Van Gogh Book - Complete Van Gogh Biography for Beginners#2 Van Gogh's Inner Struggle - Life, Work and Mental Illness #3 Van Gogh Short Stories #4 Van Gogh in Love - a Romantic Van Gogh Biography#5 Van Gogh and Money - The Myth of the Poor ArtistThe 1-Hour Van Gogh Book is an accessible introduction to Van Gogh's fascinating life and work. If you want to gain a greater appreciation for one of the most fascinating artists of all time, this is the book for you. You will gain a whole new perspective on Van Gogh.Van Gogh’s Inner Struggle is a fascinating look into the life of a tortured genius. The letters vividly show the artist's life was no bed of roses. Van Gogh acknowledged that being an artist simply involved struggle, but he believed that one would benefit from adversity, both personally and professionally. \"No victory without a battle, no battle without suffering.\"Van Gogh Today - Short Stories contains eight short stories. They are a reflection of the power of Van Gogh's story, and why this artist remains a timeless inspiration to us all.Van Gogh in Love is about the artist’s longing for love and a family, exploring the lesser-known area of the his (not so!) romantic life. As can perhaps be expected from an artist like Van Gogh, his choice of women was unconventional. He favored more mature companions, and pursued relationships with women that were considered unsuitable.Van Gogh and Money focuses on the artist's financial situation, a subject never explored before. Regardless of the actual amount of money he received from his brother, it becomes clear that Van Gogh was poor in the light of his ambition.Eager to read inspiring stories on Van Gogh? Grab your copy and enjoy!",
  "genres": [],
  "author": "Kelly Cole Rappleye",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/19077825-van-gogh-today"
}