{
  "title": "A Life with Mary Shelley",
  "description": "In 1980, deconstructive and psychoanalytic literary theorist Barbara Johnson wrote an essay on Mary Shelley for a colloquium on the writings of Jacques Derrida. The essay marked the beginning of Johnson's lifelong interest in Shelley as well as her first foray into the field of \"women's studies,\" one of whose commitments was the rediscovery and analysis of works by women writers previously excluded from the academic canon. Indeed, the last book Johnson completed before her death was Mary Shelley and Her Circle, published here for the first time. Shelley was thus the subject for Johnson's beginning in feminist criticism and also for her end.It is surprising to recall that when Johnson wrote her essay, only two of Shelley's novels were in print, critics and scholars having mostly dismissed her writing as inferior and her career as a side effect of her famous husband's. Inspired by groundbreaking feminist scholarship of the seventies, Johnson came to pen yet more essays on Shelley over the course of a brilliant but tragically foreshortened career. So much of what we know and think about Mary Shelley today is due to her and a handful of scholars working just decades ago.In this volume, Judith Butler and Shoshana Felman have united all of Johnson's published and unpublished work on Shelley alongside their own new, insightful pieces of criticism and those of two other peers and fellow pioneers in feminist theory, Mary Wilson Carpenter and Cathy Caruth. The book thus evolves as a conversation amongst key scholars of shared intellectual inclinations while closing the circle on Johnson's life and her own fascination with the life and circle of another woman writer, who, of course, also happened to be the daughter of a founder of modern feminism.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Biography",
    "Memoir",
    "Academic"
  ],
  "author": "Barbara   Johnson",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/19083410-a-life-with-mary-shelley"
}