{
  "title": "Hard Time",
  "description": "In this all-new novel from the author of After Hours and Unbound, a woman with a rocky past finds romance in the last place she’d ever expect... Annie Goodhouse doesn’t need to be warned about bad boys; good sense and an abusive ex have given her plenty of reasons to play it safe. But when she steps into her new role as outreach librarian for Cousins Correctional Facility, no amount of good sense can keep her mind—or eyes—off inmate Eric Collier. Eric doesn’t claim to be innocent of the crime that landed him in prison. In fact, he’d do it again if that’s what it took to keep his family safe. Loyalty and force are what he knows. But meeting Annie makes him want to know more. When Eric begins courting Annie through letters, they embark on a reckless, secret romance—a forbidden fantasy that neither imagines could ever be real…until early parole for Eric changes everything, and forces them both to face a past they can’t forget, and a desire they can’t deny. Praise for Cara McKenna and her novels “Cara McKenna is my go-to author for gritty, hot love stories full of honest emotion.”—Victoria Dahl, USA Today bestselling author “McKenna writes dark, lush, erotic romance.”—Heroes and Heartbreakers “Sweet, smoking hot, standout erotic romance.”—Beth Kery, New York Times bestselling author Before becoming a purveyor of smart erotic romance, Cara McKenna worked as a lousy barista, a decent designer, and an over-enthusiastic penguin handler. She loves writing sexy, character-driven stories about strong-willed men and women who keep each other on their toes…and bring one another to their knees. Cara now writes full-time and lives north of Boston with her bearded husband. When she’s not trapped in her own head, she can usually be found in the kitchen, the coffee shop, or jogging around the nearest duck-filled pond.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "Adult",
    "Erotic Romance",
    "Abuse"
  ],
  "author": "Cara McKenna",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/19091520-hard-time"
}