{
  "title": "Public Offerings Book 1: Birthright",
  "description": "Pandemic! One person stands between pandemic and hope for stopping a nightmare virus… \"A terrific launch for the author's series… have the sequels handy\" - Kirkus Reviews… Clue Award finalist for best thriller or mystery. - Winner of the prestigious Writers League of Texas competition for best thriller ...One out of four children in Sierra Leone will die before their fifth birthday. The Ebola virus, civil war and corruption have decimated the nation and its people. Dave Clement’s company can help by stopping malaria, the biggest single killer of children under five. A biomedical executive in Colorado, Dave has it a wife and daughter he treasures, a career with a mission in which he believes, and a job about to make him rich through an initial public offering. Then his fifteen-year-old daughter, Liv, inexplicably contracts a virulent form of the HIV virus, ripping his life apart. Dave discovers that his work with Sierra Leone may be responsible for Liv’s disease and the pandemic sure to follow. And Sierra Leone is Ground Zero from where the pandemic virus will explode onto the world scene. Using his industry contacts, he scrambles for a cure only to become embroiled in a genocidal cabal of powerful conspirators, including his business partner Claire McQuaid, head of a powerful pharmaceutical firm. The conspiracy links Liv’s fate to the outcome of the pandemic genocide. Dave must cooperate or doom Liv and everything he cherishes. Fighting back, Dave unpeels the layers of the pandemic conspiracy, but Claire anticipates his moves, stopping him at every turn. Pandemic and war loom ominously as the stakes escalate. With time running out, Dave must play God with his own child and a million innocents. Who will live and who will die? And how will Dave live with himself? ---- Ripped from the headlines, this breathtaking roller coaster ride undulates from the snow-capped Rockies of northern Colorado to the rain-soaked jungles of West Africa. --- Birthright, Book 1 of the Public Offerings series, is a cinematic and breathtaking adventure into the 21st century heart of darkness – stopping a manmade pandemic! --- Installment # 1 in the Public Offerings series.",
  "genres": [],
  "author": "Bob LiVolsi",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/19090004-public-offerings-book-1"
}