{
  "title": "Hidden Pain",
  "description": "Although this is book six of the series Hidden Pain can be read as a stand alone book.  Eighteen year old Alexander Burton has just begun his first Formula One racing season. Perhaps following in his father’s and grandfather’s footsteps isn't what he wants, but Alexander lives to please the people who he loves. His carefree life comes to an abrupt halt when he literally runs into the sexiest domineering man he has ever laid his eyes on.  Gray Victore, the twenty six year old billionaire businessman, who has control over the sponsorship money to most of the F1 teams, is feared for a reason. He's anything but carefree and gentle, and his vampire-like personality sucks the young Alexander into his hold. The moment Alex looked into Gray’s black eyes, he saw something in them that made his entire being submit to his dominance and power. Not understanding the pull this arrogant homophobic bully has over him confuses Alexander and makes him open his mind to the possibility of entering into a very different relationship with the sexy blond.  Gray will become Alexander’s whole life, his reason for existing, the only thought that fills his mind. He is an obsession that drives Alexander mad and he welcomes it all. His only wish is to worship Gray and to allow Gray to give him the pleasure that only he could ever do. The pleasure of pain, of dominance, of being owned by another person so completely that his heart is not his own. He would do anything for Gray, give anything for Gray; he lives just for his touch no matter how soft or hard it may be.  Gray doesn’t need or desire anyone who actually wants anything from him. He's not a master or a dominant, he's a sadist. In his world, there are no rules, no code of conduct or restrictions, no safe words, no love or empathy. To see someone suffer and bleed for him excites him in a way nothing else can. It’s not enough to have something given to him-it has to be taken, forced upon-is partners are all unwilling and unable to fulfill him. The pain is the only thing he can enjoy.  They are bound to each other in a way no one else could ever understand, and enjoy a sexual partnership that most would believe to be torture, but together they work.",
  "genres": [
    "M M Romance",
    "BDSM",
    "Abuse",
    "Romance",
    "Erotica",
    "Dark"
  ],
  "author": "Nicole Colville",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/19092565-hidden-pain"
}