{
  "title": "El libro de Noah",
  "description": "Le llaman Noah Thöryn. Es el ojo derecho de As Landin, el mejor amigo del noaiti, y un hombre muy importante en el clan berserker de Wolverhampton. Le dijeron que era hijo de una pareja de guerreros, y que recién nacido fue a parar a manos de As. Ahora ha descubierto que todo es mentira,y que lo único auténtico y real en su vida es la pasión demoledora que siente hacia Nanna, la valkyria intocable de Freyja. Sin embargo aquello que más desea le es negado por normas divinas, y Noah se esta volviendo loco por la desesperación. Si a eso se le añade las extrañas pesadillas que tiene desde que fue herido por el puñal Guddine, su vida es de todo menos apacible. No obstante, las runas hablan con objetividad, y les da igual si ellos son o no son compatibles. Después de sobrevivir milagrosamente en la batalla de Machre Moor, Noah deberá realizar un viaje para descubrir quién es y qué ha venido hacer en el Mirdgard, y es una cuestión innegociable que su pareja en su aventura, sea Nanna. ¿Cómo podrá soportar estar cerca de ella y no tocarla?Nanna siempre fue la niña de los ojos de Freyja. Era la elegida por los dioses para recoger a los muertos en batalla en el Midgard y tiene una gran peculiaridad: ningún hombre vivo la puede tocar. No obstante, el berserker de ojos amarillos ha roto su palabra y ha violado su norma, provocando que la ira de Freyja cayera sobre ella. Nanna no quiere saber nada de él, pero la Diosa Vanir tiene otros planes para ella, que deberá obedecer si quiere que la perdone de nuevo. Empezará un viaje único y revelador, lleno de aventuras, guerra y magia, al lado del único hombre que ha deseado en su vida, del que dicen que es importante para el destino del Ragnarök. Y Nanna no tiene ni idea de cómo sobrellevar la atracción que siente hacia él, sobre todo, cuando viene acompañada de la decepción que supuso que él la traicionara.El Ragnarök ha empezado.Los clanes se reagrupan para luchar juntos.Y en medio de la inminente batalla, un berserker y una valkyria deberán de viajar juntos para descubrir los secretos que los nomas y los dioses han reservado para ellos, sin saber, que el mejor y más importante de todos, será descubrirse el uno al otro en la guerra y en la seducción.Cuando el amor y la valentía brillan tanto como el sol, no se pueden tapar con un solo dedo.",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Romance",
    "Paranormal Romance",
    "Erotica",
    "Adult",
    "Erotic Romance"
  ],
  "author": "Lena Valenti",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/19098108-el-libro-de-noah"
}