{
  "title": "The Death of a President: November 1963",
  "description": "On a lovely October evening in 1961 President Kennedy and William Manchester sat in the Oval Room of the White House, talking for three and a half hours. At first the discussion was detached; Mr. Manchester was writing his Portrait of a President. But soon they were conversing as two men do who have lived many of the same years in the same places. Both were natives of Massachusetts. As a World War II Marine on Guadalcanal, Manchester had been separated by only a narrow strait from Kennedy's PT-109 base on Tulagi. They had both been awarded Purple Hearts before leaving the Pacific. Now they were fathers of daughters the same age, had traveled in the same foreign countries, and shared a deep interest in American history.More than two years later, following the assassination of President Kennedy, Mrs. Kennedy realized that she and others would be obliged to share their recollections of the national tragedy with a responsible writer--and so she and Senator Robert Kennedy asked Mr. Manchester to set down a history of the assassination and the days immediately preceding and following it.At the invitation of the Chief Justice, Mr. Manchester was a privileged observer of the Warren Commission inquiry. Meanwhile, however, he had developed his own sources of information. Operating out of headquarters in the National Archives, for two years he worked twelve to fifteen hours a day, conducting a major historical investigation throughout Texas and elsewhere, accumulating forty-five volumes and portfolios of transcribed tapes, shorthand, documents and exhibits, all of which will be deposited in the Kennedy Library. Finally, in New England, he completed a 350,000-word manuscript, not for scrutiny by the family but to set down as a whole the national and personal tragedy.The result is a powerful narrative which, in the opinion of the publisher, is both a significant contribution to history and an eminent literary achievement.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Politics",
    "Biography",
    "Presidents",
    "True Crime"
  ],
  "author": "William Manchester",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/1106474.The_Death_of_a_President"
}