{
  "title": "Acquisitions",
  "description": "In a dystopian world decimated by a bio-engineered plague, military scouts are acquisitioning a new supply of exports—slaves.With his family dead, sixteen-year-old Cameron Landry is a reluctant survivor, haunted by nightmares and bound by promises. When he and his worst enemy are both selected for shipment to a civilization called Salvation, Cam suddenly has nowhere to run. Devon is a mutant, stronger and faster, and his hatred for Cam grows with each passing day. As Cam makes friends, and finds a surprising ally in Devon’s twin sister, Tara, he learns a secret that could change everything.But Devon is on the hunt, and Cam is running out of places to hide.The Plague Legacy is a dystopian thriller series set in a future that has reversed the world to earlier versions of civilization.On a character level, this story focuses on Cameron Landry, an orphan who is dealing with the loss of his family, most recently his revered older brother. As Cam tries to forge new friendships and navigate the awkwardness of his first experiences with teen romance, he is also running from the aggressive mutant bully Devon Miller. Against a background of burned homes and a rusting ship, Cam has to find the strength within himself to survive.Cam and his friends are on different sides of the mutant and immune societal divide—even though they are teenage orphans who are largely left to govern themselves, they live in a post-apocalyptic society that has taught them to believe that there are distinct differences in the categories of human beings. In this dystopian novel, Cam forges a tentative relationship with an adult mentor, a Regulator who might not be what he seems. Officer Smith escorts Cam and his friends across the ocean to their new home—Salvation, where they are destined to be sold as slaves. Mutants for the glory of the arena, immunes for the dirty work.Some of the themes that are introduced in this book are dealing with the guilt of grief and loss, basic human survival, defining friendships, young adult romance, and emerging leadership. These themes will be further developed in the future dystopian novels of this series.Even though this is post-apocalyptic fiction, much of the premise for Acquisitions is realistic. The book’s context is based on historic events and situations, the first of which is the Children’s Crusade during which the Pope shipped plague orphans out of Europe under the guise that they were going to the Holy Land as righteous soldiers. As this action adventure series develops, the context in future books also includes the culture of the great Roman Empire and the gladiators as well as the King Arthur structure of the german comitatus. This setting lends the book the flavor of both science fiction and fantasy.Altogether, The Plague Legacy: Acquisitions is a thrilling read for teens and adults alike, packed with action, adventure and dynamic characters who will move into your heart. Be part of this impressive new series as it takes its place among the best in young adult dystopian fiction.About the AuthorChristine Nielson Haggerty grew up in rural Utah with three brothers, a sister, several chickens, a goat, and an outhouse. She always loved the escape of science fiction and fantasy and the art of writing, and her passion is to craft stories of strength and survival.Christine taught high school language arts for several years, encouraging perfection of the language in her young adult students. Now she appreciates her background in classic literature and history as she draws on the past to write about the present and the future.Her favorite genres to write are young adult dystopian fiction and young adult urban fantasy.",
  "genres": [
    "Dystopia"
  ],
  "author": "Christine Haggerty",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/19103425-acquisitions"
}