{
  "title": "Songs of Willow Frost",
  "description": "NEW YORK TIMES BESTSELLERFrom Jamie Ford, author of the beloved Hotel on the Corner of Bitter and Sweet, comes a much-anticipated second novel. Set against the backdrop of Depression-era Seattle, Songs of Willow Frost is a powerful tale of two souls—a boy with dreams for his future and a woman escaping her haunted past—both seeking love, hope, and forgiveness.Look for special features inside. Join the Random House Reader’s Circle for author chats and more.  Twelve-year-old William Eng, a Chinese American boy, has lived at Seattle’s Sacred Heart Orphanage ever since his mother’s listless body was carried away from their small apartment five years ago. On his birthday—or rather, the day the nuns designate as his birthday—William and the other orphans are taken to the historical Moore Theatre, where William glimpses an actress on the silver screen who goes by the name of Willow Frost. Struck by her features, William is convinced that the movie star is his mother, Liu Song.   Determined to find Willow and prove that his mother is still alive, William escapes from Sacred Heart with his friend Charlotte. The pair navigate the streets of Seattle, where they must not only survive but confront the mysteries of William’s past and his connection to the exotic film star. The story of Willow Frost, however, is far more complicated than the Hollywood fantasy William sees onscreen.   Shifting between the Great Depression and the 1920s, Songs of Willow Frost takes readers on an emotional journey of discovery. Jamie Ford’s sweeping novel will resonate with anyone who has ever longed for the comforts of family and a place to call home.Praise for Songs of Willow Frost\n \n“If you liked Hotel on the Corner of Bitter and Sweet, you’re going to love Songs of Willow Frost. . . . tender, powerful, and deeply satisfying.”—Lisa Genova   “[A] poignant tale of lost and found love.”\n—Tampa Bay Times\n  “Arresting . . . [with] the kind of ending readers always hope for, but seldom get.”\n—The Dallas Morning News\n   “[An] achingly tender story . . . a tale of nuance and emotion.”—The Providence Journal   “Ford crafts [a] beautiful, tender tale of love transcending the sins people perpetrate on one another and shows how the strength of our primal relationships is the best part of our human nature.”\n—Great Falls Tribune\n  “Remarkable . . . likely to appeal to readers who enjoy the multi-generational novels of Amy Tan.”\n—Bookreporter\n  “Jamie Ford is a first-rate novelist, and with Songs of Willow Frost he takes a great leap forward and demonstrates the uncanny ability to move me to tears.”—Pat Conroy  “With vivid detail, Jamie Ford brings to life Seattle’s Chinatown during the Depression and chronicles the high price those desperate times exacted from an orphaned boy and the woman he believes is his mother. Songs of Willow Frost is about innocence and the loss of it, about longing, about the power of remembered love.”—Nancy Horan, author of Loving Frank   “Ford’s boundless compassion for the human spirit, in all its strengths and weaknesses, makes him one of our most unique and compelling storytellers.”—Helen Simonson, author of Major Pettigrew’s Last Stand",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Historical",
    "Audiobook",
    "Adult Fiction",
    "Adult"
  ],
  "author": "Jamie Ford",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/19101240-songs-of-willow-frost"
}