{
  "title": "The Magician's Land",
  "description": "The stunning conclusion to the New York Times bestselling Magicians trilogyQuentin Coldwater has lost everything. He has been cast out of Fillory, the secret magical land of his childhood dreams that he once ruled. Everything he had fought so hard for, not to mention his closest friends, is sealed away in a land Quentin may never again visit. With nothing left to lose he returns to where his story began, the Brakebills Preparatory College of Magic. But he can’t hide from his past, and it’s not long before it comes looking for him. Meanwhile, the magical barriers that keep Fillory safe are failing, and barbarians from the north have invaded. Eliot and Janet, the rulers of Fillory, embark on a final quest to save their beloved world, only to discover a situation far more complex—and far more dire—than anyone had envisioned.Along with Plum, a brilliant young magician with a dark secret of her own, Quentin sets out on a crooked path through a magical demimonde of gray magic and desperate characters. His new life takes him back to old haunts, like Antarctica and the Neitherlands, and old friends he thought were lost forever. He uncovers buried secrets and hidden evils and ultimately the key to a sorcerous masterwork, a spell that could create a magical utopia. But all roads lead back to Fillory, where Quentin must face his fears and put things right or die trying.The Magician’s Land is an intricate and fantastical thriller, and an epic of love and redemption that brings the Magicians trilogy to a magnificent conclusion, confirming it as one of the great achievements in modern fantasy. It’s the story of a boy becoming a man, an apprentice becoming a master, and a broken land finally becoming whole.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Magic",
    "Audiobook",
    "Urban Fantasy",
    "Science Fiction Fantasy",
    "Young Adult"
  ],
  "author": "Lev Grossman",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/19103097-the-magician-s-land"
}