{
  "title": "Rot & Ruin",
  "description": "Romanzo finalista al Bram Stoker Award Vincitore del Dead Letter Award Vincitore del Cybils Award Vincitore del Melinda AwardNell’America post-apocalittica infestata dagli zombie dove vive Benny Imura, ogni adolescente deve trovarsi un lavoro al compimento del quindicesimo anno di età, o dimezzare per sempre la propria razione quotidiana di cibo. Benny non è interessato a portare avanti il business di famiglia, ma non ha scelta visti i precedenti fallimenti lavorativi; così accetta di diventare un cacciatore di zombie come quel vigliacco di Tom, il suo fratellastro. Il ragazzo si addentra nella desolata Rot & Ruin, il territorio in cui sono confinati gli zombie, con riluttanza, convinto di svolgere un lavoro noioso e pressoché inutile… prima di imbattersi in una terra senza dio, che gli aprirà gli occhi su un mondo totalmente diverso dalla vita a cui era abituato. Conoscerà il suo passato, i lati nascosti della personalità di Tom e il motivo per cui viene considerato da tutti come un eroe: perché là fuori, lontano dalle recinzioni del fortilizio, le distese aride di Rot & Ruin pullulano di rinnegati assassini a caccia di adolescenti, di segreti mortali, di zombie e di bellezze cresciute nelle oscurità del tempo. Rot & Ruin è molto più che un deserto senza vita…Jonathan Maberry è romanziere, drammaturgo, sceneggiatore di fumetti alla Marvel Comics (The Black Panther, Wolverine, Spider-Man) e multi premiato autore al prestigioso Bram Stoker Award (Ghost Road Blues, 2006; The Cryptopedia, 2007). E’ inoltre l’acclamato autore di Patient Zero, opzionata dalla ABC Television per una serie tv, Dead Man’s Song, Bad Moon Rising e Zombie CSU: The Forensics of the Living Dead, quest’ultimo vincitore del Black Quill Award nel 2008.Rot & Ruin si è aggiudicato un Gold Star Award nel 2010, ed è la prima zombie novel dedicata dall’autore a un pubblico young adult. È il primo libro di una serie al quale seguiranno Dust e Decay (2011), Flash&Bone (2012) e Fire&Ash (2013). Maberry è membro di diverse associazioni di scrittori, tra le quali la Science Fiction Writer Associations (SFWA) e la Horror Writers Associations (HWA). Il suo sito è: www.jonathanmaberry.com",
  "genres": [
    "Zombies",
    "Young Adult",
    "Horror",
    "Dystopia",
    "Fiction",
    "Post Apocalyptic",
    "Fantasy"
  ],
  "author": "Jonathan Maberry",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/19096911-rot-ruin"
}