{
  "title": "The Diary of a Madman, the Government Inspector, and Selected Stories",
  "description": "Nikolai Gogol's short fiction, collected here as The Diary of a Madman, The Government Inspector and Selected Stories, deeply influenced later Russian literature with powerful depictions of a society dominated by petty bureaucracy and base corruption. This Penguin Classics edition is translated with notes by Ronald Wilks, and an introduction by Robert A. Maguire.This volume includes a selection of Gogol's most admired short fiction and his most famous drama. A hilarious and biting political satire, 'The Government Inspector' has been popular since its first performance and was regarded by Nabokov as the greatest Russian play ever written. The stories gathered here, meanwhile, range from comic to tragic and describe the isolated lives of low-ranking clerks, lunatics and swindlers. They include 'Diary of a Madman', an amusing but disturbing exploration of insanity; 'Nevsky Prospect', a depiction of an artist infatuated with a prostitute; and 'The Overcoat', a moving consideration of poverty.Edited and translated by Ronald Wilks, this new collection of Gogol's shorter writings skilfully captures the savage wit of the original works. Robert Maguire's introduction considers recurrent themes and explores Gogol's influence on realism. This edition also includes detailed notes, a publishing history for each story and a chronology.Nikolai Gogol (1809-52) was born in the Ukraine. His experience of St Petersburg life informed a savagely satirical play, The Government Inspector, and a series of brilliant short stories including Nevsky Prospekt and Diary of a Madman. For over a decade, Gogol laboured on his comic epic Dead Souls - before renouncing literature and burning parts of the manuscript shortly before he died.If you enjoyed The Diary of a Madman, you might like Anton Chekhov's The Steppe and Other Stories, also available in Penguin Classics.'Everything he started to imagine transformed itself and began to wriggle with life'A.S. Byatt, author of Possession",
  "genres": [
    "Classics",
    "Fiction",
    "Short Stories",
    "Russia",
    "Russian Literature",
    "Literature",
    "19th Century"
  ],
  "author": "Nikolai Gogol",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/19107.The_Diary_of_a_Madman_the_Government_Inspector_and_Selected_Stories"
}