{
  "title": "Weedmonkey: Mama, Mother, Whore",
  "description": "Growing up during the Depression and forced to live in coal mining camps throughout Appalachia, Virgie Hopkins is subjected to child molestation, the KKK, murder, homelessness, starvation, and ridicule for being the daughter of the town whore. Virgie grows up hating her mother who was taken away when she was nine years old and while she was gone, she and her brother were put into foster care, starved, and abused. When her mother returned, she did not know her husband or her children and Virgie could not understand why she had changed. At 16, Virgie made the decision to leave Kentucky and the only life she had ever known after discovering her prostitute mother was having an affair with the young boy Virgie loved. Filled with hatred, resentment, and shame for the woman she called Mom, it was not until her mother’s funeral, did she learn the horrible truth, the reason for her change, and the reason why she became the town whore, a weedmonkey. A haunting true story… From the My mother began writing Weedmonkey when I was a little girl. In 2006, she was diagnosed with terminal cancer and given three months to live, passing on April 30. I was heartbroken not only because my mother was dying, but because her dream of writing this book was dying with her. On her deathbed, she asked me to finish writing it for her. I hope I've made her proud. ♥ Reader's Choice Golden Book Award 2018 Second Place Winner in Golden Book Award 2018 WINNER of Honorable Mention in Reader's Favorite 2017 and featured at the Miami Book Fair 2017!!! Review by Sarah Rollins for Readers' \"Weedmonkey by Lisa V. Proulx is a moving memoir which tells the story of how a little girl called Virgie was brought into the world amidst the remnants of what was the old south, amongst wealth, judgement, poverty, and injustice. Virgie’s mother is considered a town whore, her father works in the mines, and the story continues with Virgie herself left to look after her brothers and sisters, moved from foster home to ﬂop houses, and exposed to situations that you would never dream a young girl (or anyone) should ever be forced to face. Lisa V. Proulx writes with heart and soul as she tells Virgie’s story. Her writing style brings you into the story, and for some moments I almost forgot that this was a non-ﬁction book. Her words pulled you into Virgie’s plight and you felt the emotions of the young girl, her hatred for what life had dealt her, her disappointment for what she has missed in her youth, and yet her strength to go on, and become a diﬀerent person from the mother she knew and grew up with. Weedmonkey is a true story which will make you smile and cry as you follow young Virgie, understand her background and her ability to rise above the life she was forced to live. A truly touching memoir, written with passion by the author who undertook this project after it was started by her own mother. A deﬁnite must-read for anyone who enjoys books of this era or non-ﬁction stories that demonstrate true strength.\"",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Book Club"
  ],
  "author": "Lisa V. Proulx",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/19104167-weedmonkey"
}