{
  "title": "Rayna",
  "description": "*****Not intended for children under the age of 18. If you downloaded the book prior to 11/10/2014, please remove and download again. Updates have occurred.******* Bedwarmers. It's the name that Rayna chose to call the men that she shared her bed with when the need was too great. It was a safety measure. A person couldn't get their heart shredded if they allowed no one near it. Rayna Norton's sisters and mother were the only ones allowed in her heart. Life was great just the way it was. Her sisters seemed to feel differently. Christopher Leigh is the perfect man to combat and disrupt Rayna's way of thinking. He is a man with a creative mind and a determined heart. He sees Rayna at her sister's restaurant and immediately knows that he needs to have this woman in his life. The artist that he is sees the beauty of the woman she is and the gift of the future they could have. He just has to convince the ever reluctant attorney that a life shared with him will be one worth her time. Rayna's issues run deeper than Chris and her sisters could ever perceive. Her chosen way of life has more to it than meets the eye. Will Chris be able to get Rayna to see that he is not like the men of her past? Will Rayna lose out on possibly the perfect man for her because of her own stubbornness? Or will her sisters intervene on her behalf, yet again? The Norton Sisters is a series about six sisters that share the same last name, but are six entirely different women. The stories of the six almost 30 to in their thirties women will touch your heart and make you laugh out loud. The sisters by age ranking: Zoie, Wynter, Rayna, Nyema, Lynnia and Chyra are there for each other always. It follows the lives of six sisters running their own businesses, falling in love and dealing with the trials that come. They follow their own little \"Norton Code\": \"In the end, family means everything and your sisters hold you up. No matter what may come.\"",
  "genres": [
    "Erotica",
    "Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Lakeysha J.",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/19111419-rayna"
}