{
  "title": "Best of Duocarns",
  "description": "Dieses Buch beinhaltet die homoerotische Liebes-Szenen – Auskopplungen aus der großen Duocarns Buchserie – für die Freunde der schwulen Duocarns und ihrer Partner.Die Pärchen: Solutosan – der Sternenkrieger Auraner vom Planeten Sublimar, ehemaliger Chef der Duocarns, goldhäutig, weißes, langes Haar, sternenäugig, Energetiker, bisexuell, dominant, humorvoll, sensibel, Waffe aber auch Aphrodisiakum: Sternenstaub. & Ulquiorra – Energetiker, Oberhaupt von Duonalia, groß, schlank, dunkles Haar, schwarze Augen, ruhig, sanft, ausgeglichen, intelligent, stark. sowie: Tervenarius – der Giftige (Spitzname: Terv)  Auraner vom Planeten Sublimar, Krieger, Chef der Duocarns,  homosexuell, goldene Augen, silbern-weiße Mähne, fungider Hybride.  Er kann seine Pilzhaut nach Belieben verdicken und im Kampf Pilzsporen von sich geben. Er simuliert fast alle Pilzarten. &David Martinal – schlanker, dunkelhaariger Häusermakler,metallisch-weiße Haut,stahlblaue Augen, hartnäckig, sensibel, homosexuell. sowie Patallia – der Heiler (Spitzname Pat) Mediziner vom Planeten Duonalia, homosexuell, grau/violette Augen,Glatze, weißhäutig bis durchsichtig je nach Emotion. Er kann sämtliche Medikamente in seinem Körper herstellen und per Hand verabreichen und hat ein Sprachtalent. &Samuel Goldstein – (Spitzname Smu), Jude, Privatdetektiv, blond (wenn nicht gerade verrückt gefärbt), grüne Augen, gepierct,frech und unkonventionell.sowie: Jake Michaels – Polizist aus Vancouver, blond, grauäugig, homosexuell, Hobbygärtner, sportlich, sensibel, häuslich, tolerant  Arinon – Quinari vom planeten Occabellar, Kampftrainer der Quinaris und Heiler, keine Hörner, intelligent, stark, ruhig, ausgeglichen, sensibel, homosexuell  Die Buchserie selbst hat 1550 Seiten:  Teil 1: Duocarns – Die Ankunft  Teil 2: Duocarns – Schlingen der Liebe  Teil 3: Duocarns – Die drei Könige  Teil 4: Duocarns – Adam, der Ägypter  Teil 5: Duocarns – Liebe hat Klauen  Teil 6: Duocarns - Ewige Liebe  Teil 7: Duocarns - Alien War Planet  Mehr über die Duocarns auf http://www.duocarns.com",
  "genres": [],
  "author": "Pat McCraw",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/19105565-best-of-duocarns"
}