{
  "title": "Carolina Calling",
  "description": "Wouldn't it be wonderful to have been a wealthy, 18th century Aristocratic tobacco farmer in Virginia? Maybe and maybe not. Read more to find out that the farmer was faced with everything from love to bad weather to tobacco worms. A Trip to the Barn When they made it back to the ground, Joseph picked up her skirt and handed it to her. \"I wish we had a big pile of hay. I've always wondered how it would be to have a young lady in the barn with a big pile of hay.\" \"Joseph Borden, you're too much!\" Carolina gave him a little shove. She walked out of the barn with her skirt in hand. Joseph was behind her, laughing all the way. Like a Bolt of Lightning Joseph stirred in his sleep, as the thunder grew louder and louder. Suddenly he sat straight up in bed. He had heard a loud noise. It shook the windows and jarred the house. His jolt of adrenalin had made him acutely aware that something was not right. He listened intently for an indication of what was amiss. Sensing no immediate danger, he thought he would go downstairs and check everything, so he lit a candle from the coals. Unexpected Weather The rough river water began lapping up over the floor of the raft, and the deck became slippery. It was becoming almost impossible to pole the raft with any accuracy. Lightning sparked the sky and temporarily blinded those who looked. Joseph lashed the tiller so it would not swing about suddenly and cause the raft to careen. The end of lash ropes were whipping wildly in the wind. A Boundry Dispute \"No, Sir, as you can see, the property line runs just the other side of our harvesting, and I'd appreciate your not hitting Wren,\" Carolina responded. This remark, along with the whack on the arm, infuriated Thomas. The very idea of her telling him where the property line was and how to behave. Striking him on the arm didn't hurt but it was demeaning to a man of his position.",
  "genres": [],
  "author": "Barbara Dumas Ballew",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/11065415-carolina-calling"
}