{
  "title": "Lone Wolf: Eric Rudolph: Murder, Myth, and the Pursuit of an American Outlaw",
  "description": "He was supposed to be dead. Five years after Eric Rudolph escaped into the mountains of North Carolina, the FBI had long since abandoned the largest manhunt ever launched on U.S. soil. The fugitive accused of bombing the Atlanta Olympics, a gay bar, and two abortion clinics, leaving a trail of carnage across the southeast, had become a figure of folk legend. Many of his pursuers thought he had either skipped the country or crawled into a cave to die. In fact, Rudolph had been haunting the mountains and towns he knew best, pilfering food, stealing trucks, stalking the men who hunted him, and keeping his secrets buried in the woods. Then one night Rudolph got careless, and a rookie cop captured him a few miles from where he had first disappeared. But even in custody, Rudolph remained a mystery. In Lone Wolf , Maryanne Vollers brings the reader inside one of the most sensational cases of domestic terrorism in American history. In addition to her unprecedented correspondence with Rudolph, Vollers had access to the FBI, the ATF, federal prosecutors, members of Rudolph's defense team, and his family to re-create the story in all its sweeping breadth and complexity. Lone Wolf asks the inevitable Who is Eric Rudolph, and why did he kill? Is he the hate-filled neo-Nazi described by federal agents, or is he the passionate, curious, and engaging man described by his lawyers and his family? Can both personalities exist in one rare, complicated, and deadly individual? The profilers and psychologists Vollers interviews identify Rudolph as a \"lone offender,\" a self-appointed avenger with no real alliances and no meaningful social ties. It puts Rudolph in the same category as Timothy McVeigh, the Oklahoma City bomber, and Ted Kaczynski, the Unabomber. The \"lone wolf\" believes history will judge him to be a hero. Society judges him to be a monster. Without losing sight of the hideous violence of his crimes, Lone Wolf seeks to put a human face on this iconic killer as it explores the painful mysteries of the human heart.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Biography",
    "Religion",
    "History",
    "Terrorism"
  ],
  "author": "Maryanne Vollers",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/191214.Lone_Wolf"
}