{
  "title": "Food Politics: How the Food Industry Influences Nutrition and Health",
  "description": "We all witness, in advertising and on supermarket shelves, the fierce competition for our food dollars. In this engrossing exposé, Marion Nestle goes behind the scenes to reveal how the competition really works and how it affects our health. The abundance of food in the United States--enough calories to meet the needs of every man, woman, and child twice over--has a downside. Our overefficient food industry must do everything possible to persuade people to eat more --more food, more often, and in larger portions--no matter what it does to waistlines or well-being.Like manufacturing cigarettes or building weapons, making food is very big business. Food companies in 2000 generated nearly $900 billion in sales. They have stakeholders to please, shareholders to satisfy, and government regulations to deal with. It is nevertheless shocking to learn precisely how food companies lobby officials, co-opt experts, and expand sales by marketing to children, members of minority groups, and people in developing countries. We learn that the food industry plays politics as well as or better than other industries, not least because so much of its activity takes place outside the public view.Editor of the 1988 Surgeon General's Report on Nutrition and Health, Nestle is uniquely qualified to lead us through the maze of food industry interests and influences. She vividly illustrates food politics in watered-down government dietary advice, schools pushing soft drinks, diet supplements promoted as if they were First Amendment rights. When it comes to the mass production and consumption of food, strategic decisions are driven by economics--not science, not common sense, and certainly not health.No wonder most of us are thoroughly confused about what to eat to stay healthy. An accessible and balanced account, Food Politics will forever change the way we respond to food industry marketing practices. By explaining how much the food industry influences government nutrition policies and how cleverly it links its interests to those of nutrition experts, this pathbreaking book helps us understand more clearly than ever before what we eat and why.",
  "genres": [
    "Food",
    "Nonfiction",
    "Health",
    "Politics",
    "Nutrition",
    "Science",
    "History"
  ],
  "author": "Marion Nestle",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/19132.Food_Politics"
}