{
  "title": "Aliens, Fallen Angels, Nephilim and the Supernatural: Discover Ancient Secrets and Bible Prophecies about the Supernatural",
  "description": "Supernatural forces do exist. Although most of us cannot see or feel them, aliens, angels, fallen angels, demons, and nephilim may indeed be all around us and may even play a significant role in our thinking, our actions and our destiny. As you will learn, even nations and governments are readily influenced by these unseen spirits and forces. Therefore it is extremely important that we understand this other dimension that strives to influence our belief systems, and ultimately our destiny. You will learn how you can neutralize any adverse impact that their influence may have on our lives, and in the lives of our loved ones. Did giants really exist at one time? What about ancient astronauts, UFOs, and intelligent beings from other galaxies? What is their true origin? What about alien abductions. Are they all for real? Do they actually all exist? If so then why, and what are they after? This book will attempt to clarify all of these questions as well as related questions for you. Careful study of the bible and several other secret ancient writings help uncover the inter-relationship between aliens, angels, fallen angels, demons and the nephilim? This book helps explain the inter-relationship between these supernatural beings. This book covers the supernatural in detail and explains how and why Aliens, fallen angels, demons, and the nephilim all have a part in this cosmic battle in the spirit and invisible realm. I endeavor to help the reader understand who the chief players are in this ongoing cosmic battle, and what role they have and will play in past, and future world events. I am confident that after reading this book, you will acquire a much clearer understanding of the supernatural forces at hand, as I attempt to unlock for you their reasons and their purpose for existing.",
  "genres": [],
  "author": "Robert Rite",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/19135716-aliens-fallen-angels-nephilim-and-the-supernatural"
}