{
  "title": "The Golden Stairs",
  "description": "Climb to Unexpected TreasuresNews that gold has been discovered in Canada’s Yukon Territory is rapidly spreading through the United States and its territories. And the route that gets you there from Alaska is the Golden Stairs. In the spring of 1898, nineteen-year-old Livia Bray and her mother, Martha, set out to find their missing father and husband, Weldon, who left six months ago to seek his fortune. Her heart just broken, Livia does not expect to meet anyone like Matt Holden on the Golden Stairs. But Matt saves Livia’s life during an avalanche and leads her to a saving knowledge of Jesus Christ. Livia also finds true love in him…but will she and her mother find her father dead or alive? Gold in the Yukon!1898. Gold is flowing out of Canada’s Yukon Territory , and broad-shouldered Matt Holden and his parents join the thousands of people flocking north. To reach the gold fields, they take the Chilkoot Trail and a grueling climb up the icy Golden Stairs over Chilkoot Pass. With threats ranging from drunken violence to deadly avalanche, Matt has his hands full protecting those around him. Along the way, Matt meets Martha Bray and her lovely daughter, Livia, who’ve come from San Francisco searching for their missing husband and father, Weldon. He left for the Yukon months ago, but there’s been no word...and even the Mounties could find no trace of him. Will Martha and Livia ever find Weldon? And who will find their hearts’ desires—or eternal riches—in the frozen land beyond the Golden Stairs?Story Behind the Book“We read books on the history of North America and found ourselves captivated with the three big gold rushes in the nineteenth century—the California Gold Rush of 1849, the Dakota Territory Black Hills Gold Rush of 1874, and the Canadian Yukon Gold Rush of 1896. Some gold seekers embraced success, delight, and happiness, but others faced failure, tragedy, and sorrow. In the Dreams of Gold series, we captivate our readers’ imaginations as well as touch their hearts with both types of results in the gold seekers’ experiences—good and bad.”—Al and JoAnna Lacy",
  "genres": [],
  "author": "Al Lacy",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/1912583.The_Golden_Stairs"
}