{
  "title": "Politics Lost: How American Democracy Was Trivialized By People Who Think You're Stupid",
  "description": "People on the right are furious. People on the left are livid. And the center isn’t holding. There is only one thing on which almost everyone there is something very wrong in Washington. The country is being run by pollsters. Few politicians are able to win the voters’ trust. Blame abounds and personal responsibility is nowhere to be found. There is a cynicism in Washington that appalls those in every state, red or blue. The question Why? The more urgent question What can be done about it?Few people are more qualified to deal with both questions than Joe Klein.There are many loud and opinionated voices on the political scene, but no one sees or writes with the clarity that this respected observer brings to the table. He has spent a lifetime enmeshed in politics, studying its nuances, its quirks, and its decline. He is as angry and fed up as the rest of us, so he has decided to do something about it—in these pages, he vents, reconstructs, deconstructs, and reveals how and why our leaders are less interested in leading than they are in the “permanent campaign” that political life has become.The book opens with a stirring anecdote from the night of Dr. Martin Luther King Jr.’s assassination. Klein re-creates the scene of Robert Kennedy’s appearance in a black neighborhood in Indianapolis, where he gave a gut-wrenching, poetic speech that showed respect for the audience, imparted dignity to all who listened, and quelled a potential riot. Appearing against the wishes of his security team, it was one of the last truly courageous and spontaneous acts by an American politician—and it is no accident that Klein connects courage to spontaneity. From there, Klein begins his analysis—campaign by campaign—of how things went wrong. From the McGovern campaign polling techniques to Roger Ailes’s combative strategy for Nixon; from Reagan’s reinvention of the Republican Party to Lee Atwater’s equally brilliant reinvention of behind-the-scenes strategizing; from Jimmy Carter to George H. W. Bush to Bill Clinton to George W.—as well as inside looks at the losing sides—we see how the Democrats become diffuse and frightened, how the system becomes unbalanced, and how politics becomes less and less about ideology and more and more about how to gain and keep power. By the end of one of the most dismal political runs in history—Kerry’s 2004 campaign for president—we understand how such traits as courage, spontaneity, and leadership have disappeared from our political landscape.In a fascinating final chapter, the author refuses to give easy answers since the push for easy answers has long been part of the problem. But he does give thoughtful solutions that just may get us out of this mess—especially if any of the 2008 candidates happen to be paying attention.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "American History",
    "Journalism",
    "Political Science"
  ],
  "author": "Joe Klein",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/19131.Politics_Lost"
}