{
  "title": "Crop Circles, Jung, and the Reemergence of the Archetypal Feminine",
  "description": "Throwing light on the mysterious phenomenon of crop circles within the context of modern psychological reality , Crop Circles, Jung, and the Reemergence of the Archetypal Feminine in an engaging look at the science, history, and symbolic nature of the mystery of these annually occurring giant-scale works of art. Gary S. Bobroff offers a framework for the reader's own deeper consideration of crop circles by examining both the phenomenon itself and the nature of the era into which it has arrived, with special consideration of its relevance to Jungian archetypal psychology.Living in the moment of the death of one worldview and the birth of another, our culture suffers from a hyper-masculine inflation that has us alienated, imagining ourselves to be separate from each other and the earth. Today we are presented with environmental, social, and spiritual crises and mysteries that call us back toward closer participation with the world. Crop Circles--formed in living grain--exemplify the archetypal feminine nature of this moment's a calling toward conscious, felt engagement with a dynamic, living, mysterious world. Placing this modern \"dream\" into the context of modern reality, Crop Circles, Jung, and the Reemergence of the Archetypal Feminine considers what it means to live in an era of strange encounters with energies larger than ourselves.ContentsCHAPTER ONE - BODY OF EVIDENCECHAPTER TWO - WITCHES' RINGS & DEVIL'S TWISTSCHAPTER THREE - GREENING CIRCLESCHAPTER FOUR - ANTIQUE PAGEANTRYCHAPTER FIVE - REASON ALONECHAPTER SIX - A CALLING BACK DOWNCHAPTER SEVEN - THE REALITY OF THE PSYCHECHAPTER EIGHT - GHOSTS OF ELECTRICITYCHAPTER NINE - NEVER MINDCHAPTER TEN - FIELDS OF WAVING CORNACKNOWLEDGMENTSSELECTED BIBLIOGRAPHYNOTES",
  "genres": [
    "Nonfiction"
  ],
  "author": "Gary S. Bobroff",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/19138427-crop-circles-jung-and-the-reemergence-of-the-archetypal-feminine"
}