{
  "title": "Streeters: Rants and Raves from This Hour Has 22 Minutes",
  "description": "The more than one million Canadians who watch This Hour Has 22 Minutes will recognize Rick Mercer's streeters—the caustically funny rants that have become one of the best-loved segments of the show.Often called Parliament's Unofficial Opposition, Rick Mercer writes all his rants and is also one of the primary writers for the show. Photos and an eye-catching design set off Mercer's memorable exposés of the pretensions of politicians and the foibles of our society.Rick Mercer Rants about Quebec:If Quebec separates it's only gonna get worse...The first thing they're gonna do once they leave is come over. They'll be like the next door neighbour with an Amway catalogue. How are you? I'm fine. No hard feelings, let's start a carpool, can I stay in the guest room, use your currency, go halves on the army, by the way I'm a king now.Rick Mercer Rants about Jean Chrétien:I wish people would just get off Jean Chrétien's back. The man goes to China, he makes a few deals, makes us a pile of cash and what happens? Everyone is all up in arms just because of a few minor human rights violations. Look, Chrétien has no choice. My next door neighbour and I, we go halves on firewood, I save money. It's a great deal for me. But there's some soft liberals out there would prefer if I didn't even talk to the man. Okay so he ran over a couple of kids in his car because they were making a racket out on the cul-de-sac. And yes he's got a bunch of youngsters chained to the furnace because they talked back. But hey, it's not like I haven't made my feelings known to the man. I've done my part. One time I said That's bad. He changed the topic, we went on with our business, had a beer, whatever. My conscience is clear and like Jean Chrétien, I cannot afford to jeopardize this very special mutually profitable relationship with my neighbour just because of a few people chained up in his basement. And don't give me any grief here. Hey, I'm only following my Prime Minister's lead.",
  "genres": [
    "Humor",
    "Nonfiction",
    "Canada",
    "Politics",
    "Essays"
  ],
  "author": "Rick   Mercer",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/1914560.Streeters"
}