{
  "title": "Prodigal Blues",
  "description": "From award-winning author Gary A. Braunbeck comes Prodigal Blues, his first foray into non-supernatural horror.After he finds himself stranded at a truck stop in Missouri, Mark Sieber gets one of the biggest shocks of his life when he recognizes the face of a little girl on a Missing poster as belonging to the same little girl he saw only a few minutes before. Looking around for some sign of her, he comes back to his table in the restaurant to find the little girl sitting there, waiting for him.\"I'm sorry, mister,\" is all she seems capable of saying.As the police and media begin to converge on the truck stop, Mark retreats back to his hotel room to call his wife and let her know what's going on, only to be taken hostage by the same people who released the little girl. But his abductors are little more than children themselves.Ranging in ages from 12 to 19, Mark's abductors are in the process of escaping from a sadistic pedophile known to them only as \"Grendel\" a man whose practices include torture and mutilation specifically, mutilation of the face.Mark's abductors have all been mutilated by Grendel, who may be very close behind them, and need someone with a \"normal face\" to help them carry out their plan for justice and return home.For the next few days, Mark will come to understand not only the inhuman horror that these children have suffered, but how they eventually learned to fight back and how they discovered that Grendel and his practices are at the center of a very complex network catering to those whose tastes run toward the molestation and mutilation of children.Prodigal Blues is perhaps Braunbeck's most suspenseful and emotionally powerful work to date; a story of suffering, depravity, redemption, and in the end the individual's compassion for his or her fellow human beings that can lead some people to find reserves of courage and determination they never thought they possessed.Terrifying, suspenseful, sometimes surprisingly funny, and ultimately moving, Prodigal Blues is quintessential Braunbeck.",
  "genres": [
    "Horror",
    "Thriller",
    "Crime",
    "Mystery",
    "Audiobook",
    "Fiction",
    "Dark"
  ],
  "author": "Gary A. Braunbeck",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/19144.Prodigal_Blues"
}