{
  "title": "Crimson Worlds Collection I",
  "description": "Marines (Crimson Worlds I)Erik Cain joined the marines to get off death row. The deal was simple; enlist to fight in space and he would be pardoned for all his crimes.In the 23rd Century, assault troops go to war wearing AI-assisted, nuclear-powered armor, but it is still men and blood that win battles. From one brutal campaign to the next, Erik and his comrades fight an increasingly desperate war over the resource rich colony worlds that have become vital to the economies of Earth's exhausted and despotic Superpowers.As Erik rises through the ranks he finally finds a home, first with the marines who fight at his side and later among the colonists - men and women who have dared to leave everything behind to build a new society on the frontier, one where the freedoms and rights lost long ago on Earth are preserved.Amidst the blood and death and sacrifice, Erik begins to wonder. Is he fighting the right war? Who is the real enemy? --------------------------The Cost of Victory (Crimson Worlds II)The Third Frontier War is raging, and all across human-occupied space worlds are burning. Massive battlefleets struggle for dominance and kilometer-long war ships exchange thermonuclear barrages. Battered in the early years of the war, the Western Alliance is resurgent. The brilliant Admiral Augustus Garret leads the Alliance fleet from victory to victory, taking the war to the very heart of the enemy empires. And on the ground, Colonel Erik Cain, hero of the Marine Corps, leads his crack troops again into combat, seeking the final battle. In the background, the secretive intelligence agencies of the despotic Superpowers plot and scheme, using their own soldiers as pawns in the great game for control of space. But the final battle will be fought in the reddish sands of a backwater world, and the prize will be the staggering secret that has lain hidden in a remote cave for untold centuries. All the Powers struggle for the ultimate victory, but at what cost?  ---------------------------A Little Rebellion (Crimson Worlds III)Crimson Worlds Book III The Third Frontier War is over, and the Western Alliance is triumphant. All across human-occupied space, colony worlds celebrate the coming of peace.But peace is an elusive dream, and more trouble is brewing. The war was expensive, and the economies of the Superpowers, always fragile, are on the verge of total collapse.The Directorate, the shadowy intelligence organization that has become the true power behind the Alliance government, plans to strip the colonies bare to pay the costs of war. Already, they are tightening their control over the freewheeling colonial governments. And the Marine Corps faces total destruction at the hands of the worst traitor in its history.But the colonists are a different breed than the passive mob on Earth, and they have no intention of meekly surrendering their hard won freedoms. On worlds all across the frontier, plans are hatched and weapons hoarded. And in taverns and meeting halls the words of an ancient text are uttered in hushed tones. A little rebellion, now and then, is a good thing. --------------------------------The Crimson Worlds Series:Crimson Worlds I: Marines Crimson Worlds II: The Cost of Victory Crimson Worlds III: A Little Rebellion Crimson Worlds IV: The First Imperium Crimson Worlds V: The Line Must Hold Crimson Worlds VI: To Hell's HeartTombstone: A Crimson Worlds Prequel&l",
  "genres": [
    "Science Fiction",
    "Military Fiction",
    "Fiction",
    "Space Opera",
    "War",
    "Science Fiction Fantasy",
    "Amazon"
  ],
  "author": "Jay Allan",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/19138149-crimson-worlds-collection-i"
}