{
  "title": "ZOOM: The Global Race to Fuel the Car of the Future",
  "description": "\"Zoom goes zero to sixty in nothing flat. It's an exciting ride into the future of the world's favorite physical object, the automobile.\"-Gregg Easterbrook, author of THE PROGRESS PARADOX\"Zoom offers a new way to think about cars and energy that's key to understanding the forces shaping business today. It's smart, well-informed and insightful--exactly what one would expect from two of The Economist's best journalists.\"-Chris Anderson, author of THE LONG TAIL\"Zoom puts oil in its sights and squeezes off one telling round after another. Car lovers will see a sunny future with other fuels; OPEC a steadily darkening twilight.\"-R. James Woolsey, VP, Booz Allen Hamilton; former Director of Central Intelligence\"An incisive analysis of the end of the petroleum age, including all its repercussions and opportunities.\"-Vinod Khosla, Khosla Ventures\"Oil is the problem. Cars are the solution.\"Those two simple sentences by the authors of Zoom define the scope of their illuminating and important book, an examination of a transformation in business and culture that is occurring before our eyes.We are living in the midst of a Great Awakening. People are seeking environmentally-sound alternatives to gas guzzlers. Detroit's reign is over. Oil companies, despite their billion-dollar profits, could be on the brink of extinction if they don't adapt. And citizens, all too aware that these industries have lobbied politicians into gridlock over energy policy, are mobilizing to support leaders who advocate new policies.In Zoom, Iain Carson and Vijay V. Vaitheeswaran, award-winning correspondents for The Economist, show why and how geopolitical and economic forces are compelling the linked industries of oil and autos to change as never before.Drawing on years of industry research-including dozens of interviews with motor and energy executives, top policymakers, and latter-day Fords and Edisons-Carson and Vaitheeswaran -How Toyota became the world's largest automaker through innovation and superior performance.-Why American politicians have, for decades failed to address our energy issues and global warming-and how grassroots movements, along with individual entrepreneurs, innovators, and outsiders, are making real reform possible.-How these Green revolutionaries are creating new products powered by hydrogen, electricity, bio-fuels, and digital technology.As political leaders debate our energy, environmental and economic future, Zoom offers a lucid and visionary portrait of what that future could be. Anyone planning to vote will find compelling truth in its assertions and conclusions.",
  "genres": [
    "Business",
    "Nonfiction",
    "Science",
    "Economics",
    "Environment",
    "Engineering",
    "Technology"
  ],
  "author": "Iain Carson",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/1913685.ZOOM"
}