{
  "title": "Electromagnetic Pollution Solutions",
  "description": "European physicians practicing Biological Medicine have observed that one out of three patients do not respond well to properly selected healing protocols until electromagnetic interferences are eliminated. As a young doctor studying these methods, the author saw a need for a book that would not only educate patients about the issues of electromagnetic stress, but provide simple self-help guidance. Most writings on the subject focus on making the case that we have a serious problem at hand... another one. While this may be true, in the context of a reader who is seeking to restore optimum health, the focus needs to be on solutions... hence the title \"Electromagnetic Pollution Solutions. After introducing the full range of electromagnetic frequencies both in nature and in modern technology, the book focuses is on which types of EMF sources are most commonly a problem, and ultimately on what approaches have proven most successful in dealing with the unique attributes of each kind of stress source. Now in its third edition, Electromagnetic Pollution Solutions has been revised and updated, now benefiting from 30 years of the author's clinical experience in eye care, natural medicine and spiritual healing coming from the perspective that all healing is ultimately self healing. We are always facing stresses, and always making our best attempts to compensate and overcome these stresses, including the residual effects of past encounters that have not been fully healed. Using German electrophysiological biofeedback techniques to facilitate biocommunication, Dr. Swartwout has pioneered methods for listening to the innate knowledge and wisdom of the body as seen in its response patterns to environmental, physiological and pathophysiological stimuli, including the various types of electromagnetic and geopathic stresses outlined in the book. In addition to environmental and behavioral solutions, extensive information is also included about useful remedial and protective support via diet, nutrition, homeopathy, flower essences, vibrational medicine, and botanical medicine, East and West... This book is a highly readable tour de force on an essential, and still under-recognized topic and is an important addition to any health practitioner, caregiver or self-help library.",
  "genres": [],
  "author": "Glen Swartwout",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/19155582-electromagnetic-pollution-solutions"
}