{
  "title": "Die Macht der Geschlechternormen und die Grenzen des Menschlichen",
  "description": "In ihrer epochemachenden Studie Das Unbehagen der Geschlechter entwickelt Judith Butler die These der Performativität des Geschlechts: die Einsicht, daß unser Geschlecht nicht nur durch biologische Parameter bestimmt ist, sondern daß wir es durch unser Sprechen und Handeln allererst erzeugen. Was wir sind, hängt davon ab, was wir tun – was wir tun, liegt aber häufig nicht in unserer Macht. In ihrem neuen Buch geht sie nun insbesondere den Reglementierungen und Einschränkungen unseres Handelns nach und erforscht die Möglichkeiten, bestehende Muster, Regeln und Ordnungen zu demontieren, um neue Handlungsspielräume—und neue Möglichkeiten, die eigene Identität zu gestalten—zu erschließen.Die Macht der Geschlechternormen und die Grenzen des Menschlichen vertieft und bilanziert eine Reihe von Themen und Thesen aus Butlers früheren Werken: die Materialität des Körpers, die Beziehung zwischen Macht und Psyche, die politischen Dimensionen der Psychoanalyse und die Auswirkungen des juridischen Diskurses auf diejenigen, die nicht autorisiert sind, an ihm teilzunehmen. Die einzelnen Essays untersuchen das Problem der Verwandtschaft vor dem Hintergrund einer immer stärkeren Infragestellung der Lebensform Familie und die Bedeutung und Ziele des Inzesttabus; sie hinterfragen die Pathologisierung von Intersexualität und Transsexualität und unterziehen das Phänomen sexueller und ethnischer Panik in der Kunstzensur einer kritischen Analyse. Der Band schließt mit einem grundlegenden Essay über den Status der Philosophie und ihre Möglichkeiten, das »Andere der Philosophie« zur Sprache kommen zu lassen.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Philosophy",
    "Gender",
    "Queer",
    "Theory",
    "Gender Studies"
  ],
  "author": "Judith Butler",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/11068699-die-macht-der-geschlechternormen-und-die-grenzen-des-menschlichen"
}