{
  "title": "Amigas para Sempre - Quatro Mulheres, quatro segredos, quatro vidas em busca da felicidade",
  "description": "«Há sempre tempo para mudar e para conseguir o que de melhor a vida tem para nos oferecer. Chega de viver a vida a meio gás. Com medo. Limitadas pelas barreiras que nós próprias construímos, mas que, na verdade, não existem. Quando se quer, a vida está sempre pronta para nos dar uma segunda oportunidade. Basta vivê-la, sem fazer batota.»Ana, Joana e Raquel reúnem-se para comemorar os 40 anos de Carla. Mas o que se esperava ser apenas um jantar de aniversário animado entre amigas cedo se transforma numa noite emocionante, onde vão ser revelados segredos há muito escondidos e feitas descobertas surpreendentes que irão transformar para sempre a vida de cada uma destas mulheres. Após esta noite, Ana, Joana, Raquel e Carla não voltarão a ser as mesmas. Mas a amizade que as une vai tornar-se mais forte e sincera do que nunca.Depois dos anteriores sucessos, Fátima Lopes regressa à escrita com um livro que nos leva numa viagem ao universo feminino e à (re)descoberta dos valores fundamentais da vida, como o amor e a amizade.Fátima Lopes é um dos rostos mais conhecidos dos portugueses. Atualmente podemos vê-la na TVI, todas as tardes, no programa A Tarde é Sua, um programa à medida da sua apresentadora. A sua estreia em televisão aconteceu em 1994, na SIC, com o programa Perdoa-me. Seguiram-se os programas All You Need is Love, Surprise Show, Fátima Lopes, SIC 10 Horas, Fátima e Vida Nova.Em 2006, Fátima Lopes publicou o seu primeiro romance Amar Depois de Amar-te que vendeu cerca de 100 mil exemplares em Portugal, tornando-se num dos bestsellers de 2006. Em 2007, foi também editado em Espanha com grande sucesso. Editou ainda Um Pequeno Grande Amor, 18.ª edição e A Viagem de Luz e Quim, 3.ª edição. Licenciada em Comunicação Social, Fátima Lopes estreou-se como cronista no Diário Popular e na Rádio Minuto, escreveu guiões para filmes institucionais e foi responsável de comunicação e imagem do grupo Semanário Económico. Foi ainda responsável de marketing da multinacional Bausch & Lomb.",
  "genres": [],
  "author": "Fátima Lopes",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/19163688-amigas-para-sempre---quatro-mulheres-quatro-segredos-quatro-vidas-em-b"
}