{
  "title": "The Avalon Ladies Scrapbooking Society",
  "description": "Perfect for fans of Debbie Macomber, Kristin Hannah, Beth Hoffman, and Kate Jacobs, this luminous novel from the author of Friendship Bread follows a group of fascinating women who form deep friendships through their love of scrapbooking—as memories are preserved, dreams are shared, and surprising truths are revealed.Welcome to Avalon, Illinois, Pop. 4,243  At Madeline’s Tea Salon, the cozy hub of the Avalon community, local residents scrapbook their memories and make new ones. But across town, other Avalonians are struggling to free themselves of the past: Isabel Kidd is fixing up her ramshackle house while sorting through the complications of her late husband’s affair. Ava Catalina is mourning the love of her life and helping her young son grow up without his father. Local plumber Yvonne Tate is smart, beautiful, and new to Avalon, but finds that despite a decade of living life on her own terms, the past has a way of catching up—no matter where she goes. And Frances Latham, mother to a boisterous brood of boys, eagerly anticipates the arrival of a little girl from China—unprepared for the emotional roller coaster of foreign adoption.   Enter Bettie Shelton, the irascible founder of the Avalon Ladies Scrapbooking Society. Under Bettie’s guidance, even the most reluctant of Avalon’s residents come to terms with their past and make bold decisions about their future. But when the group receives unexpected news about their steadfast leader, they must pull together to create something truly memorable.   By turns humorous, wise, and deeply moving, The Avalon Ladies Scrapbooking Society is a luminous reminder that the things we hold most dear will last a lifetime.  \n“In a gathering of women there will always be compelling stories. Throw in a love of craft and these stories take on a whole new dynamic. There are shared secrets, support, encouragement, and love as the Avalon Ladies come to terms with the past and boldly step forward into the future.”—#1 New York Times bestselling author Debbie Macomber\n\nFrom the Hardcover edition.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Friendship",
    "Audiobook",
    "Womens Fiction",
    "Romance"
  ],
  "author": "Darien Gee",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/19170710-the-avalon-ladies-scrapbooking-society"
}