{
  "title": "On Thin Ice 3",
  "description": "Daniel and Kylie begin to adapt to their new lives in the outside world together, having left rehab. Daniel's hockey team is doing well, and Kylie is acing her classes, but when the family of the man who hit her car sues Kylie for pain and suffering, it brings back a number of bad memories.Will Kylie be able to keep herself together, or will she fall back to the alcohol she used to depend on?This 20,000 word story is the third and final part of the On Thin Ice trilogy. Please enjoy this “So when the regular season starts are you going to be playing again?”“I hope so. I think so. Dan thinks if we’re pretty aggressive with my rehab for the next month that it should be possible. I know that it’s not extremely important if I don’t, but I’d like to be back in time for the start of the year.”“Yeah, you had the surgery in July, three months recovery is pretty damn good for an athelete.”“I was lucky that the tears weren’t too bad, definitely.”When we finished our food, we cracked open our fortune cookies. ‘Anything is possible if you really believe’, mine said. I smiled at the words. I believed them now. After I saw Daniel skating around on the ice today, the same Daniel who winced when he showed me how to lunge because his knee was in so much pain, I knew that what my fortune cookie said was right. Anything was possible. It just took a lot of hard work.Our food discarded, I scooched in to be closer to Daniel. We sat together, me resting in between his legs, leaning back against him as his arms wrapped around my waist. I took his hands in mine, and we watched the lake in silence for a while. This was perfect. Absolutely perfect.“I love you, Kylie,” Daniel suddenly said, out of nowhere. I hadn’t been expecting it, but it felt so right to hear right now. It felt nice to hear.“I love you too,” I replied, leaning back against him. I closed my eyes. Daniel loved me. He had just told me he loved me. I thought before that the situation was perfect, but I was wrong. Now it was perfect.",
  "genres": [
    "Sports",
    "Romance"
  ],
  "author": "Victoria Villeneuve",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/19169119-on-thin-ice-3"
}