{
  "title": "What Cannot Be Said",
  "description": "A seemingly idyllic summer picnic ends in a macabre murder that echoes a pair of slayings fourteen years earlier in this riveting new historical mystery from the USA Today bestselling author of Who Cries for the Lost .July 1815: The Prince Regent’s grandiose plans to celebrate Napoléon’s recent defeat at Waterloo are thrown into turmoil when Lady McInnis and her daughter Emma are found brutally murdered in Richmond Park, their bodies posed in a chilling imitation of the stone effigies once found atop medieval tombs. Bow Street magistrate Sir Henry Lovejoy immediately turns to his friend Sebastian St. Cyr, Viscount Devlin, for help with the investigation. For as Devlin discovers, Lovejoy’s own wife and daughter were also murdered in Richmond Park, their bodies posed in the same bizarre postures. A traumatized ex-soldier was hanged for their killings. So is London now confronting a malicious copyist? Or did Lovejoy help send an innocent man to the gallows?Aided by his wife, Hero, who knew Lady McInnis from her work with poor orphans, Devlin finds himself exploring a host of unsavory characters from a vicious chimney sweep to a smiling but decidedly lethal baby farmer. Also coming under increasing scrutiny is Sir Ivo McInnis himself, along with a wounded Waterloo veteran—who may or may not have been Laura McInnis’s lover—and a charismatic young violinist who moonlights as a fencing master and may have formed a dangerous relationship with Emma. But when Sebastian’s investigation turns toward man about town Basil Rhodes, he quickly draws the fury of the Palace, for Rhodes is well known as the Regent’s favorite illegitimate son.Then Lady McInnis’s young niece and nephew are targeted by the killer, and two more women are discovered murdered and arranged in similar postures. With his own life increasingly in danger, Sebastian finds himself drawn inexorably toward a conclusion far darker and more horrific than anything he could have imagined.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Historical",
    "Fiction",
    "Regency",
    "Audiobook"
  ],
  "author": "C.S. Harris",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/191728915-what-cannot-be-said"
}