{
  "title": "Love and Decay, Vol. Two",
  "description": "Zombies- as if that wasn’t enough to ruin any girl’s dream of a happily ever after.A lot has changed for Reagan in the few months since she stumbled upon the Parker family. She has given up her isolated vagabond lifestyle and along with her best friend Haley, made a permanent home with the brothers and their sweet, little sister. More specifically, Reagan has fallen in love with Hendrix Parker, a man just as consumed with loving and protecting her.Their love is tested time and time again as their lives are continually threatened and put in danger, Zombies lurk around every dilapidated corner and an uncertain risk follows them across state lines. While the undead haunt their newfound happiness, Matthias Allen and his obsessive son Kane remind Reagan and friends that Zombies aren’t the only evil lurking in this new apocalyptic world. Kane is on a mission to make Reagan his and take her back to The Colony, where his father reigns as a tyrannical overlord and Kane is second in command.While Tyler and Miller Allen adjust to life with the Parkers, Reagan and Haley after their own escape from The Colony, the group decides to set up camp at a safe settlement that offers them refuge. But is anything truly safe at the end of the world? Soon they are surrounded by Zombies trying to eat them, an enemy settlement trying to rip them apart and the internal, every day struggles of trying to live together at the end of the world.No matter the cost, Reagan refuses to give up Hendrix, Haley and the others that she has come to love so fiercely. She will fight any enemy, against any evil; she will do anything to keep her freedom and the people that have become her life and everything she lives for safe. Love and Decay, Volume Two, is a compilation of the last six episodes in a twelve episode season. This volume includes a bonus episode from Hendrix Parker’s point of view. It is a Dystopian Romance Novella Series about Zombies, the end of the world and finding someone to share it with.This story takes place over multiple episodes, with a release date every two weeks. Episode One, Season Two will release February 14th, 2014.",
  "genres": [
    "Zombies",
    "Romance",
    "Dystopia",
    "Young Adult",
    "Post Apocalyptic",
    "Apocalyptic",
    "Horror"
  ],
  "author": "Rachel Higginson",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/19167968-love-and-decay-vol-two"
}