{
  "title": "Banker",
  "description": "Discover the classic mystery from Dick Francis, one of the greatest thriller writers of all time'Brilliant . . . I was riveted from the first to the last page' 5***** Reader Review' Banker has it murder, heroics, low tricks and high finance. I highly recommend it' 5***** Reader Review'Intelligent, well-paced, will grip you to the end' 5***** Reader Review______Tim Ekaterin has a lot of money. Unfortunately, it belongs to other people, and it is his job to invest it wisely, or get fired.And right now he's taken a big using £5 million to stud a champion racing stallion.When the resulting foals have birth defects, Tim is worried and decides that there may be something else going on at the stables. And when one of those helping with the horses is murdered, his suspicions are confirmed.Now it's not just about money, but about life and death. Determined to get answers, Tim puts himself in danger's path to discover the truth . . .Packed with intrigue and hair-raising suspense, Banker is just one of the many blockbuster thrillers from legendary crime writer Dick Francis.Praise for Dick 'As a jockey, Dick Francis was unbeatable when he got into his stride. The same is true of his crime writing' Daily Mirror'The narrative is brisk and gripping and the background researched with care . . . the entire story is a pleasure to relish' Scotsman'Dick Francis's fiction has a secret ingredient - his inimitable knack of grabbing the reader's attention on page one and holding it tight until the very end' Sunday Telegraph'A regular winner . . . as smooth, swift and lean as ever' Sunday Express'The master of suspense and intrigue' Country Life'Francis writing at his best' Evening Standard'Still the master' Racing Post",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Mystery Thriller",
    "Suspense",
    "Horses"
  ],
  "author": "Dick Francis",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/11069461-banker"
}