{
  "title": "Eighty Days: Nellie Bly and Elizabeth Bisland's History-Making Race Around the World",
  "description": "NATIONAL BESTSELLEROn November 14, 1889, Nellie Bly, the crusading young female reporter for Joseph Pulitzer’s World newspaper, left New York City by steamship on a quest to break the record for the fastest trip around the world. Also departing from New York that day—and heading in the opposite direction by train—was a young journalist from The Cosmopolitan magazine, Elizabeth Bisland. Each woman was determined to outdo Jules Verne’s fictional hero Phileas Fogg and circle the globe in less than eighty days. The dramatic race that ensued would span twenty-eight thousand miles, captivate the nation, and change both competitors’ lives forever.   The two women were a study in contrasts. Nellie Bly was a scrappy, hard-driving, ambitious reporter from Pennsylvania coal country who sought out the most sensational news stories, often going undercover to expose social injustice. Genteel and elegant, Elizabeth Bisland had been born into an aristocratic Southern family, preferred novels and poetry to newspapers, and was widely referred to as the most beautiful woman in metropolitan journalism. Both women, though, were talented writers who had carved out successful careers in the hypercompetitive, male-dominated world of big-city newspapers. Eighty Days brings these trailblazing women to life as they race against time and each other, unaided and alone, ever aware that the slightest delay could mean the difference between victory and defeat.   A vivid real-life re-creation of the race and its aftermath, from its frenzied start to the nail-biting dash at its finish, Eighty Days is history with the heart of a great adventure novel. Here’s the journey that takes us behind the walls of Jules Verne’s Amiens estate, into the back alleys of Hong Kong, onto the grounds of a Ceylon tea plantation, through storm-tossed ocean crossings and mountains blocked by snowdrifts twenty feet deep, and to many more unexpected and exotic locales from London to Yokohama. Along the way, we are treated to fascinating glimpses of everyday life in the late nineteenth century—an era of unprecedented technological advances, newly remade in the image of the steamship, the railroad, and the telegraph. For Nellie Bly and Elizabeth Bisland—two women ahead of their time in every sense of the word—were not only racing around the world. They were also racing through the very heart of the Victorian age.\nLook for special features inside. Join the Random House Reader’s Circle for author chats and more.\n  “What a story! What an extraordinary historical adventure!”—Amanda Foreman, author of A World on Fire   “A fun, fast, page-turning action-adventure . . . the exhilarating journey of two pioneering women, Nellie Bly and Elizabeth Bisland, as they race around the globe.”—Karen Abbott, author of American Rose  “[A] marvelous tale of adventure . . . The story of these two pioneering women unfolds amid the excitement, setbacks, crises, missed opportunities and a global trek unlike any other in its time. . . . Why would you want to miss out on the incredible journey that takes you to the finish line page after nail-biting page?”—Chicago Sun-Times (Best Books of the Year)   “In a stunning feat of narrative nonfiction, Matthew Goodman brings the nineteenth century to life, tracing the history of two intrepid jo",
  "genres": [
    "Nonfiction",
    "History",
    "Travel",
    "Biography",
    "Book Club",
    "Adventure",
    "Historical"
  ],
  "author": "Matthew Goodman",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/19185033-eighty-days"
}