{
  "title": "From the Dark to the Dawn: A Tale of Ancient Rome",
  "description": "Decadent Rome, 61 Anno Domini. The masters of the universe have crushed the Iceni rebellion with an iron hand, slaughtering and enslaving her people.For Philip, his existence as a captive means living to hatred. He despises his rich, young master, resenting his life of servitude and the wrestling feats Marcus forces him to perform. Bitterness engulfs his soul until he only lives for the day when he will crush the might of Rome.Then Christianity enters the picture. Taught by a Jewish breadmaker to know the man called Christus, Philip begins the struggle to forgive and honor his master. But forgiveness is not easy towards one who lives for himself.Marcus Virginius knows nothing but power and pleasure. Destined to a successful career serving Nero in the Praetorian Guard, he wants no part of Christianity. And he is determined to crush Philip’s newfound faith – no matter what it takes.Join Philip and Marcus in their journey of redemption, faith, and forgiveness. Is love enough to conquer hate? And will the light of the gospel ever surmount the darkness of Rome? Persecution abounds – will the two young men survive its terrors and live to experience the bright hope of a new dawn?Endorsement\"Alicia Willis sketches a stirring tale that delivers a powerful message of friendship, forgiveness, and God's grace. An authentic period piece, it leaves you with a greater awareness that God's ways are higher than our ways and we are on this earth for His purposes. Anyone with a bend for historical-fiction will thoroughly enjoy this book. Definitely a moving, worthwhile, and edifying read!\"-Josiah Jost, actor/writer with Jostie Flicks.",
  "genres": [
    "Historical Fiction",
    "Christian Fiction",
    "Historical",
    "Fiction",
    "Christian Historical Fiction",
    "Romance",
    "Christian"
  ],
  "author": "Alicia A. Willis",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/19181802-from-the-dark-to-the-dawn"
}