{
  "title": "German Literary Fairy Tales: Johann Wolfgang von Goethe, Clemens Brentano, Franz Kafka, and others",
  "description": "vii • Foreword (German Literary Fairy Tales) • essay by John Gardnerxiii • Introduction (German Literary Fairy Tales) • essay by Gordon Birrell1 • Fairy Tale • novelette by Johann Wolfgang von Goethe (trans. of Das Märchen? 1795)30 • Fair-Haired Eckbert • novelette by Ludwig Tieck (trans. of Der blonde Eckbert 1797)47 • A Wondrous Oriental Fairy Tale of a Naked Saint • short fiction by Wilhelm Heinrich Wackenroder (trans. of Ein wunderbares morgenländisches Märchen von einem nackten Heiligen? 1797)52 • Klingsohr's Tale • short fiction by Novalis (trans. of Klingsohrs Märchen 1802)77 • Hyacinth and Rosebud • short story by Novalis (trans. of Hyazinth und Rosenblüthe? 1802)81 • The Runenberg • novelette by Ludwig Tieck (trans. of Der Runenberg 1804)102 • The New Melusina • novelette by Johann Wolfgang von Goethe (trans. of Die neue Melusine 1816)121 • The History of Krakatuk • (1833) • short story by E. T. A. Hoffmann (trans. of Das Märchen von der harten Nuß 1816)133 • The Marble Statue • short fiction by Joseph von Eichendorff (trans. of Das Marmorbild 1819) [as by Joseph, Freiherr von Eichendorff]172 • The Tale of the Myrtle-Girl • short fiction by Clemens Brentano (trans. of Das Märchen von dem Myrtenfräulein 1826)184 • The Cold Heart • [Das kalte Herz / The Cold Heart] • novella by Wilhelm Hauff (trans. of Das kalte Herz 1827)221 • The Story of Beautiful Lau • short fiction by Eduard Mörike? (trans. of Die Historie von der schönen Lau 1853)241 • Hinzelmeier: A Thoughtful Story • novelette by Theodor Storm (trans. of Hinzelmeier: Eine nachdenkliche Geschichte 1850)264 • Bulemann's House • novelette by Theodor Storm (trans. of Bulemanns Haus 1864)282 • The Tale of the 672nd Night • short story by Hugo von Hofmannsthal (trans. of Das Märchen der 672. Nacht? 1895)298 • Jackals and Arabs • (1948) • short story by Franz Kafka (trans. of Schakale und Araber 1917)303 • Biographical Notes (German Literary Fairy Tales) • essay by Frank G. Ryder",
  "genres": [
    "Fairy Tales",
    "Literary Fiction",
    "Classics"
  ],
  "author": "Frank G. Ryder",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1106994.German_Literary_Fairy_Tales"
}