{
  "title": "The Path of the Priestess: A Guidebook for Awakening the Divine Feminine",
  "description": "A guide for personal exploration of the path to the divine feminine and the spiritual power of women.• Reveals the essential role of women in creating and maintaining the psychic/energetic/emotional landscape of society.• Explores feminine roles and the archetypal model of the Great Goddess from both Eastern and Western spiritual traditions.• Includes exercises, meditations, and visualizations drawn from ancient techniques to assist women with their spiritual awakening and self-realization.The Path of the Priestess takes readers on a journey deep into the heart of the feminine experience. It describes the author's years of first-hand experience in the ancient arts of Tantra, Dzogchen, and Indian and Egyptian temple dance and healing, as well as her research into the feminine principle in the mystic teachings of the Alchemists, Hebrew Kabbalists, and Christian Gnostics. Beginning with an analysis of the basic issues and frustrations inherent in contemporary society's conditioning of and expectations for women, readers travel back in time to the age of the great temples, schools, and sacred societies in which women still held and transmitted the spiritual light that nourished all of civilization. Through its mythic and historic tales, descriptions of sacred ritual practices, and teachings on the Goddess traditions, The Path of the Priestess provides contemporary women with the means to enter this time-honored path. In keeping with the experientially based teaching methods of these traditions, it also offers exercises and visualizations designed to align women with the powerful, sensuous, and loving energies of the most profound feminine role model that shaped and preserved culture and society--the Great Goddess.",
  "genres": [
    "Spirituality",
    "Goddess"
  ],
  "author": "Sharron Rose",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/19182819-the-path-of-the-priestess"
}