{
  "title": "The Wide Wide Sea: Imperial Ambition, First Contact and the Fateful Final Voyage of Captain James Cook",
  "description": "From New York Times bestselling author Hampton Sides, an epic account of the most momentous voyage of the Age of Exploration, which culminated in Captain James Cook’s death in Hawaii, and left a complex and controversial legacy still debated to this dayOn July 12th, 1776, Captain James Cook, already lionized as the greatest explorer in British history, set off on his third voyage in his ship the HMS Resolution . Two-and-a-half years later, on a beach on the island of Hawaii, Cook was killed in a conflict with native Hawaiians. How did Cook, who was unique among captains for his respect for Indigenous peoples and cultures, come to that fatal moment?Hampton Sides’ bravura account of Cook’s last journey both wrestles with Cook’s legacy and provides a thrilling narrative of the titanic efforts and continual danger that characterized exploration in the 1700s. Cook was renowned for his peerless seamanship, his humane leadership, and his dedication to science-–the famed naturalist Joseph Banks accompanied him on his first voyage, and Cook has been called one of the most important figures of the Age of Enlightenment. He was also deeply interested in the native people he encountered. In fact, his stated mission was to return a Tahitian man, Mai, who had become the toast of London, to his home islands. On previous expeditions, Cook mapped huge swaths of the Pacific, including the east coast of Australia, and initiated first European contact with numerous peoples. He treated his crew well, and endeavored to learn about the societies he encountered with curiosity and without judgment.Yet something was different on this last voyage. Cook became mercurial, resorting to the lash to enforce discipline, and led his two vessels into danger time and again. Uncharacteristically, he ordered violent retaliation for perceived theft on the part of native peoples. This may have had something to do with his secret orders, which were to chart and claim lands before Britain’s imperial rivals could, and to discover the fabled Northwest Passage. Whatever Cook’s intentions, his scientific efforts were the sharp edge of the colonial sword, and the ultimate effects of first contact were catastrophic for Indigenous people around the world. The tensions between Cook’s overt and covert missions came to a head on the shores of Hawaii. His first landing there was harmonious, but when Cook returned after mapping the coast of the Pacific Northwest and Alaska, his exploitative treatment of the Hawaiians led to the fatal encounter.At once a ferociously-paced story of adventure on the high seas and a searching examination of the complexities and consequences of the Age of Exploration, THE WIDE WIDE SEA is a major work from one of our finest narrative nonfiction writers.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Adventure",
    "Audiobook",
    "Travel",
    "World History"
  ],
  "author": "Hampton Sides",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/191746386-the-wide-wide-sea"
}