{
  "title": "Hacia los confines del mundo",
  "description": "La teoría de la evolución de Charles Darwin supuso un verdadero hito en la historia del pensamiento. Al desplazar a Dios como creador único de la especie humana, el gran naturalista británico transformó radicalmente la visión que el hombre moderno tenía de sí mismo, iniciando una revolución conceptual cuyas consecuencias perviven hasta nuestros días. Y si bien el nombre de Darwin quedará inscrito para siempre en los anales de la Historia, menos conocida es la figura del escocés Robert FitzRoy, sin cuya participación la teoría de Darwin nunca hubiese visto la luz.Brillante oficial de la armada, FitzRoy es nombrado capitán del Beagle con tan sólo veintitrés años de edad. Aunque su misión es cartografiar las costas de Tierra del Fuego, él alberga otros proyectos igual de ambiciosos: demostrar la igualdad de los hombres de distintas razas, tesis contraria al espíritu de la época, y ratificar la teoría del origen del mundo tal como lo describe el libro del Génesis. En otoño de 1831, FitzRoy admite a bordo del Beagle al joven Charles Darwin, de veintiún años y aspirante a clérigo, que lo acompañará en la famosa expedición que conmocionaría el mundo. Pese a sus diferentes temperamentos, una sincera amistad unirá a los hombres, que comparten una idéntica pasión por la ciencia. Ambos persiguen denodadamente la verdad, aunque no tardan en comprobar que su concepto de verdad es radicalmente opuesto. Mientras FitzRoy defiende sus creencias religiosas y el «orden natural de las cosas», Darwin madura la teoría que lo haría famoso.Además de un vibrante relato sobre el épico viaje que impactó a la sociedad del siglo XIX, en pleno debate sobre el racismo y la difícil relación entre religión, ciencia y colonialismo, esta magnífica novela —finalista del Premio Booker— es sobre todo una crónica apasionante de la pugna entre dos intelectos excepcionales, a quienes la ciencia convirtió en adversarios irreconciliables, conduciendo a uno a la gloria y al otro a la destrucción.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Adventure",
    "Literary Fiction",
    "Travel",
    "Literature"
  ],
  "author": "Harry Thompson",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/19181854-hacia-los-confines-del-mundo"
}