{
  "title": "The Queen of Four Kingdoms",
  "description": "At the age of nineteen, Yolande of Aragon is sent away from her family, her friends, and everything she knows, to marry the young Duke of Anjou, King Charles VI's first cousin. Their marriage has been arranged to form an alliance between the previously warring kingdoms of Aragon and Anjou, and is politically fraught in a time of great danger and unrest. Yet the union between Yolande and Louis becomes not only a great love story, but also sets in motion events which will change the course of history.As Louis spends more and more time and money fighting in Italy for his claim to the Kingdom of Naples, Yolande is left alone with their six children to govern their lands. But through her charm, fierce intelligence and the clever use of her spies, she becomes the saviour of not just her kingdoms but also of France. Her Royal Highness Princess Michael of Kent unveils this seldom told story, enriched by her own insider's perspective of royal life. The Queen of Four Kingdoms is the epic true story of a rich and riveting period of French and English history, all witnessed by the captivating and complex heroine Yolande.'It was a time of high stakes and high risk, where the right choice might bring a throne in its wake, but the wrong one could lead to the scaffold, of lives wrapped in gilded velvet, but drenched in ambition and blood. Princess Michael takes the reader to the heart of this glamorous, dangerous world, and holds them spellbound. I loved it.' Julian Fellowes'Meticulously researched and powerfully evoked, Princess Michael uncovers the extraordinary life of Yolande of Aragon, the power behind the throne of fifteenth-century France, and the mentor of Joan or Arc.' Philippa Gregory",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Medieval",
    "Fiction",
    "France",
    "Romance",
    "15th Century"
  ],
  "author": "Princess Michael of Kent",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/19186137-the-queen-of-four-kingdoms"
}