{
  "title": "Between Two Trailers",
  "description": "An unforgettable memoir about a girl who escapes her childhood as a preschool drug dealer to earn a divinity degree from Duke University—and then realizes she must confront her past to truly find her way home“Home, it turns out, is where the war is. It’s also where the healing begins.”Born to drug-dealing parents in rural Indiana, Dana Trent is a preschooler the first time she uses a razor blade to cut up weed and fill dime bags for her schizophrenic father, King. While King struggles with his unmedicated psychosis, Dana’s mother, the Lady, a cold and self-absorbed woman whose personality disorders rule the home, guards large bricks of drugs from the safety of their squalid trailer, where she watches TV evangelist Tammy Faye on repeat. Growing up, Dana tries to be the daughter each of her parents wanted: a drug lord’s heir and a debutante minister. But when the Lady impulsively plucks Dana from the Midwest and moves the two of them south, their fresh start results in homelessness and bankruptcy. In North Carolina, Dana becomes torn between her gritty midwestern past and her desire to be a polite southern girl, hiding her homelife of drugs and parents whose severe mental illnesses have left them debilitated.Dana imagines that her hidden Indiana life is finally behind her after she graduates from Duke University and becomes a professor and an ambivalent female Southern Baptist minister. But Dana was a child of the drug trade. Though she escapes flyover country, she realizes that she will never be able to escape her father’s legacy, and that her childhood secrets have kept her from making peace with the people and places that shaped her. Ultimately, Dana finds that no one can really “make it” until they return to where their story home.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Biography",
    "Biography Memoir",
    "Religion",
    "Autobiography"
  ],
  "author": "J. Dana Trent",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/191746539-between-two-trailers"
}