{
  "title": "Margaret's Choice",
  "description": "Originally entitled Margaret's Choice. The wizard’s tower is covered by a veil, which protects it from the elements. The garden that surrounds it is filled with flowers all year round, and its beauty reflects the personality of the wizard who created it all. The view above the woods is enchanting, but those unfortunates bound by gravity see it rising above the woods through a mist, and are drawn to it like a beacon in the night. Margaret Hall is drawn to the tower when she sees a stranger and follows him home. She stands at the white picket fence and marvels at the warmth of the air on the other side. The stranger asks her in for tea, and so starts a relationship that will change Margaret’s life forever. Her friendship with the wizard, Geezer, fills an emptiness in her life and his magic fuels her curiosity. Her old life, on a planet called Pryll, was dark and lonely, but Geezer’s warmth helps Margaret open up and adjust to life in Esher, England – on the planet Tresteria. She fills a void in his life, too. All is well until one day, on a trip to the northern provinces, Geezer introduces Margaret to his old apprentice, Mace, the man who would be king, and Margaret’s heart is pierced by a thunderbolt. She falls instantly in love. Mace’s ambition, however, has placed a wedge between him and his former master. He will do what he has to to win the throne of England and damn those who try to stop him. While he woes Margaret, he makes plans to wed another, the daughter of his former rival, and when Margaret learns of his bride-to-be, she leaves him, but her heart doesn’t forget him. As she and Geezer try to regain their old camaraderie, Margaret discovers she is pregnant, and her fear that Mace will try to claim her child as an heir, forces Geezer to strengthen the veil around the tower to protect the lady he loves. In time, though, Mace does return to Esher, and Margaret’s fears grow when she wakes one morning to find the king’s men standing near the fence surrounding the tower. The Tower in the Mist is a romantic, medieval story of a thousand-year-old wizard and the woman who captures his heart.",
  "genres": [],
  "author": "Amy Jambor",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/19188802-margaret-s-choice"
}