{
  "title": "The Complete Borrowers",
  "description": "A complete collection of the classic Borrowers stories by Mary Norton.The Borrowers: The Borrowers own nothing at all; they live in the secret places of quiet old houses - behind the mantelpiece, inside the harpsichord, under the kitchen clock. Everything they have is borrowed from the 'human beans', who don't even know they exist. Arrietty's father, Pod, is an expert Borrower - he can scale curtains using a hatpin and bring back a doll's teacup without breaking it. Girls aren't supposed to go borrowing but as Arrietty is an only child her father breaks the rule. But then Arrietty makes friends with a boy - a 'human bean' - and from that moment danger is never far away for, above all else, they must avoid the great disaster of 'being seen'.The Borrowers Afield: The Pod family escape to the fields where their cousins live, but it's a long and dangerous journey. At last they find a new home and adapt to country life.The Borrowers Afloat: Homeless again, Arrietty looks forward to a life away from the dark country cottage, to one full of sunshine.The Borrowers Aloft: The family are now living in the model village of Little Fordham - a complete village tailored to their size. All they have to do is avoid being seen by the visitors, but one night the owner of a rival village comes with a cardboard box ready to catch them . . .The Borrowers Avenged: Pod, Homily and Arrietty have managed to escape with the help of Spiller. They move into the old rectory where they live happily until the Potters come looking for them. After a horrifying encounter in the church, the Potters get their just desserts and the Borrowers can live peacefully once and for all.Poor Stainless: Young Stainless, a Borrower boy, goes missing on a mission to borrow some parsley and an enormous search ensues.Mary Norton was born in 1903 and brought up in a house in Bedfordshire, which was to become the setting for The Borrowers. First published in 1952, The Borrowers was an imediate success, winning the Library Association's Carnegie Medal. There followed four more Borrowers books: The Borrowers Afield (1955), The Borrowers Afloat (1959), The Borrowers Aloft (1961) and The Borrowers Avenged (1982). Poor Stainless was the last Borrowers story Mary Norton wrote. She died in 1992.",
  "genres": [
    "Childrens",
    "Classics",
    "Fiction",
    "Fantasy",
    "Adventure",
    "Middle Grade",
    "Young Adult"
  ],
  "author": "Mary Norton",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/1919241.The_Complete_Borrowers"
}