{
  "title": "Pledge of Allegiance & Swastika Secrets",
  "description": "Nazi salutes and Nazi behavior originated from the U.S.A.'s Pledge of Allegiance. The Nazi swastika represented crossed S-letters for \"socialism\" under the Nazis (the National Socialist German Workers Party). The Pledge was written in 1892 by Francis Bellamy. Francis was cousin to Edward Bellamy, author of an international bestseller in 1888 that launched the nationalism movement. Edward's book was translated into every major language, including German. Francis and Edward were both self-proclaimed socialists in the Nationalism movement and they promoted military socialism. The Bellamys wanted government to take over all schools. When the government granted their wish, the government's schools imposed segregation by law and taught racism as official policy. Government schools also forced robotic chanting to flags. All of that behavior even outlasted German National Socialism (or Nazism, although German National Socialists did not call themselves Nazis, they called themselves Socialists and National Socialists). In addition to the notorious salute, American socialists also bear some blame for the notorious symbol used by the National Socialist German Workers Party on its flag. Edward Bellamy worked with the Theosophical Society, another socialist group, and during that time the Theosophical Society used the symbol adopted later by German National Socialists. It is commonly called a swastika, although German socialists called it a Hakenkreuz (hooked cross).Although an ancient symbol, the swastika was altered for use as overlapping S-letters for 'socialism.' It was turned 45 degrees from the horizontal and was oriented in the S-direction to highlight the overlapping S-letters for \"socialism.\" Similar alphabetic symbolism was used in the SS division and similar symbolism is still visible today, every day, on the streets as Volkswagen logos. As part of the anti libertarian practice, people were persecuted for refusing to perform the straight-arm salute and mechanical chanting to the national flag. That happened at the same time in the USA and in Germany. The Pledge's early right-arm salute was not an ancient Roman salute. The ancient Roman salute is a myth. Professor Curry showed that the 'ancient Roman salute' myth came from the Pledge. Take the Pledge not to Pledge. Stop kissing the government's butt every morning. Remove the pledge from the flag. Remove flags from schools. Remove schools from government. For more information visit the site that archives the work of the nation's leading authority on the Pledge of the historian Dr. Rex Curry.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Ian Tinny",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/19194438-pledge-of-allegiance-swastika-secrets"
}