{
  "title": "Drusilla Blood",
  "description": "A gripping and epic occult and archaeology adventure thriller where the past and present weave together in a tale of passion, intrigue, murder and the supernatural.  ‘God, have pity. Help us.’ Edith screamed as her head was forced back by the maelstrom that roared around them. She fought to close her eyes, to shut out the snarling face feasting upon Jago’s swollen tongue. The ceremony was not going well…  1911: Edith Sanguine holds a playful séance that goes terribly wrong. Present day: Drusilla Blood, a disgraced archaeologist with a disastrous love life, plunges into a raging fire at a pagan festival and escapes the searing flames miraculously unharmed.  Two young women, separated by generations, share a sinister fate; possession by an ancient being, a sadistic and powerful entity bent on destruction and revenge. Can Drusilla Blood end the malignant legacy that Edith set in motion, hindered by those that wish to control its power for their own ends? An epic action packed race against time that travels through the darkness of Pagan Iron Age sacrifice in the desolate moors of Northern England, the heat of the Great War Egyptian desert, back to the present day and a world oblivious of the horror that threatens to engulf it.  Praise for Drusilla Blood:  ‘If Stephen King had a love child with Kate Mosse (writer!) she would be called Drusilla Blood.’ Amazon review ‘Big dollops of humour, sex and horror, like an even darker, X-rated, Wuthering Heights.’ Amazon review ‘Suspense galore and beautifully written, I highly recommend this book to anyone who is a fan of the supernatural’ Amazon review  'A terrific read, a fresh take on the paranormal genre' Orion. 'Loved the detail and energy of Drusilla Blood' Sphere 'Loved the atmosphere and the way Miriam Cooke mixes the contemporary and the historical.' Macmillan",
  "genres": [
    "Paranormal",
    "Mystery",
    "Thriller",
    "Horror",
    "Fantasy"
  ],
  "author": "Miriam  Cooke",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/19192341-drusilla-blood"
}