{
  "title": "Beethoven: Der einsame Revolutionär.",
  "description": "«Dieses junge Genie verdiente Unterstützung, daß er reisen könnte. Er würde gewiß ein zweiter Wolfgang Amadeus Mozart werden, wenn er so fortschritte, wie er angefangen.» Magazin der Musik, 1783 Als Ludwig van Beethoven – vermutlich am 16. Dezember 1770 – in Bonn geboren wurde, ließ nichts auf die einzigartige Bedeutung erahnen, die er in der Musikwelt seiner Zeit und künftiger Jahrhunderte erlangen sollte. Zwar entstammte er einer Musikerfamilie, doch hatten Familienangehörige vorangegangener Generationen musikalisch kaum mehr als einen lokalen Bekanntheitsgrad erlangt; dafür aber weiß die Überlieferung von seelischen Problemen und einer fatalen Neigung zum Alkohol in seinem engsten Verwandtenkreis. Vor diesem familiären Hintergrund fällt es schwer, den Werdegang Beethovens zur Ausnahmeerscheinung zu verstehen, ohne den Begriff «Genie» zu bemühen. Jedenfalls erhielt der kleine Ludwig eine klassische Ausbildung zum Musiker, in deren Verlauf bereits früh sein außergewöhnliches Talent bemerkt wurde und sich bald in Gestalt des Berufsmusikers Christian Gottlob Neefe ein Lehrer und Förderer fand, der richtungsweisend auf Beethovens weiteren Weg einwirkte. Und der führte unabweislich nach Wien, wo Beethoven bei großen Meistern seiner Epoche – allen voran Joseph Haydn, aber auch Johann Georg Albrechtsberger und Antonio Salieri – lernen und Zugang zu dem Kreis der Fürsten Karl von Lichnowsky und Franz Joseph Maximilian von Lobkowitz finden sollte. Er nahm Wien nicht im Sturm: Das Revolutionäre seiner Kompositionen – seiner Orchester- und seiner Klavierwerke – war zum Leidwesen des Komponisten nicht unumstritten, aber letztlich doch bezwingend; und so drang sein Ruhm bis zur kaiserlichen Familie vor, deren Spross, Erzherzog Rudolph von Österreich, schließlich sein Schüler wurde. Doch alle musikalischen, gesellschaftlichen und mitunter auch finanziellen Erfolge linderten kaum die Verzweiflung, die Beethoven empfand, als er sich bewusst wurde, dass er – vermutlich als Spätfolge einer Infektionskrankheit – allmählich ertaubte und dass er wegen der herrschenden Konventionen niemals seine «unsterbliche Geliebte» würde heiraten können. Aber er trotzte seinem Schicksal und schuf Werke, deren bestürzender Schönheit wir uns bis auf den heutigen Tag nicht entziehen können. Jan Caeyers hat Leben und Werk Beethovens in einer von großer Sympathie für seinen Protagonisten getragenen, aber nie hagiographischen Biographie zusammengeführt und zugleich ein faszinierendes Epochenporträt entworfen. Abbildungen können aus lizenzrechtlichen Gründen leider nicht im E-Book angezeigt werden.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Classical Music",
    "History",
    "Biography Memoir",
    "European History"
  ],
  "author": "Jan Caeyers",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/19188363-beethoven"
}