{
  "title": "Flight 714 to Sydney",
  "description": "One of the most iconic characters in children’s books \t\t\t\tThe world’s most famous travelling reporter goes Down Under.\t\t\t\tTintin, Captain Haddock and Professor Calculus are on their way to Sydney, Australia. Through a chance meeting they are invited to travel on board the private jet of billionaire Lazlo Carreidas. But then they fall victim to a plot to kidnap Carreidas and are captured by Tintin's arch enemy Rastapopoulos.\t\t\t\tJoin the most iconic character in comics as he embarks on an extraordinary adventure spanning historical and political events, and thrilling mysteries. Still selling over 100,000 copies every year in the UK and having been adapted for the silver screen by Steven Spielberg and Peter Jackson in 2011.\t\t\t\tThe Adventures of Tintin continue to charm more than 80 years after they first found their way into publication. Since then an estimated 230 million copies have been sold, proving that comic books have the same power to entertain children and adults in the 21st century as they did in the early 20th.\t\t\t\tHergé (Georges Remi) was born in Brussels in 1907. Over the course of 54 years he completed over 20 titles in The Adventures of Tintin series, which is now considered to be one of the greatest, if not the greatest, comics series of all time. \t\t\t\tHave you collected all the graphic novel adventures?\t\t\t\tTintin in the Land of the SovietsTintin in AmericaTintin: Cigars of the PharaohTintin: The Blue LotusTintin: The Broken EarTintin: The Black IslandTintin: King Ottakar’s SceptreTintin: The Crab with the Golden ClawsTintin: The Shooting StarTintin: The Secret of the UnicornTintin: Red Rackham’s TreasureTintin: The Seven Crystal BallsTintin: Prisoners of the SunTintin: Land of Black GoldTintin: Destination MoonTintin: Explorers of the MoonTintin: The Calculus AffairTintin: The Red Sea SharksTintin in TibetTintin: The Castafiore EmeraldTintin: Flight 714 to SydneyThe Adventures of Tintin and the PicarosTintin and Alph-Art",
  "genres": [
    "Graphic Novels",
    "Bande Dessinée",
    "Adventure",
    "Comics",
    "Fiction",
    "Childrens",
    "Comic Book"
  ],
  "author": "Hergé",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/192043.Flight_714_to_Sydney"
}