{
  "title": "Freedom from Ego Games",
  "description": "A comprehensive guide to how you can avoid wasting your life on the fruitless games played by the human egoToday many people are trapped within tight boundaries defined by the ego games--the games of survival, security, power, control, competition, validation, responsibility and blame. With penetrating insight, the ascended master Jesus teaches that on our spiritual journey the human ego plays games that are very similar to the ones played by Frankenstein's \"The story of Doctor Frankenstein was inspired by the ascended masters in order to illustrate one of the fundamental properties of the ego. The plot is simple, namely that a doctor - with seemingly benign motives - stitches together dead body parts and infuses them with life. Once the creature has received a form of life, it displays a survival instinct that makes it willing to kill anyone standing in its way, even its own creator.\"Jesus teaches through practical steps that spiritual rebirth requires us to voluntarily and consciously - if it is not conscious, it cannot be voluntary - let the old human identity die and accept that we are reborn into a higher spiritual sense of identity. You will learn how make LIFE decisions that turn your life experience positive  recognize the ego games and the illusions that hold back your personal growth  avoid having your life consumed by the ego's quest for security  overcome the ego's survival, control, validation, blame and competition games and find true validation from your spiritual self  take responsibility for yourself and stop feeling responsible for other people  \"A person who controls the world is still inferior to one who controls his or her own mind. True personal power means that in any situation you encounter on earth, you can choose your reaction freely. Instead of reacting through one of the games of the ego, you can react by being the open door for your I AM Presence and the power of God.\"                       - Jesus",
  "genres": [],
  "author": "Kim Michaels",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/19201056-freedom-from-ego-games"
}