{
  "title": "The Evolution of Vaughn",
  "description": "Vaughn, a human born on a distant planet long after earth has been destroyed, is the first of his race to be invited to the prestigious Fogerian War Institute. After glory in the Fogerian War with the parasitic E'Clei, Vaughn is raised to the rank of Captain, and given command of The Reetus for the duration of the conflict. Long after the war, Vaughn is married and lives a simple life, mining his remote moon for a precious mineral and raising his son. He arrives home from a routine business trip to find dead members of an ancient human cult called The Maxists littering his moon. Vaughn goes on a quest to find out what happened. The action heats up when he discovers his son is still alive, and has being held heart of E'Clei territory. Going to get his son could disrupt the shaky cease-fire between the Fogerians and the E'Clei, igniting an all new war. Leaving his son in the hands of the parasites he spent so much of his life fighting is not an option. How far will he go to retrieve his son and exact justice from those responsible? A review from Amazon.co.uk By G C Peterson Edition What can be said about (what is hopefully the 1st of many outings for Vaughn Troupe) about Vaughan? During the book he comes across as the perfect mix of our favourite lovable rogue heroes that populate the genre. Part smuggler, a soupçon of mercenary, a sprinkle of war hero, and a father to the core. All tied up in a package that you really don't want to shake up or get on the wrong side of......... Obviously that's exactly what someone seems intent on doing. It's safe to say that in a crowded bar/cantina there would be no doubt whatsoever about Vaughn shooting first :-) The universe around which the plot unfolds is nicely crafted. Humans certainly aren't at the apex. The aliens that are abundant certainly outclass humans in many important aspects, however it soon becomes clear that they don't have that spark of drive or ingenuity. And it's this that gives Vaughn the edge. A great read, and it's always nice to see real life scientific theories drawn into fiction (Alcubierre calculations used extensively for FTL travel). My favourite part of the book. It's just a really simple well written paragraph in the middle of the book, which has a young Vaughn explaining the true meaning of parenthood to an alien, simple but beautiful. So treat yourself to this book.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Kirk Allmond",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/19201314-the-evolution-of-vaughn"
}