{
  "title": "Rozabal Line: Book 1 in the Bharat Series of Historical and Mythological Thrillers",
  "description": "A complex yet interesting plot, a taste of many centuries and religions, a touch of terror and a mystery behind Jesus being alive is what goes into The Rozabal Line. Written by Ashwin Sanghi, a thriller fiction writer, this book showcases a cult of visionaries who believe that Jesus escaped crucifixion and lived somewhere in Kashmir, India. With a story well-knit, The Rozabal Line received its title from the Rozabal shrine in India.The story revolves primarily around an American priest, Father Vincent Morgan, who receives visions of Jesus' crucifixion simultaneously getting dreams of the life he might have lived in the past. While this part of the story grows, a lady finds a box in the library in the place where Mahabharata books were supposed to be kept. And there follows a scream before the lady faints. What lies in the box is a mystery for the readers to discover. This kick-starts the chain of secrets and terror in the story that readers experience. While in one part of the world these events are taking place, on the other side evolve thirteen people forming a terror group named Lashkar-e-Talatashar. A prediction that a new messenger is coming, Egyptian myths, the Aztec prophecy and pieces of Greek mythology, all combine to make this book an intriguing connection between religions and cultures.Westland Publishers published this book in 2012. They have made this book available in paperback binding with 384 pages.Key Features•The content of the book was hypothetically mapped with some events of the Mumbai attack in November 2008, after which the book gained tremendous amount of readership.•The Rozabal Line was first released under the pseudonym of Shawn Haigins.Ashwin Sanghi and Amish Tripathi are considered to be the frontrunners in historical and mythological retelling. This book is part of that trend.",
  "genres": [
    "Fiction",
    "Thriller",
    "Historical Fiction",
    "Indian Literature",
    "Mythology",
    "Mystery",
    "India"
  ],
  "author": "Ashwin Sanghi",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/19202921-rozabal-line"
}