{
  "title": "Garland Rose",
  "description": "What would you do, if a menacing stalker was threatening your life? For Kathy Meadows this isn’t a philosophical question, but a fact of life. A psychotic madman who calls himself, The Doctor, is stalking her calling her at all hours, day and night. When famous rock star Joel Garland learns of the danger he steps in to protect her, and enlists his cousin, Nicholas Stone, to help capture the creep. Disgruntled at having been roped into chaperoning her three teenaged nieces to a Garland Rose concert, Kathy Meadows is not happy to be there. The only positive aspect in having been so manipulated by her siblings, was the fact that here at the concert, she wasn’t being hounded by the parade of bachelors her matchmaking parents kept setting on her. Being the youngest and only unmarried daughter of ten kids, Kathy’s parents are determined to change her single status into a married one, much to her dismay. Happily ruminating on having successfully ditched two of her more persistent Romeo wannabes, from escorting her to the concert, Kathy looks up and is startled to find a pair of interested male eyes trained on her person. At first, she thought he must have been looking at someone else, for it was hard for her to believe that a man as sexy and handsome as he was could possibly be interested in her, not without some kind of incentive from her parents. However, before she could find out who he was, and why he was gazing at her, the man disappeared into the crowd around them. Kathy found herself wondering who the sexy. mystery man was, but not for long. All too soon, she discovers that her mysterious stranger is none other than the legendary and famous Joel Garland, Garland Roses’ leader and lead-singer. With a sinking heart, Kathy realizes he is way out of her league, and that once the concert is over, she’d never see him again. But fate is to prove this prediction wrong, for little did she know how important Joel Garland and his friends would soon become to her life and wellbeing, as an unknown menace, who calls himself “The Doctor” stalks and threatens her very life… Joel and Kathy’s romance is the first story, in an eight-book series which follows the lives and loves of the famous Garland Roses rock stars and their family and friends",
  "genres": [
    "Romantic Suspense"
  ],
  "author": "Kathryn L.M. Reynolds",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/19198340-garland-rose"
}