{
  "title": "84 Ribbons: A Dancer's Journey",
  "description": "Seventeen year old Marta Selbryth realizes her dream of becoming a professional dancer when the Intermountain Ballet Company in Billings, Montana invites her to join their 1957 season. As Marta's new life unfolds, she must learn to face not only the successes of dancing in the corps de ballet, but the challenges and setbacks that might crush the dream she's had for so long.After a couple of mishaps, Marta settles into life in a boarding house located near the ballet company. Her landlady, Mrs. B., is friendly, reduces her rent when Marta's offers to bake for the boarder and later allows her to use the basement as a practice studio. The two male boarders are supportive; Carol, a fellow boarder, ignores her.Marta spends her free time practicing when she's not spending time with her new friends Lynne and Bartley,her fellow corps dancers. Their time together becomes an important lifeline through their first year.Madame Cosper, the artistic director, is a demanding woman. Marta begins their association poorly when shemakes a disastrous choice. Expecting expulsion, Marta receives a second chance in the form of dancing the unpopular character roles during the fall and winter performances.Marta determines to dance every role with confidence in hopes of proving to Madame that she's up for every challenge.Steve, a young college man and a reporter, spots Marta when he's assigned to write an article about ballet for the local paper. He's attracted to her and begins his pursuit.Over the months ahead, he becomes her tour guide of the area and attempts to convince Marta to be his girl. But her steadfast focus is ballet and some of her adventures with him lead to problems with Madame Cosper.Shortly after Christmas, everything changes for Marta, Bartley and Steve. Significant events permanently influence their lives. Each must deal with exhilaration and heartbreak as well as frustration and changes that test their ability to cope.",
  "genres": [
    "Young Adult",
    "Fiction",
    "Historical Fiction",
    "Historical",
    "New Adult"
  ],
  "author": "Paddy Eger",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/19212429-84-ribbons"
}