{
  "title": "I am Enough: Journal Affirmations for Girls",
  "description": "Excellent as a journal for one girl or as a tool to use in a group setting for writing and discussion. Each entry covers a different topic and then allows space for the reader to do their own writing. Topics are particularly relevant today, such as the entry, \"I am not a Measurement.\" Doesn't talk down or issue simple edicts, such as \"love yourself,\" but takes a different approach, which respects intelligence and individuality. There is an emphasis on empowerment, self-esteem and personal accountability. An affirmation on its own is a powerful thing. However, flexing the muscle of an affirmation with the conscious expression of your own words, thoughts and experiences is a transformative thing. Use this affirmational journal to not only absorb the powerful messages in each affirmation, but to accentuate them tenfold by the expressions of your own creation. There can be not the slightest shred of doubt that you are enough as you are. This book of empowering affirmations for girls makes this point absolutely clear. Use the notes pages to journal your thoughts as you affirm this truth. You are Enough.  I am not a Measurement I am not a measurement A set of numbers Their relevance determined by others In a society that seeks constant judgment A computation of my proportions Against garish standards Dividing the good and the bad According to some scale Created in absurdity In some strange twist of fate A crooked line in humanity's development I am not a computation on a bell curve A dot on a graph I refuse to be measured On any scale Not wrought of my own design The dial turning The arrow pointing In a direction of my choosing And mine alone For there is no equation Capable of measuring me My complexities surpass the ability To be analyzed by numbers Meant to fit inside boxes I reject the proposition That places me on any scale I am not a measurement",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Parenting",
    "Childrens",
    "Feminism"
  ],
  "author": "Elizabeth D. Gray",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/19223104-i-am-enough"
}