{
  "title": "Trapped with Sex-Starved Aliens",
  "description": "THE ALL ROMANCE EBOOKS BESTSELLER!Alicia Conifer is having a hard time with her starcraft pilot, John Hanson. His overwhelming good looks and caustic tongue are distracting. But she has to graciously put up with him anyway for two whole weeks on the planet, Norbu, where she plans to study the flora and fauna.They are not alone, however.They are soon kidnapped, stripped and subjected to indignities by the natives - who seem to be partial to her voluptuous body and John's impressive manhood. But Alicia discovers that the Norbuans have two sexual appendages and a mysterious telepathic ability that has far-reaching consequences for all of them. How much of her body must she give up to learn their secrets?This is a sci-fi erotica novelette at 14,500 words and is written as an erotic homage to Avatar and John Carter.NEW! TRAPPED WITH SEX-STARVED ALIENS 2!READ AN EXCERPT chieftain crooks a finger and beckons them to come closer. They drag her, tugging her forward by her arms. She gives a strangled cry as she stares into the eyes of the alien chief. He's very tall. Taller than the rest of the Norbuans. At least nine feet in her estimate. His eyes are dark pools of obsidian, and his pupils almost take up the entire span of his visible eyeballs. His smooth skin is glowing and orange, and his nostrils are two slits in a high cheek-boned face. His mouth has almost no lips. Why is he looking at her as though he would like to eat her?His hand reaches for her left breast. He has a curious expression on his face - as though he has never seen a breast before. He may well not, judging from the flat chests of the Norbuan women. She holds her breath as his three-fingered and one-thumbed hand caresses her flesh. He cups her mound and raises it. His touch is silken and very warm. One of his long tapering three-jointed fingers brushes across her nipple, causing the tip to tense and fill with blood.She begins to breathe faster.His other hand does the same to her left breast. Soon, he is feeling her tits all over - prodding them, weighing them, squeezing them in the manner of a scientist studying a genetically-enhanced melon. She is aware of John's hot gaze upon her. \"Is he hurting you?\" he asks between his teeth. \"No,\" she says truthfully.The chieftain steps back and makes a gesture. The two Norbuans who are holding her arms bend down to hoist her up by both thighs. She gives a little shriek as they lift her off the ground. They open her thighs wide, holding her by the waist and buttocks. Her pussy is splayed before the chieftain.",
  "genres": [],
  "author": "Aphrodite Hunt",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/19224584-trapped-with-sex-starved-aliens"
}