{
  "title": "Diego y Frida",
  "description": "Cuando Frida anuncia su intención de casarse con Diego Rivera, el padre de ella hace este áspero comentario: \"Serán las bodas de un elefante y una paloma\". Todo el mundo recibe con escepticismo la nueva del matrimonio de esta muchacha turbulenta pero de frágil salud con el \"genio\" de los muralistas mexicanos, que le dobla la edad, pesa el triple que ella y tiene reputación de \"ogro\" y de seductor; comunista ateo que osa pintar, en honor de los indios, frescos en los que incita a los obreros a tomar machetes y fusiles para derrocar a la trinidad demoníaca de México: el cura, el burgués, el hombre de leyes.Diego y Frida cuenta la historia de una pareja fuera de lo común. La historia de su encuentro, el pasado grávido de Diego y la experiencia de dolor y de soledad de Frida. La fe de ambos en la revolución y su encuentro con Trotski y Breton. El papel, en fin, de ambos en la renovación del mundo del arte.Extraña historia de amor, que se construye y expresa por medio de la pintura, mientras que Diego y Frida lleva a cabo una obra a la vez desigual y complementaria. El arte y la revolución son los únicos puntos en común de estos dos seres que exploraron todas las formas de la sinrazón. Frida es, para Diego, una mujer dotada de la magia que vislumbró con su nodriza india y, para Frida, Diego es el niño todopoderoso que no pudo llevar en su vientre. Forman, pues, una pareja indestructible mítica, tan perfecta y contracditoria como la dualidad mexicana primordial: Ometecuhtli y Omecihuatl.Cuando fallece a los 46 años Frida deja el insoportable recuerdo de su ardor, de su inquieta belleza reflejada en los espejos vacíos. A pesar del torbellino de honores que rodea a Diego, la soledad lo abruma: muere en 1957, tres años después de ella.",
  "genres": [
    "Biography",
    "Art",
    "Nonfiction",
    "France",
    "History",
    "Nobel Prize",
    "Cultural"
  ],
  "author": "J.M.G. Le Clézio",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/1921328.Diego_y_Frida"
}