{
  "title": "The World of Yesterday: Memoirs of a European",
  "description": "Stefan Zweig's memoir The World of Yesterday, (Die Welt von Gestern) is a unique love letter to the lost world of pre-war Europe The famous autobiography is published by Pushkin Press, with a cover designed by David Pearson and Clare Skeats. Translated by the award-winning Anthea Bell.Stefan Zweig's memoir, The World of Yesterday recalls the golden age of pre- war Europe its seeming permanence, its promise and its devastating fall. Through the story of his life, and his relationships with the leading literary figures of the day, Zweig s passionate, evocative prose paints a stunning portrait of an era that danced brilliantly on the brink of extinction.This new translation by the award- winning Anthea Bell captures the spirit of Zweig's writing in arguably his most important work, completed shortly before his death in a suicide pact with his wife in 1942.The World of Yesterday is one of the greatest memoirs of the twentieth century, as perfect in its evocation of the world Zweig loved, as it is in its portrayal of how that world was destroyed.'— David Hare'This absolutely extraordinary book is more than just an autobiography. (...) This is a book that should be read by anyone who is even slightly interested in the creative imagination and the intellectual life, the brute force of history upon individual lives, the possibility of culture and, quite simply, what it meant to be alive between 1881 and 1942. That should cover a fair number of you.'— Nicholas Lezard, GuardianTranslated from the German by Anthea Bell, Stefan Zweig's The World of Yesterday, is published by Pushkin Press.Stefan Zweig (1881-1942) was born in Vienna, into a wealthy Austrian-Jewish family. He studied in Berlin and Vienna and was first known as a poet and translator, then as a biographer. Zweig travelled widely, living in Salzburg between the wars, and was an international bestseller with a string of hugely popular novellas including Letter from an Unknown Woman, Amok and Fear.In 1934, with the rise of Nazism, he moved to London, where he wrote his only novel Beware of Pity. He later moved on to Bath, taking British citizenship after the outbreak of the Second World War. With the fall of France in 1940 Zweig left Britain for New York, before settling in Brazil, where in 1942 he and his wife were found dead in an apparent double suicide.Much of his work is available from Pushkin Press.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Memoir",
    "German Literature",
    "Literature",
    "20th Century"
  ],
  "author": "Stefan Zweig",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/19216831-the-world-of-yesterday"
}