{
  "title": "Puoi guarire la tua vita",
  "description": "Dimmi come hai vissuto e ti dirò come guarire: la storia della nostra vita può indicarci la strada verso la guarigione e l’evoluzione personale e spirituale.Il libro cult della new age - Best seller internazionale - Nuova edizioneTradotto in 39 lingue e distribuito in 35 nazioni.Un giorno a Louise Hay viene diagnosticato un cancro e i medici la informano che le restano solo pochi mesi di vita. Di fronte a questa tragica realtà Louise riesamina le tappe principali della sua vita giungendo alla conclusione che la malattia è il risultato di esperienze negative, rabbia repressa e angoscia non esternate.Da qui nasce la sua profonda convinzione che per sconfiggere il cancro - e la malattia in generale - sia necessario rivoluzionare il proprio stile di vita e aprirsi all’amore e al perdono, all’insegna di uno spirito ottimistico e avvalendosi di atteggiamenti positivi e proattivi come mezzi efficaci per combattere la malattia e l’inquietudine interiore. La filosofia del pensiero positivo, di cui Louise Hay è diventata la massima ispiratrice mondiale, è stata alla base della sua completa guarigione e l’ha spinta ad aiutare il prossimo condividendo gli insegnamenti tratti da quel periodo di profonda trasformazione ed evoluzione personale. Parte Prima: IntroduzioneSuggerimenti al lettoreAlcuni punti della mia filosofiaCapitolo Uno: Ciò in cui credo Parte Seconda: Una sessione con LouiseCapitolo Due: Qual è il problema?Capitolo Tre: Da dove viene?Capitolo Quattro: È vero?Capitolo Cinque: Cosa facciamo ora?Capitolo Sei: Resistenza al cambiamentoCapitolo Sette: Come cambiare\tCapitolo Otto: Costruire il nuovo\tCapitolo Nove: Lavoro giornaliero Parte Terza: Mettere in pratica queste ideeCapitolo Dieci: Le relazioniCapitolo Undici: Il lavoro\tCapitolo Dodici: Il successoCapitolo Tredici: La prosperitàCapitolo Quattordici: Il corpoCapitolo Quindici: L’Elenco Parte Quarta: ConclusioneCapitolo Sedici: La mia storia",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Spirituality",
    "Health",
    "Psychology",
    "Personal Development",
    "Inspirational"
  ],
  "author": "Louise L. Hay",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/19217535-puoi-guarire-la-tua-vita"
}