{
  "title": "Biblical Eschatology",
  "description": "Biblical Eschatology provides what is not found in any other single volume on it analyzes all the major eschatological passages (including the Olivet Discourse and the book of Revelation), issues (including the second coming of Christ, the millennium, the rapture, and Antichrist), and positions (including all the major views of the millennium) in a clear, but not superficial, way. The book concludes with a chapter showing how eschatology is relevant for our lives. Biblical Eschatology makes understanding eschatology easier by including chapters on how to interpret prophecy and apocalyptic literature, by showing the history of eschatological thought, and by placing eschatology in the context of the Bible’s overall story line and structure. Clarity and understanding are enhanced by the use of comparative tables and appendices. Subject and Scripture indexes are included. The book interacts with the best of Evangelical and Reformed scholarship, and the extensive bibliography (which includes the Web addresses of many resources that are online) provides an excellent source for the reader’s further study. This is a perfect resource for intelligent Christians, including pastors, students, and teachers, who desire to understand eschatology and to see how it fits together with the rest of the Bible.“I want to commend Jonathan Menn’s Biblical Eschatology heartily. This book performs a great service for the church, precisely because it is comprehensive in its treatment of all the major eschatological passages in Scripture, detailed and clear in its analysis, fair in its assessments, and passionate in its convictions. Menn identifies the importance of eschatology through its connections with the overall story line of the Bible. He helps us with important principles and guidelines for interpreting eschatological texts. And his passion for the truth of Scripture and its practical impact in the life and ministry of the church is inspiring.”—Steven C. Roy, Associate Professor of Pastoral Theology, Trinity Evangelical Divinity SchoolJonathan Menn is the Director of Equipping Church Leaders-East Africa, after having served as East Africa Director of Equipping Pastors International for six years. He travels regularly to East Africa, where he teaches pastors and church leaders. His extensive written teaching materials on biblical subjects are available at www.eclea.net. He may be contacted at jonathanmenn@yahoo.com.",
  "genres": [
    "Theology"
  ],
  "author": "Jonathan Menn",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/19223994-biblical-eschatology"
}