{
  "title": "Women Don't Ask: Negotiation and the Gender Divide",
  "description": "When Linda Babcock asked why so many male graduate students were teaching their own courses and most female students were assigned as assistants, her dean said: \"More men ask. The women just don't ask.\" It turns out that whether they want higher salaries or more help at home, women often find it hard to ask. Sometimes they don't know that change is possible--they don't know that they can ask. Sometimes they fear that asking may damage a relationship. And sometimes they don't ask because they've learned that society can react badly to women asserting their own needs and desires.By looking at the barriers holding women back and the social forces constraining them, Women Don't Ask shows women how to reframe their interactions and more accurately evaluate their opportunities. It teaches them how to ask for what they want in ways that feel comfortable and possible, taking into account the impact of asking on their relationships. And it teaches all of us how to recognize the ways in which our institutions, child-rearing practices, and unspoken assumptions perpetuate inequalities--inequalities that are not only fundamentally unfair but also inefficient and economically unsound.With women's progress toward full economic and social equality stalled, women's lives becoming increasingly complex, and the structures of businesses changing, the ability to negotiate is no longer a luxury but a necessity. Drawing on research in psychology, sociology, economics, and organizational behavior as well as dozens of interviews with men and women from all walks of life, Women Don't Ask is the first book to identify the dramatic difference between men and women in their propensity to negotiate for what they want. It tells women how to ask, and why they should.",
  "genres": [
    "Nonfiction",
    "Business",
    "Feminism",
    "Self Help",
    "Womens",
    "Leadership",
    "Psychology"
  ],
  "author": "Linda Babcock",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/192313.Women_Don_t_Ask"
}