{
  "title": "Stop Whining, Start Living",
  "description": "Dr. Laura Schlessinger agrees that there are things worth whining about! A certain amount of whining allows for some venting of reasonable pain, disappointment, fear, frustration, or frank rage. However, staying stuck in whining mode can become a life-long problem. This is where Dr. Laura steps in with Stop Whining, Start Living to help folks conquer the temptation to retreat from living life to the fullest.As she reveals in her introduction, \"No matter what you've suffered or continue to suffer, while you are alive you have the opportunity to get something from this life, and I'm going to do my best to help you with that. . . . I know of what I speak, as this has been my torturous journey also.\" Building on the principles developed during her long career as a licensed marriage and family therapist, and addressing the chronic struggles of so many of her listeners and readers, Dr. Laura issues an important message in the no-nonsense but compassionate voice that is her trademark: If you don't like your life, quit talking about your unhappiness and try to fix it, no matter how difficult or impossible your situation seems.While it is healthy to vent occasionally, endless rumination on the negative only keeps you paralyzed in misery, reinforces hopelessness, and demoralizes those around you who feel helpless to bring any happiness into your life. Instead, Stop Whining, Start Living encourages \"whiners\" to reject negative thoughts, emotions, and attitudes; shift perspective; open up to gratitude and goodness; and embrace obligations to loved ones and the world in general. Before long, just doing what you're supposed to be doing—instead of moaning about why you can't or won't or shouldn't fulfill your responsibilities—will have you feeling better about yourself and will uplift your interactions with family, friends, colleagues, and even complete strangers in incredible ways.Illustrated by calls and letters from members of Dr. Laura's huge international audience, Stop Whining, Start Living features brave testimonials from real human beings facing real challenges. These folks have benefited enormously from Dr. Laura's powerful lessons.Stop Whining, Start Living gives readers stuck in their suffering the jump start they need to break out of reactive mode and get proactive, moving in the direction of a joyful, meaningful, happy, fulfilling, and purposeful future. Everyone can use a kick in the pants sometimes, and Dr. Laura, who \"preaches, teaches, and nags\" to millions every day on her radio program, is here to deliver it!",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Psychology",
    "Marriage",
    "Audiobook",
    "Inspirational"
  ],
  "author": "Laura Schlessinger",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/1923595.Stop_Whining_Start_Living"
}