{
  "title": "City Adrift: New Orleans Before and After Katrina",
  "description": "Hurricane Katrina was a stunning example of complete civic breakdown. Beginning on August 29, 2005, the world watched in horror as―despite all the warnings and studies―every system that might have protected New Orleans failed. Levees and canals buckled, pouring more than 100 billion gallons of floodwater into the city. Botched communications crippled rescue operations. Buses that might have evacuated thousands never came. Hospitals lost power, and patients lay suffering in darkness and stifling heat. At least 1,400 Louisianans died in Hurricane Katrina, more than half of them from New Orleans, and hundreds of thousands more were displaced, many still wondering if they will ever be able to return. How could all of this have happened in twenty-first-century America? And could it all happen again?To answer these questions, the Center for Public Integrity commissioned seven seasoned journalists to travel to New Orleans and investigate the storm’s aftermath. In City New Orleans Before and After Katrina, they present their findings. The stellar roster of contributors includes Pulitzer Prize-winner John McQuaid, whose earlier work predicted the failure of the levees and the impending disaster; longtime Boston Globe newsman Curtis Wilkie, a French Quarter resident for nearly fifteen years; and Katy Reckdahl, an award-winning freelance journalist who gave birth to her son in a New Orleans hospital the day before Katrina hit.They and the rest of the investigative team interviewed homeowners and health officials, first responders and politicians, and evacuees and other ordinary citizens to explore the storm from numerous angles, including health care, social services, housing and insurance, and emergency preparedness. They also identify the political, social, geographical, and technological factors that compounded the tragedy.Comprehensive and balanced, City Adrift provides not only an assessment of what went wrong in the Big Easy during and following Hurricane Katrina, but also, more importantly, a road map of what must be done to ensure that such a devastating tragedy is never repeated.",
  "genres": [
    "Nonfiction",
    "Cities"
  ],
  "author": "Jenni Bergal",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/1107426.City_Adrift"
}