{
  "title": "Clothes, Clothes, Clothes. Music, Music, Music. Boys, Boys, Boys",
  "description": "The guitarist for seminal female punk group The Slits recounts playing with Sid Vicious, touring with the Clash, dating Mick Jones, inspiring “Train in Vain,” and releasing her solo debut in 2012Viv Albertine is one of a handful of original punks who changed music, and the discourse around it, forever. Her memoir tells the story of how, through sheer will, talent, and fearlessness, she forced herself into a male-dominated industry, became part of a movement that changed music, and inspired a generation of female rockers.After forming The Flowers of Romance with Sid Vicious in 1976, Albertine joined The Slits and made musical history in one of the first generations of punk bands. The Slits would go on to serve as an inspiration to future rockers, including Kurt Cobain, Carrie Brownstein, and the Riot Grrrl movement in the 1990s. This is the story of what it was like to be a girl at the height of punk: the sex, the drugs, the guys, the tours, and being part of a brilliant pioneering group of women making musical history. Albertine recounts helping define punk fashion, struggling to find her place among the boys, and her romance with Mick Jones, including her pregnancy and subsequent abortion. She also gives a candid account of what happened post-punk, beyond the break-up of The Slits in 1982, including a career in film, surviving cancer, and making music again, twenty-five years later.A truly remarkable memoir told in Viv’s frank, irreverent, and distinctive voice, Clothes, Clothes, Clothes. Music, Music, Music. Boys, Boys, Boys. is a raw, thrilling story of life on the frontier.",
  "genres": [
    "Music",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Autobiography",
    "Punk",
    "Feminism"
  ],
  "author": "Viv Albertine",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/19246471-clothes-clothes-clothes-music-music-music-boys-boys-boys"
}