{
  "title": "The Monarch Project",
  "description": "An epic tale of mind-control and sinister conspiracies, magnetic cult leaders and an evil cabal intent on establishing the New World Order. The US is suffering from an unusual rash of mass cult suicides. The bloody and shocking deaths of almost one hundred people in a seedy Brooklyn warehouse see a team of cult exit experts and behavioural scientists come together to form a task squad intent on getting to the bottom of the alarming trend. Their new target is a New-Age spiritual teacher, Eon Stella, who claims to be the embodiment of the long-awaited messiah and lives on a private island in the wilds of upstate New York near the border of Canada. He’s eloquent with a casual charm and an impressive bank balance. His ‘self-help’ group, Nova Roma , has set up by Stella as a kind of antithesis of the Catholic Church. The head of the investigating team, Jimi Kritzler, is a hipster-lapsed-Jewish-boy from Brooklyn who has a stash of PhD’s and two best-selling pop-culture books about mind-control. Jimi convinces the group to infiltrate a forty day retreat on the island to get an insider’s look at the beating heart of a budding cult. Anne Diamond is an Australian theologian who is compiling a manuscript on Vatican corruption and she is leaving behind some domestic dirt to accompany Jimi on the retreat. The island lies in the Thousand Island stretch of the St Lawrence waterway and boasts a nineteenth century fairytale castle and boat house. The guests soon learn that this cult is like no other. Eon Stella preaches a doctrine of Bacchanalian extravagance where sex, fine whisky and luxurious fare are all part of the experience. As the retreat progresses through a blizzard-ridden winter, the castle becomes ice-bound and completely cut-off from the outside world. As the isolation and claustrophobia set in, so does the paranoia and the inescapable passions that such close proximity incite. The retreat becomes a mind battle between Stella and Kritzler. Anne is not sure whose side she should be on but when talk of a CIA mind-control experiment starts swirling into the leery mix, Anne starts to question her own involvement in this operation. The Monarch Project is a thrilling page turner that will keep you guessing until the end. Show less",
  "genres": [],
  "author": "Nik Boston",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/19248417-the-monarch-project"
}