{
  "title": "Saying Goodbye: What the World Doesn't Know",
  "description": "Book 1 of a 2 book seriesNo matter how strong the relationship, or powerful the attraction at some time we all must say goodbye. In 1964 the winds of change blows across the Atlantic from England to America and sparks a cultural and social revolution. Traditional values of the past are replaced with more modern attitudes caused by the hottest tunes and the latest dance craze. Vivacious Hollywood starlet Frankie Robinson has no romantic expectations when she meets the dark and introspective Alex Rowley, guitarist for one of the hottest British bands—The Dark Knights. During their first dance, they step into each other's rhythm, as though partners in another life. For an eager young couple, neither Frankie nor Alex anticipates the scandal their public relationship will cause—reputations must be protected and images need to be maintained. As Frankie and Alex dream of a life together, agents and managers worry of the monies lost and the dangers to their perspective clients. Frankie and Alex are to be kept apart no matter what tragic cost. Behind the closed curtains of celebrity life, Frank and Alex find a way to keep their private love alive despite all obstacles.Reader review: \"Have you ever wondered whether famous people can have normal lives - like honest relationships, family and true happiness? This book looks at that question with the backdrop of the turbulent 1960's when the world's beliefs, institutions and morality were being over-turned. One of the biggest stars of the British rock revolution meets an American dancer/singer/actress who is the dream of every red-blooded American boy. Just what everyone dreams of, right? Throw in the sexual revolution, the Vietnam war, the peace movement, the drug culture and growing up under the threat of Hollywood blacklisting from the McCarthy House Un-American Activities Committee. What could possibly go wrong? This is an engrossing story of a young couple striving to have a normal life in an abnormal world. Irresistible.\"",
  "genres": [],
  "author": "Mahima Martel",
  "average_rating": "4.92",
  "url": "https://www.goodreads.com/book/show/19245718-saying-goodbye"
}