{
  "title": "Natural Gas in Asia: The Challenges of Growth in China, India, Japan and Korea",
  "description": "The next decade will be crucial for Asian gas markets and determine whether natural gas will become a major fuel in the key energy markets of China, India, Japan and Korea, or will remain a \"promising\" but peripheral energy source. Natural Gas in Asia is a new edition of a 2002 study on the future of natural gas in the major energy markets of Asia. The 2nd edition has been substantially rewritten and completely updated, and contains two new chapters on South East Asia, Australia, and the Middle East.The future energy needs and environmental problems of China, India and the rest of Asia are considerable. A major question is whether gas supplies can and will respond to expanding demand for the cleanest fossil fuel? Large scale projects will need to be implemented in Russia, the Central Asian Republics and the Middle East to bring required supplies to Asian markets in the years to 2020. This book assesses the economic opportunities, political obstacles and other challenges--both domestic and international--to these projects. In order to succeed, pipeline infrastructure will need to be built over long distances to bring gas to these markets, as well as significant numbers of new LNG terminals.The volume discusses the major current and potential gas markets in China, India, Japan and Korea, as well as the potential supply of pipeline gas and LNG to Asia Russia, Central Asia, South East Asia, Australia and Middle Eastern countries. An important aspect of the next two decades will be the extent to which the region can develop pipeline gas sources to supplement existing large scale LNG imports. The volume also looks at the substantial gas markets emerging in China and India which are at the early stage of introducing large scale natural gas use in cities. These markets face the commercial challenge of developing gas-fired power generation at a cost which may be greater than generation based on domestically produced coal. However, considerations of local air quality and global emissions may give extra value to gas fired generation, as has happened elsewhere in the world.",
  "genres": [],
  "author": "Michael Bradshaw",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/1924211.Natural_Gas_in_Asia"
}