{
  "title": "The Good Rat",
  "description": "Of course Pulitzer Prize winner Jimmy Breslin recognized Burton Kaplan right away as the Mafia witness of the ages. Breslin comes from the same Queens streets as mob bosses John Gotti and Vito Genovese. But even they couldn't match Kaplan in crime—and neither could anybody else. In his inimitable New York voice, Breslin, \"the city's steadiest and most accurate chronicler\" (Tom Robbins, Village Voice ), gives us a look through the keyhole at the people and places that define the mafia—characters like Sammy \"The Bull\" Gravano, Gaspipe Casso (named for his weapon of choice), Thomas \"Three-Finger Brown\" Lucchese, and Jimmy \"The Clam\" Eppolito, interwoven with the good rat himself, Burt Kaplan of Bensonhurst, the star witness in the recent trial of two New York City detectives indicted for acting as hit men in eight gangland executions. Breslin takes us to the old-time hangouts like Pep McGuire's, the legendary watering hole where reporters and gangsters (all hailing from the same working-class neighborhoods) rubbed elbows and traded stories; the dog-fight circles and body dumps at Ozone Park; and the back room at Midnight Rose's candy store, where Murder, Inc., hired and fired. Most compelling of all, Breslin captures the moments in which the Mafia was made and broken—Breslin was there the night John Gotti celebrated his acquittal at his Ravenite Social Club on Mulberry, having bribed his way to inno­cence only to incite the wrath of the FBI, who would later crush Gotti and others with the full force of the RICO laws. As in his unforgettable novel The Gang That Couldn't Shoot Straight , Breslin brings together these real-life and long-forgotten Mafia stories to brilliantly create a sharp-eyed portrait of the mob as it lived and breathed, as it sounded and survived.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "History",
    "Biography",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Jimmy Breslin",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/1924935.The_Good_Rat"
}