{
  "title": "A Most Holy War: The Albigensian Crusade and the Battle for Christendom",
  "description": "In January of 1208, a papal legate was murdered on the banks of the Rhone in southern France. A furious Pope Innocent III accused heretics of the crime and called upon all Christians to exterminate heresy between the Garonne and Rhone rivers--a vast region now known as Languedoc--in a great crusade. This most holy war, the first in which Christians were promised salvation for killing other Christians, lasted twenty bloody years--it was a long savage battle for the soul of Christendom. In A Most Holy War, historian Mark Pegg has produced a swift-moving, gripping narrative of this horrific crusade, drawing in part on thousands of testimonies collected by inquisitors in the years 1235 to 1245. These accounts of ordinary men and women, remembering what it was like to live through such brutal times, bring the story vividly to life. Pegg argues that generations of historians (and novelists) have misunderstood the crusade; they assumed it was a war against the Cathars, the most famous heretics of the Middle Ages. The Cathars, Pegg reveals, never existed. He further shows how a millennial fervor about \"cleansing\" the world of heresy, coupled with a fear that Christendom was being eaten away from within by heretics who looked no different than other Christians, made the battles, sieges, and massacres of the crusade almost apocalyptic in their cruel intensity. In responding to this fear with a holy genocidal war, Innocent III fundamentally changed how Western civilization dealt with individuals accused of corrupting society. This fundamental change, Pegg argues, led directly to the creation of the inquisition, the rise of an anti-Semitism dedicated to the violent elimination of Jews, and even the holy violence of the Reconquista in Spain and in the New World in the fifteenth century. All derive their divinely sanctioned slaughter from the Albigensian Crusade. Haunting and immersive, A Most Holy War opens an important new perspective on a truly pivotal moment in world history, a first and distant foreshadowing of the genocide and holy violence in the modern world.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "France",
    "Medieval",
    "European History",
    "Military History"
  ],
  "author": "Mark Gregory Pegg",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/19261923-a-most-holy-war"
}