{
  "title": "A Romantic Regency Collection",
  "description": "In this Romantic Regency Collection, Anne Gallagher places the novellas you love together in one volume.A WIFE for WINSBARREN - Rich, titled, and handsome, John Tremont, Viscount Winsbarren wanders through society searching for a wife. He doesn't understand why he can't find one. A friend takes up his cause, and places an ad in the newspaper. With over two hundred responses, Winsbarren winnows it down to five. After seeing two of the ladies, he soon realizes desperation does not a life partner make. A final meeting to call the whole thing off allows Winsbarren to see the woman he was looking for was right under his nose the whole time.LOVE FINDS LORD DAVINGDALE - Thomas Merrit, the Earl of Davingdale, wants nothing to do with Society. His fondest wish - to rebuild his dilapidated barn for his newly acquired collection of horses. Until he meets the enigmatic \"Miss Ophelia Cummings\" who is only in Town for three days. Their paths serendipitously cross twice, and Thomas is drawn to her like no one before. Fate deals a cruel blow on the third day when the chance to see the delightful Miss Cummings is thwarted by mere moments. Thomas will do whatever it takes to discover if what he feels for her is real, but it may be too late.ROMANCING LADY RYDER - The Earl of Greenleigh, longs for something \"more\" yet cannot define it. Until he meets the ravishing Lady Illora Ryder. Young, beautiful, and dangerous, Illora could expose Greenleigh's secret life as an undercover operative for the Foreign Office. Lady Ryder has secrets of her own and when Greenleigh finds he and Lady Ryder are merely pawns in the game played among the allies and Bonaparte for control of the Continent, Greenleigh must expose himself, not only to the enemy, but to Society as well. Can he save both their lives before it's too late?LADY CADORET'S LONGING - Lady Dorcas Cadoret, secretly engaged these five years to her childhood sweetheart, is overwhelmed with grief when Peter is killed in action two weeks before his commission is over. His brother, Daniel, is very kind, and rumors abound there is more to his attention than just being her guardian angel. As they share a forbidden kiss, Dorcas thinks it is Peter's lips upon hers and Daniel is overwrought by feelings he should not be having about his late brother's fiancee. Can Dorcas find a way to love Daniel for himself or will Peter's memory haunt Daniel and Dorcas forever?",
  "genres": [],
  "author": "Anne  Gallagher",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/19260705-a-romantic-regency-collection"
}