{
  "title": "McLevy: The Edinburgh Detective",
  "description": "Very inspiring ... part of our history and part of our culture' - Alanna Knight 'A fascinating insight into the Victorian underclass ... a powerful writer' - Daily Mail 'This is a gem ... A fantastic weaving of period Edinburgh culture with intricate, captivating detective work ... Go out and buy one, now' - The Herald 'These stories are true crime classics, imbued with all the pathos, darkness and occasional humour that you will find in the best crime fiction' - Quintin Jardine James McLevy, an Edinburgh policeman, was one of the first exponents of the crime genre and a likely influence on the creator of Sherlock Holmes. This book features a collection of stories based on some of the 2,220 cases he dealt with in the course of his career, evoking the spirit of the city, and the vivid descriptions of its criminal classes. Edinburgh has provided the backdrop to stories of detection for almost a century and a half. In the 1860s, a few years before Conan Doyle began his medical studies at Edinburgh University, there appeared a hugely popular series of books with titles including \"Curiosities of Crime in Edinburgh\", \"The Sliding Scale of Life\" and \"The Disclosures of a Detective\". They were all the work of one James McLevy, an Edinburgh policeman. The now largely forgotten, McLevy was one of the first exponents of the crime genre and a likely influence on the creator of Sherlock Holmes.Like Conan Doyle, McLevy had an Irish background. He was born in Co Armagh, the son of a small farmer. Largely self-educated, he joined the Edinburgh police force in 1830 as a night watchman before rising up through the ranks to become a detective. The collection of stories in this book are based on some of the 2,220 cases he dealt with in the course of his career, wonderfully evoking the spirit of the city, and the vivid descriptions of its criminal classes as they moved between the very different worlds of the Old and New Towns. It is introduced by Quintin Jardine.",
  "genres": [
    "History",
    "Crime",
    "True Crime",
    "Mystery",
    "Nonfiction"
  ],
  "author": "James McLevy",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/19262823-mclevy"
}