{
  "title": "Scared Stiff",
  "description": "Halloween night in Sorenson, Wisconsin, usually resembles any other small trick-or-treaters, costume parties, and lots of cheerfully scary decorations. But Deputy Coroner Mattie Winston is finding this year a little different, because among all the fake carnage is a very real, very dead body. . .. When Mattie and her boss/best friend, Izzy, are called to the home of waitress and part-time model Shannon Tolliver, they find the ghoulish decorations just a bit too authentic. For among the fake blood and skeletons is the corpse of Shannon herself--and the evidence screams murder.Since the whole town knows Shannon recently had a very public argument with her estranged husband, Erik, he's suspect #1 for homicide detective Steve Hurley. Tall, dark, and blissfully blue-eyed detective Steve Hurley, that is. . . But Mattie happens to know Erik truly loved his wife, and is simply incapable of the brutal act--even though he owns the exact same caliber handgun as the murder weapon. . .Determined to unearth the truth--and maybe spend a little quality time with Detective Hunky--Mattie puts her scalpel-sharp medical skills to work, and digs a little deeper. What she uncovers is stranger than anyone could have imagined. . .It seems Shannon's murder is just the tip of a very fatal iceberg. Now, in order to solve a case that's getting more dangerous by the minute--and to save Erik from the slammer--Mattie will have to risk everything to catch a killer who's capable of doing anything once he's cornered. And this time, it's not just Mattie's life that's on the line. . .Praise for Working Stiff\"Sassy, sexy, and suspenseful, Annelise Ryan knocks 'em dead in her wry and original Working Stiff.\" --Carolyn Hart, author of Dare to Die\"Move over, Stephanie Plum. Make way for Mattie Winston, the funniest deputy coroner to cut up a corpse since, well, ever. I loved every minute I spent with her in this sharp and sassy debut mystery.\" Laura Levine, author of Killer Cruise\"Mattie Winston, RN, wasn't looking for excitement when she became a morgue assistant--quite the contrary--but she got plenty and so will reader who won't be able to put this book down.\" Leslie Meier, author of Mother's Day Murder\"Working Stiff has it suspense, laughter, a spicy dash of romance--and a heroine who's guaranteed to walk off with your heart. Mattie Winston is an unforgettable character.\" Tess Gerritsen, New York Times bestselling author of The Keepsake\"Ryan brings her professional expertise to her crisp debut.\" --Publishers Weekly",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Cozy",
    "Halloween",
    "Humor",
    "Romance"
  ],
  "author": "Annelise Ryan",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/11074693-scared-stiff"
}