{
  "title": "The Skinwalker's Apprentice",
  "description": "-out of print-Welcome to The Empire State, where banshees, witches, and skinwalkers wait…” Margo Pennyfeather is being hunted. The 16-year-old witch has always been an outcast, in her home back in England, and now in the village of East Hampton, New York, where her family has settled. No one but her family has ever cared for Margo, but now the most important witch in the magic world wants her as an apprentice, giving her a chance to bring her family out of poverty. Before long, Margo realizes things aren't what they seem, least of all, what kind of witch she really is. Now, the young witch must face a terrifying monster on her own, and the reverberations will reach farther than she could have ever imagined. More than three hundred years later, in 1984 Emerald Kipp is a high school senior in New York City. A troubled teen with a rebellious streak, Emerald can't seem to figure out what to do with her life, and unfortunately for her, “witch” isn’t one of the available career choices in her guidance counselor’s office. As she struggles to figure herself out, Emerald is faced with the threat of being stuck in school and missing her final summer with her three best friends. Her last year of high school is turning out to be the worst yet, and Emerald thinks it can’t possibly get any worse. Unfortunately for her, she’s dead wrong. And there’s something else, something far more sinister stirring in Emerald’s world, and she’ll have to believe in herself if she wants to get through it alive. Two witches, three hundred years apart, one inescapable fate. The Skinwalker's Apprentice is a companion novella l to the upcoming novel, Emerald Kipp and The Riddle of The Timekeeper, a terrifying magical scavenger hunt through the gritty streets of 1980’s New York City,set to a killer soundtrack",
  "genres": [
    "Fantasy",
    "Fiction",
    "Young Adult",
    "Magic",
    "Urban Fantasy",
    "Paranormal",
    "Latino"
  ],
  "author": "Claribel Ortega",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/19250523-the-skinwalker-s-apprentice"
}