{
  "title": "Crimson Shadow",
  "description": "In una Londra popolata di creature che vivono nell'ombra, si muove sicura e sfrontata, la cacciatrice Sophia Holloway, una donna temeraria, irriverente, senza peli sulla lingua, pronta a tutto pur di sterminare gli odiati vampiri dalla faccia della terra. Ma non ha fatto i conti con un affascinante vampiro ultracentenario dai modi galanti, Lance Galahad, che farà di tutto per domare il suo spirito ribelle.Tra i due inizierà un gioco fatto di incontri/scontri che li porterà inevitabilmente ad avvicinarsi.E mentre cercheranno di convivere con il legame che inizia a unirli, Sophia dovrà combattere per la sua vita e per vendicare la morte dell'amato padre. Riuscirà a scoprire l'identità del suo assassino?E Lance sarà in grado di superare le oscurità del suo passato?Un romanzo ricco di ironia, passione, sensualità, azione e una punta di malizia, che con il suo mix esplosivo, vi terrà incollati fino all'ultima pagina.Il secondo capitolo di “The Shadows Saga”, che dopo Black Shadow, non si farà dimenticare.\"Lance è la mia malattia e la cura stessa. Non ho scampo.\"Biografia Katherine Keller è l'alterego letterario di Angela Contini e Patrizia Zinni, due amiche che condividono moltissime passioni tra cui la scrittura, il fantasy e soprattutto Smallville che le ha fatte conoscere alcuni anni fa. Angela ha già pubblicato il suo romanzo di esordio “Biscotti alla vaniglia” mentre Patrizia è un'autrice alla sua prima esperienza.Entrambe adorano entrare in libreria, gironzolare tra gli scaffali e scegliere i libri da comprare. Preferiscono immergersi nella magia di un bel romanzo piuttosto che guardare la televisione, anche se non disdegnano alcuni serials americani che sono oggetto di lunghe e divertenti chiacchierate.pagina",
  "genres": [
    "Paranormal Romance",
    "Vampires",
    "Urban Fantasy",
    "Magic",
    "Fantasy"
  ],
  "author": "Katherine Keller",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/19262861-crimson-shadow"
}