{
  "title": "Dragon Maiden",
  "description": "Love, promises, truth…and sacrifice.For Laise the dragon, life is measured in cycles. Every twenty-five years, the delmen hatch, eating everything and everyone in their path. Centuries past, Laise made a promise: before the hatching, she falls in love with a maiden sent by the city, and then kills her. Only an instrument carved from the bones of Laise’s loved ones can keep the delmen at bay. One life for the lives of all those in the city and a chance to love, if only briefly. It has always seemed a fair, if cruel, bargain. Until Elinor. THE OPENING:Elinor is not the first woman I have loved, though she may be the last. Through the fog of my vision I can tell that she trembles, and I lower my head so as not to frighten her. The joints in my neck ache.“Elinor,” I say. All it took was a whiff of her scent and a glimpse of her face for me to fall. She is no great beauty, like they used to send me. Her hair and eyes are dark, her stature small, her figure plump. It doesn’t matter. My magic is strong, and won’t discriminate. “I am Laise.”“I know who you are.” Her hands travel over the walls of my cave like pale spiders, searching for cracks. The sour smell of fear wafts into my nostrils.“They told me this was my punishment. That you were going to eat me.”Ah. I press my leathery wings to my side and tuck my claws beneath my belly. There is little I can say to the accusation. It is the nature of my kind to speak the truth, no matter how harsh. I choose my words carefully. “I will not harm you against your will.” The shaking stops, but she does not relax. For the magic to work, she must love me too, and she cannot love me if she fears me so terribly. Her people sent me willing women, once. They used to vie for the honor, but it has been a long time since I’ve flown over the city. Perhaps it has aged as I have, and Elinor is what they could spare.“I don’t want to die,” she says.My heart breaks a little. I sigh, trying to ease the pain. “They seldom do.” Each of my loves has had second thoughts near the end. Elinor doesn’t wait for me to explain further. She dashes for the opening of the cave, but I am far, far quicker than she. I slink to the side and use my body to block her way out. She stops herself before she can touch me, her hands curled to her breast.I lit the lamps before she arrived, spread out the rugs, and dusted the furniture in hopes it would make her feel welcome. My cave is vast as a hall, so I have decorated it as such. Cassandra, the second of my loves, introduced me to such comforts. I still remember her bell-like laughter as she scratched the scales beneath my chin. She took her time falling in love with me, but we’d had a year together.Elinor and I have ten days.",
  "genres": [
    "Fantasy",
    "Dragons",
    "Novella",
    "High Fantasy",
    "Short Stories"
  ],
  "author": "Andrea Stewart",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/19278110-dragon-maiden"
}