{
  "title": "The Fortune Cafe",
  "description": "Welcome to Tangerine StreetTangerine Street is a must-see tourist stop with a colorful mix of one-of-a-kind boutiques, unique restaurants, eclectic museums, quaint bookstores, and exclusive bed-and-breakfasts. The Fortune Café, situated in the middle of this charming collection of shops and cafés on Tangerine Street, is a Chinese restaurant unlike any other because, well, to be honest, the fortunes found in the cookies all come true…MIS-FORTUNE: Emma, a waitress at The Fortune Café will do anything to avoid opening a fortune cookie. Each fortune is rumored to somehow magically come true. Being a girl grounded in reality, she doesn’t have time for that kind of nonsense. But when trying to prevent a food fight at the café, Emma accidentally cracks open a fortune cookie: “Look around, love is trying to catch you.” If there is one thing that Harrison, her former best friend in high school is good at, it’s catching her unaware.LOVE, NOT LUCK: Lucy has always been lucky . . . until her parents meet her fiancé’s parents at a disastrous lunch at The Fortune Café, and she breaks her lucky jade necklace. Even worse, her fortune cookie reveals that “True love is for the brave, not the lucky.” How is she supposed to read that? She’s always considered how she met her fiancé lucky. But after breaking her necklace, Lucy’s luck takes a dive. And when her fiancé dumps her, the only person she can turn to is Carter, the unluckiest guy she knows. TAKEOUT: Stella is content in her new life of taking over her mom’s jewelry shop. No more boyfriend to worry about, and as long as she stays busy, she doesn’t have to dwell on her non-existent love life. When Evan comes into the shop with his young daughter, Stella is charmed. But she is reluctant to complicate her straightforward life, so when she reads her fortune after ordering takeout from The Fortune Café, she completely ignores it. After all, how can a fortune as vague as “Do the thing you fear and love is certain,” apply to her?",
  "genres": [
    "Romance",
    "Contemporary",
    "Chick Lit",
    "Fiction",
    "Clean Romance",
    "Contemporary Romance",
    "Novella"
  ],
  "author": "Julie Wright",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/19267246-the-fortune-cafe"
}