{
  "title": "Ending Stress: A Practical Guide to Nondual Meditation and Therapy",
  "description": "This highly practical guide shows you clearly and directly how to remove stress, anger, fear and worry by becoming more realistic, using 2,500 year old meditation and therapy tools and inspired by masters of nondual and Buddhist wisdom traditions including Dzogchen, Mahamudra, Zen, Madhyamika, Advaita and Tao. Jonathan Harrison teaches nondual and Buddhist meditation and psychology. The guide explains how mental stress is created and how to remove it from your life in all its forms including anger, anxiety, disappointment, discontent, dissatisfaction, dread, envy, fear, frustration, guilt, humiliation, impatience, insult, misery, mistrust, regret, tension and worry. Some of the topics covered in the guide: - Stress and its elimination - Practical issues - Discovering what is real and what is not - Eliminating worry about non-problems - Overcoming anxiety, hope and fear - Removing frustration and anger - Finding comfort by eliminating fixations - Minimizing the effect of physical and mental pain - Letting your expectations adapt themselves to reality - Improving your choices and decisions while avoiding guilt - Respecting your thoughts without believing them - Cultivating beneficial relationships - Generating immunity to praise and criticism - Achieving total freedom In the first chapter, \"Stress and its elimination\", Jonathan Harrison shows how, in order to see how stress is created, you need to understand three things: - The way you think about things - The way things really are - The results of confusing these The way you think about things: You see the world as structured, split into separate parts which may be in conflict. Your particular mental structures consisting of your personal opinions and concepts is the result of many factors including your genetic makeup, parental upbringing, social and cultural environments and the way you have perceived, internalized and acted on your experiences. These mental structures develop and change throughout your life. The world as you see it is largely a reflection of your mental history. What you think is an original creation of your mind. The way things really are: Reality, the world as it is, is neither inherently split (dualistic), nor unified, neither structured nor unstructured. It just is. This is so simple that most people do not understand it. Ending stress It is enough to grasp deeply how things really work. The past has gone, is unalterable, the future is non-existent except as your present expectations, and “now” is already here. Within this realization, true rest occurs naturally. This is non-meditation, natural meditation or “resting in natural awareness” as Longchen Rabjam, the renowned Tibetan yogi and Dzogchen meditation master, put it. By recognizing the nature of reality you are able to live, love and benefit yourself and others more easily, as you no longer experience the frustration of trying to grasp at imagined parts of your experience or trying to remove them. In his foreword to the guide, Dr. Peter Fenner states, \"The guide offers a lucid introduction to the ultimate state and outlines clear practices to realization. Jonathan’s analysis of the dualistic mind that produces all our suffering is compelling and I delight in the way he continually points us back to the inherent inner wisdom that is at the core of every conscious being.\" In the foreword to the second edition, Dr. Stephen Fulder states, \"Learning meditation is not easy and it is not difficult. It is helpful if there is some good teaching to set us on the right path. This is where this book comes in. Jonathan Harrison has written a wonderful manual which is remarkable in its directness, simplicity, and sharpness. It offers very concise instructions not only on meditation but also on different ways of viewing ourselves and the world.",
  "genres": [],
  "author": "Jonathan   Harrison",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/19278557-ending-stress"
}