{
  "title": "Florida Is Murder: Due Justice and Surface Tension Mystery Double Feature",
  "description": "Double Down with this Florida Double Feature from #1 Amazon Bestselling Authors Diane Capri and Christine Kling! \"Intricate and ingenious - make some coffee, because you'll read all night.\" Lee Child, #1 Worldwide Bestselling author of 18 Jack Reacher thrillers Where Florida is Murder and Justice Rules! For fans of Lee Child, John Grisham, Clive Cussler and John D. MacDonald More than 89 combined 5-Star Reviews!! DUE JUSTICE is the first legal thriller featuring Judge Willa Carson. When a famous plastic surgeon's decomposed body surfaces in Tampa Bay with a bullet in its head, Willa's \"little sister\" is caught in a high-stakes game of greedy lawyers, blackmail and deceit. Fiercely independent Carly becomes the number one suspect. When Carly asks Willa for due justice, Willa has everything to lose. But she risks it all to uncover the conspiracy and keep Carly alive. Willa Carson knows she's bullet proof, except when due justice rules from the grip of a gun. SURFACE TENSION is the first sea adventure in this four-book suspense series featuring Florida tug and salvage captain Seychelle Sullivan. Working as she does in a man's world, Seychelle has to work twice as hard just to compete. Some have even called her reckless. In her view, she's just doing her job, salvaging boats and people's lives. Years ago Seychelle Sullivan had the chance to save someone's life. But on that summer night in Florida, lost in a world of teenage resentment and loneliness, Seychelle was not able to feel any pain but her own. Today Seychelle captains her father’s forty-six-foot salvage boat out of Fort Lauderdale’s New River. But she’s never escaped that one moment when she could have made a difference and didn’t. She's never going to make that mistake again. Double your reading pleasure! Grab your copy today!",
  "genres": [
    "Mystery",
    "Amazon",
    "Suspense",
    "Thriller",
    "Fiction",
    "Collections"
  ],
  "author": "Diane Capri",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/19267109-florida-is-murder"
}