{
  "title": "The Mobile Mistletoe Series (Boxed Set) Stories 1-4",
  "description": "This is the boxed set of the best-selling Mobile Mistletoe Series.Love Comes for Valentine's Day, Saint Patrick's Day, The 4th of July and Halloween.Love Comes for Valentine's DayAt Christmas, Kara Hayward makes a pact with her girlfriends She’s wearing a headband of mobile mistletoe until a man kisses her.The problem is it’s now Valentine’s Day.Will Kara be stuck wearing the headband of shame the rest of the year, or will she find Mr. Right in a place she never expects?Love Comes for Saint Patrick's DayZoe and her best friends make a pact to wear a Christmas mistletoe headband until a man kisses them. It worked for Kara, and Zoe’s next in line.Now it’s Saint Patrick’s Day. Zoe’s met handsome Irish businessman, Carrick Kelly, but can she lay her heart on the line for someone who may be gone in a few days. Her job depends on Carrick signing a contract with her advertising agency, but he doesn’t think much of her boss’s ideas.Torn between growing feelings for Carrick and work commitments, will Zoe get a little luck of the Irish to help her make a decision?Love Comes for the 4th of JulyJess Caldwell is the third in line to wear the mistletoe headband until she’s kissed. But it’s her best friend Kara’s wedding, Jess needs to keep her mind on designing the flowers and not on the fact that Kara’s older brother, Darrin, who she’s had a crush on for years will be there.Darrin’s happy to be moving home, and what is even more of a pleasant surprise is seeing her again. Jess isn’t the geeky girl he remembered when he left. But after all the mean things he said in the past, will she give him another chance?When things go wrong, more than fireworks fly for this 4th of July wedding. Will love be in the air?Love Comes for HalloweenNow it’s her turn.Until she’s kissed, Jane, is the last one of her girlfriends to wear the Mobile Mistletoe. Feeling pressured by her friends, she jumps on her dad’s motorcycle and heads out on the open road. But she doesn’t get far before it breaks down. What else can go wrong? Will she be eaten by a bear?Gage has a past he wants to forget. Retreating to the mountains, where he can build custom bikes and cars in seclusion, he wants to give back for the mistakes he’s made.Neither Jane or Gage are looking for a relationship, but isn’t Halloween the perfect time of year to scare up some love?",
  "genres": [],
  "author": "Jennifer Conner",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/19270449-the-mobile-mistletoe-series-boxed-set-stories-1-4"
}