{
  "title": "Michelangelo: Complete Works",
  "description": "Il A glorious exploration of Michelangelo's works \t \t\t \t \t\tBefore reaching the tender age of thirty, Michelangelo Buonarroti (1475-1564) had already sculpted David and Pièta , two of the most famous sculptures in the entire history of art. Like fellow Florentine Leonardo da Vinci, Michelangelo was a shining star of the Renaissance and a genius of consummate virtuosity. His achievements as a sculptor, painter, draughtsman, and architect are unique—no artist before or after him has ever produced such a vast, multi-faceted, and wide-ranging oeuvre. Only a handful of other painters and sculptors have attained a comparable social status and enjoyed a similar artistic freedom. This is demonstrated not only by the frescoes of the Sistine Chapel but also by Michelangelo’s monumental sculptures and his unconventional architectural designs, whose forms went far beyond the accepted vocabulary of his day. Such was his talent that Michelangelo was considered a demigod by his contemporaries and was the subject of two biographies during his lifetime. Adoration of this remarkable man’s work has only increased on the intervening centuries. \t\tFollowing the success of our XL title Leonardo da Vinci , TASCHEN brings you this massive tome that explores Michelangelo’s life and work in more depth and detail than ever before . The first part concentrates on the life of Michelangelo via an extensive and copiously illustrated biographical essay; the main body of the book presents his work in four parts providing a complete analytical inventory of Michelangelo’s paintings , sculptures , buildings and drawings . Gorgeous, full page reproductions and enlarged details bring readers up close to the works. \t\tThis sumptuous tome also takes account, to a previously unseen extent, of Michelangelo’s more personal traits and circumstances, such as his solitary nature, his thirst for money and commissions, his miserliness, his immense wealth, and his skill as a property investor. In addition, the book tackles the controversial issue of the attribution of Michelangelo drawings, an area in which decisions continue to be steered by the interests of the art market and the major collections. This is the definitive volume about Michelangelo for generations to come.",
  "genres": [
    "Art",
    "Nonfiction",
    "History",
    "Art History",
    "Reference",
    "Architecture",
    "Art Design"
  ],
  "author": "Frank Zöllner",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/1926929.Michelangelo"
}