{
  "title": "The Arrow",
  "description": "NATIONAL BESTSELLERAs King Robert the Bruce of Scotland plots to retake his English-occupied castles, he needs the stealth and skill of his elite soldiers, the Highland Guard. Fearless and indomitable, no men are more loyal to their king, or more cherished by the women they love. The talents of legendary marksman Gregor “Arrow” MacGregor are crucial now, as Bruce moves to reclaim his Scottish holdings. Gregor is considered the most handsome man in Scotland, and his fame as an archer is rivaled only by his reputation with the lasses as a heartbreaker. But when his infamous face is exposed during a covert mission, Gregor is forced to lie low. He returns home only to find a new battle a daring game of seduction involving his now very grown-up and very desirable ward, Cate of Lochmaben. A born fighter, Cate was clinging to life when Gregor rescued her after a vicious English raid on her village left her mother dead. But five years later, the once scrappy orphan Gregor took under his protection has become a woman. Brave, strong, and skilled in warfare, Cate is determined to lay claim to the warrior who refuses to be trapped. The heat in his eyes tells her she has his attention . . . and his desire. But will Gregor allow his heart to surrender before danger finds them, and the truth of Cate’s identity is revealed?Praise for Monica McCarty and The Arrow “[Monica] McCarty’s gift lies in writing strong characters into wildly entertaining—often unexpected—scenarios. Readers can’t go wrong with her latest.” — The Washington Post “The Highland Guard come to life as McCarty fills her tales with historical accuracy and moving romance. The ninth in the series is well paced, emotional and powerfully told. Don’t miss it!” — RT Book Reviews (Top Pick!) “One of the best Highlander historical series out there.” —The Reading Cafe “Heart-wrenching . . . The Arrow made a lasting impression on me.” —Under the Covers “A mixture of passion, history, and great wit to create a tale to captivate your senses! To die for !” —Addicted to Romance “There is danger, laughter, and sweet love and secrets revealed. All the characteristics of a wonderful read.” —Tea and Book “Monica McCarty is an absolutely superior author! Her Highland Guard series has to be one of the absolute best Highland series out there! Fun, fast paced, fact driven and totally fantastic!” —Bodice Rippers , on The Raider “McCarty is a master at writing Highlander romance . . . keeping her Highland Guard series fresh, with spectacularly riveting plots and fabulously romantic couples. . . . If you’ve not read this series yet, then I strongly suggest that you do.” —Night Owl Reviews , on The Hunter",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Medieval",
    "Scotland",
    "Fiction"
  ],
  "author": "Monica McCarty",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/19288180-the-arrow"
}