{
  "title": "You Might Remember Me: The Life and Times of Phil Hartman",
  "description": "Beloved TV comedic actor Phil Hartman is best known for his eight brilliant seasons on Saturday Night Live , where his versatility and comedic timing resulted in some of the funniest and most famous sketches in the television show's history. Besides his hilarious impersonations of Phil Donahue, Frank Sinatra and Bill Clinton, Hartman's other indelible characters included Cirroc the Unfrozen Caveman Lawyer, Eugene the Anal Retentive Chef and, of course, Frankenstein. He also starred as pompous radio broadcaster Bill McNeal in the NBC sitcom NewsRadio and voiced numerous classic roles ― most memorably washed-up actor and commercial pitchman Troy McClure ― on Fox's long-running animated hit The Simpsons . But Hartman's seemingly charmed life was cut tragically short when he was fatally shot by his troubled third wife, Brynn, who turned a gun on herself several hours later. The shocking and headline-generating turn of events stunned those closest to the couple as well as countless fans who knew Phil only from afar.Now, for the first time ever, the years and moments leading up to his untimely end are described in illuminating detail through information gleaned from exclusive interviews with scores of famous cast mates, close friends and family members as well as private letters, audio/video recordings, extensive police records, and more. Both joyous tribute and serious biography, Mike Thomas' You Might Remember Me is a celebration of Phil Hartman's multi-faceted career and an exhaustively reported, warts-and-all examination of his often intriguing and sometimes complicated life―a powerful, humor-filled and disquieting portrait of a man who was loved by many, admired by millions and taken from them far too early.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Humor",
    "Comedy",
    "True Crime",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Mike       Thomas",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/19286539-you-might-remember-me"
}