{
  "title": "Life's a Campaign: What Politics Has Taught Me About Friendship, Rivalry, Reputation, and Success",
  "description": "Chris Matthews is like no other TV interviewer. Life’s a Campaign is like no other book on success.Famous for demanding the truth from his Hardball guests, Chris Matthews now reveals what the people running this country rarely the secrets of how they got to the top. Here is the first book on power with insight snatched from those who wield it. Life’s a Campaign exposes the tactics, tricks, and truths that help people get ahead–and can help you, too, whatever your field of ambition.Written in the assertive, good-natured style that is Matthews’s trademark, Life’s a Campaign is the most useful kind of investigative reporting. You’ll benefit from his insider’s scrutiny of the Congress, the White House, and the national news media. Here are the methods, showcased in fascinating anecdotes and case histories, that presidents, senators, and other powerful people use to persuade others and win–and the life lessons they provide for the rest of us.You’ll learn about Bill Clinton’s laser-focused ability to listen to those he wants to seduce–and how he’s been teaching that craft to his wife, Hillary; how Ronald Reagan employed his basic optimism to win history to his side; the simple steps in human diplomacy that the first President Bush exploited to assemble a worldwide posse to attack Saddam Hussein and gain global approval in a way his son has failed to do; how Nancy Pelosi became the first woman Speaker of the House by practicing the most fundamental of human hardnosed loyalty. You’ll also find out, for the first time, about Matthews’s own wild ride through the turbulent, converging rapids of politics and journalism.The big payoff in Life’s a Campaign is what you’ll learn about human • People would rather be listened to than listen.• People don’t mind being used; what they mind is being discarded.• People are more loyal to the people they’ve helped than the people they’ve helped are loyal to them.• Not everyone’s going to like you.• No matter what anybody says, nobody wants a level playing field.Knowing such truths is the successful person’s number one advantage in life. As you’ll learn in Life’s a Campaign, mastering–and employing–these truths separates the leaders from the followers.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Self Help",
    "Biography",
    "Relationships"
  ],
  "author": "Chris Matthews",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/1928383.Life_s_a_Campaign"
}