{
  "title": "Between Gods: A Memoir",
  "description": "From the Man Booker-nominated author of the novel  Far to Go and one of our most talented young writers comes an unflinching, moving and unforgettable memoir about family secrets and the rediscovered past. Alison Pick was born in the 1970s and raised in a supportive, loving family. She grew up laughing with her sister and cousins, and doting on her grandparents. Then as a teenager, Alison made a discovery that instantly changed her understanding of her family, and her vision for her own life, forever. She learned that her Pick grandparents, who had escaped from the Czech Republic during WWII, were Jewish--and that most of this side of the family had died in concentration camps. She also discovered that her own father had not known of this history until, in his twenties, he had a chance encounter with an old family friend--and then he, too, had kept the secret from Alison and her sister.In her early thirties, engaged to be married to her longtime boyfriend but struggling with a crippling depression, Alison slowly but doggedly began to research and uncover her Jewish heritage. Eventually she came to realize that her true path forward was to reclaim her history and identity as a Jew. But even then, one seemingly insurmountable problem remained: her mother wasn't Jewish, so technically Alison wasn't either. In this by times raw, by times sublime memoir, Alison recounts her struggle with the meaning of her faith, her journey to convert to Judaism, her battle with depression, and her path towards facing and accepting the past and embracing the future--including starting a new family of her own. This is her unusual and gripping story, told in crystalline prose and with all the nuance and drama of a novel, but illuminated with heartbreaking insight into the very real lives of the dead, and hard-won hope for the lives of all those who carry on after.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Canada",
    "Religion",
    "Judaism",
    "Jewish",
    "Spirituality"
  ],
  "author": "Alison Pick",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/19288267-between-gods"
}