{
  "title": "Island of a Thousand Mirrors",
  "description": "A stunning literary debut of two young women on opposing sides of the devastating Sri Lankan Civil War—winner of the Commonwealth Book Prize for Asia, longlisted for the Man Asian Literary Prize Before violence tore apart the tapestry of Sri Lanka and turned its pristine beaches red, there were two families. Yasodhara tells the story of her own Sinhala family, rich in love, with everything they could ask for. As a child in idyllic Colombo, Yasodhara's and her siblings' lives are shaped by social hierarchies, their parents' ambitions, teenage love and, subtly, the differences between the Tamil and Sinhala people—but this peace is shattered by the tragedies of war. Yasodhara's family escapes to Los Angeles. But Yasodhara's life has already become intertwined with a young Tamil girl's… Saraswathie is living in the active war zone of Sri Lanka, and hopes to become a teacher. But her dreams for the future are abruptly stamped out when she is arrested by a group of Sinhala soldiers and pulled into the very heart of the conflict that she has tried so hard to avoid – a conflict that, eventually, will connect her and Yasodhara in unexpected ways. In the tradition of Michael Ondatjee's Anil's Ghost and Arundhati Roy's The God of Small Things, Island of a Thousand Mirrors is an emotionally resonant saga of cultural heritage, heartbreaking conflict and deep family bonds. Narrated in two unforgettably authentic voices and spanning the entirety of the decades-long civil war, it offers an unparalleled portrait of a beautiful land during its most difficult moment by a spellbinding new literary talent who promises tremendous things to come.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "War",
    "Literary Fiction",
    "Historical",
    "Book Club",
    "Contemporary"
  ],
  "author": "Nayomi Munaweera",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/19286587-island-of-a-thousand-mirrors"
}