{
  "title": "Rebellion: The History of England from James I to the Glorious Revolution",
  "description": "Peter Ackroyd has been praised as one of the greatest living chroniclers of Britain and its people. In Rebellion, he continues his dazzling account of the history of England, beginning with the progress south of the Scottish king, James VI, who on the death of Elizabeth I became the first Stuart king of England, and ending with the deposition and flight into exile of his grandson, James II.The Stuart monarchy brought together the two nations of England and Scotland into one realm, albeit a realm still marked by political divisions that echo to this day. More importantly, perhaps, the Stuart era was marked by the cruel depredations of civil war, and the killing of a king. Shrewd and opinionated, James I was eloquent on matters as diverse as theology, witchcraft, and the abuses of tobacco, but his attitude to the English parliament sowed the seeds of the division that would split the country during the reign of his hapless heir, Charles I. Ackroyd offers a brilliant, warts-and-all portrayal of Charles's nemesis, Oliver Cromwell, Parliament's great military leader and England's only dictator, who began his career as a political liberator but ended it as much of a despot as \"that man of blood,\" the king he executed.England's turbulent seventeenth century is vividly laid out before us, but so too is the cultural and social life of the period, notable for its extraordinarily rich literature, including Shakespeare's late masterpieces, Jacobean tragedy, the poetry of John Donne and Milton and Thomas Hobbes's great philosophical treatise, Leviathan. In addition to its account of England's royalty, Rebellion also gives us a very real sense of the lives of ordinary English men and women, lived out against a backdrop of constant disruption and uncertainty.",
  "genres": [
    "History",
    "Nonfiction",
    "British Literature",
    "European History",
    "Audiobook",
    "Politics",
    "Historical"
  ],
  "author": "Peter Ackroyd",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/19286679-rebellion"
}