{
  "title": "1001 Books You Must Read Before You Die",
  "description": "Fed up with the endless reams of chick lit on the shelves? Want a really quality book, not a celebrity-endorsed 'Essential Summer Reading' book? This is the guide for you, so read on… They're called the classics for good reason. Whether they're a work of wacky imagination, a piercing insight into social and cultural traditions at the time of writing, or simply a fantastically absorbing story, all the books featured in 1001 Books You Must Read Before You Die have come about out of people's desires to communicate a story, a message or a lesson. From much loved tales to off-beat cult fiction and the timeless classics of the nineteenth century, discover the influences on the authors, plots and characters of the books that really should make up part, if not all, of your library.Battle orks with Frodo and Aragorn in Middle Earth, go on the road with Kerouac in search of freedom, get involved with questions of gender and androgyny with Orlando, immerse yourself into the full and expansive portrait of India created by Seth in A Suitable Boy and enter the world of Christoper Boone in his touching and amusing quest to find the killer of his neighbour's pet dog. All of these books, and many more are reviewed with fresh perspectives in terms of plot, the ideas that they bring out and why they deserve, above others, to be recommended and read. The author Peter Boxall is a senior lecturer in English Literature at the University of Sussex. He has published widely on drama and twentieth-century fiction and contributes regularly to journals such as The Yearbook of English Studies. He has recently published a Reader's Guide to Samuel Beckett's drama and current projects include co-editing The Year's Work in Critical and Cultural Theory, Don DeLillo: The Possibility of Fiction and a monograph on contemporary fiction, Since Beckett.",
  "genres": [
    "Nonfiction",
    "Reference",
    "Books About Books",
    "Literature",
    "History",
    "Literary Criticism",
    "Collections"
  ],
  "author": "Peter Boxall",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/19290744-1001-books-you-must-read-before-you-die"
}