{
  "title": "Zabiba and the King",
  "description": "WHAT IS IT ABOUT? Zabiba and the King is an allegorical love story between a mighty king (Saddam) and a simple, yet beautiful commoner named Zabiba (the Iraqi people). Zabiba is married to a cruel and unloving husband (the United States) who forces himself upon her against her will. This act of rape is compared to the United States invasion of Iraq. DOES SADDAM HUSSEIN RECEIVE ANY MONEY FOR THIS BOOK? Not a dime. The translation is owned by the editor. WHY TRANSLATE THIS BOOK? The editor, an American businessman, had the book translated into English to satisfy his own curiosity. He also felt it would be interesting and a beneficial tool for the curious, the patriotic, the educator, the historian, etc., as well as for the friends and families of servicemen serving in Iraq. The publisher, a strong supporter of U.S. troops, felt the book was an interesting read. While the allegory is controversial and, at times, unsettling, it gives the reader an opportunity to \"play detective\" and attempt to decipher any hidden meanings. WHAT IS THE SETTING? The stomping grounds of a young Saddam Hussein near Tikrit, Iraq. WHAT IS THE TIME PERIOD? The era of the story is the mid-600's to early 700's A.D., due to the clue the main character, Zabiba, is a devout follower of Islam, yet the king still worships the idols of his forefathers and is ignorant of some of the fundamental traditions of the Islamic faith. DID SADDAM HUSSEIN REALLY WRITE THE NOVEL? While it is no secret that the release of this book in Arabic was an overnight best seller in Iraq and even became an on-stage musical production in Baghdad, the book promotes the establishment of a quasi-democratic form of government that the editor and others believe would not have been allowed to be published in Iraq unless Saddam were intimately involved in its creation. Many Iraqis firmly believe it was penned by Saddam Hussein.",
  "genres": [
    "Fiction",
    "Romance"
  ],
  "author": "Saddam Hussein",
  "average_rating": "2.93",
  "url": "https://www.goodreads.com/book/show/193107.Zabiba_and_the_King"
}