{
  "title": "Corn Is Maize: The Gift of the Indians",
  "description": "Read and find out about corn in this colorfully illustrated nonfiction picture book. With simple prose and beautiful illustrations, award-winning author-illustrator Aliki tells the story of how Native American farmers thousands of years ago found and nourished a wild grass plant and made corn an important part of their lives. They learned the best ways to grow and store and use its fat yellow kernels. And then they shared this knowledge with the new settlers of America. Maize has been an important crop from its beginning as a simple grass plant to its hybridization with teosinte to new protein-rich kinds. Used by both Indians and Pilgrims as food, maize is now also used in medicines, soaps, glues, powders, and other products. Popcorn, corn on the cob, cornbread, tacos, tamales, and tortillas—all of these and many other good things come from one amazing corn! \"An engaging description of how corn was found by Indian farmers thousands of years ago and how corn is grown and used today. A successful blend of social studies, science, and history augmented by accurate diagrams and cheerful illustrations.\"  (School Library Journal) This clear and appealing science book for early elementary age kids, both at home and in the classroom, is a Level 2 Let's-Read-and-Find-Out, which means the book explores more challenging concepts for children in the primary grades. The 100+ titles in this leading nonfiction series Top 10 reasons to love Books in this series support the Common Core Learning Standards, Next Generation Science Standards, and the Science, Technology, Engineering, and Math (STEM) standards. Let's-Read-and-Find-Out is the winner of the American Association for the Advancement of Science/Subaru Science Books & Films Prize for Outstanding Science Series.",
  "genres": [
    "Picture Books",
    "Science",
    "Childrens",
    "Native American",
    "Nonfiction",
    "History",
    "Food"
  ],
  "author": "Aliki",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/1107832.Corn_Is_Maize"
}