{
  "title": "Facing Tessa's Past",
  "description": "Get your kicks on Route 66!One of the early roads of the American Highway System in 1926, Route 66, opened the American West just as the Oregon Trail had done almost one hundred years earlier. Nicknames of this celebrated road are “Main Street of America” and “The Mother Road.”Facing Tessa’s Past is book one of the Christian romance series, Route 66, formerly published by Barbour Publishing. Three friends, who grew up along Route 66 in Illinois, have spread from the beginning in Chicago, Illinois, to the middle in Amarillo, Texas, and to the end in Los Angeles, California, all staying near the old Mother Road.Follow Tessa in Amarillo, Sarah in Chicago, and Amanda as she moves from California back to her roots in Illinois. Each must move past their current mindset to rekindle the special love of their past they thought was dead.Tessa Stevens blew her past on the wrong men and alcohol, but has made a remarkable turnaround after losing her sons to foster care and turning her life over to the Lord. Now, for the first time ever, she’s taking her three sons on vacation, and they will be traveling by car the “Main Street of America” as much as possible.Tessa doesn’t expect to run into the one man she’s never forgotten before her two-week vacation passes its second day. Agreeing to meet with him for a short while in her hotel lobby, she soon realizes he wants what they had before without commitment, while she is determined to uphold her new moral values.But Blake Donovan won’t leave the past where it belongs. Even after eleven years, he hasn’t forgotten Tessa, and now that he sees the new Tessa, he can’t stay away from her. Still, he resents her implications that he needs to change just because she did. He was never as wild as she was and the reason he ran from her in the first place. Will he yield to God’s will for his life and regain his one true love, or will he reject both and run again?And why does he remember only two boys, when there are now three? When he does the math, he figures he was scarcely gone before Tessa found someone else, or her youngest son is also his. But why hasn’t she told him?Please watch for Redeeming Sarah’s Present and Building Amanda’s Future to conclude the stories along Route 66.If you enjoy heartwarming contemporary Christian romance with a focus on faith, family, and love please check out these other series by Mildred Colvin.•Second Chance Love-Books 1-5•Kansas City Romance-Books 1-3",
  "genres": [
    "Romance"
  ],
  "author": "Mildred Colvin",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/11078652-facing-tessa-s-past"
}