{
  "title": "Sinful Resurrection",
  "description": "A BDSM Erotic Romantic Suspense Novel  Crest Security Agency  Sins of the past have been resurrected, predetermining their path to love. Can they overcome the treacherous obstacles set before them?  Jax Christensen likes his life just the way it is. He has his work, his club, and the occasional naked submissive to take his mind off everything else. He doesn’t talk about the past, as there is no point in reminiscing about things that cannot be altered. His chest has an empty hole where his heart used to be, but he’s grown accustomed to the constant pain. It’s become the only thing that reminds Jax that he’s alive.  Emily Weiss has never forgotten the one and only man she’s ever loved. She’s hidden for two long years in an attempt to protect Jax and herself, desperate to try and stay one step ahead of those who want her dead. She has information that could destroy the United Nations. Unfortunately, they want to eliminate her first. Emily’s exhausted and wants more than anything to feel safe once more. That was how she felt in Jax’s strong arms and she longs to be there again.  When Jax sees that Emily has risen from the grave, his heart and soul are full of anger and regret. He’ll never forgive her lies and deception. He will, however, keep her safe. He hates her for what she’s done, but he doesn’t want her death on his conscience. He’ll protect her and then walk away.  Secrets are revealed and the danger is more sinister and deadly than anyone could have guessed. Jax and Emily are forced on the run and the passion they once felt for one another burns even hotter and brighter the second time around. Jax doesn’t know how he’ll walk away this time or if he even wants to. Emily is determined to expose a high-level official within the United Nations and walk away unscathed. She wants a second chance with her first love — even if it kills her.  Publisher's This book contains explicit sexual content, graphic language, and situations that some readers may find objectionable (anal play, strong BDSM theme and elements, violence). Not intended for those under the age of 18.  Series  Crest Security Agency (CSA) is run by Gavin Crest, a retired Marine Master Sergeant. He has personally selected his own former military team members, both men and women, to configure a seamless Special Operations Capable (SOC) unit. Working together on investigations, domestically and abroad, each team member will find their niche in life and love. Follow along as Kennedy Layne conveys each of their stories as they work together on investigations that lead them down perilous paths of passion, intrigue and suspense…  Please visit www.kennedylayne.com for more information...",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Suspense",
    "Romantic Suspense",
    "Military Fiction",
    "Contemporary"
  ],
  "author": "Kennedy Layne",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/19325978-sinful-resurrection"
}