{
  "title": "Not Trivial: How Studying the Traditional Liberal Arts Can Set You Free",
  "description": "Why phonics and grammar are not trivial.Why have our political discussions in the United States become so ugly and pointless? Why are we suffering from such a breakdown in civility? In Not Trivial: How Studying the Traditional Liberal Arts Can Set You Free, Laurie Endicott Thomas explains that the problem boils down to education. The word civility originally meant training in the liberal arts. The classical liberal arts were a set of seven disciplines that were developed largely in ancient Athens to promote productive political discussions within Athenian democracy. They included three verbal arts (the trivium): grammar, logic, and rhetoric. They also included four arts of number, space, and time (the quadrivium): mathematics, geometry, music, and astronomy. These arts helped students learn to think rationally and to express themselves persuasively. The ancient Romans called these studies the liberal arts because they were considered appropriate for freeborn men, as opposed to slaves. Slaves were taught only the servile and mechanical arts, to make them more productive as workers.During the Renaissance, the classical liberal arts curriculum was supplemented by the humanities, including history, philosophy, literature, and art. Like the liberal arts, the humanities were intended to promote productive and even pleasant discussions among political decision-makers. Today, the sciences would have to be added to that curriculum.Thomas explains that the problems in our political system start in first grade. Our teachers are being trained and often forced to use a method of reading instruction that does not work. As a result, many children suffer from lifelong problems with reading. Our teachers are also being pressured to neglect the teaching of grammar. As a result, many children end up with poor reading comprehension and lifelong problems with logical thinking. Thus, they will have difficulty in making or appreciating reasonable arguments.Thomas argues that we cannot hope to enjoy freedom and equality until all children get the kind of education that is appropriate for free people. She concludes with a clear explanation of what that curriculum would be like.",
  "genres": [
    "Nonfiction",
    "Education"
  ],
  "author": "Laurie Endicott Thomas",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/19326060-not-trivial"
}