{
  "title": "Mosaic: Pieces of My Life So Far",
  "description": "One of America’s most popular music artists shares beautiful pieces of an unforgettable human mosaic, revealing pieces of a life in progress.With her unmistakable voice and honest lyrics, Amy Grant has captured a unique place in American music. As the bestselling Christian music artist of all time, a crossover pop sensation, and the wife of country music star Vince Gill, Amy has lived much of her life in the spotlight, subject to adulation, speculation, and scrutiny. Now for the first time, she bares her heart and soul to reveal thoughts on everything from motherhood and marriage to fame and forgiveness. Whether describing personal moments alone on a moonlit hillside or very public ones performing with the likes of Tony Bennett and James Taylor, Amy presents a captivating collection of beautiful reflections on life, love, and faith.Includes Never Before Published Lyrics to New SongsRendered with the lyrical insight we see in her music, Amy reflects on the pieces of her life through the years, forming a vivid mosaic of memories rich in color, varied in texture, and united in their heartfelt design.Thanks to writing and remembering, I’m re-inspired to value both the mundane and magical moments. In trying to capture a few memories as best as I can, I give myself the gift of treasuring what has been so far a very full and meaningful life. I hope you will do the same with yours. —Amy GrantAmy Grant weaves original lyrics and poetry into a narrative patchwork of timeless candor in Mosaic. The pieces of her life so far provide stunning inspiration for her beloved fans. Mixing lighthearted reminiscences of her Tennessee childhood, poignant scenes from her life as a wife and mother, and down-to-earth insight from her celebrity stardom, Amy invites you into her world and gently leads you to fresh insights about your own.Amy’s winsome personality and joyful authenticity radiate from each page, welcoming you into the satisfying company of a warm and compassionate artist—a woman who sees life through a unique and deeply personal lens.Amy Grant got her start in the music business with a part-time job sweeping up a Nashville music studio, which provided the perfect opportunity to duplicate a tape of her original songs as a gift for her family. A studio executive overheard her recordings—and the rest is music history.Since the surprising success of her debut album thirty years ago, Amy has grown into a music legend, with six Grammy Awards, twenty-six Dove Awards, and six pop chart-topping hits to her credit. An inductee into the Gospel Music Association Hall of Fame, she also was honored in 2006 with a star on the Hollywood Walk of Fame.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Christian",
    "Music",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Amy Grant",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1931598.Mosaic"
}