{
  "title": "Feyling Duplicity",
  "description": "Charlotte McBride is a seemingly typical ten-year old living amongst the greens of Ireland with an abusive and spiteful caretaker. Charlotte realizes nothing in her life is what it seems—including her own name—when she learns she’s a Faery—a Feyling, in fact. The rarest and most powerful of all Earth Guardians. Rage and vengeance consumes her to further learn she was abducted as a child, shortly after her mother was murdered. During her search for answers, and with the help of Gersendis, the life-long friend she calls sister, Charlotte uncovers a thousand year-old Vampire conspiracy to replace Faeries as guardians of the earth. Having spent the better part of their existence living amongst mortals, the Vampires never once imagined that their species was capable of adapting. To preserve the future of their bloodline they must execute a monstrous plan involving the ultimate betrayal of every Faery Law written. The Vampires will have to put their fate in the hands of one Faery—the last known Feyling.Fifteen years later Charlotte leaves the comfort and security of her realm to meet the Vampires on their own ground. Searching the mortal world of London, she soon finds herself entangled in a web of lust and deceit with the very enemy she vowed to destroy. When Dhane, an unusual champion Elf, Captain of the Mystic Guardians of the realm, and the love of Charlotte’s life, learns of her departure and intent, with a personal score to settle he prepares for another war against the Vampires. Charlotte would prefer to avoid more bloodshed between the races, but someone must stop the Vampires from carrying out their blasphemous plot. Charlotte will have to awaken her unique powers if she is to face off with her abductor and her mother's killer, in what could be a one-on-one battle for earthen supremacy.",
  "genres": [],
  "author": "Patrice McNeal",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/19318031-feyling-duplicity"
}