{
  "title": "Critical: What We Can Do About the Health-Care Crisis",
  "description": "A much-needed and hard-hitting plan, from one of the great Democratic minds of our time, to reform America’s broken health-care system. \n\nUndoubtedly, the biggest domestic policy issue in the coming years will be America’s health-care system. Millions of Americans go without medical care because they can’t afford it, and many others are mired in debt because they can’t pay their medical bills. It’s hard to think of another public policy problem that has lingered unaddressed for so long. Why have we failed to solve a problem that is such a high priority for so many citizens?\n Former Senate Majority Leader Tom Daschle believes the problem is rooted in the complexity of the health-care issue and the power of the interest groups—doctors, hospitals, insurers, drug companies, researchers, patient advocates—that have a direct stake in it. Rather than simply pointing out the major flaws and placing blame, Daschle offers key solutions and creates a blueprint for solving the crisis. \n Daschle’s solution lies in the Federal Reserve Board, which has overseen the equally complicated financial system with great success. A Fed-like health board would offer a public framework within which a private health-care system can operate more effectively and efficiently—insulated from political pressure yet accountable to elected officials and the American people. Daschle argues that this independent board would create a single standard of care and exert tremendous influence on every other provider and payer, even those in the private sector.\n After decades of failed incremental measures, the American health-care system remains fundamentally broken and requires a comprehensive fix. With his bold and forward-looking plan, Daschle points us to the solution.",
  "genres": [
    "Health Care",
    "Politics",
    "Nonfiction",
    "Medicine",
    "Medical"
  ],
  "author": "Tom Daschle",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/1933724.Critical"
}