{
  "title": "The Pale Abyssinian: The Life of James Bruce",
  "description": "How is it that James Bruce is not better known? His is the most extraordinary life story, a tale of adventure and derring-do in the grand old tradition. We think of the 19th-century David Livingstone as a great African explorer but Livingstone himself called Bruce \"a greater traveller than any of us\", a man who explored the sources of the River Nile a hundred years earlier. Near the beginning of this marvellous biography Bredin summarises his subject's \"Bruce had crossed the Nubian Desert, climbed the bandit-bedevilled mountains of Abyssinia, been shipwrecked off the North African coast and sentenced to death in Sudan. He had lived with the rulers of undiscovered kingdoms and slept with their daughters, been granted titles and lands by barbarian warlords and had then returned--more or less intact--to the place of his birth, a small town near the Firth of Forth. So extraordinary were Bruce's adventures that he was widely disbelieved by polite British society on his return and stigmatised as a liar. Yet Bredin has been able, by travelling Bruce's way, to demonstrate just how much of this fantastical adventure story is actually true. Bredin's wonderful enthusiasm for his subject and his subject's odyssey shines on every page of this biography. Some of the emphases perhaps stray a little into the realm of the cranky. His chapter 5, for instance, speculates about the lost Ark of the Covenant, believed by some to be in Abyssinia (Bredin concedes that he has drawn heavily on Graham Hancock's The Sign and the A Quest for the Lost Ark of the Covenant for this section). But in general the reader is swept along by Bruce's overpowering personality and his amazing adventures. -- Adam Roberts",
  "genres": [
    "Travel",
    "Biography",
    "History",
    "Africa",
    "Nonfiction",
    "Ethiopia",
    "Historical"
  ],
  "author": "Miles Bredin",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/1934114.The_Pale_Abyssinian"
}