{
  "title": "ARKANE Thriller Boxset 1: Stone of Fire, Crypt of Bone, Ark of Blood",
  "description": "Box set of the first 3 full-length ARKANE thriller novels:1. Stone of Fire (previously Pentecost)2. Crypt of Bone (previously Prophecy)3. Ark of Blood (previously Exodus)Over 320 5 star reviews on Amazon.com for these individual booksSTONE OF FIRE, ARKANE Book1A power kept secret for 2000 years. A woman who stands to lose everything.India. When a nun is burned alive on the sacred ghats of Varanasi, and the stone she carried is stolen, an international hunt is triggered for the relics of the early church.Forged in the fire and blood of martyrs, the Pentecost stones have been handed down through generations of Keepers who kept their power and locations secret.Until now.The Keepers are being murdered, the stones stolen by those who would use them for evil in a world transformed by religious fundamentalism.Oxford University psychologist Morgan Sierra is forced into the search when her sister and niece are held hostage. She is helped by Jake Timber from the mysterious ARKANE, a British government agency specializing in paranormal and religious experience. Morgan must risk her own life to save her family, but will she ultimately be betrayed?From ancient Christian sites in Spain, Italy and Israel to the far reaches of Iran and Tunisia, Morgan and Jake must track down the stones through the myths of the early church in a race against time before a new Pentecost is summoned, this time powered by the fires of evil.The first in the ARKANE series, PENTECOST is a fast-paced thriller that explores the edges of faith against a backdrop of early Christian history, archaeology and psychology.CRYPT OF BONE, ARKANE Book 2The prophecy in Revelation declares that a quarter of the world must die and now a shadowy organization has the ability to fulfill these words. Can one woman stop the abomination before it's too late?ISRAEL. A victim of Jerusalem Syndrome jumps to his death from the top of the Western Wall, his body smashed on the ancient stones. Another disembowels himself under the scrawled figure of the Pale Horse of the Apocalypse with the chilling words, \"God told me to do it.\"Dr Morgan Sierra, specialist in psychology of religion, travels to Israel to investigate the deaths and becomes embroiled in an international conspiracy that will use cutting-edge technology to carry an ancient curse to mankind.She joins agent Jake Timber at ARKANE, a secret government agency investigating the supernatural and together they hunt down the Devil's Bible, pursued all the way by the evil forces of Thanatos.From the catacombs of Paris to the skeletal ossuaries of Sicily and the Czech Republic, Morgan and Jake must find the Devil's Bible and stop the curse being released into the world before one in four are destroyed in the coming holocaust. Because in just seven days, the final curse will be spoken and the prophecy will be fulfilled.ARK OF BLOOD, ARKANE Book 3A desperate race to find the Ark of the Covenant - and save the world from a devastating Holy War.  Cairo, Egypt. When the curator of the Museum of Antiquities is slaughtered in a horrific ritual by a group wearing the masks of Ancient Egyptian deities, local authorities ask for help from ARKANE, the agency tasked with investigating religious and paranormal events.Then, in Washington DC, a decapitated Arab body is discovered. The head is placed on the replica Ark of the Covenant along with a chilling message that warns of a terrifying escalation of violence in the Middle East.ARKANE agent, British-Israeli psychologist Dr Morgan Sierra, must race against time to uncover the real Ark - aware that her nemesis, the vicious mercenary Natasha, is also in the hunt and out for bloody revenge. Morgan travels across Egypt and Jordan, retracing the steps of the Biblical Exodus and following a trail of clues that takes her into the mists of history - and mortal danger...The third novel in the bestselling ARKANE series, EXODUS is a pulse-pounding thriller.",
  "genres": [
    "Thriller",
    "Audiobook"
  ],
  "author": "J.F. Penn",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/19337210-arkane-thriller-boxset-1"
}