{
  "title": "Perfect Fit: The Complete B&S Series",
  "description": "Box Set includes the books one, two, and three from the B&S Where I Need to Be Spencer Marshall was done moping. After catching her boyfriend cheating with his secretary, she decides to have a girl's weekend in Vegas with her best friend, Ryan. Lady Luck must be looking out for Spencer, because the hottie that has caught her eye at her new gym is on the same flight to Vegas. Spencer is old-fashioned in the sense that she feels the guy should make the first move, but this hottie hasn't approached her...until they have one hot dance in Vegas that leaves her questioning his motives. Will her hottie finally speak to her, or will he continue playing a game of flirtation that may lead to nowhere? And will situations from their past keep them from taking the next step? Despite what people say, not everything stays in Vegas, especially when you work out every day at the same time and at the same gym. Wanted From the moment she first saw him running on the treadmill next to her, Spencer Marshall fell head over heels in love with Brandon Montgomery. After Spencer has a near-death experience she would rather forget, they do their best to move on with their lives, leaving their past behind them. Thankful for a fresh start and eager to move on with her life, Spencer focuses on helping her best friend, Ryan Kennedy, plan her wedding. Everything seems to be going as planned when someone from Brandon's past reappears. Can Spencer and Brandon survive the coming days as they struggle to deal with ghosts from the past? Anything Like Me After walking in on her cheating boyfriend, fate led Spencer Marshall to the love of her life, Brandon Montgomery. Now she has a wedding to plan. With hope that the demons from their pasts will finally leave them alone, Brandon and Spencer look forward to growing old together. Just as things are finally looking up, an unexpected houseguest arrives and stays much longer than expected. Will their love be strong enough to overcome the bad influences of their new roommate and the emotional aftermath of dealing with the trial? And when an unforeseen tragedy strikes, can Spencer finally have the happy ending she deserves?",
  "genres": [
    "Erotica",
    "Romance",
    "Amazon",
    "Erotic Romance"
  ],
  "author": "Kimberly Knight",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/19326771-perfect-fit"
}