{
  "title": "Burn Down the Ground: A Memoir",
  "description": "In this powerful, affecting, and unflinching memoir, a daughter looks back on her unconventional childhood with deaf parents in rural Texas while trying to reconcile her present life—in which her father is serving a twenty-year sentence in a maximum-security prison.As a child, Kambri Crews wished that she’d been born deaf so she, too, could fully belong to the tight-knit Deaf community that embraced her parents. Her beautiful mother was a saint who would swiftly correct anyone’s notion that deaf equaled dumb. Her handsome father, on the other hand, was more likely to be found hanging out with the sinners. Strong, gregarious, and hardworking, he managed to turn a wild plot of land into a family homestead complete with running water and electricity. To Kambri, he was Daniel Boone, Frank Lloyd Wright, Ben Franklin, and Elvis all rolled into one. But if Kambri’s dad was Superman, then the hearing world was his kryptonite. The isolation that accompanied his deafness unlocked a fierce temper—a rage that a teenage Kambri witnessed when he attacked her mother, and that culminated fourteen years later in his conviction for another violent crime.  With a smart mix of brutal honesty and blunt humor, Kambri Crews explores her complicated bond with her father—which begins with adoration, moves to fear, and finally arrives at understanding—as she tries to forge a new connection between them while he lives behind bars. Burn Down the Ground is a brilliant portrait of living in two worlds—one hearing, the other deaf; one under the laid-back Texas sun, the other within the energetic pulse of New York City; one mired in violence, the other rife with possibility—and heralds the arrival of a captivating new voice.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Book Club",
    "Autobiography",
    "True Crime",
    "Biography Memoir"
  ],
  "author": "Kambri Crews",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/11080710-burn-down-the-ground"
}