{
  "title": "Healing Glaucoma: Natural Medicine for Self-Healing",
  "description": "Subtitled Natural Medicine for Self-Healing, this book is an encyclopedic study guide, a download of the compiled research and experience of an eye doctor with thirty years experience on the front lines of holistic medicine. Dr. Swartwout has even included specific remedy and source suggestions in this heavily expanded third edition. In depth coverage has been added of multiple areas that will be of interest to the inquiring clinician and even clinical researchers will find new perspectives worthy of investigation. The book draws on an extremely wide range of effective therapies from around the world including European Biological Medicine. Detailed coverage is now included on reversing AGE (Advanced Glycation Endproducts) as well as an eye opening perspective on antioxidants, a section on Excitotoxins, and some discussion of Dr. Swartwout's 5 Phases of Health model based on Bioelectronics of Vincent that measures the parameters necessary to both quantitatively and qualitatively evaluate biological energy (in microwatts) in a fluid milieu. Those factors boil down to protons, electrons and photons in the author's penetrating insight into biophysics. Without oversimplifying anything, the discussion is aimed at supporting those patients and practitioners who are serious about discovering what may be possible in the realm of actually healing the pathophysiology of glaucoma.“This book is a great contribution to the emerging paradigm of 21st century vision care. It provides a thorough review of many healing modalities in order to help a person’s eye, body and soul heal the condition of glaucoma… A must for any patient or professional working with this condition. Dr. Swartwout is a pioneer in helping to regenerate our precious gift of sight.” - Marc Grossman, O.D., L.Ac., co-author of Greater Vision and co-author of Natural Eye Care",
  "genres": [],
  "author": "Glen Swartwout",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/19333871-healing-glaucoma"
}