{
  "title": "The Way of Humility: Corruption and Sin & On Self-Accusation",
  "description": "Originally a series written by Pope Francis while he was Cardinal Archbishop of Buenos Aires, these profound meditations give an inspiring introduction to the path of humility and love needed to form true Christian communities. They are divided into two separate works, Corruption and Sin , and Self-Accusation . As the Archbishop of Buenos Aires, Pope Francis ministered in a country that suffered greatly from the effects of corruption in public and private life. In these texts, the current Holy Father reflects on the connection between sin and corruption in the life of every Christian and how pride and self-sufficiency lead from one to the other. The roots of many of the themes of his pontificate can be found in these texts on humility, honesty and simplicity. The two pieces are on different but related issues. The difference between sin and corruption and the remedy for sin, which is self-accusation, meaning telling oneself the truth about one's faults. In short, pride is the problem; humility is the solution. The Pope \"It will do us good to reflect together on the problem of corruption and also on its relationship with sin. It will do us good to shake up our souls with the prophetic force of the Gospel, which places us in the truth about things by stirring up the layers of fallen dead leaves of human weakness and complicity that can create the conditions for corruption. It will do us a lot of good, in the light of God's word, to learn to discern the different states of corruption that surround us and threaten to lead us astray. It will do us good to say to one another again, \"Yes, I'm a sinner; but no, I'm not corrupt!\"-and to say it with fear, lest we accept the state of corruption as just another sin.\"",
  "genres": [
    "Religion",
    "Catholic",
    "Theology",
    "Spirituality"
  ],
  "author": "Pope Francis",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/19335734-the-way-of-humility"
}