{
  "title": "Meeting Dennis Wilson - Complete Edition",
  "description": "COMPLETE SINGLE VOLUME LIMITED EDITION of the seven-book serialized novel. 15 year old softball pitcher (and Beach Boys fan) Margo LeDoux has a crush on Beach Boys drummer Dennis Wilson, and wants to meet him, but her boyfriend, Scott, doesn't really like the idea (\"I don't want you runnin' off and bein' some groupie!\"). Meanwhile, Margo's best friend (and our narrator) Brian Pressley and his girlfriend, Christy Kelly, decide that they're going to \"take steps\" toward going all the way, steps which seem to get them into trouble no matter how careful they are. And then there's Christy's big sister Kathy, who's stricken with a bad case of senioritis and a boyfriend who's avoiding her just weeks shy of the senior prom... and Brian's buddy Marty, a shy kid with a Beatles obsession and a crush on Margo... and Margo's catcher Tara Longbaugh, whose parents have a Beach Boys connection that could get Margo closer to meeting her heartthrob... not to mention parents, brothers, sisters, classmates and teachers who just seem to make life harder, not easier. In Margo's words: \"How do we put UP with all these people?\" And how can a girl with a rockstar-sized crush meet the drummer of her dreams? This LIMITED EDITION complete volume contains all of the contents of the seven individual serialized books (except the \"bonus track\" extra stories included in books 1 through 4). It will be produced in print only during December 2013, after which time it will be deleted from publication. Individual volumes will remain available in print and Kindle editions. Reader reviews of the series... \"SHENK'S HOME RUN! A great story with subtle undercurrents between the characters that hook the reader... MEETING DENNIS WILSON can easily be compared to a teenager who's just coming of age. They're awkward, quirky, hilarious, and loads of fun to be around... This book is incredibly feel-good... Friendship and the emergence of first love combine with some downright laugh out loud writing... a great beach read... an engaging story with a killer soundtrack.... a wonderful book with great details... a story for all ages... I can't wait to read the next one... I started reading and could not stop... I recommend this book to anyone at any age.\" (excerpts from reader reviews on Amazon and Goodreads)",
  "genres": [],
  "author": "Max Harrick Shenk",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/19334606-meeting-dennis-wilson---complete-edition"
}