{
  "title": "Naurag: The Beginning",
  "description": "What was Earth called before Terra, Erda, and Bhoomi? What if there were civilizations more ancient and intelligent before the ones we have unearthed? Debutant author D. R. Nayak takes you on a journey to a mythical world Naurag, of mighty kingdoms in deep sea and land, ferocious beasts, and spell weavers. An orphan child Kahl, is adopted by the King of Naurag. Despite the prophesy, that an orphan would bring forth an evil unlike any that Naurag has witnessed, the King decides to give young Kahl a chance to prove himself. He appoints the royal teacher Ra Da Ur with the task of caring for the young orphan. Kahl grows up very bitter and blames the immortal Sauragians whose prophesy cursed him to the life of isolation. When he returns to the palace, he tries to nurture the same thoughts in his young sister Ujjala and brother Ural. Fearing for the children's future, the King sends the young princess and prince to Ra Da Ur. Under the care of the royal teacher, young Ujjala learns about the terrible prophesy and is urged to seek the help of the immortal Sauragians. Helped by her friends Torak, Mitra, Anguly and her brother Ural; Ujjala ventures on a perilous journey through the swamps of Gari and valleys of Mardrid to reach the gates of hope. Crossing the gates of hope, Ujjala enters Saurag the land of immortals. When Ujjala returns with the immortals, the games of death are announced on Naurag where Ujjala realizes that she has been selected as one of competitors in the games. Each task revealed in the games uncovers new fears and uncertainties that Ujjala has to overcome. But this time a chilling task has revealed itself in the scroll. The guardian of the scroll was found mysteriously dead and Ujjala has been assigned to complete a task that no student has ever attempted. An evil that was destroyed was being revived. Who was doing this? And how did this terrible catastrophe happen? The first of a thrilling trilogy, Naurag is a visually rich and enthralling story of two children growing together facing similar challenges, knowing the terrible prophesy looming over them and how each of them chose their path, and how this choice shapes their destiny.",
  "genres": [],
  "author": "D.R. Nayak",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/19332193-naurag"
}