{
  "title": "Someplace to Be Flying",
  "description": "Charles de Lint's beloved fictional city of Newford is the backdrop for this riveting urban fantasy which pays homage to ancient Native American legends of secret \"animal people\" living among us. Come join the misfits, marginalized and orphans of the modern world—street folks who sit around the fire by Moth's trailer in the junkyard in their own \"family of choice.\" Meet a punky pair of Crow Girls—delightful yet dangerous, who will insert themselves into your heart and change you forever; Raven—engimatic keeper of the pot that safeguards the ways of our world; Coyote—handsome Trickster ever driven to stir the pot with good intentions yet dire consequences; Fox—seductive canid whose past indiscretions return to haunt him; Jack Daw—storyteller who spins captivating tales while hiding his deepest sorrow; the Cuckoo family—viscious, amoral and determined to gain control of whatever will destroy the corbae (crow) clans. Combine these with a host of other compelling characters—animal and human—whose lives are woven together as they try to come to terms with complex personal relationships and damaged pasts. The mysterious threads of this story will set your imagination soaring on the winds of change, and culminate in a final battle over an object of such incredible power that it has the ability to destroy the entire world. Someplace to Be Flying, print edition review \"Nobody does urban fantasy better than Charles de Lint. He has a gift for creating engaging, fully realized characters, totally believable dialogue, and a feeling that magic is just around the corner … He can make you believe 'as many as six impossible things before breakfast.' \" —Amazon.com Editorial Review \"De Lint's elegant prose and effective storytelling continue to transform the mundane into the magical at every turn. Highly recommended.\" —Library Journal, Copyright 1998 Reed Business Information, Inc. \"In many hands, the urban fantasy plot involving strange beings just around the corner fails dismally. It does not in the hands of the reliable, the inimitable de Lint … \"As page-turning and intelligent as usual for de Lint, who clearly has no equal as an urban fantasist and very few equals among fantasists as a folklorist. First-rate.\" —Booklist \"An enthralling blend of old European and Native American mythology, seamlessly worked into a modern setting and situation. De Lint's best so far.\" —Kirkus Revews \"The reader does not have to be strictly a fan of either thrillers or fantasy to thoroughly enjoy this delightful tale.\" —The Washington Post \"De Lint is as engaging a stylist as Stephen King, but considerably more inventive and ambitious. With Someplace To Be Flying he has produced a book that should appeal even to those who, like this reviewer, do not generally care a lot for fantasy.\" —Toronto Globe and Mail",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Magical Realism",
    "Canada",
    "Magic"
  ],
  "author": "Charles de Lint",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/19351108-someplace-to-be-flying"
}