{
  "title": "The Extraordinary Journey of the Fakir Who Got Trapped in an IKEA Wardrobe",
  "description": "For readers of The 100-Year-Old Man Who Climbed Out the Window and Disappeared , a funny, charming, feel-good story about a fake fakir from India who arrives in France to shop at IKEA and unwittingly embarks on a European tour like no other.     Meet Ajatashatru Oghash Rathod. One day a fakir leaves his small village in India and lands in Paris. A professional con artist, the fakir is on a pilgrimage to IKEA, where he intends to obtain an object he covets above all a brand-new bed of nails. Without adequate euros in the pockets of his silk trousers, the fakir is all the same confident that his counterfeit 100-Euro note (printed on one side only) and his usual bag of tricks will suffice. But when a swindled cab driver seeks his murderous revenge, the fakir accidentally embarks on a European tour, fatefully beginning in the wardrobe of the iconic Swedish retailer.     As his journey progresses in the most unpredictable of ways, the fakir finds unlikely friends in even unlikelier places. To his surprise--and to a Bollywood beat--the stirrings of love well up in the heart of our turbaned hero, even as his adventures lead to profound and moving questions of the perils of emigration and the universal desire to seek a better life in an often dangerous world.     The Extraordinary Journey of the Fakir Who Got Trapped in an IKEA Wardrobe [pause for breath] is a hilarious tale that evokes the manic energy of a Marx Brothers romp and calls to mind the incisive social commentary of Candide . Pull up your Poang chair and take an unforgettable tour of Europe propelled by laughter, love and redemption. (Meatballs not included, but highly recommended.)",
  "genres": [
    "Fiction",
    "Humor",
    "France",
    "Contemporary",
    "Roman",
    "Adventure",
    "Novels"
  ],
  "author": "Romain Puértolas",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/19347251-the-extraordinary-journey-of-the-fakir-who-got-trapped-in-an-ikea-wardro"
}