{
  "title": "Sugar & Spice",
  "description": "When you think the unthinkable, where do you turn?Sugar & Spice is the UK #1 best-selling, controversial psycho-sexual (FULL-LENGTH) crime thriller the agents called \"the last taboo\".  Based on research and details from the case of Robert Black, a UK serial killer, Sugar & Spice was deemed \"Too controversial for the British market.\"100,000 + readers thought otherwise. Sugar & Spice is now one of the biggest-selling e-books in the UK of 2011. It has also just been voted as a 'Red Adept Reviews' 2011 indie award winner for mystery!If you like cosy crime, this is NOT for you. Sibel Hodge (author) called it \"Patricia Cornwell meets Silence of the Lambs.\"  The author draws heavily on the classic of the thriller genre, from Cornwell's Scarpetta and Thomas Harris through James Patterson, John Grisham, Dan Brown, Stieg Larsson and A.K. Alexander, to produce a truly unique and ground-breaking debut novel.Would you trust a convicted sex offender to help you find your daughter's killer? Claire did...Inspired by a news story of a man who begged a Judge to give him a longer sentence, because he knew he would harm another child if released without treatment, Sugar & Spice is meticulously researched, asking the questions society prefers not to have answered.At once disquieting and challenging, Sugar & Spice is car-crash reading.~It's every parent's worst nightmare: A child fails to return home. As hours turn to days, all they can do is hope. Some children never come back... Driven by the need to know why, a mother confronts the man accused of her daughter's murder, He presents a compelling defence, convincing Claire not only that he is innocent of harming her daughter, but that his previous convictions were not what they seemed. Teaming up with a second-year psychology student and a fourteen year-old truant schoolboy, Sugar & Spice is the story of a mother's fight to bring one man's reign of terror to an end.~Be warned: In Sugar & Spice not all things are nice...Praise for Sugar & Spice: \"Outstanding - compares well to any P.D. James novel.\"An American Editor\"Highly recommended.\" Sam Millar\"Saffi, your accomplishments are astonishing !\"James Thompson\"An unsettling read with echoes of Mo Hayder.\" Crimetime.co.uk\"A disturbing and cleverly-woven story. Powerful first novel.\"Jake Barton\"Compelling! A very tough subject handled exceptionally well.\"Mel Comley",
  "genres": [
    "Thriller",
    "Fiction",
    "Crime",
    "Mystery",
    "Suspense",
    "Drama",
    "Abuse"
  ],
  "author": "Saffina Desforges",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/11080802-sugar-spice"
}