{
  "title": "Sofie Metropolis",
  "description": "On her wedding day, right before the ceremony, right there in the Greek Orthodox church, Sofie Metropolis discovered her groom and her maid of honor in each other's arms. Sofie took this as a sign, and since then, she's been doing her best to confound her own, and her family's, expectations.First, she is no longer waiting tables at either her father's or her grandfather's dueling Greek restaurants in Astoria, Queens. Second, she kept the engagement ring (the garbage disposal choked on it) and all the wedding presents, including the small apartment building that was a gift from her parents. It's not easy to collect rent from an eccentric group of tenants that includes a trio of lackadaisical business school students and a nice little old Jewish lady who plies Sofie with ethnic delicacies, but at least Sofie has a roof over her head. And her ex-fiance's recliner in the living room.Sofie also has a new career, thanks to uncle Spyros's detective agency. Okay, so far, the cases haven't been all that exciting-mostly, Sofie's been tracking down lost pets and cheating spouses-but at least she's in control of her life. And even Sam Spade had to start somewhere.Then Sofie's mother's best friend, Mrs. Kapoor, who seems to dose everything, even tea, with curry, reports that her dog has been stolen. Sofie must drop everything to search for the meanest mutt on the face of the earth . . . .The agency's usually unflappable office manager comes to Sofie in terror because the neighborhood \"vampire\" has disappeared, replaced by his even creepier nephew . . . .Tailing a wayward wife, Sofie is caught in a shoot-out and is rescued by Australian man-of-mystery Jake Porter, who might be a bounty hunter and who definitely gets Sofie's engine started . . . .And what is Jake Porter doing in the middle of Sofie's adultery case anyway, and why is the cheating wife now on the run?",
  "genres": [
    "Mystery",
    "Chick Lit",
    "Fiction",
    "Humor",
    "Cozy Mystery",
    "Audiobook",
    "Contemporary"
  ],
  "author": "Tori Carrington",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/1935343.Sofie_Metropolis"
}