{
  "title": "Heart of a Knight",
  "description": "He had great hopes of becoming a legend… Geoffrey de Servian showed excellent promise of becoming a first-rate knight until one day he falls off a horse, leaving him physically and mentally broken. His ambition of becoming a celebrated knight is shattered, and he is left a shadow of the man he once was. But the fall was not an accident as everyone implies, and he sets out to find the culprit that dared to ruin his dream. In the meantime, he must find work and shelter, laying low until the opportunity arises, and he can meet his nemesis face to face. She only wanted to lead a simple life… Finally, Widow Karina can enjoy a modicum level of success. Her abusive husband is long dead, and her scented candles are slowly starting to sell. Unfortunately life as a female merchant is not easy, especially when the guild master is harassing her. But her fortune turns when an attractive stranger arrives at her door, looking for work. He offers protection from the guild master, and she takes him on. Only there is one problem — this remarkable stranger is different from any man that she’s ever known. And even more dangerous, he threatens to rip apart the steel cage that surrounds her heart, making her yearn for the impossible. Then just as they are drawn together, the king’s daughter appears in town, desperately seeking help. With passion and desire simmering just below the surface, Geoffrey and Karina must put aside their feelings for one another, and serve the princess in their own separate ways. And while Geoffrey possesses the mind and heart of a knight, is it enough to save the princess and win over the woman he loves? This medieval romance novella is approximately 36,000 words or about 100 print pages. Although the story has sexual elements, it does not contain explicit love scenes.",
  "genres": [],
  "author": "Dana D'Angelo",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/19367906-heart-of-a-knight"
}