{
  "title": "Death at the Abbey: A gripping, historical cozy mystery series from Anita Davison for 2024",
  "description": "Even the most glamorous stately homes hide secrets and lies from the past... When Flora Maguire receives an alarming telegram informing her of her father’s tragic death in a riding accident, she races back from London to her childhood home.But when Flora and her new husband, Bunny, get to Cleeve Abbey – where she was once Governess to Eddy, Viscount Trent, and her father was butler to Earl Trent – it’s all is not well.Flora’s intention was to bury her father next to Lily, her mother, who sadly passed away when Flora was a small child. But it turns out that a mystery surrounds the whereabouts of Lily’s final resting place.No-one is willing to talk. And, with her father now dead in what seems like a suspicious accident, Flora must now strive alone to uncover hidden family secrets. And a terrible betrayal with the power to change everything…A cozy mystery, perfect for fans of Agatha Christie and Downton Abbey, and set in the glorious Cotswolds landscape.Previously published as Murder at Cleeve Abbey.What people are saying about Death at the ‘Intriguing… Clues to keep you guessing… I was caught up in the story immediately.’ Goodreads reviewer, 5 stars‘I love, love, love this series! … The intricate plot with its many odd characters kept me turning the pages until the stunning end. I highly recommend this to everyone who loves historical fiction and who would like to venture into the cozy mystery genre. Highly recommended!’ Goodreads reviewer, 5 stars‘An intriguing mystery… Flora makes a wily opponent with first rate detective skills.’ Goodreads reviewer, 5 stars Would recommend to anyone who likes their heroines feisty.’ Goodreads reviewer, 5 stars",
  "genres": [
    "Mystery",
    "Historical",
    "Historical Fiction",
    "Cozy Mystery",
    "British Literature",
    "Fiction",
    "Crime"
  ],
  "author": "Anita Davison",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/193556984-death-at-the-abbey"
}