{
  "title": "The Kidney Sellers: A Journey of Discovery in Iran",
  "description": "\"In The Kidney Sellers, Fry-Revere shows considerable strengths as a nonfiction writer. She is a keen observer of details in surroundings, events, and people. The reader is caught up in her personal drama of anxieties, impressions, and reactions to events. The history, culture, and current political climate of Iran is interspersed liberally throughout the book so that the reader can better understand why Iranians are motivated to act as they do and why the current kidney donor system was enacted.\" — New York Journal of Books“Sigrid’s journey...reads like a novel blended with a captivating news article that you quite literally cannot put down…I give the book a very strong five stars.” — Rogue Reviews“Sigrid Fry-Revere has given us an amazing, courageous, provocative, even dangerous look at the complex and generally successful system of selling/donation that has solved the kidney supply problem in Iran.  Eloquently, humorously written, it is one of my best reads in years–fascinating to anyone who loves a good travel adventure story, but essential for anyone interested in overcoming the organ transplant problem that costs thousands of lives each year.” — Robert Veatch, Ph.D., Professor of Medical Ethics at the Kennedy Institute of Ethics and Fellow of the Hastings Center. “The Kidney Sellers is exciting, well written, and insightful. This book is going to revolutionize the way we think about living kidney donation.” — Harvey Mysel, Founder, Living Kidney Donors Network.“The Kidney Sellers offers an invaluable and hopeful contribution to a long-standing controversy. This book is a must read for anyone who wants to take improving donation rates seriously.” — Jim Gleason, UNOS board member, TRIO (Transplant Recipients International Organization) president.“The Kidney Sellers is at once a deeply researched policy manifesto, a geo-political thriller, and an intense personal account.” — Reason TV",
  "genres": [
    "Nonfiction",
    "Medical",
    "Medicine"
  ],
  "author": "Sigrid Fry-Revere",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/19359048-the-kidney-sellers"
}