{
  "title": "Get Off My Neck: Black Lives, White Justice, and a Former Prosecutor's Quest for Reform",
  "description": "A deeply revealing exposé of the American prosecutorial system and its historic and present racial inequities—and how we can transform the system to one of fairness and justice.In Get Off My Neck , Debbie Hines draws on her unique perspective as a trial lawyer, former Baltimore prosecutor, and assistant attorney general for the State of Maryland to argue that US prosecutors, as the most powerful players in the criminal justice system, systematically target and criminalize Black people. Hines describes her disillusionment as a young Black woman who initially entered the profession with the goal of helping victims of crimes, only to discover herself aiding and abetting a system that prizes plea bargaining, speedy conviction, and excessive punishment above all else. In this book, she offers concrete, specific, and hopeful solutions for just how we can come together in a common purpose for criminal justice and racial justice reform.Get Off My Neck explains that the racial inequities in the prosecutorial system are built into our country’s DNA. What’s more, they are the direct result of a history that has conditioned Americans to perceive the Black body as insignificant at best and dangerous at worst. Unlike other books that discuss the prosecutor’s office and change from inside the office, Hines offers a proactive approach to fixing our broken prosecutorial system through a broad-based alliance of reform-minded prosecutors, activists, allies, communities, and racial justice organizations—all working together to end the racist treatment of Black people.Told intimately through personal, family, and client narratives, Get Off My Neck is not only a deeply sobering account of our criminal justice system and its devastating impact on Black children, youth, and adults but also a practical and inspiring roadmap for how we can start doing better right now.",
  "genres": [
    "Nonfiction",
    "Social Justice",
    "True Crime"
  ],
  "author": "Debbie Hines",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/193555941-get-off-my-neck"
}