{
  "title": "Another Day in the Frontal Lobe: A Brain Surgeon Exposes Life on the Inside",
  "description": "Katrina Firlik is a neurosurgeon, one of only two hundred or so women among the alpha males who dominate this high-pressure, high-prestige medical specialty. She is also a superbly gifted writer–witty, insightful, at once deeply humane and refreshingly wry. In Another Day in the Frontal Lobe, Dr. Firlik draws on this rare combination to create a neurosurgeon’s Kitchen Confidential–a unique insider’s memoir of a fascinating profession.Neurosurgeons are renowned for their big egos and aggressive self-confidence, and Dr. Firlik confirms that timidity is indeed rare in the field. “They’re the kids who never lost at musical chairs,” she writes. A brain surgeon is not only a highly trained scientist and clinician but also a mechanic who of necessity develops an intimate, hands-on familiarity with the gray matter inside our skulls. It’s the balance between cutting-edge medical technology and manual dexterity, between instinct and expertise, that Firlik finds so appealing–and so difficult to master.Firlik recounts how her background as a surgeon’s daughter with a strong stomach and a keen interest in the brain led her to this rarefied specialty, and she describes her challenging, atypical trek from medical student to fully qualified surgeon. Among Firlik’s more memorable a young roofer who walked into the hospital with a three-inch-long barbed nail driven into his forehead, the result of an accident with his partner’s nail gun, and a sweet little seven-year-old boy whose untreated earache had become a raging, potentially fatal infection of the brain lining.From OR theatrics to thorny ethical questions, from the surprisingly primitive tools in a neurosurgeon’s kit to glimpses of future techniques like the “brain lift,” Firlik cracks open medicine’s most prestigious and secretive specialty. Candid, smart, clear-eyed, and unfailingly engaging, Another Day in the Frontal Lobe is a mesmerizing behind-the-scenes glimpse into a world of incredible competition and incalculable rewards.",
  "genres": [
    "Nonfiction",
    "Medical",
    "Medicine",
    "Memoir",
    "Science",
    "Biography",
    "Neuroscience"
  ],
  "author": "Katrina Firlik",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/193724.Another_Day_in_the_Frontal_Lobe"
}