{
  "title": "Broken",
  "description": "Telepath. Vigilante. Nightmare.The citizens of Detroit tell tales about the Angel. About how she stalks the streets at night, bringing evil to its knees.They pray her name.They whisper about those she's saved. And those she's destroyed.If only they knew the whole story.Molly Brooks has earned her reputation: an Angel to the humans she's saved, a nightmare to the supernaturals who cross her. She is the last and only line of defense between the innocents in her city and those who hunt them. She is feared. Loved. A legend in the making.But she's barely hanging on. She's lost too much, become something she fears. The things she doesn't know about her past threaten to destroy her as she tries to learn how to navigate the new world she's created for herself. Untangling the mysteries of her powers only reveals new dangers, more deadly than anything she could have imagined. Can she protect those she loves, those who have become her friends and family, from the nightmare of what she is?And what will it take to truly break her?Readers and Reviewers on “Lost Girl: Hidden, Book One”:“...an emotional rollercoaster...”“Humor. Romance. Violence. Memorable characters. Good and evil and a hell of a lot in between. There's a lot of good stuff in here.”“What a great book! Totally pulled me in...”“...marries urban legends and Greek mythology, along with a bit of superhero swagger.\"“Excellent story, excellent characters!”“This is a compelling read – fast paced and witty - with a main character who is so right in today’s climate where women are as far removed from a damsel in distress as a vampire is from tofu. Molly is a character I liked immediately – quirky but lovable - and I am looking forward to the sequel.”",
  "genres": [
    "Urban Fantasy",
    "Paranormal",
    "Paranormal Romance",
    "Fantasy",
    "Vampires",
    "Demons",
    "Romance"
  ],
  "author": "Colleen Vanderlinden",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/19377855-broken"
}