{
  "title": "Time to Upsize",
  "description": "Upsize Instantly to this Witty, Sexy and Bestselling Australian Series of E-books!The Indignities Book #1 is Available as a Special Introductory Offer!Turning thirty years old can be traumatic for young gay men who yearn to be boyish forever - but what can you do? It’s unavoidable. Or is it? Clever, conniving Stephen Spear thinks he can outsmart this particular milestone. After all, he’s managed to convince his sweet, passive boyfriend Blake that he’s been faithful to him for the past three years. Smoothing over and explaining away inconvenient realities is an absolute cinch for Stephen!But when temptation moves right next-door in the form of Rick, a Sydney hunk with a legendary endowment, Stephen disregards any sense of caution. He’s too entranced and far too self-absorbed to realise that the seduction might not actually unfold in accordance with his master plan.Stephen Spear, the anti-hero of the bestselling Australian novel 'Vanity Fierce', rides again in this outrageous sequel. Set ten years after 'Vanity Fierce', this new series of books can also be read as a self-contained storyline.˃˃˃ Praise for 'The Indignities' from influential Australian mainstream ’s wit is wicked in every sense of that word, while his ability to address confronting issues in a deceptively sunny manner is admirable. (Australian Book Review)The gay world has turned since 'Vanity Fierce', with the internet making its mark on social and sexual behaviour. Aitken has a keen sense of that, opening a window onto the lively confusions of gay culture. (The Age, Melbourne)˃˃˃ A must read. (Sydney Star Observer)The newspaper of record for Sydney's gay and lesbian community urges readers to read 'The Indignities'.'Aitken may have written the prequel to this book more than a decade ago, but don’t let that fool you into thinking 'The Indignities' is a second-rate follow. Far from it. Aitken has has not only given character Stephen Spear a whole new audience, but also provided him with the depth of character readers of 'Vanity Fierce' feared he may never find. A must read.' Sydney Star ObserverUpsize today! This funny, sexy and very entertaining book is free!",
  "genres": [
    "M M Romance",
    "LGBT",
    "Romance",
    "Gay",
    "Contemporary",
    "Amazon",
    "Fiction"
  ],
  "author": "Graeme Aitken",
  "average_rating": "2.89",
  "url": "https://www.goodreads.com/book/show/19374726-time-to-upsize"
}