{
  "title": "England, my England",
  "description": "My birth was easy; I slipped out like a greasy turd. Cleared of deviancy I turned to look at the host, a ruffled looking creature of perhaps thirty. I noticed in disgust that mucus had pooled in the pronounced cleft of her chin and as I was placed in flab dimpled arms I frantically tried to wipe it away. Interpreted as affection this elicited knowing chuckles from the assembled professionals, all of who were sodden with perspiration and blood. I have yet to reason why so many were present at my conjuring - perchance the stars ordained my coming?Thus begins England, my England, the controversial tale of a particularly English killer. Born of working class parents in a market town, witness his bloody struggle against bullies, teachers, liberals, the aristocracy, and a bloated culture screaming for annihilation. And the cat.Unsuitable for children or retards.Welcome to the most self-indulgent rant of the century, as an unnamed male goes on an eloquently wordy killing spree through modern England. Not so much showing contempt towards taboo as having unprotected sex with it in a bed sit and then wiping itself on the curtains afterwards, the book makes the Marquis De Sade seem like Enid Blyton. Gloriously iconoclastic, it is written in an elegant and witty prose - though slightly too long for my liking. If this book were a pub in town, it'd be a 3am brawl with duelling rapiers, after a six-hour absinthe binge.Left Lion MagazineEngland, My England is original in the true sense of the word, a satirical take on modern culture and a descent into madness. It is very funny, it is very dark and it will stay with you for a very long time. If, after reading the book (and you must see it through to the end in order to understand it), you are left feeling offended and outraged then you didn't 'get it', and the satire and honesty has been lost on you. It may require a few readings before you extract all of the nuances and subtle witticisms, but each time the journey from start to finish is just as affecting as the last.News editor, Close Up Film",
  "genres": [],
  "author": "King Henry",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/19374134-england-my-england"
}