{
  "title": "Adventures of Huckleberry Finn",
  "description": "This is the first edition of Huckleberry Finn ever to be based on Mark Twain's entire original manuscript—including its first 663 pages, which had been lost for more than a hundred years when they were discovered in 1990 in a Los Angeles attic. The text of the Mark Twain Library edition (first published in 1985) has been re-edited using this manuscript, restoring thousands of details of wording, spelling, and punctuation that had been corrupted by Mark Twain's typist, typesetters, and proofreaders. The revised Mark Twain Library Huckleberry Finn is sure to become the standard edition for all students and readers of Mark Twain.The authoritative new edition of this beloved work includes all of the 174 first-edition illustrations by Edward Windsor Kemble, which the author called \"rattling good.\" It also contains a new gathering of manuscript pages, photographically reproduced, and an appendix of passages from the manuscript, including the long-lost \"ghost story,\" which illustrate how extensively Mark Twain revised his work. The editors have also revised and updated their explanatory notes, the maps of the Mississippi River valley, and the glossary of slang and dialect words.The story of Huck and his companion Jim, a runaway slave, as they travel down the Mississippi to escape from slavery and \"sivilization\" has been delighting readers around the world since Twain first published it in 1885. Simply put, it is a revolutionary in its narrative method, surpassingly funny, and at the same time deeply perceptive about human nature. No other American novel of the nineteenth century still commands so vast an audience, and certainly no other retains the capacity to stir controversy with its sharp satire on American racism.A Responsible Critical TextTo produce this authoritative critical text, the editors studied all aspects of Mark Twain's manuscript, working notes, proof sheets, and letters. To judge the authority of every variant, they created a unique electronic database that made it possible to analyze--by speaker and date of composition--every word in the manuscript and first edition.An Inside View of How Mark Twain Wrote Huckleberry FinnThe new appendixes of \"Three Passages\" and \"Manuscript Facsimiles\" will give teachers and students as well as the general reader a close-up view of Mark Twain's writing process. They can follow the evolution of three key passages, as the author searched for the right word, the truest dialect, and the most telling description.",
  "genres": [
    "Fiction",
    "Classics",
    "Historical Fiction",
    "Literature",
    "Adventure",
    "Young Adult",
    "School"
  ],
  "author": "Mark Twain",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/19374.Adventures_of_Huckleberry_Finn"
}