{
  "title": "Hidden Passion",
  "description": "It’s almost a year since Jamie Burton began the painful journey of recovering his hidden past with Scot Victore. Even though the past is beginning to become clear for Jamie his present is seriously mixed up. He is forced to live two lives, he moves from his love for his beautiful Valerio to the hidden passion he shared with Scot. His journey is a difficult one, he can't be told the truth, he has to see it for himself and only with the help of Scot Victore can he do that. He’s confused by the strong emotions he has returning for Scot, he knows inside there was more, more than he feels for Valerio. But he also knows it hurts to be with Scot. He knows he should love Valerio but the pull he feels for Scot keeps growing and growing.Life with Valerio should be easy in comparison to his past relationship with Scot, but Valerio’s closeted homosexuality still hasn’t been resolved and they are nowhere near to having the open and loving relationship that Jamie craves for them. Hiding from the whole world is hard for them both, but Jamie never denies Valerio, never hides him and the frustration of always being held in the shadows of Valerio’s life is painful for Jamie.Scot would never deny Jamie, never turn him away. He's there for him in a way only he can see right now. His pain is growing along with Jamie's memories. How long can he cope with his painful past being lived out right in front of him in a way he didn’t see the first time. His love for Rafael is pure and uncomplicated but he knows his heart belongs to Jamie. Seeing Valerio fight so strongly to keep Jamie in his hold is breaking him in two. Scot loves Jamie in a way that no one else will ever do, but along with his love comes pain and hurt. Jamie has to see everything that has happened between them before Scot can be sure what Jamie wants. Running between Jamie and Rafael is hurting him but how can he turn from his beloved Jamie when he is the only person who can help him find the truth.All four of them are on a painful journey, one that can end only one way, even more painfully. Scot is the only one who can see the future, he is the only one who can understand what is to come and he dreads it with every breath he takes. When the end comes, when Jamie sees what has happened, what will remain of the love and passion that they both feel?When the truth is out and Jamie see’s what he has spent years hiding inside his mind will it be time for Scot to step back and continue with his beautiful Rafael and let Valerio take Jamie from him? Or will he and Jamie be able to be the couple that he has always wanted them to be?",
  "genres": [
    "M M Romance",
    "Romance",
    "Abuse",
    "Sports",
    "Contemporary",
    "Mental Illness"
  ],
  "author": "Nicole Colville",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/19369548-hidden-passion"
}