{
  "title": "Firebreather",
  "description": "For Angelina Brown, everything that couldn’t be proved with science was basically unnecessary; including love. Her outlook on the emotion was clinical, almost detached. That is until she found herself mated to one of the dragon shifters in a resident horde that she helped look after as an expert dragontologist. Ryuu had two issues. One, he needed to find a mate and fast. Two, he needed to solve a murder even faster. The first issue is taken care of when his mating to Angelina pretty much drops into his lap. But after an incident that leaves his confidence shaken, he begins to wonder, is the good doctor with him because of her heart’s curiosity or her brain’s? Stuck together through an unbreakable bond that is as old as time and just as strong; the pair finds themselves not only trying to figure out who their surprise arsonist is, but whether or not they should follow the lead of their emotions. “What do you want me to do?” she asked Elder Gou, who stood a short distance from Ryuu.  He stroked his goatee. “I feared this would happen. He’s waited so long to mate. Too long. He needs a mate. Now.” Angelina nodded. “If he doesn’t?” Elder Gou’s almond-shaped eyes were sad. “I fear he could die.” Die. Angelina looked down at Ryuu who had ceased fire breathing and simply laid on the hall’s floor, body drenched in sweat. His skin feverish, his face flushed, and his body warring against itself. She’d seen this before—when pubescent youths shift for the first time. Ryuu wasn’t even close to being in that age, over 28 for sure, so what exactly was his body doing? “Elder, I don’t have any remedies for this. When young hatchlings go through this, it is to test if they will live or die. Ryuu is an adult…” The Elder laughed, but it was without humor. “You do have what it takes to save him.” “I do?” “You are a female.” “Yes, but a human one.” Elder Gou nodded. He pointed to Ryuu. “In this state, Ryuu is a human male.” “Shifter.” She corrected. The Elder nodded. “If you do not wish to save him, I understand.” “It isn’t that. But why me? Why not one of the dozens of females in this keep who want to mate with him?” It seemed like an easy fix. Bring in a female dragon shifter, and she mates with Ryuu. He lives and it’s over.  Elder Gou sighed. “Any female will not do. Ryuu had rejected the females of this keep that are available to mate. Many of us here are related, and bringing in another female from a different clan will take too much time; he will die before then. Besides, as you know, we mate for life. I cannot bond him to a woman he does not love or want. If he has wished to be mated to just any female, he would have done so and spared himself this pain.” Angelina stared down at Ryuu’s suffering and now, spasming body. She did find him attractive, but having sex with him would bind her for life. After a decade of studying dragon shifters, she knew little about their mating with purely human females. It did happen, but in very rare cases. Most of the science on the subject warned against it because humans didn’t fair well. Would she be willing to give up her life, potentially, to save his?",
  "genres": [],
  "author": "RaeLynn Blue",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/19371372-firebreather"
}