{
  "title": "Half-Hearts",
  "description": "With billions of people on the planet, how can anyone ever find their other half? And what if everything depended on it?The magical world of Alamea is in imminent danger of falling under the control of Vranah, “The Great Evil,” as he sweeps swiftly and mercilessly across their entire planet. And, with every death on Alamea, the equivalent of that person dies on Earth, Alamea’s parallel planet. The only hope lies in an ancient Alamean prophecy— the prophecy of the Half-Hearts. According to this prophecy, if any two of the twenty-four Alamean Half-Hearts can find each other, fall in love, and marry in a place that is magically prepared for such a union, that union would tip the balance of power so that Vranah may be able to be defeated. Then and only then will Alamea be saved and Earth be free of its terrible twin destiny.Unfortunately, only Vranah knows the identities of the Half-Hearts. On the rare occasions that two Half-Hearts manage to even find each other, Vranah casts spells of distrust, jealousy, deceit, infidelity, abuse, and any other selfish traits he can throw at them, in order to break them apart and neutralize the threat. When love proves too strong to be distracted by such tactics, he simply kills them.Lani Johnson is a twenty-one-year-old college senior from California. Yanked out of her world and its relative safety, she is swept into Vranah’s final war for Alamea. As she discovers that everyone has extraordinary gifts, and as she works to develop her own, she has no idea what is at stake or what could be the key to saving both Alamea and Earth— or whether it is all simply an elaborate dream world that her broken heart constructed, in order to distract her from her own reality.Half-Hearts is a journey of thrilling twists and surprising turns, with many perils along the way. And from within what should be the safety of close friendship and true love, arises a shocking ending that no one will see coming.Visit the Half-Hearts Trilogy Website at www.HalfHearts.com",
  "genres": [],
  "author": "Kealohilani",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/19371627-half-hearts"
}