{
  "title": "Why We Can't Wait",
  "description": "Dr. King’s best-selling account of the civil rights movement in Birmingham during the spring and summer of 1963  On April 16, 1963, as the violent events of the Birmingham campaign unfolded in the city’s streets, Dr. Martin Luther King, Jr., composed a letter from his prison cell in response to local religious leaders’ criticism of the campaign. The resulting piece of extraordinary protest writing, “Letter from Birmingham Jail,” was widely circulated and published in numerous periodicals. After the conclusion of the campaign and the March on Washington for Jobs and Freedom in 1963, King further developed the ideas introduced in the letter in Why We Can’t Wait, which tells the story of African American activism in the spring and summer of 1963. During this time, Birmingham, Alabama, was perhaps the most racially segregated city in the United States, but the campaign launched by King, Fred Shuttlesworth, and others demonstrated to the world the power of nonviolent direct action. Often applauded as King’s most incisive and eloquent book, Why We Can’t Wait recounts the Birmingham campaign in vivid detail, while underscoring why 1963 was such a crucial year for the civil rights movement. Disappointed by the slow pace of school desegregation and civil rights legislation, King observed that by 1963—during which the country celebrated the one-hundredth anniversary of the Emancipation Proclamation—Asia and Africa were “moving with jetlike speed toward gaining political independence but we still creep at a horse-and-buggy pace.” King examines the history of the civil rights struggle, noting tasks that future generations must accomplish to bring about full equality, and asserts that African Americans have already waited over three centuries for civil rights and that it is time to be “For years now, I have heard the word ‘Wait!’ It rings in the ear of every Negro with piercing familiarity. This ‘Wait’ has almost always meant ‘Never.’ We must come to see, with one of our distinguished jurists, that ‘justice too long delayed is justice denied.’”",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Race",
    "Classics",
    "Social Justice",
    "Philosophy"
  ],
  "author": "Martin Luther King Jr.",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/11082099-why-we-can-t-wait"
}