{
  "title": "Just One %$#@ Speed Bump After Another: more cartoons (2)",
  "description": "Just One %$#@ Speed Bump After More Cartoons by Dave Coverly is the latest collection of comic panels by the proudly scatterbrained cartoonist and his constant companion, Cuppa Joe. Regular readers of “Speed Bump” will recognize the subtle ironies and the overlooked details we all take for granted, as well as the occasional wordplay and the gentle pokes at the absurd ways we live and love. Irregular readers might try bran. The humor is rarely tied to pop culture, current trends or fads; instead, it comes from the human traits we have in common. You may see your family in some of the panels, or your friends, neighbors and co-workers. You may even see yourself … heck you may even see yourself in animal form. In one “Speed Bump” cartoon entitled “Frog Puberty”, an adult frog talking to another about his youngster, says, “Last year I’d say ‘Jump’ and he'd say ‘How High?’ … This year I say ‘Jump’ and he says ‘How Come?’” Much like the last book, this “Speed Bump” tome covers a wide range of topics. You'll find plenty of cartoons about kids and parenting, love and relationships, work and business … and as Dave is a regular contributor to Pet’s Animal Times magazine, there are more than a few animal cartoons thrown in for good measure. Now with more than a decade under its stylishly drawn belt, “Speed Bump” has accumulated hundreds of newspapers and millions of readers on several land masses around the world. It’s found its way onto refrigerator doors, church bulletin boards, calendars and greeting cards, and into textbooks, TV programs, and even a U.S. Congressional Hearing. But being the nice folks that we are, we’ve saved you the trouble of tracking all these down yourself by binding them into a big, beautiful book. It even has a pull-out color section so you can pin your favorite.",
  "genres": [],
  "author": "Dave Coverly",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/1937829.Just_One_Speed_Bump_After_Another"
}