{
  "title": "Scurvy: How a Surgeon, a Mariner, and a Gentleman Solved the Greatest Medical Mystery of the Age of Sail",
  "description": "Scurvy took a terrible toll in the Age of Sail, killing more sailors than were lost in all sea battles combined. The threat of the disease kept ships close to home and doomed those vessels that ventured too far from port. The willful ignorance of the royal medical elite, who endorsed ludicrous medical theories based on speculative research while ignoring the life-saving properties of citrus fruit, cost tens of thousands of lives and altered the course of many battles at sea. The cure for scurvy ranks among the greatest of human accomplishments, yet its impact on history has, until now, been largely ignored.From the earliest recorded appearance of the disease in the sixteenth century, to the eighteenth century, where a man had only half a chance of surviving the scourge, to the early nineteenth century, when the British conquered scurvy and successfully blockaded the French and defeated Napoleon, Scurvy is a medical detective story for the ages, the fascinating true story of how James Lind (the surgeon), James Cook (the mariner), and Gilbert Blane (the gentleman) worked separately to eliminate the dreaded affliction.Scurvy is an evocative journey back to the era of wooden ships and sails, when the disease infiltrated every aspect of seafaring life: press gangs \"recruit\" mariners on the way home from a late night at the pub; a terrible voyage in search of riches ends with a hobbled fleet and half the crew heaved overboard; Cook majestically travels the South Seas but suffers an unimaginable fate. Brimming with tales of ships, sailors, and baffling bureaucracy, Scurvy is a rare mix of compelling history and classic adventure story.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Medicine",
    "Medical",
    "Microhistory",
    "Maritime"
  ],
  "author": "Stephen R. Bown",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/193845.Scurvy"
}