{
  "title": "The Critical Task",
  "description": "The Critical Task is an action and adventure thriller with an ever-surprising, multi-layered storyline! Clarion ForeWord Review: “Secret societies, artificial intelligence, and wild action meet in The Critical Task. First-time novelist Bryan A. Mantz packs every page of The Critical Task with action and, frequently, humor… The Critical Task is nicely designed, printed with an easily read variety of fonts and a captivating cover. The snappy dialogue between the protagonists is often a lot of fun, especially in the flirtation and growing romance between Bryant and Knoebel. They’re easy to like and entertaining to read about as they find themselves in an increasingly tangled web, running further into danger with every turned page.”Kirkus Reviews: \"A breakneck debut thriller that fuses elements of sci-fi and espionage fiction... The novel has many fine elements, including unique, first-person narration from a computer's point of view, as well as exceptional character development and relentless pacing... A thriller that offers an entertaining roller-coaster ride...\"Jason Bryant has a big problem that falls well outside the realm of his business school curriculum. He has somehow managed to land square in the crosshairs of Acies, an ancient criminal brotherhood that is calling for his elimination. Can a deteriorating supercomputer that may have its own agenda help this young MBA student escape certain death?The Critical Task is a wildly inventive suspense novel that is told from the perspective of a unique supercomputer. When Jason unwittingly runs afoul of Acies, he finds himself up against an organization that has remained hidden for centuries, while it has also infiltrated every major United States law-enforcing agency, including the FBI and CIA. To save himself, Jason must find out exactly who they are and stop them.When an FBI agent teams Jason with private investigator Teri Knoebel, together they gradually discover the organization's inside secrets. At the same time, the novel mines complex questions of existence, religion and scientific responsibility, bolstering the twists and turns of the investigation.As they soon realize that their lives are not the only ones at stake, will Jason and Teri prevail in The Critical Task?",
  "genres": [
    "Science Fiction",
    "Mystery Thriller"
  ],
  "author": "Bryan A. Mantz",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/19385882-the-critical-task"
}