{
  "title": "Burning Pyres, Mass Graves and a State That Failed Its People: India’s Covid Tragedy",
  "description": "The official figure of close to 500,000 deaths during the two waves of the Covid-19 pandemic in India are widely believed to be gross underestimates. As Harsh Mander shows, the underreporting of cases and deaths was the least of the crimes committed by the Indian state in the summer months of 2020 and 2021.The first part of the book, ‘Locking Down the Poor’, describes the grave humanitarian crisis of 2020, which pushed the urban poor to the brink of starvation. It shows how this was a direct consequence of public policy choices that the central government made, particularly of imposing the world’s longest and most stringent lockdown—with just four hours notice—with the smallest relief package. From the highways and overcrowded quarantine centres, Mander brings us stories of the estimated 30 million migrant workers whose livelihoods were destroyed, forcing them to walk hundreds of kilometres to their villages.The second part of the book, ‘Burning Pyres, Mass Graves’, records the horrors of the following year, when everything from hospital beds to medical oxygen and essential medicines fell disastrously short. Mander traces the causes for these shortages to the criminal neglect of public health in India, a situation made worse under the current government. He holds the state culpable for indulging in pageantry—with the Prime Minster advertising himself as a messiah—when the country needed to brace for the impact of the second wave which experts had warned was coming.Combining ground reports with hard data and first-hand knowledge, Mander chronicles the greatest catastrophe India has faced in a century, the effects of which will be felt for decades. This powerful, even shattering, book is a necessary record of a national tragedy that too many of us want to forget, when remembering is our only defence against a similar disaster in the future.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Harsh Mander",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/193845541-burning-pyres-mass-graves-and-a-state-that-failed-its-people"
}