{
  "title": "Ethical Realism: A Vision for America's Role in the World",
  "description": "America today faces a world more complicated than ever before, but both political parties have failed to envision a foreign policy that addresses our greatest threats. As a result, the United States risks lurching from crisis to crisis. In Ethical Realism , Anatol Lieven and John Hulsman, two distinguished policy experts from different political camps, have joined forces to write an impassioned manifesto that illuminates a new way forward.Rather than blindly asserting a mixture of American power and the transformative effects of democracy, Lieven and Hulsman call for a foreign policy that recognizes America’s real strengths and weaknesses, and those of other nations. They explain how the United States can successfully combine genuine morality with tough and practical common sense.To achieve these goals, Lieven and Hulsman emphasize the core principles of the American tradition of ethical realism, as set out by Reinhold Niebuhr, Hans Morgenthau, and George prudence, patriotism, responsibility, humility, and a deep understanding of other nations. They show how this spirit informed the strategies of Harry Truman and Dwight Eisenhower in the early years of the Cold War and how these presidents were able to contain Soviet expansionism while rejecting the pressure for disastrous preventive wars a threat that has returned since 9/11.Drawing on this philosophy and these historical lessons, Lieven and Hulsman provide a set of concrete proposals for tackling the problems we face today, including the terrorist threat, Iran, Russia, the Middle East, and China. Their arguments are intended to establish American global power on a more limited but much firmer basis, with greater international support. Both morally stirring and deeply practical, this book shows us how to strengthen our national security, pursue our national interests, and restore American leadership in the world.",
  "genres": [
    "Politics",
    "Philosophy",
    "International Relations",
    "Nonfiction",
    "History"
  ],
  "author": "Anatol Lieven",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/193866.Ethical_Realism"
}