{
  "title": "Sheila's Guide to Sulawesi, Indonesia",
  "description": "Indonesia is the largest island nation in the world, encompassing 17,000+ islands (Wouldn’t you like to know who counted them?), each with its own unique culture. Indonesia has rain forests, at least 150 active volcanoes, tropical beaches, Orangutans, famous resort areas, home to mankind’s last remaining frontiers, and a haven for underwater enthusiasts.Why Visit Sulawesi? Divers don't have to be told to visit either Sulawesi or Indonesia, home to some of the World’s best diving; with some of the highest levels of biodiversity in the world! Bunaken National Marine Park in North Sulawesi has 7 of the 8 species of giant clams - 70 genera of corals (Hawaii only has 10) - and may even have more fish species than the Philippines.The main focus of those, in-the-know, is to visit the ethnic Toraja people in the mountainous region of South Sulawesi; attend elaborate funeral rites that usually last several days; see burial sites carved into rocky cliffs where effigies of the dead keep watch; and unusual houses called, tongkonan. Tongkonan are large, peaked-roof traditional houses (similar to some seen in other parts of the world).It seems like some people work their whole lives so they can take an Exotic Vacation, when in reality, such a trip can be had for less than taking the family to DisneyWorld.Let Travels With Sheila teach you how to Travel the World on a Budget, share exotic locations with you known only to locals, and most importantly, ease your fears about languages, currencies, personal safety and staying healthy.HERE IS SOME OF THE INFORMATION YOU’LL FIND INSIDE...Easy Travel Basics.- The Dos and Don’t of Planning A Trip to Sulawesi.How to See the Best of Sulawesi.Now, Travels With Sheila tells it like it is with the personalized, up-to-date information and photographs you need to make the most of your trip to Sulawesi. See the best of Exotic Sulawesi from one end of this island to the other by following her travel tips.",
  "genres": [],
  "author": "Sheila Simkin",
  "average_rating": "1.00",
  "url": "https://www.goodreads.com/book/show/19388688-sheila-s-guide-to-sulawesi-indonesia"
}