{
  "title": "Kamun-Ra: The first book in the Mya of Thebes Chronicles",
  "description": "How does Mya know who to fight, if they refuse to step out of the shadows and into the light?It is Mya's eighteenth birthday and she can finally join the Protectorate academy at Kamun-Ra. Ever since she was a little girl she has been pulled to the Protectorate by the desire to save at least one life. But by the end of her adventure, she will be responsible for saving many more.Forbidden to return to her hometown of Thebes by the local magister, Mya has no choice but to continue on the path before her. Sailing to Kamun-Ra, Mya meets her best friend Shereen. After being shipwrecked, the pair are forced to claw and scrape their way to their new home.Their merry band of misfits is completed by the warrior poet, Octavian, and a pair of goblins named Uzzle and Zaz. Together, they must find a way to keep their sworn enemy to the north from destroying the Protectorate and sending the world into a civil war that will last thousands of years. Their adventure starts in the first book in the series, Kamun-Ra .The Mya of Thebes Chronicles is an adventure story that will follow Mya and her friends across every corner of the known world. Set in an ancient time, the countries in the Protectorate use magic to construct monoliths to honour the gods. Travelling across the various country sides, Mya fights against mythical creatures with her Protectorate Shab'Ti, which allow her to switch from sword to spear in a flash of blue. But no matter how many mythical beasts she conquers, she cannot forget her goal of defending the Protectorate from the Draski's vile plot.The Mya of Thebes Chronicles is a series that is not bound by traditional fantasy gender roles. It will instead let the characters be judged by their actions, allowing Mya and Shereen to both become very different heroes of legend.The Mya of Thebes ChroniclesAfter the birth of my daughter, I was inspired to write her an adventure story, and in doing so create a world and characters that she could fall in love with. As I get ready to release my first book in this journey I have come to the realization that I am sharing this with everyone that opens my book and decides to read Mya's adventures. I am not sure where this journey will go, but I have the feeling that it is going to be great.",
  "genres": [],
  "author": "M.A. McAlpine",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/193790067-kamun-ra"
}