{
  "title": "Vital Signs",
  "description": "More and more every day I find myself drawn into the puzzle of her speech, determined to unravel meaning in each sentence, because now I’m sure it’s there, if I only listen to her in a way I have failed to listen for thirty years. – From Vital Signs by Tessa McWatt After thirty years of marriage, producing three now-grown children, Mike and Anna have settled into entrenched domesticity. She is skillful and poised and still beautiful, an instructor of English at the city college. He is a successful graphic artist on the verge of retirement, his awards and ambitions and accomplishments largely behind him. Though the couple’s erotic life has dimmed somewhat, he still considers her ravishing. But their apparent balance is thrown asunder when Anna breaks the normal silence of their breakfast table with uncontrollable babble about hummingbirds. After an emergency consultation with a neurologist, they have a confabulation, or the scrambling of time, memories and language due to a dangerous aneurysm in Anna’s brain that could burst at any moment. Not knowing how much time they have left with the beloved Anna, Mike and the kids rally together to support her through the terror of her disintegrating mind. But the unbearable strain of the situation is worsened by another worry that is haunting he suspects that his two eldest children, Charlotte and Fred, know of his past infidelity. Several years ago, Anna and Mike took a trip to Egypt, hoping the shared adventure would thwart their mid-life marriage blues. Instead, the trip deepened the chasm, his sexual jealousy and insecurities swamping her attempts at intimacy. Their estrangement worsened when they returned home to discover that their youngest daughter, Sasha, was in hospital, having overdosed on drugs. Anna was furious with Mike for his cool response at the time, which she interpreted as unfeeling. Two weeks later Mike began his affair, with a much younger woman dissimilar to Anna in all respects. He persisted in the romance for three years, feeling young and vital and once again in control, at least for a time. The affair is long over but today, as Anna disappears into a terrifying collapse of time and language, Mike is wracked by his should he keep his silence about the affair and spare his family more pain, or should he seize the opportunity to be wholly honest with the woman he loves, possibly in the last days of her life? Perhaps the answer lies in his drawings, the means of communication with which he is most comfortable. Can he codify his emotions into pictures? Can he articulate his love and regret and sorrow to his wife – and to himself – without having to say the heart-rending words out loud? Narrated by a terrified male protagonist whose deep yearning for forgiveness might only be granted by a woman in the grips of dementia, Tessa McWatt’s Vital Signs is a thought-provoking and mesmerizing literary accomplishment – a compassionate and visceral study of a marriage at the brink of catastrophe.",
  "genres": [
    "Fiction"
  ],
  "author": "Tessa McWatt",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/11082749-vital-signs"
}