{
  "title": "Finally Home",
  "description": "This will be the 4th and final book in the Home Series, and focuses on Commander Michael Casiano and Lainey Riley.Mike Casiano has lived his life by a certain creed: take care of all those who depend on you and leave no man behind. He wanted more for his life than joining his family's law firm when he graduated college. His best friend was joining the Navy after graduation, and Mike decided to join him. After surviving the horrors of war, he has returned to his hometown to run a private securities company along with the other men from his unit who were now out of the service. Out of all his men, Mike has had the hardest time adjusting to civilian life...until his best friend's cousin comes into his life.At a society ball when she was seventeen years old, Lainey Riley looked up from the dance floor to the balcony above and saw a man in Navy dress whites who would haunt her dreams for years to come. He was her cousin's best friend and commanding officer, and he had the most beautiful, unique eyes she had ever seen. She would not see him again for nearly ten years, but the image of his face and his eyes was never far from her thoughts. When she meets him again while counseling the son of her cousin's fiancée, sparks definitely fly between them.When a man begins stalking Lainey, her cousin calls on Mike Casiano to keep her safe. Despite their attraction, Mike and Lainey butt heads at every opportunity. Will they get past their own differences and hard headedness to allow the attraction between them to grow? Lainey will try every trick in her arsenal to help Mike conquer the demons that haunt him and make it possible for the wounded warrior to see that he is Finally Home.",
  "genres": [
    "Military Fiction",
    "Romance",
    "Contemporary Romance",
    "Mystery",
    "Contemporary",
    "Romantic Suspense"
  ],
  "author": "Ann Vaughn",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/19380334-finally-home"
}