{
  "title": "Sinister Crown: Brave Mädchen tun das nicht",
  "description": "Ein dunkler Prinz. Seine heißen Bodyguards. Ein mysteriöser Professor. Und dazwischen ich. Als ich mein Studium an der Campbell-Universität an der Westküste der USA aufnehme, will ich nur Bloß nicht auffallen.Mein Plan scheitert direkt am ersten Tag, als ich in der Umkleidekabine der Schwimmhalle in eine Szene stolpere, die nicht für meine Augen bestimmt ist. Doch ausgerechnet den spanischen Thronfolger und seine Leibwächter dabei zu erwischen, wie sie im Drogenrausch ihren Spaß mit einem betäubten Mädchen haben, bringt mich schneller auf ihren Radar, als ich nur blinzeln kann. Ich habe etwas gesehen, was ich nicht sehen durfte, und dafür muss ich bezahlen.Die Fake-Freundin des Prinzen zu spielen, soll ihm helfen, seinen sowieso schon angeknacksten Ruf zu retten. In der Öffentlichkeit behandelt er mich wie die zukünftige Prinzessin, doch hinter verschlossenen Türen erniedrigt er mich zu einem Spielzeug, das er mit seinen Freunden teilt.Doch schnell stelle ich Dass mich ab sofort zwei heiße Bodyguards auf Schritt und Tritt verfolgen, ist gar nicht so verkehrt. Denn als meine Vergangenheit mich einholt, weiß ich, dass ich weitaus größere Probleme habe, als den Prinzen in einer Orgie erwischt zu haben.Eins davon ist mein attraktiver Professor, der mich so ansieht, wie er keine Studentin ansehen dürfte.Doch ob ausgerechnet er der Richtige ist, mir zu helfen, mein Geheimnis zu bewahren …?Sinister Crown – Brave Mädchen tun das nicht ist der Auftaktband einer fesselnden Dark-Reverse-Harem-Reihe von Amazon-Bestsellerautorin Alessia Gold. Neben zahlreichen triggernden Themen beinhaltet die Reihe tabulose, spicy Szenen, die explizit ausgeschrieben sind. Die Folgebände erscheinen in kurzen Abständen, mit jedem Buch wird die Reihe dunkler und intensiver. Für sensible LeserInnen ausdrücklich nicht geeignet. Kein Zusammenhang mit anderen Reihen der Autorin.",
  "genres": [
    "Dark Romance",
    "German Literature",
    "Romance",
    "Reverse Harem",
    "Audiobook"
  ],
  "author": "Alessia Gold",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/193855470-sinister-crown"
}