{
  "title": "Wuhan: How the COVID-19 Outbreak in China Spiraled Out of Control",
  "description": "The definitive account of the Chinese government's response to the initial Covid-19 outbreak in Wuhan .The Covid-19 pandemic, which began as an outbreak in Wuhan in late 2019, has claimed millions of lives and caused unprecedented disruptions. Despite its generation-defining significance, there has been a surprising lack of independent research examining the decisions and measures implemented in the weeks leading up to the Wuhan lockdown, as well as the missteps and shortcomings that allowed the novel coronavirus to spread with minimal hindrance.In How the COVID-19 Outbreak in China Spiraled Out of Control, Dali L. Yang scrutinizes China's emergency response to the Covid-19 outbreak in Wuhan, delving into the government's handling of epidemic information and the decisions that influenced the scale and scope of the outbreak. Yang's research reveals that China's health decision-makers and experts had an excellent head start when they implemented a health emergency action program to respond to the outbreak at the end of December 2019. With granular detail and compelling immediacy, Yang investigates the political and bureaucratic processes that hindered information flows and sharing, as well as the cognitive framework that limited understanding of the virus's contagiousness and hampered effective decisions.Yang's research uncovers that urgent warnings from sources outside Wuhan helped shift the Chinese health leadership's focus towards epidemic control. Once this shift occurred, China's party-state mobilized resources and enforced a lockdown in Wuhan. This lockdown was divided into two providing additional medical resources and enforcing community-level lockdowns and home confinement. The 76-day lockdown contained the virus within China's borders, but the leadership and public later faced the challenge of reopening China in a world still grappling with SARS-CoV-2. How the COVID-19 Outbreak in China Spiraled Out of Control also critiques the Chinese authorities for prioritizing dominance and control in their response to the Wuhan outbreak. This preoccupation led to the suppression, distortion, and neglect of crucial disease information, fostering an atmosphere of organized silence. The punishment of whistleblowers and the banning of the immediate release of research findings on the novel coronavirus further contributed to this silencing. Yang emphasizes the importance of retaining public trust during a pandemic and underscores the need for transparency, openness to new information, and direct communication of risk with the public.",
  "genres": [
    "China",
    "History",
    "Nonfiction",
    "Science",
    "Politics",
    "Biology",
    "Audiobook"
  ],
  "author": "Dali L. Yang",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/194011304-wuhan"
}