{
  "title": "The Sinner's Guide",
  "description": "Venerable Louis of Granada Venerable Louis of Granada was the favorite spiritual writer of St. Teresa of Avila, St. John of the Cross, St. Francis de Sales, St. Charles Borromeo, St. Vincent de Paul, and St. Rose of Lima; and The Sinner's Guide (along with The Book of Prayer and Meditation) is one of his two most famous and most popular books.St. Teresa of Avila stated that this work of Venerable Louis converted over 1,000,000 souls in her day. She, along with St. John of the Cross, St. Francis de Sales, St. Charles Borromeo, St. Vincent de Paul, and St. Rose of Lima, all counted it among their favorite spiritual books.\"We are all destined to one or the other,\" says Ven. Louis, \"either to reign eternally with God in Heaven or to burn eternally with the devils in Hell.\" This inescapable fact is vividly brought to life on every page of this masterfully written book. Utterly realistic with regard to the ultimate end of human life, Venerable Louis of Granada presents here the Four Last Death, Judgment, Heaven and Hell - even rehearsing with the reader the day of his death and the moment of his judgment. His description of the despair in Hell will shake loose any desire, by even the most hardened sinner, to persevere in sin. Man's classic excuses, such as planning to convert later and the difficulty of practicing virtue, are thoroughly demolished. Moreover, Ven. Louis shows how the sinner's life, because of his gnawing conscience, is a continual torment to him even while still on this earth. Whereas, the practice of virtue brings the wonderful promise of Heaven, plus the beautiful joy of a clear conscience, and the many other marvelous advantages of holiness -even here in this life! The Sinner's Guide is a book of crystal clarity which cuts through the religious fog so prevalent today. It strips away the glamour of sin, fortifying the soul for the resolute practice of the Christian virtues-those true riches which alone will accompany him beyond the grave.",
  "genres": [
    "Catholic",
    "Religion",
    "Spirituality",
    "Theology",
    "Christianity",
    "Christian",
    "Nonfiction"
  ],
  "author": "Louis of Granada",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/19391739-the-sinner-s-guide"
}