{
  "title": "All the Light We Cannot See",
  "description": "Winner of the Pulitzer Prize, a New York Times Book Review Top Ten Book, National Book Award finalist, more than two and a half years on the New York Times bestseller listA blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II. Marie-Laure lives in Paris near the Museum of Natural History, where her father works as the master of the locks (there are thousands of locks in the museum). Open your eyes, and see what you can with them before they close forever. Marie-Laure has been blind since the age of six. Her father builds a perfect miniature of their Paris neighbourhood so she can memorize it by touch and navigate the real streets with her feet and cane. When she is twelve, the German Nazis occupy Paris and father and daughter flee to the walled citadel of Saint-Malo on the Brittany coast, where Marie-Laure’s agoraphobic reclusive great-uncle lives in a tall house by the sea. With them they carry what might be the museum’s most valuable and dangerous jewel. In a mining town in Germany, the orphan Werner Pfennig grows up with his younger sister, Jutta, both enchanted by a crude radio they find that brings them news and stories from places they have never seen or imagined. Werner becomes an master at building and fixing these crucial new radios, a talent that wins him a place at an elite and brutal military academy and, ultimately, makes him a highly specialized tracker of the Resistance. More and more aware of the human cost of his intelligence, Werner travels through the heart of Hitler Youth to the far-flung outskirts of Russia, and finally into Saint-Malo, where his path converges with Marie-Laure. The story Illuminates the ways, against all odds, that people try to be good to one another.At the same time, far away in a walled city by the sea, an old man discovers new worlds without ever setting foot outside his home. But all around him, impending danger closes in.Ten years in the writing, a National Book Award finalist, All the Light We Cannot See is a magnificent, deeply moving novel from a writer “whose sentences never fail to thrill” (Los Angeles Times).",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Historical",
    "War",
    "World War II",
    "Audiobook"
  ],
  "author": "Anthony Doerr",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/19398490-all-the-light-we-cannot-see"
}