{
  "title": "Sycamore Row: by John Grisham -- Sidekick",
  "description": "THIS IS NOT THE NOVEL BY JOHN GRISHAM.Fans of John Grisham are excited about his very first sequel, Sycamore Row, which follows the characters and setting of A Time to Kill. If you are looking for a deeper reading experience, then this analysis is the perfect companion.  In Sycamore Row, we return to the character of Jake Brigance and the town of Clanton, Mississippi. With the Carl Lee Hailey case well behind him, Jake is frustrated and bored with the status of his professional life. But as he immerses himself in defending a will during an intense jury trial against powerful opponents, he gets out of the professional doldrums. The experience seems to breathe new life into his personal affairs, as well.  John Grisham crafts a tale of revenge and forgiveness with a gentler voice than in A Time to Kill. Fans will appreciate Grisham's range, as the reader enjoys the building tension as Jake does battle without the threat of death hanging over his head.  With this analysis, you will gain a better understanding of the characters and plot while receiving rich insight into the novel's themes and symbolism. Examine Grisham's writing style to see how he expertly builds tension in ways not seen in his previous works. This analysis covers an in-depth view of the setting, including the location, time period, and social issues. A convenient character reference list helps you keep track of the entire cast in Sycamore Row. The chapter-by-chapter analysis covers the plot while adding insightful details. Spoiler alerts tell you when to stop in case you are reading this analysis along with the book. Learn what drives each key character while you explore the major themes and symbols throughout the novel. Challenge your mind with the discussion questions and responses at the end of the analysis.  Get the most out of your reading with the help of an expert's perspective while you enjoy Sycamore Row by John Grisham.",
  "genres": [
    "Mystery",
    "Fiction"
  ],
  "author": "BookBuddy",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/19400580-sycamore-row"
}