{
  "title": "Charles Dickens in Cyberspace: The Afterlife of the Nineteenth Century in Postmodern Culture",
  "description": "Charles Dickens in Cyberspace opens a window on a startling set of literary and scientific links between contemporary American culture and the nineteenth-century heritage it often repudiates. Surveying a wide range of novelists, scientists, filmmakers, and theorists from the past two centuries, Jay Clayton traces the concealed circuits that connect the telegraph with the Internet, Charles Babbage's Difference Engine with the digital computer, Frankenstein's monster with cyborgs and clones, and Dickens' life and fiction with all manner of contemporary popular culture--from comic books and advertising to recent novels and films. In the process, Clayton argues for two important that postmodernism has a hidden or repressed connection with the nineteenth-century and that revealing those connections can aid in the development of a historical cultural studies. In Charles Dickens in Cyberspace nineteenth-century figures--Jane Austen, Charles Darwin, Charles Dickens, ThomasHardy, Henry James, Ada Lovelace, Joseph Paxton, Mary Shelley, and Mary Somerville--meet a lively group of counterparts from Andrea Barrett, Greg Bear, Peter Carey, Hélène Cixous, Alfonso Cuarón, William Gibson, Donna Haraway, David Lean, Richard Powers, Salman Rushdie, Ridley Scott, Susan Sontag, Neal Stephenson, Bruce Sterling, and Tom Stoppard. The juxtaposition of such a diverse cast of characters leads to a new way of understanding the \"undisciplined culture\" the two eras share, an understanding that can suggest ways to heal the gap that has long separated literature from science. Combining storytelling and scholarship, this engaging study demonstrates in its own practice the value of a self-reflective stance toward cultural history. Its personal voice, narrative strategies, multiple points of view, recursive loops, and irony emphasize the improvisational nature of the methods it employs. Yet its argument is serious and that the afterlife of the nineteenth centurycontinues to shape the present in diverse and sometimes conflicting ways.",
  "genres": [
    "History"
  ],
  "author": "Jay Clayton",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/1011957.Charles_Dickens_in_Cyberspace"
}