{
  "title": "Five Years in the Warsaw Ghetto: The Stars Bear Witness",
  "description": "Born in a small town outside of Warsaw in 1889, Bernard Goldstein joined the Jewish labor organization, the Bund, at age 16 and dedicated his life to organizing workers and resisting tyranny. Goldstein spent time in prisons from Warsaw to Siberia, took part in the Russian Revolution and was a respected organizer within the vibrant labor movement in independent Poland.In 1939, with the Nazi invasion of Poland and establishment of the Jewish Ghetto, Goldstein and the Bund went underground—organizing housing, food and clothing within the ghetto; communicating with the West for support; and developing a secret armed force. Smuggled out of the ghetto just before the Jewish militia’s heroic last stand, Goldstein assisted in procuring guns to aid those within the ghetto’s walls and aided in the fight to free Warsaw. After the liberation of Poland, Goldstein emigrated to America, where he penned this account of his five-and-a-half years within the Warsaw ghetto and his brave comrades who resisted to the end. His surprisingly modest and frank depiction of a community under siege at a time when the world chose not to intervene is enlightening, devastating and ultimately inspiring.“His active leadership before the war and his position in the Jewish underground during it qualify him as the chronicler of the last hours of Warsaw’s Jews. Out of the tortured memories of those five-and-a-half years, he has brought forth the picture with all its shadings—the good with the bad, the cowardly with the heroic, the disgraceful with the glorious. This is his valedictory, his final service to the Jews of Warsaw.”—Leonard Shatzkin",
  "genres": [
    "History",
    "Nonfiction",
    "Holocaust",
    "Poland",
    "Judaism",
    "War",
    "World War II"
  ],
  "author": "Bernard  Goldstein",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/1108448.Five_Years_in_the_Warsaw_Ghetto"
}