{
  "title": "Uprooting Racism: How White People Can Work for Racial Justice",
  "description": "In 2008 the United States elected its first black president, and recent polls show that only twenty-two percent of white people in the United States believe that racism is a major societal problem. On the surface, it may seem to be in decline. However, the evidence of discrimination persists throughout our society. Segregation and inequalities in education, housing, health care, and the job market continue to be the norm. Post 9/11, increased insecurity and fear have led to an epidemic of the scapegoating and harassment of people of color.\"Uprooting Racism\" offers a framework for understanding institutional racism. It provides practical suggestions, tools, examples, and advice on how white people can intervene in interpersonal and organizational situations to work as allies for racial justice. Completely revised and updated, this expanded third edition directly engages the reader through questions, exercises, and suggestions for action, and takes a detailed look at current issues such as affirmative action, immigration, and health care. It also includes a wealth of information about specific cultural groups such as Muslims, people with mixed-heritage, Native Americans, Jews, recent immigrants, Asian Americans, and Latinos.Previous editions of \"Uprooting Racism\" have sold more than fifty thousand copies. Accessible, personal, supportive, and practical, this book is ideal for students, community activists, teachers, youth workers, and anyone interested in issues of diversity, multiculturalism, and social justice.Paul Kivel is an award-winning author and an accomplished trainer and speaker. He has been a social justice activist, a nationally and internationally recognized anti-racism educator, and an innovative leader in violence prevention for over forty years.",
  "genres": [
    "Race",
    "Social Justice",
    "Nonfiction",
    "Anti Racist",
    "Sociology",
    "Politics",
    "History"
  ],
  "author": "Paul Kivel",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/11083973-uprooting-racism"
}