{
  "title": "No Easy Way Out",
  "description": "A ROMANTIC CLASSIC! First time available for Kindle. Full-length novel!Engineering robots, and all non-living creatures, was easy for Virginia – not so much with people. So when her best friend dragged her to the company Halloween party, Virginia went kicking and screaming…well as much as her Playboy bunny costume allowed for any movement.But with her mask in place and her normal reserve as tiny as her costume, Dr. Farrell suddenly let loose. Wild and wanton, she fell into the muscular arms of the costumed and masked Bandit. His virile charms and passionate kisses penetrated her reserve. But at the stroke of midnight, when the masks were to come off, Virginia fled, leaving her bunny tail in the palm of the handsome Bandit's hand.Dr. Alex Braddock was determined to find the curvy ass that fit the tail. He was stunned when it appeared that his new boss, Dr. Farrell was his sexy rabbit. But was it the prim, professional Virginia? She resembled oatmeal!Or her wanton twin sister? She got turned on by the navel in an orange!Which woman was the aggressor? Which woman ignited burning desire? Which woman - became the all-consuming question that needed an answer.This romantic comedy is a laugh-a-minute, with a team of fairy godmothers that would make any Cinderella blush and a surprise twist in the middle that makes for no easy way out!Love audio books - Fabulous narrator Katie McAble makes No Easy Way Out a delight to your ears and your funny bone! Her voice dazzles and makes each character come alive! This links to the Kindle ebook edition only!Romantic Times called it: \"A delicious tale of the unexpected. Not content with the usual ending, Chase confronts the very real problems of career conflicts and role models in an honest and straightforward manner.\"___________________________________________________________Other Elaine Raco Chase 'romantic classics' – One Way or Another and Best Laid Plans (first time back in print since 1983) the first friends with benefits novel!Updated and enhanced contemporary romantic comedies by Elaine Raco Chase: Special Delivery, Video Vixen, Designing Woman, Dare the Devil, Lady Be Bad, Calculated Risk, Rules of the Game, Double Occupancy and Three Books in One: A Well-Stacked Trio!_____________________________________________________________Fun note on this classic -No Easy Way Out was #100 in the Dell Ecstasy Romance line published in 1982. It was timed to debut two months after Disney's EPCOT Center opened in Orlando. Why? Because, like my real-life husband, heroine Dr. Virginia Farrell was working on the Audio-Animatronic™ robots robots for the park.",
  "genres": [
    "Romance"
  ],
  "author": "Elaine Raco Chase",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/19411958-no-easy-way-out"
}