{
  "title": "The Cityscape Series",
  "description": "The Cityscape Series tells a compelling story of devotion, deception, desire and ultimately, love. Start the trilogy people are calling \"gripping,\" \"sexy\" and \"smart.\" Now available as a complete set. COME UNDONE Olivia Germaine has already found love. Devoted wife, loyal friend, determined career woman - she's created the life she always envisioned. But when Olivia locks eyes with a handsome stranger across a crowded room, he peers a little too closely and sees emotions she thought she'd buried long ago. David Dylan, alleged playboy and eternal bachelor, challenges Olivia to confront the life she's built and to make decisions that could either lead to happiness . . . or regret. Will Olivia be able to draw the line between lust and love? And can David respect that line?COME ALIVE Determined to move on with her life, Olivia Germaine has vowed to forget David Dylan. Struggling to keep her head above water, she focuses on her new promotion and refuses to drown in the memory of him. But when Olivia realizes what life without David means, she must decide if she is willing to risk everything for him... and if she is ready to reopen the wounds of her past. Can Olivia move forward with her marriage despite her feelings for David? And can David stay away like he promised?COME TOGETHER With a single decision, Olivia Germaine's fantasy has become a reality. Now she is faced with two commitments: one she must make and one she must break. But in order to accept a love she never thought possible, Olivia will have to let go of the broken past that defines her - and of deeply-rooted fears that could ruin everything. Everything is what David Dylan wants to give her, and it's what he wants in return. He must prove to Olivia that despite his playboy ways, he's worth leaving behind the stable future her husband can offer her. David is a man who always gets what he wants . . . but this time he may be fighting for something unattainable. Can Olivia escape the past that threatens to consume her? And can David break through to her before it does?",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Audiobook",
    "Contemporary",
    "Erotica",
    "Drama",
    "Slow Burn"
  ],
  "author": "Jessica Hawkins",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/19402367-the-cityscape-series"
}