{
  "title": "2:46: Aftershocks: Stories from the Japan Earthquake",
  "description": "In just over a week, a group of unpaid professional and citizen journalists who met on Twitter created a book to raise money for Japanese Red Cross earthquake and tsunami relief efforts. In addition to essays, artwork and photographs submitted by people around the world, including people who endured the disaster and journalists who covered it, 2:46: Stories from the Japan Earthquake contains a piece by Yoko Ono, and work created specifically for the book by authors William Gibson, Barry Eisler and Jake Adelstein. “The primary goal,” says the book's editor, a British resident of Japan, “is to record the moment, and in doing so raise money for the Japanese Red Cross Society to help the thousands of homeless, hungry and cold survivors of the earthquake and tsunami. The biggest frustration for many of us was being unable to help these victims. I don’t have any medical skills, and I’m not a helicopter pilot, but I can edit. A few tweets pulled together nearly everything – all the participants, all the expertise – and in just over a week we had created a book including stories from an 80-year-old grandfather in Sendai, a couple in Canada waiting to hear if their relatives were okay, and a Japanese family who left their home, telling their young son they might never be able to return.\" If you'd like to make a donation to aid the victims of the March 11 earthquake and tsunami, please visit the Japanese Red Cross Society website, where you can donate via Paypal or bank transfer (watch out for the fees, though!) or the American Red Cross Society, which accepts donations directed to its Japan Earthquake and Pacific Tsunami fund (but only accepts donations made with U.S.-issued credit cards). And of course, if you like the book, please tell your friends, and tell them to give generously as well! Thank you! Japan really does appreciate your help!",
  "genres": [
    "Nonfiction",
    "Japan",
    "History",
    "Short Stories",
    "Memoir",
    "Anthologies",
    "Asia"
  ],
  "author": "Jake Adelstein",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/11085108-2"
}