{
  "title": "My Daily Book of Mormon Devotional - 365 Day Personal Study Guide",
  "description": "This book helps you answer two questions, “How do I make my scripture study more effective?” and “What should I study today?” It is a guide to help you, and your family, during your daily scripture study devotional. There are many Book of Mormon commentaries and study guides available that give the author’s perspective on the Book of Mormon. This book is not one of them. The great truths of the Book of Mormon, particularly those that will be of greatest benefit to you, are found by going directly to the source then listening to the promptings of the Spirit. The study guide allows you to fully customize your daily devotional based on the amount of time you have available. It is divided into seven Read, Look For, Ask Yourself, Ponder This Quote, Expand Your Understanding, Personal Application, and Prayer. This format allows you to select those activities that match both your needs and your time. For example, if you find you have limited time on a particular day you may only want to read the assignment and pray. On other days you can use the additional activities to expand your study and deepen your understanding. Following this pattern of scripture study and using these tools will lead you to ponder the Book of Mormon and will help you strengthen your testimony of its truthfulness as you listen to the Spirit. Additionally, it will aid you in obtaining the blessings promised by Elder Marion G. Romney in the April 1980 LDS General \"And so, I counsel you, my beloved brothers and sisters and friends everywhere, to make reading in the Book of Mormon a few minutes each day a lifelong practice. All of us need continuing close contact with the Spirit of the Lord. We need to take the Holy Spirit for our guide that we be not deceived. I am persuaded by my own experience and that of my loved ones, as well as by the statement of the Prophet Joseph Smith, that one can get and keep closer to the Lord by reading the Book of Mormon than by reading any other Book. Don't be content with what someone else says about what is in it. Drink deeply from the divine fountain itself. \"I feel certain that if, in our homes, parents will read from the Book of Mormon prayerfully and regularly, both by themselves and with their children, the spirit of that great book will come to permeate our homes and all who dwell therein. The spirit of reverence will increase; mutual respect and consideration for each other will grow. The spirit of contention will depart. Parents will counsel their children in greater love and wisdom. Children will be more responsive and submissive to that counsel. Righteousness will increase. Faith, hope, and charity--the pure love of Christ--will abound in our homes and lives, bringing in their wake peace, joy, and happiness.\" (Conference Report, April 1980; 112-113) Update Edition 2 (March 2014) Contains links to the LDS.org scriptures site for each of the reading assignments. Additionally a number of minor error corrections have been made to the original edition. Edition 2.1 (17 Apr 14) Contains a significant number of punctuation and formatting changes to bring it more in line with the LDS Church style guide. It also contains a corrections to a few minor errors in the cross reference sections. Edition 2.2 (18 May 14) Contains additional minor corrections and updates to the cross references. Edition 3.0 (15 July 14) Over 2500 hyperlinks added to the document to make cross referencing easier. Also contains corrections to a few minor errors that were found during the update and re-editing process. Edition 3.1 (24 Sept 14) Minor corrections to the text Edition 3.2 (2 Jan 15) Fixed minor errors and hyperlinks. Edition 3.",
  "genres": [],
  "author": "Layne Packer",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/19402164-my-daily-book-of-mormon-devotional---365-day-personal-study-guide"
}