{
  "title": "The Number Sense: How the Mind Creates Mathematics, Revised and Updated Edition",
  "description": "Our understanding of how the human brain performs mathematical calculations is far from complete, but in recent years there have been many exciting breakthroughs by scientists all over the world. Now, in The Number Sense, Stanislas Dehaene offers a fascinating look at this recent research, in an enlightening exploration of the mathematical mind. Dehaene begins with the eye-opening discovery that animals--including rats, pigeons, raccoons, and chimpanzees--can perform simple mathematical calculations, and that human infants also have a rudimentary number sense. Dehaene suggests that this rudimentary number sense is as basic to the way the brain understands the world as our perception of color or of objects in space, and, like these other abilities, our number sense is wired into the brain. These are but a few of the wealth of fascinating observations contained here. We also discover, for example, that because Chinese names for numbers are so short, Chinese people can remember up to nine or ten digits at a time--English-speaking people can only remember seven. The book also explores the unique abilities of idiot savants and mathematical geniuses, and we meet people whose minute brain lesions render their mathematical ability useless. This new and completely updated edition includes all of the most recent scientific data on how numbers are encoded by single neurons, and which brain areas activate when we perform calculations. Perhaps most important, The Number Sense reaches many provocative conclusions that will intrigue anyone interested in learning, mathematics, or the mind.  \"A delight.\"  --Ian Stewart, New Scientist  \"Read The Number Sense for its rich insights into matters as varying as the cuneiform depiction of numbers, why Jean Piaget's theory of stages in infant learning is wrong, and to discover the brain regions involved in the number sense.\"  --The New York Times Book Review  \"Dehaene weaves the latest technical research into a remarkably lucid and engrossing investigation. Even readers normally indifferent to mathematics will find themselves marveling at the wonder of minds making numbers.\"  --Booklist",
  "genres": [
    "Science",
    "Mathematics",
    "Psychology",
    "Nonfiction",
    "Neuroscience",
    "Education",
    "Parenting"
  ],
  "author": "Stanislas Dehaene",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/19410777-the-number-sense"
}