{
  "title": "Hooked: How to Build Habit-Forming Products",
  "description": "Why do some products capture our attention, while others flop? What makes us engage with certain products out of habit?Is there be a pattern underlying how technologies hook us? This book introduces readers to the \"Hook Model,\" a four steps process companies use to build customer habits. Through consecutive hook cycles, successful products reach their ultimate goal of bringing users back repeatedly -- without depending on costly advertising or aggressive messaging.Hooked is a guide to building products people can’t put down. Written for product managers, designers, marketers, startup founders, and people eager to learn more about the things that control our behaviors, this book gives readers:- Practical insights to create user habits that stick.- Actionable steps for building products people love.- Behavioral techniques used by Twitter, Instagram, Pinterest, and other habit-forming products.Nir Eyal distilled years of research, consulting and practical experience to write a manual for creating habit-forming products. Nir has taught at the Stanford Graduate School of Business and Hasso Plattner Institute of Design. His writing on technology, psychology and business appears in the Harvard Business Review, The Atlantic, TechCrunch, and Psychology Today.\"You'll read this. Then you'll hope your competition isn't reading this. It's that good.\"- Stephen P. Anderson, Author of “Seductive Interaction Design”\"Nir's work is an essential crib sheet for any startup looking to understand user psychology.”- Dave McClure, Founder 500 Startups\"\"When it comes to driving engagement and building habits, Hooked is an excellent guide into the mind of the user.\"- Andrew Chen, Technology Writer and Investor.“I’ve learned a great deal from Nir, and you will too. He’ll help you design habits to benefit your users, and your company.”- Dr. Stephen Wendel, author Designing for Behavior Change",
  "genres": [
    "Business",
    "Nonfiction",
    "Design",
    "Psychology",
    "Self Help",
    "Entrepreneurship",
    "Technology"
  ],
  "author": "Nir   Eyal",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/19404862-hooked"
}