{
  "title": "Peaches Monroe: The Complete 3-Book Trilogy",
  "description": "THE PEACHES MONROE TRILOGY - A Hollywood hunk falls for a very curvy bookstore manager. Rated 18+ for erotic romance and comedy.This collection contains all three books, also available separately:Book #1 - StardustBook #2 - StarlightBook #3 - Starfire\"This is one of those books that you beg your best friend to read because you have to have someone to laugh with. This book has everything ... humor, great characters, and hot sex!\"Bobbie Jo, Two Crazy Girls with a Passion for BooksPeaches Monroe is a curvy blonde who manages a little bookstore, in a small town in Washington State. She's twenty-two, and shares a house with her cousin, who's also her best friend. Life is good for Peaches. Simple, but good. Sometimes she gets a little wild and goes drunk-shopping on the internet. She's never had a boyfriend, but that just leaves more time for her books.Dalton Deangelo is a hot, young actor who sets ladies' hearts on fire.He shot to stardom from out of nowhere, and he's very secretive about his past, preferring to focus on his work. He's famous for playing the sexiest bad boy vampire on TV. Week after week, he's seen kissing beautiful, thin actresses ... or burying his face between their legs.Now Dalton is in Beaverdale, Washington, to shoot an indie movie over the summer. He comes running into the bookstore looking for a place to hide from reporters, and refuses to leave until he gets a date with Peaches.As soon as Peaches kisses Dalton, her quiet, small-town life begins to unravel.Peaches Monroe is launched toward the stars, beginning with a job in LA as a plus-size model for a line of sexy underwear.Her relationship with Dalton has its obstacles, and she finds herself entangled not just with Dalton, but with a passionate male underwear model named Keith Raven, as well as an old crush from her past, Adrian Storm.Life has become anything but simple for Peaches Monroe. Will her summer end in a wedding? And if so, who will be the groom?Reader reviews:\"OMG! I cried I laughed and cried a lot more. Loved, loved, loved the ending. Thank you for writing such an amazing series.\"Debbie Barrett\"Peaches kept me up all night. Thank you for an amazing book, series, characters. I laughed and cried so much that my husband was concerned. It was truly perfect.\"Melissa Bradshaw Davis\"I've read 100's and 100's of books, and MiMi's books literally made me spit all over my kindle.... OMG funny...... No spoilers here, GET THESE BOOKS NOW!\"Tammy Gurke\"Oh Mimi, she was marvelous! I will miss our dear Miss Peaches! I laughed, cried, laughed again! Starfire was such an amazing ending\"Carrie Walters\"I was up much later than I should have been on a work night, but I just HAD to finish Starfire before I went to bed last night.\"Jennifer Bartholomai Baldwin\"I miss all the characters already!! I almost fell off my chair with the counting dog & box of kittens parts. I had tears rolling down my face I was laughing so hard!\"Nancy Gelle",
  "genres": [
    "Romance"
  ],
  "author": "Mimi Strong",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/19404911-peaches-monroe"
}