{
  "title": "Halloween Party Ghost Effects - from bygone stage magic",
  "description": "Creating ghostly experiences at family Halloween parties is this booklet’s subject. It shares the methods which one family devised for parties for children aged from eight to twelve years old. · In part it’s unsophisticated, imaginative, childlike fun – building ghost train style tunnels in your home with wet rags dangling and sheets rising spookily from laundry baskets. · In part it’s unusual adaptation of old-fashioned stage magic to create startling ghost illusions – a flying luminous skull via Pepper’s Ghost, a ghostly magic lantern image projected on steam, and skeletal forms which are multiplied by unseen mirrors. You can draw inspiration from either aspect of the booklet on its own – or from both. The party ideas in the booklet were actually carried out and photos of some props are included plus diagrams to explain certain special effects. Very little spending is required – the props, like the fun, are home made. Readers need to pick and choose which parts to adapt for own use. Just one of these ideas, which you feel like adapting, will be enough for a Halloween party which everyone will remember. Some of the methods in the booklet could be adapted for events other than Halloween, like Santa’s Grottoes for younger children. This booklet is primarily for parents. Your children can become your partners in creating these parties and you can have great fun planning and rehearsing together. Older children / teenagers may be able to take charge of the ‘smoke and mirrors’ special effects side – and find this an absorbing, creative hobby. But, overall, parents need to be in the driving seat. Care is needed to ensure that these parties are fun, not frightening; relevant advice is included in this booklet. Americans, in particular, may be interested. While these party methods were developed by an English family in London, they fit American Halloween customs much better than they do English ones. A PRACTICAL MANUAL, NOT BEDTIME READING This booklet is well worth buying if you are considering creating a party like this yourself. But, if you’re just wanting to see special effects, its detailed practical advice is hardly relevant and there are plenty more colourful visuals available free on YouTube. We’re moved to make this comment by critical reviews on Amazon UK, which compare this booklet unfavourably with special effects items viewable free on the internet. These reviews miss the point of this booklet, which is detailed practical guidance for people who might actually utilise the methods described. To the best of our knowledge, this is the only document worldwide about using theatre ghost effects at a children’s party in a small home. It includes some original technical solutions – like how to use non-toxic steam, not smoke, as a screen for magic lantern projections and how to convert battery-powered torches / flashlights into dimmable lighting systems for Pepper’s Ghost. As practical guidance towards an unusual sort of children’s party, this booklet is a unique resource.",
  "genres": [],
  "author": "Charlie Henley",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/19421972-halloween-party-ghost-effects---from-bygone-stage-magic"
}