{
  "title": "Whispers in Time",
  "description": "Gabriella Delacruz is about to find out that time-travel-by-ancient-stone-artifact is no joke, but an all-too-real mode of travel to another time and place. A whispered warning of a dark stranger, a dead fiancé, and the devilishly handsome Damon St. Tremaine, sixth Earl of Arrowood, are just a few of the things she must contend with in nineteenth-century England.GABRIELLA DELACRUZ has lost everyone she’s ever loved. First, her parents, when she was only thirteen, her fiancé, five years ago, and now her beloved grandmother. At twenty seven years old, Gabriella doesn’t feel she has room left in her heart for anyone else. But all that changes the day of her grandmother’s funeral, when Gabriella discovers an unusual package in a trunk. One of the items contained in the package is a stone object that has mystical powers. This stone will serve as the catalyst for Gabriella’s journey into the past. As she’s transported back in time, a whispered voice warns her to “Beware the dark stranger…”DAMON ST. TREMAINE, sixth Earl of Arrowood, has always maintained a façade of cool indifference. His years spent fighting in the war with the French and subsequent years posing as a spy after the war have made him bitter and distrustful. When he sees the beautiful Gabriella for the first time, he is inexplicably drawn to her. Unable to resist the lure of the woman in her strange attire, he’s mesmerized by her slim figure, her scandalously exposed shapely legs, and stunning green eyes. But Damon doesn’t trust Gabriella, certain that her only purpose is to swindle his grandmother out of money and jewels.Gabriella has never seen such a virile and imposingly sensual man as Damon St. Tremaine, with his dark hair and dark, penetrating eyes. However, she refuses to be intimidated by the earl, giving him nothing but vague, flippant answers in response to his questions. She finds him condescending and arrogant, but she also finds him undeniably attractive.",
  "genres": [
    "Time Travel",
    "Historical",
    "Paranormal",
    "Fantasy",
    "Suspense",
    "Romance",
    "Chick Lit"
  ],
  "author": "Lori Villarreal",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/11085432-whispers-in-time"
}