{
  "title": "Rivulet",
  "description": "Unfathomable forces have always contested Genevieve Indiana Falcon, known as Indie. The curse of her cold touch entraps her just as the grief ignited in her past torments her. Yet, her mysterious ability to dream while awake saturates her in the belief that she was not always anguished. There is hope that one day a true peace in her soul can be found. Foolishly, Indie assumes she has contained her life in an odd balance, and she cherishes the visions she sees of the enigmatic boy that held her in a lost time, but can never reach. She grieves for a life she fears she'll never possess, and that grief is a weapon she uses against her aunt who stands between her and her inheritance. Weeks away from her twenty-first birthday, the date where she would assume control over her family legacy, a night terror robs Indie of the balance she was clinging to. Like the dream she had before she lost her family, it predicts a fatal catastrophe on the horizon. The fight between life and death, good and evil, began the moment her thundering heart awoke her. Everything changed after that dream. The one thing that keeps her curse at bay is stolen, and then the enigmatic boy arrives in the flesh. Face to face with her fiery born-again lover Indie realizes that the only way she can prevent the tragedy before her is to surrender everything she was, is, and could be. Can she bend the laws of nature and fight the improbability that fire and ice could ever be one? As far as Indie is concerned, there is not a myth, spoken fate, or curse that is stronger than her stubborn desire to have it all ... including him.The Rivulet series can be read on its own or as #11 in the Web of Hearts and Souls Series.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "New Adult",
    "Romance",
    "Supernatural",
    "Paranormal Romance"
  ],
  "author": "Jamie Magee",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/19417279-rivulet"
}