{
  "title": "The Venus Complex",
  "description": "A man rises out of an abyss of frustration and rage and creates works of art out of destruction, goddesses out of mere dental hygienists and beauty out of death. It’s also about the sickness and obsession that is LOVE.  Enter into Michael’s world through the pages of his personal journal, where every diseased thought, disturbing dream, politically incorrect rant and sexually explicit murder highlights his journey from zero to psycho.  EDITORIAL REVIEWS  \"This is one hell of a novel, Barbie Wilde, has written one of the most tense and powerful stories I have read in a long long time...I don't know from which dark recess of Barbie's mind she dragged this story from, but she is really beginning to scare me. It is as though some dark primal rage takes control of her mind when she writes stories like this.\"  --Ginger Nuts of Horror   “As intelligent and cultured as Hannibal, easily as disturbing as American Psycho and infinitely less reassuring than Dexter, this is a sexually-charged real life horror story that will definitely stay with you.”  --Paul Kane, award-winning horror and fantasy writer   \"...If you are a fan of both the crime and horror genres and want something special to read this Christmas, go for The Venus Complex.\"  --Fear Magazine   \"The Venus Complex is a clever, grisly, art-infused, sexually-charged narrative that will keep you turning pages. I apologize, but I simply have to say this: Barbie Wilde's work definitely has some sights to show you.\"  --HorrorTalk   \"The Venus Complex is the work of someone who loves and understands the inner workings of truly effective horror, can write with exceptional talent, and combines both of these things into one of the best depictions of steadily mounting evil this side of Poe. Or Clive Barker, for that matter.\"  --Drunk Monkeys",
  "genres": [
    "Horror",
    "Crime",
    "Serial Killer",
    "Audiobook",
    "Thriller"
  ],
  "author": "Barbie Wilde",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/19421391-the-venus-complex"
}