{
  "title": "Jade's Cowboy Crush",
  "description": "Single mother, Jade Miller, has just witnessed a murder. Now, set to testify against the cold-blooded killer, Jade must be placed under protection. While she is grateful to the kind folks who’ve offered to take in her and her son, Jade is surprised to find the man escorting them from L.A. to Montana is Gavin Emerson. A womanizing, far-too-attractive-for-his-own-good, rebel cowboy. Jade assures Gavin that she has sworn off men until her son is grown, but all too soon she finds herself fighting back feelings for the man who’s agreed to care for them. Gavin wants nothing to do with ranch life. Not since the ugly fallout he had with his father over eight years ago. But when he agrees to come back, harboring Jade and her son for a time, Gavin falls in love with life on the land once again. Above that, he finds his heart has been captured by his lovely house guest, Jade Miller. After reservations on both parts, the two are finally ready to open up and give their new-found love a try. Only they aren’t in the clear just yet, and as a dark and deadly threat falls upon them, Gavin finds that his bad-boy past may have led the danger right to their door.Excerpt: Jade wasn’t sure why she wanted him to think she was asleep. Perhaps to appear as if she hadn’t been waiting for him. Besides, he’d done his job, finished massaging her back, and what they both needed was a good night’s sleep. Nothing more. Yet as Gavin sunk onto the edge of her bed, ran a feathery-light finger over her arm, Jade wanted something more than a simple night’s sleep. She froze in place, stunned as she felt him lean over her, the bed slightly creaking beneath his weight. Her heart skipped at least two beats while she waited, working to keep her breaths slow and even. It wasn’t until she felt his warm breath on her face that she realized just how close he’d gotten. Did he plan to kiss her in her sleep? Like sleeping beauty? The idea caused a sudden streak of tingling anticipation to skitter over her flesh. If his lips touched hers, would she kiss him back? She imagined wrapping her hand around the back of his neck, indulging in the moment. Suddenly it seemed as if her heart was working to make up for the lost beats – pounding in excess to a near painful degree. Please, Gavin, she pled inwardly. Please just kiss me. Without a conscious thought, she let her lips part slightly. Gavin’s warm breath met hers, the seductive sensation causing Jade to silently grip fistfuls of the sheets at her sides.Wanting.Craving.*Though this novel is considered clean romance, it does contain passionate kissing scenes and a few mild curse words.*",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Westerns",
    "Contemporary",
    "Suspense",
    "Horses",
    "Amazon"
  ],
  "author": "Kimberly Krey",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/19442540-jade-s-cowboy-crush"
}