{
  "title": "Bound",
  "description": "Alice Cole spent her first seven years living in two smoky, crowded rooms in London with her family. But a new home and a better life waited in the colonies, or so her father promised a bright dream that turned to ashes when her brothers and mother took ill and died during the arduous voyage. Arriving in New England unable to meet the added expenses incurred by their misfortunes at sea, her father bound Alice into servitude to pay his debts. By the age of fifteen, Alice can barely remember the time when she was not a servant to John Morton and his daughter, Nabby. Though work fills her days, life with the Mortons is pleasant; Mr. Morton calls Alice his \"sweet, good girl,\" and Nabby, only three years older, is her friend, companion, and now newly married, her mistress. But Nabby's marriage is not happy, and soon Alice is caught up in its storm; seeing nothing ahead but her own destruction, she defies her new master and the law and runs away to Boston. There she meets a sympathetic widow named Lyddie Berry and her lawyer companion, Eben Freeman. Frightened and alone, Alice impulsively stows away on their ship to Satucket on Cape Cod, where the Widow Berry offers Alice a bed and a job making cloth in support of the new boycott of British wool and linen. At Widow Berry's, Alice believes her old secret is safe, until it becomes threatened by a new one. As the days pass, the political and the personal stakes rise and intertwine, ultimately setting off a chain of events that will force Alice to question all she thought she knew. Bound by law, society, and her own heart, Alice soon discovers that freedom as well as gratitude, friendship, trust, and love has a price far higher than any she ever imagined. Library Journal hailed Sally Gunning's previous novel, The Widow's War, as \"historical fiction at its best.\" With Bound, this wonderfully talented writer returns to pre-Revolutionary New England and evokes a long-ago time filled with uncertainty, hardship, and promise.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "18th Century",
    "Adult Fiction",
    "Novels"
  ],
  "author": "Sally Cabot Gunning",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/1945184.Bound"
}