{
  "title": "Winged Isis",
  "description": "The sky offered no second chances. The women of Isis had to save their world now. Or never.They live in a world divided: in Elysium, on one side of the electro-magnetic Border, reign the Procurators and Reverends, descendants of early 21st Century power elites and those who aped them; on the other live the Freelanders, whose democratic city-colonies, including the lesbian settlement Isis, have established a safe haven for social progress. Now, as the satellites that maintain the Border threaten to fail, all of Freeland is menaced by war with Elysium.The women of Isis refuse to wait idly for slaughter. Led by Tomyris Whitaker and her chief of staff--and former lover--Loy Chen, they are attempting to launch a mission to replace the deteriorating satellites that protect the Border. But General Medusa is convinced that a civilian task force cannot succeed in this critical mission and challenges their control. As Whitaker and Medusa play politics, sparks fly between the rival women they have each chosen to pilot the shuttle, Loy Chin and Major Mika Reno. But the crumbling Border satellites cannot wait for the orderly process of the Council, nor the disorderly love affairs as the women cling to what may be their last taste of freedom.On the ground, Whit's partner, Kali Tyler, works frantically to restore the Border by revising the computer programs her mother created years ago to protect Freeland. As Whitaker and Kali leave one another, they are fired by memories of their own mothers' deaths in the previous attack on Isis, and by the desire to live in a free world where they can raise the child that Kali is carrying.As love and duty become one, the lesbians of Isis risk their lives in a battle of wits and courage that will determine whether women will live free or die enslaved.",
  "genres": [
    "Lesbian",
    "Science Fiction",
    "LGBT",
    "Queer"
  ],
  "author": "Jean  Stewart",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/1108908.Winged_Isis"
}