{
  "title": "The P.J. Stone Gates Trilogy",
  "description": "The P.J. Stone Gates Trilogy Omnibus contains:~Hidden Gates (Book 1)~For P.J. Stone, being a “Seer” who has never seen anything is less than fun. And P.J. isn’t known for her patience.To make matters worse, she must choose a suitable mate to continue the Seer bloodline. Duty always comes before her heart…at least that’s what her parents taught her. When she finds herself wanting someone who is considered off-limits, P.J. is forced to question everything she believes.As if navigating her love life isn’t complicated enough, P.J. finally receives a vision—of a threat to her world that only she can perceive. But no one will believe a fledgling Seer’s warnings. With nowhere else to turn, she may decide to trust a stranger with her life, her world, and maybe even her heart.~Broken Gates (Book 2)~P.J. Stone is a Seer who saw too little, too late.In the past, her biggest worries were boys and school—but war has a way of changing things. Now, the alien Riders are trying to overrun the world. As the last of their kind, P.J. and her friends must find a way to save humanity before there’s nothing left to save. After choosing a mate, P.J. hoped she'd have time to enjoy her love life. But with everything changing so quickly and major secrets revealed, who knows what the future will bring?~Open Gates (Book 3)~Bryn is gone. Jenna isn’t herself. And the world has been taken over by the alien Riders. The only constant in P.J.’s life is Khol. But even he might not be able to help her pick up the shattered pieces of her existence.P.J. finally gets the answers to all her questions, but will she be able to handle the truth? And will she be strong enough to face her own destiny when the time comes?***This book is recommended for ages 17& up, due to sexual content and some strong language.",
  "genres": [
    "New Adult",
    "Paranormal Romance",
    "Fantasy",
    "Paranormal",
    "Romance"
  ],
  "author": "D.T. Dyllin",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/19448945-the-p-j-stone-gates-trilogy"
}