{
  "title": "Justice For Emily",
  "description": "The Paranormal Romance Guild nominated Justice For Emily as one of 2011's best reads.Rachael Merchant is on a cross country trip running from the tragic images of her last case that are embedded deep in her soul. She is a City of Phoenix Homicide Detective that is trying to deal with the freak show her life has become.Three days ago, she was sitting in a hospital room with a man that had just murdered his three small children because he was angry his wife had left him. After making the arrest, she let the perpetrator know that when he got out of prison she was coming after him. He would not be able to hide from her. She left the hospital, went back to work and quit on the spot.After a great deal of persuading, her captain convinced her that an indefinite leave of absence was in order instead of quitting. She went home, packed her bags and jumped in the car. With no destination in mind, she just drove.Rachael found herself on the side of the road, unsure of where she was and on the phone with her partner. All she wanted to do was run as fast and as far as she could from the image of those three small babies with bullets in their bodies.Officer Patrick Sheehan pulls in front of Rachael while she is bent over the hood of her car looking at a map. He overhears the conversation between Rachael and her partner and thanks fate for dropping a homicide detective right in his lap. His good friend, Emily, was murdered just days ago and Patrick knows who killed her, her husband and his boss, the Chief of Police of Brownwood, Texas.Boyd Campbell has taken extreme measures to cover up his wife's murder but Patrick is going to do everything in his power to put this monster away. He doesn't care what he has to do or say to get this cop to stay and work this case. He needs her help and she is just going to have to deal with it. She could just blame fate for bringing her here when he needed her expertise. After all, the only important thing at the moment is getting Justice For Emily.",
  "genres": [],
  "author": "Sandy Wolters",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/11088599-justice-for-emily"
}