{
  "title": "La patria del criollo: Ensayo de interpretación de la realidad colonial guatemalteca",
  "description": "This translation of Severo Martínez Peláez’s La Patria del Criollo, first published in Guatemala in 1970, makes a classic, controversial work of Latin American history available to English-language readers. Martínez Peláez was one of Guatemala’s foremost historians and a political activist committed to revolutionary social change. La Patria del Criollo is his scathing assessment of Guatemala’s colonial legacy. Martínez Peláez argues that Guatemala remains a colonial society because the conditions that arose centuries ago when imperial Spain held sway have endured. He maintains that economic circumstances that assure prosperity for a few and deprivation for the majority were altered neither by independence in 1821 nor by liberal reform following 1871. The few in question are an elite group of criollos, people of Spanish descent born in Guatemala; the majority are predominantly Maya Indians, whose impoverishment is shared by many mixed-race Guatemalans. Martínez Peláez asserts that “the coffee dictatorships were the full and radical realization of criollo notions of the patria.” This patria, or homeland, was one that criollos had wrested from Spaniards in the name of independence and taken control of based on claims of liberal reform. He contends that since labor is needed to make land productive, the exploitation of labor, particularly Indian labor, was a necessary complement to criollo appropriation. His depiction of colonial reality is bleak, and his portrayal of Spanish and criollo behavior toward Indians unrelenting in its emphasis on cruelty and oppression. Martínez Peláez felt that the grim past he documented surfaces each day in an equally grim present, and that confronting the past is a necessary step in any effort to improve Guatemala’s woes. An extensive introduction situates La Patria del Criollo in historical context and relates it to contemporary issues and debates.",
  "genres": [
    "History"
  ],
  "author": "Severo Martínez Peláez",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/1944853.La_patria_del_criollo"
}