{
  "title": "The Dalmatian Plantation: Max's Journey",
  "description": "There once was a Dalmatian puppy named Max. Maximillian Schalliwagger he was in fact! He lived in a pet shop called the Pet Palace. He was a happy boy, but something was wrong. He was 5 months old, (now going on 6!) and didn’t have his forever home yet and he was starting to fret! His friend, parrot Captain Jack, the mascot of the Pet Palace, tried to tell Max things would work out and be alright, but Max was still worried and afraid, and he couldn't sleep at night. Another pup at the Palace, Pugslee the Pug, just told Max she would be going soon. Her forever family picked her out of the bunch and she was excited to start her new life. Max was happy for her, but sad to see her go. Sad for himself too. When would he get his own family and forever home? The Boxer Brothers liked to tease. They told Max no one wanted him was because he was “...so funny looking with all those spots. You look like you got chicken pox!” they made fun. Max hung his head and almost started to cry, but didn’t want them to see. His tears he tried to hide. Captain Jack told Max \"don't pay them any mind. They don’t know any better than to be bullies and be mean and unkind.\" “Max you are U-nique. You are special and one of a kind. You are a special dog and should be proud of his heritage and the history of the Dalmatian breed and hold your head high.\" That night when Max went to sleep, he dreamed and he dreamed of what his life would be. Where would he end up and where would this lead? A nice life with a little girl or boy, and a nice family possibly? Or would he be part of a Firehouse team, as a fireman’s dog, riding along at top speed? Would he be a member of a circus troop, performing tricks and flips for cheering crowds at the show? He smiled at the thought of being in the spotlight, but then worried what if no one wanted him like the Boxers had teased? What if he ended up at the pet orphanage under lock and key. The Poodle sisters had warned him about this place for unwanted pets called The Society. Max tossed and he turned at that thought of this. Captain Jack had told him please not to fret. Even though The Society does good deeds, Max still was scared and didn’t want to end up there please. Then his dream turned to worse and he remembered the tale from long ago, the one that haunts all Dalmatians where ever they go. Of the woman who loved spots, so much in fact, she wanted 100s of spotted dogs to hang on her racks and make up her wardrobe with spotted coats, gloves and hats! “Oh no!” Max cried and covered his eyes. He didn’t want to see this coat nightmare, he didn’t want to lose his hide! “Now, now, my young friend, that is just a story.” Captain Jack tried to calm him. “You don’t have to worry. For there is a place where Dalmatians can live, free from harm, without a care in the world, and always safe and sound. Where they can run and play all day long, dig in the dirt and chase butterflies and squirrels.” “What is this place.” Max asked with a whine. “It’s a place in your heart and for all good Dalmatians to find. It’s there, you can trust me I have heard the tale told. Let yourself dream of running and playing all through the fields. And I hope your sweet puppy dog dreams will come true, very soon, this time for real.” And with a pat on his head, like a good dog Max did as told. He went back to bed and the wonderful dream began to unfold. Of this magical place with green fields of grass, a big white house with huge old oak trees guarding the pass. Then he saw a sight, something he could hardly believe. Another Dalmatian like him, also running care free. Max smiled and he barked running happily in his dream. The Dalmatian Plantation is the place where Dalmatians dream. This is a modern day, true life story of unwanted Dalmatian Max and his quest to find his forever home.",
  "genres": [],
  "author": "Teresa Anderson",
  "average_rating": "4.89",
  "url": "https://www.goodreads.com/book/show/19452803-the-dalmatian-plantation"
}