{
  "title": "Fair Catch",
  "description": "Training, playing ball and studying is Lexi’s life and it never seems to bother her until her friend, Parker Hill, points out to her that sweat pants on a Friday night while watching sappy romance movies isn’t really living up her last year in college. Lexi didn’t see the need to party since she didn’t know what the hell she was doing with her life after college but her friends wouldn’t take no for an answer. Little did she know going to the first party of the season was going to flip her world upside down. Jake Taylor, starting quarterback for Cal U and campus heart throb spent his entire college career, partying, getting drunk and winning football games but it is all finally catching up to him. He is ready to throw in the towel of his partying days when he decides to have one more last fling. That is when he runs into the one person that could turn his life inside out. Lexi wants nothing to do with Jake and his partying ways but after one bet gone wrong , she finds herself on a date with the annoyingly obnoxious, egotistical heart throb. Even though she wants nothing to do with him, she finds herself gravitating toward him and giving into his charm. They fall hard and fast for each other as they find love, comfort and a home. They live in their own littler world where nothing matters besides the love they share for each other. But love isn’t enough for Lexi when she is trying to find her way after college. She slowly sinks into Jake’s shadow and finds herself clawing out of the Jake sized hole she buried herself in so she can find who she is, who she wants to be and what her future holds for her. Fair Catch is a true love story that goes through the trials and tribulations of Jake and Lexi’s insecurities, jealousies, short comings and strong personalities. Love is one hell of a strong bond but sometimes, it’s not strong enough. Follow Jake and Lexi as they try to hold on to the love they share while they try to find themselves and find out what life is after graduation.",
  "genres": [
    "Sports",
    "Romance",
    "Sports Romance",
    "New Adult",
    "College",
    "Football",
    "Contemporary"
  ],
  "author": "Meghan Quinn",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/19462694-fair-catch"
}