{
  "title": "Playboy Interview with John Lennon and Yoko Ono",
  "description": "John Lennon could be angry, as he is in Lennon Remembers: The Full Rolling Stone Interviews from 1970, and nasty, as proven by Albert Goldman's brilliant, scathing The Lives of John Lennon.  But he could also be charming, smart, and extraordinarily witty, as he is in his last interview, published in book form as All We Are Saying. Co-interviewee Yoko Ono is charm-free but valuable, because she sparks the conversation and brings up fascinating stuff that Lennon wished she hadn't, like their mad plots to kidnap her daughter from her ex-husband. As interviewer David Sheff's tape rolls, John and Yoko's anecdotes flow effortlessly: the joys of making their 1980 comeback album, Double Fantasy; the mortifying horrors of John's \"lost weekend\" in L.A. with Harry Nilsson; John's interestingly twisted family life; John and Yoko and Paul's last get-together, watching Saturday Night Live the night producer Lorne Michaels offered the Beatles $3,200 to reunite on the show (they almost got in a cab and did it!).  Best of all is Lennon's song-by-song account of who wrote which famous tunes and where they came from. \"Strawberry Fields\" contains an entire childhood memoir, and the production reflects Paul's alleged \"sabotage\" of Lennon's work. \"Please Please Me\" was based on a Roy Orbison melody and Bing Crosby's punning song title \"Please (Lend an Ear to My Pleas).\" The \"element'ry penguins\" in \"I Am the Walrus\" refer to idiots like Allen Ginsberg who chant \"Hare Krishna\" worshipfully. \"Hey Jude\" was Paul's song comforting John's son Julian when John left his family for Yoko, and Paul's unconscious, reluctant farewell to his writing partner (\"go out and get her\").  Lennon had been publicly silent and artistically dormant for five years before these interviews, and he was just bursting with the exhilaration of the rebirth of his imagination days before his death. Reading this book is like sharing a day in the life of a very happy man. --Tim Appelo",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "History",
    "Pop Culture",
    "Biography Memoir",
    "Memoir"
  ],
  "author": "David Sheff",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/194658.Playboy_Interview_with_John_Lennon_and_Yoko_Ono"
}