{
  "title": "Below the Palmettos",
  "description": "When an earthquake rocks the capital city of Columbia, South Carolina something odd happens. In the wake of the tragedy people are starting to disappear around the city. Who or what could be responsible? Could it be the recently released drug lord Jamal Washington? Is it the unstable violent vagrant Anthony Roaper? Could it be the mysterious and legendary Third Eye Man? Or could it be something far worse.Police officer Steven Bowen has had his fair share of troubles. These days he just wants to live his life with as less stress as possible. When he is approached by Detective Davis Sutton to aid in the search for a particular missing subject, Bowen jumps at the chance to get off the street. What he finds instead will put his sanity to the test.Zeek is new in town. He is a college freshman looking for friends and new experiences. When he attempts to join a notorious fraternity the experiences he encounters take a deadly turn. Can he survive a night of hazing in the catacombs under the city?Matilda is Bowen’s wife. She works her hands to the bone as a nurse in the local emergency department. Family means everything in the world to her. Just how far will she go to protect the ones that she loves?Abigail Willits is a social media influencer and herpetologist on a special assignment in the state. When the number of missing persons climbs to noticeable levels her expertise is called upon. Now what could a reptile specialist be needed for?Alex McGregor runs the local homeless shelter. When he learns of the disappearance of a young woman in the area he becomes obsessed with finding her. What he finds in turn is a hell that no man should be subject to.From the mind and creator of SCRATCH: a novel comes a southern story of loss, isolation, and misfortune. What will you find, Below the Palmettos?",
  "genres": [],
  "author": "Thomas W.  Brown",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/194612757-below-the-palmettos"
}