{
  "title": "Everything is an Afterthought",
  "description": "A pioneering ROLLING STONE critic gets his due.What happened to Paul Nelson? In the '60s, he pioneered rock & roll criticism with a first-person style of writing that would later be popularized by the likes of Tom Wolfe and Norman Mailer as “New Journalism.” As co-founding editor of THE LITTLE SANDY REVIEW and managing editor of SING OUT!, he’d already established himself, to use his friend Bob Dylan’s words, as “a folk-music scholar”; but when Dylan went electric in 1965, Nelson went with him. During a five-year detour at Mercury Records in the early 1970s, Nelson signed the New York Dolls to their first recording contract, then settled back down to writing criticism at ROLLING STONE as the last in a great tradition of record-review editors that included Jon Landau, Dave Marsh, and Greil Marcus. Famously championing the early careers of artists like Bruce Springsteen, Jackson Browne, Rod Stewart, Neil Young, and Warren Zevon, Nelson not only wrote about them but often befriended them. Never one to be pigeonholed, he was also one of punk rock’s first stateside mainstream proponents, embracing the Sex Pistols and the Ramones. But in 1982, he walked away from it all — ROLLING STONE, his friends, and rock & roll. By the time he died in his New York City apartment in 2006 at the age of seventy — a week passing before anybody discovered his body — almost everything he’d written had been relegated to back issues of old music magazines. How could a man whose writing had been so highly regarded have fallen so quickly from our collective memory? With Paul Nelson’s posthumous blessing, Kevin Avery spent four years researching and writing EVERYTHING IS AN AFTERTHOUGHT: THE LIFE AND WRITINGS OF PAUL NELSONN. This unique anthology-biography compiles Nelson’s best works (some of it previously unpublished) while also providing a vivid account of his private and public lives. Avery interviewed almost 100 of Paul Nelson’s friends, family, and colleagues, including several of the artists about whom he’d written. Bruce Springsteen says, “He is somebody who played a very essential part in that creative moment when I was there trying to establish what I was doing and what I wanted our band to be about.” This is a landmark work of cultural revival, a tribute to and collection by one of the unsung critical champions of popular art. Black-and-white illustrations and photographs throughout.[Please note: There are listings online for a Feral House edition of this title, which was never published. The Fantagraphics edition is not only the preferred edition, it's the only edition.]",
  "genres": [
    "Music",
    "Biography"
  ],
  "author": "Paul Nelson",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/11089775-everything-is-an-afterthought"
}