{
  "title": "Truismes",
  "description": "« Le directeur a été très gentil avec moi le jour de mon embauche. J'ai eu la permission de gérer ma parfumerie toute seule. Ca marchait bien. Seulement, quand les premiers symptômes sont apparus, j'ai dû quitter la parfumerie. Ce n'était pas une histoire de décence ni rien ; c'est juste que tout devenait trop compliqué. Heureusement, j'ai rencontré Edgar, et Edgar, comme vous le savez, est devenu président de la République. C'était moi, l'égérie d'Edgar. Mais personne ne m'a reconnue. J'avais trop changé. Est-ce que j'avais raté la chance de ma vie ? En tout cas, je ne comprenais toujours pas très bien ce qui m'arrivait. C'était surtout ce bleu sous le sein droit qui m'inquiétait... »Difficile d’écrire son histoire lorsqu’on habite dans une porcherie et, qui plus est, lorsqu’on est devenue une truie. Car telle est l’extraordinaire aventure de la narratrice de cette fable terriblement sensuelle, qui se métamorphose sous les yeux stupides de son ami Honoré, prend du poids, se découvre une soudaine aversion pour la charcuterie, se voit pousser des seins surnuméraires, et finit, bien obligée, par quitter la parfumerie dont elle était l’hôtesse très spéciale...Tantôt humaine, tantôt animale, elle erre dans les égouts et dans les jardins publics où elle se nourrit de débris végétaux, elle met bas ses porcelets, devient l’égérie du futur président de la République avant d’être la maîtresse d’un très séduisant loup qui se nourrit de livreurs de pizzas et manquer finir sa vie dans l’assiette de sa propre mère.Derrière ces aventures porcines se profile une société aux prises avec un extrémisme obsessionnel de la vie saine mais de fait corrompue, une vaste ferme des animaux où les achats se règlent en Euro ou en Internet Card, où charlatans et fous mystiques se disputent le pouvoir.Le récit de cette modification se double donc d'un conte moral où l'œuvre d'imagination affiche ses intentions de satire sociale. Se plaçant d'emblée sous l'égide de Knut Hamsun, de la glèbe et de la sauvagerie attenante à l'humain, la narratrice, truie endiablée, permet au lecteur de renouer avec des plaisirs de lecture qui viennent de très loin.",
  "genres": [
    "Fiction",
    "France",
    "Fantasy",
    "Magical Realism",
    "French Literature",
    "Feminism",
    "Novels"
  ],
  "author": "Marie Darrieussecq",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/1948278.Truismes"
}