{
  "title": "The Great Derangement: A Terrifying True Story of War, Politics, and Religion at the Twilight of the American Empire",
  "description": "A revelatory and darkly comic adventure through a nation on the verge of a nervous breakdown--from the halls of Congress to the bases of Baghdad to the apocalyptic churches of the heartland.Rolling Stone's Matt Taibbi set out to describe the nature of George Bush's America in the post-9/11 era and ended up vomiting demons in an evangelical church in Texas, riding the streets of Baghdad in an American convoy to nowhere, following a trail of pork through the halls of Congress, and falling into the rabbit hole of the 9/11 Truth Movement.He discovered in his travels across the country that the resilient blue state/red state narrative of American politics had become irrelevant. A large and growing chunk of the American population was so turned off--or radicalized--by electoral chicanery, a spineless news media, and the increasingly blatant lies from our leaders (\"they hate us for our freedom\") that they abandoned the political mainstream altogether. They joined what he calls The Great Derangement.Taibbi tells the story of this new American madness by inserting himself into four defining American subcultures: • The Military, where he finds himself mired in the grotesque black comedy of the American occupation of Iraq;• The System, where he follows the money-slicked path of legislation in Congress;• The Resistance, where he doubles as chief public antagonist and undercover member of the passionately bonkers 9/11 Truth Movement; and• The Church, where he infiltrates a politically influential apocalyptic mega-ministry in Texas and enters the lives of its desperate congregants. Together these four interwoven adventures paint a portrait of a nation dangerously out of touch with reality and desperately searching for answers in all the wrong places. Funny, smart, and a little bit heartbreaking, The Great Derangement is an audaciously reported, sobering, and illuminating portrait of America at the end of the Bush era.\"The funniest angry writer and the angriest funny writer since Hunter S. Thompson roared into town.\" -- James Wolcott\"…[A] scabrous, hilarious vivisection of our disintegrating nation. …Taibbi shines a light on the corruption, absurdities, and idiot pieties of modern American politics. Beneath his cynical fury, though, are flashes of surprising compassion for the adrift credulous souls who are taken in by it all.\" -- Michelle Goldberg",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Religion",
    "Humor",
    "War",
    "Journalism"
  ],
  "author": "Matt Taibbi",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/1948003.The_Great_Derangement"
}