{
  "title": "The Complete King Series",
  "description": "The King Quartet in one perfect set! Every gift has consequences . . . FEARLESS Let's get this out of the way I can hear minds. And yes, that's about as much fun as it sounds. As long as I can remember, I've been the loner, the crazy girl who answers words that no one has spoken out loud. It doesn't help that I'm the perennial new kid in town, too; my family moves around so much that I'm constantly learning how to tune out a fresh set of voices. But then we move to King, Florida. It doesn't take me long to realize that this town is different. King was founded by magic and steeped in mystery, and I'd be intrigued if I wasn't worried about surviving. Ms. Lacusta, the science teacher, leads some weird exclusive club of girls, and she's trying to recruit me. That doesn't sit well with Nell Massler, the ultimate mean girl whose extracurricular activities include blood rituals. And mine is the blood she wants next. Entangled in a web of first love, quirky and secretive townsfolk, magic and blood spells, I discover the town's secrets aren't just bizarre . . . they're deadly. BREATHLESS I am not having the senior year I wanted. First of all, my boyfriend--and the love of my life--Michael goes off to college, leaving me on my own in the mystical--and sometimes scary--town of King. I think I can take care of myself during my last year here, but it turns out there are all kinds of threats ready to prove me wrong. First, I'm being stalked by a local preacher who suspects I have supernatural gifts. (He's right.) The hot new boy at school is flirting with me like crazy. Oh, and I'm being blackmailed by my chemistry teacher--who just might be a witch. I'm going to need all of my many talents--and a little help from unexpected sources--just to keep my head above water. . .literally. RESTLESS Aside from the fact that I can hear other people's thoughts, I used to be a fairly boring girl. But then I moved to King, Florida . . . and everything in my life went crazy. When I agreed to allow Ms. Lacusta to help me develop my powers, I had no idea how deep and dark the journey would become. Trapped between fascination and fear, I end up moving farther away from my friends and family, even from my boyfriend, Michael. Leading a double life forces me into decisions that will threaten my sanity and my future... and the very lives of those I love. ENDLESS After the insanity that was my senior year in high school, my life is back to what passes for normal. No witches are trying to kill me. No preachers are threatening to drown me. I'm away at college with my boyfriend, and I'm learning to control my powers. Everything is finally perfect . . . until it isn't. When my new part-time job leads to more than I bargained for, I'm thrown into a deadly fight against forces of evil that I didn't even know existed. Mastering my extraordinary gifts--and drawing on the strength of an endless love--may be the only weapons that can guarantee my happily-ever-after. Save Tomorrow is a series of paranormal romances that begins in the small town of King, Florida, winds through the Serendipity and Recipe for Death books, and finally culminates in Age of Aquarius, the inevitable showdown that ties all the characters together in a fight to stop the ultimate evil.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Romance",
    "Fiction",
    "Amazon",
    "Collections"
  ],
  "author": "Tawdra Kandle",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/19476859-the-complete-king-series"
}