{
  "title": "Hell’s Wasteland: The Pennsylvania Torso Murders",
  "description": "Did the Mad Butcher of Cleveland also strike in Pennsylvania? From 1934 to 1938, Cleveland, Ohio, was racked by a classic battle between good and evil. On one side was the city s safety director, Eliot Ness. On the other was a nameless phantom dubbed the Mad Butcher of Kingsbury Run, who littered the inner city with the remains of decapitated and dismembered corpses. Never caught or even officially identified, the Butcher simply faded into history, leaving behind a frightening legend that both haunts and fascinates Cleveland to this day. In 2001 the Kent State University Press published James Jessen Badal s In the Wake of the Butcher: Cleveland s Torso Murders, the first serious, book-length treatment of this dark chapter in true crime history. Though Murder Has No Tongue: The Lost Victim of Cleveland s Mad Butcher a detailed study of the arrest and mysterious death of Frank Dolezal, the only man ever charged in the killings followed in 2010.Now Badal concludes his examination of the horrific cycle of murder-dismemberments with Hell s Wasteland: The Pennsylvania Torso Murders. During the mid-1920s, a vast, swampy area just across the Ohio border near New Castle, Pennsylvania, revealed a series of decapitated and otherwise mutilated bodies. In 1940 railroad workers found the rotting remains of three naked and decapitated bodies in a string of derelict boxcars awaiting destruction in Pennsylvania s Stowe Township. Were all of these terrible murders the work of Cleveland s Mad Butcher? Many in Ohio and Pennsylvania law enforcement thought they were, and that assumption led to a massive, well-coordinated two-state investigation. In Hell s Wasteland, Badal explores that nagging question in depth for the first time.Relying on police reports, unpublished memoirs, and the surviving autopsy protocols as well as contemporary newspaper coverage Badal provides a detailed examination of the murder-dismemberments and weighs the evidence that potentially links them to the Cleveland carnage. Hell s Wasteland is the last piece in the gigantic torso murder puzzle that spanned three decades, covered two states, and involved law enforcement from as many as five different cities.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime"
  ],
  "author": "James Jessen Badal",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/19481859-hell-s-wasteland"
}