{
  "title": "All These Pieces of Me",
  "description": "Emma sees the world inside out and looks right past the physical scars that Brandon had begun to think would be the only thing the world would ever see. Set in Dallas, Texas, this is a mature adult Contemporary Romance series with BDSM elements and atypical themes, including physical disfigurement, Autism, and OCD. Each book will be a complete story, no cliffhangers. Brandon To say that I’m ugly is like saying a cemetery is quiet. Okay, maybe parts of me are attractive, sure. I’d gotten more than my share of second, hungry glances from women at clubs. Then I’d turn to the other side and they’d get a nice big glimpse of Quasimodo. Only the desperately drunk or the ‘I can fix you’ chicks took a third look. Not Emma, though. She looked right at my scars and didn’t miss a beat. The typical stares from folks noticing my face just blend into the background noise as I try to comprehend this odd little woman. She’s still and quiet, clutching her teddy bear like it’s nobody’s business. And maybe it’s not. Maybe least of all mine. There’s more there, I’m sure. Way more. And for the first time, I think I’m going to actually put in the effort to find out what, because I think it may just completely blow my sorry world apart. Emma The guy walking in front of me is seriously massive. I’d heard that everything is bigger in Texas, but this is absolutely ridiculous. There’s also the matter of his face. He has me both ready to swoon and run screaming in the same crazy second. I’m still not sure which of those options my body has decided on. I think the jury is still out on a lot of things to do with my current state of affairs. I wish I could talk the way that I think instead of stammering through life like a little girl who holds onto a damn teddy bear and continues to obsess over the color pink. I can't, though. My brain just doesn't work that way. His gentle brown eyes put me at ease for some reason I haven’t quite worked out yet, and I really want to know his story. Scars are just part of life and we all have them. Most of us are lucky, though, and have scars we can hide deep down inside. Most of us aren't forced to wear them on our face. *This book is intended for mature readers and contains romantic scenes of intimacy. This book does include BDSM themes.",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Contemporary",
    "Contemporary Romance",
    "Autistic Spectrum Disorder",
    "Dark"
  ],
  "author": "C.E. Kilgore",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/19474019-all-these-pieces-of-me"
}