{
  "title": "Journey to the Lost City",
  "description": "ReviewThe Mysterious and Dangerous Amazon Jungle, Subterranean Rooms, Tunnels, Pyramids, Ancient Aliens, Nazis, Traps, Thrilling Escapes, Chases, Strange Creatures, Dangerous Enemies, a Lost City and Great Characters, are just a few ingredients that make this exciting adventure thriller a must read for fans of this genre. (NY.Post.book.reviews)Product DescriptionIn the 17th century, 68 men enter the Amazon jungle to search for a lost gold mine. Ten years later a lone survivor emerges from the jungle and tells a fantastic tale about strange city built of stone they stumbled upon. Before his death, he records it all in a manuscript now known as Manuscript 512.Many years later, Colonel Fawcett reads Manuscript 512. To him, it is evidence a Lost City exists in the remote areas of the Amazon Jungle. He means to find it.The date is 1925 - The location is the Amazon Jungle. Colonel Percy Fawcett, his son Jack and close friend Raleigh Rimmell, are looking for a lost City rumoured to be hidden in the unexplored regions of the cannibal inhabited jungle.Dead Horse Camp is situated at the boundary of unexplored territory. Ahead lay the unknown, danger, and perhaps a Lost Civilization. The three explorers enter the jungle never to be seen or heard from again.In the following years, over 100 explorers lost their lives searching for the missing Fawcett expedition; those that did return found no trace of Fawcett. It was as if he had disappeared.Present day - New information that reveals what befell the Fawcett expedition reaches the civilized world. A team is put together to travel to the Amazon jungle. Their task is to unravel the mystery and find the Lost City of Z. But the journey to the Lost City is just the beginning. Inside lurks danger and a secret those guarding it will kill to protect. Survival will not be easy: escape almost impossible.An Unexpected Adventure Book 1 & 2 will take you inside the Lost City to learn of its many secrets and dangers. A thrilling story of adventure and discovery that weaves together an exciting blend of fact and fiction linked to the legends surrounding the lost Fawcett expedition and the mysterious Amazonian Jungle.An exciting archaeological mystery thriller with flashbacks to Colonel Fawcett's 1925 Expedition.",
  "genres": [],
  "author": "Ben Hammott",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/19475642-journey-to-the-lost-city"
}