{
  "title": "King Dork Approximately",
  "description": "From Frank Portman comes the long-awaited sequel to the beloved cult classic King Dork, of which John Green, author of The Fault in Our Stars, said, “Basically, if you are a human being with even a vague grasp of the English language, King Dork will rock your world.”   Aside from the stitches and the head wound, Tom Henderson is the same old King Dork. He's still trying to work out who to blame for the new scar on his forehead, the memory loss, and his father's mysterious death. But illicit female hospital visitations, The Catcher in the Rye, and the Hillmont High sex-pocalypse have made him a new man.   What doesn't make you stronger can kill you, though, and tenth grade, act two, promises to be a killer. Tom's down one bloodstained army coat, one Little Big Tom, and two secret semi-imaginary girlfriends. Now his most deeply held beliefs about alphabetical-order friendship, recycling, school spirit, girls, rock and roll, the stitching on jeans, the Catcher Code, and the structure of the universe are about to explode in his face. If only a female robot's notes could solve the world's problems, he'd have a chance. But how likely is that?   King Dork Approximately--it feels like the first time. Like the very first time.\nPraise for King Dork Approximately:\n“A hilarious peek into the male adolescent mind . . . [and] inside this sarcastic teen is the soul of a poet who makes this comedic tale a refreshingly insightful read.”—\nVOYA\n  “Utterly enjoyable, this book’s culture-meets-romantic-confusion focus makes it a teen take on Nick Hornby's High Fidelity.”—\nBooklist\n   “Tom’s irreverent voice and sharply observed, deeply funny insights about public education and the teen social order carry the story.”—\nPublishers Weekly\n “Portman has crafted a perceptive protagonist, whose brilliantly wry observations will keep readers laughing and whose voice is infused with an all-too-believable mix of innocence and cynicism.”—\nSchool Library Journal\n   “King Dork Approximately is a smart and sardonic sequel, a book for all ages.\"—Largeheartedboy.com  “Whether you're male or female, old or young, these two books will put into words feelings that you've always struggled first to express and then to repress.\"—Reason.com   “Sarcastic and funny, but it’s also super smart and insightful about the lives of teenagers.”—Bustle.comFrom the Hardcover edition.",
  "genres": [
    "Young Adult",
    "Fiction",
    "Humor",
    "High School",
    "Coming Of Age",
    "Music",
    "Teen"
  ],
  "author": "Frank Portman",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/19480624-king-dork-approximately"
}