{
  "title": "The Spy Game",
  "description": "‘If you were a sleeper, how long do you think it would takebefore you forgot who you really were? If you were living undercoverfor years and years. Which person would be you?' On a freezing January morning in 1961, eight-year-old Anna's motherdisappears into the fog. A kiss that barely touches Anna's cheek, arumble of exhaust and a blurred wave through an icy windscreen, and hermother is gone. Looking back, Anna will wish that she could have paidmore attention to the facts of that day. The adult world shrouds theloss in silence, tidies the issue of death away along with the thingsthat her mother left behind. And her memories will drift and settlelike the fog that covers the car. That same morning a spy case breaks in the news - the case of theKrogers, apparently ordinary people who were not who they said theywere; people who had disappeared in one place and reappeared in anotherwith other identities, leading other lives. Obsessed by stories of theCold War, and of the Second World War which is still a fresh andpainful memory for the adults about them, Anna's brother Peter beginsto construct a theory that their mother, a refugee from easternGermany, was a spy working undercover and might even still be alive. Aslife returns to normal, Anna struggles to sort between fact andfantasy. Did her mother have a secret life? And how do you know who aperson was once she is dead? The Spy Game is a beautifully wrought novel about loss,history, memory and imagination, and the way in which we shape these toconstruct our own identities. It is a painful and tender reminder ofthe importance of understanding the past and, in turn, the importanceof letting go.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Mystery",
    "Adult",
    "Literary Fiction",
    "Historical",
    "British Literature"
  ],
  "author": "Georgina Harding",
  "average_rating": "3.13",
  "url": "https://www.goodreads.com/book/show/19478026-the-spy-game"
}