{
  "title": "Bully Boy: The Truth About Theodore Roosevelt's Legacy",
  "description": "What Hath TR Wrought?“I don’t think that any harm comes from the concentration of power in one man’s hands.” —Theodore RooseveltThe notion that Theodore Roosevelt was one of America’s greatest presidents is literally carved in stone—right up there on Mount Rushmore. But as historian Jim Powell shows in the refreshingly original Bully Boy, Roosevelt’s toothy grin, outsized personality, colossal energy, and fascinating life story have obscured what he actually did as president.And what Roosevelt did severely damaged the United States.Until now, no historian has thoroughly rebutted the adulation so widely accorded to TR. Powell digs beneath the surface to expose the harm Roosevelt did to the country in his own era. More important, he examines the lasting consequences of Roosevelt’s actions—the legacies of big government, expanded presidential power, and foreign interventionism that plague us today. Bully Boy reveals:• How Roosevelt, the celebrated “trust-buster,” actually promoted monopolies • How this self-proclaimed champion of conservation caused untold environmental destruction• How TR expanded presidential power and brought us big government• How he heralded in the era of government regulation, handicapping employers, destroying jobs, and harming consumers• How he established the dangerous precedent of pushing America into other people’s wars even when our own national interests aren’t at stake• How this crusader for “pure food” launched loony campaigns against margarine, corn syrup, and Coca-Cola• How Roosevelt inspired the campaign to enact a federal income tax that was supposedly a tax on the rich but became a people’s taxBully Boy is both a groundbreaking look at a pivotal time in America’s history and a powerful explanation of how so many of our modern troubles began.From the Hardcover edition.",
  "genres": [
    "History",
    "Biography",
    "Presidents",
    "Politics"
  ],
  "author": "Jim  Powell",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/194721.Bully_Boy"
}