{
  "title": "Red Earth: Race and Agriculture in Oklahoma Territory",
  "description": "Before the great Land Rush of 1889, Oklahoma territory was an island of wildness, home to one of the last tracts of biologically diverse prairie. In the space of a quarter century, the territory had given over to fenced farmsteads, with even the racial diversity of its recent past simplified.In this book, Bonnie Lynn-Sherow describes how a thriving ecology was reduced by market agriculture. Examining three central Oklahoma counties with distinct populations—Kiowas, white settlers, and black settlers—she analyzes the effects of racism, economics, and politics on prairie landscapes while addressing the broader issues of settlement and agriculture on the environment.Drawing on a host of sources—oral histories, letters and journals, and agricultural and census records—Lynn-Sherow examines Oklahoma history from the Land Rush to statehood to show how each community viewed its land as a resource, what its members planted, how they cooperated, and whether they succeeded. Anglo settlers claimed the choice parcels, introduced mechanized farming, and planted corn and wheat; blacks tended to grow cotton on lands unsuited for its cultivation; and Kiowas strove to become pastoralists. Lynn-Sherow shows that as each group vied for control over its environment, its members imposed their own cultural views on the uses of nature—and on the legitimacy of the 'other' in their own relationship with the red earth.Lynn-Sherow further reveals that racism, both institutionalized and personal, was a significant factor in determining how, where, by whom, and to what ends land was used in Oklahoma. She particularly assesses the impact of USDA policy on land use and, by extension, environmental and social change. As agricultural agents, railroads, and local banks encouraged white settlers to plant row crops and convert to market farms, they also discriminated against Indians and blacks. And, as white settlers prospered, they in turn altered the relationship of Indians and African Americans with the land.The transformation of Oklahoma Territory was a protracted power struggle, with one people's relationship to the land rising to prominence while banishing the others from history. Red Earth provides a perceptive look at how Oklahoma quickly became homogenized, mirroring events throughout the West to show how culture itself can be a major agent of ecological change.",
  "genres": [
    "Agriculture"
  ],
  "author": "Bonnie Lynn-Sherow",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/194705.Red_Earth"
}