{
  "title": "A Wicked Hunger",
  "description": "Her mysterious past could mean his doom…or his salvation. Vampires run this city. Hell, they practically run the world. Despite her blurry past, Coraline knows just how dangerous they can be. All her life, she has strived to avoid them. But when her husband is murdered, and she finds herself targeted next, her survival suddenly depends on a devastatingly handsome vampire named Mason. Assigned to investigate Coraline and her crooked husband, Mason has had to ignore his intense attraction to the little mortal female. When she bears witness to her husband’s brutal murder, and is placed under his protection, it is more imperative than ever to keep his distance, especially when he discovers she is more than just human. A Wicked Hunger is book 1 in the Creatures of Darkness series. ====================== Interview with the Author Q - Tell us a little bit about your Creatures of Darkness series Creatures of Darkness is set in an alternate future where vampires have openly admitted that they exist and the world is still trying to adjust. The series follows Coraline Conwell who finds herself dropped dead-center into the largest know vampire clan. Though they claim to want to protect her, her past experience with vampires has left her terrified of their kind. Mason must not only guard her life, but earn her trust while trying to contain his intense desire for her. Q – What order should I read the books in? Each book can be read in any order and the reader can still follow along, but for the full experience, I suggest the following - A Wicked Hunger - A Wicked Night - A Wicked Desire Standalone novel in the - Keeping His Siren Q - So, why should readers give these books a try? For ravenous paranormal romance Creatures of Darkness hits the spot. Readers have said my world building grabs their emotions from the start and doesn’t let go. It’s a series that draws you in and makes love each and every character. Readers who enjoy steamy romance, alpha males, vampires, and intricate story telling will want to take this epic journey. Q - What inspired the world you created in A Wicked Hunger, having it take place in the future? I’ve always been interested in sci-fi, fantasy, paranormal, and mythology. I thought about the kind of romance novels I enjoy reading and what I liked about the idea that there could be a supernatural world within our own, veiled from sight. I often imagine different futures and certain events might affect our world, and since I love the supernatural world, it only made sense to incorporate vampires. My futuristic world also contains witches, succubus, incubus, familiars, shifters, and many other creatures of the night. Other books by Kiersten Fay - The Demon’s Possession - The Demon Slave - The Demon’s Retribution - Demon Untamed - Keeping His Siren Creatures of Darkness series ebook Categories - Paranormal Romance Series - Vampire Romance - Futuristic Romance - Fantasy Romance Series - Urban Fantasy - Science Fiction & Fantasy - Reverse Harem - Romance with Alpha Males - Witches & Wizards - Vampires - Succubus - Romantic Suspense - Myths & L",
  "genres": [
    "Paranormal",
    "Vampires",
    "Paranormal Romance",
    "Romance",
    "Fantasy",
    "Magic",
    "Urban Fantasy"
  ],
  "author": "Kiersten Fay",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/19482487-a-wicked-hunger"
}