{
  "title": "The Seahawk's Sanctuary",
  "description": "* 2013 Silver Medal Winner - Global eBook Award: Historical Romance* Best Book of 2011 Nominee - The Romance Reviews* 2011 Nominated for the Global eBook Award in 2 categories: Historical Literature – Fiction and Best eBook CoverPirates. Now she had to contend with pirates. Victoria wondered at the magnitude of her bad luck as she tried to gulp down her fear. Contempt narrowed her eyes as they swept over the British captain's inert form lying on the floor. Her hopes rose with her gaze when the blows to the door ceased.In the eerie silence, resounding words echoed throughout the cabin. \"Find Buck,\" ordered a voice of authority. \"Seems I have need of his special talents. I'll handle this.\"Historical Romance - Synopsis -Wishing to escape the dull responsibilities of his rice plantation home, Grant Hawthorne sails the seas procuring boycotted goods for the American colonies. While plundering an British merchant ship, he discovers the captain’s ill-treated cabin boy, Vic, and offers the youth the opportunity to join his crew. Grant quickly learns, however, that Vic is actually Victoria, a young woman who, for unknown reasons, is fleeing England. They try keeping her gender a secret from the crew, until a sailor exposes her deception, causing tensions to explode to mutinous proportions.After several weeks at sea, the ship sets anchor outside the Charles Town harbor and Grant, though intrigued by Victoria’s spirit and beauty, lets her go. While in port, he is confronted with the fact that a tragic accident has placed all the Hawthorne properties and assets in jeopardy. He suddenly realizes both Victoria and his home, are too precious to lose. With a firm determination, Grant initiates a search to locate the mysterious Victoria while he prepares to fight for what is rightfully his.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Pirates",
    "Historical Romance",
    "Fiction",
    "Historical"
  ],
  "author": "Lynne Marie",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/11092118-the-seahawk-s-sanctuary"
}