{
  "title": "Victorian Murderesses: A True History of Thirteen Respectable French and English Women Accused of Unspeakable Crimes",
  "description": "This riveting combination of true crime and social history examines a dozen cases from the 1800s involving thirteen French and English women charged with murder. Each incident was a cause célèbre, and this mixture of scandal and scholarship offers illuminating details of backgrounds, deeds, and trials.\"The real delight is that historian Mary S. Hartman does more than reconstruct twelve famous trials. She has written a piece on the social history of nineteenth-century women from an illuminating perspective: their favorite murders.\" — Time Magazine\"Noteworthy …. It has several distinctions: its expert prose style, its scholarly authority, and its perceptive analysis of the prevailing attitudes toward women's roles and domestic relations.\"—Criticism\"The author would have made a fine detective …. When she observes the women and men in extreme circumstances, she writes with the gift of a novelist and the depth of a scholar.\" — Los Angeles Times\"Vividly written, meticulously researched.\" — Choice\"Loved this book and so glad to see it's been returned to print! You can't beat the highly readable scholarly treatment of these 13 Victorian murderesses. Harman does a spectacular job of bringing these women and the carnage they created into the 20th and 21st centuries as well as giving the reader an excellent feminist critique of their reception in scholarly and popular culture. Pour yourself a cup of tea and enjoy the variety of their crimes and their drive to define themselves outside the constrictions of Victorian life.\" — Under the Covers and Reading",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Crime",
    "Victorian",
    "19th Century",
    "British Literature"
  ],
  "author": "Mary S. Hartman",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/19484244-victorian-murderesses"
}