{
  "title": "Desire & Prejudice",
  "description": "Desire & Prejudice is a new novella by first-time author Jean-Louis McMillan. The setting of this contemporary love story takes place in the late 20th century in the Middle East (Beirut-Lebanon, Paris-France and Morocco), among other secondary locales. Through the lives and the love of his two main characters, Adam and Jasmine, McMillan explores the power and the effects of PTSD, a dangerous—and perhaps irrational—kind of love, and the inexplicable prejudice that plagues our world and our relationships.The story begins when Adam and Jasmine meet, although that’s not the start of “their” stories. After his trauma, Adam’s life had shattered; the events haunted his memory, keeping him awake at night, the pressure of the trauma squeezing against his lungs, his soul. His life continued on a downward spiral until, eventually, he was entirely broken. He wasn’t sure how he’d ever be whole again.And then he meets Jasmine. He finds her while working as a secret official for the DGSE—France’s external intelligence agency, in Beirut-Lebanon. Their hearts are jolted back to life at the sight of one another, but their erotic affair is a dangerous one. Jasmine is a woman he cannot have and was never meant to be with. Her beauty captivates him; her love overwhelms him. Though Jasmine suffers from her own trauma and feels constricted within the confines of her societal role, she too finds temporary healing and freedom in her wild but secret romance with Adam.Through the events of their dangerous love affair, the reader is drawn in to the minds and the hearts of these two people. We root for them, although we know their love is impossible. The reader is left on the edge of their seat, wondering if and when and how they will get caught. It seems inevitable.But as it turns out, “getting caught” was never the real danger to their love. The most dangerous thing, we learn, is prejudice.Desire & Prejudice is a sexy love story with a spy thriller twist by one of the most exciting new authors of 2014. Through the story of Adam and Jasmine, first-time author Jean-Louis McMillan uses the classic tale to explore the modern art of lovemaking and the power of redemption. Does love have the power to overcome prejudice? Can it heal a wounded soul?",
  "genres": [
    "Erotica",
    "Fiction",
    "Romance",
    "Amazon"
  ],
  "author": "Jean-Louis McMillan",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/19502017-desire-prejudice"
}