{
  "title": "Risteard’s Unwilling Empress",
  "description": "Ristéard Roald is the powerful and deadly ruler of Elpidios, a planet that is slowly dying without the blood stones needed to absorb the radiation gradually destroying its stratosphere. He has sworn to do whatever it takes to protect his world and his people, but time is running out.Hope comes from an unexpected source, the Kassis. They have found a way to replicate the blood stones needed to save his world, but his first dealings with a traitorous Kassisan has left a deep distrust for the species.Ricki Bailey is used to dealing with diplomats and handling complex situations. After all, as the daughter of the owners of Cirque de Magik, the most spectacular Circus to the Stars, she is used to organizing their trips to foreign countries. Her life changes when her mother and father decide to take the circus to the real stars… and to another star system!If she thought learning new laws and customs was going to be a challenge, it was nothing to the sudden interest she was getting from a huge blue male known as the Grand Ruler! Ricki discovers words that she didn’t even realize were in her vocabulary, most of them not in the least polite.She decides the best way to deal with the arrogant male is to treat him like she did when encountering difficult Consuls during the circus’ travels on Earth; stay cool, calm, and professional and only deal with the facts necessary to complete whatever business transaction was required.Ristéard is stunned when a strange, alien female, foretold in the ancient tablets as being the great Empress who will save his world, appears. He is even more astonished when she refuses his attentions! With the life of his planet at stake, not to mention his own peace of mind and body, he will do whatever is necessary to ensure the female stays by his side.Yet, there are forces working against him and Ricki, powerful forces that do not want him to be successful. Dangers and traitors among his own council threaten not only him, but her. It will take all of Ristéard’s resources, and a few unexpected allies, to complete the dangerous journey ahead of them.Can he keep his unwilling Empress safe from those that would destroy her? Better yet, can he save his world when there are those that would destroy it for the treasure of precious blood stones hidden somewhere beneath its surface?",
  "genres": [
    "Science Fiction",
    "Aliens",
    "Romance",
    "Paranormal",
    "Science Fiction Romance",
    "Fantasy",
    "Audiobook"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/19500808-risteard-s-unwilling-empress"
}