{
  "title": "Introduction To The Constitution Of India",
  "description": "A book for everybody in India and abroad who wants to know anything about the Constitution of India during its first fifty years. Meets the requirements of the various Universities of India for the LL.B., LL.M., B.A. and M.A. (Political Science) and Competitive examinations held by the Union and State Public Service Commissions. Also indispensable for politicians, journalists, statesmen and administrative authorities. Prescribed in several Universities even for under-graduate courses in Civics. Incorporates all amendments to the Constitution upto 83rd Constitutional Amendment Act 2000. Contains materials, figures and charts not included in any publication so far on the subject. Elaborate comments on separatism in Punjab, Assam & elsewhere.Salient features:* While the Author's Commentary on the Constitution of India and the Shorter Constitution annotate the Constitution Article by Article, primarily from the legal standpoint, the present work offers systematic exposition of the constitutional document in the form of a narrative, properly arranged under logical chapters and topical headings.* It will supply the long felt need for an introductory study on the Constitution for the general readers, politicians as well as students and candidates for the Public Service Commission and other competitive examinations.* It traces the constitutional history of India since the Government of India Act, 1935; analyses the provisions of the present Constitution and explains the inter-relation between its diverse contents. * It gives an account of the working of each of the provisions of the Constitution during its first decade with reference to statutes and decisions wherever necessary, together with a critical estimate of its trends, in a concluding chapter.* The analytical Table of Contents, marginal notes, index and the graphic Tables at the end of the book will serve as admirable aids.* The three Legislative lists have been printed side by side for the convenience of reference.* The change made by the different Constitution Amendment Acts upto the 83rd Amendment and the reorganisation of the States made by various statutes may be seen at a glance.* Without going into excessive detail the footnotes and references have been printed at the end of each Chapter so that the advanced student and the researcher may profit by pursuing those references, after his study of the contents of each chapter.* The status of Jammu and Kashmir and the provisions of its State Constitution have been fully dealt with.",
  "genres": [
    "India",
    "Nonfiction",
    "Politics",
    "History",
    "Law",
    "Academic",
    "Indian Literature"
  ],
  "author": "Durga Das Basu",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/1949356.Introduction_To_The_Constitution_Of_India"
}