{
  "title": "She Didn't Run thriller box set: Three riveting women’s fiction novels with bonus short read",
  "description": "GET THREE BOOKS IN ONE GREAT-VALUE BOX SET FROM AN AWARD-WINNING AUTHOR!SHE DIDN’T RUN is a collection of three full-length women’s fiction suspense novels, plus a bonus short read. In each thriller novel, you’ll meet a woman who refused to run from danger. Or the truth.Along with three unexpected heroines, you’ll encounter spiraling tension, shocking secrets, travel-worthy destinations and relationships with heat.From a prestigious American university near Washington DC, to a wealthy neighborhood in Mexico City where social inequality is the norm, and finally to a heart-stopping murder scene on the beach in Acapulco, each of these engrossing and impossible-to-put-down novels of suspense builds to a riveting climax. Expect some romantic suspense along the way.Carmen Amato's 30-year career as a CIA intelligence officer with counterdrug experience inspires authentic thrillers loaded with action, deception and intrigue. Her personal experiences make for plot twists you’ll never see coming.Also sold separately, the three novels in the SHE DIDN’T RUN box set enjoy a combined total of over 1300 reviews with an average rating of 4.5 out of 5. BOOK 1: AWAKENING MACBETHIn the wake of her father’s unexplained death, university professor and accomplished author Brodie Macbeth is having terrible nightmares. As she tries to move on with her life, romance comes in the form of an Iraq War veteran. Too late, Brodie realizes that her nightmares are a game she doesn’t know how to play. The prize is her new lover’s soul.“Both Brodie and Joe are relatable characters; indeed, he’s so perfectly flawed that many readers will fall in love with him, too . . . Suspenseful, page-turning paranormal romance.” – Kirkus ReviewsBOOK 2: THE HIDDEN LIGHT OF MEXICO CITYWorking as a domestic for a wealthy Mexico City family, Luz de Maria Alba falls for the wrong man. From the opposite end of the social spectrum, Eduardo Cortez is an attorney investigating links between Mexico’s powerful Minister of Public Security and a notorious drug cartel. When the cartel goes after Luz to get to Eduardo, it’s a riveting ride through the darkness of Mexico’s drug war, where violence buys loyalty, votes are for sale, and the odds are against survival.“Dramatic tale of politics and corruption . . . a poignant love story between the unlikeliest of individuals, all of which is woven seamlessly into an enthralling political drama.” – Literary Fiction ReviewLonglisted, 2020 Millennium Book AwardBOOK 3: CLIFF A Detective Emilia Cruz NovelAcapulco’s first female police detective, Emilia Cruz dives into an ocean of secrets, lies, and murder when she investigates her lieutenant’s death in the explosive start to the award-winning series. When the victim’s seamy off-duty life is exposed, the city’s mayor and the powerful head of the police union try to end the investigation. Yet is the killer one of Emilia’s fellow detectives? Feeling like one of Acapulco’s famous cliff divers falling toward the rocks below, she must choose between truth and survival.2019 & 2020 Poison Cup award, Outstanding Series – CrimeMasters of America\"A thrilling series\" -- National Public Radio“Consistently exciting” -- Kirkus ReviewsBONUS! ACAPULCO A Detective Emil",
  "genres": [],
  "author": "Carmen Amato",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/194945489-she-didn-t-run-thriller-box-set"
}