{
  "title": "Final Truth",
  "description": "In her thrill-packed trilogy Cold Truth, Hard Truth, and Dark Truth, Mariah Stewart proved beyond a shadow of a doubt that she can brilliantly and suspensefully handle the truth. Prepare yourself for the shocking, eye-opening Final Truth, in which a woman who specializes in exposing lies finds herself trapped in a real-life nightmare.All that stands between Lester Ray Barnes and the state of Florida's death chamber is a judge's signature. He is sentenced to die for the rape and murder of a young woman, his conviction hinging on two pieces of evidence: DNA testing and an eyewitness who placed him at the scene. But when the story breaks that the DNA testimony at trial had been fabricated and that the eyewitness was coerced by a cop, all hell breaks loose. In the absence of credible evidence to sustain the conviction, the court is forced to set Lester Ray free. It's the sort of circus the media adore—until it turns into the kind of Grimm's fairy tale the media love even more.Intrigued by the story of a young man railroaded by justice, true-crime writer Regan Landry is drawn into Lester Ray's camp like a moth to a flame. For Regan, writing is a way to stay connected to her late literary-legend father, and her knack for detective work makes her a natural when it comes to uncovering new leads in even the murkiest mysteries.Eager for the spotlight, Lester Ray willingly agrees to work with Regan on a tell-all about his experience as an innocent man on death row. But less than a week after leaving prison, he vanishes from the Sunshine State. Soon after, darkness descends on the outer banks of North Carolina as a string of women are raped and murdered in a frenzied spree. Fearing the worst, Regan, along with Special Agent Mitch Peyton and the FBI, sweeps in to confront the unspeakable: the horrifying possibility that they have helped to free a cunning monster with an insatiable appetite for death—and a ruthless determination never to be caged again.",
  "genres": [
    "Romantic Suspense",
    "Mystery",
    "Suspense",
    "Romance",
    "Thriller",
    "Fiction",
    "Audiobook"
  ],
  "author": "Mariah Stewart",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/194938.Final_Truth"
}