{
  "title": "The Art of Taking Second Chances",
  "description": "\"Amazing debut novel by a conscientious and smart writer.\" - Reader Review, Goodreads\"The characters were perfect, the story was perfect. Tara and Sameer are everything I needed.\" - Reader Review, Amazon\"Varsha navigates the complexities of love and desire hindered by timing, familial expectations & prejudices, with panache. This is a debut that will keep you thinking long and hard .\" - Riya Iyer, author of & Then They Met\nSteamy romance. High Drama. A lot of heart.\n“I wanted him, but we were not in the same league. Not by a long shot. The social differences between us were too real, too palpable.”Talented and headstrong, Tara has worked hard to become what she is today, a successful art appraiser and an aspiring artist. When her latest job brings her to Dallas, the last thing she expects is running into Sameer Rehani. He is the spoilt, rich, and irresistibly gorgeous man who broke her heart years ago in India. This time she is determined to keep her distance. But it’s getting increasingly difficult to deny the heat that arises within her every time she sees him. Desire is rebellious, after all.“A year before, if someone had joked that I’d be enamored with a simple, small-town girl who wore no makeup and whose English accent left much to be desired, I would’ve wagered my dad’s shiny new car.”A bona fide rake during his college days in Baroda, Sameer has now sobered up to head a successful financial firm in Dallas. He is one step away from achieving everything he’s wanted for over a decade, when in walks Tara Kadam, his first and only love. And she still has the power to make his heart skip a beat. Sameer has a lot to make up for but he knows he needs to put everything on the line for a second chance at happiness.This debut novel by Varsha Chitnis presents South Asian characters in a refreshing new light.",
  "genres": [
    "Romance"
  ],
  "author": "Varsha Chitnis",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/195077280-the-art-of-taking-second-chances"
}