{
  "title": "EUROPA: Engagement: (Book 3)",
  "description": "P. R. Garcia continues the Europian trilogy in the third book, Engagement. Knowing war is now inevitable, Enok goes on the defensive and prepares to engage and defeat this formidable enemy once and for all. But he knows the real key to the Oonocks' survival is Europa. While the Orbs continue to transform her, she endeavors to find a way to save her people and take them home before this new Terrian leader destroys them all. But before she can find a way to save them, she needs to return to the world above. She tours the complex meeting her people and learning how to exist underwater as a true Oonock while Enok, Jeanip and Kiijon search for a way to safely return to the air world above. Intrigued by the puzzle JeffRa left for him, Typhin, in his delusional state, smuggles the wooden statues and box back into the complex, convinced JeffRa left the puzzle for him as a prize for being his mentor. He is determined to find its solution, unaware it contains the destruction of the complex and a way to find the hiding place of Europa and Earon. Believing in JeffRa's plan, the new Terrian leader launches an armada of predator warships and sets sail for the island. Soon he receives confirmation of where the young monarchs are hidden and closes in, killing any sea creature in his path. As the armada draws closer Enok begins to doubt himself and wonders if he should step down and turn over the ruling of the Oonocks to Europa. He also realizes his daughter is going to have to make the ultimate sacrifice to ensure her people's existence, a sacrifice that will devastate her. He wonders how many more lives will be lost in the battle? And what price the human race will pay for his refusal to eliminate his brother when he should have on Europa? What will their casualties be as the two superior races engage each other? Friends will part, some will be left behind, some will go on, some will loose their life.",
  "genres": [],
  "author": "P.R. Garcia",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/19514704-europa"
}