{
  "title": "Billionaire Brothers: Box Set 1-3",
  "description": "Billionaire Brothers Series Box Set 1-3Fall in love with these smoking hot alpha billionaires and the curvy women who love them.At the Billionaire's PleasureCarrie, a shy insecure woman, considers herself plump and unattractive to men. When she is dumped by her boyfriend, Richard, it dents her already fragile confidence almost beyond repair. She longs to find a man who can dominate and take her at his whim.Enter David Ashcroft, her boss. He has had his eye on Carrie for quite some time. And what David Ashcroft wants, David Ashcroft gets. His authority and dominant attitude has Carrie begging for more. He opens her up to a world she never knew existed. A world where she is willing to do anything for the billionaire's pleasure.But when a business deal becomes unstable, everything begins to unravel. A woman from David's past threatens Carrie's trust in him. And a thwarted business rival makes his revenge personal and deadly. Will they be able to overcome all the odds and get to the bottom of a situation threatening to spin out of control? Or is their budding relationship destined to be destroyed through the obsession of others?If you held the one you love in your arms, would you do anything to keep them safe? Would you do anything for love?At the Billionaire's PromiseLife has never seemed more perfect for Carrie. She has David, the man of her dreams, the man who loves and adores her. And yet, she can't shake the feeling that all that might come crashing down around her ears at any moment.When word of her engagement to David Ashcroft, the most eligible bachelor in the country gets out, Carrie finds her life thrown into chaos by the media frenzy that ensues. But not everyone wants to see Carrie happy. Secrets and lies spill out into the public leaving Carrie more vulnerable than ever. And with her ex, Richard, snapping at her heels, David is the only man who can save her. But has his trust in her been completely destroyed?Sides must be chosen, and difficult decisions made. In the end, can love truly be enough to overcome the deadliest of opposition?Loving the BillionaireHeather Sampson is a woman on the run. Mentally and physically scarred after time spent at the mercy of Jude, a mad man, she ran from all of her problems. But tragic circumstances and a repeat of history has forced Heather to return to her old life. With her sister missing, Heather's one hope of saving her lies in the hands of the only man she has ever truly loved.Aaron Ashcroft is a billionaire tycoon. Handsome and deadly, he has long since given up all hope of getting back the woman he fell in love with two years before. That is, until the day she walks back into his life.Jude has plans for both her and Aaron. In a race for her life, will Heather trust Aaron? Or will her fear keep her from the man she loves and cost her everything?Billionaire Brothers Series Reading OrderAt the Billionaire's Pleasure Book 1At the Billionaire's Pleasure Christmas Stocking Book 1.5At the Billionaire's Promise Book 2Loving the Billionaire Book 3Loving the Billionaire Winter's Wedding Book 3.5At the Billionaire's Paradise Book 4Loving the Billionaire Picture Perfect Book 5At the Billionaire's Passion Book 6Loving the Billionaire Ever After Book 7",
  "genres": [
    "Erotic Romance",
    "Romance",
    "Erotica",
    "Contemporary Romance"
  ],
  "author": "M.G. Morgan",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/19508772-billionaire-brothers"
}