{
  "title": "Pictures of Nothing: Abstract Art Since Pollock",
  "description": "\"What is abstract art good for? What's the use--for us as individuals, or for any society--of pictures of nothing, of paintings and sculptures or prints or drawings that do not seem to show anything except themselves?\" In this invigorating account of abstract art since Jackson Pollock, eminent art historian Kirk Varnedoe, the former chief curator of painting and sculpture at the Museum of Modern Art, asks these and other questions as he frankly confronts the uncertainties we may have about the nonrepresentational art produced in the last five decades. He makes a compelling argument for its history and value, much as E. H. Gombrich tackled representation fifty years ago in \"Art and Illusion,\" another landmark A. W. Mellon Lectures volume. Realizing that these lectures might be his final work, Varnedoe conceived of them as a statement of his faith in modern art and as the culminating example of his lucidly pragmatic and philosophical approach to art history. He delivered the lectures, edited and reproduced here with their illustrations, to overflowing crowds at the National Gallery of Art in Washington in the spring of 2003, just months before his death. With brilliance, passion, and humor, Varnedoe addresses the skeptical attitudes and misunderstandings that we often bring to our experience of abstract art. Resisting grand generalizations, he makes a deliberate and scholarly case for abstraction--showing us that more than just pure looking is necessary to understand the self-made symbolic language of abstract art. Proceeding decade by decade, he brings alive the history and biography that inform the art while also challenging the received wisdom about distinctions between abstraction and representation, modernism and postmodernism, and minimalism and pop. The result is a fascinating and ultimately moving tour through a half century of abstract art, concluding with an unforgettable description of one of Varnedoe's favorite works.",
  "genres": [
    "Art",
    "Art History",
    "Nonfiction",
    "History",
    "Reference",
    "Essays",
    "Cultural"
  ],
  "author": "Kirk Varnedoe",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/195089.Pictures_of_Nothing"
}