{
  "title": "The Worship of Walker Judson",
  "description": "This is an award winning tale about a powerful healer-gone-bad, and the young woman who surrenders her life to him!Young Walker Judson has a grand secret. He sees light that emanates from, and surrounds other folks. Soul shadows, the boy terms them. Years later, as director of The Living Light Healing Center, he meets the hunchback, Lauren Finch, and straightens her spine. She's then seduced by his charisma, becomes his devout assistant, and ultimately transforms into a powerful healer in her own right. When all goes awry, even as Lauren's faith is challenged, even as others abandon Walker, she remains steadfast. But how far is she willing to go to prove her devotion, and what will it take for her to peel off the blinders and trust her own strengths?And so, is Walker Judson truly a healer-gone-bad or a saintly soul whose paranormal talents are misunderstood? Ultimately, you, the reader must decide. Today's news is rife with stories of physical and emotional abuse on the part of Catholic priests and Buddhist monks, as well as school teachers and sports coaches. Furthermore, cults such as the People's Temple, at the behest of their leader, Jim Jones, require followers to commit mass suicide. Along another vein, politicians, athletes, and entertainers, Bill Clinton, Anthony Weiner, Tiger Woods, and Michael Jackson, to name a few, violate the trust of family and supporters, destroying lives in the process. So why are tales of manipulation and abuse rampant among the powerful? Then again, why are followers so easily swayed that they cast aside common sense and discernment? The Worship of Walker Judson explores the misuse of power and the ease with which seekers relinquish it. Psychic phenomena, cultism, mystics and madmen, the retelling of the Christ story in the context of the persecuted healer, along with the role of personal choice versus karmic destiny are additional issues examined in this novel.",
  "genres": [
    "Suspense"
  ],
  "author": "Janice Strubbe Wittenberg",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/19505853-the-worship-of-walker-judson"
}