{
  "title": "The Hollow Dolls",
  "description": "Men are immediately hooked on the sexual intensity of disordered dark child Melanie Willow and Mel herself. Two together, unable to love, they share a borderline personality in a single 19-year-old body. Melanie teeter-totters with Winnie, her bestie with benefits in a drugged delusional week of self-harm. A rape. And finally, suicide attempts. In a bid to save themselves the girls begin to write a memoir together just as they embark on a special journey... It is to the Man-Rabbit’s island in a shared psychosis (Folie à Deux) where they are sent on a mission of revenge: Eliminate predators of young girls. The Man-Rabbit also demands that in order to succeed they must learn to love. Melanie and Winnie know that their love is only a game; a borrowed phantom melancholy complete with Winnie’s crocodile tears, and Melanie’s dominant affectations of her dark princess. Unable to love or feel, they are Hollow Dolls. And so the struggle begins; a journey from their child-like masquerade of love to a new world of real love. The girls end up in the notorious Downtown Eastside of Vancouver, Canada where Melanie is searching for her birth father. Melanie needs desperately to find out what happened in her youth, but at the same time everything is catching up—the police, the demands of her mission with the Man-Rabbit, and her fracturing psyche. Real love tempts The Hollow Dolls, mind and body. They refuse to believe anything short of absolute, and so they test love. Through the looking glass, Melanie and Winnie dance on psychic tenterhooks in a realm filled with passion. Their mission of murder and vengeance mingles with their unquenchable desire as they explore domination and submission together and with others. An ancestral aching for blood sport grows in Winnie, awakening her true self. Melanie watches her dark blood princess and the gateway to real love opens ever so slowly. And as though one needed to delve into flesh itself to dissect and prove love, Melanie and Winnie find themselves in the Blood Sister Parlor Plains, where Love holds court and the greatest wishes of human kind are granted.",
  "genres": [
    "Mental Illness",
    "Realistic Fiction",
    "Mental Health",
    "Psychology",
    "Fiction",
    "Contemporary",
    "Dark"
  ],
  "author": "Marilyn Talia Dahl",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/19507910-the-hollow-dolls"
}