{
  "title": "Ditching the Dream",
  "description": "Elizabeth Fairchild thought she had everything she ever wanted. A successful husband. Three amazing children. A beautiful home in Napa, California. However, several months after their youngest child heads off to college, Elizabeth, who has been a stay-at-home mother for the past twenty-some years, realizes that she’s not sure who she is or what her passions are. Her husband is more married to his job than ever before. And Elizabeth doesn’t know what she wants to do. But she knows that she needs some space to figure it all out. Some distance from her seemingly perfect life.One impulsive flight later, clear across the country, Elizabeth finds herself in New York City. If she can make it there, she can make it anywhere!At first, her husband was livid. Who will cook him dinner? How is laundry going to get done? Is she having an affair? He decides to give Elizabeth a hall-pass, which only serves to further enrage her. How could he think such a thing after being married for over twenty years?But then she meets Jack Stevens. Sinfully gorgeous. Confident. Successful. And his eye on Elizabeth. There’s also something familiar about him.And then... Kevin Parker. Ruggedly handsome. Witty. A teacher. He makes her feel as young as he is.Both men show Elizabeth different sides of herself. Each gives her a new perspective.Enthralled and enlightened by her sanctioned affairs, she feared her entanglements could be less than temporary…Will the new Elizabeth embrace her scorching future, or will playing with fire leave her heart burned?Ditching the Dream is the first book in the steamy Dream Series of romantic page-turners. If you like sizzling chemistry, complex heroes, and endings that leave you craving more, then you’ll love Isabelle Peterson’s passionate page-turner. And you can keep turning the pages as Ditching the Dream is Book 1 in a 6 Book series.",
  "genres": [
    "Romance",
    "BDSM",
    "Erotica",
    "Menage",
    "Erotic Romance",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Isabelle Peterson",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/19515047-ditching-the-dream"
}