{
  "title": "Happy Medium",
  "description": "A clever con woman must convince a skeptical, sexy farmer of his property’s resident real-life ghost if she’s to save them all from a fate worse than death, in this delightful new novel from the author of Mrs. Nash’s Ashes.Fake spirit medium Gretchen Acorn is happy to help when her best (read: wealthiest) client hires her to investigate the unexplained phenomena preventing the sale of her bridge partner’s struggling goat farm. Gretchen may be a fraud, but she’d like to think she’s a beneficent one. So if “cleansing” the property will help a nice old man finally retire and put some much-needed cash in her pockets at the same time, who’s she to say no?Of course, it turns out said bridge partner isn’t the kindly AARP member Gretchen imagined—Charlie Waybill is young, hot as hell, and extremely unconvinced that Gretchen can communicate with the dead. (Which, fair.) Except, to her surprise, Gretchen finds herself face-to-face with Everett: the very real, very chatty ghost that’s been wreaking havoc during every open house. And he wants her to help ensure Charlie avoids the same family curse that’s had Everett haunting Gilded Creek since the 1920s.Now, Gretchen has one month to convince Charlie he can’t sell the property. Unfortunately, hard work and honesty seem to be the way to win over the stubborn farmer—not exactly Gretchen’s strengths. But trust isn’t the only thing growing between them, and the risk of losing Charlie to the spirit realm looms over Gretchen almost as annoyingly as Everett himself. To save the goat farm, its friendly phantom, and the man she’s beginning to love, Gretchen will need to pull off the greatest con of her life: being fully, genuinely herself.",
  "genres": [
    "Romance",
    "Paranormal",
    "Contemporary",
    "Fantasy",
    "Audiobook",
    "Fiction",
    "Contemporary Romance"
  ],
  "author": "Sarah   Adler",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/195273403-happy-medium"
}