{
  "title": "A Shooting Star Meets the Well of Death, Why and How Richard Halliburton Conquered the World",
  "description": "AMAZING STUNTS, IMPROBABLE ADVENTURES, BEST-SELLING AUTHOR-RICHARD HALLIBURTON WAS ALL OF THESE AND SO MUCH MORE AS THIS CAREFULLY RESEARCHED, EXCITING BIOGRAPHY SHOWS. ..\".entertaining and very well-researched...This book should be high on any traveler's reading list.\"-Ian Usher (traveler, writer, adventurer, speaker - author of Life Sold). ..\".an interesting and sometimes funny book about a man who should have a book next to Lindbergh and Earhart.\"-Henry H. Holden, author of \"Great Women in Aviation #2 - Florence Lowe \"Pancho\" Barnes. PRINCETON GRADUATE HALLIBURTON VAULTED ONTO THE BEST SELLER LIST WITH HIS FIRST TRAVEL/ADVENTURE BOOK AND NEVER LOOKED BACK. HE BLASTED OUT SIX MORE OF THE SAME DESPITE INNER CONFLICTS AND BATTLES WITH CRITICS THEN VANISHED IN WAGNERIAN SPLENDOR WHILE SAILING A GAUDY CHINESE JUNK INTO A 1939 PACIFIC TYPHOON. ..\".Was Halliburton a daring adventurer...or...a dilettante who...staged spectacular stunts?...Both...are true...and this is the fascination of his paradoxical personality.\"--Jerry Camarillo Dunn, Jr., longtime writer for the National Geographic Society, author of My Favorite Place on Earth. ..\".we hope many readers will share our memories of this unique man and his adventures, and welcome this fine work into your libraries.\"-Robert J. Gormley, former publisher Northeastern University Press, Orbis Books and Chatham House Publishers; Beatrice Gormley, author of YA biographies including the forthcoming Nelson Mandela, Simon & Schuster, 2014). \"Taylor...revives the memory of this dashing debonair of derring-do. A welcome addition to the libraries of all aficionados of adventure literature. Bravo.\"-Scott Wallace, author of The Unconquered: In Search of the Amazon's Last Uncontacted Tribes",
  "genres": [],
  "author": "William R.     Taylor",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/19520910-a-shooting-star-meets-the-well-of-death-why-and-how-richard-halliburton"
}