{
  "title": "President Ted Cruz: The 2016 Election and America's Future",
  "description": "Ted Cruz, a freshman Republican Senator from Texas, acquired a 2016 candidate status which is disproportional to his congressional experience; his actions have become more closely scrutinized than any other possible contender. Why such attention to a man who is, without the slightest question, a natural born Canadian, and therefore might not be eligible to hold office?The basis for a good con is to tell the mark exactly what is going to befall them, and then credit someone else with being the cause and allow the mark to do the work.Having done that, you then tell them you are going to deliver exactly what they want, or desire to have. If you do it correctly, they will not examine what you are actually doing. Of course this is not new, following Hebrew tradition, rules are given at least twice, and so it is with Matthew 7 & 12. We know people, not by their words, but by their deeds; in the same way that we know a tree by its fruit. If the tree is good, then the fruit will be also; you don't get good fruit from thorn-bushes, or figs from thistles?In the Pirates movie, Johnny Depp had a great line, one which sums up the basis of any good political conspiracy, or Con; it is the essence of the idea popularized in the 1939 WC Fields movie, \"You Can't Cheat an Honest Man.\" Every good prosecutor knows that you can sway a jury by telling them the truth and allow them to distort it. It is the rule which governs a 'lawyer's lie' \"You lied to me, you told me the truth.\"Both the 2014, and 2016, elections will be determined by those who accept bad fruit, and denounce demonstrative truth to be a lie.To be President, you need to fight the winnableTo be President, if you wish to wage war, need to wage wars which can be won.From the first December, up to and including that date of publication of this book, \" The Affordable Care Act\" (known as Obamacare) was successfully enrolling 100,000 applications a day - some with reported monthly premiums lower than the cost of a single gallon of gasoline.This book is the first to truly examine the possibility of a Ted Cruz becoming President, and what it would take for the Tea Party to become a continuing force in American politics.",
  "genres": [],
  "author": "William Lawrence Lipton",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/19515188-president-ted-cruz"
}