{
  "title": "Unravel Me",
  "description": "Golden boy. Notorious serial dater. The NHL’s most eligible bachelor. That’s what the headlines say about me, at least. I wish I could say they’re not accurate, but truthfully? I don’t even know who I am anymore. Between a soul-crushing ex-girlfriend and a never-ending queue of dates gone wrong, one thing has become glaringly I don’t want to be Adam Lockwood.So when my dog decides to play matchmaker, taking down a sweet little thing with rose gold waves, brilliant green eyes, and a smile for days, I can’t believe my luck that she doesn’t have a clue who I am. I know I should tell her, but for once in my life someone sees the man behind the goalie mask. Rosie gives me all of her–her heartache, her laughter, and her son. But me? I’m holding on a little too tightly to the pieces I’m scared to give up, the pieces she might not like. One small lie becomes a secret hanging above my head, but what if there’s another one hiding right around the corner? Suddenly, my deepest desire becomes my biggest fear. I’m terrified she’s going to unravel me.Unravel Me is book #3 in the Playing For Keeps series, a series of interconnected standalone mature hockey romance stories that contain relatable characters, lots of heat, swoon, laughs, and a ride on an emotional rollercoaster!Unravel Me contains emotional references to the past death of parents and its surrounding grief, as well as brief discussions of foster care, depictions of child neglect (not by the main character), and the death of an animal (minimal descriptions and as it pertains to the FMC’s training as a veterinarian student; not main character’s pet). If you are sensitive to these subjects, please use this information to make an informed decision about whether to proceed with this story.",
  "genres": [
    "Romance",
    "Sports Romance",
    "Hockey",
    "Sports",
    "Found Family",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Becka Mack",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/195227305-unravel-me"
}