{
  "title": "Beastly Beauty",
  "description": "From New York Times bestselling, award-winning author Jennifer Donnelly comes a revolutionary, gender-swapped retelling of Beauty and the Beast that will forever change how you think about beauty, power, and what it really means to follow your heart. What makes a girl \"beastly?\" Is it having too much ambition? Being too proud? Taking up too much space? Or is it just wanting something, anything , too badly? That's the problem Arabella faces when she makes her debut in society. Her parents want her to be sweet and compliant so she can marry well, but try as she might, Arabella can't extinguish the fire burning inside her -- the source of her deepest wishes, her wildest dreams. When an attempt to suppress her emotions tragically backfires, a mysterious figure punishes Arabella with a curse, dooming her and everyone she cares about, trapping them in the castle. As the years pass, Arabella abandons hope. The curse is her fault -- after all, there's nothing more \"beastly\" than a girl who expresses her anger -- and the only way to break it is to find a boy who loves her for her true a cruel task for a girl who's been told she's impossible to love. When a handsome thief named Beau makes his way into the castle, the captive servants are thrilled, convinced he is the one to break the curse. But Beau -- spooked by the castle's strange and forbidding ladies-in-waiting, and by the malevolent presence that stalks its corridors at night -- only wants to escape. He learned long ago that love is only an illusion. If Beau and Arabella have any hope of breaking the curse, they must learn to trust their wounded hearts, and realize that the cruelest prisons of all are the ones we build for ourselves.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Retellings",
    "Romance",
    "Fairy Tales",
    "Audiobook",
    "Fiction"
  ],
  "author": "Jennifer Donnelly",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/195263575-beastly-beauty"
}