{
  "title": "Naughty or Nice",
  "description": "All proceeds of this book benefit Kids Need to Read.A mix of magical, spooky, and romantic tales for the holidays.The Santa Call, by J.R. Rain - Santa calls a radio talk show seeking advice on matters of the heart.Disco Angels, by Danielle Younge-Ullman - It's the holidays, and whether Sarah is ready or not, she and her family are in for a wild, dysfunctional and possibly magical evening. One Stormy Christmas, by Toni LoTempio - Autumn finds getting a Christmas present for her vamp boyfriend ins't as easy as she thinks - not when Bad Santa's involved!Fortune Cat’s Visit, by Heather Massey - Lynn Chong is alone on the eve of Chinese New Year taking care of the dusty San Francisco Chinatown shop she inherited after her parents’ death when a handsome stranger, Jian Yuen, enters the shop. Jian is there to claim a mysterious alien artifact in Lynn’s possession and price is no object. Lynn isn't sure she wants to surrender one of the last ties to her parents, but her attraction to Jian, that she suspects is mutual, may be too tempting to resist.Real Elves, by Helen Smith - As she emerges from visiting Santa in a department store in London, Sophie’s grandfather reports her missing… but the little girl’s right there. Is she a ghost, a twin, an alien abductee—or is there some simpler explanation? Amateur sleuth Emily Castles has fifteen minutes to figure out the puzzle before the police are called and Christmas is ruined.Carol, by J.W. Becton - By day, Calla Hawthorne works as a forensic psychologist, but on the side, she uses her abilities to identify revenants, risen souls who have returned to earth. This year, Calla’s holiday plans are cut short when she must save a child from a murderer and convince Matt Carol, the murder victim, to take that final step into eternity.Krampus Klaus, by Christiana Miller - When Gina and Bobby wake up at midnight on Christmas Eve, they catch Santa in the middle of his present deliveries -- but he's unlike any Santa they've ever heard of. He's short-tempered, rude and wouldn't know jolly if it ran him over with a sleigh. Turns out that Santa has been cursed. Gina and Bobby have to figure out a way to save him before Santa turns into the demonic Krampus, (Hell's official Punisher and Tormentor of Naughty Children), forever.Dark Christmas, by Liz Schulte - Ella Reynolds loves Christmas, but not parties. However, at the prompting of her boyfriend she reluctantly agrees to host a Christmas party at her house. But when an unexpected guest arrives, the party is over. A man dressed as Santa Claus is found dead at her front door. Who killed Santa and what does he want with her?Santa Stole My Ghoulfriend, by Rose Pressey - Psychic investigator Larue Donavan is usually dedicated to helping lost spirits find peace. But this time, she's tasked with helping a lost woman find her Christmas spirit.The Perfect Gift, by Barbra Annino - A young wife struggling with fertility receives a unique gift from her husband that wreaks havoc on her home and her sanity.",
  "genres": [],
  "author": "J.R. Rain",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/19523854-naughty-or-nice"
}