{
  "title": "Midsummer",
  "description": "All her life, Joy's been haunted by a man she's never met -- her visionary grandfather, the artist Lorenzo. At work on digging a New York subway tunnel, his pickaxe struck the remains of an ancient Dutch trading ship -- and a vision lit up the underground, convincing him that he was blessed. As it turned out, his children did well in life, and almost a century later, his granddaughter Joy, a gifted linguist, married the Canadian descendant of the lost ship's captain. Yet nonno's story also led to the death of Joy's cousin Leonora, her Aunt Elena's only child. It was a tragedy that might have been prevented by Joy's father, Eddie, a man who's been bruised by life and who seldom speaks to his sister. Yet in the year 2000, he has no choice. Wealthy Aunt Elena and Uncle Carlo are coming from Rome to New York City to celebrate their fiftieth wedding anniversary. They've invited the family to dine at the sky-high tower restaurant above the tunnel where nonno Lorenzo saw his vision long ago. On the first day of summer, Elena and Eddie will face each other at last. Midsummer is a story of family ties and fortune, and of Minding peace as life nears its close, high above the historic place where nonno's story began.“Carole Giangrande's Midsummer sets sail in search of distant turning points. She holds the heart of her story gently, and she steers us gracefully through time, and memory. The elegance of her language casts long shadows. She moves us as she writes from the center of longing and wonder.”- Karen Lee Lewis, author of What I Would Not Unravel\"Midsummer is emotionally focused and charged with the power of archetype, its undercurrent of passion perfectly controlled. Carole Giangrande has mastered the novella form.\" - Eva Tihanyi, author of Flying Underwater: Poems New and Selected",
  "genres": [],
  "author": "Carole Giangrande",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/19536993-midsummer"
}