{
  "title": "First Time",
  "description": "My first tenant, and first time. Excerpt:There was something about Doug and a couple of his friends that kept making my senses tingle and the hair on my arms stand at attention, when we would brush against each other. I had never had a sexual encounter with a man, and learned later in life that it was what some people call their \"gay-dare\". After helping Doug finish setting up the house and unpacking as many of the boxes as they could, his friends slowly left and went back to their lives. I stayed along with his friend CJ, and we ordered a pizza and had some beer to celebrate the successful day of moving. Around 10pm or so, I welcomed Doug to the neighborhood, and called it a night. I went back over to my half of the house, and took a shower to get ready for bed.I was in my room, watching TV when I heard a thumping through the wall. I was a little pissed that Doug was hammering things into the walls at 11pm, but I gave him the benefit of the doubt, considering it was his first day in a new home, and the garages were between us. He probably didn't think I would hear the thumping of the hammer, but I did.I fell asleep watching TV, and woke up in the middle of the night, needing to piss like a race horse. Guess I shouldn't have had so many beers, I thought to myself, as I relieved the pressure on my bladder. As I stood there taking a piss I heard the thumping on the walls again, and looked at my watch, and saw it was almost 3am. The thumping noise would stop for short periods of time, then start in again for a minute or so, then stop and start again. I was getting madder by the minute as it would start again, and decided I better go over and tell him to call it a night, before the neighbors called the cops.I slipped on a pair of cut-off sweats, and headed out the back door. I was intent on letting him know he woke me up, so I didn't bother to put on any shoes, or a shirt. As I walked through the grass, I heard the thumping noise again, and it was coming from the wall by the garage. He was doing something in his bedroom, and I decided to just walk up to the open window and holler in. There weren't any curtains up yet, so when I reached the window I about passed out from the scene that lay before me.I was standing off to the side of the bed, outside the window and looking in to see CJ on his back on that massive bed, with his legs in the air, and Doug was sliding his enormous cock deep into his buddy's tight ass. His hands were gripping CJ's legs behind the knees and basically folding him in half, so CJ could suck the tip of his own lengthy cock. The thumping I was hearing was the head board bouncing against the wall, each time Doug would slam his huge cock deep into his buddy's bowels.I stood there in amazement at the sexual act happening before me. I didn't even realize it, but my cock had snaked down the pant leg of my shorts and had popped out into the cool night air, as a gentle breeze blew over my sensitive knob. My hand instinctively reached down and began stroking my steel hard pole, before I even realized what was going on. Watching these two guys going at it like gang-busters was the most erotic thing I had ever seen, and it only took me about 8 strokes of my pulsing rod to blow a load all over the side of the house.Just as I got my thoughts straight and my mind back on the situation, I heard CJ moaning like a whore in heat, as Doug rammed his cock deep into his buddy's ass, and bellowed like a lion mounting its mate. My eyes widened as I watched CJ's cock twitch and cum flooded his mouth and ran out the corners as he sucked on his own cock head, and I could see a white fluid seeping out around Doug's cock as he pressed his balls tight against CJ's buns.",
  "genres": [],
  "author": "Kate Vaunn",
  "average_rating": "3.17",
  "url": "https://www.goodreads.com/book/show/19539400-first-time"
}