{
  "title": "The Spectral Link",
  "description": "Often at the conclusion of an author interview, a question is posed, one that allows the subject to announce or promote forthcoming projects and publications. In the case of Thomas Ligotti, the response has invariably been to the effect that he never has any idea what he is going to produce in the future, if anything. Since he began publishing in the early 1980s, this answer has perhaps seemed somewhat disingenuous. Some may have thought that it was an affectation or diversionary tactic. After all, books under his name have since appeared on a somewhat regular, if not exactly prolific, schedule. But as the years went by, it became more and more apparent that Ligotti's output was at best haphazard. A chapbook here, a slim or full-fledged story collection there, a book of poetry or unclassifiable prose out of nowhere, and then at some point a quasi-academic statement of his philosophical ideas and attitudes. Such a scattered crop of writings is not unheard-of, but for one who toils in the genre of horror, whose practitioners are commonly hard at work on a daily basis, it does seem as paltry as it is directionless.Accordingly, the present volume is another unexpected contribution to Ligotti s desultory offerings. And no one could be as surprised by its appearance as he was. As anyone knows who has followed his interviews and obsessions as they appear in his fiction, Ligotti must take his literary cues from a lifetime of, let us say, whimsical pathologies. Other authors may suffer writer's block. In the present case, the reason may be dubbed 'existence block,' one that persisted for some ten years. This is less than an ideal development for anyone, but for a word-monger it can spell the end. And yet the end did not arrive. During 2012, it seemed that it might in the form of a sudden collapse and subsequent hospitalization prefigured--one might speculate--by the abdominal crisis suffered by the character Grossvogel in Ligotti's story 'The Shadow, The Darkness.' Yet like the agony endured by the aforementioned figure, the one in question led only to a revitalization of creativity. This revitalization may not be exactly spectacular, but all the same here it is.Throughout Ligotti's 'career' as a horror writer, many of his stories have evolved from physical or emotional crises. And so it was with the surgical trauma that led to the stories in The Spectral Link, an event that is marginally mentioned in the first of these stories, 'Metaphysica Morum.' In the second story, 'The Small People,' Ligotti returns, although not precisely in the usual fashion, to his fixation with uncanny representations of the so-called human being. Having nearly ceased to exist as he lay on the surgeon s table, the imposing strangeness of the nature and vicissitudes of this life form once again arose in his imagination. So what project and publications are forthcoming from Thomas Ligotti? As ever, not even he knows.",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Weird Fiction",
    "The United States Of America",
    "American",
    "Lovecraftian"
  ],
  "author": "Thomas Ligotti",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/19535869-the-spectral-link"
}