{
  "title": "Twelve Steps",
  "description": "\"With her debut novel, Veronica Bartles creates a fun, fast-paced story about a feisty heroine whose plan to steal her oh-so-perfect sister's spotlight leads to a messy love triangle ... no, love pentagon. TWELVE STEPS will have you cheering when Cinderella finds her backbone, Prince Charming learns that not every stepsister wants his glass slipper, and the heroine realizes she's been shining in her own light all along.\" Laura Bowers, Author of BEAUTY SHOP FOR RENT and JUST FLIRT\"Smart and funny, Twelve Steps perfectly captures the gut-wrenching joy and supreme mortification of unrequited love. Authentic and *oh so* relatable, Bartles hits it out of the park with her debut! For anyone who's ever felt second best, or struggled to find their place in the world, this book is for you! Grab the chocolate, turn off the phone, and prepare to ride the roller coaster of Andi's life as it unfolds, page after humor filled page. This is contemporary romance done right!\" -- Rachel Harris, Author of MY SUPER SWEET SIXTEENTH CENTURY and A TALE OF TWO CENTURIESSixteen-year-old Andi is tired of being a second-class sibling to perfect sister Laina. The only thing Andi's sure she has going for her is her awesome hair. And even that is eclipsed by Laina's perfect everything else.When Andi's crush asks her to fix him up with Laina, Andi decides enough is enough, and devises a twelve-step program to wrangle the spotlight away from Laina and get the guy.Step 1: Admit she's powerless to change her perfect sister, and accept that her life really, really sucks.Step 4: Make a list of her good qualities. She MUST have more than just great hair, right?Step 7: Demand attention for more than just the way she screws things up.When a stolen kiss from her crush ends in disaster, Andi realizes that her twelve-step program isn't working. Her prince isn't as charming as she'd hoped, and the spotlight she's been trying to steal isn't the one she wants.As Laina's flawless façade begins to crumble, the sisters work together to find a spotlight big enough for both to shine.",
  "genres": [
    "Young Adult",
    "Romance",
    "Contemporary",
    "Realistic Fiction",
    "Young Adult Romance"
  ],
  "author": "Veronica Bartles",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/19539299-twelve-steps"
}