{
  "title": "Kingdom's Hope",
  "description": "A Riveting Medieval Parallel to the BibleGood and evil clash. Leinad and Cedric are determined to not only survive, but claim hope and victory! In Kingdom’s Dawn , Leinad and Tess, along with all the king’s people, must escape slavery by the powerful Lord Fairos. Kingdom’s Hope finds them free and arriving in the Chessington Valley . But when they forget the king, will Kergon and the Kessons capture them for good? After many years, Kingdom’s Edge finds Cedric living a hopeless life until a stranger appears with powerful words of a new kingdom and a grand army. Finally, Kingdom’s Reign marches you through the danger of earth’s last days as the evil dark knight threatens to defeat the prince once and for all. Swords, knights, and battles define these captivating tales that parallel biblical events from Genesis to Revelation!Fierce castle lords hold the kingdom hostage.But a champion is coming…Fairos thought he had sentenced Leinad to death in the Banteen desert. But he was wrong. Leinad survived. Now, trained by the King himself, Leinad returns—a true Knight of the King. His skill with the sword is unmatched this side of the Great Sea ; his resolve is unshakeable. He is determined to fulfill the mission given him by the King and to free the people from their bondage to Lord Fairos.Leinad’s quest takes him from the chains of slavery, near the jaws of dragons, and close to the arms of love. And when the rest of the kingdom turns away from the King and the Code, Leinad turns to his most faithful ally, Tess. With her help, Leinad struggles to conquer his own doubt. But he must do so soon, for the King’s archenemy, the Dark Knight, is about to unleash his entire evil force, and only Leinad can stop them…Journey to Arrethtrae, where the King and His Son implement a bold plan to save their kingdom; where courage, faith, and loyalty stand tall in the face of opposition; where good will not bow to evil; where the future of the kingdom is at the threshold of either victory or defeat—and one man holds the key.DISCUSSION QUESTIONS INCLUDEDStory Behind the Book“When my six kids’ eyes glossed over during a reading from the Bible, I paused to explain the significance of redemption to a sin-sick soul. I was rewarded with patronizing elephant nods and more blank stares. Shortly thereafter, I awoke in the middle of the night with a medieval story enveloping my mind. I wrote it down and later read it to my children. Their waning attention transformed into complete anticipation. I was amazed and disappointed. Why did it take a fictional story, not a Bible passage, to get that response? Then I realized—that is how Jesus taught! Parables are powerful! I penned the Kingdom series to help young people get excited about the supremely significant story of Jesus Christ and His mission to save mankind.”—Chuck Black",
  "genres": [
    "Fantasy",
    "Christian",
    "Christian Fiction",
    "Fiction",
    "Young Adult",
    "Middle Grade",
    "Medieval"
  ],
  "author": "Chuck Black",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/1953965.Kingdom_s_Hope"
}