{
  "title": "Flight of a Valentine",
  "description": "We all have cracks in our foundation, Right? That question has never rang more true than it does to Angela Valentine right now.  \"Flight of a Valentine\" is the story of Angela Valentine, a girl with a newly broken heart and even worse a shattered spirit, who always finds herself on the outside looking in when it concerns family realizing now that it also includes love.   Angela would have never thought the one person she decides to let into her life and fall in love with would rattle her to her core when things didn't work out. Bringing back all the old ugly memories of her childhood, unwanted, never quite important enough. Angela thought that the years and all the hours of sitting in her shrink's office had helped her to move on from the past. She has never been more wrong about anything.  Being born with a case of fight or flight. Fight after fight with herself, done with questioning herself. Angela feels she has run out of options and decides to flee to her home state of Virginia, the one place she doesn't want to go, the place she fled from at the young age of eighteen. Now at thirty-three, it's the only place she knows she needs to go to find the answers. In the hopes of realizing that the life she has built for herself in Atlanta is exactly what she wants and needs. Now if she can come to terms with herself and her past, maybe she can stop fleeing from situations that she can't control and maybe just maybe finally fix the crack in her foundation of self.  Family drama, a hot younger man, trust worthy friends, family issues that most people can relate too. You can't leave out the personal growth and realization we all experience at some point in out lives, usually when things have fallen off track and we lose control of the situation that stems from one bad decision after another. Sometimes we need to realize that it's okay to be who, what and how we are and love ourselves for that. This is not a story of love, this is a story of falling apart and gluing yourself back together.  I think of this book as \"Chick-lit with Edge\". Anyone who likes a mainstream entertaining drama along with a few detailed provocative sex scenes will enjoy this book. The protagonist \"Angela\" has a strong voice, spirit and has always been her own hero.",
  "genres": [
    "Chick Lit"
  ],
  "author": "Angela Bradley",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/19540683-flight-of-a-valentine"
}