{
  "title": "Six Months of September",
  "description": "\"The second story on the ten o’clock news on Student missing, police inquiring. The interview with the professor was followed by a quick hit with a grumpy detective in a wrinkled suit tossing out the inevitable quote that the first forty-eight hours are the most vital in a case. He didn’t mention the fact that twice that time had passed.\" One woman’s disappearance unlocks dark secrets in Mark Allen’s brisk new detective novel, Six Months of September. As the suspects pile up, it falls on one unemployed reporter to figure out what the police cannot. Duncan Walsh has recently been fired from his job at Channel 8 news after an intense altercation with a local news icon. While contemplating his next move, he spends his days at the Chicago Museum of Natural History where he quickly befriends a beautiful tour guide named Agnes. A local university student, Agnes reveals that she is soon heading off on a paleontology dig. But when Agnes never shows up for the assignment, her disappearance becomes headline news. Unable to sit back while Agnes’s life may be in danger, Duncan launches his own investigation with the assistance of his best friend. Along the way, another volunteer joins up, the last person Duncan ever wants to James, Agnes’s boyfriend. The ragtag group of amateur detectives struggles to gain leads, a task made all the harder by James’s father, the Chicago Police Commander who may just hold a secret of his own. The danger heats up and more secrets are revealed as their investigation brings them closer to the university where Agnes studied. When one of them is attacked by an unknown assailant, Duncan begins to suspect that they may have gotten themselves in over their heads. Readers will find Six Months of September a compulsively readable page turner, right down to the right down to the shocking final confrontation.",
  "genres": [],
  "author": "Mark        Allen",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/19534712-six-months-of-september"
}