{
  "title": "Fog City Strangler",
  "description": "As 1958 nears an end San Francisco is being terrorized by a man who calls himself the “Fog City Strangler,” who preys on pretty young blonde women. The strangler announces each murder by sending a note and piece of the victim’s clothing to the local newspapers.Angst mounts as the strangler continues to claim more victims. Private eye SamSlater is worried that the Fog City Strangler may be eying his beautiful blonde wife, TWA stewardess Amelia Ryan. His anxiety is further fueled when TWA launches an advertising campaign with Amelia’s picture on a series of billboards plastered all over the city. Sam fears the billboards may attract too much attention--the wrong kind of attention.Meanwhile, Sam and Amelia are hired to try to find the missing daughter of awealthy dowager who fears she has lost her only child. The missing woman went for a walk with her dog on Stinson Beach, near San Francisco, and seemingly vanished into thin air. The woman’s husband arrived at their beach house and found the dog running loose but there was no trace of his wife. The police are stumped in their investigation.As Sam and Amelia look into the disappearance of the woman on the beach theydiscover that nothing is as it seems at first glance. On a stormy night a shadowy figure sets fire to the beach house where the couple is staying--hoping to stop theirinvestigation.Greg Messel’s Fog City Strangler is a stand-alone thriller but is part of the SamSlater Mystery Series--Last of the Seals, Deadly Plunge and San Francisco Secrets.Greg Messel grew up in the San Francisco Bay Area and now lives inEdmonds, Washington on the Puget Sound with his wife, Carol. “Fog CityStrangler” is his seventh novel and is the fourth in a new series of SamSlater mystery novels. Greg has lived in Oregon, Washington, California,Wyoming and Utah and has always loved writing, including stints as areporter, columnist and news editor for a daily newspaper.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Suspense"
  ],
  "author": "Greg Messel",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/19541981-fog-city-strangler"
}