{
  "title": "Secrets of Seduction",
  "description": "Stunning sensuality and breathtaking romance mark this dazzling new Legendary Lovers tale from New York Times bestselling author Nicole Jordan, where an extraordinary beauty teaches a handsome, reclusive “beast” to love again. The most charming Wilde cousin, Lady Skye has secretly loved the enigmatic Earl of Hawkhurst since girlhood, long before the tragedy that left him scarred both physically and emotionally. When Skye learns that the celebrated hero has returned to England from his self-imposed exile to make a cold marriage of convenience, she brazenly plants herself on his castle doorstep, determined to convince Hawk that she alone is his true mate and destiny.An elite member of the Guardians of the Sword, Hawk has vowed never again to risk the pain of loving—but that’s before he deals with the most enchanting, annoyingly persistent seductress he’s ever encountered. One night of blazing passion leaves him impossibly torn. Will Hawk choose duty over love, or will he open his heart and let Skye’s healing light penetrate his darkness?Praise for Secrets of Seduction  “[Nicole] Jordan delivers a powerful, moving romance with intense emotions, sexual tension and a few recurring characters. This is a marvelous, well-written love by a gifted storyteller.”—RT Book Reviews   “I absolutely loved it! The characters were delightful, and their antics kept me laughing out loud and cheering for them! The story had so many unique twists and turns that I did not expect—it was like being on a sizzling hot roller coaster ride.”—Night Owl Reviews  “Nicole Jordan writes a wondrous storyline of romance and love . . . Secrets of Seduction has a little bit of humor, love, romance, betrayal, intrigue, suspense and heartbreak.”—The Reading Café   “A great introduction to Nicole Jordan, a great twist on a classic tale, and enough to score her a spot on my permanent ‘Authors to Track’ list.”—The Lemon Review   “Secrets of Seduction is one of the best books I’ve read this year. A classic feel good romance, you’ll love to read!”—Love Romance Passion   “The narrative moves at a well-clipped pace with both an interesting mystery to solve and a gloomy castle to transform along with the Earl’s heart. These and the sizzling love scenes are bound to keep romance readers enchanted.”—Historical Novels Review  “Humorous, seductive . . . Jordan has written a romantic love story with just the right amount of humor to make Secrets of Seduction a fun and enjoyable read.”—Fresh FictionFrom the Paperback edition.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Regency",
    "Historical Fiction",
    "Fiction",
    "Regency Romance"
  ],
  "author": "Nicole Jordan",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/19545710-secrets-of-seduction"
}