{
  "title": "ePatient 2015: 15 Surprising Trends Changing Health Care",
  "description": "“A fascinating and groundbreaking look at how technology and empowered patients are fundamentally changing health care – and a vitally important reminder that the future of health care is about more than who pays for it.”  Written by best selling author Rohit Bhargava (Likeonomics) and noted digital health futurist Fard Johnmar, ePatient 2015 combines groundbreaking original research with insights from pioneers of the digital health movement to offer a road map for patients, caregivers, providers, and business professionals seeking to understand the future of health care.  Taking a global view, the book brings readers on a journey from the robotics labs of Japan to a tiny Dutch city using data to revolutionize breast cancer treatment. These are the stories that bring 15 bold new trends shaping the future of health care to life, including “The Over-Quantified Self,” “CareHacking,” “MicroHealth Rewards,” and “Multicultural Misalignment” to name a few.  - The Over-Quantified Self: How Big Data may deliver “feel good” stats rather than real actionable health advice - Multicultural Misalignment: Why it is critical that health innovators develop products that address differences in age, ethnicity, and culture - MicroHealth Rewards: What game theory teaches us about changing health behavior and why rewards (or punishments) work—or don’t - CareHacking: The surprising ways patients are using digital tools to get better, lower cost, and faster care  Whether you spend most of your time inside the health care system, or happen to be among the billions of people who will end up using it one day, ePatient 2015 paints a surprisingly unique, optimistic, and clear-eyed vision of health care’s future, and how anyone can get ready for it.  For online resources and information on bulk orders, visit the official book website.",
  "genres": [
    "Health Care"
  ],
  "author": "Rohit Bhargava",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/19545231-epatient-2015"
}