{
  "title": "The War Against Population: The Economics and Ideology of World Population Control",
  "description": "Dr. Jacqueline Kasun, Ph.D. The idea that humanity is multiplying at a terrible and accelerating rate is one of the false dogmas of our times. From that notion springs the widely held belief that unless population growth is immediately contained by every governmental and private method imaginable, mankind faces imminent disaster. These ideas form the basis for an enormous international population-control industry that involves billions of dollars of taxes as well as the full time efforts of scores of private philanthropies. Embodied in their agenda is the sort of social planning that actually mandates draconian control over families, churches and other voluntary institutions around the globe. Point by point, Dr. Kasun shatters the dogmas of the controllers--tenets that simply fall apart under close scrutiny and comparison with a mountain of data that the controllers refuse to confront. This is a fascinating book, a tour de force effort to restore reality to a subject that has become unmoored by ideology. \"An eye-opener. The material Kasun presents is invaluable for reference and it is provided in an accessible and readable form.\" - Julian L. Simon, from the Foreword \"This book urgently needs to be read by citizens in general and by parents in particular. It carefully exposes two of the leading frauds of our time--the \"overpopulation\" hysteria and the false pretensae of \"sex education\". - Thomas Sowell, Author, A Conflict of Visions \"One of the best kept secrets in the world is the evil nature of the population control movement. This is the best and most important book on the subject.\" - Charles E. Rice, Professor of Law, University of Notre Dame \"Dr. Kasun's book is about much more than the `overpopulation' myth--for instance, the bare facts about `sex ed'. You will be amazed to know what your tax dollars are actually paying for. Get this book.\" - J.P. McFa",
  "genres": [
    "Economics",
    "Politics"
  ],
  "author": "Jacqueline Kasun",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/1954193.The_War_Against_Population"
}