{
  "title": "Nuff Said",
  "description": "The New York Times and Wall Street Journal bestselling author of Just Tyrus returns in his inimitable style with deeper reminiscences on the life that shaped him and how he views the world we’re living in.\"In this sequel, you'll delve into some of Tyrus's extraordinary life experiences and see how they connect with the most pressing issues of our immigration, crime, bullying, athletics, politics, China, parenting, and respect (for ourselves, each other, and the planet). It is Tyrus’s commentary on all of these issues that has the power to silence a room. When he talks, people listen. There's so much wisdom and common sense in his takes that you’ll finish this book more informed and more optimistic about the future—and we could all use that.” —Dana Perino A rare voice of reason and authentic storyteller who never holds back, Tyrus picks up where he left off in Just Tyrus, delivering a series of gut-wrenching, heart-rending and redemptive tales from his remarkable life and coupling them with no-nonsense insights on the hottest issues being discussed around the country. “Tyrus remains one of the most distinct, original voices in any medium, if not one of the most brutally honest to enter the realm of television since Charles Krauthammer. I mention them both because they're not different—both deep thinkers who leave inedible marks on those who are lucky enough to cross their paths. It’s Tyrus's thinking that drives this book, and you'll get it through his powerful words. Writers spend years trying to concoct a voice. Tyrus makes it seem like it was always there.” —Greg Gutfeld Whether he’s tackling the issues of race and activism in America today or confronting his past with stories of family, relationships, wrestling, and more, this is pure Tyrus at his unbridled best. The parallels he draws between current culture and his personal past are insightful, provocative, and profound. Nuff Said is a powerful reflection on a complex life and a complicated world.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Politics"
  ],
  "author": "Tyrus",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/195458565-nuff-said"
}