{
  "title": "Mortal",
  "description": "Edited by Monique Happy Editorial Services 114,000 words. Approximately 450 pages. \"Through a combination of tight, well-structured plots and fully realized characters, Chesser has emerged as one of the top Indie writers in the business.\" Joe McKinney- 2012 Bram Stoker Award winner and Best Selling author of the Dead World Series. \"Shawn is the author of the Surviving the Zombie Apocalypse Series, a run that so far includes five of the best military zombie writing out there, including Trudge, Soldier On, In Harm’s Way, A Pound of Flesh, and Allegiance.\" Joe McKinney- Mortal, Book 6 in the Surviving the Zombie Apocalypse series, picks up immediately where \" Surviving the Zombie Apocalypse\" left off. Warning Spoilers Ahead. Outbreak - Day 16: With an estimated ninety-nine percent of the United States’ population having already succumbed to the Omega Virus and reanimated to form roving hordes of flesh-eating monsters, two groups of survivors struggle against long odds to survive the zombie apocalypse. Returning from a mission to secure the brain power necessary to replicate an antiserum that has successfully brought one Omega-infected man back from the brink of death, the stealth helicopter carrying Captain Cade Grayson and his small team of Delta Force operators responsible for successfully pulling off the daring feat goes missing. Fearing that the helo has gone down in the zombie-infested countryside somewhere near Pierre, South Dakota, the life—or death—of the men may depend on a decision made by Major Freda Nash, five hundred miles away. Will she send all available resources to search for the missing Ghost Hawk and the eight men aboard? Or will she be forced to put her personal feelings aside for the good of mankind and shift the focus solely to seeing that the aircraft carrying the scientists rescued from the NML, Canada’s answer to the CDC, makes it safely back to Schriever AFB? Meanwhile, awaiting Cade’s return at Schriever AFB, Brooklyn Grayson and daughter Raven are making final preparations to leave Schriever for the compound near Eden, Utah, when a soldier shows up on their doorstep, unannounced and bearing heartbreaking news. Four hundred miles northwest of Schriever, Logan Winters, his brother, Duncan, and a group of survivors newly arrived from Jackson Hole struggle to adapt to life at the Eden Compound—forced to deal not only with the threats posed by the insatiable dead, but also with a group of marauders hell-bent on taking everything they hold dear. Our survivors find out, up close and personal, who is Mortal, and who will survive to fight another day.",
  "genres": [
    "Zombies",
    "Horror",
    "Apocalyptic",
    "Post Apocalyptic"
  ],
  "author": "Shawn Chesser",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/19544561-mortal"
}