{
  "title": "Potrošni",
  "description": "Jednog dana u rano proleće Dorit Veger se prijavljuje u Drugu jedinicu banke rezervnog biološkog materijala. Tu će upoznati nove prijatelje, uživati u lepom apartmanu i blagodetima najnovijih tehničkih dostignuća i proživeti ostatak svog života s ljudima nalik njoj samoj. Ovde su žene starije od pedeset i muškarci stariji od šezdeset godina – samci, bez dece i bez karijera u naprednim granama industrije – izolovani tokom svojih poslednjih godina. Postaju subjekti najrazličitijih ispitivanja i testiranja, da bi počeli da doniraju svoje organe – sve do poslednje, krajnje donacije. Iako pomirena sa sudbinom, Dorit u Jedinici spoznaje ljubav – i život najednom postaje nepodnošljiv. Potrošni predstavljaju svojevrstan ogled o društvu u kome sistem eliminiše one koji ne doprinose u konvencionalnom smislu, gde su autsajderi – „potrošni“ – osuđeni, pod suptilnom prisilom, da žrtvuju sopstvene živote zarad života onih „potrebnih“. Oni takođe zadiru duboko u psihu žene, u njenu fleksibilnost i kreativnost čak i u užasnim uslovima.„Holmkvistova oslikava političko-naučne studije poput Hobsovog Levijatana i RusoovogDruštvenog ugovora, ali i klasične antiutopijske romane od Vrlog novog sveta do 1984... Orvelovski horor u Ksanaduu na ksanaksu – jezivo duboko i izuzetno provokativno.“Kirkus Reviews„Kao i svaka dobra antiutopijska knjiga, Potrošni predstavljaju groteskan i bolan odraz našeg sopstvenog vremena. Oni postavljaju pitanja koja mi – a naši političari zasigurno – radije ne bismo postavili... Fantastična slagalica od romana.“ Smålandsposten „Poput Sluškinjine priče Margaret Atvud, i ovaj roman dočarava hladnu distopiju: žena srednjih godina, sama i bez dece, smatra se nebitnom.“ More Magazine „Jezivo duboko i izuzetno provokativno.“ Kirkus Reviews",
  "genres": [
    "Fiction",
    "Dystopia",
    "Science Fiction",
    "Book Club",
    "Speculative Fiction",
    "Sweden",
    "Adult"
  ],
  "author": "Ninni Holmqvist",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/19548676-potro-ni"
}