{
  "title": "El Salto Cuántico",
  "description": "En un futuro lejano la humanidad se embarca en el proyecto más ambicioso de su corta historia.La detección de un nuevo cuerpo celeste en los confines del Sistema Solar invita a su exploración, y al efecto se envía una sonda que transmite al arribar a su destino impactantes imágenes de un misterioso espécimen habitante.Ante la excitación producida por la confirmación de vida extraterrestre, las potencias del Globo deciden aunar esfuerzos para encarar lo que cataloga como la misión más importante en la historia del ser humano. Pero una falla en la misión tripulada que se encara a tal fin desencadena un desenlace inesperado.Luego de quedar a la deriva, la nave es rescatada por una raza de seres superiores que transportará a sus ocupantes hasta su hogar para enseñarles el estilo de vida y las costumbres de una sociedad en apariencia perfecta. También los astronautas Sheena Reed, Bill Johnson y Richard Spenter tendrán allí el privilegio de saber que los precursores de aquella civilización supieron poblar alguna vez su mismo Sistema Solar, por lo que resultan ser los responsables de sembrar la Tierra con su semilla. Pero no todo es felicidad para los habitantes de ese mundo ideal: su planeta está muriendo y pronto se verán forzados a emprender un nuevo éxodo.Durante su aventura, los terrícolas obtendrán respuestas a otra serie de enigmas que el ser humano desde sus comienzos pugnó por resolver y hasta entonces continuaban sin respuesta; pero, ante el acontecimiento de un hecho inesperado, también tendrán acceso a un oscuro secreto y a los inquietantes planes urdidos por esa raza superior, vinculados con la única alternativa que hallan a disposición para continuar con su existencia.Ese secreto celosamente guardado explicará los orígenes de varios hechos que marcaron la historia a lo largo de su desarrollo en nuestro planeta, algunos de los cuales contribuyeron con la evolución y otros que atentaron contra ella…El surgimiento de las Líneas de Nazca, la construcción de las Pirámides de Egipto, el levantamiento de los imponentes Moais en la Isla de Pascua y hasta la vida y obra de personalidades tales como Cristobal Colon, Adolf Hitler e incluso el propio Jesús de Nazareth son solo algunos ejemplos de los expedientes que componen el inescrupuloso Proyecto Planeta Tierra.",
  "genres": [],
  "author": "Carlos Daniel Marchio",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/19546572-el-salto-cu-ntico"
}