{
  "title": "Till Death and Beyond",
  "description": "Alt Cover: ASIN B00HBGWT4GTill Death and Beyond is a sizzling tale of two souls bound by destiny in a cruel plot to separate them forever...A COLD BEAUTY WHO KNOWS DEATH INTIMATELY...Amira is the strongest witch on the face of the earth, with psychic abilities no others possess. And yet, she is but a slave to the whims of the gods. Forced to be born anew every time she fails in fulfilling an ancient prophecy, Amira is desperate to break the vicious cycle.A TORMENTED WARRIOR WHO HAS LOST EVERYTHING...Plagued by the memories and guilt over his family’s demise, Raven lives for the sole reason of restoring his younger brother. And kidnapping a witch is only the beginning—for he intends to right the wrongs of his past by any means necessary.A DESTINY TO CHANGE THE WORLD...While the gods might have planned for her to be captured, surrender is not something that comes easy to Amira. Yet one glance into her captor’s eyes, and she is swept away by emotions long ago denied to her. She decides to play along. For a while.Despite the hatred Raven harbors for their kind, he is intrigued by the witch. One taste of her lips, and she becomes his obsession. Soon, he discovers that fighting against the passion they ignite in one another is futile. But as they strip each other’s secrets, a powerful force threatens to destroy them both.For in this game of gods nothing is simple—the whole universe seems to conspire against them. And no matter how fiercely they fight, or what they are willing to endure to save each other ... the path they travel is paved with loss.Will they survive the ultimate test, if even their determination—to fight till death—might not be enough?",
  "genres": [
    "Paranormal Romance",
    "Fantasy",
    "Witches",
    "Romance",
    "Paranormal",
    "Magic",
    "Demons"
  ],
  "author": "Lyn C. Johanson",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/19546930-till-death-and-beyond"
}