{
  "title": "Bondage Celebration",
  "description": "Desired    DiscipliNation is a sanctuary for all things kink. Master Andre’ seeks to build an inclusive community where members can explore their passions. Do you have what it takes to join our ranks? Our Masters are a special breed, tight knit and eager to promote the lifestyle one sub at a time. Doms, are you willing to take a sub to heights of pleasure they’ve only dreamed about? If you measure up…we will teach you how. Only submissives willing to learn their full potential, explore their limits and experience submitting to a firm, unrelenting Dom need apply.  Discover sensuality too intense to know any bounds…DiscipliNation.    Bondage Celebration by Tori Carson   This is book two in the Desired Discipline series  Laura refused to say ‘obey’ at their wedding. Now Nick thinks he’s found the key to her obedience. Will Laura fall into line or rebel against his unfair sex-tactics?  Nick has tasted Laura’s submission and can’t get enough. Now he wants his headstrong, stubborn wife collared once and for all. When a disgruntled ex-employee sets Laura in his sights, the stakes become deadly. Nick must bring Laura to heel before it’s too late.  Laura is both enchanted and repulsed by the platinum and diamond slave collar that Nick is determined she will wear permanently. While Laura loves and gladly accepts his domination in the bedroom, he demands more. Nick will stop at nothing until he owns her body and soul.  Laura fears losing her independence, but one incredible orgasm at a time, Nick is drawing her further into his silky web of bondage and dominance.  After Laura is attacked, she learns there is more to being a good submissive than simple obedience. If they are going to find their happily ever after, Laura must be strong enough to battle both Nick’s demons and her own.  Tori Carson   About the   Tori lives in the beautiful Sonoran Desert with her loving husband of almost thirty years. She wakes up each morning to the howls of coyotes and the barking of her family dogs wanting to join the fray.  When Tori isn't writing, she's either spending time with her two, wonderful adult children, or creating stained glass art.  She likes her love stories scorching hot. She tries to infuse a fire and passion between her characters that rivals the blazing summer sun that Arizona is known for. Tori encourages you to bask in the heat between the covers of a Dominant/submissive, happily-ever-after, bondage romance.",
  "genres": [
    "BDSM",
    "Contemporary"
  ],
  "author": "Tori Carson",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/19548723-bondage-celebration"
}