{
  "title": "A Xicana Codex of Changing Consciousness: Writings, 2000-2010",
  "description": "A Xicana Codex of Changing Consciousness features essays and poems by Cherríe L. Moraga, one of the most influential figures in Chicana/o, feminist, queer, and indigenous activism and scholarship. Combining moving personal stories with trenchant political and cultural critique, the writer, activist, teacher, dramatist, mother, daughter, comadre, and lesbian lover looks back on the first ten years of the twenty-first century.Moraga considers decade-defining public events such as 9/11 and the campaign and election of Barack Obama, and she explores socioeconomic, cultural, and political phenomena closer to home, sharing her fears about raising her son amid increasing urban violence and the many forms of dehumanization faced by young men of color. Moraga describes her deepening grief as she loses her mother to Alzheimer’s; pays poignant tribute to friends who passed away, including the sculptor Marsha Gómez and the poets Alfred Arteaga, Pat Parker, and Audre Lorde; and offers a heartfelt essay about her personal and political relationship with Gloria Anzaldúa.Thirty years after the publication of Anzaldúa and Moraga’s collection This Bridge Called My Back, a landmark of women-of-color feminism, Moraga’s literary and political praxis remains motivated by and intertwined with indigenous spirituality and her identity as Chicana lesbian. Yet aspects of her thinking have changed over time. A Xicana Codex of Changing Consciousness reveals key transformations in Moraga’s thought; the breadth, rigor, and philosophical depth of her work; her views on contemporary debates about citizenship, immigration, and gay marriage; and her deepening involvement in transnational feminist and indigenous activism. It is a major statement from one of our most important public intellectuals.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Essays",
    "Poetry",
    "Queer",
    "Feminist Theory",
    "Latino"
  ],
  "author": "Cherríe L. Moraga",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/11097584-a-xicana-codex-of-changing-consciousness"
}