{
  "title": "The Adversity of Diversity: How the Supreme Court's Decision to Remove Race from College Admissions Will Doom Diversity Programs",
  "description": "When the US Supreme Court announced its landmark 6-3 decision to take race out of the equation for college and university admissions, it did more than just bring affirmative action in higher education to a screeching halt. It also fired a warning shot across the bow of businesses and governmental agencies across the days for workplace diversity, equity, and inclusion (DEI) programs that violate the Equal Protection Clause of the 14 th Amendment have an expiration date. In The Adversity of Diversity , award-winning political scientist Carol M. Swain and collaborator Mike Towle offer an insightful look at DEI's inception and evolution into a billion-dollar industry. Swain and Towle explain why DEI's days are numbered, and how we as a people can move beyond divisiveness toward the unity promised by our nation's motto, E Pluribus Unum , \"out of many, one.\"From Alan Dershowitz's On the heels of the Supreme Court decision declaring race-based affirmative action in higher education unconstitutional, Swain and Towle's The Adversity of Diversity puts forth a compelling case for questioning the entire diversity, equity, and inclusion (DEI) industry that has departed from any integrationist goals. It has become an aggressive force that takes organizations away from their core missions and often transforms them into divisive and disruptive institutions that openly violate the rights of members of disfavored groups. Swain's recommended solution of Real Unity Training Solutions entails a return to core American principles that embrace nondiscrimination and equal opportunity in a meritocratic system that recognizes individual rather than group rights.﻿I believe that the demise of race-based affirmative action in college admissions should be accompanied by the elimination of most other nonmeritocratic criteria, such as legacy status, athletics, geography, and other nonacademic preferences. We should truly level the playing field by eliminating practices that create division while taking us further from (Dr. Martin Luther) King's vision and the constitutional protections we should welcome. In this book, Swain shares her own affirmative action journey and the factors that enabled her to achieve the American dream. She and her co-author have not given up on the nation's motto of E Pluribus Unum-out of many, one. Her vision for unity rather than what has become divisive training is one we can and should explore. One need not agree with all their observations and proposals to benefit from their wisdom",
  "genres": [
    "Politics"
  ],
  "author": "Carol M. Swain",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/195601954-the-adversity-of-diversity"
}