{
  "title": "The Beatles Illustrated Lyrics",
  "description": "Originally published in 1969 in two volumes, this collection is issued for the first time in hardback. For those unfamiliar with previous editions, the book is a compilation of 206 Beatles lyrics as illustrated both by fans and by internationally famous artists of the time such as David Bailey, David Hockney, and Ralph Steadman. Edited by designer Alan Aldridge, it also features quotes from the band, specially commissioned photographs, and many of the songs they wrote for other artists such as Cilla Black and PJ Proby.In interpreting the lyrics, the illustrators breathe new life into the words and flesh out basic love songs such as \"Love Me Do\" and \"She Loves You\" with their surreal and psychedelic images. Similarly, the more mature lyrics of later songs such as \"Eleanor Rigby\" and \"Norwegian Wood\", which are effective as words alone, also profit from visual enhancement. The diverse material on offer encompasses a broad spectrum of styles that range from the nursery rhyme-like \"Yellow Submarine\" through the hallucinogenic \"Strawberry Fields Forever\" and the abstract \"I Am The Walrus\" to the reflective beauty of \"Across the Universe\". As with poems, lyrics will always be open to interpretation and the Beatles songs have suffered more dissection than most. However, the illustrations not only successfully capture the essence of the songs but also provide a fascinating reflection of 1960s culture, perhaps most notably by the frequent use of sexist imagery.The Beatles' enormous contribution to art, fashion, and music in the 1960s cannot be under- estimated, nor can their lasting impact on popular culture be disputed, making this definitive collection as relevant today as it was then. The lavish presentation with full colour illustrations ensures it is essential both for casual fans and for obsessive devotees who wish to deconstruct every word of every lyric. The Fab Four changed the world and this is a wonderful example of their colossal talent.",
  "genres": [
    "Music",
    "Art",
    "Nonfiction",
    "Poetry",
    "Reference",
    "History",
    "Biography"
  ],
  "author": "Alan Aldridge",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/195502.The_Beatles_Illustrated_Lyrics"
}