{
  "title": "I Went on an Adventure and All I Got Was This Barbarian Orc",
  "description": "Berklak:Being a half-orc is fun most of the time. Most people think I’m all orc, and that usually slicks things up so I can glide in and out of town without much fuss. Most of the time things go really smoothly for me. Sometimes, young watchmen from small towns with too much time on their hands pick a fight with half-orcs just trying to get some mead, and sometimes that ends up with me taking a kid all the way to the capital to become a bard, and sometimes that means I discover along the way a new questline that I need to follow. Sometimes. Well, this time, at least, and my companion for this quest is the cutest little necromancer I’ve ever seen (he’s the only one I’ve ever seen, but he’s adorable).Now, where did I leave my barrel of mead again?Lawton:Being the most feared human in Fasgard is annoying and inconvenient. It’s not like I went out of my way to be born a necromancer, but since my options are death or working for the king, I gladly accept my role as high sorcerer. It doesn’t matter that I’m a prince of the realm, at least not to anyone in the palace. When one of my father’s concubines loses her temper a little too hard, the things I discover lead me to the most wonderful half-orc I’ve ever met (I’ve only met the one, but he’s amazing), and my very first real adventure.I can’t believe I’m finally going to leave the palace!I Went On An Adventure and All I Got is This Barbarian Orc is a five chapter serial fantasy adventure with a light-hearted, fun TTRPG vibe. Expect big magic, lots of cuddles, plenty of steam, and a team of characters that might not get a natural 20 on every roll, but they make up for it with creative solutions to both magical and mundane problems.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Magic",
    "Romance",
    "Paranormal",
    "Adventure",
    "LGBT"
  ],
  "author": "Jennifer Cody",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/195522658-i-went-on-an-adventure-and-all-i-got-was-this-barbarian-orc"
}