{
  "title": "Day of Reckoning: How Hubris, Ideology, and Greed Are Tearing America Apart",
  "description": "America is coming apart at the seams. Forces foreign and domestic seek an end to U.S. sovereignty and independence. Before us looms the prospect of an America breaking up along the lines of race, ethnicity, class and culture. In Day of Reckoning , Pat Buchanan reveals the true existential crisis of the nation and shows how President Bush’s post-9/11 conversion to an ideology of “democratism” led us to the precipice of strategic disaster abroad and savage division at home.Ideology, writes Buchanan, is a Golden Calf, a false god, a secular religion that seeks vainly, like Marxism, to create a paradise on earth.While free enterprise is good, the worship of a “free trade” that is destroying the dollar, de-industrializing America, and ending our economic independence, is cult madness. While America must stand for freedom and self-determination, the use of U.S. troops to police the planet or serve as advance guard of some “world democratic revolution” is, as Iraq shows, imperial folly that will bring ruin to the republic. While America should speak out for human rights, the idea that we get in Russia’s face and hand out moral report cards to every nation on earth is moral arrogance. While we have benefited from immigration and the melting pot worked with millions of Europeans, the idea we can import endless millions of aliens, legal and illegal, from every culture, clime, creed, and continent on earth, and still remain a country, is absurd.To save America the first imperative is to remove from power the ideologues of both parties who have nearly killed our country.In his final chapter, Buchanan lays out ideas to prevent the end of America. He calls for a bottom-up review of all of America’s Cold War commitments, a ten-point program to secure America’s borders, ideas to halt the erosion of our national sovereignty and restore our manufacturing preeminence and economic independence, and a formula for finding the way to a cold peace in the culture wars.Buchanan offers a radical but necessary program, for neither party is addressing the real crisis of America -- whether we survive as one nation and people, or disintegrate into what Theodore Roosevelt called a “tangle of squabbling nationalities” and not a nation at all. IN THIS EYE-OPENING BOOK, PAT BUCHANAN REVEALS THE PERILOUS PATH OUR NATION HAS - Pax Americana -- the era of U.S. global dominance -- is over.- A struggle for world hegemony among the United States, China, a resurgent Russia and radical Islam has begun.- Torn apart by a culture war, America has begun to Balkanize and break down along class, cultural, ethnic, and racial lines.- Free trade is hollowing out U.S. industry, destroying the dollar, and plunging the country into permanent dependency and unpayable debt.- One of every six U.S. manufacturing jobs vanished under Bush.- The Third World invasion through Mexico is a graver threat to U.S. survival than anything happening in Afghanistan or Iraq.…IS OUR DAY OF RECKONING JUST AHEAD?",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "American"
  ],
  "author": "Patrick J. Buchanan",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/1955394.Day_of_Reckoning"
}