{
  "title": "The Con Queen of Hollywood: The Hunt for an Evil Genius",
  "description": "“This book is as engrossing as anything by Agatha Christie, as unsettling as a novel by Stephen King, and reported with a vigorous empathy that leaves Truman Capote in the dust. Scott Johnson’s courage, his relentless quest for the truth behind a set of brilliantly obscured cruelties, and his examination of the very fabric of psychopathy ultimately lead him to question how the appalling lies spat out by the Con Queen relate to the daily untruths required of us all. His narrative is further deepened by breathtakingly honest reportage about himself and his family, which led him to this radical investigation of a deformed mind. I cannot remember the last time I read anything with such breathless fascination.”—Andrew Solomon The spellbinding tale of an epic international manhunt for a psychopathic con artist who exploited the dreams of creators to steal dozens of identities and millions of dollars. Blending years of deep reporting with distinctive, powerful prose, Scott C. Johnson’s unique true crime narrative recounts the tale of the brilliantly cunning imposter who carved a path of financial and emotional destruction across the world. Gifted with a diabolical flair for impersonation, manipulation, and deception, the Con Queen used their skill with accents and deft psychological insight to sweep through the entertainment industry. Johnson traces the origins of this mastermind and follows the years-long investigation of a singularly determined private detective who helped deliver them to the FBI. Described by one victim as a “crazy, evil genius,” the Con Queen enacted one of the most elaborate scams ever to hit Hollywood—the perfect criminal, committing the perfect crime for our time.  But for what purpose? And with what motive?  Johnson’s unparalleled access to sources—including exclusive interviews with victims and never-before-heard recordings of the Con Queen—brought global attention to the scam, spurred law enforcement to act, and led Johnson himself to venture in search of the Con Queen. Journeying from Los Angeles to the United Kingdom to Jakarta, Johnson eventually came face-to-face with one of the most disturbing criminal minds in recent history, only to realize what chasing the Con Queen revealed about himself and his own troubled family history.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Audiobook",
    "Crime",
    "Psychology",
    "Journalism",
    "Pop Culture"
  ],
  "author": "Scott C. Johnson",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/195494526-the-con-queen-of-hollywood"
}