{
  "title": "What Ho, Automaton!",
  "description": "** Finalist for the 2012 WSFA Award for best short fiction **\"A fun blend of P.G. Wodehouse, steampunk and a touch of Sherlock Holmes. Dolley is a master at capturing and blending all these elements. More than fascinating, this work is also rip-roaring fun!\" - SF RevuThe adventures of Reggie Worcester, gentleman consulting detective, and his automaton valet, Reeves.\"Dolley got me to laugh out loud near the end. Which, frankly, is VERY hard to do. Dolley's tone is spot on Wodehouse and the steampunk elements tie into both plot and silliness admirably.\" - Gail Carriger, author of SoullessReggie, an avid reader of detective fiction, knows two things about solving One, the guilty party is always the person you least suspect. And, two, The Murders in the Rue Morgue would have been solved a lot sooner had the detective the foresight to ask the witnesses if they'd seen any orang-utans recently. Reeves needs all his steam-powered cunning and intellect to curb the young master's excessive flights of fancy. And prevent him from getting engaged.The book contains two stories set in an alternative 1903 where an augmented Queen Victoria is still on the throne and automata are a common sight below stairs.What Ho, Automaton! - an 8,000 word novelette about how the two met.Something Rummy This Way Comes - a 41,000 word novella chronicling their first case. When Reggie discovers that four debutantes have gone missing in the first month of The London Season and, for fear of scandal, none of the families have called the police, he feels compelled to investigate. With the help of Reeves's giant brain and extra helpings of fish, he conducts an investigation that only a detective of rare talent could possibly envisage.Mystery, Zeppelins, Aunts and Humour. A steam-powered Wodehouse pastiche.REVIEWS\"A fun blend of P.G. Wodehouse, steampunk and a touch of Sherlock Holmes. Dolley is a master at capturing and blending all these elements. More than fascinating, this work is also rip-roaring fun! But where Dolley really excels is in capturing the atmosphere and humor of the Bertie and Jeeves stories. Any Wodehouse fan will want to grab a copy of this work, but even if you have never explored that world, What Ho, Automaton! is a fun and fascinating read. Highly recommended, take a spin in this steampunk hybrid and enjoy the ride!\" - SF Revu\"Dolley's collection of Wodehousian steampunk is entertaining and often spot-on parody... Fans of Wodehouse will certainly appreciate Dolley's witty pastiche,\" - Publishers Weekly\"I found myself snickering and snorting as I read, thinking the entire time 'this is pure awesome'\" - Tiffany A. Harkleroad\"I enjoyed every page of this book. A steampunk novel that combines classic British Humor, tongue-in-cheek references to Sherlock Holmes and a cast of great characters. I don't think I've actually laughed out loud this much while reading a book in a very long time.\" - ErisAerie\"I found myself laughing out loud at Reggie and the fabulous Reeves as they romped their way through various adventures. A homage to Wodehouse without being sycophantic, this is fantastic. One thing to say to Chris More please!\" - Sueo23",
  "genres": [
    "Steampunk",
    "Humor",
    "Mystery",
    "Fantasy",
    "Fiction",
    "Science Fiction",
    "Historical Fiction"
  ],
  "author": "Chris Dolley",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/11097620-what-ho-automaton"
}