{
  "title": "Her Own Woman: The Life of Mary Wollstonecraft",
  "description": "Pioneering eighteenth-century feminist Mary Wollstonecraft lived a life as radical as her vision of a fairer world. She overcame great disadvantages -- poverty (her abusive, sybaritic father squandered the family fortune), a frivolous education, and the stigma of being unmarried in a man's world. Her life changed when Thomas Paine's publisher, Joseph Johnson, determined to make her a writer. Wollstonecraft's great feminist document, \"A Vindication of the Rights of Woman, \" which brought her fame throughout Europe, insisted that women reap all the new liberties men were celebrating since the fall of the Bastille in France. Wollstonecraft lived as fully as a man would, socializing with the great painters, poets, and revolutionaries of her era. She traveled to Paris during the French Revolution; fell in love with Gilbert Imlay, a fickle American; and, unmarried, openly bore their daughter, Fanny. Wollstonecraft at last found domestic peace with the philosopher William Godwin but died giving birth to their daughter, Mary, who married Percy Bysshe Shelley, wrote the classic \"Frankenstein, \" and carried on her mother's bold ideas. Wollstonecraft's first child, Fanny, suffered a more tragic fate. This definitive biography of Mary Wollstonecraft gives a balanced, thorough, freshly sympathetic view. Diane Jacobs also continues Wollstonecraft's story by concluding with those of her daughters. \"Her Own Woman\" is distinguished by the author's use of new first sources, among which are Joseph Johnson's letters, discovered by an heir in the late 1990s, and rare letters referring to Wollstonecraft's lover Gilbert Imlay. Jacobs has written an absorbing narrative that is essential tounderstanding Mary Wollstonecraft's life and the importance it has had on women throughout history.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Diane Jacobs",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/195538.Her_Own_Woman"
}