{
  "title": "New Cold Wars: China's Rise, Russia's Invasion, and America's Struggle to Defend the West",
  "description": "A fast-paced account of America’s plunge into simultaneous Cold Wars against two very different adversaries—Xi Jinping’s China and Vladimir Putin’s Russia—based on deep reporting from inside the White House, U.S. intelligence agencies, technology firms, and foreign governments.More than thirty years after the fall of the Berlin Wall, the United States finds itself in a volatile rivalry against the world’s other two great nuclear powers. Yet this era bears very little resemblance to the old Cold War. As Putin and Xi increasingly threaten to team up, this moment grows far more complex—and undeniably more dangerous—than the world of a half century ago.New Cold Wars —the latest from Pulitzer Prize-winning journalist and bestselling author of The Perfect Weapon, David E. Sanger—tells the riveting story of America at a crossroads. At the turn of the millennium, the United States was confident that a democratic Russia and a newly wealthy China could gradually be pulled into the Western-led order. That proved a fantasy. By the time Washington emerged from the age of terrorism, the three nuclear powers were engaged in a new, high-stakes struggle for military, economic, and technological supremacy—with nations around the world forced to take sides.Based on a remarkable array of interviews with top officials in the United States, foreign leaders, andtech companies thrust onto the front lines, Sanger unfolds a riveting narrative spun around the era’s critical Will the mistakes Putin made in his ill-considered invasion of Ukraine prove his undoing, and will he reach for his nuclear arsenal? Will China strike back at the U.S. chip embargo, or seize Taiwan, the world’s semiconductor capital?Taking readers from the battlefields of Ukraine—where trench warfare and cyberwarfare are fought side by side—to the back rooms and boardrooms where diplomats, spies, and tech executives jockey for geopolitical advantage, New Cold Wars is a remarkable first draft history chronicling America’s return to superpower conflict, the choices that lie ahead, and what is at stake for the United States and the world.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "China",
    "Russia",
    "Audiobook",
    "War"
  ],
  "author": "David E. Sanger",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/195531096-new-cold-wars"
}