{
  "title": "Becca and Greg at 314 Harper's Cove",
  "description": "New from the author of the Love Under Construction series! Come and visit the neighbors of Harper's Cove. Every couple on the street is pretty sure they're the only ones doing something as kinky as they're doing, but the joke's on them! Becca and Greg at 314 Harper's Cove continues the series. Even though they seem like your average neighbors, Becca and Greg live a lifestyle their neighbors wouldn't understand, especially the busybody of the neighborhood. Becca lives to serve, and while Greg appreciates her, he rules his domain with an iron fist - or maybe an iron cage. When Becca's asked to share Greg, she does what she has to do, even though Greg insists she'll always be first for him. And it might work out better than Becca thinks initially - that is, if the nosy neighbor will stay out of their business. But the arrival of another woman to their home makes Gloria sure that there's something going on that's just not right. Even Becca's explanation doesn't dissuade her from poking around to find out the \"truth.\" And poke she does, until she gets the surprise of her life! Poor Russell, her husband, is left to listen to her nonsense while trying to keep her drinking under control, but it doesn't work. Gloria is determined to get down to the truth of what's going on in the Hendersons' house. Will Gloria's snooping lead her to a view of life in the Hendersons' house that she's not expecting? Written from first-person perspective of two of the characters, the Harper's Cove series novellas are quick, fun, steamy reads. They'll tickle your funny bone AND put a sizzle in your shorts! At 20K-25K words, they're perfect for a lazy afternoon's entertainment or a quick bedtime jolt to the libido. The books are not dependent on each other and can be read in any order. At their completion, the series will be at least six books (maybe even more!) and each will be just as hot and hilarious. Visit Harper's Cove and get into the lives of the kinkiest neighborhood in town. They're up to things that your neighbors would never do. Or would they? This book contains mild BDSM, unconventional relationships, and frank content. Readers should be 18 or older to purchase this book.",
  "genres": [
    "Romance",
    "Erotica"
  ],
  "author": "Deanndra Hall",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/19549877-becca-and-greg-at-314-harper-s-cove"
}