{
  "title": "Karen and Brett at 326 Harper's Cove",
  "description": "A new series from the author of the Love Under Construction series! Come and visit the neighbors of Harper's Cove. Every couple on the street is pretty sure they're the only ones doing something as kinky as they're doing, but the joke's on them! Karen and Brett at 326 Harper's Cove kicks off the series. They seem like your average neighbors, but Karen and Brett have a secret - well, they have twelve of them. And every Saturday night their secrets converge for the biggest, most adventurous party on the block. They've been holding their weekly \"parties\" every week for years, and they're not inclined to stop because of one snoopy neighbor. Sometimes they even carry part of the party over into the late night and next morning. They're doing a very good job of keeping everything on the down-low too. Or so they think. But Gloria is sure they're up to something; matter of fact, Gloria's sure EVERYONE in the neighborhood is up to something, and she's certain that it's no good. She pokes, prods, and prowls to try to figure out what her neighbors are hiding. She's quick to corner them at the mailbox and question them, sometimes even trying to invite herself to their homes. They're all on to her, and they're doing their best to stay away from her and keep her out of the business. They get a little additional help from her long-suffering husband, Russell, who thinks she's either making things up or imagining them. After all, between the \"cough syrup\" every morning, her Bloody Mary lunch, her happy hour stress-reliever, and her evening mixer, not to mention her \"in-between meal snacks,\" Gloria's prone to making up and seeing things that aren't there anyway. Even Russell's threats of returning her to rehab don't stop Gloria from sneaking around, peeking into windows, and generally being the nosy busybody of the neighborhood. Wouldn't Gloria be surprised if she realized that those gallon bottles she saw them carrying in were full of lube, not liquor? Written from first-person perspective of two of the characters, the Harper's Cove series novellas are quick, fun, steamy reads. They'll tickle your funny bone AND put a sizzle in your shorts! At 20K-25K words, they're perfect for a lazy afternoon's entertainment or a quick bedtime jolt to the libido. The books are not dependent on each other and can be read in any order. At their completion, the series will be at least six books (maybe even more!) and each will be just as hot and hilarious. Visit Harper's Cove and get into the lives of the kinkiest neighborhood in town. They're up to things that your neighbors would never do. Or would they?",
  "genres": [
    "Romance"
  ],
  "author": "Deanndra Hall",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/19549874-karen-and-brett-at-326-harper-s-cove"
}