{
  "title": "Flags Over the Warsaw Ghetto: The Untold Story of the Warsaw Ghetto Uprising",
  "description": "The Warsaw Ghetto Uprising has become a symbol of heroism throughout the world. A short time before the uprising began, Pawel Frenkel addressed a meeting of the Jewish Military Of course we will fight with guns in our hands, and most of us will fall. But we will live on in the lives and hearts of future generations and in the pages of their history.... We will die before our time but we are not doomed. We will be alive for as long as Jewish history lives! On the eve of Passover, April 19, 1943, German forces entered the Warsaw ghetto equipped with tanks, flame throwers, and machine guns. Against them stood an army of a few hundred young Jewish men and women, armed with pistols and Molotov cocktails. Who were these Jewish fighters who dared oppose the armed might of the SS troops under the command of SS General Juergen Stroop? Who commanded them in battle? What were their goals? In this groundbreaking work, Israel s former Minister of Defense, Prof. Moshe Arens, recounts a true tale of daring, courage, and sacrifice that should be accurately told out of respect for and in homage to the fighters who rose against the German attempt to liquidate the Warsaw ghetto, and made a last-ditch fight for the honor of the Jewish people. The generally accepted account of the Warsaw Ghetto Uprising is incomplete. The truth begins with the existence of not one, but two resistance organizations in the ghetto. Two young men, Mordechai Anielewicz of the Jewish Fighting Organization (ZOB), and Pawel Frenkel of the Jewish Military Organization (ZZW), rose to lead separate resistance organizations in the ghetto, which did not unite despite the desperate battle they were facing. Included is the complete text of The Stroop Report translated into English.",
  "genres": [
    "Holocaust",
    "History",
    "Nonfiction",
    "World War II",
    "Historical",
    "Poland"
  ],
  "author": "Moshe Arens",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/11098189-flags-over-the-warsaw-ghetto"
}