{
  "title": "Imperial Grunts: The American Military on the Ground",
  "description": "In this landmark book, Robert D. Kaplan, veteran correspondent for The Atlantic Monthly and author of Balkan Ghosts, shows how American imperialism and the Global War on Terrorism are implemented on the ground, mission by mission, in the most exotic landscapes around the world. Given unprecedented access, Kaplan takes us from the jungles of the southern Philippines to the glacial dust bowls of Mongolia, from the forts of Afghanistan to the forests of South America–not to mention Iraq–to show us Army Special Forces, Marines, and other uniformed Americans carrying out the many facets of U.S. foreign policy: negotiating with tribal factions, storming terrorist redoubts, performing humanitarian missions and training foreign soldiers. In Imperial Grunts, Kaplan provides an unforgettable insider’s account not only of our current involvement in world affairs, but also of where America, including the culture of its officers and enlisted men, is headed. This is the rare book that has the potential to change the way readers view the men and women of the military, war, and the global reach of American imperialism today.As Kaplan writes, the only way to understand America’s military is “on foot, or in a Humvee, with the troops themselves, for even as elites in New York and Washington debated imperialism in grand, historical terms, individual marines, soldiers, airmen, and sailors–all the cultural repositories of America’s unique experience with freedom–were interpreting policy on their own, on the ground, in dozens upon dozens of countries every week, oblivious to such faraway discussions. . . . It was their stories I wanted to tell: from the ground up, at the point of contact.”Never before has America’s overarching military strategy been parsed so incisively and evocatively. Kaplan introduces us to lone American servicemen whose presence in obscure countries is largely unknown, and concludes with a heart-stopping portrait of marines in the first battle in Fallujah. Extraordinary in its scope, beautifully written, Imperial Grunts, the first of two volumes, combines first-rate reporting with the sensitivity and insights of an acclaimed writer steeped in history, literature, and philosophy, to deliver a masterly account of America’s global role in the twenty-first century. • Imperial Grunts paints a vivid picture of how defense policy is implemented at the grassroots level.• Kaplan travels throughout the world where U.S. forces are located. This is not just a book about Iraq or Afghanistan. • Rather than debate imperialism, Kaplan relies on a keen understanding of history, philosophy, and in-the-field reporting to show how it actually works on the ground.• Imperial Grunts escapes Washington and shows us what it’s like to live with the grunts day to day.Praise for Imperial Grunts“One of the most important books of the last several years. Robert Kaplan uses his prodigious energy and matchless reporting skills to takes us on to the front lines with the new warrior-diplomats who use weapons, imagination, and personal passion to protect and advance the interests of the United States. This is a generation every American should come to know.”–Tom Brokaw“Robert Kaplan has brilliantly captured the story of today’s U.S. military operating in far-flung places on strange missions. Imperial Grunts is the most insightful and superbly written account of soldiering in the New World Disorder to date. It is a must read for all Americans.”–General Anthony C.",
  "genres": [
    "Military Fiction",
    "History",
    "Nonfiction",
    "War",
    "Military History",
    "Politics",
    "Travel"
  ],
  "author": "Robert D. Kaplan",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/19577804-imperial-grunts"
}