{
  "title": "Miles to Go for Freedom: Segregation and Civil Rights in the Jim Crow Years",
  "description": "Told through unforgettable first-person accounts, photographs, and other primary sources, this book is an overview of racial segregation and early civil rights efforts in the United States from the 1890s to 1954, a period known as the Jim Crow years. Multiple perspectives are examined as the book looks at the impact of legal segregation and discrimination on the day-to-day life of black and white Americans across the country. Complete with a bibliography and an index, this book is an important addition to black history books for young readers.Praise for Miles to Go for Freedom*STARRED REVIEW* “A detailed and thought-provoking account of segregation. A valuable and comprehensive perspective on American race relations.”—Publishers Weekly, starred review*STARRED REVIEW *“Readers will come away moved, saddened, troubled by this stain on their country’s past and filled with abiding respect for those who fought and overcame. Osborne expertly guides readers through this painful, turbulent time of segregation, enabling them to understand fully the victims’ struggles and triumphs as they worked courageously to set things right.”— Kirkus Reviews, starred review*STARRED REVIEW *“The text is elegant and understated. Drawing on personal interviews, the author provides incidents of everyday racism that young people will be able to grasp and relate to immediately.”— School Library Journal, starred review\"Tight, consistent focus, pristine organization, and eminently browsable illustrations make this middle-school offering a strong recommendation.\"— Bulletin of the Center for Children's Books\"Osborne’s book is a well-written chronicle of the African-American struggle for equal rights in the United States. The reader will be quickly engaged.\"— Library Media Connection",
  "genres": [
    "Nonfiction",
    "History",
    "Comics",
    "Middle Grade",
    "Childrens"
  ],
  "author": "Linda Barrett Osborne",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/11098408-miles-to-go-for-freedom"
}