{
  "title": "Buddhism Ultimate Collection",
  "description": "BUDDHISM ULTIMATE COLLECTION: 5 Famous Books for Beginners from Zen Masters & Experts for You to Get Simple, Plain, Quick Understanding of Buddhist Beliefs, Religion & TeachingsDo you want a clear, easy understanding of Buddhist concepts? Before you answer, read the following carefully...PATH TO YOUR CALM, STRESS-FREE SERENITYThink about the calm inner peace you want..Buddhism has been practised for thousands of years, helping people achieve a stress-free outlook on life. Imagine the serenity you will find when you understand it. Imagine what your renewed life will be like...To achieve this, do you want a book that will easily explain ALL Buddhist concepts?Then you want the Buddhism Ultimate Collection from 'Everlasting Flames Publishing'.DESIGNED WITH YOU IN MINDThink Buddhism is difficult? There is no need to feel that. This collection is designed to make Buddhism simple, easy-to-follow and enjoyable, so you can apply it to your life quickly.These works are from acclaimed Buddhist Zen Masters and Experts, guaranteed to provide the rejuvenating knowledge you want.'THE BEST BUDDHISM BOOK YOU CAN GET...'In this 'must-have' collection, in an easy to navigate Kindle eBook, you get the following works:*ZEN FOR AMERICANS – SERMONS OF A BUDDHIST ABBOTHistoric series of electrifying lectures, explaining Buddhism.From SOYEN SHAKUBuddhist Abbot, Zen Master and Elder Master.First Zen Master to teach in the USA.CHAPTERS INCLUDE:What is Buddhism?Buddhist FaithGod-Conception of Buddhism*BUDDHIST CATECHISM - QUESTIONS AND ANSWERS In use around the world to teach Buddhism, this has simple Questions and Answers concerning Buddha and all Buddhism Concepts, showing their use in modern society. Certified by Buddhist High Priests.Written by HENRY S. OLCOTTAmerican Military Officer, Journalist, Lawyer. Known as the man who created a renaissance in the study of Buddhism. Honored in Sri Lanka for his efforts as major Buddhism revivalist.CHAPTERS INCLUDE:Understanding DharmaBuddhism and ScienceFundamental Beliefs*WAY TO NIRVANASeries of 6 in-depth lectures given on Buddhism.From PROFESSOR DE LA VALLE-POUSSIN Ph. DExpert in Sanskrit, Pali, Avestan and Oriental languages. Holder of several Doctorates, one achieved at the age of 19.CHAPTERS INCLUDE:The Buddhist SoulNirvana - No SufferingPath to Nirvana*LIFE OF BUDDHAThe original epic poem about the Buddha.Written by Asvaghosha Bodhisattva, the legendary Indian poet.Translated from Chinese into English by the famous Samuel Beal.*BUDDHA, THE PLAYA play and story to help make Buddhism easy to understand.Written by PROFESSOR PAUL CARUS, Ph.D. Expert in Comparative Religion. Professor of Philosophy. First managing editor of the Open Court Publishing Company.YOUR FREE BONUSES: *THE DHAMMAPADA (WITH INTRODUCTION)Most respected of Buddhist texts, written by the Buddha himself.Sometimes called ‘The Path to Eternal Truth’ or ‘The Path to Righteousness’.Translated by respected F. MAX MULLERGerman Philologist and OrientalistFounder of the discipline of Comparative Religion.*SUTRA OF THE 42 CHAPTERS (WITH COMMENTARY)The earliest Buddhist sutras (rules/formulas). Highly regarded as \"the First Sutra\" or first formula of Buddhism. YOUR EXCLUSIVE, ENVIABLE COLLECTIONImagine the knowledge and understanding you will get from these works. Imagine the calm inner life you will discover.DON'T MISS OUTAs you read this, you understand why you have to have this astonishing collection because it will help discover the calm serenity you deserve. Don’t miss out on the amazing words others are finding out about.And available on the Kindle, this big collection is yours for next to nothing.GET THIS BUDDHISM ULTIMATE COLLECTION RIGHT NOW and start living the world of Buddhism.'Everlasting Flames Publishing' is devoted to keeping the classics burning bright. Also available in the Kindle Store:*William Shakespeare Ultimate Collection: 213 Plays Poems and Sonnets*Ultimate Mythology Collection:50+ Books - Iliad, Odyssey, Oedipus and More ALL in One",
  "genres": [
    "Buddhism",
    "Religion"
  ],
  "author": "Paul Carus",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/10014691-buddhism-ultimate-collection"
}