{
  "title": "The Nature of Disappearing",
  "description": "In this captivating novel of suspense, a wilderness guide must team up with the man who ruined her life years ago when the friend who introduced them goes missing.Emlyn doesn’t let herself think about the past.How she and her best friend, Janessa, barely speak anymore. How Tyler, the man she thought was the love of her life, left her freezing and half-dead on the side of the road three years ago.Her new life is simple and safe. She works as a fishing and hunting guide, spending her days in Idaho’s endless woods and scenic rivers. She lives alone in her Airstream trailer, her closest friends a handsome and kind Forest Service ranger and the community’s makeshift reverend, who took her in at her lowest.But when Tyler shows up with the news that Janessa is missing, Emlyn is propelled back into the world she worked so hard to forget. Janessa, it turns out, has become a social media star, documenting her #vanlife adventures with her rugged survivalist boyfriend. But she hasn’t posted lately, and when she does, it’s from a completely different location than where her caption claims to be. In spite of their fractured history, Emlyn knows she might be the only one with the knowledge and tracking skills to save her friend, so she reluctantly teams up with Tyler. As the two trace Janessa’s path through miles of wild country, Emlyn can’t deny there’s still chemistry crackling between them. But the deeper they press into the wilderness, the more she begins to suspect that a darker truth lies in the woods―and that Janessa isn’t the only one in danger.Poignant, suspenseful, and unforgettable, THE NATURE OF DISAPPEARING explores what it takes to start over―and the cost of letting the past pull you back in.",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Audiobook",
    "Suspense",
    "Adult"
  ],
  "author": "Kimi Cunningham Grant",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/195790594-the-nature-of-disappearing"
}