{
  "title": "Rednecks",
  "description": "Winner of the Southern Book Prize for Fiction A historical drama based on the Battle of Blair Mountain, pitting a multi-ethnic army of 10,000 coal miners against mine owners, state militia, and the United States government in the largest labor uprising in American history.Rednecks is a tour de force, big canvas historical novel that dramatizes the 1920 to 1921 events of the West Virginia Mine Wars—from the Matewan Massacre through the Battle of Blair Mountain, the largest armed conflict on American soil since the Civil War, when some one million rounds were fired, bombs were dropped on Appalachia, and the term “redneck” would come to have an unexpected origin story.Brimming with the high stakes drama of America’s buried history, Rednecks tells a powerful story of rebellion against oppression. In a land where the coal companies use violence and intimidation to keep miners from organizing, “Doc Moo\" Muhanna, a Lebanese-American doctor (inspired by the author’s own great-grandfather), toils amid the blood and injustice of the mining camps. When Frank Hugham, a Black World War One veteran and coal miner, takes dramatic steps to lead a miners' revolt with a band of fellow veterans, Doc Moo risks his life and career to treat sick and wounded miners, while Frank's grandmother, Beulah, fights her own battle to save her home and grandson. Real-life historical figures burn bright among the hills: the fiery Mother Jones, an Irish-born labor organizer once known as \"The Most Dangerous Woman in America,\" struggles to maintain the ear of the miners (\"her boys\") amid the tide of rebellion, while the sharp-shooting police chief \"Smilin\" Sid Hatfield dares to stand up to the \"gun thugs\" of the coal companies, becoming a folk hero of the mine wars.Award-winning novelist Taylor Brown brings to life one of the most compelling events in 20th century American history, reminding us of the hard-won origins of today's unions. Rednecks is a propulsive, character-driven tale that’s both a century old and blisteringly contemporary: a story of unexpected friendship, heroism in the face of injustice, and the power of love and community against all odds.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "Southern",
    "Book Club",
    "Adult"
  ],
  "author": "Taylor  Brown",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/195790759-rednecks"
}