{
  "title": "Apostles of Mercy",
  "description": "Apostles of Mercy is the new alternate history first contact novel from the instant New York Times, Wall Street Journal and LA Times bestselling Lindsay Ellis.First Contact has not been going well. The nations of Earth are rapidly militarizing against the arrival of the Superorganism, an alien civilization that promises to destroy humanity before it can develop into a real threat. The Superorganism has done it before–to their distant transient relatives–and they could easily do it again. But the alien Ampersand and his human interpreter Cora Sabino are done with trying to save humanity from both the Superorganism and itself; to them, this is a civilization that does not deserve to be saved.When a strange new form of communication between the two of them reveals to Cora how alien Ampersand truly is, she begins to question her blind devotion. But she soon learns of a danger that may force them to leave Earth before either of them are a group of superorganism enemies that have been wreaking havoc on Earth for decades. Existence on the margins has made them desperate and bent on revenge against any of Ampersand's race whose path they cross. Before Cora and Ampersand can make their final escape, these hostile aliens stage an attack, and take that which is most dear to both of them.Ampersand's enemies will not consider any form of truce; the greatest threat to them is not from the Superorganism, but from an increasingly fearful and violent human civilization newly aware of their existence. Cora and Ampersand must go to extreme measures to take back what was stolen and prevent wholesale human extermination–but in doing so they may be no better than the civilizations they are trying to escape.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Audiobook",
    "Aliens",
    "Queer",
    "Romance",
    "LGBT"
  ],
  "author": "Lindsay  Ellis",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/195790939-apostles-of-mercy"
}