{
  "title": "Women in the Valley of the Kings: The Untold Story of Women Egyptologists in the Gilded Age",
  "description": "The never-before-told story of the women Egyptologists who paved the way of exploration in Egypt and created the basis for Egyptology.The history of Egyptology is often told as yet one more grand narrative of powerful men striving to seize the day and the precious artifacts for their competing homelands. But that is only half of the story. During the so-called Golden Age of Exploration, there were women working and exploring before Howard Carter discovered the tomb of King Tut. Before men even conceived of claiming the story for themselves, women were working in Egypt to lay the groundwork for all future exploration.In Women in the Valley of the Kings: The Untold Story of Women Egyptologists in the Gilded Age, Kathleen Sheppard brings the untold stories of these women back into this narrative. Sheppard begins with some of the earliest European women who ventured to Egypt as travelers: Amelia Edwards, Jenny Lane, and Marianne Brocklehurst. Their travelogues, diaries and maps chronicled a new world for the curious. In the vast desert, Maggie Benson, the first woman granted permission to excavate in Egypt, met Nettie Gourlay, the woman who became her lifelong companion. They battled issues of oppression and exclusion and, ultimately, are credited with excavating the Temple of Mut.As each woman scored a success in the desert, she set up the women who came later for their own struggles and successes. Emma Andrews’ success as a patron and archaeologist helped to pave the way for Margaret Murray to teach. Margaret’s work in the university led to the artists Amice Calverley’s and Myrtle Broome’s ability to work on site at Abydos, creating brilliant reproductions of tomb art, and to Kate Bradbury’s and Caroline Ransom’s leadership in critical Egyptological institutions. Women in the Valley of the Kings upends the grand male narrative of Egyptian exploration and shows how a group of courageous women charted unknown territory and changed the field of Egyptology forever.",
  "genres": [
    "Nonfiction",
    "History",
    "Egypt",
    "Biography",
    "Archaeology",
    "Feminism",
    "Historical"
  ],
  "author": "Kathleen Sheppard",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/195791072-women-in-the-valley-of-the-kings"
}