{
  "title": "Reagan",
  "description": "This is the definitive biography of Ronald Reagan by the leading Reagan reporter, the White House correspondent for The Washington Post.Lou Cannon's full-dress biography is about an ordinary man from Illinois who grew up to be the fortieth President of the United States. It is a book about a man who speaks to the future with a vision of the past, promising a return to the golden age he believes was America in his childhood. It is a book about Ronald Wilson Reagan and the ways he grew and mastered the communicative skills which made him a conservative folk hero, two-time Governor of California, and President.It is a book about a boy who found \"a clean kind of hatred\"in playing football and who practiced announcing imaginary football games into a broomstick microphone. This boy was a dreamer, who read about the lives of America's heroes and imagined he was one of them. He was an optimist, who remained so even when the dreams of his family were crushed by the Depression and who thrilled to the message of hope in Franklin Roosevelt's inaugural speech. This is a book about a conservative Republican with liberal Democratic heroes.Reagan is also a warts-included critical biography of a resourceful politician who is rarely as simple as he seems. It is a book about a man who escaped the shadow of his father's alcoholism, the poverty and obscurity of Dixon, Illinois, the setback of being fired from his first radio announcing job and the typecasting of Warner Brothers, to become first a competent actor and then the ablest political communicator of his time.The book traces Reagan's achievements and failures in Hollywood and Sacramento, records his courage and his lies, and tells how he went on to become President of the United States. Finally, Reagan is an account of how he came to grips with that presidency and of what he hopes to achieve in the time remaining to him. \"What I'd really like to do,\" he told Lou Cannon, \"is go down in history as the man who made Americans believe in themselves again.\"",
  "genres": [
    "Biography",
    "Presidents",
    "History",
    "Nonfiction",
    "Politics",
    "American History"
  ],
  "author": "Lou Cannon",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/1109868.Reagan"
}