{
  "title": "The Full-Body Fat Fix: The Science-Based 7-Day Plan to Cool Inflammation, Heal Your Gut, and Build a Healthier, Leaner You!",
  "description": "Discover a groundbreaking new way of eating that can reverse inflammation, heal your gut, and improve your overall health, fitness and athletic performance—in just one week—while setting you on the path to easy, sustainable weight loss for life!Journalist and bestselling author Stephen Perrine reveals how in his intensely researched, yet simple and engaging new book, The Full-Body Fat Fix. With a unique blend of humor and science, Perrine explains how chronic inflammation and an unhealthy microbiome are the underlying causes of weight gain, and how classic “dieting” strategies—like cutting calories, eliminating certain foods or only eating during specific times—actually undermine our weight-loss goals.The new science of weight management is more exciting and delicious than we ever imagined. Simply by eating a greater variety of plant-based foods—at least 30 different plants each week, including vegetables, fruits, whole grains, seeds, nuts, herbs and legumes—and not getting stuck with the same old “healthy” foods again and again, science shows we can bring healing back to our guts, turn off the mechanisms that cause inflammation and reduce our risk of obesity and its related diseases.In Perrine’s hands, this trick is as easy as it is delicious, starting with “The Fire Fightin’ Five,” a yummy combination of five meals and snacks (including pizza!) that will give you 30 unique plants—effortlessly! And with his 7-Day Challenge, you’ll be able to track and maximize your dietary goals—and make a game out of healthy eating and weight loss. (How many different plants can you eat? Can you squeeze in more than your friends and family?) To make it even easier, dozens of recipes populate the book, each one as enticing as the next.Weight loss has never been as fun, as delicious, or as easy to enjoy.",
  "genres": [
    "Nonfiction",
    "Health",
    "Self Help"
  ],
  "author": "Stephen Perrine",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/195790886-the-full-body-fat-fix"
}