{
  "title": "Questioning the COVID Company Line: Critical Thinking in Hysterical Times",
  "description": "“We must protect the vaccinated from the unvaccinated!”This statement, proclaimed by public health officials and politicians, then parroted by members of the populace, perfectly encapsulates the absurdity of the period of history from 2020 to 2023, when the people of the world were subjected to an unprecedented level of fear-mongering propaganda across all media platforms. The use of propaganda to galvanize support for war has gone on since time immemorial, but in this case the “evil enemy” was not a foreign leader or group of people but a virus, the Severe Acute Respiratory Syndrome Coronavirus 2 (SARS-CoV-2), better known as COVID-19. Adopting a wartime stance toward a virus with a mortality rate similar to that of the seasonal flu, governments all over the planet secured widespread compliance with mandates dictating the behavior of formerly free human beings.In this collection of twenty-six essays, Laurie Calhoun traces the history of the COVID-19 crisis from its inception in 2020, analyzing the various stages of what transpired in real time. As she attempts to comprehend what is going on, Calhoun illuminates the manifold contradictions serving as the basis for vicious shaming campaigns, pitting citizens against other citizens, alienating people everywhere, and attacking the very concept of civil society. Together, these investigations constitute an intellectual journal which chronicles all that we have been through and serves as a cautionary tale for the future.Praise for Questioning the COVID Company Critical Thinking in Hysterical Times:\"The dissidents were few and far between in the early days of Covid totalitarianism. Laurie Calhoun was among them, and this is her powerful story. It was a lonely struggle, and we only found out later that government censorship was working hard to keep us from finding each other. But now we have. The rackets and lies are becoming more obvious by the day. It's thrilling that Laurie has put together her lucid and prescient work, if only for future generations to not everyone went insane.\"—Jeffrey Tucker, Brownstone Institute\"Questioning the COVID Company Line is a crucially important reflection on the COVID-19 pandemic. Laurie Calhoun critically interrogates the COVID-19 outbreak and government response to make sense of the global events that unfolded during the 2020 to 2023 period. In doing so, she cuts through many of the popular narratives surrounding COVID while offering important insight into the broader philosophical and practical challenges associated with government responses to crises. This book will be of great value to those interested in understanding the COVID experience and to those concerned with government overreach, which threatens the very liberties the state purports to protect.\"—Christopher Coyne, George Mason University\"Laurie Calhoun survived getting walloped by Covid-19 early in 2020 while isolated in rural Austria. She revived, shifted to Britain, and began relentlessly debunking the official frauds and follies of the pandemic. Laurie had the ideal intellectual background for seeing through multiple levels of government shenanigans. Having done research in chemistry and written a penetrating critique of contemporary analytic philosophy, Laurie was too savvy to swoon for Fauci and other bobble-headed pseudo-saviors. Her books on foreign policy fiascos vivify how politicians use deceit to stretch their power. She was the ideal person for Questioning the COVID Company Line' via critical thinking in hysterical times.\"—Jim Bovard, author of Attention Deficit Democracy and Public Policy Hooligan",
  "genres": [
    "Health",
    "Politics"
  ],
  "author": "Laurie Calhoun",
  "average_rating": "2.92",
  "url": "https://www.goodreads.com/book/show/195800434-questioning-the-covid-company-line"
}