{
  "title": "Miss May Does Not Exist: The Life and Work of Elaine May, Hollywood’s Hidden Genius",
  "description": "2024 National Book Critics Circle finalist — John Leonard Prize for Best First Book • Named one of 2024's Best Books by The New York Times, NPR, Publishers Weekly, Vulture, Newsweek, Literary Hub, and more.\"A deeply researched, psychologically astute new biography of May by Carrie Courogen...The book is written with a brash literary verve that feels authentic to its subject, and it does justice both to May’s mighty artistry and to the complex fabric of her life, linking them persuasively while resisting facile correlations between her personal concerns and her blazing inspirations.\" — Richard Brody, The New Yorker\"Casual, sympathetic and compulsively readable.\" — The New York Times Book Review\"A minor miracle...a fascinating, three-dimensional portrait of a brilliant, complicated artist\" — The Los Angeles TimesMiss May Does Not Exist , by Carrie Courogen is the riveting biography of comedian, director, actor and writer Elaine May, one of America’s greatest comic geniuses. May began her career as one-half of the legendary comedy team known as Nichols and May, the duo that revolutionized the comedy sketch.After performing their Broadway smash An Evening with Mike Nichols and Elaine May, Elaine set out on her own. She toiled unsuccessfully on Broadway for a while, but then headed to Hollywood where she became the director of A New Leaf, The Heartbreak Kid, Mikey and Nicky, and the legendary Ishtar. She was hired as a script doctor on countless films like Heaven Can Wait, Reds, Tootsie, and The Birdcage. In 2019, she returned to Broadway where she won the Tony Award for Best Leading Actress in The Waverly Gallery. Besides her considerable talent, May is well known for her reclusiveness. On one of the albums she made with Mike Nichols, her bio is “Miss May does not exist.” Until now.Carrie Courogen has uncovered the Elaine May who does exist. Conducting countless interviews, she has filled in the blanks May has forcibly kept blank for years, creating a fascinating portrait of the way women were mistreated and held back in Hollywood. Miss May Does Not Exist is a remarkable love story about a prickly genius who was never easy to work with, not always easy to love and frequently often punished for those things, despite revolutionizing the way we think about comedy, acting, and what a film or play can be.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Film",
    "Biography Memoir",
    "Memoir",
    "Audiobook",
    "History"
  ],
  "author": "Carrie Courogen",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/195790922-miss-may-does-not-exist"
}