{
  "title": "Foreign Agents: How American Lobbyists and Lawmakers Threaten Democracy Around the World",
  "description": "A stunning investigation and indictment of the United States' foreign lobbying industry and the threat it poses to democracy.For years, one group of Americans has worked as foot-soldiers for the most authoritarian regimes around the planet. In the process, they've not only entrenched dictatorships and spread kleptocratic networks, but they've secretly guided U.S. policy without the rest of America even being aware. And now, they've begun turning their sights on American democracy itself.These Americans are known as foreign lobbyists, and they've spent years ushering dictatorships directly into the halls of Washington, all while laundering the reputations of the most heinous, repressive regimes in the process. These foreign lobbyists include figures like Ivy Lee, the inventor of the public relations industry - a man who whitewashed Mussolini, opened doors to the Soviets, and advised the Nazis on how to sway American audiences. They include people like Paul Manafort, who invented lobbying as we know it - and who then took his talents to autocrats from Ukraine to the Philippines, and then back to the White House. And they now include an increasing number of Americans in law firms and consultancies, among PR specialists and former lawmakers, and even within think tanks and universities.All of these industries, and all of these Americans, have transformed into proxies for dictators and strongmen wherever they can be found. And for years, they've escaped scrutiny.In Foreign Agents , Casey Michel shines a light on these foreign lobbyists, and all the damage and devastation they have caused in Washington and elsewhere. From Moscow to Beijing, from far-right nationalists to far-left communists, from anti-American autocrats to pro-Western authoritarians, these foreign lobbyists have helped any illiberal, anti-democratic government they can find. And after decades of success in installing dictator after dictator, and in tilting American policy in the process, they've now begun trying to end America's democratic experiment, once and for all.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Business",
    "Economics",
    "Political Science",
    "Audiobook"
  ],
  "author": "Casey Michel",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/195790855-foreign-agents"
}