{
  "title": "Ami",
  "description": "When the Pillar blooms, the end of the world is not far behind. Li Ami was always on the outside—outside of family, outside of friendships, outside of ordinary magic. The odd and eccentric daughter of a former imperial magician, she has devoted her life to books because she finds them easier to read than people. Exiled to the outermost west of the Morning Realms, Ami has become the sole caretaker of her mentally ill father, whose rantings and ravings may be more than mere ramblings; they may be part of a dire prophecy. When her father is arrested for trespassing and stealing a branch from the sacred tree of the local monastery, Ami offers herself to the mysterious Beast in the castle, who is in need of someone who can translate a forbidden magical text and find a cure for the mysterious blight that is affecting the harvest of the land. Meanwhile, as signs of magical corruption arise throughout the Morning Realms, Jin Zhara begins to realize that she might be out of her element. She may have defeated a demon lord and uncovered her identity as the Guardian of Fire, but she’ll be more than outmatched in the coming elemental battle against the Mother of Ten Thousand Demons…unless she can find the other Guardians of Dawn. Her magic is no match for the growing tide of undead, and she needs the Guardian of Wood with power over life and death in order to defeat the revenants razing the countryside. The threat of the Mother of Ten Thousand Demons looms larger by the day, and the tenuous peace holding the Morning Realms together is beginning to unravel. Ami and Zhara must journey to the Root of the World in order to seal the demon portal that may have opened there and restore balance to an increasingly chaotic world.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Queer",
    "Retellings",
    "LGBT",
    "Fiction"
  ],
  "author": "S. Jae-Jones",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/195791521-ami"
}