{
  "title": "All Hail the Underdogs",
  "description": "When seventeen-year-old Patrick Roman is offered a scholarship to a top hockey preparatory school, he thinks maybe his notorious bad luck has finally ended. With a hearing for his legal emancipation on the horizon, he dreams of getting scouted and securing a place on a D1 college team. There’s only one problem: Roman has serious beef with his new winger on the team, Damien Bordeaux. They’re supposed to be perfectly in sync on the ice. But Roman, with his buzzcut and tattoos, has nothing in common with trust-fund-kid Damien, his floral scrunchies, and designer T-shirts that cost more than all of Roman’s secondhand hockey gear combined.When eighteen-year-old Damien Bordeaux starts his senior year, he tells himself he’s going to focus on hockey and school. No more making out in the stacks, no more dorm parties. He needs to decide what his future will look like. Does he pursue his long-held dream of becoming a writer? Or stay in his lane and do what he’s good at: hockey. Regardless, he’s not going to let any pretty boys distract him from figuring his shit out. Except his new center, Roman, is possibly the most beautiful boy Damien has ever seen. And his hockey—the way he moves on the ice—might be even more beautiful. Too bad he’s also probably a homophobic, racist asshole.But their antagonistic beginning turns into an unlikely friendship and then turns into something much scarier for them both. Navigating relationships is hard enough for normal teenagers. It’s a lot harder when contending with lawyers, NHL scouts, and mutual past trauma. Roman and Damien have to decide: What do they really want in life? Are they willing to fight for each other—including fighting against their own pasts and prejudices—so they can have a happy ending?",
  "genres": [
    "Romance",
    "Sports",
    "LGBT",
    "Queer",
    "Hockey",
    "Young Adult",
    "M M Romance"
  ],
  "author": "E.L. Massey",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/195806912-all-hail-the-underdogs"
}