{
  "title": "Mahlon Blaine: One",
  "description": "He's pretty much an unknown, and yet...In two thousand drawings published between 1917 and 1967, illustrator Mahlon Blaine revealed his subjects – from Demons to Deities, Maylasians to Martians, Biology to Biography, Lasciviousness to Literature. He painted, but he is best known for pen and ink – an uncanny artistic master of Erotica and Exotica who lived for decades in cheap hotels and borrowed rooms, acutely observing humanity while wielding pens and brushes dipped in wit and wry.With everything from children's classic tales to cookbooks to treatises on witchcraft to mainstream fiction to literature (including Steinbeck, Hemingway and Voltaire), the publishing industry relied on Mahlon Blaine often. His best book productions feature twenty to a hundred illustrations each, and he garnered several awards for design and illustration.His personal life is obfuscated by a combination of time's grime and his own desire for privacy and outlandish cover stories.The author Roland Trenary has been collecting and researching the artist for almost 40 years, amassing the most comprehensive assemblage of information and artwork that one might imagine, given the elusive nature of the subject. The book includes a complete bibliography of published work and a biography that emphasizes the professional side of Blaine. Among the over 400 illustrations herein are rare photographs and self-portraits of Blaine and, especially interesting, dozens of published and unpublished drawings and paintings that reveal a side of the artist previously unknown and unseen.This goes beyond either The Art of Mahlon Blaine (1982) or The Outlandish Art of Mahlon Blaine (2009) in presenting both rare published and unpublished examples of Blaine's unique artistic vision, with 350 examples not found in those two previous books on Blaine. And remember, unbelievably, he only had one eye!Bibliographically, here are 130 books and 80 magazines described and pictured that held Blaine's public outpouring, as well as ephemera and posthumous publication listings - information not available anywhere else.",
  "genres": [],
  "author": "Roland Trenary",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/19579346-mahlon-blaine"
}