{
  "title": "Daughters of Shandong",
  "description": "An instant USA Today Bestseller!A propulsive, extraordinary novel about a mother and her daughters’ harrowing escape to Taiwan as the Communist revolution sweeps through China, by debut author Eve J. Chung, based on her family storyDaughters are the Ang family’s curse.In 1948, civil war ravages the Chinese countryside, but in rural Shandong, the wealthy, landowning Angs are more concerned with their lack of an heir. Hai is the eldest of four girls and spends her days looking after her sisters. Headstrong Di, who is just a year younger, learns to hide in plain sight, and their mother—abused by the family for failing to birth a boy—finds her own small acts of rebellion in the kitchen. As the Communist army closes in on their town, the rest of the prosperous household flees, leaving behind the girls and their mother because they view them as useless mouths to feed.Without an Ang male to punish, the land-seizing cadres choose Hai, as the eldest child, to stand trial for her family’s crimes. She barely survives their brutality. Realizing the worst is yet to come, the women plan their escape. Starving and penniless but resourceful, they forge travel permits and embark on a thousand-mile journey to confront the family that abandoned them.From the countryside to the bustling city of Qingdao, and onward to British Hong Kong and eventually Taiwan, they witness the changing tide of a nation and the plight of multitudes caught in the wake of revolution. But with the loss of their home and the life they’ve known also comes new freedom—to take hold of their fate, to shake free of the bonds of their gender, and to claim their own story.Told in assured, evocative prose, with impeccably drawn characters, Daughters of Shandong is a hopeful, powerful story about the resilience of women in war; the enduring love between mothers, daughters, and sisters; and the sacrifices made to lift up future generations.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "China",
    "Historical",
    "Asia",
    "Audiobook",
    "Literary Fiction"
  ],
  "author": "Eve J. Chung",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/195888874-daughters-of-shandong"
}