{
  "title": "The Mango Tree: A Memoir of Fruit, Florida, and Felony",
  "description": "Rows of orange people sit handcuffed in a beige room. One of them is my mother.When journalist Annabelle Tometich picks up the phone one June morning, she isn’t expecting a collect call from an inmate at the Lee County Jail. And when she accepts, she certainly isn’t prepared to hear her mother’s voice on the other end of the line. However, explaining the situation to her younger siblings afterwards was easy; all she had to say was, “Mom shot at some guy. He was messing with her mangoes.” They immediately understood. Answering the questions of the breaking-news reporter—at the same newspaper where Annabelle worked as a restaurant critic––proved more difficult. Annabelle decided to go with a variation of the truth: it was complicated. So begins The Mango Tree, a poignant and deceptively entertaining memoir of growing up as a mixed-race Filipina “nobody” in suburban Florida as Annabelle traces the roots of her upbringing—all the while reckoning with her erratic father’s untimely death in a Fort Myers motel, her fiery mother’s bitter yearning for the country she left behind, and her own journey in the pursuit of belonging. With clear-eyed compassion and piercing honesty, The Mango Tree is a family saga that navigates the tangled branches of Annabelle’s life, from her childhood days in an overflowing house flooded by balikbayan boxes, vegetation, and juicy mangoes, to her winding path from medical school hopeful to restaurant critic. It is a love letter to her fellow Filipino Americans, her lost younger self, and the beloved fruit tree at the heart of her family. But above all, it is an ode to Annabelle’s hot-blooded, whip-smart mother Josefina, a woman who made a life and a home of her own, and without whom Annabelle would not have herself.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Biography Memoir",
    "Book Club",
    "Biography",
    "Mental Health"
  ],
  "author": "Annabelle    Tometich",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/195820710-the-mango-tree"
}