{
  "title": "A Dawn with the Wolf Knight",
  "description": "To enter the woods as a human means death… But I am no mere human. They call me, “witch.\"\n As one of the last surviving witches, Faelyn’s sole duty is to keep the protective barriers on the forests where the lykin roam—creatures who can shed flesh for fur—sparing nearby humans from their violent, beastly natures. When she has an unlikely encounter with the rare, primordial spirit of the moon, Faelyn finds herself not only the object of the Wolf King’s desire, but essential to his ability to keep his crown. Taken to the magical land of Midscape, the Wolf King claims her as his bride to control the moon spirit’s magic that now resides within Faelyn. But Faelyn refuses to resign herself and the spirit Aurora to a life of servitude underneath the king’s cruel rule. Faelyn hatches a dangerous plan for them both to escape and help comes from an unlikely ally. Evander is the king’s blisteringly handsome, loyal knight, right hand, and Faelyn’s sworn protector…on the outside. But appearances are not what they seem. He plots against the king’s brutality at every turn and helping Faelyn escape will serve these ends. But altruism for Faelyn and the trapped moon spirit isn’t his only motivation… Evander is hiding secrets, and they might change Faelyn’s life forever. A desperate plot to escape. A brutal king. Ancient powers. And a sworn protector who can’t keep his hands off her… Will she be taken as the Wolf King’s bride? Or will she manage an escape that will free her heart and change her fate forever? A Dawn with the Wolf Knight is a complete, *stand alone novel*. For readers who love romantasy novels with second-chance/long-lost love, life-changing female friendships, deep lore, forbidden romance, slow-burn, and a happily ever after. While it is set in the Married to Magic universe, readers can start with this book.",
  "genres": [
    "Fantasy",
    "Romance",
    "Romantasy",
    "Fantasy Romance",
    "Werewolves",
    "Paranormal",
    "Witches"
  ],
  "author": "Elise Kova",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/195883956-a-dawn-with-the-wolf-knight"
}