{
  "title": "Spartan Up!: A Take-No-Prisoners Guide to Overcoming Obstacles and Achieving Peak Performance in Life",
  "description": "Since 2006 more than one million people have participated in Spartan Races around the world. In 2014 there will be a race every other day in 15 countries on five continents. What do these Spartans know that you don’t? They know that we all have a fire burning within us to prove ourselves. Joe De Sena has captured that invincible Spartan spirit in his manifesto for bold living, SPARTAN UP! A Take-No-Prisoners Guide to Overcoming Obstacles and Achieving Peak Performance in Life (Houghton Mifflin Harcourt; May 13, 2014; $24).  De Sena’s prescription for life’s insurmountable obstacles is to get off the couch and crush them through hard work and force of will. A legend in the ultramarathon community, he created Spartan Race, extreme obstacle races where no one knows what to expect, but to finish is to be transformed. Spartan Race drives participants to their very limit to learn what they are capable of and to set a new frame of reference; one they can draw upon in the face of life’s harshest challenges. Everyday disappointments and setbacks seem small when you’ve been to the other side of hell and made it back as a victor. In SPARTAN UP! De Sena paints a picture of how he created the Spartan way of life, beginning with an unexpected challenge by a friend that got him back into shape through endurance racing. After that first race, De Sena completed more than 50 ultramarathons (in conditions ranging from -30 to 120 degrees) and 14 Ironman events, including the 135-mile Badwater ultramarathon, the 140.6 Lake Placid Ironman, and a 100-mile Vermont trail run—in a single week. The harder the race the more he loved it; he was hooked.SPARTAN UP! is more than an insider’s view of the world of obstacle racing, it’s a manual for the Spartan way of life, including :•\tFinding the will to succeed: The first half of a race you run with your legs; the second half you run with your mind. Turn your pain into an outboard motor to drive you forward. •\tTossing your cookies: The Cookie Test can teach you how to overcome the need for immediate gratification and help you prosper in the long term. •\tChanging your frame of reference: Reset your inner default as an antidote to dissatisfaction and the insatiable need for “more.” •\tGetting Spartan fit: Survival of the Fittest means training outside the gym for strength, endurance and flexibility throughout the entire body—and don’t forget those burpees! •\tMoving mountains: Whether metaphorical mountains or the ones on which Spartans race, what you think are your limits can be a mere starting point for transformation. Age, gender, and physical ability are no barrier and finishers become entirely new people, without limitations, living life to the fullest. That’s why the Spartans say: “You’ll know at the finish line.” JOE DE SENA is a cofounder of Spartan Race, which began as an obstacle race based on the extreme spirit of the legendary Death Race, and has become a multi-million dollar global lifestyle company in less than 10 years. It was voted Outside magazine’s Best Obstacle Race. In one year’s time he competed in the Raid International Ukatak in Canada; the IditaSport in Alaska; the Odyssey Adventure Race and the OAR Beast of the East, both in Virginia; the Raid the North Extreme in Newfoundland, the Adrenaline Rush in Ireland and the Discovery Channel World Championships in Switzerland. He resides in Vermont with his family. For more information, please visit www.spartanupthebook.com.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Fitness",
    "Health",
    "Personal Development",
    "Sports",
    "Audiobook"
  ],
  "author": "Joe De Sena",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/19583491-spartan-up"
}