{
  "title": "The Question of God: C.S. Lewis and Sigmund Freud Debate God, Love, Sex, and the Meaning of Life",
  "description": "\"This elegantly written and compelling comparison of the worldviews of Sigmund Freud and C. S. Lewis provides a riveting opportunity to consider the most important questions mankind has ever asked: Is there a God? Does he care about me? This profound book is for anyone who is earnestly seeking answers about truth, the meaning of life, and God's existence.\"  -- Francis Collins, Director, National Human Genome Research Institute  Many of history's greatest thinkers have wrestled with the ultimate question of belief and nonbelief in God. Though it might seem unlikely that any new arguments could possibly be raised on either side, the twentieth century managed to produce two men who each made brilliant, new, and lasting arguments, one in favor of belief and one opposed. Few spokesmen have ever championed their respective positions better than Sigmund Freud and C. S. Lewis. Sadly, as far as we know, they never met or debated each other directly.  In The Question of God their arguments are placed side by side, as if they were standing at podiums in a shared room. Both thought carefully about the flaws and alternatives to their positions; each considered the other's views. Both men considered the problem of pain and suffering, the nature of love and sex, and the ultimate meaning of life and death. Here, with their debate made explicit, we can take ringside seats at one of history's most profound encounters.  For more than twenty-five years Armand Nicholi has studied the philosophical writings of both men, and has taught a popular course at Harvard that compares the two worldviews. In The Question of God he presents the fruits of years of labor among the published and unpublished writings of Lewis and Freud, including an extensive exploration of their private letters. He allows them to speak for themselves on every major question of belief and nonbelief, but also skillfully draws conclusions from their own lives. Why did Freud have such difficulty maintaining lifelong friendships? How did Lewis's friendships change after his transition from atheism to belief? Why was Freud unable to willfully ignore his own internal moral sense, even though he believed it to be purely a product of socialization and not in any way eternally \"true\"?  The Question of God may be the best book about belief and nonbelief ever written, since it does not presuppose which answer is correct. Instead, it uses two of history's most articulate spokesmen to present arguments on both sides. In the end, readers must join Nicholi's hundreds of former students in deciding for themselves which path to follow.",
  "genres": [
    "Philosophy",
    "Religion",
    "Nonfiction",
    "Psychology",
    "Theology",
    "Christian",
    "Christianity"
  ],
  "author": "Armand M. Nicholi Jr.",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/19590424-the-question-of-god"
}