{
  "title": "The Rise and Fall of the EAST: How Exams, Autocracy, Stability, and Technology Brought China Success, and Why They Might Lead to Its Decline",
  "description": "The long history of China’s relationship between stability, diversity, and prosperity, and how its current leadership threatens this delicate balance A Foreign Affairs Best Book of 2023 Chinese society has been shaped by the interplay of the EAST—exams, autocracy, stability, and technology—from ancient times through the present. Beginning with the Sui dynasty’s introduction of the civil service exam, known as Keju, in 587 CE—and continuing through the personnel management system used by the Chinese Communist Party (CCP)—Chinese autocracies have developed exceptional tools for homogenizing ideas, norms, and practices. But this uniformity came with a huge downside: stifled creativity. Yasheng Huang shows how China transitioned from dynamism to extreme stagnation after the Keju was instituted. China’s most prosperous periods, such as during the Tang dynasty (618–907) and under the reformist CCP, occurred when its emphasis on scale (the size of bureaucracy) was balanced with scope (diversity of ideas). Considering China’s remarkable success over the past half-century, Huang sees signs of danger in the political and economic reversals under Xi Jinping. The CCP has again vaulted conformity above new ideas, reverting to the Keju model that eventually led to technological decline. It is a lesson from China’s own history, Huang argues, that Chinese leaders would be wise to take seriously. The long history of China’s relationship between stability, diversity, and prosperity, and how its current leadership threatens this delicate balance A Foreign Affairs Best Book of 2023 Chinese society has been shaped by the interplay of the EAST—exams, autocracy, stability, and technology—from ancient times through the present. Beginning with the Sui dynasty’s introduction of the civil service exam, known as Keju, in 587 CE—and continuing through the personnel management system used by the Chinese Communist Party (CCP)—Chinese autocracies have developed exceptional tools for homogenizing ideas, norms, and practices. But this uniformity came with a huge downside: stifled creativity. Yasheng Huang shows how China transitioned from dynamism to extreme stagnation after the Keju was instituted. China’s most prosperous periods, such as during the Tang dynasty (618–907) and under the reformist CCP, occurred when its emphasis on scale (the size of bureaucracy) was balanced with scope (diversity of ideas). Considering China’s remarkable success over the past half-century, Huang sees signs of danger in the political and economic reversals under Xi Jinping. The CCP has again vaulted conformity above new ideas, reverting to the Keju model that eventually led to technological decline. It is a lesson from China’s own history, Huang argues, that Chinese leaders would be wise to take seriously.",
  "genres": [
    "China",
    "History",
    "Politics",
    "Nonfiction",
    "Economics",
    "Asia",
    "Audiobook"
  ],
  "author": "Yasheng Huang",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/195917358-the-rise-and-fall-of-the-east"
}