{
  "title": "Sea Witch",
  "description": "The time: the golden age of piracy - 1716 The Place: the Pirate Round - from South Africa to the Islands of the Caribbean. Escaping the bullying of his elder brother, from the age of fifteen Jesamiah Acorne has been a pirate, with only two loves - his ship and his freedom. But his life is to change when he and his crew unsuccessfully attack a merchant ship off the coast of South Africa. He is to meet Tiola Oldstagh, an insignificant girl or so he thinks - until she rescues him from a vicious attack, and almost certain death, by pirate hunters. And then he discovers what she really is; a healer and a midwife - and a white witch. Her name, an anagram of \"all that is good.\" Jesamiah and Tiola become lovers, despite her guardian, Jenna Pendeen's disapproval, but Stefan van Overstratten a Cape Town Dutchman, also wants Tiola as his wife, and Jesamiah's half brother Phillipe Mereno, is determined to seek revenge for a stolen ship and the insult of being cuckolded. When the call of the sea and an opportunity to commandeer a beautiful ship - Sea Witch - is put in Jesamiah's path, he must make a choice between his life as a pirate or his love for Tiola; he wants both - but Mereno and Von Overstratten want him dead. In trouble, imprisoned in the darkness and stench that is the lowest part of his brother's ship, can Tiola with her Craft, and the aid of Roux, Jesamiah's quartermaster and the rest of his loyal crew, save her pirate? And can she keep Jesamiah safe from another who wants him for herself? From the elemental being that is Tethys, Goddess of the Sea? A charismatic pirate rogue and a white witch - what better combination for a story of romance and high-sea fantasy adventure?",
  "genres": [
    "Historical Fiction",
    "Pirates",
    "Fantasy",
    "Historical",
    "Romance",
    "Fiction",
    "Adventure"
  ],
  "author": "Helen Hollick",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/1958775.Sea_Witch"
}