{
  "title": "The Cemetery of Untold Stories",
  "description": "Literary icon Julia Alvarez returns with an inventive and emotional novel about storytelling itself that will be an instant classic. Alma Cruz, the celebrated writer at the heart of The Cemetery of Untold Stories , doesn’t want to end up like her friend, a novelist who fought so long and hard to finish a book that it threatened her sanity. So when Alma inherits a small plot of land in the Dominican Republic, her homeland, she has the beautiful idea of turning it into a place to bury her untold stories—literally. She creates a graveyard for the manuscript drafts and revisions, and the characters whose lives she tried and failed to bring to life and who still haunt her. Alma wants her characters to rest in peace. But they have other ideas, and the cemetery becomes a mysterious sanctuary for their true narratives. Filomena, a local woman hired as the groundskeeper, becomes a sympathetic listener as Alma’s characters unspool their secret tales. Among them: Bienvenida, the abandoned second wife of dictator Rafael Trujillo, consigned to oblivion by history, and Manuel Cruz, a doctor who fought in the Dominican underground and escaped to the United States. The characters defy their author: they talk back to her and talk to one another behind her back, rewriting and revising themselves. The Cemetery of Untold Stories asks: Whose stories get to be told, and whose buried? Finally, Alma finds the meaning she and her characters yearn for in the everlasting vitality of stories. Readers of Isabel Allende’s Violeta and Barbara Kingsolver’s Demon Copperhead will devour Alvarez’s extraordinary new novel about beauty and authenticity that reminds us the stories of our lives are never truly finished, even at the end.",
  "genres": [
    "Fiction",
    "Magical Realism",
    "Fantasy",
    "Historical Fiction",
    "Audiobook",
    "Books About Books",
    "Book Club"
  ],
  "author": "Julia Alvarez",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/195820829-the-cemetery-of-untold-stories"
}