{
  "title": "The Architect of Desire: Beauty and Danger in the Stanford White Family",
  "description": "The story of Stanford White--his scandalous affair with the 16-year-old actress Evelyn Nesbit, his murder in 1906 by her husband, the millionaire Harry K. Thaw, and the hailstorm of publicity that surrounded \"the trial of the century\"--has proven irresistable to generations of novelists, historians, and biographers. The premier neoclassical architect of his day, White's legacy to the world were such masterpieces as New York's original Madison Square Garden, the Washington Square Arch, and the Players, Metropolitan, and Colony clubs. He was also responsible for the palaces of such clients as the Whitneys, Vanderbilts, and Pulitzers, the robber barons of the Gilded Age whose power and dominance shaped the nation in its heady ascent at the turn of the century.As the century rolled on, however, the story of Stanford White and Evelyn Nesbit came to be viewed as glamorous and romantic, the darker narrative of White's out-of-control sexual compulsion obscured by time. Indeed, White's wife Bessie and his son Larry remained adamantly silent about the matter for the duration of their lives, a silence that reverberated through the next four generations of their extended family.Suzannah Lessard is the eldest of Stanford White's great grandchildren. It was only in her 30's that she began to sense the parallels between the silence about her great-grandfather's life and the silence about her own perilous experience as a little girl in her own home. Thus she became drawn to the remarkable history of her family in order to uncover its hidden truths, and in so doing to liberate herself from its enclosure at last. The result is a multi-layered memoir of astonishing elegance and power, one that, like a great building, is illumined room by room, chapter by chapter, until the whole is clearly seen.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Memoir",
    "True Crime",
    "Architecture",
    "American History"
  ],
  "author": "Suzannah Lessard",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/196203.The_Architect_of_Desire"
}