{
  "title": "So Many Things To Bury",
  "description": "A master of small-town crime/noir returns with this stunning tale of one working man's struggle against fate, circumstance and his own bad choices.The year is 1977. Al Heidorn is a working stiff, a Korean War vet and recently divorced father of three whose life is unraveling from decades of drink, PTSD, and bad choices. Now, having hit rock bottom, Al is determined to turn things around and make up for lost time . . . though that's easier said than done. Because while Al may have kicked the booze, Fate still has one more vicious kick in store for him. Will Al find a \"heretofore hidden higher gear\" and become the man his family needs, or will he squander the only thing that he has yet to lose—his young daughter's love and life?CRITICAL ACCLAIM FOR SO MANY THINGS TO BURY\"(So Many Things to Bury) is a REALLY good novel. Nothing I love more than a story about a loser driven by circumstance to find a heretofore hidden higher gear.\" --Jim Thomsen, The Killing Rain: Left Coast Crime Anthology\"There's not anything good about Al Heidorns's life. Falling apart at the seams, Al's just not boy scout material. Heidorn has no where to go but six feet under. Chris Orlet's story is filled with top-notch witty prose and humor until the reality of Heidorn's choices leaves no one laughing. High fives for Orlet, a worthy author, who makes it clear some people continually make bad decisions.\" —Wil A. Emerson, author of Fatal Mistake\"Although the protagonist makes one horrible decision after another, I kept rooting for him hoping he'd figure things out. This starts off bleak and becomes increasingly darker by the chapter. My favorite novel by this author so far.\"--Goodreads reviewerREVIEWS“What I’ve been waiting for for years. Finally a worthy successor to James Crumley and Newton Thornburg and Kem Nunn, the 1970’s godfathers of true noir’s long-needed revival. ” Jonathan Ashley, author of South of Cincinnati, Out of Mercy, and The Cost of Doing Business“Classic noir! A Taste of Shotgun features craven characters creating carnage and feckless fuckwits failing and flaming out fantastically. Fuck yeah.\" Jedidiah Ayres, author of Peckerwood“Often very funny, and true to the “noir” tradition in that its central characters are terminal screw-ups who get themselves deeper and deeper into horrible fixes. The more they try to dig themselves out, the worse it gets.” Rory Costello, Hard Sentences: Crime Fiction Inspired by Alcatraz“White trash noir at its finest. Dirt balls, criminals, and other assorted living train wrecks doing crazy stupid things, and it is funny as well. What is there not to love? I look forward to other titles by this author.” Jim Thomsen, The Killing Rain: Left Coast Crime Anthology“Often very funny, and true to the “noir” tradition in that its central characters are terminal screw ups who get themselves deeper and deeper into horrible fixes. The more they try to dig themselves out, the worse it gets. Benefits from its setting in redneck Illinois, with realistic descriptions of how the local economy has been hollowed out. Also benefits from the exclusion of the very played-out theme of meth.” David Nemeth, Unlawful Acts",
  "genres": [],
  "author": "Chris Orlet",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/196096506-so-many-things-to-bury"
}