{
  "title": "Whatever Happened to Penny Candy?",
  "description": "In \"Whatever Happened to Penny Candy?\" Richard Maybury uses historical events from Ancient Rome to explain economic principles. This clearly written book about economics is a remarkably easy and fun explanation of investment cycles, velocity, business cycles, recessions, inflation, the demand for money and more. Essential for every student, businessperson and investor. Recommended by former U.S. Treasury Secretary William Simon. It is also on many recommended reading lists.Can be used for courses in Economics, Business, Finance, Government and Ancient Rome. To improve the student's learning experience, also purchase the student study guide for \"Whatever Happened to Penny Candy?\" titled \"A Bluestocking Guide: Economics\" also available through Amazon.com.Table of Contents for Whatever Happened to Penny Candy?AcknowledgementsStudy Guide AvailablePreface Note to ReaderA Note About EconomicsSmart 1. Money: Coins and Paper2. Tanstaafl, The Romans, and Us3. Inflation4. Dollars, Money, and Legal Tender5. Revolutions, Elections, and Printing Presses6. Wages, Prices, Spirals, and Controls7. Wallpaper, Wheelbarrows, and RecessionsBoom and Bust Cycle Since the Civil War8. Fast MoneyHistory Repeats9. Getting Rich Quick10. The Boom and Bust Cycle11. How Much is a Trillion? The Roaring 90sFederal Debt Chart 12. What's So Bad About the Federal Debt?An Interesting Exercise One Reason Governments Spend So Much 13. Summary 14. Where Do We Go From Here?15. Natural Law and Economic ProsperityNations and Legal SystemsAppendix (not a complete listing)Supply of Dollars ChartReal Wages ChartQuotesMedian Income ChartThe Oil MythHow to Invest in Gold and SilverMeasures of Money SupplyThe Truth About InflationReal Investment ValueResourcesInternet Addresses Book SuppliersDistilled Wisdom Bibliography GlossaryAnswers to Exercises for Real Investment ValueIndexFor Further Study (also available through Amazon.com)Economics: A Free Market ReaderContains articles by noted economists that expand on the concepts presented in Penny Candy. Study questions/answers included.Capitalism for KidsExplains the philosophy of entrepreneurship. Excellent information for both kids and adults. Includes a test to help kids determine if they have the personality to become an entrepreneurCommon Sense Business for Kids Explains common sense strategies behind basic business principles. Gems of wisdom for the businessperson (young or experienced) conveyed through real-life stories and anecdotes. Though written with young people in mind, this book is engaging and beneficial for adults as well.Whatever Happened to Justice? rev. ed.Explains the common law model. Maybury says, \"In my opinion, you and your family and friends will avoid a lot of trouble, and find success of every kind easier to achieve, if you adopt these two models, Austrian economics and common law. 'Penny Candy' explains the Economic model. Now, read 'Justice' for the Legal model. Underlying common law are two basic rules: 1) do all that you agreed to do and 2) do not encroach on other persons or their property.\"",
  "genres": [
    "Economics",
    "Nonfiction",
    "School",
    "History",
    "Education",
    "Politics",
    "Read For School"
  ],
  "author": "Richard J. Maybury",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/196117.Whatever_Happened_to_Penny_Candy_"
}