{
  "title": "Predator's Refuge",
  "description": "A tiger shifter searching for a safe place to hide. A lynx shifter trying to prove herself. Neither expecting the desire that flares between them … nor the danger stalking them. Suspense and passion fill the pages of Predator’s Refuge , Book 3 of Rosanna Leo’s thrilling romance series, Gemini Island Shifters.Lynx shifter Marci Lennox has worked at the shifter-friendly Ursa Fishing Lodge and Resort all her adult life. It’s more a home to her than a job. When her boss goes on vacation, putting her in charge, Marci is thrilled. Finally a chance to prove she has the mettle to run a resort.Her confidence is shaken when new employee Anton Gaspar appears. One look at the mysterious tiger shifter spells trouble for Marci and for her sex-crazed lynx. Anton is judgmental, condescending, and a little misogynistic. Unfortunately, Marci’s lynx thinks his tiger is more delicious than an oversized bag of Maltesers.It becomes difficult for Marci to remain neutral near Anton, especially when she learns of his troubling past and unusual family circumstances. However, when dangerous incidents occur on the resort, the lynx woman and tiger man join forces to combat the threat to the lodge and its guests.Harder still is the quest to combat their explosive feelings for one another. As they explore their mutual passion, they realize the danger at the resort is more insidious than they ever envisioned. Their dreams, their love, and their very lives are at stake.Content Hot, Paranormal, Contemporary, Shifters, SuspenseParanormal Romance Fiction, Romantic Suspense Fiction, Contemporary Romance Fiction, Contemporary Paranormal Romance Fiction, Shifter Romance Fiction",
  "genres": [
    "Paranormal Romance",
    "Shapeshifters",
    "Romance",
    "Paranormal",
    "Erotica",
    "Erotic Romance",
    "Adult"
  ],
  "author": "Rosanna Leo",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/19609948-predator-s-refuge"
}