{
  "title": "Queen Bees and Wannabes",
  "description": "“My daughter used to be so wonderful. Now I can barely stand her and she won’t tell me anything. How can I find out what’s going on?”“There’s a clique in my daughter’s grade that’s making her life miserable. She doesn’t want to go to school anymore. Her own supposed friends are turning on her, and she’s too afraid to do anything. What can I do?”Welcome to the wonderful world of your daughter’s adolescence. A world in which she comes to school one day to find that her friends have suddenly decided that she no longer belongs. Or she’s teased mercilessly for wearing the wrong outfit or having the wrong friend. Or branded with a reputation she can’t shake. Or pressured into conforming so she won’t be kicked out of the group. For better or worse, your daughter’s friendships are the key to enduring adolescence—as well as the biggest threat to her well-being.In her groundbreaking book, Queen Bees and Wannabes, Empower cofounder Rosalind Wiseman takes you inside the secret world of girls’ friendships. Wiseman has spent more than a decade listening to thousands of girls talk about the powerful role cliques play in shaping what they wear and say, how they respond to boys, and how they feel about themselves. In this candid, insightful book, she dissects each role in the clique: Queen Bees, Wannabes, Messengers, Bankers, Targets, Torn Bystanders, and more. She discusses girls’ power plays, from birthday invitations to cafeteria seating arrangements and illicit parties. She takes readers into “Girl World” to analyze teasing, gossip, and reputations; beauty and fashion; alcohol and drugs; boys and sex; and more, and how cliques play a role in every situation.Each chapter includes “Check Your Baggage” sections to help you identify how your own background and biases affect how you see your daughter. “What You Can Do to Help” sections offer extensive sample scripts, bulleted lists, and other easy-to-use advice to get you inside your daughter’s world and help you help her.It’s not just about helping your daughter make it alive out of junior high. This book will help you understand how your daughter’s relationship with friends and cliques sets the stage for other intimate relationships as she grows and guides her when she has tougher choices to make about intimacy, drinking and drugs, and other hazards. With its revealing look into the secret world of teenage girls and cliques, enlivened with the voices of dozens of girls and a much-needed sense of humor, Queen Bees and Wannabes will equip you with all the tools you need to build the right foundation to help your daughter make smarter choices and empower her during this baffling, tumultuous time of life.From the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "Parenting",
    "Psychology",
    "Self Help",
    "Education",
    "Feminism",
    "Sociology"
  ],
  "author": "Rosalind Wiseman",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/19634128-queen-bees-and-wannabes"
}