{
  "title": "Tristessa",
  "description": "Tristessa is the name with which Kerouac baptized Esperanza Villanueva, a Catholic Mexican young woman, a prostitute and addict to certain drugs, whom he fell in love with during one of his stays in Mexico -a country that he frequently visited - by the middle of the fifties. Wrapped in a spiritual atmosphere that expresses the yearnings of Kerouac to find himself, \"Tristessa\", translated by Jorge García- Robles, a specialist in the beat generation, is the story of the strange loving relationship that the author had with Esperanza, as well as the significant description of the atmosphere that surrounded it, which depicts some key places of Mexico City back then.Hero of the beat generation, the creator of a model of life that would be followed by thousands of young people in the entire world, a sui generis mystic, \"Tristessa\", which until recently was not known in Spanish and that was published in English, is one of his fresher and better achieved works. Tristessa es el nombre con el que Kerouac bautizó a Esperanza Villanueva, una joven mexicana católica, prostituta y adicta a ciertas drogas, de quien se enamoró durante una de sus estancias en México, país que visitaba con frecuencia, a mediados de los años cincuenta. Tristessa, en la traducción de Jorge García- Robles, especialista en la generación beat, es el relato de la extraña relación amorosa que tuvo con Esperanza, así como la significativa descripción del ambiente que la rodeaba, en la que aparecen retratos de algunos lugares clave de la Ciudad de México: Plaza Garibaldi, Niño Perdido, la colonia Roma. Escritor «al rojo vivo», como lo calificó Henry Miller, héroe de la generación beat, creador de un modelo de vida que seguirían miles de jóvenes en todo el mundo, místico sui géneris, Tristessa, que hasta hace poco no se conocía en español y que se publicó en inglés apenas hace diez años, es una de sus obras más frescas y mejor logradas.",
  "genres": [
    "Fiction",
    "Classics",
    "Literature",
    "American",
    "Novels",
    "Novella",
    "Romance"
  ],
  "author": "Jack Kerouac",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/19647.Tristessa"
}