{
  "title": "Legacy of the Force: Invincible",
  "description": "No war can last forever. Now, in the long and punishing battle between the defiant champions of the New Jedi Order and the juggernaut that is the Galactic Alliance, the endgame is finally at hand. With so much lost–and nothing less than the course of the future still at stake–there can be no turning back. No matter the consequences.The rebel cause is losing ground under the twin blows of Admiral Gilad Pellaeon’s assassination and the death of Mara Jade Skywalker. At the same time, having gained the support of the Imperial Remnant and its ruthlessly efficient forces, the Galactic Alliance, with the extraordinary power and dark brilliance of newly ascendant Sith Lord Darth Caedus at its helm, may be unstoppable. Tormented and torn between the call of duty and the thirst for vengeance, Luke has searched the Force and beheld an unspeakable vision of the galaxy enslaved under tyranny more monstrous than even Palpatine’s. Now it seems that the last, best hope lies in mobilizing the scattered Jedi for one decisive search-and-destroy mission. The objective: eliminate Darth Caedus. It’s a plan that will be as difficult and dangerous to execute as it is daring. For Caedus is a scion of both the Skywalker and Solo bloodlines whose command of the Force surpasses even that of his grandfatherDarth Vader. There is only one who is bound by destiny to stand against him in what will surely be a duel to the death, only one with an outside chance of bringing down the dark lord who was once Jacen Solo.Failure is not an option. The furious final moments between power and peace are here, and whoever confronts Darth Caedus will decide the outcome–and the fate of those left standing.",
  "genres": [
    "Star Wars",
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Space Opera",
    "Science Fiction Fantasy",
    "War"
  ],
  "author": "Troy Denning",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1962427.Legacy_of_the_Force"
}