{
  "title": "Paul Marchand, F.M.C.",
  "description": "Evoking the atmosphere of early-nineteenth-century New Orleans and the deadly aftermath of the San Domingo slave revolution, this historical novel begins as its protagonist puzzles over the seemingly prophetic dream of an aged black praline seller in the famous Place d'Armes. Paul Marchand, a free man of color living in New Orleans in the 1820s, is despised by white society for being a quadroon, yet he is a proud, wealthy, well-educated man. In this city where great wealth and great poverty exist side by side, the richest Creole in town lies dying. The family of the aged Pierre Beaurepas eagerly, indeed greedily, awaits disposition of his wealth. As the bombshell of Beaurepas's will explodes, an old woman's dream takes on new meaning, and Marchand is drawn ever more closely into contact with a violently racist family. Bringing to life the entwined racial cultures of New Orleans society, Charles Chesnutt not only writes an exciting tale of adventure and mystery but also makes a provocative comment on the nature of racial identity, self-worth, and family loyalty.Although he was the first African-American writer of fiction to gain acceptance by America's white literary establishment, Charles W. Chesnutt (1858-1932) has been eclipsed in popularity by other writers who later rose to prominence during the Harlem Renaissance. Recently, this pathbreaking American writer has been receiving an increasing amount of attention. Two of his novels, Paul Marchand, F.M.C. (completed in 1921) and The Quarry (completed in 1928), were considered too incendiary to be published during Chesnutt's lifetime. Their publication now provides us not only the opportunity to read these two books previously missing from Chesnutt's oeuvre but also the chance to appreciate better the intellectual progress of this literary pioneer. Chesnutt was the author of many other works, including The Conjure Woman & Other Conjure Tales, The House Behind the Cedars, The Marrow Tradition, and Mandy Oxendine. Princeton University Press recently published To Be an Letters of Charles W. Chesnutt, 1889-1905 (edited by Joseph R. McElrath, Jr., and Robert C. Leitz, III).Originally published in 1999.The Princeton Legacy Library uses the latest print-on-demand technology to again make available previously out-of-print books from the distinguished backlist of Princeton University Press. These editions preserve the original texts of these important books while presenting them in durable paperback and hardcover editions. The goal of the Princeton Legacy Library is to vastly increase access to the rich scholarly heritage found in the thousands of books published by Princeton University Press since its founding in 1905.",
  "genres": [
    "Fiction",
    "African American"
  ],
  "author": "Charles W. Chesnutt",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/1109979.Paul_Marchand_F_M_C_"
}