{
  "title": "Becoming a Tiger: How Baby Animals Learn to Live in the Wild",
  "description": "It's a jungle out there. And survival is never a given. Somehow, a blind, defenseless tiger kitten must evolve into a deadly, efficient predator; a chimp must learn to distinguish edible plants from lethal poisons; a baby buffalo must be able to pick its mother out of a herd of hundreds. Contrary to common belief, not everything is \"hardwired\" -- or instinctual -- in the animal kingdom. Many skills a wild animal needs to thrive, to grow, to be what nature intended, must be developed through play, painstaking teaching, and often treacherous trial and error. The coming-of-age processes of the myriad creatures of plain, forest, ocean, and jungle are truly fascinating and often astonishing natural events. In Becoming a Tiger , Susan McCarthy, co-author of the critically acclaimed New York Times bestseller When Elephants Weep , offers readers an in-depth look into the amazing ways baby animals learn not only about themselves, but about their world and ours -- and how to survive in both. Based on extensive scientific research done in the lab, in controlled \"natural\" settings, as well as in the wild, her findings provide stunning new insights into the lives and development of Earth's nonhuman inhabitants -- not only tigers, but lions, bears, bats, rats, birds, dolphins, whales, apes, elephants, and dozens of other species. Sharing stories and discoveries at once captivating, funny, breathtaking, provocative, and heartwarming, Susan McCarthy carries us on a remarkable journey into untamed places, immersing us in the fascinating, complex, and hitherto unimagined societies and cultures of the beasts and birds. Along the way she shines a brilliant new light on subjects scientists, biologists, and zoologists have only begun to explore, revealing startling truths about the behavior, and sometimes humanlike foibles, of creatures great and small. Warm, informative, and beautifully written, Becoming a Tiger is an enthralling reading experience for animal lovers everywhere. In the transformation tales of playful pups, big-footed cubs, and scrawny chicks becoming deadly hunters, able foragers, and deft nest-builders are valuable and enriching life lessons for members of our own inquisitive, ever-developing species.",
  "genres": [
    "Animals",
    "Nonfiction",
    "Science",
    "Nature",
    "Wildlife",
    "Adult"
  ],
  "author": "Susan McCarthy",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/1964157.Becoming_a_Tiger"
}