{
  "title": "This Is Not Chick Lit: Original Stories by America's Best Women Writers",
  "description": "Chick A genre of fiction that often recycles the following Girl in big city desperately searches for Mr. Right in between dieting and shopping for shoes. Girl gets dumped (sometimes repeatedly). Girl finds Prince Charming.This Is Not Chick Lit is a celebration of America’s most dynamic literary voices, as well as a much needed reminder that, for every stock protagonist with a designer handbag and three boyfriends, there is a woman writer pushing the envelope of literary fiction with imagination, humor, and depth.The original short stories in this collection touch on some of the same themes as chick lit–the search for love and identity–but they do so with extraordinary power, creativity, and range; they are also political, provocative, and, at turns, utterly surprising. Featuring marquee names as well as burgeoning talents, This Is Not Chick Lit will nourish your heart, and your mind.Including these original “The Thing Around Your Neck” by Chimamanda Ngozi Adichie“Two Days” by Aimee Bender“An Open Letter to Doctor X” by Francine Prose“Gabe” by Holiday Reinhorn“Documents of Passion Love” by Carolyn Ferrell“Volunteers Are Shining Stars” by Curtis Sittenfeld“Selling the General” by Jennifer Egan“The Seventy-two-Ounce Steak Challenge” by Dika Lam“Love Machine” by Samantha Hunt“Ava Bean” by Jennifer S. Davis“Embrace” by Roxana Robinson“The Epiphany Branch” by Mary Gordon“Joan, Jeanne, La Pucelle, Maid of Orléans” by Judy Budnitz“Gabriella, My Heart” by Cristina Henríquez“The Red Coat” by Caitlin Macy“The Matthew Effect” by Binnie Kirshenbaum“The Recipe” by Lynne Tillman“Meaning of Ends” by Martha WittPraise for This Is Not Chick Lit“ This Is Not Chick Lit is important not only for its content, but for its title. I’ll know we’re getting somewhere when equally talented male writers feel they have to separate themselves from the endless stream of fiction glorifying war, hunting and sports by naming an anthology This Is Not a Guy Thing.” —Gloria Steinem“These voices, diverse and almost eerily resonant, offer us a refreshing breath of womanhood-untamed, ungroomed, and unglossed.” — Elle",
  "genres": [
    "Short Stories",
    "Fiction",
    "Feminism",
    "Anthologies",
    "Literary Fiction",
    "Contemporary",
    "Essays"
  ],
  "author": "Elizabeth Merrick",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/19625.This_Is_Not_Chick_Lit"
}