{
  "title": "Nebula Award Stories 2",
  "description": "These stories, first published in 1966, represent an exciting and important time in the history of science fiction -- the era when SF became true literature. Editors for this volume are BRIAN W. ALDISS and HARRY HARRISON. ALDISS is a prolific award-winning author of over two dozen novels, hundreds of short stories, several critical works, and poetry. His latest novels are THE TWINKLING OF AN OR MY LIFE AS AN ENGLISHMAN and SUPERTOYS. The multiple award-winning author of dozens of novels of speculative fiction, HARRISON is best known for The Stainless Steel Rat series, MAKE ROOM! MAKE ROOM! (the basis for the film SOYLENT GREEN), and the alternate history novels STARS & STRIPES FOREVER and STARS & STRIPES IN PERIL. He lives in Ireland. The Secret Place by Richard McKenna - \"[A} sensitive piece of writing, a perfect example of second generation science fiction, the retelling and reexamination of a theme that originated in the pulp years...\" Light of Other Days by Bob Shaw - The memorable classic featuring \"slow glass\" through which light takes a very long time to travel. Who Needs Insurance? by Robin S. Scott - If one can be accident prone, then perhaps one can be \"safety-prone\" -- but why? Among the Hairy Earthmen by R.A. Lafferty - Earth is nothing more than a bloody playground for the children of the gods. The Last Castle by Jack Vance - A prime example of one of Vance's \"haunting mood-possessed visions of the distant future, written in a style that stirs the reader to reaction and response.\" Day Million by Frederik Pohl - A very short story \"jewel-like conciseness\" of future love, life, and romance. When I Was Miss Dow by Sonya Dorman - \"[A] sense of strangeness, more than a bit of human warmth, as well as a good strong whiff of alien strangeness.\" Call Him Lord by Gordon R. Dickson - Earth proves to be a testing ground for the son of an emperor of a hundred worlds. In the Imagicon by George Henry Smith - \"What good was paradise without something to compare it to? Without a taste of hell from time to time, how could a man appreciate heaven?\" We Can Remember It For You Wholesale by Philip K. Dick - Now better know as the story on which film Total Recall was based, the original is a far more subtle questioning of reality. Man In His Time by Brian W. Aldiss - The sole survivor of crash landing on Mars returns to Earth, but is 3.3077 minutes ahead of the rest of the world.",
  "genres": [
    "Science Fiction",
    "Anthologies",
    "Short Stories",
    "Fiction",
    "Speculative Fiction",
    "Fantasy"
  ],
  "author": "Brian W. Aldiss",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/1964669.Nebula_Award_Stories_2"
}