{
  "title": "The Pilgrims",
  "description": "Eric Albright is a twenty-six-year-old journalist living in London. That is to say he would be a journalist if he got off his backside. But this luckless slacker isn’t all bad—he has a soft spot for his sometimes friend Stuart Casey, the homeless old drunk who mostly lives under the railway bridge near his flat. Eric is willing to let his life just drift by…until the day a small red door appears on the graffiti-covered wall of the bridge, and a gang of strange-looking people—Eric's pretty sure one of them is a giant—dash out of the door and rob the nearby newsagent. From that day on Eric and Case haunt the arch, waiting for the door to reappear.When it does, both Eric and Case choose to go through…to the land of Levaal. A place where a mountain-sized dragon with the powers of a god lies sleeping beneath a great white castle. In the castle the sinister Lord Vous rules with an iron fist, and the Project, designed to effect his transformation into an immortal spirit, nears completion. But Vous's growing madness is close to consuming him, together with his fear of an imaginary being named Shadow. And soon Eric may lend substance to that fear. An impossibly vast wall divides Levall, and no one has ever seen what lies beyond. Eric and Casey are called Pilgrims, and may have powers that no one in either world yet understands, and soon the wall may be broken. What will enter from the other side?Pilgrims is no ordinary alternate-world fantasy; with this first volume in The Pendulum Trilogy, Will Elliott's brilliantly subversive imagination twists the conventions of the alternate-world fantasy genre, providing an unforgettable visionary experience.At the publisher's request, this title is being sold without Digital Rights Management software (DRM) applied.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Dragons",
    "Science Fiction",
    "Epic Fantasy",
    "Horror"
  ],
  "author": "Will Elliott",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/19628407-the-pilgrims"
}