{
  "title": "The Royal Matchmaking Competition: Princess Zoyechka",
  "description": "Can be read as the FIRST IN THE SERIESA laugh out loud hilarious romantic comedy.\nRecipe for finding a husband:\n1)Take suitors on dangerous gryphon rides—and test their willingness to stick around longer.2) Spy on the bachelors—to discover their true natures.3) Let the suitors viciously fight over you—until you hopelessly fall in love with one.4) Mix it together until you find the best future king consort.One elven princess perpetually getting into trouble.Twelve men seeking to woo her.One suitor manipulating the events from behind the scenes.Princess Zoyechka must choose a husband from a pool of royals, nobles, elves, dwarves, and commoners, all of whom endure daily competitions to win dates … and the chance to become the Supreme King of Velazia. But things go awry when one bachelor proves to be a spy trying to steal the Crown’s secrets. The problem is, Zoyechka doesn't know who the culprit is—so how can she avoid choosing him as her husband?Warning: if you like gryphon-riding princesses, light fantasy worlds, a pinch of humor, a dash of romance, and a smidgen of mystery, this fairy tale mixture might be for you. Side effects of reading might include: hoping the book will never end, getting lost in the pages, and wishing you lived in an alternate reality with suitors vying for your attention. Read at your own risk!--A clean YA romantic-comedy, light fantasy. No violence, or gore.TropesGryphon rider, princess in disguise, pirates, action & adventure, elven romance, fae romance, enemies to lovers, friends to lover, choosing one husband out of many.--Readers do not need to read book one of the series. This story starts off with fresh new characters and a few occasional returning.",
  "genres": [
    "Romance",
    "Fantasy",
    "Young Adult"
  ],
  "author": "Zoiy G. Galloay",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/196541861-the-royal-matchmaking-competition"
}