{
  "title": "Classics of American Literature",
  "description": "84 lectures | 31 minutes each 1 Introduction to Classics of American Literature 2 Benjamin Franklin's Autobiography 3 Washington Irving 4 Ralph Waldo Emerson Yesterday 5 Emerson Today 6 Emerson Tomorrow 7 Henry David Thoreau 8 Thoreau 9 Walden 10 Edgar Allan Poe 11 Poe 12 Poe's Legacy 13 Nathaniel Hawthorne 14 The Scarlet Letter 15 Hawthorne's “A 16 The Scarlet Letter 17 Hawthorne Our Contemporary 18 Herman Melville 19 Biggest Fish Story 20 Ahab and the White Whale 21 Moby-Dick 22 Melville's “Benito Cereno” 23 “Benito Cereno” 24 Walt Whitman 25 Whitman 26 Whitman 27 Whitman—Poet of Death 28 The Whitman Legacy 29 Uncle Tom's Cabin 30 Stowe's Representation of Slavery 31 Uncle Tom's Cabin 32 Emily Dickinson 33 Dickinson's Poetry 34 Dickinson 35 Dickinson 36 Dickinson's Legacy 37 Adventures of Tom Sawyer 38 Huckleberry Finn 39 Huckleberry Finn 40 Huckleberry Finn 41 Mark Twain's Pudd'nhead Wilson 42 Henry James 43 The Turn of the Screw 44 The Screw of Interpretation 45 Stephen Crane 46 Red Badge of Courage 47 Stephen Crane 48 Charlotte Perkins Gilman 49 “The Yellow Wallpaper” 50 Robert Frost 51 Robert Frost 52 Robert Frost 53 T.S. Eliot 54 T.S. Eliot 55 F. Scott Fitzgerald 56 The Great Gatsby 57 Fitzgerald's Triumph 58 Ernest Hemingway's The Sun Also Rises 59 Sun Also Rises 60 Ernest Hemingway 61 Hemingway's The Garden of Eden 62 The Garden of Eden 63 William Faulkner's Sound and Fury 64 Sound and the Fury 65 Sound and the Fury 66 Absalom, Absalom! 67 Absalom, Absalom! 68 Absalom, Absalom! 69 The Grapes of Wrath 70 John Steinbeck 71 The Grapes of Wrath 72 Invisible Man 73 Invisible Man 74 Invisible Man 75 Eugene O'Neill 76 Long Day's Journey Into Night—There's No Place Like Home 77 Tennessee Williams 78 A Streetcar Named Desire 79 Death of a Salesman—Death of an Ethos? 80 Death of a Salesman 81 Toni Morrison's Beloved 82 Beloved— “Thick Love” 83 Beloved—Morrison's Writing 84 Conclusion",
  "genres": [
    "Nonfiction",
    "Literature",
    "Audiobook",
    "Classics",
    "Books About Books",
    "History",
    "Literary Criticism"
  ],
  "author": "Arnold Weinstein",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/1966702.Classics_of_American_Literature"
}