{
  "title": "An Unfinished Love Story: A Personal History of the 1960s",
  "description": "An Unfinished Love A Personal History of the 1960s by Doris Kearns Goodwin, one of America’s most beloved historians, artfully weaves together biography, memoir, and history. She takes you along on the emotional journey she and her husband, Richard (Dick) Goodwin embarked upon in the last years of his life.Dick and Doris Goodwin were married for forty-two years and married to American history even longer. In his twenties, Dick was one of the brilliant young men of John F. Kennedy’s New Frontier. In his thirties he both named and helped design Lyndon Johnson’s Great Society and was a speechwriter and close advisor to Robert Kennedy. Doris Kearns was a twenty-four-year-old graduate student when selected as a White House Fellow. She worked directly for Lyndon Johnson and later assisted on his memoir.Over the years, with humor, anger, frustration, and in the end, a growing understanding, Dick and Doris had argued over the achievements and failings of the leaders they served and observed, debating the progress and unfinished promises of the country they both loved.The Goodwins’ last great adventure involved finally opening the more than three hundred boxes of letters, diaries, documents, and memorabilia that Dick had saved for more than fifty years. They soon realized they had before them an unparalleled personal time capsule of the 1960s, illuminating public and private moments of a decade when individuals were powered by the conviction they could make a difference; a time, like today, marked by struggles for racial and economic justice, a time when lines were drawn and loyalties tested.Their expedition gave Dick’s last years renewed purpose and determination. It gave Doris the opportunity to connect and reconnect with participants and witnesses of pivotal moments of the 1960s. And it gave them both an opportunity to make fresh assessments of the central figures of the time—John F. Kennedy, Jacqueline Kennedy, Martin Luther King Jr., Robert Kennedy, Eugene McCarthy, and especially Lyndon Johnson, who greatly impacted both their lives. The voyage of remembrance brought unexpected discoveries, forgiveness, and the renewal of old dreams, reviving the hope that the youth of today will carry forward this unfinished love story with America.",
  "genres": [
    "History",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Politics",
    "Book Club",
    "Audiobook"
  ],
  "author": "Doris Kearns Goodwin",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/196585876-an-unfinished-love-story"
}