{
  "title": "A Culture of High Performance: Achieving Higher Quality at a Lower Cost",
  "description": "For bulk order inquiries, please contact huronpublishing@hcg.com In healthcare, even the way we change has changed. Quint Studer s new book helps you hardwire the skills you need to perform at a higher level continuously. Our industry has always dealt with change. But the environment we re navigating now requires change at a whole different level. We ve moved from experiencing episodic change to continuous change and as John Kotter has famously noted, that requires a whole different set of skills and a whole different level of urgency. In his new book A Culture of High Achieving Higher Quality at a Lower Cost , thought leader Quint Studer explains how to leverage the powerful values that have always defined healthcare people passion, fortitude, willingness to learn to meet the challenges of our disruptive external environment. Writing in his trademark conversational style, he lays out the framework, principles, processes and tactics that hardwire excellence in your organization all the while growing a culture of consistent reliable execution that drives quality higher and higher (and higher!) as it controls costs. The book A look at the latest research that validates which behaviors and practices truly work The framework and core principles that lay the foundation for dramatic culture change A simple seven-step model that helps you diagnose shortfalls, develop a treatment plan and hardwire the systems that drive performance Why transparency and straight communication build trust and foster engagement How to create and cascade a clear set of objective, weighted, aligned goals that break down silos and hold people accountable for achieving outcomes A method for ensuring that leaders get the training and development they need High-impact tactics that get behavior and processes aligned across your organization The phases of change you can expect and how to help people navigate them How to connect with head people and heart people (most of us are a blend of both) as you seek to drive change A Culture of High Performance is the perfect companion to Studer s bestselling classic Hardwiring Excellence . Packed with new research and fresh insights all brought to life with humorous, thought-provoking and inspiring stories this book is a must have for any leader struggling to shore up margins while sustaining an organization that s a great place for employees to work, physicians to practice medicine and patients to receive care.",
  "genres": [
    "Leadership"
  ],
  "author": "Quint Studer",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/19664261-a-culture-of-high-performance"
}