{
  "title": "The Hazelbourne Ladies Motorcycle and Flying Club",
  "description": "A timeless comedy of manners—refreshing as a summer breeze and bracing as the British seaside—about a generation of young women facing the seismic changes brought on by war and dreaming of the boundless possibilities of their future, from the bestselling author of Major Pettigrew's Last StandIt is the summer of 1919 and Constance Haverhill is without prospects. Now that all the men have returned from the front, she has been asked to give up her cottage and her job at the estate she helped run during the war. While she looks for a position as a bookkeeper or—horror—a governess, she’s sent as a lady’s companion to an old family friend who is convalescing at a seaside hotel. Despite having only weeks to find a permanent home, Constance is swept up in the social whirl of Hazelbourne-on-Sea after she rescues the local baronet’s daughter, Poppy Wirrall, from a social faux pas.Poppy wears trousers, operates a taxi and delivery service to employ local women, and runs a ladies’ motorcycle club (to which she plans to add flying lessons). She and her friends enthusiastically welcome Constance into their circle. And then there is Harris, Poppy’s recalcitrant but handsome brother—a fighter pilot recently wounded in battle—who warms in Constance’s presence. But things are more complicated than they seem in this sunny pocket of English high society. As the country prepares to celebrate its hard-won peace, Constance and the women of the club are forced to confront the fact that the freedoms they gained during the war are being revoked.Whip-smart and utterly transportive, The Hazelbourne Ladies Motorcycle and Flying Club is historical fiction of the highest order: an unforgettable coming-of-age story, a tender romance, and a portrait of a nation on the brink of change.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Romance",
    "Audiobook",
    "British Literature",
    "Book Club"
  ],
  "author": "Helen Simonson",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/196845474-the-hazelbourne-ladies-motorcycle-and-flying-club"
}