{
  "title": "The Golden Dawn: The Original Account of the Teachings, Rites, and Ceremonies of the Hermetic Order",
  "description": "The Golden Dawn by Israel Regardie is considered by many to be the book that started the modern occult movement. The original Hermetic Order of the Golden Dawn, which started in the late 1800s, borrowed from a wide variety of occult traditions รณ Kabalah, Tarot, Geomancy, Enochian Magic, Theosophy, Freemasonry, Paganism, Astrology, and many more รณ and created a unique and viable system of magic that is still being practiced today. Almost every contemporary occult writer and modern group has been influenced, directly or indirectly, by the Order or its members, making The Golden Dawn one of the most influential occult books of the past 100 years.The book is divided into several basic sections. First are the knowledge lectures, where you will learn the basics of the Kabalah, symbolism, meditation, geomancy and more. This is followed by the rituals of the Outer Order, consisting of five initiation rituals into the degrees of the Golden Dawn.The next section covers the rituals of the Inner Order including two initiation rituals, equinox ceremonies, and more. Then you will learn the basic rituals of magic and the construction, consecration, and means of using the magical tools. Once you have these you can go on to evocation rituals, talismans, and invocations.The book gives explanations for how to design talismans, do skrying and travel on the astral plane. You will also learn geomancy, the Tarot, and Enochian magic.Filled with numerous illustrations, lists, and tables, The Golden Dawn provides guidance for a lifetime of magic and life-changing transformation. Get your copy today.",
  "genres": [
    "Occult",
    "Magick",
    "Spirituality",
    "Nonfiction",
    "Religion",
    "Esoterica",
    "Philosophy"
  ],
  "author": "Israel Regardie",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/111009.The_Golden_Dawn"
}