{
  "title": "The Light Eaters: How the Unseen World of Plant Intelligence Offers a New Understanding of Life on Earth",
  "description": "Award-winning environment and science reporter Zoë Schlanger delivers a groundbreaking work of popular science that probes the hidden world of the plant kingdom and reveals the astonishing capabilities of the green life all around us. It takes tremendous biological creativity to be a plant. To survive and thrive while rooted in a single spot, plants have adapted ingenious methods of survival. In recent years, scientists have learned about their ability to communicate, recognize their kin and behave socially, hear sounds, morph their bodies to blend into their surroundings, store useful memories that inform their life cycle, and trick animals into behaving to their benefit, to name just a few remarkable talents.The Light Eaters is a deep immersion into the drama of green life and the complexity of this wild and awe-inspiring world that challenges our very understanding of agency, consciousness, and intelligence. In looking closely, we see that plants, rather than imitate human intelligence, have perhaps formed a parallel system. What is intelligent life if not a vine that grows leaves to blend into the shrub on which it climbs, a flower that shapes its bloom to fit exactly the beak of its pollinator, a pea seedling that can hear water flowing and make its way toward it? Zoë Schlanger takes us across the globe, digging into her own memories and into the soil with the scientists who have spent their waking days studying these amazing entities up close.What can we learn about life on Earth from the living things that thrive, adapt, consume, and accommodate simultaneously? More important, what do we owe these life forms once we come to understand their rich and varied abilities? Examining the latest epiphanies in botanical research, Schlanger spotlights the intellectual struggles among the researchers conceiving a wholly new view of their subject, offering a glimpse of a field in turmoil as plant scientists debate the tenets of ongoing discoveries and how they influence our understanding of what a plant is.We need plants to survive. But what do they need us for—if at all? An eye-opening and informative look at the ecosystem we live in, this book challenges us to rethink the role of plants—and our own place—in the natural world.",
  "genres": [
    "Nonfiction",
    "Science",
    "Nature",
    "Biology",
    "Plants",
    "Audiobook",
    "Environment"
  ],
  "author": "Zoë Schlanger",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/196774338-the-light-eaters"
}