{
  "title": "Fire On The Ganges: Life Among the Dead in Banaras",
  "description": "'In the land of the dead, there is life all around.'Banaras, Uttar Pradesh. A place where life and death co-exist in the most unimaginable way. The Doms are a Dalit sub-caste in Banaras designated by tradition to perform the Hindu rite of cremation. They have ownership of the sacred fire without which, it is believed, the Hindu soul will not achieve liberation from the cycle of death and rebirth. Despite this, the community is condemned to the lowest order in caste hierarchy, and its members continue to be treated as 'untouchables'. Fire on the Ganges is the first attempt to chronicle the everyday realities of the Doms. It plunges into Banaras's historical past, while narrowing its lens to a few spirited characters from the Dom community. Through their tales of struggle and survival, loss and ambition, betrayal and love, it tells the at-times-heartbreaking, at-times-exhilarating story of a community struggling to find a place beyond that accorded to it by ancient tradition. --- 'A book of humanity and intimacy, hope and resilience, Radhika Iyengar has chronicled that which is often overlooked -- the enduring power of the voice. This is oral history at its finest.'-- AANCHAL MALHOTRA (author of Remnants of a Separation)'Vividly told and richly detailed, Radhika Iyengar's Fire on the Ganges is an untold story that will shape our collective understanding of India.' -- SONIA FALEIRO (author of The Good Girls)'At once sobering and enlivening, Fire on the Ganges is a compelling account of how the Doms both contribute to, and are overlooked by, a \"new India\" that has lost its lustre. Radhika Iyengar makes her subject spring to life through her eye for detail and her immersion in the world she's writing of.' -- AMIT CHAUDHURI (author of Sojourn)'By observing their world with a keen, unflinching eye, Radhika Iyengar is able to render the lives of her subjects with compassion and insight while delivering a story that is both uplifting and heartbreaking. Fire on the Ganges is the work of a first-rate reporter and a gifted writer, whose narrative moves like the river, slow and deep, to the ancient rhythms of Indian life.'-- DON BELT (Former Senior Editor, National Geographic Magazine)'You might think of Manikarnika as a place for the dead. Th­is fine book is a reminder that the burning ghats are a place for the living.' -- AMITAVA KUMAR (author of The Blue Book)'With admirable elegance and empathy, Radhika Iyengar tells stories of a community that has not been spared caste prejudice despite its traditional \"prerogative\" of cremating Hindus at the most auspicious ghats along the Ganga.' -- MANOJ MITTA (author of Caste Pride)'A worthy illustration of show-don't-tell, Fire on the Ganges leaves you both hopeful and anxious about the possibilities of breaking through the barriers imposed by the caste system for those who are placed at its very bottom...Iyengar's work stands out for its dogged curiosity and immersive storytelling.' -- SNIGDHA POONAM (author of Dreamers)'With the narrative drive of a novel, this is a non-fiction book that illuminates a profession, a tradition and a society. An absolutely fascinating read!'-- TABISH KHAIR (author of The Body by the Shore)‘Deeply alarming and yet never alarmist, Radhika Iyengar’s Fire on the Ganges is essential reading—wise, sensitive and unsettling.’-- DAVID HAJDU (author of A Revolution in Three Acts)'Deeply-reported, thoroughly-researched, with writing that leaves your skin cold, Fire on the Ganges is a book about the hum of life arranged around death.'-- MANSI CHOKSI (author of The Newlyweds)",
  "genres": [
    "Nonfiction",
    "India"
  ],
  "author": "Radhika  Iyengar",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/196797761-fire-on-the-ganges"
}