{
  "title": "Tell Me Where It Hurts: A Day of Humor, Healing, and Hope in My Life as an Animal Surgeon",
  "description": "It’s 2:47 a.m. when Dr. Nick Trout takes the phone call that starts another hectic day at the Angell Animal Medical Center. Sage, a ten-year old German shepherd, will die without emergency surgery for a serious stomach condition. Over the next twenty-four hours Dr. Trout fights for Sage’s life, battles disease in the operating room, unravels tricky diagnoses, reassures frantic pet parents, and reflects on the humor, heartache, and inspiration in his life as an animal surgeon. And he wants to take you along for the ride.…From the front lines of modern medicine, Tell Me Where It Hurts is a fascinating insider portrait of a veterinarian, his furry patients, and the blend of old-fashioned instincts and cutting-edge technology that defines pet care in the twenty-first century. For anyone who’s ever wondered what goes on behind the scenes at your veterinarian’s office, Tell Me Where It Hurts offers a vicarious journey through twenty-four intimate, eye-opening, heartrending hours at the premier Angell Animal Medical Center in Boston.You’ll learn about the amazing progress of modern animal medicine, where organ transplants, joint replacements, and state-of-the-art cancer treatments have become more and more common. With these technological advances come controversies and complexities that Dr. Trout thoughtfully explores, such as how long (and at what cost) treatments should be given, how the Internet has changed pet care, and the rise in cosmetic surgery.You’ll also be inspired by the heartwarming stories of struggle and survival filling these pages. With a wry and winning tone, Dr. Trout offers up hilarious and delightful anecdotes about cuddly (or not-so-cuddly) pets and their variously zany, desperate, and demanding owners. In total, Tell Me Where It Hurts offers a fascinating portrait of the comedy and drama, complexities and rewards involved with loving and healing animals.Part ER , part Dog Whisperer , and part House , this heartfelt and candid book shows that while the technology has changed since James Herriot’s day, the humanity and compassion remains unchanged. If you’ve ever had a pet or special place in your heart for furry friends, Dr. Trout’s irresistible book is for you.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Memoir",
    "Dogs",
    "Biography",
    "Medical",
    "Audiobook"
  ],
  "author": "Nick Trout",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/1967737.Tell_Me_Where_It_Hurts"
}