{
  "title": "Can't Help Falling",
  "description": "Sometimes all it takes to start a fire is a single match. . .Owen Larrabee is not my soulmate.He wasn't when I confessed my love to him on his wedding day, and he isn't now. I should probably say that I wasn't the bride when that happened. I don't have the best timing.He’s got a temper, he's moody, and he has a history of being misunderstood and making big mistakes.I, on the other hand, make pumpkin cupcakes, spend my Friday nights curled up with a beloved romance novel and long to be kissed in the rain.Owen is my best friend’s older, off-limits brother and the only boy I ever thought I loved. Which is laughable because he only ever saw me as his kid sister’s dorky friend.But that was a long time ago. And I’m over him.Mostly.Until he comes back to Harvest Hollow like some kind of hero, showing up just in time to pull me out of my burning house and make me feel all the things I told myself I’d never feel again.But I have questions. Why is Owen back? And does he remember our secret friendship or the day I’ve spent the last eight years trying to forget?I know better than to get hung up on Owen again. Especially now, when he’s sworn off relationships and thinks romance is a farce. And I’m something of an expert—at least to the people who listen to my podcast, The Hopeful Romantic.Never mind that nobody would guess their local bookshop owner is the one doling out popular weekly relationship advice.Never mind that I’m basing all that advice on the hundreds, (thousands?) of romance novels I’ve read over the years and not on personal experience.And especially never mind that Owen is making me question everything I believe about all of it.",
  "genres": [
    "Romance",
    "Contemporary",
    "Clean Romance",
    "Fiction",
    "Contemporary Romance",
    "Friends To Lovers",
    "Second Chance"
  ],
  "author": "Courtney Walsh",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/196917213-can-t-help-falling"
}