{
  "title": "The World in a City: Traveling the Globe Through the Neighborhoods of the New New York",
  "description": "“The whole world can be found in this city. . . .”–from the PrefaceFifty years ago, New York City had only a handful of ethnic groups. Today, the whole world can be found within the city’s five boroughs–and celebrated New York Times reporter Joseph Berger sets out to discover it, bringing alive the sights, smells, tastes, and people of the globe while taking readers on an intimate tour of the world’s most cosmopolitan city.For urban enthusiasts and armchair explorers alike, The World in a City is a look at today’s polyglot and polychrome, cosmopolitan and culturally rich New York and the lessons it holds for the rest of the United States as immigration changes the face of the nation. With three out of five of the city’s residents either foreign-born or second-generation Americans, New York has become more than ever a collection of villages–virtually self-reliant hamlets, each exquisitely textured by its particular ethnicities, history, and politics. For the price of a subway ride, you can visit Ghana, the Philippines, Ecuador, Uzbekistan, and Bangladesh.As Berger shows us in this absorbing and enlightening tour, New York is an endlessly fascinating crossroads. Naturally, tears exist in this colorful social the controversy over Korean-language shop signs in tony Douglaston, Queens; the uneasy proximity of traditional cottages and new McMansions built by recently arrived Russian residents of Manhattan Beach, Brooklyn. Yet in spite of the tensions among neighbors, what Berger has found most miraculous about New York is how the city and its more than eight million denizens can adapt to–and even embrace–change like no other place on earth, from the former pushcart knish vendor on the Lower East Side who now caters to his customers via the Internet, to the recent émigrés from former Soviet republics to Brooklyn’s Brighton Beach and Midwood whose arrival saved New York’s furrier trade from certain extinction.Like the place it chronicles, The World in a City is an engaging hybrid. Blending elements of sociology, pop culture, and travel writing, this is the rare book that enlightens readers while imbuing them with the hope that even in this increasingly fractious and polarized world, we can indeed co-exist in harmony.",
  "genres": [
    "Travel",
    "New York",
    "Nonfiction",
    "History",
    "Cultural"
  ],
  "author": "Joseph Berger",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/1968030.The_World_in_a_City"
}