{
  "title": "From Thunder to Breakfast",
  "description": "This book was written by Gene K. Garrison about Hube Yates, which, for the purposes of \"From Thunder to Breakfast,\" took place when Hube was an excited 11-year-old ranch boy living in Guthrie, Oklahoma. The family of nine made the arduous and adventure-packed journey to Phoenix, Arizona in two covered wagons. The year was 1914. Yates eventually became a Phoenix fireman, horseman, part-time minister, hunting guide and dude wrangler. His experiences, from the hilarious to the heroic, lasted into his seventies, and so did his special gift for charming an audience. He had a great memory for detail, and described his adventures in a warm, down-to-earth style, full of image-rich phrases. A middle-aged cowboy was \"all silver around the ears. He had gray-blue eyes as clear as crystal. He also looked like the kind of guy you'd like to have on your side if you had any trouble.\" Although this sounds as though it's a man's book, Western style, reviewers, especially of the feminine gender, also see Yates' gentle, tender, caring side. True, he saved lives and won the Carnegie Hero's Medal for a dangerous exploit, but his sensitive, caring nature was disengaged only when he was going through a practical-joke period. Hugh Downs wrote the foreword to this book. He said, in part, that Yates \"is able to relate the simplest event with uncontrived humor that is simultaneously subtle and powerfully funny. \" He didn't overlook Yates' character, adding, \"Every subject or event that intersects his life, every experience he files in his almost computer-like memory is stamped with the grace of an outlook that is humane and helpful, devoid of self-centeredness or bitterness, and amused by most of the cosmic panorama.\" Even though Hube Yates was a Southwesterner of the highest order, a man we should try to emulate, people were drawn to him because they loved to listen to him talk. Listening to him via the pages of \"From Thunder to Breakfast\" is the next best thing. Author Gene K. Garrison was careful to catch his speech patterns and colloquialisms. People who knew him can hear him talk when they read this book.",
  "genres": [],
  "author": "Gene K. Garrison",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/1968064.From_Thunder_to_Breakfast"
}