{
  "title": "Oye",
  "description": "A coming-of-age comedy. A telenovela-worthy drama. A moving family saga. All in a phone call you won’t want to hang up on…A young woman reckons with her rowdy, unpredictable family and the revelation of their long-buried history in this wildly inventive debut.“Yes, hi, Mari. It’s me. I’m over my tantrum and finally calling you back. But you have to promise that you won’t say anything to Mom or Abue about this, okay? They’ll set the house on fire if they find out…”Luciana is the baby of her large Colombian American family. And despite usually being relegated to the sidelines, she now finds herself the voice of reason in the middle of their unexpected crisis. Her older sister, Mari, is away at college and reduced to a mere listening ear on the other end of their many phone calls, so when South Florida residents are ordered to evacuate before a hurricane, it’s up to Luciana to deal with her eccentric grandmother, Abue, who’s refusing to leave. But the storm isn’t the only danger. Abue, normally glamorous and full of life, is given a crushing medical diagnosis. While she’d prefer to ignore it and focus on upholding her reputation and her looks instead, the news sets Abue on her own personal journey, with Luciana reluctantly along for the ride.When Abue moves into Luciana’s bedroom, their complicated bond only intensifies. Luciana would rather be skating or sneaking out to meet girls, but Abue’s wild demands and unpredictable antics are a welcome distraction from Luciana’s misguided mother, absent sister, and uncertain future. Forced to step into the role of caretaker, translator, and keeper of the devastating secrets that Abue begins to share, Luciana suddenly finds herself center stage, facing down adulthood—and rising to the occasion.As Luciana chronicles the events of her upended senior year over the phone, Oye feels like the most entertaining conversation you’ve ever eavesdropped a rollicking, heartfelt, and utterly unique novel by an author as original as she is insightful.",
  "genres": [
    "Fiction",
    "Contemporary",
    "LGBT",
    "Coming Of Age",
    "Audiobook",
    "Queer",
    "Literary Fiction"
  ],
  "author": "Melissa Mogollon",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/196845489-oye"
}