{
  "title": "The Wilderness of Girls",
  "description": "A finalist for the 2025 YALSA William C. Morris Award for Best Debut Novel for Teens, as well as an Indie Next Pick, Amazon Editor’s Pick, and one of Barnes & Noble’s Best Books of 2024.An unflinching YA debut about a troubled teen who discovers a pack of feral girls in the woods and is swept up in the ensuing mystery: Are the Wild Girls of Happy Valley lost princesses from a faraway land, as they believe, or are they brainwashed victims of a deranged kidnapper?In her ambitious debut perfect for fans of Sadie and The Hazel Wood, Madeline Claire Franklin crafts a gripping exploration of how the world teaches young girls to cage their wildness―and what happens when they claw themselves free.After being placed in foster care, Rhi is hungry for a fresh start and begins working at the Happy Valley Wildlife Preserve. While in the woods, she stumbles upon a surreal sight: a pack of wolves guarding four feral and majestic girls. After Rhi gains their trust, they reveal that they’re princesses from another land, raised by a magical prophet they call Mother―and they're convinced Rhi is their lost fifth sister.Unsure what to believe, Rhi ushers the girls to civilization, where they’re met with societal uproar and scrutiny, dubbed by the ravenous media and true crime junkies as “The Wild Girls of Happy Valley.” Desperate to return to their kingdom, the girls look to Rhi for help. Rhi knows the girls are deluded, but at the same time she’s drawn in by their boldness and authenticity―traits she is afraid she has lost within herself. And when Rhi witnesses strange phenomena she can’t quite explain, the line between fantasy and reality grows blurry.As the hunt for answers intensifies, Rhi must make a decision that will change the course of her life and the lives of her Wild Girls forever.Content Warnings — This book portrays, describes, or discusses in detail: Complex-PTSD, suicide and suicidal ideation, disordered eating, body shaming, family and domestic violence, emotional abuse, cannibalism, and sexual assault.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Mystery",
    "Fiction",
    "Thriller",
    "Magical Realism",
    "Mystery Thriller"
  ],
  "author": "Madeline Claire Franklin",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/196841933-the-wilderness-of-girls"
}