{
  "title": "Walking With Saint James: 31 Meditations for Pilgrims on the Camino de Santiago",
  "description": "An ancient pilgrimage, a weary sojourner, and an incredible and sacred journey through endless fields of stars. For the last thousand years, pilgrims have journeyed through Spain on the Camino de Santiago , a 500-mile pilgrimage to the Cathedral of Santiago de Compostela . Legend holds that James, the Apostle of Jesus, rests in a crypt beneath the old cathedral. Walking the dusty plains of the Meseta Central , through the shady forests of pine and eucalyptus, trekking across the windy ridgetops of the Cantábrian Mountain Range , and traversing endless fields of stars , we embark on a spiritual quest to explore the writings of Saint James. And as we walk we make friends and discover that our faith in God is evolving, growing ever deeper! In his vital, sacred, inspiring travelogue, Zebulun Mattos sets out on a spiritual and cultural odyssey that offers contemplative prayers, quiet inspiration, and lasting hope. Each devotional includes glimpses of the pilgrim's journey, tales of knights and nobles, historical anecdotes, and depictions of ecology and anthropology encountered along the way. This is where your pilgrimage begins. ¡Buen Camino! —— —— —— — This book will easily fit in a gift box, gift bag, or gift basket. It is one of the best Christian gifts for women and gifts for men who have everything! Who is Saint James? St. James the Great is the patron saint of Spain. Whether your question is “How long is the Camino de Santiago” or “Who wrote the book of James”, more questions will be answered in this historical book. It is an excellent book for Catholic daily readings and Christian daily devotionals. It is not a comparison of Catholics and Protestants. This book is for both Catholics and Christians. The Way of Saint James is an amazing pilgrimage for adventure explorers and the perfect gift for travelers. One of the wonderful messages is, “Be still and know that I am God”. Grab your walking sticks and trekking poles and go on another hiking adventure! Wie Pilger wissen, ist der Camino de Santiago eine wunderbare Reise durch Spanien. Dieses Buch ist derzeit in englischer Sprache, wird aber so bald wie möglich ins Deutsche übersetzt. Wählen Sie den Küstenweg oder den lex orandi lex credendi lex vivendi französischen Weg. Ich bin dann mal weg... Che tu completi o meno il tuo pellegrinaggio in Italia lungo la Via Francigena e ricevi il tuo Testimonium, il Cammino di Santiago in Spagna è un viaggio per tutti! Questo libro è in inglese ma sarà tradotto in italiano. O Caminho de Santiago na Espanha é uma peregrinação incrível para todos! Este livro está em inglês, mas será traduzido para o português. 스페인의 성 야고보의 길은 모두를 위한 놀라운 순례지입니다 ! 이 책은 영어로 되어 있지만 한국어로 번역될 것입니다 .",
  "genres": [],
  "author": "Zebulun Mattos",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/196794601-walking-with-saint-james"
}