{
  "title": "White Christmas-Bloody Christmas: Finally the True Story of the Lawson Family Murders of Christmas Day, 1929",
  "description": "In 1929, shortly before Christmas, Charlie Lawson took his family (37-year-old wife Fannie and their children: Arthur, 16; Marie, 17; Carrie, 12; Maybell; 7, James, 4; Raymond, 2; and Mary Lou, 4 months) into town to buy new clothes and to have a family portrait taken. As they were far from wealthy, this seemed unusual. The new clothes ultimately became burial outfits. On the 25th, he began the slaughter with his daughters, Carrie and Maybell, who were setting out to their uncle and aunt's house. Lawson waited for them by the tobacco barn; when they were in range, shot them with a shotgun, then ensured that they were dead by bludgeoning them. He then placed the bodies in the tobacco barn.Afterwards, he returned to the house and shot Fannie, who was on the porch. As soon as the gun was fired, Marie, who was inside, screamed, while the two small boys, James and Raymond, attempted to find a hiding place. Lawson shot Marie and then found and shot the two boys. Lastly, he killed the baby, Mary Lou. It is thought that she was bludgeoned to death. After the murders, he went into the nearby woods and, a few hours later, shot himself. The only survivor was his eldest son, 16 year-old Arthur, whom he had sent on an errand just before starting his deadly work. The bodies of the family members were found with their arms crossed and rocks under their heads. The gunshot signaling Charlie Lawson's own suicide was heard by the many people who already had learned of the gruesome event on the property and gathered there. A police officer who was with Arthur Lawson ran down to discover Charlie's body along with letters to his parents. As footprints encircled the tree it was supposed that he had been pacing around the tree prior to taking his life.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Christmas",
    "Crime",
    "History"
  ],
  "author": "M. Bruce Jones",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/19705071-white-christmas-bloody-christmas"
}