{
  "title": "The Life of the World to Come",
  "description": "From idea to flesh to myth, this is the story of Alec Seventh Earl of Finsbury, pirate, renegade, hero, anomaly, Mendoza's once and future love.Mendoza is a Preserver, which means that she's sent back from the twenty-fourth century by Dr. Zeus, Incorporated - the Company - to recover things from the past which would otherwise be lost. She's a botanist, a good one. She's an immortal, indestructible cyborg. And she's a woman in love.In sixteenth century England, Mendoza fell for a native, a renegade, a tall, dark, not handsome man who radiated determination and sexuality. He died a martyr's death, burned at the stake. In nineteenth century America, Mendoza fell for an eerily identical native, a renegade, a tall, dark, not handsome man who radiated determination and sexuality. When he died, she killed six men to avenge him.The Company didn't like that - bad for business. But she's immortal and indestructible, so they couldn't hurt her. Instead, they dumped her in the Back Way Back.Meanwhile, back in the future, three eccentric geniuses sit in a parlor at Oxford University and play at being the new Inklings, the heirs of C. S. Lewis and J. R. R. Tolkien. Working for Dr. Zeus, they create heroic stories and give them flesh, myths in blood and DNA to protect the future from the World to Come, the fearsome Silence that will fall on the world in 2355. They create a hero, a tall, dark, not handsome man who radiates determination and sexuality.\"Now,\" stranded 150,000 years in the past, there are no natives for Mendoza to fall in love with. She tends a garden of maize, and she pines for the man she lost, twice. For Three. Thousand. Years.Then, one day, out of the sky and out of the future comes a renegade, a timefaring pirate, a tall, dark, not handsome man who radiates determination and sexuality. This is the beginning of the end.",
  "genres": [
    "Science Fiction",
    "Time Travel",
    "Fiction",
    "Fantasy",
    "Science Fiction Fantasy",
    "Adventure",
    "Romance"
  ],
  "author": "Kage Baker",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/197041.The_Life_of_the_World_to_Come"
}