{
  "title": "Lies and Weddings",
  "description": "A forbidden affair erupts dramatically amid a decadent Hawaiian wedding in this hilarious, sophisticated, and thrillingly plotted story of love, money, murder, sex—and the lies we tell about them all. Rufus Leung Gresham, future Earl of Greshambury and son of a former Hong Kong supermodel, has a problem: his family fortune, the legendary Gresham Trust, has been depleted by decades of profligate spending. While magazine covers and Instagram stories display impeccably designed manors and shiny new yachts, the secret reality holds nothing more than a gargantuan mountain of debt. The only solution, put forth by Rufus’s scheming mother, is for Rufus to seduce a woman with money, thereby securing the family's precarious financial future.Should he marry Solène de Courcy, a French hotel heiress with honey-blond tresses and a royal bloodline? Should he pursue Martha Dung, the tattooed venture capital genius who passes out billions like lollipops? Or should he follow his heart, betray his family, squander his legacy, and finally confess his love to the literal girl next door, the humble daughter of a doctor, Eden Tong? When the Gresham family descends on the Big Island of Hawaii to host a veritable who's who of sultans, barons, and oligarchs for the wedding of the decade, Rufus must merely flex his famous abs to bewitch the heiress of his choice. But instead a hot mic exposes a secret tryst, a volcanic eruption burns through the nuptials, and the Gresham family's plans—and their reputation—go up in flames.Can the once-great earldom rise from the ashes? Or will a secret tragedy, hidden for two decades, reveal a shocking twist? Spanning the black sand beaches of Hawaii, the red city of Marrakech, the Los Angeles bachelor pad of a billionaire playboy, and the inner sanctum of England’s oldest family estate, Lies and Weddings reveals an enthralling family saga that is as scandalous and satirical as it is full of heart.",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary",
    "Audiobook",
    "Chick Lit",
    "Book Club",
    "Humor"
  ],
  "author": "Kevin Kwan",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/197144545-lies-and-weddings"
}