{
  "title": "Being Different : An Indian Challenge To Western Universalism",
  "description": "India is more than a nation state. It is also a unique civilization with philosophies and cosmologies that are markedly distinct from the dominant culture of our times – the West. India’s spiritual traditions spring from dharma which has no exact equivalent in western frameworks. Unfortunately, in the rush to celebrate the growing popularity of India on the world stage, its civilizational matrix is being digested into western universalism, thereby diluting its distinctiveness and potential.This book addresses the challenge of direct and honest engagement on differences, by reversing the gaze, repositioning India from being the observed to the observer and looking at the West from the dharmic point of view. In doing so it challenges many hitherto unexamined beliefs that both sides hold about themselves and each other. It highlights that unique historical revelations are the basis for western religions, as opposed to dharma’s emphasis on self-realization in the body here and now. It describes the integral unity that underpins dharma’s metaphysics and contrasts this with western thought and history as a synthetic unity. The west’s anxiety over difference and fixation for order runs in contrast with the creative role of chaos in dharma. The book critiques fashionable reductive translations and argues for preserving certain non-translatable words of Sanskrit. It concludes with a rebuttal against western claims of universalism and recommends a multi-civilizational worldview.The discussions and debate within the book employ the venerable tradition of purva-paksha, an ancient dharmic technique where a debater must first authentically understand in the opponent’s perspective, test the merits of that point of view and only then engage in debate using his own position. Purva-paksha encourages individuals to become truly knowledgeable about all perspectives, to approach the other side with respect and to forego the desire to simply win the contest. Purva-paksha also demands that all sides be willing to embrace the shifts in thinking, disruptive and controversial as they may be, that emerge from such a dialectical process.Being Different highlights six distinct and fundamental points of divergence between the dharmic traditions and the West. These are as follows:1) Approaches to difference: The West’s pervasive anxiety over personal and cultural differences have resulted in the endless need for the appropriation, assimilation, “conversion” and/or digestion and obliteration of all that does not fit its fundamental paradigms. The roots of this anxiety lie in the inherent schisms in its worldview. Dharmic traditions, in contrast, while not perfect, are historically more comfortable with differences, both individual and collective; they are not driven by mandates for expansion and control.2) History-centrism vs. Inner Sciences: The Judeo-Christian religious narrative is rooted in the history of a specific people and place. Further, the divine is external rather than within and guides humanity through unique and irreplaceable revelations. The dharmic traditions, in contrast, emphasize a series of sophisticated techniques of meditation and related inner sciences to achieve higher states of embodied knowing.3) Integral unity vs. synthetic unity: Since the time of Aristotle, the West has assumed an atomic partitioning of reality into distinct and unrelated parts. The Judeo-Christian worldview is based on separate essences for God, the world and/ human souls. Additionally, there is an unbridgeable gap between Greek reason and religious revelation. The result has been a forced unity of separate entities, and such a unity always feels threatened to disintegrate and remains synthetic at best. In dharmic cosmology all things emerge from a unified whole. In Hinduism this integral unity is the very nature of Brahman; in Buddhism there is no ultimate essence like Brahman, but the principle of impermanence and co-dependence provides unity. Dharma and science are enmeshed as part of the same exploration. Every aspect of reality mirrors and relates to every other aspect in a web of interdependency.4) The nature of chaos and uncertainty: The West privileges order in its aesthetics, ethics, religions, society and politics, and manifests a deep-rooted fear of chaos, uncertainty and complexity. The dharmic worldview see chaos as a creative catalyst built into the cosmos to balance out order that could become stultifying., and hence it adopts a more relaxed attitude towards it5) Translatability vs. Sanskrit: Unlike Western languages, in Sanskrit the fundamental sounds have an existential link to the experience of the object they represent. This makes Sanskrit a key resource for personal and cultural development. It also implies that the process of translation and digestion into Western schemas is unavoidably reductive.6) Western universalism challenged: In the “grand narrative” of the West, whether secular or religious, it is the agent or driver of historical unfolding and sets the template for all nations and peoples. This book challenges this self-serving universalism. It contrasts this with dharma’s non-linear approach to the past and multiple future trajectories.The very openness that makes dharma appealing, however, often makes it vulnerable to invasion, appropriation and erosion by a more aggressive and externally ambitious civilization. The book uses the metaphor of digestion to point to the destructive effects of what is usually white-washed as assimilation, globalization or postmodern deconstruction of difference. For complex reasons, which are analyzed at length, the dharmic traditions have been a particular target of digestion into the West, and Being Different challenges the uncritical acceptance of this process by both Westerners and Indians.",
  "genres": [
    "India",
    "Nonfiction",
    "Philosophy",
    "History",
    "Religion",
    "Hinduism",
    "Spirituality"
  ],
  "author": "Rajiv Malhotra",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/19705238-being-different"
}