{
  "title": "When the Dead Rise",
  "description": "Dark magic is returning with a vengeance…For decades, the continent of Merora was plagued with demonic creatures that all but wiped out the human race. But in the darkest hour, when hope was lost, the Brotherhood of the Order rose up and fought back, reclaiming the lands and driving back the dark magic until it became nothing but a distant, horrifying memory. Since then, the Order have worked in the shadows, a silent guardian keeping evil at bay. Until now.***There is dark magic in the spell books Azerrad has dedicated his long life to protecting. So, when they are taken from his homeland aboard a ship destined for the demonic city of Uvrenmouth, he has no choice but to steal aboard the ship and follow them.Azerrad has heard whispers of the Order in Uvrenmouth – a centuries-old brotherhood that protects the city from the inhuman entities that lurk in the dark. People across Merora know it as a symbol of light that disbanded the evil that once ruled these lands. The spell books should be safe behind their walls in deep, guarded vaults filled with runes and powerful magic that have long been forgotten.So why do Azerrad's instincts tell him the books are in danger? Why does the dark city of Uvrenmouth call out like an unholy beacon to the unnatural creatures that still hide in the shadows? Azerrad will have to infiltrate the Order and uncover the secrets lurking behind its holy façade. But gaining the trust of an Order that puts its traditions above all else? Not an easy task for an ancient vampire.The fate of the world now rests in his dead hands.Gripping and action-filled, When The Dead Rise is an epic fantasy tale filled with gruesome battles and witty characters. Perfect for fans of The Witcher, Van Helsing, and Morbius, When The Dead Rise is the first installment in an epic fantasy series and sets up the Merora Universe. Nicholas’ debut novel depicts themes of power, political control, building trust, and rising up against all odds.Content Graphic violence, death, language & gore. “As a beta reader for the author I was able to read this book before it was released. I’m so glad I did. I couldn’t put it down. The twists and turns make it an exciting read. Can’t wait for the next instalment in this series.” – Beta Reader“I only received this book on Saturday & have already finished it- I just couldn’t put it down! Loved all the characters & the plot - it did not disappoint. Brilliant writer. I am already excited for the next one.” – Ciara M“What a great good read. Really liked the characters and such a great plot. Did not disappoint. What a talented writer.” – Grace B“If you like fantasy you’ll like this, ticks every box and for the first time in a long time I couldn’t put the book down!” – Matthew C",
  "genres": [],
  "author": "Nicholas P. Williams",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/197080044-when-the-dead-rise"
}