{
  "title": "The Story of Ab: A Tale of the Time of the Cave Man",
  "description": "“A good story, free from the incrustations of excessive learning and progressing with a quick, nervous style. Living in the stone age, when the woods were full of blood-scenting and man-eating beasts, Ab’s survival depended on his parents’ instinct for peril and the invigorating buffets of the sinewy cave mother. After an exciting childhood, in which ‘Rock-a-by-baby upon the tree-top’ was a reality to him because hyenas were at the base of the tree, he grew up and was mated with Lightfoot, a Shell girl who outswam him and whom he taught to use the bow and arrow. The scene where, somewhat after their honeymoon, they were treed by bears, he with the arrows on one tree and she with the bow on the next, and the lithe, rotund Lightfoot made a lover’s leap into her husband’s arms, is quite thrilling; and the author’s ingenuity is evinced in causing the male bear instinctively to crawl into the entrance of the cave to die, and the family, after vainly trying to eat him out, to give up their tunneling exploit and repair to Fire Valley, a mysterious region of which their parents had told them, where sheets of gaseous flame were emitted from the earth to protect them from the approaching glacial wave. While the book is noteworthy chiefly for its vigor of treatment, it has a number of fine touches that the life it portrays thoroughly human; and the hairy characters converse in language that is quite intelligible….Besides the wolverine and mammoth, the musk-ox and tailless hare, there was the great tiger Sabre-Tooth, which Ab killed when he became Neolithic, insisting that its skin remain uncut, which caused a war. The author concludes by asserting that Victor Hugo must have had a strain of the blood of Ab.” -The Book Buyer, Volume 15, 1898 “It is a story of wild adventure and love and war – when men lived in caves and, in such retreats, defended themselves against each other, and against the monster wild beasts of the time. But, strange as is the story, it is, broadly speaking, true and will prove assuredly one of the greatest of educators. The author has had the assistance of many noted scientists of this country and of Europe in his labors, and the result is a novel the oldest in scene and the newest in conception.” -The American Monthly Review of Reviews, Volume 16, 1897 Man has been, from the beginning, under the never resting, never hastening, forces of evolution. The earth from which he sprang holds the record of his transformations in her peat-beds, her buried caverns and her rocky fastnesses. The eternal laws change man, but they themselves do not change. Ab and Lightfoot and others of the cave people whose story is told in the tale which follows the author cannot disown. He has shown them as they were. Hungry and cold, they slew the fierce beasts which were scarcely more savage than they, and were fed and clothed by their flesh and fur. In the caves of the earth the cave men and their families were safely sheltered. Theirs were the elemental wants and passions. They were swayed by love, in some form at least, by jealousy, fear, revenge, and by the memory of benefits and wrongs. They cherished their young; they fought desperately with the beasts of their time, and with each other, and, when their brief, turbulent lives were ended, they passed into silence, but not into oblivion. The old Earth carefully preserved their story, so that we, their children, may read it now.",
  "genres": [
    "Fantasy"
  ],
  "author": "Stanley Waterloo",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/19710070-the-story-of-ab"
}