{
  "title": "Common Places: Mythologies of Everyday Life in Russia",
  "description": "What is the “real Russia”? What is the relationship between national dreams and kitsch, between political and artistic utopia and everyday existence? Commonplaces of daily living would be perfect clues for those seeking to understand a culture. But all who write big books on Russian life confess their failure to get properly inside Russia, to understand its “doublespeak.”Svetlana Boym is a unique guide. A member of the last Soviet Generation, the Russian equivalent of our Generation X, she grew up in Leningrad and has lived in the West for the past thirteen years. Her book provides a view of Russia that is historically informed, replete with unexpected detail, and everywhere stamped with authority. Alternating analysis with personal accounts of Russian life, Boym conveys the foreignness of Russia and examines its peculiar conceptions of private life and common good, of Culture and Trash, of sincerity and banality. Armed with a Dictionary of Untranslatable Terms, we step around Uncle Fedia asleep in the hall, surrounded by a puddle of urine, and enter the Communal Apartment, the central exhibit of the book. It is the ruin of the communal utopia and a unique institution of Soviet daily life; a model Soviet home and a breeding ground for grassroots informants. Here, privacy is forbidden; here the inhabitants defiantly treasure their bits of “domestic trash,” targets of ideological campaigns for the transformation ( perestroika ) of everyday life.Against the Russian and Soviet myths of national destiny, the trivial, the ordinary, even the trashy, take on a utopian dimension. Boym studies Russian culture in a broad sense of the word; she ranges from nineteenth- and twentieth-century intellectual thought to art and popular culture. With her we go walking in Moscow and Leningrad, eavesdrop on domestic life, and discover jokes, films, and TV programs. Boym then reflects on the 1991 coup that marked the end of the Soviet Union and evoked fin-de-siècle apocalyptic visions. The book ends with a poignant reflection on the nature of communal utopia and nostalgia, on homesickness and the sickness of being home.",
  "genres": [
    "Russia",
    "Nonfiction",
    "History",
    "Anthropology",
    "Philosophy",
    "Cultural",
    "Theory"
  ],
  "author": "Svetlana Boym",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/197267.Common_Places"
}