{
  "title": "The Book of Dark Academia",
  "description": "A dark academia anthology of poetry, art, quotes, musings, fashion, and more...Embark into a world of midnight shadows and secrets, of books and learning, of mystery and intrigue. A place where the quest for knowledge is a never-ending journey. This book is written for the dark the student, the scholar, a seeker of truth, a lover of lost art and dusty tomes. For keepers of the perpetually burning flame. So take my hand, dear reader, turn the page, and let yourself fall into the world of dark academia~Within the walls of this labyrinth, your mind will be enticed by titillating quotes, original dark academia poetry, paintings of women reading books and partaking in sword-fights, lush gothic architecture, eastern and western mythology, DA inspired music (from Vivaldi's darkly passionate Winter to instrumentals like Enemies to Lovers, anyone?). You'll also discover the history of dark academia and its various subcultures, i.e. light academia, witchy academia, classic academia, etc, and dark academia fashion from around the world (there is a whole other world beyond the tweed and blazers that will leave your aesthetic palate delighted).Since dark academia and books go hand in hand, it would be egregious to write The Book of Dark Academia without mentioning DA book recommendations (yes, cult classics like The Secret History and Babel but also some hidden treasures, including dark academia books by POC authors). This coffee table art book is also rich with darkly beautiful excerpts from authors, poets, and philosophers who have inspired generations of dark academics (Rumi, Friedrich Nietzsche, Rabindranath Tagore, Virginia Woolf, Emily Dickinson, Sappho, Oscar Wilde, Carl Jung, Lao Tzu, Muhammad Iqbal, Sigmund Freud, Ovid, Jane Austen, and many more).While this dark academia anthology has that signature aesthetically moody, dreamy flavor, it also offers practical guidance, like where to meet fellow dark academics, how to connect with yourself deeper through shadow work, a list of dark academic activities you may not have thought of to indulge yourself in yet, and quotes that make for thought-provoking journaling prompts. Of course, we cannot let only your mind be satiated. Your eyes will also have a visual feast of their own. Every page is filled with gorgeous photography art that captures the allure of dark academia and will transport you to a world of shadowy libraries, secret societies, and midnight gardens.Whether you're an dark academic yourself, simply intrigued about this fascinating subculture, or gifting this book to that friend, The Book of Dark Academia makes a deliciously aesthetic coffee table book or read for any bookshelf.",
  "genres": [],
  "author": "D.K.S Dhara",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/197220654-the-book-of-dark-academia"
}