{
  "title": "Call of the Sea",
  "description": "The Devils of Vitality always catch their prey.Bay Delmar is pretty done with life.There’s a reason even his friends refer to him as the Undead or Robot. It’s been years since Bay’s been able to feel anything other than emptiness when he isn’t straddling a hoverbike and risking his neck in one of Vitality’s infamous street races. By day, he’s Professor Delmar, the reputable—yet stony—youngest staff member at the prestigious Vail University. But by night, he’s either racing or sneaking off to the Seaside Cinema where he partakes in other…questionable pastimes. The fact that he suffers from emotional detachment, likes fast bikes and violent porn, aren’t even his biggest secret. No, the one thing Bay can never risk the world finding out is that he has an obsession. With a student.Sila Varun is an apex predator.  Being a genius and all-around perfect specimen sort of ensured from the get-go he would be. He’s lived his life at the top of the food chain, and the best way to get prey to let down their guard? Give them a false sense of security. The mask he wears on a daily basis provides him and his brother with a layer of protection, but boredom is always there, scratching at the back of his psyche. Until he discovers Bay Delmar lurking in the shadows—both literally and figuratively. What was meant to be a quickly handled task soon turns into a fixation. Sila’s never grown attached to anything before, and he has no intention of doing so now, so what harm could playing a long game bring?  Bay is shocked, and admittedly a little thrilled when the person he’s been secretly yearning for suddenly shows an interest in him, only it’s clear from the start that Sila isn’t the kindhearted boy next door type he’s led the planet to believe. His psychopathic nature is revealed the very first night the two of them share together, and the worst possible thing that could happen does. Bay realizes that only makes him like the younger man more. Since his emotions went dormant, he needs constant stimulation—of both the pain and pleasure sort—in order to feel anything, and Sila’s vicious nature easily calls to the soul Bay thought was gone forever. This psychopath may be the only thing that can breathe life back into him. But how can he convince Sila he’s worth more alive to him than dead?Sila’s always in control, always in charge. He plays everyone like pieces in a game of chess. So why does he feel like he’s stumbled onto someone else’s board? And why is he suddenly wondering if the Devil kills the King after all, or if perhaps he lays claim to him instead?Trigger Warning: This is a stand-alone dark romance, which means there are many themes that some might find disturbing. Some of these include but are not limited to, dub-con, violence, and a heartless male lead who's incapable of feeling guilt or remorse, along with explicit sexual material not suitable for all readers. Please be sure to read the Author's Note for a complete list of all warnings! HEA guarneteed. Though this book takes place on the same planet and within the same timeframe as Echo and These Silent Stars, those books do not need to be read first, or at all, to enjoy this book.",
  "genres": [
    "M M Romance",
    "Dark",
    "Dark Romance",
    "Romance",
    "Science Fiction",
    "BDSM",
    "College"
  ],
  "author": "Chani Lynn Feener",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/197302857-call-of-the-sea"
}