{
  "title": "Home To Italy",
  "description": "In this delightful, moving novel, Peter Pezzelli brings to life the earthy sensuality of Italy's Abruzzo region— the smell of just-baked bread wafting through the village piazza; the shopkeepers sweeping the sidewalks first thing in the morning; groups of cyclists dotting the mountain roads—and spins a story of May-December romance as sharp and delicious as the olives of Villa San Giuseppe. . .SOMETIMES YOU HAVE TO TRAVEL FAR TO FIND YOUR WAY HOME.After the death of his beloved wife, Anna, Peppi's family and friends expect him to bury his grief by tending to his gardens and taking long rides on his bike. Instead, Peppi shocks them all with his decision to leave Rhode Island and return to Villa San Giuseppe, the small Italian village where he spent his childhood, and to il mulino, his family's old mill. But once he's back, he temporarily moves into an apartment over the candy factory run by his childhood best friend, Luca. It is modest, but livable, with a lovely view of Luca's neglected gardens and his equally neglected daughter, the fiery Lucrezia.More a force of nature than a woman, Lucrezia's legendary temper and workaholic schedule hide the very real pain she feels over her husband's death years before. At first, she tolerates Peppi as an eccentric annoyance—her father's strange but handsome American friend who fixes things around the factory and is bringing the gardens back to life. But soon, Lucrezia's interest in Peppi deepens. Like a high wind, the gossip is flying through Villa San Giuseppe—Lucrezia's making it to dinner on time. She's eating olives from a man's hand.She's wearing heels. Now, under the Italian sun, a tentative romance begins to bloom between the grieving pair, yielding to a surprisingly strong passion with the power to heal life's wounds and promise second chances. . .",
  "genres": [
    "Fiction",
    "Italy",
    "Romance",
    "Travel",
    "Contemporary",
    "Adult",
    "Book Club"
  ],
  "author": "Peter Pezzelli",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/19728171-home-to-italy"
}