{
  "title": "From Midnight to Dawn: The Last Tracks of the Underground Railroad",
  "description": "This extraordinary narrative offers a fresh perspective on the Underground Railroad as it traces the perilous journeys of fugitive ex–slaves from the United States to free black settlements in Canada.The Underground Railroad was the passage to freedom for many slaves, but it was rife with dangers. There were dedicated conductors and safe houses, but also arduous nights in the mountains and days in threatening towns. For those who made it to Midnight (the code name given to Detroit), the Detroit River became a River Jordan—and Canada became their land of Canaan, the Promised Land where they could live freely in black settlements under the protection of British law. One of these settlements was known as Dawn.In prose rich in detail and imagery, From Midnight to Dawn presents compelling portraits of the men and women who established the Railroad, and of the people who traveled it to find new lives in Canada. Some of the figures are well known, like Harriet Tubman and John Brown. But there are equally heroic, less familiar figures here as well, like Mary Ann Shadd, who became the first black female newspaper editor in North America, and Osborne Perry Anderson, the only black survivor of the fighting at Harpers Ferry.From Midnight to Dawn evokes the turmoil and controversies of the time, reveals the compelling stories behind events such as Harpers Ferry and the Christian Resistance, and introduces the reader to the real–life “Uncle Tom” who influenced Harriet Beecher Stowe’s Uncle Tom ’ s Cabin .An extraordinary examination of a part of American history that transcends national borders, From Midnight to Dawn will captivate readers with its tales of hope, courage, and a people’s determination to live equal under the law.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Civil War",
    "Race",
    "Audiobook"
  ],
  "author": "Jacqueline L. Tobin",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/111015.From_Midnight_to_Dawn"
}