{
  "title": "Drama: An Actor's Education",
  "description": "Through the vivid stories in \"Drama\", John Lithgow shares a backstage history of his struggle, crisis, and discovery, and the scenes of his early life and career that took place before he became a nationally-known star. Above all, \"Drama\" is a tribute to the most important influence in John Lithgow's life: his father, Arthur Lithgow. An actor, director, producer, and great lover of Shakespeare, Arthur brought theatre to John's boyhood, where performance and storytelling were a constant and cherished part of family life. Lithgow brings the theatre worlds of New York and London to life as he relives his collaborations with renowned performers and directors including Mike Nichols, Bob Fosse, Liv Ullmann, Meryl Streep, and Brian De Palma. Lithgow's ruminations on the nature of theatre, performance, and storytelling cut to the heart of why actors are driven to perform, and why people are driven to watch them do it. At once hilarious and reflective, \"Drama\" pulls back the curtain on the making of one of our most beloved actors.“John Lithgow’s memoir is both unflinching and irresistible. It captures the long, hard road to the stage for any actor, or for virtually anyone trying to make it in New York, and shows how putting all of your hopes into the one thing you love isn’t so crazy after all.” —Gay Talese\"A memoir as finely crafted as one of Lithgow’s performances.\"—Steve Martin“John Lithgow’s memoir of his training as an actor is more than an insider’s view of his craft. Lithgow likens acting to storytelling, and he’s a wonderful writer. The portrait of his father is as finely articulated as it is heartfelt, and the account of the young actor’s struggles with his too-young, too-early first marriage is both moving and candid. I loved this book.” — John Irving“This book has all the drama we’ve come to expect from John Lithgow, the alternately dark, tender, romantic, dangerous, deranged actor we find in Drama, which is also a family tale of the richest variety. A great read.” — Mary Karr",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Autobiography",
    "Biography Memoir",
    "Theatre"
  ],
  "author": "John Lithgow",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/11101760-drama"
}