{
  "title": "Only Yesterday",
  "description": "Israeli Nobel Laureate S.Y. Agnon's famous masterpiece, his novel Only Yesterday, here appears in English translation for the first time. Published in 1945, the book tells a seemingly simple tale about a man who immigrates to Palestine with the Second Aliya--the several hundred idealists who returned between 1904 and 1914 to work the Hebrew soil as in Biblical times and revive Hebrew culture. Only Yesterday quickly became recognized as a monumental work of world literature, but not only for its vivid historical reconstruction of Israel's founding society. This epic novel also engages the reader in a fascinating network of meanings, contradictions, and paradoxes all leading to the question, what, if anything, controls human existence?Seduced by Zionist slogans, young Isaac Kumer imagines the Land of Israel filled with the financial, social, and erotic opportunities that were denied him, the son of an impoverished shopkeeper, in Poland. Once there, he cannot find the agricultural work he anticipated. Instead Isaac happens upon house-painting jobs as he moves from secular, Zionist Jaffa, where the ideological fervor and sexual freedom are alien to him, to ultra-orthodox, anti-Zionist Jerusalem. While some of his Zionist friends turn capitalist, becoming successful merchants, his own life remains adrift and impoverished in a land torn between idealism and practicality, a place that is at once homeland and diaspora. Eventually he marries a religious woman in Jerusalem, after his worldly girlfriend in Jaffa rejects him.Led astray by circumstances, Isaac always ends up in the place opposite of where he wants to be, but why? The text soars to Surrealist-Kafkaesque dimensions when, in a playful mode, Isaac drips paint on a stray dog, writing \"Crazy Dog\" on his back. Causing panic wherever he roams, the dog takes over the story, until, after enduring persecution for so long without \"understanding\" why, he really does go mad and bites Isaac. The dog has been interpreted as everything from the embodiment of Exile to a daemonic force, and becomes an unforgettable character in a book about the death of God, the deception of discourse, the power of suppressed eroticism, and the destiny of a people depicted in all its darkness and promise.",
  "genres": [
    "Fiction",
    "Israel",
    "Nobel Prize",
    "Jewish",
    "Historical Fiction",
    "Classics",
    "Literature"
  ],
  "author": "S.Y. Agnon",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/197170.Only_Yesterday"
}