{
  "title": "Calling Invisible Women: A Novel",
  "description": "A delightfully funny novel packing a clever punch, from the author of the New York Times bestselling Julie and Romeo    A mom in her early fifties, Clover knows she no longer turns heads the way she used to, and she's only really missed when dinner isn't on the table on time. Then Clover wakes up one morning to discover she's invisible--truly invisible. She panics, but when her husband and son sit down to dinner, nothing is amiss. Even though she's been with her husband, Arthur, since college, her condition goes unnoticed. Her friend Gilda immediately observes that Clover is invisible, which relieves Clover immensely--she's not losing her mind after all!--but she is crushed by the realization that neither her husband nor her children ever truly look at her.  She was invisible even before she knew she was invisible.   Clover discovers that there are other women like her, women of a certain age who seem to have disappeared.  As she uses her invisibility to get to know her family and her town better, Clover leads the way in helping invisible women become recognized and appreciated no matter what their role.  Smart and hilarious, with indomitable female characters, Calling Invisible Women will appeal to anyone who has ever felt invisible.Praise for Jeanne Ray’s \"A captivating comic romp...Wise, winsome, and refreshingly optimistic.\" --People\"A comic gem of a love story...completely entertaining.\" --The Denver Post\"At last, someone has written a love story for and about grown-ups! A smart, sexy celebration of the timeless nature of romance.\" --A. Manette Ansay\"A little jewel of a book.\" --The Philadelphia Inquirer\"Love and desire will not be denied in this lighthearted inversion of a classic story. Filled with the delicate sweetness of fresh flowers and new love, Julie and Romeo is a smart, funny, touching book. Where has Jeanne Ray been hiding all these years?\" --Alison McGhee, author of Shadow Baby\"A charming, smart love story with interesting characters and great laughs.\" -- The Christian Science Monitor",
  "genres": [
    "Fiction",
    "Book Club",
    "Chick Lit",
    "Fantasy",
    "Humor",
    "Audiobook",
    "Womens"
  ],
  "author": "Jeanne Ray",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/19725877-calling-invisible-women"
}