{
  "title": "Long Time Gone",
  "description": "When DNA results reveal a disturbing connection to the mysterious disappearance of a famous baby nearly three decades ago, a forensic scientist is plunged into a dangerous search for answers in this engrossing, propulsive new novel from the internationally bestselling author of Twenty Years Later.Thirty years ago, Baby Charlotte vanished. Today, she’s still in danger.When Dr. Sloan Hastings submits her DNA to an online genealogy site for a research assignment, her goal is to better understand the treasure-trove of genetic information contained on ancestry websites. Brilliant and driven, Sloan is embarking on a fellowship in forensic pathology, training under the renowned Dr. Livia Cutty.Sloan has one reservation about involving herself in the she’s adopted. Grateful for a loving home, she’s never considered tracking down her biological parents. The results of her search are shocking. Sloan’s DNA profile suggests her true identity is that of Charlotte Margolis, aka “Baby Charlotte”, who captured the nation’s attention when she mysteriously disappeared, along with her parents, in July 1995. Despite an exhaustive search, the family was never seen again, and no suspects were named in the case.Sloan’s discovery leads her to the small town of Cedar Creek, Nevada, the site of her disappearance. It also leads her to Sheriff Eric Stamos. The Margolis family’s influence and power permeate every corner of Harrison County, and Eric is convinced that in learning the truth about her past, Sloan can also help discover what happened to Eric’s father, who died under suspicious circumstances soon after he started investigating the case her disappearance.Slowly, over the course of a stifling summer, Sloan begins getting to know her relatives. Though initially welcoming, the Margolis family is also mysterious and tight-lipped. Not everyone seems happy about Sloan’s return, or the questions she’s asking. And the more she and Eric learn, the more apparent it becomes that the answers they both seek are buried in a graveyard of Margolis family secrets that some will do anything to keep hidden—no matter who else has to die…",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Mystery Thriller",
    "Audiobook",
    "Suspense",
    "Crime"
  ],
  "author": "Charlie Donlea",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/197522426-long-time-gone"
}