{
  "title": "The Charmed Friends of Trove Isle",
  "description": "In a grown-up twist on The Sisterhood of the Traveling Pants , USA Today bestselling author Annie Rains pens a powerful, uplifting story of female friendship and resilience in a small Southern town, as former childhood friends overcome grief and begin to take new chances in their lives… with the help of a long-lost gift they were meant to share. Perfect for readers of Karen Hawkins’ The Book Charmer or Heather Webber’s Midnight at the Blackbird Café .Ten years after she left her hometown of Trove Isle, NC, Melody Palmer is back to receive an unexpected inheritance—her great aunt’s thrift store, Hidden Treasures. There, in a glass case beneath the register, Melody spies the long-lost charm bracelet she shared with her high school friends, Liz and Bri, and her younger sister, Alyssa. After a devastating prom night accident, it disappeared, and the girls’ friendship evaporated with it. Slipping the bracelet on her arm for safekeeping, Melody soon finds herself crossing paths with her former friends once more.While Melody fled, Liz has stayed in Trove Isle, helping with her parents’ business instead of pursuing her photography goals. Guilt still weighs on her after that fateful night when they lost Alyssa. For Bri, the consequences were even more stark. After spiraling into self-destruction, Bri served four years in a women’s state prison and is about to be released—but can Trove Isle ever feel like home again?Yet despite everything that’s changed, the promise that the bracelet once held—of adventures, achievements, love, and lifelong friendship—hasn’t quite faded. And together, they might yet find a way to reconcile their pasts and futures, one charm at a time . . .",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Romance",
    "Contemporary",
    "Friendship",
    "Audiobook",
    "Womens Fiction"
  ],
  "author": "Annie Rains",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/197522435-the-charmed-friends-of-trove-isle"
}