{
  "title": "Take Back Your Brain: How a Sexist Society Gets in Your Head—and How to Get It Out",
  "description": "A bold new paradigm for breaking free from negative self-talk and creating a life of confidence, power, and joy, from Master Coach and host of the UnF*ck Your Brain podcast Kara Loewentheil.I never look good in skirts. I can’t ask for a raise or my boss will think I’m greedy. I’m getting too old to find a partner. I’m a bad mom and my kids can tell. I’ll never be good enough.Women absorb a lifetime of sexist social messaging that says our worth is determined by our looks, accomplishments, and what everyone (but ourselves) thinks of us. Take Back Your Brain exposes how the patriarchy hijacks our minds and wrecks our confidence—and shows how to break free once and for all.For a long time, Kara Loewentheil wasn’t sure why she, like so many ambitious women, still wrestled with insecurity and low self-esteem, despite two Ivy League degrees, a successful law career, and a thriving social life. After breaking down under her desk one day, she decided enough was enough. Kara learned the power of thought work, became a Master Certified Life Coach, rewired her brain to overcome sexist social messages, and began to coach other women to do the same.Now in Take Back Your Brain , she shows you how to undo the socialization you never asked for, starting with reprogramming your core beliefs from patriarchy’s corrosive influence. Weaving cognitive psychology and feminist theory with practical thought work exercises, this book teaches you By changing your thoughts, you can transform your emotions, actions, the direction of your life, and ultimately the world. Because when women unleash their true power, they awaken new possibilities for all of us.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Feminism",
    "Psychology",
    "Personal Development",
    "Mental Health",
    "Audiobook"
  ],
  "author": "Kara Loewentheil",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/197536305-take-back-your-brain"
}