{
  "title": "The Yankee Way: The Untold Inside Story of the Brian Cashman Era",
  "description": "With rare access to the inner sanctum of the New York Yankees, SNY analyst Andy Martino weaves two years of exclusive interviews with general manager Brian Cashman into a revelatory account of never-before-told stories about Derek Jeter, Aaron Judge, Alex Rodriguez, the complex front office, team ownership, and insights into the World Series wins and day-to-day running of the team that fans never get to see.When Brian Cashman arrived in the Bronx as an intern in 1986, he discovered a team in chaos, run on impulse and emotion and lacking the sheen that had defined the Yankees in earlier eras. Decades later, Cashman had risen through the ranks of the front office, earned the trust of the Steinbrenner family, and become the longest-serving GM in the Yankees’ storied history, helping to transform the Yankees to glory with a string of World Series championships and an unmatched streak of winning seasons.  With unprecedented inside access and featuring exclusive interviews with Cashman, owner Hal Steinbrenner, top front-office executives, current Yankee stars and coaches, award-winning baseball journalist Andy Martino gives fans a view from the GM’s seat that we would never normally see. From Cashman’s battles with inscrutable team captain Derek Jeter, to tensions between Jeter and A-Rod, to Cashman’s struggles with beloved manager Joe Torre. This book explores the management of egos on the field and in the front office, as well as the evolution of the manager position over generations and into the analytics era. Packed with drama and intrigue, this is the definitive inside account of the most intriguing and storied franchise in Major League Baseball.",
  "genres": [
    "Baseball",
    "Sports",
    "Nonfiction",
    "Biography",
    "Business",
    "Audiobook"
  ],
  "author": "Andy Martino",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/197514398-the-yankee-way"
}