{
  "title": "Spieltrieb",
  "description": "Ada ist mit 12 Jahren auf erschreckende Weise erwachsen geworden. Vor zwei Jahren nämlich hat die hochintelligente Schülerin, neu am Bonner Ernst-Bloch-Gymnasium und im Unterricht gern in die Rolle der Lehrerin schlüpfend, beschlossen, alles als „gleich gültig“ anzusehen. Nur der Sport- und Deutschlehrer Smutek und Höfi, der Geschichtslehrer, können ihr Paroli bieten. Aber dann kommt der ebenso attraktive wie kluge Halbägypter Alev ins Spiel, dem alle „Prinzessinnen“ der Schule zu Füßen liegen. Ada und Alev scheinen wie geschaffen für ein Experiment jenseits moralischer Konventionen, bei dem es vor allem um die gleichberechtigten Startanlagen der Teilnehmer geht. Das intellektuelle Kräftemessen beginnt -- und weitet sich bald zu einer Obsession. Aber wer hält die Fäden in der Hand? Wie kann man Realität und Fiktion auseinanderhalten? Und: Gibt es eine Möglichkeit auszusteigen? Ada, so hieß schon einmal die (12-jährige) Heldin eines Buchs, in dem es um Spieltriebe in Internatsumgebung ging: um erotische Spiele, aber auch um solche mit Form und Inhalt. Ada oder Das Verlangen heißt dieses Buch, und der Meister adoleszenter Erotik, Vladmir Nabokov, hat es Ende der sechziger Jahre geschrieben. Ada erscheint darin als „anmutiger Computer“, dem der „Wortzirkus“ das größte Vergnügen bereitet. Und tatsächlich ist ADA ja auch der Name einer raffinierten, zur Strukturprüfung anderer Programme verwendeten Programmiersprache: unbewusst durchschauend und „intelligent dumm“ wie die Protagonistin von Zehs Spieltrieb eben. Auf beide Traditionen spielt Zehs Roman mehr als deutlich an: auch dies Teil einer intertextuellen Strategie, die das Buch um eine weitere Nuance bereichert. All diese Ebenen hat Zeh auf eine faszinierend konsequente, atmosphärisch überaus dichte Weise zu einer philosophischen Pubertätsgeschichte mit Liebes- und Krimielementen miteinander verwoben. Und sie hat dies so spielerisch leicht getan, das ihr faszinierender Roman auf hohem Niveau bestens, teils sogar vergnüglich lesbar geblieben ist. --Thomas Köster",
  "genres": [
    "Fiction",
    "German Literature",
    "Contemporary",
    "Germany",
    "Roman",
    "Novels",
    "Literature"
  ],
  "author": "Juli Zeh",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/1975322.Spieltrieb"
}