{
  "title": "A Magical Girl Retires",
  "description": "A millennial turned magical girl must combat climate change and credit card debt in this delightful, witty, and wildly imaginative ode to magical girl manga.Twenty-nine, depressed, and drowning in credit card debt after losing her job during the pandemic, a millennial woman decides to end her troubles by jumping off Seoul’s Mapo Bridge.But her suicide attempt is interrupted by a girl dressed all in white—her guardian angel. Ah Roa is a clairvoyant magical girl on a mission to find the greatest magical girl of all time. And our protagonist just may be that special someone.But the young woman’s initial excitement turns to frustration when she learns being a magical girl in real life is much different than how it’s portrayed in stories. It isn’t just destiny—it’s work. Magical girls go to job fairs, join trade unions, attend classes. And for this magical girl there are no special powers and no great perks, and despite being magical, she still battles with low self-esteem. Her magic wand . . . is a credit card—which she must use to defeat a terrifying threat that isn’t a monster or an intergalactic war. It’s global climate change. Because magical girls need to think about sustainability, too.Park Seolyeon reimagines classic fantasy tropes in a novel that explores real-world challenges that are both deeply personal and universal: the search for meaning and the desire to do good in a world that feels like it’s ending. A fun, fast-paced, and enchanting narrative that sparkles thanks to award-nominated translator Anton Hur, A Magical Girl Retires reminds us that we are all magical girls—that fighting evil by moonlight and winning love by daylight can be anyone's game.Translated from the Korean by Anton Hur.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Contemporary",
    "Magical Realism",
    "Novella",
    "Queer",
    "Adult"
  ],
  "author": "Park Seolyeon",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/197448796-a-magical-girl-retires"
}