{
  "title": "The Evolutionary Strategies that Shape Ecosystems",
  "description": "THE EVOLUTIONARY STRATEGIES THAT SHAPE ECOSYSTEMS In 1837 a young Charles Darwin took his notebook, wrote “I think”, and then sketched a rudimentary, stick-like tree. Each branch of Darwin’s tree of life told a story of survival and adaptation – adaptation of animals and plants not just to the environment but also to life with other living things. However, more than 150 years since Darwin published his singular idea of natural selection, the science of ecology has yet to account for how contrasting evolutionary outcomes affect the ability of organisms to coexist in communities and to regulate ecosystem functioning.In this book Philip Grime and Simon Pierce explain how evidence from across the world is revealing that, beneath the wealth of apparently limitless and bewildering variation in detailed structure and functioning, the essential biology of all organisms is subject to the same set of basic interacting constraints on life-history and physiology. The inescapable resulting predicament during the evolution of every species is that, according to habitat, each must adopt a predictable compromise with regard to how they use the resources at their disposal in order to survive. The compromise involves the investment of resources in either the effort to acquire more resources, the tolerance of factors that reduce metabolic performance, or reproduction. This three-way trade-off is the irreducible core of the universal adaptive strategy theory which Grime and Pierce use to investigate how two environmental filters selecting, respectively, for convergence and divergence in organism function determine the identity of organisms in communities, and ultimately how different evolutionary strategies affect the functioning of ecosystems. This book refl ects an historic phase in which evolutionary processes are finally moving centre stage in the effort to unify ecological theory, and animal, plant and microbial ecology have begun to find a common theoretical framework.Companion websiteThis book has a companion website www.wiley.com/go/grime/evolutionaryst... with Figures and Tables from the book for downloading.",
  "genres": [
    "Evolution",
    "Ecology"
  ],
  "author": "J. Philip Grime",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/19752801-the-evolutionary-strategies-that-shape-ecosystems"
}