{
  "title": "Once There Were Heroes",
  "description": "From Philip C. Quaintrell, author of The Echoes Saga 'For lovers of your classic Tolkien, this series has it all' - Alan Coleman - Amazon customer 'Best newcomer to the genre. Philip is up there with Feist and Sanderson' - Philip Spick - Amazon customer 700,000 COPIES SOLD WORLDWIDE -- THE GODS ARE DEAD.IN THEIR ABSENCE, THERE CAN BE ONLY CHAOS. ONLY WAR.AND THEY ARE NOT ALL THAT HAS FADED FROM THE WORLD OF VERDA... Once there were heroes. Brave men and women who showed their quality to be above the rest. Those whose deeds earned them the heart of a dragon . Those whose courage and strength resonated with the unborn, who, in their eggs, can wait thousands of years for a warrior worthy of them. These heroes rose up on young battlefields and defended the weak and oppressed across all of Erador. They did so because they were inspired . They had only to look up and see. Dragons Riders! The last noble warriors in the realm. Only heroes can embolden the ordinary. For centuries, millennia , the Dragon Riders galvanised generation after generation, adding Riders to their ranks, birthing dragons from their eggs. But there are no more heroes. War with the Andarens is like nothing the Riders, nor the armies of Erador, have ever faced. In the place of heroes there are only soldiers now. Fodder for the machine of war. This time of twilight is set to be the crowning hour of the dark, when the light is losing its grip. There are those who have been waiting, biding their time in the shadows while the heroes of Verda die out. They worship something ancient. Something forgotten by myth and legend. Something evil. It falls on a few to keep back that darkness. A few who must rise without inspiration and prove themselves worthy. -- 'I read a lot of fantasy books and I can say that this is one of the best I have read' - B. Stewart - Amazon customer - The Echoes Saga ''The Echoes Saga' demonstrates a simple commitment to the power of story' - Stephen Dudley - Amazon customer - The Echoes Saga",
  "genres": [
    "Fantasy",
    "Dragons",
    "Epic Fantasy",
    "Fiction",
    "High Fantasy",
    "Adult",
    "Magic"
  ],
  "author": "Philip C. Quaintrell",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/197450537-once-there-were-heroes"
}