{
  "title": "Survive for Me",
  "description": "Jersey wasted no time in sacrificing himself, thinking that it was the necessary step to save the lives of the only two people left in the world for whom he cared. But death wasn’t what he got in exchange for that sacrifice. Death would’ve been a relief. Instead, Jersey finds himself in the trunk of a car and on the way to be tortured relentlessly for days while his captors use his suffering to attempt to lure Trista and Memphis back out of hiding. His background from another life provided him with the ability to withstand that torture to some extent, and Jersey knows that once his mind has had enough, a more primal part of him will take over until his body can no longer endure the pain. He was willing to live out his last days in the painful custody of the man he used to work for in order to keep Trista and Memphis safe, but he was entirely unprepared to learn the truth of how he’d come to work for that organization in the first place.Secrets that shatter his already fragile grip on reality send Jersey into the depths of his memories until he struggles to find his way back out of the past.Trista and Memphis know they’re working against someone else’s timeline to get Jersey back alive. To achieve that goal, they’re forced to rely on the help of others who’ve worked within the same dangerous organization that connects all of them. While Trista wrestles to understand what Jersey might be experiencing, she’s left with the unpleasant realization that after an entire life spent in solitude, she no longer wants to face the world alone. Except the version of Jersey who returns to her is a man she barely recognizes.She can’t see a future without him, but he can’t see beyond the nightmares of his past.This is the second book in The Broken Bounty Series . It is not a standalone. It’s a dual perspective, dark romance and is intended for readers over 18 years of age. Emotional upheaval is common in the works of Ember Nicole, and this one is no different. There are warnings included within the first pages of the book. Please read and understand them before venturing further.",
  "genres": [
    "Dark Romance",
    "Dark",
    "Enemies To Lovers",
    "Romance",
    "Contemporary"
  ],
  "author": "Ember Nicole",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/197597742-survive-for-me"
}