{
  "title": "Apollo's Fire: Igniting America's Clean Energy Economy",
  "description": "In 1961, President John F. Kennedy ignited America’s Apollo Project and sparked a revolution in space exploration. Today the New Apollo Energy Project is poised to revolutionize the production of energy and thereby save our planet. The nation that built the world’s most powerful rockets, its most advanced computers, and its most sophisticated life support systems is ready to create the world’s most powerful solar energy systems, its most advanced wind energy turbines, and its most sophisticated hybrid cars. This will result in nothing less than a second American Revolution. Who are the dreamers in California who believe they can use mirrors and liquid metal to wring more electricity from a ray of sunshine than anyone else on earth can? Who are the innovators who have built a contraption that can turn the energy of a simple wave off the Oregon coast into burnt toast in Idaho? Who are the scientists in Massachusetts who have invented a battery that now runs your hand drill and will soon run your car? Readers will meet them all in this book. They will learn how the new energy economy will grow, the research that is required, and the legislation that must be passed to make the vision a reality. This is a thoughtful, optimistic book, based on sound facts. No one before has tied together the concepts of economic growth and greenhouse gas reductions with such concrete examples. No one has previously told the real stories of the people who are right now on the front lines of the energy revolution. The co-authors, one a U.S. Congressman who is the primary sponsor of the New Apollo Energy Act, and the other the founder of the Apollo Alliance, have joined their experience, expertise, and passion for a clean energy future to lay out the path to stop global warming and gain energy independence.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Science",
    "Environment",
    "Climate Change",
    "Economics"
  ],
  "author": "Jay Inslee",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/1975145.Apollo_s_Fire"
}