{
  "title": "The Success Formula For Personal Growth: 2,000 Motivational Quotes, Winning Strategies and Advice From 500 Super Successful People",
  "description": "In a unique and entertaining approach, 2,000 inspirational and positive quotations from 500 of the most successful people from ancient times to our modern society, are organized and combined with hundreds of the author's practical tips and common sense advice, to produce a powerful system of success lessons, to accelerate your personal change and growth, to become successful and achieve happiness and fulfillment in your personal and business life.The quotations and success lessons are very easy to search. They are categorized by over 90 subjects and page number in the Table of Contents. The printed book (not the ebook) also cross-indexes and groups each quote by its author's name and page number in a separate Index at the end of the book. The Success Formula For Personal Growth is a wide ranging guide to the thinking and actions that lead to achieving personal growth and success, such as: Learn to take responsibility for your life.Learn to become an expert communicator and connect with people's minds and hearts.Learn to train your mind to maximize its positive output.Learn to eliminate negative limitations that are holding you back.Learn to increase your belief and confidence in yourself.Learn to get into the habit to set and complete goals.Learn time management and problem solving skills.Learn to use active visualization to train your mind for success.Learn to use emotionally charged affirmations to boost your self-esteem and confidence.And much more. Personal change is not easy. But anyone who wants more out of life, and knows in their heart that they can become more than they are now, and do more than they have already done, can transform their life, and benefit from reading, learning, absorbing, and putting into practice habits based on The Success Formula For Personal Growth.About the Author:Jerry Bruckner has a lifelong burning passion to pursue personal growth and to mentor people to help them develop and succeed.Practiced martial arts 25 years; Captain of his College's Karate team, and assistant Karate Instructor. Completed his College's charitable, summer long, 500 mile swim, bike and run competition. Served as an American Red Cross Life Guard instructor and water safety and swimming instructor. Practiced Litigation and Appellate Law as an Attorney for 10 years in New York. Mentored law students who worked for the New York City Law Department, and provided free legal help to low income people. Jerry admits to having a geek side. He taught himself computer programming as a hobby, and went on to work for one of the world's largest software companies, where he was selected for two consecutive years to speak at their prestigious annual technology conference. Recently founded the website and blog: Personal-Development-TV.com to share personal development lessons and tips with people around the world. Jerry's motto that sums up his attitude toward personal development: \"You only get one chance to play the game of life... be grateful for every day and whatever you have... give it all you got... with whatever you've got... to do your best to achieve your maximum potential... to provide for yourself and your family, and to give back to the Community!\"",
  "genres": [],
  "author": "Jerry Bruckner",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/11102208-the-success-formula-for-personal-growth"
}