{
  "title": "Reaping the Whirlwind: A Trent Tyson Historical Mystery",
  "description": "For seventy-five years the truth about the pivotal evolution trial of Tennessee vs. John Thomas Scopes has lain dormant in scholarly tomes. In honor of this landmark year, best-selling author Rosey Dow wrote Reaping the Whirlwind to reveal the behind-the-scenes action, the string pulling and conniving, the publicity stunts, and the humorous interaction of the players in this critical real-life drama. \"John Scopes was innocent,\" announces Ms. Dow. \"He never taught evolution and, in fact, was not a biology teacher.\" Yet hundreds of reporters poured into tiny Dayton, Tennessee to see him tried and convicted. Radios across the nation broadcast every word of the trial to a populace with its ear pressed to the receiver determined not to miss a single word. Few knew the truth even then. In page-turning fiction style, Rosey Dow weaves the factual account of the trial with a murder mystery to show this issue's relevance to modern America. In his foreword, Scopes Specialist Dr. Richard Cornelius says, \"Rosey Dow has been meticulous in her research and painstaking in her attempts at historical accuracy.\" She portrays William Jennings Bryan as the quick-witted, compassionate man that he was and reveals the brilliant tactics used by Clarence Darrow to undercut his opponent. Definitive and compelling, Reaping the Whirlwind puts the past in perspective and plots a roadmap to the present. Have you ever wanted to know the truth behind the famous Scopes trial but didn't want to take the time to pour over dry documents? Rosey Dow has woven a thrilling murder mystery around the actual historic facts of the trial, providing the reader an intriguing and entertaining way to understand the impact of this famous trial. A captivating story that makes history come alive?",
  "genres": [
    "Mystery",
    "Historical",
    "Fiction"
  ],
  "author": "Rosey Dow",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/1110191.Reaping_the_Whirlwind"
}