{
  "title": "The Invasion of Heaven",
  "description": "Psychologist Loche Newirth becomes hunted when he sees a painting that opens a window onto the afterlife. An ancient order of men seeking to control the art pursue him across the world through centuries, into madness and beyond. The first part of Michael B. Koep's The Newirth Mythology-The Invasion of Heaven is mystery, adventure, myth, betrayal, murder and madness.Psychologist Loche Newirth wonders if it was his fall: the fifty foot drop rom the rocky cliff to the icy water below. Is this why he has been hallucinating? Or is it because one of his clients is dead, or his mentor has gone mad or that his wife is leaving him? He can't bring himself to believe what he has been seeing. Insane things like a massive, searching eye. He sees it in the water below the cliff. He sees it in mirrors, on walls: a massive, crystal blue iris and fathomless pupil there in the center of his life, looking at him.To find the answer, Loche pens the recent events of his life into a book and leaves the work behind for his mentor, Doctor Marcus Reardon, to interpret. As Reardon reads, he plunges into the harrowing depths of Loche's reality:his loss of a client, the discovery of an unknown past, an ancient conflict over possession of the human condition, the awesome reality of the gods walking among us, and the crimes of humanity invading the hope that lies beyond the grave.And along the way, Loche tells of unforgettable characters: the torn and manic housewife that teeters on the edge of sanity, and the depressed, swashbuckling swordsman that believes he is over six hundred years old, the stoned and prolific painter and his perilous work he must keep secret, and the beautiful business woman that abandons her life's work for a love she never expected.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Mystery",
    "Science Fiction",
    "Mythology",
    "Audiobook",
    "Adventure"
  ],
  "author": "Michael B. Koep",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/19774312-the-invasion-of-heaven"
}