{
  "title": "Tony Visconti: The Autobiography: Bowie, Bolan and the Brooklyn Boy. A nostalgic journey through the golden age of British pop and rock music",
  "description": "A name synonymous with ground-breaking music, Tony Visconti has worked with the most dynamic and influential names in pop, from T.Rex and Iggy Pop to David Bowie and U2. This is the compelling life story of the man who helped shape music history, and gives a unique, first-hand insight into life in London during the late 1960s and '70s. This memoir takes you on a roller-coaster journey through the glory days of pop music, when men wore sequins and pop could truly rock. Featuring behind-the-scenes stories of big names such as Bowie, Visconti's unique access to the hottest talent, both on stage and off, for over five decades is complemented by unseen photographs from his own personal archive, offering a glimpse at music history that few have witnessed so intimately. Soon after abandoning his native New York to pursue his musical career in the UK, Visconti was soon in the thick of the emerging glam rock movement, launching T.Rex to commercial success and working with the then-unknown David Bowie. Since his fateful move to the land of tea and beer drunk straight from the can, Visconti has worked with such names as T.Rex, Thin Lizzy, Wings, The Boomtown Rats, Marsha Hunt, Procol Harum, and more recently Ziggy Marley, Mercury Rev, the Manic Street Preachers and Morrissey on his acclaimed new album 'Ringleader of the Tormentors'. Even Visconti's personal life betrays an existence utterly immersed in music. Married to first to Siegrid Berman, then to Mary Hopkin and later to May Pang, he counts many of the musicians and producers he has worked with as close friends and is himself a celebrated musician.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Autobiography",
    "Rock N Roll",
    "Collections",
    "Memoir"
  ],
  "author": "Tony Visconti",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/1978034.Tony_Visconti"
}