{
  "title": "Fires of Aggar",
  "description": "Once, long ago, the Council of Aggar sought the help of Diana n'Athena. Bonded to the Blue-Sighted Shadow Elana, the Amazon and her new love successfully adverted an intergalactic conflict that would that destroyed the planet. But over the course of generations, the folly of the Terran Galactic Empire brought war after all and Aggar was again in danger.This time the dey Sorormin Amazons responded with an entire fleet. The metal-poor Aggar would be eradicated without their guardianship and so they came. They brought the technologies and the raw materials Aggar would need to survive, and they brought their families, their livestock and choice crops. For everyone knew, that even before the warring was done, space travel would be a thing of the past, too dangerous to attempt. The Amazons would come to call Aggar home.Gwyn, dey Sorormin and Royal Marshal, is called to the aid of Llinolae, a Blue-Sighted woman and Ruler of Khirla. The brigand Terran Clan is launching bloody raids on Khirla and may be behind a traitorous plot within Llinolae's own household. Llinolae's gift allows her to see out-of-time to receive council from a very precious couple -- one Amazon, one Blue-Sighted -- but even that is not enough.With the help of Gwyn's bond-mated Sandwolves, and friends Brit n'Minona and the Shadow Sparrow n'Sappho, Gwyn and Llinolae struggle side-by-side against the Clan and find themselves caught in an ever-strengthening bond of love.The excitement, romance and epic adventure of Shadows of Aggar has returned. Sword fights, magical duels, sharp wits and mythical creatures, all converge among the giant trees of Aggar's forests, returning readers everywhere to a beloved world.More like Fires of Aggar from Blue Forge Keeper of the Piece by Lesley DavisConstellations of the Heart by Lesley DavisWoven in Life's Tapestry by Lesley DavisCast a Wide Circle by Lesley DavisA Touch of Alchemy by Lesley Davis",
  "genres": [
    "Fantasy",
    "Lesbian",
    "LGBT",
    "Romance",
    "Lesbian Romance",
    "Audiobook",
    "Science Fiction"
  ],
  "author": "Chris Anne Wolfe",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/10122383-fires-of-aggar"
}