{
  "title": "The Lady, Her Lover, and Her Lord",
  "description": "\"If you want to know the secret to a fulfilling life as a lady, if you want to know how to strengthen your relationship with your love, and most of all, if you want to establish a stronger fellowship with your Lord, then this book is for you. Bishop T. D. Jakes is a breath of fresh air as he shares important principles with every woman desiring to live a more positive and productive life. Take it from me, the material within this book does make a difference.\"--Natalie Cole on The Lady, Her Lover, and Her LordJuly 1998With his bestseller Woman, Thou Art Loosed!, Bishop T. D. Jakes showed women across the country how to heal the emotional scars left by the verbal, sexual, physical, and emotional abuse suffered at the hands of the men in their lives. Now Jakes has written The Lady, Her Lover, and Her Lord, the progressive next step for healing past injuries and moving forward into the future. The hugely popular Pentecostal pastor points out how our society demands women to be sweet, sexy, and submissive. Society demands women to be anything and everything but the one thing God wants them to be: real. Jakes advises women who want to transform old pain into fuel for future accomplishment and achievement. The Lady, Her Lover, and Her Lord serves as a dialogue between the genders, not a monologue for one gender. Jakes's answer to creating balance and fulfillment in life focuses on the three crucial relationships in a woman's life: with herself, with her man, and with God. Jakes redirects the expectations characteristic of failed relationships by discussing the many things women often want from their man that can be truly fulfilled only by God.Each chapter of The Lady, Her Lover, and Her Lord provides readers with a unique aspect of Bishop Jakes's message. Some examples:* \"Falling in Love with Yourself\": Jakes examines the importance of self-love and the role it plays in our relationships with others.* \"Embracing Someone Else\": a look at the search for a life partner. Jakes points out that we often choose partners because they are physically appealing, only to find out that there is not enough inner attraction to sustain such a relationship.* \"Pillow Talk\": an exploration of what happens to relationships when we become the victim of hateful, thoughtless words, and what that can do to a relationship.* \"Serving the Lord and Making Money\": a look at money, wealth, and financial strength in the Christian life. Jakes concludes by reminding readers of God's capacity when things go wrong.",
  "genres": [
    "Christian",
    "Spirituality",
    "Christianity",
    "Nonfiction",
    "Self Help",
    "Marriage",
    "Religion"
  ],
  "author": "T.D. Jakes",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/197742.The_Lady_Her_Lover_and_Her_Lord"
}