{
  "title": "The Dead Sea Scrolls: A New Translation",
  "description": "The Dead Sea Scrolls: A New Translation is a landmark work that brings to life the long-inaccessible scrolls of Qumran. Three translators at the forefront of modern scrolls scholarship reveal the rich tapestry of writings known as the Dead Sea Scrolls. This is the most comprehensive translation ever compiled for general readers in any language. Translated into English, it contains virtually every legible portion of the fragmented scrolls, including revelatory information on early Xianity & its roots deeper than previously realized in ancient Judaism. Included also are scroll fragments that promise to alter views of biblical history, including never-before released texts & newly discovered writings by & about biblical prophets & ancestors. The translators provide commentary throughout that place the scrolls in their historical context. They also present an introduction giving an overview of their contents & discusses who authored them & why. This book includes:Revelations about biblical history & the roots of Xianity.Never-before-seen stories about the biblical figures Abraham, Jacob & Enoch--including a text explaining why God demanded Isaac's sacrifice.12 extra-biblical texts that claim Mosaic authorship.New psalms attributed to King David & to Joshua.Texts illuminating ancient doctrines about angels & writings claiming to be revelations of angels like Archangel Michael. In their great variety, the Dead Sea Scrolls as captured in this groundbreaking translation offer an unprecedented glimpse of the complex roots of Xianity. Its dozens of never-before-published texts encompass poetry & prose, teaching parables & magical tales, astrology, apocalyptic visions, buried treasure lists, stories of messiahs & antichrists, demons & angels & together comprise a classic of religious history.",
  "genres": [
    "Religion",
    "History",
    "Reference",
    "Nonfiction",
    "Theology",
    "Christian",
    "Christianity"
  ],
  "author": "Michael Owen Wise",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/1977131.The_Dead_Sea_Scrolls"
}