{
  "title": "Fire Exit",
  "description": "The blood that came out of me was blood that ran through her veins. It’s strange: all blood looks the same, yet it’s different, we’re told, in so many various ways and for so many various reasons. But one thing is for certain, I thought: you are who you are, even if you don’t know it. From the porch of his home, Charles Lamosway has watched the life he might have had unfold across the river on Maine’s Penobscot Reservation. On the far bank, he caught brief moments of his neighbor Elizabeth’s life—from the day she came home from the hospital to her early twenties. But there’s always been something deeper and more dangerous than the river that divides him from her and the rest of the tribal community. It’s the secret that Elizabeth is his daughter, a secret Charles is no longer willing to keep. Now, it’s been weeks since he’s seen Elizabeth, and Charles is worried. As he attempts to hold on to and care for what he can—his home and property; his alcoholic, quick-tempered, and bighearted friend Bobby; and his mother, Louise, who is slipping ever deeper into dementia—he becomes increasingly haunted by his past. Forced to confront a lost childhood on the reservation, a love affair cut short, and the death of his beloved stepfather, Fredrick, in a hunting accident—a death he and Louise are at odds over as to where to lay blame—Charles contends with questions he’s long been afraid to ask. Is his secret about Elizabeth his to share? And would his daughter want to know the truth, even if it could cost her everything she’s ever known? From the award-winning author of Night of the Living Rez, Morgan Talty’s debut novel, Fire Exit, is a masterful and unforgettable story of family, legacy, bloodlines, culture and inheritance, and what, if anything, we owe one another",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Contemporary",
    "Indigenous",
    "Audiobook",
    "Native American",
    "Mystery"
  ],
  "author": "Morgan Talty",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/197789783-fire-exit"
}