{
  "title": "Wild for You",
  "description": "From New York Times bestselling author Kristen Proby comes an all-new small-town series set in Montana, starting with WILD FOR YOU, an Age-Gap, Single Dad, Nanny, Grumpy/Sunshine romance!Remington Wild is a single dad of two adorable kids, and as the oldest son of the Wild family, has recently taken over the Wild River Ranch from his father. Life is crazy, and he’s finally willing to admit that he needs help, and the sooner the better. He has no idea that the beautiful woman he sees every day at Bitterroot Valley Coffee Co. is the woman who would show up for the job.Erin Montgomery couldn’t get out of Seattle fast enough. It’s not that she doesn’t love her big, loud family, but living in the big city just wasn’t for her. The minute she stepped foot in Bitterroot Valley, she knew she was home. She loves the slower pace, the friendly people, and her job at the coffee shop. Even the smoking hot grumpy guy who stops in every afternoon can’t put a damper on how much she loves small town life!Thanks to car trouble, and her stubbornness when it comes to using her trust fund, Erin needs a second job and applies for the position of a part-time nanny. She’s surprised to find that it’s Grumpy himself who answers the door at the ranch, but Erin quickly learns that she loves his kids and the ranch, and it’s a no-brainer to take the job. She just has to remind herself to resist the sexy rancher and keep it strictly professional.Remington is attracted to his younger nanny, and finds himself falling headfirst in love with her. He and his kids have never been happier, and he knows she is the perfect addition to their family for as long as she’s willing to stay. Hopefully forever.But when secrets are exposed, one of which endangers his children, will their love survive? Or will it tear them apart?",
  "genres": [
    "Romance",
    "Small Town Romance",
    "Westerns",
    "Contemporary Romance",
    "Audiobook",
    "Contemporary",
    "Romantic Suspense"
  ],
  "author": "Kristen Proby",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/197806181-wild-for-you"
}