{
  "title": "Cortège",
  "description": "Praise for In the Blood\"An astonishing debut by an African-American poet with mandarin grace and surpassing elegance of form married to unflinchingly bold and discerning content. Phillips refuses to write what might be expected of him on any subject, whether it's gender, race, faith, or morality. His reticence, his refusal of polemic, remind me sometimes of the young James Merrill, even of Auden.\"--Marilyn HackerPriase for Cortège\"Carl Phillips is a poet of eros, but for him eros isn't simply sex, or even sexual desire sublimated into social ritual, or art, or any of the overdetermined ploys by which all of us, men and women, heterosexual and homosexual, attempt to close the distance between ourselves and others. Rather, eros is the never ending struggle, as he puts it, 'to fill a space in so there's no room left for awhile for what he surely calls a suffering inside him.' In the intricacies of thinking and feeling enacted in every poem of Cortège, no feeling ever quite escapes its opposite--the joy of fulfilled desire is infused with the isolation it has momentarily eclipsed, the heaven of intimacy only heightens 'how it feels to be stranded.' Cortège is a book that has been packed in salt: the durable salt of artistic making, and the bitter salt of longing. Few other poets writing today can track so well, so unforgettably, the estranging spaces in the heart of love, the perils of beauty or the beauty of peril.\"--Alan Shapiro\"Out so much farther than our present pieties, attentive to no social or sentimental voice, only passion's (so often ruinous, defiant of upshot), it is not in every case, every poem, that Carl Phillips triumphs over my timidity. As with Sappho and Pasolini, though, traces of the winged god are everywhere unmistakable, even when this new poet has kicked them over: it is a sacred entail his harsh graces make. I for one am an awed (if lacerated) heir.\"--Richard HowardCarl Phillips is author of In the Blood, winner of the 1992 Morse Poetry Prize. He is a recipient of an Academy of American Poets Prize, and has published widely in journals including the dn0 Kenyon Review, the Paris Review, and the Yale Review. Phillips teaches at Washington University in St. Louis and is currently visiting assistant professor of creative writing at Harvard University.",
  "genres": [
    "Poetry"
  ],
  "author": "Carl Phillips",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/197984.Cort_ge"
}