{
  "title": "The Safeguard of the Sea: A Naval History of Britain, 660-1649",
  "description": "\"[An] awesomely scholarly study. . . . The importance of this book is not only in its intrinsic interest, or its usefulness as a superb resource, but its demonstration that [Britain's] story cannot be told without a thorough knowledge of what happened at sea.\"―Alan Judd, Sunday Times [London] Throughout the chronicle of Britain's history, one factor above all others has determined the fate of kings, the security of trade, and the integrity of the realm. Without its navy, Britain would have been a weakling among the nations of Europe, could never have built or maintained the empire, and in all likelihood would have been overrun by the armies of Napoleon and Hitler. Now, for the first time in nearly a century, a prominent naval historian has undertaken a comprehensive account of the history and traditions of this most essential institution. N. A. M. Rodger has produced a superb work, combining scholarship with narrative, that demonstrates how the political and social history of Britain has been inextricably intertwined with the strength-or weakness-of her seapower. From the early military campaigns against the Vikings to the defeat of the great Spanish Armada in the reign of Elizabeth I, this volume touches on some of the most colorful characters in British history. It also provides fascinating details on naval construction, logistics, health, diet, and weaponry. \"A splendid book. It combines impressively detailed research with breadth of perception....[Rodger] has prepared an admirable historical record that will be read and reread in the years ahead.\"― Times [London] 24 pages of illustrations",
  "genres": [
    "History",
    "Nonfiction",
    "Naval History",
    "Medieval",
    "War",
    "British Literature",
    "Military Fiction"
  ],
  "author": "N.A.M. Rodger",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/1110295.The_Safeguard_of_the_Sea"
}