{
  "title": "The Last Time You Called",
  "description": "ONLINE COUNSELLING. IT’S ALL FUN AND GAMES, UNTIL SOMEONE TURNS UP DEAD.Cat has two names. Two careers. Two lives. By day, she teaches English at a private academy in her home country of South Africa. By night, she’s living her dream of being an online counsellor on a mental health app. She’d be a full-time counsellor if she could, but it doesn’t pay the bills.Then her flatmates move out suddenly, leaving her without a roof over her head. As the pressure mounts for Cat to find a steady job, she gets a ‘too good to be true’ offer to teach English in a small town in Spain. With free accommodation, a monthly allowance and her work visa taken care of, it seems like the perfect opportunity to buy some time and reassess her options.But when Cat arrives in town, she soon realises she’s not the only one with something to hide. Her host family isn’t who they say they are. Her new colleagues at the academy are avoiding her. She’s sure she’s being watched.Six months earlier, Lisa arrived in Spain to start a new life. But it’s nothing like what she’d imagined. Her future mother-in-law seems to hate her, her fiancé is constantly distracted, and his estranged sister is hiding something. She strikes up an unlikely friendship with an older British couple next door, but even they seem strangely reserved. Then things start unravelling, and fast. As Lisa makes one shocking discovery after the next, her world spirals dangerously out of control.As the two women’s fates intertwine, Cat must come to terms with her past and ask herself the question she’s been running from all along: is she capable of pushing someone over the edge?Fast-paced, with numerous twists and turns, THE LAST TIME YOU CALLED is a story of how every action has consequences, and despite our best efforts to conceal the truth, it always comes out.",
  "genres": [],
  "author": "Carmi Heyman",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/197987518-the-last-time-you-called"
}