{
  "title": "Sins of the Assassin",
  "description": "Colossal in concept, dazzlingly plotted, filled with vivid, jaw-dropping violence, \"Sins of the Assassin\" confirms Robert Ferrigno as the modern master of the futuristic thriller.In the second book of Ferrigno's spectacular Assassin Trilogy, Rakkim Epps battles radical fundamentalist forces in a futuristic America, now a divided blood-soaked dystopia. Will he survive? Can America ever be unified again?The year is 2043. New York and Washington, D.C., have been leveled by nuclear bombs. New Orleans is submerged beneath fifty feet of water and treasure hunters scavenge its watery ruins. The United States no longer exists, and in its place two new nations maintain an uneasy coexistence.To the west stretches the Islamic Republic, seemingly governed by a moderate president but hollowed from within by the violent, repressive Black Robes, a shadowy fundamentalist group intent on crushing all those who do not follow Allah's path. In this frightening world, freedom is controlled by the state, and non-Muslims are either second-class citizens, hidden underground, exiled, or executed.To the east and south lies the Christian Bible Belt, itself torn by conflict from warring factions, each claiming to be more righteous than the others. Meanwhile the former United States is being nibbled away at the edges: South Florida, known as \"Nuevo Florida,\" is independent; the Aztlan Empire, formerly Mexico, encroaches from the south; and Canada has laid claim to huge swaths of territory along the United States's former northern border.What stability exists between the warring empires is threatened when the president of the Islamic Republic discovers that a Bible Belt warlord, known simply as the Colonel, is searching for a superweapon hidden inside a remote mountain decades earlier by the old United States regime. Rakkim Epps, retired shadow warrior, is sent on a perilous mission to infiltrate the Belt and steal or destroy the weapon. Accompanying Rakkim is Leo, a naive nineteen-year-old whose technologically enhanced brain is crucial to their success.Together they sneak through the Belt, a lawless territory where a bloodthirsty, drug-addled militia prepares for the End-Times.When Rakkim and Leo finally reach the Colonel's mountain, Epps is forced to rely on his shadow warrior's ability to kill any and all who would halt his quest. Opposing him is the Colonel's enforcer, a sadistic, carbon-skinned killer named Gravenholtz, and the Colonel's wife, the alluring, sexually rapacious Baby, who wants -- and gets -- more of everything. Meanwhile, the Old One, the ancient and immensely rich Muslim fanatic who seeks to rule both American nations, plots his attack from the safety of his ocean liner. Rakkim Epps, he realizes, must be stopped, controlled, or killed.A terrific stand-alone read, \"Sins of the Assassin\" is a cinematic feast of action and plot, and verifies Robert Ferrigno's Assassin Trilogy as a monumental imaginative work of suspense.",
  "genres": [
    "Fiction",
    "Thriller",
    "Science Fiction",
    "Dystopia",
    "Alternate History",
    "Speculative Fiction",
    "Fantasy"
  ],
  "author": "Robert Ferrigno",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/1979253.Sins_of_the_Assassin"
}