{
  "title": "An Imperfect Gentleman",
  "description": "Ruined in the eyes of society, and removed from the only world they’d ever known, the Nightingale siblings vow never to be victims again. They will build their new life on what they’d once ignored. Being a clairvoyant is an excellent survival skill.A power he vows will not control him…After society turned its back on the Nightingales, Alexander knew it was time to face what he’d always denied. From a young age, he’d shut out the voices inside his head, but now being able to talk to the dead was a skill he could no longer ignore.When a persistent voice from the past insists he approach an angry protester, he gets more than he’d bargained for. Dragged into the melee, he is soon holding a placard beside the intriguingly lovely Harriet Shaw.A woman with strong convictions and a burning need for change. Harriet was also determined to set right the wrongs of her past, and Alex was just the man to keep her safe.To go forward, she must first look back…Raised with wealth and privilege in America, Harriet arrived in London, excited for her family’s new adventure. Desperate to be the perfect society miss, her parents allow her to attend a private school for young ladies.After a year of torment that ends in scandal, she was sent home, and in that moment, truly understood how controlled a woman’s life could be. She vows to do something to change that.Harriet is stunned when Alexander Nightingale tells her an old friend from the past has a message for her. Will she finally find the truth about her friend's disappearance, and can she trust the enigmatic Alex to help?Can Alex break through Harriet’s barriers and help her solve a mystery while convincing her to take a chance on love?Books in The Notorious Nightingales SeriesThe Disgraced DebutanteAn Imperfect Gentleman",
  "genres": [
    "Romance",
    "Paranormal",
    "Fantasy",
    "Historical",
    "Historical Romance"
  ],
  "author": "Wendy Vella",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/197894902-an-imperfect-gentleman"
}