{
  "title": "The Neurobiology of Learning and Memory",
  "description": "To understand how the brain learns and remembers requires an integration of psychological concepts and behavioral methods with mechanisms of synaptic plasticity and systems neuroscience. The Neurobiology of Learning and Memory , Second Edition, provides a synthesis of this interdisciplinaryfield. Each chapter makes the key concepts transparent and accessible to a reader with minimal background in either neurobiology or psychology and is extensively illustrated with full-color photographs and figures depicting important concepts and experimental data. Like the First Edition, the SecondEdition is organized into three parts. However, each part has been expanded to include new chapters or reorganized to incorporate new findings and concepts.Part One introduces the idea that synapses modified by experience provide the basis for memory storage. It next describes the long-term potentiation methodology used to study how synapses are modified and concepts needed to understand the organization of synapses. The remaining chapters areorganized around the idea that the synaptic changes that support long-term potentiation evolve in four overlapping stages referred to as (a) generation, (b) stabilization, (c) consolidation, and (d) maintenance. The goal of each chapter is to reveal that each stage depends on unique molecularprocesses and to describe what they are.Part Two builds on this foundation to show how molecules and cellular processes that have been identified from studies of synaptic plasticity also participate in the making of memories. It discusses some of the basic conceptual issues researchers face in trying to relate memory to synaptic moleculesand describes some of the behavioral and neurobiological methods that are used. The chapters describing the processes involved in memory formation and consolidation have been extensively modified to provide a more detailed account of the molecular events that are engaged to ensure that establishedmemories endure. The chapters on memory modulation and the fate of retrieved memories have been extensively modified to provide a more in-depth account of the relevant processes.Part Three is organized around the multiple memory systems view--that different neural systems have evolved to store the content contained in our experience. It features discussion of the medial-temporal hippocampal system that supports episodic memory, the concept of systems consolidation, and itsrelationship to Ribot's law--that memories become resistant to disruption as they age. The cortical-striatal system and its relationship to what are called behavioral actions and habits is described, and the book ends with a discussion of neural systems involved in the acquisition and removal ofemotional memories.",
  "genres": [
    "Neuroscience",
    "Textbooks"
  ],
  "author": "Jerry W. Rudy",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/19804829-the-neurobiology-of-learning-and-memory"
}