{
  "title": "The Lost Ark of the Covenant: Solving the 2,500-Year-Old Mystery of the Fabled Biblical Ark",
  "description": "The Lost Ark of the Covenant is the real-life account of an astounding quest—professor Tudor Parfitt's effort to recover the revered artifact that contained the Ten Commandments, sacred to Judaism, Christianity, and Islam. This holy object disappeared from the Temple when the Babylonians invaded Jerusalem in 586 BC and was lost—apparently forever. According to the biblical account, the Ark was built at the command of God, in accord with Moses's prophetic vision on Mount Sinai. The Ark, believed to be the throne of God, was carried by the Israelite high priests in the wilderness during their harrowing search for a homeland. When the Babylonians destroyed Jerusalem, the Ark entered the domain of legend. The mysterious disappearance of arguably the most important religious artifact in history led to a plethora of theories about the location of the Ark. Its whereabouts unknown, adventurers risked their lives and fortunes for over two millennia in attempts to discover this sacred treasure. With painstaking historical scholarship, groundbreaking genetic science, and hair-raising fieldwork, Parfitt, who the Wall Street Journal calls \"a British Indiana Jones,\" debunks the previous myths and reveals the shocking history of the Ark and its keepers. From Israel to Egypt, Ethiopia, and the ruins of Great Zimbabwe, the journey leads to places Parfitt could never have imagined. He encounters a cannibalistic tribe in Papua, New Guinea. He is ambushed and shot at in Africa. And he narrowly escapes being kidnapped by Islamist outlaws in the wilder reaches of Yemen.Throughout his search, he is aided by a motley crew of kabbalistic mystics, Muslim holy men, charlatans and crooks, tribal elders, and scheming politicians. The Lost Ark of the Covenant is a vivid and page-turning account of the culmination of two decades of research by an acclaimed scholar and adventurer. In the end, legend becomes reality as an unknown history comes to light, and with it our understanding of this lost treasure is changed forever.",
  "genres": [
    "History",
    "Religion",
    "Nonfiction",
    "Archaeology",
    "Ancient History",
    "Audiobook",
    "Judaism"
  ],
  "author": "Tudor Parfitt",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/1979858.The_Lost_Ark_of_the_Covenant"
}