{
  "title": "The Anatomy of Deception",
  "description": "A mesmerizing forensic thriller that thrusts the reader into the operating rooms, drawing rooms, and back alleys of 1889 Philadelphia, as a young doctor grapples with the principles of scientific process to track a daring killer.In the morgue of a Philadelphia hospital, a group of physicians open a coffin and uncover the corpse of a beautiful young woman. What they see takes their breath away. Within days, one of them strongly suspects that he knows the woman’s identity…and the horrifying events that led to her death.But in this richly atmospheric novel–an ingenious blend of history, suspense and early forensic science–the most compelling chapter is yet to come, as young Ephraim Carroll is plunged into a maze of murder, secrets and unimaginable crimes....Dr. Ephraim Carroll came to Philadelphia to study with a leading professor, the brilliant William Osler, believing that he would gain the power to save countless lives. As America hurtles toward a new century, medicine is changing rapidly, in part due to the legalization of autopsy–a crime only a few years before. But Carroll and his mentor are at odds over what they glimpsed that morning in the hospital’s Dead House. And when a second mysterious death is determined to have been a ruthless murder, Carroll can feel the darkness gathering around him–and he ignites an investigation of his own.Soon he is moving between the realm of elite medicine, Philadelphia high society, and a teeming badlands of criminality and sexual depravity along the city’s fetid waterfront. With a wealthy, seductive woman clouding his vision, the controversial artist Thomas Eakins sowing scandal, and the secrets of the nation’s powerful surgeons unraveling around him, Carroll is forced to confront an agonizing moral choice–between exposing a killer, undoing a wrong, and, quite possibly, protecting the future of medicine itself….",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Historical",
    "Thriller",
    "Historical Mystery",
    "Mystery Thriller"
  ],
  "author": "Lawrence Goldstone",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/1979852.The_Anatomy_of_Deception"
}