{
  "title": "Sister in Law: Shocking True Stories of Fighting for Justice in a Legal System Designed by Men",
  "description": "For more than quarter of a century Harriet Wistrich has fought the corner of people from all walks of life let down by our justice system. When Sally Challen won her appeal to overturn her conviction for the murder of her coercively controlling husband, it was with Harriet Wistrich at her side. When victims of taxi driver and serial rapist John Worboys successfully took the Metropolitan Police to court for their investigative failures, and then, four years later, helped to hold the Parole Board to account for their decision to grant his early release from prison, the solicitor acting for them was Harriet Wistrich. It was Harriet who represented a pioneering group of the women caught up in the ‘spy cops’ scandal – women deceived into forming long-term relationships with men later revealed to be undercover police officers embedded within their communities. In a remarkable legal career, Harriet has been at the forefront of some historic and ground-breaking legal victories. Frequently working with women who have survived male violence or abuse, sometimes with the bereaved families of those who did not survive, her work has led her to challenge the police, CPS, government departments and the prison and immigration detention system. In Sister in Law, she tells the shocking stories of some of those who have come to her for assistance and shines a feminist light on the landscape of arcane laws and byzantine systems, skewed towards male behaviour and responses, through which she has steered them. Litigation can be a long and rocky path of pitfalls and dead ends and there are defeats as well as gains, hours of painstaking work as well as courtroom drama. It takes collaboration, extraordinary tenacity and huge compassion, but Harriet Wistrich is proof that it is possible to demand better justice and to bring about important change.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "True Crime",
    "Law",
    "Audiobook",
    "Social Justice",
    "History"
  ],
  "author": "Harriet Wistrich",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/197913429-sister-in-law"
}