{
  "title": "All Things Are Possible: The Healing and Charismatic Revivals in Modern America",
  "description": "\" . . . a book about healing revivalists that takes them seriously and treats them fairly.\" ―Journal of Southern History\" . . . will be a definitive work for some years to come.\" ―Reviews in American History\"Harrell has obviously attended countless rallies, read sheafs of literature, and personally interviewed many of the principals. He . . . tell[s] the story in a largely biographical format. This makes for lively reading.\" ―Harvey G. Cox, New York Times Book Review\" . . . will attract readers interested in the reasons behind the various fat and lean periods among revivalists.\" ―Publishers Weekly\"All Things Are Possible is the first book to tell the story of the enterprisers who have personal followings. The narrative is full of of seriousness and scandal strangely blended. Professor Harrell has done a staggering amount of research in hard to discover sources; his scholarship is impressive and he is eminently fair-minded. Here is a missing link in the chain of American religious movements.\" ―Martin E. Marty, The University of Chicago Divinity School\"Harrell's book will doubtless be the definitive work on the subject for a long while―who else will wade through Healing Waters and Miracle Magazine with such fastidious care?\" ―The Kirkus ReviewsThis is the first objective history of the great revivals that swept the country after World War II. It tells the story of the victories and defeats of such giants of the revival as William Branham, Oral Roberts, Jack Coe, T. L. Osborn, A. A. Allen. It also tells of the powerful present day evangelists who are carrying on the revival, including Robert Schambach and Morris Cerullo. The book includes pictures of Schambach, Allen, Cerullo, Branham, Roberts, Osborn, Coe and many others. Those who lived through the great revival of the 1950's and 1960's will be thrilled to read about those exciting days. Those who do not remember those days need to read this book to see what has led us up to this present moment in time.David Edwin Harrell, Jr. is a professor of history at the University of Alabama in Birmingham. He has tried to write this book in an objective way, although you may not agree with all that he says. Dr. Harrell has visited Schambach revivals.",
  "genres": [
    "Church History",
    "Religion",
    "Christian",
    "Biography",
    "History",
    "Theology"
  ],
  "author": "David Edwin Harrell Jr.",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/1982517.All_Things_Are_Possible"
}