{
  "title": "Moosewood Restaurant Low-Fat Favorites: Flavorful Recipes for Healthful Meals",
  "description": "This is the low-fat book cooks who care about wholesome, vegetarian-inspired food have been waiting for, with more than 280 recipes that are as delicious and trustworthy as those in the Moosewood Collective's previous books.With fourteen chapters, ranging from savory soups and main course salads to creative side dishes and aromatic Mediterranean and Asian-inspired dishes, fat will not be missed in mouthwatering recipes like Guacamole with Asparagus, Chinese Orzo Vegetable Salad, Spring Vegetable Paella, Indian Potato Pancakes, and Creamy Dairyless Rice Pudding. Along with those creative dishes, there are also low-fat variations on familiar favorites such as Macaroni and Cheese, Shephard's Pie, and Dark Chocolate Pudding. An added the Moosewood Collective has made sure that the ingredients used in the recipes throughout the book are easily found in most well-stocked supermarkets. Along with nutritional and glossary guides that provide explanations of nutritional terms, instructions for how to glean the information you need from nutrition labels, a brief overview of vitamins and minerals, and guides to ingredients and cooking techniques, the Collective also offers tips and ideas for sustaining a low-fat lifestyle. They bake rather than fry, replace high-fat ingredients with healthy substitutes (no artificial ingredients allowed!), and use butter and oil very moderately, so that what is lost in fat is gained in bold, intense flavors. Moosewood Restaurant Low-fat Favorites is sure to set the kitchen standard not only for health-conscious cooks, but also for those who have come to rely on the Moosewood Collective's easy, earthy approach to cooking.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Vegetarian",
    "Reference",
    "Food and Drink"
  ],
  "author": "The Moosewood Collective",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/198176.Moosewood_Restaurant_Low_Fat_Favorites"
}