{
  "title": "Late Cainozoic Floras of Iceland: 15 Million Years of Vegetation and Climate History in the Northern North Atlantic",
  "description": "Being the only place in the northern North Atlantic yielding late Cainozoic terrestrial sediments rich in plant fossils, Iceland provides a unique archive for vegetation and climate development in this region. This book includes the complete plant fossil record from Iceland spanning the past 15 million years. Eleven sedimentary rock formations containing over 320 plant taxa are described. For each flora, palaeoecology and floristic affinities within the Northern Hemisphere are established. The exceptional fossil record allows a deeper understanding of the role of the “North Atlantic Land Bridge” for intercontinental plant migration and of the Gulf Stream-North Atlantic Current system for regional climatic evolution. ’Iceland sits as a “fossil trap” on one of the most interesting biogeographic exchange routes on the planet - the North Atlantic. The fossil floras of Iceland document both local vegetational response to global climate change, and more importantly, help to document the nature of biotic migration across the North Atlantic in the last 15 million years. In this state-of-the-art volume, the authors place sequential floras in their paleogeographic, paleoclimatic and geologic context, and extract a detailed history of biotic response to the dynamics of physical change.’ Bruce H. Tiffney , University of California, Santa Barbara   ’This beautifully-illustrated monograph of the macro- and microfloras from the late Cenozoic of Iceland is a worthy successor to Oswald Heer’s “Flora fossilis arctica”. Its broad scope makes it a must for all scientists interested in climatic change and palaeobiogeography in the North Atlantic region. It will remain a classic for years to come.’ David K. Ferguson , University of Vienna",
  "genres": [],
  "author": "Thomas Denk",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/11103528-late-cainozoic-floras-of-iceland"
}