{
  "title": "The Pretend Christmas Bride",
  "description": "He’s my new bossMy sworn enemyAnd now my arranged husband...Edward Chase. Ex-priest. Now, General Manager of the London Ice Kings hockey team and the new CEO of the Davenport empire.The first time we met I spilt coffee all over his $10,000 suit.He looked at me like I was an inconvenience.I despised him at once.So, imagine my shock when he turns out to be my new boss?He’s stern, forbidding and determined never to love again.I’m a curvy romantic, who believes in happily ever afters.He’s heartless......and will stop at nothing to make his inherited company a success.Including agreeing to a marriage of convenience...But when his bride doesn’t turn up for the wedding,He insists I stand in.With conditions...We will not share a bed.There will be no feelings involved.We will be strangers bound only by duty.I want to refuse,We’re opposites after all....but this is my chance to escape my hateful step-mother and step-sisters.Staying under his roof, the chemistry between us escalates.When my new husband calls me ‘my wife’ in front of our families and friends,I hope he has feelings for me.And when we’re trapped in a lighthouse with only one bed, over Christmas... I know he does.But what happens when he reveals his secret...?Filled with forbidden longing where every stolen moment counts, this stand alone forced proximity, billionaire holiday romance is an emotional rollercoaster, where she falls first, but he falls harder. A journey from enemies to lovers, this is a multilayered winter romance of how opposites attract, the power of vulnerability, and the triumph of true love. There is no cheating, no other woman drama and no third act break up. There is however breathtaking angst, heartfelt groveling and an unforgettable HEA . Also a champagne swigging Great Dane who plays matchmaker.",
  "genres": [
    "Romance",
    "Christmas",
    "Holiday",
    "Enemies To Lovers",
    "Contemporary",
    "Plus Size",
    "Adult"
  ],
  "author": "L. Steele",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/198171725-the-pretend-christmas-bride"
}