{
  "title": "Lauren Conrad An L A Candy Novel 3 Books Collection Set",
  "description": "This is a three books collection. Titles in this collection are: L.A. Candy , Sugar and Spice, Sweet Little Lies, Lauren Conrad is best known for starring in the MTV hit series The Hills. Her novels, L.A. Candy and Sweet Little Lies, were #1 New York Times bestsellers. She began her career as a fashion designer in spring 2008 with the debut of the Lauren Conrad Collection and expanded in 2009 with a second line, LC Lauren Conrad, exclusively for Kohl's. She has been featured on the covers of Cosmopolitan, Teen Vogue, Us Weekly, Rolling Stone, and Entertainment Weekly, among others. Lauren also launched the m.powerment by mark charity campaign in 2008. She lives in Los Angeles. Los Angeles is all about the sweet life: hot clubs, cute guys, designer . . . everything. Nineteen-year-old Jane Roberts can't wait to start living it up. She may be in L.A. for an internship, but Jane plans to play as hard as she works, and has enlisted her BFF Scarlett to join in the fun. When Jane and Scarlett are approached by a producer who wants them to be on his new series, a \"reality version of Sex and the City,\" they can hardly believe their luck. Their own show? Yes, please! Soon Jane is TV's hottest star. Fame brings more than she ever imagined possible for a girl from Santa Barbara-free designer clothes, the choicest tables at the most exclusive clubs, invites to Hollywood premieres-and she's lapping up the VIP treatment with her eclectic entourage of new pals. But those same friends who are always up for a wild night are also out for a piece of Jane's spotlight. In a city filled with people chasing after their dreams, it's not long before Jane wakes up to the reality that everyone wants something from her, and nothing is what it seems to be. L.A. Candy is a deliciously entertaining novel about what it's like to come of age in Hollywood while starring in a reality TV show, written by a girl who has experienced it all ...",
  "genres": [],
  "author": "Lauren Conrad",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/19810172-lauren-conrad-an-l-a-candy-novel-3-books-collection-set"
}