{
  "title": "The Crimson Crown",
  "description": "Mirror, mirror, on the wall, who’s the wickedest of them all? Snow White’s dark queen tells her side of the story in the first book of a queer, witchy duology that reimagines the classic fairy tale—from the author of Malice.“An alluring, vengeful origin story that brings tremendous dimension to a classic fairytale.”—Chloe Gong, New York Times bestselling author of Immortal LongingsLegends tell of a witch who became a queen—the heartless villain in the story of Snow White.But now the wicked queen is stepping out of Snow White’s shadow to become the heroine of her own legend.Her real “once upon a time” begins when she is just Ayleth, a young witch who lives in the forest with her coven. The witches practice their magic in secret, hiding from the White King and his brutal war against witchcraft.Ayleth, however, faces a war of her own. Her magical gifts have yet to reveal themselves, and as the threat of the Royal Huntsmen intensifies, Ayleth fears she will never become the witch her coven needs.To prove herself, Ayleth sets out on a perilous quest that sends her to the White Palace, a decadent world of drama and deceit. There, Ayleth encounters an unlikely figure from her past: Jacquetta, a witch who once held Ayleth’s heart—and betrayed her.As events at the palace escalate, Ayleth finds herself caught in the web of the White King, whose dark charisma is as dangerous as the sinister force that seems to be haunting the palace—and perhaps even Ayleth herself. With the threat of discovery looming, Ayleth and Jacquetta must set aside the wounds of their past and work together to survive.As she uncovers the secrets of the White Court—and those of her own heart—Ayleth must find the strength to transform into someone she never imagined she could be.A powerful witch, the very wickedest of them all.Book One in The Crimson Crown series.",
  "genres": [
    "Fantasy",
    "Retellings",
    "LGBT",
    "Lesbian",
    "Romance",
    "Queer",
    "Adult"
  ],
  "author": "Heather   Walter",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/198137736-the-crimson-crown"
}