{
  "title": "King of the Khyber Rifles",
  "description": "Purchase of this book includes free trial access to www.million-books.com where you can read more than a million books for free. This is an OCR edition with typos. Excerpt from Lie to a liar, for lies are his coin. Steal from a thief, for that is easy. Set a trap for a trickster, and catch him at the first. attempt. But beware of the man who has no axe to grind. Eastern Proverb. CHAPTER III IT was a musty smelling entrance, so dark that to see was scarcely possible after the hot glare outside. Dimly King made out Rewa Gunga mounting stairs to the left and followed him. The stairs wound backward and forward on themselves four times, growing scarcely any lighter as they ascended, until, when he guessed himself two stories at least above road level, there was a sudden blaze of reflected light and he blinked at more mirrors than he could count. They had been swung on hinges suddenly to throw the light full in his face. There were curtains reflected in each mirror, and little glowing lamps, so cunningly arranged that it was not possible to guess which were real and which were not. Rewa Gunga offered no explanation, but stood watching with quiet amusement. He seemed to expect King to take a cWnce and go forward, but if he did he reckoned without his guest. King stood still. Then suddenly, as if she had done it a thousand times before and surprised a thousand people, a little nut-brown maid parted the middle pair of curtains andsaid \"Salaam !\" smiling with teeth that Were as white as porcelain. All the other curtains parted too, so that the whereabouts of the door might still have been in doubt had she not spoken and so distinguished herself from her reflections. King looked scarcely interested and not at all disturbed. Balked of his amusement, Rewa Gunga hurried past him, thrusting the little maid aside, and led the way. King followed him into a long room, whose walls were hung with richer silks than any he remembered to have seen. ...",
  "genres": [
    "Adventure",
    "Fiction",
    "Historical Fiction",
    "Fantasy",
    "Classics",
    "India",
    "Action"
  ],
  "author": "Talbot Mundy",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/1981112.King_of_the_Khyber_Rifles"
}