{
  "title": "Moosewood Restaurant Daily Special: More Than 275 Recipes for Soups, Stews, Salads & Extras",
  "description": "A steaming bowl of soup with fresh bread and a green salad, a tempting combo plate of crisp, complementary salads--these Daily Specials have been staples of Moosewood's ever-changing menu board since the restaurant opened its doors more than twenty-five years ago. Over the years the creative chefs of the Moosewood Collective have introduced literally thousands of new soups and as many salads, all devised to showcase the fresh seasonal produce, vibrant ethnic flavors, and meatless food products that form the core of their cuisine. Now, for the first time, they have gathered the very best offerings from their vast soup and salad repertoire, as well as the ingenious extras that transform these simple dishes into world-class meals. Here are classics like Very Creamy Vegetable Chowder and Tuscan Bean Soup, as well as intriguing new creations like Caribbean Sweet Potato Coconut Soup, Golden Gazpacho, and Fennel Vichyssoise. Salads range from straightforward choices that are easy to mix and match, such as Spinach with Cilantro Cashew Dressing, Mexican Chickpea Salad, or Tunisian Carrot Salad, to satisfying one-dish meals like Broiled Tofu & Sugar Snap Peas or Persian Rice & Pistachio Salad. Each recipe is followed by helpful suggestions for selecting dishes so that creating well-balanced combo plates at home is a snap.There are easy-to-use indexes of recipes by categories including children's favorites, quickly made, low-fat, low-carbohydrate, and vegan dishes. And each recipe has a complete nutritional breakdown, so it's simple to create menus for those with special health or dietary concerns. The section on transforming leftovers into sprightly new dishes also makes Moosewood Restaurant Daily Special a practical primer for those who want to make the most of seasonal bounty.Few foods are more comforting--or satisfying--than a good soup and a well-made salad, and because many can be made ahead and served on demand, they are perfectly suited to the way we eat and live today. With more than 275 kitchen-tested recipes to fit any occasion, Moosewood Restaurant Daily Special offers years' worth of inspiration for Daily Specials every cook will be delighted to serve.Moosewood Inc. and the authors of this book have donated 1 percent of their royalties from Moosewood Restaurant Daily Special to the community food and nutrition programs of the Greater Ithaca Activities Center (G.I.A.C.) in Ithaca, New York.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Vegetarian"
  ],
  "author": "The Moosewood Collective",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/198179.Moosewood_Restaurant_Daily_Special"
}