{
  "title": "Little Dorrit",
  "description": "Clennam rose softly, opened and closed the door without a sound, and passed from the prison, carrying the quiet with him into the turbulent streets.'Introspective and dreamy, Arthur Clennam returns to England from many years abroad to find a people gripped in their self-made social and mental prisons. Against a background of government incompetence and financial scandal, he searches for the key to the affairs of the Dorrit family, prisoners for debt in the Marshalsea. He discovers through the seamstress Amy Dorrit the fulfilment of which he dreams, but only after he learns to understand his own heart. Revelation and redemption hauntDickens's portrayal of human relations as fundamentally distorted by class and money. The swindling financier Merdle, the bureaucratic nightmare of the Circumlocution Office, and a teeming cast of characters display the inadequacy of secular morality in the face of contemporary social and politicalconfusion. Mixing humour and pathos, irony and satire, Dickens's eleventh novel reveals a master of fiction in top form.This new edition, based on the definitive Clarendon text, includes all of Phiz's original illustrations and a wide-ranging introduction highlighting Dickens's move to more personal and spiritual concerns. ABOUT THE SERIES: For over 100 years Oxford World's Classics has made available the widest range of literature from around the globe. Each affordable volume reflects Oxford's commitment to scholarship, providing the most accurate text plus a wealth of other valuable features, including expert introductions by leading authorities, helpful notes to clarify the text, up-to-date bibliographies for further study, and much more.",
  "genres": [
    "Classics",
    "Fiction",
    "Victorian",
    "Literature",
    "19th Century",
    "Historical Fiction",
    "British Literature"
  ],
  "author": "Charles Dickens",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/19815609-little-dorrit"
}