{
  "title": "Heir, Apparently",
  "description": "An American teen learns she may have accidentally married the King of England, only to end up stranded on a tropical island with him in this highly-anticipated sequel to The Prince & The Apocalypse.Freshman year is stressful enough without accidentally being married to the King of England. Of course, Wren Wheeler can’t tell her Northwestern classmates about that; after surviving a narrowly-averted apocalypse over the summer, everyone’s had enough excitement for one lifetime. Wren knows she needs to move on from Theo, but she can’t forget the look in his eyes when he left her on that island in Greece—and also, he took her dog.When an ill-fated attempt to rescue Comet the Apocalypse Dog turns into a chemistry-fueled reunion with Theo that’s caught by the paparazzi, Wren finds herself under the royal spotlight. Suddenly, she’s a problem for “the firm” to solve, and in order to be protected from the rabid press, she’ll have to fly back to London with Theo. Along for the ride are Naomi and Brooke, as well as Theo's siblings, including Henry, the brother he's spent his life being compared to. But because the universe can’t let these two maybe-newlyweds have one conversation in peace, their plane goes down over the Atlantic, crashing on a tropical island in the middle of nowhere.Stranded with no sign of rescue, the group will have to band together against poisonous animals, catastrophic injuries, a brotherly rivalry, and an ill-timed volcano if they’re going to make it out alive. And, scariest of all, Wren and Theo will have to face their feelings for one another and decide what they want their futures to look like—and if that future will be heartbreak, or happily ever after.",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary",
    "Audiobook",
    "Fiction",
    "Contemporary Romance",
    "Adventure"
  ],
  "author": "Kara McDowell",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/198112003-heir-apparently"
}