{
  "title": "Jingle Bell Jilt",
  "description": "ShayI just got dumped…left at the altar! But instead of licking my wounds in the darkness of my apartment, I take the errant advice of my best friend and go on the honeymoon by myself. I mean, who does that? Apparently, me. I do that, even as the universe repeatedly shows me it is a bad idea.Things only get worse when the rental property I’m staying at floods in the middle of the night. What am I supposed to do? It’s Christmas Eve. There is no place else to stay, except at the very handsome landlord's place next door. Surely that won’t be a problem. It's only for a week. It doesn’t matter that he’s handsome, sweet, and everything my ex isn’t, I don’t need—no, I don’t want—a rebound guy.EvanMy old college roommate and his new wife just arrived to stay in my rental property for their honeymoon. Except, my friend isn’t with her. It seems he decided not to show up for the wedding. And he says it’s because of my advice. Crap! Now I have this teary-eyed woman staying in my rental. And from what I’ve heard about her, she may not be completely stable. I should have gone back to New Hampshire for Christmas with my family.Now, because of a broken pipe, she’s staying in my guest room. I may have neglected to mention that her ex and I are friends. But that shouldn’t matter, right? She’ll only be here until New Year’s and then it will be back to business as usual. I don’t want to be that guy. The one who gets his friend’s cast-off. Even if I think he was crazy for letting her go. Now if only I can keep my growing attraction and lips to myself for one measly week.*Part of the Gift-Wrapped Romance series, Merry Kismet is a jilted bride and ex's best friend, sweet and clean romantic comedy. Enjoy all five romances in any Crush by Kasey StocktonMerry Kismet by Anneka WalkerSolo for the Season by Martha KeyesOne Small Secret,/i> by Esther HatchJingle Bell Jilt by Mindy Burbidge Strunk",
  "genres": [
    "Christmas",
    "Romance",
    "Holiday",
    "Contemporary",
    "Clean Romance",
    "Audiobook",
    "Forced Proximity"
  ],
  "author": "Mindy Burbidge  Strunk",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/198331218-jingle-bell-jilt"
}