{
  "title": "Learn Your Lesson",
  "description": "My mother only wanted me to learn one lesson growing up…Men are trash. Her father left her, and then my father left us. Being raised by her and my grandmother, I was surrounded by the reminder to be independent and guard my heart. After my one and only experience with a boy in college fell flatter than a pancake, I realized they were right — and I was content to live the life of a twenty-six-year-old cat lady.Until Will Perry blew my quiet world to smithereens.Starting goalie for the Tampa Bay Ospreys and the kind of hot that scrambles your brain, all I was ever supposed to be to him was his daughter’s kindergarten teacher. Then, in a twist of events, his temporary nanny.But temporary turns to permanent, and when I move into his pool house, everything changes.He’s impossibly grumpy and focused on only two things: hockey, and taking care of his daughter. I’m only focused on using this new income to pay back my student loans. But in that house, I feel his heated gaze beneath that permanent scowl, the way it lingers and warms my skin. And though I know my mother would lose her mind if she knew, my dreams have become midnight fantasies about my long-haired, muscle-lined mystery of a boss.When the tension becomes too much, we break, and we make a deal. He still needs a nanny. I still need a paycheck and for my matriarchy to not disown me. But Will agrees to teach me everything I’ve always wanted to learn, and I’m all too eager to be his student.I can do this. I’m a grown woman. I can explore my sexuality with the hottest goalie on earth and still remain one-hundred percent professional. And I can definitely do it all without catching feelings. I have to.Otherwise, I’ll end up heartbroken in my mother’s arms while she shakes her head and asks me if I’ll ever learn my lesson.___________________________________________TROPES:Pro Hockey RomanceSingle Dad/NannyForced ProximitySpicy LessonsGrumpy SunshineAge GapOpposites AttractFound Family ___________________________________________Learn Your Lesson is book three in the Kings of the Ice series: a series of interconnected standalones following a team of professional hockey players and the women who bring them to their knees. They do not need to be read in order, but you will gain glimpses of future characters/couples in each book.",
  "genres": [
    "Sports Romance",
    "Sports",
    "Hockey",
    "Romance",
    "Forced Proximity",
    "Contemporary Romance",
    "Found Family"
  ],
  "author": "Kandi Steiner",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/198266455-learn-your-lesson"
}