{
  "title": "Saving 6",
  "description": "An epic and unforgettable love story begins in Saving 6, the third book in the international bestselling and TikTok-phenomenon The Boys of Tommen series, from Chloe Walsh.An epic and unforgettable love story begins in Saving 6, the third book in the international bestselling and TikTok-phenomenon The Boys of Tommen series, from Chloe Walsh.The power and pain of first love has never been more deeply felt than in Chloe Walsh's extraordinary stories about the irresistible Boys of Tommen, which will give you the ultimate book hangover.The reader reaction to The Boys of Tommen says it all!'Absolute perfection. This book will ruin you''I have no words as to how heartbreakingly beautiful this book is and the talent of Chloe is unmeasured in my eyes''Chloe Walsh is a genius when it comes to creating characters and writing, making you feel every emotion''There's not enough stars to rate this book it is simply outstanding!'.........................He's a boy who's lost. She's girl who might just be the home he's never had.The second born son in a broken marriage, Joey Lynch has spent a lifetime picking up the pieces of a family unravelling. When his older brother Darren skips town, twelve-year-old Joey finds himself thrown into the role of protector to his younger siblings and mother. Plagued by self-loathing, and furious with the world, he grapples with teenage life, his unwavering sense of duty to his family, while balancing precariously close to a life of addiction that threatens to swallow him whole. The only light in his sea of darkness is his boss's firecracker of a daughter who refuses to back down. A girl who just so happens to be his classmate.Aoife Molloy has never been backwards in coming forward. Her bubbly and self-assured nature has never led her astray. Until her first day of secondary school when she collides with a hot-headed boy who sparks a burning curiosity inside of her that only grows stronger by the day.Falling into a complicated friendship with her father's apprentice, Aoife works to unravels the secrets around Joey Lynch's life - while he desperately fights to keep her out.",
  "genres": [
    "Romance",
    "Friends To Lovers",
    "Sports Romance",
    "Sports",
    "Contemporary",
    "Contemporary Romance",
    "Young Adult"
  ],
  "author": "Chloe Walsh",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/198404979-saving-6"
}