{
  "title": "Mindscapes: Ten Science Fiction and Speculative Fiction Short Stories",
  "description": "This book is a compilation of 10 science fiction and speculative fiction short stories by the author from his two previous short story collections, Book of Dreams and Book of Dreams 2nd Edition, as well as two new stories written in 2013. Its scope extends from the innermost dimensions of the mind to the outer reaches of the universe, focusing from diverse perspectives on some common themes as to the meaning of life, the superlative strength and wrenching weakness of the human spirit, the power of love and the exquisite pain and ecstasy that flesh is heir to in its perpetual struggle between the duality of human nature that reflected both the divine and the profane.In very broad outline, the ten stories involve the following themes:If necessity is the mother of invention, could humanity use present technology to find a way to propagate its seed when faced with the certainty of an extinction-level event in less than two years' time?What really caused the catastrophic failure after the first full-scale test of the Large Hadron Collider? Motivated, ingenious terrorists are about to try their own field experiment to replicate the classified results of the test on a large scale using two suitcase nukes and a modified jetliner in an attack that, if successful, will eradicate all life on earth, destroy our corner of the universe and, in time, give birth to a new addition to the multiverse.If we could communicate with the other sentient, intelligent species with whom we share our planet, what vital lessons might we learn from them and they from us?In a not too distant future in which all human beings on earth are connected and integrated into a single neural net, what price might be exacted for one wishing to opt out?Egyptologists and historians have long debated the riddle of the Sphinx--its true origins, its too-small human head and the pharaoh it was intended to represent. What if the riddle could be revealed live, in prime time, to an attentive world-wide audience upon the excavation of a chamber buried stories beneath its right paw?What price would you pay to revisit a crossroad in your life when you had made a terrible, life altering mistake? Would you give up an unfulfilled life for the chance of virtual happiness in an alternate reality?Would you sacrifice everything if you could attain absolute knowledge? If so, could you live with the knowledge you attained?It is said that no man is an island, but what if even the least among us is a god in his/her own right?If an alien visitor offered you a lifetime of health and the gift of telepathy for a small service, would you be quick to accept?If we purportedly use only a small fraction of our brain's capacity, what possible purpose does the apparently unused portion serve?Above are some of the questions raised in this collection of science fiction and speculative fiction short stories that explores the interrelationship between dreams and reality, the nature of reality itself, and the dangers attendant to the single-minded pursuit of wish fulfillment that all too often results in unexpected and unwanted consequences.The author is an Associate Professor of Legal Studies at Hofstra University's Frank G. Zarb School of Business and has previously published seven non-fiction books through traditional publishers. His business law and legal environment textbooks have been used in colleges and universities throughout the United States since 1993. He has also published a book of poems and the two previous noted books of short stories since 2011.For more information about the author's books, textbooks, scholarly articles and blogs, you can visit victordlopez.com.",
  "genres": [],
  "author": "Victor D. Lopez",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/19842667-mindscapes"
}