{
  "title": "Bad Therapy: Why the Kids Aren't Growing Up",
  "description": "In virtually every way that can be measured, Gen Z's mental health is worse than that of previous generations. Youth suicide rates are climbing, antidepressant prescriptions for children are common, and the proliferation of mental health diagnoses has not stopped the trend. What has gone wrong with our youth? In Bad Therapy , bestselling investigative journalist Abigail Shrier argues that the problem isn't the kids — it's the mental health experts. Mental health care can be lifesaving when properly applied, but that is not what's happening. Instead, children experiencing the normal pangs of adolescence and their anxious parents are seeking answers from therapists, who are only too happy to explore what might be wrong — and to make money doing so. No industry seems to turn away from the possibility of exponential growth, and our mental health industry is no exception. It asks children, again and How do you feel? Are you sure? By treating the well, it is making them sick, feeding normal kids with normal problems into the mental healthcare pipeline. It is minting patients faster than it can cure them. Drawing on extensive research and interviews with doctors, parents, therapists and young people, Shrier enumerates the dangerous side effects of unnecessary or poorly executed mental health care. With clear eyes and compassion, she examines ways worried parents who think they must indulge their child's every feeling make matters worse, and she offers liberating advice for raising emotionally resilient and independent children. Packed with relatable stories, devastating insights, and common-sense conclusions, Bad Therapy is a must-read for anyone concerned about protecting the next generation.",
  "genres": [
    "Nonfiction",
    "Parenting",
    "Psychology",
    "Audiobook",
    "Health",
    "Self Help",
    "Mental Health"
  ],
  "author": "Abigail Shrier",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/198332459-bad-therapy"
}