{
  "title": "Devil's Frost",
  "description": "When the Solstice Stones end in blood and chaos, Lily's destiny and the coven's future hang in the balance.  ***  Every young witch looks forward to her first Solstice Stones. The pride of representing her coven against the warlocks. The rush from her first taste of dark magic.  But a few short minutes into the Stones, and Lily’s lifelong dream turns into a nightmare of pain and regret. Betrayed not once, but twice, her restraint snaps—with dire consequences.  Lily is wracked with guilt and on the run from the powerful Congression, when her broken confidence is further shattered by an ugly secret from the past. As her options dwindle, Lily is forced into a distasteful alliance.  Will she be able to find her way back to the light? Or will darkness consume her before dawn's new day?  About the Author Heidi R. Kling is a YA author of both fantasy and contemporary novels. The bestselling Witch’s Brew Spellspinners 1 (Coliloquy), is the first of a 9-book series, while her debut contemporary, Sea (Penguin), was an IndieNext Pick, Northern California Book of the Year nominee, Gateway Reader’s Award choice. Witch’s Brew Spellspinners 1 launched The Spellspinners of Melas County series in 2012. A serialized saga of estranged witches and warlocks, set in a modern, but fantastical world of a coastal California beach town is told in an innovative “active fiction” format— not unlike the “Choose Your Own Adventure” books we loved as kids. Book two, The Gleaning, followed this past spring. Devil’s Frost, the third book in the series launches November 2013, with six titles to follow. When not penning novels, Heidi contributes short stories and essays to teen lit aimed anthologies such as Truth And Dare, The First Time, A Visitor’s Guide To Mystic Falls, and Two & Twenty Dark Tales, directs and writes children’s theatre and feeds her Damon addiction with lots of CW television. After earning her MFA in Writing for Children from the New School in New York, she returned to her native California where she writes and lives with her husband and two children on the San Francisco peninsula, right over the coastal mountains from the sea. She’s constantly eying seaside eucalyptus groves for signs of warlocks, but sadly hasn’t spotted one. Yet.  Please visit Heidi on the web , on Facebook (Heidi R. Kling) and at her favorite hangout, Twitter!",
  "genres": [
    "Young Adult",
    "Paranormal",
    "Witches",
    "Fantasy"
  ],
  "author": "Heidi R. Kling",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/19826826-devil-s-frost"
}