{
  "title": "Bite of a Scorpio",
  "description": "She is smart, beautiful, controlling, strong, confident, and takes crap from no one. When her life and the life of her friends are in danger. will she let someone else take control to keep them safe?She has a deep seated anger when it comes to people being abused, mentally or physically. Will she let the rage within take over?Every time she is around him there is a chink in her control and when they come together it's explosive. Will she give in? Does she want to give in?This gorgeous, enigmatic man pisses her off every time they are near each other. The sexual tension is thick. How long will it take for him to break down her walls? Joanna Davis has and needs to be in control of her business and personal life. She prides herself in being a beautiful, strong, giving and sometimes intimidating woman in and out of business. There was abuse in her past that still haunts her so she has vowed to never give her heart or her control away. She has built a business that solves problems for many people and most in power. When her employees and her life are threatened she has to increase her security measures. Joanna has no family so she has surrounded herself with a few close girlfriends that she would do anything to keep them safe. Joanna’s friends say the Scorpion within her drives her. When Alexander McCloud of First Security, the best in his field, is thrust into her life the battle of wills begins. He is a devastatingly handsome man with intense brown eyes and body of a God, she can only imagine being beneath him. There’s a magnetic field that pulls Joanna to him and she does not like the loss of control she has when around him. Joanna decides the best course of action is to keep her distance. Alexander has a controlling alpha male personality. He has seen Joanna Davis from afar twice before and even then she took his breath away. When their paths cross in business he believes that fate has brought them together. While trying to keep her safe he vows not rest until he possesses her. Even with the hurt from his past he still has a big heart. Will Joanna let go of some of that control and allow him into her heart? Erotic M/F and F/F scenesThis book will capture your interest and have you obsessed with finding out what happens to the next woman in this tight knit circle.",
  "genres": [],
  "author": "O. Dovey Gray",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/19838037-bite-of-a-scorpio"
}