{
  "title": "When Women Ran Fifth Avenue: Glamour and Power at the Dawn of American Fashion",
  "description": "A glittering, glamorous portrait of the golden age of American department stores and of three visionary women who led them, from the award-winning author of The Plaza .The American department a palace of consumption that epitomized modern consumerism. Every wish could be met under one roof – afternoon tea, a stroll through the latest fashions, a wedding (or funeral) planned. It was a place where women, shopper and shopgirl alike, could stake out a newfound independence. Whether in New York or Chicago or on Main Street, USA, men owned the buildings, but inside, women ruled.In this hothouse atmosphere, three women rose to the top. Hortense Odlum of Bonwit Teller, Dorothy Shaver of Lord & Taylor, and Geraldine Stutz of Henri Bendel's took risks, innovated and competed as very different kinds of career women, forging new paths for the women who followed in their footsteps. In the 1930s, Hortense came to her husband's department store as a housewife tasked with attracting more shoppers like herself, and wound up running the company. Dorothy championed American designers during World War II--before which US fashions were almost exclusively Parisian copies--and beyond, becoming the first businesswoman to earn a salary of more than $1.5 million. And Geraldine re-invented the look of the modern department store in the 1960s, and had a preternatural sense for trends, inspiring a devoted following of ultra-chic shoppers as well as decades of copycats.In When Women Ran Fifth Avenue, journalist Julie Satow draws back the curtain on three American women who made twentieth-century department stores a mecca for women of every age, social class, and ambition. This stylish account, rich with personal drama and trade secrets, captures the department store in all its glitz, decadence, and fun, and showcases the women who made that beautifully curated world go round.",
  "genres": [
    "Nonfiction",
    "History",
    "Fashion",
    "Biography",
    "Audiobook",
    "Feminism",
    "New York"
  ],
  "author": "Julie Satow",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/198563695-when-women-ran-fifth-avenue"
}