{
  "title": "Pack Darling Part One",
  "description": "After surviving childhood at the snooty, stuck-up boarding school for budding omegas, I have everyone convinced I'm a dud.My awakening? Never gonna happen. Heat, mates, and a fairytale pack life? Maybe next reincarnation.All I want is to be left alone.I'm invisible, headed to a blissful solo future until the Wyvern Pack destroys my dream of independence.Atlas, Hunter, Finn, Jett, and Orion are poison candy. They don't want an omega, but they need one, even if there'll never be a real spot for me in their pack.Who needs a pack? I’ll keep myself safe, same as always.I'll never awaken, and I'll never ever give the Wyverns my heart...Because all they'll do is rip me apart .♥ Slow♥ Med/High (spicy MM + MMMMM scenes)♥ Growly alpha males, no shifting♥ Warning : Contains MM content, frequent cursing, and references to past assault that may be disturbing. Author not responsible for ugly crying. Wait for Part 2 if HEA is a requirement.Join the fanpack who are waiting for Pack Darling, Part Two and see if you agree with these readers’ reviews!“Like AJ Merlin's Reckless, Pack Darling fits into that great middle ground … Basically, it's a perfect choice for those who don't want super sweet or super dark. Pack Darling is just right.” – Rambling Reader, Goodreads“I honestly can't give enough stars to this book. I think it easily deserves six, seven or even eight stars, but unfortunately there is no option to add extra stars, so I'm gonna have to go with five and an amazing review. But somehow I doubt a review can really do justice to this amazing book.” – Ines, Goodreads“I love the books that sneak up on you!....Oh my goodness. I have to wait until September for book two. I am dying inside from anticipation. I read this twice in three days! How many more times will I read it between now and then!? I highly recommend this book for people who enjoy Lily Archer's Omega Academy . Pack Darling is similar in awesomeness without aliens. I can't wait to read more by Lola Rock!” - Ali, Have Coffee, Need Books",
  "genres": [
    "Omegaverse",
    "Reverse Harem",
    "Romance",
    "Fantasy",
    "Paranormal",
    "M M Romance",
    "Enemies To Lovers"
  ],
  "author": "Lola Rock",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/198558356-pack-darling-part-one"
}