{
  "title": "The Road to the Country",
  "description": "A sweeping, heart-racing, mystical novel about a university student in Lagos trying to save his brother, and himself, amid the chaos of Nigeria’s civil war—a story of love, friendship, and personal triumph by the two-time Booker Prize finalist and “the heir to Chinua Achebe” (New York Times)“A wondrous novel.”—Nana Kwame Adjei-Brenyah, author of Chain-Gang All Stars, finalist for the National Book Award“Chigozie Obioma is that rare thing: an original. His world is a mix of the real and the folkloric, and his writing sounds like no one else’s.”—The Wall Street JournalThe first images of the vision are grainy—like something seen through wet glass. But slowly it clears, and there appears the figure of a man.Set in Nigeria in the late 1960s, The Road to the Country is the epic story of a shy, bookish student haunted by long-held guilt who must go to war to free himself. When his younger brother disappears as the country explodes in civil war, Kunle must set out on an impossible rescue mission. Kunle’s search for his brother becomes a journey of atonement that will see him conscripted into the breakaway Biafran army and forced to fight a war he hardly understands, all while navigating the prophecies of a local Seer, he who marks Kunle as an abami eda—one who will die and return to life.The story of a young man seeking redemption in a country on fire, Chigozie Obioma’s novel is an odyssey of brotherhood, love, and unimaginable courage set during one of the most devastating conflicts in the history of Africa. Intertwining myth and realism into a thrilling, inspired, and emotionally powerful novel, The Road to the Country is the masterpiece of Chigozie Obioma, a writer Salman Rushdie calls “a major voice” in literature.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Africa",
    "Nigeria",
    "War",
    "Historical",
    "African Literature"
  ],
  "author": "Chigozie Obioma",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/198563650-the-road-to-the-country"
}