{
  "title": "Learning to Forgive",
  "description": "This isn't your Typical Everyday fairytale. This story isn't sweet or sugary. Instead... It's Raw and Dark It's Rough and Dangerous And It's Definitely not for kids under 17 years of age.  So turn back now if you're not ready for Lyric and Blaire's story. Because shit just got Real.   “I’ve learned a lot this past year, but there are two things I’ll never forget: one, People aren’t what they seem, and two, I fucking hate liars.” –Blaire  Blaire Morgan was a quiet, grief stricken girl when she left Mobile, Alabama, a year ago after her brother’s unexpected death. She returns a year later with fresh wounds from another betrayal, and she’s not the same person. A woman letting her tortured past rule her life, her “take no shit” attitude is catching the attention of everyone that crosses her path, including the bad boy front man of Lyrical Obsessions—the new band that plays at Jay Jay’s. When she learns he has something she wants, she plans on doing whatever it takes to get it.  What is a demon? An evil spirit possessing a person, acting as a tormentor in Hell?  Lyric “The Demon” Devereux is that tormentor and Hell is any place he sees fit, either in the fighting ring or on the streets. He killed his first person at seventeen years old, and that list has grown over the years—as well as his list of enemies—but his biggest enemy is himself and he doesn’t know how to win that battle. When Blaire comes into town like wildfire and turns heads, Lyric’s temper emerges—uninvited and unexpected. His plan to stay at a distance for her safety, and his sanity, changes when she continuously shows up with her defiance and seductive pull. He now has no choice but to face his past that could possibly destroy the both of them.   Tempers will detonate. Lust will consume. Truth will destroy. But will love forgive?",
  "genres": [
    "Romance",
    "New Adult",
    "Romantic Suspense",
    "Contemporary Romance",
    "Abuse",
    "New Adult Romance",
    "Contemporary"
  ],
  "author": "R.D. Cole",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/19851890-learning-to-forgive"
}