{
  "title": "The Dude's Guide to Manhood: Finding True Manliness in a World of Counterfeits",
  "description": "Discover the path to true masculinity—to an adventurous life of strength, purpose, and clarity.Didn’t we used to understand manhood? Wasn’t there a time once when it was clear and straightforward? Are we lost?Dudes, look around The trail we once traveled from boyhood to maturity is now so overgrown, it’s almost impossible to trace. Our vision is blurred, rendering the map that previous generations followed unreadable. Our compass needles are spinning in circles, making navigation impossible. We are stuck in dense, dangerous woods, and our communities—the wives, children, friends, and colleagues we could be influencing—are suffering as a result.It can be tempting to give up and, like so many men today, simply exist, but take Now is not the time for men to abandon our quest. We can discover the path to true masculinity—to an adventurous life of strength, purpose, and clarity.In The Dude’s Guide to Manhood, pastor, author and dude Darrin Patrick charts a course back toward real manliness, mapping out a vision to help men find significance and influence in today’s broken, mixed-message culture. Revealing his own frailties and missteps, Patrick doesn’t preach at you but walks with you on a journey toward healing and wholeness.Filled with timeless wisdom, accessible insights and practical guidance, The Dude’s Guide to Manhood issues an encouraging and doable call to all men, whatever your age or stage. We need not settle for wandering aimlessly through our days, wounded, weak, and passive. Instead, we can get back on the trail, embrace our gifts while facing our imperfections, and trust the God of new beginnings to lead us into all that we are destined to forgiven, connected, determined, teachable, content, heroic, and so much more.",
  "genres": [
    "Christian",
    "Christian Living",
    "Christianity",
    "Nonfiction",
    "Discipleship",
    "Theology",
    "Parenting"
  ],
  "author": "Darrin Patrick",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/19849751-the-dude-s-guide-to-manhood"
}