{
  "title": "Alex's Wake: The Tragic Voyage of the St. Louis to Flee Nazi Germany-and a Grandson’s Journey of Love and Remembrance",
  "description": "A tale of two journeys...On May 13, 1939, the luxury liner SS St. Louis sailed away from Hamburg, Germany, bound for Havana, Cuba. On board were more than 900 Jewish refugees fleeing persecution in Nazi Germany. But an indifferent world conspired against them. After being denied landing rights in Havana, the refugees were turned away by the United States and Canada and forced to sail back to Europe, where the gathering storm of the Holocaust awaited them.Two of those refugees were Alex Goldschmidt, a sixty-year-old veteran of World War I, and his seventeen-year-old son Klaus Helmut Goldschmidt. After their trans-Atlantic voyage, they landed in France. They would spend the next three years in one French camp after another before being shipped to Auschwitz in 1942.Sixty-nine years later, Martin Goldsmith, Alex's grandson and Helmut's nephew, retraced their sad journey. Beginning in lower Saxony where Alex was born, Martin spent six weeks on the road and covered more than 5,700 miles, setting foot on the earth Alex and Helmut trod during their final days. Alex's Wake is Martin's eyewitness report.The book offers a compelling history of the voyage of the St. Louis, including testimony from those on board, a tale of espionage, and the brave resolve of Captain Gustav Schroeder. It also offers a harrowing chronicle of the vast network of camps in France, many of which were organized by the French themselves with little or no encouragement from the Germans.But Alex's Wake is also a contemporary travelogue and a heartfelt memoir of a second-generation American Jew trying to make sense of his heritage and to escape the burden of guilt and fear he long thought was his sole inheritance. Setting forth with the irrational, impossible desire to save two members of his family who were murdered ten years before he was born, Goldsmith concludes his journey by coming home to a moving symbol of remembrance at one of the scenes of the crime.",
  "genres": [
    "Nonfiction",
    "Biography",
    "History",
    "Holocaust",
    "World War II",
    "Audiobook",
    "Memoir"
  ],
  "author": "Martin Goldsmith",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/19861757-alex-s-wake"
}