{
  "title": "Hair on Fire: A Heartwarming & Humorous Christmas Memoir",
  "description": "Tired of focusing on the stressful hustle and bustle of December? These delightful stories brim with Christmas nostalgia and heartwarming moments.Are you hoping to rediscover the magic of the winter holidays? Looking for traditional inspiration for your upcoming Xmas parties? Ever wondered what’s behind the twelve days of gift-giving? The daughter of a real cowboy, award-winning author Larada Horner-Miller grew up in a small rural community in southeastern Colorado. Now she’s using her seventy years of festive experiences to share the true meaning of the season and how to rejoice in its miracles.Hair on Fire is a compilation of poems, prose, and helpful scripture references all centered around family. Using vivid and humorous language, Horner-Miller reveals a treasure trove of tales that will touch anyone’s heart. And when you immerse yourself in the warmth of her stories, you’ll soon be looking forward to the big day with refreshed anticipation and pure happiness.In Hair on Fire , you’ll - A vibrant celebration of Christmas specialness that will reawaken your inner child- At look at the mix of sadness and joy that the 25th of December can trigger and why it’s okay to embrace them both- An immersive retelling of what Joseph and Mary experienced on the road to Bethlehem, so you can put yourself in the Holy Family’s shoes.- What the traditions of a New Mexican holiday entail and how to bring them to life- The reason you should never stand too close to the angels in a pageant, and much, much more!Hair on Fire is a charming collection of Christmas memories told through poetry and prose. If you like uplifting journeys, evocative memoirs, and light-hearted joy, then you’ll love Larada Horner-Miller’s Yuletide gift.Buy Hair on Fire to deck the halls today!",
  "genres": [
    "Book Club",
    "Christmas",
    "Drama",
    "Contemporary",
    "Novels"
  ],
  "author": "Larada Horner-Miller",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/198668522-hair-on-fire"
}