{
  "title": "Blood at the Root",
  "description": "A teenager on the run from his past finds the family he never knew existed and the community he never knew he needed at an HBCU for the young, Black, and magical . Enroll in this fresh fantasy debut with the emotional power of Legendborn and the redefined ancestral magic of Lovecraft Country .Ten years ago, Malik's life changed forever the night his mother mysteriously vanished and he discovered he had uncontrollable powers. Since then, he has kept his abilities hidden, looking out for himself and his younger foster brother, Taye. Now, at 17, Malik is finally ready to start a new life for both of them, far from the trauma of his past. However, a daring act to rescue Taye reveals an unexpected connection with his long-lost a legendary conjurer with ties to a hidden magical university that Malik’s mother attended. At Caiman University, Malik’s eyes are opened to a future he never could have envisioned for himself— one that includes the reappearance of his first love, Alexis. His search for answers about his heritage, his powers, and what really happened to his mother exposes the cracks in their magical community as it faces a reawakened evil dating back to the Haitian Revolution. Together with Alexis, Malik discovers a lot beneath the surface at feuding covens and magical politics, forbidden knowledge and buried mysteries. In a wholly unique saga of family, history and community, Malik must embrace his legacy to save what's left of his old family as well as his new one. Exploring the roots and secrets that connect us in an unforgettable contemporary setting, this heart-pounding fantasy series opener is a rich tapestry of atmosphere, intrigue, and emotion.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Magic",
    "Audiobook",
    "Mystery",
    "Young Adult Fantasy"
  ],
  "author": "LaDarrion Williams",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/198688474-blood-at-the-root"
}