{
  "title": "Shit Happens: Gue yang Ogah Kawin, Kok Lo yang Rese?!",
  "description": "Shit does happen in their life. But, still, life must goes on....Lula, Sebastian, dan Langit. Tiga orang lajang yang hidup di kota besar bernama Jakarta dengan profesi berbeda. Jurnalis, penulis, dan editor. Love their life much, so damn proud of themselves, boast their freedom of life as an individual. ‘till one question ruins their [un]perfect life. Lula : I have a good job, I’m pretty, and, believe me, I’m not an airhead Paris-Hilton-like girl. I’m all what men need. Tapi, kenapa nggak ada cincin di jari manis gue? Sebastian : Mangoli (nikah)… cuma itu yang ada di pikiran Mama akhir-akhir ini. Katanya, menikah itu sumber kebahagiaan. Talk to yourself, Mom. Your marriage isn’t a picture of a happy life. Kenapa sih terus-terusan maksa aku nyari calon parumaen (menantu) dan menikah secepatnya? Langit : We were a perfect couple. ‘till, I found his affair. Then, he left me. He chose his latest partner, not me. This is my question. WHY ? So, this is not a story about perfect life. They just try HARD to make it perfect. ***‘Shit does happen, bahkan tidak hanya di kamar mandi. Buku ini membuat gue berdecak dari, ehm, kalimat pertama sampai terakhir. Lucu, cerdas, dan membuat berpikir. Membaca dua editor super ini akhirnya ‘kawin’ dan beranak novel membuat gue berkesimpulan: awesomeness happens!’ –Raditya Dika, penulis korban editan mereka berdua. ‘Buku ini punya dialog yang kocak dan cerdas! I think any smart, sophisticated, mid and late 20s urban people dengan segala quarter life crisis-nya could really relate to the story.You know, shitty crisis which only makes us feel so smart, so strong, so wise, so different, so damn proud and sooo alive for having it. And even though we might not get through it well in the end but just to think, feel, and living it, it’s just…wow! Happy reading!’ (www.icharahmanti.com)",
  "genres": [
    "Romance",
    "Novels",
    "Indonesian Literature",
    "Fiction",
    "Humor",
    "Comedy"
  ],
  "author": "Christian Simamora",
  "average_rating": "3.06",
  "url": "https://www.goodreads.com/book/show/1986747.Shit_Happens"
}