{
  "title": "Twilight at Monticello: The Final Years of Thomas Jefferson",
  "description": "Much has been written about Thomas Jefferson, with good reason: His life was a great American drama–one of the greatest–played out in compelling acts. He was the architect of our democracy, a visionary chief executive who expanded this nation’s physical boundaries to unimagined lengths. But Twilight at Monticello is something entirely new: an unprecedented and engrossing personal look at the intimate Jefferson in his final years that will change the way readers think about this true American icon. It was during these years–from his return to Monticello in 1809 after two terms as president until his death in 1826–that Jefferson’s idealism would be most severely, and heartbreakingly, tested.Based on new research and documents culled from the Library of Congress, the Virginia Historical Society, and other special collections, including hitherto unexamined letters from family, friends, and Monticello neighbors, Alan Pell Crawford paints an authoritative and deeply moving portrait of Thomas Jefferson as private citizen–the first original depiction of the man in more than a generation. Here, told with grace and masterly detail, is Jefferson with his family at Monticello, dealing with illness and the indignities wrought by early-nineteenth-century medicine; coping with massive debt and the immense costs associated with running a grand residence; navigating public disputes and mediating family squabbles; receiving dignitaries and correspondingwith close friends, including John Adams, the Marquis de Lafayette, and other heroes from the Revolution. Enmeshed as he was in these affairs during his final years, Jefferson was still a viable political force, advising his son-in-law Thomas Randolph during his terms as Virginia governor, helping the administration of his good friend President James Madison during the “internal improvements” controversy, and establishing the first wholly secular American institution of higher learning, the University of Virginia at Charlottesville. We also see Jefferson’s views on slavery evolve, along with his awareness of the costs to civil harmony exacted by the Founding Fathers’ failure to effectively reconcile slaveholding within a republic dedicated to liberty.Right up until his death on the fiftieth anniversary of America’s founding, Thomas Jefferson remained an indispensable man, albeit a supremely human one. And it is precisely that figure Alan Pell Crawford introduces to us in the revelatory Twilight at Monticello.'Crawford (Thunder on the Right) offers his own equally compelling look, in this case at Jefferson's life, post-presidency, from 1809 until his death in 1826. Then a private citizen, Jefferson was burdened by financial and personal and political struggles within his extended family. His beloved estate, Monticello, was costly to maintain and Jefferson was in debt. Newly studying primary sources, Crawford thoroughly conveys the pathos of Jefferson's last years, even as he successfully established the University of Virginia (America's first wholly secular university) and maintained contact with James Madison, John Adams, and other luminaries. He personally struggled with political, moral, and religious issues; Crawford shows us a complex, self-contradictory, idealistic, yet tragic figure, helpless to stabilize his family and finances. Historians and informed readers alike will find much to relish in both of these distinctive works of original scholarship. Both are recommended for academic and large public libraries.–Library Journal“In \"Twilight at Monticello,\" Alan Pell Crawford treats his subject with grace and sympathetic understanding, and with keen penetration as well, showing the great man's contradictions (and hypocrisies) for what they were.”–Wall Street Journal“Like all people, famous or almost unknown, Jefferson was a mass of contradictions. Crawford explores them masterfully, thus indeed presenting a new Jefferson for a new generation.”–Houston Chronicle“…a worthy addition to the already enormous body of Thomas Jefferson scholarship. Crawford did his homework well, using literally dozens of sources to give us an unvarnished picture of the human side of one of America’s greatest leaders in an entertaining, fast-moving narrative. You might never loom at Monticello in quite the same way again after reading this book.”–The Fredericksburg (Va.) Free-Lance Star",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "American History",
    "Presidents",
    "Politics",
    "Biography Memoir"
  ],
  "author": "Alan Pell Crawford",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/1986673.Twilight_at_Monticello"
}