{
  "title": "The Road to the Country",
  "description": "THE TWICE BOOKER-SHORTLISTED AUTHOR'Obioma is truly the heir to Chinua Achebe' New York Times'Incredibly moving and hopeful' Nadifa Mohamed'Remarkable' Alice Walker 'A major voice' Salman Rushdie'A wondrous novel’ Nana Kwame Adjei-Brenyah\nAt first the vision is grainy but slowly it clears, and there appears the figure of a man.\nWhen a country is plunged into civil war, two brothers on either side of it are divided. They will try to find their way back to each other. Kunle's search for his sibling Tunde becomes a journey of atonement which sees him conscripted into the army to fight a war he hardly understands. Once there, he will forge friendships to last a lifetime, and he will meet a woman who will change his world forever. But will he find his brother?The story of a young man seeking redemption in a nation on fire, Chigozie Obioma's novel is an odyssey of brotherhood, love and unimaginable courage set during the Biafran War. Intertwining myth and realism into a thrilling, inspired and emotionally powerful novel, The Road to the Country is a masterpiece.***MORE PRAISE FOR THE ROAD TO THE COUNTRY AND CHIGOZIE OBIOMA***'Chigozie Obioma brings the Biafran War to life in a visceral yet mystical way. Loss, pain and grief are etched onto a canvas that seems timeless and endless. I grieve for those lost in that doomed declaration of independence but celebrate those, such as Chigozie, who carry their torches’ Nadifa Mohamed‘This powerfully evocative and intimate book is unarguably Obioma’s finest. Through subtle, piercing, and gripping language, he renders those seemingly simple but unforgettable moments when our lives intertwine with history, anchoring you to the pages until the end. The Road to the Country will remind you that our existence is the histories of past, present, and the future—and the importance of understanding that. This is among the best books I’ve read in a while and is certainly destined to be a classic’ Ishmael Beah‘A spectacular blend of realism and mysticism, The Road to the Country is Chigozie Obioma at his finest. He is a novelist in a league of his own’ Imbolo Mbue'A remarkable talent' Independent‘Chigozie Obioma is a gifted and original storyteller’ Jennifer Clement'Few contemporary novels achieve the seductive panache of Obioma's heightened language’ Guardian‘One of the most exciting voices of modern African literature’ Financial Times‘A truly gifted writer, Obioma has proven yet again that he's a literary treasure’ Nicole Dennis-Benn",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Africa",
    "Nigeria",
    "War",
    "Historical",
    "African Literature"
  ],
  "author": "Chigozie Obioma",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/198679001-the-road-to-the-country"
}