{
  "title": "Maximum Impact",
  "description": "This electrifying debut thriller delivers a gripping tale of Big Brother gone mad amid a modern world on the verge of endless war. Brimming with high-powered suspense, here is the brilliant, frighteningly believable story of three masterminds locked on a breathtaking collision cours—the outcome of which will determine the fate of the United States.Circumference of DarknessTwenty-two-year-old Jeannie Reese is a computer wunderkind—and the top architect of next-generation security for the Department of Defense. Her latest brainchild is IRIN, the most powerful surveillance technology ever developed. To date, IRIN has remained ultraclassified and inactive. But on the day a shocking act of terrorism strikes U.S. shores, the presidential order comes to launch Jeannie’s creation against the dark forces behind the attack.Known only as Phr33k, forty-one-year-old John Fagan is a legendary, reclusive computer hacker. For years he has expertly hidden himself while operating freely within the shadows of the Internet’s background noise. He has remained in complete seclusion despite his infamy as the author of a slew of massive electronic crimes—and despite his long-ago, now eerily prophetic, scenarios of terrorist warfare against America.Under Jeannie’s direction, IRIN gathers and analyzes endless data—and unearths Phr33k. If she is to stop the next stage of a terror campaign clearly begun years before, Jeannie will have to find the überhacker; but that is only the beginning. For she soon discovers that Phr33k is being held by the leader of a vast terrorist network, who now plans to use this unique genius to conceive and deliver his final, fatal a devastating nationwide wave of unparalleled destruction.For his part, Phr33k is used to working alone. But all that will have to change.He has a new challenge, one unlike any he’s faced how to provide Jeannie Reese with one outrageous, impossible shot to short-circuit the perfect, unstoppable scheme he so masterfully—and so unwillingly—helped to create.",
  "genres": [
    "Fiction",
    "Thriller",
    "Science Fiction",
    "Historical Fiction",
    "Politics"
  ],
  "author": "JackHenderson",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/1988205.Maximum_Impact"
}