{
  "title": "Wellen",
  "description": "In stimmungsvollen Bildern schildert dieser baltische Sommerroman das Schicksal völlig unterschiedlicher, sich fremder Menschen. Das Meer und die Nähe des abgelegenen Ostseebadeort verbindet sie für kurze Zeit miteinander. Am Ende bleiben außer der Kraft des Meeres nur zerstörte Träume übrig.  Der eine Ort des Geschehens ist das Haus der Generalin von Palkow. Zur Sommerfrische versammelt sie am Strand ihre Großfamilie: die Tochter „Bella“ mit ihren zwei Töchtern und dem Sohn sowie deren Ehemann. Der andere Ort ist ein kleines Fischerhaus, in dem ein äußerst exotisches Paar wohnt: Doralice, eine wunderschöne Gräfin, die ihrem alten Ehemann mit einem Maler davongelaufen ist. Mit eben diesem Hans Grill lebt die gesellschaftlich geächtete Doralice hier an dem Badeort. Doralice hat etwas gewagt, wovon 1910 viele träumten: Sie hat sich aus ihrer unglücklichen Ehe befreit, hat sich von ihrem „Maler entführen lassen“. Doch wenngleich der immer von Freiheit spricht, fühlt sie sich nicht zu Hause, unverstanden, unglücklich. Doralice ist für die Frauen eine Gefahr, für die Herren von Interesse. Obwohl ein Zusammentreffen dieser beiden Welten um jeden Preis vermieden werden soll, kommt es in der Hitze des Sommers zu folgenschweren Begegnungen.  Der „baltische Fontane“, wie von Keserling oft genannt wird, schrieb mehrere Erzählungen und Romane, „Wellen“ erschien 1910. Alle spielen im ehemaligen Herzogtum Kurland und beschäftigen sich mit der Lebenssphäre des baltischen Adels. Eduard von Keyserling (1855 bis 1918) studierte als Spross eines kurländischen Adelsgeschlechts Jura, Philosophie und Kunstgeschichte, bis er „wegen einer Unkorrektheit“ abbrechen musste. Bis 1895 verwaltete er, gesellschaftlich isoliert, die mütterlichen Güter und ging dann nach München. Er zählte hier zur Schwabinger Boheme. Bereits 1897 erkrankte er an einem Rückenmarksleiden und erblindete mit 45 Jahren. 1918 starb er in München.",
  "genres": [
    "Classics",
    "German Literature",
    "Germany",
    "Fiction",
    "20th Century"
  ],
  "author": "Eduard von Keyserling",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/1987774.Wellen"
}