{
  "title": "All the Worst Humans: How I Made News for Dictators, Tycoons, and Politicians",
  "description": "New York Times Editors' ChoiceNamed a best book of the year by Amazon\n\n\"A rollicking, unexpectedly affecting story. . . It’s going to be one of the big, buzzy Beltway books of the year.\"—Politico\n\nA bridge-burning, riotous memoir by a top PR operative in Washington who exposes the secrets of the $129-billion industry that controls so much of what we see and hear in the media—from a man who used to pull the strings, and who is now pulling back the curtain.\n\nAfter nearly two decades in the Washington PR business, Elwood wants to come clean, by exposing the dark underbelly of the very industry that’s made him so successful. The first step is revealing exactly what he’s been up to for the past twenty years—and it isn’t pretty. Elwood has worked for a murderer’s row of questionable clients, including Gaddafi, Assad, and the government of Qatar. In All the Worst Humans, Elwood unveils how the PR business works, and how the truth gets made, spun, and sold to the public—not shying away from the gritty details of his unlikely career.This is a piercing look into the corridors of money, power, politics, and control, all told in Elwood’s disarmingly funny and entertaining voice. He recounts a four-day Las Vegas bacchanal with a dictator’s son, plotting communications strategies against a terrorist organization in Western Africa, and helping to land a Middle Eastern dictator’s wife a glowing profile in Vogue on the same time the Arab Spring broke out. And he reveals all his slippery tricks for seducing journalists in order to create chaos and ultimately cover for politicians, dictators, and spies—the industry-secret tactics that led to his rise as a political PR pro.  Along the way, Phil walks the halls of the Capitol, rides in armored cars through Abuja, and watches his client lose his annual income at the roulette table. But as he moved up the ranks, he felt worse and worse about the sleaziness of it all—until Elwood receives a shocking wake-up call from the FBI. This risky game nearly cost Elwood his life and his freedom. Seeing the light, Elwood decides to change his ways, and his clients, and to tell the full truth about who is the worst human.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Politics",
    "Audiobook",
    "Biography",
    "History",
    "Biography Memoir"
  ],
  "author": "Phil Elwood",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/198902261-all-the-worst-humans"
}