{
  "title": "Love's True Second Chance: A True Love Story",
  "description": "The following is a true story; love and heartache in high school, the feelings of anger, curiosity through the years, and finally a reuniting.At forty-nine, I’ve suffered a wide variety of ups and downs, emotional highs and lows. I thought I’d experienced every feeling imaginable. What Debbie and I shared in the short seven months God allowed us together were beyond my wildest dreams. We were about to get an education in how deeply two people can love.Join Debbie and I, by getting a copy today, as we reconcile the pain and hurt from the past and embark on the love we both so desperately sought through the years.What ever happened to your first love? How did their lives turn out? Do they ever think about the wonderful times we spent together? Those care-free days when the only thing that really mattered was walking hand in hand on long walks or hanging out with friends at the arcade. Do they remember the first date and the first kiss? Do they still remember us and what would happen if we were ever saw each other again? Would the old feelings of the past be reignited, or would it be a simple hello, how have you been and we part paths again?I always wondered how her life turned out. Through the years a business card would be left in a mailbox with no return call, letter or email. I guess the memories would be just that, memories. But in December of 2008, it was worth one more shot. One more attempt to make contact with the one girl whose memory lingered. The one girl, who no matter how far I traveled or how hard I tried to suppress the thoughts of the past, was always just under the surface waiting to reawaken. One more time, one more attempt, just one more time, and if nothing happens, let her memories fade; never to surface again.It has been two weeks since the card was dropped off. Well, we gave it our best shot. We tried one more time and since there has been no contact, her memory is starting to fade. I take our prom picture out of my wallet and place it in a small box with all of the remaining reminders of our love from so long ago. The phone rings. Must be someone with more bad news about why they can't deliver the materials ordered. \"This is Jeff\"(what do you want!), \"This is Debbie.\" My response was cold and quick, \"And?\" A very long pause, \"Jeff.....this.....is.... Debbie.\" I slowly remove both feet from my mouth. It is her! The long lost connection has been made. Now what?Join us for the most intense seven month \"true love\" one could ever imagine. Travel back to high school when life was so easy, so care-free and the word worry didn't exist. The chance meetings at college that at times were better forgotten. To present day when we are both trying to figure out if the feelings from the past should remain in the past or is there still something there; unfinished business. There is plenty of time (?) to figure it all out.",
  "genres": [
    "Romance"
  ],
  "author": "Jeff  Dawson",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/11106641-love-s-true-second-chance"
}