{
  "title": "Love in the Scottish Winter Highlands",
  "description": "She is determined to restore her inherited Scottish castle. He needs her to fail so he can finally escape his tormenting memories. Can true love overcome the pain of the past?Marla Wilson suddenly finds herself the owner of a half-ruined castle in the Scottish Highlands. Full of doubts, she leaves her life in London behind to restore her crumbling, inherited mansion.But her neighbour and grumpy widower Niall McCarron has an agenda of his own. Still haunted by his wife’s fatal accident, he’s desperate to sell the land—including Marla’s castle—in order to leave the village and his past behind.Their instant attraction turns to fiery dislike when Niall finds out that the gorgeous woman he saved from a tree is the one thing standing in his way. Wherever they bump into each other, they clash. Until a snowy Christmas Ceilidh in the village pub brings unexpected, buried feelings to the surface.As Niall and Marla’s enmity slowly turns to friendship, an irresistible attraction grows between them—leading to a stormy night full of passion. But their old wounds and Niall’s secret threaten to ruin everything...Brimming with witty banter, passionate tension, and gripping emotion,Love in the Scottish Winter Highlands is a heart-warming holiday romance set in the wild, beautiful landscape of rural Scotland. Crumbling castle, cute dog, cosy community—it’s got it all.+++ Love in the Scottish Winter Highlands is the first part of the stand-alone 'Escape to Scotland'-series. It's written in third person with alternating POV and addresses bereavement and emotional growth. This novel contains some swearing and two open door scenes. +++If you love brooding heroes and plucky heroines, second chance stories, and feel-good Scottish Highland romance, snuggle up with this sparkling small-town romance and be whisked away to wintry Scotland!",
  "genres": [
    "Romance",
    "Christmas",
    "Contemporary",
    "Holiday",
    "Scotland",
    "Enemies To Lovers",
    "Chick Lit"
  ],
  "author": "Beatrice Bradshaw",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/198973475-love-in-the-scottish-winter-highlands"
}