{
  "title": "Faine",
  "description": "Left stranded on an enemy planet, can Faine find and rescue the woman he believes to be his fated mate?Choosing to remain behind when the others in his party escape the Khagrish homeworld, Faine is determined to locate and rescue Farah, the human woman he loves. Somehow he’ll get the two of them off the planet and safely home to the Badari Warriors’world far away. Alone, feared and hated by the aliens on this alien world, cut off from his pack, Faine must traverse a city and countryside full of danger on his quest to locate Farah.Farah Saunders was a teacher in the Sectors until she was kidnapped by pirates and sold to become a subject of lab experiments. Taken to the Khagrish home world with a small group of humans and two Badari prisoners, she was selected by a Khagrish noble to become his personal special project. Her situation is hopeless yet she can’t stop thinking of the one man who might be able to save her – Faine. She barely knew him but feels an uncanny connection to the fearless, genetically engineered soldier. What is this link tying them together?Reunited, the two of them go on the run, hunted ruthlessly by the Khagrish authorities and the infuriated noble. Can Faine accomplish the miracle he’s hoping for and find a way for them to escape? Will Farah ever agree to become his claimed mate?FAINE is the 20th book in the Badari Warriors world (the seventeenth in the numbered main series) and each novel or novella has a satisfying Happy for Now ending for the hero and heroine, not a cliffhanger. Genetically engineered soldiers of the far future, the Badari were created by alien enemies to fight humans. The scientists kidnapped an entire human colony from the Sectors to use as subjects in twisted experiments…the Badari packs and the humans made common cause, rebelled and escaped the labs. Now they live side by side in a sanctuary valley protected by a powerful Artificial Intelligence, and wage unceasing war on the aliens. Some overarching issues do remain unresolved in each book since this is an ongoing series but romance always wins the day in my novels! BADARI WARRIORS AYDARRMATEERTIMTUR (IN THE STARS ROMANCE)JADRIANDARIKGABEKIERCECAMRONBADARI WARRIOR’S MEGAN AND MATEERREEDEDAEGANLANDONHONEYMOON FOR THE ALPHAIVOKKJAMOKANHOLIDAY FOR THE ALPHATRATUSREEDE’S MISSION TO THE SECTORSNARIO",
  "genres": [],
  "author": "Veronica  Scott",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/198973143-faine"
}