{
  "title": "Hard Aground . . . Again: Inspiration for the Navigationally Challenged and Spiritually Stuck",
  "description": "This book carries a 100% GUARANTEED RETURN POLICY. What I mean is, I GUARANTEE if you RETURN this book, we will revise our customer service POLICY. Speaking of our customer service policy, if you are not completely satisfied with this book for any reason, you can mail a picture of you NOT READING this book -- plus a copy of your receipt and maybe a handwritten note explaining why you think this is the worst boating book ever -- to Slip None, Whittaker Creek, Oriental, North Carolina. There is no one at that address, but sometimes it helps to vent. Speaking of venting...if you own a boat, you know what I'm talking about. If you DO NOT own a boat, what are you waiting for, a sign? Okay, here's one sign: Salt water covers over 71% of the earth's surface. That means if you had a boat, you could be, at this very minute, wet. You might also be broke, permanently deformed from living in spaces the size of a Tupperware bread box, have a dent in your skull from banging your forehead into the companionway hatch, and exude from your body such an aromatic stench that even mosquitoes vector away when you walk down the dock. You may also be divorced. Enough about you. Let's talk about this book you are going to return. Here are a few topics we'll cover. Table of Contents PART I - Anchors Away Think Globally, Sail Locally A Stern Response The Haves and the Half-Knots Gaining a Cents of Worth Eternal Shoalmates (Sand)Bar Hopping Anchors Away PART II - Signal Flags Hand-Held Navigational Aids I Don't Know, Bub, Sounds Fishy to Me A Force to be Wreck'ned With Oscar Mired Dinners Signal Flags PART III - Not a Yacht Happening Let's Go to 68 New Boat? I Wooden Have One Cockpit Downsizing Boat Borrowship Give Me Your Tired, Your Poor, Your Muddled Masts Naming Rights Not a Yacht Happening Part IV - Bringing the Bow to Port I Got the Turkey Trots Seeds of Greed Santa Pause Recovering from a Sinking Spell Another Year Has Croaked Bringing the Bow to Port Part V - The Cost of Cruising Oh Say Can You Sea Knock on Wood May I Mayreau? Recharging My Batteries Diving for Pennies Happy Daddy's Day The Cost of Cruising There, now. Don't say I didn't warn you.",
  "genres": [],
  "author": "Eddie       Jones",
  "average_rating": "4.88",
  "url": "https://www.goodreads.com/book/show/19888247-hard-aground-again"
}