{
  "title": "A Song of Magic",
  "description": "Three sets of hands upon the stone, one set of hands to pass alone.Still reeling from learning what she is, and still not in control of her magic, Jenyfer sails with Katarin Le Fey and the women of The Night Queen, determined to stay away from Ordes and the danger she poses to him and the crew of The Excalibur. Arthur travels to the country of his mother to learn to harness his magic and prepare himself to fulfil a destiny he isn’t sure he wants, or deserves, as Ordes attempts to forge a way forward without Jenyfer. While searching for his warrior’s heart and trying to decipher the Fisher Queen’s messages, Arthur finds the family he craves. Doing their best to avoid one another and their roles in Merlin’s prophecies, Ordes and Jenyfer’s paths continue to cross, leading them from Avalon to the watery realm of the Master of Songs and Death, and the musical heart of syhren magic. As Jenyfer begins to uncover her power, she and Ordes learn that sometimes, it can be hard to distinguish the truth from the lies. Recovering from her time beneath the waves, Lamorna struggles to reclaim her place in Kernou. As the Chif’s influence spreads, and Kernou becomes more dangerous than ever, Lamorna and her aunt decide to flee. Drawn into the fierce land of Cruithea, Lamorna discovers a place of magic and savage beauty, where she forms an alliance that could shape the future of Teyath and put everything in jeopardy.From the wilds of Cruithea, to the magical island of Avalon and the mysterious realm of Lyonesse, Jenyfer, Ordes and Arthur are drawn deeper into the world of gods and prophecies, and learn that not everything is as it seems. A Song of Magic is the second book in The Grail Cycle, an epic romantic fantasy reimagining of the Arthurian legends.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fiction",
    "Romantasy",
    "New Adult"
  ],
  "author": "Kate Schumacher",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/198834047-a-song-of-magic"
}