{
  "title": "War of the Rats",
  "description": "Stalingrad, August 1942-the brutal siege of the city begins.\nFor six months, Stalingrad is the center of a titanic struggle between the Russian and German armies, the bloodiest campaign in mankind's long history of warfare. The outcome is pivotal. If Hitler's forces are not stopped, Russia will fall. And with it, the world.With razor-sharp prose and brilliant historical accuracy, David L. Robbins brings the reader right into the thick of this monumental battle, in a novel so authentic, it could almost be true....German soldiers call the battle Rattenkrieg, war of the rats. The combat is horrific, as victories are measured in meters and soldiers die in the smoking cellars and trenches of a ruined city. Through this twisted carnage stalk two men-one Russian, one German-each the top sniper in their respective armies. These two marksmen are equally matched in both skill and tenacity. And each has his own mission....The young Russian sniper's credo of \"one man, one bullet\" has established his reputation as the Red army's top long-distance assassin. Nicknamed the Hare, he's been put in charge of an impromptu sniper school, training both men and women to kill with chilling precision.To counter this threat, the Headmaster, leader of the Nazis' elite sniper school, is flown to Stalingrad. Each has been given similar orders-to find and kill his counterpart. And the extraordinary duel begins....Complicating matters is an American woman, Tania Chernova, trapped in Russia at the start of the war, who has come to Stalingrad from the Russian resistance. Seeking vengeance against the German army, the defiant American joins the Hare's team of snipers, becoming one of his most talented assassins-and possibly his greatest weakness.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "War",
    "World War II",
    "Military Fiction",
    "Russia",
    "Thriller"
  ],
  "author": "David L. Robbins",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/1988586.War_of_the_Rats"
}