{
  "title": "Mattie, Milo, and Me: A Memoir",
  "description": "Anne grew up in an abusive home, leading to severe depression and a determination to do better as a mother. One of her sons wants a dog from the time he is a baby; Anne very much does not. For years she appeases him with creatures who live in cages and tanks, but on his tenth birthday she can no longer say no—and she proceeds to fall in love with their new four-legged family member, Mattie. Then Mattie dies a sudden and tragic death, and Anne feels herself begin to sink back into depression.Trying to cope, she immediately adopts Milo—a dog who, unbeknownst to her, has already been returned to the rescue by several families due to his aggressive behavior. But even after she realizes Milo is dangerous, she’s committed to trying to give him a chance at a good life.Anne’s journey takes the reader from dog school into the deep woods as she perseveres with Milo’s lifelong rehabilitation and her unwavering efforts to be a good mother to her sons. Working with Milo strengthens Anne and expands her ability to love. Ten years later, when Milo dies, Anne faces another close the door to that part of her heart, or risk loving another dog after two tragic losses?\"… a certain kind of pet lover, looking for a comforting reminder of the powerful bond that can occur between animals and humans, may finish this book teary-eyed.”— Kirkus Reviews“Mattie, Milo and Me is a warm memoir about a woman’s connection to—and transformation because of—her dog.”— Foreword Reviews“Abel debuts with a heart-warming memoir spotlighting the intense bond between dogs and their owners. . . . Animal lovers will relish the central role that Abel’s pets play in her wellbeing throughout the narrative.” — BookLife“A moving and fearless exploration of resilience, atonement, and the healing power of the link between people and their furry companions. Abel’s writing is both introspective and heart-wrenchingly honest.” – The Book Revue“Mattie, Milo, and Me began as the winning story at a Moth StorySLAM in NYC. The story of Anne and her dog Milo captured the hearts of the audience. She wrote this memoir to answer the many questions posed by people who wanted to know more. This is one of those books you won’t want to put down, but also one you won’t want to finish.”— Inga Glodowski, The Moth “I love Mattie, Milo, and Me. It had me laughing out loud—yet it’s so touching that it had me in tears, too. This book is brilliant. Anne’s joys and struggles are relatable. I learned a lot. I highly recommend Mattie, Milo, and Me.”— Natalie Aronow, Doctor of Veterinary Medicine“Mattie, Milo, and Me is a beautifully written book. This memoir takes you on an emotional ride. You’ll laugh, cry, and want to hug a dog by the end. A must-read.”— Gary and Allie Vider, Metro Pets NYC",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Dogs",
    "Animals"
  ],
  "author": "Anne Abel",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/198973166-mattie-milo-and-me"
}