{
  "title": "Entwined: Essays on Polyamory and Creating Home",
  "description": "In a series of genre-blending essays, Entwined tells the story of Alex Alberto’s decade-long polyamorous journey towards a new kind of family. In these essays, Alex attempts to build two committed relationships at once when no one involved has done this before; develops a powerful bond with the woman their partner loves; sits through a tense Thanksgiving Dinner with religious in-laws; questions the need for rules and hierarchy in their relationships; experiences the intensity of a triad; wrestles with the fragility baked into the nuclear family after their father’s stroke; and explores their queerness and gender identity in English, in New York, and struggles to reconcile their newfound self in their native French-Canadian language and culture.Entwined explores the fuzzy lines between friendship, romance, and family with various essay forms, including a play, an advice column, and a love letter. Yes, there are challenges, but rather than wallowing in the throes of jealousy, this collection celebrates the hard work of creating a love life that resists conventional narratives.--------WHAT EARLY READERS SAY ABOUT ENTWINED:\"Entwined is a goddamn bible for poly-curious people.\"—Chloe Caldwell (she/her), 37, questioning\"For Alex, polyamory is about creating a family. By getting to know them and their reality you gain entry to a world that might otherwise seem intimidating.\"—Sofia M. (she/her), 64, mother of a polyamorous person\"Entwined is about the desire to create a life outside of capitalism, heteronormativity, and the patriarchy.\"—Samantha Paige Rosen (she/her), 33, queer and monogamous\"Entwined had me captivated from start to finish. It will no doubt influence my approach to romance and family.\"—Rio C. (she/her), 21, queer, trans, and curious about polyamory\"The variety in content and structure makes it a quick read. Entwined deepened my understanding of polyamory’s possibilities; it’s not all swinging and sex parties.\"—Melissa Gopp-Warner (she/her), 43, queer/questioning and monogamous\"I laughed, cried, and felt my heart fill the fuck up.\"— Dan D. (they), 36, queer and newly navigating non-monogamy within a lifelong partnership.",
  "genres": [
    "Nonfiction",
    "Essays",
    "Queer",
    "Memoir",
    "Polyamory",
    "LGBT",
    "Relationships"
  ],
  "author": "Alex Alberto",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/199026848-entwined"
}