{
  "title": "A Sociedade Supersecreta de Bruxas Rebeldes",
  "description": "A sociedade supersecreta de bruxas rebeldes é uma fantasia romântica para quem não resiste a uma leitura aconchegante com um toque de magia. Na história, Mika, uma bruxa solitária, enfim tem a oportunidade de fazer parte de uma família e encontrar um novo amor.Uma das poucas bruxas na Grã-Bretanha, Mika Moon precisa seguir três regras: esconder sua magia, viver de maneira discreta e se manter distante de outras bruxas para que seus poderes não se misturem e causem algum acidente mágico. Como uma órfã que perdeu os pais muito cedo e foi criada por uma figura austera e rigorosa, Mika está acostumada a viver sozinha. E a seguir regras. Todas elas. Com uma exceção: os vídeos que publica on-line “fingindo” ser bruxa. Afinal, ninguém levaria a sério, né?Mas, então, Mika recebe uma mensagem inusitada implorando que ela viaje até onde Merlim perdeu as barbas para ensinar três jovens bruxas a dominar a própria magia. Contrariando as regras e o bom senso, Mika decide ir e logo se vê envolvida não só com as crianças, mas com os peculiares moradores da Casa de Lugar Nenhum: um anfitrião irreverente e seu marido adorável, uma governanta encantadora e um bibliotecário gato. Quer dizer, chato.Assim como todos ali, o tal bibliotecário faria qualquer coisa para proteger as meninas, mas, para o Sr. Ranzinza, uma desconhecida como Mika é uma ameaça. E não uma ameaça qualquer, mas uma das mais perigosas: uma ameaça irresistível.Conforme Mika conquista seu lugar na Casa de Lugar Nenhum, a ideia de ter uma família, um lar, de repente parece possível. No entanto, a magia não é o único perigo no mundo, e quando uma ameaça bate à porta, a jovem precisará decidir se vale a pena arriscar tudo para proteger uma família que nem sabia que procurava.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fiction",
    "Audiobook",
    "Witches",
    "Cozy",
    "Contemporary"
  ],
  "author": "Sangu Mandanna",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/199085391-a-sociedade-supersecreta-de-bruxas-rebeldes"
}