{
  "title": "Escape to Cadrius: Life and Philosophy in a Distant Future",
  "description": "Imagine a place without violence, theft and deception. Then imagine another land, just across the border, filled with chaos, tyranny and misery.Transport your imagination to the year 2092 where, after the chaos of the AI apocalypse, governments around the world have been replaced. Populations were plunged into poverty as AIs took over jobs. We find two contrasting societies, one controlled by a dictator, the other living by a set of guiding principles. These societies can propel people to either prosperity or poverty, happiness or sorrow, utopia or dystopia. These two lands are thought provoking in how their ethical values and social inequalities are similar to, or different from, our own. A story of how the world could be better, but also how it could go wrong.In this world, Destiny lived a mostly happy life in a walled enclave, away from the cares of the outside world, only hearing the propaganda ministry's narrative of the world. Until her parents are arrested for treason by the authoritarian regime. She becomes an outcast, facing the same dangers as the commoners. Destiny, with her servant Savannah, makes a desperate escape attempt across a desolate landscape. They face hardship to get to a place of hope, to make new friends, and possibly find love. But on the other side, Destiny has a lot to learn. Her social status suddenly changes, and she fears she may be sent back.Savannah, though she follows along with Destiny, has a very different journey. From misery, subservience and disrespect, to a new life of freedom and equality.The challenges they face require personal growth in which they have to learn such things as courage, justice, critical thinking, and that they are equal to anyone. Their future will be forever changed. The lessons they learn are lessons we all need to learn.",
  "genres": [],
  "author": "Larry Haley",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/199137509-escape-to-cadrius"
}