{
  "title": "The Cases Nobody Wanted",
  "description": "*Author \"I have never used AI in my writing.\" A.G. RussoThe homefront, summer 1942, Brooklyn, New York. Six months after the Japanese bombed Pearl Harbor, America was fighting overseas with the Allies in World War II. Maeve O’Shaughnessy’s fight for survival was different. Her three brothers were shipped out and left her with their new detective agency and fifteen-year-old brother to manage. Before the War, Maeve worked as a secretary. She knew nothing about detective agencies. From the start she struggled to make enough money to feed Jimmy and herself. Vic Marino, a no-nonsense ex-cop, showed up and told her he was going to help her make a go of the agency. Maeve vehemently protested but Vic insisted she had no choice.Against the backdrop of a war many Americans never wanted, more men were drafted and volunteered to serve every day. Those left behind supported the war effort the best they could. As 1942 wore on sacrifices were necessary for the War, while the losses became real and heartbreaking. Thousands of women took up the cause working outside the home. Yet Maeve found herself trapped in circumstances beyond her control.Vic’s “deal” to help the detective agency survive came at a cost. He took on responsibility for the detective agency along with an angry naïve woman and her teenage brother. The business was sinking and needed to make money fast. They needed a client. One walked in on Vic’s first day in the office. Mrs. Sullivan implored them for help. Her daughter Lucille, a “beautiful angel,” was brutally murdered in an expensive apartment owned by a rich businessman. The police showed no interest in her violent death. Maeve and Vic had no choice. They took the case nobody wanted.From the mean streets of Brooklyn to Chinatown to the Brooklyn Navy Yard to the Fulton Fish Market to upstate New York, dealing with thugs, colorful characters, and puzzling clues, O’Shaughnessy Investigations, Inc. pursued the baffling case. A blend of neo-noir mystery and historical fiction. Book 1 0f 3.Content Please be aware this book contains issues of violence, racism and racial slurs (in the context of the times), sexism, pregnancy and childbirth, and abusive language.Previously published as O'SHAUGHNESSY INVESTIGATIONS, INC. Episodes 1-32 on Kindle Vella.",
  "genres": [
    "Contemporary",
    "Book Club",
    "Drama",
    "Novels",
    "Mystery",
    "Historical Fiction",
    "Historical"
  ],
  "author": "A.G. Russo",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/199121904-the-cases-nobody-wanted"
}