{
  "title": "Lula Dean’s Little Library of Banned Books",
  "description": "The provocative and hilarious summer read that will have book lovers cheering and everyone talking! Kirsten Miller, author of The Change, brings us a bracing, wildly entertaining satire about a small Southern town, a pitched battle over banned books, and a little lending library that changes everything.Beverly Underwood and her arch enemy, Lula Dean, live in the tiny town of Troy, Georgia, where they were born and raised. Now Beverly is on the school board, and Lula has become a local celebrity by embarking on mission to rid the public libraries of all inappropriate books—none of which she’s actually read. To replace the “pornographic” books she’s challenged at the local public library, Lula starts her own lending library in front of her home: a cute wooden hutch with glass doors and neat rows of the worthy literature that she’s sure the town’s readers need.But Beverly’s daughter Lindsay sneaks in by night and secretly fills Lula Dean’s little free library with banned books wrapped in “wholesome” dust jackets. The Girl’s Guide to the Revolution is wrapped in the cover of The Southern Belle’s Guide to Etiquette. A jacket that belongs to Our Confederate Heroes ends up on Beloved. One by one, neighbors who borrow books from Lula Dean’s library find their lives changed in unexpected ways. Finally, one of Lula Dean’s enemies discovers the library and decides to turn the tables on her, just as Lula and Beverly are running against each other to replace the town’s disgraced mayor.That’s when all the townspeople who’ve been borrowing from Lula’s library begin to reveal themselves. It’s a diverse and surprising bunch—including the local postman, the prom queen, housewives, a farmer, and the former DA—all of whom have been changed by what they’ve read. When Lindsay is forced to own up to what she’s done, the showdown that’s been brewing between Beverly and Lula will roil the whole town...and change it forever.",
  "genres": [
    "Fiction",
    "Audiobook",
    "Books About Books",
    "Contemporary",
    "Book Club",
    "Humor",
    "Adult"
  ],
  "author": "Kirsten Miller",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/199119054-lula-dean-s-little-library-of-banned-books"
}