{
  "title": "A Irmandade Secreta de Sua Majestade",
  "description": "Quatro bruxas se unem para impedir uma profecia terrívelsobre o Apocalipse de se concretizar.A Irmandade Secreta de Sua Majestade (ISSM) é o maior coven do Reino Unido, cuja existência data dos tempos de Ana Bolena, sua fundadora. Nos anos 1990, um grupo de pré-adolescentes se une ao ISSM e são iniciadas na bruxaria. Vinte e cinco anos depois, quatro dessas amigas tomaram diferentes rumos em suas vidas: uma deixou o coven para dedicar-se à prática veterinária; outra assume com alegria os cuidados de sua família suburbana; uma decide fundar seu próprio coven, voltado a bruxas não-brancas; e a outra se tornou a Alta Sacerdotisa do ISSM.Quando surge uma profecia sobre a Criança Maculada, que fará o Leviatã se levantar e causará o extermínio de todas as bruxas e do mundo como conhecemos, os caminhos dessas mulheres poderosas voltam a se cruzar, e elas precisam enfrentar seus traumas, suas diferenças e seus preconceitos para sobreviver. Mas será que as coisas são mesmo como parecem ser?Escrito pela autora transgênero e ativista Juno Dawson — que já foi publicada no Brasil com seu livro Este Livro é Gay: E Hetero e Bi e Trans... —, A Irmandade Secreta de Sua Majestade, primeiro volume da trilogia Realeza das Bruxas, é a pedida perfeita para quem busca uma leitura de ficção mágica fora dos padrões.Com uma narrativa que altera os pontos de vistas das personagens principais, o leitor mergulha nos pensamentos de Niahm Kelly, Elle Pearson, Leonie Jackson e Helena Vance e embarca em uma jornada arrebatadora por um dos cartões-postais mais queridos do mundo. Dawson, sempre divertida e cheia de referências à cultura pop, apresenta ao leitor personagens bem-construídos e tridimensionais, cujas escolhas têm o poder de afetar não só as pessoas que cresceram ao seu lado, mas toda a comunidade bruxa.Sempre por meio do viés da bruxaria moderna, A Irmandade Secreta de Sua Majestade aborda importantes assuntos contemporâneos, como questões de gênero, estruturas de poder, racismo, feminismo radical trans-excludente e supremacia branca.O mais novo título da marca DarkLove estabelece diálogo com os livros da marca Magicae à medida em que apresenta rituais mágicos e a história de divindades pagãs mesclados à sua trama, que se torna mais e mais eletrizante com o avançar das páginas. A Irmandade Secreta de Sua Majestade é uma estreia de fantasia admirável e um verdadeiro caldeirão que mistura a energia contagiante das Spice Girls, a magia misteriosa de Jovens Bruxas e a ação eletrizante de Kingsman: Serviço Secreto. Junte-se ao nosso coven.Juno Dawson é roteirista, jornalista e autora best-seller, mais conhecida por obras como Este Livro é Gay e Clean. Ela foi agraciada com o YA Book Prize e escreve para a televisão. Também já fez participações em programas como I May Destroy You e Holby City e foi modelo para a Jecca Cosmetics. Atualmente, faz parte do coletivo queer Club Silencio e é host do podcast So I Got to Thinking, que discute a série Sex and the City.“Ler este livro foi um deleite. A construção de mundo é incrível, a escrita é sofisticada e a abordagem das questões identitárias e de gênero é feita com nuances e cuidado. Não consegui largar.”— Louise O'Neill, autora de A Pequena Sereia e o Reino das Ilusões —“Inteligentemente construído. Uma sucessão de comentários políticos gradualmente erguida, que revela uma metáfora complexa para o clima sociopolítico do Reino Unido e sua transfobia dominante.”— Publishers Weekly —“Dawson usa as regras dos romances fantásticos para se pronunciar sobre como as organizações podem excluir e ignorar pessoas negras e LGBTQIAPN+.”— Booklist —",
  "genres": [
    "Fantasy",
    "Fiction",
    "Witches",
    "LGBT",
    "Queer",
    "Audiobook",
    "Adult"
  ],
  "author": "Juno  Dawson",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/199285002-a-irmandade-secreta-de-sua-majestade"
}