{
  "title": "Secrets of the Lone Wolf Trader: How to make a six-figure income in 5 hours per week day trading stock options",
  "description": "Get ready to FIRE YOUR BOSS, take the power back, and make a six-figure income in just 5 hours per week. That’s right. You really can make six figures per year by day trading stock options in approximately 1 hour per day, even with a small trading account.Secrets of the Lone Wolf Trader gives you a simple, effective strategy you can use to make anywhere from hundreds to thousands of dollars per day, in just 1 hour per day! You’ll learn how to day trade stock options like a professional, even if you have no previous trading experience!In this book, self-taught full time day trader Patrick Buchanan will teach you what he’s learned from years of day trading with his own trading account, which started off small and grew into a full time six-figure income. This book is designed for the beginning trader with a small trading account. It gives you all the information you need to know, without getting into the weeds of confusing or irrelevant details you don’t need to know.You DO NOT need to be rich or have years of previous stock market experience to be successful as a day trader. All you need is a few thousand dollars to start with, a computer, a fast internet connection, and your brain. That’s it.Secrets of the Lone Wolf Trader will teach you how READ PRICE ACTION ON A STOCK CHARTUNDERSTAND WHAT CANDLESTICKS ARE AND HOW TO INTERPRET THEIR MEANINGCHOOSE THE CORRECT STRIKE PRICE AND EXPIRATION DATE OF AN OPTIONIDENTIFY TRENDS THAT DEVELOP ON CHARTS, AND PROFIT FROM THEMTIME YOUR ENTRIES AND EXITS FOR MAXIMUM PROFITDEVELOP PROPER RISK MANAGEMENT TO AVOID LOSING MONEYWORK ON YOUR MINDSET, TO AVOID TRADING BASED ON GREED OR FEARImagine no clients, no customers, no product or service to market. No office space, no overhead, no cold calling, no networking, no invoices to send, no co-workers… and NO BOSS.The Lone Wolf strategy is designed for maximum simplicity and maximum profit with minimal risk. By trading a handful of blue-chip stocks with this specific, easy-to-understand strategy, you can easily make over 10-20% P&L on your trades every day.Create the world you want to live in. Harness the power that you already have inside your own mind and use it to change your life. Become a wolf.",
  "genres": [],
  "author": "Patrick Buchanan",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/199288168-secrets-of-the-lone-wolf-trader"
}