{
  "title": "Professor Mmaa's Lecture",
  "description": "“I recommend this book to the reader because it is massive, impressive, and grimly amusing. I cannot promise the reader that at any point he will shake his sides with laughter, but I can promise him a wry pleasure to be derived from the skilful dissection of folly.”  Bertrand Russell Professor Mmaa’s Lecture, given to a packed auditorium, deals with the habits, mentality and culture of Homo sapiens. But both the professor and his entire audience are termites; the whole story is set inside a termite mound.Naturally, Themerson’s attempt to comprehend humankind by examining how they would have been understood by insects is very funny. Termites have no sight, just a sense of smell, and can only explain their surroundings and lives through their insects’ angle on the world. The closing scene of the novel reveals what the termites have been researching and what has happened to their mound, giving the whole story an ironic twist.But this novel has much more to offer. Themerson’s heightened expertise and instinct for parodying the language and methods of scholarship, and the morals and manners of the academic world, produces a merciless and comical survey of philosophical views and attitudes. He pillories religion, language, reason and scholarship, as insect thinkers with suspiciously familiar names scuttle through the pages of the novel. A great many cases of dogmatic thinking and narrow-mindedness are exposed to ridicule. The only path that seems to earn the author’s approval is pluralism of ideas. You can see just why Bertrand Russell calls this novel a useful gospel for sceptics.Professor Mmaa’s Lecture is in the tradition of philosophical satire, whose most famous proponents are Voltaire and Swift, and is a rare incidence of light yet deep prose that can be read with great pleasure on several levels.",
  "genres": [
    "Philosophy",
    "Fiction",
    "Poland",
    "Polish Literature",
    "Novels",
    "20th Century"
  ],
  "author": "Stefan Themerson",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/1110823.Professor_Mmaa_s_Lecture"
}