{
  "title": "The Consequence of Anna",
  "description": "The Instant #1 BESTSELLER, reminiscent of The Thorn Birds, The Light Between Oceans, and Lady Chatterley’s Lover. Poignant, heartbreaking, and unforgettable. Inspired by a TRUE STORY . . .Nominated for a PULITZER PRIZE . . . Soon to be a MAJOR MOTION PICTURE.“An intense and emotional read!” – Rhys Bowen, New York Times bestselling author of In Farleigh Field and The Tuscan Child\n\"SHAMED BE THE WOMAN WHO ALLOWETH SUCH A SIN!\"\nSet against the sprawling backdrop of 1930s Australia, Anna May Shahan is a wild child raised on a lush farm by the sea, always barefoot and playing in her neighbor’s secret garden. Her Aboriginal nanny teaches her the ways of the land, and she grows up to be a quirky, eccentric, and sweet woman. But she is not without her demons, as she struggles with bizarre behaviors and a haunting, dark side.Soon after marriage, Anna inherits Sugar Alexandria, her family’s sheep station, and she and her Irish husband James lead a simple, hardworking life. That is until Anna’s beautiful widowed cousin Lottie returns from London after being absent for over a decade. Lottie confesses to Anna her heart’s greatest desire to have a child, and Anna, in fear of losing her beloved cousin again, seeks to grant her wish by means of her own husband. What happens next brings devastating consequences for them all.A literary achievement and the most emotionally gripping book of the year, The Consequence of Anna is a complex historical family saga, intertwined with the haunting mystery of Anna’s mental illness and the secrets, lies, and revelations revealed through the hidden passions of Lottie and James. Layered with lush romance, obsessive love, the strong bond of female friendship, and the frightening effects of altruistic intentions gone wrong, this provocative and powerful allegory cuts through rules and boundaries and proves the old adage that no good deed goes unpunished!",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Novels",
    "Drama",
    "Book Club",
    "Romance"
  ],
  "author": "Kate Birkin",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/199280824-the-consequence-of-anna"
}