{
  "title": "Therese Raquin",
  "description": "Zola’s 20 Rougon-Macquart novels are a panoramic account of the Second French Empire. They are the story of a family principally between the years 1851 and 1871. These 20 novels contain over 300 major characters, who descend from the two family lines of the Rougons and Macquarts and who are related. In Zola’s words, which are the subtitle of the Rougon-Macquart series, they are \"L’Histoire naturelle et sociale d’une famille sous le Second Empire\"(\"The natural and social history of a family under the Second Empire\"). Most of the Rougon-Macquart novels were written during the French Third Republic. To an extent, attitudes and value judgments may have been superimposed on that picture with the wisdom of hindsight. The débâcle in which the reign of Napoleon III of France culminated may have imparted a note of decadence to certain of the novels about France in the years before that disastrous defeat. Nowhere is the doom laden image of the Second Empire so clearly seen as in Nana, which culminates in echoes of the Franco-Prussian War (and hence by implication of the French defeat). Even in novels dealing with earlier periods of Napoleon III’s reign the picture of the Second Empire is sometimes overlaid with the imagery of catastrophe. In the Rougon-Macquart novels, provincial life tends to be overshadowed by Zola’s preoccupation with the capital. Only in his picture of rural working-class life in La Terre and in the corresponding picture of industrial working-class life in Germinal, does Zola convincingly escape from Paris into the provinces. The life of provincial towns is an even more noticeable omission from his achievement, for only in Le Rêve and in the twice repeated picture of Plassans (modeled upon his childhood home, Aix-en-Provence) does he achieve such a portrait (La Fortune des Rougon, La Conquête de Plassans). Le Docteur Pascal has the same setting but cannot properly be termed a novel of provincial life. La Débâcle, the military novel is set for the most part in country districts of eastern France; its dénouement takes place in the capital during the civil war leading to the suppression of the Paris Commune. Like Balzac, Zola’s imagination was roused by Paris and all that the capital represented to him.",
  "genres": [
    "Fiction",
    "France",
    "French Literature",
    "Classics",
    "19th Century",
    "Literature",
    "Novels"
  ],
  "author": "Émile Zola",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/19924404-therese-raquin"
}