{
  "title": "Let the Nations Be Glad!: The Supremacy of God in Missions",
  "description": "Why do we do missions? We are told, by Jesus, to preach the gospel and make disciples of all nations. So missions is duty, right? Wrong. If you do missions purely from a sense of duty you will not honor those you are reaching out to, nor will you truly honor God. Duty is the wrong place to look, so where do we find the answer to why we do missions? We turn, according to John Piper, to worship. // In our worship of God we encounter God's glory. The overflow from our worship is a desire to share God's glory with others (the chief end of man is to glorify God and enjoy Him forever), and we naturally become missional. When Jesus was asked what the kingdom of God was like, he compared it to a pearl so valuable that one would sell all they owned simply to possess it. Does that seem like duty to you? Instead, Jesus calls us to a new mindset, which flows from the mindset that worship creates in us. Thus, according to Piper, does worship become the goal of missions and the fuel which makes missions possible. // Worship as the fuel for missions makes sense to a lot of people, but worship as the goal of missions? Piper reminds us that the true reason we share God with others is to make them worshipers (and sharers) as well. He feels that the true goal of missions is \"the gladness of the peoples in the greatness of God.\" If it is true, (as Piper states) that \"God is most glorified in us when we are most satisfied in Him,\" then increasing the number of people who are satisfied in God will bring God more glory. And missions is the way we can do that. // Missions must be seen as more than simply saving people from sin, though that is a very important aspect. And missions is not just about getting people into heaven, although that is important as well. Instead, through missions we should always seek to make as many people as possible into true worshipers, into those fully satisfied with the greatness of God. // With that mindset, missions becomes a joyous experience, as we joyfully share the life-changing presence of God in our lives with those who don't know God. When we have made worship both the fuel and goal of all our missionary endeavors, we realize that \"missions is not a recruitment project for God's labor force. It is a liberation project from the heavy burdens and hard yokes of other gods.\" Missions is never a burden, because it comes out of our overwhelming joy in God's grace and mercy, and we just want to share that joy. So make God the center of your missions work, and joyfully share what He has graciously given to you.",
  "genres": [
    "Theology",
    "Christian",
    "Nonfiction",
    "Faith",
    "Christianity",
    "Evangelism",
    "Christian Living"
  ],
  "author": "John      Piper",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/199252.Let_the_Nations_Be_Glad_"
}