{
  "title": "A Free Life",
  "description": "From Ha Jin, the widely-acclaimed, award-winning author of Waiting and War Trash, comes a novel that takes his fiction to a new setting: 1990s America. We follow the Wu family--father Nan, mother Pingping, and son Taotao--as they fully sever their ties with China in the aftermath of the 1989 Tiananmen Square massacre and begin a new, free life in the United States.At first, their future seems well-assured--Nan’s graduate work in political science at Brandeis University would guarantee him a teaching position in China--but after the fallout from Tiananmen, Nan’s disillusionment turns him towards his first love, poetry. Leaving his studies, he takes on a variety of menial jobs while Pingping works for a wealthy widow as a cook and housekeeper. As Nan struggles to adapt to a new language and culture, his love of poetry and literature sustains him through difficult, lean years. Ha Jin creates a moving, realistic, but always hopeful narrative as Nan moves from Boston to New York to Atlanta, ever in search of financial stability and success, even in a culture that sometimes feels oppressive and hostile. As Pingping and Taotao slowly adjust to American life, Nan still feels a strange, paradoxical attachment to his homeland, though he violently disagrees with Communist policy. And severing all ties--including his love for a woman who rejected him in his youth--proves to be more difficult than he could have ever imagined.Ha Jin’s prodigious talents are evident in this powerful new book, which brilliantly brings to life the struggles and successes that characterize the contemporary immigrant experience. With its lyrical prose and confident grace, A Free Life is a luminous addition to the works of one of the preeminent writers in America today.",
  "genres": [
    "Fiction",
    "China",
    "Contemporary",
    "Literary Fiction",
    "Asia",
    "Audiobook",
    "Novels"
  ],
  "author": "Ha Jin",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/199215.A_Free_Life"
}