{
  "title": "TALES OF THE BOOGA DOOGA LAND - Pickwicks Plan",
  "description": "Pickwick's Plan is now a 5 Star book and a 2013 Readers Favorite Annual International Book Award Contest Finalist - award ceremony scheduled for 23rd November 2013 at Miami, USA.This book started out as a Bedtime story, told by the author to his little children around the year 1992-93 and remained in limbo, until finally, he decided to retire very early from his profession as a senior bank officer, to get these \"Family Read Together\" books published. It is his belief, that the books will be loved for generations by young and old alike!.  'Pickwick's Plan' begins with a Little Pixie Town on the edge of the enchanted Great Booga Dooga Forest, near the Great Booga Dooga Lake, in the enchanted Booga Dooga Land, and revolves around the life and adventures of one of the smallest Pixies, 'Pickwick' and his amazing 'OctoDoll'.  The adventure starts when, knowing that nothing can be done successfully unless a plan is made, and not knowing anything about how to prepare a 'Plan', they set about making an astonishing \"PLAN\", which is successfully set rolling and takes them to a successful and enchanting culmination. The very definition of a \"Plan\" must be redefined with a chuckle, after reading this book. The story was told chapter by chapter to his little children, and evolved in its telling. There was the magic of playing with the words of the English language, and the emergence of different beings like the amazing OctoDoll, the magical Emperor Angelfish, the cute 'Knock', the wise ScOwl, the magical Flowerfishes, and others, who have made the book a unique \"Family Read Together\" experience, which will be loved by people of all ages spanning all genres.  Every line is original, and every episode opens out new vistas. Another of tales of the Booga Dooga Land, 'The Wormus', has been published and will be followed by many other books in the series, with each being an independent book in itself.  Throughout the book, runs the thread of family unity and togetherness, aimed at delivering little lessons of courage, kindness and graciousness in the little events described in the book. This book is aimed at strengthening the 'family unit' and achieves its aim with great flair! It has gone a long way achieving its aim of being a trendsetter in what the author refers to, as a \"Family Read Together Children's\" book written to delight the entire family from \"Toddlers to the Toothless\". Deepak Menon is presently based New Delhi, India",
  "genres": [],
  "author": "Deepak Menon",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/19918100-tales-of-the-booga-dooga-land---pickwicks-plan"
}