{
  "title": "The Blues Brothers: An Epic Friendship, the Rise of Improv, and the Making of an American Film Classic",
  "description": "The story of the epic friendship between John Belushi and Dan Aykroyd, the golden era of improv, and the making of a comedic film classic that helped shape our popular culture “They’re not going to catch us,” Dan Aykroyd as Elwood Blues tells his brother Jake, played by John Belushi. “We’re on a mission from God.” So opens the musical action comedy The Blues Brothers , which hit theatres on June 20, 1980. Their scripted mission was to save a local Chicago orphanage; but Aykroyd, who conceived and wrote the film, had a greater to honor the then-seemingly forgotten tradition of rhythm and blues, some of whose greatest artists—Aretha Franklin, James Brown, John Lee Hooker, Cab Calloway, Ray Charles—made the film as unforgettable as its wild car chases. Late and vastly over budget, beset by mercurial and oft drugged-out stars, The Blues Brothers opened to tepid reviews at best. However, in the 44 years since it has been acknowledged a inducted into the National Film Registry for its cultural significance; even declared a “Catholic classic” by the Church itself; and re-aired thousands of times on television to huge worldwide audiences. It is, undeniably, one of the most significant films of the 20th century. The story behind any classic is rich; the saga behind The Blues Brothers , as Daniel de Visé reveals, is epic, encompassing the colorful childhoods of Belushi and Aykroyd; the comedic revolution sparked by Harvard’s Lampoon and Chicago’s Second City; the birth and anecdote-rich, drug-filled early years of Saturday Night Live , where the Blues Brothers were born as an act amidst turmoil and rivalry; and of course the indelible behind-the-scenes narrative of how the film was made, scene by memorable scene. Based on original research and dozens of interviews probing the memories of principals from director John Landis and producer Bob Weiss to SNL creator Lorne Michaels and Aykroyd himself, The Blues Brothers vividly portrays the creative geniuses behind modern comedy.",
  "genres": [
    "Nonfiction",
    "Music",
    "Biography",
    "History",
    "Audiobook",
    "Film",
    "Media Tie In"
  ],
  "author": "Daniel de Visé",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/199358929-the-blues-brothers"
}