{
  "title": "Christmas Cupid",
  "description": "From #1 Amazon Bestselling Author Ilsa Madden-Mills comes a brand new enemies to lovers holiday novella (40,000 words) about finding love in unexpected places.Dear Sneaky Santa, I’d like to have a word about your sense of humor. Was it really necessary to stick me, a professional hockey player nursing an injury and avoiding the media, in an isolated cabin with a bratty, boot-designing princess who seems to have made it her mission to despise me? I mean, come on, what did I ever do to you?And let’s talk about our first encounter. Was it your intention for her to barge in on me while I was enjoying a soak in the tub? It wasn’t exactly my finest moment, and I’m sure she didn’t appreciate the view of my massive body floundering around as I tried to grab a towel.Now, I’m stuck with her, thanks to a mutual acquaintance, in the middle of a snow blizzard, navigating through bear attacks, sketchy neighbors, and whole lot of tension. I had plans, Santa, plans to escape to Cabo and forget about the world, not to be trapped with a woman who thinks I’m unworthy of her time just because she can’t stand hockey players.Oh, and speaking of our delightful Iris, she’s stingier with her food than Scrooge was with his pennies! I’m not asking for a feast, but a guy’s got to eat! And could you possibly turn her yippy dog into a reindeer or something? It would certainly add to the Christmas spirit and save my eardrums.I’m trying to rediscover the meaning of Christmas, and you throw me into this chaos? Is this some kind of test, or are you just having a jolly laugh up there in the North Pole?So here’s my Christmas wish, Santa: sprinkle a bit of your magic and either get me out of here or be a Cupid and ignite a fiery, undeniable passion between us, because right now, this scenario is frostier than a snowman.Slapshotting Through the Snow, Kyler Blanchette",
  "genres": [
    "Christmas",
    "Romance",
    "Holiday",
    "Novella",
    "Sports Romance",
    "Forced Proximity",
    "Enemies To Lovers"
  ],
  "author": "Ilsa Madden-Mills",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/199290050-christmas-cupid"
}