{
  "title": "Red Side Story",
  "description": "The long-awaited follow-up to the New York Times bestselling Shades of Grey—in an exclusive edition for North American readers, complete with a never-before-published short story“Fforde's books are more than an ingenious idea. They are written with buoyant zest and are tautly plotted . . . and are embellished with the rich details of a Dickens or Pratchett.” —The IndependentWelcome to Chromatacia, where the societal hierarchy is strictly regulated by one's limited color perception. Civilization has been rebuilt after an unspoken “Something that Happened” five hundred years ago. Society is now color vision-segregated, professions, marriages, and leisure activities all dictated by an individual’s visual ability, and everything run by the shadowy National Color in far-off Emerald City.Out on the fringes of Red Sector West, twenty-year-old Eddie Russett is being bullied into an arranged marriage with the powerful DeMauve family, purples who hope to redden up their progeny’s color-viewing potential with Eddie’s gene stock. Their obnoxious daughter Violet is confident the marriage won’t hamper her style for too long because Eddie is about to go on trial for a murder he didn’t commit, and he’s pretty sure to be sent on a one-way trip to the Green Room for execution by soporific color exposure. Meanwhile, Eddie is engaged in an illegal relationship with his co-defendant, a Green, the charismatic, unpredictable, and occasionally deadly Jane Grey. Time is running out for Eddie and Jane to figure out how to save themselves. Negotiating the narrow boundaries of the Rules within their society, they search for a loophole—some truth of their world that has been hidden from its hyper-policed citizens. New York Times bestselling author Jasper Fforde returns to his fan-favorite Shades of Grey series with this wildly anticipated, laugh-out-loud funny and darkly satiric adventure about two star-crossed lovers on a quest to survive—even if it means upending their entire society in the process.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction",
    "Dystopia",
    "Humor",
    "Audiobook",
    "Science Fiction Fantasy"
  ],
  "author": "Jasper Fforde",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/199353348-red-side-story"
}