{
  "title": "A Thousand Times Before",
  "description": "A heartrending family saga following three generations of women connected by a fantastic tapestry through which they inherit the experiences of those that lived before them, sweeping readers from Partition-era India to modern day Brooklyn.Ayukta is finally sitting down with her wife Nadya to respond to a question she’s long avoided: Should they have a child? The decision is complicated by a secret her family has kept for centuries, one that Ayukta will be the first to share with someone outside their bloodline: the women in her family inherit a mysterious tapestry, through which each generation can experience the memories of those who came before her.Ayukta invites Nadya into this lineage, carrying her through its past. She relives her grandmother Amla’s life: Once a happy child in Karachi, Amla migrates to Gujarat during Partition, witnessing violence and loss that forever shape her approach to marriage and motherhood. Amla’s daughter, Arni, bears this weight in her own blood in 1974, when gender equity and urban class distinctions divide the community as a bold student movement takes hold. As Ayukta unspools these generations of women—whole decades of love, loss, heartbreak, and revival—she reveals the tapestry’s second gift: the ability for each of these women to dramatically reshape their own worlds. Like all power, both fantastic and societal, this inheritance is more treacherous than it seems.What would it mean, to impart an impossible burden? To withhold these incredible gifts?Sweeping, deeply felt and intergenerational, A Thousand Times Before is a debut as poetic as it is propulsive, as healing as it is heartbreaking, as it examines what it means to carry our past with us and to pass it on. Rooted in a tender love story, and spun with a tremendous amount of care, this book is a rare, remarkable feat from an incredible new literary talent.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Queer",
    "India",
    "LGBT",
    "Book Club",
    "Historical"
  ],
  "author": "Asha Thanki",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/199373441-a-thousand-times-before"
}