{
  "title": "Abraham Lincoln: The True Story of a Great Life",
  "description": "A quarter of a century has well-nigh rolled by since the tragic death of Abraham Lincoln. The prejudice and bitterness with which he was assailed have disappeared from the minds of men, and the world is now beginning to view him as a great historical character. Those who knew and walked with him are gradually passing away, and ere long the last man who ever heard his voice or grasped his hand will have gone from earth. With a view to throwing a light on some attributes of Lincoln's character heretofore obscure, and thus contributing to the great fund of history which goes down to posterity, these volumes are given to the world. If Mr. Lincoln is destined to fill that exalted station in history or attain that high rank in the estimation of the coming generations which has been predicted of him, it is alike just to his memory and the proper legacy of mankind that the whole truth concerning him should be known. If the story of his life is truthfully and courageously told-nothing colored or suppressed; nothing false either written or suggested-the reader will see and feel the presence of the living man. He will, in fact, live with him and be moved to think and act with him. If, on the other hand, the story is colored or the facts in any degree suppressed, the reader will be not only misled, but imposed upon as well. At last the truth will come, and no man need hope to evade it. \"There is but one true history in the world,\" said one of Lincoln's closest friends to whom I confided the project of writing a history of his life several years ago, \"and that is the Bible. It is often said of the old characters portrayed there that they were bad men. They are contrasted with other characters in history, and much to the detriment of the old worthies. The reason is, that the Biblical historian told the whole truth-the inner life. The heart and secret acts are brought to light and faithfully photographed. In other histories virtues are perpetuated and vices concealed. If the life of King David had been written by an ordinary historian the affair of Uriah would at most have been a quashed indictment with a denial of all the substantial facts. You should not forget there is a skeleton in every house. The finest character dug out thoroughly, photographed honestly, and judged by that standard of morality or excellence which we exact for other men is never perfect. Some men are cold, some lewd, some dishonest, some cruel, and many a combination of all. The trail of the serpent is over them all! Excellence consists, not in the absence of these attributes, but in the degree in which they are redeemed by the virtues and graces of life. Lincoln's character will, I am certain, bear close scrutiny. I am not afraid of you in this direction. Don't let anything deter you from digging to the bottom; yet don't forget that if Lincoln had some faults, Washington had more—few men have less. In drawing the portrait tell the world what the skeleton was with Lincoln. What gave him that peculiar melancholy? What cancer had he inside?\" Some persons will doubtless object to the narration of certain facts which appear here for the first time, and which they contend should have been consigned to the tomb. Their pretense is that no good can come from such ghastly exposures. To such over-sensitive souls, if any such exist, my answer is that these facts are indispensable to a full knowledge of Mr. Lincoln in all the walks of life. In order properly to comprehend him and the stirring, bloody times in which he lived, and in which he played such an important part, we must have all the facts—we must be prepared to take him as he was",
  "genres": [
    "Biography",
    "History",
    "Civil War",
    "American History",
    "Presidents",
    "Politics",
    "Nonfiction"
  ],
  "author": "William Henry Herndon",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/19936385-abraham-lincoln"
}