{
  "title": "Wandering Home: A Long Walk Across America's Most Hopeful Landscape: Vermont's Champlain Valley and New York's Adirondacks",
  "description": "The acclaimed author of The End of Nature takes a three-week walk from his current home in Vermont to his former home in the Adirondacks and reflects on the deep hope he finds in the two landscapes.Bill McKibben begins his journey atop Vermont’s Mt. Abraham, with a stunning view to the west that introduces us to the broad Champlain Valley of Vermont, the expanse of Lake Champlain, and behind it the towering wall of the Adirondacks. “In my experience,” McKibben tells us, “the world contains no finer blend of soil and rock and water and forest than that found in this scene laid out before me—a few just as fine, perhaps, but none finer. And no place where the essential human skills—cooperation, husbandry, restraint—offer more possibility for competent and graceful inhabitation, for working out the answers that the planet is posing in this age of ecological pinch and social fray.”The region he traverses offers a fine contrast between diverse forms of human habitation and pure wilderness. On the Vermont side, he visits with old friends who are trying to sustain traditional ways of living on the land and to invent new ones, from wineries to biodiesel. After crossing the lake in a rowboat, he backpacks south for ten days through the vast Adirondack woods. As he walks, he contemplates the questions that he first began to raise in his groundbreaking meditation on climate change, The End of Nature : What constitutes the natural? How much human intervention can a place stand before it loses its essence? What does it mean for a place to be truly wild?Wandering Home is a wise and hopeful book that enables us to better understand these questions and our place in the natural world. It also represents some of the best nature writing McKibben has ever done.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Nature",
    "Environment",
    "Memoir",
    "Adventure",
    "Outdoors"
  ],
  "author": "Bill McKibben",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/199361.Wandering_Home"
}