{
  "title": "The Middle Generation: A Novel of John Quincy Adams and the Monroe Doctrine",
  "description": "The classical era of American history began with the Revolution and ended with emancipation. Between these bookends lies the absorbing yet overshadowed epic of a new nation spearheading liberty's cause in a world skeptical of freedom arriving at all, much less in slaver's garb. M. B. Zucker takes readers back to that adolescent country in the care of an enigmatic guide, John Quincy Adams, heir to one president by blood and another, Washington, by ideology. Adams is the missing link between the founders and Abraham Lincoln, and is nigh unanimously regarded as America's foremost Secretary of State. Through Adams' eyes, readers will experience one of history's greatest and most forgotten his showdown with Europe over South American independence, the conflict which prefigured the Monroe Doctrine. With his signature dialogue and his close study of Adams' 51-volume diary, M. B. Zucker's The Middle Generation is a political thriller and character piece that surpasses his achievement in The Eisenhower Chronicles and ascends to the cinematic heights of the historical epics of David Lean and Steven Spielberg. It is an unforgettable portrait and a leap forward for one of our rising historical fiction novelists. ***** \"This captivating read offers an insightful portrait of one of the most important figures in American John Quincy Adams. The author's ability to portray the distant, flinty Adams, as a flesh and blood human being represents a remarkable achievement. This is historical fiction at its best, for the characters who animate Michael Zucker's novel ring true from the first page to the last. Zucker's novel is full of vibrant portrayals of all the key figures from the so-called Era of Good Feelings, including James Monroe, Andrew Jackson, John C. Calhoun, and Henry Clay. The Middle A Novel of John Quincy Adams and the Monroe Doctrine is an entertaining and enlightening read that all students of historical fiction and of American history will enjoy.\" - Stephen F. Knott, former Professor of National Security at the Naval War College and the author of Coming to Terms with John F. Kennedy ﻿﻿ \"M. B. Zucker goes well beyond a story of simple political intrigue. He offers one of the most moving literary portraits of a President I have ever encountered.\" -Dr. Jeffery Tyler Syck, Author of The Revolution of 1828: John Quincy Adams, Andrew Jackson, and the Origins of American Democracy﻿ \"John Quincy Adams is one of a small group of presidents whose major achievements to his country preceded and followed his time in the White House. In this splendid account of Adams's years as Secretary of State, Michael Zucker, a rising star in the area of historical fiction, recaptures JQA's extraordinary vision and true greatness.\" -Alvin S. Felzenberg, Presidential Historian and Author of The Leaders We Deserved...Rethinking the Presidential Rating Game",
  "genres": [
    "Historical Fiction",
    "American History"
  ],
  "author": "M.B. Zucker",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/199418186-the-middle-generation"
}