{
  "title": "Frostbite: How Refrigeration Changed Our Food, Our Planet, and Ourselves",
  "description": "An engaging and far-reaching exploration of refrigeration, tracing its evolution from scientific mystery to globe-spanning infrastructure, and an essential investigation into how it has remade our entire relationship with food—for better and for worse.How often do we open the fridge or peer into the freezer with the expectation that we’ll find something fresh and ready to eat? It’s an everyday act, easily taken for granted, but just a century ago, eating food that had been refrigerated was cause for both fear and excitement. Banquets were held just so guests could enjoy the novelty of eggs, butter, and apples that had been preserved for months in cold storage—and demonstrate that such zombie foods were not deadly. The introduction of artificial refrigeration overturned millennia of dietary history, launching an entirely new chapter in human nutrition. We could now overcome not just rot, but also seasonality and geography. Tomatoes in January? Avocados in Shanghai? All possible.In FROSTBITE, New Yorker contributor and co-host of the award-winning podcast Gastropod Nicola Twilley takes readers with her on a tour of the cold chain from farm to fridge, visiting such off-the-beaten-track landmarks as Missouri’s subterranean cheese caves, the banana-ripening rooms of New York City, and the vast refrigerated tanks that store the nation’s OJ reserves. Today, more than three-quarters of everything on the average American plate is processed, shipped, stored, and sold under refrigeration. It’s impossible to make sense of our food system without understanding the all-but-invisible network of thermal control that underpins it. Twilley’s eye-opening book is the first to reveal the transformative impact refrigeration has had on our health and our guts; our farms, tables, kitchens, and cities; global economics and politics; and even our environment.In the developed world, we’ve reaped the benefits of refrigeration for more than a century, but as Twilley soon discovers, the costs are catching up with us. We’ve eroded our connection to our food, extending the distance between producers and consumers and redefining what “fresh” really means. More importantly, refrigeration is one of the leading contributors to climate change. As the developing world races to build a U.S.-style cold chain, Twilley asks, can we reduce our dependence on refrigeration? Should we? A deeply-researched and reported, original, and entertaining dive into the most important invention in the history of food and drink, FROSTBITE makes the case for a recalibration of our relationship with the fridge—and how our future might depend on it.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Food",
    "Audiobook",
    "Health",
    "Technology"
  ],
  "author": "Nicola Twilley",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/199514774-frostbite"
}