{
  "title": "Christmas in My Heart A Second Treasury: More Heartwarming Tales of Holiday Joy",
  "description": "According to the New York Times Book Review, there are a few secrets to a good Christmas It should have a meaning.It should include a dying child.It should make readers cry.Any promise is possible.It should be short enough to read in one sitting.Most important, it should tell a story.If these are what make a Christmas story good, Christmas in My Heart, A Second Treasury will bring you nonstop Christmas joy.  From cover to cover, all fourteen of these stories represent the best in holiday memories.  And in reading them, you are creating memories for years to come.Amid the hustle and bustle of Christmas shopping, decorating, concerts, and parties, it is sometimes easy to forget what makes this time of year so special.  Nothing brings the real reason for Christmas into focus better than reading beloved stories that touch our hearts.  And no one brings us those stories better than Joe Wheeler, whose Christmas in My Heart won the favor of loyal readers from coast to coast.In Christmas in My Heart, A Second Treasury, Wheeler works his magic once again, bringing the joy of Christmas alive for even those Scrooges among us.  Its traditional and contemporary stories set this apart as a collector's item in the making--one destined to stand the test of time.  Whether we are laughing with Miss Enderby in \"Jolly Miss Enderby,\" crying with Dr. Loomis in \"The Tiny Foot,\" or feeling the warm glow of happiness in \"Christmas Is for Families,\" all of these wonderful stories bring us true peace.Whether you buy it because Joe Wheeler is so well known, or because the individual stories in this edition touch your heart, Christmas in My Heart, A Second Treasury is the best gift you can give anyone this Christmas, even yourself.",
  "genres": [
    "Christmas",
    "Fiction",
    "Short Stories"
  ],
  "author": "Joe L. Wheeler",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/1994975.Christmas_in_My_Heart_A_Second_Treasury"
}