{
  "title": "The Affirmative Action Empire: Nations and Nationalism in the Soviet Union, 1923–1939",
  "description": "\"Terry Martin looks at the nationalities policy of the early Soviet period and offers an insightful, detailed analysis of a problem that Soviet leaders grappled with throughout the twentieth century. As he points out, it was a problem that eventually helped to usher in the end of the USSR.\"― Amanda Wood Aucoin, New Zealand Slavonic Journal The Soviet Union was the first of Europe's multiethnic states to confront the rising tide of nationalism by systematically promoting the national consciousness of its ethnic minorities and establishing for them many of the institutional forms characteristic of the modern nation-state. In the 1920s, the Bolshevik government, seeking to defuse nationalist sentiment, created tens of thousands of national territories. It trained new national leaders, established national languages, and financed the production of national-language cultural products.This was a massive and fascinating historical experiment in governing a multiethnic state. Terry Martin provides a comprehensive survey and interpretation, based on newly available archival sources, of the Soviet management of the nationalities question. He traces the conflicts and tensions created by the geographic definition of national territories, the establishment of dozens of official national languages, and the world's first mass \"affirmative action\" programs. Martin examines the contradictions inherent in the Soviet nationality policy, which sought simultaneously to foster the growth of national consciousness among its minority populations while dictating the exact content of their cultures; to sponsor national liberation movements in neighboring countries, while eliminating all foreign influence on the Soviet Union's many diaspora nationalities. Martin explores the political logic of Stalin's policies as he responded to a perceived threat to Soviet unity in the 1930s by re-establishing the Russians as the state's leading nationality and deporting numerous \"enemy nations.\"",
  "genres": [
    "History",
    "Russia",
    "Nonfiction",
    "Soviet History",
    "Ukraine",
    "Politics",
    "Russian History"
  ],
  "author": "Terry   Martin",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/199527.The_Affirmative_Action_Empire"
}