{
  "title": "The Horse",
  "description": "Award-winning author Willy Vlautin explores loneliness, art, addiction, regret, love, and hard-won empathy in this poignant novel—his most personal to date—that captures the life of a journeyman musician unable to escape the tragedies of his past.Al Ward lives on an isolated mining claim in the high desert of central Nevada fifty miles from the nearest town. A grizzled man in his sixties, he survives on canned soup, instant coffee, and memories of his ex-wife, friends and family he’s lost, and his life as a touring musician. Hampered by insomnia, bouts of anxiety, and a chronic lethargy that keeps him from moving back to town, Al finds himself teetering on the edge of madness and running out of reasons to go on—until a horse arrives on his doorstep: nameless, blind, and utterly helpless. Al hopes the horse will vanish as mysteriously as he appeared. Yet the animal remains, leaving him in a conundrum. Is the animal real, or a phantom conjured from imagination? As Al contemplates the horse’s existence—and what, if anything, he can do—his thoughts are interspersed with memories of his life as a musician, from the moment his mother’s part-time boyfriend gifts him a 1959 butterscotch blonde Telecaster, to the day his life as a traveling musician begins. He joins various bands—all who perform his songs once they discover his talent–playing casinos, truck stops, clubs, and bars. He falls in love, and finds pockets of companionship and minor success along the way. Never close to stardom or financial success, he continues as a journeyman for decades until alcoholism and a heartbreaking tragedy lead him to the isolation of the barren Nevada desert. A poignant meditation on art, addiction, loneliness, heartbreak, and the reality of life on the road in smalltime bands, The Horse is a beautiful, haunting tale from an author working at the height of his powers.",
  "genres": [
    "Fiction",
    "Music",
    "Literary Fiction",
    "Contemporary",
    "Audiobook",
    "Literature",
    "Novels"
  ],
  "author": "Willy Vlautin",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/199532033-the-horse"
}