{
  "title": "Behind the Pickle Jar",
  "description": "Amy Hewston, Assistant Manager of Ultra Luscious Relaxation Spa, is so stressed she can barely function. Her anxiety on overdrive, she finds herself forced to take some time off work, despite her Type A, goal-oriented personality. Her well-meaning husband Matt decides the best road to recovery would be to rent a farmhouse north of the city, where the whole family can relax and regroup. Their two teens are far from onside when their family van pulls into the old farmhouse on Concession 5.While fixing a broken window in the cellar, Amy and Matt come across a diary behind a long-forgotten jar of pickles. The diary belonged to Isabel Huntly who lived in the farmhouse at the turn of the 20th century. As Amy gradually reads through its pages, the history of the century home and the family who lived there, takes hold of her psyche. Fascinated by the simple farm lifestyle and the intricate community, in contrast to her own harried existence, there is something about the diary that speaks to her.Suddenly her life choices, which once seemed so clear and obvious, are put to the test. She finds herself torn between the need to return to her stressful, high-paced career and her desire to live a simpler life, following her passion for opening a piano bar in a small town. Fraught with indecision, whichever choice Amy makes at this crossroad will affect herself and her family forever.This historical fiction, partially narrated by the old farmhouse itself, takes the reader on a journey through yesteryear, from horse-drawn buggies and church socials to Instagram and iPhones. Many people today can relate to Amy Hewston’s hectic life. Her daily struggles, eventual crisis and life altering decisions, would lead to great discussions over a glass of wine at any book club.",
  "genres": [
    "Book Club"
  ],
  "author": "Wendy McQuaig",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/199461321-behind-the-pickle-jar"
}