{
  "title": "The Insufferable Mr. Fletcher",
  "description": "Junior Sano, the design tracker on the hit series Elysian, is an Afro-Latina stunner who likes to be in control, wielding impermanence as a shield to protect herself by curating every aspect of her image. In an industry that can be cruel and exploitative, Junior has learned to hide her sensitive underbelly to get ahead without getting hurt. Which is why when new producer Davis Fletcher is ushered through the doors, she writes him off as yet another clueless corporate drone who’ll fail upward role-playing ‘Producer’ for imdb credits. Junior has no interest in the upheaval his fumbling inexperience will bring to her ordered environment.Davis Fletcher got his dark eyed good looks and single-minded determination from his Cree mother and generations of crippling poverty from his white father. When he left his one-horse town in Northern Nowhere, Ontario, seven years ago to pursue his dream career in television, ending up as the trusted right hand to the studio head with the chance to lead his own project was beyond his wildest imaginings. The final hurdle is completing a season in the trenches of their flagship series. He can’t afford any distractions. He won’t go home to be mocked for daring to rise above his station - not even for the walking, talking threat to his equilibrium that is Junior Sano.When Junior is voluntold to help Davis with the season finale, her usual method of avoiding the insufferable pedant won’t do her any good. Nor will braining him with a stapler. But as they spend time together, she finds he is not only alarmingly good at his job, but he has the uncanny ability to see through her façade. When Davis confesses that he likes her – like, he likes her likes her – and seals his declaration with a whopper of a kiss, Junior falls into a fling that starts to feel more permanent every day. But Junior and Davis clash on the best way to proceed with their he wants to go public while she balks at fixing what ain’t broke. To end this stalemate, Junior will have to decide if finding the one person capable of truly seeing her is worth the risk of relinquishing her precious control or will keeping the reins prove she has been the insufferable one all along.",
  "genres": [],
  "author": "Lindo Forbes",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/199526976-the-insufferable-mr-fletcher"
}