{
  "title": "Feen und Frösche",
  "description": "Ein Märchen voller Magie und knisternder RomantikVielleicht braucht die Welt manchmal eine Spur Chaosmagie ...Darf ich vorstellen? Ich bin Malea, dreizehnte Fee und größter Pechvogel im ganzen Königreich. Wo ich auch hingehe, ich hinterlasse eine Spur aus zerbrochenen Glasschuhen und verzauberten Fröschen. Und einer dieser ehemaligen Frösche - ein unverschämter Kerl namens Aurelian - hat mir die Sache mit dem Fluch besonders übel genommen. Aus Rache hat er meinen Zauberstab zerbrochen und ich habe deswegen aus Versehen die Königstochter verflucht. Und jetzt macht ihr entzürnter Vater Jagd auf uns Feen ...Ich muss meinen Fehler wiedergutmachen, selbst, wenn ich mich dazu mit diesem unausstehlichen Ex-Frosch verbünden muss.Als ich unten beim Esstisch ankam, lag der verzauberte Frosch immer noch entspannt im Wasser und ließ kleine Blubberbläschen an die Oberfläche steigen. Ich fischte ihn heraus.„Und?“, fragte er erwartungsvoll.„Nun, es gibt eine Möglichkeit“, sagte ich, während ich ihn auf der Hand in Richtung Wand trug. „Sie ist nicht sehr angenehm, aber einen Versuch ist es wert.“Mit einem entschuldigenden Schulterzucken schmetterte ich den Frosch an die Wand. Es gab einen unverhältnismäßig lauten Knall und er verschwand in einer grauen Rauchwolke, in der einige grüne Glitzerfäden hingen. Als der Rauch sich lichtete, erblickte ich einen jungen Mann, der auf dem Hosenboden saß, den Rücken an der Wand und sich stöhnend den Hinterkopf rieb.„Aua, so eine Frechheit“, schimpfte er und blickte fassungslos auf seine Hände.„Keine Schwimmhäute mehr“, murmelte er.Für einen Menschen war er gar nicht mal so hässlich, dachte ich. Das Gesicht war symmetrisch und die hellbraunen Haare sahen so aus, als würde es Spaß machen, darin herum zu wuscheln. Als der ehemalige Frosch offenbar begriffen hatte, dass der Fluch gelöst war, blickte er hoch. Seine Augen besaßen noch immer diesen beeindruckenden Farbton, ein helles Goldbraun. In den menschlichen Augen wirkte es bei Weitem nicht so seltsam wie bei einem Frosch. Nein, die edle Farbe passte in sein aristokratisch gemeißeltes Gesicht. Diese hübschen goldbraunen Augen funkelten mich jedoch ziemlich wütend an. Undankbarer Wicht! Offenbar nahm er mir den Wurf an die Wand übel. Dabei hatte es doch hervorragend funktioniert. Und dass ein Kuss ebenfalls eine Option gewesen wäre, musste er ja nie erfahren. Der Mann sprang auf, kniff die Augen zusammen und schien dann zu einer Erkenntnis zu kommen. Jegliche Farbe wich aus seinem Gesicht und er wirkte beinahe so grün, wie er noch vor ein paar Minuten gewesen war.„DU!“, stieß er aus. „Du bist die böse Fee, die mich verwandelt hat! Du hast mich mit dem Fluch belegt!“„Ich?“, rief ich empört. „Du hast dir den Kopf wohl zu sehr angeschlagen. Ich habe dich gerade von deinem Fluch befreit, du Blödmann. Etwas Dankbarkeit wäre da durchaus angeme...!“„Nein, nein, nein!“, unterbrach mich der Mann. „Als Frosch habe ich dich irgendwie nicht erkannt. Außerdem bist du um einiges älter geworden, aber ich bin mir ganz sicher.“Er deutete auf mein Gesicht.„Diese grünen Augen und die schwarzen Haare ... unverwechselbar!“Ein mulmiges Gefühl machte sich in meinem Bauch breit.„Wie lange warst du denn genau ein Frosch?“, fragte ich.Die Frage brachte den Mann aus der Fassung.„FÜNFZEHN JAHRE!“, brüllte er. „FÜNFZEHN ELENDE JAHRE!“Ich stolperte einen Schritt zurück. Vor fünfzehn Jahren hatte ich einen frechen Jungen in einen Frosch verwandelt. Ich war damals gerade einmal sechs gewesen, der Junge ungefähr elf. Es war mein erster Auftrag gewesen. Und Aurora hatte den armen Frosch nie gefunden.„Fünfzehn Jahre, die ich auf der Flucht vor Störchen verbracht habe und mich von Tümpel zu Tümpel gerettet habe“, knurrte der Mann und sah an sich herunter. „Bei Prinz Charming, du hast mir die ganze KINDHEIT GERAUBT!“",
  "genres": [],
  "author": "Lisa Schubert",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/199550712-feen-und-fr-sche"
}