{
  "title": "Molten Death",
  "description": "A glimpse of a quickly melting corpse at the foot of a volcano has amateur sleuth and food enthusiast Valerie Corbin shocked. But how can she investigate a murder, when there's no evidence the victim ever existed?The first Orchid Isle cozy mystery, set in tropical Hilo, Hawai'i, introduces a fun and feisty LGBTQ+ couple who swap surfing lessons for sleuthing sessions! Retired caterer Valerie Corbin and her wife Kristen have come to the Big Island of Hawai'i to treat themselves to a well-earned tropical vacation. After the recent loss of her brother, Valerie is in sore need of a distraction from her troubles and is looking forward to enjoying the delicious food and vibrant culture the state has to offer.Early one morning, the couple and their friend - tattooed local boy, Isaac - set out to see an active lava flow, and Valerie is mesmerized by the shape-shifting mass of orange and red creeping over the field of black rock. Spying a boot in the distance, she strides off alone, pondering how it could have gotten there, only to realize to her horror that the boot is still attached to a leg - a leg which is slowly being engulfed by the hot lava. Valerie's convinced a murder has been committed - but as she's the only witness to the now-vanished corpse, who's going to believe her?Determined to prove what she saw, and get justice for the unknown victim, Valerie launches her own investigation. But, thrown into a Hawaiian culture far from the luaus and tiki bars of glossy tourist magazines, she soon begins to fear she may be the next one to end up entombed in shiny black rock . . .The amiable characters, stunning backdrop and culinary delights make this the perfect cozy of fans who enjoy a tropical vacation with a twisty murder mystery and compelling Hawai'ian culture - paired with an added bonus of recipes of local Hawai'ian dishes!",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "LGBT",
    "Fiction",
    "Adult",
    "Lesbian",
    "Queer"
  ],
  "author": "Leslie Karst",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/199549081-molten-death"
}