{
  "title": "A Daughter of Fair Verona",
  "description": "Knives Out meets Bridgerton in Fair Verona, as New York Times bestselling author Christina Dodd kicks off a frothy, irreverent, witty new series with an irresistible premise—Romeo and Juliet’s daughter as a clever, rebellious, fiercely independent young woman in fair Verona—told from the delightfully engaging point of view of the captivating Rosie Montague herself…\"A sharp, determined heroine, a clever historical mystery, sparkling wit, a unique setting, family drama and a dash of romance.”– Amanda Quick, New York Times bestselling author of The Lady Has a PastOnce upon a time a young couple met and fell in love. You probably know that story, and how it ended (hint: badly). Only here’s the thing: That’s not how it ended at all.Romeo and Juliet are alive and well and the parents of seven kids. I’m the oldest, with the emphasis on ‘old’—a certified spinster at twenty, and happy to stay that way. It’s not easy to keep your taste for romance with parents like mine. Picture it—constant monologues, passionate declarations, fighting, making up, making out . . . it’s exhausting.Each time they’ve presented me with a betrothal, I’ve set out to find the groom-to-be a more suitable bride. After all, someone sensible needs to stay home and manage this household. But their latest match, Duke Stephano, isn’t so easy to palm off on anyone else. The debaucher has had three previous wives—all of whom met unfortunate ends. Conscience forbids me from consigning another woman to that fate. As it turns out, I don’t have to . . .At our betrothal ball—where, quite by accident, I meet a beautiful young man who makes me wonder if perhaps there is something to love at first sight—I stumble upon Duke Stephano with a dagger in his chest. But who killed him? His late wives’ families, his relatives, his mistress, his servants—half of Verona had motive. And when everyone around the Duke begins dying, disappearing, or descending into madness, I know I must uncover the killer . . . before death lies on me like an untimely frost.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Mystery",
    "Fiction",
    "Historical",
    "Retellings",
    "Audiobook"
  ],
  "author": "Christina Dodd",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/199611972-a-daughter-of-fair-verona"
}