{
  "title": "New Nebraska Lessons",
  "description": "She’s the only human on campus. Four paranormal guys all want a taste. But now a killer might beat them to it.When Cecilia moves to New Nebraska, she must brush shoulders with the dangerous paranormals forcibly relocated there. Taking a job at the college she attends to support her ailing mother, she figures keeping her head down will be easy. Instead, her unusual ordinariness turns heads all around town.Her professor, Aaron, hides both a shy sweetheart and a colossal grizzly beneath his hulking exterior. Despite their student – teacher relationship, neither he nor his territorial beast can stay away or let her go.Jaxon carries the weight of his wolf pack on his large, footballer shoulders. Pressure from his father to step up as alpha makes each day a chore, until delicate, kind Cecilia brings light into his life.Xander’s obsession with the new human’s blood soon transforms into a yearning to cherish and protect her that shatters his playboy instincts. But how can this hotshot vampire convince her his feelings are real for the first time in his very long life?Osric doesn’t give a f*ck about the ordinary human girl or the infatuation she’s stirred within his best friend, Aaron. As a Fae prince, he has far more important things to worry about, like the human-hunting serial killer stirring up old but unresolved tensions between humans and paranormals. But what happens when he starts to see a special spark in Cecilia and comes to dread the killer will spot it, too?New Nebraska Lessons is a slow burn, why choose romance. Multi POVs, multiple love interests, and smoldering with detailed, spicy scenes.This book is the first of the New Nebraska series, standalone romances set in the same world.",
  "genres": [
    "Reverse Harem",
    "Paranormal",
    "Shapeshifters",
    "Fae",
    "Vampires",
    "Fantasy",
    "College"
  ],
  "author": "Cara B. King",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/199553520-new-nebraska-lessons"
}