{
  "title": "Long-time Listener, First-time Werewolf",
  "description": "Contains the first three Kitty Norville books: Kitty and the Midnight Hour, Kitty Goes to Washington, and Kitty Takes a Holiday, as well as a short story \"Kitty Meets the Band\".DJ Kitty Norville never much liked doing the nightshift at K-NOB, Denver's alternative radio station - that is, until the attack that made her a werewolf. Now her habits have become decidedly more nocturnal, not to mention reckless. One night, in a fit of boredom, she ditches the stations dull '90s format in favor of posing a question to her listeners: Do you believe in vampires? The startling answer: Yes. Suddenly calls from anguished, alienated, self-proclaimed vampires, werewolves and witches begin pouring in, with Kitty dispensing on-air advice with unexpected aplomb. And all at once The Midnight Hour - late night radio's scariest, most surreal talk show - is born.But not everyone's thrilled with Kitty's newfound success. Carl, the alpha-male leader of Kitty's werewolf pack, takes her on-air bravado as a challenge to his authority. And Arturo, head of Denver's vampire families, is terrified she may let loose some privileged information that will be fatal to his kin. Either way, both honchos want her to quit. Then a deranged bounty hunter specializing in lycanthropes threatens to kill her on-air, forcing her to take werewolf form right in the studio... causing the most privileged information of all to go public: her own secret identity. Ahh, but it'll take more than coming out as a werewolf to keep Kitty Norville sidelined. And here are her first three other-worldly adventures: In addition to Kitty and the Midnight Hour, Kitty Goes to Washington, where she is invited to testify at a Senate hearing on behalf of all supernaturals... by a paranoid, bible thumping senator determined to expose her a monster; and Kitty Takes a Holiday, but her longed-for Colorado vacation gets cut short when nearby livestock turn up mutilated... with evidence of black magic afoot.",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Paranormal",
    "Vampires",
    "Werewolves",
    "Fiction",
    "Short Stories"
  ],
  "author": "Carrie Vaughn",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/1996864.Long_time_Listener_First_time_Werewolf"
}