{
  "title": "Highland Spirits",
  "description": "In the final volume of Amanda Scott’s engrossing Highland series, a Scottish heiress falls in love with a man who seems to have been plucked from her dreamsPenelope MacCrichton watches the tall, broad-shouldered figure walk toward her across the mist-shrouded loch. Is he a phantom, a restless, sensual spirit fated to live only in her secret fantasies? Or is he the seductive, brooding stranger she meets later in London . . . who may not be a stranger at all?Michael Mingary, Earl of Kintyre, is enchanted by the reserved Highland heiress, even as he’s haunted by unsettling dreams of a ghostly Scottish castle. Desperate to save his family legacy, he strikes a bargain with the Campbells—a clan with whom he has an old score to settle. But when Penelope makes a bold counter-proposal, he’s tempted beyond all measure. Surrendering to passion, Michael and Penelope gamble on a love that holds the promise of the future—a love that could be the fulfillment of all their dreams.Review“Perfect for readers who enjoy romances with a rich sense of history.” —BooklistAbout the AuthorA fourth-generation Californian of Scottish descent, Amanda Scott is the author of more than fifty romantic novels, many of which appeared on the USA Today bestseller list. Her Scottish heritage and love of history (she received undergraduate and graduate degrees in history at Mills College and California State University, San Jose, respectively) inspired her to write historical fiction. Credited by Library Journal with starting the Scottish romance subgenre, Scott has also won acclaim for her sparkling Regency romances. She is the recipient of the Romance Writers of America’s RITA Award (for Lord Abberley’s Nemesis, 1986) and the RT Book Reviews Career Achievement Award. She lives in central California with her husband.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Scotland",
    "Medieval"
  ],
  "author": "Amanda Scott",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/1996283.Highland_Spirits"
}