{
  "title": "Why (Not) Me?: Searching for God When We Suffer",
  "description": "“This is a story of enduring friendship and devastating illness, but also of repair, renewal, and the power of love to illuminate the miracle of ordinary life.”— Letty Cottin PogrebinAuthor of How to Be a Friend to a Friend Who’s SickOne man’s confrontation with his mortality as seen through another person’s eyes. In the face of devastating loss, the human soul still yearns for answers to timeless questions.What’s the meaning behind our pain? How does the divine intersect with our anguish? Where does evil fit into this narrative?Embark on an evocative journey with Rabbi Hirshel Jaffe, flanked by his dear friends Rabbi James Rudin and Marcia Rudin, in this refreshed edition of their seminal work. Charting Hirshel’s courageous confrontation with hairy cell leukemia, this narrative intricately melds his personal battles with deeply philosophical and spiritual inquiries that echo in our hearts today.As Eugene J. Fisher, Distinguished Professor of Theology at Saint Leo University, remarks, this “very moving book” provides insights into “how Jewish traditions have helped Jews survive tragedies over the centuries and today.”Explore the deep wisdom faith offers when facing a medical crisis. Through Hirshel’s eyes—as not just a patient, but also a rabbi tasked with consoling others—you’ll grasp the enduring and transformative power of belief, especially in the darkest times.Another cancer warrior, Jonathan D. Sarna, a noted professor at Brandeis University, connects with the book’s raw experience of what living with cancer means. He adds, “Since the authors have now survived into their eighties, it fills me with hope.”The authors and their loved ones have weathered storms of their own, accentuating the book’s universal resonance. This edition further inspires with thoughtful reflective questions composed to surface awareness, alternative thinking and action.The essence of this book surpasses eras and societal evolutions. Hirshel’s contemplations on life, mortality, and faith continue to touch souls, offering a balm for life’s daunting trials. Why (Not) Me? serves as a timeless lantern for all navigating our personal tempests.",
  "genres": [],
  "author": "Hirshel Jaffe",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/199653346-why-not-me"
}