{
  "title": "Adam & Evie's Matchmaking Tour",
  "description": "A rollicking, unforgettable romance about two strangers finding love despite their best efforts as they embark on a sweeping matchmaking tour through Việt Nam, perfect for readers of Carley Fortune and Abby Jimenez.What’s a few weeks to a lifetime of promise?Evie Lang’s life is in shambles. On the heels of losing her beloved aunt, she's unceremoniously fired from her poetry professorship by her secret boyfriend. Lacking income and inspiration, she's stuck in Ohio with no idea how to move forward—until hope arrives in a surprising letter.Auntie Hảo left Evie the deed to her San Francisco row house, a place full of Evie’s happiest memories. The catch? To inherit, she must go on a pre-arranged matchmaking tour in Việt Nam. The last thing Evie wants is to spend time with a group of strangers looking for love. But she can't resist the chance to finally visit her family’s native home.A world away, Adam Quyền has a chip on his shoulder. He’s working around the clock as CMO for his sister’s elite matchmaking business, a job complicated by her insistence that he knows nothing about love. He’s desperate to prove himself, so when she challenges him to join the inaugural tour, he reluctantly agrees.Adam thinks Evie is chaotic and unpredictable. Evie thinks Adam is grumpy and uptight. But from the bustling streets of Hồ Chí Minh City to the soaring waterfalls in Đà Lạt, they keep getting thrown together, their animosity charged with attraction…and they discover that true love may be out there, if they are willing to take a leap.Two stubborn hearts, one whirlwind adventure, Adam & Evie’s Matchmaking Tour is a story of how loving (and living) bravely can lead you to the most unexpected places—and the most imperfectly perfect loves.",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary",
    "Contemporary Romance",
    "Travel",
    "Adult",
    "Audiobook"
  ],
  "author": "Nora Nguyen",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/199793676-adam-evie-s-matchmaking-tour"
}