{
  "title": "A Daily Dose of Now: 365 Mindfulness Meditation Practices for Living in the Moment",
  "description": "Reduce stress, ease anxiety, and increase inner peace—one day at a time—with a year of easy-to-follow mindfulness meditation techniques.Certified mindfulness teacher, bestselling author, ultramarathoner, wife, and dog-mom Nita Sweeney shares mindfulness meditation practices to help anyone break free from worry and self-judgment.Mindfulness meditation trains you to live in the present moment—the now. Feel calmer. Think more clearly. Respond more effectively and enjoy a more fulfilling life. Even in tiny doses, mindfulness is scientifically proven to enhance physical and mental health, boost creativity, and improve cognition function.CONVENIENT, ACCESSIBLE FORMAT: Each of the 365 short entries includes a meditation-related quotation, a real-life example of how Sweeney uses mindfulness to enhance her life, and a new practice to show how to apply that day’s technique to your life. No need to stop your thoughts, travel to a monastery, or contort your body into a pretzel. Go at your own pace. Follow the suggestions in order or use the comprehensive index to find entries tailored to your needs.BACKED BY SCIENCE: Numerous studies show that mindfulness meditation is an antidote to scattered thinking and emotional distortion. Instead of escaping from reality into denial or distraction, each daily entry offers an expert meditation method for escaping INTO reality as a powerful way to deal with life’s inevitable ups and downs.BASED ON CENTURIES-OLD TRADITION: In A Daily Dose of NOW, Sweeney not only draws on her life and meditation experiences, her coaching and teaching, but also on her decades of study with highly respected teachers in traditions that date back centuries. These include Shinzen Young, author of The Science of Enlightenment and founder of Unified Mindfulness, Natalie Goldberg, Zen practitioner and bestselling author of Writing Down the Bones, and Sensei Sean Murphy, author of One Bird, One Stone and co-founder of Sage Institute for Creativity & Consciousness.RELATABLE, PRACTICAL ADVICE: Sweeney has lived with depression, anxiety, and bipolar disorder for most of her adult life. She formulated the exercises over thirty years as she experimented to find the most effective tools to recover from addiction, improve her mental health, and gain insight into the nature of reality. The resulting book, written in her uplifting, straightforward style, is a wellness toolkit for beginning and seasoned meditators alike.Discover the power of now as you incorporate the time-tested wellness tool of mindfulness into your life with this daily meditation practice guide.",
  "genres": [],
  "author": "Nita Sweeney",
  "average_rating": "4.89",
  "url": "https://www.goodreads.com/book/show/199699611-a-daily-dose-of-now"
}