{
  "title": "Verses in the Sand",
  "description": "Experience the Napoleonic Wars like never before, through the eyes of two men from opposite worlds, united by fate but destined for conflict. 'Verses in the Sand' is a gripping tale of action, romance, and friendship set against the backdrop of the Napoleonic Wars and the failed 1798 United Irishman rebellion, marking the beginning of a series that will explore British and Irish history between the years 1792 and 1815.In the year 1799, British army captain William Mason and fiery Irish convict Sean find their fates entwined. The sole survivors of a shipwreck, they find themselves stranded on a deserted island.William, the youngest son of a respected British noble, was set on the path of military service from a young age. Expected to join the army, he was commissioned an officer in the King's 33rd Regiment to serve under his cousin Colonel Arthur Wellesley. Sean, a fiercely proud Irishman, bore the scars of the ill-fated 1798 Rising. Captured at the Battle of Vinegar Hill, he was bound for the penal colonies of Australia.Despite their mutual distrust toward each other, both men realise they must cooperate to survive and eventually, animosity gives way to a fragile camaraderie. To pass the time, William takes it upon himself to tutor the once illiterate Sean in reading and writing, and discovers a brilliant and poetic soul within the young rebel. Sean's beautiful 'Verses in the Sand' take shape, only for the incoming tide to erase them with the dawn. This natural cycle becomes a powerful metaphor, offering both men a blank canvas, erasing the marks of their past and granting them a fresh beginning, regardless of their diverse backgrounds.However, the island transforms into a battlefield when Lady Elizabeth, a young English aristocrat, washes ashore. She is a captive to the enigmatic yet ruthless pirate captain, Mercier, and his sinister crew. Through several flashbacks, we witness an epic sea battle between a formidable British ship of the line and a swift French frigate — revealing the events leading up to Mercier's arrival on the island.William and Sean are thrust into the heart of a perilous rescue mission, setting the stage for a confrontational showdown with Mercier and his menacing crew.This is the first book in the United Irishmen series - the second book in the series will serve as a prequel to this story and follow both William and Sean's experiences in the 1790s culminating with the 1798 Rising. It is a tale of friendship, war, adventure, and tragedy.",
  "genres": [
    "Historical Fiction",
    "Historical Romance"
  ],
  "author": "Darren Beaming",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/199724294-verses-in-the-sand"
}