{
  "title": "The Ecstatic",
  "description": "Victor LaValle has already established himself as “one of the most eloquent voices of the approaching century” (Kirkus Reviews), a writer of darkly humorous tales full of haunting beauty, astonishing leaps of imagination, and language that “crackles and hums” (Chicago Tribune). The Ecstatic is LaValle’s debut novel, a startling tale of love, horror, sex, insanity, faith, morbid obesity, and the modern American family. Something is wrong with Anthony—our 318-pound hero—and it’s getting worse. A monster has caught his uncle and his mother; now it wants Anthony. Mental illness has been transmitted through his family’s blood. The three women in his life—his mother, younger sister, and grandmother—find him naked and disoriented in his off-campus college apartment and take him home to Queens, each determined to fix him in her own peculiar way. But his presence soon turns their house into a semisuburban asylum. Sweet but wickedly sarcastic, smart and heartbreakingly vulnerable, Anthony narrates his family’s surreal adventures through a world of grinning exploitation and fake cures, from storefront evangelists and neighborhood loan sharks to bogus beauty pageants and bootleg medical clinics. He corresponds with a dreadlocked Japanese militant, is haunted by a vicious pack of dogs, and tries to make his own horror movie, all in search of an answer to a question he doesn’t dare ask. Written in the tradition of misfit picaresques from Journey to the End of the Night and Invisible Man to A Confederacy of Dunces and The World According to Garp, The Ecstatic is the revelatory story of a family trying to save themselves from a ravenous world and their own unraveling minds.",
  "genres": [
    "Fiction",
    "Horror",
    "Humor",
    "Literary Fiction",
    "Mental Health",
    "Mental Illness",
    "Literature"
  ],
  "author": "Victor La Valle",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/1111143.The_Ecstatic"
}