{
  "title": "Tastes Like Shakkar",
  "description": "In the hilarious follow-up to the breakout rom-com Dating Dr. Dil, Nisha Sharma adds shakkar and mirch to Shakespeare’s iconic comedy Much Ado About Nothing for one sweet and spicy love story.Bobbi Kaur is determined to plan a celebration to remember for her best friend’s wedding. But she has two problems that are getting in her 1. The egotistical, and irritatingly sexy, chef Benjamin “Bunty” Padda is supposed to help her with the menu since he’s the groom’s best friend, and2. Someone is trying to sabotage the wedding.With aspirations of taking over her family’s event planning business, Bobbi knows that one misstep in managing the Kareena Mann and Prem Verma (#Vermann) party, along with the other weddings on her plate, will only give her uncle another reason not to promote her. That means Kareena’s big day and Bobbi's future career are on the line.Bunty will do anything for his best friend, even though he has his hands full in finding a new location for his next restaurant while also playing mediator between his brother and father, the celebrated Naan King. When Prem asks Bunty to help with the wedding menu, he agrees, especially since it puts him in close proximity to the delicious Bobbi Kaur. When a mystery shaadi saboteur starts leaving threatening notes, and cancelling cake orders, Bunty and Bobbi have no choice but to call a truce and face the volatile attraction they have for each other.Through masquerade fundraisers and a joint bachelor-bachelorette trip to Vegas, this chef and wedding planner explore their growing connection all while trying to plan a wedding at Messina Vineyards in a time crunch. But once the shaadi saboteur is caught and the wedding is over, will their love story have a happily ever after?With the return of the meddling aunties (who are scary good at finding information) and a lot of hilarity and hijinks, Bobbi and Bunty’s romance is an event you don’t want to miss.",
  "genres": [
    "Romance",
    "Contemporary",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Audiobook",
    "Fiction",
    "Forced Proximity"
  ],
  "author": "Nisha Sharma",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/199695865-tastes-like-shakkar"
}