{
  "title": "The Wolves of K Street: The Secret History of How Big Money Took Over Big Government",
  "description": "Two veteran investigative journalists trace the rise of the modern lobbying industry through the three dynasties—one Republican, two Democratic—that have enabled corporate interests to infiltrate American politics and undermine our democracy.On K Street, a few blocks from the White House, you’ll find the offices of the most powerful men in Washington. In the 1970s, the city’s center of gravity began to shift away from elected officials in big marble buildings to a handful of savvy, handsomely paid operators who didn’t answer to any fixed constituency.The cigar-chomping son of a powerful Congressman, an illustrious political fixer with a weakness for modern art, a Watergate-era dirty trickster, the city’s favorite cocktail party host…these were the sorts of men who now ran Washington. Over four decades, they’d chart new ways to turn their clients’ cash into political leverage, abandoning favor-trading in smoke-filled rooms for increasingly sophisticated tactics like “shadow lobbying,” where underground campaigns sparked seemingly organic public outcries to pressure lawmakers into taking actions that would ultimately benefit corporate interests rather than the common good. With billions of dollars at play, these lobbying dynasties enshrined in Washington a pro-business consensus that would guide the country’s political leaders—Democrats and Republicans alike—allowing companies to flourish even as ordinary Americans buckled under the weight of stagnant wages, astronomical drug prices, unsafe home loans, and digital monopolies. A good lobbyist could kill even a piece of legislation supported by the president, both houses of Congress, and a majority of Americans.Yet, nothing lasts forever. Amidst a populist backlash to the soaring inequality these lobbyists helped usher in, Washington’s pro-business alliance suddenly began to unravel. And while new ways for corporations to control the federal government would emerge, the men who’d once built K Street found themselves under legal scrutiny and on the verge of financial collapse. One had his namesake firm ripped away by his own colleagues. Another watched his business shut down altogether. One went to prison. And one was found dead behind the 18th green of an exclusive golf club, with a bottle of $1,500 wine at his feet and a bullet in his head.A dazzling and infuriating portrait of fifty years of corporate influence in Washington, The Wolves of K Street is a masterpiece of narrative nonfiction—irresistibly dramatic, spectacularly timely, explosive in its revelations, and absolutely impossible to put down.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Economics",
    "Business",
    "American History",
    "Government"
  ],
  "author": "Brody Mullins",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/199797863-the-wolves-of-k-street"
}