{
  "title": "The Nightward",
  "description": "LONG-LISTED FOR THE 2025 BRITISH SCIENCE FICTION ASSOCIATION AWARDS AND THE LOCUS AWARDS!Nebula and MIFRE award-winning author R.S.A. Garcia’s scifantasy debut novel—the first in a duology—in which Caribbean mythology meets The Witcher, introduces a world where women warrior-magicians rule, and a child princess and her bodyguard must flee an attempted coup and evade the wave of darkness sent to kill her.For 500 years Gaiea’s Hand has stood as a ward against the Dark. The Age of Chaos is a faded memory. The Goddess has left Gailand and given her Blessing to the Queens to rule in her stead.Princess Viella of the court of Hamber is the Spirit of Gaiea, presumptive heir to the throne and budding wielder of magic. And yet she’s still a child—not yet ten years old—and a day spent evading her teachers and her dutiful bodyguard, Luka, is much more satisfying than learning about telepathy, illusions, and other spells, or obeying even her mother, the Queen.There is time enough…until there isn’t.For the night the Queen hosts the Ceremony to confirm Viella as the next Hand of Gaiea, everything changes for her—in the most horrific way the assassination of Viella’s mother.Now Viella is Queen.Luka, despite resenting his position as royal babysitter, does not hesitate. He rushes his charge from the Court and vows to keep her safe. Yet he is unsure how to help a burgeoning Hand of Gaiea, let alone contend with his place as a man in a matriarchal world and the secret that is burning inside him.Together, they are on the run from darkness in a world where the lines between magic and technology are blurring and it’s up to a child and her protector to bring clarity and light back to the Queendom.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Mythology",
    "Adult",
    "Magic",
    "Audiobook"
  ],
  "author": "R.S.A. Garcia",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/199793379-the-nightward"
}