{
  "title": "Once Upon a Time: The Captivating Life of Carolyn Bessette-Kennedy",
  "description": "The life and legacy of Carolyn Bessette-Kennedy, wife of John F. Kennedy Jr., are reexamined in this captivating and effervescent biography that is perfect for fans of My Travels with Mrs. Kennedy , What Remains , and Fairy Tale Interrupted .A quarter of a century after the plane crash that claimed the lives of John F. Kennedy Jr., his wife Carolyn, and sister-in-law Lauren, the magnitude of this tragedy remains fresh. Yet, Carolyn is still an enigmatic figure, a woman whose short life in the spotlight was besieged with misogyny and cruelty.Amidst today’s cultural reckoning about the way our media treats women, Elizabeth Beller explores the real person behind the tabloid headlines and media frenzy. When she began dating America’s prince, Carolyn was increasingly thrust into an overwhelming spotlight filled with relentless paparazzi who reacted to her reserve with a campaign of harassment and vilification.To this day, she is still depicted as a privileged princess—icy, vapid, and drug-addicted. She has even been accused of being responsible for their untimely death, allegedly delaying take-off until she finished her pedicure. But now, she is revealed as never before.A fiercely independent woman devoted to her adopted city and career, Carolyn relied on her impeccable eye and drive to fly up the ranks at Calvin Klein in the glossy, high-stakes fashion world of the 1990s. When Carolyn met her future husband, John was immediately drawn to her strong-willed personality, effortless charm, and high intelligence. Their relationship would change her life and catapult her to dizzying fame, but it was her vibrant life before their marriage and then hidden afterwards, that is truly fascinating.Based on in-depth research and exclusive interviews with friends, family members, teachers, roommates, and colleagues, this comprehensive biography reveals a multi-faceted woman worthy of our attention regardless of her husband and untimely death.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Audiobook",
    "Biography Memoir",
    "Memoir",
    "Politics"
  ],
  "author": "Elizabeth Beller",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/199798216-once-upon-a-time"
}