{
  "title": "Grumpy Little Christmas",
  "description": "My country music career is going downhill fast, and my very public breakup isn't helping. All I want is to hide away at a cozy ski lodge this Christmas, avoid anything festive, and figure out what to do with my life. Is that so much to ask?Aksel Lund is a modern-day Viking who should be gracing magazine covers with his smoldery frown, not running the Havenkirk Ski Lodge like a tyrant. Unbeknownst to me, this map-dot town in Idaho doesn’t have a spa or know how to be chill about Christmas. Aksel’s eight-year-old daughter drags me to every single Snowmass celebration because I don’t have the heart to tell her no.Her grinch of a father though? He has no heart. When he’s not criticizing my music, or saving me from hurtling down the slopes, or arguing with me over my excessive luggage—it’s only five suitcases, calm down—he’s dodging my questions about why he’s a single dad and who keeps calling about his debts.I may be a celebrity— which basically makes me a scrooge in his eyes—but I know a thing or two about hard times. And it looks like Havenkirk will be sold to some rich developer the minute the tinsel comes down. If only Mr. Tall-Dark-and-Brooding would let me help save the lodge.And if only Aksel didn’t make my heart twist painfully in my chest and leave me panting whenever he turns that glower on me. If only I truly loved the season and could pull a Christmas miracle out of my guitar.Turns out a miracle is what I need to get Aksel out of my heart, too.Author’s Grumpy Little Christmas is a steamy small-town romance with low angst, high heat, and one grumpy alpha hero. If you like melt-your-marshmallows banter, gingerbread contests, snow sledding, mistletoe kisses, tender daddy-daughter moments, and lazy hot tub nights leading up to the sweetest holiday love affair between the two most unlikely people, then this is the romance for you! Grumpy Little Christmas is a complete standalone novel.",
  "genres": [
    "Christmas",
    "Holiday",
    "Romance",
    "Small Town Romance",
    "Contemporary",
    "Humor",
    "Romantic Comedy"
  ],
  "author": "Marika Ray",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/199870965-grumpy-little-christmas"
}