{
  "title": "Wasting Time on God: Why I Am an Atheist",
  "description": "★ ★ ★ ★ ★ “The best books about Atheism are the ones written by Paulo Bittencourt, because, unlike Richard Dawkings, Christopher Hitchens and Sam Harris, who have never been religious, he was raised Evangelical, studied Theology and, therefore, speaks from experience.” (D. Barker) ★ ★ ★ ★ ★ “Arguments so radically thorough, sharp and damning that they baffle even some atheists and make them feel like defending religious people.” (M. Shermer) Among theological, philosophical and historical arguments, in “Wasting Time on God” Paulo Bittencourt, who was a devout Adventist, active in the church, a Theology student and almost became a pastor, reveals the reasons why he doesn’t believe in invisible beings, including the celestial ones, and undoubtedly demonstrates that Atheism is the only intellectually honest stance. Do you have faith in God? Is it unshakable? How do you know, if you don’t put it to the test? Read this book to the end. If it doesn’t make you doubt any of the things you believe, nothing else will. It will be proven that you really stand firm in the faith. Topics covered: Allah, Atheism, Bible, Christianity, Adventist, Baptist, Catholic, Evangelical, Pentecostal Church, Communism, Devil, Evolution, Freethought, God, Gospel, Heaven, Hell, Islam, Jesus, Judaism, Mohammed, Philosophy, Protestantism, Satan, Science, Skepticism, Socialism, etc. Paulo Bitencourt was born in Castro, Brazil, spent his childhood in Rio de Janeiro and studied Theology in São Paulo. Close to becoming a pastor, he went on an adventure to Europe and ended up settling in Austria. The book “Ethics”, by Bento de Espinosa (Baruch Spinoza), turned him into a naturalist, humanist and freethinker. Paulo Bitencourt dedicates his life to helping people liberate themselves from religion. Paulo Bittencourt is the author also of the books “Liberated from Religion” and “Com Zeus Não Se Brinca” (Zeus Is Not to Be Played With). “I don’t want to believe, I want to know.” — Paulo Bittencourt Visit: liberatedfromreligion . wordpress . com",
  "genres": [
    "Spirituality",
    "Science"
  ],
  "author": "Paulo Bitencourt",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/199860611-wasting-time-on-god"
}