{
  "title": "The Truth About Woke: A deep dive into a pile of woke shit",
  "description": "We hear much about the wokerati nowadays, how easily offended they are, how they want to fill an already overburdened country with migrants at taxpayers’ expense, how they believe footballers ‘taking the knee’ for six seconds before a match is the answer to all our racial issues, how they believe in 56 or more different genders, how they want to stop the whole world from using oil, how they believe in ancestral guilt for slavery and how simple words can cause so much offence that they need to go and have a group hug and blubber their eyes out to their lefty vegetarian unwashed mates.I grew up in an age when most things were acceptable. You called a bird a bird, had the crack with your black mates about their skin colour, drank with the old tranny in the pub who'd often turn up in a dress and a wig but forgetting to shave ….. and who used the men's bogs. You fought people at bus stops, and you laughed at just about everyone and everything.Yes, you got into fights in pubs or at football, but you always put your glass down before going into a fight. You would never dream of glassing anyone, let alone stabbing them! What is wrong with the world nowadays!You danced to Young Gifted and Black by Bob and Marcia, even though you're now accused of being a racist for hating terrorismAnd now, thanks to the blubbering, self-righteous twatty woke brigade you can't do any of this anymore without being dragged in front of HR or being 'cancelled' (there's a word for you) or being thrown in Facebook Jail or having some woke mummy's boy burst into tears because you've misgendered him.What is the world coming to? Why should you and I stop using words we've used for 50 years or more just because all of a sudden it offends someone fragile snowflake?Where has it all gone wrong? Does any of it make any sense? Will the woke one day take over the world? Or is it just a load of nonsense stemming from the politically correct mob of the ‘70s?I’m well aware that in this book I may well be bringing fresh notions or concepts that will cause many people to think of me as a bit odd, but I’m okay with that, because maybe I’m just conscious and alive in a batty old world. That said, it doesn’t mean everyone will ‘get’ me, there are a million zings and zaps and tangs and wallops in the world. We all have a different piquancy. What it does mean, however, is that my Tribe can find meIn this book I don’t simply discuss the wokerati, but also touch on FGM, Ukraine, the cashless society, Automatic Intelligence, the Democratic Football Lads Alliance (DFLA), and even 1984 …. To name a few.When all’s said and done, I’ve only written what most people are thinking, including the woke mob, even if they won’t admit it to themselves.Using a metaphor from the Four Horsemen of the Apocalypse from the book of Revelations I finish by articulating exactly what the wokerati are trying to say, at least the eco-warriors, because most people actually agree with them but not their way of going about things. And not only do the lefty woke fail to express their point in meaningful terms, but they can never be honest with themselves about it.This book is for those who can be honest with themselves and is written in the language of the bloke who has a few pints before the game on a Saturday afternoon, a few more pints and a curry afterwards, and enjoys having the crack with his mates, but who is also concerned about the direction the world is heading.I hope you enjoy",
  "genres": [],
  "author": "Karl Wiggins",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/199900504-the-truth-about-woke"
}