{
  "title": "Rust-Colored Rain: A Zombie Apocalypse Thriller",
  "description": "The world was ready to defend against an asteroid of epic proportions… but nobody was ready for what came after.On the last day of normality in Mackinaw, Illinois, Oliver McCallister thinks his worst problem is figuring out how to come clean to his wife about the secret he’s been keeping from her. Zoe McCallister thinks her worst problem is squeezing in an errand at the courthouse before another long day of nursing classes—and worrying about whatever Oliver is hiding from her.Oliver has just started his garbage route when an emergency broadcast announces the arrival of a ten-kilometer-long asteroid. A nuclear strike successfully destroys the asteroid and turns the sky into a canvas of crimson clouds. People cheer. They dance in the rust-colored rain falling from the clouds. It seems the apocalypse has been avoided.But the apocalypse isn’t happening to people, it’s happening inside them.First their eyes bleed. A ravenous hunger consumes them. Their sanity breaks. Then they become… the undead.As the apocalypse unfolds, Oliver battles the undead to rescue a wise-beyond-her-years six-year-old named Jurnee and make his way back home, where he hopes he’ll find Zoe and safety. Before they can be reunited, Zoe must band together with a group of survivors to dodge the infectious red rains and escape a zombie-infested courthouse.Will Zoe’s medical knowledge, Oliver’s protective instincts, and Jurnee’s indomitable spirit be enough for them to find safe refuge in this new and frightening world? Will Oliver and Zoe be able to repair their strained marriage, or will this dire situation push them further apart?Rust-Colored Rain is the first book in a thrilling new science fiction zombie series from the author of the award-winning God Stones series. If you’re yearning for a character-driven thrill ride, edge-of-your-seat suspense, and brain-craving zombies, then you’ll love Otto Schafer’s Rust-Colored Rain.",
  "genres": [
    "Horror",
    "Zombies",
    "Dystopia",
    "Post Apocalyptic",
    "Science Fiction",
    "Fantasy",
    "Audiobook"
  ],
  "author": "Otto Schafer",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/199958705-rust-colored-rain"
}