{
  "title": "Straight from the Heart",
  "description": "You know the name and you can't mistake the voice. Now you can read the incredible story of how a shy, music-loving teenager called Gaynor Hopkins morphed into legendary international superstar Bonnie Tyler and carved out an extraordinary career that is still going strong to this day.After five decades in the business - during which time she has recorded some of the most iconic songs of all time, travelled the world and performed for royalty and the Pope - Bonnie is sharing her fascinating journey for the first time. And she's not holding back.From her early days growing up in a tiny mining village in South Wales, to her career as a club singer that led to her accidental discovery by a talent scout, the Top of the Pops devotee had no idea she would one day grace the infamous illuminated stage alongside some of her biggest idols. Her rise to fame would sound like a fairy tale if it wasn't all true.Bonnie has always determinedly followed her own path, even when sceptical music execs told her she would fail. Her bravery led to her working with the legendary producer and songwriter Jim Steinman, going on to record the classic power ballads 'Total Eclipse of the Heart' and 'Holding Out for a Hero', as well as duetting with some of the best-known names in the business.She is undoubtedly one of the biggest vocal powerhouses of her generation, but her roots remain firmly in her beloved Wales. She is resolutely down to earth, funny and endlessly charming. Whether she's talking about the family she adores or sharing hilarious anecdotes from her many years in the spotlight, Bonnie never fails to entertain.Finally, we get to hear the amazing tale of a woman who has led the way for so many other female artists - and has had a bloody great time doing it. Bonnie's much-anticipated memoir is inspirational, moving and straight from the heart.",
  "genres": [
    "Biography",
    "Nonfiction"
  ],
  "author": "Bonnie Tyler",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/199881634-straight-from-the-heart"
}