{
  "title": "Berge, Meere und Giganten",
  "description": "Альфред Деблін (1878–1957) належить до когорти найвидатніших німецьких письменників двадцятого сторіччя. Він відомий передовсім завдяки експериментальному роману «Берлін Александерплац» (1929), який сьогодні вважається одним із найважливіших німецькомовних прозових творів ХХ століття, а також не менш дивовижному роману «Гори моря і велетні» (1924), створеному на перетині футурології, фантастики, антиутопії та візіонерства.«Гори моря і велетні» є унікальним новаторським романом не лише завдяки своєрідному авторському підходу до пунктуації, але й через загальну складну форму і стиль оповіді, тому жанр твору важко, та навіть неможливо визначити в рамках класичного жанрового поділу. Дослідники творчості Дебліна досі сперечаються, чи це філософська антиутопія, химерна наукова фантастика, а чи притча про майбутній апокаліпсис, який накликало на себе людство через власну деструктивну природу та ірраціональний потяг до самознищення. Проте всі погоджуються в тому, що «Гори моря і велетні» є непересічним явищем як для творчості самого Альфреда Дебліна, так і для німецької літератури загалом.Експериментальний і дивовижний у всіх сенсах роман «Гори моря і велетні» Альфреда Дебліна стоїть окремішньо не лише серед німецької та світової прози загалом, але й радикально вирізняється з-поміж інших творів самого автора, оскільки це єдиний фантастичний текст Дебліна. Тим цікавішим є цей творчий експеримент і виклик, який Деблін кинув сам собі, створивши роман, що неможливо означити жодним із відомих нині жанрів, а лише можна окреслити приблизний периметр жанрового наближення – це антиутопія, футурологія, наукова фантастика і навіть есхатологічний трактат про апокаліпсис.Дія роману відбувається у далекому майбутньому протягом п’яти сторіч, коли людство, як і саме життя на Землі, зазнають глобальних і докорінних змін. Велика Уральська війна як фінальний підсумок споконвічного протистояння Східної і Західної цивілізацій, розтоплення льодовиків Гренландії і вивільнення з вічної мерзлоти могутніх доісторичних рослино-тваринних гібридів, генна інженерія, трансгуманізм і відмова від технологій заради повернення до простого життя давно минулих і забутих епох, новітні химерні соціальні та геополітичні устрої, а можливо, навіть апокаліпсис як кінець старого світу і зародження світу нового, геть інакшого і чужого нашому сьогоденню, – Деблін широко й масштабно змальовує візії далекого майбутнього людської цивілізації, майбутнього, яке дивує і жахає, але яке, попри все, водночас є логічним продовженням і наслідком нашого непростого й буремного сьогодення.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "German Literature",
    "Germany",
    "Classics",
    "Environment",
    "Dystopia"
  ],
  "author": "Alfred Döblin",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/2000281.Berge_Meere_und_Giganten"
}