{
  "title": "Pacific Northwest K-9 Unit Books 7-9",
  "description": "Love Inspired Suspense brings you three full-length stories in one collection. Enjoy action-packed stories in the Pacific Northwest K-9 Unit series featuring canine crime-stoppers solving thrilling mysteries that will keep you on the edge of your seat!This box set includes:UNDERCOVER OPERATIONby USA Today bestselling author Maggie K. BlackK-9 officer Asher Gilmore and trainer Peyton Burns have two tasks: rescue three stolen bloodhound puppies and expose a drug ring. To outwit the criminals, they must go undercover as married smugglers with the help of an underwater-detection dog. But infiltrating the crime ring proves more dangerous than expected…SNOWBOUND ESCAPEby USA Today bestselling author Dana MentinkAfter months of tracking a colleague falsely accused of double homicide, officer Tanner Ford and his K-9 partner finally locate crime tech Mara Gilmore—but the real murderer is closing in. Forced to run into a frozen wilderness to survive, can Tanner protect Mara from a vicious assailant…before the harsh winter conditions bury them?K-9 NATIONAL PARK DEFENDERSby Katy Lee and Sharee StoverMembers of the Pacific Northwest K-9 Unit are in a race against time in these holiday novellas. Can rival officers Veronica Eastwood and Parker Walsh work together to save Veronica’s sister in Katy Lee’s Yuletide Ransom? And can K-9 officers Dylan Jeong and Brandie Weller stop a bomber out for revenge in Sharee Stover’s Holiday Rescue Countdown?From Love Inspired Suspense: Courage. Danger. Faith.Pacific Northwest K-9 UnitBook 1: Shielding the Baby by Laura ScottBook 2: Scent of Truth by Valerie HansenBook 3: Explosive Trail by Terri ReedBook 4: Olympic Mountain Pursuit by Jodie BaileyBook 5: Threat Detection by Sharon DunnBook 6: Cold Case Revenge by Jessica R. PatchBook 7: Undercover Operation by Maggie K. BlackBook 8: Snowbound Escape by Dana Mentink",
  "genres": [],
  "author": "Maggie K. Black",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/200050191-pacific-northwest-k-9-unit-books-7-9"
}