{
  "title": "We Are Not Good People",
  "description": "From the “exhilarating, powerful, and entertaining” (Guardian) storyteller of the Avery Cates series comes a gritty supernatural thriller featuring a pair of unlikely heroes caught up in the underground world of blood magic.The ethics in a world of blood are gray—and an underground strata of blood magicians has been engineering disasters for centuries in order to acquire enough fuel for their spells. They are not good people.Some practitioners, however, use the Words and a swipe of the blade to cast simpler spells, such as Charms and Cantrips to gas up $1 bills so they appear to be $20s. Lem Vonnegan and his sidekick Mags fall into this level of mage, hustlers and con men all. Lem tries to be ethical by using only his own blood, by not using Bleeders or “volunteers.” But it makes life hard. Soon they might have to get honest work.When the pair encounters a girl who’s been kidnapped and marked up with magic runes for a ritual spell, it’s clear they’re in over their heads. Turning to Lem’s estranged master for help, they are told that not only is the girl’s life all but forfeit, but that the world’s preeminent mage, Mika Renar, has earth-shattering plans for her—and Lem just got in the way. With the fate of the world on the line, and Lem both spooked and intrigued by the mysterious girl, the other nominates him to become the huckleberry who’ll take down Renar. But even if he, Mags, and the simpletons who follow him prevail, they’re dealing with the kind of power that doesn’t understand defeat, or mercy.Book One in the Ustari Cycle, the first portion of We Are Not Good People was originally published in an altered form as Trickster (Pocket Books).",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Fiction",
    "Horror",
    "Science Fiction Fantasy",
    "Thriller",
    "Dark"
  ],
  "author": "Jeff Somers",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/20019064-we-are-not-good-people"
}