{
  "title": "Red Clay, Running Waters",
  "description": "Red Clay, Running Waters is the little-known story of John Ridge, a Cherokee man dedicated to his people, and his White wife Sarah Northrop, a woman devoted to his cause.In 1824, John Ridge, the promising son of a Cherokee leader, returns from his New England education with his White bride, Sarah. John burns to realize the dream of an independent Cherokee Nation, using his eloquence, his education, and his Cherokee heart in defense of his people's humanity and rights. Peace at home evades when tensions rise between the Southern states and the federal government, pulling the couple into the crossfire of a divided country on the brink of civil war.As America wrestles for its soul over the fate of the Indians, John and Sarah unite to forestall a Cherokee diaspora, testing the limits of individual commitment and the meaning of sacrifice. The Ridges' abiding love for the Cherokee compel them to join forces seeking justice, but with options eroding, and Andrew Jackson in office, John and Sarah must confront an agonizing choice about the future of the Cherokee Nation. In a timely saga of one family's search for justice in the 1830s Removal Crisis, this story of profound love, sacrifice, and the meaning of home weaves the complex strands of politics, race, religion, and love into the tapestry of the turbulent times before the Trail of Tears. Grappling with universal themes - the meaning of love, commitment, and the courage to confront tyranny, Red Clay Running Waters is a vibrant and heart-breaking portrait of the Antebellum Era and the fate of Native Americans. Readers will be propelled across true events on a stunning journey across true events leading to a haunting and moving conclusion.",
  "genres": [
    "Historical Fiction",
    "Novels",
    "Drama",
    "Book Club",
    "Contemporary",
    "Historical"
  ],
  "author": "Leslie K. Simmons",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/200257206-red-clay-running-waters"
}