{
  "title": "The Lady or the Tiger? And, the Discourager of Hesitancy",
  "description": "Story summary: In ancient times, a king devised a system of justice where guilt or innocence was determined entirely by chance. The system worked this way: When a man committed a crime important enough to interest the king, notice was given that the fate of the accused person would be decided, on a given date, in the arena of the amphitheater. When the date arrived and everyone had assembled in the galleries, the king gave a signal, a door beneath him opened, and the accused stepped out into the arena. Two doors, exactly alike and side by side, faced the accused, and it was his duty to open one of them. He could open either door he pleased. If he opened the one, a hungry tiger would spring upon him and tear him to pieces. But, if he opened the other door, a beautiful lady came out and the accused was immediately married to her, as a reward for his innocence.The king had a beautiful daughter, with whom a young man of common blood fell in love. The king's daughter was also in love with the young man. The love affair went on for some time before the king discovered its existence. Immediately, the king had the youth placed into prison and set a day for the trial in the arena. The appointed day arrived, and the galleries of the arena were filled. The signal was given, a door beneath the royal party opened, and the lover of the princess walked into the arena. The princess, through the use of her position and money, had learned behind which door stood the lady and behind which waited the tiger. The youth expected her to have learned this information, and he looked toward her for a signal. Her signal was toward the right, and the youth went to the door on the right and opened it. The story leaves it up to the reader to decide which came out of the door--the lady or the tiger. Which did the princess decide? Was it to let her lover to live and love another woman, or did she decide that if she couldn't have him no one would?",
  "genres": [
    "Short Stories",
    "Classics",
    "Fiction",
    "School",
    "Read For School",
    "Fantasy",
    "Mystery"
  ],
  "author": "Frank R. Stockton",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/200337.The_Lady_or_the_Tiger_And_the_Discourager_of_Hesitancy"
}