{
  "title": "Only for the Brave at Heart: Essays Rethinking Race, Crime, and Justice",
  "description": "Only when we transform our minds can we break the chains of our mental enslavement and find true liberation from our misperceptions about race, crime, and justice.Social commentators and scholars have presented numerous theories on these topics. But while all lament the horrors associated with discrimination and racism, few so far have proposed a viable way to escape these sufferings.By taking a critical look at the writings of novelists, social commentators, and scholars in the fields of sociology, criminology, criminal justice, black studies, philosophy, and law, Professor Leon E. Pettiway presents a series of essays that provide a path that liberates us from these sufferings. In doing so, he provides a unique perspective that reframes the social realities of racial membership and institutional racism in the US and how they impact our perceptions of crime and justice.Buddhism and race are essential elements of these discussions, but Pettiway’s commentary is also informed by an Afrocentric perspective. In these ways, Pettiway examines our thoughts concerning race, the causes of crime, and the administration of justice. He uses these frameworks to demonstrate how our current modes of thinking reinforce and perpetuate white supremacy, influence our scholarly endeavors, and frame today’s public policies and social agendas.In Only for the Brave at Heart: Essays Rethinking Race, Crime, and Justice, readers will: learn new ways of thinking that can liberate our world from injustice assess the ways we create the realities of race, crime, and justice explore how love and compassion lead to meaningful actions that can reduce human sufferingPettiway has spent his career as an academic and Buddhist monk reflecting on and writing about the African-American experience. Only for the Brave at Heart attempts to create an intellectual movement that reimagines how we think about the perceived differences that fracture our society and disenfranchise so many.In the end, Only for the Brave at Heart is a critique and commentary on social justice. This powerful collection of essays about discrimination and racism will prove to be one of the most important books about race in America today.",
  "genres": [],
  "author": "Leon E. Pettiway",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/200296051-only-for-the-brave-at-heart"
}