{
  "title": "Antediluvian Tales",
  "description": "The work of almost every New Orleans writer has been irrevocably split into two periods: pre-Katrina and post-Katrina. As Poppy Z. Brite writes in the foreword to this new mini-collection, \"After the events of 2005, I couldn't see pairing stories I'd written before the flood with those I'd written after; for better or worse, my life, my outlook, and, necessarily, my work has changed forever ... These are literally antediluvian tales, stories written before August 29, 2005... Whatever else they may be, the stories in this little collection now seem almost impossibly innocent to me.\"Antediluvian Tales contains five stories of the Stubbs family, the New Orleans clan whose adventures Brite has chronicled in her popular Liquor novels and other works. Two more stories revisit the author's fictitious alter ego Dr. Brite, the coroner of New Orleans. Completing the book is \"The Last Good Day of My Life,\" a nonfiction look at the changes the past two years have wrought on Brite, filtered through a reminiscence about a day she spent knocking around Cairns, Australia.Any reader who loves New Orleans will treasure these antediluvian tales for the city that exists in them: a city that will never again exist in its pre-Katrina form, but which cannot be killed by hurricanes, floods, or governmental neglect as long as its artists continue to chronicle and cherish it.Table of Contents:Drink Up, Dreamers, You're Running Dry: A ForewordThe Feast of St. RosalieFour Flies and a SwatterHenry Goes ShoppingThe Working Slob's Prayer (Being A Night in the History of the Peychaud Grill)Crown of ThornsWound Man and Horned Melon Go to HellThe Devil of Delery StreetThe Last Good Day of My Life (A True Story)Appendix: Alternate Order of Stories",
  "genres": [
    "Short Stories",
    "Fiction",
    "Horror",
    "Collections",
    "Short Story Collection",
    "Fantasy",
    "Queer"
  ],
  "author": "Poppy Z. Brite",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/200377.Antediluvian_Tales"
}