{
  "title": "Don Segundo Sombra",
  "description": "Inspired in Don Segundo Ramirez, a cattle drover Ricardo Guiraldes met personally and whose tomb lies in San Antonio de Areco, very close to the author's own, Don Segundo Sombra more than a novel is a lesson on the gaucho lifestyle. Ricardo Guiraldes, a friend of Jorge Luis Borges - they both founded the legendary magazine Proa - managed to develop a simple and modern language, a high quality mixture of literacy and colourful local camp expressions that earned him a major standing among the best representatives of \"criollismo.\"Even though it may be considered as a continuity with Martin Fierro, more than an extinguished gaucho elegy Don Segundo Sombra proposes new ethical examples to a youth that Guiraldes considered disoriented and restless. Basically structured as lessons to be absorbed departing from inexperience, lessons on labour, amusement, morals, camp chores (horse taming, cattle rodeo, raw hide handy work, animal healing, etc.), they become an example of \"lo argentino\" supported by a very specific and precise lexikon.Our edition includes more than 300 lexicographic notes, conveniently placed at the bottom of the pages and intended to help the modern reader grasp the exact meaning of the text without obtrusive lengthy interruptions. The notes were made after a careful research work that included the critical Martin Fierro editions by Eleuterio F. Tiscornia, Ed. Losada, Buenos Aires, 1941; by Carlos Alberto Leumann, Ed. Angel de Estrada, Buenos Aires, 1945; and by Santiago M. Lugones, Ed. Centurion, Buenos Aires, 1948; their own notes compared between them and with the critical edition by Elida Lois y Angel Nunez, Ed. ALLCA XX (Association Archives de la Litterature Latinoamericaine, des Caraibes et Africaine du XX Siecle), Paris 2001; with Leopoldo Lugones en El payador, Ed. Centurion, Bs. As. 1948 (and Stockcero 2004); Francisco Castro in Vocabulario y frases del Martin Fierro, Ed. Kraft, Bs. As. 1950, and Domingo Bravo en El Quichua en el Martin Fierro y Don Segundo Sombra, Ed. Instituto Amigos del Libro Argentino, Bs. As. 1968; Horacio J. Becco en don Segundo Sombra y su vocabulario, Ed. Ollantay, Bs. As. 1952; Ramon R. Capdevila 1700 refranes, dichos y modismos (region central bonaerense), Ed. Patria, Bs. As. 1955; Emilio Solanet Pelajes Criollos, Ed. Kraft, Bs. As. 1955; and Tito Saubidet Vocabulario y refranero criollo, Ed. Kraft, Bs. As. 1943\"",
  "genres": [
    "Fiction",
    "Spanish Literature",
    "Classics",
    "Latin American",
    "Latin American Literature",
    "Modern Classics",
    "Novels"
  ],
  "author": "Ricardo Güiraldes",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/200299.Don_Segundo_Sombra"
}