{
  "title": "Held",
  "description": "A breathtaking and mysterious new novel from the beloved Anne Michaels, internationally bestselling author of Fugitive Pieces and The Winter Vault.1917. On a battlefield near the River Aisne, John lies in the aftermath of a blast, unable to move or feel his legs. Struggling to focus his thoughts, he is lost to memory—a chance encounter in a pub by a railway, a hot bath with his lover on a winter night, his childhood on a faraway coast—as the snow falls.1920. John has returned from war to North Yorkshire, near another river—alive, but not whole. Reunited with Helena, an artist, he reopens his photography business and endeavours to keep on living. But the past erupts insistently into the present, as ghosts begin to surface in his ghosts whose messages he cannot understand .So begins a narrative that spans four generations, moments of connection and consequence igniting and re-igniting as the century unfolds. In luminous moments of desire, comprehension, longing, and transcendence, the sparks fly upward, working their transformations decades later. This resonance through time—not only of actions but also of feelings and perceptions—desire in its many forms—are at the heart of this novel’s profound investigation.Held is a deeply affecting and intensely beautiful novel, full of unforgettable characters and imagery, wisdom and compassion. It explores the deepest mysteries, and the ways in which desire in its many forms—and perhaps the deepest desire, to find meaning—manifests itself. Held moves through history to light upon Darwin, Sir Ernest Rutherford, North Sea ganseys, early photography, Ella Mary Leather, modern field hospitals…while lovers find each other and snow drifts down across the centuries. From the WW1 battlefield where the novel begins, and its opening lines, Held is alive with \"We know life is finite. Why should we believe death lasts forever?”",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Literary Fiction",
    "Canada",
    "Historical",
    "War",
    "Audiobook"
  ],
  "author": "Anne  Michaels",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/200241802-held"
}