{
  "title": "A Memory of Things to Come",
  "description": "You have been lied to...You were told that monsters are fairy tales, stories created to scare you into obedience, little more than superstitious dogma which has no place in our modern society.That was a lie. Demons are real, and you are their prey. Melody’s life is going nowhere fast. Her dad is always gone, her sister is always in her way, and all she wants is to avoid being sent off to boarding school.  That is, until she discovers she’s anything but ordinary. As her new powers awaken, she stumbles headlong into a world filled with wannabe knights, insane stalkers, quirky AIs, and of course, demons bent on wiping her and everything she loves from existence.  But becoming a demon hunter isn’t just glory and gratitude from rescued victims. It’s mostly survival and not getting caught. And the deeper Melody moves into her new world, the harder either of those becomes.   Athena lived in an age of miracles: a time when immortality was an upload away, and her every want or need could be fulfilled by a nanite vat. An age that ended with the onslaught of the demon hordes. Pulled into a last-ditch program designed to give humanity a fighting chance, she escapes an attack with the only copy of the research that might give them a fighting chance. Now, she must survive long enough to share that knowledge.    Victor is an Imperial knight, a fact he’s quite proud of. It does, after all, get him a ton of attention from the ladies. Or at least it did… until he was saddled with protecting the spoiled trainee daughter of a higher-up.  Now he spends his days trying to keep her from getting the two of them slaughtered by the sudden upsurge of demons and their psychotic human minions, all the while dodging the small army of government agents who think he’s the one behind dozens of murders… which, to be fair, he is, because they were all demonically possessed.   With unforgettable characters and page-turning adventure, A Memory of Things to Come weaves several stories together into one cohesive tale of honor, sacrifice, the price of freedom, and the pain of loss.",
  "genres": [],
  "author": "J.S. Charette",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/200377314-a-memory-of-things-to-come"
}