{
  "title": "Lonely in London: A Pride and Prejudice Christmas Variation",
  "description": "No villains, no angst, just a sweet Darcy and Elizabeth Christmas story of 24,000 words written from a Christian I don’t know why I am feeling so low. Perhaps I am just not used to begin confined to the house, unable to be as much out of doors as I would be at home. Then it occurred to her, ah, the problem is that I miss my Jane. I am lonely!Reminding herself of her need for a confidante, she decided to write to Aunt Chatty, the advice columnist. What harm can it do? she thought, and began to write.Dear Aunt Chatty, I am visiting here in London with my aunt and uncle, who are kind and generous and very dear to me. My aunt is ill and I am here from my country home to aid with her children’s care until she is recovered. I feel quite guilty even bothering to write to you as I truly should not be complaining. But here I am writing whether or not it is justified.I generally visit my relations here in Town with my older sister, who is also my dearest friend and confidante. She was dealt a tremendous blow last autumn when a suitor who had been courting her assiduously and had captured her heart deserted her without explanation or even a farewell. He has now returned to our country neighborhood and has again been calling on her. I tell you all this to explain why she did not accompany me here and why I can’t write to her to seek her advice when she currently has so much to deal with herself.I, too, suffered a disappointment of the heart this past spring, which was entirely my own fault. I couldn’t bear to share the details with anyone, even my sister, but I have also been somewhat melancholy as a result of my self-inflicted heartache. I reacted in anger to some unfortunate comments and rejected a proposal of marriage from a very honorable gentleman. At the time, I thought him arrogant, conceited, and ungentlemanly. I have since learned that he is the opposite of my perception, but, of course, I can’t contact him to enlighten him about my change of heart.So here I am in the city, away from my closest family and friends as the festive season approaches, unable to even go out for a solitary walk to help clear my mind of my unhappy thoughts. I am without my confidante and feeling guilty about the pain I must have caused the man I so rudely rejected. I hope you can offer me some advice on how to regain my usual cheerful attitude.In the meantime, I am,Lonely in London",
  "genres": [
    "Christmas"
  ],
  "author": "Jae George",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/200316651-lonely-in-london"
}