{
  "title": "A New Position: Family Matters Book 1",
  "description": "Constant pressure. Too many bills. Too little money. Being a single mother raising two strong-minded and rebellious teenagers with no financial or emotional support from an absent ex-husband. A new and tough job working under a tough but fair boss. Competing in the dating meat market with girls younger, prettier and definitely more well-built than I am. Plus the unavoidable fact that I’ve almost hit the Big 4 0 – or, more accurately, that it’s about to hit me full in the face - before whipping around and kicking me in the ass for good measure!What I needed more than anything else was to be able to just let go and have some fun while I was still able.Carrie: I was just so damned frustrated. Oh, not so much physically, I guess. After all, I did at least have a boyfriend managed to do at least a minimal job in performing his male duty. No, the causes of my frustration were my mother and brother.I’m a grown woman. I’ve been legal age a long time now. Even so, mom insisted on treating me as if I were still a little girl. Clean up my room! Stop texting my girlfriends or surfing social media so much! Study harder! Pull up my grades. I mean, really! I’m a grown woman, not a child!Then there’s my brother. He’s been so sullen and withdrawn since mom divorced dad. I honestly don’t know what his problem is. After all, anyone can see that mom was in the right kicking dad out. He really did drink up most of his paycheck. And even we kids could tell that dad didn’t try very hard to keep it inside his pants when he met a willing woman at some bar. So what did Harry expect mom to do? Just grin and bear it? Mom isn’t some sort of mousy doormat type. She’s a strong, independent woman – the type of woman she’s raising me to be.So I was so frustrated I could hardly stand it. But then I met a man who I knew had just what I needed to completely satisfy every one of my female needs, to relieve all my womanly frustrations. Now all I had to do was convince him that I was woman enough to satisfy all his male wants and needs.Family Neither of us women would have guessed that the solution to both our problems involved voluntarily, even enthusiastically, – surrendering to a life of total and complete sexual submission to a loving, caring and considerate – as well as strict, firm and demanding Dominant. Neither of us would ever have expected that the solution to our problems would involve freely living a thoroughly kinky lifestyle filled with sex - vaginal, oral and anal -as well as erotic bare-ass spankings, paddling, whipping and bondage – not to mention also filled with orgasms so explosive and volcanic that they shook our being to our very core. We describe all these activities, and more, in these journals in explicit and graphic detail using clear and descriptive language rather than polite euphemisms. So if the explicit depiction of erotic and kinky actions between consenting adults may offend you, do not purchase or read these journals. These journals are written about and for consenting adults. So if you are under the age of 18 or the explicit description of intimate, often kinky, activity between consenting adults may offend you, do not purchase or read these journals.Finally, since it should be obvious that no modern woman would ever willingly, voluntarily and enthusiastically surrender total control over every inch of her body to any other individual, no matter how loving, caring and trustworthy that person is or how much sensual and sexual satisfaction she enjoys the reader would therefore realize that these journals are mere works of erotic fantasy and do not represent activities that would ever occur in o",
  "genres": [],
  "author": "Violet Carrie",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/200606029-a-new-position"
}