{
  "title": "The Witches of New York",
  "description": "The beloved, bestselling author of The Birth House and The Virgin Cure is back with her most beguiling novel yet, luring us deep inside the lives of a trio of remarkable young women navigating the glitz and grotesqueries of Gilded-Age New York by any means possible, including witchcraft... The year is 1880. Two hundred years after the trials in Salem, Adelaide Thom ('Moth' from The Virgin Cure) has left her life in the sideshow to open a tea shop with another young woman who feels it's finally safe enough to describe herself as a witch: a former medical student and \"gardien de sorts\" (keeper of spells), Eleanor St. Clair. Together they cater to Manhattan's high society ladies, specializing in cures, palmistry and potions--and in guarding the secrets of their clients. All is well until one bright September afternoon, when an enchanting young woman named Beatrice Dunn arrives at their door seeking employment. Beatrice soon becomes indispensable as Eleanor's apprentice, but her new life with the witches is marred by strange occurrences. She sees things no one else can see. She hears voices no one else can hear. Objects appear out of thin air, as if gifts from the dead. Has she been touched by magic or is she simply losing her mind? Eleanor wants to tread lightly and respect the magic manifest in the girl, but Adelaide sees a business opportunity. Working with Dr. Quinn Brody, a talented alienist, she submits Beatrice to a series of tests to see if she truly can talk to spirits. Amidst the witches' tug-of-war over what's best for her, Beatrice disappears, leaving them to wonder whether it was by choice or by force. As Adelaide and Eleanor begin the desperate search for Beatrice, they're confronted by accusations and spectres from their own pasts. In a time when women were corseted, confined and committed for merely speaking their minds, were any of them safe?",
  "genres": [
    "Historical Fiction",
    "Fantasy",
    "Fiction",
    "Witches",
    "Historical",
    "Book Club",
    "Paranormal"
  ],
  "author": "Ami McKay",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/20053031-the-witches-of-new-york"
}