{
  "title": "Caitlin Star",
  "description": "Caitlin Star is our last hope.After losing her foster parents at the age of thirteen, Caitlin is uprooted from the only home she had ever known. Heartbroken, she travels back to her birthplace-Pittsburgh, Pennsylvania-to live with a relative.One night Caitlin is harassed by a carload of drunken fiends. Just as the would-be rapists prepare to move in on the teen-age girl-a muscle-bound rescuer steps out of the shadows and intercedes on Caitlin's behalf-a mysterious and charismatic man named Gunner Star.Gunner Star takes on Caitlin as his protege and trains her in the ways of the Bull Mongoni, a mythic species of hominids that lived long ago. An exciting, brave new world opens up for Caitlin as she discovers a new philosophy, achieves an astonishing level of physical and mental focus, and begins to see the world around her from a new perspective.Caitlin learns she is not alone as Gunner Star's Bull Mongoni philosophy grows into a world-wide, cultural movement. But there are dark forces at work in a new right-wing extremist government. The separation of church and state is banished. The Supreme Court is eliminated. New laws are passed deeming that anyone who believes the earth is older than 6000 years is a criminal who must be hunted down by a government police force known as the Moral Authority.Free thinking is considered dangerous to a government who has turned the National Parks over to the Big Oil Mafia and controls the bodies of all post-pubescent women via an inserted tracker probe. Soon the Moral Authority sets their sites on the Bull Mongoni and it falls upon Catlin Star to lead her fellow rebels, battle a sadistic enemy, save the very freedom of North America, and restore hope for the future of the planet itself.Action, romance, satire, sex, suspense, political intrigue, and sword fights to the death-this book has it all. Caitlin Star is the femme fatale action hero of the new generation.",
  "genres": [
    "Dystopia",
    "Action",
    "Young Adult",
    "Science Fiction",
    "Paranormal",
    "Fantasy",
    "Adventure"
  ],
  "author": "James J. Caterino",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/20054503-caitlin-star"
}