{
  "title": "Diego Rivera: The Complete Murals",
  "description": "Diego in The most comprehensive study of Rivera's work ever made \t \t\t \t \t\tA veritable folk hero in Latin America and Mexico’s most important artist—along with his wife, painter Frida Kahlo— Diego Rivera (1886–1957) led a passionate life devoted to art and communism. After spending the 1910s in Europe, where he surrounded himself with other artists and embraced the Cubist movement, he returned to Mexico and began to paint the large-scale murals for which he is most famous. In his murals, he addressed social and political issues relating to the working class, earning him prophetic status among the peasants of Mexico. He was invited to create works abroad, most notably in the United States, where he stirred up controversy by depicting Lenin in his mural for the Rockefeller Center in New York City (the mural was destroyed before it was finished). Rivera’s most remarkable work is his 1932 Detroit Industry , a group of 27 frescos at the Detroit Institute of Art in Michigan. \t\tThis lavish volume— the first book to feature Rivera’s complete mural oeuvre, including newly discovered works —features numerous large-scale details of the murals, allowing their various components and subtleties to be closely examined. In addition to the murals is a vast selection of paintings, vintage photos, documents, and drawings from public and private collections around the world many of which the whereabouts were previously unknown to scholars and whose inclusion here is thanks to the most intense research performed on Rivera’s work since his death. Texts include an illustrated biography and essays by prominent art historians offering interpretations of each mural. One could not ask for a more comprehensive study of Rivera’s oeuvre; finally, a half-century after Rivera’s death, his work is the subject of the sweeping retrospective it deserves. \t\t The works of Diego Rivera are herein reproduced with the authorization of CONACULTA-INBA, Mexico, 2007. D. R. 2007 Banco de México, Fiduciario en el Fideicomiso relativo a los Museos Diego Rivera y Frida Kahlo. Av. Cinco de Mayo No. 2, Col. Centro, Del. Cuauhtémoc 06059, México D. F.\t\tPhotograph by Rafael Doniz\t\t© 2007 TASCHEN GmbH \t\tContributing María Estela Duarte Sanchez, Laura González Matute, Renato González Mello, Catha Paquette, Ana Isabel Pérez Gavilán Ávila, Nadia Ugalde Gómez, Marina Vázquez Ramos, James Weschler",
  "genres": [
    "Art"
  ],
  "author": "Luismartin Lozano",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/1111515.Diego_Rivera"
}