{
  "title": "Becoming Earth: How Our Planet Came to Life",
  "description": "A vivid account of a major shift in how we understand Earth, from an exceptionally talented new voice. Earth is not simply an inanimate planet on which life evolved, but rather a planet that came to life.One of humanity’s oldest beliefs is that our world is alive. Though once ridiculed by some scientists, the idea of Earth as a vast interconnected living system has gained acceptance in recent decades. We, and all living things, are more than inhabitants of Earth—we are Earth, an outgrowth of its structure and an engine of its evolution. Life and its environment have coevolved for billions of years, transforming a lump of orbiting rock into a cosmic oasis—a planet that breathes, metabolizes, and regulates its climate.Acclaimed science writer Ferris Jabr reveals a radical new vision of Earth where lush forests spew water, pollen, and bacteria to summon rain; giant animals engineer the very landscapes they roam; microbes chew rock to shape continents; and microscopic plankton, some as glittering as carved jewels, remake the air and sea.Humans are one of the most extreme examples of life transforming Earth. Through fossil fuel consumption, agriculture, and pollution, we have altered more layers of the planet in less time than any other species, pushing Earth into a crisis. But we are also uniquely able to understand and protect the planet’s wondrous ecology and self-stabilizing processes. Jabr introduces us to a diverse cast of fascinating people who have devoted themselves to this vital work.Becoming Earth is an exhilarating journey through the hidden workings of our planetary symphony—its players, its instruments, and the music of life that emerges—and an invitation to reexamine our place in it. How well we play our part will determine what kind of Earth our descendants inherit for millennia to come.",
  "genres": [
    "Science",
    "Nonfiction",
    "Nature",
    "History",
    "Environment",
    "Biology",
    "Audiobook"
  ],
  "author": "Ferris Jabr",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/200634148-becoming-earth"
}