{
  "title": "The Aztec Myths: A Guide to the Ancient Stories and Legends",
  "description": "The essential guide to the world of Aztec mythology, based on Nahuatl-language sources that challenge the colonial history passed down to us by the Spanish. From their remote origins as migrating tribes to their rise as builders of empire, the Aztecs were among the most dynamic and feared peoples of ancient Mexico, with a belief system that was one of the most complex and vital in the ancient world. Historian Camilla Townsend returns to the original tales, told at the fireside by generations of Indigenous Nahuatl speakers. Along the way, she deals with human sacrifice, the raising of great temples, and the troubling legacy of the Spanish conquest. Few cultures are generally understood to have been so controlled by their religion as the Aztecs, and few religions are envisioned as being as violent and celebratory of death as theirs. In this introduction to the Aztec myths, Townsend draws from sixteenth-century historical annals and songs written down by Nahuatl-speaking peoples, now known as the Aztecs, in their own language to counter this narrative, inherited from the conquering Spaniards. In doing so, she reveals a rich tapestry of mythic tradition that defies modern expectations. Townsend retells stories ranging from the creation of the world, revealing the Aztec cosmological vision of nature and the divine, to legends of the Aztecs’ own past that show how they understood the foundation of their state and the course of their wars. She considers the impact of colonial contact on the myths and demonstrates that Indigenous engagement with the new cultural customs introduced by the Europeans never entirely uprooted old ways of thinking. 75 illustrations",
  "genres": [
    "Nonfiction",
    "Mythology",
    "History",
    "Native American"
  ],
  "author": "Camilla Townsend",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/200547582-the-aztec-myths"
}