{
  "title": "Sex Revolts: Gender, Rebellion, and Rock 'n' Roll",
  "description": "Iggy Pop once said of women: \"However close they come I'll always pull the rug from under them. That's where my music is made.\" For so long, rock 'n' roll has been fueled by this fear and loathing of the feminine. The first book to look at rock rebellion through the lens of gender, The Sex Revolts captures the paradox at rock's dark heart--the music is often most thrilling when it is most misogynist and macho. And, looking at music made by female artists, it asks: must it always be this way?Provocative and passionately argued, the book walks the edgy line between a rock fan's excitement and a critic's awareness of the music's murky undercurrents. Here are the angry young men like the Stones and Sex Pistols, cutting free from home and mother; here are the warriors and crusaders, The Clash, Public Enemy, and U2 taking refuge in a brotherhood-in-arms; and here are the would-be supermen, with their man-machine fantasies and delusions of grandeur, from Led Zeppelin and Jim Morrison to Nick Cave and gangsta rap. The authors unravel the mystical, back-to-the-womb longings of the psychedelic tradition, from Pink Floyd, Jimi Hendrix, and Van Morrison to Brian Eno, My Bloody Valentine, and ambient techno. Alongside the story of male rock, The Sex Revolts traces the secret history of female rebellion in rock: the masquerade and mystique of Kate Bush, Siouxie, and Grace Jones, the demystifiers of femininity, like the Slits and Riot Grrl, tomboy rockers like L7 and P. J. Harvey, and confessional artists like Janis Joplin, Joni Mitchell, and Courtney Love.A heady blend of music criticism, cultural studies, and gender theory by two of rock's keenest observers, The Sex Revolts is set to become the key text in the women-in-rock debate.",
  "genres": [
    "Music",
    "Feminism",
    "Nonfiction",
    "Sociology",
    "Gender",
    "Punk",
    "LGBT"
  ],
  "author": "Simon Reynolds",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/200607.Sex_Revolts"
}