{
  "title": "Freeman's Challenge: The Murder That Shook America's Original Prison for Profit",
  "description": "An award-winning historian tells a gripping, morally complicated story of murder, greed, race, and the true origins of prison for profit.In the early nineteenth century, as slavery gradually ended in the North, a village in New York State invented a new form of the profit-driven prison. Uniting incarceration and capitalism, the village of Auburn built a prison that enclosed industrial factories. There, “slaves of the state” were leased to private companies. The prisoners earned no wages, yet they manufactured furniture, animal harnesses, carpets, and combs, which consumers bought throughout the North. Then one young man challenged the system.In Freeman’s Challenge , Robin Bernstein tells the story of an Afro-Native teenager named William Freeman who was convicted of a horse theft he insisted he did not commit and sentenced to five years of hard labor in Auburn’s prison. Incensed at being forced to work without pay, Freeman demanded wages. His challenge triggered first against him, then by him. Freeman committed a murder that terrified and bewildered white America. And white America struck back—with aftereffects that reverberate into our lives today in the persistent myth of inherent Black criminality. William Freeman’s unforgettable story reveals how the North invented prison for profit half a century before the Thirteenth Amendment outlawed slavery “except as a punishment for crime”—and how Frederick Douglass, Harriet Tubman, and other African Americans invented strategies of resilience and resistance in a city dominated by a citadel of unfreedom.Through one Black man, his family, and his city, Bernstein tells an explosive, moving story about the entangled origins of prison for profit and anti-Black racism.",
  "genres": [
    "History",
    "Nonfiction",
    "United States",
    "Social Justice",
    "Race",
    "Crime",
    "Politics"
  ],
  "author": "Robin Bernstein",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/200652217-freeman-s-challenge"
}