{
  "title": "Becoming Earth: How Our Planet Came to Life",
  "description": "A vivid account of a major shift in how we understand Earth, from an exceptionally talented new voice. Earth is not simply an inanimate planet on which life evolved, but rather a planet that came to life.The notion of a living world is one of humanity’s oldest beliefs. Though once scorned by many scientists, the concept of Earth as a vast interconnected living system has gained acceptance in recent decades. Life not only adapts to its surroundings—it also shapes them in dramatic and enduring ways. Over billions of years, life transformed a lump of orbiting rock into our cosmic oasis, breathing oxygen into the atmosphere, concocting the modern oceans, and turning rock into fertile soil. Life is intertwined with Earth’s capacity to regulate its climate and maintain balance.To reveal life’s profound influence on the planet, Jabr transports the reader to such extraordinary places as an observatory halfway between the treetops and clouds, an experimental nature reserve in Siberia, and a former gold mine nearly one mile underground. We learn how microbes may have played a role in forming the continents. We discover how plants help keep oxygen levels high enough to support complex life, but not so high that Earth becomes disastrously flammable. We see how termites, elephants, and other animals sculpt the planet’s landmasses; how kelp forests and coral reefs store carbon and buffer ocean acidity; and how bacteria change the weather.Humans are one of the most extreme examples of life changing Earth. Through fossil fuel consumption, agriculture, and pollution, humans have radically altered more aspects of the planet in less time than any other species, pushing Earth into a crisis. But we are also in a unique position to understand and protect the planet’s wondrous ecology and self-stabilizing processes. Jabr introduces us to a diverse cast of fascinating characters doing exactly that. Through compelling narrative, evocative descriptions, and lucid explanations, he shows us how Earth became the world we’ve known, how it is rapidly becoming a very different world, and how we will determine what kind of Earth our descendants inherit for millennia to come.",
  "genres": [
    "Science",
    "Nonfiction",
    "Nature",
    "History",
    "Environment",
    "Biology",
    "Audiobook"
  ],
  "author": "Ferris Jabr",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/200634712-becoming-earth"
}