{
  "title": "Chasing Francis: A Pilgrim’s Tale",
  "description": "What happens when the pastor of a mega church loses his faith?Pastor Chase Falson has lost his faith in God, the Bible, evangelical Christianity, and his super-sized megachurch. When he falls apart, the church elders tell him to go away: as far away as possible. Join Chase on his life-changing journey to Italy where, with a curious group of Franciscan friars, he struggles to resolve his crisis of faith by retracing the footsteps of Francis of Assisi, a saint whose simple way of loving Jesus changed the history of the world. Read this riveting story and then begin your own life-changing journey through the pilgrim's guide included in this powerful novel.Hidden in the past lies the future of the churchWhen his elders tell him to take some time away from his church, broken pastor Chase Falson crosses the Atlantic to Italy to visit his uncle, a Franciscan priest. There he is introduced to the revolutionary teachings of Saint Francis of Assisi and finds an old, but new way offollowing Jesus that heals and inspires. Chase Falson's spiritual discontent mirrors the feelings of a growing number of Christians who walk out of church asking, Is this all there is? They are weary of celebrity pastors, empty calorie teaching, and worship services wherethe emphasis is more on Lights, Camera, Action than on Father, Son, and Holy Spirit while the deepest questions of life remain unaddressed in a meaningful way.Bestselling author Ian Morgan Cron masterfully weaves lessons from the life of Saint Francis into the story of Chase Falson to explore the life of a saint who 800 years ago breathed new life into disillusioned Christians and a Church on the brink of collapse. Chasing Francis is a hopeful and moving story with profound implications for those who yearn for a more vital relationship with God and the world.",
  "genres": [
    "Fiction",
    "Christian",
    "Spirituality",
    "Christian Fiction",
    "Faith",
    "Religion",
    "Christianity"
  ],
  "author": "Ian Morgan Cron",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/20088505-chasing-francis"
}