{
  "title": "It's Your Misfortune and None of My Own: A New History of the American West",
  "description": "A centerpiece of the New History of the American West, this book embodies the theme that, as succeeding groups have occupied the American West and shaped the land, they have done so without regard for present inhabitants. Like the cowboy herding the dogies, they have cared little about the cost their activities imposed on others; what has mattered is the immediate benefit they have derived from their transformation of the land.\tDrawing on a recent flowering of scholarship on the western environment, western gender relations, minority history, and urban and labor history, as well as on more traditional western sources, It’s Your Misfortune and None of My Own is about the creation of the region rather than the vanishing of the frontier.\tRichard White tells how the various parts of the West—its distinct environments, its metropolitan areas and vast hinterlands, the various ethnic and racial groups and classes—are held together by a series of historical relationships that are developed over time. Widespread aridity and a common geographical location between the Missouri River and the Pacific Ocean would have provided but weak regional ties if other stronger relationships had not been created.\tA common dependence on the deferral government and common roots in a largely extractive and service-based economy were formative influences on western states and territories. A dual labor system based on race and the existence of minority groups with distinctive legal status have helped further define the region. Patterns of political participation and political organization have proved enduring. Together, these relationships among people, and between people and place, have made the West a historical creation and a distinctive region.\tFrom Europeans contact and subsequent Anglo-American conquest, through the civil-rights movement, the energy crisis, and the current reconstructing of the national and world economies, the West has remained a distinctive section in a much larger nation. In the American imagination the West still embodies possibilities inherent in the vastness and beauty of the place itself. But, Richard White explains, the possibilities many imagined for themselves have yielded to the possibilities seized by others. Many who thought themselves cowboys have in the end turned out to be dogies.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Westerns",
    "Research",
    "20th Century",
    "American"
  ],
  "author": "Richard White",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/200843.It_s_Your_Misfortune_and_None_of_My_Own"
}