{
  "title": "American Scripture: Making the Declaration of Independence",
  "description": "Pauline Maier shows us the Declaration as both the defining statement of our national identity and the moral standard by which we live as a nation. It is truly \"American Scripture,\" and Maier tells us how it came to be -- from the Declaration's birth in the hard and tortuous struggle by which Americans arrived at Independence to the ways in which, in the nineteenth century, the document itself became sanctified.Maier describes the transformation of the Second Continental Congress into a national government, unlike anything that preceded or followed it, and with more authority than the colonists would ever have conceded to the British Parliament; the great difficulty in making the decision for Independence; the influence of Paine's Common Sense , which shifted the terms of debate; and the political maneuvers that allowed Congress to make the momentous decision.In Maier's hands, the Declaration of Independence is brought close to us. She lets us hear the voice of the people as revealed in the other \"declarations\" of 1776: the local resolutions -- most of which have gone unnoticed over the past two centuries -- that explained, advocated, and justified Independence and undergirded Congress's work. Detective-like, she discloses the origins of key ideas and phrases in the Declaration and unravels the complex story of its drafting and of the group-editing job which angered Thomas Jefferson.Maier also reveals what happened to the Declaration after the signing and how it was largely forgotten and then revived to buttress political arguments of the nineteenth century; and, most important, how Abraham Lincoln ensured its persistence as a living force in American society. Finally, she shows how by the very act of venerating the Declaration as we do -- by holding it as sacrosanct, akin to holy writ -- we may actually be betraying its purpose and its power.",
  "genres": [
    "History",
    "American History",
    "American Revolution",
    "Nonfiction",
    "Politics",
    "Political Science",
    "American"
  ],
  "author": "Pauline Maier",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/200836.American_Scripture"
}