{
  "title": "I Hope This Finds You Well",
  "description": "In this wildly funny and heartwarming office comedy, an admin worker accidentally gains access to her colleagues’ private emails and DMs and decides to use this intel to save her job—a laugh-till-you-cry debut novel you’ll be eager to share with your entire list of contacts, perfect for fans of Anxious People and Eleanor Oliphant Is Completely Fine.As far as Jolene is concerned, her interactions with her colleagues should start and end with her official duties as an admin for Supershops, Inc. Unfortunately, her irritating, incompetent coworkers don’t seem to understand the importance of boundaries. Her secret to survival? She vents her grievances in petty email postscripts, then changes the text colour to white so no one can see. That is, until one of her secret messages is exposed. Her punishment: sensitivity training (led by the suspiciously friendly HR guy, Cliff) and rigorous email restrictions.When an IT mix-up grants her access to her entire department’s private emails and DMs, Jolene knows she should report it, but who could resist reading what their coworkers are really saying? And when she discovers layoffs are coming, she realizes this might just be the key to saving her job. The plan is simple: gain her boss’s favour, convince HR she’s Supershops material and beat out the competition.But as Jolene is drawn further into her coworker’s private worlds and secrets, her carefully constructed walls begin to crumble—especially around Cliff, who she definitely cannot have feelings for. Soon she will need to decide if she’s ready to leave the comfort of her cubicle, even if it means coming clean to her colleagues.Crackling with laugh-out-loud dialogue and relatable observations, I Hope This Finds You Well is a fresh and surprisingly tender comedy about loneliness and love beyond our computer screens. This sparkling debut novel will open your heart to the everyday eccentricities of work culture and the undeniable human connection that comes with it.",
  "genres": [
    "Fiction",
    "Romance",
    "Contemporary",
    "Audiobook",
    "Book Club",
    "Humor",
    "Chick Lit"
  ],
  "author": "Natalie Sue",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/200987323-i-hope-this-finds-you-well"
}