{
  "title": "Hard Road West: History and Geology along the Gold Rush Trail",
  "description": "In 1848 news of the discovery of gold in California triggered an enormous wave of emigration toward the Pacific. Lured by the promise of riches, thousands of settlers left behind the forests, rain, and fertile soil of the eastern United States in favor of the rough-hewn lands of the American West. The dramatic terrain they struggled to cross is so familiar to us now that it is hard to imagine how frightening—even godforsaken—its sheer rock faces and barren deserts seemed to our forebears.       Hard Road West brings their perspective vividly to life, weaving together the epic overland journey of the covered wagon trains and the compelling story of the landscape they encountered. Taking readers along the 2,000-mile California Trail, Keith Meldahl uses the diaries and letters of the settlers themselves—as well as the countless hours he has spent following the trail—to reveal how the geology and geography of the West directly affected our nation’s westward expansion. He guides us through a corrugated landscape of sawtooth mountains, following the meager streams that served as lifelines through an arid land, all the way to California itself, where colliding tectonic plates created breathtaking scenery and planted the gold that lured travelers west in the first place. “Alternates seamlessly between vivid accounts of the 19th-century journey and lucid explanations of the geological events that shaped the landscape traveled. . . . The reader comes away with both an appreciation for the arduous cross-continental wagon journey and an understanding of the events that created such a vast and difficult landscape.”— Library Journal “[Meldahl] draws on his professional knowledge to explain the geology of the West, showing how centuries of geological activity had a direct effect on the routes taken by the travelers. . . . Meldahl provides a novel account of the largest overland migration since the Crusades.”— Science News",
  "genres": [
    "History",
    "Geology",
    "Science",
    "Nonfiction",
    "American History",
    "Geography",
    "Travel"
  ],
  "author": "Keith Heyer Meldahl",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/2011201.Hard_Road_West"
}