{
  "title": "Niels Bohr's Times In Physics, Philosophy and Polity",
  "description": "Abraham Pais's life of Albert Einstein was one of the finest scientific biographies ever written. When it first appeared in 1982, Christian Science Monitor called it \"an extraordinary biography of an extraordinary man,\" and Timothy Ferris, in The New York Times Book Review , said it was \"thebiography of Einstein he himself would have liked best,\" adding that \"it is a work against which future scientific biographies will be measured.\" As a respected physicist himself, Pais was the first biographer to give Einstein's thinking its full due, yet despite the occasional high level of scienceneeded to discuss Einstein's ideas, it was the winner of the 1983 American Book Award for Science.Now Pais turns to Niels Bohr, to illuminate the life and thought of another giant of 20th-century physics. Bohr was the first to understand how atoms were put together. He played a major role in shaping the theory of the atomic nucleus, he decoded the atomic spectrum of hydrogen, anachievement which marks him as the founder of the quantum dynamics of atoms, and his concept of complementarity (which provides the philosophical underpinning for quantum theory) qualifies him as one of the twentieth century's greatest philosophers. Pais covers all of these achievements withsophistication and clarity, but he also reveals the many other facets of the man. Perhaps most important, he shows that Bohr was not only a great scientist, but also a great nurturer of young scientific talent, acting as father figure extraordinaire for several generations of physicists. Bohr'sInstitute of Theoretical Physics, which he founded in Copenhagen and for which he tirelessly raised funds, was the world's leading center for physics all through the 1920s and 1930s, the birthplace of Heisenberg's papers on the uncertainty relations, Dirac's first paper on quantum electrodynamics,and other pivotal works. And Pais reveals as well the personal side of Bohr, the avid reader and crossword puzzle solver (Bohr loved Icelandic sagas, Goethe and Schiller, Dickens and Mark Twain--while studying in England early in his career, he improved his English by reading The Pickwick Paperswith a dictionary to one side); his aid to Jews and other refugees in the 1930s and during the war; the tragic loss of his son Christian (who died in a sailing accident right before Bohr's eyes); and his attempts during and after the war to promote openness between East and West, meeting with bothRoosevelt and Churchill (the former was quite courteous, the latter lectured Bohr like a schoolboy).Niels Bohr's Times, is a marvelous biography that captures the essence of one of the best-loved figures of this century.",
  "genres": [
    "Biography",
    "Science",
    "Physics",
    "History",
    "Nonfiction",
    "History Of Science",
    "Denmark"
  ],
  "author": "Abraham Pais",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/111172.Niels_Bohr_s_Times_In_Physics_Philosophy_and_Polity"
}