{
  "title": "The Three Battlegrounds: An In-Depth View of the Three Arenas of Spiritual Warfare: The Mind, the Church and the Heavenly Places",
  "description": "At any time the Spirit of God's kingdom is truly manifest in the earth, it will ultimately confront the stronghold of hell. Indeed, wherever evil spirits have either a foothold or a stronghold, you can expect also that the gates of hell will not prevail against the church that Jesus builds. This book explores the three arenas of spiritual warfare that the maturing Christian will face: the mind, the church and the heavenly places. It provides the foundation of insight, wisdom and discernment on the nature of the battle and the keys to victory. Here are some quotes from the book: \"Victory begins with the name of Jesus on our lips. It is consummated by the nature of Jesus in our hearts.\" \"There are satanic strongholds over countries and communities and there are strongholds which influence the churches and individuals. Wherever a stronghold exists, it is a demonically induced pattern of thinking. Specifically, it is a house made of thoughts which has become a dwelling place for satanic and activity.\" \"Is your love growing or becoming softer, brighter, more daring and more visible? Or is it becoming more discriminating, calculating, less vulnerable and less available? This is very important issue, for your Christianity is only as real as your love. A measurable decrease in your ability to love is evidence that a stronghold of cold love is developing within you.\" \"There is a war, a very ancient war, between the spirit of Elijah and the spirit of Jezebel. In this age-old battle, Elijah represents the interests of heaven: the call to repentance and the return to God. Jezebel, on the other hand, represents that unique principality whose purpose is to hinder and defeat the work of repentance.\"",
  "genres": [
    "Christian",
    "Nonfiction",
    "Religion",
    "Faith",
    "Spirituality",
    "Christianity",
    "Christian Living"
  ],
  "author": "Francis Frangipane",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/20111.The_Three_Battlegrounds"
}