{
  "title": "Evolution's Rainbow: Diversity, Gender, and Sexuality in Nature and People",
  "description": "In this innovative celebration of diversity and affirmation of individuality in animals and humans, Joan Roughgarden challenges accepted wisdom about gender identity and sexual orientation. A distinguished evolutionary biologist, Roughgarden takes on the medical establishment, the Bible, social science—and even Darwin himself. She leads the reader through a fascinating discussion of diversity in gender and sexuality among fish, reptiles, amphibians, birds, and mammals, including primates. Evolution's Rainbow explains how this diversity develops from the action of genes and hormones and how people come to differ from each other in all aspects of body and behavior. Roughgarden reconstructs primary science in light of feminist, gay, and transgender criticism and redefines our understanding of sex, gender, and sexuality. Witty, playful, and daring, this book will revolutionize our understanding of sexuality. Roughgarden argues that principal elements of Darwinian sexual selection theory are false and suggests a new theory that emphasizes social inclusion and control of access to resources and mating opportunity. She disputes a range of scientific and medical concepts, including Wilson's genetic determinism of behavior, evolutionary psychology, the existence of a gay gene, the role of parenting in determining gender identity, and Dawkins's \"selfish gene\" as the driver of natural selection. She dares social science to respect the agency and rationality of diverse people; shows that many cultures across the world and throughout history accommodate people we label today as lesbian, gay, and transgendered; and calls on the Christian religion to acknowledge the Bible's many passages endorsing diversity in gender and sexuality. Evolution's Rainbow concludes with bold recommendations for improving education in biology, psychology, and medicine; for democratizing genetic engineering and medical practice; and for building a public monument to affirm diversity as one of our nation's defining principles.",
  "genres": [
    "Science",
    "Nonfiction",
    "Gender",
    "Queer",
    "LGBT",
    "Biology",
    "Sexuality"
  ],
  "author": "Joan Roughgarden",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/20109591-evolution-s-rainbow"
}