{
  "title": "The Last Red Wolf",
  "description": "Lyle Larson wanted more. He wanted friends, stability, and, above all else, a family. Growing up alone, drifting from one foster placement to another, Lyle had always wondered why no one had wanted him, why he never seemed to be enough. Setting out on a new path, moving to a new city, and beginning his college experience, he knew that whatever happened, at least he was moving in the right direction.Chess Beck wanted freedom. Being a werewolf, let alone the next in line to become the Alpha of his family's pack, afforded him almost none of the independence that he craved. Between his family influencing his future and The Union of the Wolves' input on everything else, there seemed to be no opportunity for Chess to choose his own path.Neither Lyle nor Chess imagined what fate had planned for them when Lyle was assigned to tutor with Chess after struggling early in his first semester. The electricity they experienced could not be described by chemistry alone, after their initial meeting they felt an innate pull between them and the two continue to find themselves inexplicably linked by more than just a passing attraction. The connection and mystery deepens when an accident involving Chess causes Lyle to become the first werewolf turned from a bite in centuries.Navigating the werewolf world turns out to be a lot harder than Lyle could have imagined, especially when it is rumored you could possibly be the last Red Wolf. The need to uncover the truth of why Lyle was able to be turned and to find out who Lyle is drives the two both closer together and further into danger. With difficult decisions ahead, Lyle and Chess have to decide the future for themselves, their friends, family, and wolves forever.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Fantasy",
    "Gay",
    "M M Fantasy",
    "LGBT",
    "Queer"
  ],
  "author": "Kurtis A. Dolman",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/201277160-the-last-red-wolf"
}