{
  "title": "The Summer of Yes",
  "description": "A near-death experience catapults workaholic junior editor Kelsey Worthington into changing her life--one yes at a time.Kelsey Worthington always dreamed of being a writer, but she's settled into a routine of helping other people tell their stories in her job as a junior editor. She doesn't go outside of her comfort zone. Her relationships are safe. Her job is secure. Her existence is stable. And she's great with that.And then, the accident.While she's in the hospital overnight, she meets an older woman named Georgina Tate--a glass-ceiling-shattering, wildly successful businesswoman. Georgina sacrificed everything to become the woman she is today, but now, with a pair of failing kidneys and only a handful of months left to live, Georgina is forced to come face-to-face with her regrets. Kelsey is forced to reckon with her own list of \"things I'll do someday,\" and she starts to ask a simple but life-changing What if I said yes to all the things I normally say no to? And The Yes Plan is born.It takes some convincing, but Georgina finally agrees to go along with Kelsey on her Summer of Yes adventures. The two of them set off to see what might be out there waiting for them if they simply open themselves up to it. Together, they say yes to whatever comes their way--a whole day being tourists in their own New York City, dinner with strangers, a convertible that is far from practical but so much fun. But when Kelsey springs a surprise visit to Georgina's son Hayden and Georgina's ex-husband (who is not so much of an ex), the older woman is less than thrilled. But this is where the true journey begins.Two stories of love, forgiveness, regret, romance, and finding a way to live a fearless life intertwine as these two women make an indelible impression on each other. And it all starts with a simple \"yes.\"",
  "genres": [
    "Romance",
    "Fiction",
    "Audiobook",
    "Contemporary",
    "Chick Lit",
    "Christian Fiction",
    "Clean Romance"
  ],
  "author": "Courtney Walsh",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/201335518-the-summer-of-yes"
}