{
  "title": "Soul Repair: Recovering from Moral Injury after War",
  "description": "The first book to explore the idea and effect of moral injury on veterans, their families, and their communities Although veterans make up only 7 percent of the U.S. population, they account for an alarming 20 percent of all suicides. And though treatment of post-traumatic stress disorder has undoubtedly alleviated suffering and allowed many service members returning from combat to transition to civilian life, the suicide rate for veterans under thirty has been increasing. Research by Veterans Administration health professionals and veterans’ own experiences now suggest an ancient but unaddressed wound of war may be a moral injury. This deep-seated sense of transgression includes feelings of shame, grief, meaninglessness, and remorse from having violated core moral beliefs. Rita Nakashima Brock and Gabriella Lettini, who both grew up in families deeply affected by war, have been working closely with vets on what moral injury looks like, how vets cope with it, and what can be done to heal the damage inflicted on soldiers’ consciences. In Soul Repair, the authors tell the stories of four veterans of wars from Vietnam to our current conflicts in Iraq and Afghanistan—Camillo “Mac” Bica, Herman Keizer Jr., Pamela Lightsey, and Camilo Mejía—who reveal their experiences of moral injury from war and how they have learned to live with it. Brock and Lettini also explore its effect on families and communities, and the community processes that have gradually helped soldiers with their moral injuries. Soul Repair will help veterans, their families, members of their communities, and clergy understand the impact of war on the consciences of healthy people, support the recovery of moral conscience in society, and restore veterans to civilian life. When a society sends people off to war, it must accept responsibility for returning them home to peace.",
  "genres": [
    "Military Fiction",
    "War",
    "Nonfiction",
    "Theology",
    "Psychology",
    "Mental Health",
    "Philosophy"
  ],
  "author": "Rita Nakashima Brock",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/20137963-soul-repair"
}