{
  "title": "Magic Pill: The Extraordinary Benefits and Disturbing Risks of the New Weight-Loss Drugs",
  "description": "The bestselling author of Lost Connections and Stolen Focus offers a revelatory look at the drugs upending weight loss as we knew it—from his personal experience on Ozempic to what these drugs mean for our society’s deeply dysfunctional relationship with food, weight, and our bodiesIn January 2023, bestselling author Johann Hari started to inject himself once a week with Ozempic, the diabetes drug that produces significant weight loss. He wasn’t alone—credible predictions suggest that in two years, a quarter of the U.S. population will be taking this class of drug. Proponents say that this is a biological solution to a biological problem. While 95 percent of diets fail, the average person taking one of the new drugs will lose a quarter of their body weight in six months, and keep it off for as long as they take it. Here is a moment of liberation from an illness that massively increases your chances of diabetes, dementia, and cancer, and causes 10 percent of all deaths. Still, Hari was wildly conflicted. The massive rise in obesity rates around the world in the last half century didn’t happen because something went wrong with human biology. It happened because something went disastrously wrong with our We began to eat food designed to be maximally addictive. We built cities that are impossible to walk or bike around. We became much more stressed, making us seek out more comfort snacks. From this perspective, the new weight loss drugs arrive at a moment of madness. We built a food system that poisons us, then decided en masse to inject ourselves with a different potential poison that puts us off all food.A personal journey through weight loss combined with scientific evidence from experts, Magic Pill explores, as only Hari can, questions How did we get to this point? What does it reveal about our society that we couldn’t solve this problem socially, and instead turned to potentially risky pharmaceutical solutions? And will this free us from social pressure to conform to an ideal body type—or make that pressure even more dangerously intense?",
  "genres": [
    "Nonfiction",
    "Health",
    "Science",
    "Audiobook",
    "Medicine",
    "Psychology",
    "Self Help"
  ],
  "author": "Johann Hari",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/201319612-magic-pill"
}