{
  "title": "Om Vel Way: Be Happy and Make Happy",
  "description": "The primary theme of this book is to \"Be Happy and Make Happy.\"In life, everything one does is aimed at increasing the quality and scale of one's happiness. Quality refers to richness and intensity; scale refers to its scope and longevity. The foundational and ultimate theme of human life is to evolve and to increase happiness, not only in our lives but also in the lives of others.OM VELWay is the title ofthe book.\"OM\" is the Spirit. \"VEL\" is the Sport. \"Way\" is how the Spirit plays the Sport. OM is based on the view that we are, at our core, an evolving awareness. We are not what we possess or what we experience through our body and mind, but we are that which occupies the body and mind, is aware of their experiences, and can evolve from each experience.VEL is a synthesis of three powers that drive our pursuit of 1. V The power to be aware, a higher truth about who we are, and the nature of life, from each experience, to lead an authentic life.2. E The power to evolve, based on our awareness of the higher truth, to lead an authentic life, i.e., to enable \"verity.\"3.  L The power to Love, that which fuels our progress along evolution.WayWhat holds us back? It is nothing but our ignorance about who we truly are. This ignorance is forged with craving and resentment about what we experience in our bodies and minds. We then cling to what we like and refuse to be open to what we resent, ending up a \"fettered self\" with a fixed notion of \"I am this.\" This becomes the path of suffering wherein we progressively sink in the journey across the sea of life.What then could propel us forward? Progressive revelations of truth about our innate nature, the ability to let go (non-clinging) of our fettered views of the self and embrace the higher truth about our intrinsic nature. In short, we need to swim across the sea of life through evolving awareness i.e., embracing the notion of \"I am that I am.\" When we thus swim along in the sea of the journey of life, we realize the path to progressive happiness.In short, progress happens along the path of self-actualization, \"to be the self that we truly are,\" most fundamentally and with the Self as both the ultimate refuge and the goal.",
  "genres": [],
  "author": "Seval Seer",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/201516476-om-vel-way"
}