{
  "title": "Coming Full Circle: How Americans Finally Got Things Right!",
  "description": "There is a lot that our U.S. biology and history books haven't told us. COMING FULL CIRCLE (CFC): How Americans Finally Got Things Right! is an eco-novel series (in 3 books) that sets the record straight.On a geologic timescale, we are accelerating toward our own oblivion at laser-focused warp speed. Right now—every day—the world is adding more layers of atmospheric pollution and species disintegration to the enveloping shroud that may eventually doom our own species (Homo sapiens) to extinction.These twin towers of environmental degradation are not something that might become challenges in the future. They are hugeproblems right now, and they're getting worse every day that we sit by and pretend that nothing bad is really happening.But here is the good news. The climate crisis and biodiversity loss do not have to remain unsolved. In fact—as detailed in CFC—both of these world-wide conundrums can be well on their way to full resolution in less than ten years.We can use the perpetual, inextinguishable energy of Earth—the sun's glorious rays, the wind's constant breezes, and the water's endless waves—to work for us all. And, in the process, we'll leave the polluting fossil fuels right where they belong—buried in the ground, never to see the light of day.Renewable energy here on Earth is abundant and omnipresent. Each time we go outside, we see and feel it everywhere. It's like an endless symphony written by a master composer and played by a world-class orchestra. The golden rays of streaming sunlight are the strings—always there, maintaining the basic rhythm of the interwoven movements. The wind provides the percussion—rising from gentle whispering breezes of the snare drum to the bold resounding gusts of the tympani. Then flowing water blends in with the woodwinds and the brass—transitioning from gently lapping melodic notes of the flute to lazy ripples of an oboe's dulcet tones and concluding with rolling waves of trumpet blasts.We are all now right on the cusp of what will become the Renewables Revolution—providing a mighty parallel to the Industrial Revolution. The Industrial Revolution resulted in the transformation of our nation from a rural agrarian society to an urban, manufacturing society. Now we are about to transform ourselves again—from a hard-edged, fossil-fuel driven economy, to a softer-sided renewable energy world.So now—as the concluding chapters of CFC emphasize—the decision is in our hands. The issue is about preserving the existing quality and character of the human species here on Earth. Will we \"come full circle\" and decide to make the changes that will save our ice sheets, arctic tundra, blue oceans, coral reefs, rain forests, and polar bears? Or will we just watch while our world slides into oblivion—at least for Homo sapiens?Coming Full Circle (CFC) is a fiction sequel to our non-fiction book, Protecting the Planet, in that it reaches the same positive conclusions about solving our twin ecological dilemmas of climate change and biodiversity loss. The main difference is that CFC uses an informative and entertaining blend of historical fiction and poignant truths to tell the story of how we \"progressed\" from colonial times to our current precipice of environmental disasters.",
  "genres": [],
  "author": "Budd Titlow",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/201613673-coming-full-circle"
}