{
  "title": "Karma",
  "description": "THE OFFICIAL STORY OF A MUSICAL ICON - TOLD IN FULL FOR THE FIRST TIME IN HIS OWN WORDS 'I went to a lot of trouble to create Boy George and then I went through a whole battle for years about not wanting to be him. But now I enjoy and embrace it in a way that I wasn't able to as a young person.... I'm finally learning to be George Alan O'Dowd from Eltham.'Karma is the definitive autobiography from the incomparable Grammy, Brit and Ivor Novello award-winning lead singer of Culture Club and LGBTQ+ Boy George. Told in his inimitable style, Karma tells the story of the charismatic frontman - the drama, the music, his journey of addiction and recovery, surviving prison, meeting legends like David Bowie, Prince and Madonna, and the highs and lows of a life lived in the spotlight and in the headlines.This is the explosive and searingly honest account of Boy George's life as a child growing up in sixties London, coming out to his Irish Catholic family and exploring his sexuality through the hedonism of the seventies - the glam rock and punk rock revolution that birthed Culture Club - and the heydays of the nineties, to finally embracing the man and artist that he is today. With all the humour, honesty, sarcasm (and hats!) that you'd expect, Karma gives us a unique insight into Boy George's incredible story and the true evolution of a music icon.'Culture Club is always going to be one of those lovers I go back to. I've railed against it and that Boy George character I created. For years I convinced myself I was a creature of habit, unchangeable, immovable. But eventually you have to look in the mirror. Not looking for spots, looking for something deeper. Why the hell am I here? I would say life is the point of life.'",
  "genres": [
    "Nonfiction",
    "Audiobook",
    "Biography",
    "Music",
    "Memoir",
    "Autobiography",
    "LGBT"
  ],
  "author": "Boy George",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/201559718-karma"
}