{
  "title": "Lisette's List",
  "description": "From Susan Vreeland, bestselling author of such acclaimed novels as Girl in Hyacinth Blue, Luncheon of the Boating Party, and Clara and Mr. Tiffany, comes a richly imagined story of a woman’s awakening in the south of Vichy France—to the power of art, to the beauty of provincial life, and to love in the midst of war.  In 1937, young Lisette Roux and her husband, André, move from Paris to a village in Provence to care for André’s grandfather Pascal. Lisette regrets having to give up her dream of becoming a gallery apprentice and longs for the comforts and sophistication of Paris. But as she soon discovers, the hilltop town is rich with unexpected pleasures.   Pascal once worked in the nearby ochre mines and later became a pigment salesman and frame maker; while selling his pigments in Paris, he befriended Pissarro and Cézanne, some of whose paintings he received in trade for his frames. Pascal begins to tutor Lisette in both art and life, allowing her to see his small collection of paintings and the Provençal landscape itself in a new light. Inspired by Pascal’s advice to “Do the important things first,” Lisette begins a list of vows to herself (#4. Learn what makes a painting great). When war breaks out, André goes off to the front, but not before hiding Pascal’s paintings to keep them from the Nazis’ reach.   With German forces spreading across Europe, the sudden fall of Paris, and the rise of Vichy France, Lisette sets out to locate the paintings (#11. Find the paintings in my lifetime). Her search takes her through the stunning French countryside, where she befriends Marc and Bella Chagall, who are in hiding before their flight to America, and acquaints her with the land, her neighbors, and even herself in ways she never dreamed possible. Through joy and tragedy, occupation and liberation, small acts of kindness and great acts of courage, Lisette learns to forgive the past, to live robustly, and to love again.Praise for Lisette’s List\n \n“Vreeland’s love of painters and painting, her meticulous research and pitch-perfect descriptive talents . . . are abundantly evident in her new novel.”—The Washington Post   “This historical novel’s . . . great strength is its lovingly detailed setting. . . . Readers will enjoy lingering in the sun-dappled, fruit-scented Provençal landscape that Vreeland brings to life.”—The Boston Globe   “A pleasurable opportunity to learn something about art, history . . . and to enjoy a plucky heroine who grows in ways she never thought possible.”—St. Louis Post-Dispatch   “Mesmerizing . . . Vreeland’s passionate writing is as good as a private showing at the Louvre.”—Kirkus Reviews (starred review)   “An entrancing novel of joy and heartache . . . Vreeland provides the reader with a broad spectrum of emotions.”—The Free Lance-StarFrom the Hardcover edition.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Art",
    "Historical",
    "France",
    "World War II",
    "Book Club"
  ],
  "author": "Susan Vreeland",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/20181572-lisette-s-list"
}