{
  "title": "The Witch of Tophet County",
  "description": "The last witch on Earth takes on interdimensional invaders, tentacled overlords, and local politics in this fun, funny, and fast-paced urban fantasy series.The witch of Tophet County has three primary Kentucky bourbon, Amish romance novels . . . and protecting her true identity from the chthonic monsters who rule humanity with an iron tentacle.Despite her best efforts to get fired, the witch is trapped in a draconian, century-long contract that condemns her to work for the Archons of the Nether Realms in the banal misery of county government. But when she accidentally pleases her many-armed overlords, the Dread Lord of Human Resources curses her with an unwanted promotion. And it involves meetings.As she enters a new bureaucratic hellscape, the witch is assigned to lead a task force investigating recent attacks on senior Archons. Fortunately, her boss has offered her a if she solves the case, they’ll knock fifteen years off her sentence. And if that doesn’t work out, well, she just might have to find a way to help take down the tentaclarchy—or else be doomed to permanent civil servitude . . .Filled with quick-witted banter, hilariously relatable office politics, and fantastically original characters, The Witch of Tophet County is Lovecraft meets Parks and Recreation—an explosive start to a new series guaranteed to have you glued to your seat until the very last page.The first volume of the hit horror fantasy series—with more than 100,000 views on Royal Road—now available on Kindle, Kindle Unlimited, and Audible!“[The Witch of Tophet County] explores zany situations with a large cast of strange characters, effectively playing off the concept of an office in a fantasy realm.” —Kirkus Reviews",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Witches",
    "Horror",
    "Urban Fantasy",
    "Audiobook",
    "Humor"
  ],
  "author": "J.H.   Schiller",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/201738641-the-witch-of-tophet-county"
}