{
  "title": "Headcase",
  "description": "In the picturesque and artistic streets in Bath, things are not what they seem… Chris Honeysett lives an enjoyable life as a painter, supplemented by his work as a gourmet cook. However, he also runs an amateur investigative company on the side, taking small cases where he can. The work of his investigative company, Aqua, is also shared by his housemate Annis Jordan, another artist, and Tim, a whizz on the computer. Generally, it’s the usual sort of case; one spouse thinks the other is having an affair, however now some art has gone missing and Chris has been charged with finding it. One problem is that the client insists on not making it public or getting the police involved. Art thieves should be shot. Which is why Chris Honeysett very nearly doesn’t take the case. The police have much better resources for tracking stolen works of art, but his classic Citroen is due for an overhaul and the price of sea bass is going up… Someone else, who has become known as “Dr Atkins” has also been kidnapping overweight women and starving them to death. When Chris stumbles across the second victim, still alive he vows to find this sick individual. Things change for the worse when an old friend is brutally murdered and Chris finds himself high on a shortlist of suspects… Although Chris would much rather everyone just leave him alone to enjoy the long, hot days in his property, Mill House, he now has every intention of solving the case, clearing his name and finding out what happened to his dear old friend. Murder seems grotesque set against the genteel facade of Bath, but Chris knows from bitter experience that there is more bubbling under the surface of this beautiful city than hot springs. Amateur sleuth or not, he is determined to solve the case… ”Art imitates life imitating art in this appealing mystery debut” - Publisher’s Weekly Peter Helton was born in Germany in 1957. When he grew up, he moved first to Greece, and then to the UK, where he worked as a translator for film and TV. Earning A Levels at Bath Tech, and a humanities degree at Bristol poly, he completed his education with a foundation course in art and design and a fine art degree at UWE, Bristol. He had several shows, including a one man show, and was for years represented by Anthony Hepworth Fine Art. Headcase is his first novel.",
  "genres": [
    "Mystery",
    "British Literature",
    "Fiction"
  ],
  "author": "Peter Helton",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/2017436.Headcase"
}