{
  "title": "The Boys of Riverside: A Deaf Football Team and a Quest for Glory",
  "description": "The incredible story of an all-deaf high school football team’s triumphant climb from underdog to undefeated, their inspirational brotherhood, a fascinating portrait of deafness in America, and the indefatigable head coach who spearheaded the team, by New York Times reporter and San Francisco Bureau Chief, Thomas Fuller.In November 2021, an obscure email from the California Department of Education landed in New York Times reporter Thomas Fuller’s inbox. The football team at the California School for the Deaf in Riverside, a state-run school with only 168 high school students, was having an undefeated season. After years of covering wildfires, war, pandemic, and mass shootings, Fuller was captivated by the story about this deaf football team. It was uplifting. During the pandemic’s gloom, it was a happy story. It was a sports story but not an ordinary one, built on the chemistry between a group of underestimated boys and their superhero advocate coach, Keith Adams, a deaf former athlete himself. The team, and Adams, tackled the many stereotypes and seemed to be succeeding. Fuller packed his bags and drove seven hours to the Riverside campus just in time to see them trounce their opponent in the second game of the playoffs.The Boys of Riverside looks back at the historic 2021 and 2022 seasons in which the California School for the Deaf chased history, following the personal journeys of Keith Adams (their dynamic deaf head coach), a student who spent the majority of the season sleeping in his father’s car parked in the Target lot, a fiercely committed player who literally played through a broken leg in order not to miss a crucial game, and myriad heart-wrenching and uplifting stories of the players who had found common purpose. Through their eyes, Fuller reveals a portrait of high school athletics, and deafness in America.",
  "genres": [
    "Nonfiction",
    "Sports",
    "Audiobook",
    "Disability",
    "Football",
    "History",
    "Book Club"
  ],
  "author": "Thomas  Fuller",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/201751384-the-boys-of-riverside"
}