{
  "title": "Nest",
  "description": "For fans of Jennifer Holm, a heartfelt and unforgettable middle-grade novel about an irresistible girl and her family, tragic change, and the healing power of love and friendship. In 1972 home is a cozy nest on Cape Cod for eleven-year-old Naomi \"Chirp\" Orenstein, her older sister, Rachel; her psychiatrist father; and her dancer mother. But then Chirp's mom develops symptoms of a serious disease, and everything changes. Chirp finds comfort in watching her beloved wild birds. She also finds a true friend in Joey, the mysterious boy who lives across the street. Together they create their own private world and come up with the perfect plan: Escape. Adventure. Discovery. Nest is Esther Ehrlich's stunning debut novel. Her lyrical writing is honest, humorous, and deeply affecting. Chirp and Joey will steal your heart. Long after you finish Nest, the spirit of Chirp and her loving family will stay with you. Praise for Nest:\"A poignant, insightful story of family crisis and the healing power of friendship.\" —Kirkus Reviews, Starred\"A stunning debut, with lyrical prose and superbly developed characters. . . . [Readers] will savor Nest and reflect on it long after its conclusion.\" —School Library Journal, Starred\"Ehrlich's novel beautifully captures the fragile bond shared by Chirp and Joey and their growing trust for each other in a world filled with disappointments and misunderstandings.\" —Publishers Weekly, Starred \"Chirp's first-person voice is believable; her poignant earnestness is truly heartrending. Ehrlich writes beautifully, constructing scenes with grace and layers of telling detail and insight.\" —The Horn BookWhat authors are saying about Nest:\"Nest sings with heart and emotion. Simply gorgeous.\" —Jennifer L. Holm, New York Times bestselling author of Turtle in Paradise\"Nest speaks to the heart. I wanted to put my arms around Chirp and never let go.\" —Holly Goldberg Sloan, author of Counting by 7s and I'll Be There\"I loved the book! It's so tender and touching and real. Chirp is a marvelous character, and Joey's just plain lovable. I worry about him. Congratulations. The book is absolutely splendid and I hope everyone in the world notices.\" —Karen Cushman, author of the Newbery Medal–winning, The Midwife's Apprentice, and the Newbery Honor, Catherine, Called Birdy\"A remarkable work. Esther Ehrlich's characters stand out so real and true: Chirp's friendship with Joey is tender and moving, and truly unforgettable. One can see Cape Cod and feel Chirp's love for the birds wheeling overhead. I wanted this story to go on and on. What a brilliant future this author has. I can't wait to read her next book.\" —Patricia Reilly Giff, two-time Newbery Honor–winning author",
  "genres": [
    "Middle Grade",
    "Realistic Fiction",
    "Historical Fiction",
    "Fiction",
    "Childrens",
    "Young Adult",
    "Family"
  ],
  "author": "Esther Ehrlich",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/20170580-nest"
}