{
  "title": "Cowboy's Christmas: Ten Book Cowboy Holiday Romance Boxset",
  "description": "The perfect Christmas gift for romance fans…Bestselling authors Leslie North and Mary Sue Jackson team up to spread some Christmas cheer with this heartwarming set. Featuring six sexy, rugged cowboys and the women who lasso their hearts…In \nCowboy's Christmas Rodeo\n,Axel King sets out to win the Pride River Christmas Rodeo before he retires. That’s where the beautiful Belle Manning comes in. Axel wants her by his side as his pretend girlfriend to keep him on the straight and narrow. But it doesn’t take long before their fake relationship turns all too real…In \nCowboy’s Christmas Past\n, Amelia Crawford finally has the chance to make a serious film, but first she needs to learn how to ride a horse—and Beau Taylor is the perfect person to teach her. The trouble is, she’d forgotten how gorgeous he is. And how his touch made her feel…In \nSnowed In With The Rancher\n, Olivia Wickham never forgot her cruise ship romance with a sexy cowboy. But she never got the chance to tell him that she was pregnant with his twin daughters. When she and the twins become stranded in the wilderness, Olivia is shocked to see the handsome face of Tate McConnell—the girls' father. With Christmas around the corner, Olivia and Tate wonder if fate is offering them a second chance at love…In \nRancher's Family Christmas\n, widower and single dad Alex Harvey is doing his best to run a ranch, care for his wheelchair-bound father, and raise three girls. Then beautiful and kind Juniper Marsh steps in to help. She’s determined to give Alex and his girls the perfect Christmas. But secretly, she’s hoping their kiss under the mistletoe will turn into something more…In \nCowboy's Christmas Return\n, rodeo star Travis Harvey reluctantly returns home for Christmas. And he’s stunned to find his father’s full-time nurse is more stunning than he ever imagined. If Scarlet can handle his grumpy father, she can handle anything. But he’s not sure he can handle his growing attraction to the beautiful nurse…And in \nCowboy's Christmas Homecoming\n,Serena Douglas will do anything to give her twins a magical Christmas. She doesn’t need another man—until her ex, Will Harvey, comes back into town. Back In high school, Will was head-over-heels for Serena, but fate pulled them apart. With Christmas magic in the air, could a romantic miracle be in store for Will and Serena?",
  "genres": [],
  "author": "Mary Sue Jackson",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/201839971-cowboy-s-christmas"
}