{
  "title": "Deception",
  "description": "Olympia Wingfield, an old maid at twenty-five was saddled with raising her motherless hellion nephews, though the lovely bluestocking preferred spending every spare minute pursuing her true passion-the study of ancient treasure. Between trying to control a mob of unruly neighbor whose interest was far from scholarly, the absentminded beauty was having a most chaotic day. Cornered in her own library before she could manage to extricate herself from the cad's clutches, she found herself unexpectedly rescued...by a glorious stranger who was the embodiment of her most exotic dreams...Tall and dark, with chiseled features and long, windswept black hair, Mr. Jared Chillhurst could have walked straight out of a legend of buried treasure and uncharted seas. As it could have walked straight out of a legend of buried treasure and uncharted seas. As it was, he strode into Olympia's life with all boldness of privateer...setting everything and everyone to rights, before turning his brilliant gaze on her.He announced that he was the new tutor, come to school her three incorrigible charges. He claimed to be a gentleman who'd traveled the world and made his name on a remote, mysterious island...And then he seduced imaginative, impractical Olympia, who'd long fantasized of foreign lands and ancient quests, with his daring traveler's tales and a pirate's plundering kisses.Too late, Olympia would discover that only part of Jared's story was true. For the enigmatic Mr. Chillhurst was no lowly tutor but the future earl of Flamecrest and the descendant of a notorious buccaneer. Chillhurst considered himself to be the only sane member of a family noted for its flamboyant eccentrics, and he prided himself on his cold, logical, unemotional approach to everything, including passion. He had insinuated himself into the Wingfield household for one purpose: to recover the missing Flamecrest fortune.Soon Olympia is swept up in a scandalous affair with this dangerous, desirable man who is haunted by old enemies and an even older mystery. Only she can see beneath his smooth, unshakable surface to an untapped well of deep emotion and fiery sensuality. And she comes to realize that it is up to her to find the key to the past, to the long-lost Flamecrest gold, and to Jared's heart, if they are both to survive and win life's greatest treasure-a love worthy of a legend.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Fiction",
    "Regency",
    "Mystery"
  ],
  "author": "Amanda Quick",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/2020192.Deception"
}