{
  "title": "The Reckoning: How the Democrats and the Left Betrayed Women and Girls",
  "description": "Democrats and the establishment Left have abandoned and betrayed American women and girls on the altar of “gender identity,” doing untold damage in the process. It’s time for liberals and progressives—especially feminists and free speech advocates—to hold them accountable.In The Reckoning, Kara Dansky, a radical feminist and lifelong Democrat, exposes the invasion by men into female-only spaces, the harming of children, and the silencing, punishment, cancellation and even violence against women who speak out. Meanwhile, the Democratic Party, which claims to represent the interests of women, ignores the problem, while its allies in the organized Left and mainstream media paint all opposition to the “trans” agenda as “right wing.” But radical feminists are not “right wing.” They are leftists who know that sex is real and are not afraid to demand women’s hard-won rights to safe spaces and privacy. The Democrat-Left wing establishment knows all the ways in which “gender identity” harms women and girls—and plenty of boys. Yet they are sacrificing women and children to a vicious profit-driven industry that allows men to invade women’s spaces and sports, denies that sex is real, and slices up children’s bodies.Now the Democrats are facing a reckoning. Detransitioners are starting to speak out, clinicians are blowing the whistle, and women and girls, including many lesbians, have had it. Even now, the tide of common sense and decency is starting to turn in other countries that have banned harmful medical and surgical procedures for underage children and a handful of Democrats are bucking the trend at the state level. Elected Democrats will later claim they didn’t know, that they couldn’t have known, that the science has changed. But they knew. They have known all along. This book provides the evidence.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Politics"
  ],
  "author": "Kara Dansky",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/201934741-the-reckoning"
}