{
  "title": "A Man's Life: Dispatches from Dangerous Places",
  "description": "\"Brought to life by a poetic and muscular style, Jenkins's writing is a brew of history, philosophy, and raw emotion. His journeys are as intellectual and spiritual as they are physical, and we are by his side, in his head.\" So wrote Robin Russin for the LA Times about Mark Jenkins's last book, The Hard Way . In A Man's Life , Jenkins walks across northern Afghanistan, retracing the ancient route of Marco Polo; clandestinely enters northern Burma, slipping along the forgotten Burma Road; climbs a new route in Uganda's Mountains of the Moon; bicycles across Lithuania with a long-lost friend; canoes through Surinam with the Maroons, descendants of escaped slaves. Described by critic Bill Berkeley as having a \"Whitmanesque openness to experience,\" Jenkins's desire to explore and understand the world has pushed him to extremes most of us cannot imagine―being arrested in a dozen different countries from Tibet to Tajikistan, breaking a dozen bones, climbing inside glaciers in Iceland, narrowly escaping falling glaciers on Mont Blanc. Through his willingness to put himself out there, Jenkins captures profound glimpses of our chaotic, contradictory, ever-morphing world. A Man's Life shares how these experiences change Jenkins from a reckless young globetrotter to a mature, contemplative family man who seeks adventure because he viscerally must, and yet is constantly aware of the dangers of the world and its cool-faced indifference to one man's life. Each departure from home could be permanent and each homecoming is layered with pathos―his latest journey might have cost him his daughter's first steps or his wife's birthday. The tales in A Man's Life explore the razor's edge between life and death, as well as the nature of love and friendship, failure and redemption. Together, they unite Jenkins's stunning travels with his lucid contemplations on the meaning of it all. Praised by Richard Bernstein in The New York Times for being able to \"[transform] a common sight into a moment of pure magic\" and by Amanda Heller in the Boston Globe as \"blessed with a rare combination of physical and intellectual grace … he makes us understand what pushes the man who pushes the envelope,\" Jenkins is one of the rare writers who channels action-packed adventure into lyrical, evocative storytelling.",
  "genres": [
    "Travel",
    "Adventure",
    "Nonfiction",
    "Nature",
    "Biography",
    "Memoir",
    "Outdoors"
  ],
  "author": "Mark Jenkins",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/2019312.A_Man_s_Life"
}