{
  "title": "Millie Lands A Movie Deal",
  "description": "Millie Chandler is a widow and single mom living in southeast Texas. Under the pen name Ingrid Bleu, Millie has made a successful living as an independent author without drawing any attention to her. Her latest novel, Finding Samantha Merryweather (a tear-jerking drama about forgiveness and redemption), has steadily increased in sales since its release six months prior. Suddenly, her novel became a best-seller thanks to Lindsey Faulkner, a famous actress, producer, and lifestyle guru. She selects Finding Samantha Merryweather as her Book of the Month and posts an Instagram story about Millie's book. Lindsey states she intends to contact 'Ingrid Bleu' to obtain the movie rights for her production company. This creates a frenzy within the movie industry, and now everyone is clamoring to buy the rights to Millie's novel!Once the biggest box office draw worldwide, Declan Garity is now disgraced and rejected from Hollywood. Though considered one of the most extraordinary talents of his generation as an award-winning actor and screenwriter, Declan has been plagued by substance abuse, multiple arrests, incarcerations, a violent temper, and family tragedy, forcing him into exile for the last five years. Now sober, Declan is convinced Finding Samantha Merryweather is the perfect vehicle to stage a comeback. As such, he must rush to Millie before Lindsey Faulkner, also Declan's former lover, purchases them. Declan is determined to convince an apprehensive Millie that he's the perfect choice to bring her book to the screen.Cherishing her quiet and peaceful life, Millie worries that selling the rights to anyone, especially Declan Garity, will come at a personal and professional cost. Is that a price Millie Chandler's willing to pay? It won't be long before Millie discovers the stakes are higher than she could have imagined. Millie Lands a Movie Deal is a quick, fast-paced read that holds your attention until the end!",
  "genres": [],
  "author": "Melissa Martineau Alexander",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/201985259-millie-lands-a-movie-deal"
}