{
  "title": "Night Flyer: Harriet Tubman and the Faith Dreams of a Free People",
  "description": "From the National Book Award–winning author of All That She Carried, an intimate and revelatory reckoning with the myth and the truth behind an American everyone knows and few really understandHarriet Tubman is, if surveys are to be trusted, one of the ten most famous Americans ever born and soon to be the face of the twenty-dollar bill. Yet often she’s a figure more out of myth than history, almost a comic-book superhero—the woman who, despite being barely five feet tall, illiterate, and suffering from a brain injury, managed to escape from her own enslavement, return again and again to lead others north to freedom without loss of life, speak out powerfully against slavery, and then become the first American woman in history to lead a military raid, freeing some 750 people. You could almost say she’s America’s Robin Hood, a miraculous vision, often rightly celebrated but seldom understood. Tiya Miles’s extraordinary Night Flyer changes all that. With her characteristic tenderness and imaginative genius, Miles explores beyond the stock historical grid to weave Tubman’s life into the fabric of her world. She probes the ecological reality of Tubman’s surroundings and examines her kinship with other enslaved women who similarly passed through a spiritual wilderness and recorded those travels in profound and moving memoirs. What emerges, uncannily, is a human being whose mysticism becomes the more palpable the more we understand it—a story that offers us powerful inspiration for our own time of troubles. Harriet Tubman traversed many boundaries, inner and outer. Now, thanks to Tiya Miles, she becomes an even clearer and sharper signal from the past, one that can help us to echolocate a more just and sustainable path.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Race",
    "African American",
    "Audiobook",
    "American History"
  ],
  "author": "Tiya Miles",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/201866614-night-flyer"
}