{
  "title": "This Side of Paradise",
  "description": "This Side of Paradise, by F. Scott Fitzgerald, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:New introductions commissioned from today's top writers and scholarsBiographies of the authorsChronologies of contemporary historical, biographical, and cultural eventsFootnotes and endnotesSelective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the workComments by other famous authorsStudy questions to challenge the reader's viewpoints and expectationsBibliographies for further readingIndices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. If the “Roaring Twenties” are remembered as the era of“flaming youth,” it was F. Scott Fitzgerald who lit the fire. His semi-autobiographical first novel, This Side of Paradise, became an instant best-seller and established an image of seemingly carefree, party-mad young men and women out to create a new morality for a new, post-war America. It traces the early life of Amory Blaine from the end of prep school through Princeton to the start of an uncertain career in New York City.Alternately self-confident and self-effacing, torn between ambition and idleness, the self-absorbed, immature Amory yearns to run with Princeton’s rich, fast crowd and become one of the “gods” of the campus. Hopelessly romantic, he learns about love and sex from a series of beautiful young “flappers,” women who leave him both exhilarated and devastated. Fitzgerald describes it all in intensely lyrical prose that fills the novel with a heartbreaking sense of longing, as Amory comes to understand that the sweet-scented springtime of his life is fragile and fleeting, disappearing into memory even as he reaches for it. Sharon G. Carson is Professor Emerita in the English Department at Kent State University, where she has taught for thirty-five years. She is the author of numerous articles and essays on modern and contemporary fiction.",
  "genres": [
    "Classics",
    "Fiction",
    "Literature",
    "Novels",
    "American",
    "Romance",
    "Historical Fiction"
  ],
  "author": "F. Scott Fitzgerald",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/2019298.This_Side_of_Paradise"
}