{
  "title": "Kade",
  "description": "This book is a spinoff from the Heart of Stone series; therefore it is essential that you have read all the previous books before this novel.  ‘You have to learn the rules of the game. And then you have to play better than anyone else.’ Albert Einstein.  Ava left. Kade’s heart left with her. There was nothing left but an angry, hollow waste of a body. A body Kade was determined to destroy with alcohol and various faceless women. Women that were never any other than Ava to him; their faces, their bodies, even their laughter was all Ava because it was the only way to survive without her. Until Grace Beaumont.  Grace kicks ass. She’s feisty, tough, unforgiving but beautiful, witty and extremely quirky. A bit of an oddball to Kade but he soon finds out that underneath all that hard shell is an exceptionally unique but damaged soul.  When Grace is assigned to protect Kade after he finds himself in the wrong place at the wrong time, the series of events that follow, cause the couple to run and take on new terrors together. Relying on only each other and Grace’s special elite skills, they find themselves embroiled in something neither of them could have ever imagined. When Grace’s past unites with Kade’s present, a whole new threat comes into play and they find themselves not only dealing with things that could blow their worlds wide apart but feelings neither of them are willing to admit to.  Will Grace be able to finally mend the shattered pieces of Kade and will Kade be able to find the lost pieces of Grace’s soul that were splintered many years ago? But one thing is certain in their undertaking, when they come together, the results are explosive.  This book contains explicit sex scenes including M/M/F, strong language and violence… oh and one hell an alpha male.",
  "genres": [
    "Romance",
    "Erotica",
    "Dark",
    "BDSM"
  ],
  "author": "D.H. Sidebottom",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/20197203-kade"
}