{
  "title": "Sunset",
  "description": "This 1st print edition is superseded by the revised 3rd edition, available amazon.com/Sunset-Pact-Arcanum-Arshad...An unlikely savior emerges to prevent the advent of mass destruction and genocide descending on the world... By DayLos Angeles, 2040. When the terrorist known as Medusa threatens to kill millions with a stolen nuclear bomb, Nick Jameson makes a fateful decision. He reveals himself on global television as a Daywalker - a vampire with a soul. To save Los Angeles, Nick exposes not only his own gifts but three separate cultures based on millennia-old magic.By NightThe three metahuman races exist in careful balance, working to maintain a fragile peace. Nick and his fellow Daywalkers successfully master their natural bloodlust. The Sentinels, armed with both magic and steel, repress their warlike instincts. And even some Nightwalkers, normally their natural enemies, have deserted the Court of Shadows to join the triple alliance. Nick Jameson is deeply involved with two such Nightwalkers - handsome Lorcan and powerful Rory. Both men love Nick. But neither can protect the new Ambassador to Humanity from the events he has set in motion.By the SwordJeremy Harkness was lured into Medusa's service under false pretenses. A loner with no one and nothing to cling to, he was willing to die for his cause. But the night Medusa tried to obliterate Los Angeles, Jeremy met Nick Jameson, triggering the onset of his own psychic gifts. For Jeremy is the third race of metahuman, a Sentinel, born to kill the Nightwalkers with no quarter asked or offered. And neither Medusa nor the Court of Shadows will settle for peace when they can make war...Betrayal and treachery lurk around every corner on the road to coexistence, and at every turn, Nick must question who to trust among his metahuman allies, friends, and lovers--before their civilization is plunged into the depths of darkness and bloodshed. With ancient magic, emerging romance, and ever-shifting allegiances, this inventive series unveils a scintillating, homoerotic world of Nightwalkers, Daywalkers, Sentinels, and Humans, who battle for world dominance in the not-too-distant future.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Vampires",
    "Paranormal",
    "Science Fiction",
    "Romance",
    "Urban Fantasy"
  ],
  "author": "Arshad Ahsanuddin",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/11120367-sunset"
}