{
  "title": "I Heard That Song Before",
  "description": "In a riveting psychological thriller, Mary Higgins Clark takes the reader deep into the mysteries of the human mind, where memories may be the most dangerous things of all.At the center of her novel is Kay Lansing, who has grown up in Englewood, New Jersey, daughter of the landscaper to the wealthy and powerful Carrington family. Their mansion -- a historic seventeenth-century manor house transported stone by stone from Wales in 1848 -- has a hidden chapel. One day, accompanying her father to work, six-year-old Kay succumbs to curiosity and sneaks into the chapel. There, she overhears a quarrel between a man and a woman who is demanding money from him. When she says that this will be the last time, his caustic response is: \"I heard that song before.\" That same evening, the Carringtons hold a formal dinner dance after which Peter Carrington, a student at Princeton, drives home Susan Althorp, the eighteen-year-old daughter of neighbors. While her parents hear her come in, she is not in her room the next morning and is never seen or heard from again. Throughout the years, a cloud of suspicion hangs over Peter Carrington. At age forty-two, head of the family business empire, he is still \"a person of interest\" in the eyes of the police, not only for Susan Althorp's disappearance but also for the subsequent drowning death of his own pregnant wife in their swimming pool. Kay Lansing, now living in New York and working as a librarian in Englewood, goes to see Peter Carrington to ask for permission to hold a cocktail party on his estate to benefit a literacy program, which he later grants. Kay comes to see Peter as maligned and misunderstood, and when he begins to court her after the cocktail party, she falls in love with him. Over the objections of her beloved grandmother Margaret O'Neil, who raised her after her parents' early deaths, she marries him. To her dismay, she soon finds that he is a sleepwalker whose nocturnal wanderings draw him to the spot at the pool where his wife met her end. Susan Althorp's mother, Gladys, has always been convinced that Peter Carrington is responsible for her daughter's disappearance, a belief shared by many in the community. Disregarding her husband's protests about reopening the case, Gladys, now terminally ill, has hired a retired New York City detective to try to find out what happened to her daughter. Gladys wants to know before she dies. Kay, too, has developed gnawing doubts about her husband. She believes that the key to the truth about his guilt or innocence lies in the scene she witnessed as a child in the chapel and knows she must learn the identity of the man and woman who quarreled there that day. Yet, she plunges into this pursuit realizing that \"that knowledge may not be enough to save my husband's life, if indeed it deserves to be saved.\" What Kay does not even remotely suspect is that uncovering what lies behind these memories may cost her her own life.I Heard That Song Before once again dramatically reconfirms Mary Higgins Clark's worldwide reputation as a master storyteller.",
  "genres": [
    "Mystery",
    "Fiction",
    "Suspense",
    "Thriller",
    "Mystery Thriller",
    "Crime",
    "Romance"
  ],
  "author": "Mary Higgins Clark",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/2020553.I_Heard_That_Song_Before"
}