{
  "title": "We've Got Issues: How You Can Stand Strong for America's Soul and Sanity",
  "description": "From the #1 New York Times bestselling author and beloved television host comes We’ve Got How You Can Stand Strong for America’s Soul and Sanity, a new book on how to come home to our core values, fortify our families, and re-embrace self-determination and self-governance. Do you think mainstream America needs to find its voice? If so, you’re not alone. The country is under attack by extremists at the fringes who put ideology before sanity and stoke division for their own gain. They are trying to rob America of its common sense and deny empirical truths, and we’re all suffering the consequences. In We’ve Got How You Can Stand Strong for America’s Soul and Sanity, Dr. Phil employs his signature no-nonsense approach to analyze America’s cultural crisis and offers practical, empirically based, action-oriented strategies to restore and support our country’s collective mental health. This compelling work combines a brutally honest look at the sustained attack on the core values that have defined America at its best and offers prescriptive guidance on what you can do in your own life to stop the madness. With his ten working principles for a healthy society, Dr. Phil provides the tools for mainstream America to fight back against the forces of division with sensible and urgently needed advice supported by the latest social, medical, and psychological findings. Dr. Phil demystifies the “tyranny of the fringe” and deconstructs their assault on the principles that made our nation prosperous, free, and powerful. With the hard-earned wisdom of years spent working with Americans of all backgrounds, Dr. Phil charts a course from cancel culture to counsel culture, from fear to acceptance, from victimhood to community, and from the tyranny of the fringe to a more civil society where we heal our divides and every one of us decides to be who we are on purpose. Dr. Phil is here to show us how.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Psychology",
    "Audiobook",
    "Self Help",
    "Cultural"
  ],
  "author": "Phillip C. McGraw",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/202081142-we-ve-got-issues"
}