{
  "title": "More Than Life: A YA Historical Fantasy",
  "description": "“Romance, loss, and self-discovery take the stage in this series opener, with lots of enticing hints for the epic adventure still to come. A page-turner for all romantasy fans!” –Marissa Meyer, New York Times Best Selling Author of The Lunar Chronicles“A sweeping tale of grief, love, adventure, and finding one’s path in life. Full of secrets long kept and characters you can’t help but root for, readers will get lost in its rich world.” –Annie Sullivan, author of A Touch of Gold and Tiger QueenA gripping story of overcoming grief, self-realization, and embarking on the adventure of a lifetime. As the daughter of a high-ranking sea captain, nineteen-year-old Cordelia Kimbal lives a life of luxury in the sea faring kingdom of Mikiria. But when her father dies unexpectedly, she is stripped of her title and home, and forced to join the working class in order to survive.Determined to rise above her losses, Cordelia is eager to prove her worth and stand on her own. But four months after her father's passing, a mysterious letter arrives, revealing the secret location of the mythical island of Qualaris. Known for concealing the secrets of magic and eternal life, Qualaris is often dismissed as mere legend, but Jaspar, Cordelia's father's enigmatic apprentice, is convinced of its existence and is harboring its secrets—secrets that the dark enchanter, Janus would stop at nothing to obtain.For generations, Jaspar and his ancestors have pursued the discovery and rescue of Qualaris while battling a curse of nonexistence, and he believes that Cordelia is the island's true protector, the one who can save it and its people from Janus's impending threat.Faced with the daunting task of defending Qualaris and its people, Cordelia embarks on a quest to locate the island, embrace her birthright, and take on the darkest enchanter in history. If she doesn’t, the island and its people won’t be the only casualties of Janus’s war.Join Cordelia on her journey as she navigates a world of magic, mystery, and danger, discovering her true self and the strength within her.*Content More Than Life is the first book in the More Than Life trilogy, and ends on a cliffhanger.",
  "genres": [
    "Fantasy",
    "Young Adult"
  ],
  "author": "Bethanie Finger",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/202141316-more-than-life"
}