{
  "title": "The Untold Story of Books: A Writer's History of Publishing",
  "description": "“People don’t read books anymore. Who has the time nowadays?” –Lesley’s Weekly (1913) From Gutenberg to Amazon, Michael Castleman’s The Untold Story of Books is the first and only history of publishing told from a veteran author’s point of view. Witty, entertaining, and full of remarkable new insights, it’s a deeply researched, fascinating history of the idiosyncratic book business—aimed at authors, aspiring authors, booksellers, industry professionals, and everyone who loves to read books. The Untold Story of Books organizes the 600-year saga of publishing into three distinct book businesses, all defined by the evolution of printing: Gutenberg-style hand presses (1450-1870), industrial printing (1870-2000), and digital publishing (2000-?). Castleman explores how each new book business upended its predecessor, forcing authors, publishers, and booksellers to adapt to ever-changing circumstances. It’s a story full of surprises. Why did books become favored Christmas presents? Because of a poem written in 1823. Why is New York the nation’s publishing capital? Because of the Erie Canal. Why are book endorsements are called “blurbs”? Because of a satirist’s joke in 1907. And why is copyright often an illusion? Because publishing was founded on book piracy, which today is easier and more rampant than ever. Arriving at the present day, Castleman paints a compelling portrait of an evolving book business full of new promise and peril. He unpacks the many myths surrounding the writer’s relationship to publishers. As tensions in an increasingly disrupted industry mount, Castleman offers a refreshing perspective, grounded in a truth that few would care to admit: writing and publishing have always been incredibly difficult professions— callings more than livings. Ultimately, The Untold Story of Books equips today’s authors with the understanding they need to survive— and maybe even thrive.",
  "genres": [
    "Nonfiction",
    "History",
    "Books About Books",
    "Writing",
    "Business",
    "Crafts"
  ],
  "author": "Michael Castleman",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/202030091-the-untold-story-of-books"
}