{
  "title": "10-Minute Stories From Greek Mythology - The Iliad and The Odyssey: Timeless Legendary Tales To Inspire Kids Of All Ages",
  "description": "Want your kids to develop a habit of reading? Treat them to these quick 10-minute action-packed Greek legends!Children nowadays seem to read less and less. Reading a book can seem like a chore when entertainment can be gained through a screen so much more quickly. But studies have shown that developing an “atomic habit” - just doing a few minutes a day of whatever skill or habit you want to take on can be more than enough to engrain it into our lives. Therefore, we have transformed timeless, legendary stories into 10-minute, bite-size chunks long enough to entertain, enthrall, and even educate the reader but short enough to be enjoyed quickly at bedtime or any other point in our busy modern days.Within its pages, you and your child will 25 page-turning adventures from the Iliad, the Odyssey, and the broader Epic Cycle;The greatest superhero team-up of the ancient world – uncover the might of Achilles, the tragedy of Ajax, and the sharp wits of Odysseus;From the heroic battles of the epic Trojan War to an unforgiving voyage through the Mediterranean Sea, with monsters and magic at every turn to inspire your imagination;Bite-sized non-stop entertainment in just 10 minutes! Cultivate and strengthen a love for books and reading. Timeless classic stories for kids to enjoy, helping young ones learn while having fun;Your perfect bedtime and travel companion – these short stories are excellent for you and your child to spend quality time together whenever and wherever you want!And much more.Some more gruesome or difficult details have been left aside, lying ready in the original texts, and are 100% kid-friendly without losing their magical charm.Gift your children the magic of reading with these enchanting Greek stories scroll up and click “Add to Cart” right now.",
  "genres": [
    "Mythology"
  ],
  "author": "Joy Chester",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/202214260-10-minute-stories-from-greek-mythology---the-iliad-and-the-odyssey"
}