{
  "title": "Killer Among Us",
  "description": "The witness protection program had simply not worked as promised. He and his wife had been relocated to a one horse hick town in West Tennessee, with a promise to start life over - on the right side of the law, this time.His factory job lasted less than a year. A strike and major labor dispute had cost him his job - and his running around with other women had cost him his wife. He never intended for any of this to happen, but it seemed he was meeting failure at every turn. He had made that difficult move from the underworld to the real world with all good intentions of making it stick - it wasn't working. Things were dragging him back, and he was finding it too easy to drift into the dark side of life once again. He knew that if he crossed back over, all chances and opportunity for a life in the real world were over - his one chance gone forever. While he resisted, it just didn't seem to matter - circumstances were taking him back - he couldn't stop himself.He started by renewing some old contacts, asking the right questions and finally by offering his services for hire. It didn't take long for things to happen, and contract offers coming his way.They started with a call from Anthony 'Tony' Scarsetti. He had worked for Tony in the past, and he believed they held a mutual respect for each other - him for his skills and Tony for his leadership. Tony was a rival of Steve Carrollton, and their competition for the vices in Memphis and on Beale Street was well known. Evidently, Carrollton had been temporarily sidelined - but his operations continued. Tony was looking for some professional help to make his temporary situation a permanent one.Once again in his life, things were looking up and he was feeling good about himself - being useful. His skills were needed and he would again be a contributor. His little house on Mullins Avenue, in this hick town of Humboldt, would also be useful. Quiet, out of the main activity in Memphis, and allowing him to operate under the radar. Besides, the government had bought it, why not put it to good use?He would start by sharpening the skills that had once made him successful. After all, failure was not an option in this business - only death. Hours in the local forests and woods would give him the privacy required - he had the perfect set-up and the perfect location. Nobody local to challenge him, and besides, if someone did - he was still the best at what he did. Everybody knew that.~The tickets arrived to his post office box in a medium size brown envelope. American Airlines First Class to Miami and a First Class Cabin for a cruise to the Bahamas. It also contained $5,000 in large bills - more would be paid when the job was complete. He'd never been on a cruise before. In fact, the largest boat he'd ever been on was one he and his brother used for cat fishing when he was a kid. Things were good again. He wasn't going to make the same mistakes he had made in the past. At the top of his game he was the best, and he intended to be at the top of his game.",
  "genres": [],
  "author": "Gerald W. Darnell",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/20234667-killer-among-us"
}