{
  "title": "Queens of Moirai",
  "description": "The Three Fates, a Mad Queen with a zombie horde, and a family of Ouroboros collide in this spicy mythology retelling of The Grim Reaper, and how she came to be.Morena Atropos is the Third Fate, the controller of Death, the granddaughter of Atropos. Doomed with dark gifts of destruction, and imprisoned for all of her life in a stone tower, Morena’s only view is the Obsidian Sea. Those she loves are taken away from her or used against her - what choice does she have but to serve as assassin?Hiding her strength, Morena hones her murderous abilities, serving as slave to an unstoppable villain - her mother, Malinda the Mad, Queen of the Blood Throne. There’s no hope of escape until the arrival of a mysterious stranger who claims to be her betrothed. He's there to finally rescue her, and Morena is all too willing to throw herself into his muscular arms. But all is not as it seems... and as his lies unravel, it plunges Morena into a love-triangle of forbidden love and arranged marriage, and a choice between her heart or her soul.In the meantime, her mother and her zombie army are on the move, and the other Fates expect Death to save the day.Set in an epic fantasy world in a timeline of hundreds of years, this dark romantasy features the Three Fates: Clotho, Lachesis, and Atropos, and their last descendants. Ideal for fans of mythology retellings with spice, this most unlikely of heroines will surprise and defy your expectations.----Note: This book contains adult material and various trigger warnings, including steamy sex scenes, death, dismemberment, imprisonment, gore, horror, an abusive parent, and suicide. It is a full length novel and suitable for 18+.",
  "genres": [
    "Fantasy",
    "Mythology",
    "Romance",
    "Romantasy",
    "Retellings",
    "Fantasy Romance",
    "Dark"
  ],
  "author": "Rhiannon Hargadon",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/202417522-queens-of-moirai"
}