{
  "title": "The House by the Cemetery",
  "description": "Six Feet Under meets Succession with a gothic twist after the suspicious death of a midwestern funeral home empire’s wealthy patriarch in New York Times bestselling author Lisa Childs’ dark, twisty, horror-tinged new series for readers of Megan Collins, Samantha Downing, Stacy Willingham, and Rachel Hawkins.In Gold Creek, Michigan, legend has that the ghost of a local grave digger still walks the cemetery, swinging his shovel, looking for his next victim to bury. But when the town’s wealthy undertaker dies, his estranged daughter must contend with the ghosts that haunt her own family . . .After she left home at seventeen, River Gold swore she would never return to Gold Creek. Growing up at the Gold Funeral Home and Memorial Gardens was a nightmare. Classmates constantly teased her for being part of the “Ghoul” family, while her own family denied that she was actually a Gold. Her father, undertaker Gregory Gold, certainly never acted like a father. He was far more interested in profiting off other people’s tragedies. But now Gregory has died. And River has surrendered to her mother, Fiona’s, pleas that she come back for his funeral.But the mourning period is cut short when it’s revealed that Gregory died of poisoning—and Fiona is arrested for his murder. Clearly, Fiona, his third wife and the funeral home’s cosmetologist, is being framed. There are plenty of more likely suspects, and River is determined to prove her mother’s innocence. That she’ll have to work with the sheriff—her high school enemy—is a small price to pay.With a fortune at stake, River is sure the killer lies among Gregory’s first two wives, their children, and grandchildren. Yet soon, other discoveries will be made, and longstanding secrets unearthed. But when teenagers start disappearing from the cemetery, the danger hits closer to home than River imagined possible. Drawn back into the lives—and lies—of the Golds—she’ll have to use her every resource to keep herself, and her loved ones, safe.",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller",
    "Fiction",
    "Mystery Thriller",
    "Halloween",
    "Crime"
  ],
  "author": "Lisa Childs",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/202470562-the-house-by-the-cemetery"
}