{
  "title": "A Fearsome Doubt",
  "description": "Bestselling author Charles Todd has earned a special place among mystery’s elite writers with his acclaimed series featuring Scotland Yard Inspector Ian Rutledge, a former soldier seeking to lay to rest the demons of his past in the aftermath of World War I. But that past bleeds into the present in a complex murder case that calls into question his own honor...and the crimes committed in the name of God, country, and righteous vengeance.In 1912 Ian Rutledge watched as a man was condemned to hang for the murders of elderly women. Rutledge helped gather the evidence that sent Ben Shaw to the gallows. And when justice was done, Rutledge closed the door on the case. But Shaw was not easily forgotten.Now, seven years later, that grim trial returns in the form of Ben Shaw’s widow Nell, bringing Rutledge evidence she is convinced will prove her husband’s innocence. It’s a belief fraught with peril, threatening both Rutledge’s professional stature and his faith in his judgment. But there is a darker reason for Rutledge’s reluctance. Murder brings him back to Kent where, days earlier, he’d glimpsed an all-too-familiar face beyond the leaping flames of a bonfire. Soon an unexpected encounter revives the end of his own war, as the country prepares for a somber commemoration on the anniversary of the Armistice. To battle the unsettled past and the haunted present at the same time is an appalling mandate. And the people around him? Among them the attractive widow of a friend, a remarkable woman who survived the Great Indian Mutiny; a bitter, dying barrister; and a man whose name he never knew—unwittingly compete with the grieving Nell Shaw. They’ll demand more than Rutledge can give, unaware that he is already carrying the burden of shell shock—and the voice of Hamish MacLeod, the soldier he was forced to execute in the war. The killer in Marling is surprisingly adept at escaping detection. And Ben Shaw’s past is a tangle of unsettling secrets that may or may not be true. Rutledge must walk a tortuous line between two murderers...one reaching out to ruin him, the other driven to destroy him.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical Mystery",
    "Historical",
    "British Literature",
    "Crime"
  ],
  "author": "Charles Todd",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/20238.A_Fearsome_Doubt"
}