{
  "title": "There Are Rivers in the Sky",
  "description": "From the Booker Prize finalist author of The Island of Missing Trees, an enchanting new tale about three characters living along two rivers, all under the shadow of one of the greatest epic poems of all time.In the ancient city of Nineveh, on the bank of the River Tigris, King Ashurbanipal of Mesopotamia, erudite but ruthless, built a great library that would crumble with the end of his reign. From its ruins, however, emerged a poem, the Epic of Gilgamesh, that would infuse the existence of two rivers and bind together three lives. In 1840 London, Arthur is born beside the stinking, sewage-filled River Thames. With an abusive, alcoholic father and a mentally ill mother, Arthur’s only chance of escaping destitution is his brilliant memory. When his gift earns him a spot as an apprentice at a leading publisher, Arthur’s world opens up far beyond the slums, and one book in particular catches his interest: Nineveh and Its Remains.In 2014 Turkey, Narin, a ten-year-old Yazidi girl, is diagnosed with a rare disorder that will soon cause her to go deaf. Before that happens, her grandmother is determined to baptize her in a sacred Iraqi temple. But with the rising presence of ISIS and the destruction of the family’s ancestral lands along the Tigris, Narin is running out of time. In 2018 London, the newly divorced Zaleekah, a hydrologist, moves into a houseboat on the Thames to escape her husband. Orphaned and raised by her wealthy uncle, Zaleekah had made the decision to take her own life in one month, until a curious book about her homeland changes everything. A dazzling feat of storytelling, There Are Rivers in the Sky entwines these outsiders with a single drop of water, a drop which remanifests across the centuries. Both a source of life and harbinger of death, rivers—the Tigris and the Thames—transcend history, transcend fate: “Water remembers. It is humans who forget.”",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Literary Fiction",
    "Historical",
    "Book Club",
    "Audiobook",
    "Contemporary"
  ],
  "author": "Elif Shafak",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/202468422-there-are-rivers-in-the-sky"
}