{
  "title": "طوفان دیگری در راه است",
  "description": "طوفان دیگری در راه است جدیدترین رمان بلند سیدمهدی شجاعی و از پرفروش‌ترین آثار داستانی در نوع خود است. می‌توان گفت محور اصلی داستان، تحول و به عبارت بهتر، تولد دوباره است؛ زندگی مجددی که برای تک تک شخصیت‌های کتاب اتفاق می‌افتد و داستانک‌های نقل شده در لا به لای داستان اصلی، ماجرای همین تغییر و تحول‌ها برای شخصیت هاست.قسمت اعظم کتاب از زبان زنی به نام زینت روایت می‌شود که در گذشته خواننده و رقاص بوده ولی بنا به دلایلی توبه کرده و تبدیل به یکی از بندگان مقرب خدا می‌شود. زینت در یکی از شب‌هایی که مشغول اجرای برنامه در یک عروسی بوده با نوجوانی به ظاهر دیوانه به نام کمال مواجه می‌شود که تصمیم می‌گیرد به نوعی به او کمک کند. زینت که حکم مادر این پسر را پیدا کرده با او به روستایی فرار می‌کند و وسایل ادامه تحصیلش را فراهم می‌کند و حتی او را برای تحصیل به خارج از کشور می‌فرستد. زینت در طول داستان مشغول تعریف کردن مراحل رشد و بالندگی نوجوان گم شده برای حاج امین پدر کمال است که هم او باعث به مرز جنون رسیدن پسرش شده بود و اکنون یکی از مهره‌های سرشناس و ثروتمند و خیّر است. زینت حاج امین را قدم به قدم با زندگی پسر گمشده‌‌اش که از طرف پدر طرد شده بود آشنا می‌کند و در همین حین او چشم درون او را باز می‌کند تا این که…شاید بتوان داستان این کتاب را مصداق جملهٔ معروف «راه‌های رسیدن به خداوند به تعداد مخلوقات اوست» دانست: در این کتاب می‌خوانیم فکر می‌کنم دچار حالتی شبیه «دوست داشتن» شده باشم! نمی‌توانم اسمش را بگذارم عشق. برای این که به قول همیشهٔ تو، عشق ساده نیست. ولی دوست داشتن چرا! کافی است که تو دختری را تصادفاً در یک مهمانی ببینی -مهمانی‌‌ای که ایرانی‌ها به مناسبت چهارشنبه سوری برگزار کرده اند- و قیافه‌‌اش به دلت بنشیند و بخصوص چاله‌‌ای که موقع خندیدن، روی گونه‌‌اش می‌افتد توجهت را جلب کند. با کمی پررویی جلو بروی و با قدری پررویی بیشتر، سر صحبت را باز کنی و در همان چند دقیقه اول، متوجه شوی که او هم تصادفاً از تو خوشش آمده و از دیدنت خوش وقت شده و تو هم از خوشحالی بخندی و همزمان با دست به دنبال چاله‌‌ای بر روی صورتت بگردی تا علت علاقه و جلب توجه او را هم به خودت پیدا کنی. و البته مهم نیست اگر پیدا نکنی! مهم این است که به گفتگو ادامه دهی و آخر شب، او را تا منزلش -یعنی بیرون منزلش- همراهی کنی.",
  "genres": [
    "Novels",
    "Literature"
  ],
  "author": "سیدمهدی شجاعی",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/2023051._"
}