{
  "title": "Playing Ball: Life Lessons from My Journey to the Super Bowl and Beyond",
  "description": "NFL football star Vernon Davis delves into his astonishing career, from winning Super Bowl 50 in 2016 with the Denver Broncos to reinventing himself as an actor and producer, and recalls the hard-won lessons—including that infamous press conference—that paved his path to success. In October 2008, after a San Francisco loss to Seattle, Vernon Davis was put on blast by Coach Mike Singletary in a fiery speech criticizing his “me-myself-and-I attitude”. It proved to be the turning point in Davis’s career, and the inspiration for him to change his mindset, his playing, and his life. At the time, Davis was a young, talented player who had been drafted by the 49ers in 2006 at number six, one of the highest draft positions for a tight end in NFL history. He played ten years for the team, which included a 2013 Super Bowl loss to the Baltimore Ravens in a 34-31 heartbreaker, where he recorded six catches for 104 yards. Winning a Super Bowl in 2016 with Peyton Manning, Davis landed a crucial downfield block and sprung teammate C.L. Anderson for a key 34-yard run that helped the Broncos defeat the Carolina Panthers 24-10. Davis retired in 2019 after a final four years playing pro for his hometown team in Washington. He’s now deeply involved in his new acting and producing feature films. Here he rewinds the tape to reflect on his career and competitive spirit—and the insights about teamwork, leadership, and responsibility that came in the aftermath of Coach Singletary’s press conference, spurring him to transform his life for the better. Weaving personal reflections with frank, real-world advice, Playing Ball is not just one athlete’s memoir but an eye-opening exploration of what winning—on the field and beyond—really means.",
  "genres": [
    "Sports"
  ],
  "author": "Vernon Davis",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/202470606-playing-ball"
}