{
  "title": "Watchers of Time",
  "description": "The year is 1919, and Ian Rutledge is a fragile yet courageous former soldier searching for his place in a postwar world. Now a Scotland Yard investigator, Rutledge is called upon to probe a small-town murder — and discovers that it may be connected to one of the greatest disasters of all time....In Osterley, a marshy Norfolk backwater, a man lies dying on a rainy autumn night. While natural causes will surely claim Herbert Baker’s life in a matter of hours, his last request baffles his family and friends. Baker, a devout Anglican, inexplicably demands to see the town’s Catholic priest for a last confession. The old man dies without knowing that the very priest who gave him comfort will follow him to the grave just a few weeks later — the victim of an appalling murder.The local police are convinced the evidence points to an interrupted robbery, and have named a suspect, Matthew Walsh. But the dead priest’s bishop insists that Scotland Yard oversee the investigation. A simple task for Rutledge, a man not yet well enough to return to full duty. The Inspector draws on years of experience and a war-honed intuition as he finds himself uncovering secrets that the local authorities would prefer not to see explored. Surely, they reason, it is better to charge an outsider — Matthew Walsh — with murder than to learn that someone in this tightly knit community would commit such a horrendous crime. And yet there are those, Rutledge soon discovers, who held grudges against the priest that had little to do with God or the Church. No one in Osterley is aware that Rutledge hears voices — or, rather, one haunting voice: that of a soldier he was forced to execute during the War. It is with the voice of Hamish MacLeod, by turns second-guessing and taunting him, that Rutledge begins a journey toward the devastating truth that will unlock the secrets of Osterley and pare away its layers of deception. And in piecing together a different story, Rutledge encounters a chain of events that stretches from these brooding marshes to one of the greatest sea disasters in history — the sinking of the Titanic. Who is the mysterious woman who may have boarded that ship ... and who is the secretive woman who survived it? Rutledge comes to believe that he alone can stop a killer from striking again. Deftly capturing the anguish of a man haunted by his tragic past, Watchers of Time delves beneath a cast of unforgettable characters to examine a mystery even greater than murder: the mystery of what is right and what is wrong after the world has committed the sin of war.From the Hardcover edition.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical Mystery",
    "Historical",
    "Crime",
    "British Literature"
  ],
  "author": "Charles Todd",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/20239.Watchers_of_Time"
}