{
  "title": "After the War",
  "description": "In his third and most powerful work of fiction, the acclaimed author of The Coming of Rain and Bound for the Promised Land —biographer also of Thomas More—immerses us in the rich life of an American town, in the subtle and complex experience of becoming an American, in the good and evil of a time gone by.The place is Bourbonville, Tennessee. The the end of the First World War. The Paul Alexander—Greek by birth, Belgian by adoption, wounded in the war, nearly to death, and now washed up history, by accident, by odd fate, on the edges of Bourbonville, and soon to become part of its center.This is a town where people have known one another for generations, a town full of talkers, compulsive storytellers—thrilled to have a new listener to whom they can pour out local scandals, triumphs, secrets, especially the ongoing saga of the great schism between Moreland Pinkerton, champion of Progress who has drained a swamp to a foundry, and Brian Ledbetter and his Weaver stepsons, independent farmers with the values of an earlier, more agrarian America, who see Pinkerton as a bully and a destroyer. Listening, fascinated, Paul is reluctantly drawn into the life of the town, into the world beyond Mrs. Coolidge’s where he boards, one of seven bachelors. And—through both his work and his friendships—into the battle between Pinkerton (his boss at the foundry) and Ledbetter (whose granddaughter loves him) for the town’s soul.Inevitably, the two factions find themselves in dangerous confrontation where a black war veteran’s attempt to organize the foundry’s black workers erupts into racial animosities and bloody industrial conflict. And, in the midst of these violent events, Paul’s own astonishing story—his exile from Greece and his wartime ordeal—unfolds as he begins to move away from his past into the heart of the town, finding himself eventually part even of its myths.In After the War , Marius has given us a large and moving novel that compels us both by its panoramic amplitude and by its revelation of one fascinating life in the throes of change.",
  "genres": [
    "Historical Fiction",
    "World War I",
    "Fiction"
  ],
  "author": "Richard Marius",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/2022933.After_the_War"
}