{
  "title": "The Murder Stone",
  "description": "The Great War is still raging in the autumn of 1916, when Francesca Hatton’s beloved grandfather dies on the family estate in England’s isolated Exe Valley. Grieving for the man who raised her, Francesca is stunned to find an unsigned letter among his effects, cursing the Hattons and their descendants. Now a stranger has shown up on her doorstep, accusing her grandfather of being a murderer. Ex-soldier Richard Leighton blames Francis Hatton for the death of his mother, who vanished nearly a quarter of a century earlier. Her body was never found, only a shawl stained with her blood. And Leighton is not the only one with a claim on Francesca’s grandfather. On the day of his funeral, unexpected visitors arrive with the mourners, and Francesca is besieged by charges of Hatton’s vicious dealings. Yet there is also a shy young woman who praises his secret generosity.At the center of the intrigue is an unusual white stone that lies hidden in a secluded garden where Francesca once played with her five male cousins, all of them dead now on the battlefields of France. According to the terms of Hatton’s will, the Murder Stone must be dug up and transported to Scotland, where it is to be buried forever. But before Francesca can begin the journey, a series of ominous “accidents” occur, culminating in the discovery of a bleeding body on the Murder Stone itself.Was Hatton the loving, caring protector his granddaughter always believed him to be? Or a vindictive, secretive man who cultivated dangerous enemies? Francesca sets out in pursuit of the truth—and into the sights of someone determined to exact a revenge long overdue. From the Hardcover edition.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical Mystery",
    "Historical",
    "World War I",
    "Mystery Thriller"
  ],
  "author": "Charles Todd",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/20236.The_Murder_Stone"
}