{
  "title": "Searching For Zen: A Tale Of Divine Destiny",
  "description": "In a world where Earth intertwines with realms of fantasy and science fiction, a humble boy is bestowed with a divine destiny, thrusting him into a journey of self-discovery and perilous adventure.Our story begins on Earth, but an Earth with a past steeped in fantasy, myths, and legends. From humble beginnings, a boy is given a divine destiny, a chance to make his mark on human civilization, but he must embark upon a life-changing journey. Our hero struggles to understand what he has been given and what to do with it, losing himself in doubt and loneliness as he confronts the dark side of humanity.Coming of age, Zen finds strength in himself, builds a family from a motley collection of strangers, and discovers love. His newfound friends help him open up, learn to trust others, and eventually understand his reason for fighting. The trials he faces throughout his quest amplify as his power increases, and he even sparks the ire of those in the spirit realm, who doubt any human can wield such power successfully.As Zen grapples with the weight of his purpose and the sacrifices it demands, he learns that the true power lies not in his abilities alone, but in the bonds of love, friendship, and the resilience of the human spirit.Book Trib ReviewIn Searching for Zen, author Albert T. Franklin weaves an exhilarating tale that seamlessly melds elements of fantasy and science fiction into an epic narrative of self-discovery, love and the enduring power of the human spirit. From its humble beginnings on Earth to the vast expanses of the cosmos, this book takes readers on a gripping adventure that will keep them turning pages long into the night.At the heart of the story is Zen, a seemingly ordinary boy thrust into an extraordinary destiny. Franklin expertly captures Zen’s journey of self-discovery, as he grapples with doubt, loneliness and the weight of his divine purpose. From the very first line, readers will find themselves drawn into Zen’s world, rooting for him as he navigates the challenges that come with his newfound power.",
  "genres": [
    "Drama",
    "Book Club",
    "Contemporary",
    "Novels",
    "Fantasy",
    "Philosophy",
    "Science Fiction"
  ],
  "author": "Albert T. Franklin",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/202285960-searching-for-zen"
}