{
  "title": "God and the Goddesses: Vision, Poetry, and Belief in the Middle Ages",
  "description": "Contrary to popular belief, the medieval religious imagination did not restrict itself to masculine images of God but envisaged the divine in multiple forms. In fact, the God of medieval Christendom was the Father of only one Son but many daughters—including Lady Philosophy, Lady Love, Dame Nature, and Eternal Wisdom. God and the Goddesses is a study in medieval imaginative theology, examining the numerous daughters of God who appear in allegorical poems, theological fictions, and the visions of holy women. We have tended to understand these deities as mere personifications and poetic figures, but that, Barbara Newman contends, is a mistake. These goddesses are neither pagan survivals nor versions of the Great Goddess constructed in archetypal psychology, but distinctive creations of the Christian imagination. As emanations of the Divine, mediators between God and the cosmos, embodied universals, and ravishing objects of identification and desire, medieval goddesses transformed and deepened Christendom's concept of God, introducing religious possibilities beyond the ambit of scholastic theology and bringing them to vibrant imaginative life.Building a bridge between secular and religious conceptions of allegorized female power, Newman advances such questions as whether medieval writers believed in their goddesses and, if so, in what manner. She investigates whether the personifications encountered in poetic fictions can be distinguished from those that appear in religious visions and questions how medieval writers reconcile their statements about the multiple daughters of God with orthodox devotion to the Son of God. Furthermore, she examines why forms of feminine God-talk that strike many Christians today as subversive or heretical did not threaten medieval churchmen.Weaving together such disparate texts as the writings of Latin and vernacular poets, medieval schoolmen, liturgists, and male and female mystics and visionaries, God and the Goddesses is a direct challenge to modern theologians to reconsider the role of goddesses in the Christian tradition.",
  "genres": [
    "Religion",
    "Medieval",
    "Nonfiction",
    "Poetry",
    "History"
  ],
  "author": "Barbara Newman",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/2022892.God_and_the_Goddesses"
}