{
  "title": "Just Love Her: A Mother's Journey of Healing Through Her Daughter's Drug Addiction",
  "description": "Riveting, inspiring, true life account of a mother s journey to heal herself, even as she strives to help her daughter overcome the ravages of drug addiction. Hayes has walked where parents fear to tread, learning important lessons along the way. Now she is eager to share her experience, so that others can profit from the knowledge she gained. Hayes thought she had her life on track. She was a professional woman and successful entrepreneur in Canada. A large part of her identity was the close relationship she had with her children. Then her daughter, Angie, began to assert her independence in uncharacteristic ways. Before her fourteenth birthday it became clear to Hayes that not only had her daughter fallen in with the wrong crowd, but she was also experimenting with drugs. Hayes life seemed to unravel as she realized she could not cope with a child who defied every parameter of good behavior. Reluctantly she sent her daughter to live with her father in the hope that a change of environment and renewed relationships with old friends would set Angie back on the right path. As Angie descended into self-destructive behavior, Trina found her own path to be strewn with issues she had not recognized when things were going well with her children. When her son, Sean, decided to move with his dad to be with Angie, Trina s outlook became even bleaker. In spite of the fact that she had always told her children they must stick together, she felt a loneliness that stripped away every certainly she had held. Her self-esteem plummeted, and memories from her own childhood plagued her. No longer supremely confident in her abilities, Hayes made some bad relationship choices, and there were times when she thought she had failed at everything. How could she have been so wrong about everything in her life? How could her daughter be doing drugs when Hayes had tried so hard to be a good parent? Only her faith kept her going. She came to see the situations she had gotten herself into as instruments of learning, and she was grateful. When Angie agreed to go into treatment, Trina felt that she, as well as her daughter, had turned a corner. The road was not smooth. Angie completed her six month treatment program and moved in with Trina and Sean, but soon she regressed into her old self-destructive behavior, violating the contract she had signed with her counselor and Trina and Sean. Throughout all the ups and downs, Trina clung on to the words of advice from a Just Love Her. She didn t know it, but Angie clung to those words, too; she depended on her mother s love as a lifeline. No matter how badly she messed up, no matter how far she descended into her own private hell, she knew her mother loved her.",
  "genres": [],
  "author": "Trina Hayes",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/2025310.Just_Love_Her"
}