{
  "title": "Holistic Mysticism: The Integrated Spiritual Path of the Quakers",
  "description": "When people hear the word Quaker, their first association is often oats, motor oil, or the Amish—but oatmeal, automobile lubricant, and avoiding electricity have nothing to do with the Quakers' holistic mysticism. What is central to Quaker spirituality is the Divine Center, an inner sanctuary where the very Presence of God dwells. As Quaker theologian Rufus Jones “The kingdom of God is not a place where we go, but a state of being we can live in.” And we don’t need to take the journey by horse and buggy!Let Amos Smith open your heart and expand your mind. Quakerism holds wisdom we desperately need today. Read, contemplate, and prepare to be transformed. —Phileena Nikole, author of Mindful The Heart of Christian Contemplation and Pilgrimage of a Contemplative Spirituality for the Active LifeI am grateful to Amos Smith for sharing himself, for bringing alive these voices from Quaker tradition, and for making clear that mysticism is not confined to monasteries or otherwise isolated from the problems of the world. —Margery Post Abbott, author of To Be Broken and Tender My own interior work by the Spirit of Christ has been affirmed on many levels by this new book by Amos Smith. . . . Read, relish, and be renewed.—David Sanford, Executive Editor of Tyndale House's Holy MosaicAmos Smith is a practicing Quaker (Friends General Conference) and a long-term centering-prayer practitioner, as well as a writer, workshop leader, and rehabilitation counselor. He emphasizes centering prayer and contemplative arts as the saving graces of his life. He is also the author of Healing the Divide (Resource, 2013) and Be Still and Listen (Paraclete, 2018). For more information, go to RCMR5.org ( friends).",
  "genres": [
    "Novels",
    "Drama",
    "Contemporary",
    "Book Club"
  ],
  "author": "Amos Smith",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/202642445-holistic-mysticism"
}