{
  "title": "The Reaper: No Mercy",
  "description": "Reaper: No Mercy is the beginning of a standalone series based on the characters and environment from the Blood, Brains, and Bullets series by Sean Liebling. Captain Jason Scott had retired from the United States Marine Corp as a Force Recon sniper with the 1st Marine Division. Now a hard-working family man, his life revolved around his wife, children, and grandchildren. Upon arriving home after working third shift on the day the undead rose, he found his entire family slaughtered. Berserk with rage, he killed every zombie in sight using any means at hand. They truly died under his wrath, and he survived. It was then that he realized the Lord had a new mission for him. Now Jason Scott is known as the Reaper: the coldest, deadliest killer in the new world of the Apocalypse. He once again dons his old tools of the trade—the tools of a Marine Corps sniper—and sets out to eradicate the spawn of Hell. Along the way he encounters Jay Scarmon, the interim Governor of Michigan, and together they make a safe haven for a large group of survivors in the town of Newaygo. The Reaper saves hundreds of people, kills thousands of the undead, and even participates in a raid on a secret shadow government fortress – against the very people who engineered and released the virus that almost entirely destroyed mankind. However, the Reaper knows that there is more to be done than simply rebuild and protect those under his charge. Evil is afoot in the land; they must contend not only with the reanimated dead, but also with the forces of the shadow government. There are also plenty of bad men who are ready and willing to take advantage of the weak. The Reaper’s mission is clear – he must fight the Lord's fight and take the battle to the evil minions of Satan, both living and undead. He needs to help the survivor groups band together into cohesive assemblies better able to survive this new world, and finally, he must scout westward into Colorado in order to recon the shadow government's stronghold there. Follow the adventures of the Reaper as he travels to the city of Paris, Missouri. There he meets several disparate groups of survivors. He also learns of a band of marauders who are ravaging the countryside, killing those that stand against them, and enslaving the rest. The older folk and the young children are killed outright; the rest of the prisoners are treated brutally, forced to live and work under the most inhumane of circumstances. The women are repeatedly raped and beaten. The Reaper must convince the survivors to band together and take their town back from the marauders – all whilst fighting the hordes of undead, their mutual distrust of one another, and their fear of the overwhelming numbers arrayed against them. Who will prevail? Only the Reaper knows.This limited edition contains special unedited bonus features following the final chapter!",
  "genres": [
    "Zombies"
  ],
  "author": "Sean Liebling",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/20257369-the-reaper"
}