{
  "title": "The Monster Within: Elemental Love",
  "description": "From USA Today Bestselling Author Cerys du Lys ~ After being exiled and forced into an arranged marriage with the terrifying Demon King, Solace had all but lost hope of ever knowing happiness. The commanding Demon King, Bastion, turns out to be far less monstrous than the stories surrounding him, though. Will Solace be able to find love and kindness in this most unlikely of places, or will treacherous falseness and the sinister fate of a prophecy be her undoing? (A Cerys du Lys fantasy romance novel) Exiled from her home, cast out and condemned for simply existing in a cruel world with no place for her, Solace is sent to become a sacrificial bride for the Demon King. In accordance with an ancient pact, humanity must offer the leader of the monstrous host a wife once every hundred years. The arranged marriage is meant to maintain peace, and yet... The stories told about monsters and the terrifying aspects of the Demon King are anything but reason for rejoice. Abandoned by fate, orphaned at a young age, despised from the start despite her smiles and attempts at friendship and happiness, Solace has no choice but to become some monstrous abomination of a bride. But... Bastion is unlike anything she expected. The Demon King is nice to her, offering safety and kindness in exchange for... what? In order to retain succession to the throne, a demon must provide an heir; when a demon couples with a human, the inevitable fate of the woman is to die from the demonic energy growing inside her. Still... Between the life she once had, the intimate emotions stirring within her, and the need to belong, to have companionship and something truly of her own, Solace struggles to come to terms with her situation. Bastion may not hate her--is it possible for him to love her?--but their union will be her final act. They have time; there's no reason to hurry. Or, they had time... Conspiracy and treachery threaten Bastion's sovereignty. An inauspicious prophecy foretold nearly a century ago tells of a monster living within the Demon King, waiting to destroy humanity. And Solace is the key to this cataclysm. All Solace ever wanted was happiness and love; a home. Struggling down a path filled with self-discovery and deception, can she learn how to stop The Monster Within and finally find her happy ending, or is she destined to become the catalyst to devastation? Emotional, enchanting, and sweet. This compelling romance of dominance and desires, kings and queens, peasants, monsters, and maidens will captivate you, fascinate you, and leave you feeling absolutely enraptured.",
  "genres": [
    "Fantasy",
    "New Adult",
    "Erotica",
    "Paranormal",
    "Magic",
    "Adventure"
  ],
  "author": "Cerys du Lys",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/20262394-the-monster-within"
}