{
  "title": "Act Like a Success, Think Like a Success",
  "description": "When Steve Harvey was thirtysomething, he was living in his car. It was a sacrifice he was willing to make to give it his best shot at becoming a comedian. After several months of this lifestyle-washing in public bathrooms, eating fast food-he had considered giving up. Before calling his mother to ask if he could stay with her, he checked his voicemail. The Apollo Theatre wanted him to perform! Great opportunity, but Steve did not have enough money for gas to get from Tennessee to New York. He prayed about it, as he was too proud to ask for money. The following day he had a message from a club in Florida. The audience loved him so much they asked Steve back for a second night. The gig provided him enough money to fly to New York. Although he had no place to stay, walking around all night with a bag that held everything that he owned, it did not get him down. In his new book, Act Like a Success, Think Like a Success, Steve explains this as a “Pushback, Pushforward” moment. He believes we all have these kinds of situations in life when we have to make a conscious decision to move forward with our dream or walk away. He also believes that anyone aspiring for a better life should be prepared for accidents. This means that one should constantly work on developing their gift, the gift that God has given each of us, so that when opportunities arise we will be ready. Steve addresses discipline-sleeping a maximum of five hours a night. Anyone who sleeps more is not serious about getting the rewards life has to offer. He also discusses concepts of work versus effort and rich versus success. He focuses on taking the lid off the jar. In other words, remove messages from yourself and others that will limit dreams.Act Like a Success, Think Like a Success is a book about success that is rich with anecdotes from Steve’s life—from sleeping in his car to becoming the $40 million dollar man! This invaluable guide is written for everyone, whether you are just beginning your career or are well situated in the c-suite.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Business",
    "Audiobook",
    "Personal Development",
    "Leadership",
    "Inspirational"
  ],
  "author": "Steve  Harvey",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/20262403-act-like-a-success-think-like-a-success"
}