{
  "title": "Das Kapital. Kritik der politischen Ökonomie, Buch 1: Der Produktionsprozess des Kapitals",
  "description": "Kapital von bleibendem Wert Zum Ende eines jeden Jahres wird aufgeräumt. Auch vor dem Bücherschrank mache ich da nicht Halt. Zu jedem Jahreswechsel muß notwendig der ein oder andere Band seinen sonnenbeschienenen Platz im Regal gegen die Dunkelheit und Enge in einer der -- immerhin wohlsortierten -- Kisten auf dem Speicher eintauschen. Drei blaue Folianten mit dem Titel Das Kapital. Kritik der politischen Ökonomie, erworben 1980 von mir damals gerade mal 19-Jährigen (für, wenn ich mich recht entsinne, sage und schreibe zehn Ostmark -- kann das sein?-, zwangsumgetauscht gegen \"unsere echte D-Mark\"), haben bislang bei jeder Aufräumaktion ihren Platz verteidigen können. Und dies wird auch zum Ende dieses Jahres nicht anders sein, wenn mit dem Dezember das Jahrhundert und mit diesem -- wenn man es so rechnen will -- das Jahrtausend zu Ende geht. Was (außer den zahllosen Zitaten) wird bleiben von Karl Marx nach dem Ende von so gut wie allen kommunistischen, ja auch nur sozialistischen Staatswirtschaften dieser Welt? Wird sich die Erinnerung an sein Werk mit dem Nachgeschmack des untergegangenen Totalitarismus im Osten Europas allmählich ganz im Nichts verlieren? Ich denke: Nein! Im Gegenteil wird irgendwann der Blick wieder frei werden für dieses Stück deutscher und europäischer Geistesgeschichte. Frei vor allem von der gegenwärtig noch reflexhaften Konnotation mit den ehemals real existierenden staatskapitalistischen Diktaturen, deren Führer ihren und ihrer Staatsdoktrinen Namen mit dem von Marx verbanden, ohne dass der sich noch hätte wehren können. Das Kapital, zuerst erschienen zwischen 1867 und 1894, ist ohne Zweifel ein bedeutendes Zeugnis der Geschichte der Politischen Ökonomie als Wissenschaft. Und als solches wird es bleiben. Und bleiben wird es auch in meinem Bücherschrank. Auch im neuen Jahrhundert. Beladen freilich mit Erinnerungen, die nichts mit dem Werk und ebenso wenig mit seinem Autor zu tun haben: Mit dem geteilten Berlin des Jahres 1980, dem ersten Jahr des letzten Jahrzehnts der DDR. Hat das irgend etwas zu bedeuten? Nein! Denn: \"Abstrakt strenge Grenzlinien scheiden ebensowenig die Epochen der Gesellschafts- wie der Erdgeschichte\". (Karl Marx, Das Kapital, Berlin (Ost): Dietz Verlag 1980, Band 1, S. 391). --Andreas Vierecke",
  "genres": [
    "Philosophy",
    "Economics",
    "Politics",
    "Nonfiction",
    "History",
    "Classics",
    "Theory"
  ],
  "author": "karl-marx",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/202646.Das_Kapital_Kritik_der_politischen_konomie_Buch_1"
}