{
  "title": "Uncle Tom's Cabin for Children [Adapted from the Work of H.B. Stowe]",
  "description": "This historic book may have numerous typos and missing text. Purchasers can usually download a free scanned copy of the original book (without typos) from the publisher. Not indexed. Not illustrated. 1868 edition. ... UNCLE TOM'S CABIN FOE CHILDREN. CHAPTER I. Uncle Tom's Cabin And The Great nousE. Uncle Tom lived in a small hut, or cabin, roughly built of logs of wood; but rough as it was, it would not be easy to find a prettier little cottage, that is, as far as the outside of it went, for it was all overgrown with the most beautiful scarlet and white flowers, so that the wood was completely hidden by them. The inside was certainly not so brilliant, but then it was extremely comfortable, because it was kept so beautifully clean by Aunt Chloe, Uncle Tom's wife. This little dwelling was situated close to the great house occupied by Uncle Tom's master, where Aunt Chloe was the cook; and a famous cook she was! nobody's cakes and puddings could compare with Aunt Chloe's; and her head was always so full of roasting, and boiling, and baking, that the very ducks and chickens used to look frightened when they met her. When her master's dinner was sent up, she used to come home to look after her children and her old man, as she called Uncle Tom. There she is now, with her black shining good-humoured face, lifting the corner of the baking pan, to see if her cake is rising nicely, for slie is expecting Master George Shelby, her master's son, to tea; and as she is very fond of him, she likes to give him something good. In a corner of the room, on a rough bench, sit Mose and Pete, her two little boys, with their woolly heads and fat faces, as black as her own. They are playing with the baby, and at the same time keeping.an eye on the bake pan, because they hope, by-and-by, when Mas'r George is served, to get a bit of the cake. In the middle of the room, there is a table covered with a clean cloth, and at this table sits Uncle Tom himself, with a slate before him,...",
  "genres": [],
  "author": "Catherine Crowe",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/20278130-uncle-tom-s-cabin-for-children-adapted-from-the-work-of-h-b-stowe"
}