{
  "title": "Personal Days",
  "description": "In an unnamed New York-based company, the employees are getting restless as everything around them unravels. There’s Pru, the former grad student turned spreadsheet drone; Laars, the hysteric whose work anxiety stalks him in his tooth-grinding dreams; and Jack II, who distributes unwanted backrubs–aka “jackrubs”–to his co-workers.On a Sunday, one of them is called at home. And the Firings begin.Rich with Orwellian doublespeak, filled with sabotage and romance, this astonishing literary debut is at once a comic delight and a narrative tour de force. It’s a novel for anyone who has ever worked in an office and “Where does the time go? Where does the life go? And whose banana is in the fridge?”Praise for PERSONAL DAYS\"Witty and appealing...Anyone who has ever groaned to hear 'impact' used as a verb will cheer as Park skewers the avatars of corporate speak, hellbent on debasing the language....Park has written what one of his characters calls 'a layoff narrative' for our times. As the economy continues its free fall, Park's book may serve as a handy guide for navigating unemployment and uncertainty. Does anyone who isn't a journalist think there can't be two books on the same subject at the same time? We need as many as we can get right now.\" — The New York Times Book Review\"Never have the minutiae of office life been so lovingly cataloged and collated.\" —\"Three First Novels that Just Might Last,\" — TimeA \"comic and creepy début...Park transforms the banal into the eerie, rendering ominous the familiar request \"Does anyone want anything from the outside world?\" — The New Yorker\"The modern corporate office is to Ed Park's debut novel Personal Days what World War II was to Joseph Heller's Catch-22 —a theater of absurdity and injustice so profound as to defy all reason....Park may be in line to fill the shoes left by Kurt Vonnegut and other satirists par excellence.\" —Samantha Dunn, Los Angeles Times\"In Personal Days Ed Park has crafted a sometimes funny, sometimes heartbreaking, but always adroit novel about office life...Sharp and lovely language.\" — Newsweek\"A warm and winning fiction debut.\" — Publishers Weekly\"I laughed until they put me in a mental hospital. But Personal Days is so much more than satire. Underneath Park's masterly portrait of wasted workaday lives is a pulsating heart, and an odd, buoyant hope.\" — Gary Shteyngart, author of Absurdistan\"The funniest book I've read about the way we work now.\" –William Poundstone, author of Fortune's Formula\"Ed Park joins Andy Warhol and Don DeLillo as a master of the deadpan vernacular.\" —Helen DeWitt, author of The Last Samurai",
  "genres": [
    "Fiction",
    "Humor",
    "Contemporary",
    "Novels",
    "Literary Fiction",
    "Literature",
    "New York"
  ],
  "author": "Ed     Park",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/2026701.Personal_Days"
}