{
  "title": "The Testimony of Tradition",
  "description": "This historic book may have numerous typos and missing text. Purchasers can usually download a free scanned copy of the original book (without typos) from the publisher. Not indexed. Not illustrated. 1890 edition. ...of the Duke of Athole, and of Mr. Farquharson of Invercauld.\" 3 \"Tales,\" II. 107. The story referred to is on pp. 102-6. And the latter inference is, in point of fact, the right one; if we do not restrict lon-dnbh to the precise meaning of \"black elk.\" Mr. J. F. Campbell not only tells us that certain \"great antlered deer \"were formerly hunted by the Feens, but he also points out Sutherlandshire traditions which tell how witches and fairies used to milk the female deer. And this statement forms one of the reasons which lead him to believe that Fairies, Picts, and Lapps were practically one people; for his deduction therefrom is \" Fairies, then, milked deer, as Lapps do.\" Now, the point of this is that the deer milked by the Lapps is the reindeer, and not any variety of deer now existing in the British Islands. Mr. Campbell's further reference to \"a story published by Grant Stewart, in which a ghost uses a herd of deer to carry her furniture,\" quite bears out his belief that the reindeer was domesticated, as well as hunted, by the little people. And it is an actual historical fact that the reindeer was hunted in Caithness so recently as the twelfth century. In a very full and exhaustive \"Notice of Remains of the Rein-Deer, Cervus tarandus, found in Ross-shire, Sutherland, and Caithness,\"1 the late Dr. John A. Smith, Sec. S. A., Scot, has pointed out that the seventeenth-century historian, Torfaeus, mentions that it was the custom of two earls of Orkney, during the twelfth century, to cross over to Caithness from the Orkneys, for the purpose of hunting the roe-deer and the reindeer. Dr. Smith adds that the correctness of Torfeus' statement having been at one time called...",
  "genres": [],
  "author": "David MacRitchie",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/20283422-the-testimony-of-tradition"
}