{
  "title": "The 39 Clues - Clues: Alcatraz Island, Aloe, Amber, Barley, Blood, Bone, Branch Serums, Cahill Timeline, Cairo, Egypt, Calcium Carbonate, Card Combos, Card Packs, Charlie Wallace, Clover, Clue Key, Clue Symbols, Cocoa, Copper",
  "description": "This book consists of articles from Wikia or other free sources online. Pages: 56. Chapters: Alcatraz Island, Aloe, Amber, Barley, Blood, Bone, Branch Serums, Cahill Timeline, Cairo, Egypt, Calcium Carbonate, Card Combos, Card Packs, Charlie Wallace, Clover, Clue Key, Clue Symbols, Cocoa, Copper, Crestwood Cemetery, Dan and Amy's Alliances, David Livingstone, Easter Island, Ekaterina Serum, False Clues, Gideon Cahill, Gold, Grace's Will, Henry Morton Stanley, Honey, Hydrogen, Iodine, Iron Solute, Ivan Kleister, Janus Serum, Jonah Wizard, Katherine Cahill, King Cobra Venom, Lead, Lily, Lucian Serum, Luke Cahill, Mace, Madagascar, Madrigal Gauntlet, Madrigal Serum, Magnesium, Marie Curie, Master Serum, Mercury, Mint, Missions, My Clues, Myrrh, Paris, France, Pearl, Pepper, Philosopher's Stone, Phosphorus, Platinum, Quartz, Rosemary, Salt, Scotland, Serum Formula, Silk, Silver, Storm Warning, Sulfur, The 39 Clues Website, The Bermuda Triangle, The Black Circle, The Clues Chart, The Eiffel Tower, The Flying Lemur, The Maze of Bones, The Sword Thief, The Tower of London, The Viper's Nest, Tomas Clues, Tungsten, Uranium, Vinegar, Water, William Shakespeare, World War II, Wormwood, Ye Olde Nessie Shack, Zinc. Excerpt: Alcatraz Island is a small island off the coast of California. There used to be a prison there. It is also containing the Tomas Clue Wormwood is hidden here. It is abandoned by prisoners now but is still famous for housing the murderer Al Capone. The Tomas Branch uses it as a stronghold, and they hold the Clue Wormwood in it. Aloe Symbol To earn this Clue, you must add the 6 cards from The Black Circle. The Lucians have the clue one gram of melted amber in the Amber Room. Amy and Dan Cahill found the clue with help of Anastasia's daughter, Nataliya. After finding the clue Dan and Amy shared the it with the Holt family. It was in the clock that could be opened The Amber Symbol Barley is a Madrigal clue and is part of Gideon Cahill's master serum. The...",
  "genres": [],
  "author": "Source Wikia",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/20292955-the-39-clues---clues"
}