{
  "title": "Twisted",
  "description": "New York Times bestselling novelist Andrea Kane leads you down a dark and twisted alleyway, littered with drugs, kidnapping, and murder. Navigating expertly between the mind of a deranged serial killer and the FBI special agents racing to end his lethal spree, Kane delivers a complex, unforgettable story based on extensive research with the FBI and its Crisis Negotiation and Behavioral Analysis Units. Twisted is Kane's most accomplished novel yet.Who will be next?Former FBI Special Agent Sloane Burbank survived a life-threatening injury sustained in the line of duty, only to face leaving a job she loves in order to recuperate. As an independent consultant, she now uses her specialized skills to train law enforcement and private organizations in crisis resolution. But when one of her closest childhood friends mysteriously disappears, and the woman's devastated parents beg for her help, Sloane takes the case—even though her ex-lover Derek Parker is the FBI agent in charge.Special Agent Derek Parker, now assigned to the Asian Criminal Enterprise Task Force in the FBI's New York Field Office, has no time to spare for a year-old case he sees as a dead end—especially since it would mean working with a woman he never expected to see again. He's pursuing the leader of a Chinese gang and trying to solve a series of grisly murders in Chinatown, so he initially offers Sloane the case files and minimal cooperation.But as more women disappear and others turn up brutally murdered, Derek's priorities shift, and he and Sloane come to the sickening realization that these random crimes are linked to the same crazed killer. No one can anticipate when he will strike again, but when Sloane becomes the target of the killer's twisted obsession, it's clear that his ultimate fantasy is even more psychotic than either of them ever imagined.",
  "genres": [
    "Romantic Suspense",
    "Mystery",
    "Suspense",
    "Romance",
    "Thriller",
    "Fiction",
    "Contemporary"
  ],
  "author": "Andrea Kane",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/2029076.Twisted"
}