{
  "title": "Freedoms Ferment Phases of American Social History from the Colonial Period to the Outbreak of the Civil War",
  "description": "Freedom's Ferment was first published in 1944. Minnesota Archive Editions uses digital technology to make long-unavailable books once again accessible, and are published unaltered from the original University of Minnesota Press editions.In this historical synthesis of men and movements, Alice Felt Tyler shows in action the democratic faith of the young American republic. She tells the stories of the reform movements and social and religious experiments characteristic of the early half of the nineteenth century.The early efforts toward social and economic equality — later engulfed in the urgent issues of the Civil War—are here depicted and interpreted in their relation to the history of American thought and action.Freedom's Ferment divides the movements of the early 1800's into two groups: the cults and utopias of varied origins and the humanitarian crusades. A wave of revivalistic religions swept the country. Here is the story of the Millerites, who believed the end of the world would come on October 22, 1844, of the Spiritualists, Rappites, the Mormons, the Shakers.Many experiments in communal living were instituted by religious groups, but others were entirely social in concept. Life at Brook Farm, in Robert Owen's colony, in the Oneida Community, and a score of others, is interestingly reconstructed.Humanitarian reforms and crusades represent the other phase of the movements. Tyler, \"exasperated by all the silly twaddle being written about the eccentricities\" of the early American republic, shows these movements and the leaders—event the crackpots—as manifestations of the American creed of perfectibility.Prison and educational reforms, work for delinquents and unfortunates, crusades for world peace, temperance, and women's rights flourished. All to be overshadowed by the antislavery movement and submerged temporarily by the Civil War.Freedom's Ferment pictures the days when the pattern for the American way of life and the fundamentals of the American faith were being set by crusaders who fought for righteousness. The changes in out social picture have altered the form of the humanitarian movements but not the purpose.Interpretative and critical, the book show the ferment of the period and the urge to reform, found in every phase of life, to be the result of the fusion of religious freedom and political democracy.",
  "genres": [
    "History",
    "American History"
  ],
  "author": "Alice Felt Tyler",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/2029114.Freedoms_Ferment_Phases_of_American_Social_History_from_the_Colonial_Period_to_the_Outbreak_of_the_Civil_War"
}