{
  "title": "The History and Antiquities of Tallaght, County Dublin",
  "description": "This historic book may have numerous typos and missing text. Purchasers can usually download a free scanned copy of the original book (without typos) from the publisher. Not indexed. Not illustrated. 1877 edition. ... HISTORY OF TALLAGHT. I HE earliest notice we have of Tamlacht, or Tallaght, is in the account of the destruction of the colony of Parthalon by the first recorded plague or pestilence, as related in the Annals of the Four Masters to have taken place in the year A.m. 2820. The entry by those Annalists is--\" Nine thousand of Partholan's people died in one week, on Sean Mhagh Ealta Edair, viz., 5000 men and 4000 women, whence is named Tamlacht Muntire Parthalon, now called Tallaght, near Dublin.\" The word Tamh means an epidemic pestilence; and the term Tamlacht, the plague monument, which frequently enters into topographical names in Ireland, signifies a place where a number of persons cut off by pestilence were interred together. This destruction of the colony of Parthalon, which is said to have occurred in Sean Mhagh Etair, or the old plain of the Valley of the Flocks, stretching between Ben Edair (Howth) and Tallaght, on which the city of Dublin now stands, is thus mentioned in the \" Book of Invasions,\" contained in the \" Book of Leinster\"--\"In Sean Mhagh Etair, Parthalon became extinct in a thousand men and four thousand women of one week's mortality, or Tamh.\" This is the oldest manuscript account of the pestilence we now possess. This Partholanus, son of Leara, son of Sru, son of Easrue, son of Framant, son of Fartholda, son of Magog, son of Japhet, son of Noah, having slain his father and mother in Greece, in order to obtain the crown, and hinder his eldest brother of the succession, began his voyage from the country of Migdonia, in Greece, and steered by Sicily, and on until he came into the Irish Sea, and landed upon the 14th May, at a place called Inbher Sceine, in the west of Munster. His posterity continued in Ireland about three...",
  "genres": [],
  "author": "William Domville Handcock",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/20269072-the-history-and-antiquities-of-tallaght-county-dublin"
}