{
  "title": "Enchanted India",
  "description": "This historic book may have numerous typos and missing text. Purchasers can usually download a free scanned copy of the original book (without typos) from the publisher. Not indexed. Not illustrated. Excerpt: ... comes into view in huge white masses--docks, and factories with tall chimneys; and coco-palms, in long lines of monotonous growth, overshadow square houses devoid of style. As we go nearer, gothic towers are distinguishable among the buildings--faint reminiscences of Chester, clumsily revived under the burning light of white Asia. BOMBAY In the spacious harbour, where a whole fleet of steamships lies at anchor, a swarm of decked boats are moving about, sober in colour, with the bows raised very high in a long peak, and immense narrow sails crossed like a pair of scissors, and resembling a seagull's wings. The noise in the dock is maddening. The Customs, the police, the health-officers, all mob the voyager with undreamed-of formalities, such as a paper to be signed declaring that he has but one watch and one scarf-pin, and that their value is in proportion to the wearer's fortune. Then, again, the dispersal of the luggage, which must be fished out at another spot amid the yelling horde of coolies who rush at the trunks and use the portmanteaus as missiles, till at last we are in the street. Under the blinding sunshine reflected from the whitewashed houses, an incredibly mixed crowd, squeezed against the railings of the custom-house wharf, stands staring at the new arrivals. Natives, naked but for a narrow loin-cloth rolled about their hips; Parsees in long white tunics, tight white trousers, and on their heads hideous low square caps of dark wax-cloth, pursuing the stranger with offers of money-changing; Hindoos, clad in thin bright silk, and rolls of light-hued muslin on their head; English soldiers, in white helmets, two of whom stare at me fixedly, and exclaim that, \"By Jo', Eddy has missed this steamer!\" There are closed carriages, ...",
  "genres": [],
  "author": "Bojidar Karageorgevitch",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/20276027-enchanted-india"
}