{
  "title": "Matisse the Master: The Conquest of Colour, 1909-1954",
  "description": "“If my story were ever to be written down truthfully from start to finish, it would amaze everyone,” wrote Henri Matisse. It is hard to believe today that Matisse, whose exhibitions draw huge crowds worldwide, was once almost universally reviled and ridiculed. His response was neither to protest nor to retreat; he simply pushed on from one innovation to the next, and left the world to draw its own conclusions. Unfortunately, these were generally false and often damaging. Throughout his life and afterward people fantasized about his models and circulated baseless fabrications about his private life.Fifty years after his death, Matisse the Master (the second half of the biography that began with the acclaimed The Unknown Matisse ) shows us the painter as he saw himself. With unprecedented and unrestricted access to his voluminous family correspondence, and other new material in private archives, Hilary Spurling documents a lifetime of desperation and self-doubt exacerbated by Matisse’s attempts to counteract the violence and disruption of the twentieth century in paintings that now seem effortlessly serene, radiant, and stable.Here for the first time is the truth about Matisse’s models, especially two his pupil Olga Meerson and the extraordinary Lydia Delectorskaya, who became his studio manager, secretary, and companion in the last two decades of his life.But every woman who played an important part in Matisse’s life was remarkable in her own right, not least his beloved daughter Marguerite, whose honesty and courage surmounted all ordeals, including interrogation and torture by the Gestapo in the Second World War.If you have ever wondered how anyone with such a tame public image as Matisse could have painted such rich, powerful, mysteriously moving pictures, let alone produced the radical cut-paper and stained-glass inventions of his last years, here is the answer. They were made by the real Matisse, whose true story has been written down at last from start to finish by his first biographer, Hilary Spurling.",
  "genres": [
    "Art",
    "Biography",
    "Nonfiction",
    "History",
    "France",
    "Art History",
    "Biography Memoir"
  ],
  "author": "Hilary Spurling",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/202795.Matisse_the_Master"
}