{
  "title": "Chesapeake Bay Cooking: The Companion Cookbook to the Public Television Series",
  "description": "Loosen your belts and get ready to chow down on a pile of steamed blue crabs, dine on a Maryland plantation-style feast, or graze through the stalls of Baltimore's Cross Street Market with television host and \"Culinary Ambassador of the Bay,\" John Shields.  In this companion cookbook to the 26-part public television series, take a delicious tour with Shields along the Chesapeake's 4,600 miles of pristine coastline and through the bountiful farmlands of Delaware, Maryland, and Virginia.In Chesapeake Bay Cooking with John Shields, you will learn how to prepare 190 recipes from this mid-Atlantic region's culinary fare, including rockfish and gumbos, duck and Maryland fried chicken, beaten biscuits and the famous Lady Baltimore cake.  Best of all, you'll learn everything you need to know about the undisputed star of Chesapeake cuisine--crabs. Shields's book includes plenty of helpful crabformation--how to buy, cook, hammer, and eat blue crabs, why you never eat the \"devil,\" and how to tell the difference between \"jimmies\" (male crabs) and \"sooks\" (female crabs).With John Shields as your guide, drop in on the locals, who, for generations, have made this region one of the most popular destinations on the East Coast. Visit Crisfield, home to the Miss Crustacean beauty pageant, where you can sample the crispy, sweet, fried soft-shell crabs. Don't miss the rambunctious two-day chicken festival on the Delmarva Peninsula, where \"there's a whole lot of frying chicken going on.\"  And, since Shields always loves a party, you'll join the Biddlecomb family for a real Virginia-style Fourth of July, where the menu includes Miss Lorraine's Barbecued Chicken, Lady Liberty Seafood Salad, and Pickled Watermelon Rind.  And you can't leave Baltimore without visiting Little Italy to share a meal of Rockfish Braised in Gravy with home cook Carmella Sartori.Here are satisfying foods, easy-to-prepare recipes, and the people who've kept Chesapeake cuisine cooking for centuries--all brought home to you by the region's favorite son, John Shields.",
  "genres": [
    "Cookbooks",
    "Cooking"
  ],
  "author": "John Shields",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/2030197.Chesapeake_Bay_Cooking"
}