{
  "title": "The Forest: An idylic Australian setting harbouring a criminal secret",
  "description": "Money laundering, drugs, international crime, smuggling, fraud and murder ... all this hidden behind the bucolic backdrop of a rich country estate, an established timber mill, a cozy rural village and a magnificent forest. Saskia van Essen has to dig deep to unearth the rot infecting this home of family and friends.In this adventure, Saskia travels into the mountains of eastern Australia. She takes a job to help restructure a well-established timber mill, thinking her main task is to straighten out some financial mismanagement and modernise the organisation. Instead, she stumbles into the clutches of international crime. She needs all her cyber and observational skills, as well as her mountain biking skills to save the organisation, her new-found friends and herself.\nDownload now!\nPRAISE FOR \"The Forest\"(BEST BOOK Chanticleer Book Reviews - 5 stars! ) \"The Forest\", a slow-burning mystery ... follows a young investigator unravelling a mystery that sits deep in the core of a private logging organization ... \"The Forest\" is an eye-opener for mystery readers and the business world alike.(Prairies Book Reviews) An exhilarating and thrilling read ... The warmth and complexities of family connections, buried mysteries, and a persistent protagonist all combine to create an enthralling tale ... atmospheric and thoroughly engaging.(OnLineBookClub review - Five stars)The central characters in this book are so easy to love and connect to ... The author has a remarkable ability to capture the reader's attention. Her ability to describe scenes engagingly and arouse curiosity contribute to the factors that make this book difficult to put down. Readers will always be curious to know what will happen next.",
  "genres": [
    "Drama",
    "Novels",
    "Contemporary",
    "Book Club"
  ],
  "author": "Miriam Verbeek",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/203024688-the-forest"
}