{
  "title": "World Odyssey",
  "description": "Set in the nineteenth century, World Odyssey (The World Duology, #1) follows the fortunes of three young travelers as each embarks on an epic journey. Their dramatic adventures span sixteen years and see them engage with Native American Indians, Barbary Coast pirates, Aborigines, Maoris and Pacific Islanders as they travel around the world – from America to Africa, from England to the Canary Islands, to Australia, New Zealand and Samoa.Ambitious American adventurer Nathan Johnson’s journey begins when he runs away to sea to escape a violent father. After surviving a shipwreck and enslavement by one of the indigenous tribes of America’s northwest, his stocks rise and he becomes a successful trader. When Nathan decides to visit Fiji to trade muskets to the natives, he doesn’t know it but his fortunes are about to change again.Sheltered English missionary Susannah Drake’s journey begins after she agrees to accompany her clergyman father to Fiji to help him run a mission station there. They endure a nightmare voyage they’re lucky to survive. When Susannah finds herself sexually attracted to a young crewmember, she is forced to choose between her forbidden desires and the life her father has mapped out for her.Irrepressible Cockney Jack Halliday’s journey begins when he steals hemp from an unscrupulous employer who owes him outstanding wages. For this he’s sentenced to seven years’ hard labor in the British penal colony of New South Wales. Jack escapes to Fiji only to be tracked down by a bounty hunter employed by the British Government to round up escaped convicts.After traveling thousands of miles and experiencing the best and worst that life can offer, these three disparate individuals eventually end up in the remote archipelago of Fiji, in the South Pacific, where their lives intersect.",
  "genres": [
    "Historical Fiction",
    "Adventure",
    "Romance",
    "Travel",
    "Africa",
    "M M Romance",
    "Young Adult"
  ],
  "author": "Lance Morcan",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/20300866-world-odyssey"
}