{
  "title": "Ajak's Song",
  "description": "South Sudan has emerged from eons of oppression and exploitation to become the world's newest nation. South Sudan has many treasures; it is a land of immense natural riches and amazing cultural diversity. The South Sudanese have proven to have incredible strength and resilience. But South Sudan has the world's highest rates of tropical diseases, maternal and fetal deaths, and untreated injuries. It is a country virtually without modern medical care.Dr. Ken Waxman is an American surgeon. In 2010 he joined Doctors without Borders and traveled to a South Sudanese village near the Northern border to help develop a surgical facility, in anticipation of the increasing violence that was certain to ensue as South Sudan voted for independence. Ajak's Song is the story of that journey. Why should you read Ajak's Song? Here are some compelling • Dr. Waxman invites you on his journey into the heart of sub-Saharan Africa. Share his awe in experiencing a land that is at once terribly hostile and ineffably beautiful.• Join Dr. Waxman as he struggles to provide medical and surgical care across great cultural divides.• Meet inspiring South Sudanese, such as Awok, a woman with a tumor, Mou and Ajak, two children who fight to avoid amputations from terrible leg injuries, and Malueth Angui, a young Dinka who serves as Dr. Waxman's assistant.• Share Dr. Waxman's anguish as he witnesses the human tragedy of some of the terrible diseases of South Sudan, and the suffering they cause.• Join in an effort to help South Sudan improve medical care. With each purchase of Ajak's Song, you will support an organization with a mission to educate young South Sudanese physicians, the future leaders for South Sudan's healthcare revolution.*Proceeds from sales of Ajak's Song will be donated to the nonprofit organization Future Doctors for South Sudan (www.futuredoctors.org).",
  "genres": [],
  "author": "Kenneth Waxman",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/20294324-ajak-s-song"
}