{
  "title": "Lost in transliteration: The tolerance of unintelligibility in Chinese bibliographic records in Western libraries.",
  "description": "This dissertation uses personal names to compare the differences between information provided in Chinese characters and information provided by the translation of those characters into the Roman alphabet. In view that the written representation of Chinese names in cenemic and pleremic systems is certain to bring about distinct linguistic results, a historical account is provided to review the problems of transliterating Chinese names that has evolved over time. By focusing on the development of incorporating Chinese records into Western catalog, the review not only sheds some light on the inherent capability and capacity of each script, it also helps explain why script is by itself a core technology in the formation of a message, and, how in the words of Harold Innis, the practice of romanizing Chinese names exerts the script's \"bias\" in communication. The script issues can also be observed from how information is prepared and produced to serve the public. To systematically record the changes that resulted in rendering names in different time periods, a four-year survey project collected data from a Chinese author catalog in a major Chinese collection in a major research university, the University of Wisconsin. Analyses show that technical gaps consistently occur for technologies or resources associated with processing alphabetic records and with records in the Chinese characters and that mainstream technologies used in the Western collections have not always been suitable for the non-roman language materials through the decades. Results from the survey also show that the ever-changing information technologies placed the Chinese collection at a relative disadvantage until 2005. The presentation of a Chinese name in the western bibliographic practice presents a prototype reflecting a unique medium-content relationship. In this tricky relationship, the role of script is entwined; it could be the medium in one construct, but also be the content in another. Distinguishing the two constructs is vital because it explains how certain media silently monopolized the name business; it tells why transliterating Chinese names in Roman alphabet makes many Chinese bibliographic records unintelligible.",
  "genres": [],
  "author": "Jyh-Ming Yang",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/11129023-lost-in-transliteration"
}