{
  "title": "Winter at the Door",
  "description": "Perfect for fans of Jenny Milchman, Linda Castillo, and Lisa Gardner—the first book in a suspenseful new crime thriller series featuring the tough but haunted police chief Lizzie Snow, a big-city cop with a mission, taking on a small town with a dark side. Moving from Boston to remote Bearkill, Maine, isn’t homicide cop Lizzie Snow’s idea of a step up. But breaking away from tragedy and personal betrayal is at least a step in the right direction. Her dead sister’s fate still torments her, as does her long-missing niece’s disappearance. Lizzie hopes to find the mysteriously vanished child here, amid the coming ice and snow. But in the Great North Woods, something darker and more dangerous than punishing winter is also bound for Bearkill. The town is a world apart in more than distance—full of people who see everything, say little, and know more than they’ll share with an outsider. The only exceptions are the handsome state cop who once badly broke Lizzie’s heart and desperately wants another chance—and Lizzie’s new boss, sheriff Cody Chevrier, who’s counting on her years of homicide experience to help him solve his most troubling case, before it’s too late. A rash of freak accidents and suicides has left a string of dead men—all former local cops. Now the same cruel eyes that watched them die are on Lizzie—and so is the pressure to find out what sort of monster has his hooks in this town, what his ruthless game is, and just how brutally he’ll play to win. Whatever the truth is, its twisted roots lie in the desolate backwoods of Allagash County: where the desperate disappear, the corrupt find shelter, and the innocent lose everything. It’s there that a cunning and utterly cold-blooded killer plans the fate of the helpless lives at his mercy—one of whom may be the lost child Lizzie will do anything to save. As a blizzard bears down, and Bearkill’s dark secrets claw their way to the surface, Lizzie gears up for a showdown that could leave the deep, driven snow stained blood red.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Audiobook",
    "Mystery Thriller",
    "Suspense",
    "Crime"
  ],
  "author": "Sarah Graves",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/20307068-winter-at-the-door"
}