{
  "title": "The Aesthetics of Disappearance",
  "description": "Virilio himself referred to his 1980 work The Aesthetics of Disappearance as a \"juncture\" in his thinking, one at which he brought his focus onto the logistics of perception -- a logistics he would soon come to refer to as the \"vision machine.\" If Speed and Politics established Virilio as the inaugural -- and still consummate -- theorist of \"dromology\" (the theory of speed and the society it defines), The Aesthetics of Disappearance introduced his understanding of \"picnolepsy\" -- the epileptic state of consciousness produced by speed, or rather, the consciousness invented by the subject through its very absence: the gaps, glitches, and speed bumps lacing through and defining it. Speed and Politics defined the society of speed; The Aesthetics of Disappearance defines what it feels like to live in the society of speed.\"I always write with images,\" Virilio has claimed, and this statement is nowhere better illustrated than with The Aesthetics of Disappearance. Moving from the movie theater to the freeway, and from Craig Breedlove's attainment of terrifying speed in a rocket-power car to the immobility of Howard Hughes in his dark room atop the Desert Inn, Virilio himself jump cuts from such disparate reference points as Fred Astaire, Franz Liszt, and Adolf Loos to Dostoyevsky, Paul Morand, and Aldous Huxley. In its extension of the \"aesthetics of disappearance\" to war, film, and politics, this book paved the way to Virilio's follow-up: the celebrated study, War and Cinema.This edition features a new introduction by Jonathan Crary, one of the leading theorists of modern visual culture.Foreign Agents series. Distributed for Semiotext(e)",
  "genres": [
    "Philosophy",
    "Theory",
    "Nonfiction",
    "Art",
    "Technology",
    "Sociology",
    "Politics"
  ],
  "author": "Paul Virilio",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/203090.The_Aesthetics_of_Disappearance"
}