{
  "title": "Joseph Smith: Rough Stone Rolling",
  "description": "Joseph Smith, America’s preeminent visionary and prophet, rose from a modest background to found the largest indigenous Christian church in American history. Without the benefit of wealth, education, or social position, he published the 584-page Book of Mormon when he was twenty-three; organized a church when he was twenty-four; and founded cities, built temples, and attracted thousands of followers before his violent death at age thirty-eight. Rather than perishing with him, Mormonism migrated to the Rocky Mountains, flourished there, and now claims millions of followers worldwide.In Joseph Smith: Rough Stone Rolling , Richard Bushman, an esteemed American cultural historian and a practicing Mormon, tells how Smith formed a new religion from the ground up. Moving beyond the popular stereotype of Smith as a colorful fraud, the book explores the inner workings of his personality–his personal piety, his temper, his affection for family and friends, and his incredible determination. It describes how he received revelations and why his followers believed them.Smith was a builder of cities. He sought to form egalitarian, just, and open communities under God and laid out a plan for ideal cities, which he hoped would fill the world. Adopted as the model for hundreds of Mormon settlements in the West, Smith’s urban vision may have left a more lasting imprint on the landscape than that of any other American.He was controversial from his earliest years. His followers honored him as a man who spoke for God and restored biblical religion. His enemies maligned him as a dangerous religious fanatic, an American Mohammad, and drove the Mormons from every place in which they settled. Smith’s ultimate assassination by an armed mob raises the question of whether American democracy can tolerate visionaries.The book gives more attention to Joseph Smith’s innovative religious thought than any previous biography. As Bushman writes, “His followers derived their energy and purpose from the religious world he brought into being.” Some of the teachings were controversial, such as property redistribution and plural marriage, but Smith’s revelations also delved into cosmology and the history of God. They spoke of the origins of the human personality and the purpose of life. While thoroughly Christian, Smith radically reconceived the relationship between humans and God. The book evaluates the Mormon prophet’s bold contributions to Christian theology and situates him culturally in the modern world.Published on the two hundredth anniversary of Smith’s birth, Joseph Smith: Rough Stone Rolling is an in-depth portrayal of the mysterious figure behind one of the world’s fastest growing faiths.",
  "genres": [
    "Biography",
    "Religion",
    "History",
    "Nonfiction",
    "Lds",
    "Mormonism",
    "Church"
  ],
  "author": "Richard L. Bushman",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/2030931.Joseph_Smith"
}