{
  "title": "The Birds of Pandemonium: Life Among the Exotic & the Endangered",
  "description": "Each morning at first light, Michele Raffin steps outside into the bird music that heralds another day at Pandemonium Aviaries. A full symphony that swells from the most vocal of more than 350 avian throats representing more than 40 species. “It knocks me out, every day,” she says. Pandemonium, the home and bird sanctuary that Raffin shares with some of  the world’s most remarkable birds, is a conservation organization dedicated to saving and breeding birds at the edge of extinction, with the goal of eventually releasing them into the wild. In The Birds of Pandemonium,  she lets us into her world--and theirs. Birds fall in love, mourn, rejoice, and sacrifice; they have a sense of humor, invent, plot, and cope. They can teach us volumes about the interrelationships of humans and animals. Their stories make up the heart of this book. There’s Sweetie, a tiny quail with an outsize personality; the inspiring Oscar, a disabled Lady Gouldian finch who can’t fly but finds a brilliant way to climb to the highest perches of his aviary to roost. The ecstatic reunion of a disabled Victoria crowned pigeon, Wing, and her brother, Coffee, is as wondrous as the silent kinship that develops between Amadeus, a one-legged turaco, and an autistic young visitor. As we come to know the individual birds, we also come to understand how much is at stake for many of these species. One of the aviary’s greatest success stories is breeding the gorgeous green-naped pheasant pigeon, whose home in the New Guinea rainforest is being decimated. Thanks to efforts at Pandemonium, these birds may not share the same fate as the now-extinct dodo.",
  "genres": [
    "Nonfiction",
    "Birds",
    "Animals",
    "Nature",
    "Science",
    "Memoir",
    "Biography"
  ],
  "author": "Michele Raffin",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/20312456-the-birds-of-pandemonium"
}