{
  "title": "Walt Disney's Donald Duck: Lost in the Andes",
  "description": "Carl Barks Donald Duck and Uncle Scrooge comics are considered among the greatest artistic and storytelling achievements in the history of the medium. After serving a stint at the Walt Disney studios as an in-betweener and a gag-man, Barks began drawing the comic book adventures of Donald Duck in 1942. He quickly mastered every aspect of cartooning and over the next nearly 30 years created some of the most memorable comics ever drawn as well as some of the most memorable characters: Barks introduced Uncle Scrooge, the charmed and insufferable Gladstone Gander, the daffy inventor Gyro Gearloose, the bumbling and heedless Beagle Boys, the Junior Woodchucks, and many others. Barks alternated between longish, sprawling 20- or 30-page adventure yarns filled with the romance of danger, courage, and derring-do, whose exotic locales spanned the globe, and shorter stories that usually revolved around crazily ingenious domestic squabbles between Donald and various members of the Duckburg cast. Barks s duck stories, famously enjoyed equally by both children and adults, are both evanescent celebrations of courage and perseverance and depictions of less commendable traits greed, resentment, and one-upmanship. Our initial volume begins when Barks had reached his peak 1948-1950. Highlights include: The title story, Lost in the Andes (Barks s own favorite). Donald and the nephews embark on an expedition to Peru to find where square eggs come from only to meet danger in a mysterious valley whose inhabitants all speak with a southern drawl, and where Huey, Dewey, and Louie save Unca Donald s life by learning how to blow square bubbles! Two stories co-starring the unbearably lucky Gladstone, including the epic Race to the South Seas, as Donald and Gladstone try to win Uncle Scrooge s favor by being the first to rescue him from a desert island. Two Christmas stories, including The Golden Christmas Tree, one of Barks s most fantastic stories that pits him and the nephews against a witch who wants to destroy all the Christmas trees in the world. In other stories, Donald plays a TV quiz show contestant and ends up encased in a giant barrel of \"Shaky-Jell,\" a truant officer who matches wits with his nephews, and a ranch hand who outwits cattle rustlers. These new editions feature meticulously restored and re-colored pages in a beautifully designed, affordable format geared to the mainstream book buyer. Discover the genius of Carl Barks!",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Humor",
    "Fiction",
    "Adventure",
    "Comic Book",
    "Fantasy"
  ],
  "author": "Carl Barks",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/11129118-walt-disney-s-donald-duck"
}