{
  "title": "The Distance",
  "description": "A dark, ultra-contemporary and relentlessly paced debut thriller about a London society woman trying to put her secret criminal past behind her--and the hit man who comes to her with an impossible job she can't refuse.     Charlotte Alton is an elegant socialite. But behind the locked doors of her sleek, high-security apartment in London's Docklands, she becomes Karla . Karla's business is information. Specifically, making it disappear. She's the unseen figure who, for a commanding price, will cover a criminal's tracks. A perfectionist, she's only made one slip in her several years ago she revealed her face to a man named Simon Johanssen, an ex-special forces sniper turned killer-for-hire. After a mob hit went horrifically wrong, Johanssen needed to disappear, and Karla helped him. He became a regular client, and then one day, she stepped out of the shadows for reasons unclear to even herself. Now, after a long absence, Johanssen has resurfaced with a job, and he needs Karla's help again. The job is to take out an inmate--a woman--inside an experimental prison colony. But there's no record the target ever existed. That's not the only the criminal boss from whom Johanssen has been hiding is incarcerated there. That doesn't stop him. It's Karla's job to get him out alive, and to do that she must uncover the truth. Who is this woman? Who wants her dead? Is the job a trap for Johanssen or for her? But every door she opens is a false one, and she's getting desperate to protect a man--a killer--to whom she's inexplicably drawn. Written in stylish, sophisticated prose, The Distance is a tense and satisfying debut in which every character, both criminal and law-abiding, wears 2 faces, and everyone is playing a double game.",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Suspense",
    "Audiobook",
    "Mystery Thriller",
    "Crime"
  ],
  "author": "Helen Giltrow",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/20307069-the-distance"
}