{
  "title": "Compound Fracture",
  "description": "Bestselling and award-winning author Andrew Joseph White returns with a queer Appalachian thriller, that pulls no punches, for teens who see the failures in our world and are pushing for radical change.A gut-wrenching story following a trans autistic teen who survives an attempted murder, only to be drawn into the generational struggle between the rural poor and those who exploit them.On the night Miles Abernathy—sixteen-year-old socialist and proud West Virginian—comes out as trans to his parents, he sneaks off to a party, carrying evidence that may finally turn the tide of the blood feud plaguing Twist Creek: Photos that prove the county’s Sheriff Davies was responsible for the so-called “accident” that injured his dad, killed others, and crushed their grassroots efforts to unseat him.The feud began a hundred years ago when Miles’s great-great-grandfather, Saint Abernathy, incited a miners’ rebellion that ended with a public execution at the hands of law enforcement. Now, Miles becomes the feud’s latest victim as the sheriff’s son and his friends sniff out the evidence, follow him through the woods, and beat him nearly to death. In the hospital, the ghost of a soot-covered man hovers over Miles’s bedside while Sheriff Davies threatens Miles into silence. But when Miles accidentally kills one of the boys who hurt him, he learns of other folks in Twist Creek who want out from under the sheriff’s heel. To free their families from this cycle of cruelty, they’re willing to put everything on the line—is Miles?A visceral, unabashedly political page-turner that won’t let you go until you’ve reached the end, Compound Fracture is not for the faint of heart, but it is for every reader who is ready to fight for a better world.",
  "genres": [
    "Horror",
    "Queer",
    "Young Adult",
    "LGBT",
    "Thriller",
    "Fiction",
    "Transgender"
  ],
  "author": "Andrew Joseph White",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/203166772-compound-fracture"
}