{
  "title": "Detectives & Desires and Choices Collection",
  "description": "Detectives & Desires and Choices Collection Detectives &Desires #1 - Intimate Knowledge Part 1& 2 How long can Detective Raisa Gordon resist her undercover target Leo Gold? Especially when he has intimate knowledge about her desires and isn't afraid to use it. Will the FBI’s plan to use his passion for her to bust the entire Gold operation wide open succeed? Or will Raisa surrender to her treacherous desires? A series that will unfold over multiple volumes ranging from 10,000 to 20,000 words each. Intimate Knowledge is an erotic romance with explicit sexual content with elements of BDSM. It has a delectable slow build to consummation Detectives & Desires #2 - Her Keeper Part I&2 The feud between Detective Rick Andrews and Sara Michaels is legendary and no one ever wants to stand in the line of fire when they go at it. Only, now Sara has crossed the line and Rick is determined to use the power her transgression grants him to lay down the law in a way she can't escape. A series that will unfold over multiple volumes ranging from 10,000 to 20,000 words each. Her Keeper is an erotic romance with explicit sexual content with elements of BDSM. It has a hot cop (two actually), sexy frisking, spanking, cuffing, a crazy, hot proposition yet to come and two people who are stubbornly in love. Choices Series The Plan - Chances & Choices Prequel Falling in love again just isn't part of the plan. It has been a rough year for Julian West and Claire Fitzpatrick. They are both struggling with the loss of a loved one. When Andrea Saunders, a Los Angeles socialite, convinces Julian to escort Claire to the Spring Charity Ball, it begins an enduring friendship. A friendship where both comfortably forget the sizzling attraction that flared between them in the first few moments of meeting. In time, that attraction re-emerges and Julian must face emotions he has spent years repressing. A 6000 word short story prequel to Chances & Choices Chances & Choices Book 1 Julian & Claire After three years in New York and a failed relationship behind her, Claire Fitzpatrick can hardly wait to get back to L.A. to her new job as senior feature writer at Choices L.A., but most of all to the security and comfort of her best friend Julian West. To her, he is the nice guy she can turn to for advice and comfort – the uncomplicated friend she can count on. Julian West has fooled Claire Fitzpatrick for years playing the platonic friend. But on her first night home, he blows his cover and suddenly Claire sees him in a whole new light. Now Julian must face emotions he has spent too long repressing. “The most romantic book I have ever read.” Ibooks 5 STARS “Get ready for fun. Oh my this is great Reading Renee 5 STARS Great Value Collection",
  "genres": [],
  "author": "Helen Karol",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/20319876-detectives-desires-and-choices-collection"
}