{
  "title": "An Unproven Concept--The Unfortunate Starwreck of the Spaceliner Titanic",
  "description": "The Confederation of Man has overseen the prosperous expansion of humanity for centuries, with the Confederation Fleet its bulwark against all that would harm it. This shield is flawed, however, with a schism between the Line and Carrier factions threatening the Fleet's ability to protect mankind against internal dissent and the possibility of external threats. In the year 3050, Fleet Admiral Malinverni has designed the battlecruiser Constitution to merge the best of both factions in the hope of forging a better future. Considered a flawed concept by all but her crew, if either Fleet faction can help it neither the Constitution nor her captain, Mackenzie Bolan, will ever get a chance to prove themselves.Aboard the starliner Titanic, Captain Abraham Herrod is confronted with the possibility emerging technology may make his craft obsolete. Convinced the Titanic’s modernity and onboard weapons makes her all but invincible, Captain Herrod takes his vessel into unknown space in an attempt to prolong the “Golden Age of Starliners.”An Unproven Concept is the truthful recounting of the Titanic’s ensuing Starwreck and the Constitution’s rush to save the starliner and her passengers. Combining unremitting action, hostile aliens, mecha, railguns, and mortal protagonists in one package, this novel provides space opera at its modern finest. It is based upon the short story \"On Their Behalf,\" an \"L. Ron Hubbard's Writers of the Future semi-finalist, and succeeds “Ride of the Late Rain” (Fall 2012 Honorable Mention) in the Vergassy Chronicles.\"This is a space opera that plays out on a grand scale, and Young conducted it with aplomb.\"--Pop Cults, the website of Geek and Alternative Culture (http://www.popcults.com/spall-sewage-...)",
  "genres": [
    "Science Fiction"
  ],
  "author": "James L. Young Jr.",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/20318143-an-unproven-concept--the-unfortunate-starwreck-of-the-spaceliner-titanic"
}