{
  "title": "Entropy",
  "description": "From the NEW YORK TIMES  and USA TODAY  bestselling author, Addison Moore :  Laken Stewart is sure of one thing—she must free her loved ones from the notorious Celestra tunnels.  Laken along with Cooper Flanders set out to free their families from the hands of the Countenance before it’s too late. Laken will do anything to assure their safety, even if it means losing the one she truly loves.  When Laken finds herself in a position that might embed her into the Countenance organization for all eternity, her faith in her ability to pull off the ultimate sacrifice wavers.  Once her old boyfriend, Wesley, realizes who he really is, and what the Counts have cost him, he’s more determined than ever to win Laken back.  Laken’s heart becomes divided, and yet she knows she must make a decision that has the power to shape all of their destinies forever.  Laken has fallen hard for Cooper, but Wesley is back, and now her heart is torn. Cooper would give up his life to protect Laken, and he might just have to. Wesley remembers everything from his true past, and he wants Laken more than ever—nothing or no one will stand in his way.    Books by Addison Moore  New Adult Romance:   Someone to Love (Someone to Love 1) Someone Like You (Someone to Love 2) Someone For Me (Spring 2014) 3:AM Kisses (3:AM Kisses 1) Winter Kisses (3:AM Kisses 2) Sugar Kisses (3:AM Kisses 3 Coming early 2014) The Solitude of Passion Beautiful Oblivion Perfect Love (A Celestra Novella)  Young Adult Romance:   Ethereal (Celestra Series Book 1) Tremble (Celestra Series Book 2) Burn (Celestra Series Book 3) Wicked (Celestra Series Book 4) Vex (Celestra Series Book 5) Expel (Celestra Series Book 6) Toxic Part One (Celestra Series Book 7) Toxic Part Two (Celestra Series Book 7.5) Elysian (Celestra Series Book 8) Ephemeral (The Countenance Trilogy 1) Evanescent (The Countenance Trilogy 2) Entropy (The Countenance Trilogy 3) Ethereal Knights (Celestra Knights)",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Young Adult",
    "Romance",
    "Angels",
    "Paranormal Romance",
    "Time Travel"
  ],
  "author": "Addison Moore",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/20321952-entropy"
}