{
  "title": "100 Best Quotes from Children's Books",
  "description": "ABOUT THE BOOK Storytelling has been around as long as humankind, although the ability to be a storyteller or history-keeper is a special gift not everyone possesses. Generations of our ancestors told oral tales of encounters with nature-with wild animals or with the land itself, real or imagined. Clans gathered around to hear of dreams or of explanations of certain \"unexplainable\" phenomena, such as thunder and lightning. These stories were often illustrated by scratching them or painting them onto cave walls or on rocks, and especially those tales of great battles against warring tribes. Some of the stories only existed as verbal histories passed from grandfathers to sons to grandsons. MEET THE AUTHOR Susan Gabrielle has had work published in The Christian Science Monitor, TheBatShat, New Verse News, and local publications, and was a finalist in the Tiny Lights Narrative Essay Contest. Her short story \"What she should have said\" was published in the Social Justice issue of the Little Patuxent Review, and she has been nominated for a Pushcart Prize for her poem \"After 10 years of War.\" She currently teaches writing and literature classes as a university instructor, and is at work on a nonfiction writers' guide. You can reach her at Susan-Gabrielle.com EXCERPT FROM THE BOOK But while storytelling itself is an ancient art form, the genre of children's literature is relatively new, and children's book publishing only came to prominence beginning in Great Britain in the 18th century. As Allen notes, \"From the time John Newbery, publisher and bookseller, decided to create books just for children in 18th-century England until the end of the 19th century, when English industry produced children's books of the highest quality, the body of children's literature that became available from England earned a growing respect throughout the literary world.\" Before that time, children were treated as miniature adults, useful only insofar as their ability to bring income to the home. Most children up to the 1800s worked on the family farm, so there was little free time for play, and since many children did not attend school, they could not read. The family may have owned a Bible, but it most likely would have been read to them by the father, perhaps after dinner.  CHAPTER OUTLINE100 Best Quotes from Children's Books + Introduction + The Beginnings of “Children's Literature” + For adults, for Children or Both? + A Move Toward Realism + ...and much more100 Best Quotes from Children's Books",
  "genres": [],
  "author": "Susan Gabrielle",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/20325816-100-best-quotes-from-children-s-books"
}