{
  "title": "End Game",
  "description": "Garrick LeBlanc never intended to fall in love with two people, but he has, and now he has to figure out what to do about it. He wants to make them happy, but is afraid he’s doing just the opposite. To make matters worse, he’s trapped in New Brunswick until the end of the hockey season, while his lovers are both in Boston.Savannah Morrison has no one but herself to blame for practically shoving Garrick into the arms of another man. After all, it was her idea that he take a lover while they are separated for the season. She loves Garrick with all her heart, but how the hell is she going to share him with Rhian?Rhian Savage used to have such a simple life. Now he’s in love, his dreams of skating on an NHL team are coming true, and he keeps spotting a strangely familiar face in the crowds. To top it all off, he has to see Savannah every day. He knows she’s Garrick’s real future, but he doesn’t have the balls to do the right thing for all of them and end it—until his life goes sideways. As usual.Now Rhian is alone, Garrick is heartbroken, and Savannah—the last person Rhian figured would object—is beating down his door.End Game, the 3rd book in the Hat Trick series, is an m/m/f romance about the three main characters in Fair Play and Two Man Advantage finding their way to their perfect ending. It features strong, supportive families that are sometimes biological, sometimes lost and then found, and always by choice. End Game can be read as a standalone, but will definitely be even better if you read Fair Play (Hat Trick Book 1) and Two Man Advantage (Hat Trick Book 2) before diving in. It is an 85,000 word m/m/f romance with no cheating, no cliffhangers, and a guaranteed HEA for everyone.",
  "genres": [
    "M M F",
    "Sports",
    "Menage",
    "Romance",
    "Hockey",
    "M M Romance",
    "Sports Romance"
  ],
  "author": "Samantha Wayland",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/20322127-end-game"
}