{
  "title": "The Captive Series Bundle #1-3",
  "description": "The first three books of the bestselling Captured Series on sale until June 9. Captured (Book 1), Renegade (Book 2), and Refugee (Book 3). The exciting conclusion, Salvation (Book 4), will be released on June 8.Book 1, Captured. Blood Slave. Captured, taken from her beloved family and woods, Aria’s biggest fear is not the imminent death facing her, but that she will be chosen as a blood slave for a member of the ruling vampire race. No matter what becomes of her though, Aria knows that she must keep her identity hidden from the monsters imprisoning her. She has already been branded a member of the rebellion, but the vampires do not know the true depth of her involvement with it, and they must never know. Though hoping for death, Aria’s world is turned upside down when a vampire named Braith steps forward to claim her. He delays her execution, but Aria knows it’s only a matter of time before he drains her, and destroys her. Especially once she learns his true identity as a prince within the royal family; the same royal family that started the war that ultimately brought down humankind, reducing them to nothing more than servants and slaves. Aria is determined to hate the prince, determined not to give into him in anyway, but his strange kindness, and surprising gentleness astonish her. Torn between her loyalties to the rebellion, and her growing love for her greatest enemy, Aria struggles to decide between everything she has ever known, and a love she never dreamed of finding.Book 2, Renegade Though she is free of the palace, rescued from her position as a blood slave, Aria is haunted by the memories of her time spent within the fortress, tormented by memories of Braith, the prince that betrayed her and shattered her heart. Every day is a struggle to get through, and the only solace she is able to find is with Max, her best friend, and fellow captive. Though Max does not understand her bond to Braith, he knows some of what she endured, and helps to ease some of the tattered pieces of her soul. Aria slowly begins to salvage the broken parts of her wounded spirit by throwing herself into the wonder of the woods she had so greatly missed, and the secure and reassuring love that Max freely gives her. Her world is thrown into a tailspin again though when a marauding group of vampires destroy the caves she had found temporary shelter in. Scattered about the forest, seeking to stay hidden and find her family, Aria is stunned when Braith, the monster that savaged her heart, reappears. Stunned by his sudden arrival in her world, Arianna is uncertain if he has come to recapture her, or to kill her for daring to escape. Book 3, Refugee Whispers, rumors, and horror stories abound about The Barrens and the strange creatures that lurk within them. Determined to find the remaining vampires that stood against his father in the war, Braith knows that it’s dangerous to enter the inhospitable land, but that they must if they are to have a chance at gaining allies to help overthrow the king. Though he once knew the powerful vampires that are rumored to reside within The Barrens, he is unsure what to expect if they succeed in finding them. He will do whatever is necessary though to ensure a future for himself and Aria. Aria is fearful of entering into the land she’s heard nothing but cautionary tales about, but she’s determined to help Braith locate the vampires that may help them with their cause. She is fascinated and amazed by the world they uncover within, one that is unlike anything she has ever seen before. However, the more immersed they become in a world that she doesn’t entirely understand, the more she realizes that it won’t be the war, or even the king that will eventually tear her and Braith apart.  It will be her.",
  "genres": [
    "Vampires",
    "Paranormal",
    "Paranormal Romance",
    "Dark"
  ],
  "author": "Erica Stevens",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/20325235-the-captive-series-bundle-1-3"
}