{
  "title": "My Vietnam, Your Vietnam",
  "description": "A chronicle of the divergent journeys of a Vietnamese father, who fled his home country in desperation, and his American-born daughter, who ventured to Vietnam as an adult, capturing the stark contrast between their perspectives as they strive to heal the long-term wounds of war refugees.In this captivating, heartfelt dual memoir, Christina Vo and her father, Nghia M. Vo, delve into themes of their identity, heritage, and the tragic multi-generational ordeals of war, with intertwined stories that present a multifaceted portrayal of Vietnam and its profound influence on shaping both familial bonds and individual identities across time.Nghia M. Vo left Vietnam in April 1975 with only the clothes on his back, following the US withdrawal of troops and the fall of Saigon. After a harrowing two month journey, he found himself in a refugee camp outside Harrisburg, Pennsylvania where he began the painful process of reconnecting with his family and rebuilding his life as a medical doctor. Christina Vo, Nghia’s daughter, grew up in the US. As a restless young adult, she felt a longing to connect with her heritage and soon moved to Hanoi in the former North Vietnam—much to her father's distress—to discover a country that had changed dramatically since the war, yet retained many of the ancient traits experienced by her ancestors.Captivating in its fluid movement and evocative depictions of place, My Vietnam, Your Vietnam offers readers a rich, multilayered exploration of Vietnam through two very distinct voices and perspectives. The memoir's exploration of healing the trauma suffered by war refugees and their families echoes far beyond the personal experience of the two authors, providing a path to discussion of reconciliation and hope.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Asia",
    "War",
    "Audiobook",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Christina Vo",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/203251042-my-vietnam-your-vietnam"
}