{
  "title": "The Aspect of Essence",
  "description": "Step into a shadowed realm with immersive world-building and character arcs that evolve across the series. Experience multiple slowburn romances, intricate magic systems, unique bonds, jaw-dropping plot twists, and kick-your-feet banter.\nA half-breed princess is torn from her throne and conscripted to a military academy where the sadistic shadow-wielding commander targets her the moment she arrives. A broken healer is legally bound to increase a dying population, but his servitude takes a darker turn.A relentless villain with knowledge of the realm's darkest secrets will sacrifice everything to protect his race—no matter the cost.For over a millennium, the elves have concealed their powers.Until now.Since arriving on the mortal shores, the elves have systematically colonized the primitive human race. As subjugated peasants, the mortals toil to supply the elven realm with riches.The elves’ magic has degraded their race to a point where they have been rendered infertile. A hundred years ago, they resorted to interbreeding with humans in an effort to preserve their species.In the elven realm, Jassyn has spent his life both researching the fertility crisis and being forced to produce offspring. His existence balances on a narrow precipice between solving mysteries of the elves’ infertility or succumbing to his handlers’ maltreatment. A new assignment—tutoring a half-breed princess in a human realm—promises a temporary relief. But he soon discovers the real reason for his presence.Serenna, Jassyn’s new pupil, has earned the right to leave the mortal realm to join the elven courts—everything she's ever dreamed of. Or so she thought. Her anticipated life as a noble takes an unexpected turn when a monstrous race emerges, threatening the existence of all. She learns that not only do half-breeds like her and Jassyn possess magic, but that the elves have suppressed all knowledge of their powers.Instead of joining the ranks of the elven noble houses, Serenna is conscripted to a military academy for half-breeds. In a race for survival, she must learn how to wield Essence before being thrown on the front lines.But the shadow-wielding commander—Prince Vesryn, an enigmatic male whose sharp tongue and hidden motives make him as dangerous as he is captivating—doesn't make it easy and ruthlessly challenges her at every turn. With the imminent threat of war, Serenna has no choice but to manifest her power while enduring the prince's relentless, infuriating attention. Meanwhile, Jassyn strives to protect her from the prince, but his forced servitude takes a darker turn, leading him down a destructive path.Enjoyed by fans of A Court of Thorns and Roses, Crowns of Nyaxia, The Empyrean, and Throne of Glass. If you admired Sansa Stark and Nesta's character growth, fell hard for Rhysand’s charm in A Court of Mist and Fury, and can’t resist an anti-hero with Kylo Ren’s dark allure, The Aspect of Essence is your next obsession!\nPlease be aware that this series is intended for adults. Reading guidance can be found in the sample listed at the front of the novel.",
  "genres": [
    "Fantasy",
    "Romantasy",
    "Fantasy Romance",
    "Romance",
    "Fae",
    "Enemies To Lovers",
    "Magic"
  ],
  "author": "Samantha Amstutz",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/203362689-the-aspect-of-essence"
}