{
  "title": "Fighting Destiny",
  "description": "Alternate cover edition of ASIN B00D5M4PTMHave you ever heard of the old Celtic legends of the Fae - beautiful, magical, deadly and a love of messing with humans just for kicks and giggles? Welcome to my world. What started out as a strange assignment, leads to one of the most gruesome murder mysteries of our times and my friends and I are set and determined to find out who is killing off Fae and Witches alike. Couple of problems in the way – I hate the Fae and the Prince of the Dark Fae is bound and determined that I work for him. He’s a rude, overbearing egotistical ass with a compulsive need to possess, dominate and control me. Oh – did I mention that he is absolutely sex-on-a-stick gorgeous and he makes me feel things that I never ever wanted to feel for a Fae…every time he touches me or looks at me with those golden eyes seems to pull me further in under his spell, despite my better judgment. My friends and I can’t trust anyone and nothing is as it seems on the surface – not even me.  Warning: Mature content and language not intended for anyone under the age of eighteen.  This book is not intended for anyone under the age of 18, or anyone who doesn't like lip biting, throw your ass on the bed, tear your clothes off and leave you panting dominant alpha male characters. This is a dark, dangerous, intense, gritty and raw. Scenes are dark, disturbing, and scorching HOT. This book is a soul crushing, tear jerking, and leave you hanging on the edge of your seat fast paced book. Side Effects may include, but are not limited to: Drooling, lip biting, wet panties, crying, and screaming at the author. If any of these things happen, do not seek medical attention—get the next book in the series and enjoy the ride!  Revised copy June, 22,2013 Format work by Princess S.O.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Fae",
    "Romance",
    "Paranormal Romance",
    "Urban Fantasy",
    "Magic"
  ],
  "author": "Amelia Hutchins",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/20329669-fighting-destiny"
}