{
  "title": "Heaven Sent",
  "description": "Heaven Sent: Heaven Desperate to save his family's hotel, the Weiss Strande, Tyler and his best friend sink their hopes and what's left of their money into a new venture: a nightclub at the hotel. The White Room must succeed, or the hotel will go under. Against all hope, they manage to sign the mega-popular rock group Heaven Sent to play the grand opening. Already a huge fan of the group, Tyler couldn't be more excited to welcome them to his hotel. He's not at all prepared for the bomb of lust that hits him when he's finally face-to-face with the painfully gorgeous lead singer, Johnnie Heaven. Johnnie's probably the most beautiful person he's ever seen, but Tyler is straight. He's feeling a misguided form of hero worship, right? When Johnnie invites Tyler to his room to play video games, their shared passion, Tyler jumps at the chance. He and Johnnie have a great time with the games, but Tyler soon discovers that Johnnie aims to introduce Tyler to a whole new level of game play... Heaven Sent: Purgatory Lucas Sloane defines beautiful for Reese. Tall and sleek with gorgeous red hair and deep, dark eyes to drown in, it's no wonder that the famous bass player of Heaven Sent is the hero of many a starry-eyed teenager's dreams. Reese used to be one of those teens back when Heaven Sent was no more than the house band for the local club, Purgatory. Back then, Reese found the courage to confess his love to Luc...only to be soundly rejected. Luc wasn't gay. Not long after, Heaven Sent left town and skyrocketed into rock and roll stardom. Now, six years later, Luc is back in town for a visit and more gorgeous than ever. Surprisingly, he not only apologizes for his treatment of Reese years ago, he comes onto him. Luc's discovered the pleasures of being with a man and wants to know what it'd be like between the two of them. But Reese can't. He lives the straight and narrow, teaches high school...he's even got a girlfriend. He has a normal life. He can't be gay. But it's hard to deny the man who's defined everything beautiful in Reese's artistic mind. No one has to know about it, right? Publisher's Note: This book is a male-male love story and contains homoerotic sex acts that may be offensive to some readers.",
  "genres": [
    "M M Romance",
    "Erotica",
    "Romance",
    "Gay",
    "LGBT",
    "Contemporary Romance",
    "Yaoi"
  ],
  "author": "Jet Mykles",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/2033269.Heaven_Sent"
}