{
  "title": "Swords and Salt - The Complete Series",
  "description": "Previously published cover of ASIN: B00HGNDE98Tale 1: A Question of Honor  With less than six months until his entrance exams for the famed Nurian warrior-mage academy, Yanko is sent to his uncle’s salt mine for “hardening,” as his father calls it. He expects endless days of physical labor; what he doesn’t expect is to have to choose one of the mine’s prisoners as a sparring partner.  Not wanting his uncle to think him a coward, Yanko picks a big scarred man from Turgonia, a land known for its ruthless warriors. Only after his selection does he learn that he’ll be expected to kill his opponent… before his opponent kills him.  A Question of Honor is a 19,000-word novella.  Tale 2: Labyrinths of the Heart  After months of working in his uncle’s mine, Yanko longs to see his family and friends again, especially Arayevo, the woman he has adored from afar since he was a boy. When she travels two days and asks to see him, his mind dances at the possibilities.  But the mines are busy: there’s a political delegate to humor, a maiden in distress to help, and a wedding that must go perfectly—or else. Yanko will be lucky if he finds a chance to talk to Arayevo before she disappears from his life forever.  Labyrinths of the Heart is a 21,000-word novella.  Tale 3: Death from Below  A visit from Yanko’s older brother is interrupted when an alarm blasts through the mine. Mutilated workers have been found dead in a newly opened tunnel.  Yanko has been studying to become a mage, and his brother is a soldier, so they believe they are prepared to deal with this unknown threat, but what awaits them in the subterranean depths is nothing the mine has seen in its hundreds of years of operation.  Death from Below is a 13,000-word novella.  Total word count for all three adventures: 53,000 words.",
  "genres": [
    "Fantasy",
    "Steampunk",
    "Adventure",
    "Adult",
    "Short Stories",
    "Magic",
    "Young Adult"
  ],
  "author": "Lindsay Buroker",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/20329348-swords-and-salt---the-complete-series"
}