{
  "title": "Estella's Revenge",
  "description": "'Loved it from the very first page - Estella is a superbly well-drawn character and absolutely unforgettable.' Frances QuinnYou know Miss Havisham.The world's most famous jilted bride.This is her daughter’s story.Raised in the darkness of Satis House where the clocks never tick, the beautiful Estella is bred to hate men and to keep her heart cold as the grave.She knows she doesn’t feel things quite like other people do but is this just the result of her strange upbringing?As she watches the brutal treatment of women around her, hatred hardens into a core of vengeance and when she finds herself married to the abusive Drummle, she is forced to make a deadly Should she embrace the darkness within her and exact her revenge?A stunningly original, gripping Gothic read, perfect for fans of Stacey Halls, Madeline Miller and Jessie Burton.Readers are stunned by Estella's Revenge:‘The genius concept behind this book is so irresistible, it makes the novel feel like magic…Charles Dickens's spirit would be definitely securing his copy now!’ Sophie Hannah‘This gripping and clever novel takes Miss Havisham’s daughter and tells us her dark and compelling tale. Masterfully constructed, complex, immersive and delivered through Havelocke’s beautiful prose. Both heartbreaking and uplifting, this is an absolute must-read.' Rebecca Netley'Thrillingly dark and beautifully written, this twisty Gothic tale will grip you to the last page and beyond.' Bella Ellis‘Deliciously creepy and decidedly dark, I loved this foray into the mind of Dickens’s most enigmatic heroine…It’s so beautifully written, it gripped me from the very first sentence and would not let me go until I finished reading.’ Jessica Bull'I truly cannot rave about this book enough!... Estella's Revenge is a dark, cunning story full of twists and turns and with plenty of heart.' Victoria Hawthorne‘A darkly ingenious take on a classic character, Estella’s story had me gripped. I couldn’t turn the pages fast enough.’ Susi Holliday‘Utterly beautiful.’ Louise Beech'Meticulously researched and full of dark intrigue, I loved being transported into Estella's world. A page-turning delight.' Sarah Ward‘Barbara Havelocke...makes the era come alive for the reader...A story with great depth...I look forward to reading more of Estella's story.' Valerie Keogh‘A dream to read…I believe that this book will in time be shelved next to Great Expectations as an essential complimentary read... Stunning.’ ⭐⭐⭐⭐⭐ Reader Review‘I absolutely loved this. A retelling of Charles Dickens’ Great Expectations? Please, yes, give it to me. This absolutely DELIVERED.'⭐⭐⭐⭐⭐ Reader Review‘Superbly and skilfully written. Great characters, twists and turns and a terrific gothic eeriness.",
  "genres": [
    "Historical Fiction",
    "Gothic",
    "Retellings",
    "Historical",
    "Fiction",
    "19th Century",
    "British Literature"
  ],
  "author": "Barbara Havelocke",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/203351234-estella-s-revenge"
}