{
  "title": "Five Novels of the 1960s & 70s: Martian Time-Slip / Dr. Bloodmoney / Now Wait for Last Year / Flow My Tears, the Policeman Said / A Scanner Darkly",
  "description": "Philip K. Dick was a writer of incandescent originality and astonishing fertility, who made and unmade fictional world-systems with ferocious rapidity and unbridled speculative daring. “The floor joists of the universe,” he once wrote, “are visible in my novels.” The five novels collected in this volume—a successor to Philip K. Dick: Four Novels of the 1960s—offer a breathtaking overview of the range of this science-fiction master. In these classics from the height of his career, the wild humor, freewheeling inventiveness, and darkly prophetic insights of Dick at his best are fully on display.Martian Time-Slip (1964) unfolds on a parched and thinly colonized Red Planet where the unscrupulous seek to profit from a troubled child’s time-fracturing visions. Dr. Bloodmoney, or How We Got Along After the Bomb (1965) chronicles the interwoven stories of a multiracial community of survivors, including the scientist who may have been responsible for World War III. Into this apocalyptic framework Dick weaves observations of daily life in the California of his own moment. Famous, among other reasons, for a therapy session involving a talking taxicab, Now Wait for Last Year (1966) explores the effects of JJ-180, a hallucinogen that alters not only perception, but reality.In Flow My Tears, the Policeman Said (1974), a television star seeks to unravel a mystery that has left him stripped of his identity. A Scanner Darkly (1977), the basis for the 2006 film, envisions a drug-addled world in which a narcotics officer’s tenuous hold on sanity is strained by his new surveillance assignment: himself. Regarded by some as Dick’s most powerful novel, A Scanner Darkly mixes futuristic fantasy with an all-too-real evocation of the culture of addiction in 1970s America. Mixing metaphysics and madness, Dick’s work remains exhilarating and unsettling in equal measure.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Novels",
    "Speculative Fiction",
    "Literature",
    "Philosophy",
    "Dystopia"
  ],
  "author": "Philip K. Dick",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/2033517.Five_Novels_of_the_1960s_70s"
}