{
  "title": "The Day of Atonement",
  "description": "NAMED ONE OF THE BEST BOOKS OF THE YEAR BY LIBRARY JOURNAL • Look for special features inside. Join the Random House Reader’s Circle for author chats and more.The bestselling author of such novels as A Conspiracy of Paper and The Whiskey Rebels continues his masterly run of “atmospheric” (The Washington Post), “page-turning” (The Baltimore Sun), “tremendously smart” (Newsweek) historical thrillers. In The Day of Atonement, David Liss blends meticulous period detail with crackling adventure in the tale of one man’s quest for justice—and retribution.   Sebastião Raposa is only thirteen when his parents are unjustly imprisoned, never to be seen again, and he is forced to flee Portugal lest he too fall victim to the Inquisition. But ten years in exile only serve to whet his appetite for vengeance. Returning at last to Lisbon, in the guise of English businessman Sebastian Foxx, he is no longer a frightened boy but a dangerous man tormented by violent impulses. Haunted by the specter of all he has lost—including his exquisite first love—Foxx is determined to right old wrongs by punishing an unforgivable enemy with unrelenting fury.   Well schooled by his benefactor, the notorious bounty hunter Benjamin Weaver, in the use of wits, fists, and a variety of weapons, Foxx stalks the ruthless Inquisitor priest Pedro Azinheiro. But in a city ruled by terror and treachery, where money and information can buy power and trump any law, no enemy should be underestimated and no ally can be trusted. Having risked everything, and once again under the watchful eye of the Inquisition, Foxx finds his plans unraveling as he becomes drawn into the struggles of old friends—and new enemies—none of whom, like Lisbon itself, are what they seem.   Compelled to play a game of deception and greed, Sebastian Foxx will find himself befriended, betrayed, tempted by desire, and tormented by personal turmoil. And when a twist of fate turns his carefully laid plans to chaos, he will be forced to choose between surrendering to bloodlust or serving the cause of mercy.Praise for The Day of Atonement  “Enthralling . . . [a] sly, rich and swift novel of vengeance and rough justice.”—The Seattle Times  “One of the masters of the historical thriller, Liss is back with yet another highly entertaining novel. . . . [The Day of Atonement] paints a vivid picture of the waning days of the Inquisition, and of the truly evil religious leaders who led it. One of Liss’s best books.”—Minneapolis Star Tribune“Foxx is reminiscent of Lee Child’s Jack Reacher: a man with his own moral code who takes on multiple adversaries simultaneously. . . . Liss has the start of another solidly researched, action-packed historical series here.”—Booklist (starred review)  “[An] action-packed novel.”—The Wall Street Journal\n \n“Snappy dialogue and convincing atmosphere . . . The plot moves swiftly to a shattering climax.”—The Washington Post“Another intriguing thriller set against historical events for Liss, who has a knack for period detail, breakneck plots and characters we want to root for.”—San Antonio Express-News\n \n“Fans of Liss know well his mix of dark arts and historical detail.”—New York Daily NewsFrom the Trade Paperback edition.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Historical",
    "Portugal",
    "Historical Mystery",
    "Thriller"
  ],
  "author": "David Liss",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/20342628-the-day-of-atonement"
}