{
  "title": "Nixon's Secrets: The Rise, Fall, and Untold Truth about the President, Watergate, and the Pardon",
  "description": "\"We appreciate Roger Stone, he is one tough cookie.\" - President TrumpLearn the inside scoop on Watergate, the Ford Pardon, and the 18 ½ minute Gap.Roger Stone, The New York Times bestselling author of The Man Who Killed Kennedy—the Case Against LBJ , gives the inside scoop on Nixon’s rise and fall in Watergate in his new book Nixon’s Secrets. Stone charts Nixon’s rise from election to Congress in 1946 to the White House in 1968 after his razor-thin loss to John Kennedy in 1960, his disastrous campaign for Governor of California in 1962 and the greatest comeback in American Presidential history.“Just as the assassination of JFK prevents a balanced analysis of Kennedy and his times, the myth of Watergate prevents a reappraisal of our 37th President.” said Stone who’s book on LBJ was the second biggest selling book during the 50th anniversary of Kennedy’s murder.Stone reveals how the Kennedy’s wiretapped Nixon’s hotel room the night before the Nixon-Kennedy debate, and stole Nixon's medical records from his psychiatrist’s office. Stone lays out how Kennedy running mate Lyndon Johnson stole Texas from JFK through vote fraud while Mayor Richard Daley stole Illinois, and how JFK actually lost the popular vote.Stone looks at the Nixon the desegregation of the public schools, the progressive social programs, Nixon's struggle to end the war in Vietnam, the historic SALT arms reduction agreement with Russia, the saving of Israel in the Six Days War, the opening to China, and the disastrous decision to take America off the Gold standard.“The mainstream media’s interpretation of the facts surrounding the Watergate episode are a fantastic and grotesque distortion of historical truth,” said Stone. “Cursory examination of the facts in Watergate will reveal that the actions which caused the fall of Nixon cannot be reduced to the simplistic account summarized by Bob Woodward and Carl Bernstein of the Washington Post.”The author outlines how White House Counsel John Dean, planned, pushed and covered-up the Watergate break-in , then sought to avoid responsibility for it. Stone examines the bungled Watergate break-in to determine what exactly Nixon’s agents were looking for and how the CIA infiltrated the burglar team and sabotaged the break-in to gain leverage over Nixon. Find out why Nixon demanded the CIA turn over the records of the Bay of Pigs and Kennedy Assassination.Learn how a cabal of military and intelligence hard-liners spied on andundermined Nixon to stop his pro-peace détente foreign policy, his withdrawal of troops from Vietnam, his arms limitation agreement with the Soviets, and his opening to Red China. Discover how Vice President Spiro Agnew was setup to move him out of the line of presidential succession.Stone makes the compelling case that General Alexander Haig orchestrated Nixon’s removal from office in a coup d’état and brokered the deal for his pardon. Finally the public will learn what is on the 18 ½ minute gap in the White House Tapes.Stone, a Washington Insider for forty years, outlines why FBI Man Mark Felt is not deep throat, why there is no deep throat, and why Bob Woodward and Carl Bernstein lie about it even today.Stone reveals how Nixon used the dark secrets he knew to avoid prosecution by blackmailing Gerald Ford for a full, free and unconditional pardon. Nixon’s secret would not only destroy his presidency—it would save him from prison and allow him to launch his final comeback—advising President Bill Clinton on Foreign Affairs despite Hillary’s attempts to block him and her being fired from the 1974 House Impeachment Committee for lying and violating Nixon’s rights.Skyhorse Publishing, as well as our Arcade imprint, are proud to publish a broad range of books for readers interested in history--books about World War II, the Third Reich, Hitler and his henchmen, the JFK assassination, conspiracies, the American Civil War, the American Revolution, gladiators, Vikings, ancient Rome, medieval times, the old West, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Biography"
  ],
  "author": "Roger Stone",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/20344710-nixon-s-secrets"
}