{
  "title": "Warlords of Ancient Mexico: How the Mayans and Aztecs Ruled for More Than a Thousand Years",
  "description": "Learn the unbelievable true history of the great warrior tribes of Mexico.More than thirteen centuries of incredible spellbinding history are detailed in this intriguing study of the rulers and warriors of Mexico. Dozens of these charismatic leaders of nations and armies are brought to life by the deep research and entertaining storytelling of Peter Tsouras.Tsouras introduces the reader to the colossal personalities of the Smoking Frog, the Mexican Machiavelli, the Poet Warlord, the Lion of Anahuac, and others . . . all of them warlords who shaped one of the most significant regions in world history, men who influenced the civilization of half a continent.The warlords of Mexico, for all their fascinating lives and momentous acts, have been largely ignored by writers and historians, but here that disappointing record is put right by a range of detailed biographies that entertain as they inform. Students of the area, historians working in American history, and long-term visitors and tourists to the region will gain a much clearer understanding of the background history of these territories and the men who formed and reformed them.Lavishly illustrated with dozens of photographs and color paintings, Warlords of Ancient Mexico is essential reading for anyone interested in this tumultuous, endlessly captivating period of Central American history.Skyhorse Publishing, as well as our Arcade imprint, are proud to publish a broad range of books for readers interested in history--books about World War II, the Third Reich, Hitler and his henchmen, the JFK assassination, conspiracies, the American Civil War, the American Revolution, gladiators, Vikings, ancient Rome, medieval times, the old West, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [
    "History",
    "Nonfiction",
    "Audiobook",
    "Politics",
    "Historical",
    "The Americas",
    "War"
  ],
  "author": "Peter G. Tsouras",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/20344649-warlords-of-ancient-mexico"
}