{
  "title": "Harmony Bay: An adventurous slice of waterfront life where mystery surrounds history...",
  "description": "\"Tom Gahan's first novel demonstrates his mastery of description. He layers the plight of a contemporary single parent with events of the American Revolution and weaves a tale that provides the essence of Harmony Bay...\"- Florence Gatto - Long Island Writer's Guild, author of The Scent of Jasmine\"Harmony Bay captures the scope of small town life...the way it should be.\"- Jerry Schaefer - WRCN 103.9 FM\"Very impressive. Hats off to you, Mr. Gahan!\"- Deborah E. Gordon - Sarasota, Florida\"Wow! What an attention grabber...from the very first page Harmony Bay captured my attention and didn't let go...\"- Dominick J. Morreale, EdD, author of The Legend of Benny\"Harmony Bay, a warm-hearted place...a riveting, heart-warming story.\"- Lisa A. Dabrowski, WLNG 92.1 FM, author of The Hunting Poetess\"Getting to know the delightful characters of Harmony Bay makes me want to walk down the beach with any one of them and call them friend...Well done.\"- Caren Heacock - Southold, New York\"True escapism! ...Tom Gahan brings a fictional world to life in Harmony Bay, conjuring up images of the past, interwoven with a present day tale. His intimate portrayal of the characters comes through in a style that brings the reader into their lives as if they were kin...\"- Craig Romain - Editor, Lost Island Media\"Harmony Bay uncovers the rich historical past of a small town through the eyes of newcomers...Detailed description laced with historical references gives the reader a feel for life in a bayside town...\"- Kathy Gemmell - Frederick, Maryland\"Very interesting book...I'm glad that we were able to provide some scientific background...\"- Emerson Hasbrouck - Program Director, Cornell Cooperative Extension Marine Program\"From swashbuckling adventure to witty humor to romance, Harmony Bay covers all of the bases.\"- Bob Mann - Tyler, Texas",
  "genres": [],
  "author": "Tom Gahan",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/10125181-harmony-bay"
}