{
  "title": "Off the Sidelines: Raise Your Voice, Change the World",
  "description": "Foreword by Hillary Rodham Clinton Fourteen years before Kirsten Gillibrand succeeded Hillary Rodham Clinton as senator from New York, she heard her future mentor say these life-changing words: “Decisions are being made every day in Washington, and if you are not part of those decisions, you might not like what they decide, and you’ll have no one to blame but yourself.” A young corporate lawyer at the time, Gillibrand felt as if she’d been struck by lightning. She instantly knew that her voice—all women’s voices—were essential to shaping the future of this country, and that she had a greater purpose in life: to speak up and effect change. Now, in this extraordinary memoir, the senator, wife, and mother of two recounts her personal journey in public service and galvanizes women to reach beyond their busy lives and make a meaningful difference in the world around them.Off the Sidelines is a playbook for women who want to step up, whether in Congress or the boardroom or the local PTA. If women were fully represented in politics, Gillibrand says, national priorities would shift to issues that directly impact them: affordable daycare, paid family medical leave, and equal pay. Pulling back the curtain on Beltway politics, she speaks candidly about her legislative successes (securing federally funded medical care for 9/11 first responders, repealing Don’t Ask, Don’t Tell) and her crushing disappointments (failing by five votes to pass a bill protecting survivors of sexual assault in the military).Gillibrand also shares stories of growing up the daughter and granddaughter of two trailblazing feminists in a politically active family in Albany, New York, and retraces her nonlinear path to public office. She lays bare the highs and lows of being a young (pregnant!) woman in Congress, the joys and sacrifices every working mother shares, and the support system she turns to in her darkest moments: her husband, their two little boys, and lots of girlfriends.In Off the Sidelines, Gillibrand is the tough-love older sister and cheerleader every woman needs. She explains why “ambition” is not a dirty word, failure is a gift, listening is the most effective tool, and the debate over women “having it all” is absurd at best and demeaning at worst. In her sharp, honest, and refreshingly relatable voice, she dares us all to tap into our inner strength, find personal fulfillment, and speak up for what we believe in.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Memoir",
    "Feminism",
    "Biography",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Kirsten Gillibrand",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/20342582-off-the-sidelines"
}