{
  "title": "Security Analysis: The Classic 1951 Edition",
  "description": "With nearly a million copies sold, Security Analysis has been continuously in print for more than sixty years. No investment book in history had either the immediate impact, or the long-term relevance and value, of its first edition in 1934. By 1951, seventeen years past its original publication and more than a decade beyond its revised and acclaimed 1940 second edition, authors Benjamin Graham and David Dodd had seen business and investment markets travel from the depths of Depression to the heights of recovery, and had observed investor behavior during both the calm of peacetime and the chaos of World War II. The prescient thinking and insight displayed by Graham and Dodd in the first two editions of Security Analysis reached new heights in the third edition. In words that could just as easily have been written today as fifty years ago, they detail techniques and strategies for attaining success as individual investors, as well as the responsibilities of corporate decision makers to build shareholder value and transparency for those investors. The focus of the book, however, remains its timeless guidance and advice--that careful analysis of balance sheets is the primary road to investment success, with all other considerations little more than distractions. The authors had seen and survived the Great Depression as well as the political and financial instabilities of World War II and were now better able to outline a program for sensible and profitable investing in the latter half of the century. Security The Classic 1951 Edition marks the return of this long-out-of-print work to the investment canon. It will reacquaint you with the foundations of value investing--more relevant than ever in tumultuous twenty-first century markets--and allow you to own the third installment in what has come to be regarded as the most accessible and usable title in the history of investment publishing.",
  "genres": [
    "Finance",
    "Business",
    "Nonfiction",
    "Economics",
    "Money",
    "Personal Finance",
    "Buisness"
  ],
  "author": "Benjamin Graham",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/203409.Security_Analysis"
}