{
  "title": "William and the Thirteenth Key",
  "description": "Fate and adventure lie just behind the door...  William Sturnbottom is convinced fate is playing a cruel trick on him. After his mother mysteriously disappears while in Nepal, William is forced to leave his familiar London home for a chilly manor house in Scotland to live with his equally chilly grandfather. With not much to do, young William’s imagination soon runs wild, and he becomes convinced that his grandfather is hiding secrets from him. Secrets that are hidden somewhere in the old man’s manor. But when William enters his grandfather’s forbidden study, he unlocks more than secrets...he unlocks a whole new world.  After discovering a curious looking amulet in the study, William is spirited into the fantastical realm of Corpurnia--a world inhabited by strange and terrifying creatures. For hundreds of years this world has been oppressed by the cruel and powerful Emperor Harbos. Ravaged by time, and his insane desire to retrieve thirteen mythical Keys said to have the ability to unleash an ancient evil, Harbos has brought Corpurnia to the edge of ruin. The seas have been turned to deserts, sand pirates roam the wilds in floating ships, and the once powerful Guild of Key Academics charged with protecting the Keys has been nearly wiped out.  While William is convinced his arrival in Corpurnia is an unfortunate accident, it is anything but--his presence in this new realm had been foretold centuries ago. And as William soon discovers, a terrible burden has fallen on his shoulders. Now, trapped in Corpurnia and being hunted by Harbos and the might of his Empire, William must rely on the help of some unlikely allies--a grouchy gremlin, a mysterious dark elf, and a wise old Key Academic--to survive. And so begins a bold adventure through Corpurnia, an imaginative new world full of dark goblins, razorback trolls, stormhowlers, and worst of all, the ground wailers. All that keeps William going is the hopes of finding his mother, discovering the way home, and if he can, live up to his destiny as the Key Bearer.",
  "genres": [],
  "author": "Wil Madoc Rees",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/20348945-william-and-the-thirteenth-key"
}