{
  "title": "What the Woods Took",
  "description": "Yellowjackets meets Girl, Interrupted when a group of troubled teens in a wilderness therapy program find themselves stranded in a forest full of monsters eager to take their place.Devin Green wakes in the middle of the night to find two men in her bedroom. No stranger to a fight, she calls to her foster parents for help, but it soon becomes clear this is a planned abduction—one everyone but Devin signed up for. She’s shoved in a van and driven deep into the Idaho woods, where she’s dropped off with a cohort of equally confused teens. Finally, two camp counselors inform them that they've all been enrolled in an experimental therapy program. If the campers can learn to change their self-destructive ways—and survive a fifty-days hike through the wilderness—they’ll come out the other side as better versions of themselves. Or so the counselors say.Devin is immediately determined to escape. She’s also determined to ignore Sheridan, the cruel-mouthed, lavender-haired bully who mocks every group exercise. But there’s something strange about these woods—inhuman faces appearing between the trees, visions of people who shouldn't be there flashing in the leaves—and when the campers wake up to find both counselors missing, therapy becomes the least of their problems. Stranded and left to fend for themselves, the teens quickly realize they’ll have to trust each other if they want to survive. But what lies in the woods may not be as dangerous as what the campers are hiding from each other—and if the monsters have their way, no one will leave the woods alive.Atmospheric and sharp, What the Woods Took is a poignant story of transformation that explores the price of becoming someone—or something—new.",
  "genres": [
    "Horror",
    "Young Adult",
    "Thriller",
    "Mystery",
    "LGBT",
    "Fiction",
    "Queer"
  ],
  "author": "Courtney Gould",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/203578707-what-the-woods-took"
}