{
  "title": "Bad Elephant Far Stream",
  "description": "Bad Elephant Far Stream is an elephant’s life story, told from her own perspective, through her own eyes. Inspired by the true story of the elephant Topsy, it begins in the forests of Ceylon in the late 1860s with the capture of a baby elephant known to her own kind as Far Stream. She is taken to America and sent to the Adam Forepaugh Circus in Philadelphia. There, Far Stream embarks on a new life under the big top, appearing first as “Baby Annie,” then, when she grows bigger, as “Topsy.” She crisscrosses North America for thirty years with the circus, experiencing hardships, kidnapping, escapes and adventure. But when she comes to outweigh her keepers by a factor of forty—it’s hard not to hurt somebody. It’s hard not to be labeled as “bad.”What is it like to be an elephant in the circus? What does it think? What does it feel? What does it yearn for? Bad Elephant Far Stream takes the reader on a voyage of discovery to find out.Praise for Bad Elephant Far \"This book has haunted me since I read it...Samuel Hawley really displays the magnificent brains, emotional depth (yes, emotional depth), and stunning strength of these amazing creatures.\" (Pamela Fagan Hutchins, author of the What Doesn’t Kill You series)“Meticulously researched and well told...an important story...One of the strengths of the Hawley’s book is that it avoids a too-emotional approach, letting the facts of these elephants’ lives speak for themselves. Another strength is the feel for the period described. One actually gets a sense of the language and values of the late 19th century....I urge people to read this book.\" (Stewart McFarlane, author of Of Mice and Animal Encounters in the Life of a Wandering Buddhist)“Intriguing and haunting...Moving and thought-provoking...an intense and emotional novel. A highly recommended read.” (Shalini’s Book Reviews)“Well researched, well written and compelling...gripping, heart felt, and filled with compassion.” (Lynelle Clark, Aspired Writer)“Far Stream captured my heart immediately...I enjoyed this book so much that I had to research the story further.” (The Writers Lounge)“This historically significant novel is one that will stick with me for a long while. It’s a must read for those who enjoy this genre.” (Pure Bibliographic Ramblings of a Bookworm)“I found myself having a hard time putting down the book as I wanted to find out what would happen next. Topsy's story was just that engrossing.” (If It Has Words)",
  "genres": [
    "Animals",
    "Abuse",
    "Fiction",
    "Historical Fiction"
  ],
  "author": "Samuel Hawley",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/20350412-bad-elephant-far-stream"
}