{
  "title": "Awaken",
  "description": "★★★★★ \"Highly recommended for anyone who loves Paranormal Romance - this is how it should ALWAYS be written\" - Hazel Butler. Author of Chasing Azrael.A lot happens after waking up dead...Michael Warden used to live a normal life. A successful entrepreneur he had everything until his life got taken away from him. Literally. Now he is trapped in a world that shouldn't exist, fighting things that should only exist in nightmares in a quest to find out the truth about what happened to him.Lacy Holloway is finally content in the little town of Oakland, Garrett Co. Working at the local university, she has finally allowed herself to move on from the one thing that had haunted her past. Aside from an unsettling string of suicides at her place of work, Lacy is happy. Then a new colleague enters her life. Michael is handsome, smart and their friendship is instant...Easy. That is, until another student attempts to take her own life and Lacy is hurled into a world of nightmares which she soon discovers Michael is already a part of.As they are forced to face demons, both the supernatural and the emotional kind, they also have to face the realization that they are both beginning to feel things for each other that neither of them expected, least of all Michael. As well as trying not to fall too deeply for the woman who has captivated him, he is shocked to discover things about his very existence that could change both their lives and the world as they know it.*This book contains some Adult situations and is recommended for age 17+*DIVINE HUNTER SERIES READING AwakenDark DeliveranceEvo -A Divine Hunter World Novel (character tie in book #2.5 in series)Kindred Salvation Mortal HeartRaziel - A Divine Hunter World Novel (character tie in book #4.5 in series)",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Demons",
    "Romance",
    "Angels",
    "Fantasy",
    "Supernatural"
  ],
  "author": "L.J. Sealey",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/20351533-awaken"
}