{
  "title": "Scourge: The Once and Future Threat of Smallpox",
  "description": "A Washington Post Best Book of 2001, Scourge provides a definitive account of the dramatic story of smallpox by a leading \"expert on biological and chemical weapons\" (The New York Times). Jonathan B. Tucker traces the history of the smallpox virus from its first recorded outbreak around 3700 B.C. through its use as the first biological warfare agent in human history, and draws some decisively important lessons for the future. In a timely debate, Tucker addresses the ever-growing concerns about the proliferation of the deadly smallpox virus and its use by terrorist organizations. Explaining how the eradication of the disease in the late 1970s encouraged military research and production of the virus, he exposes the failure of the Russian government to secure its remaining cold-war stockpiles, and evaluates the past and present measures undertaken by the United States to counter the existing dangers of a smallpox attack. Ultimately, he passionately argues for the strengthening of the existing legal ban on the development and possession of biological weapons. Impeccably researched, Scourge is as arresting as it is indispensable, and as William Beatty in Booklist raves, Tucker \"has a sense of ... history that helps him make the story of smallpox as disease and ... weapon fascinating and frightening.\" Scourge has been acclaimed as \"a concise, suspenseful and scientifically accurate narrative.\" -- The New York Times Book Review\" Tucker's fascinating, revealing book affords the reader a sobering look at this new type of warfare....\" -- Chris Patsilelis, Houston Chronicle -- \"[Tucker] reports the debate evenhandedly and with telling detail.\" -- David Brown, The Washington Post Book World",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Medicine",
    "Medical",
    "Disease",
    "Audiobook"
  ],
  "author": "Jonathan B. Tucker",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/203506.Scourge"
}