{
  "title": "Цар Шишман и Дан Войвода",
  "description": "Двама владетелив продължение на две годиниводятот двете страни на Дунавсвоята си лична война,приключила за единия от тяхс глава по-малко.Заради омраза ли? За любов? Жена?Или има и друго?Тук е тяхната история,разказана в една приписка,в няколко надписа,в стенописите на две църкви в Карпатите,с фактологията на едно погребение от ХІV в.,в шифрованите съобщения на патриарх Евтимий,както и в повече от 450 народни песни. *Doi domnitoriîn continuare de doi aniducpe cele două părţi Dunariirăzboiul său propriufinalizat pentru unul dintre eicu un cap mai puţin.Din cauza urii ? Din cauza dragostei ? Sau unei femei ?Sau este şi altceva?Aici este istoria lor,povestita într-o înscriere,în câteva inscripţii,pe picturele murale în două biserici din Carpaţi,cu faptologie de o înmormântare din veacul al XIV-ea,în comunicarile criptate patriarhului Eftimie,aşa cum şi în mai mult decât 450 de căntece populare*Two monarchswage a personal war against each otheron the Two opposite banks of the Danubefor Two years.As a result, the warfare endedwith a beheading of one of them.But what was the premise for this bloodshed –odium, love, or a certain womanas the motif for this historical belligerency?Their story is written hereas the centuries-old tale was recounted in one transcript,in several inscriptions,and in the frescoes of two churches in the Carpathians.Moreover, the facts were gathered from one entombment from ХІV A.D.,from the encrypted messages of patriarch Evtimii,and from the lyrics of more than 450 folk songs,which contributed to the disclosureof the forgotten medieval story.*Двое владетелей в течении двух лет ведутпо обеим сторонам Дунаясвою личную войну,приключившую для одного из них головой меньше.Из-за ненависти ли? Ради любви? Женщина?Или есть и другое?Здесь ихняя история,рассказанная в одной приписке,в несколько надписей,в стенописях двух церквей в Карпатах,с фактологией одного погребения ХІV-го века,в шифрованных сообщениях патриарха Евфимия,как и в более чем 450 народных песнях.",
  "genres": [],
  "author": "Снежанка Генчева",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/20348544"
}