{
  "title": "It's a Privilege Just to Be Here",
  "description": "This debut novel pulls at the threads in the (cashmere) sweater of academia in a witty take-down of racial inequality at prep schools, perfect for fans of Such a Fun Age and Little Fires Everywhere.Wesley Friends School is Washington, DC’s most prestigious prep school, so of course Aki Hiyashi-Brown is proud to teach at it and send her daughter Meg there. Why wouldn't she be proud? Parents kill to have their kid enrolled at Wesley. Not only is Wesley the premier academic destination for the children of the capital elite, but it’s all about \"Diversity, Achievement, Collegiality,\" as all of their every glossy brochures will tell you. Aki should know. As one of the few teachers of color on staff, her face is plastered on every piece of marketing material the school puts out. But when someone graffities \"Make Wesley White Again\" on campus, it exposes dangerous fault lines in the school community—ones Aki may have spent a lifetime learning to ignore. But her headstrong daughter Meg, and Meg's similarly impassioned classmates, aren’t willing to let slide. Before Aki can sort out her own feelings about the hate crime, the school's administration jumps into crisis management mode and assigns Aki as head of the Racial Equity Task Force—a cobbled-together initiative that has a big name and no little actual power. Between hasty changes to the curriculum and an anonymous instagram account documenting a history of racism on campus, Aki finds herself caught in the crossfire.Written with the keen eye of a prep school insider, It’s a Privilege Just to Be Here is a piercing takedown of the American institution of prep schools and a searing perspective on the growing tensions between generations with different ideas of how to fight for what you believe in.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Mystery Thriller",
    "Mystery",
    "Audiobook",
    "Dark Academia",
    "Social Justice"
  ],
  "author": "Emma Sasaki",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/203531374-it-s-a-privilege-just-to-be-here"
}