{
  "title": "The LOVE Series: The Complete Four Book Set",
  "description": "*This is a combination of all four full length novels in the Love series* This series is my first. A lot has changed in my writing style since the Love series. It’s very interesting to me to see that growth. I hope you follow along on my journey. In Blue Love a New Adult / College, Coming of Age story Tessa Ross tries to fight her attraction to bad boy Lucas Links. He is hot, arrogant, and has a sexual past that most boys his age could only dream of, (If they even knew they could dream of such things). Lucas, the star quarterback seems to have it all, super star athletic abilities, expensive clothes, cars, and women who literally stop just to watch him walk by. On the outside he appears to have it all. Tessa is a young woman who lives her life always doing what is right to make everyone else happy. She tries desperately to hold herself accountable to the demanding expectations of her family and everyone around her. Is Tessa as innocent as she appears? Is Lucas just a spoiled young man who seems to have what every male, and female wants? If you Love an emotional story that is full of spicy hot goodness. If you Love to follow a story from beginning until the bitter sweet end. If you are often left wondering what happened next... get your tissues and lip balm ready you are in for the read of your life. As we all know, you should never judge a book by it's cover. In book two of the \"Love\" series, Tessa and Lucas have decided it best to be friends. But is it possible when they share a love as deep as theirs? Follow Luke as he tries to be the man he realized he wanted to become when he fell in love with Tessa. Follow Tessa as tries to stay strong for herself and Lucas through loss, life, and new love. In Sad Love book three in the \"Love\" series. Love had not been easy for Tessa Ross and Lucas Links. In book three of MJ Fields Love series we follow Tessa and Luke through there college years. Will they get back together or is enough finally enough? In True Love, book four of the Love Series,Tessa Ross has finally decided to give herself a break. A break from her forced smiles and the people she loved so that her heart could continue to heal. She needed to continue to figure out a way to stay strong which meant putting distance between her memories and of her and Lucas. Tessa returns to her families house in Cape Code a place that she always loved.",
  "genres": [],
  "author": "M.J. Fields",
  "average_rating": "4.79",
  "url": "https://www.goodreads.com/book/show/20348051-the-love-series"
}