{
  "title": "Trouble Island",
  "description": "A gripping new novel inspired by a real place and events from the author’s family, Trouble Island is the standalone suspense debut from historical mystery writer Sharon Short.Many miles from anywhere in the middle of Lake Erie, Trouble Island serves as a stop-off for gangsters as they run between America and Canada. The remote isle is also the permanent home to two women: Aurelia Escalante, who serves as a maid to Rosita, lady of the mansion and wife to the notorious prohibition gangster, Eddie McGee. In the freezing winter of 1932, the women anticipate the arrival of Eddie and his strange coterie: his right-hand man, a doctor, a cousin, a famous actor, and a rival gangster who Rosita believes murdered their only son.Aurelia wants nothing more than to escape Trouble Island, but she is hiding a secret of her own. She is in fact not a maid, but a gangster’s wife in hiding, as she runs from the murder she committed five years ago. Her friend Rosita took her in under this guise, but it has become clear that Rosita wants to keep Aurelia right where she is.Shortly after the group of criminals, celebrities, and scoundrels arrive, Rosita suddenly disappears. Aurelia plans her getaway, going to the shore to retrieve her box of hidden treasures, but instead finds Rosita’s body in the water. Someone has made sure Aurelia was the one to find her. An ice storm makes unexpected landfall, cutting Trouble Island off from both mainlands, and with more than one murderer among them.Both a gripping locked room mystery, and a transporting, evocative portrait of a woman in crisis, Trouble Island marks the enthralling standalone suspense debut from Sharon Short, promising to be her breakout novel, inspired by a real island in Lake Erie, and true events from her own rich family history.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Thriller",
    "Fiction",
    "Mystery Thriller",
    "Suspense",
    "Action"
  ],
  "author": "Sharon Short",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/203578712-trouble-island"
}