{
  "title": "Intertwined Lives: Margaret Mead, Ruth Benedict, and Their Circle",
  "description": "A uniquely revealing biography of two eminent twentieth century American women. Close friends for much of their lives, Ruth Benedict and Margaret Mead met at Barnard College in 1922, when Mead was a student, Benedict a teacher. They became sexual partners (though both married), and pioneered in the then male-dominated discipline of anthropology. They championed racial and sexual equality and cultural relativity despite the generally racist, xenophobic, and homophobic tenor of their era. Mead’s best-selling Coming of Age in Samoa (1928) and Sex and Temperament in Three Primitive Societies (1935), and Benedict’s Patterns of Culture (1934), Race (1940), and The Chrysanthemum and the Sword (1946), were landmark studies that ensured the lasting prominence and influence of their authors in the field of anthropology and beyond.With unprecedented access to the complete archives of the two women—including hundreds of letters opened to scholars in 2001—Lois Banner examines the impact of their difficult childhoods and the relationship between them in the context of their circle of family, friends, husbands, lovers, and colleagues, as well as the calamitous events of their time. She shows how Benedict inadvertently exposed Mead to charges of professional incompetence, discloses the serious errors New Zealand anthropologist Derek Freeman made in his famed attack on Mead’s research on Samoa, and reveals what happened in New Guinea when Mead and colleagues engaged in a ritual aimed at overturning all gender and sexual boundaries.In this illuminating and innovative work, Banner has given us the most detailed, balanced, and informative portrait of Mead and Benedict—individually and together—that we have had.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Anthropology",
    "History",
    "LGBT",
    "Womens",
    "Queer"
  ],
  "author": "Lois W. Banner",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/111373.Intertwined_Lives"
}