{
  "title": "The Living Medicine: How a Lifesaving Cure Was Nearly Lost―and Why It Will Rescue Us When Antibiotics Fail",
  "description": "A remarkable story of the scientists behind a long-forgotten and life-saving the healing viruses that can conquer antibiotic resistant bacterial infectionsFirst discovered in 1917, bacteriophages—or “phages”—are living viruses that devour bacteria. Ubiquitous in the environment, they are found in water, soil, inside plants and animals, and in the human body.When phages were first recognized as medicines, their promise seemed limitless. Grown by research scientists and physicians in France, the Soviet Union, and elsewhere to target specific bacteria, they cured cholera, dysentery, bubonic plague, and other deadly infectious diseases.But after Stalin’s brutal purges and the rise of antibiotics, phage therapy declined and nearly was lost to history—until today. In The Living Medicine, acclaimed science journalist Lina Zeldovich reveals the remarkable history of phages, told through the lives of the French, Soviet, and American scientists who discovered, developed, and are reviving this unique cure for seemingly-intractable diseases. Ranging from Paris to Soviet Georgia to Egypt, India, South Africa, remote islands in the Far East, and America, The Living Medicine shows how phages once saved tens of thousands of lives. Today, with our antibiotic shield collapsing, Zeldovich demonstrates how phages are making our food safe and, in cases of dire emergency, rescuing people from the brink of death. They may be humanity’s best defense against the pandemics to come.Filled with adventure, human ambition, tragedy, technology, irrepressible scientists and the excitement of their innovation, The Living Medicine offers a vision of how our future may be saved by knowledge from the past.",
  "genres": [
    "Nonfiction",
    "Science",
    "Health",
    "Medicine",
    "History",
    "Medical",
    "Biography Memoir"
  ],
  "author": "Lina Zeldovich",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/203579033-the-living-medicine"
}