{
  "title": "The Maya Papyrus",
  "description": "Gold Medal Winner in the Global Ebook Awards 2013                  Praise for The Maya Papyrus\"Thoroughly enjoyable and deeply satisfying, The Maya Papyrus is an exceptional novel from an author who deserves your appreciation. It is recommended without reservation!\"BookViral.com\"The Maya Papyrus is an astonishingly well-crafted novel. Coady's Egypt - and Egyptians - come to breathtaking life. A massive cast of wholly believable characters drawn straight from the pages of history, a palpable setting, and a plot full of tension and bleak surprises seamlessly interweave to make this one of the best historical novels I've read in a very long time.\"L. M. Ironside, author of The Sekhmet Bed and The Crook and Flail \"A novel that no history fan can put down though the dishes go unwashed and sleep is elusive for several days...a very enjoyable book, and extremely hard to put down.\" The Kindle Book ReviewProduct DescriptionIn the Valley of the Kings, a team of archaeologists has unearthed a secret that has lain buried for over 3000 years. Hidden in Nefertiti's tomb is a bundle of papyrus sheaves. Although badly decayed, the documents have survived well enough to tell an epic tale of war, murder and treachery...Thuya is a woman who craves greatness. Her son, Aye, is a man who will stop at nothing to attain it. Together they will concoct a scheme so monumental in its scope that it will mould the reigns of Egypt's kings and rewrite the future of the known world.The Maya Papyrus is populated with some of the most extraordinary characters in Tutankhamun, the boy king; Akhenaten, the deformed tyrant; Akhenaten's queen, Nefertiti, whose beauty remains legendary three millennia later.Who among them can stand against a man willing to risk everything to achieve immortality?",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Egypt"
  ],
  "author": "Richard Coady",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/20382241-the-maya-papyrus"
}