{
  "title": "The Cheesemaker's Daughter",
  "description": "When Marina’s father summons her to their Croatian island from New York—and away from her evaporating marriage—to help him save his failing cheese factory, she must face her rocky past and an uncertain future.How do you begin again when the past threatens to drown you?In the throes of an unraveling marriage, New Yorker Marina Maržić returns to her native Croatian island where she helps her father with his struggling cheese factory, Sirana. Forced to confront her divided Croatian-American identity and her past as a refugee from the former Yugoslavia, Marina moves in with her parents on Pag and starts a new life working at Sirana. As she gradually settles back into a place that was once home, her life becomes inextricably intertwined with their island’s cheese. When her past with the son of a rival cheesemaker stokes further unrest on their divided island, she must find a way to save Sirana—and in the process, learn to belong on her own terms.Exploring underlying cultural and ethnic tensions in a complex region mired in centuries of war and turmoil, The Cheesemaker’s Daughter takes us through the year before Croatia joins the European Union. On the dramatic moonscape island of Pag, we are transported to strikingly barren vistas, medieval towns, and the mesmerizing Adriatic Sea, providing a rare window into a tight-knit community with strong family ties in a corner of the world where divisions are both real and imagined. Asking questions central to identity and the meaning of home, this richly drawn story reckons with how we survive inherited and personal traumas, and what it means to heal and reinvent oneself in the face of life’s challenges.",
  "genres": [
    "Fiction",
    "Food",
    "Family",
    "Historical Fiction",
    "Contemporary",
    "Audiobook",
    "War"
  ],
  "author": "Kristin Vukovic",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/203746307-the-cheesemaker-s-daughter"
}