{
  "title": "Dead Ends: The Dead Series: Vol 1",
  "description": "Dead Ends is an eclectic potpourri of nine horrific tales, including two tales to be adapted for full-length upcoming novels, Drive and FiremanDead Air (March 28, 2025) is a sister collection of horror stories to Dead Ends and the continuation of the The Dead Series Dead-end Tale 1: Drive A battered black Audi Quattro in Old Castle's scrapyard has become a morbid attraction for the town's youth since 17-year-old Kelly Monroe's life was taken in that tomb-on-wheels. Kelly's three best friends make the mistake of paying the scrapyard a nocturnal visit to say a final goodbye. This short story is going to be developed as a full-length novel with the same title slated for late 2024Dead-end Tale 2: HannaHanna, the old woman living at the top of the building, isn't who her neighbours think she is, and there's an odd smell coming down the pipes from her flat.Dead-end Tale 3: The Dark WebThere's something in the attic spinning a dress of silk for Jessica.Dead-end Tale 4: The Dare Norman Childers is a suspense writer suffering from writer's block. One sleepless night, he notices something strange in the park across from his apartment. He finds himself being a character in his own novel, but he needs to find out how the story ends.Dead-end Tale 5: Yucky! Widow Slater is a haunted woman who cannot escape her past. Thinking she is losing her mind, she makes a strange confession.Dead-end Tale 6: Bad Blood Baby Starkweather was born with a quirk – he only drinks blood – which is a growing problem for his foster mother. And as little Starkweather grows, so does his thirst.Dead-end Tale 7: The Taxi Driver Jake Montgomery suffers a terrible shock when he discovers his daughter Eva is allergic to nuts. Panicked, Jake flags down a taxi to take them to the hospital. The strange taxi driver is determined to get her to the hospital on time...no matter the consequences.Dead-end Tale 8: CrossbreedWhen the Mackenzie family set off on their yearly camping trip, they did and didn’t know they would and wouldn’t be returning home.Dead-end Tale 9: FiremanWhen Max Power receives the alert message on his pager, he expects it will be a night like any other night. He would be wrong. This short story is going to be developed as a full-length novel with the same title slated for late 2024",
  "genres": [
    "Horror",
    "Mystery",
    "Suspense",
    "Paranormal",
    "Occult",
    "Thriller",
    "Gothic"
  ],
  "author": "Jonathan  Dunne",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/203786195-dead-ends"
}