{
  "title": "Melt My Heart",
  "description": "Sometimes Cupid works in mysterious ways. This diverse collection of Valentine tales proves that love can be found when you least expect it and in the least likely places … A farmer, a doctor, a biker, and a werewolf all get struck by the love god’s arrows in this sweet and super-sexy anthology.Bloom by Rachel Cross When L.A.’s charity fundraising maven Ava Bennett heads out to the middle of nowhere to check on a friend of her rock star client, she’s shocked to discover the surly farmer she meets is actually Nathaniel Robinson. Once an infamous music producer, Nate traded in his fast-paced lifestyle for sanity—and now lives off the grid as a small organic farmer. Can a career woman find love with a virtual hermit?Laying Down His Colors by Debra Kayn A year ago on Valentine’s Day, Kristen Mead had a night she can’t forget with Bruce Grennan. But the Bantorus Motorcycle Club member and Cactus Cove bartender has ignored her ever since. As a Club kid, she knows the golden rule: you never mess with a fellow member’s daughter. But she’s all grown up, and ready to stake a claim on her man. Will he risk everything—including the respect of his brothers—to make Kristin his?Trapped by Cupid by Nicole FlocktonNurse Lisa Wheeler wouldn’t mind getting swept off her feet this Valentine’s Day, but it seems Cupid’s arrow has passed her by. Instead, she’s stuck working the late shift with arrogant Dr. Noah Collins. But when this couple gets stuck in a stalled elevator, it turns out the ER’s golden boy might just have a secret soft side—and Cupid might have better aim than she thought. A Demoness Matched by Holley TrentLiberated from a dangerous cult, Julia Tate needs protection from her incubus father. Luckily, her brother Charles, an eros demon, knows just where she can find it: at the home of reclusive former baseball star Calvin Wolff. The mysterious Mr. Wolff is hiding a hairy secret and doesn’t want to let anyone get close, but he’s drawn to this innocent young woman’s enthusiasm. When trouble finds them, they discover a werewolf and a demoness just might make an out-of-this-world match.",
  "genres": [
    "Paranormal",
    "Anthologies"
  ],
  "author": "Rachel Cross",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/20365943-melt-my-heart"
}