{
  "title": "Beyond the Hoax: Science, Philosophy and Culture",
  "description": "When physicist Alan Sokal revealed that his 1996 article, \"Transgressing the Boundaries: Toward a Transformative Hermeneutics of Quantum Gravity,\" published in Social Text, was a hoax, the ensuing scandal made the front page of the New York Times and caused an uproar amongst the post-modernists he had so hilariously-and convincingly-parodied.Now, in Beyond the Hoax, Sokal revisits this remarkable chapter in our intellectual history to illuminate issues that are with us even more pressingly today than they were a decade ago. Sokal's main argument, then and now, is for the centrality of evidence in all matters of public debate. The original article, (included in the book, with new explanatory footnotes), exposed the faulty thinking and outright nonsense of the postmodernist critique of science, which asserts that facts, truth, evidence, even reality itself are all merely social constructs. Today, right wing politicians and industry executives are happily manipulating these basic tenants of postmodernism to obscure the scientific consensus on global warming, biological evolution, second-hand smoke, and a host of other issues. Indeed, Sokal shows that academic leftists have unwittingly abetted right wing ideologies by wrapping themselves in a relativistic fog where any belief is as valid as any other because all claims to truth must be regarded as equally suspect. Sokal's goal, throughout the book, is to expose the dangers in such thinking and to defend a scientific worldview based on respect for evidence, logic, and reasoned argument over wishful thinking, superstition, and demagoguery of any kind.Written with rare lucidity, a lively wit, and a keen appreciation of the real-world consequences of sloppy thinking, Beyond the Hoax is essential reading for anyone concerned with the state of American culture today.",
  "genres": [
    "Philosophy",
    "Science",
    "Nonfiction",
    "Politics",
    "Psychology",
    "Education",
    "Sociology"
  ],
  "author": "Alan Sokal",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/2036727.Beyond_the_Hoax"
}