{
  "title": "On Lynchings",
  "description": "Though the end of the Civil War brought legal emancipation to blacks, it is a fact of history that their social oppression continued long after. The most virulent form of this ongoing persecution was the practice of lynching carried out by mob rule, often as local law enforcement officials looked the other way. During the 1880s and 1890s, more than 100 African Americans per year were lynched, and in 1892 alone the toll of murdered men and women reached a peak of 161.In that awful year, the twenty-three-year-old Ida B. Wells, the editor of a small newspaper for blacks in Memphis, Tennessee, raised one lone voice of protest. In her paper she charged that white businessmen had instigated three local lynchings against their black competitors. In retaliation for her outspoken courage a goon-squad of angry whites destroyed her editorial office and print shop, and she was forced to flee the South and move to New York City.So began a crusade against lynching which became the focus of her long, active, and very courageous life. In New York she began lecturing against the abhorrent vigilante practice and published her first pamphlet on the subject called Southern Horrors . After moving to Chicago and marrying lawyer Ferdinand Barnett, she continued her campaign, publishing A Red Record in 1895 and Mob Rule in New Orleans , about the race riots in that city, in 1900.All three of these documents are here collected in this work, a shocking testament to cruelty and the dark American legacy of racial prejudice. Anticipating possible accusations of distortion, Wells-Barnett was careful to present factually accurate evidence and she deliberately relied on southern white sources as well as statistics gathered by the Chicago Tribune . Using the words of white journalists, she created a damning indictment of unpunished crimes that was difficult to dispute since southern white men who had witnessed the appalling incidents had written the descriptions.Along with her husband she played an active role in the founding of the National Association for the Advancement of Colored People (NAACP). Due to her efforts, the NAACP launched an intensive campaign against lynching after World War I.Her work remains important to this day not only as a cry of protest against injustice but also as valuable historical documentation of terrible crimes that must never be forgotten. This new edition is enhanced by an introduction by Patricia Hill Collins, professor and chair of the Department of African American Studies at the University of Cincinnati.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "African American",
    "Politics",
    "Essays",
    "Historical"
  ],
  "author": "Ida B. Wells-Barnett",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/203934.On_Lynchings"
}