{
  "title": "The Oxford English Dictionary",
  "description": "The 20-Volume OED and the new Version 3.0 CD-ROM makes exploring the resources of the most authoritative dictionary of the English language easy and complete.The Oxford English Dictionary is the internationally recognized authority on the evolution of the English language from 1150 to the present day. The Dictionary defines over 500,000 words and traces their usage through 2.5 million illustrative quotations from a wide range of literary and othersources. It is an unsurpassed guide to the meaning, pronunciation, and history of the English language.This new version of The Oxford English Dictionary (Second Edition) on CD-ROM thus offers unparalleled access to the world's most important reference work for the English language. The text of this version has been augmented with the inclusion of the Oxford English Dictionary Additions Series(Volumes 1-3), published in 1993 and 1997, the Bibliography to the Second Edition, and other ancillary material. New Features*The powerful Advanced search makes it possible to make use of the full potential of the OED. Complex search expressions can be built through the use of Boolean operators, case-sensitive searching, exact character searching, restricting searches to previous search results, searching inpronunciations, and an extended range of wildcard options*A new installation option makes it possible to run the Dictionary from the hard disk*The Automatic Look-up feature enables fast access to OED headwords from any Microsoft Office 97 or 2000 application. This feature can be used within the OED CD-ROM itself to look up words in the definition or quotation text System PC with minimum 200 MHz Pentium-class processor; 32MB RAM (64 MB recommended); 16-speed CD-ROM drive (32-speed recommended); Windows 95, 98, Me, NT, 2000, or XP (Local administrator rights are required to install and open the OED for the first time on a PC running Windows NT 4 and to install and run the OED on Windows 2000 and XP); 1.1 GB hard diskspace to run the OED from the CD-ROM and 1.7 GB to install the CD-ROM to the hard SVGA 800 x 600 16-bit (64k, high color) setting recommended.",
  "genres": [
    "Reference",
    "Nonfiction",
    "Dictionaries",
    "Language",
    "Writing",
    "History",
    "Linguistics"
  ],
  "author": "John Andrew Simpson",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/203829.The_Oxford_English_Dictionary"
}