{
  "title": "Detectives & Desires and Choices Introductory Collection",
  "description": "How long can Detective Raisa Gordon resist, Leo Gold, her undercover target? Especially when he has intimate knowledge that he is not afraid to use. Will the FBI’s plan to use his passion for her to bust the entire Gold operation wide open succeed? Or will Raisa surrender to her treacherous desires? A series that unfolds over multiple volumes ranging from 10,000 to 20,000 words each. Intimate Knowledge is an erotic romance with explicit sexual content with elements of BDSM. It has a delectable slow build to consummation Detective & Desires #1 Intimate Knowledge How long can Detective Raisa Gordon resist, Leo Gold, her undercover target? Especially when he has intimate knowledge that he is not afraid to use. Will the FBI’s plan to use his passion for her to bust the entire Gold operation wide open succeed? Or will Raisa surrender to her treacherous desires? A series that unfolds over multiple volumes ranging from 10,000 to 20,000 words each. Intimate Knowledge is an erotic romance with explicit sexual content with elements of BDSM. It has a delectable slow build to consummation Part1- The Prologue The countdown is reaching the final moments. Leo is determined to fully posses Raisa and she fears she will disappear into him. Leo Gold is the singular, most attractive, mesmerizing man to ever come into her orbit and he lays her core bare with intimate knowledge ripped from her subconscious. She is coming to terms with the fact that her feelings are too deeply engaged with her target. Just how the hell did she get there? This is a revised version of Part 1 with an extended prologue. Don't miss Part 2 out now is a revised version of half of original Part 1 and Part 2 Don’t miss Part 3 of Intimate Knowledge out end of December 2013 Detectives & Desires #2 Her Keeper Part 1 The feud between Detective Rick Andrews and Sara Michaels is legendary and no one ever wants to stand in the line of fire when they go at it. Only, now Sara has crossed the line and Rick is determined to use the power her transgression grants him to lay down the law in a way she can't escape. A series that unfolds over multiple volumes ranging from 10,000 to 20,000 words each. Her Keeper is an erotic romance with explicit sexual content. It has a hot cop (two actually), sexy frisking, spanking, cuffing, a crazy, hot proposition yet to come and two people who are stubbornly in love. Part 1 Rick and Sara have been fighting their feelings far too long and a roadside arrest takes their feud to combustion level. Sara decides its time she made a change. She wants to see Rick’s softer side. Rick agrees but it’s going to cost her. Don’t miss Part 2 of her Keeper now on sale individually or as part of collections Don’t miss Part 3 of Her Keeper out now Part 4 out end of December 2013 AND The Plan Choices Prequel The Plan – Chances & Choices Prequel Choices Book 1 by Helen Karol Falling in love again just isn't part of the plan. It has been a rough year for Julian West and Claire Fitzpatrick. They are both struggling with the loss of a loved one. When Andrea Saunders, a Los Angeles socialite, convinces Julian to escort Claire to the Spring Charity Ball, it begins an enduring friendship. A friendship where both comfortably forget the sizzling attraction that flared between them in the first few moments of meeting. In time, that attraction re-emerges and Julian must face emotions he has spent years repressing. A 6000 word short story prequel to Chances & Choices.",
  "genres": [],
  "author": "Helen Karol",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/20403690-detectives-desires-and-choices-introductory-collection"
}