{
  "title": "Under the Sabers: The Unwritten Code of Army Wives",
  "description": "Under the Sabers is a groundbreaking narrative detailing the complex personal challenges Army wives face, presenting a provocative new look at Army life. Tanya Biank goes beyond the sound bites and photo ops of military life and shows what it is really like to be an Army wife--from hauling furniture off the rental truck by yourself at a new duty station when your husband is in the field, to comforting your son who wants his dad home from Afghanistan for his fifth birthday--she takes readers into the hearts and homes of today's military wives.In the summer of 2002, Army wives were in the headlines after Biank, a military reporter for the Fayetteville Observer, made international news when she broke the story about four Army wives who were brutally murdered by their husbands in the span of six weeks at Fort Bragg, an Army post that is home to the Green Berets, Airborne paratroopers, and Delta Force commandos. By that autumn, Biank, an Army brat herself, realized the still untold story of Army wives lay in the ashes of that tragic and sensationalized summer. She knew the truth--wives were the backbone of the Army. They were strong--not helpless--and deserved more than the sugarcoating that often accompanied their stories in the media.Under the Sabers tells the story of four typical Army wives, who, in a flash, find themselves neck-deep in extraordinary circumstances that ultimately force them to redefine who they are as women and Army wives. In this fascinating and meticulously researched account, Biank takes the reader past the Army's gates, where everyone has a role to play, rules are followed, discipline is expected, perfection praised, and perception often overrides reality. Biank explores what happens when real life collides with Army convention.Biank describes what it means to be a wife and mother in a subculture that is in a constant state of readiness for war. In this hard-hitting and powerful book, Biank takes a close look at the other woman--the Army itself--and its impact on wives, marriages, and home life. This story of strength and perseverance is an eye-opener for those who have never experienced military life and an anthem to those women who each day live the \"unwritten code.\"",
  "genres": [
    "Nonfiction",
    "Military Fiction",
    "War",
    "Family",
    "True Crime",
    "Adult",
    "Biography"
  ],
  "author": "Tanya Biank",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/203885.Under_the_Sabers"
}