{
  "title": "The Stones of Andarus",
  "description": "The Stones of Andarus are three ancient stones said to contain a fragment of the power of creation twisted with the dark soul of a crazed sorcerer. When a demented Master Mage intends to unleash the unholy power of these ancient artifacts, it will fall to five unlikely heroes to stop him. The battle for the fate of the realm has only just begun...Legend has it that a demented sorcerer named Andarus sought to harness the power of creation…to bend it to his will. He searched throughout the realm for mystical vessels that could contain such unfathomable power and The Stones of Andarus were created. The Stones are said to contain a fragment of the power of creation along with the dark, twisted soul of the sorcerer Andarus.On this account, the legends are true.The fate of The Stones through history is not known. Some say that, despite their awesome power, they were destroyed long ago. Others claim they were divided and hidden away in the far corners of the land. Yet others believe the sinister power of the Stones has faded over the great span of time since their creation, and can never be a threat again. Then there are those who say the tale of the Stones is nothing but pure fantasy.On this account, the legends are dead wrong.Xavier, an unstable and evil Master Mage, has spent his life perfecting his mastery of not only the Mystical Arts, but the forbidden magic of the Dark Mystics. Now, at the peak of his sinister power, he has the Stones of Andarus and intends to not only unleash their unholy power, but attempt to control it.Such power, twisted by the crazed essence of a mad man, can never be controlled and dared not be unleashed, but Xavier believes he has the power and the skill to accomplish the impossible.Enter Daimion Devenshire, a mysterious loner with seductive charms, dark secrets and deep scars. He is a minor mage of the Mystical Arts, but there is a power within him that not even he is aware of...at least not yet. When he learns that Xavier has the Stones, he knows that the mad man has to be stopped or the entire realm could be forever altered if not destroyed. Joining him on his desperate quest are The Lady Brianna Standish, seductively beautiful and fiercely independent. She is a woman who lives her life on her terms, much to the chagrin of medieval society. Raven Darkseed is a rouge Adept Mage of the Mystical Arts and the closest thing to a best friend to Devenshire. Shantira Dubris is a young village woman set on vengeance and torn by the storm of emotions and sensations that Devenshrie stirs within her. Zandorth Krahl is a warrior of the Ancient Class, a vanishing breed of men who value honor and integrity above all else.From the beginning, Devenshire and company are pursued…by both friend and foe. Darius Thieberian, a vampire with special designs on Brianna, stalks the group with motives as dark as the night he lives in. Rachelle Tambrey, a unique vampire with an unexplainable interest in Devenshire, follows as well. Add a compliment of the King’s Royal Guards who have been convinced that Devenshire is a vampire by an ex-vampire hunter turned bandit, and the group’s efforts to save the realm are thwarted at every turn.Through trials and tribulations, deceptions and betrayals this group of unlikely heroes must face many obstacles in their epic quest to stop Xavier, including an opponent fiercer than any they have ever faced…the demons within themselves.The battle for the fate of the realm has only just begun...",
  "genres": [
    "Fantasy",
    "Epic Fantasy"
  ],
  "author": "Tom Sechrist",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/20406003-the-stones-of-andarus"
}