{
  "title": "Diana Tregarde Investigates",
  "description": "Long before Buffy showed the world how tough girls could be and Laurell K Hamilton shows us that you could have a vampire (or werewolf) for a boyfriend, Mercedes Lackey created Diana Tregarde. Diana is a Guardian charged with saving innocents and destroying evil wherever she finds it. Because if she doesn't, evil will find her—and kill her first.In Children of the Night, Diana is running her friend’s occult shop in New York City when trouble does finds her. Mr. Trouble, as she calls him, is a vampire whose psychic power makes her radar go off the charts. So when she discovers that he’s the new benefactor of ex-boyfriend Dave Kendall’s band, she’s not surprised to see how bad Kendall looks. It will take all of Diana’s power—and the aid of a sexy vampire protector with a score of his own to settle—if she’s to save Kendall now….In Burning Water, Diana gets a call from Detective Mark Valdez, an old college friend turned cop. When Valdez realizes that the serial killer stalking Dallas is not human, he knows he needs help. Unfortunately, Tezcatilpoca, an angry Aztec god, is on the rampage and Diana fears she’s met her match. But as luck would have it, Texcatilpoca isn’t the only god in the world.In Jinx High, Diana is summoned to Oklahoma by an old friend who fears that his teenage son is in supernatural danger from a fellow classmate. Faye Harper, the “it” girl with a mean streak a mile wide, is actually a sorceress whose power is disturbing. So disturbing, in fact, that an ancient being who slumbers underground is being awakened by it…and all hell is about to break loose—literally. Jacket art by Chris McGrath. (Approx. 800 pp.) 1989-1991.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Fiction",
    "Mystery",
    "Magic",
    "Vampires"
  ],
  "author": "Mercedes Lackey",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/2040679.Diana_Tregarde_Investigates"
}