{
  "title": "Dolmens in the Blue Mountain",
  "description": "About the Book Most of us still dream and hope to find ways out beyond violence and corruption. Using dolmens (single-chambered tombs constructed, dates back to Neolithic period 4000 to 3000 BC), as a metaphor, Dolmens in the Blue Mountain explores the meaning of life and death in the context of migrations of Kerala’s Syrian Christian community, and the struggle for survival of tribal communities in the Western Ghats mountain ranges. The story revolves around the lives of three brothers. One of them migrated to Canada. The second one joins a Delhi based NGO, bogged down by a corrupt and callous system, was forced to quit his job on moral grounds. The third one stayed back in Kerala, but got into conflict with the radicalized tribal community. Will the brothers, inspired by the dolmens, which taught them the meaning of living in harmony with nature, without compromising the resource needs of poor people and future generations, be able to fulfill their dreams and aspirations?About The Author: Dr. K. S. Sebastian lives in Delhi with his family of three school going children and wife Neena. He holds a Master degree in social work and a PhD degree in Public Health from Jawaharlal Nehru University, New Delhi. He worked in the development sector for more than two decades in varying capacities, ranging from a ‘grass roots level community worker’ to Director of an international foundation. His work took him to various parts of the world and provided opportunity to work closely with key players in the sector, across the planet. As researcher, program planner, implementer, and evaluator of social and economic development programs, he got an opportunity to understand the inside out of development work, but was disenchanted with the sector and decided to quit the job to take up writing and freelance consulting. This is his debut fiction novel, though he has been publishing research based papers, advocacy materials, and training manuals as part of his work. Dr. Sebastian originally hails from a remote village in Kerala, born to illiterate parents; he survived a childhood of poverty and hardship. The life of one of the protagonist of this story is a documentation of author’s own life largely, and real life characters inspire most of the events of this story.",
  "genres": [],
  "author": "Kandathil Sebastian",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/20404194-dolmens-in-the-blue-mountain"
}