{
  "title": "The Accidentally on Purpose Trilogy",
  "description": "Accidentally on Purpose was a New York Times Best Seller in 2012. Now author L.D. Davis releases Accidentally on Purpose and the sequels Worthy of Redemption and Worth the Fight in one book for your reading pleasure! Accidentally on Purpose: Emmy hates her boss Kyle Sterling. She does the unthinkable after a night of drinking and sleeps with him. Before she can even begin to put the enormous mistake behind her, she finds herself snowed in for a long weekend with Kyle. The pair not only get cozy while the storm rages outside, but Emmy sees a side of Kyle that she didn’t know could possibly exist beneath his hard, temperamental exterior. When the storm is over, Emmy insists on moving on, especially since Kyle has a long-standing girlfriend, socialite and heiress Jessyca Venner. Soon Emmy starts dating Luke Kessler, and even as their relationship grows serious, she finds Kyle hard to shake. Kyle aggressively pursues Emmy without mercy, despite the fact that she clearly loves Luke. Armed with the knowledge that Jessyca possess sensitive and alarming information that has the enormous potential of destroying Sterling Corporation, Kyle refuses to cut ties with her until he is able to find a way to save the family business from devastation. Emmy, unable to resist Kyle any longer, begins to make a series of bad decisions that result in heartbreaking, life altering, and even devastating consequences. Is there hope for Emmy or will she lose everything? Will she be able to forgive Kyle for a terrible act? Will she be able to forgive herself? Most importantly, is there enough alcohol in the world to deal with her loud mouth, overbearing, and over opinionated mother? Worthy of Redemption: In this sequel to the New York Times Best Seller Accidentally On Purpose, Kyle Sterling must live with his devastating actions that caused him to lose the love of his life. Conditioned by a life of tribulation starting from when he was a small child, Kyle loses all hope that he can ever deserve happiness again. Lily's heart was broken first by a tragic loss and then by the two people she cared about most in the world. After tragedy strikes again, Lily's entire world is shaken and begins to crumble piece by piece. Lily hides her heartache and secrets behind a wall of colorful hair, piercings, tattoos and a style and attitude that is all her own. When Lily is forced to take a position at Sterling Corporation working closely with Kyle, the pair quickly clash. Kyle's dick-like behavior is at an ultimate high, but Lily challenges him at every turn. Despite his personal objections regarding Lily, her background, and her appearance, Kyle is unable to deny the building chemistry between him and the little irritating \"barmaid.\" Despite his dick-like disposition and violent past, Lily fights to prove to Kyle that he is worthy – of being loved, and worthy of redemption, but Kyle is afraid of repeating history and he can’t let go of his past… ...And maybe a very important someone from his past isn’t ready to let go yet either... Worth the Fight: Worth the Fight is the third book in the Accidentally on Purpose series. In Accidentally on Purpose, Emmy Grayne broke Luke Kessler's heart in a devastating love triangle. When Emmy returns with a life-altering secret, Luke is tries to make room in his life for Emmy. The reunion is not easy, and Luke is still very bitter for what Emmy did to him. However, as more of Emmy's secrets become exposed, Luke begins to take great strides to not only repair his relationship with Emmy, but to repair her, too. Luke and Emmy struggle to find a happy ending together. The demons of their past threaten their present and future, and mistakes are made that could ruin them forever. How much is too much to fight for? Is there a time to give up or is Luke and Emmy's relationship worth the fight?",
  "genres": [
    "Contemporary Romance"
  ],
  "author": "L.D. Davis",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/20405851-the-accidentally-on-purpose-trilogy"
}