{
  "title": "Intimate Knowledge Parts 1-2 and Choices Prequel Collection",
  "description": "How long can Detective Raisa Gordon resist, Leo Gold, her undercover target? Especially when he has intimate knowledge that he is not afraid to use. Will the FBI’s plan to use his passion for her to bust the entire Gold operation wide open succeed? Or will Raisa surrender to her treacherous desires? A series that unfolds over multiple volumes ranging from 10,000 to 20,000 words each. Intimate Knowledge is an erotic romance with explicit sexual content with elements of BDSM. It has a delectable slow build to consummation Part1- The Prologue The countdown is reaching the final moments. Leo is determined to fully posses Raisa and she fears she will disappear into him. Leo Gold is the singular, most attractive, mesmerizing man to ever come into her orbit and he lays her core bare with intimate knowledge ripped from her subconscious. She is coming to terms with the fact that her feelings are too deeply engaged with her target. Just how the hell did she get there? This is a revised version of Part 1 with an extended steamier prologue. Part 2 Leo Gold has been keeping tabs on Detective Raisa Gordon. Seeing her at an art exhibit he falls for and sets out to make her his. The FBI see the opportunity to use his feelings to infiltrate the Gold crime family. Detective Raisa Gordon has the hots for a younger guy she’s never met. Will her passions for him get in the way when they meet? Will she keep it together to just turn into a hot little tramp for her target? Leo and Raisa finally meet and sparks fly. He is proving irresistible and Raisa yields just a little for an explosive encounter. This is a revised Part 2 consisting of Chapter 1-8 Part 3 starts from Chapter 9 and is out end of December 2013 The Plan – Chances & Choices Prequel Choices Book 1 by Helen Karol Falling in love again just isn't part of the plan. It has been a rough year for Julian West and Claire Fitzpatrick. They are both struggling with the loss of a loved one. When Andrea Saunders, a Los Angeles socialite, convinces Julian to escort Claire to the Spring Charity Ball, it begins an enduring friendship. A friendship where both comfortably forget the sizzling attraction that flared between them in the first few moments of meeting. In time, that attraction re-emerges and Julian must face emotions he has spent years repressing. A 6000 word short story prequel to Chances & Choices.",
  "genres": [],
  "author": "Helen Karol",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/20403813-intimate-knowledge-parts-1-2-and-choices-prequel-collection"
}