{
  "title": "Justice Healed",
  "description": "Genre: Contemporary Western Erotic Romance Series: Cowboy Justice Association FULL LENGTH NOVEL You can’t go home again, but if you do, pretend you want to be there. Dr. Madison Shay has left Chicago and moved back to her small town roots to take over her father’s medical practice. She’s not the skinny, gawky red haired, four-eyed girl any longer but it sure feels that way. She still remembers the painful teasing from her classmates and always feeling like she didn’t belong. She wants this time to be different but deep down she knows she’ll never be part of the cool crowd. Sheriff Tanner Marks might have been the captain of the football team years ago but things aren’t as rosy now. He has a son who hates him, and an ex-wife who is about to marry a man Tanner thinks might be a criminal. He doesn’t really have time in his life for a woman. Considering the things he’s done in his past, he’s not sure he deserves one either. He can’t help but feel envious of his friend, Seth Reilly, though. He found the love of a good woman. Is it too much to ask that fate send him someone as well? Madison and Tanner aren’t looking for love but it feels like the town has other plans. They keep finding themselves thrown together and it’s not unpleasant in the least. In fact, they’re starting to enjoy themselves. There just might be a future for them after all. When a drug war between two cartels breaks out, their little town is caught in the crossfire. Tanner will call in every favor he can, from the five cowboy cops he trusts most in the world, to keep his town and the woman he loves safe. He’s going to show the bad guys what cowboy justice really means. Publisher’s warning: This book contains hot sex scenes between a sexy small town sheriff and his very lucky woman, including action in the shower, on the kitchen table, and in front of a roaring fire. Series description: The Cowboy Justice Association is a group of six lawmen in Montana who work together to keep the peace. If only they could find that peace in their own lives. For more information, please visit www.OliviaJaymes.com",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Westerns",
    "Suspense",
    "Contemporary",
    "Contemporary Romance",
    "Erotica"
  ],
  "author": "Olivia Jaymes",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/20409744-justice-healed"
}