{
  "title": "Southampton Swindle",
  "description": "By reader and reviewer request, the story of Nathanial and Sebastian and how they met.Liars are in need of good allies.Southampton, 1786: Since being tossed from his ancestral family home at thirteen, and falling in with a swindler, Sebastian has been fighting to preserve life and limb any way he can. While ingratiating himself with Lady Wandsworth and her thousands of pounds, Sebastian meets another roguish charmer, Nathanial, and at his side, the pretty but deadly Anne. Sebastian's world is abruptly changed as he is introduced to imagination-defying ideas and is snared in an international swindle involving the Queen of France's diamond necklace.Sebastian is drawn to Nathanial and his worldly, experienced ways, until Anne reveals the truth about him and the necklace.... This book contains two hot, sexy alpha heroes, frequent, explicit and frank sex scenes and sexual language.It includes heart-stopping sexual scenes between the aforementioned sexy heroes, menage scenes, and anal sex. Don't proceed beyond this point if hot love scenes offend you.No vampires were harmed in the making of this novel.___This is a Blood Drops book. Blood Drops are short and novella length stories featuing the characters and situations in the Blood Stone series. Droplet sized morsels for your reading pleasure.The Blood Stone Blood Stone 1: Blood Knot (#1 Amazon Best Seller, Fantasy Romance)Blood Drops 1.1: Southampton SwindleBlood Drop 1.2: Broken PromiseBlood Stone 2: Blood StoneBlood Stone 3: Blood UnleashedBlood Stone 3.5: Blood Drive - Blood Stone Boxed Set 1Blood Stone 4:  Blood Revealed (Upcoming)These are continuing characters and storylines. Reading the series in order is strongly recommended. Click here for series information.___Tracy Cooper-Posey is an Amazon #1 Best Selling Author. She writes erotic vampire romances, hot romantic suspense, paranormal and urban fantasy romances. She has published over 70 novels since 1999, been nominated for five CAPAs including Favourite Author, and won the Emma Darcy Award.She turned to indie publishing in 2011. Her indie titles have been nominated four times for Book Of The Year and Byzantine Heartbreak was a 2012 winner. She has been a national magazine editor and for a decade she taught romance writing at MacEwan University.She is addicted to Irish Breakfast tea and chocolate, sometimes taken together. In her spare time she enjoys history, Sherlock Holmes, science fiction and ignoring her treadmill. An Australian, she lives in Edmonton, Canada with her husband, a former professional wrestler, where she moved in 1996 after meeting him on-line.Her website can be found at TracyCooperPosey.com. Tracy appreciates hearing from readers and can be reached at Tracy@TracyCooperPosey.com.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "M M F",
    "Vampires",
    "Paranormal Romance",
    "Menage",
    "LGBT"
  ],
  "author": "Tracy Cooper-Posey",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/20409109-southampton-swindle"
}