{
  "title": "In the Mix",
  "description": "*** This book contains the GEGs! For those of you who don't understand that warning: GEGs=Strong language, gut-busting LOL moments caused by best friends who check their maturity at the door when they're together, and impromptu Kegal exercises. This book does not come with batteries. Though it can be read as a standalone, I recommend reading the series in order (though not necessary) since all the books will have a continuation of EVERYONE'S story. Enjoy! ***  CiCi O’Brien has a weapon of mass destruction—her mouth. It’s always loaded and ready to strike, whether the situation calls for laughter or a professional smartass. It’s been her strongest defense against unwanted feelings over the past fifteen years. If she acts like she doesn’t care, then she won’t, right?  Yeah . . . keep telling yourself that, Ceese!  Luckily for CiCi, she’s surrounded by friends and family who can easily see through her façade. They (and the furballs she takes care of at work) are who enrich her life, have been the ones she’s needed. That is, until the day her life changed—when she grabbed it by the balls.  No, seriously . . . she grabbed him by the balls. Not kidding.  Kyle Cooper has it all. He’s smart, handsome, and a ninja (not really, but that’s what Mitch likes to call him). As vice president of Colton Technologies, he travels around the world with Mitch, bringing companies the latest innovations in automobile technology. At home, he’s a force to be reckoned with, always hanging out with his parents and sister or . . . working.  Oh.  Kyle Cooper does not have it all, and he’s ready for a change. He just isn’t sure where to begin. That is, until CiCi O’Brien walks into his office and grabs this bull by the . . . horns (wink), which causes a spark to ignite in both of them. Kyle embraces it. CiCi does everything, short of calling the fire department, to put it out. Who will prevail? And what will that win truly mean?",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "Adult",
    "Humor",
    "Chick Lit",
    "Erotica"
  ],
  "author": "Jacquelyn Ayres",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/20410863-in-the-mix"
}