{
  "title": "Magic & Mayhem on the Nile",
  "description": "Amid luscious scenes of Egyptian culture and history, four teenagers endure mistakes, missteps, and plenty of hilarity Told in four alternating points of view, Tyne O'Connell's latest novel MAGIC & MAYHEM On THE NILE (USA title \"True Love, The Sphinx & Other Unfathomable Riddles\") is both a fast-paced comedy-of-errors, and a heartfelt romance that proves that sometimes, the greatest complication of all is love Four teens from two very different parts of the world find themselves immersed in one class trip to the land of the sphinx and pyramids, Egypt. All four teens will cross paths that lead to miscommunication, secrets, and a whole lot of love. This will be one class trip that they will never forget. A romantic comedy, told in four points of views, MAGIC & MAYHEM ON THE NILE is one read you do not want to miss. All four characters go through life-changing experiences that will make them stronger and make us, the reader, laugh. Who knew that teenage love could be so complicating and so amusing? \"A Breezy, escapist and relatively chaste romance for fans of the Gossip Girl Books\" Gillian Engburg THE BOOKLIST “Outrageously funny and a serious contender for the teen chick-lit throne.” — THE BOOKSELLERTold in four alternating points of view, Tyne O'Connell's latest novel MAGIC & MAYHEM On THE NILE (USA title \"True Love, The Sphinx & Other Unfathomable Riddles\") is both a fast-paced comedy-of-errors, and a heartfelt romance that proves that sometimes, the greatest complication of all is loveFour teens from two very different parts of the world find themselves immersed in one class trip to the land of the sphinx and pyramids, Egypt. All four teens will cross paths that lead to miscommunication, secrets, and a whole lot of love. This will be one class trip that they will never forget.A romantic comedy, told in four points of views, MAGIC & MAYHEM On THE NILE is one read you do not want to miss. All four characters go through life-changing experiences that will make them stronger and make us, the reader, laugh. Who knew that teenage love could be so complicating and very amusing?",
  "genres": [
    "Young Adult",
    "Romance",
    "Teen",
    "Boarding School"
  ],
  "author": "Tyne O'Connell",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/20416066-magic-mayhem-on-the-nile"
}