{
  "title": "Perfectly Wicked: A Novel",
  "description": "Charmed meets Ghosthunters in this magically wicked paranormal romance, perfect for fans of Not the Witch You Wed and The Ex Hex.Holly Celeste and her sisters make the best apple cider in Maine—courtesy of a magical secret ingredient—but even that hasn’t been enough to keep their orchard afloat. To save the family business, Holly accepts a proposal to let a ghost hunting series film an episode on her farm. Connor Grimm may be the sexy and down-to-earth TV host the nation loves, but to Holly he represents her greatest exposure. Holly doesn’t mind if Connor chases down a silly ghost story—it’s their other secret she’s terrified he’ll reveal.Connor Grimm’s life goal is to normalize the paranormal, which he does on his show, Grimm Reality. Except he isn’t only looking for a ghost at Wicked Good Apples. There have been rumors of rain during droughts and other inexplicable happenings that could only be attributed to something supernatural, and Connor plans to expose it on an episode that will take his show’s success to another level.Intent on keeping Connor in the dark, Holly joins him as he interviews eyewitnesses, hunts for old records, and unearths a story even she didn’t know existed. Despite her resolution to dislike him, she begins to fall for the only man who’s ever made her feel like strange could be normal. Too bad a relationship with Connor could only be he moves to a new state every month, and there’s no room in his life for a woman with a pet hedgehog, a houseful of nosy aunts and sisters, and a failing apple orchard.When Connor finally pieces together Holly’s greatest secret, he’s forced to choose between revealing his biggest paranormal discovery yet and propelling his show to the top of the charts, and giving it all up for the wicked woman who’s charmed his heart.",
  "genres": [
    "Romance",
    "Paranormal",
    "Fantasy",
    "Witches",
    "Paranormal Romance",
    "Halloween",
    "Audiobook"
  ],
  "author": "Lindsay Lovise",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/204132605-perfectly-wicked"
}