{
  "title": "Freedom At Midnight",
  "description": "The end of an empire. The birth of two nations.Seventy years ago, at midnight on August 14, 1947, the Union Jack began its final journey down the flagstaff of Viceroy’s House, New Delhi. A fifth of humanity claimed their independence from the greatest empire history has ever seen—but the price of freedom was high, as a nation erupted into riots and bloodshed, partition and war.Freedom at Midnight is the true story of the events surrounding Indian independence, beginning with the appointment of Lord Mountbatten of Burma as the last Viceroy of British India, and ending with the assassination and funeral of Mahatma Gandhi. The book was an international bestseller and achieved enormous acclaim in the United States, Italy, Spain, and France.“There is no single passage in this profoundly researched book that one could actually fault. Having been there most of the time in question and having assisted at most of the encounters, I can vouch for the accuracy of its general mood. It is a work of scholarship, of investigation, research and of significance.”—James Cameron, The New York Sunday Times“Freedom at Midnight is a panoramic spectacular of a book that reads more like sensational fiction than like history, even though it is all true….. The narrative is as lively, as informative and as richly detailed as a maharaja’s palace.”—Judson Hand, The New York Daily News“Outrageously and endlessly fascinating is my awestruck reaction to Freedom at Midnight. The new sure-to-be bestseller by Larry Collins and Dominique Lapierre. It is all here: maharajas and tigers, filth and squalor, extravagance and macabre sex, massacres, smells, starvation, cruelty and heroism. Collins and Lapierre have made human history breathtaking and heartbreaking.”—Margaret Manning, The Boston Globe“No subject, I thought, as I picked up Freedom at Midnight, could be of less interest to me than a story of how Independence came to India after three centuries of British rule. I opened the book and began to flip through the photographs: here was a picture of Gandhi dressed in his loincloth going to have tea with the King of England; there was a picture of a maharaja being measured against his weight in gold; and another of thousands of vultures devouring corpses in the street. I began to read, fascinated. Here was the whole chronicle illustrated with anecdotes and masterful character sketches of how the British had come to India, how they had ruled it and how, finally, compelled by the force of economics and history, they had been forced to leave it divided…… Collins and Lapierre are such good writers that their books are so interesting that they are impossible to put down.”—J.M. Sanchez, The Houston Chronicle",
  "genres": [
    "History",
    "Nonfiction",
    "India",
    "Politics",
    "Historical",
    "Pakistan",
    "Asia"
  ],
  "author": "Dominique Lapierre",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/204123.Freedom_At_Midnight"
}