{
  "title": "Dawnland",
  "description": "On a fated summer getaway in Cape Cod, two families on the verge of fracture contend with the secrets of the past in a powerful and moving novel by the author of April & Oliver.April, her brother-in-law Oliver, and their families reunite in Cape Cod on an exquisite stretch of beach called Dawnland. After eleven summers of building traditions—kayaking, whale watching, bonfires, and ocean swims—this year comes with new threats both on and off the coastline.Before their marriages, April and Oliver had an intense but disastrous fling that they kept hidden. Although they moved on with their lives, their more recent fiery encounter is getting harder to keep secret—especially as the week unravels, revealing fault lines not only between husbands and wives but between brothers, fathers and sons, and children growing up amid discord and lies. Ground zero for conflict is April’s volatile teenage son, Lochlann.The family structure begins to teeter. Secrets are surfacing. As everyone faces the consequences of their choices, the truth could finally forge them together or tear them apart forever.ADVANCE PRAISE:\"Occasionally a book burns into your occipital lobe unable to leave you. How do you stop longing for something you can never have? Dawnland is a poignant reminder that the longings inside of us never go away. Tess Callahan killed me softly with this book. My heart is still in her hands…” ~ Tarryn Fisher, NY Times Bestselling Author of The Wives & Good Half Gone\"Tess Callahan writes with furious urgency about yearning and desire. As family secrets are gradually revealed, the reader begins to glimpse how we are all complicit in the dance. Emotionally powerful, Dawnland explores questions of betrayal, guilt and loss, and the high cost we must pay for genuine freedom. The ending will stay with you long after you turn the final page.\"- Alan Watt, LA Times bestselling author of Diamond Dogs and The 90-Day Novel“Tess Callahan works magic in her novel DAWNLAND, writing with mesmerizing lyricism and wisdom about an extended family’s fraught week on Cape Cod. On the eve of their widowed father’s second marriage, two brothers as different as night and day gather with their wives and children for an annual vacation by the ocean that turns out to be anything but mundane. DAWNLAND is a deeply intelligent story about marriage, parenting, adolescence, and the challenge of reckoning with one's choices. I loved it.”~ Karen Dukess, author of The Last Book Party",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Audiobook"
  ],
  "author": "Tess Callahan",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/204118316-dawnland"
}