{
  "title": "The World Duology",
  "description": "Set in the nineteenth century, The World Duology (World Odyssey / Fiji: A Novel) follows the fortunes of three young travelers. Their dramatic adventures span sixteen years and see them engage with Native American Indians, Barbary Coast pirates, Aborigines, Maoris and Pacific Islanders as they travel around the world – from America to Africa, from England to the Canary Islands, to Australia, New Zealand, Samoa and Fiji. In book one, World Odyssey, ambitious American adventurer Nathan Johnson, sheltered English missionary Susannah Drake and irrepressible Cockney Jack Halliday each follow very different paths. Nathan’s journey begins when runs away to sea and finds himself the slave of a Northwest American Indian tribe after his ship founders on the rocky coast; Susannah’s journey begins after she agrees to accompany her clergyman father to Fiji to help him run a mission station there, and they must endure a nightmare voyage they’re lucky to survive; Jack’s journey begins when he’s sentenced to seven years’ hard labor in the British penal colony of New South Wales after stealing hemp from an unscrupulous employer. After traveling thousands of miles and experiencing the best and worst that life can offer, these three disparate individuals eventually end up in the remote archipelago of Fiji, in the South Pacific, where their lives intersect. In book two, Fiji: A Novel, Jack sets himself up to trade Fijian kauri to European traders while Nathan trades muskets to the same natives Susannah and her father are trying to convert to Christianity. Conflict’s inevitable. Susannah despises Nathan, but is also attracted to him. She soon finds she’s torn between her spiritual and sexual selves. When their lives are suddenly endangered by marauding cannibals, all three are forced to rely on each other for their very survival.",
  "genres": [
    "Historical Fiction",
    "Adventure",
    "Coming Of Age",
    "Religion",
    "Young Adult",
    "Travel",
    "Historical Romance"
  ],
  "author": "Lance Morcan",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/20410937-the-world-duology"
}