{
  "title": "Chosen by Fate",
  "description": "Chosen. By its very essence, the word chosen is one of finality. What you’ve chosen becomes your destiny. Unless, by chance, fate has chosen otherwise. But choice is a double edged sword, as Will and Sarah find out when it cuts their lives into ever more hard to assemble pieces.  What was the point of hoping, planning, dreaming? What was the point of loving? It could all be taken, and for Will, it had been. Helplessly bound by his obligations, he watches the love of his life drifting slowly, irretrievably away. How can keeping his promise to Sarah, and keeping his vow to do anything to protect his family come to this? How can such love summon such pain?  As fate would have it, Sarah is asking herself that very same question. As she struggles to escape the ether ties of amnesia, she gropes the dark corners of her heart, trying to grasp something solid, something to hold. But life is forcing Sarah to seek the very answers she fears most. Can there be something even more powerful than love? Putting a thousand-piece puzzle together through her dark days of forgetfulness, Sarah slowly snaps one faintly matched memory into place after another, as a familiar picture slowly begins to emerge from the foggy past. And the more her memories creep back in, bringing with them a desire smoldering just beneath the surface of her shattered life, she begins to realize the question that has taunted her for so long, is upon her again. Will, or Adley?  Both Will and Sarah share their hopeless closeness as their choices lead them ever further apart. What they’ve chosen for themselves involves others, and promises made have overgrown the road behind them. If there is no going back, the only way forward is straight through the gates of fate.  As they enter, deep family secrets explode from the shadows of their pasts, secrets that cut so deeply, no one will ever be the same, no one will ever forget, and ever-lurking death will snatch its due. Neither Will nor Sarah ever had a chance to choose. Fate had chosen their path long ago. And now, fate has brought them to their final destination. Will they choose to accept it? Do they even have a choice?  This is book three of the New Adult Romance Series: Fate's Path. The books are not stand alone. For your reading enjoyment, please read the books in order. 1--Surrender to Fate 2--Shattered by Fate 3--Chosen by Fate   Recommended for 18+ for new adult content and explicit scenes. If you love steamy coming of age and unique historical romance novels that spin an emotional story all around you, scroll up and add this love story to your kindle now!",
  "genres": [
    "New Adult",
    "Romance"
  ],
  "author": "Jacelyn Rye",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/20411173-chosen-by-fate"
}