{
  "title": "Windy City: A Novel of Politics",
  "description": "The acclaimed author of the intensely powerful novel Pretty Birds , Scott Simon now gives us a story that is both laugh-out-loud funny and heart-piercing–as sprawling and brawling as Chicago, where politics is a contact sport.The mayor of Chicago is found in his office late at night, sitting in his boxer shorts, facedown dead in a pizza. The mayor was a hero and a dynamic, charming, ingenious, corruptible, and a masterly manipulator. The city mourns. But it’s discovered that the mayor was murdered–shortly after he may have begun to squeal on some of his colleagues at City Hall. Over the next four days, police race to find the mayor’s killer, while the politicians who bemoan his passing scramble for his throne.At the center is Sundaran “Sunny” Roopini, forty-eight, alderman of the Forty-eighth Ward, and vice-mayor. Sunny is an Indian immigrant, a restaurant owner, and a recent widower. He is getting tired of politics and wants to hold on just long enough to do the best for his two restive teenage daughters. But as acting interim mayor for a few days, Sunny must deal with forty-nine other aldermen who have their own clashing ambitions.How will Sunny do what’s best for both his family and city in a time of crisis?As The Last Hurrah embodied urban politics for a previous generation, Windy City captures politics in the multiethnic tumult of today’s big city, where a stalled subway raises fears of a terrorist attack and smoke-filled rooms are abolished by no-smoking statutes. The story takes a raft of colorful characters–pinky-ringed pols, pious reformers, money-grubbers, and wheeler-dealers of every creed, color, and proclivity–through City Hall corridors, neighborhood restaurants and clubs, weddings, sex scandals, gospel churches, police stations, and sting operations to deliver an ending that is unexpectedly noble.Windy City is a roller coaster of a novel that dips and soars through the amusement park of politics. With echoes of Primary Colors and Thank You for Smoking , Windy City will win votes as the best political novel in many years. Its personal story–about a flawed, decent man thrust suddenly under hot lights–will also win hearts.Praise for Windy “Delectable… Offers an insider’s view of the kind of urban political fray–albeit fictional–that Barack Obama emerged from as an Illinois state legislator representing Chicago’s South Side…. Windy City’s articulate and witty protagonist … must juggle dirty secrets and deal making…”– USA Today“Comic but sneakily affecting… The rich multiculturalism of the American city is not a new phenomenon… rarely, however, has it been depicted with such unabashed affection... The zeal with which he celebrates the city, warts and all, is hard to resist.. Simon’s choice of hero…is an immensely appealing figure.”– Washington Post Book World“Pitch-perfect… Scott Simon, NPR host, knows his way around politics… His dialogue throws off sparks and shrieks like a Chicago El-car…Recommended to all political junkies.”– The Roanoke Times (Virginia)“A hilarious satirical novel about politics.”–Clarence Page, The Chicago Tribune“ Entertaining and well-observed … renders the inner workings of City Hall with wit and aplomb….Some of Simon’s Chicagoans may be con artists, crooks, amoral opportunists or blowhards, sometimes all of the above, but the author still treats them with great affection and respect, creating an impressively large and diverse cast of characters”–Adam Langer, The Chicago Tribune“[A] great novel … filled with emotional turmoil, gritty political decisions, murders, homicide attempts, a suicide and even a touch of romance…[a] human and fully realized portrait of the people caught up in contemporary public life.”– Time Out Chicago“[A] big-hearted bear-hug of a novel … embracing roots and family, eccentricities and failings, and dappled with the sights, sounds and grit of the Windy City–makes this an energizing and loving contemporary urban fable.”– GO Magazine, AirTran Airways“A rather sentimental, positive picture of the democratic process.” — Pittsburgh Post-Gazette“ Windy City is funny and tender … full of boisterous love for the sport of politics and Chicago.  The best political novel in years.”–Christopher Buckley, author of Boomsday and Thank You for Smoking",
  "genres": [
    "Fiction",
    "Politics",
    "Mystery",
    "Novels",
    "Book Club"
  ],
  "author": "Scott Simon",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/2041754.Windy_City"
}