{
  "title": "You Can See Me",
  "description": "World renowned chef, Prescott Vaughan was at the height of his career. Right before he's to leave for Paris to work alongside his idol, a horrific car accident leaves him completely blind. His female fiancé leaves him in a state of desperation and depression. He pines for love, companionship, and so happens to find it in the form of his very sexy neighbor. Sexy male neighbor, Dr. Rickson 'Ric' Edwards. Prescott's not gay - at least he never considered himself gay - until Ric saves him from a date, gone terribly wrong. The two neighbors hit it off quickly and waste no time exploring and learning each other. Things are great until Ric begins to have his doubts about meeting Prescott's many wants. When Ric insist he and Prescott take a breather, Pres finds himself lonely and miserable again. Enter, male escort and aspiring chef, Blair McKenzie to fill the void. In the meantime, Ric works on his issues that prohibit him from displaying the love he knows he has for Prescott. When Ric is finally ready and returns to claim Prescott he's not sure that Pres can let go of the sexy, southern, hotness that is Blair McKenzie. After Ric has his own personal encounter with the sinfully sexy man, he can't help but become entranced and crave more as well. Pres soon realizes that there's no need to choose between his two men, because when all three of them finally come together - grab a cold drink - because the heat is going to go all the way up! ​This is not your typical gay ménage romance. Everyone is not happy, skipping along, and loving life. These men are at each other’s throats. They live completely separate lives; fuss, cuss, and fight until they all realize exactly what the problem is...too damn much sexual tension.​",
  "genres": [
    "M M Romance",
    "M M M",
    "Romance",
    "Menage",
    "Contemporary",
    "Disability",
    "Audiobook"
  ],
  "author": "A.E. Via",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/20416316-you-can-see-me"
}