{
  "title": "Quality Snacks",
  "description": "In a wide range of forms and tones, the fifteen stories in Andy Mozina’s new collection, Quality Snacks, center on high-stakes performances by characters trying to gratify both deep and superficial needs, often with unexpected consequences. Driven by strange ambitions, bungled love, and a taste for—or abject fear of—physical danger, the collection’s characters enact the paradox in the concept of a quality snack: the dream of transmuting the mundane into something extraordinary.Two teenage boys play chicken on a Milwaukee freeway. A man experiencing a career crisis watches a seventy-four-year-old great grandmother perform an aerial acrobatics routine at the top of a swaying 110-foot pole. Desperate to find a full-time job, a pizza delivery man is fooled into a humiliating sexual demonstration by a couple at a Midway Motor Lodge. A troubled young man tries to end his father’s verbal harassment by successfully hunting a polar bear. After an elf civil war destroys his Christmas operation, Santa Claus reinvents himself as a one-man baseball team and ends up desperate to win a single game. And in the title story, a flavor engineer at Frito-Lay tries to win his boss’s heart with a new strategy for Doritos that aims to reposition the brand from snack food to main course.While some stories embrace pathos and some are humorous and some are realistic and some contain surreal elements, all of the stories in Quality Snacks share striking insight and a cast of compelling, well-conceived characters. This collection, in an earlier form, has been a finalist for the Flannery O’Connor Short Fiction Award, the Dzanc Short Story Collection Contest, the Elixir Press Fiction Award, and the Autumn House Fiction Contest, and a semi-finalist for the Mary McCarthy Prize. Readers of fiction will be satisfied by the variety of fare offered by Quality Snacks.",
  "genres": [
    "Short Stories"
  ],
  "author": "Andy Mozina",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/20419217-quality-snacks"
}