{
  "title": "صياد الملائكة",
  "description": "تصدر عن دار الربيع العربي رواية \"صياد الملائكة\" في روايته الجديدة \"صيَّاد الملائكة\" يطرح هدرا جرجس قضية الفتنة الطائفية في الصعيد، وعلاقة المسلمين بالمسيحيين ودور الدولة والكنيسة في التعامل مع مشكلات المسيحيين... كلمة الغلاف:كان صغيرًا جدًّا، بحيث إنه بالكاد ملأ راحة يده عندما فرده فوقَها، وهو يتأمَّله بدهشةٍ، ورهبةٍ، ويتحسَّس، بصورة أقرب إلى الوَجد، تلك النعومة الطاغية، التي من فرطها أحسَّ أنه لا يلمس شيئًا، رغم أنه مرَّره، أكثر من مرةٍ بين أصابعه، وكان قبلَها قد جرَّب أن يطويه، طيَّات كثيرة وصغيرة، حتى صار بإمكانه أن يدسَّه ـ لو أراد ـ داخل علبة سجائر، وهذا، في حدِّ ذاته، ما لا يحتمل التفكير فيه، إنه سِحر، والأدهى كان إحساسه اليقيني بأن هذا الموقف ما هو إلا رسالة نازلة من السماء.**** هدرا جرجس، صاحب رائعة \"مواقيت التعرّي\" والتي وصلت إلى القائمة الطويلة بجائزة البوكر العربية وكانت المنافسة محتدمة مع الروائي الكبير البهاء الطاهر \"بهاء طاهر\"، ونال عنها جائزة ساويرس المركز الأول، ثم أصدر متتالية قصصية عنوانها \"بالضبط كان يشبه الصورة\" نال عنها جائزة الدولة التشجيعية.****قريبا بمكتبة الربيع العربي 17 ش مجلس الشعب - ميدان لاظوغلي - مترو سعد زغلول وبجميع المكتبات الكبرى وبمكتبات المحافظات وفي جميع أنحاء العالم عبر شركة نيل وفراتوفي معرض القاهرة الدولي للكتاب 2014 صالة 2 جناح الربيع العربي****هدرا جرجسولد في 7 يناير 1980 بأسوان.تخرج في كلية الآداب، قسم الصحافة، سنة 2000، ويعمل صحفيًّا. عضو لجنة القصة بالمجلس الأعلى للثقافة ونقابة الصحفيين واتحاد الكتاب.صدر له:1- مواقيت التعرِّي ـ رواية.طبعة أولى ـ سلسة إبداعات ـ الهيئة العامة لقصور الثقافة 2007.طبعة ثانية ـ سلسة الأعمال الخاصة ـ الهيئة العامة لقصور الثقافة 2009.حصلت على المركز الأول في جائزة ساويرس للأدب المصري 2008.ووصلت للقائمة الطويلة لجائزة البوكر في دورتها الأولى 2008.2- بالضبط... كان يشبه الصورة ـ قصص متتالية.طبعة أولى ـ الدار للنشر والتوزيع 2010.طبعة ثانية ـ الهيئة العامة للكتاب ـ مكتبة الأسرة 2013.حصل عنها الكاتب على جائزة الدولة التشجيعية 2011.3- عصفور الجنة ـ حكاية للأطفال.كتاب قطر الندى ـ الهيئة العامة لقصور الثقافة ـ 2013.",
  "genres": [],
  "author": "هدرا جرجس زخارى",
  "average_rating": "2.87",
  "url": "https://www.goodreads.com/book/show/20416277"
}