{
  "title": "The Card: A Van Stone Novel",
  "description": "Van Stone has it all, the perfect family, great friends and the best job in the world. Then, his life falls apart. Thrust into a deadly plot masterminded by unknown enemies, Van is in a race against time to save those closest to him. When Van wins an essay contest to become the new batboy for a Major League baseball team, he finds himself in a foreign world of million dollar athletes and fame. Forced into the spotlight, Van is uncomfortable in his new role. His instant fame at South Seattle High School has turned all eyes toward him, including unknown adversaries that want something he has. Jack Stone works for Biotrust, a large and secretive biotechnology company. Van’s father is on the verge of making one of the most stunning discoveries in over a century, a technology that could change the world forever. While finishing the project, Biotrust forces Van’s father into a leave of absence. In an effort to protect his secrets, Jack may have endangered his family. As The Card barrels forward, Van slams headfirst into a plot that threatens the people near to him. Working through adversity, Van finds an inner strength. He draws on his deductive powers and an unstoppable attitude, to battle the corrupt forces. Not knowing who to trust, Van sets out with his two best friends to solve the secrets behind an innocent gift, a Moe Berg baseball card. Set in Seattle, Washington, this fast-paced mystery takes you behind the scenes in professional baseball and into a world of cutting edge science and technology. Full of unexpected twists and high stakes drama, this first in a series adventure will keep you guessing until the final scene. As fresh as today’s headlines, Jim Devitt, in his debut novel, weaves a suspenseful ride that blows the lid off scientific advancement, in a story of breathtaking action and suspense.",
  "genres": [
    "Young Adult",
    "Mystery",
    "Sports",
    "Baseball",
    "Fiction"
  ],
  "author": "Jim Devitt",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/11141672-the-card"
}