{
  "title": "Forbidden Fruit: Volume Two",
  "description": "A collection of erotic forbidden romance novellas from some of today's bestselling authors.Release date: April 2014Novellas include:Dancing with Desire by Kasey MillsteadThe rules are clear: No sex with the patrons. Dance like no one’s watching. Fuck them with your eyes.Make love to them with your moves. But, no sex with the patrons. Ever.Why is it, when someone tells you not to do something…or someone…you immediately want to do what they told you not to?In Ana’s case, that someone is Ethan Faulkner. Rich, sexy and confident, and a patron of the exclusive gentleman’s club where she works as a dancer.Will Ana play by the rules, or will Ethan have her Dancing with Desire?Sins of the Flesh by Adriane LeighShe walked into his church wounded and seeking solace, what she didn't expect to find was temptation so sharp and sweet under one snow-white collar. Their relationship was never innocent. From the beginning, their attraction was combustible; the magnetism all-consuming; the sexual tension explosive, begging them to succumb to their dark desire in . . . sins of the flesh.Duty of Care by Lisa EdwardFor Toni Masters, moving from a small country town to the city, to pursue her nursing career, is a dream come true. But her first day on North Ward is not what she had hoped for. Toni’s first patient encounter is with twenty-six year old Michael Davidson, or Harley as he is known to his friends. Harley is difficult and miserable being stuck in a hospital bed, and only seems happy when he has the nurses running in circles. But all Harley’s efforts to antagonize the new nurse, only make Toni push back and give as good as she gets.A mutual respect is born along with a growing attraction, and Toni vows to do all she can to make Harley’s stay in North Ward as comfortable as possible. But how far will Toni take her duty of care?Her Secret Service by Liv MorrisWhen a hot Secret Service agent meets a beautiful nymphomaniac, rules are broken. Cammie Douglas is a spoiled and promiscuous beauty who's completely out of control. She attends Southern Methodist University where her life revolves around finding her next hook-up. Her father, Senator Anthony Douglas is a candidate for President and fears his \"little\" girl's latest public scandal could damage his campaign. He bribes Secret Service agent Jude Warner into watching Cammie and hopefully reining in her careless behavior. Jude is dark and handsome, the silent-type, trained to live a life of control and regiment. When he meets Cammie, Jude fights a raw sexual attraction to her making his life both heaven and hell. Naughty Cammie is determined to have him join her on the wild side by playing a game of sexual seduction. Can Jude resist his desire to possess Cammie? Or will he sacrifice everything he stands for to be with her?Burning Desire by Vicki GreenA young eighteen year old Riley Morris has been in a nursing program for almost a year now but little did she know she would soon be living in a mansion with Parker Wright, a thirty five year old sexy man and taking care of his dying bedridden wife. Parker has made it no secret to Riley of his desire for her once she moves in but she’s trying not to give in to her own desire for him with the guilt of situation that has her there but can she? Will she?What Mother Doesn't Know by Nikki WorrellGabriella Tuttle is a 19 year old girl who works for her step-father’s construction company. She lives at home with her mother and step-father, Sofia and Rick Jameson. They were a happy family until 2 years ago when Sofia fell in with the wrong crowd in an effort to recapture her youth.At the age of 37, Rick has had enough. He’s done with Sofia’s abusive behavior. He’s done watching her lying around the house, strung out on the drug of the week. But he is not willing to leave Gabriella alone with her. As wrong as he knows it is, Rick has had an unhealthy attraction to his step-daughter from the time she started high school. Now that Gabby’s an adult, and Rick’s ready to get Sofia out of his life, dare he make the move to become something other than a step-father to Gabby? His mind isn’t so sure, but his body has been ready for years.The Taste of Mr. Davenport by Jessica IngroCarter Davenport has watched his daughter’s best friend Claire come out of her shell over the last two years. And what has been exposed has him more than intrigued. He’d like nothing more than to peel back her layers and devour what’s underneath, but Claire is officially off limits to him.When Claire Reynolds met Elisa Davenport during her first year of college, she never dreamed she'd one day find herself having an illicit affair with Elisa's unbelievably sexy father. Now that she’s had a mouthwatering sample, she wants more. After all, one taste is never enough…One promising summer vacation leads to stolen glances, erotic touches and steamy encounters neither can forget. Like all things taboo, will their relationship have an expiration date? Or will Claire show Carter they are more than just a forbidden romance?Wicked, Wicked, Wicked Witch, by Penny Reid Maleficent Taylor has a problem, she’s a witch who is infatuated with a prince. She’s not a real witch, but she does play one at the largest theme park in the world. This prince, however, is strictly off limits and he has been since their families clashed eight years ago, ending with her parents divorced and her brother in jail. In life and in the movies, the beautiful princess always ends up with the handsome prince, and the witch always loses. But, much to Maleficent’s dismay and surprise, fate has thrown them together in a rainstorm, and everyone knows what happens when a witch gets wet.",
  "genres": [
    "Romance",
    "Anthologies",
    "Contemporary",
    "Novella",
    "Short Stories",
    "Erotica",
    "Contemporary Romance"
  ],
  "author": "Kasey Millstead",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/20416860-forbidden-fruit"
}