{
  "title": "Dancing on the Wind",
  "description": "\"I am going to die, she thought. It is sunny, and the whole of London is happy and joyous because I am going to die.\"  The great Marquess herself had come to enjoy the show.  \"Speech! Speech!\" roared the crowd.  Polly raised her hands and the crowd fell silent.  \"My lords, ladies, and gentlemen,\" said Polly from the foot of the gallows. \"Why is it that such as I who am poor and have nothing should hang for a petty theft when such as she,\" - here Polly paused and pointed straight toward the woman who'd captured her - \"Mrs. Blanchard, that abbess of Covent Garden, can commit murder on the souls of innocent country girls over and over again, and yet go free!\"  With those words Polly said her farewells and at last, \"I bid you good day, my friends. We shall meet again. For such as you who enjoy a spectacle such as this will surely roast in hell!\"  ABOUT THE SERIES  Determined heroines run the gamut from those who set out by running a confectioners sweet shop to others who are willing to disguise themselves as boys to get by and do what they have to do. Whatever the matter, the Regency series brings us heroines of style, grace, and determination - women who are not afraid to use their smarts to seek the stature or standing they feel they need. They may come from humble beginnings (or not, depending) but what these heroines share is a determination unmatched that leaves us turning page after page as we follow them in their dance.  ABOUT THE AUTHOR  From 1977 to the early 1990s, Marion Chesney wrote over one hundred romance novels. Now writing as M. C. Beaton, she is the bestselling award-winning author of two internationally successful mystery series - HAMISH MACBETH and AGATHA RAISIN. She lives in the United Kingdom.",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Audiobook",
    "Historical",
    "Regency",
    "Fiction"
  ],
  "author": "Sarah Chester",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/20419378-dancing-on-the-wind"
}