{
  "title": "I'll Be Waiting",
  "description": "From New York Times Bestselling author Kelley Armstrong comes a spellbinding new tale of supernatural horror involving a haunted-house, seances, lost loved ones, and a sinister spirit out for blood...Nicola Laughton never expected to see adulthood, being diagnosed with Cystic Fibrosis as a child. Then medical advances let her live into her thirties and she met Anton, who taught her to dream of a future… together. Months after they married, Anton died in a horrible car crash, but lived long enough to utter five words to her, “I’ll be waiting for you.”That final private moment became public when someone from the crash scene took it to the press—the terminally ill woman holding her dying husband as he promised to wait for her on the other side. Worse, that person claimed it wasn’t Anton who said the words but his ghost, hovering over his body.Since their story went public, Nicola has been hounded by spiritualists promising closure. In the hopes of stopping her downward spiral, friends and family find a reputable medium—a professor of parapsychology. For the séance, they rent the Lake Erie beach house that Anton’s family once owned.The medium barely has time to begin his work before things start happening. Locked doors mysteriously open. Clouds of insects engulf the house. Nicola hears footsteps and voices and the creak of an old dumbwaiter…in an empty shaft. Throughout it all she’s haunted by nightmares of her past. Because, unbeknownst to the others, this isn’t her first time contacting the dead. And Nicola isn’t her real name.That’s when she finds the first body....In this atmospheric, thrilling new ghost story, Kelley Armstrong's full talents are on display to thrill, chill and leave the reader guessing how Nicola escapes with her life--if she can.",
  "genres": [
    "Horror",
    "Paranormal",
    "Mystery",
    "Thriller",
    "Fiction",
    "Ghosts",
    "Audiobook"
  ],
  "author": "Kelley Armstrong",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/204174277-i-ll-be-waiting"
}