{
  "title": "Forbidden Fruit: Volume One",
  "description": "From some of todays NY Times, USA Today and Amazon Bestselling Authors comes this Anthology of Forbidden Love Novellas. Release date: March 2014Educate Me by Lexi BuchananBianca is a new, 24 year old teacher at the local high school who can't stop thinking about one of her pupils, 18 year old Mason. Bianca soon discovers that Mason wants his hands on her just as badly. How can they have a relationship when everything is against them?Weakness by Missy JohnsonAfter too much sex, drinking and partying, almost eighteen year old Maya finds herself doing a six month stint in a juvenile detention centre. When she catches the eye of sexy, thirty something prison guard Max, she realises she can have more than a little fun while on the inside. Especially when she learns that pretty young redheads are his weakness...Secret Obsession by Olivia LindenWhen two lost souls find each other, nothing can be sweeter. Or, more forbidden. Finn Walters does his best to ignore his attraction to Sylvia Davis. She's tempting, but off limits. The problem is that she wants him too, and when she makes the first move, nothing can stop him from taking what he wants. Lines get crossed, blurred and scratched down his back when they both give into their mutual desires. How far will they go to indulge their Secret Obsession?Lock & Key by R.S. GreyJournalist Kate Winters is on assignment in Kosovo when she’s captured by rebel forces. She’ll be tortured and beaten until they’re done questioning her… but she soon learns that it’s not the low-ranking guards she should fear. They’re nothing compared to their leader—dangerous, sinfully sexy, Adam, whose main purpose is to extract information from her by any means possible.One Hot Summer by Lisa M HarleyAnaBelle Mason knew when she married an older man he might die before she did, she just didn't realize it would happen so soon. Less than five years after her fairy tale wedding to the man of her dreams, she was left all alone to run the ranch that had been in her late husbands family for years. Tray Thompson lives the life of a carefree college student. He spends his day coasting through classes, and his nights working his way through the female population of Walker University. When Tray's best friend Jason asks him to help him work at his family farm for the summer, Tray doesn't want to go, but he owes Jason so much. He reluctantly agrees to help his best friend out.What will happen when a lonely widow woman, bound and determined to make it on her own meets her stepsons best friend and sparks fly?Will she be able to tame the young mans playboy ways or will he help her remember she lost her husband, not her life?The Naughty Au Pair by Janice BakerAngelina left her small town in France to become Senator Lauren Winchester’s Au Pair. She never expected to fall in love and have an affair with the Senator’s husband, Gordon. Angelina expected Gordon to keep his promise to leave his wife for her. When Gordon fails to finally tell his wife, Angelina decides to have a night to herself. A tryst to rid herself of Gordon’s hold on her. But that hot fling happened to be with Conner, the Senator’s older son from a previous marriage. When Angelina and Conner realize their true identities, Conner must have her. But is Angelina willing to give up her feelings for Conner’s step dad? Or will she wait for Gordon to finally make up his mind and sweep her off her feet?Strictly Off Limits by Jessica HawkinsAlexandra James gave up her spring break for an offer she couldn’t refuse: a week-long job that would earn her enough money to buy her way out of a broken heart. But if she thought her new boss would let her off easy because he’s her father’s best friend, she couldn’t have been more wrong. Dean Brittany demands perfection from his employees—but none more so than his new temp, since correcting her mistakes seems to fuel his unexpected attraction to her. Unfortunately for him, eighteen-year-old Alexandra is strictly off limits.Try Me by Stacey LynnWhen Marcus Whitmore finally realizes he isn’t going to get the only girl he’s ever loved and his family isn’t going to be together, he decides it is time to move on. After all, the best way to get over a woman - is to get another woman under you. Which is exactly what he does, thinking that a night of passion will ease Emma from his mind. What Marcus doesn’t plan on is waking up to an empty bed and the memory of a woman he can’t forget.Weeks later, when Marcus runs into Tabby again, he is determined to have her back in his bed. The problem? Tabby is his son’s teacher. And if anyone finds out that Tabby is involved with Logan’s dad, she could lose her job.Is Marcus worth the risk? Are the best things in life really worth fighting for?Inadmissible Attraction by Rebecca BrookeNineteen year old Nora Willson has spent the last five years refereeing for her parents, while trying to hide the deplorable state of their marriage from her younger siblings. When she goes to their custody hearing to offer moral support, she never expects her father’s attorney to notice her in more ways than one. Will that one moment make Nora see what she’s been missing, or will fear cause her to step away from the gorgeous Mr. Garnes.In Too Deep by Morgan Jane Mitchell25-year-old Loraine Wynters has always been in control. She takes what she wants, from a new man every night -and leaves. Too bad this has cost her her last job and landed her in the local sex addict’s support group where she is certain she doesn't belong. Within this group of weirdos, she sees a familiar face.Richard Mahoney may be the gorgeous 30-year-old, successful owner of Table 21, but he has lost more than Loraine could ever imagine because of his obsession. After learning all her secrets, Loraine’s new boss Rick is determined to fix her with his own brand of therapy. After digging deeper, Loraine finds that her boss needs more than just physical healing. Can they repair each other so they can be with other people?With both Loraine and Rick longing for a normal life, will a pact between them be the answer to both their problems? Or are they getting in too deep?Overall word count is: 200,000 Warning: Over 18+ only due to explicit sexual content.",
  "genres": [
    "Anthologies",
    "Erotica",
    "Romance",
    "Collections",
    "Contemporary Romance"
  ],
  "author": "Lexi Buchanan",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/20416822-forbidden-fruit"
}