{
  "title": "Hot Ice",
  "description": "New York Times Award-winning author Cherry Adair is turning up the temperature, amping up the action, and raising the degree of danger and desire to irresistibly hot new heights.  “A breathtaking ride . . . I couldn’t turn the pages fast enough! No one does hot romance, ice-cold villains and nonstop adventure better.”  Diamonds–jewels of every kind, in fact – are Taylor Kincaid’s best friends. The only thing she enjoys more is the challenge of stealing them, at which she excels like few others in the world. And specializing in plundering precious stones from wealthy international criminals just makes it all the more satisfying . . . and dangerously exciting. So for Taylor, there’s no resisting the double allure of snatching the elusive Blue Star diamonds – a prize she has pursued across three continents – from the South American stronghold of the murderous Morales terrorist organization. The heist goes down without a hitch. Until Taylor discovers she has made off with more than she bargained for, namely the secret security-system codes that provide access to a South African diamond mine–packed with enough gems to sink a battleship. Suddenly, Taylor’s no longer just an ultrachic freelance jewel thief, but a reluctant player in a high-stakes cat-and-mouse game against elite global trouble-shooters and bloodthirsty terrorists. There’s nothing reluctant, however, about Huntington St. John, the top T-FLAC operative who’s hot on Taylor’s trail. And in Taylor’s opinion, just plain hot. The feeling, emotional and otherwise, is very mutual. Though they’re on opposite sides of the law, Hunt and Taylor swiftly come to appreciate each other’s well-honed skills. But since ecstasy is fleeting, and diamonds are forever, Taylor soon slips from the sheets and hits the streets . . . to reclaim the jewels she stashed overseas. And true to his name, Hunt is close behind–but this time, he’s after more than the codes. With the clock ticking, and two groups of terrorists closing fast, they’ll have to mix pleasure with some very risky business. If they can survive danger at every turn, outwit the ultimate high-tech security system, and somehow conquer each other . . . they just might get everything they desire.  …fast-paced and intricately plotted tale of danger, deception, and desire that is perfect for readers who like their romantic suspense adrenaline-rich and sizzlingly sexy…",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Contemporary Romance",
    "Contemporary",
    "Adult",
    "Military Fiction"
  ],
  "author": "Cherry Adair",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/20427388-hot-ice"
}