{
  "title": "The Billionaire's Paradigm: His Absolute Purpose",
  "description": "From USA Today Bestselling Author Cerys du Lys ~ Trapped in a library during a blizzard, Elise finds herself forced into isolation with Lucent Storme, the untoward magnate who's rumored to have more than a few forbidden desires and darker passions. Both appalled and allured by his sordid sophistication, struggling to come to terms with what she knows and what she feels, she finds herself drawn to this man who seems both powerful and fractured all at once. Lucent's secrets and dominant obsessions may be more than Elise can handle, though, and her gentle curiosity is just as likely to cause her pain and heartbreak as it is to bring her happiness... (A Cerys du Lys contemporary romance novel) When Elise Tanner finds herself trapped in a library with Lucent Storme during a record-breaking blizzard, she panics. He might not know her, but she knows more than enough about him. Besides being the newly appointed Director of Public Relations for Landseer Enterprises and an influential business magnate, there are rumors that he has a taste for the darker side of sexuality. He seems fake, false, excessively demanding, too self-important by far, and... with over six feet of snow expected and the streets completely unmanageable, there's absolutely no way for her to escape him. He's so predatory and dominant, yet beneath his rakish and enigmatic exterior, she senses there's more to this mysterious and isolated man. He's charming and intelligent (though reserved and terse), begrudgingly handsome, and surprisingly thoughtful. Unintentionally, Elise finds herself drawn to Lucent in a way that defies logic. Unfortunately the snow may be the least of her worries. One disaster begets another and not everything is as it seems with the man who holds a sole singular obsession above all others. Will Elise's curiosity be her undoing? Is she unwittingly playing right into Lucent's hand; his dark desires and commanding personality? Or can she discover His Absolute Purpose, the reason he hides himself behind a facade of formality, and gain a deeper, more emotional and intimate connection with the compelling Director of Public Relations? The snow may have brought them together, but it can't keep them together forever. What happens when the ice begins to melt? Powerful, sensual, and commanding. This poignant story of love, attraction, and temptation will bind you, entwine you, and thrill you until the very end.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "BDSM",
    "New Adult"
  ],
  "author": "Cerys du Lys",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/20424382-the-billionaire-s-paradigm"
}