{
  "title": "Why Did The leaf fall?",
  "description": "\"Kids books should deal more with \"big\" children's questions\" This book does it wonderfully, and deals with one of the most interesting children's question, that one, about God.  This is a story about a little boy who found one summer day a leaf fallen from a tree, for no real reason,  In this unique children's book The boy does not stop asking Why? How? Who is to blame? Well, there are things in life that happen to us and we do not know how to explain them to our children.  \"kids books should cause the readers and the listeners to think\" This is one of the children's Books that will cause you to think  and will give you tools to answer your children's difficult questions. This Picture book, will become a motivational book for your kid.  \"We do not always understand why things happen the way they do, But all things happen for a reason. Sometimes the reasons are understandable,  sometimes they are hidden, sometimes they seem clear but in truth, they are not at all what we think.  But always, always, whatever happens is for the best!\"  \"Books for kids should invest in illustrations\" This is a gorgeous illustrated bedtime children's picture book. Picture books: beautiful illustrated picture book  \"If you want to choose from bedtime stories, this bed time story is very highly recommended. It will make you and your child go to sleep with a smile\"  This children's book for kindle, is designed for the category of preschool books but is also suitable for beginner readers.  Children's books ages 4-8 Children's books ages 9 -12  ** Amazon Prime Members can download this book for FREE! **  By Grady Harp HALL OF FAME TOP 50 REVIEWE RVINE VOICE \"Author Anat Umansky (`Don't Think You Can't') has shared with us a story told by Baal Shem Tov, the Rabbi who founded Jewish Hasidism, restructured with endearing prose and made visual by the gifted illustrator Yelena Al.... ...Not only is the story touching and memorable but it also provides answers to curious children that everything that happens, happens for a reason. This is a sweet and learned book and we can only hope Anat Umansky will continue to write such beautiful little bedtime stories\"",
  "genres": [],
  "author": "Anat Umansky",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/20422389-why-did-the-leaf-fall"
}