{
  "title": "Immortal",
  "description": "Nine months after the Courier sacrificed himself to destroy the Adam and reduced the intelligent evols to shambling, mindless zombies, Else is preparing to give birth to the son of the man she loved. The child is born during a terrible storm, and feral zombies attack Else’s house in the Queensland bush. She must battle zombies, crocodiles and the elements to get her newborn son to safety. The child is lost when Else’s small boat is swept away on flood waters. She joins forces with an Aboriginal hunter called Jirra to track the boat down the river to the sea – hoping that her baby is still alive. Together they discover that the child has been taken by the Sea People. Human survivors that live on a derelict ship anchored off shore. Else continues her search – reaching the ship and discovering that a rag-tag tribe of human survivors live below decks, building their own mythology under the iron rule of the evol Captain and crew. Most newborns are given to the crew – the stem-cell rich infants are enough to keep the evols functioning as intelligent dead. Else encounters the different factions living in the superstructure, the Holders, The Engineers and The Fishermen. The first half of the book comes to an explosive conclusion as Else rescues her son and destroys the ship. In part 2 Else finds herself the unwilling leader of a band of survivors who have not been on land in years. She decides to lead them to Mildura, where she hopes that Sister Mary will have a place for them. The journey across the wasteland of Australia is hard and Else must learn to be a leader while struggling with her own demons and doubts. As the numbers of survivors grow Else is forced to make hard decisions. The sanctuary of Mildura is not as she had hoped – the scientist Donna is recreating the Tankbread programme – and wants to use Else and her son as tissue for experimentation. After a hard fought battle against Donna and the hordes of dead, Else leads her growing tribe of survivors to a new life – and in her son she sees hope for a future.",
  "genres": [
    "Zombies",
    "Horror",
    "Fiction",
    "Science Fiction",
    "Dystopia"
  ],
  "author": "Paul Mannering",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/20433365-immortal"
}