{
  "title": "The World We Deserve",
  "description": "\"The warning signs were all there . . . family breakdown, community decay, opioids, crime, loss of direction. But not enough was done.\"The Great Reset is complete.In the middle of the 21st century, America has become a very different place. Digital currency and social credit have replaced the old monetary system. The vast majority of people live in tiny pod-like apartments and the age of A.I. has arrived. Movements are tracked, actions are known. Even buying groceries requires a person’s “citizenship rating” to meet a certain threshold. Of course, there are ways to increase it. One just needs to have the correct view of things . . . and behave accordingly.The demographics of Western countries bear little resemblance to the previous century. A walk through the streets of New York or Dallas is now virtually indistinguishable from a walk through downtown Manila or Mexico City. The effects of open borders and unchecked mass migration have come home to roost. Welcome to your progressive utopia.Any semblances of the old America and its values, what held it together, what made it so successful, have been carefully altered, obscured, or destroyed. Only the aged even remember what Christianity is, and very few speak of it, for such an act would be heresy. There is little concept of family. There are no churches. Except in the rogue zones, of course.Jack Nolan’s grandfather was famous. But according to the prevailing orthodoxy, Jonathan Nolan was a dissident. A conservative with an outdated worldview. And so, Jack’s citizenship rating has been permanently reduced. His life will be a struggle.He wonders how things went so far off the rails. Was it always like this? With cities left decaying, people giddily filming violence in public with smartphones, and a society bereft of any sense of community, compassion, or shared purpose? During a chance encounter, Jack meets a stranger who speaks of things no longer widely spoken. The very words could be dangerous. They don’t align with the magnificent progressive order the government has gifted the people. But yet, the stranger’s words resonate, and the values he puts forth represent a vision of something beyond mindless consumerism and obedience to the state. Of course, therein lies the problem. Jack will soon learn the price of dissent in a society where dissent is no longer tolerated.",
  "genres": [],
  "author": "T.K. Kanwar",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/204305482-the-world-we-deserve"
}