{
  "title": "Trapped with Sex Starved Aliens 2",
  "description": "THE 2ND PART TO THE ALL ROMANCE EBOOKS BESTSELLER!Alicia Conifer and her stunningly handsome starcraft pilot, John Hanson, are sexual prisoners of the natives on the strange planet, Norbu. John engineers their clever escape. But they are soon captured by another brutish tribe with a secret that has explosive consequences for mankind.Alicia and John must experience it firsthand in a unique orgiastic ritual that you will never have read before!This sci-fi erotica novelette at 11,500 words is the sequel to TRAPPED WITH SEX-STARVED ALIENS. It is written as an erotic homage to Avatar and John Carter.Read an excerpt :Alicia almost swoons as she feels the rush of John's penis inside her. She can't see his face, much is the pity, but he's so omnipresent that it's good enough to feel his flesh upon her skin and his harder flesh within her flesh - a hot, long rod of pleasure and sustenance. But it's wonderful to know that she can render a man as hot as this as unintelligible as he has become, and moaning what will hopefully be her name.Oh, but he feels soooo good. His cock spears her right up to her cervix, and she can feel her greedy mouth - that innermost of mouths -suck him in. He fills her so thoroughly and fully that she can only tip her head back in velvety satisfaction.She can murmur his name over and over again (John Hanson) but that would only scare him.Because she has feelings for him.She hasn't known him that long, and this is only the second time they are fucking making love. But her emotions where he is concerned have already run the gamut from the very low to the very high. It's incredible the way he can make her feel - like she is living life vicariously for the first time.Even this act involves willfulness and defiance. She is defying her former self - the one who played it safe all those years. She's finally falling for the bad boy from the wrong side of town, and he's every bit the frenetically guilty pleasure that he is.Exactly what these feelings are she isn't certain yet. All she knows is that they 1) Deep affection2) Extraordinary lust3) Bountiful concern - like she would put herself in the path of danger if it involved putting him out of itWhat does any of it mean? Does any of it constitute (and dare she say it, she who has never been in this predicament before) love?She's confused, and this is a path she'd best not venture. Her entire groin area is so suffused with his cock that she can barely rock from side to side, merely up and down. Best she concentrate on the sublime physicality of their relationship right now and leave the tempestuous emotions for later.His breathing grows ever more ragged.\"You feel so good,\" he manages to say between gasps.",
  "genres": [],
  "author": "Aphrodite Hunt",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/20430182-trapped-with-sex-starved-aliens-2"
}