{
  "title": "Paleo Fast Food: 26 Super Quick And Make-Ahead Recipes For When You're On The Go",
  "description": "\"Set Your Schedule Concerns Aside, Get Your Paleo Food Fast - Right Here!\"An Allergy-free, Whole Foods / Fast Food Cookbook Designed for Health Conscious and Food Sensitive People.We live busy lives, and we need foods that are quick and keep us going.  This often results in poor food choices and breaking our commitments to eating healthy.  Fast food doesn't have to be laced with additives and leave you feeling sick or still hungry. Now it can be nutrient-dense, healthy and delicious as well as being quick and convenient.  In 'Paleo Fast Food' you'll find 26 easy gluten-free / grain-free make-ahead and on the go recipes that will satisfy, nourish and save you time in the kitchen.  In following this cookbook, you'll be able to avoid those terrible moments where you're starving and on the go and wonder \"What am I going to eat?!\".   'Paleo Fast Food' includes recipes the whole family will love, such Slow Cooker Coconut YogurtSausage and Squash SkilletBanana Bread Green SmoothieSpicy Turkey SandwichAll-Day Baby Back RibsWaffle Iron Steak and PortabellaFiesta Sweet PotatoesApricot Energy Cookies…….and much more! This cookbook features 26 high-quality recipe photos so you will easily be able to enjoy viewing them on both the black & white and the full color Kindle. Don't have a Kindle? Don't worry, you can also view this book by downloading the FREE Kindle app for your computer, iPad, or other mobile .In this cookbook you'll Tips on how to make food prep easier, and how to plan for eating on the go.Recipes for breakfast, lunch, dinner, snacks, Pre and post workout.Shopping tips to help you fill your pantry, fridge and your freezer with easy go to ingredients.Easily labeled recipes to fit all your needs including Freezer Meals, Take-Away, Quick, Pre-Workout, Post-Workout, Pantry Staples and Slow Cooker meals.Suggestions on tools to help make food prep easier and more efficient'Paleo Fast Food' is an easy-to-read guide for busy cooks who want delicious, nourishing food but don't want to spend all their time in the kitchen making it (or breaking the bank buying substandard expensive pre-made or pre-packaged meals from the grocery store).  This book will help you fill your belly with nutrient dense food to keep you going where you need to, when you need to.  Can't wait to dig in....Scroll to the top of the page to download this book now and have your Paleo meals made fast and delicious!About The AuthorKate Evans Scott is the author of the Amazon Bestselling cookbooks The Paleo Kid,  Paleo Kid Snacks, The Paleo Kid Lunchbox,  Paleo Fast Food, The Paleo Kid's Halloween, The Paleo Kid's Christmas and 26 Spa-Inspired Vitamin Waters.  After her son was diagnosed with several food intolerances and after having struggled with her own Autoimmune Disease, Kate made the commitment to remove all grains and processed foods from her family's diet.",
  "genres": [
    "Cookbooks"
  ],
  "author": "Kate Evans Scott",
  "average_rating": "2.85",
  "url": "https://www.goodreads.com/book/show/20433600-paleo-fast-food"
}