{
  "title": "The Dark Victorian: Bones",
  "description": "\"I am made of this.\"\nIn a mechanical and eldritch Victorian London, a black arts surgeon is ripping out the bones and organs of the healthy poor to transplant into the afflicted bodies of the wealthy. Anti-vivisectionists battle with medical doctors, medical doctors condemn supernatural practitioners, and amidst it all the Bone Stealer hunts for his most elusive prize yet: the skeleton of a woman over six feet tall. Secret Commission agents Art, the artificial ghost, and Jim Dastard, the animated skull, rush to stop him before another woman dies. And Art, only six days living after being resurrected to serve the Secret Commission, might be that woman.Experience female detective mysteries with a Victorian superheroine:A gaslamp fantasy in a steampunk, paranormal London, follow the dangerous adventures of an uncanny female sleuth and her senior skull partner set in the same alternate world as Elizabeth Watasin's Victorian Gothic series, The Elle Black Penny Dreads.Enjoy a bonus Art Gallery:The paperback version of Dark Victorian: Bones contains a small gallery of illustrations by Elizabeth Watasin.The Dark Victorian, a unique take on lesbian historical fiction:Set eighteen years before words like 'homosexual' and 'lesbian' had yet to be invented, the world of The Dark Victorian series continues the 19th century tradition of British female marriage and romance into a future where same-sex unions thrive. Into this world, a singular steampunk lesbian is reborn and while only six days living, Artifice quickly learns-from her encounters with a madwoman journalist, a mysterious woman in black, and a French prostitute-where her heart lies...Dark Victorian: Bones is the latest paranormal steampunk tale from speculative fiction storyteller Elizabeth Watasin, who delights in bringing you shilling shockers immersed in Gothic Victorian mystery, women sleuths, and the eldritch vestiges of an otherworldly London. Enjoy the deadly battles of a Victorian superheroine and her skull partner as Artifice and Jim Dastard rid the world of threats and monsters.Editor: JoSelle Vanderhooft",
  "genres": [
    "Steampunk",
    "Fantasy",
    "LGBT",
    "Historical",
    "Paranormal",
    "Lesbian",
    "Mystery"
  ],
  "author": "Elizabeth Watasin",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/20428222-the-dark-victorian"
}