{
  "title": "Intimate Knowledge Parts 1&2 / Her Keeper Parts 1&2",
  "description": "Detective & Desires #1 Intimate Knowledge A series that unfolds over multiple volumes ranging from 10,000 to 20,000 words each. Intimate Knowledge is an erotic romance with explicit sexual content with elements of BDSM. It has a delectable slow build to consummationPart1- The PrologueThe countdown to consummation is reaching the final moments. Leo is determined to fully possess Raisa and she fears she will disappear into him. Leo Gold is the singular, most attractive, mesmerizing man to ever come into her orbit and he lays her core bare with intimate knowledge ripped from her subconscious.She is coming to terms with the fact that her feelings are too deeply engaged with her target. Just how the hell did she get there?Part 2Leo Gold has been keeping tabs on Detective Raisa Gordon. Seeing her at an art exhibit he falls for and sets out to make her his. The FBI see the opportunity to use his feelings to infiltrate the Gold crime family.  Detective Raisa Gordon has the hots for a younger guy she’s never met. Will her passions for him get in the way when they meet? Will she keep it together to just turn into a hot little tramp for her target?Leo and Raisa finally meet and sparks fly. He is proving irresistible and Raisa yields just a little for an explosive encounter. Detectives & Desires #2 Her Keeper Parts 1&2 The feud between Detective Rick Andrews and Sara Michaels is legendary and no one ever wants to stand in the line of fire when they go at it. Only, now Sara has crossed the line and Rick is determined to use the power her transgression grants him to lay down the law in a way she can't escape. A series that unfolds over multiple volumes ranging from 10,000 to 20,000 words each. Her Keeper is an erotic romance with explicit sexual content. It has a hot cop (two actually), sexy frisking, spanking, cuffing, a crazy, hot proposition yet to come and two people who are stubbornly in love. Part 1 Rick and Sara have been fighting their feelings far too long and a roadside arrest takes their feud to combustion level. Sara decides its time she made a change. She wants to see Rick’s softer side. Rick agrees but its going to cost her. Part 2 The roadside arrest has shifted their dynamics. Their first kiss has managed to erase their fears and now they both want to taste what might be. But a kiss isn’t the only forfeit Rick demands. He’s decreed a year long sentence Sara just might be crazy enough to consider.",
  "genres": [],
  "author": "Helen Karol",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/20433467-intimate-knowledge-parts-1-2-her-keeper-parts-1-2"
}