{
  "title": "Seduction in the Sun Box Set",
  "description": "The Seduction in the Sun Box Set: 9 Sizzling Romances set under the hot sun... 1000 pages!Indulge in nine scorching romances that will whisk you away from the winter chill... with steamy new adult, sexy billionaires, and alphas wielding ribbons and rope, these books by bestselling authors will take you someplace very hot indeed...HANDS ON WITH THE CEO by Cat KalenWhen a self conscious college sophomore takes an au pair job in Greece, sitting for a gorgeous billionaire CEO, she knows he's just the guy to give her the sexual experiences she's looking for. Too bad he's hands off. Or is he?ONE HOT WINTER BREAK by USA Today Bestselling Author Sharon PageCollege student Mia Reynolds just broke up with her long-time boyfriend, Ryan, and gets an offer she can't refuse from billionaire's son Jonathon Powell: a week at an exotic resort. Jonathon's wicked games intrigue Mia. But ultimately, is it Jonathon she loves... or Ryan?SOMETHING BORROWED by New York Times Bestselling Author Adriana HunterWhat do you do when the one man you were meant to be with already belongs to another?For Dana Marshall, new wedding planner and curvy single, \"always the bridesmaid, never the bride\" is the story of her life. But when she is assigned to help manage a dream wedding for an important client, nothing can prepare her for the encounter with the insanely handsome groom...DEBT OF HONOR by New York Times Bestselling Author Opal CarewHeld captive by a domineering sheikh......and made to pay for a crime she did not commit.Angelica couldn't believe that hopping off a plane during a refueling stop to search for one-of-a-kind souvenirs could lead to so much trouble. Now she is detained in an exotic country by a devastatingly handsome sheikh... and ends up in his harem.HOW TO TRAIN A LOVER - A SAVAGE INERACTIVE by New York Times Bestselling Author Daire St. DenisTessa's off to spend some much needed R&R in the Greek Isles on the luxury yacht of playboy billionaire and sexual dominant, Alander Papadakis. However, when Alander breaks one of her golden rules, her holiday plans take a turn and she jets off--solo--to the island of Lesvos where she happens upon a mysterious young man from her past.VEGAS HEAT by New York Times Bestselling Author Lauren HawkeyeAnna Phillips and her husband Austin are in a marital rut. In a last ditch attempt to save their marriage, they decide to take a road trip. The destination? The Last Temptation Resort and Casino in Vegas... which is also a BDSM club... with an enticing stranger.BREAKING FREE by USA Today Bestselling Author Cherise SinclairA submissive, Beth must yield to become aroused, but after a sadistic husband, she's too scared to give up control. The last thing she wants is a ruthless, powerful Dom. But that's just what she gets.THAT ONE TIME by New York Times Bestselling Author Marian Tee23-year-old Ayah Chandler believes in love at first sight, and she should - since it only took that one time for her to fall head over heels. Billionaire Nic de Koningh grew up trusting no one but himself.",
  "genres": [],
  "author": "Lauren Hawkeye",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/20434291-seduction-in-the-sun-box-set"
}