{
  "title": "Take a Walk on the Dark Side: Rock and Roll Myths, Legends, and Curses",
  "description": "Take a Walk on the Dark Side is the ultimate book for today's rock and roll fan: a fascinating compendium of facts, fictions, prophecies, premonitions, coincidences, hoaxes, doomsday scenarios, and other urban legends about some of the world's most beloved and mysterious pop icons.  Updating, revising, and expanding on material from his cult classic Hellhounds on Their Trail, Patterson offers up a delectable feast of strange and occasionally frightening rock and roll tales, featuring the ironies associated with the tragic deaths of many rock icons, unsolved murders, and other tales from the \"fell clutch of circumstance.\"  Beginning with the fateful place where it all started -- a deserted country crossroads just outside Clarksdale, Mississippi, where Robert Johnson made his deal with the devil -- through the Buddy Holly curse (rock and roll's first great tragedy) and beyond, this incredible volume uncovers some of rock and roll's most celebrated murders, twists of fate, and decades-long streaks of bad luck that defy rational explanation. Inside you'll find:     Facts about Jimmy Page and the Zeppelin Curse.   Chilling quirks of fate in the fatalities in the Allman Brothers and Lynyrd Skynyrd.   Facts about Jimmy Page and the Zeppelin curse   Chilling quirks of fate surrounding the deaths of musicians in the Allman Brothers Band and Lynyrd Skynyrd   A provocative look at \"The Club,\" membership in which requires an untimely death at age twenty-seven and whose inductees include Kurt Cobain, Jimi Hendrix, and Janis Joplin   Cryptic messages in song lyrics that have proved eerily prophetic     Carefully researched, wildly enjoyable, and often harrowing, Take a Walk on the Dark Side takes the reader on a mysterious ride through rock and roll history.",
  "genres": [
    "Music",
    "Nonfiction",
    "Supernatural",
    "History",
    "Rock N Roll",
    "Biography",
    "Paranormal"
  ],
  "author": "R. Gary Patterson",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/20440392-take-a-walk-on-the-dark-side"
}