{
  "title": "4 Horsemen",
  "description": "Penny is thrust unexpectedly into a world of violence and crime when the 4 Horsemen motorcycle club invades her happy suburban life. With hell broken out in the city, she has no choice but to flee for her life with Conquest, the MC President. Surrendering herself body and soul to the fearsome and sexually dominating leader, Penny discovers there is more to becoming a Horseman than simply wearing the colors. Climb on, hang on, and let the open road take you on an erotic thrill ride like nothing you have ever seen.A little My hands were shaking as I let my fingertips trace over the little sewn on patch. Just to the left, was a small symbol pressed into the leather. I stared at it quizzically, lifting the vest up to inspect it closer.“One percent.”The voice startled me. It was strong and sensual, almost like an embrace. I spun at once, staring at the man from last night, the man who had captivated my thoughts.“You know what it means, don’t you?” he asked, stepping closer. I inhaled sharply, taking in the faint scent of whiskey and leather and oil. A familiar tingle ran up my spine. Excitement…“No,” I whispered demurely, trying to turn away from his piercing gaze. The deep pools of blue drew tried to draw me back in as he smiled, his wide jaw softening ever so slightly as the cheeks creased.“People used to say 99 percent of all bikers are upright law abiding citizens.”I winced as his hand wrapped around my shoulder, pulling me back to face him again. My whole world was lost in blue.“I’m the one percent.”I whimpered lightly as his other hand wrapped around my waist, pulling me close. My whole body trembled against him. He was hard chiseled with muscle rippling beneath cloth. My breasts pressed into him, my mouth angling upward in a fearful pout.“What’s your name, baby girl?”“Penny…” I whispered.“Do you know what the penalty is for a woman touching a rider’s colors without his permission, Penny?”He didn’t wait for an answer. At once his hands pressing me downward, forcing me onto my knees.",
  "genres": [],
  "author": "Ava Bonde",
  "average_rating": "2.76",
  "url": "https://www.goodreads.com/book/show/20436075-4-horsemen"
}