{
  "title": "Lord of Light",
  "description": "1192 A.D. - Sir Roane de Garr is a member of St. John the Baptist Hospitaller sect and while visiting the supposed Holy Sepulchre in Jerusalem, he is hit by a freak bolt of lightning and suddenly finds himself with miraculous healing powers. The Hospitallers believe he is a heretic and must be destroyed, so he flees back to England and into seclusion as a bounty is put on his head.  Enter Lady Alisanne de Soulant, a young lady who is losing her sight to a disease of the eyes. Forced by bounty hunters hired by the Hospitallers to lure Roane out of hiding, she finds herself torn between saving Roane’s life and the life of her father, whom the bounty hunters hold hostage in order to insure her cooperation. After she helps the bounty hunters capture Roane, she helps him escape, only to find herself captured and punished by the bountymen. Those who seek to collect a price on Roane’s head realize he is in love with the woman they used as bait and they use her again to lure him back out of hiding. Roane is given the choice between saving Alisanne or her father, knowing whoever he does not rescue first will surely die at the hands of the evil bounty hunters.  Clearly Roane’s heart is with Alisanne, but he fears she will resent him for leaving her elderly father at the mercy of the bountymen. Of course, he’s being sought by the bountymen too and must evade capture even as he attempts to rescue the other two. Only Roane’s cunning and intelligence can save all three of them, but in a nasty twist of fate, he ends up the bountymen's quarry. When Alisanne and her father attempt to save him, Alisanne's father is captured as well.  Hope seems lost. With both of the men she loves captured, now it is up to Alisanne with her failing sight to save them both from the executioner's sword. Can she find the help she needs, and the courage deep within her, before it's too late?  Bonus Material at the end: Five chapter excerpt of SINFUL FOLK by Ned Hayes",
  "genres": [
    "Historical",
    "Historical Romance",
    "Medieval",
    "Romance",
    "Audiobook"
  ],
  "author": "Kathryn Le Veque",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/20437360-lord-of-light"
}