{
  "title": "Wilderness Rescue Healing Hearts: A Sapphic Alaska Rescue Romance",
  "description": "“Sweet, small-town love story that proves love overcomes all obstacles.”Join Alaskan author Harmony Noble for the thrilling conclusion of the beloved Wilderness Rescue series in \"Healing Hearts.\" The heartwarming small-town series Wilderness Rescue delivers a fast-paced romance between four strong females who find a second chance at love in this opposites-attract, forced-proximity love story. Get ready to race down the ski slopes where two paths cross on a wild ride of love and self-discovery to navigate physical and emotional obstacles, let go of the past, and embrace their true selves to find passionate love in this couple-swap, small town romance.Caitlyn, affectionately known as Cat, whose fearless spirit conquers mountain peaks and marathons. However, a life-altering accident has left her grappling with a loss of confidence and identity. Can she overcome her inner turmoil and grumpiness to reclaim her belief in herself and find love?Peekaboo has an infectious zest for life that shines and as a dedicated ski instructor, she inspires others with disabilities to embrace joy and adventure. Yet, behind her vibrant facade lies a heart yearning for something more—a love that ignites passion and fulfills her deepest desires. Torn between duty to her devoted partner and longing for fiery passion, will Peekaboo find love?On the pristine slopes of Alyeska, Cat and Peekaboo’s paths converge, sparking an unlikely connection that defies the odds. Together, they are on a transformative journey of love, empowering each other to embrace their true selves and the promise of a brighter future. As their bond deepens and their hearts connect, Cat and Peekaboo discover that true happiness lies not in the absence of obstacles but in the strength to overcome them together.⭐⭐⭐⭐⭐ \"A captivating journey of love and self-discovery that will stay with you long after you've turned the last page.\"Join us on the slopes where \"Healing Hearts\" awaits to inspire, uplift, and remind you that the most beautiful journeys are the ones discovered when we least expect them. Embrace true love and let the slopes of Alyeska carry you to a story that transcends the ordinary, igniting the passion for life and love. Experience all the unforgettable standalone love stories of Harmony Noble's Wilderness Rescue series.Discover more stories of sweet small town romance when you “Embrace True Love” with author Harmony Noble.",
  "genres": [],
  "author": "Harmony   Noble",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/204398982-wilderness-rescue-healing-hearts"
}