{
  "title": "On the Abolition of All Political Parties",
  "description": "A brilliant woman who was a study in fiercely maintained contradictions, a star student who went to work on a factory line, a Jewish convert to Catholicism who insisted on refusing baptism, Simone Weil is one of the most intransigent and taxing of spiritual masters, always willing to push her thinking—and us—one step beyond the apparently reasonable in pursuit of the one truth, the one good. She asks hard questions and avoids easy answers. In this essay—now in English for the first time—she challenges the foundation of the modern liberal political order, making an argument that will have particular resonance in present-day America. Examining the dynamic of power and propaganda caused by party spirit, the increasing disregard for truth in favor of opinion, and the consequent corruption of education, journalism, and art, Weil proposes that politics can only begin where the party spirit comes to an end.This volume also reprints an admiring portrait of Weil by the Nobel laureate Czeslaw Milosz and an essay about Weil’s friendship with Albert Camus by the translator Simon Leys.Quotes:At a time when the distrust and disenchantment Americans feel with politics runs deeper than the Mariana Trench, Weil’s essay ‘On the Abolition of All Political Parties’ would no doubt be a best seller.—Robert Zaretsky, from “Recalling the Apostle of Nonpartisanship,” The New York TimesWhat makes her thought so special, so bracing and so strange, is its combination of philosophical rigour and spiritual compass…Only a saint could withstand the pressure to conform to the prefabricated morality of the political realm; only a genius could formulate an idea outside the ‘for’ or ‘against’ thinking so long inculcated by party politics that it has become a kind of ‘intellectual leprosy.’ The tone and texture of this vivid editorial, however, renews a certainty that Weil was both.—The AustralianWeil’s writing is unusual and compelling, in part, because it is both quite strictly rational and eccentrically spiritual. Her argumentation is so compact, so holistic, each sentence and paragraph building methodically on its predecessor, that trying to précis her is probably futile. To omit anything from a summary of her writing is to short-change her. She writes modestly and without flair, but her words all but radiate moral and intellectual conviction.—Australian Book Review[Source: http://www.nybooks.com/books/imprints...]",
  "genres": [
    "Philosophy",
    "Politics",
    "Nonfiction",
    "Essays",
    "History",
    "France",
    "20th Century"
  ],
  "author": "Simone Weil",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/20447761-on-the-abolition-of-all-political-parties"
}