{
  "title": "Reverberation The Novel",
  "description": "alternate cover image of ISBN: 9781466485839August 18, 1828. A wealthy farmer, Jacob Hicks, dies. His friend, Squire Richard Holt, testifies that, on his deathbed, the deceased disinherited his four daughters and named his son, Maris, as his sole beneficiary. In a naive attempt to invalidate the questionable will by eliminating the witness, two disgruntled family members independently fire at the squire. One shot finds its mark.James Daunt, one of the shooters, is seen and accused of the murder. As a posse closes in on him, he is rescued by Sally Morley, an unconventional young woman. She spirits him away to a liberal, utopian community led by Thaddeus Goodenough, a controversial, Bible-quoting preacher who advocates common property and free love. Although James is married to Jacob’s pretty daughter, Margaret, he is attracted to the idiosyncratic Sally. Their relationship grows as he is assimilated into Pleasant Valley Farm. However, the threat of capture and death by hanging is ever present, and with the widespread publication of his description and the offer of a reward, he realizes no refuge is safe for him. James is forced to flee, leaving Sally to deal with her past as well as with the consequences of their passionate love affair.Esther Hicks Latch, Jacob’s oldest daughter, is the second shooter. She falls during her flight from the scene and is seriously injured. Her physical and mental health deteriorates as the fallout from the murder of Richard Holt reverberates around the shooters and ensnares those who are close to them. Esther’s husband, Elias, becomes obsessed with capturing James. Her brother, Maris, faces a legal challenge to the verbal will and acts to ensure his inheritance against the efforts of his siblings to overturn the testimony in court. While trying to save James’ soul, the Reverend Goodenough is compelled to evaluate his own truths.Reverberation, The Novel, is a story of love and friendship, greed and survival set amid the changing social, religious and philosophical mores of antebellum America.",
  "genres": [],
  "author": "V.B. Holmes",
  "average_rating": "3.10",
  "url": "https://www.goodreads.com/book/show/20441971-reverberation-the-novel"
}