{
  "title": "High-Heeled Wonder",
  "description": "Sylvie Bissette may be one of Harbor City’s youngest glitterati, but only her best friends know her most closely guarded secret. She’s the woman behind The High-Heeled Wonder, a must-read blog for fashionistas everywhere. Gossip, fashion advice, exposés. Too bad some people can’t take a little criticism. When an internet troll discovers her secret identity and escalates from stalking her to threatening her life, Sylvie turns to security expert Tony Falcon for help. The investigator from the other side of the tracks is the olive oil to her Evian water and aggravates her to no end, but it’s not just her temper he’s inciting...Tony Falcon wouldn't know a kitten heel from a tabby cat, but since most of the bad guys he tracks down aren't wearing stilettos, it's never been a problem... until he meets Sylvie. When a murder investigation leads him to the same place Sylvie works, he realizes the feisty fashionista may be his best chance at catching the criminals who killed his best friend. It all leads back to the cut-throat fashion world. But solving that case means going after the people Sylvie cares about, and soon his attraction for her—and the danger she’s in—has him wondering if solving the case is worth hurting the woman he can’t stop fantasizing about...When Sylvie’s almost run over in broad daylight, Tony goes undercover as her boyfriend to infiltrate the close-knit fashion community. And when they discover Sylvie’s stalker may be linked to Tony’s own investigation, what started as a simple plan to find his friend’s killers turns into a hot bed of secrets and revelations. In a world full of overblown egos and dog-eat-dog ambition, Tony and Sylvie must work together to find her revenge-obsessed stalker before Sylvie ends up with a literal knife in the back.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Contemporary",
    "Suspense",
    "Contemporary Romance",
    "Audiobook",
    "Mystery"
  ],
  "author": "Avery Flynn",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/20442413-high-heeled-wonder"
}