{
  "title": "ابن الجنرال",
  "description": "\"إن حكايتي هي حكاية صبي إسرائيلي، صهيوني، أدرك أن روايته للقصة لم تكن الرواية الوحيدة، واختار أن يزرع الأمل في واقع يعتبره الجميع مستحيلاً..أشعر أن رحلاتي ورؤاي السياسية التي اكتسبتها من أبي يمكن أن تقدم نموذجاً للمصالحة؛ ليس فقط في الشرق الأوسط، ولكن في أي مكان ينظر فيه الناس إلى \"الآخر\" مرتابين ويسكنهم الخوف، أكثر مما تسكنهم إنسانيتنا المشتركة\". من هذه النافذة وتلك الرؤية نطلّ على حكاية \"ابن الجنرال\" للكاتب \"ميكو بيلد\"، الجندي الإسرائيلي الذي نشأ صهيونياّ ثم ما لبث أن تحوّل إلى واحد من أهم دعاة إنهاء النظام العنصري والمناهضين للصهيونية أمثال: إسرائيل شاحاك، إيلان بابيه، نعوم تشومسكي، وغيرهم كثر...في \"ابن الجنرال\" يدوّن ميكوبيلد رحلته في فلسطين التي ابتدأت بحلم صغير هو أن يصبح عضواً في الوحدات الخاصة ويعتمر القبعة الحمراء رمز القوة والإقدام في إسرائيل. كان حلمه النهائي أن يصبح جنرالاً مثل أبيه، ماتي بيلد، الذي قاد سرية اشتهرت ببسالتها في حرب 1948. وتتحقق أمنية ميكو بدخول الجيش والالتحاق بالقوات الخاصة، ويعود ذات يوم والقبعة الحمراء على رأسه، وفي قلبه فخر قومي لا حدود له. ولكنه يكتشف فجأة أنه لا يريد أن يصبح جنرالاً. لذا، يلقي القبعة ومن ورائها طموحه العسكري، ويشرع في حياة جديدة يسافر معها هذا الكاتب في الزمان على طول عقود وفي المكان عبر العالم: من أمريكا إلى اليابان، ومن بلعين إلى غزة، ومن إسرائيل إلى فلسطين.تشكل القضية الفلسطينية والإنسان الفلسطيني المحور الرئيسي في\"ابن الجنرال\" تلك المأخوذة من الواقع بكل قساوته ومرارته ولكن بعيون إسرائيلي وهو ما يثير فضولنا لقراءة الكتاب، حيث يعود بنا ميكو القهقري إلى الوراء لمعرفة المقدمات والحيثيات والأحداث التي أدت إلى تغييره كإنسان من الداخل ونتدرج معه صعداً من مكان إلى آخر، لنعرف كيف بدأت معركته مع نفسه تلك الانعطافة التي مهدت لها مشاركته في دورية داخل أراضي الضفة الغربية ويشعر أنه ورفاقه من الجنود الإسرائيليين يُهلكون حرث فلاح فلسطيني بسيط في الضفة الغربية دون سبب، خاصةً عندما يراجعُ ميكو الضابط ويأمره بالعودة لمكانه في الدورية. بعد ذلك يرتحل ميكو بأفكاره في الزمان والمكان، وتتطور نظرته النقدية الضدية لكل سلوك تسلكه إسرائيل تجاه الفلسطينيين، فيتخلى تدريجياً عن حلمه الصهيوني حتى يصل إلى مرحلة وصفها بقوله: \"لم تعد لدي أي رابطة عاطفية مع الصهيونية\"، وذلك بعد عدة تجارب مريرة أوصلته إلى تلك النهاية المحتومة.تأتي أهمية هذا الكتاب وتقديمه للقارئ العربي اليوم من كونه انعكاس لمرحلة يحتاج فيها الجميع بقوة للتعرف على خريطة هذا العالم بشكل أفضل، سبراً لغور أشخاصه، كما يرى مترجم الكتاب \"محمود محمد الحرثاني\"، واستكشافاً أعمق لمؤسساته وديناميات التحول التي لا تملكها جهة ميتافيزيقية تحول دون كل تطور وتكبح كل تحرر. إن التاريخ ليس مؤامرة متواصلة الحلقات، ولكنه تيارات تجيء وأخرى تذهب وفراغات تُملأ بالباطل والزيف إن لم يشغلها أهل الحق الأصيل في الأرض والمعنى. وإن فاتنا نحن العرب، وخاصة الفلسطينيون، أن تقف إلى جانبنا قوة خشنة، فإن القوة الناعمة هائلة التأثير لو تم استثمارها من أجل قضايانا العادلة. أليس دالاً أن ينتفض أناس مثل ميكو بيلد وإيلان بابيه وآفي شلايم ونعوم تشومسكي، وكلهم يهود، عن إسرائيل وهي في أوج قوتها، وينضموا للمستضعفين على الطرف الآخر. ألا يدل هذا على القوة الهائلة في فكرة الحق والحرية؟",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Biography",
    "Israel",
    "Memoir",
    "Autobiography"
  ],
  "author": "Miko Peled",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/20443141"
}