{
  "title": "Lexy Baker: Books 1-4",
  "description": "This set includes the first 4 books in the Lexy Baker Cozy Mystery Series:  Killer Cupcakes  Lexy Baker has finally opened her dream bakery, gotten rid of her cheating boyfriend and settled into her grandmothers house with her perky dog Sprinkles at her side. Things are going great … until her ex boyfriend is found poisoned with cupcakes from her bakery.  Suddenly Lexy finds herself in the middle of a murder investigation headed up by her hunky neighbor detective Jack Perillo who figures her for the killer. Lexy takes it upon herself to find the real killer aided by a gang of iPad toting, would-be detective grandmothers.  As things heat up between Lexy and the hunky detective, the real killer closes in and there's only one question to be answered -- will Lexy get her man?   Dying For Danish  When Lexy Baker stumbles over the body of her high paying catering client, she finds herself in a race against time to find the killer. Aided by four iPad toting amateur detective grandma's, her best friend and her little dog Sprinkles, Lexy finds the suspect list growing at every turn.  To make matters worse, the investigation is headed up by her hunky neighbor Detective Jack Perillo who she had been hot and heavy with - until he mysteriously stopped calling her several weeks earlier. Add in a handsome rich suspect, an angry gold digger ex-girlfriend and a suspicious son and you'll see that Lexy has her work cut out for her.  Murder, Money and Marzipan  Lexy's off to Las Vegas to compete in the prestigious Bakery Battles where, you guess it, she stumbles over another body. But not just any body. Contest judge Amanda Scott Saunders has been strangled with Lexy's apron. The local police soon discover Lexy had means, motive and opportunity and Lexy must enlist the aid of her grandmother to help clear her name.  3 Bodies and A Biscotti  The bodies are piling up at the Brook Ridge Falls Retirement Center. Healthy people are dropping like flies. And yet no one believes a murderer is on the loose… except for Lexy Baker and the troupe of iPad-toting grandmothers who live at the center.  When Lexy’s detective boyfriend, Jack, refuses to believe that foul play is involved, Lexy has no choice but to find the killer on her own. Along with Nans and her gang of iPad-toting, mystery-solving grandmas, they use everything from hypnosis to high-tech gadgets to track down the killer.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Audiobook",
    "Romance",
    "Crime",
    "Mystery Thriller"
  ],
  "author": "Leighann Dobbs",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/20449651-lexy-baker"
}