{
  "title": "The Polymorph",
  "description": "Arbitrator, Jim Brown is returning to Earth after completing a successful mission to put down a revolution on and also thwarting an invasion of the planet Pirrus, an Earth colony. While there he found out that he is part alien and this secret had been hidden from him since birth.Brown finds that an alien species has successfully assimilated themselves with the humans on Earth and is ruling over them covertly. When an attempt is made to kidnap him, he realises he has become a target in a hidden game where different groups are vying for power, complicated by the introduction of artificial humans and super androids to boost Earth’s population and armies.Some ruling factions are preparing for war against the planet Levita and re-conquest of a group of planets, former colonies in the Delta Quadrant, who have declared their independence from Earth.Brown realises that he is also running the gauntlet of former enemies who are out to get him. He is desperate to thwart the prospects of war against Levita, where he has a son he has never met and is also against re-colonisation after his recent experiences on Pirrus.Aboard The Space Adventurer, the cruise ship on which he is returning, he meets two beautiful women. Marika, who has been sent as his minder, by the EPA, Earth Policy Administration, to keep an eye on Brown as they don’t fully trust him and Leela, the daughter of Earth’s biggest industrialist, who is secretly building the super androids on a space hub, where the ship makes a stop.He soon realises that he is in a desperate battle for survival, before he can even reach Earth and the big bash the EPA is throwing for him, for successfully completing his mission on Pirrus.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Space",
    "Teen",
    "Space Opera",
    "Young Adult",
    "Novels"
  ],
  "author": "Max Nowaz",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/101265124-the-polymorph"
}