{
  "title": "The House of Cthulhu: Tales of the Primal Land Vol. 1",
  "description": "The House of Cthulhu introduces the weird and wonderful world of Theem'hdra, an island continent of wonders and terrors, where brave men die terrifying deaths, awe-inspiring sorcerers hurl powerful magic at each other, and monsters abound. This is classic Lovecraftian horror from one of the masters of the form, British Fantasy Award-winner Brian Lumley.The volcanic eruption that created the island of Surtsey in 1967 also revealed a long hidden cache of documents that told the fantastic history of Theem'hdra as written by the sorcerer Teh Atht. Building on translations begun by the scholar Thelred Gustau-who vanished under mysterious, some say magical, circumstances-Brian Lumley brings the saga of the Primal Land to readers of today.Here, the wizard Mylarkhrion-most powerful of the terrible magicians who walked the earth in those long-ago days-battles sorcerers jealous of his knowledge, power, and wealth. His own apprentice, thinking he knows all of his master's secrets, challenges him-but Mylarkhrion has one final trick up his sleeve . . . . When the assassin Humbuss Ank, who specializes in killing wizards, makes Mylarkhrion his target, he avoids or destroys nearly all of the sorcerer's traps, forcing Mylarkhrion to a final, desperate gamble for survival. But even Mylarkhrion has a weakness, a lust for power that drives him to summon the Great One, Cthulhu, and so call doom upon himself!The fabled riches of the House of Cthulhu draw thieves and warriors from throughout the civilized-and uncivilized lands, but none escape with so much as a single gemstone, for they discover that Cthulhu's House is not a temple but a dwelling-place. Surely the Elder God lives there still, waiting for an unwary person to open the portal between his world and ours . . . .",
  "genres": [
    "Horror",
    "Fantasy",
    "Cthulhu Mythos",
    "Lovecraftian",
    "Sword and Sorcery",
    "Fiction",
    "Short Stories"
  ],
  "author": "Brian Lumley",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/204533.The_House_of_Cthulhu"
}