{
  "title": "I'm the Man: The Story of That Guy from Anthrax",
  "description": "I'm the Man is the fast–paced, humorous, and revealing memoir from the man who co-founded Anthrax, the band that proved to the masses that brutality and fun didn't have to be mutually exclusive. Through various lineup shifts, label snafus, rock 'n' roll mayhem, and unforeseen circumstances galore, Scott Ian has approached life and music with a smile, viewing the band with deadly seriousness while recognizing the ridiculousness of the entertainment industry. Always performing with abundant energy that revealed his passion for his craft, Ian has never let the gravity of being a rock star go to his shaven, goateed head.Ian tells his life story with a clear-eyed honesty that spares no one, least of all himself, starting with his upbringing as a nerdy Jewish boy in Queens and evolving through his first musical epiphany when he saw KISS live on television and realized what he wanted to do with his life. He chronicles his adolescence growing up in a dysfunctional home where the records blasting on his stereo failed to drown out the sound of his parents shouting at one another. He sets down the details of his fateful escape into the turbulent world of heavy metal. And of course he lays bare the complete history of Anthrax—from the band's formation to their present-day reinvigoration—as they wrote and recorded thrash classics like Spreading the Disease , Among the Living , and the top-twenty-charting State of Euphoria .Along the way, Ian recounts harrowing, hysterical tales from his long tour of duty in the world of hard rock. He witnesses the rise of Metallica, for which he had a front row seat. He parties with the late Dimebag Darrell while touring with Pantera and gets wild with Black Label Society frontman and longtime Ozzy Osbourne guitarist Zakk Wylde. He escapes detection while interviewing Ozzy for \"The Rock Show\" while dressed as Gene Simmons and avoids arrest after getting detained on suspicion of drugs while riding the tube in England with the late Metallica bassist Cliff Burton.In addition, I'm the Man addresses the trials and tribulations of Ian's life and loves. He admits his foibles and reveals the mistakes made along the way to becoming a fully-functioning adult. He celebrates finally finding peace and a true sense of family with his wife, singer/songwriter Pearl Aday, and examines how his world changed after the birth of their first son.I'm the Man is a blistering hard rock memoir, one that is astonishing in its candor and deftly told by the man who's kept the institution of Anthrax alive for more than thirty years.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Autobiography",
    "Audiobook",
    "Memoir",
    "Music Biography"
  ],
  "author": "Scott Ian",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/20448530-i-m-the-man"
}