{
  "title": "Al-Quebeca",
  "description": "Montreal homicide detective Sophie Gillette, still mourning the death of her brother during covert ops in Afghanistan, investigates a fatal hit-and-run, uncovering a terrorist plot to assassinate an American governor, disable New England’s electrical grid, and kill 10,000 hockey fans. ~ Montreal, Quebec. Homicide detective Sophie Gillette, still mourning the death of her brother during covert military operations in Afghanistan, is dispatched to the scene of a fatal hit-and run during a January snowstorm. Defying easy resolution, the case launches her on a collision course with biker wars, arms smuggling by First Nations warriors and, unexpectedly, a deadly terrorist plot. For years the CIA has warned Canada’s Security Intelligence Service that Montreal, where almost one in four residents has ties to Muslim or Arabic-speaking homelands, is a hot-bed of Al-Qaeda sleeper cells awaiting the call to jihad. Gillette, a talented young investigator on the fast track, carries a load of emotional baggage – father and brother both dead of unnatural causes, mother on the edge of a nervous breakdown. Despite her supportive relationship with an RCMP officer, Gillette suffers anxiety, self-doubt and fear of emotional commitments. Meanwhile, her desire to provide justice and closure for a young widow drives her to resolve the hit-and-run case. In the course of their investigation, Gillette and her partner uncover a cadre of militant student activists, drug financiers, gun-runners and a rogue professor with a PhD in chemical toxicology, all with vague links to a shadowy figure known only as al-Quebeca. Dispatched from Paris to strike America and its ally Canada, terrorist Mustafa Nadir is on a bold mission to assassinate an American governor, disable New England’s electrical grid, and kill 10,000 hockey fans. Even as his love for a woman is swept aside by his fanaticism, Gillette pursues him to a brutal confrontation.",
  "genres": [
    "Mystery"
  ],
  "author": "Alan Annand",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/20455895-al-quebeca"
}