{
  "title": "Promise Land: My Journey through America's Self-Help Culture",
  "description": "“In writing this book I walked on hot coals, met a man making a weight-loss robot, joined a Healing Circle, and faced my debilitating fear of flying. Of all of these things, talking to my father about my mother’s death was by far the hardest.”  The daughter of a widowed child psychologist and parenting author, Jessica Lamb-Shapiro grew up immersed in the culture of self-help, of books and pamphlets and board games and gadgets and endless jargon-filled conversations about feelings. It wasn’t until she hit her thirties that Jessica began to wonder: if all this self-improvement arcana was as helpful as it promised to be, why wasn’t she better adjusted? She had a flying phobia, hadn’t settled down, and didn’t like to talk about her feelings. Thus began Jessica’s fascination with the eccentric and labyrinthine world of self-help. She read hundreds of books and articles, attended dating seminars, walked on hot coals, and attempted to conquer her fear of flying. But even as she made light of the sometimes dubious effectiveness of these as-seen-on-TV treatments, she slowly began to realize she was circling a much larger problem: her mother’s death when she was a toddler, and the almost complete silence that she and her father had always observed on the subject. In the tradition of Augusten Burroughs, Jessica Lamb-Shapiro illuminates the peculiar neuroses and inalterable truths that bind families together, whether they choose to confront them or not. Promise Land is a tender, witty, and wise account of a young woman’s journey through her own psyche toward the most difficult stage of grown-up emotional life: acceptance.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Humor",
    "Mental Health",
    "Book Club"
  ],
  "author": "Jessica Lamb-Shapiro",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/20458162-promise-land"
}