{
  "title": "Superclass: The Global Power Elite and the World They Are Making",
  "description": "Each of them is one in a million. They number six thousand on a planet of six billion. They run our governments, our largest corporations, the powerhouses of international finance, the media, world religions, and, from the shadows, the world’s most dangerous criminal and terrorist organizations. They are the global superclass, and they are shaping the history of our time. Today’s superclass has achieved unprecedented levels of wealth and power. They have globalized more rapidly than any other group. But do they have more in common with one another than with their own countrymen, as nationalist critics have argued? They control globalization more than anyone else. But has their influence fed the growing economic and social inequity that divides the world? What happens behind closeddoor meetings in Davos or aboard corporate jets at 41,000 feet? Conspiracy or collaboration? Deal-making or idle self-indulgence? What does the rise of Asia and Latin America mean for the conventional wisdom that shapes our destinies? Who sets the rules for a group that operates beyond national laws? Drawn from scores of exclusive interviews and extensive original reporting, Superclass answers all of these questions and more. It draws back the curtain on a privileged society that most of us know little about, even though it profoundly affects our everyday lives. It is the first in-depth examination of the connections between the global communities of leaders who are at the helm of every major enterprise on the planet and control its greatest wealth. And it is an unprecedented examination of the trends within the superclass, which are likely to alter our politics, our institutions, and the shape of the world in which we live. David Rothkopf is the author of Running the The Inside Story of the National Security Council and the Architects of American Power. He is the president and chief executive of Garten Rothkopf, an international advisory firm; a visiting scholar at the Carnegie Endowment for International Peace; and a teacher of international affairs at Columbia University’s Graduate School of International and Public Affairs. David Rothkopf estimates that there are six thousand members of the superclass—on a planet of six billion. They are the wealthiest, the most elite, and they hold the most power. They run our governments, our largest corporations, the powerhouses of international finance, the media, world religions, and, from the shadows, the world’s most dangerous criminal and terrorist organizations. The six thousand people who compose the global superclass are shaping the history of our time.Today’s superclass has achieved unprecedented levels of wealth and power. Nationalist critics have argued that they have more in common with one another than with their own countrymen. They have globalized more rapidly than any other group—they control globalization—but they have been accused of feeding the growing economic and social inequity that divides the world. What happens inside closed-door meetings in Davos or aboard corporate jets at 41,000 feet? Conspiracy or collaboration? Deal-making or idle self-indulgence? What does the rise of Asia and Latin America mean for the conventional wisdom that shapes our destinies? Who sets the rules for a group that operates beyond national laws?Drawn from exclusive interviews and extensive original reporting, Superclass answers all of these questions as it draws back the curtain on a privileged society that most of us know little about, even though it profoundly affects our everyday lives. It is the first in-depth examination of the connections between the global communities of leaders who are at the helm of every major enterprise on the planet and control its greatest wealth. And it is an unprecedented examination of the trends within the superclass, which are likely to alter our politics, our institutions, and the shape of the world in which we live. \"Mr. Rothkopf's book argues that on many of the most critical issues of our time, the influence of all nation-states is waning, the system for addressing global issues among nation-states is more ineffective than ever, and therefore a power void is being created. This void is often being filled by a small group of players—'the superclass'—a new global elite, who are much better suited to operating on the global stage and influencing global outcomes than the vast majority of national political leaders.\" — Thomas L. Friedman, The New York Times \"Mr. Rothkopf's book argues that on many of the most critical issues of our time, the influence of all nation-states is waning, the system for addressing global issues among nation-states is more ineffective than ever, and therefore a power void is being created. This void is often being filled by a small group of players—'the superclass'—a new global elite, who are much better suited to operating on the global stage and influencing global outcomes than the vast majority of national political leaders.\" — Thomas L. Friedman, The New York Times\"Mr Rothkopf makes a fascinating tour of the world of the superclass. He opens the door to the office of the head of Goldman Sachs, Lloyd Blankfein, on the top floor of Goldman's tower on New York's Broad Street. He visits the factory that customises Gulfstream jets (every year nearly 10% of Gulfstream's clients attend Davos). He calls on the Carlyle Group where financiers and former presidents get together to make each other richer. And he offers a tour of the weird proceedings of the Bohemian Grove meetings, which Richard Nixon described as 'the most faggy goddamned thing you could ever imagine' . . . Superclass is a pioneering study of a subject that has often been the preserve of conspiracy theorists. Mr Rothkopf is anything but a crank, and he is right when he says that, these days, the most influential people around the world are also the most global people. He is also admirably ambivalent about his subject. He worries about surging inequality—the richest 1% of humans own 40% of the planet's wealth—and about the rumbling backlash against so much unaccountable power. But he points out that, in a world where most global institutions are lumbering and antiquated, members of the superclass have repeatedly stepped in to put the global system to rights. Let us hope that they have not lost their touch.\"— The Economist\"If you're trying to figure out where to throw your Molotov cocktails, David Rothkopf's book proves you've got your work cut out for you. The businessman and former Clinton official spent years crunching numbers and trailing the 6,000 or so 'power elite' who make most of the decisions about how the planet works. Neither a gossipfest nor an anarchist call to arms, this measured book demonstrates the way these elite businessmen anonymously influence politicians and dictators, and take advantage of international chaos to advance their own interests.\"— New York magazine\"There are just over 6,000 people in the superclass. So says the author of this fascinating book, a field guide to the world's most élite citizens. See the rich and powerful in their natural habitats, from Davos and Bilderberg to the Bohemian Grove. 'That such a group exists is indisputable,' says Rothkopf, who includes such power brokers as heads of state, CEOs of the world's largest companies, billionai",
  "genres": [
    "Nonfiction",
    "Politics",
    "Economics",
    "Business",
    "History",
    "Finance",
    "Sociology"
  ],
  "author": "David Rothkopf",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/2045737.Superclass"
}