{
  "title": "Fallen Into the Pit",
  "description": "Best known in America for her brilliantly imagined twelfth-century Benedictine monk/detective, Brother Cadfael, Ellis Peters has also enthralled fans on both sides of the Atlantic with her superbly constructed stories featuring British police detective George Felse. Inspector Felse first appeared in what has since been called a classic of the genre, Fallen Into the Pit. Never before available in the United States, this multilayered, most ingenious whodunit is long-awaited and, as mystery fans will soon discover, well worth waiting for. \"Understand me once and for all, fighting is something not to be considered short of a life-and-death matter... It proves nothing. It solves nothing,\" Chad Wedderburn tells thirteen-year-old Dominic Felse. A classics master who fought with the Resistance, Wedderburn came home to Comerford to teach school. Ironically, when the peace of the little village is shattered by the murder of a former German prisoner of war, it is the peaceful Wedderburn who becomes the primary suspect. Police Sergeant George Felse is deeply disturbed that his son Dominic is the one who discovers the body, and that the boy has begun doggedly pursuing clues in Comerford's isolated countryside. Murder is a deadly business, and the closer young Felse comes to the truth, the more likely he is to become a victim himself. His father knows this all too well, and for the first time in his career his personal life is threatened by his policeman's duties. Now, as George Felse uncovers the skeletons in the closets of Comerford's best citizens, he begins to understand the forces that may drive men or women to desperate acts. But will he deduce enough to forestall another tragedy - or stop a killer with a twisted mind and bloody plans? Rich with the hues of the Shropshire countryside and its vividly drawn character portraits, this irresistibly suspenseful mystery is still further reason to place Ellis Peters alongside Agatha Christie, Dorothy Sayers, and P. D. James as",
  "genres": [
    "Mystery",
    "Fiction",
    "Historical Fiction",
    "Crime",
    "British Literature",
    "Historical Mystery",
    "Mystery Thriller"
  ],
  "author": "Ellis Peters",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/2046232.Fallen_Into_the_Pit"
}