{
  "title": "House Lust: America's Obsession With Our Homes",
  "description": "A rich narrative that blends social commentary with incisive reporting, House Lust offers an astute, funny, and sometimes disturbing portrait of the behaviors that drove the greatest real estate boom in history—and its eventual bust.Owning a home has long been considered the fulfillment of the American Dream. But in the last decade, as the real estate market boomed, Americans’ fascination with homes turned into a frenzy. Everywhere we turned, people were talking about, scheming over, envying, shopping for, refinancing, or just plain ogling houses—in the process, we’ve transformed shelter from a basic necessity into an all-consuming passion.In House Lust, Newsweek’s Daniel McGinn travels the country to explore the roots of this mania. Even as the real estate boom has turned to bust, Americans remain obsessed with houses—many of us are still trading up, adding on, or doubling down to buy vacation property. But for others, this zeal for housing has carried a painful price, one that’s evident in the soaring foreclosure rates and mounting despair as millions of homeowners (and their lenders) realize they’ve stretched too far to buy the home of their dreams.In a compelling narrative that takes us inside the homes—and psyches—of the House Lust–afflicted throughout the nation, McGinn examines the forces that turned housing into the talk of dinner parties. He explores the arms race for square footage and introduces readers to a menagerie of characters from the real estate world—from “renovation psychologists” who treat remodeling-addled clients to a guy who trades vacation time-shares the way kids trade baseball cards. McGinn also jumps into the fray himself by enrolling in real estate school and buying an investment property, sight unseen, over the Internet.House Lust shows us just how contagious the ideal of owning the best home on the block can be. And as the real estate boom recedes into memory, McGinn offers cautionary tales to help us curb our lust when prices start rising again.From the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "Audiobook",
    "History",
    "Cultural",
    "Psychology",
    "Finance",
    "Book Club"
  ],
  "author": "Daniel McGinn",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/2045766.House_Lust"
}