{
  "title": "Verenhimo – Suomalaisia vampyyritarinoita",
  "description": "Mitä, Suomessako muka ei ole vampyyreja? Niitähän on tunnetusti vain Transylvanian vuoristossa ja Yhdysvaltain eteläosissa, mutta hyvin niitä mahtuisi piileksimään myös Suomen pimeisiin kuusimetsiin. Vampyyri on myös surullinen, yksinäinen hahmo – mikä vetoaisi suomalaisiin paremmin kuin pimeässä viihtyvä, päivät nukkuva tyyppi, jolla on ongelmia hampaistonsa kanssa?Ainakin vampyyritarinoita täällä osataan kirjoittaa. Sen todistavat Verenhimo-kirjan novellistit, jotka ottavat perinteisen hahmon ja istuttavat sen suomalaiseen maaperään tyylikkäästi ja pelottavasti. Verenhimo päivittää vampyyrimyytin monella eri tavalla: vampyyrit hallitsevat ihmisiä iilimatojen avulla, ottavat osaa seuroihin, ovat kansainvälisten lääketehtaiden koekaniineja, vaanivat ihmisiä sairaalan käytävillä. Mutta lopulta vampyyrikin ottaa ilon irti perinteisestä perjantaipullosta. Monet tarinat ottavat vauhtia myös historiasta – kuka tiesi, millaisia salaisuuksia piilee esimerkiksi Ulrika Eleonoran kirkon rakentamisessa...Verenhimo-teoksen kirjoittajat ovat uuden polven science fiction-, fantasia- ja jännärikirjoittajia, joilla on veri hallussaan. Mukana tarina muun muassa Finlandia-palkitulta Johanna Sinisalolta sekä Runeberg-palkitulta Tiina Raevaaralta.Tarinalistaus:\tLeinonen, Anne. Surma tuli jään yli\tSinisalo, Johanna. Peili\tPeltoniemi, Sari. Vain mato, matkamies maan\tSalin, Petri. Isä meidän\tSoikkeli, M. G. Tuo meille hautavettä jos palaat\tWaltari, Mika. Muumio\tKatajala, Jussi. Korpin silmät kaiken näkevät\tKoskinen, Juha-Pekka. Yövuoro\tLeppä, Asta. Ystäväni Leo\tThorel, Christine. Uhanalaiset\tLaine, Petri. Keskiyön konsertto D-mollissa\tAnttila, Leo. Kohtalo\tNevala, Heikki. Juotikkaat\tSaloranta, Tuomas. Minulla on tehtävä\tMäki, Harri István. Enkeli tupakkasalongissa\tHarri Erkki. Himo\tKaronen, Jarmo. Leimu ja Saarni\tSupinen, Miina. Kuristajakäärme\tTammi, Jari. Pojan rippijuhlat\tEtelä, Harry. Vampyyrin orja\tKita, Rene. Vampyyrin lauantai\tRaevaara, Tiina. Progress\tNummelin, Juri. Vampyyriviihteen historiasta",
  "genres": [
    "Fantasy",
    "Horror",
    "Short Stories",
    "Vampires",
    "Finnish Literature",
    "Fiction"
  ],
  "author": "Juri Nummelin",
  "average_rating": "3.03",
  "url": "https://www.goodreads.com/book/show/11148106-verenhimo-suomalaisia-vampyyritarinoita"
}