{
  "title": "Tall, Dark and Alpha Boxed Set",
  "description": "10 Sexy Romances Featuring Hot Alpha Heroes and the Women They Love!He makes your heart pound and melts your resistance away. He promises you a world of passion and you find it impossible to resist his dark charm. When he catches your eye across the room, you know he means business. He could be an executive, cop, shape shifter, or a bad boy looking for a little fun. Once he has you in his sights, you can't get away—and after one sizzling night in his arms, you won't want to. He’s Tall, Dark & Alpha. The alpha male is the ultimate indulgence…the richest dark chocolate…and we’re offering him to you in abundance. Delve into the sensual worlds of award-winning Randi Alexander, Koko Brown, Sam Cheever, Delaney Diamond, Eve Langlais, Afton Locke, Dawn Montgomery, Farrah Rochon, Paige Tyler, and Eve Vaughn. Immerse yourself in the alpha male experience. [ My Boat|21523121] by Afton Rhonda Simms embarks on a cruise to create an ad campaign. Instead, she lands Simon Mann, a blue marlin shape shifter who will do anything to be human again. Will she let him rock her boat? [ Tongued Devils|22369190] by Dawn Captain Na'varr and his executive officer, Brom, know they have a good thing when they capture stowaway hacker, Raesa, with her hot temper and dangerous curves. They want her, body and soul just as she wants them. But such trust endangers them in ways none of them can anticipate. Dare they risk it all?[ for Love|11719497] by Delaney Rafael Lopez, former professional wrestler and “Sexiest Athlete Alive,” is back and determined to hold onto the woman he lost, but still loves, and the son he never knew existed. [ (Vampire Love)|19086645] by Eve Ella hears voices and they don’t like anyone. But not even poltergeists can stand in the way of a vampire in love.Sex With An Ex by Eve Vaughn [ Her Wildest Dreams|19092018] by Farrah When Erica Cole, owner of \"Your Wildest Dreams\" event planning, requests his help in creating a Valentine’s Day fantasy date for her clients, chocolatier Gavin Foster sees it as the perfect opportunity to show her just how sweet their reality could be.[ Challenge|23120851] by Koko Sports agent Gemma Clarke must face the biggest challenge of her young represent her former lover and bad boy footballer, Devin Spencer. Their passionate love affair ended badly. Now he's back to prove to Gemma he's changed and convince her to give them one more chance.[ Cops, a Girl and a Pair of Handcuffs|19439523] by Paige Cilla Garner has it bad for hot cops Hayes Prescott and Reed Lockwood. If they both end up asking her out, she doesn't know how she'll choose. Having a threesome doesn't even enter her mind until they hint at it, and then it's all she can think about.[ and Seduction|11485193] by Randi Country music superstar/actor Chase Tanner has never wanted anything or anyone more than gorgeous screenplay writer Reno Linden. To Reno, Chase is larger than life, sinfully sexy and hell-bent on getting her into bed. Reno risks the plunge into Chase’s arms, but will their attraction survive the glitz and stress of fame?[ Dark & Apocalyptic|22850051] by Sam He’s a hunter in a world turned upside down. She’s his prey, a creature of dark magic. But the passion burning within them may be their undoing.",
  "genres": [
    "Romance",
    "Anthologies",
    "Contemporary",
    "Paranormal",
    "Contemporary Romance",
    "Vampires",
    "Interracial Romance"
  ],
  "author": "Afton Locke",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/20482968-tall-dark-and-alpha-boxed-set"
}