{
  "title": "What Makes Cannabis Recipes Work?: The Ingredients & Tactics!",
  "description": "What strikes your mind first when you hear about Marijuana? Dangerous Drug! Right? Yes? Or No? Well, Marijuana is a very controversial issue with a lot of information being spread around, both for and against it. The truth about marijuana needs to be brought to light so that everyone can decide, with an educated opinion, whether or not the positive effects of marijuana outweigh the negative ones. Between the anti-drug activists, who would utter anything to make marijuana seem as if an evil life-taking drug, and the pro-drug activists, who tend to feel like it is a plant which was sent down from the heaven to save mankind, the actual data and facts can get quite warped and distorted. If used casually marijuana’s positive effects outweigh the negative. Yes! Marijuana is safe when used cautiously. The American Medical Association has now recognized the medical value of marijuana. Its positive benefits •Beautiful visions •An increased appetite for life •Compassion •Treating respiratory allergies •To help a person have an emotional or mental breakthrough •And many more! We are offering you an amazing eBook “What Makes Cannabis Recipes Work”. In these health-consciousness days, many people are giving up smoking. That's where this book in. These recipes are so delicious that nothing will get wasted except your dinner guests. This is not just \"some book\". In fact, there isn’t any book like this out there available. * It is NOT about rehashed or outdated recipes. * It is NOT some fancy photo book with nothing but ad-filled crap. * It is NOT some confusing, babbling, rambling Tetra-Hydro botany speak you won't understand. * It is NOT any other poorly put together book that after completing leaves the reader in the dark on many other issues and with so much more to be desired. The book is full of delicious recipes that come with detailed descriptions about the preparation process. This book reveals the process for creating the essential ingredients necessary for marijuana infusion into foods such as Cannabutter, Ghee, Cannabis Tar and Cannabis Cooking Brandy. Don’t wait! Grab this book NOW and take your health to a next level!",
  "genres": [],
  "author": "Ronald E. Hudkins",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/20465315-what-makes-cannabis-recipes-work"
}