{
  "title": "Stonewalled: My Fight for Truth Against the Forces of Obstruction, Intimidation, and Harassment in Obama's Washington",
  "description": "Who's been Hacking Sharyl Attkison's computers? Computers that turn themselves on in the night, make strange noises, then shut themselves down. Whoever is doing it is using highly sophisticated spyware available only to our top intelligence agencies. Is someone trying to send Attkisson a message?Seasoned CBS reporter Sharyl Attkisson reveals how she has been electronically surveilled while digging deep into the Obama Administration and its scandals, and offers an incisive critique of her industry and the shrinking role of investigative journalism in today’s mediaAmericans are at the mercy of powerful figures in business and government who are virtually unaccountable. The Obama Administration in particular has broken new ground in its monitoring of journalists, intimidation and harassment of opposition groups, and surveillance of private citizens. Sharyl Attkisson has been a journalist for more than thirty years. During that time she has exposed scandals and covered controversies under both Republican and Democratic administrations. She has also seen the opponents of transparency go to ever greater lengths to discourage and obstruct legitimate reporting.Attkisson herself has been subjected to “opposition research” efforts and spin campaigns. These tactics increased their intensity as she relentlessly pursued stories that the Obama Administration deemed dangerous to it. Stonewalled is the story of how her news reports were met with a barrage of PR warfare tactics, including online criticism, spying in her personal computer, probable phone taps, illegal access to her business lines to CBS, as well as emails and phone calls up the network chain of command in an effort to intimidate and discourage the next story. In Stonewalled, Attkisson recounts her personal tale, setting it against the larger story of the decline of investigative journalism and unbiased truth telling in America today.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Biography",
    "Journalism",
    "Memoir",
    "American History"
  ],
  "author": "Sharyl Attkisson",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/20483097-stonewalled"
}