{
  "title": "Shadow Boxer",
  "description": "Fatigued from her latest mission where sleep was only a fleeting blip in time, Evy Rivera will see no reprieve. Urgently, she must again travel back in time to ancient Rome. Now, she’s tasked with saving her lover’s daughter before Evy’s misogynistic mentor ensures the girl’s death. Worse, Evy must push aside her heart-wrenching desire to reconnect with Constantine to focus on her task. Every step draws Evy deeper into the mysteries and lies surrounding her lightning rider ability. Once her assignment in Rome is complete, she’s ripped away from Constantine and hurled through infinity. Evy’s warring mentors send her on a far different mission. With nowhere to turn, she must align herself with the man who despises her in order to befriend Nikola Tesla and keep his patents out of the FBI’s clutches. But her heart aches for Constantine. Will she be able to push her feelings aside and complete the alteration before it’s too late?Readers wanted more ...“...An excellent job of developing each character through her vivid details. I really enjoyed this book and can't wait to see what other adventures await Evy.” Leigh, Goodreads“With a totally original premise, solid storytelling, and good writing, this story is one you won't want to miss.” - Brianna, Goodreads“Brilliant...a heroine you [can] relate to ... her Spanish temperament shines through with amusing results ... plenty of action and danger, horses, motorbikes, swords and arrows, bloodshed and fear but also a hefty dollop of romance...” Carole, Goodreads“From the moment I started reading this story, I knew I was going to love the original and unique concept of the Lightning Rider. This story was action packed from beginning to end...” Michele, Goodreads5/5 Stars “I will definitely be waiting to read the rest. I loved the story line and thought it was well written. The story was unique and has a good Science Fiction element. The ending sets the reader up, eagerly waiting for the next book to see what happens to Evy, her family, and those who know her secret.” Stacy Sabala, Goodreads",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "New Adult",
    "Romance",
    "Science Fiction",
    "Time Travel"
  ],
  "author": "Jen Greyson",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/20475959-shadow-boxer"
}