{
  "title": "Henry V: The Astonishing Triumph of England's Greatest Warrior King",
  "description": "Henry V reigned over England for only nine years and four months and died at the age of just thirty-five, but he looms over the landscape of the late Middle Ages and beyond. The victor of Agincourt, he is remembered as the acme of kingship, a model to be closely imitated by his successors. William Shakespeare deployed Henry V as a study in youthful folly redirected to sober statesmanship. For one modern medievalist, Henry was, quite simply, “the greatest man who ever ruled England.” For Dan Jones, Henry V is one of the most intriguing characters in all medieval history, but one of the hardest to pin down. He was a hardened, sometimes brutal warrior, yet he was also creative and artistic, with a bookish temperament. He was a leader who made many mistakes, who misjudged his friends and family, but he always seemed to triumph when it mattered. As king, he saved a shattered country from economic ruin, put down rebellions, and secured England’s borders; in foreign diplomacy, he made England a serious player once more. Yet through his conquests in northern France, he sowed the seeds for three generations of calamity at home, in the form of the Wars of the Roses. Henry V is a historical titan whose legacy has become a complicated one. To understand the man behind the legend, Jones first examines Henry’s years of apprenticeship, when he saw the downfall of one king and the turbulent reign of another. Upon his accession in 1413, he had already been politically and militarily active for years, and his extraordinary achievements as king would come shortly after, earning him an unparalleled historical reputation. Writing with his characteristic wit and style, Jones delivers a thrilling and unmissable life of England’s greatest king.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Medieval",
    "British Literature",
    "Audiobook",
    "War"
  ],
  "author": "Dan Jones",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/204640542-henry-v"
}