{
  "title": "What My Heart Wants",
  "description": "***This edition contains 2 ebooks: What My Heart Wants and Waiting For A Fall***Did I miss a class growing up? You know the kind that teaches you how to deal with teenage heartache and maybe how to avoid it all together?I could have used the advice.Desperately.Senior year wasn’t supposed to be like this for Annabelle Simms. Thanks to James, after having a crazy off/on relationship with himsince school started, it’s been nothing but heartache central.After confronting James and the popular crew in front of the entire school, things were about to get harder. If she had any hope of surviving the rest of her senior year in one piece, she’d have to ignore what her heart wanted and start listening to her head.How many times could she say this was the last time before… it was too late?Warning Contains Sexual ScenesRecommended for ages 17+This is not a standalone novel. Book 3 in Y.A SeriesWAITING FOR A FALLPreviously published as Young Annabelle Series: Young Annabelle, The Truth About James, What My Heart Wants (Books #1-3).***Author's Cut Version******Warning contains strong language and sexual scenes******There is a HEA***The first time I met James I thought he was an idiot. But the more time we spent together the more I realized that he was just as angry as I was. Him with his dad and me with my mom. He’s got me all twisted, messed up to a point where I barely recognize myself anymore. My best friend tells me to dump him. My parents don’t know he exists. But I can’t seem to stay away. When we’re alone it’s everything, but when we’re at school it’s like we don’t even exist, and I wish he’d tell me why.Already a star on the Royal Heights High School Baseball team, James Lawson wasn’t your average transfer student. Even with his ‘new guy’ status, he quickly becomes one of the popular ‘Kings’ at school and that alone should have been the red flag Annabelle needed to stay away from him. He’s arrogant, intense, rude and worst of all he seems like the kind of guy that usually gets what he wants. But the more time they spend together the more difficult she finds it to stay away from him, especially with all the stress her mother is causing her concerning her appearance. As if she didn't already have enough to worry about, she finds out that the popular ‘Queen’ of Royal Heights High had her sights set on a certain popular ‘King’. In Donna Tallins eyes, James was her perfect match, but there was one person standing in her way of high school couple stardom. And that was Annabelle.",
  "genres": [
    "Young Adult",
    "Romance",
    "High School",
    "New Adult",
    "Contemporary",
    "Sports Romance"
  ],
  "author": "Sarah Tork",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/20486808-what-my-heart-wants"
}