{
  "title": "While They Slept: An Inquiry Into the Murder of a Family",
  "description": "Early on an April morning, eighteen-year-old Billy Frank Gilley, Jr., killed his sleeping parents. Surprised in the act by his younger sister, Becky, he turned on her as well. Billy then climbed the stairs to the bedroom of his other sister, Jody, and said, “We’re free.”But is one ever free after an unredeemable act of violence? The Gilley family murders ended a lifetime of physical and mental abuse suffered by Billy and Jody at the hands of their parents. And it required each of the two survivors–one a convicted murderer, the other suddenly an orphan–to create a new identity, a new life.In this mesmerizing book, bestselling writer Kathryn Harrison brilliantly uncovers the true story behind a shocking and unforgettable crime as she explores the impact of escalating violence and emotional abuse visited on the children of a deeply troubled family. With an artistry that recalls Truman Capote’s In Cold Blood, Norman Mailer’s The Executioner’s Song, and her own The Kiss, Harrison reveals the antecedents of the murders–of a crime of such violence that it had the power to sever past from present–and the consequences for Billy and for Jody. Weaving in meditations on her own experience of parental abuse, Harrison searches out answers to the question of how survivors of violent trauma shape a future when their lives have been divided into Before and After.Based on interviews with Billy and Jody as well as with friends, police, and social workers involved in the case, While They Slept is Kathryn Harrison’s unflinching inquiry into the dark heart of violence in an American family, and a personal quest to understand how young people go on after tragedy–to examine the extent as well as the limits of psychic resilience. The New York Times called Kathryn Harrison’s The Kiss “a powerful piece of writing, a testament to evil and hope.” The same could be said about While They Slept.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Mystery",
    "Memoir",
    "Adult",
    "Biography"
  ],
  "author": "Kathryn Harrison",
  "average_rating": "2.91",
  "url": "https://www.goodreads.com/book/show/2048874.While_They_Slept"
}