{
  "title": "The Great Warming: Climate Change and the Rise and Fall of Civilizations",
  "description": "How the earth's previous global warming phase, from the tenth to the fifteenth centuries, reshaped human societies from the Arctic to the Sahara―a wide-ranging history with sobering lessons for our own time.From the tenth to the fifteenth centuries the earth experienced a rise in surface temperature that changed climate worldwide―a preview of today's global warming. In some areas, including Western Europe, longer summers brought bountiful harvests and population growth that led to cultural flowering. In the Arctic, Inuit and Norse sailors made cultural connections across thousands of miles as they traded precious iron goods. Polynesian sailors, riding new wind patterns, were able to settle the remotest islands on earth. But in many parts of the world, the warm centuries brought drought and famine. Elaborate societies in western and central America collapsed, and the vast building complexes of Chaco Canyon and the Mayan Yucatan were left empty.As he did in his bestselling The Little Ice Age , anthropologist and historian Brian Fagan reveals how subtle changes in the environment had far-reaching effects on human life, in a narrative that sweeps from the Arctic ice cap to the Sahara to the Indian Ocean. The history of the Great Warming of a half millennium ago suggests that we may yet be underestimating the power of climate change to disrupt our lives today―and our vulnerability to drought, writes Fagan, is the \"silent elephant in the room.\"Learn more at www.brianfagan.com.Brian Fagan discusses The Great Warming on The Daily Show with John Stewart.PRAISE for The Great Warming :\"This is not only World History at its best, sweeping across all of humankind with a coherent vision, but also a feat of imagination and massive research. If Fagan has given the medieval period throughout the globe a new dimension, he has at the same time issued an irrefutable warning about climate change that is deeply troubling.\"―Theodore Rabb, author of The Last Days of the Renaissance\"Climate has been making history for a very long time, though historians have rarely paid much attention to it. But as it turns out, a few less inches of rain, a change in temperature of just a degree or two can make all the difference in how human events unfold. The Great Warming demonstrates that although human beings make history, they very definitely do not make it under circumstances of their own choosing.”―Ted Steinberg, author of Down to Nature’s Role in American History and American The Obsessive Quest for the Perfect Lawn",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Environment",
    "Climate Change",
    "Archaeology",
    "Audiobook"
  ],
  "author": "Brian M. Fagan",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/2048995.The_Great_Warming"
}