{
  "title": "تغريبة العبدي المشهور بولد الحمرية",
  "description": "وتتم « تغريبة العبدي » ثلاثية نصية لهذا المبدع، من مواليد أسفي، والتي تتوج مرحلة هذا الحراك الروائي الذي بدأت تشهده المدينة والجهة السنوات الأخيرة على مستوى الإصدارات.الروائي عبدالرحيم لحبيبي والذي انشغل سنوات بالتربية والتدريس تفرغ السنوات الأخيرة للكتابة الروائية، وخاض مغامرة نص روائي يحتفي بالمكان وبمتخيله، وعليه أسس وانطلاقا من نصه الروائي الأول « خبز وحشيش وسمك » أسلوبه الخاص في الكتابة الروائية. وتختلف الرواية الثالثة عن سابقتها بدرجة النضج الفني الذي كتب بها المبدع نصا روائيا ينطلق من مخطوط كي يبني نصا رحليا يبحث في ثنايا الأمكنة وعوالم المقدس. مخطوط الرواية انتشله السارد من الضياع من « سوق العفاريت » بأسفي ليعيد نسج تفاصيله على القارئ وليتحول الى مطية لنسج الحكاية الأساس. ويحاول النص الروائي « تغريبة العبدي المشهور بولد الحمرية »، تقع الرواية في 256 صفحة، أن ينسج نصا روائيا تاركا « للعبدي » ملأ بياضاته لكن، هذه المرة في قالب روائي حاول الخروج على الطابع التقليدي بتجريب قوالب جديدة تتماهى مع تيمة الرواية والتي تتميز هذه المرة بالجدة في طرحها ومنظورها السردي.-------------------------------------------------------نعتوا لي هناك رجلا مجذوبا يجلس عاريا أمام خرابة. عاريا كما ولدته أمه، كان يمشي بالأسواق كذلك، حاسر الرأس، مكشوف السوأتين، تحكي عنه كرامات مطلعا على المغيبات يقرأ ما بالقلوب والنفوس وما تهجس به... أقرأته السلام والتحية وجلست أمامه، رفع رأسه نحوي ووضع يده على فرجه، فاستغرب ما فعل، نظر في عيني وقال: انتظرتك طويلا أيها المغربي، قلت: وما أدراك أنني من بلاد المغرب؟ قال: العلامات، قلت مستوضحا: أية علامات. قال: العلامات تظهر وتختفي، لكنها تتكلم... تابع كلامه، سافرت طويلا وجبت الآفاق، رأيت أناسا وديارا وبحارا وقفارا، أنا لم أرحل إلى أي مكان، لكنني سافرت بعيدا، أبعد مما تظن، صادفتك، لكنك لم تتعرف عليّ، ما تبحث عنه لن تجده هنا، ربما كان هنا ذات يوم، قد يعود أو لا يعود... قلت له دون أن أفكر: جئتك لائذا خائفا مذعورا، قال: أعرف، الخوف يجمع الأحباب، كلنا نخاف الله لكي نحبه، أما هؤلاء، فلا خوف منهم ولا عليهم، فدعهم في عماهم يعمهون، وفي غبائهم ينعمون...\"",
  "genres": [
    "Fiction",
    "Novels"
  ],
  "author": "عبد الرحيم لحبيبي",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/20487564"
}