{
  "title": "The Bat",
  "description": "The Bat (An Existential Fable) is an action-adventure novel centered on the not-too-distant future in NYC as the Big Apple becomes the beacon of the world in the throes of the Great Recession. Existentialism becomes a philosophical alternative to religion in a city that has lost hope in the future. Crime is rampant as narcotic use has reached epidemic proportions, and vigilantes began to capture the imagination of the world press as they take a stand in the War On Gangs. Special Forces Captain Garrison is an Iraqi vet whose respect in the community is second only to that of Dr. Albert Coulter, the leader of the Outreach Project at the Harbor VA in NYC. Coulter hopes to counsel troubled vets to avoid a rumored network of ex-military taking part in the vigilante actions. Garrison is also concerned as some of his colleagues are being suspected of being among the key figures. The two men are drawn together in an uneasy alliance, both suspicious of the other’s ulterior motives. Deception is a theme that resonates throughout the plot as Brenda Hammond, the major female protagonist, joins the group as a grad student researching her thesis paper. She has an affair with Garrison’s close friend, Johnny Sullivan, who is unaware that Brenda is an undercover cop. Her mentor, Chief Joel Madden, has assigned her to infiltrate the alleged vets’ network though expecting her success to improve his successes at winning her heart. He assigns a team of detectives to keep watch over her, unaware that they are on the payroll of a Mafia family involved in a desperate rivalry with street gangs and drug cartels for control of the drug traffic in NYC. The characters are drawn closer and deeper into the drug wars as violence turns the streets of New York into a war zone. The plot thickens as Homeland Security agents are alerted to the discovery of an experimental drug developed for military use by a research team headed by Dr. Coulter. Traces of the drug are discovered in tainted crack that is causing a pandemic in ghetto areas. Coulter is being watched by not only HS but the NYPD as they work feverishly to track down the distributors of the superdrug. It is left to the mysterious Bat to solve the mysteries and help bring the predators to justice.",
  "genres": [],
  "author": "John Reinhard Dizon",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/20486195-the-bat"
}