{
  "title": "Fireproof: Memoir of a Chef",
  "description": "With rare intensity and candor, world-renowned, Michelin-starred Chef Curtis Duffy shares his epic journey from child of an outlaw biker father to famed culinary iconoclast. Fans of no holds-barred stories such as Motley Crue’s The Dirt, memoirs by celebrity chefs, and brutally honest personal memoirs will love this raw and inspiring true story.  “Chef Curtis Duffy's Fireproof is like Anthony Bourdain's Kitchen Confidential meets Sons of Anarchy.”—Peter Blauner, New York Times bestselling author of The Intruder Fireproof charts Chef Curtis Duffy’s rise in spite of trauma, to being mentored by and recognized among the world’s top chefs. Amid childhood chaos in rural Ohio, a young Duffy first found refuge in Home Ec class, then at one of Columbus’s best restaurants, where he honed his skills. His passion ignited, Duffy was dead set on leaving Ohio and breaking the Duffy family curse. But the tragic deaths of his parents jeopardized his promising trajectories. Summoning extraordinary fortitude, Duffy ate pain, graduated culinary school, and moved to Chicago to work in Chef Charlie Trotter’s kitchen—a hotbed of talent that produced prominent alumni such as Grant Achatz, Graham Elliot, and Homaro Cantu. Inspired by stellar peers and staging for Thomas Keller at the French Laundry, Duffy’s drive only grew. His meteoric rise would cost him a marriage—the price of ambition, focus, and Grace restaurant. Grace earned three Michelin stars four years in a row, solidifying Duffy’s place as one of the world’s greatest culinary artists. But in a heartbreaking act of defiance, Duffy walked out after disputes with Grace’s owner. Unstoppable, Duffy created Ever restaurant—a launch nearly derailed by the COVID-19 pandemic. Duffy persisted where many others would have resigned their craft, and Ever earned two Michelin stars from 2021-2024. Duffy was ranked one of the “50 Most Powerful People in American Fine Dining” in 2024 by the Robb Report.",
  "genres": [
    "Memoir"
  ],
  "author": "Curtis Duffy",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/204876727-fireproof"
}