{
  "title": "The Winter Palace",
  "description": "From award-winning author Eva Stachniak comes this passionate novel that illuminates, as only fiction can, the early life of one of history’s boldest women. The Winter Palace tells the epic story of Catherine the Great’s improbable rise to power—as seen through the ever-watchful eyes of an all-but-invisible servant close to the throne.Her name is Barbara—in Russian, Varvara. Nimble-witted and attentive, she’s allowed into the employ of the Empress Elizabeth, amid the glitter and cruelty of the world’s most eminent court. Under the tutelage of Count Bestuzhev, Chancellor and spymaster, Varvara will be educated in skills from lock picking to lovemaking, learning above all else to listen—and to wait for opportunity. That opportunity arrives in a slender young princess from Zerbst named Sophie, a playful teenager destined to become the indomitable Catherine the Great. Sophie’s destiny at court is to marry the Empress’s nephew, but she has other, loftier, more dangerous ambitions, and she proves to be more guileful than she first appears.What Sophie needs is an insider at court, a loyal pair of eyes and ears who knows the traps, the conspiracies, and the treacheries that surround her. Varvara will become Sophie’s confidante—and together the two young women will rise to the pinnacle of absolute power. With dazzling details and intense drama, Eva Stachniak depicts Varvara’s secret alliance with Catherine as the princess grows into a legend—through an enforced marriage, illicit seductions, and, at last, the shocking coup to assume the throne of all of Russia. Impeccably researched and magnificently written, The Winter Palace is an irresistible peek through the keyhole of one of history’s grandest tales.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "18th Century",
    "Russia",
    "Romance"
  ],
  "author": "Eva Stachniak",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/11149173-the-winter-palace"
}