{
  "title": "Hunting Justice",
  "description": "A dark secret puts them in the crosshairs of a relentless killer…Ex-detective and current Elite Guardian Noelle Burton survived a horrifying attack by a serial killer as a child. Now, determined to put the scars of her past behind her, she’s intent on helping the Elite Guardians set up shop in her hometown of Savannah, Georgia. More, she’s wondering if her friendship with Dr. Jonah Harris, an ex-ER doctor turned medical examiner, might be more. But he has his own demons to fight—namely guilt over the death of his wife.So, maybe not.Meanwhile, Jonah can't ignore the growing desire he feels for Noelle. If only he knew he wasn’t going to destroy their friendship…And then, tragedy strikes—the sudden death of a colleague rocks his world, and Jonah knows that there's more to the incident than meets the eye. In fact, he may have been the intended target. Now he needs Noelle…not just as a friend, but as a protector.Noelle will have to protect Jonah, while not letting their friendship spark into something more, and Jonah will have to unravel the threat that stalks him. Clues lead them down a dark path, revealing unsettling connections to a series of unsolved crimes. And when they stumble upon the chilling possibility of a serial killer lurking in the shadows, all Noelle’s nightmares come back to life.Then the unthinkable occurs—the killer strikes again, targeting someone close to them. Noelle and Jonah race against time to expose the truth and capture the killer…and when their friendship becomes something deeper, it’s clear they have everything to lose.Don’t miss this gripping story of resilience, trust, and the power of love in the exhilarating second book of the Elite Guardians: Savannah.Elite Guardians: SavannahBook 1: Vanishing LegacyBook 2: Hunting JusticeBook 3: Guarding TruthElite Guardians CollectionBook 1: Driving Force Book 2: Impending StrikeBook 3: Defending HonorBook 4: Christmas in the Crosshairs",
  "genres": [
    "Christian Fiction",
    "Suspense",
    "Romance",
    "Christian",
    "Contemporary",
    "Romantic Suspense",
    "Mystery"
  ],
  "author": "Lynette Eason",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/204925166-hunting-justice"
}