{
  "title": "The Light Between Us",
  "description": "The Light Between Us is a Southeast Asian historical romance that defies time and space as an archivist explores Singapore’s tumultuous past through a supernatural connection.At work one night, photography archivist Charlie Sze-Toh receives a misdirected letter from Wang Tian Wei, a 1920s colonial era Chinese photographer. Through a mysterious digital folder and photographic plates, a conversation is sparked, leading to a romance that spans lifetimes.In his time, Tian Wei scours a turbulent Singapore for his missing friend, Aiko, leading him to the perfumed chambers of a Japanese brothel. Meanwhile, in the modern day, Charlie struggles against a family dynamic dominated by her stepmother, a manipulative matriarch who uses family secrets as bargaining chips. Communication starts to become difficult and Tian Wei’s letters are tinged by the increasing threat of Japanese Occupation. Will one last fate-defying letter from Charlie allow Tian Wei to keep their love alive?Inspired by her research into Singaporean historical archives, Elaine Chiew weaves Chinese mythology and early 20th century colonial Singapore into this speculative epic.Author of Peach Blossom Spring, Melissa Fu, says:Steeped in a rich tapestry of language, food, fashion, politics and art, we follow Charlie See-Toh, a 21st century photographic archivist, and Wang Tian Wei, a photographer in 1920s-1940s Singapore. Though separated by nearly a century, they establish a mysterious, soulful connection while burning time's candle at both ends. Elaine Chiew renders a novel that is at once a love story, a meditation on photography, and a gripping tale.\"Author of bestseller How High We Go In the Dark, Sequoia Nagamatsu, says:\"Interrogating the honesty and possibility of photographs, Chiew masterfully entangles a love transcending time and space with speculative finesse. Like the letters within the novel, these pages manifest the past and present—not just mere words, not mere image but a sensory cornucopia that one can step inside to interrogate heart and truth, colonial past as well as the ghosts of colonialism that remain in the same streets and buildings, which now carry different names. A genre-defying, labyrinthine, and luscious novel that doesn’t pull its philosophical punches as it dares to thrill.\"Award-winning playwright, novelist, and shortlisted short story author, Hannah Vincent, says:\"The Light Between Us (TLBU) is an intricate, richly layered and meticulously researched historical detective story set in pre WWII Singapore. It’s a stunningly ambitious novel, blending fictional characters and events with historical figures and factual landmarks. Simultaneously lush and ghostly, Chiew’s writing is visually attentive and alert to power structures governing not only the colonial era but our modern age. The cultural and sexual oppression of women is one of the novel’s concerns and enquiries.[Chiew] pays careful attention to authenticity and historical accuracy and I was grateful for the comprehensive glossary and cast list at the end of the book. Her skill and enthusiasm as both a food writer and a visual researcher/cultural critic are evident – in The Light Between Us an entertainingly entangled plot and sympathetic characters allow readers lively and populated access to her insights.\"Acclaimed Singaporean author of several books, including A Good Day to Die, Mahita Vas, says:\"This is an engrossing tale of bittersweet love and longing simultaneously straddling two eras in Singapore: a young archivist and her adoptive brother in the present-day city and a photographer in colonial times. The separate worlds of Cantonese photographers and Japanese soldiers orbit over the internet when the photographer mysteriously appears on the archivist's computer screen, luring her into a celestial realm in her basement office. Told through archived photographs, Chiew immerses the reader in old Singapore and the harrowing [beginning] of the Japanese Occupation while moving seamlessly into the lives of a wealthy family led by a devious matriarch. Meticulously researched and richly crafted, The Light Between Us dances elegantly between truths and lies, promises and threats, and between a sweet dream and harsh reality.\"",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Historical"
  ],
  "author": "Elaine Chiew",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/204929184-the-light-between-us"
}