{
  "title": "The Greek Maiden and the English Lord",
  "description": "Sixteen year old Lily, a gypsy in 1831 France, finds out the truth about her hidden past through her gypsy grandmother, Mirela. She had been kidnapped during the Greek revolution by the gypsies when she was young. Her true parents are a Greek heiress and a wealthy English nobleman.  Without a clue of what she will find, Lily embarks on her search for her true parents. In England, a cousin informs her that her mother died during the war and her father is away to the Indies. Lily is sent to a boarding school in York to become a \"lady.\" There, Lily meets handsome Edward Grant, and falls in love with him, but he is engaged to another.  To make matters worse, Lily's father is reported dead from a shipwreck, which sets Lily's whole world reeling. Penniless, Lily's gypsy past comes back to haunt her when the mistresses of the boarding school find out. She is forced to work at the boarding school as a maid to pay her tuition. Her determination to do what is right and honest earns her respect in Edward's eyes. Enough to ask her to be his aunt's companion.  Will their close proximity spark a love in Edward's heart, a love strong enough to break the ties of his engagement with the other woman and claim Lily as his own?     Excerpt  Lily trembled with rage at her cousin's betrayal. \"I am the rightful daughter of Sir Frederick Montgomery!\"  \"So you say! We maintain the highest caliber in this school and your hidden past, the life of a gypsy, would have sooner or later inflicted a bad influence on the other students.\" Mistress Bates shuddered. \"To think that we were harboring a gypsy under our roof!\"  \"It was no fault of mine that I was raised up as a gypsy,\" Lily began, but was interrupted by an imperious stare from Mistress Bates.  \"I do not care whether or not it was your fault!\" Mistress Bates tapped her foot nervously on the wood floor. \"You will not be permitted to further your education here, and you must pay the thirty-six guineas that you owe us!\"  Lily's fingers shook as she pulled out her purse and gave her all the money she had in her possession. \"Here are five guineas towards the cost. That is all I have. The rest of the money-\"  \"Huh! That is not enough!\" Mistress Bates paced the room, causing the keys hanging from her waist to rattle with each step she took. \"You must pay the rest of the money.\"  \"I can be an assistant to Miss Farfield,\" Lily cried. \"I have done well in my studies. I have!\"  Mistress Bates stopped and gave her a horrified look. \"Given your gypsy past, you are quite unqualified.\" She resumed her pacing. \"We have recently lost a maid who left to get married. You will take her place. It will take you two year's worth of work to pay back your debt.\"  Lily's pride was shattered. She so much wanted to become a lady, one that her father could have been proud of, but it was not meant to be. In such a short time, she had lost everything, her father, her chance to become a lady, and her pride. She could see no other way to procure the funds than by working. With a determined look, Lily pulled herself upright and stra",
  "genres": [
    "Historical Romance",
    "Historical Fiction",
    "Romance",
    "Historical",
    "Regency Romance"
  ],
  "author": "Patty Apostolides",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/20491086-the-greek-maiden-and-the-english-lord"
}