{
  "title": "Stand to Attention",
  "description": "Stand to Attention Anthology by Sean Michael, Jambrea Jo Jones, Lily Harlem, Elizabeth Coldwell, Noelle Keaton, Lucy Felthouse     ‘Almost' by Sean Michael   Lane lost his legs while saving his unit overseas. It’s been two years and he’s doing his best to come to terms with things, including the fact that he dumped his lover to free the man up from being stuck with a gimp for the rest of his life. Luckily, Lane inherited his Gramps’ cottage — it just needs some renovations to make it wheelchair friendly. He’s determined to make the best of what he’s got.  Hammer was one of the men Lane saved… and his lover while they were in the army together. He let Lane drive him away back when the man first got hurt, but now he’s hunting Lane, determined to make Lane the one who almost got away. Will Lane be able to see past his legs far enough to realise Hammer’s in it for the long haul?   ‘On the Home Front' by Jambrea Jo Jones   Peter \"Bulldog\" Jakes killed his mother. People tell him it isn't his fault, but he is just as guilty as if he pulled the trigger. Bulldog knew being in the Army Special Forces would eventually hurt his family.  Moby Edwards' heart aches for his First Sergeant and he wants to help, but Bulldog blows him off — every time.  When Bulldog is forced to take leave, Moby follows, but will things out of their control ruin what could be the healing power of friends turned into lovers?   ‘Who Dares Wins' by Lily Harlem   Waiting for my SAS husband Jack to come home safe and sound is always a gut-wrenching, heart-twisting time. I have no idea where he is, what jungle swamp he may be lying out in or desert he might be marching across.  So naturally when he returns to me, our emotions can't fail to run hot and our lust for each other cranks up to sky-high levels. But the one thing about Jack is he lives for the extreme and seizes the moment. I really should have known what would come of me telling him my wildest fantasies.   ‘An Act of Duty' by Elizabeth Coldwell   For Corporal Mark Stockdale, a trip to Amsterdam won’t just provide some much-needed R and R away from the horrors of the Afghanistan battlefield — it’s also a way of keeping a promise to a fallen comrade. But violence has a way of seeking Mark out, even in the most peaceful of locations, and when he stops for a drink in a quiet bar, he finds himself stepping in to help its owner, Robin Sneijder, fight off a group of opportunist thieves. Robin shows his gratitude, and Mark is stunned by the depth of the passion between them, and when Mark wakes in the night from a vivid nightmare of the attack that killed his best friend, Ozzy, Robin is there to comfort him.   ‘Trusting the Army Captain' by Noelle Keaton   Ambitious army captain, Patrick Bosworth, is eager to advance in his career so that he can live up to his family’s distinguished legacy. But having been passed over for promotion to major twice already, Patrick fears his career has stalled.  When a superior office suggests a way to get the promotion that involves gathering information on a fellow army captain in the Medical Corps, Patrick reluctantly agrees to participate. He regrets the assignment almost immediately, especially when he falls for Craig, the guy he’s supposed to be investigating.",
  "genres": [
    "Anthologies",
    "Military Fiction",
    "M M Romance",
    "Romance"
  ],
  "author": "Sean Michael",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/20491009-stand-to-attention"
}