{
  "title": "Legends of Dune Trilogy [Box Set] -",
  "description": "This Mass Market Boxed Set contains the three volumes of the Legends of Dune: Dune: The Butlerian Jihad, 0-765-34077-1Dune: The Machine Crusade, 0-765-34078-XDune: The Battle of Corrin, 0-765-34079-8 Dune: The Butlerian JihadFrank Herbert's Dune series is one of the great creations of imaginative literature, science fiction's answer to The Lord of the Rings.Decades after Herbert's original novels, the Dune saga was continued by Frank Herbert's son, Brian Herbert, in collaboration with Kevin J. Anderson. Working from Frank Herbert's own notes, the acclaimed authors reveal the chapter of the Dune saga most eagerly anticipated by readers: the Butlerian Jihad.Throughout the Dune novels, Frank Herbert frequently referred to the war in which humans wrested their freedom from \"thinking machines.\" In Dune: The Butlerian Jihad, Brian Herbert and Kevin J. Anderson bring to life the story of that war, a tale previously seen only in tantalizing hints and clues. Finally, we see how Serena Butler's passionate grief ignites the struggle that will liberate humans from their machine masters; here is the amazing tale of the Zensunni Wanderers, who escape bondage to flee to the desert world where they will declare themselves the Free Men of Dune. And here is the backward, nearly forgotten planet of Arrakis, where traders have discovered the remarkable properties of the spice melange. . . . Dune: The Machine Crusade More than two decades have passed since the events chronicled in Dune: The Butlerian Jihad. The crusade against thinking robots has ground on for years, but the forces led by Serena Butler and Irbis Ginjo have made only slight gains; the human worlds grow weary of war, of the bloody, inconclusive swing from victory to defeat.The fearsome cymeks, led by Agamemnon, hatch new plots to regain their lost power from Omnius--as their numbers dwindle and time begins to run out. The fighters of Ginaz, led by Jool Noret, forge themselves into an elite warrior class, a weapon against the machine-dominated worlds. Aurelius Venport and Norma Cenva are on the verge of the most important discovery in human history-a way to \"fold\" space and travel instantaneously to any place in the galaxy.And on the faraway, nearly worthless planet of Arrakis, Selim Wormrider and his band of outlaws take the first steps to making themselves the feared fighters who will change the course of history: the Fremen.Here is the unrivaled imaginative power that has put Brian Herbert and Kevin Anderson on bestseller lists everywhere and earned them the high regard of readers around the globe. The fantastic saga of Dune continues in Dune: The Machine Crusade. Dune: The Battle of Corrin It has been fifty-six hard years since the events of Dune: The Machine Crusade. Following the death of Serena Butler, the bloodiest decades of the Jihad take place. Synchronized Worlds and Unallied Planets are liberated one by one, and at long last, after years of victory, the human worlds begin to hope that the end of the centuries-long conflict with the thinking machines is finally in sight.Unfortunately, Omnius has one last, deadly card to play. In a last-ditch effort to destroy humankind, virulent plagues are let loose throughout the galaxy, decimating the populations of whole planets . . . and once again, the tide of the titanic struggle shifts against the warriors of the human race. At last, the war that has lasted many lifetimes will be decided in the apocalyptic Battle of Corrin.In the greatest battle in science fiction history, human and machine face off one last time. . . . And on the desert planet of Arrakis, the legendary Fremen of Dune become the feared fighting force to be discovered by Paul Muad'Dib in Frank Herbert's classic, Dune.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Contemporary"
  ],
  "author": "Brian Herbert",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/20494726-legends-of-dune-trilogy-box-set--"
}