{
  "title": "Ordinary Affects",
  "description": "Ordinary Affects is a singular argument for attention to the affective dimensions of everyday life and the potential that animates the ordinary. Known for her focus on the poetics and politics of language and landscape, the anthropologist Kathleen Stewart ponders how ordinary impacts create the subject as a capacity to affect and be affected. In a series of brief vignettes combining storytelling, close ethnographic detail, and critical analysis, Stewart relates the intensities and banalities of common experiences and strange encounters, half-spied scenes and the lingering resonance of passing events. While most of the instances rendered are from Stewart’s own life, she writes in the third person in order to reflect on how intimate experiences of emotion, the body, other people, and time inextricably link us to the outside world. Stewart refrains from positing an overarching system—whether it’s called globalization or neoliberalism or capitalism—to describe the ways that economic, political, and social forces shape individual lives. Instead, she begins with the disparate, fragmented, and seemingly inconsequential experiences of everyday life to bring attention to the ordinary as an integral site of cultural politics. Ordinary affect, she insists, is registered in its particularities, yet it connects people and creates common experiences that shape public feeling. Through this anecdotal history—one that poetically ponders the extremes of the ordinary and portrays the dense network of social and personal connections that constitute a life—Stewart asserts the necessity of attending to the fleeting and changeable aspects of existence in order to recognize the complex personal and social dynamics of the political world.",
  "genres": [
    "Anthropology",
    "Theory",
    "Nonfiction",
    "Academic",
    "Cultural Studies",
    "Philosophy",
    "Grad School"
  ],
  "author": "Kathleen  Stewart",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/2049141.Ordinary_Affects"
}