{
  "title": "Haunting Adile",
  "description": "\"Haunting Adile is another example of Ms Lamb’s treatment of fairytale material—the side of the story that’s usually left untold. Here, she writes in a straightforward manner, appropriate for bringing the magical down to earth with a bump. \"\"This book will twist your emotions.\"\"Scary tale of not being accepted by society\"'Adile was forced into marriage with Selim, an older wealthy man with twin teenage sons named Timur and Ahmet. She despised them, cursing them at every opportunity. Those curses failed to bring her the freedom she craved. Unexpectedly, Selim passed away, and Adile became the guardian of the boys and their inheritance, which she couldn't access.When Timur fell in love with a boy named Adem from their village, things got worse.Ahmet was afraid that Adile and her brothers would react negatively to the same-sex relationship because it was considered a sin and brought dishonor to the family.Timur and Adem decide to run away together to escape judgment, but chaos ensues, and the consequences affect everyone involved.The walls of the house and barn became silent witnesses to events that occurred within, absorbing all the energy and becoming a place of curses from the past.Restless spirits began to roam around, whispering in the dark corners, turning the entire area into a haunted place, attracting something even more sinister.Did they all manage to escape the village together and start a new life?' ***TRIGGER WARNING- Reader discretion is advised.This story contains content that could potentially trigger emotional distress, especially for individuals who suffer from Post Traumatic Stress Disorder or other mental health disorders.Please be aware that this story encompasses the struggles of those who fall in love with someone of the same sex, like homophobia. Some of these pages contain graphic violence, including elements of suicide and murder.",
  "genres": [],
  "author": "Lily Lamb",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/204941776-haunting-adile"
}