{
  "title": "The Peculiar Case of Lord Finsbury's Diamonds",
  "description": "#1 New York Times bestselling author Stephanie Laurens brings you a tale of murder, mystery, passion, and intrigue – and diamonds! Penelope Adair, wife and partner of amateur sleuth Barnaby Adair, is so hugely pregnant she cannot even waddle. When Barnaby is summoned to assist Inspector Stokes of Scotland Yard in investigating the violent murder of a gentleman at a house party, Penelope, frustrated that she cannot participate, insists that she and Griselda, Stokes’s wife, be kept informed of their husbands’ discoveries. Yet what Barnaby and Stokes uncover only leads to more questions. The murdered gentleman had been thrown out of the house party days before, so why had he returned? And how and why did he come to have the fabulous Finsbury diamond necklace in his pocket, much to Lord Finsbury’s consternation? Most peculiar of all, why had the murderer left the necklace, worth a stupendous fortune, on the body? The conundrums compound as our intrepid investigators attempt to make sense of this baffling case. Meanwhile, the threat of scandal grows ever more tangible for all those attending the house party – and the stakes are highest for Lord Finsbury’s daughter and the gentleman who has spent the last decade resurrecting his family fortune so he can aspire to her hand. Working parallel to Barnaby and Stokes, the would-be lovers hunt for a path through the maze of contradictory facts to expose the murderer, disperse the pall of scandal, and claim the love and the shared life they crave. A pre-Victorian mystery with strong elements of romance. A short novel of 39,000 words. An entry in The Casebook of Barnaby Adair series, the events in this short novel occur between the events described in the full-length Casebook novels, WHERE THE HEART LEADS and the upcoming THE MASTERFUL MR. MONTAGUE. Praise for the works of Stephanie “Stephanie Laurens’ heroines are marvelous tributes to Georgette feisty and strong.” Cathy Kelly “Stephanie Laurens never fails to entertain and charm her readers with vibrant plots, snappy dialogue, and unforgettable characters.” Historical Romance Reviews. “Stephanie Laurens plays into readers’ fantasies like a master and claims their hearts time and again.” Romantic Times Magazine Praise for Where the Heart Volume 1 in the Casebook of Barnaby Adair \"A satisfying blend of mystery and romance.\" Publishers Weekly \"In an Amanda Quick-style suspense/romance, Laurens never loses touch with her characters' deep emotions or the haunting mystery.\" Romantic Times \"An interesting and absorbing plot...an exciting and appealing romantic mystery.\" FreshFiction.com",
  "genres": [
    "Historical Romance",
    "Romance",
    "Mystery",
    "Historical",
    "Historical Fiction",
    "Historical Mystery",
    "Novella"
  ],
  "author": "Stephanie Laurens",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/20499721-the-peculiar-case-of-lord-finsbury-s-diamonds"
}