{
  "title": "Oriental Odyssey I: The Shadow of the Padishah / Through the Desert",
  "description": "The first and only unabridged translation of Karl May's \"Giölgeda padishanün\" - \"In the Shadow of the Padishah\". As this book, translated by Michael Michalak, is the first of a larger series that is estimated to span some seven volumes, it has been appropriately renamed \"Oriental Odyssey I\". This original travel narrative, along with the many parts that follow, is referred to the \"Orient Zyklus\" in German. It was first published in the \"Deutscher Hausschatz\" magazine as a serial between 1881 and 1888. Karl May is known in Germany as the most prolific and most published author whose many books have been and still continue to be on the best seller list in that country. During the 120 years after the travel tales first appeared, many authors have tried to copy Karl May's style as well as make the story line contained in his writings their own. His manuscripts have been translated into many popular world languages, yet they have rarely been translated into English. Most of the English language versions in existence today are abridged, adapted or otherwise purloined. For that reason, English language readers have been denied access to these literary masterpieces and the greater spiritual message woven into Karl May's writings. Yet his thoughts and ideas deal with issues that are as relevant today as they were more than a century ago. Now, for the first time since Karl May originally penned these manuscripts, his writings can speak clearly to English language readers of today. Thanks to Mr. Michalak's diligent research and the editing efforts of his wife Elaine, the first and second volumes of Karl May's \"Giölgeda padishanün\" can now be enjoyed in all their intended glory. The often frustrating and demanding task of rendering the uniquely German perspectives and concepts of an earlier era into modern English that can be equally well understood by children as well as adults has consumed the precious hours available to Mr. Michalak and his wife Elaine. But it is thanks to Elaine that the first volume made it into print and it is her legacy that the remaining volumes will be produced over the coming years. It is Mr. Michalak's intention to publish the second part of their joint work by the end of June 2002, along with the first ever German-English comparative version suitable for German, as well as English language students.",
  "genres": [
    "Fiction",
    "Adventure",
    "German Literature",
    "Classics",
    "Westerns",
    "Novels",
    "Historical"
  ],
  "author": "Michael M. Michalak",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1115044.Oriental_Odyssey_I"
}