{
  "title": "The Temple of Avinasi: The Legend of the Kalki",
  "description": "From the ashes of Epic Wars shall the great Lord of Dark rise,So terrible his wrath, every protestor shall demise…Ripped apart would be the Shield and the protecting forces,A whole world shall fall, mortal or otherwise…A heroic tale timed in modern age -- a battle of existence between evil and the good, bred on the ashes of the four thousand year old legendary Epic Wars. The ‘Immortal Protectors’ of the Temple are finding it hard to maintain control over a new rising evil power, far greater in magnitude than the previous war.The Shield that protects Earth from external attacks had stopped the invading Dark Seekers, also called Nishachars -- a fled group from some distant dying planet -- for long. Until four thousand years ago … when the shield was ruptured, and the entire mortal world turned on the edge of demolition. It was then the immortal protectors, the Light Seekers, more commonly known as Devs, along with the remaining army of mortals fought and drove back the combined army of Nishachars and Asurs, and restored the shield -- but at a great price. The Nishachars retreated, and since then they have grown and redoubled their army several times, waiting for their prophesied Dark Lord to rise. The Devs, on the other hand, knowing that they won’t be able to stop the Great Dark Lord, if risen -- formed a secret brotherhood named ‘The Temple of Avinasi’ and scattered themselves throughout the world. Their only feeble hope lies in an ancient legend named ‘Kalki’, the last prophesied Avatar of Vishnu… And unaware of all this, two fourteen year old boys are presently spending their time merrily together in the mortal world, innocently oblivious to the fact, that how much changed their destinies are from what it seems, and how much the world’s fate is dependent on them…",
  "genres": [
    "Fantasy"
  ],
  "author": "Ayush Pathak",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/20497863-the-temple-of-avinasi"
}