{
  "title": "Studs Up",
  "description": "Holden MonroeI want it all. My career, trophies, and love. But I can't. I had to choose, and I chose my career. I was happy with that.Being gay in professional soccer isn’t accepted. I keep my sexuality a closely guarded secret, but someone knows, and they use it to control me. They have rules. No relationships.Years ago, I was forced to give up a man that I loved to keep my secret and my career, and I thought that was the worst pain I had ever suffered.I was wrong, so very wrong.But one man threatens everything. Nolan Reed is the bane of my existence and the man I’m obsessed with. We are rivals. The rivalry between our teams is the longest and most bitter rivalries in the league. Not only were our team's rivals, but he had I had been battling for dominance for years.He is intolerable, and he is beautiful. No one makes me angrier, and I still can’t stop wanting him.He’s the best defender in the league and knows how to shut me down and keep me from scoring. It’s infuriating. I want to hate him, but he has these blue eyes that ruin everything.My world is turned upside down when we’re forced to room together during the national team winter camp, and I do something really stupid. I kissed him. The strangest thing happens, because he kisses me back and suddenly I find myself falling in love with him, knowing all the while I will have to let him go.Nolan’s willing to fight for me, but I can’t let him go down with me. I thought I knew pain, but I was wrong, so very wrong.Nolan ReedThere are many words people use to describe me, most of them are four letters and very colorful. The nicest thing anyone could say is I’m a grump.I am so focused on my career that I don’t pay attention to anything else. I’ve had a few girlfriends, but the game is what I love, and nothing else matters to me.Except this one thing. Holden Monroe.He’s a Rover, and I’m a Guardian. All I want to do is beat him and win trophiesWe met in our teens, and I saw instantly he was going to be a legend but as I tracked his career, that didn’t seem to pan out. He couldn’t quite become the player he was meant to be, and it drove me crazy.At the national team camp, I push him because he pisses me off, and I know he can be better. Because we can’t seem to get along, Coach decided that we should room together until we can play nice.I hated it. I hated being in such a small space with such an insufferable man. But slowly, I start to put the pieces together. Monroe has nightmares and panic attacks.The harder I push, the angrier he gets until, out of nowhere, he kisses me. My body came alive as though waking from a deep slumber.I had never kissed a man before. I liked it a lot. But I was confused. Why now? Why him? After conducting an experiment, I am certain I want it to happen again.When I got the chance, I found myself falling in love with him, but I didn't have all of him. He holds his secrets close. Something terrifies him on a level so deep and dark he won't let me in. All I want to do is protect him and see him become the legend I know he is.But not even the Great Nolan Reed, is strong enough to protect the man I love.Studs Up is a gay soccer romance between a grumpy central defender and a partially sunshine striker with a happily ever after and a first-person dual point of view. Contains mature themes and is not intended for underage audiences.",
  "genres": [
    "M M Romance",
    "Sports"
  ],
  "author": "Evie  Knight",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/205039892-studs-up"
}