{
  "title": "Three Cups of Deceit: How Greg Mortenson, Humanitarian Hero, Lost His Way",
  "description": "This vastly expanded edition, as of October 2014, includes an afterword, a detailed look at further financial improprieties committed by Mortenson, an analysis of his recent claims of innocence, and fresh evidence from new sources from Pakistan, Afghanistan, and the US.Greg Mortenson has built a global reputation as a selfless humanitarian and children’s crusader, and he’s been nominated for the Nobel Peace Prize. He is also not what he appears to be. As acclaimed author Jon Krakauer discovered, Mortenson has not only fabricated substantial parts of his bestselling books Three Cups of Tea and Stones into Schools, but has also misused millions of dollars donated by unsuspecting admirers like Krakauer himself.This is the tragic tale of good intentions gone very wrong.One hundred percent of Jon Krakauer's proceeds from the sale of Three Cups of Deceit will be donated to the \"Stop Girl Trafficking\" project at the American Himalayan Foundation (www.himalayanfoundation.org/live/proj... THE AUTHORJon Krakauer is the author of \"Eiger Dreams\", \"Into the Wild\", \"Into Thin Air\", \"Under the Banner of Heaven\", and \"Where Men Win Glory\" and is the editor of the Modern Library Exploration series.PRAISE FOR \"THREE CUPS OF DECEIT\"\"The truth matters. Jon Krakauer's takedown of Greg Mortenson's book \"Three Cups of Tea\" and the charitable foundation he built from it is devastating. It is not just the fascinating story of a huckster who took publishers, philanthropists, journalists, academics, and a gullible public for a ride, but a detailed trip into the slippery netherworld where what matters most is what sells, not what really happened.\" —Mark Bowden, author of \"Black Hawk Down\"\"Packed with interviews and anecdotes that undercut Mortenson's image as a cheerful do-gooder, Krakauer's account of good intentions gone horribly wrong is a stunning example of investigative journalism.\" —Publishers Weekly“Krakauer forcefully claims that Mortenson improperly used his charity’s funds and failed to build all the schools he says he did.” —Elizabeth Taylor, Literary Editor, Chicago Tribune",
  "genres": [
    "Nonfiction",
    "Biography",
    "Audiobook",
    "History",
    "Journalism",
    "True Crime",
    "Politics"
  ],
  "author": "Jon Krakauer",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/11151351-three-cups-of-deceit"
}