{
  "title": "Promises of Forever",
  "description": "Life can change on a dime.Childhood tragedy left Koa Burgard with many scars. Reclusive and still healing, he is sent to summer camp, where the other kids tease and bully him. All except outgoing and popular Jersey Reid. A boy who dreams about being a hockey star. A tentative friendship forms. Every summer, they reconnect for adventure. Every winter, they write letters back and forth.Promises are made, and promises are shattered.Thirty years later, the sudden death of his parents brings Jersey home. Rotten things keep happening. His life has been full of torment and pain, and he can’t remember a time when he was happy.Will it ever stop?Cleaning out his deceased parents’ house, he uncovers Koa’s pen pal letters. Can Jersey recapture the happiness and innocence of youth by reconnecting with the strange, quirky boy he befriended at camp so long ago? Or will his prior mistakes be a barrier?Although Koa is now a respectable English teacher at an elite boarding school, Jersey quickly learns that the boy from camp has darker secrets than he ever imagined.Koa has given up on happiness. His views on life are bleak and disturbing, and he’s learned it’s better to be alone in an unforgiving world.Jersey’s return offsets Koa’s balance and brings the past back into focus. A past he’s spent a lifetime trying to forget.But Jersey was Koa’s savior once. He was kind when no one else was. Jersey made him feel safe in an unsafe world.Until Jersey broke a promise.And promises are supposed to be for forever.** Promises of Forever is an angsty MM romance with the following themes. Second chance love, jock and nerd dynamic, opposites attract, mental health. Please check the trigger warnings on my website **",
  "genres": [
    "M M Romance",
    "Second Chance",
    "Romance",
    "Friends To Lovers",
    "Mental Health",
    "LGBT",
    "Audiobook"
  ],
  "author": "Nicky James",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/205028590-promises-of-forever"
}