{
  "title": "Tell Me Everything",
  "description": "From Pulitzer Prize-winning author Elizabeth Strout comes a “stunner” (People) of a novel about new friendships, old loves, and the very human desire to leave a mark on the world.With her remarkable insight into the human condition and silences that contain multitudes, Elizabeth Strout returns to the town of Crosby, Maine, and to her beloved cast of characters—Lucy Barton, Olive Kitteridge, Bob Burgess, and more—as they deal with a shocking crime in their midst, fall in love and yet choose to be apart, and grapple with the question, as Lucy Barton puts it, “What does anyone’s life mean?”It’s autumn in Maine, and the town lawyer Bob Burgess has become enmeshed in an unfolding murder investigation, defending a lonely, isolated man accused of killing his mother. He has also fallen into a deep and abiding friendship with the acclaimed writer Lucy Barton, who lives down the road in a house by the sea with her ex-husband, William. Together, Lucy and Bob go on walks and talk about their lives, their fears and regrets, and what might have been. Lucy, meanwhile, is finally introduced to the iconic Olive Kitteridge, now living in a retirement community on the edge of town. They spend afternoons together in Olive’s apartment, telling each other stories. Stories about people they have known—“unrecorded lives,” Olive calls them—reanimating them, and, in the process, imbuing their lives with meaning.Brimming with empathy and pathos, Tell Me Everything is Elizabeth Strout operating at the height of her powers, illuminating the ways in which our relationships keep us afloat. As Lucy says, “Love comes in so many different forms, but it is always love.”",
  "genres": [
    "Fiction",
    "Book Club",
    "Literary Fiction",
    "Audiobook",
    "Contemporary",
    "Mystery",
    "Adult Fiction"
  ],
  "author": "Elizabeth Strout",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/205066300-tell-me-everything"
}