{
  "title": "The BP Corollary",
  "description": "THE STORY ONLY A BP INSIDER COULD TELLIn the deep water forty miles off the Louisiana coast, an evil corporation in search of excessive profits pushes the limits of technology to explore for oil. To save time and reduce costs, BP recklessly disregards precautions its competitors routinely employ. The resulting explosion kills eleven men, sinks the drilling platform, and causes an environmental disaster unparalleled in human experience.Max Thomas is a former BP Financial Analyst who wrote a tell-all book exposing corruption at BP and predicting catastrophic events like the Deepwater Horizon explosion. He works as Controller for a resort on Florida’s Gulf Coast.Liam Camron is a former BP Vice President who supplied inside information for Max’s anti-BP book. The company discovered his betrayal and banished him to Captiva Island, Florida where a separation agreement bars him from contact with Max or work in the oil industry. He has spent years as a recluse in his mansion researching the history and organization of the world.Sorina is Max’s Romanian girlfriend. She was a banquet manager working at the resort until her temporary visa expired and she took a job at a resort on Jersey Island in the English Channel.Mandy is the Director of Food and Beverage working under Max. Secretly in love, she waits for their circumstances to align and Max to appreciate his feelings for her.Lord Ashburton was BP Chairman during Max and Liam’s tenure. One of the most powerful men in the world, he retains control of BP and keeps a watchful eye on both Max and Liam. He controls the resort where Sorina works and used her as leverage against Max. The all-seeing eye becomes an important character representing the organization of the world and those who truly control our lives.The Deepwater Horizon disaster starts our story. Max sees an opportunity to grant interviews to promote his book and option his movie rights. Liam sees his chance to take revenge on BP and Lord Ashburton. When Ashburton suspects a new collaboration, he has Max arrested and fired, Mandy fired, and Sorina disciplined. Liam extends his research into events surrounding the disaster and convinces Max that Lord Ashburton is behind his recent problems. He hires Max to write a new book detailing BP blame and advocating extending the Monroe Doctrine to criminal corporations and using it to force BP to divest its US assets and leave the hemisphere.They travel to England on a fact-finding mission and to extract Sorina. They bring her into the US through Mexico and continue with visits to New Orleans and Grand Isle, Louisiana where they gather first-hand accounts. Max is beat up and his house is burnt down. Liam’s mansion becomes a fortress as they pursue both the book and the political implications of the corollary. Max becomes suspicious of Liam’s true motives when he admits to keeping a secret.As the book nears completion and those in control come to appreciate the effect The BP Corollary can have on the organization of the world, the order goes out to terminate Max, Liam, and two scientists who have been supplying information. The FBI brings news of the deaths of the scientists just days before the mansion comes under attack.The life-and-death struggle involves the foursome in a 200-year-old fight between Lord Ashburton’s family and the Rothschild family. Using the resources of the Rothschilds, they defeat Lord Ashburton and force the breakup of BP and the liquidation of its assets.During the course of the battle, Max falls deeply in love with Mandy and they are married aboard a Rothschild yacht in Monte Carlo. Still celebrating their marriage and the victory over Lord Ashburton and BP, Max and Mandy discover the secret Liam has been hiding. The chilling ending reveals that their triumph over BP and Lord Ashburton represents a crushing defeat for the larger world and a monumental victory for the forces of evil on our planet.",
  "genres": [],
  "author": "Rick Lacey",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/20504393-the-bp-corollary"
}