{
  "title": "Rock Hard And Wet (BBW Shapeshifter Paranormal Romance)",
  "description": "Poseidon, Greek god of the sea, proclaims that any nymph from his harem who wishes to search out a mate may do so. However, she only has three days to find someone he deems worthy. Welcome to the erotic, paranormal fantasy world of the Nymphs of New York. She’s a nymph on a mission.\n  Callianira, a curvy, vivacious BBW, is the life of the party at every orgy. But she's fallen prey to a depression no amount of hot sex can shake. Her best friend Petra has a plan: a trip to New York City to find soul mates who can handle a couple of horny nymphs for a lifetime.  Callie’s not buying the sales pitch Petra is hawking, but goes along for the ride. She figures she can find a male or two who won’t mind acting as multiple orgasm donors.  He’s a sexy, rock hard alpha male, and has just been released from a five hundred year prison sentence.  Outcast from the Aerie of New York, gargoyle shifter Theo’s focused on guarding the humans of Brooklyn and keeping his twin Logan out of trouble. When gorgeous females who smell like salt water and sex invade his territory, his careful plan for regaining entrance to the secular aerie gets ripped out to sea. They’re completely wrong for each other.  Callie’s magic is tied to the ocean. Theo can’t swim. Callie is carefree, sweet, and finds joy in bending the rules. Theo toes the line and is ever vigilant.  He’ll sink to the bottom of the ocean, and she’ll fly above it to claim their happily ever after.  EXCERPT:  This had to stop. Right now. And there was only one way he could think of to get her to shut up. It was time to accept his loses and turn the tide of the battle to minimize the damage on his side.  “Callie.” He threaded his hand into her hair just behind one ear and clenched the back of her skull with enough pressure to let her know he had control. She glanced up at him, and the acceleration of her heartbeat filled his ears, drowning out everything around him but her.  Theo lowered his head and kissed her, the first woman he’d held in his arms in five hundred years. Her taste on his tongue when she opened to him exploded and overwhelmed his control. He ground his mouth on hers, desperate to get closer, to crawl inside her and soak up her carefree joy. She tasted like sunshine and water, the dew in a meadow on a summer morning, sweet honey, and the scent of tiny wild roses.  The kiss did its job. It shut her up, got her to stop commentating on the very public sex not twenty-five feet away, but it came with a price. His d*ck sprung so hard in his pants he had to grit his teeth against the surge of pain.  He gripped her by the a** and picked her up off the ground. Her strong fingers dug into his hair, tugging on the long strands trailing onto his collar. She mewled in frustration, long legs twining around his waist. Callie undulated her hips on him, and he almost burst.",
  "genres": [
    "Paranormal",
    "Romance",
    "Erotica",
    "Paranormal Romance",
    "Urban Fantasy",
    "Fantasy"
  ],
  "author": "Jennifer  James",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/20504928-rock-hard-and-wet-bbw-shapeshifter-paranormal-romance"
}