{
  "title": "The Fool of Venus; The Story of Peire Vidal",
  "description": "George Cronyn's 1934 novel \"The Fool of Venus: The Story of Peire Vidal\" is a gripping episodic fiction set in the 12th century that focuses on troubadour Peire Vidal. From the foreward:\"Two hundred years before Froissart glorified the Age of Chivalry, and so identified it thenceforth in the popular mind with romance, the histrionic exploits of Richard the Lion had been faithfully set down by clerical correspondents in his train, who plainly admired that warrior though they did not gloss over the ambiguities of his character. A few years later, Villehardouin, greatest of all historiographers and crusader as well, recounted with matchless vigor the colorful if sordid happenings of the Fourth Crusade, further particularized by the Grand Logothete, Nicetas, who suffered in the sack of New Rome from being on the losing side.These candid and generally scrupulous chroniclers have provided the groundwork for the present narrative insofar as it treats of military matters. But though the importance of the troubadours in the conduct of the crusades was recognized at the time, they fare obscurely in the annals, wherein deeds, rather than songs, are recorded. Fortunately for our knowledge of the twelfth-century manners and customs when not at war, the world's most accomplished group of singers, the jongleurs and troubadours of Provence, were self-revealing in their songs. And of these none was more autobiographical than Peire Vidal, who has left to the speculation of posterity some forty-eight songs which compose a sort of lyrical diary, though addressed mostly to lovely ladies or generous patrons. In the very words of the distinguished troubadour are to be found the sources of the curious legends that cluster about his name; and from them his story is largely drawn.The other persons of this chronicle have been subjected to no more fictitious interpretation than may be justified on the basis of extant historical records.\" - George W. Cronyn",
  "genres": [],
  "author": "George W. Cronyn",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/20506187-the-fool-of-venus-the-story-of-peire-vidal"
}