{
  "title": "A King's Ransom",
  "description": "NEW YORK TIMES BESTSELLER Sharon Kay Penman follows up her acclaimed novel Lionheart with the vivid and heart-wrenching story of the last event-filled years in the life of Richard I of England, Coeur de Lion. November 1192. After his bloody crusade in the Kingdom of Jerusalem, Richard and his crew are overcome by a sudden storm, its fierce winds propelling the ship onto the Sicilian shore. But this misfortune is just the beginning. Forced to make a dangerous choice, Richard finds himself in enemy territory, where he is captured—in violation of the papal decree protecting all crusaders—and handed over to the Holy Roman Emperor. Imprisoned in the notorious fortress at Trifels, from which few ever leave alive, Richard, for the first time in his life, experiences pure, visceral fear—while his mother, Eleanor of Aquitaine, moves heaven and earth to secure his release. Amid betrayals, intrigues, infidelities, wars, and illness, Richard’s courage and intelligence will become legend. Look for special features inside. Join the Random House Reader’s Circle for author chats and more. Praise for A King’s Ransom “Masterful . . . [Sharon Kay] Penman has absorbed herself so fully into the heart and mind of her protagonist that an undeniably flawed but refreshingly human Richard [the Lionheart] virtually walks off the pages.” —Booklist “Historical fiction of the first order . . . Instead of history that reads like a novel [Sharon Kay] Penman achieves something a novel that reads like history.” —Willamette Week “A well-researched and impressively detailed narrative displaying a strong commitment to historical accuracy and richly drawn, sympathetic characters.” — Library Journal “Once you start reading you won’t want to stop.” —British Weekly “Massively entertaining.” —Kirkus Reviews",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Medieval",
    "British Literature",
    "12th Century",
    "Plantagenet"
  ],
  "author": "Sharon Kay Penman",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/20516724-a-king-s-ransom"
}