{
  "title": "Walking the Woods and the Water: In  Patrick Leigh Fermor's footsteps from the Hook of Holland to the Golden Horn",
  "description": "In December 1933, an eighteen-year-old Patrick Leigh Fermor set out in a pair of hobnailed boots to chance and charm his way across Europe, 'like a tramp, a pilgrim or a wandering scholar,' on foot from the Hook of Holland to Constantinople. The books he later wrote about this walk, A Time of Gifts (1977), Between the Woods and the Water (1986) and the posthumous The Broken Road (2013), are a half-remembered, half-reimagined journey through cultures now extinct, landscapes irrevocably altered by the traumas of the twentieth century. The brilliant bubble of his writing captures a prelapsarian world of moccasin-shod peasants and castle-dwelling aristocrats, preserved in perfect clarity. But war, political terror and brutal social change lay on the horizon. That bubble was about to burst, and the raw light of the modern world soon to come flooding in. On 9th December 2011, Nick Hunt caught the ferry to the Hook of Holland to follow in his footsteps. Using Fermor's books as his only travel guide he spent seven months walking his route through Holland, Germany, Austria, Slovakia, Hungary, Romania, Bulgaria and Turkey, to discover for himself what remained of hospitality, kindness to strangers, freedom, wildness, adventure, the mysterious, the unknown, the deeper currents of myth and story that still flow beneath Europe's surface. I'd been walking for two hundred and twenty days. With the twists and turns the road had taken it was impossible to say how far; two and a half thousand miles was my rough guess. I'd passed through eight countries and three seasons, followed two major rivers and dozens of minor ones, and crossed three mountain ranges, one of them twice. I'd picked up fragments of seven languages, and met more people than I could remember. I'd walked through three books: two real, one imagined. I'd worn one pair of boots.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Walking",
    "Memoir",
    "History",
    "Adventure",
    "Nature"
  ],
  "author": "Nick Hunt",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/20511506-walking-the-woods-and-the-water"
}