{
  "title": "What Is a Friend and How Can I Be a Very Good One?: A Children's Book That Teaches Friendship Skills of Respecting Friends' Choices, Offering Help, Mending Friendships, and More!",
  "description": "* This eBook is a SHORT version of the book. Some important information and exercises (e.g., practice for how to fix a friendship) are not included in this eBook due to formatting differences. Therefore, to effectively work on the target skills, please purchase the paperback or hardcover version.Is it difficult for your child or students to maintain friendships?Do they understand that friendship is not just about having fun together but involves more?Do they understand what is expected of a friend?Do they know how to mend a friendship when they may have hurt their friends' feelings?\nWhat Is a Friend and How Can I Be a Very Good One?\n is the 3rd book in the \nMaking Friends!\n series. After teaching the four basic friendship skills in Book 1 and two more skills in Book 2, this book targets four more important friendship skills to help young children have a deeper understanding of what friendship is about - including respecting friends' choices, offering help, mending friendships when they may have hurt their friends' feelings, and more. Friendship is not just about having fun together! Young readers will take the perspective of the main character and learn these skills step by step following the story. In the end, social situations are provided for practice to reinforce the skills taught. This book brings four more friendship marbles for young readers to collect for their \"friendship jar\"!The author has uniquely applied behavior science to children’s literature by using behavioral technologies and procedures such as Behavior Skills Training (BST) through instructions, modelling, rehearsal, and feedback.This book was developed together with researchers, school teachers, early childhood educators, behaviour analysts, speech-language pathologists, many parents, and children!",
  "genres": [],
  "author": "Stephanie Chan",
  "average_rating": "4.87",
  "url": "https://www.goodreads.com/book/show/205145172-what-is-a-friend-and-how-can-i-be-a-very-good-one"
}