{
  "title": "Beyond Orpheus: Studies in Musical Structure",
  "description": "Beyond Orpheus is a study of the elements of musical structure and the ways they provide unity, coherence and uniqueness in classic-romantic music. The book rests in part upon Arnold Schoenberg's concept of Grundgestalt, or Basic Shape, as the singular germinal source from which all aspects of a musical work arise. Though Schoeberg based his philosophy of composition upon this idea, he discussed it explicitly in his writings only minimally. Beyond Orpheus clarifies and illuminates the concept, drawing from the writings of Stoenberg and those of his circle. It traces the development of the concept from the music of Mozart, Haydn, Beethoven, Brahms, and others, through the ultimate extension of certain of its systematic principles in twelve-tone music and total serialism. In the light of this continuous line of thought from the Viennese classics through the present, the question is asked whether aspects of total serialism are themselves found in classical music. In other words, do works of the eighteenth and nineteenth centuries arise from basic shapes that influence their structure not only with regard to thematic unities of pitch and rhythm, but also with regard to harmonies, tonal plans, and secondary qualities of phrasing, inflection, articulations, dynamics, timbres—in short, in their total compositional and structural character? The author concludes that they do, to a much greater degree than is generally recognized. He marshals extensive examples and analyses literature to demonstrate the point. The question of norms arises in this discussion, particularly those standard norms of harmony, tonal plan, metric and rhythmic placement, and conventional formal procedures that largely mold classic-romantic music. The author shows that shapes intrinsic to individual works provide a structural rationale for the seeming anomalies at times found in the musical behavior of these works, for their departure, that is, from the norms of convention, create their own norms and extend them to many it is these intrinsic norms that provide the unique character of the works, and special bases for their coherence and unity. The author's conclusions are illustrated and illuminated by the numerous excerpts from scores by Haydn, Mozart, Beethoven, Schubert, Schumann, Brahms, Schoenberg, and other composers.",
  "genres": [
    "Music"
  ],
  "author": "David Epstein",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/205143.Beyond_Orpheus"
}