{
  "title": "Deliverer",
  "description": "The ninth novel in Cherryh’s Foreigner space opera series, a groundbreaking tale of first contact and its consequences…In the aftermath of civil war, the world of the atevi is still perilously unstable. Tabini-aiji, powerful ruler of the Western Association, along with his son and heir Cajeiri, and his human paidhi, Bren Cameron, have returned to the seat of power. The usurper, Murini, has escaped to the lands of his supporters, but the danger these rebels pose is far from over. Ilisidi, Tabini's grandmother, the aiji-dowager, has returned to her ancient castle in the East, for she has powerful ties in the lands of the rebels, and she seeks to muster whatever support for her grandson that she can from among those enemy strongholds.In his father's tightly guarded headquarters, eight-year-old Cajeiri is horribly bored. Two years on an interstellar starship surrounded by human children have left him craving excitement. But unbeknownst to this dissatisfied youngster, he has become a target for forces bent on destroying his father's rule and everything it stands for. Though still a child, Cajeiri embodies a unique threat to the venerable, tradition-defined lifestyle of his people. For this young boy is the first ateva youth to have lived in a human environment. And after hundreds of years of tenuous atevi-human coexistence, Cajeiri may very well be the first ateva to ever truly understand the so similar yet so dangerously different aliens who share his home planet and threaten the hidebound customs of his race.The long-running Foreigner series can also be enjoyed by more casual genre readers in sub-trilogy installments. Deliverer is the 9th Foreigner novel, and the 3rd book in the third subtrilogy.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Space Opera",
    "Aliens",
    "Science Fiction Fantasy",
    "Audiobook",
    "Adventure"
  ],
  "author": "C.J. Cherryh",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/11153026-deliverer"
}