{
  "title": "Howard's Book of Conundrums and Riddles",
  "description": "CONUNDRUMS, INGENIOUS ENIGMAS, CLEVER CHARADES, QUEER RIDDLES, PERPLEXING PUZZLES, CURIOUS CATCHES, AND AMUSING SELLS, ORIGINAL AND NEWLY DRESSED. A LEARNED writer, when the world was \" slow,\"And ponderous moral essays were \" the go,\"Stung by a jester—so the story runs—Classed picking pockets with concocting puns.A fig for Johnson, and all by-gone seersWhose \" rounded periods \" bored our grandsires' earsThese times are jollier, thank the gods! than theirs,And puns more relished than pedantic airs.Our modern scholars sometimes condescendHumor with logic in their works to blend;Our lawyers pungently each other \" chaff\"Till judge and jury over-tickled, laugh ;Our politicians who for office strive,Like clowns, with jokes the canvass keep alive ;Our statesmen deal in stories quaint and queer,That tell, well told, upon the public ear,And e'en the merchant, leaning o'er his desk,Hums some light ditty from the last burlesque.In such an age, when men of every classPrefer \" ha! ha ! \" to lachrymose \" alas! \"A work like this, of gravity the foe,Will by the world be hailed as apropos.With humorous problems every page aboundsWhere double meaning lurks in single sounds And words are played on with such perfect art, That each solution makes the solver start. The \" dollar hunt,\" so strenuously pursued, Would keep us all in a most dolorous mood, But for the hours we borrow from the mart And give to Momus, tickler of the heart! The daily press, so leaden-paced of yore, Aims with broad jokes to make the millions roar The stage with equivoques convulsive rings, And comic songs the muse of opera sings. In short, to link with smiles our daily cares, And dovetail laughter with our grave affairs, Seems a main object—neither more nor less— Of stage, bar, party and the public press. To give new impulse to the merry din, This merry book appropriately comes in. Conundrums rich, upon these leaves of ours, Like sunlit rain, have fallen in golden showers, With riddles, of their puzzling tribe the pinks, That take the shine out of old Egypt's Sphynx. Open, and read and solve—pray don't repress The sovereign Yankee privilege to guess, But twist the meaning out, by hook or crook. Of every pleasant mystery in our \" Book.\"BOOK OF CONUNDRUMS AND RIDDLES,",
  "genres": [],
  "author": "Clarence J. Howard",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/20512344-howard-s-book-of-conundrums-and-riddles"
}