{
  "title": "The Fix",
  "description": "Meet Colt Walker, a college quarterback with good looks, brains, and one of the best arms in the game. Why would a guy with Heisman and first round NFL draft potential risk everything? Colt puts it all on the line as he slides into the ugly world of sports gambling.Also, meet college football referee, Frank Gastner. A man stewing in his own misery as he is consumed by alcohol, heavy gambling debt, and a nasty divorce.Follow these two emotionally wrought characters, as their lives spin completely out of control. Alcohol and lies flow nonstop while bookies and mobsters stir up trouble. Walker and Gastner are brought together on the football field, each hoping to resolve his own dilemma. Emotions run the gamut and the story will keep you guessing until the last play of the final game.“Engaging characters, true to life situations, and a story that will make you rethink the headlines regarding college sports.”\"One thing I love is a good mystery. More than that I love a good sports mystery. And most of all I love a good sports mystery that feels real. 'The Fix,' is all of the above.\" - John Feinstein, Sportswriter, Columnist, Author, Broadcaster, Sports Commentator“Blazes like a 4.2 forty with the intrigue of a Sports Illustrated cover piece.\" Andrew Gross, NY Times Bestselling AuthorAs a former college athlete and now a member of the national media I couldn't take my eyes off The Fix. The twists and turns kept me on the edge of my seat as a sports fan. It's a must read!” Douglas Gottlieb, Host of The Doug Gottlieb Show on CBS Radio“Continuing to write first-rate suspense- exploring the deepest conflicts in human nature. Exquisitely crafted with an utterly surprising climax, this story will satisfy all. Balkind takes you away for a spellbinding, all-consuming afternoon.” Tonja Walker - Actress, Producer“As a former newspaper and mag scribe, I am always looking for the story within the story and The Fix makes you wonder could this really happen today? Like every good book I have ever read the Fix made me think and that is a good thing. A must read!” Damon Hack, Senior Writer for Sports Illustrated, NY Times, Newsday and The Golf Channel\"Sports, suspense and a compelling look at the temptations and tragedies of gambling...'The Fix' is a sure thing!\" Brian A. Crowell, PGA Professional, TV Broadcaster, author of Slice Free Golf“Being a sports thriller, I'd say \"The Fix\" is a home-run, a hole in one and a touchdown. Balkind and Burr had me snookered!” Claude Bouchard, bestselling author of the VIGILANTE series\"Fast, lively, and morally complex, ‘The Fix’ starts with a bang and hurtles along to a surprising, satisfying conclusion. Balkind has produced another vivid thriller set in the intersection where modern-day sports, big business, and crime collide.\" Joe Wallace, author of Diamond Ruby and Invasive Species",
  "genres": [
    "Fiction"
  ],
  "author": "Michael Balkind",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/20520868-the-fix"
}