{
  "title": "Blood of Thieves",
  "description": "Discover how the Riyria Revelations began! BLOOD OF THIEVES collects two complete novels containing the earliest adventures of the heroes of Michael Sullivan's smash-hit epic fantasy saga! THE CROWN TOWER: Two men who hate each other. One impossible mission. A legend in the making.Hadrian Blackwater, a warrior with nothing to fight for is paired with Royce Melborn, a thieving assassin with nothing to lose. Together they must steal a treasure that no one can reach. The Crown Tower is the impregnable remains of the grandest fortress ever built and home to the realm's most prized possessions. But it isn't gold or jewels that the old wizard is after, and if he can keep them from killing each other they become a legendary team.THE ROSE AND THE THORN: A dear friend is brutally beaten. Two thieves want answers. Riyria is born.For more than a year Royce Melborn has tried to forget Gwen DeLancy, the woman who saved him and his partner Hadrian Blackwater from certain death. Unable to get her out of his mind, the two thieves return to Medford but receive a very different reception -- Gwen refuses to see them. The victim of abuse by a powerful noble, she suspects Royce will ignore any danger and seek revenge. By turning the thieves away, Gwen hopes to protect them once more. What she doesn't realize is what the two are capable of, but she's about to find out. The Riyria Chronicles are prequels to The Riyria Revelations and the books can be read in either order of publication (starting with Theft of Swords) or chronological order (The Crown Tower).\"Best of\" and \"Most Anticipated\" ListsThe Crown Tower* 2013 Goodreads Choice Award Nominee for Fantasy* 2013 Audible Best of Everything* 2013 Audible's 5-star Listens for Fantasy* 2013 Fantasy Faction's Top 25 Fantasy Books* 2013 Shadowhawk Shades's Top 6 Fantasy Reads* 2013 Confessions of an Avid Reader's Top 10 Books* 2013 Audible's August Customer Favorites* 2013 Shadowhawk Shade's Reading Award for August* 2013 Fantasy Book Review's Six (non-hyped) Most Anticipated Books* 2013 Fantasy Faction's Top 10 Most Anticipated Books* 2013 Ranting Dragon's 50 Fantasy and Sci-Fi Novels to Look Forward* 2013 BestFantasyBooks.com's Most Anticipated Fantasy Reads* 2013 Shadowhawk's Shade Most Anticipated Releases* 2013 A Fantasy Reader's Eager Meter Nominee* 2013 Draumr Kopa Fantasy Book Blog Waiting on WednesdayThe Rose and the Thorn* 2013 Fantasy Faction's Top 25 Fantasy Books of 2013* 2013 Confessions of an Avid Reader's Top 10 Books* 2013 Audible's September Customer Favorites",
  "genres": [
    "Fantasy",
    "Adventure",
    "Epic Fantasy",
    "Fiction",
    "Audiobook"
  ],
  "author": "Michael J. Sullivan",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/20520503-blood-of-thieves"
}