{
  "title": "Millionaire Monster Daddies: Collection 1",
  "description": "Get the first four books in the Millionaire Monster Daddies series in one collection edition!CASSIN:Danny can hardly figure out what he wants to do with his life, let alone who he wants to date. He has just moved into an apartment with his three queer best friends and for the first time they can do whatever they want. What they want to do, is get drunk and go clubbing.When the friends pre-game then stumble into a bar they've never seen before, they have no way of knowing that they somehow bluffed their way into a super elite, super supernatural millionaires club.Danny spends the whole night socializing with Cassin, a guy who seems vaguely familiar to him but insists they've never met. Danny goes home with him that night, and when he wakes up in the morning, he realizes that Cassin owns the company that his dad works for--that's where he's seen him.Cassin seems un-bothered with Danny's... unconventional body... and indeed seems to be obsessed with him in general. The pair get closer and closer until secrets come out that neither of them can ignore...In the neon-lit corners of the city lies La Société de la Nuit, an exclusive nightclub known only to the elite paranormals. Delilah, a captivating succubus with secrets as ancient as her allure, finds herself managing the club when her jet-setting friend Cassin disappears to Europe. With a vision to transform the club into a haven for the queer community, Delilah, alongside Kyne, a brooding wolf-shifter, and Rayze, a cheeky ghost with a habit of becoming all too real, dives into the city's vibrant LGBTQ+ nightlife.But it's at a sultry lesbian club where Delilah's world collides with Annabelle's. With fiery red curls and a spirit to match, Bel is everything Delilah is drawn to and everything she should avoid. Because Delilah's touch is as deadly as it is tempting. Unbeknownst to Bel, she steps into a world teeming with monsters, millionaires, and mysteries when she signs up to bartend at La Société.KYNE:In the electrifying, supernaturally charged streets of Chicago, Kyne is a formidable wolf shifter, balancing life as a bouncer at an exclusive club for mystical creatures and as a self-defense instructor.Alejandro, or Ali, is a wealthy young man looking to fortify himself against the dangers of the city. After a harrowing mugging, Ali's journey leads him to Kyne's self-defense class—a decision that changes both their destinies.The night should have been like any other. But as Ali leaves class, danger befalls him once more. This time, Kyne is there to save him. The attack, however, leaves Ali with no memories, and Kyne with just a name to go by. The twist? A mate bond forms, revealing that Ali is the missing piece to Kyne's life—a realization that forces Kyne to confront an attraction he never saw coming, challenging every notion he had about his own sexuality.RAYZE:Behind the bewitching glow of La Société de la Nuit’s neon signs, the lines between dreams and reality blur for Rowan. After discovering the club's supernatural clientele and having a heart-racing encounter with the mysteriously seductive Rayze, Rowan is thrust into a world where the supernatural is more than just whispered legends.But there's more to Rayze than meets the eye. His ethereal presence ignites a fire in Rowan—a connection deeper than any they’ve ever felt. Nights seep into passionate encounters where dreams become tangible, and a ghost’s touch is as real as any living being's. Every dream-soaked night brings them closer, but every dawn threatens to tear them apart.",
  "genres": [],
  "author": "August Oliver",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/205212893-millionaire-monster-daddies"
}