{
  "title": "Toddlers And Tycoons",
  "description": "Maggie Fairbanks has life summed up in one word. Difficult. After her sister and her deadbeat brother- in- law clean out Maggie's bank account and take off for parts unknown, she is left holding onto nothing but a diaper bag and a heaping helping of toddler sized trouble. Between her job as a waitress, and trying to put herself through college, Maggie needs to find the extra cash in order to keep her tiny niece and nephew from going into foster care or worse... going back to live with Maggie's selfish mother and her alcoholic father in their rust bucket of a trailer. With nothing left to her name, Maggie takes a job working as a housekeeper for an eccentric old man and his grandson. But more is going on under the surface on the ranch than just dirty dishes, and it just may wind her up in more trouble than she can handle.Maggie's decision to take the job on the Calhoun Ranch was going to change her life in more ways than one. If Elias Calhoun, patriarch of the Calhoun family had any say in it, the job would be permanent as in for life... Elias has his eye on Maggie for much more than just as his housekeeper, he wants to see her matched up with his hard headed grandson Lucas, and not even the pesky FBI agents hunkering down on his spread, are going to stop him from achieving his goal.Lucas Calhoun, grandson to the eccentric oil tycoon has his hands full. With juggling the ranch, his family's oil company, and the terrifying death threats aimed at his hard headed grandfather, Lucas doesn't want more chaos thrown into the mix. And chaos was just what Maggie Fairbanks would bring him, along with two babies in tow. Unfortunately, Lucas can't just send her away, he needs her too much, though he won't admit it...even to himself. When a situation calls for Lucas to propose a temporary marriage to his spirited housekeeper, he never suspects just how much he would gain from doing so, or what he stands to lose...maybe, his very own heart.With danger just around the corner, could falling in love with a temporary wife be any crazier?",
  "genres": [],
  "author": "Rebecca De Medeiros",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/20520248-toddlers-and-tycoons"
}