{
  "title": "Scattered Links",
  "description": "CAPTIVATING! SCATTERED LINKS takes you down the street of nearly any Eastern European town, arm-in-arm with the orphaned. Michelle has captured the beauty and horror millions of children live everyday. The attention to detail is impressive. Having lived in a post-Soviet country for a time, visiting orphaned children, this fictional account rings with truth, from the heart-wrenching pain of abandonment to the realization of self-worth, and the love family and faith brings. Thank you for such an uplifting book, appropriate for the young reader, as well as adult. May your heart be encouraged, as mine was.  Kim de Blecourt, speaker and award-winning author of \"Until We All Come Home: A Harrowing Journey, a Mother's Courage, a Race to Freedom\"  “Scattered Links is a novel that pulls its characters from the gutters and, in the end, celebrates the tenacity of the human spirit.” A reviewer comment.  Thirteen-year-old Oksana lives on the streets of Russia with her pregnant mama and abusive aunt—both prostitutes. When Mama swells into labor, Oksana makes a decision to save herself from abandonment, a decision that torments her forever. But her plan fails when her aunt dumps her in an orphanage before she has the chance to say goodbye to her mama or tell her the secret that haunts her.  Scattered Links is a story of family and the consequences that come from never learning how to love. It’s a story of a girl’s inability to bond with her adopted family and the frustrations that follow.  How can a child understand the mechanics of forming a healthy relationship when she never had a mother who answered her cries, held her when she was frightened, fed her when she was hungry, or loved her unconditionally?  Only when the child meets a rescued abused horse, and recognizes the pain in his eyes, does she begin to trust again.",
  "genres": [
    "Fiction",
    "Russia",
    "Young Adult"
  ],
  "author": "M. Weidenbenner",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/20516809-scattered-links"
}