{
  "title": "Amintiri din pribegie",
  "description": "A book in Romanian.\"Amintiri din pribegie” este o carte pe care nici cel mai posmagit cititor nu o poate lasa din mana. Ajunge sa o deschida, si ramane captiv, hipnotizat de atatea peripetii, lumi si personaje. [...] Aceasta viata de om cum putine au fost nu explica totusi decat in mica masura interesul extraordinar al memoriilor lui Neagu Djuvara.Esentialul este arta rafinata si voluptuoasa a povestitorului, capacitatea lui de a preface orice intr-o istorie nemaipomenita si memorabila. [...] Scriind intr-o admirabila romana, ca si inaintasul sau fost bey de Samos, fostul consilier (si „negru”, autor de discursuri) din Republica Niger devine, prin aceste „amintiri”, unul dintre cei mai importanti scriitori romani. De azi.” (Mircea Iorgulescu)\"Povestea vieţii lui Neagu Djuvara are verva sălbatică a unui peisaj luxuriant. Nu e suficient să spui că a trecut prin multe. A trecut prin tot. Război şi Universitate, aventură şi savantlâc, exil şi repatriere, Europa şi Africa, diplomaţie, filozofia istoriei, spionaj, jurnalistică, Sorbona, Niamey şi Bucureşti, boierie şi sărăcie, profesorat, politică, explozie creatoare după vârsta de 80 de ani, anonimat şi glorie, acţiune, contemplativitate, radicalitate, cordialitate, hazard. Recunoaşte singur că a fost mereu însoţit, în momentele decisive, de un „noroc\" salutar. A prins ultimul tren spre Helsinki după marea revoluţie rusească din octombrie şi a fost trimis la Stockholm pe 23 august 1944, anume, parcă, pentru a supravieţui tăvălugului bolşevic. La 94 de ani are încă mari proiecte, speră să-şi afle sfârşitul pe un vapor, e ubicuu, tonic, şarmant, distins, fără fasoane, bucuros de glumă şi de tacla. De câte ori îl văd, mă contaminez de buna lui dispoziţie, savurez bunele lui maniere şi admir curajul opiniilor sale, adeseori în afara convenţiilor curente.\" (Andrei PLEŞU)",
  "genres": [
    "Romanian Literature",
    "Nonfiction",
    "History",
    "Biography",
    "Romania",
    "Memoir",
    "Autobiography"
  ],
  "author": "Neagu Djuvara",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/2052703.Amintiri_din_pribegie"
}