{
  "title": "Crispin: Cross Of Lead",
  "description": "Astas son is all hes ever been called. The lack of name is appropriate, because he and his mother are but poor peasants in fourteenth-century medieval England. But this thirteen-year-old boy who thought he had little to lose soon finds himself with even less -- no home, family, or possessions. Accused of a crime he did not commit, he has been declared a wolfs head. That means he may be killed on sight, by anyone. If he wishes to remain alive, he must flee his tiny village. All the boy takes with him is a newly revealed name -- Crispin -- and his mothers cross of lead. His journey through the English countryside is amazing and terrifying. Especially difficult is his encounter with the juggler named Bear. A huge, and possibly even mad, man, Bear forces the boy to become his servant. Bear, however, is a strange master, for he encourages Crispin to think for himself. Though Bear promises to protect Crispin, the boy is being relentlessly pursued. Why are his enemies so determined to kill him? Crispin is gradually drawn right into his enemies fortress where -- in a riveting climax -- he must become a different person if he is to save Bears life and his own. He discovers that by losing everything, he has gained the most precious gift of all: a true sense of self. A master of breathtaking plot twists and vivid characters, Avi brings the full force of his storytelling powers to the world of medieval England. Avis books are loved by children and adults around the world. The author has written many novels for young readers, several of which have garnered prestigious awards, including two Newbery Honors. Crispin: The Cross of Lead is his fiftieth book, and it was awarded the 2003 John Newbery Medal.",
  "genres": [
    "Historical Fiction",
    "Young Adult",
    "Fiction",
    "Middle Grade",
    "Historical",
    "Childrens",
    "Adventure"
  ],
  "author": "Avi",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/20521491-crispin"
}