{
  "title": "My Thinning Years: Starving the Gay Within",
  "description": "As a child, Jon tried desperately to be his father’s version of the all-American boy, denying his gayness in a futile attempt to earn the love and respect of an abusive man. With this he built a deep, internalized homophobia that made him want to disappear rather than live with the truth about himself. That denial played out in the forms of anorexia, bulimia, and obsessive running, which consumed him as an adolescent and young adult.It wasn’t until a grueling yet transformative Outward Bound experience that Jon began to face his sexual identity. This exploration continued as he entered college and started the serious work of sorting through years of repressed anger to separate from his father’s control and condemnation.My Thinning Years is an inspiring story of courage, creativity, and the will to live—and of recreating the definition of family to include friends, relatives, and teachers who support you in realizing your true self.“A storyteller's job is to help others find their way. Show them choices. Perhaps avoid pitfalls. Jon Derek Croteau's powerful new book is a beacon shining on the puzzle of life.”—Bob Dotson, New York Times bestselling author of American Story, a Lifetime Search for Ordinary People Doing Extraordinary Things & NBC News/Today Show Correspondent“I canceled plans to finish this book, and you will, too. Alternately riveting, heartfelt and horrifying, Jon Derek Croteau's descent into anorexia and obsessive running as a means to deny his true self is spellbinding.”—Eric Poole, author of Where's My Wand“Jon Derek Croteau writes with unstinting honesty in his memoir MY THINNING YEARS, and courageously explores the harmful effects of bullies long after they've left the scene. But he also reveals the plain fact that the greatest bully we have to win over is often the one within us.”—James Lecesne, Co-Founder of THE TREVOR PROJECT“A fantastic and harrowing story, told deeply and honestly…an emotional read…a generous, hopeful book I dearly hope gets into the hands of the many people who face similar hardships and desperately need to hear Jon Derek Croteau's story.”—Randy Harrison, actor, Queer As Folk“MY THINNING YEARS is an inspiring story of one man's struggle with anorexia, with sexual identity, and his struggle for selfhood.”—Betsy Lerner, author of Food and Loathing“The story of all of us as we come to terms with who we are. As I raced through these pages like the runner within them, I was reminded of my own trials… It takes courage to tell your story, to come out, to remove yourself from an abusive relationship. These pages help usher in our more tolerant present and our ever-evolving hearts.”—Award-winning singer/songwriter, Will Dailey“MY THINNING YEARS is not just a labor of love but a love-letter to those who are struggling silently and suffering deeply with an eating disorder. Jon Derek Croteau sheds incredible insight and a heartfelt vision for surviving and thriving in your life.”—Jess Weiner, Author, Strategist and Self-Esteem Expert“MY THINNING YEARS is an emotional journey through Jon Derek Croteau’s struggle with eating disorders and accepting his identity as a gay man. In his struggle to accept his sexuality, Croteau attempts to erase his pain through trying to erase himself. Men’s experiences of anorexia and bulimia are underrepresented in media, medical and personal accounts. This is an honest, powerful and raw insight into the self-punishing, self-harming and consuming force of eating disorders.”—Grace Bowman, author of Thin“You do not need an eating disorder, homosexual tendencies, or a terrible parent to love this book. Croteau's story is a universal one, and his painful and hard-won transformation will both move and inspire you.”—Eric Poole, author of Where’s My Wand? One Boy’s Magical Triumph over Alienation and Shag Carpeting“MY THINNING YEARS is a powerful story about overcoming adversity. Jon Derek Croteau’s courage, honesty, and unfailing passion are sure to both inspire and keep the pages turning!”—Jenni Schaefer, co-author of Almost Anorexic, author of Life Without Ed and Goodbye Ed, Hello Me",
  "genres": [
    "LGBT",
    "Nonfiction",
    "Memoir",
    "Queer"
  ],
  "author": "Jon  Derek Croteau",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/20523567-my-thinning-years"
}