{
  "title": "The Kindling Heart",
  "description": "An alternate cover edition can be found here.Ruan MacLeod was through with women. They were nothing but trouble. Leaving the rash life of his youth behind, he returned to Skye, seeking peace. He never meant to split the clan or start a war with the MacDonald of Duntulm. He certainly never foresaw an arranged marriage to the most scandalous woman in Scotland. Even though she was twice his age, the size of a horse and mother to more than one illegitimate child, he agreed to secure his sister’s freedom. However, even that plan goes drastically awry. On his wedding day, he finds himself faced instead with an enticing, green-eyed lass named Bree. A walking disaster, his bride immediately turns his world into chaos and threatens to melt his resolve never to love again.Betrayed by her own mother, Bree flees to Skye, thinking only to reunite with her long, lost father. Instead, she finds herself wed to Ruan MacLeod as a replacement bride. When she is forced to remain in the castle, she is soon caught between brothers and the mentally ill wife of the laird.Shy, yet strong, Bree embarks on a journey of independence and learns along the way that all men are not necessarily evil. In fact, one particularly brooding, yet gentle-hearted warrior is worthy of love, and she soon loses her heart forever.Excerpt from Chapter Six:...All at once, he noticed he was still holding her, apparently at the same moment understanding dawned in her face.Bree launched into another attack, jabbing his midriff and raking his skin with her nails.“Be still, ye wee hellion!” Ruan bellowed, pinning her wrists behind her back.For a moment, he thought she was going to retch; her pasty skin seemed almost yellow, purple and black streaks adorned her nose and cheekbones. Marriage to him had not served her well; in two days, she had transformed from a lass with a pair of bright green eyes to a drowned, underfed chicken.As her foot grazed his shin, he winced, quickly amending the thought; a mean-spirited, drowned, underfed chicken.Another well placed kicked wrenched a new succession of curses from his lip, but as her tears began to flow, real ones, his exasperation fled. Of all things, tears affected him the most. One slid down her cheek. Succumbing to a wave of pity, he wiped it gently with his thumb. Bree gulped, frowning in a way he could not fathom. For several long minutes, they stared wordlessly at each other.Finally, her cracked lips opened and she wailed, “I’m not wedding anyone!”Gazing down into the bright eyes brimming with tears, Ruan sighed. “Aye, ‘tis a wee bit late, lass.”It was supposed to be comforting, or so he thought, but his response seemed only to renew her resistance. Balling her fists, she struck his chest but more in blows of frustration than anything else. In spite of his best efforts, he grinned. Battling to the last breath was something he could understand, even for a hopeless cause such as this one. Lips twitching, he easily recaptured her wrists in a single hand. They were unusually small hands, perfectly shaped.The fingers jerked free from his grasp. Startled, he met her eyes once more.“You’ll die if you touch me!” Her slurred threat ended with a hiccup, rendering it anything but intimidating.He could smell the whiskey on her breath.His grin widened.Her hand fumbled near his belt before closing over the hilt of his sword. Assuming a fierce expression, she attempted to frighten him. “I’ll sever your manhood whilst you sleep!”To emphasize the statement she tugged at the blade, several times.On the third attempt, the sword cleared the scabbard almost an inch.“Aye.” Ruan laughed outright, his lips curving into a suggestive smile, “But it would take even a larger blade; ye haven’t a prayer if ye can’t lift this one.” His hand closed over hers. Not as a deterrent, but simply to watch her eyes flash defiantly once more....",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Scotland",
    "Historical Fiction",
    "Medieval",
    "Fiction"
  ],
  "author": "Carmen Caine",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/11156287-the-kindling-heart"
}