{
  "title": "Lord of the Vampires: 4-in-1 Bundle",
  "description": "Lord of the Vampires Royal House of Shadows #1Once upon a time…the Blood Sorcerer vanquished the kingdom of Elden. To save their children, the queen scattered them to safety and the king filled them with vengeance.Only a magical timepiece connects the four royal heirs…and time is running out.…Nicolai the Vampire was renowned for his virility, but in a twist of fate \"The Dark Seducer\" had become a sex slave in the kingdom of Delfina—stripped of his precious timepiece and his memory. All that remained was a primal need for freedom, revenge—and the only woman who could help him.In her dreams, a wanton vampire called to Jane Parker, drawing her to his dark sexuality and his magical realm.But for a human, all was not a fairy tale in Delfina. Jane was the key to Nicolai's memory…but exploiting her meant dooming the only mortal he craved.The Darkest Angel Lords of the Underworld #4.5An iron-willed demon assassin, the angel Lysander has never known lust—until he meets Bianka. Spawned from the bloodline of Lucifer, the beautiful but deadly Harpy is determined to lead the pure-hearted Lysander into temptation….The Amazon's Curse Atlantis #5Zane, a fierce vampire warrior, has been enslaved by the Amazons. Nola, a lovely Amazon soldier, has been cursed with invisibility. Now, these two stubborn enemies must overcome the pasts that haunt them and embrace a love that can set them free... (Can be found as a whole novel here)The Darkest Prison Lords of the Underworld #3.5Passion and danger collide in this brand-new, eBook exclusive Lords of the Underworld adventure!Once, Atlas, the Titan god of Strength, was the Greek goddess Nike's slave. Now, he is her master. And soon these sworn enemies destined to destroy one another will be forced to risk everything for a chance at love...",
  "genres": [
    "Paranormal Romance",
    "Romance",
    "Paranormal",
    "Vampires",
    "Fantasy",
    "Adult",
    "Urban Fantasy"
  ],
  "author": "Gena Showalter",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/11156403-lord-of-the-vampires"
}