{
  "title": "The Colony: The Harrowing True Story of the Exiles of Molokai",
  "description": "In the bestselling tradition of In the Heart of the Sea, The Colony reveals the untold history of the infamous American leprosy colony on Molokai and of the extraordinary people who struggled to survive under the most horrific circumstances. In 1866, twelve men and women and one small child were forced aboard a leaky schooner and cast away to a natural prison on the Hawaiian island of Molokai. Two weeks later, a dozen others were exiled, and then forty more, and then a hundred more. Tracked by bounty hunters and torn screaming from their families, the luckless were loaded into shipboard cattle stalls and abandoned in a lawless place where brutality held sway. Many did not have leprosy, and most of those who did were not contagious, yet all were caught in a shared nightmare. The colony had little food, little medicine, and very little hope. Exile continued for more than a century, the longest and deadliest instance of medical segregation in American history. Nearly nine thousand people were banished to the colony, trapped by pounding surf and armed guards and the highest sea cliffs in the world. Twenty-eight live there still. John Tayman tells the fantastic saga of this horrible and hopeful place—at one time the most famous community in the world—and of the individuals involved. The narrative is peopled by presidents and kings, cruel lawmen and pioneering doctors, and brave souls who literally gave their lives to help. A stunning cast includes the martyred Father Damien, Robert Louis Stevenson, Jack London, Mark Twain, Teddy Roosevelt, John Wayne, and more. The result is a searing tale of survival and bravery, and a testament to the power of faith, compassion, and heroism. \"Tayman's narrative pulls the reader beyond the superficial, medical horrors of leprosy to the more devastating human horrors that lie beneath. In doing so, he has brought to light the profound dignity of his subjects.\"—New York Times \"Tayman's crisp, flowing writing and inclusion of personal stories and details make this an utterly engrossing look at a heartbreaking chapter in Hawaiian history.\"—Booklist \"Drawing on contemporary sources and eyewitness accounts of the still surviving members of the colony, Tayman has created a fitting monument to the strength and character of the castoffs in particular, and human beings as a whole.\"—Publishers Weekly",
  "genres": [
    "History",
    "Nonfiction",
    "Medical",
    "Science",
    "Medicine",
    "American History",
    "Audiobook"
  ],
  "author": "John Tayman",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/2052889.The_Colony"
}