{
  "title": "Mia's Journey",
  "description": "READER ADVISORY: Mature Audiences Only. This story contains content that includes sex and violent content. All of the characters are 18 years of age or older.A powerful, well-connected, sexual predator “buys” his wife in lieu of legal fees for his own sadistic desires.A physically and emotionally abused girl lives in sexual hell, with ‘invisible handcuffs’ binding her. Her only escape is her writing.An older man in a loveless marriage befriends her not knowing the world of hurt awaiting him for doing so.A corrupt cop, a sexual sadist, a powerful family, against two unprepared, unlikely, heroes.But nothing is what it seems, and neither are they. Both sides bring out the very best, and the very worst in each other in this erotic adventure.Mia has been abused her entire life. It started with her father and continued when she was given to her husband as payment for legal fees. Her husband, Jeffery Prescott, was a well- connected lawyer that took great pleasure in using his submissive wife any way his sick mind desired. He even started loaning her out to other twisted sexual predators. She is held in captivity in plain sight with ‘invisible handcuffs.’ His contacts throughout the city insure that Mia is controlled every second of her day. Mia started writing to escape her everyday hell.Ten years later, on an online writing forum, she meets someone she nicknames “Daddy,” for the father she never had. Daddy is older, in a loveless marriage, held together by the love he has for his son. What started as an unlikely friendship soon turns into something filled with passion. Mia and Daddy click for opposite reasons……One wants escape her brutal present, another wants to escape his violent history.It sparks an intense sexual relationship neither is prepared, or ready for. They first rely on each other for emotional support, and both their worlds spirals out of control.Daddy sees what is happening in Mia’s life and tries to help her, and without knowing it, gets involved in things way over his head. But Daddy isn’t who he appears to be and has lethal skills of his own buried deep in his past. He left his violent former life behind…or so he thought. Daddy knows he is no action hero. He can’t compete with younger, stronger, better armed men. He has to rely on his smarts instead.A sexual sadist, a corrupt cop, a powerful family, against two unprepared, unlikely, heroes.The lawyer, in an effort to save his own skin, first tries to intimidate Daddy. When that fails, he then enlists the help of a corrupt cop and an inner city gang. Daddy is savagely beaten, and he is left for dead. Bad move. They should have killed him because now it’s personal. There are some things in life you don’t back down from.Mia, on finding out what happens to her one and only true friend who was only trying to help her, sets out on her own mission to destroy her husband. Her rage at her treatment and her abusers is let loose as she sets out to crush the family that “owns” her.Alone and without help, against powerful , politically connected enemies, the hunted turn the tables and become the hunters as Mia and Daddy set out to balance the scales of justice in an explosive, bloody, climax that leaves the entire city reeling.READER ADVISORY: This story contains content that includes sex and erotic themes. All of the characters are 18 years of age or older.",
  "genres": [
    "Dark",
    "BDSM",
    "Erotica",
    "Abuse",
    "Adult",
    "Suspense",
    "Amazon"
  ],
  "author": "John Rebell",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/20534905-mia-s-journey"
}