{
  "title": "Toxic",
  "description": "“You’re an addiction I can’t overcome, no matter how hard I try.” – Rook TylerHis life consists of his best friend, Jack Daniels, his favorite drug of choice and women. Rook Tyler lives for performing at night and wasting the rest of his days washing away the pain from his childhood so he doesn’t have to feel anything...ever. The only people he trusts are his band mates from Shattered Souls and he wants to keep it that way. His life was completely under control and simple until he heard the voice of Maisy Madison filter through The Tavern speakers. Growing up in the foster care system with her two other band mates from Twisted Perfection, Maisy finds herself doing pretty much anything to get her and her band noticed but nothing seems to be working. One lucky night, Shattered Souls, the most popular band in the country, decides to show up at their little concert and luckily signs them on the spot. But the arena venues and massive amount of fans isn’t what has Maisy shaking in her heels. It’s the deep baritone voice of Rook Tyler that has haunted her dreams for years which has her wondering if she can actually go through with the tour. The force is almost too strong. He can feel her everywhere he goes and no matter how much he tries to resist her, he finds himself gravitating towards Maisy, wanting to hold her, kiss her and touch her. He knows he shouldn’t get involved. He knows no matter what, he will end up hurting her but he can’t help it, his soul is connected to hers and the pull is too strong for him to resist. Rook warned her time and time again but she doesn’t listen, she doesn’t want to listen. She needs him and she doesn’t care that she knows deep down in her heart that their relationship is going to end in disaster.She refuses to acknowledge that no matter what they do, their love is toxic.",
  "genres": [
    "Romance",
    "New Adult",
    "Music",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Musicians"
  ],
  "author": "Meghan Quinn",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/20528574-toxic"
}