{
  "title": "Angel Blackwood",
  "description": "Some people would say that only a coward runs, but I'd say running away from Point Bright and the people I once loved most is the hardest damn thing I've ever had to do.The possibility of losing my friends due to my inherent need to flee is an entirely new sort of hurt, one I haven't felt before and the fact that I have lost myself over these past few months has almost killed me; I need to find myself again.I have to get back to the strong girl I was before Point Bright broke me, seriously messing with my head. I’m not sure how and if I can ever possibly be that person again but I must try. Too much has happened, too much crazy shit has gone down.I now know things I never thought could ever be remotely possible when I was innocent and naïve. That girl, the one with the pure heart is long gone and left in her wake… is me, the girl with the tainted one. My heart has been repeatedly splintered only to be mended then shattered again.In one night I lost the boy who continually hurt me whilst also insisting I was his world. The same boy who made me feel like I mattered… even if that meant forcing me to love him.Maybe the beatings worked after all?Or maybe I'm just a stupid lonely girl trying to make up for the neglect I have experienced in the previous few years. Even after all the crap he put me through, I continued to love him fiercely and stood by him only to find him in bed with her.Then there's Jax, I loved him from the moment I laid eyes on him but I knew I could never have him. Then I found out he was my mate; well surely it was destiny telling us that we were meant to be together?To have him reject me because he believed I was too weak to be the Luna of his pack broke me more than the beatings ever could.He really doesn't know how wrong he is!I now have to leave behind the girls who have been more like sisters to me, leaving all this pain behind. My destination is my parents pack house. What I don't expect is to smack head first into a really muscular chest, only to find out…I've found my second chance mate.",
  "genres": [
    "Paranormal",
    "Shapeshifters",
    "Werewolves",
    "New Adult",
    "Paranormal Romance",
    "Witches",
    "Fantasy"
  ],
  "author": "Sophie Summers",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/20530143-angel-blackwood"
}