{
  "title": "Bright Lights & Champagne",
  "description": "Belief and excitement, tears and disappointment. We all do it; each and every one of us dreams and fantasises, believing that we will be the one to have our dream come true. A voice singing one of our favourite songs, words with meaning adorning a rememberable tune. A face which we find attractive, we all have someone or something which we believe to be our hearts desire. Decorating bedroom walls with posters of those who inspire; and dreaming of being with those responsible for our teenage crush. Many a teenage girl wanted to be the girl on his arm. Many a teenager longs to live the lifestyle of the rich and famous.We all fall, head over heels and deeper than deep. Who we fall in love with feels at times to be out of our control. Attraction, desire, need, want, love or lust. When it hits it is like a thunderbolt. Unexpected, fast and unavoidable. Jane couldn’t have known what the future held. None of us know what life holds in store. Childhood can be magical, a time for learning and seeing everything through young fresh eyes. Being a teenager is a time of adventurous exploration, our time to believe and to dream. As we grow, we each live our own individual lives, taking one day at a time. Many of us have high expectations, we all have hope and we all hope that we will be happy and find love.What is love? Is there such a thing as love at first sight? We open our eyes and we see what we see. Mrs Jane Carter was an ordinary everyday wife and mother, a maturing female like any other, she believed that her life was mapped out before her. For Jane, growing up and becoming a responsible adult had brought with it troubles, hard times and complications, as a wife and mother Jane Carter had suffered heartache and knew that there would be more. Like many in her situation Jane pictured a future in-which she and her husband would go through life together. From being two very different individuals Jane and John Carter had vowed to become one, one couple, a unit; when their marriage was blessed with two children the Carters became a family and as a family was how Jane believed that they would spend the rest of their lives. As housewife and mother life wasn’t always easy but Mrs. Jane Carter, Jane believed herself fortunate to have found respect and loyalty both of which equaled Jane was married, in love and happy.How was a mature female to know the way in which a thoughtful birthday gift would transport her memory back in time, whilst catapulting her life into confusion and changing it forever? Can money buy everything which a rich, powerful and popular man desires. Can love be bought and a lifestyle sold. When we fall in love, will we stop at nothing in our attempt to have that love returned.When John was head hunted and offered a top paid job, the Carter family believed that their luck had changed as the loving family of four saw their dreams turn into They, Jane and John should have known that for every reward there is a sacrifice. For one to gain what they crave another must lose what they have. Dreams which come true can no longer be dreams and we should all be careful what we wish for. Money; the Carter's wanted nothing more then to be able to pay their way and be able to experience that which others appeared to take for granted. A family holiday, being able to send the children on school trips and take them to the places their friends bragged about. Food in the cupboards and clothes on their backs; The Carter family were happy to do things their way. Like everyone would John and Jane saw a career with good pay and prospects as being something they'd be foolish not to accept.As a teenager, Jane had wanted to be his girl. ‘Many did.’As a rich and powerful male, he would stop at nothing and do anything to make her his.",
  "genres": [
    "Romance"
  ],
  "author": "Jo Royston",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/11156730-bright-lights-champagne"
}