{
  "title": "Cup and Sorcery",
  "description": "Ollie and his crew are back! The Fibulan Museum has been burglarised and our intrepid detectives are appointed to solve the mystery, but they soon discover that this is no ordinary crime. During the course of their investigations, they find themselves undertaking a quest of quite literally epic proportions, in the hope that they will stave off disaster and avoid seeing Mrs. Ladle's legs.Earlier...The hunched figure sat on a three legged wooden stool, hooded head leaning over the container.Eyes unblinking, it peered intently into the murky miasma. Hands were raised and sleeves folded carefully back, before fingers were waved over the bowl in intricate patterns. At the same time, whispered incantations passed from tight, dry lips, attempting to invoke the aid of some otherworldly power...Can Ollie and his friends defeat the forces of darkness?Can they survive their treacherous journey?Can Flug have an intelligent thought without having a stroke? Of course he can't, but at least it builds up the tension.Cup and Sorcery is the second book in the Skullenia Novel series, and is a fun read for all ages!Author's excerpt from Cup and After cracking the difficult, and quite frankly exhausting, case of Jocular’s' missing lycanthropes, Ollie had taken some time to sort through some of his Uncle's vast accumulation of paperwork. There was all the usual stuff. Bills for cape cleaning (blood is hell to shift), receipts going back hundreds of years (he found one for a gas powered fang cleaner dated 1756), letters of thanks for work done and some magazine renewal forms (two of which were for publications that Ollie had (a) never heard of and (b) never wanted to hear of. They revelled under the headings of 'Bleeders Wives' and 'Double O Positives, How does all that fit in one cup?' Ollie was sure that his Uncle would only peruse these publications for the articles on the latest hansom cabs, but they went in the bin regardless). There was also the odd invitation or two. One of them was asking old Gorge to attend the Antichristening of his Demigodson, so Ollie replied to that one informing the sender of his late Uncle's demise. The second was an invitation to attend a conference in London where all of the delegates gathered to hear lectures, join in discussion groups and get involved in workshops doing table top exercises and giving presentations. The whole weekend was organised by the BBC (British Bloodletting Corporation) and the RSPCA (Royal Society for the Preservation of Carnal Acts), two charitable bodies whose sole intent was the advancement of the modern day undead. Ollie had figured that not only would it be a chance to get away for a few days to relax and blow away the cobwebs, which in Stitches' case was the literal truth, because his armpits were a constant problem, but he might get some valuable networking done. Not a bad idea, now that he had a computer with darknet access installed in his office.",
  "genres": [
    "Urban Fantasy"
  ],
  "author": "Tony   Lewis",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/20541697-cup-and-sorcery"
}