{
  "title": "The Little Doll Girl",
  "description": "This book appears in three Kindle editions, each for readers of different ages. Nine print collectible limited editions are available as well as eight Spanish editions. As with many illustrated classic stories, it is a story with unique characters and deals with hope, determination, compassion, and much more. In the opening preface, Robert Landsbury discovers the diary in a shed on a newly purchased estate in River Falls, Ohio and passes it along to his associates. The diary is faithfully preserved for today's reader. In it, the reader will discover that a ten-year-old mute girl, Tammy Wurtherington residing in the Wixby estate is the author. She loves to make dolls in a shed out in back of the house. She lives with Lord Wixby and Aunt May in a lavish estate at the edge of town. Aunt May teaches her to use a sewing machine and gives her a small one suited to size as a birthday gift. One day while constructing a toy soldier for her brother, Alfred the Mouse appears and is impressed with her ability to make doll outfits and reluctantly invites her to follow him to Kira if she will bring along the sewing machine. Tammy keeps a diary of her exploits in Kira which is ruled with an iron-hand by a pair of sorceresses, Catherine and Lucinda. Tammy and Alfred find their way through a fantasy underground transportation system that ends up with the pair mistakenly ending up in a wicker-basket in the middle of the ocean. From this point you will discover many wonderful characters like Zeke, the Flying Opossum, and Cedric the Mongoose, who accompany Tammy on her journey to Capira to present a petition to return the kingdom to its former glory. Tammy has an adventure in which she learns to love all the strange living creatures she encounters in a magical land. Before she departs, all of Kira will fall in love with The Little Doll Girl who changed them forever and became a legend.",
  "genres": [
    "Fantasy",
    "Childrens"
  ],
  "author": "Reynold Jay",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/20541196-the-little-doll-girl"
}