{
  "title": "The Dewey Decimal System",
  "description": "After a flu pandemic, a large-scale terrorist attack, and the total collapse of Wall Street, New York City is reduced to a shadow of its former self. As the city struggles to dig itself out of the wreckage, a nameless, obsessive-compulsive veteran with a spotty memory, a love for literature, and a strong if complex moral code (that doesn’t preclude acts of extreme violence) has taken up residence at the main branch of the New York Public Library on 42nd Street.Dubbed \"Dewey Decimal\" for his desire to reorganize the library's stock, our protagonist (who will reappear in the next novel in this series) gets by as bagman and muscle for New York City's unscrupulous district attorney. Decimal takes no pleasure in this kind of civic dirty work. He'd be perfectly content alone amongst his books. But this is not in the cards, as the DA calls on Dewey for a seemingly straightforward union-busting job.What unfolds throws Dewey into a bloody tangle of violence, shifting allegiances, and old vendettas, forcing him to face the darkness of his own past and the question of his buried identity.With its high body count and snarky dialogue, The Dewey Decimal System pays respects to Raymond Chandler, Dashiell Hammett, and Jim Thompson. Healthy amounts of black humor and speculative tendencies will appeal to fans of Charlie Huston, Nick Tosches, Duane Swierczynski, Victor Gischler, Robert Ferrigno, and early Jonathan Lethem.Nathan Larson is best known as an award-winning film music composer, having created the scores for over thirty movies such as Boys Don’t Cry, Dirty Pretty Things, and The Messenger. In the 1990s he was the lead guitarist for the influential prog-punk outfit Shudder to Think. This is his first novel. Larson lives in Harlem, New York City, with his wife and son.",
  "genres": [
    "Fiction",
    "Mystery",
    "Dystopia",
    "Science Fiction",
    "Thriller",
    "Noir",
    "Post Apocalyptic"
  ],
  "author": "Nathan Larson",
  "average_rating": "3.13",
  "url": "https://www.goodreads.com/book/show/10127040-the-dewey-decimal-system"
}