{
  "title": "Long Goodbye: The Deaths of Nancy Cruzan",
  "description": "As the trial over her fate rages in a stately old courtroom in southwestern Missouri, the unmistakable voice of Ted Koppel tells the nation about Nancy Cruzan \"This is, at one and the same time, one of the simplest and one of the most complicated stories with which we have ever dealt.\" Long The Deaths of Nancy Cruzan follows an ordinary familys extraordinary journey to the United States Supreme Court. The book looks behind the scenes at the painful human cost exacted in a highly public legal battle. It is the true story of an American tragedya tragedy that could visit any of us in an instant. On a black January night Nancy Cruzans 20-year-old Rambler flies off the road and travels the length of two football fields before flipping to a stop. Nancy is thrown out face down on the cold ground, apparently dead. But not quite. Five years later, Nancy has not emerged from her coma, and her family makes the grim request that the state hospital remove Nancys feeding tube, which the family authorized years before when hope remained. But the state refuses, and the battle begins. Before the battle is over, powerful forces in society will team up to oppose the familyincluding the Missouri Attorney General, Missouri Governor John Ashcroft, United States Solicitor General Ken Starr, and the U.S. Conference of Catholic Bishops. Near the end, protestors from around the country converge on Missouri, and attempt to storm the hospital. Their fight reaches its climax, and resolution, shortly after midnight on a bitter cold Christmas Day. This blue-collar family keeps one goal from! beginning to end  trying to do what they know in their hearts their loved one would want them to do. In the process, they help to raise the consciousness of a nation, and \"free countless Americans of some of the fears attending death,\" according to the New York Times.",
  "genres": [
    "Memoir",
    "Nonfiction"
  ],
  "author": "William H. Colby",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/2055.Long_Goodbye"
}