{
  "title": "John Wayne: My Life With the Duke",
  "description": "The Big Trail, The Longest Day, The Green Berets, True Grit... These are movies synonymous with America, movies that formed many Americans' visions of their country. And John Wayne has formed many Americans' ideas of themselves for themselves and the world. No one has had as great an impact on American films.The year 1987 is the 60th anniversary of John Wayne's entry into film-making. And Pilar Wayne, his wife of twenty-five years, breaks her long silence about their life together in one of the most revealing star biographies ever written. In a loving portrait about their sometimes wonderful, sometimes stormy life together, Pilar Wayne sets the record straight about John Wayne, more than eight years after his death and in response to numerous others' false accounts misrepresenting this amazing man.Here is the story of the most popular figure in films the world has ever known: His life before he met Pilar Pallette, Peruvian film star and founder of a Peruvian Theater Group, his two previous marriages, and his liaison with the great Marlene Dietrich. Here is Duke the family man, with his and Pilar's three beautiful children, together with his complex relationships with children from his first marriage. Here is the political Wayne, his opinions and cherished beliefs, which many readers will recognize as their own, epitomized in the movies he made. Here is the actor on screen, off screen, and behind the scenes, with his friends, John \"Pappy\" Ford, Henry Fonda, Bogart and Bacall, Ronald Reagan, and many others. Here is John Wayne, the man and the myth - but also the man behind the myth - in his own words, recounted by the woman who loved him and knew him best. John Wayne: My Life with the Duke is a tribute to legendary, larger-than-life figure of American culture and film history.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "Film",
    "Biography Memoir"
  ],
  "author": "Pilar Wayne",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/2054188.John_Wayne"
}