{
  "title": "The Concrete Killing Fields",
  "description": "Gripping and gnawing; fascinating and funny; mesmerizing yet motivating! Have you ever wondered ... Why we still have so many homeless people on the streets? Why so many people with mental illness, homeless or not, are in jails or prisons? Why so many people are such strong supporters of President Bill Clinton, and/or Hillary?You need to wonder no longer. Pat Morgan has the answers. With her gift of story-telling, deep sense of compassion, and rich Southern sense of humor, Pat Morgan takes you on a ride ... a kaleidoscope of adventures that few ever experience.From the cotton fields of Arkansas to the concrete killing fields of Tennessee to the Presidents box at the Kennedy Center you will open your eyes, your heart and discover that it is never too late to live out your dreams.To read Pat Morgan's The Concrete Killing Fields is to travel with those our nation has left behind. In bravely revealing her own journey alongside our nation's homeless men, women and children, Pat helps us understand both how we can help them and how we can learn from them. Her own assessment of that journey provides a job description for all those who sincerely want to make a difference in the lives of our country's homeless population. Thanks, Pat, for the gift of this book and for your incredible honesty.Fred Karnas, Social Investment Officer, Kresge Foundation, former Executive Director of the National Coalition for the Homeless, former Interim Director of the U.S. Interagency Council on Homelessness, and former Deputy Assistant Secretary for Special Needs Programs, U.S. Department of Housing and Urban DevelopmentPat Morgan found her calling in the basement of Calvary Episcopal Church in Memphis Tennessee where she discovered the invisible people the homeless. She hadn t set out to become an expert on homeless people; she hadnt planned on working in Washington DC; and she hadnt planned on finding the missing healing ingredient that she needed.As a political insider, part policy maker and confessed political activist and junkie, Pat Morgan was the fly on the wall with a ringside seat. Failing at picking cotton as a young girl, she discovered that what she was good at picking was smart people and mentors to guide her.I'd wept when nobody could see me and laughed when everybody could. I'd mourned more than I ever expected to mourn and I'd danced every chance I got. I' d like to think I hadn't cast away stones, but the truth is that I' d cast a lot of stones and gathered up a few more to cast at the barriers to accessing the system. Pat Morgan, from The Concrete Killing FieldsGet ready for an intense glimpse into a lifetime of stories-stories of people you have heard of and stories from those who are invisible all waiting to be told.Readers, be warned! Pat s must tell testament is compelling and contagious, relentless and raw, inspired and inspiring! Read and digest The Concrete Killing Fields. You will not remain the same.The Reverend Dr. Douglass M. Bailey, former rector of Calvary Episcopal Church (Memphis), President and founder, Center for Urban Ministry, Inc., Winston-Salem, North Carolina",
  "genres": [],
  "author": "Pat  Morgan",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/20543847-the-concrete-killing-fields"
}