{
  "title": "The Fake Mate",
  "description": "Two wolf shifters agree to be fake mates but unexpectedly find something real in this steamy paranormal romantic comedy by Lana Ferguson. Mackenzie Carter has had some very bad dates lately. Model train experts, mansplainers, guys weirdly obsessed with her tail—she hasn’t had a successful date in months. Only a year out of residency, her grandmother’s obsession with Mackenzie finding the perfect mate to settle down with threatens to drive Mackenzie barking mad. Out of options, it feels like a small thing to tell her grandmother that she’s met someone. That is, until she blurts out the name of the first man she sees and the last man she would ever date: Noah Taylor, the big bad wolf of Denver General. Noah Taylor, interventional cardiologist and all around grump, has spent his entire life hiding what he is. With outdated stigmas surrounding unmated alphas that have people wondering if they still howl at the moon, Noah has been careful to keep his designation under wraps. It’s worked for years, until an anonymous tip has everything coming to light. Noah is left with two options: come clean to the board and risk his career—or find himself a mate. The chatty, overly friendly ER doctor asking him to be her fake boyfriend on the same day he’s called to meet the board has to be kismet, right? Mackenzie will keep her grandmother off her back, and Noah will get a chance to prove he can continue to work without a real mate—a mutually beneficial business transaction, they both rationalize. But when the fake-mate act turns into a very real friends-with-benefits arrangement, lines start to blur, and they quickly realize love is a whole different kind of animal.",
  "genres": [
    "Romance",
    "Fantasy",
    "Paranormal",
    "Omegaverse",
    "Audiobook",
    "Paranormal Romance",
    "Contemporary"
  ],
  "author": "Lana Ferguson",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/205429170-the-fake-mate"
}