{
  "title": "Speeches and Writings 1832–1858",
  "description": "The works of Abraham Lincoln preceding the famous Lincoln-Douglas debates illuminate the political career of one of our most courageous presidents and reveal his extraordinary gifts as a writer. Covering the years 1832 to 1858, this Library of America volume contains 240 speeches, letters, drafts, and fragments that record his emergence as an eloquent anti-slavery advocate and defender of the Constitution.From the beginning, Lincoln’s career and the style of his writing nurtured each other. During his years as a lawyer, he argued hundreds of cases before judges and juries. As a stump speaker, he became familiar with the ebb and flow of public sentiment. He never spoke down to the “common people” and his engaging idiomatic style is free of irrelevant ornamentation and resounds with the wordplay, sarcasm, and self-mockery of frontier humor as well as with the cadences of the Bible. His speeches and letters echo the political philosophy of and his “beau ideal of a statesman” Henry Clay and the rhetoric of Daniel Webster, while reflecting the ambition of a resolute politician who hoped to be “truly esteemed by my fellow men.”His private letters show how much Lincoln learned about politics as a stalwart of the Illinois Whigs in the 1830s and 40s—how to measure his support, to form alliances, and to avoid divisive quarrels. His public writings reveal his abilities as a party spokesman and orator, equally adept at articulating positions and ridiculing opponents. Included are his speech in Congress attacking the war against Mexico, his fervent call before the Springfield Lyceum for a reverent obedience to the law, and the satiric “Rebecca” letter that nearly involved him in a duel with its enraged target. There are in addition more personal letters and poems that further testify to the complexities of his character.The renewed threat of slavery’s expansion into the territories transformed Lincoln’s political life in 1854. This volume includes several speeches on the subject, notably from his 1858 Senate race against Stephen A. Douglas, along with the complete texts of their seven debates. The exchanges are marked by personal jibes, accusations of falsehood, appeals to human sympathies and racial prejudices, and profound disagreements on whether the spread of slavery was merely a local question or one that imperiled the future of free government. Still the most famous confrontation in American political history, the debates have the tense drama of two powerful minds disagreeing with all the intensity that characterized mid-nineteenth-century American democracy.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Biography",
    "Civil War",
    "American History",
    "Essays"
  ],
  "author": "Abraham Lincoln",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/20549.Speeches_and_Writings_1832_1858"
}