{
  "title": "Haunt Your Heart Out",
  "description": "A dashing ghost hunter and the bookseller who made up the ghosts he’s chasing wind up entangled in more ways than one in this steamy contemporary romance from the author of Text Appeal, perfect for fans of Ashley Poston and Chloe Liese.Homebody Lex McCall loves her sleepy Vermont town and quiet bookstore job. After her family, friends, and exes all moved away to seek futures elsewhere, Lex set one rule: no dating tourists, newcomers, or anyone else who is bound to leave her behind. When the bookshop owner, eager to offload the supposedly haunted building, offers to sell the store to Lex at an unbeatable price, Lex jumps at the chance to further put down roots.Then handsome stranger James stops by the bookstore. Lex assumes he’s just another tourist passing through, but it turns out he’s part of a ghost-hunting documentary crew that’s looking into the many “verified” ghost stories in town. Lex can’t resist getting involved—especially because these so-called ghosts are actually made up stories from Haunted Happenings, her hobby vlog from a decade prior. Worried her ghost-faking secret will get out and ruin her chance to buy the store, she tampers with the ghosthunters' research and skews the results. After all, James’s stay is only temporary and her career dreams come first.But as they spend more time together, Lex realizes she’s falling for James. Worse, there’s more at stake than her simply being found out and losing his affection: his mission isn’t as frivolous as it seems, and her interference may cost him much more than a spooky story. This not-quite-ghost-story is sure to delight Gilmore Girls fans and anyone who loves flirty romances with a little extra spirit.",
  "genres": [
    "Romance",
    "Halloween",
    "Contemporary",
    "Paranormal",
    "Adult",
    "Contemporary Romance",
    "Holiday"
  ],
  "author": "Amber Roberts",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/205438870-haunt-your-heart-out"
}