{
  "title": "Eight The Hard Way",
  "description": "Eight thrilling stories from eight masters of suspense. Inside this anthology you'll find a mix of classic mystery and suspense, full-blown action, and blood-curdling suspense. There are tales of vengeance and redemption, good versus evil, and more than a few laugh-out-loud moments. The ebook edition also includes a fully hyperlinked Table of Contents, which gives you a brief synopsis and page count for each story - making it easy to choose what you want to read next. You'll also find a short bio for each author, along with a web link where you can find out more. ~~ Nick StephensonPaydown - by Nick Stephenson. When a high-flying Wall Street investment banker is found brutally killed, what started out as a simple fraud case turns into expert criminologist Leopold Blake's first ever murder investigation. As the glamor of Wall Street is stripped away by a series of catastrophic discoveries, Leopold will have to decide how much he is prepared to risk in order to uncover the truth - and whether it's a price he's willing to pay. Loose Ends - by David Vandyke. There's not much left that can surprise private investigator California \"Cal\" Corwin any more, especially since the accident. But after a young girl is kidnapped and feared murdered, Cal is drawn into a deadly game of cat and mouse that will stretch her skills to the ultimate limit. With danger at every turn and with more questions than answers, Corwin must scour the streets of San Francisco to track down the culprits before it's too late - and the clock is ticking...  Mr. Mockingbird Drive - by Robert Swartwood. Julio and Tyshawn are far from professional thieves, but they get by. After weeks spent researching the perfect mark, the boys are ready to strike - and the payout is going to be unbelievable...Mr. Mockingbird Drive is a cleverly deceptive piece of flash fiction. The story first featured in Needle: A Magazine of Noir, Winter 2012. Ladies Weekend - by Ryan King. A trip to the Gulf Shores with her three sisters-in-law was not exactly Cathy's idea of a good time. With a dark secret to protect, a weekend stuck with the meddling Biddle sisters might have been too much to bear - but, thankfully for Cathy, there's nothing a little \"medicine\" can't fix...This delightfully twisted story was first published in 2012. Veritas: Concubine - by R.S. Guthrie. How far would you go to find the truth? Shale Veritas is not his real name, but that's not important. What's important is why he's taken an interest in you - and what you've done to deserve it...This dark, atmospheric tale of revenge, justice, and redemption is not for the faint-hearted. You have been warned. Divide and Conquer - by Kay Hadashi. Nobody ever told June Kato that babysitting could be such hard work ... As a world-class neurosurgeon, June is used to dealing with high-pressure situations. But when a trio of violent thugs invade her home while her four-year-old nieces are staying over, nap time suddenly takes on a whole new meaning. A thrill-ride from start to finish. Recidivist - by Alan McDermott. Something needs to be done about Steven Howe. Even though he's yet to see his twelfth birthday, after 97 arrests the police and social services have had enough. Forced to attend a state-sponsored retreat for troubled youths, Steven is about to find out just how far the government is prepared to go to meet their targets - starting with him. Return of the Bride - by Micheal Maxwell. Tradition has it that Al-Qurnah is the site of the Garden of Eden. But for Phillip Sear, a man who has lived with sin his entire life, it has an entirely different significance. On a journey to redeem himself for a lifetime of selfish choices, Sear will finally learn how to keep his promises - but at what cost?",
  "genres": [
    "Mystery",
    "Short Stories",
    "Thriller",
    "Fiction",
    "Crime",
    "Mystery Thriller",
    "Amazon"
  ],
  "author": "Nick Stephenson",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/20555259-eight-the-hard-way"
}