{
  "title": "Shifter Seduction Boxed Set",
  "description": "Defying Pack Law – Eve LanglaisDana fled her pack and their laws to live on her terms, but the price of defiance was her happiness. Could it be that now older and wiser, she can accept the Lycan menage way of life? Or will jealousy and fear send her running again?Surrounded by Pleasure - Mandy HarbinAttorney Krista Owens hopes tolose some inhibition and maybe, finally, her virginity, but she doesn’t know the men she’ll be staying with are mountain lion shifters whose instinct to mate with any available woman can turn deadly, or that the moment Toby Woods sees her his feral side will stop at nothing to have her.Juneau Heat – Tressie LockwoodShiya’s been chatting up Birk Rider online and agrees to meet him in face-to-face in Juneau, Alaska. When Birk suggests a threesome with her taking on him and his buddy Kotori Munro, she can’t say no to the sexy bear shifters, even if her family of hunters wants them dead.Lycan Lover – S. K. YuleA party turns deadly, and Karen is stalked into the dark night. Ancient lycan, Anthony, saves her, and an instant, undeniable chemistry ignites between them. But will the fire last after Karen sustains a bite from a rogue, and she finds out Anthony is something she thought only existed in horror stories?Three Fur All - Crymsyn HartOctober has escaped her kidnappers only to run into the arms of two very sexy wolves. The more Mika and Elliot fight their growing attraction to her, the more they desire to show October a howling good time. Together they will risk everything to save the woman they love before everything explodes around them.Theirs to Claim - LeTeisha NewtonZelina thought she was sworn off dating--until she woke up between a naked set of twins. Rion and Quin are determined to prove that Zelina is their mate in any way they can. If that means keeping her in bed--under them, over them, or between them--so be it.",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Menage",
    "Anthologies",
    "Collections"
  ],
  "author": "Eve Langlais",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/20555780-shifter-seduction-boxed-set"
}