{
  "title": "Students Can Help Keep Schools Safe: A Student/Teacher Guide to School Safety and Violence Prevention",
  "description": "Students Can Help Keep Schools Safe is a school violence prevention book for students 3-8th grade. This book will teach students about what to do if they encounter an intruder in the building or know of student planning violence.Students Can Help Keep Schools Safe: A Student’s/Teacher’s Guide to School Safety and Violence Prevention is a much needed guide to promote school safety and violence prevention. This book directs students on recognizing potential danger and preparation if such an event occurs. The book offers students a pro-active approach to violence prevention. As a supplement, staff members are supported by a teacher’s guide for educators, and bonus student journal section. Parents and educators will appreciate the simple, non-threating language that creates a school safety message that every child must hear. This book has the potential to save many lives.The Bad Guys is the counterpart to Students Can Help Keep Schools Safe. The Bad Guys is for readers in preschool to 3rd grade.Audio Link to The Bad Guys:www.youtube.com/watch?v=zvFEytR1mwQ‎Discounts available to school districts in the United States.what is violence, school violence, violence, safety at school, school safety, gun violence, school safety,elementary books, books for preschool teachers, parenting, parenting books, how to keep your kid safe, violence, shootings, sandy hook, violence prevention, safety at school,books for teachers, safety and security, help for violence,book for preschoolers, safety books,violence prevention books, violence school, safety at school, school violence, school safety, violence in schools, causes of violence, school, school and violence, school shooters, types of violence, gun violence, stop the violence, violence in America, youth violence, youth violence prevention, violence prevention, what is school violence, how to prevent school violence school violence #what is violence#school violence#violence#safety at school#school safety#gun violence#school safety#elementary books#books for preschool teachers#parenting# parenting books#how to keep your kid safe#violence, shootings, sandy hook #violence prevention#safety at school#books for teachers#safety and security#help for violence",
  "genres": [],
  "author": "Julie K. Federico",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/20554399-students-can-help-keep-schools-safe"
}