{
  "title": "Tame a Wild Heart",
  "description": "Librarian's note: This is an alternate cover edition for ASIN: B005JFMPYU.Catherine Evans fell in love when she was three years old, head-over-heels, forever kind of love. The very first moment she saw twelve-year-old Duncan McKenzie, she told God and her pony that she was going to marry that boy. He was handsome. He was kind. He was strong and smart and all the good things a boy should be. For thirteen years she loved him with every beat of her heart. And on her sixteenth birthday he walked away from her father's ranch, and from her. He didn't look back over his shoulder. Not even once. And from that day forward, Catherine Evans swore off all men. Her heart turned to stone, her will to iron, and her vow to God changed. She'd run her father's ranch. She'd succeed. She'd survive. And she would never, ever love another man as long as she lived. Duncan McKenzie left the ranch ten years ago, desperate to escape temptation in the form of a budding young lady too innocent to claim for his own. But Catherine's frightened father summons him home. The ranch is under attack and the old man's stubborn daughter refuses to seek help. Duncan left a sweet young girl behind a decade ago. He returns to a defiant siren, a woman whose heart is as wild as the land she would sacrifice her life to protect. When Catherine's father coerces her into marrying Duncan, the fire in her eyes spells trouble, but it's the kind of trouble Duncan has no desire to resist. Marriage is the only way he can protect her. Especially when Duncan's own past comes calling in the form of one extremely dangerous and vengeful outlaw, Catherine's cowardly enemies want the ranch badly enough to kill for it, and his reluctant bride is very much in their way.",
  "genres": [
    "Romance",
    "Westerns",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Western Romance",
    "Amazon"
  ],
  "author": "Cynthia Woolf",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/20558727-tame-a-wild-heart"
}