{
  "title": "Linnets and Valerians",
  "description": "The four Linnet children: Nan, Robert, Timothy and Betsy are sent to live with their strict grandmother while their father travels to Egypt. Locked away in separate rooms as punishment by their ruthless grandmother, the Linnets feel at once that their new life is unbearable—and decide to make their escape—out of the house, out of the garden and into the village. Commandeering a pony and trap, the children and their dog are led away as the pony makes his way nonchalantly home. The pony’s destination happens to be a house that belongs to their gruff but loveable uncle Ambrose. The kindly uncle Ambrose agrees to take them under his wing, he educates them and encourages them to explore Dartmoor, letting the children have free rein in his sprawling manor house and surrounding countryside.Befriending the collection of house guests, including an owl, a giant cat, and a gardener, Ezra, who converses with bees, and getting to know the miscellaneous inhabitants of the village, the four siblings discover a life in which magic and reality are curiously intermingled and evil and tragedy lurk never far away. Then stumble upon the eccentric Lady Alicia Valerian, who seems to have lost her family. And then the real fun begins! The Linnets start their search for the missing Valerians. But the village is under a spell of the witch Emma Cobley. Can the children lift the spell and restore happiness to the villagers? Or will they be thwarted by evil Emma Cobley and her magic cat?This charming story beautifully depicts early twentieth century English country life while conjuring an air of magical adventure. It is full of vivid characters, battles between good and evil and wonderful spell-binding moments.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Childrens",
    "Classics",
    "Historical Fiction",
    "Young Adult",
    "Historical"
  ],
  "author": "Elizabeth Goudge",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/205616.Linnets_and_Valerians"
}