{
  "title": "The Musician and the Monster",
  "description": "Music says things words never can. I love you. I miss you. I’m sorry I killed you.Every night, Ceridwen Kinsley plays music on her rooftop for the spirit of her dead mother. A peaceful if odd ritual, until she witnesses a murder by something not quite human. The monstrous encounter earns her notoriety within the city and a visit from the reclusive Lord Protector Drystan Winterbourne.Charged with protecting the backwater city of Teneboure by the king, Drystan is failing at his task, and he can’t afford another slip up. But when fate and the very monster he means to conquer bring Ceridwen to his notice, he seizes the opportunity and presents her with an offer: play music for him at his manor in exchange for the money her impoverished family desperately needs. Music eases the strain of his magic, and who better to hire than the woman whose tunes he secretly listens to at night?At first, Ceridwen is put off by Drystan’s unkempt appearance and harsh demeanor, not to mention the odd ailment that plagues him. But as he embraces her passion for music and she draws the recluse out of his lonely tower, the two develop an unlikely attachment. Class lines begin to blur as fearful indifference shifts to unexpected desire, and Ceridwen yearns to help Drystan subdue the monster as well as provide for her family. However, the monster prowling the night isn’t their only enemy, and as terrible secrets come to light, protecting those they love may risk their lives and their hearts.This retelling of Beauty and the Beast incorporates themes and motifs from Phantom of the Opera, and is set in a gaslamp fantasy world with strong gothic vibes. It should appeal to fans of romantic and atmospheric retellings and fairy tales by authors such as Hannah Whitten, Tessonja Odette, and Stephanie Garber.While this is book 4 in the Reimagined Fairy Tales series, it can be read as a standalone.",
  "genres": [
    "Fantasy",
    "Romance",
    "Retellings",
    "Romantasy",
    "Fantasy Romance",
    "Gothic",
    "Historical"
  ],
  "author": "Megan Van Dyke",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/205590092-the-musician-and-the-monster"
}