{
  "title": "Harbour Street",
  "description": "This is a previously-published edition of ASIN B00FWPNH08.\nHarbour Street is the sixth book in Ann Cleeves’ crime novel series VERA – which is a major TV detective drama starring Brenda Blethyn on ITV. As the snow falls thickly on Newcastle, the shouts and laughter of Christmas revellers break the muffled silence. Detective Joe Ashworth and his daughter Jessie are swept along in the jostling crowd onto the Metro. But when the train is stopped due to the bad weather, and the other passengers fade into the swirling snow, Jessie notices that an old lady hasn’t left the train: Margaret Krukowski has been fatally stabbed as she sat on the crowded train. Nobody, including the policeman himself, sees the stabbing take place. Margaret’s murderer is seemingly invisible; her killing motiveless. Why would anyone want to harm this reserved, elegant lady? Arriving at the scene, DI Vera Stanhope is relieved to have an excuse to escape the holiday festivities. As she standing on the silent, snow-covered station platform, Vera feels a familiar buzz of anticipation, sensing that this will be a complex and unusual case. Soon Vera and Joe are on their way to the south Northumberland town of Mardle, where Margaret lived, to begin their inquiry. Then, just days later, a second woman is murdered. Vera knows that to find the key to this new killing she needs to understand what had been troubling Margaret so deeply before she died – before another life is lost. She can feel in her bones that there’s a link. Retracing Margaret’s final steps, Vera finds herself searching deep into the hidden past of this seemingly innocent neighbourhood, led by clues that keep revolving around one street . . . Why are the residents of Harbour Street so reluctant to speak? Told with piercing prose and a forensic eye, Ann Cleeves’ gripping new novel explores what happens when a community closes ranks to protect their own – and at what point silent witnesses become complicit. Also available in the Vera Stanhope series are The Crow Trap, Telling Tales, Hidden Depths, Silent Voices and The Glass Room. Ann Cleeves’ Shetland series (BBC television drama SHETLAND) contains five titles, of which Dead Water is the most recent.",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Audiobook",
    "British Literature",
    "Mystery Thriller",
    "Detective"
  ],
  "author": "Ann Cleeves",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/20558110-harbour-street"
}