{
  "title": "Submissive Milking",
  "description": "Angelica is an experienced submissive looking for a new master. When she finds Cameron and clicks with him, she isn’t so certain he is the right master for her because he is new to the game. But when Cameron forces her body to lactate she begins to see possibilities in her new dom. Pushing her boundaries in her private and public life makes her rethink her decision… This is a 21,000 word novella intended for adult audiences.Content features graphic sex, erotic lactation, group sex, adult nursing relationships, lesbian sex, and other depictions of adult sexuality. Explicit language and adult only nodded once. “Good. That’s better. I expect more of you,” he said as his voice modulated a bit. He paused and looked her up and down, admiring her body. She had taken extra care to trim back the length of her black curls and carefully shape them. While she didn’t have perfect body Angelica knew she attracted more than her fair share of male—and occasionally female—gazes of admiration. Maybe her belly was a little bit more rounded than she liked and her breasts were a little too large for her frame but she didn’t have anything to be ashamed of. A small smile played at the corners of Cameron’s mouth. “Are you ready to play?” he asked as he slowly unbuttoned his shirt.Angelica couldn’t stop her smile as he exposed his chest and the light brown hair that was scattered across his skin. He was already barefoot and when he casually dropped his shirt to the floor he was wearing only a pair of black pants. She nodded. “Yes. I’m ready.”He grabbed her by the wrist and gently led her to the bedroom. “Is there a certain game you would like to play?” he asked. His manner had changed back to a much more neutral stance now that she had been properly disciplined and had taken her punishment willingly.“Aren’t you supposed to be the one surprising me?” she asked a little bit impertinently.",
  "genres": [],
  "author": "Elliot Silvestri",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/20557816-submissive-milking"
}