{
  "title": "From the Ashes",
  "description": "Follow Harold Lancaster, a retired San Francisco police officer, as he witnesses the devastation of humanity after a worldwide viral terrorist attack that will change the course of history forever!  Harry learns that he and his family, as well as a portion of what remains of the population, is immune to the mutated virus that has been unleashed. During forced relocation, his young nephew is separated from his parents and left in a world now ruled by anarchy and filled with horrors beyond comprehension. Harry's unshakable resolve, his only reason to exist, is to reach his nephew and reunite with the rest of his family. Along with a small band of friends who refuse to leave his side, and after assisting in establishing a safe haven on Angel Island in the San Francisco Bay, Harry embarks on an arduous twenty-three hundred mile trek across a ravaged country.  Although Harry faces the infected and unspeakable horrors, he also discovers incredible acts of courage and resolve by those who remain among the Survivors of the Dead!  FROM THE ASHES begins Harry's journey with at least two more books in the series forthcoming. Book Two, THE ROAD UNKNOWN, coming fall of 2014!  EDITORIAL REVIEW:  \"Tony Baker brings a wealth of real world experience, as well as a commitment to serving others, into the midst of a zombie apocalypse that shatters society as we know it. When the chips are down we should all be so lucky as to have “Dirty Harry Lancaster” show up on our doorstep. Baker mixes humor and horror in a lively tale of apocalyptic survival, always with the highest ideals, but often compromised by circumstance. This debut novel shows promise for a long and entertaining series that should stand out from the crowd of zombie fiction.  \"It is truly humbling that Tony chose to base his apocalyptic adventure on the scenario introduced by the Sovereign Spirit Saga. It was an honor to give him permission to quote and refer to characters and events described in my series. It is my sincere hope that readers who enjoyed my books will be equally entertained by Tony Baker’s “Survivors of the Dead: Out of the Ashes” and future works in this series.\"  David P. Forsyth Author of The Sovereign Spirit Saga",
  "genres": [
    "Zombies",
    "Horror",
    "Fiction"
  ],
  "author": "Tony Baker",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/20560501-from-the-ashes"
}