{
  "title": "To Unshakable Bliss: A Techie's Adventure",
  "description": "Who am I? What is the meaning or purpose of my life? These were the questions that sparked one woman’s extraordinary odyssey to enduring peace. In her gripping debut novel \"To Unshakable Bliss,\" author Serene Rishi invites you to question the nature of your own identity.Rishi introduces us to Qayum, a former star in the tech world rebuilding her career as an author of children's tales. Despite the worldly success, there is a persistent restlessness within Qayum. She struggles to reconcile external validation from work and wealth with inner purpose. The more thrills she chases, the quicker euphoria evaporates.On a road trip along California’s Pacific Coast, watching ethereal sunsets dissolve into darkness, she comprehends life’s transiency. She realizes the volatility of happiness while on life’s Ferris wheel of random ups and downs. Just then, the plot thickens. Befriending an old classmate in Denmark, Qayum remembers her carefree spiritual childhood self. Her friend's unwavering faith in an eternal soul inspires Qayum to conduct her own investigations.She unravels the world’s illusory nature through varied perspectives - from neuroscience, psychology, and Stoic philosophies to the Upanishads and Bhagavad Gita. Back on that homeward-bound flight, scientific theories on consciousness are explored, exposing parallel themes from millennia-old scriptures. Profound implications set in - mystical visions across eras and cultures point to a fundamental reality underlying existence itself.What our ambitious protagonist, and perhaps you too, have sought in relentless pursuits already dwells within. Qayum realizes this ever-present kingdom, once unveiled, holds fulfillment beyond imagination's scope. The harder question how does one remain engaged in life’s theater while rooted in awakened truth?Join Qayum's liberating adventures across breathtaking terrains and ancient spiritual tributaries. From Zanzibar's spice markets to Copenhagen's quaint cafes to California's majestic redwoods, uncover fresh joy and wisdom. Alongside vivid global backdrops, treasured contemplations from spiritual and scientific visionaries through history are instilled.",
  "genres": [],
  "author": "Serene Rishi",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/205649912-to-unshakable-bliss"
}