{
  "title": "Philanthropic Ways",
  "description": "They were three little church girls, veritable Angels that had been brought up sheltered from the big bad world outside. But when they became teenagers they parted company and went their separate ways. Avarel takes the path that leads her to total separation from God and while she acquires great fame and wealth, she eventually learns that the needs of the spirit are of far greater importance than those of the flesh as she arrives at a place in her life where only God can restore her peace. Carly's chosen path pushes God to the periphery of her life and she struggles through challenges of her own making. And as she arrives at a place of desperation in her life where only He can restore her joy, it dawns on her that God has never stopped loving her, but that he has done so from a distance to where she has relegated Him, her choices having limited His hand in her life. Amelia chooses to stay put at Born Again Church of God, vowing never to leave home and while her life has not been free of persecution, she has been blessed with true joy and kept strong by God's grace. God has been good to Amelia, but He made her a promise many years ago, the fulfilment of which she feels is way overdue. She becomes weary with waiting and struggles to maintain her grounding as her trust in God's faithfulness is eroded and she is pushed to the edge - a place of spiritual decline where only His love can reach and save her. But God has a plan for redemption which will see all Three Little Angels return to the place of love that they had once all called \"home\" - Born Again Church of God - where it had all begun but they each must make the right choice if they are to be truly redeemed. In keeping with Eugenie Laverne Mitchell's unique writing style, there are many interesting characters that come into play in this heart-warming novel where the main focus is on love and as the title suggests philanthropic love will play a strong role in this colourful story.",
  "genres": [
    "Christian",
    "Fiction",
    "Christian Fiction"
  ],
  "author": "Eugenie Laverne Mitchell",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/20564949-philanthropic-ways"
}