{
  "title": "Titanium Security Series Box Set: Volume I",
  "description": "Now you can get the first three books of the Titanium Security Series in one bundle!  Ignited: When her father is murdered by a Taliban cell in the tribal regions of Pakistan, Khalia Patterson reluctantly steps into his shoes to carry on the legacy of Fair Start Foundation, a non-profit group dedicated to furthering the education of girls. There she meets Hunter Phillips, the ex-SEAL and head of her Titanium security team, and quickly learns that coming to Pakistan might prove to be a deadly decision.  Battling demons of his own, Hunter grudgingly leads Khalia’s protective detail as a favor to his boss. From their first meeting it’s clear she’s going to be trouble, and that the cell that killed her father is hell bent on taking her out as well. Keeping her alive is one of the toughest assignments he’s ever faced, yet through one harrowing situation after another she continually impresses him with her strength and inner courage. Even though he fights his feelings for her, it’s a losing battle. And when the job is over, he doesn’t know how he’ll let her go.  Singed: She walked away from him once…  Struggling to live with her decision to walk away from the only man she ever loved and watching helplessly while her brother succumbs to his battle with severe PTSD, NSA analyst Claire Tierney’s life is at an all time low. The final hit comes when she accesses classified information at work that might get her fired. Instead, she’s assigned to a joint taskforce charged with hunting down a Taliban assassin planning an attack on American soil, and finally has something productive to focus on. Until she meets the rest of the team and learns she’ll be working with the last person on earth she wants further contact with; her ex. She knows letting him go was the biggest mistake of her life, but just when she thinks things can’t get any worse, new intel points to the assassin’s intended target. Her.  This time he’s not letting her go…  As a former Special Forces Master Sergeant and second-in-command of his Titanium Security team, Gage Wallace can handle anything, except being forced to go through life without Claire. When she abruptly walked out on him six months ago, his whole world caved in. It’s clear she’s still determined to keep her distance, but when she’s named a possible target of the very cell they’re trying to dismantle, Gage will stop at nothing to ensure she’s safe. When tragedy destroys Claire’s defenses and the explosive desire between them ignites once more, this time he’s not letting her go. Too late they discover that the danger confronting them is far greater than anyone ever realized, and it’s a race against time to stop a terrorist from unleashing hell on them all.  Burned: A woman with a dark past…  Forced into hiding after her NSA-sanctioned task force lands on a terrorist cell’s hit list, cryptologist Zahra Gill must rely on the skill and experience of her ex-Special Ops Titanium Security teammates to keep her safe—including former Force Recon Marine Sean Dunphy. The impossibly sexy man has the unnerving ability to shatter her concentration by simply walking into the same room. Even though she’s sworn to keep him at a distance, his charm and protectiveness weaken her resistance. Drawn to his strength and magnetic sensuality, she finally gives in to the passion she’s denied herself for so long…even though she knows she might lose her heart in the process.  The man strong enough to win her trust…  Sean’s had his eye on the guarded, proud analyst from the first day they met.",
  "genres": [
    "Romantic Suspense",
    "Military Fiction",
    "Military Romance",
    "M F Romance",
    "Romance",
    "Mystery Thriller"
  ],
  "author": "Kaylea Cross",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/20567211-titanium-security-series-box-set"
}