{
  "title": "Invincible",
  "description": "Publisher’s Note: This is a work of fiction. Names, characters, places, and incidents are a product of the author’s imagination. Locales and public names are sometimes used for atmospheric purposes. Any resemblance to actual people, living or dead, or to businesses, companies, events, institutions, or locales is completely coincidental. Expanded edition, with Annie's POV, 15,000 more words, new twist, more emotion. This is a full length novel, 60,000 words. New Adult Romantic Thriller. This book is intended for readers 18+.I’ll be honest with you—I’m no hero. Sure, the media tries to brand every Navy SEAL as some kind of Batman dressed in cammies. There’s even a line in one of our cadences: Superman is the man of steel, he ain’t no match for Navy SEAL. You’ve seen the movies—we’re infallible, invaluable, invincible. But that night, the one you read about in the papers … all I really wanted to do was get laid. One harmless fuck with an Aruban whore, no strings attached. I picked her out of a lineup—wild, dark hair, long legs and a crooked smile. After she sucked me off, I relaxed back onto the creaky, cum-stained cot, thankful for the blissful moments she gave me when I actually forgot for a second the faces of my buddies who died because I made the wrong call, the tears of the children I couldn’t save, and the eyes of the enemies I slaughtered during their last seconds of life. But before I left, her hazel eyes peered into my soul. She whispered in a distinct Californian accent, “My name is Annie Hamilton. I’m an American citizen. I was kidnapped on spring break five years ago. You’re my last hope. Please save me.” One desperate plea. This wasn’t a Hollywood blockbuster or a New York Times best-selling thriller. I knew this time there was no room for excuses, no margin for errors. I had one chance to put on the cape and be her hero.",
  "genres": [
    "Military Fiction",
    "Romance",
    "Dark",
    "Abuse",
    "Romantic Suspense",
    "New Adult",
    "Contemporary"
  ],
  "author": "Alana Albertson",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/20566499-invincible"
}