{
  "title": "School Nightz",
  "description": "School Nightz is a compilation of the Night School Vampire Hunter Trilogy novellas.Description for each of the novellas (1-3) is below.Night School Vampire Hunter (Novella#1) Fifteen year old Dasheen Bellamy’s world is turned upside down, when she is accused of killing her father and godmother. Dasheen cannot remember the events of the night her world is destroyed, but she feels inside that she is innocent. Due to lack of evidence against her and with no other family, she and her younger brother Jordan, are sent to the mysterious Ame’ Academy, a residential school where all is not what it appears. Soon Dasheen’s world changes again when she meets a group of misfits, who she befriends, a handsome but secretive boy, and learns that she has ancient powers. When Jordan begins to behave strangely and appears frightened, Dasheen realizes that dark forces are after her brother’s soul; and she then uses her new found power to prepare for a fight against the ancient evil. ************** Kindred (Night School Vampire Hunter Trilogy) Novella#2 Dasheen Bellamy…a.k.a. “Angel” and her friends at Ame Academy, a boarding school for preternatural and humans are back, and they are preparing for battle against the dark forces that kidnapped Angel’s younger brother Jordan. Angel had recently discovered that she was a Hunter and that she alone has a special weapon against her enemies, her blood, which is discovered to be toxic to her enemies. Angel is prepared to use her training and all that is at her disposal in order to save Jordan, even if that means joining forces with the strange and mysterious Rafael. Instantly drawn to him at their first meeting; Rafael frightens her, he hints at the secret of having known Angel in a previous lifetime? Can love survive two lifetimes? Angel discovers that she is more than just a Vampire Hunter, and that she plays a major role in an ancient prophecy, which she must fulfill by facing a force so evil that survival is not promised. **************** Redemption (Night School Vampire Hunter Trilogy) Novella#3 Darkness has fallen over Ame’ Academy after Angel plummeted into the gaping twilight of the abyss. Ismet, Bella Donna, Elin and Rafael were now left to pick up the pieces. But those that loved Angel refused to believe she is gone, and so the search for her and the truth begins. Plus the clock is counting down and the Beast has escaped its pit. The group of friends, with the help of unlikely allies must confront an ancient evil, and once again face the heartache of losing someone they love, to save the world from destruction once and for all. The highly anticipated and surprising finale to the Night School Vampire Hunter Trilogy!",
  "genres": [
    "Vampires"
  ],
  "author": "Michelle Cornwell-Jordan",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/20566708-school-nightz"
}