{
  "title": "The Frozen Lake: A Vintage Mystery",
  "description": "Two great houses. One dark secret. A story of aristocratic families and tangled secrets for anyone who can't get enough of Downton Abbey.England, Christmas 1936.For the first time since Alix Richardson's childhood, the great lake is freezing, bringing the promise of skating and a Christmas kept in old-fashioned style in Wyncrag, her grandfather's great house above the lake. But she returns to find the house - and her family - still caught in the icy grip of her iron-willed grandmother Lady Caroline.As the scattered members of the family return from their lives to the winter wonderland of the frozen north - Edwin, the photographer; Saul, the politician; Perdita, the daughter who never knew her parents - so too do others. Across the lake, at Grindley Hall, theatre director Hal Grindley comes home from New York with a secret of his own, to find his brothers all too anxious to relieve him of his share in the family business empire. Michael Wrexham, a young and brilliant aircraft designer, hasn't set foot near the lake since he fell through the ice and almost drowned fifteen years ago, while an enigmatic American film star adds a touch of mysterious glamour to the winter gatherings.Amid the glittering backdrop of winter parties and skating on the lake, both Alix and Hal begin to ask uncomfortable questions - about their families, their pasts and about the two black-shirted men from the south who have come to stay, bringing the long shadows of fascism to this remote corner of England.When one of the Blackshirts is found dead under the ice, the arrival of Special Branch gives urgency to Alix and Hal's inquiries and casts a sinister light on Lady Caroline's long reign at Wyncrag. But neither realises how dark their families' secrets are - and both must work to save a previous generation's tragedy from coming back to haunt them all....An atmospheric, multi-layered story of great families, their eccentricities, and their secrets, set amid a backdrop of the fells, lakes and ancient towns of the English Lake District where the author's family once owned a house like Wyncrag.Elizabeth Edmondson is the author of over 20 novels, including the period novels of espionage and redemption Voyage of Innocence and The Villa Dante and a number of bestselling historical romances under the name Elizabeth Aston.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Christmas",
    "Audiobook",
    "Historical",
    "Historical Mystery"
  ],
  "author": "Elizabeth Edmondson",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/20567257-the-frozen-lake"
}