{
  "title": "Bernie and the Putty",
  "description": "Winner of 15 Awards for Excellence. Dive into a humorous fantasy world unlike anything you have imagined. A world of gods and goddesses who build universes for a living. Are they all-powerful and all-knowing? Well, not exactly... As Bernie graduates from God School, he is thrilled to land his dream job as a builder of universes. His first assignment is to build his own universe. Determined but unsure, bright but without confidence, Bernie forges ahead, only to find problems everywhere. Mysterious asteroids, unexplained volcanoes, shifting continents and more lead him to suspect sabotage. But who could sabotage his universe? Only another god could do that. It’s god vs. god, guile vs. goodness, where only one of them plays by the rules. Bernie must find a way to outwit his vicious foe. If he fails, it will cost him everything. A fascinating tale of good vs. evil and a young hero on a journey of self-discovery in an original, humorous, fantastic wrapper.  Awards & Recognition:*** GRAND PRIZE *** Writer's Digest Self-Published e-Book Awards (2014)*** FINALIST *** Stargazer Literary Awards (2015)*** FINALIST *** Beverly Hills Book Awards (2015)*** GOLD *** eLit Book Awards (2015)*** FINALIST *** Next Generation Indie Book (2015)*** WINNER *** San Francisco Book Festival (2015)*** FINALIST *** International Book Awards (2015)Praise for The Universe Builders:  “…had me hooked from start to finish…I couldn’t put it down.”“This book was fantastic! I was riveted, wanting to know what was going to happen to Bernie.”“…weird, crazy characters that will tickle your funny bone and, at times, tug at your heartstrings.” “…a fascinating tale of good vs. evil and of a young hero on a journey of self-discovery.”“…a mind-bending journey…and a great start to a series.” “Everybody loves an underdog story, and I’m no different.” “This book was just wonderful!”",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Science Fiction",
    "Fiction",
    "Mythology",
    "Science Fiction Fantasy",
    "Magic"
  ],
  "author": "Steve LeBel",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/20566411-bernie-and-the-putty"
}