{
  "title": "At War In The Willows",
  "description": "The FULL Series, all 3 books in a specially priced Trilogy!What chances could you take to keep your true love with you forever? Would you go against the rules of society, your family and risk everything you have ever known? Would you go to any length to save the one you love, even if what must be done could possibly cause their death? The Willows is a resort town run by vampires, werewolves and witches. Here, their true identities are kept secret from humans, and intimate relations between the individual clans are strictly forbidden.When it becomes known that the vampire Amberlyn has fallen in love with the werewolf Kane, the tedious line of their co-existence has been crossed. Caught in the crossfire of this revelation, Drake, the vampire clan leader and Amberlyn’s maker, is killed along with an innocent witch. These deaths spark a series of horrific events, leading to an all out War In The Willows.Unexpected close encounters, bodies ripe with need, and situations beyond their control lead to forbidden relationships. Now, three vampires, a witch, a werewolf and a human must ride along the edges of the rules. They will attempt once unthinkable romantic entanglements despite all those who oppose their relationships, while fighting for their lives as well.With the Willows full of violence and bloodshed, meetings and magic amiss, will the clans ever be able to find peace among them again? Or, will this war destroy the Willows?In Book 1, Amberlyn’s vampire brother, Isaac, always one to kick ass first and deal with the consequences later, kidnaps a witch, Winter. He intends to find out what type of retaliation the witch clan is planning against the vampires and werewolves. In doing so, he finds so much more then he bargained for.By Book 2, Isaac and Winter devise a plan to try to get the Elders of the clans talking peacefully. But, things don’t go as they’d hoped, and the fighting between the clans becomes more devious – deadly. Now, Devin, another vampire of Drake’s making, steps in to help pick up some of the pieces.When Book 3 begins, it is Devin who hides the biggest secret; he’s in love with a local human. In a moment of desperation – of love – Devin sweeps this human, Sara, away to his home in order to keep her out of harm’s way.",
  "genres": [
    "Paranormal"
  ],
  "author": "Kiki Howell",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/20562805-at-war-in-the-willows"
}