{
  "title": "Everything",
  "description": "Love could prove fatal in N.B. Baker’s thrilling debut, Everything. A seductive tale of romance and deception, its twists and turns lead to a shocking finale that proves no secret is left buried forever. Ella Stone hasn’t had it easy. Abandoned by her parents when she was an infant, she was lucky to be raised by her grandparents on their vast ranch in Wyoming. But when they both pass away within a year of each other, Ella is forced to think about the future for the first time in her life.Deciding that her new beginning lies in Detroit with her two best friends, Ella makes the big move. There she meets Hunter, a man whose passion for art immediately fascinates her. Their steamy relationship comes to an abrupt end, however, when she catches him in bed with another woman.Despite Hunter’s seeming inability to take “it’s over” at face value, Ella struggles to move on. While exploring the city, her coincidental run-ins with a man named Chance St. John seem comical at first. That is, until one night when Chance rescues Ella from a brutal attack—then it seems like fate.Ella and Chance embark on a whirlwind romance, becoming closer with each passing day. Their passionate exploits both in and out of bed give way to a deeper connection that Ella has never before experienced. But despite his obvious feelings for her, Chance remains tight-lipped about certain areas of his life. His frequent nightmares and inexplicable explosions indicate to Ella that he’s hiding something from his past.The situation only gets stranger as Ella falls victim to a string of bizarre attacks; it appears as though someone is out to get her.Danger seems to close in around Ella—little does she know that it is only beginning as Everything builds to an explosive climax. When Chance’s dark past is finally revealed, will it destroy them both?",
  "genres": [
    "Romance",
    "Contemporary Romance"
  ],
  "author": "N.B. Baker",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/20564952-everything"
}