{
  "title": "Winter in Sweetwater County",
  "description": "Welcome to the beloved world of Sweetwater County. A twelve-book series enjoyed by over a MILLION readers!Lisa Mortan’s ideal life crumbles when her rich and powerful fiancé demands she ends an unwanted pregnancy. With no job or social support, she flees to a small town in hopes of finding a good family for her unborn baby but instead finds a man who is as broken as she is.Eric Gaylord returns to his hometown for a respite after a tragic loss, but when his spitfire mother takes on an unknown woman as a business partner, he is forced to face the nightmare he’d left behind or risk losing the one woman who could heal his heart.Why readers have fallen in love with Sweetwater 'This was a sweet romance story. It is heartfelt and I found myself tearing up many times while reading, and I full on cried at the end. Ciara has written a beautiful love story, and I am really looking forward to spending more time in Sweetwater County.Booke Blogs, 5 Stars'I enjoyed reading this book. we need more towns like this today. Goodreads Review, 5 Stars 'Loved this book! This book was very well written, I read it in one sitting couldn't put it down. This had me smiling, angry, and tearing up. This was a very heartwarming story that should be on the Hallmark channel. these two are both broken and struggling with issues of their past yet they are perfect for each other.'Goodreads Review, 5 StarsWhat a moving story. She talks about real life scenarios that people daily live through. I lived through every page of the torment Lisa must have gone through; but she is strong with the strength of will to survive... and she does. Moving out of NYC was the best thing she could have done for herself.Poison Ivey, 5 Stars",
  "genres": [
    "Romance",
    "Christmas",
    "Contemporary Romance",
    "Chick Lit",
    "Amazon",
    "Holiday",
    "Fiction"
  ],
  "author": "Ciara Knight",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/20564422-winter-in-sweetwater-county"
}