{
  "title": "The Fatal Gift of Beauty: The Trials of Amanda Knox",
  "description": "The sexually violent murder of twenty-one-year-old British student Meredith Kercher in Perugia, Italy, on the night of November 1, 2007, became an international sensation when one of Kercher’s housemates, twenty-year-old Seattle native Amanda Knox, as well as her Italian boyfriend and a troubled local man Knox said she “vaguely” knew, was arrested and charged with the murder. The Fatal Gift of Beauty is award-winning author and journalist Nina Burleigh’s mesmerizing literary investigation of the murder, the controversial prosecution, the conviction and twenty-six-year sentence of Knox, the machinations of Italian justice, and the underground depravity and clash of cultures in one of central -Italy’s most beloved cities.      When Perugia authorities concluded that the murder was part of a dark, twisted rite—a “sex game”—led by the American with an uncanny resemblance to Perugia’s Madonna, they unleashed a media frenzy from Rome to London to New York and Seattle. The story drew an international cult obsessed with “Foxy Knoxy,” a pretty honor student on a junior year abroad, who either woke up one morning into a nightmare of superstition and misogyny—the dark side of Italy—or participated in something unspeakable.      The investigation begins in the old stone cottage overlooking bucolic olive groves where Kercher’s body was found in her locked bedroom. It winds through the shadowy, arched alleys of Perugia, a city of art that is also a magnet for tens of thousands of students who frequent its bars, clubs, and drug bazaar on the steps of the Duomo. It climaxes in an up-close account of Italy’s dysfunctional legal system, as the trial slowly unfolds at the town’s Tribunale, and the prosecution’s thunderous final appeal to God before the quivering girl defendant resembles a scene from the Inquisition.       To reveal what actually happened on that terrible night after Halloween, Nina Burleigh lived in Perugia, attended the trial, and corresponded with the incarcerated defendants. She also delved deeply into the history, secrets, and customs of Perugia, renowned equally for its Etruscan tunnels, early Christian art, medieval sorcerers, and pagan roots.      The Fatal Gift of Beauty is a thoughtful, compelling examination of an enduring mystery, an ancient, storied place, and a disquieting facet of Italian an obsession with female eroticism. It is also an acute window into the minds and personalities of the accused killers and of the conservative Italian magistrate striving to make sense of an inexplicable act of evil. But at its core is an indelible portrait of Amanda Knox, the strangely childlike, enigmatic beauty, whose photogenic face became the focal point of international speculation about the shadow side of youth and freedom.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Biography",
    "History",
    "Italy",
    "Mystery"
  ],
  "author": "Nina Burleigh",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/11161726-the-fatal-gift-of-beauty"
}