{
  "title": "The Last Triumvirate",
  "description": "They may fall, but she will rise.Cyra of Fernweh is perfectly content to spend her days making wine on her family’s vineyard after being left there as an infant twenty-two years earlier. Those in the outer lands are not especially hospitable to anyone with magic, so only her brothers know that Cyra uses her meager elemental gifts to light stove fires and water crops around the vineyard. When her life is threatened one day, however, Cyra draws on a much greater magic she didn’t know she possessed to save herself. In doing so, she accidentally lands herself in trouble with the Triumvirate Lords of Thasia.Torn from her home and summoned before the lords, including the dangerous and feared Lord Bressen, Cyra learns that a seer’s vision predicted she will cause the downfall of the Triumvirate. With the help of Samhail, a huge warrior who gives new meaning to the idea of rock-hard muscles, Cyra is forced to navigate a world of power, passion, and political intrigue to discover how she’s involved in the coming crisis before the lords decide to remove her as a threat to their power and their lives.As old enemies emerge to settle grudges and new ones prove willing to do anything for their ambition, what Cyra discovers about herself and her growing powers could put her in more danger than she ever dreamed possible. Fighting for her life, though, may prove easier than fighting her desires.The Last Triumvirate is Book 1 of a six-book series. Book 2 is anticipated in Summer 2024.“It is a FANTASTIC novel! I haven’t read such well-written fantasy in a while. Lots of humor and badassery.” - Advanced ReaderContent Advisory: This book includes mature (18+) subjects and potentially upsetting situations that include graphic violence, death, threats and mentions of sexual assault, brief accountings of torture, abuse, and self-harm, multiple explicit depictions of sex, and some non-traditional sexual practices and proclivities.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fantasy Romance"
  ],
  "author": "Karen C.P. McDermott",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/205701015-the-last-triumvirate"
}