{
  "title": "Breathless",
  "description": "From USA Today Bestselling Author Cerys du Lys ~ Sadie and Evan live in entirely different worlds. Brought together by fate, and held there by hope, can they bridge the gap dividing humanity, or will long held fears and prejudice force them apart forever? (A Cerys du Lys paranormal romance novel) Sadie is a normal girl. Or, she used to be. When catastrophe strikes, a military experiment meant to advance society sends the world into chaos and disarray instead. Those affected become lost and confused, cold and alone. Many give in to their new vicious urges, striking out against humanity for forcing them into this unwanted existence. Sadie is one of them, but she refuses hurt people like they do. She won't. Life is hard now, but there must be more, right? She can cope, she can... Does she even have a reason for living anymore, or is she just fooling herself? Evan is a normal guy. He was one, and he still is. While everyone acts as if this is the end of the world, he refuses to believe it. There's always hope, always answers, and he's determined to find them. Everyone says it's pointless, that he's risking too much, but even if he can help just one person... The world isn't over, it needs guidance towards a new beginning, and Evan's going to help it get there. When Sadie and Evan meet in this soulless, heartless, hopeless world, their lives are inadvertently and inextricably bound together by fate. He can't actually like her, can he? She's so much different. There's no way for him to help her, is there? He doesn't know where to start. They can't stay together. They can't... But what if they're both willing to ignore their differences and just... try? Unfortunately, life isn't so simple. Amidst danger and disaster, deceit, treachery, and hate, it seems like the entire world is against them. Trapped, lost, alone, cold and isolated, betrayed and Breathless, can they overcome all obstacles and rescue not just themselves, but each other? Sweet, sensual, and alluring. This paranormal story of attraction and desire, suspense, danger, and fighting against the odds will captivate you, fascinate you, and leave you feeling spellbound.",
  "genres": [
    "Romance",
    "Paranormal Romance",
    "Zombies"
  ],
  "author": "Cerys du Lys",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/20573491-breathless"
}