{
  "title": "American Desperado: My Life--From Mafia Soldier to Cocaine Cowboy to Secret Government Asset",
  "description": "In 2008 veteran journalist Evan Wright, acclaimed for his New York Times bestselling book Generation Kill and co-writer of the Emmy-winning HBO series it spawned , began a series of conversations with super-criminal Jon Roberts, star of the fabulously successful documentary Cocaine Cowboys.  Those conversations would last three years, during which time Wright came to realize that Roberts was much more than the de-facto “transportation chief” of the Medellin Cartel during the 1980s, much more than a facilitator of a national drug epidemic.  As Wright’s tape recorder whirred and Roberts unburdened himself of hundreds of jaw-dropping tales, it became clear that perhaps no one in history had broken so many laws with such willful abandon. Roberts, in fact, seemed to be a prodigy of criminality – but one with a remarkable self-awareness and a fierce desire to protect his son from following the same path. American Desperado is Roberts’ no-holds-barred account of being born into Mafia royalty, witnessing his first murder at the age of seven, becoming a hunter-assassin in Vietnam, returning to New York to become -- at age 22 -- one of the city’s leading nightclub impresarios, then journeying to Miami where in a few short years he would rise to become the Medellin Cartel’s most effective smuggler. But that’s just half the tale.  The roster of Roberts’ friends and acquaintances reads like a Who’s Who of the latter half of the 20th century and includes everyone from Jimi Hendrix, Richard Pryor, and O.J. Simpson to Carlo Gambino, Meyer Lansky, and Manuel Noriega. Nothing if not colorful, Roberts surrounded himself with beautiful women, drove his souped-up street car at a top speed of 180 miles per hour, shared his bed with a 200-pound cougar, and employed a 6”6” professional wrestler called “The Thing” as his bodyguard.  Ultimately, Roberts became so powerful that he attracted the attention of the Republican Party’s leadership, was wooed by them, and even was co-opted by the CIA for which he carried out its secret agenda. Scrupulously documented and relentlessly propulsive, this collaboration between a bloodhound journalist and one of the most audacious criminals ever is like no other crime book you’ve ever read.  Jon Roberts may be the only criminal who changed the course of American history.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Crime",
    "True Crime",
    "History",
    "Memoir",
    "Autobiography"
  ],
  "author": "Jon Roberts",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/11161428-american-desperado"
}