{
  "title": "The Long Goodbye",
  "description": "Ronald Reagan’s daughter writes with a moving openness about losing her father to Alzheimer’s disease. The simplicity with which she reveals the intensity, the rush, the flow of her feelings encompasses all the surprises and complexities that ambush us when death gradually, unstoppably invades life.In The Long Goodbye, Patti Davis describes losing her father to Alzheimer’s disease, saying goodbye in stages, helpless against the onslaught of a disease that steals what is most precious–a person’s memory. “Alzheimer’s,” she writes, “snips away at the threads, a slow unraveling, a steady retreat; as a witness all you can do is watch, cry, and whisper a soft stream of goodbyes.”She writes of needing to be reunited at forty-two with her mother (“she had wept as much as I over our long, embittered war”), of regaining what they had spent decades demolishing; a truce was necessary to bring together a splintered family, a few weeks before her father released his letter telling the country and the world of his illness . . .The author delves into her memories to touch her father again, to hear his voice, to keep alive the years she had with him.She writes as if past and present were coming together, of her memories as a child, holding her father’s hand, and as a young woman whose hand is being given away in marriage by her father . . . of her father teaching her to ride a bicycle, of the moment when he let her go and she went off on her own . . . of his teaching her the difference between a hawk and a buzzard . . . of the family summer vacations at a rented beach house–each of them tan, her father looking like the athlete he was, with a swimmer’s broad shoulders and lean torso. . . . She writes of how her father never resisted solitude, in fact was born for it, of that strange reserve that made people reach for him. . . . She recalls him sitting at his desk, writing, staring out the window . . . and she writes about the toll of the disease itself, the look in her father’s eyes, and her efforts to reel him back to her.Moving . . . honest . . . an illuminating portrait of grief, of a man, a disease, and a woman and her father.",
  "genres": [
    "Biography",
    "Memoir",
    "Nonfiction",
    "Presidents",
    "History",
    "Biography Memoir",
    "Politics"
  ],
  "author": "Patti   Davis",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/2057.The_Long_Goodbye"
}