{
  "title": "Storm of the Seven Sins",
  "description": "In a world poisoned by revenge, love is their only salvation.Now bonded as skúma and familiar, Eva and Ari can read each other’s minds—and hearts. They’re an unbeatable warrior pair, and now that they’ve confessed their love for each other, their path forward should be clear…together.But the Executor’s disappearance has driven a wedge between them. Eva’s more determined than ever to march against the Commonwealths and put an end to the man she despises. And much as he would like to see the Executor dead, uniting the Houses comes at a price that Ari’s not willing to pay.When a strike against the Brotherhood stronghold sends the resistance into chaos, Ari and Eva find themselves on opposite sides of a deadly conflict. As Eva’s newfound powers spiral out of control, and Ari faces unexpected revelations, the rift between them widens. In a world beset by shifting loyalties and awakening magic, the two must face the possibility of a future apart if they want to survive and bring the Commonwealths down.Author's NoteIf you can’t resist fierce girls with swords, infuriating guys with hearts of gold, a plot that twists and turns when you least expect it, and star-crossed lovers who fight to the death by each other’s sides, then this is the book for you.With the propulsive action and addictive romance of Shatter Me, the high-stakes twists-and-turns of The Hunger Games, and the fantastical world-building of From Blood and Ash, this second book in the award-winning, slow-burn, romantic dystopian fantasy Seven Sins series will pull you in, break your heart, and never let you go.Praise for the Seven Sins SeriesWINNER, Gold Moonbeam Award for Best Book Series, Young Adult FictionWINNER, North Carolina Indie Author Award in Young Adult FictionWINNER, Silver IPPY Award, Young Adult FictionFINALIST, Foreword INDIES Award in Young Adult FictionSHORTLISTED, Manly Wade Wellman Award for Science Fiction and Fantasy",
  "genres": [
    "Fantasy",
    "Dystopia",
    "Young Adult",
    "Romance"
  ],
  "author": "Emily Colin",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/205696114-storm-of-the-seven-sins"
}