{
  "title": "Damage Control",
  "description": "DECEPTION - POWER PLAYS - MURDER \"What do we have, Sergeant?\" Sheriff Quinn asked the leader of the bomb squad. \"Well, Sheriff, it's not a bomb. No one should touch anything until CSU gets here. You will want to have a Deputy Coroner respond as well.\" \"A Deputy Coroner?\" Annie said. \"Why do we need a Deputy Coroner?\" \"It's a tongue,\" the Sergeant said. \"What?\" Annie said, shocked. \"A severed tongue,\" he said to Annie. \"Addressed to you. We didn't look any further into the container. We'll leave that to the Deputy Coroner and the CSU people.\" Sweet Southern Belle Detective Annie Avants hunts down murderers and serial killers in Kern County California. In this second book of the Detective Annie Avants crime fiction mystery series, Detective Annie Avants and her partner, Detective Tom Weston tackle the most perplexing murder mystery since they have worked together. The victim is a local, well-respected Bakersfield attorney who has gone missing. There's not much evidence to go on. His car was found an hours drive out of Bakersfield with blood on the passenger seat. No body has been found. What is the motive? Revenge? Payback for a case lost? Jealousy? staff is in a quandary. He had a new trial scheduled to begin the next morning. Everything was set to go.And then, he just disappeared. A mysterious package left in the restroom of the Kern County Courthouse leads our detectives to believe that the attorney is dead But now. . . another person has gone missing! Annie Avants was born and raised a true southern belle in Mena, Arkansas. From a young age, she knew she wasn't destined to become a farmer's wife and give her parents a passel of grandbabies. It upset her family when she joined the Polk County Sheriff's Department and became one of the youngest detectives of record. After a few years of working in Arkansas, she was ready to spread her wings and took a job offer she couldn't refuse with the Kern County Sheriff's Office in California. It wasn't long before she was one of the lead detectives in the Robbery/Homicide Unit. Her partner, Detective Tom Weston, had only one goal. To finish out his last five years and retire. When his pregnant wife was killed in a bungled bank robbery a few years ago, his life came to a halt and he barely existed. Now, with the help of his young, vibrant new partner, he is taking a new lease on life and was even brave enough to ask Laine DelMonte, the Chief of Technical Investigations, for a date. One major conflict in Annie's life at this moment is the unwanted pressure by Deputy District Attorney Jesse Greyeyes to make her commit to a relationship between the two of them. Feelings of dread, and being trapped, rise to the surface in Annie each time Jesse puts on the pressure. Will our detectives find the answers before a media frenzy erupts in the Kern County/Bakersfield area? Will they call in an FBI profiler to help solve the mystery? Will they come to understand the kinds of criminal minds that lead someone to become a serial killer and, if so, will this help them catch the murderer before someone else is dead? WHAT READERS ARE SAYING Renee Benzaim does it again! Just finished \"Damage Control\" by Renee Benzaim and enjoyed it as much, if not more than \"Cause of Death\", the first in her series about Detective Annie Avants and he",
  "genres": [
    "Mystery"
  ],
  "author": "Renee Benzaim",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/20567701-damage-control"
}