{
  "title": "Armata de cavalerie. Povestiri din Odesa",
  "description": "Volumul de fata grupeaza integral povestirile din Armata de cavalerie, partial ciclul odesit si alte citeva texte. Prospetimea privirii auctoriale, alaturi de poeticitatea textelor – Isaac Babel este un rafinat stilist –, participa la conturarea unor personaje complexe, veridice. Prin fata cititorului se perinda cavaleristi (comandanti, comisari, simpli soldati), tarani, clerici, hoti, negustori, cu totii plini de viata, departe de orice schematism si ostentatie. Prin intermediul unor scrisori trimise de pe front, al unor frinturi din zilele de groaza, de acalmie ori de pregatire de lupta, dar si prin decuparea unor scene de viata din mediul evreiesc ori din propriul trecut, autorul se descopera ca pictor ce poate cuprinde in citeva trasaturi de penel, subtil, comic si tragic, destine si intelepciune, omenescul din om. „Nu poti sa nu te intrebi cum ar fi scris Isaac Babel daca n-ar fi trait in vremuri atit de tulburate. Fara teroarea istoriei, am fi vorbit acum despre el, poate, cum vorbim despre orice alt celebru artist european.” (The Guardian) „Lectura lui Babel aminteste de tinarul Tolstoi, de Maupassant, Cehov, Stephen Crane si Salom Alehem. Cu toate acestea, Isaac Babel e diferit: el este un cronicar al situatiilor imposibile, ale caror claritate si precizie dau fictiunii intensitate lirica si luminozitate.” (Kirkus Reviews) „Lumea este pentru mine ca un spectacol urias, in fata caruia eu sint singurul spectator fara binoclu. Orchestra anunta preludiul celui de-al treilea act, scena este departe, ca intr-un vis, inima imi tresalta de placere – n-ar fi pacat ca in fata unui asemenea spectacol sa fiu orbit de o banala pereche de lentile?” (Isaac Babel)",
  "genres": [
    "Fiction",
    "Russia",
    "Short Stories",
    "Russian Literature",
    "Classics",
    "Jewish",
    "Literature"
  ],
  "author": "Isaac Babel",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/20569992-armata-de-cavalerie-povestiri-din-odesa"
}