{
  "title": "Incommunicado",
  "description": "Just about everyone is incommunicado in the small, sleepy Oregon coastal town of Sea Park during winter. Until Pearl Harbor, that is, when it springs to patriotic life. But is Ruby Opal Pearl (a.k.a. Jewels) Stokes the only person to see what’s really happening here? Tommy Kiramoto, the one person in her life who has provided security, shelter, and a smidgeon of respect—and who owns the biggest resort on the coast—is now the cause of the town’s rage. Tommy’s Japanese ancestry makes him the prime target of an angry mob, not to mention he’s also rich, has a shady past, and everyone in town owes him money. As the town's patriotism blossoms into paranoia and turns violent, Jewels has to do something to protect Tommy from internment (or worse), even if that something is going up against the town and the government, not to mention the FBI. Thus begins a twelve-year-old girl’s war within a war.Randall Platt’s Incommunicado is both timely and timeless. It's about the meaning of courage and the willingness to stand up for what's right, even when it goes against the prevailing attitudes of the time and place. It's also about the insidious way groups and communities can nurture ignorance and prejudice. But most of all, it’s an adventure story set in a town full of unforgettable characters, during a time of great intrigue and peril, no matter which enemy or on what front you fight.Sky Pony Press, with our Good Books, Racehorse and Arcade imprints, is proud to publish a broad range of books for young readers—picture books for small children, chapter books, books for middle grade readers, and novels for young adults. Our list includes bestsellers for children who love to play Minecraft; stories told with LEGO bricks; books that teach lessons about tolerance, patience, and the environment, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [
    "Middle Grade",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Young Adult",
    "Childrens",
    "Young Adult Historical Fiction"
  ],
  "author": "Randall Platt",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/20578616-incommunicado"
}