{
  "title": "Bright Coin Moon",
  "description": "Set against the colorful backdrop of immoral psychics and dishonest scam artists, Bright Coin Moon tells a story of longing and loyalty and the emotional burden of sacrifice.Seventeen-year-old Lindsey Allen is an A-student who has her heart set on becoming an astronomer. But first she must break away from her mother, an eccentric failed beauty queen who has set up a phony psychic reading shop in their Oregon garage.Lindsey is biding time until she graduates high school, reading tarot cards for the neighbors in her mother’s shop and recording the phases of the moon in her Moon Sign notebook. Her life changes when her mother, Debbie, decides they should move to California to become Hollywood psychics to the stars. As they pull out of the driveway, Lindsey looks up at the silver morning moon. It’s a bright coin moon, which means only one what you leave behind today will rise up tomorrow.When mother and daughter arrive in Los Angeles with new identities, they move into a leaky, run-down building and spend their nights stalking restaurants and movie premieres to catch that one celebrity they hope will be their ticket. When it seems they will never make it in LA, Lindsey is assigned a new mentor through her school. Joan is a lonely, wealthy widow who can’t get past the death of her husband, Saul. Debbie is convinced they’ve hit the jackpot, and plans for a future séance commence.As Lindsey grows closer to Joan, guilt over the scam consumes her, and she must make the ultimate decision. But can she really betray her mother?Sky Pony Press, with our Good Books, Racehorse and Arcade imprints, is proud to publish a broad range of books for young readers—picture books for small children, chapter books, books for middle grade readers, and novels for young adults. Our list includes bestsellers for children who love to play Minecraft; stories told with LEGO bricks; books that teach lessons about tolerance, patience, and the environment, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [
    "Young Adult",
    "Fiction",
    "Book Club"
  ],
  "author": "Kirsten Lopresti",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/20578568-bright-coin-moon"
}