{
  "title": "The Copernicus Complex: Caleb A. Scharf",
  "description": "Longlisted for the 2015 PEN/E.O. Wilson Literary Science Writing AwardShort-listed for \nPhysics World\n's Book of the Year\nThe Sunday Times (UK) Best Science Book of 2014\n\n\nA Publishers Weekly Top 10 Science Book of Fall 2014An NBC News Top Science and Tech Book of 2014A Politics & Prose 2014 Staff PickIn the sixteenth century, Nicolaus Copernicus dared to go against the establishment by proposing that Earth rotates around the Sun. Having demoted Earth from its unique position in the cosmos to one of mediocrity, Copernicus set in motion a revolution in scientific thought. This perspective has influenced our thinking for centuries. However, recent evidence challenges the Copernican Principle, hinting that we do in fact live in a special place, at a special time, as the product of a chain of unlikely events. But can we be significant if the Sun is still just one of a billion trillion stars in the observable universe? And what if our universe is just one of a multitude of others-a single slice of an infinity of parallel realities?In The Copernicus Complex, the renowned astrophysicist Caleb Scharf takes us on a scientific adventure, from tiny microbes within the Earth to distant exoplanets, probability theory, and beyond, arguing that there is a solution to this contradiction, a third way of viewing our place in the cosmos, if we weigh the evidence properly. As Scharf explains, we do occupy an unusual time in a 14-billion-year-old universe, in a somewhat unusual type of solar system surrounded by an ocean of unimaginable planetary diversity: hot Jupiters with orbits of less than a day, planet-size rocks spinning around dead stars, and a wealth of alien super-Earths. Yet life here is built from the most common chemistry in the universe, and we are a snapshot taken from billions of years of biological evolution. Bringing us to the cutting edge of scientific discovery, Scharf shows how the answers to fundamental questions of existence will come from embracing the peculiarity of our circumstance without denying the Copernican vision.With characteristic verve, Scharf uses the latest scientific findings to reconsider where we stand in the balance between cosmic significance and mediocrity, order and chaos. Presenting a compelling and bold view of our true status, The Copernicus Complex proposes a way forward in the ultimate quest: determining life's abundance, not just across this universe but across all realities.",
  "genres": [
    "Science",
    "Nonfiction",
    "Astronomy",
    "Philosophy",
    "Physics",
    "Space",
    "Audiobook"
  ],
  "author": "Caleb Scharf",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/20575445-the-copernicus-complex"
}