{
  "title": "Twilight in the Forbidden City",
  "description": "According to the title page, the Amereon House edition was limited to 300 copies. No dust jacket.British academic and diplomat Reginald Fleming Johnston (1874-1938) published Twilight in the Forbidden City in 1934. The work is a memoir of Johnston's time in Beijing between 1919 and 1924, at the court of the Qing Dynasty, where he served as tutor to Aisin-Gioro Puyi (1906-1967), last emperor of China. Johnston was one of only two foreigners who were permitted to enter the imperial palace, and so his account provides a unique Western perspective on the epochal events of the period. The work has a preface by the emperor Puyi and includes detailed descriptions of palace rituals, including Puyi's wedding ceremony; translations of key documents; Johnston's perspective on the revolution of 1911 and the 1917 restoration; his observations on Chinese society as a whole; and eye-witness accounts of the political intrigues of the palace. The memoir was dramatised in Bernardo Bertolucci's cinematic masterpiece, The Last Emperor.Table of ContentsIntroduction; Preface; 1. The Reform Movement of 1898; 2. The collapse of the Reform Movement; 3. Reaction and the Boxer Movement, 1898-1901; 4. The last years of Kuang-Hsu, 1901-1908; 5. The Empress-Dowager, T'z -Hsi; 6. The Revolution, 1911; 7. The 'Articles of Favourable Treatment' of the Manchu Imperial House; 8. The Ta Ch'ing and the Hung Hsien Emperors; 9. Change Hsun and the Restoration of 1917; 10. Autobiography of the Old Man of the Pine-Tree (translated from the Chinese); 11. The Forbidden City, 1919-1924; 12. The Imperial tutors; 13. The Manchu court in twilight; 14. The Imperial Household Department (Nei Wu Fu); 15. The dragon unfledged; 16. Monarchist hopes and dreams; 17. The dragon restless; 18. The dragon flaps his wings; 19. Dragon and phoenix; 20. Plots and stratagems; 21. The Imperial garden; 22. The summer palace; 23. The Fifth of November; 24. The dragon caged; 25. The flight of the dragon; Epilogue: the dragon goes home; Pedigree of the Manchu Emperors; Notes; Index.",
  "genres": [
    "China",
    "History",
    "Biography",
    "Nonfiction",
    "Asia",
    "Memoir",
    "Asian Literature"
  ],
  "author": "Reginald Fleming Johnston",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/2057780.Twilight_in_the_Forbidden_City"
}