{
  "title": "Cooking Allergy-Free: Simple Inspired Meals for Everyone",
  "description": "Banish boring recipes for the allergy-conscious from your kitchen. Those of us with food allergies often have disappointing dining options. Cooking Allergy-Free is a phenomenal resource for the home cook with 150 delicious recipes for all courses--appetizers, soups and salads, main dishes, sides and vegetables, sweets, dressings and sauces, plus breakfast and breads.  Forget those boring same-old, same-old dishes.  Instead, dig into these healthy, allergy-free dishes with gourmet Inspired Starters-Pumpkin Pear Soup with Sunchokes and HerbsDelicious main courses-Orange Balsamic ChickenHeavenly desserts -Flourless Molten Chocolate Cookies Food allergies are on the rise. More than 12 million Americans have food allergies. Did you know, according to Dr. Scott Sicherer at New York's Jaffe Food Allergy Institute, that have one food allergy can put you at a higher risk for reaction to other foods? According to the National Institute of Allergy and Infectious Approximately 1 in 20 children and about 1 in 25 adults have a food allergyFood allergies have increase 50% from 1997 to 2011The only way to prevent a reaction is to avoid the allergenic food Cooking Allergy-Free is your cure ! An entire chapter is devoted to helpful strategies for setting up your kitchen to be allergy-friendly, including information on grocery shopping, stocking the pantry, and preventing cross-contamination. Take the stress, fear, and guesswork out of allergy-free cooking .  No more cooking multiple meals to accommodate different dietary needs. Each flavorful recipe is free of at least one of the \"big 8\" allergens-eggs, soy, nuts, gluten, dairly, shellfish, fish and corn. For easy reference, recipes are identified by colorful icons and include simple substitutions for converting recipes for people with other allergies. Menu suggestions and wine pairings simplify weeknight meal planning and make entertaining easy.",
  "genres": [
    "Cooking",
    "Nonfiction",
    "Cookbooks",
    "Food"
  ],
  "author": "Jenna Short",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/20578284-cooking-allergy-free"
}