{
  "title": "Mongol",
  "description": "Librarian's Note: An alternate cover for this ISBN can be found hereSince man has been man, those called wise in every generation and culture have declared that true love never dies. There must be a reason they keep saying this. A merciless, agonizing memory can sometimes break a person and render them incapable of facing even the commonplace without being unnerved. Then sometimes it will forge a person into something more than human, a figure of near super human ability who can take action in even the most savage of circumstances.Victoria Custer remembered how she and the one to whom she vowed her eternal love were buried by mountains and swallowed by the sea. That painful, frightening memory from a thousand generations past has forged her into something more than she was and has emboldened her with unrelenting purpose. Now, as Vic Challenger, she will confront even the grimmest peril and will venture into situations so horrible they make the bravest of men cower and weep for their mother. Vic has embarked against all odds on an epic quest that may last a lifetime and on any day could bring violent death. She has learned from her mysterious avatar Nat-ul, even when you face the gravest of threats, you need not be brave, you just need to do what needs done, for no matter how dire the circumstances, “It’s not hard. It’s just living.”Nothing short of death will stop Vic. And even death itself seems to have failed at least once.It’s the Fall of 1920 and Vic Challenger and her friend Lin Li have gone to Mongolia. They thought they were prepared for anything but doom begins to hound them, in the form of Hung-hu-tzes, White Russians, and hellish creatures that stalk them from underground. This is Lin's first trip with Vic but will it also be her last? They both have to wonder how this trip will end",
  "genres": [],
  "author": "Jerry   Gill",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/20580419-mongol"
}