{
  "title": "Indian Renaissance: A New Age",
  "description": "A consortium of corrupt leaders is trying to take over your country. What will you do? a)Fight and revolt against the consortium's bid to rule. b)Accept their control and help them gain more power so that you will be able to benefit during their reign. c)Live as if today was your last day on earth and try to make a difference. d)Why should you care?! Twelve people were faced with the same question and this is the story of the choices they made and its consequences. There is Orohan [who is in remission from leukaemia], Dr. Mariannette and Dhadhijah who are a recently reunited family of aliens. They are fighting for their planet Naibiru’s freedom from the evil dictator Dumansh who has his eye on planet earth. Miriam who is an orphan trying to make a normal life for herself and find justice for her friends who have been cheated. Aaron who is a cyber crimes specialist trying solve a Nigerian scam case as well as work out his family issues with his wife Miriam. Biju who is trying to escape his violent past and find redemption in running a prison home. His children Caleb and Clare who have to grow up, handling their father’s past and their cranky mother Fatima. Mathew, Vivek, Irfan and Deepika who are on their life’s journey and have to choose between doing good and evil. \"Hannah Juan's absorbing and provocative novel will grab your attention, your eyeballs and your imagination all through the book from the first page to the last. It opens the Pandora's box of superstition and corruption in the contemporary world against the settings of a booming Indian metropolis.\" -Dr. Prateep V Philip [IPS; Assistant Director General of Tamil Nadu Police, Author of ten books, Founder of E.Q thinking, Excenomics and winner of Her Majesty the Queen's Award for Innovation.]",
  "genres": [],
  "author": "Hannah Mary Juan",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/20595112-indian-renaissance"
}