{
  "title": "The Nuns of Sant'Ambrogio: The True Story of a Convent in Scandal",
  "description": "A true, never-before-told story-discovered in a secret Vatican archive-of sex, poison, and lesbian initiation rites in a nineteenth-century convent. In 1858, a German princess, recently inducted into the convent of SantAmbrogio in Rome, wrote a frantic letter to her cousin, a confidant of the Pope, claiming that she was being abused and feared for her life. What the subsequent investigation by the Churchs Inquisition uncovered were the extraordinary secrets of SantAmbrogio and the illicit behavior of the convents beautiful young mistress, Maria Luisa. Having convinced those under her charge that she was having regular visions and heavenly visitations, Maria Luisa began to lead and coerce her novices into lesbian initiation rites and heresies. She entered into a highly eroticized relationship with a young theologian known as Padre Peters-urging him to dispense upon her, in the privacy and sanctity of the confessional box, what the two of them referred to as the special blessing. What emerges through the fog of centuries is a sex scandal of ecclesiastical significance, skillfully brought to light and vividly reconstructed in scholarly detail. Offering a broad historical background on female mystics and the cult of the Virgin Mary, and drawing on written testimony and original documents, Professor Wolf-Germanys leading scholar of the Catholic Church, and among the very first scholars to be granted access to the archives of the Congregation for the Doctrine of the Faith, formerly the office of the Inquisition-tells the incredible story of how one woman was able to perpetrate deception, heresy, seduction, and murder in the heart of the Church itself.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "True Crime",
    "Crime",
    "Historical",
    "Audiobook"
  ],
  "author": "Hubert Wolf",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/20587900-the-nuns-of-sant-ambrogio"
}