{
  "title": "An Indigenous Peoples' History of the United States",
  "description": "The first history of the United States told from the perspective of indigenous peoples Today in the United States, there are more than five hundred federally recognized Indigenous nations comprising nearly three million people, descendants of the fifteen million Native people who once inhabited this land. The centuries-long genocidal program of the US settler-colonial regimen has largely been omitted from history. Now, for the first time, acclaimed historian and activist Roxanne Dunbar-Ortiz offers a history of the United States told from the perspective of Indigenous peoples and reveals how Native Americans, for centuries, actively resisted expansion of the US empire.With growing support for movements such as the campaign to abolish Columbus Day and replace it with Indigenous Peoples’ Day and the Dakota Access Pipeline protest led by the Standing Rock Sioux Tribe, An Indigenous Peoples’ History of the United States is an essential resource providing historical threads that are crucial for understanding the present. In An Indigenous Peoples’ History of the United States, Dunbar-Ortiz adroitly challenges the founding myth of the United States and shows how policy against the Indigenous peoples was colonialist and designed to seize the territories of the original inhabitants, displacing or eliminating them. And as Dunbar-Ortiz reveals, this policy was praised in popular culture, through writers like James Fenimore Cooper and Walt Whitman, and in the highest offices of government and the military. Shockingly, as the genocidal policy reached its zenith under President Andrew Jackson, its ruthlessness was best articulated by US Army general Thomas S. Jesup, who, in 1836, wrote of the Seminoles: “The country can be rid of them only by exterminating them.”  Spanning more than four hundred years, this classic bottom-up peoples’ history radically reframes US history and explodes the silences that have haunted our national narrative.An Indigenous Peoples' History of the United States is a 2015 PEN Oakland-Josephine Miles Award for Excellence in Literature.",
  "genres": [
    "History",
    "Nonfiction",
    "Indigenous",
    "Social Justice",
    "Race",
    "Native American",
    "Audiobook"
  ],
  "author": "Roxanne Dunbar-Ortiz",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/20588662-an-indigenous-peoples-history-of-the-united-states"
}