{
  "title": "Not Marked: Finding Hope and Healing after Sexual Abuse",
  "description": "Are you suffering the effects of sexual abuse? There is a way out. In Not Finding Hope and Healing after Sexual Abuse, Mary DeMuth illuminates the way to go from shame-filled to joy-filled, from traumatized to finding enduring peace. This isn t theory. Mary has lived it. She s traveled this path and offers a uniquely qualified, insider s view of the healing process. Then Mary goes deeper because often you re not the only one who has suffered. Her husband Patrick comes alongside her and offers insights into how spouses can love a sexual abuse victim toward wholeness, and how this will bring your relationship a whole new level of strength. Not Marked will help · Find the courage to share your story maybe for the first time. · Stop comparing your brokenness to others' wholeness. · Understand the specific way God designed you to heal. · Identify safe people to entrust your healing journey to. · Embrace utter honesty about your abuse, even if that means anger toward God. · Discover how prayer helps you move from angst to alleluia. · Find the powerful antidote to bitterness. · Let go of accusatory thought patterns and grasp God s affection for you. · Uncover an ancient pathway to healing. · Live the effervescent life you ve longed for but could never quite grasp. You do not have to be forever marked by sexual abuse. You are resilient even if you believe all your strength is gone. You are worthy of being made whole even if you can t believe it s possible. And you are a stunning work of amazingness even though your heart can t even start to grasp that. Yet. This is your time. The moment to start the journey of the unmarked life!",
  "genres": [
    "Abuse",
    "Nonfiction",
    "Psychology",
    "Mental Health",
    "Self Help",
    "Faith",
    "Marriage"
  ],
  "author": "Mary E. DeMuth",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/20588431-not-marked"
}