{
  "title": "Magic of the Wood House",
  "description": "Elementals: Water, Earth, Fire and Air are only the beginning. Elementals support everything from Darkness to Time, secretly maintaining the processes of nature. Only now the Elementals are nearly extinct. Two years ago, the Air House released a plague that killed ninety percent of them. With their society in chaos and so many of their kind dead, they can’t find their Phase-Matches; the other halves of themselves. Without Matches they can’t have any more children and without the Elementals, the world will end. Again.Sullivan: Sullivan Pryce is human. Mostly. Big, scarred and suspicious of everyone, he has no idea that his grandfather was one of the most respected Elementals who ever lived. The surly Police Chief’s unique DNA means women are pouring out of the cosmos to try and court him. Most of them wind up in Sullivan’s jail, awaiting psych evaluations and bail hearings. All he wants for Christmas is to get rid of this “Cult” of insane stalkers. Except, he can’t stop thinking about one of them: Teja, the most beautiful weirdo he’s ever seen. No matter how crazy she is, Sullivan can’t get Teja out of his mind. And not just because her gangster family has kidnapped him.Teja: Notorious for their wild ideas on romance and mafia movie lifestyle, the Fire House is feared throughout the Elemental realm. But, tossing the universe’s most eligible bachelor into a dungeon is crazy even for them. Teja, of the Fire and Cold Houses is horrified by her zany relatives’ actions. She knows that Sullivan is her Match and that’s the last thing she wants. For two years, Teja has been frozen inside. Having Sullivan in such close proximity threatens to melt the protective layer of ice inside her heart.Being around Sullivan soon has Teja feeling far too much. For instance, anger that he isn’t beheading the parade of home wrecking women trying to seduce him away. And desire when she gazes at his warrior’s face. And confusion that Sullivan seems to have far more powers than a mostly-human guy should possess. …And fear, because someone is targeting the Fire Phases. Her family is being framed for a terrible crime. As the rest of the Elementals turn on the Fire House, Sullivan and Teja are about to be caught right in the middle of the fight.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fantasy Romance",
    "Paranormal",
    "Paranormal Romance",
    "Magic",
    "Contemporary"
  ],
  "author": "Cassandra Gannon",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/20587926-magic-of-the-wood-house"
}