{
  "title": "A Gentle Hope: A Beauty and the Beast Retelling",
  "description": "Can one find hope when trapped in a curse?Iara has spent years caring for her grumpy, unappreciative father, all the while longing to join her mother’s loving family in the capital city. But when her father dies and she can finally make that dream come true, she is accosted. First by an unwanted suitor who insists she marry him, and then a fairy godmother she’s never seen before, who whisks her away—to be magically imprisoned on the grounds of a ruined castle.Aleixo thinks of his past with shame. His reputation for cruelty is so well-known that even his own people refer to him as the Beast. As a result, he's been cursed, forced to live within the grounds of a ruined castle until he can find a way to break the curse. He has worked hard to redeem himself by rescuing other people in desperate straits. But it’s been three years, and he’s beginning to lose hope that he can ever earn his freedom. That is, until he meets Iara.Iara isn’t grateful for being rescued, and her repeated attempts to flee the grounds are as amusing as they are futile. But her determination is inspiring and for the first time in years, Aleixo truly begins to believe that the curse can be broken—at least by her. Still, now he has to face the possibility of another loss, for what if Iara’s escape just means he’ll be left behind?“A Gentle Hope,” a retelling of Beauty and the Beast, is a standalone novella, complete with tropes like forced proximity, emotional scars, and redemption. It is part of the “Hope Ever After” series, a collection of twenty hopeful and uplifting fairy tale retellings. Each book is written by a different author so it can be enjoyed in any order. The proceeds from this series are donated to the O.U.R. (Operation Underground Railroad) to rescue children from exploitation and trafficking.",
  "genres": [
    "Beauty and The Beast",
    "Fantasy",
    "Romance",
    "Fairy Tale Retellings",
    "Retellings",
    "Young Adult",
    "Fairy Tales"
  ],
  "author": "Sarah   Carlisle",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/205902823-a-gentle-hope"
}