{
  "title": "Virginia's Adventures Omnibus Edition: Virginia's First Four Adventures",
  "description": "From Virginia’s origin as a voluptuous young graduate, sexually enhanced by the evil Dr Tanis, through her salacious sex filled adventures with Bill and Bunny, to the ultimate showdown with the evil doctor - it’s all here in one volume.Virginia’s Adventures feature a light, humorous, plot with frequent explicit consensual heterosexual sex and lesbian sex. This book contains explicit sex and is unsuitable for readers under 18 years of age.Four books in one Arousing Virginia and Bill have an Adventure - Why is the voluptuous young Virginia so horny lately? Will she fall into the evil clutches of Time’s man of the year, Dr. Tanis? Will Bill, the handsome Interpol agent, stop thinking with his dick? Will there be enough sex? Find out as Virginia has her first salacious adventure.Seductive Virginia and Bunny’s Doll Adventure - After their close escape from sexual slavery at the hands of the evil Dr. Tanis, Virginia and Bunny have settled well into life at Interpol. Focused, dedicated, not at all obsessed with sex. Two of Bunny's friends from her university days have made a super-real robotic sex doll in her image - but what possible confusion could that cause? Find out in Virginia's second salacious adventure.Passionate Virginia and Bunny’s Basement Adventure - When Interpol Human Resources force Virginia and Bunny to take leave, despite the girls’ best intentions, their pesky sexual arousal gets the better of them. But wait - what is going on in the old fallout shelter under the State Building? Why is Dr Tanis’s wife Josephine here? Will they escape alive? Confusion reigns in Virginia and Bunny’s third salacious adventure.Shameless Virginia and Bunny’s Fourth Adventure - When Josephine takes the (supposedly) brainwashed Bill to Dr. Tanis’s private mansion, Jessica is captured while following him. While Bill is strapped down and subject to the carnal desires of Dr. Tanis’s beautiful assistants, it is up to the girls to penetrate all defenses and come to the rescue. Will they find a satisfactory solution? Will they finally have enough sex? Find out in Virginia and Bunny’s fourth salacious adventure.",
  "genres": [],
  "author": "Hollis Chester",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/20600264-virginia-s-adventures-omnibus-edition"
}