{
  "title": "Jamie Oliver's Comfort Food: The Ultimate Weekend Cookbook",
  "description": "Jamie's new cookbook brings together 100 ultimate comfort food recipes from around the world. It's all about the dishes that are close to your heart, that put a smile on your face and make you feel happy, loved, safe and secure. Inspired by everything from childhood memories to the changing of the seasons, and taking into account the guilty pleasures and sweet indulgences that everyone enjoys, it's brimming with exciting recipes you'll fall in love with.Jamie's Comfort Food is all about the food you really want to eat, made exactly how you like it. With this in mind, the book features ultimate versions of all-time favourites, and also introduces cherished dishes from countries around the world, providing a delicious recipe for every occasion. This isn't everyday cooking – this is about weekends, holidays, celebrations and occasions. Whether you're home alone, or sharing the love with a big group of family or friends, there really is something for everyone.Celebrating the beauty of good food is at the heart of this book, and it's jam-packed with incredible photography. Written in Jamie's usual down-to-earth and easy-to-understand style, the methods are precise and have been tested to the hilt, so are guaranteed to work, but this time Jamie has turned the edit filter off, and shares extra hints, tips and ideas throughout to ensure you achieve the best possible results. This is about making food the very best it can be, and embracing the rituals of cooking.Recipes include everything from mighty moussaka, delicate gyoza with crispy wings, steaming ramen and katsu curry to super eggs Benedict, scrumptious sticky toffee pudding and tutti frutti pear tarte tatin.Treat yourself, and your loved ones, with Jamie's Comfort Food.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Food and Drink",
    "Cuisine"
  ],
  "author": "Jamie Oliver",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/20603007-jamie-oliver-s-comfort-food"
}