{
  "title": "The Secret of the Earth",
  "description": "When Dirk Waaijen, master of the Voorne, was five days out from the island of Celebes, a strange thing happened. For nearly a week the Dutchman had idled along with a cargo of cocoa, jaggaree, trepang, some Manado coffee, a few bags of nutmegs and other products of the Archipelago, but without an incident worth logging; when suddenly, an odd looking cask, with mast and streamer, was seen floating in the waters ahead, and all hands became alive with excitement. A couple of burly fellows hauled the barrel upon the deck, with the expectation of a prize, but were discomfited on finding that it contained only some cotton cloth, carefully wrapped about a dirty water-stained document, written in a language which no one could understand. Even Captain Waaijen himself was unable to read a word of it, despite his wise look, and the volumes of smoke which he blew from time to time over the packet. Had he confided in me, his only English speaking passenger, I might at least have made him comprehend the importance of the paper, even if unable to render a literal translation; but the captain was surly, and took the bundle to his room. It is even possible that he was ignorant of the fact that it was written in the English language. However this may have been, I was surprised on reaching Gravenhage, the end of our voyage, to have the paper thrust into my hands by Waaijen himself, and without a word of explanation. Believing it to be merely the record of some unfortunate craft foundered in the South Sea, I laid the packet aside, not even unrolling it for weeks. When I did so, I was amazed at the contents, and immediately sought the master of the Voorne; but he had left upon another of those endless voyages, the length of which even the company was unable to decide. Assured that no claim will ever be made upon the document, and overwhelmed with the profundity of its contents, I offer it to the public, convinced that in the history of our planet, there is nothing half so astounding as the revelation it contains. It is to be regretted that the paper cannot be given in its entirety; the omissions, indicated by asterisks, being the result of damage caused by salt water to the MS., which has made it undecipherable in those places; the total thus lost amounting to more than a hundred pages. The following is an exact rendering of the decipherable parts of the Attlebridge papers, handed me by the captain of the Voorne.",
  "genres": [],
  "author": "Charles Willing Beale",
  "average_rating": "3.09",
  "url": "https://www.goodreads.com/book/show/20598542-the-secret-of-the-earth"
}