{
  "title": "NIV Bible",
  "description": "The world's most popular modern English Bible, now fully revised and updated and in eBook format for the first time. The NIV eBook is designed to be easy to navigate and has additional links for immediate access to key passages within the Bible.With over 400 million Bibles in print, the New International Version is the world's most popular modern English Bible. It is renowned for its combination of reliability and readability. Fully revised and updated for the first time in 25 years, the NIV is ideal for personal reading, public teaching and group study.This eBook edition * Navigation system to easily access Bible passages * Links to key stories, events and people of the Bible * Linked reading plan * Bible Timeline * Overview for each book of the Bible * Quick links to find inspiration and help from the Bible in different life situationsBritish This edition uses British spelling, punctuation and grammar to allow the Bible to be read more naturally.More about the This revised and updated edition of the NIV includes three main types of change, taking into account changes in the way we use language day to day; advances in biblical scholarship and understanding; and the need to ensure that gender accurate language is used, to faithfully reflect whether men and women are referred to in each instance. The translators have carefully assessed a huge body of scholarship, as well as inviting peer submissions, in order to review every word of the existing NIV to ensure it remains as clear and relevant today as when it was first published.Royalties from all sales of the NIV Bible help Biblica, formerly the International Bible Society, in their work of translating and distributing Bibles around the world.",
  "genres": [
    "Christian",
    "Nonfiction",
    "Religion",
    "Theology",
    "School",
    "Christian Non Fiction",
    "Christianity"
  ],
  "author": "Anonymous",
  "average_rating": "4.76",
  "url": "https://www.goodreads.com/book/show/20605628-niv-bible"
}