{
  "title": "Oops I Ate a Vengeance Demon",
  "description": "Getting possessed by a demon wasn’t on my to-do list. I was just too busy for that sort of thing.I had a fifty-hour work week, a hellraiser of a toddler, debilitating morning sickness and a husband who thought his only job was taking out the trash. I was at breaking point.I don’t remember being possessed, or attacking Terry, or my local priest pulling the demon out of me and trapping her in a banana (with the help of a stranger, a badass girl who apparently wrangled supernatural creatures for a living.)But the aftermath was wild. Terry promised he’d try harder, and give me more support.He lied. And I broke.So… I ate the banana. I absorbed the vengeance demon.She’s a part of me now, sharing my body; we’re like two people in a car. Most of the time, I’m driving. Sometimes, I let her take the wheel.She’s the rage of wronged women; the vengeance of the vulnerable, wild justice for the oppressed. She can hear bad thoughts, she can sense evil intentions. She can tell when someone wants to abuse their power, and she whispers their secrets to me.She also eats the internal organs of evil people… which is a little awkward, since I’m a vegetarian.Her methods might be a little blunt. And bloodthirsty. But she’s definitely got my back, and I need her help right now.My best friend is being blackmailed. Someone’s gotten hold of Chloe’s nudes, and is threatening to send them to her whole contact list. Together, me and my vengeance demon need to find who did this, and help bring him to justice.Hopefully, my kind of justice. The kind involving the police and a courtroom. Not the kind where I’m picking gristle and sinew out of my teeth for a week.But you never know…",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Demons",
    "Romance",
    "Paranormal",
    "Mystery",
    "Magic"
  ],
  "author": "Lauretta Hignett",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/205971401-oops-i-ate-a-vengeance-demon"
}