{
  "title": "Blood Drive",
  "description": "The first three massive tombs in the Blood Stone series are now presented together at one low price - save 45% on the retail price of all three individual titles.BOOK 1: BLOOD KNOTWinter, a thief who can manipulate others' biologies, \"healed\" her ex-partner, Sebastian, whom she secretly loves. Nathanial, Sebastian's ex-lover, talks them into stealing proof that will expose vampires to humans.Nathanial refuses to love humans, leaving Winter unsure of his feelings for her or Sebastian. But the evidence they steal is hot. The future of vampires is in jeopardy and others want the evidence, forcing all three to trust each other to survive. Can they?BOOK 2: BLOOD STONESurvival becomes a deadly game where lovers might be enemies.Nial orders Calum Garrett to get close to Hollywood producer Kate Lindenstream. Garrett is reluctant for she is human and already involved with Roman Xerus. Roman and Garrett know each other from sixteenth century Scotland, but they parted bitterly two centuries ago.With Roman's support, Kate battles Garrett in wills and business. On the closed-in desert movie set, Garrett's orderly world crumbles for he experiences real, human feelings for Kate....BOOK 3: BLOOD UNLEASHEDWho is the real enemy?Marcus wants nothing to do with vampires, until he meets the sniper called The Whisper. Ilaria is a smoldering Italian beauty who captures his heart. Rick puts together clues revealing the Whisper is gunning for the leader of the revolutionaries. He meets Ilaria and finds she is a wounded woman with a deep secret. Is she involved with the Blood Stone? Or is she innocent as both want to believe?WARNING: These books contain multiple hot, sexy alpha heroes, frequent, explicit and frank sex scenes and sexual language.They include heart-stopping sexual scenes between the aforementioned sexy heroes, ménage scenes, and anal sex. Don't proceed beyond this point if hot love scenes offend you.No vampires were harmed in the making of this novel.",
  "genres": [],
  "author": "Tracy Cooper-Posey",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/20612762-blood-drive"
}