{
  "title": "Wtf I'm Trying to Be Spiritual: A Guidebook for Loving Yourself Without Fear",
  "description": "Winner of the 2015 International Book Awards New Age: Non-Fiction CategoryFinalist in the Spirituality: General Category for the 2015 International Book AwardsFed up with living life as an opinion of someone else? Throughout this book, readers will discover themselves, or at least what or who they aren't. There's no point in having spiritual answers if we can't stand ourselves, as we layer most things into our guilt and shame cycle, which we seem to like so much. Self-hatred is evident in many of us, from overeating to starvation; seeking and never finding that true love, leaving a trail of broken lives--our own included--shows us we are really seeking ourselves. Never really knowing why that would be, we ventured into the heart of the matter, literally: self-love. Where is it, what is it, and how come we don't have it? The reader is invited to discover how to reveal the power of love within and share it with others by the world's foremost authority--God. The dialogue between God and the book's authors provides insights into some of life's biggest questions and the human condition, not just on a personal level, but also on a global scale. Through these inspiring messages, this book exposes spiritual truths, while providing solutions that can be incorporated into the daily practice of everyday living, to bring a greater sense of peace and awareness to the reader.For more information, please visit our website: www.kissandtellproductions.com.Front cover: photo by Jeanette Bishop (Isle of Skye, Scotland)Back cover: photo by Helen Varga (Cranberry Creek Gardens, Lynedoch, Ontario, Canada)BlueInk Review\"While the authors' basic premise (direct communication with a supreme being) may not be palatable to everyone, their suggestions could offer a way back into spirituality for sincere seekers . . . . \"ForeWord Clarion Reviews\"Bishop and Varga have created a jovial and generous guidebook for self-care.The book's largest sections, which focus on loving oneself and healing via that love, offer a blueprint for this reorientation. Trading between practical advice and recalled, meditative conversations with the Spirit, the authors act as creative spiritual gurus.\" Kirkus Indie Review\" . . . there are sound pieces of advice to be gleaned from these pages, even by readers with diff erent beliefs.\"",
  "genres": [],
  "author": "Jeanette Bishop",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/20608733-wtf-i-m-trying-to-be-spiritual"
}