{
  "title": "Return to Grace Street",
  "description": "New game. New rules.Warning: This is not a fairy tale love story nor is it a BDSM romance. This is a story about facing the darkness within. The man written within the pages of this book is obsessive, possessive and broken, and he gets off on mind fucking his lovers. He's an anti-hero with an abusive past who often times pushes too hard in his quest to win his own sick game. The fainthearted, closed-minded and squeamish need not read any further. Contains graphic sex, total power exchange, and situations that may elicit discomfort or trigger past memories of abuse. For mature readers aged 18+Abandon. Denial. Surrender. Victor tried to stay away; he couldn't. He tried to start a new chapter and only wasted his time. He did his best to keep his demons at bay, but it proved to be an impossible task. Now Mr. Black is back to take what's his and face-off with the one player who beat him at his own game. Only this time he aims to win, even if his methods mean risking everything, including his job, reputation and sanity.Having moved past the heartbreak and physical torture that Mr. Black put her through, Elsa's life is back on track. With a new love in her life and her future secure, she's horrified and angry when he reappears, threatening his wrath if she doesn't play his twisted game again. But despite being haunted by his dark, untold secrets, she's a different woman now. Stronger than before and far more resilient. And more importantly, determined to make her own rules.This time around, both participants are on equal ground. They will play with such passion and ferocity, their very existence is threatened because in their eyes, there can be only one winner and there is no conceding when your mental and physical freedom is at stake.",
  "genres": [
    "Dark",
    "BDSM",
    "Romance",
    "Erotica",
    "Dark Romance",
    "Abuse",
    "Adult"
  ],
  "author": "Ella Dominguez",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/20611995-return-to-grace-street"
}