{
  "title": "Grace Street",
  "description": "Warning: This is neither a conventional romance nor a traditional love story. There are no hearts and flowers on the pages of this book. The heroine doesn't always make wise choices and though I've tried to make her strong, she's often times weak in the face of the fierce hero. The hero is not a knight in a shining armor. He's broken and frequently cruel, and what every woman in the real world should avoid. What's contained in this book isn't real - it's fiction; dark, depraved and decadent make-believe. Contains detailed sexual encounters, uncomfortable situations and erotic elements including voyeurism, oral and anal. Intended for readers 18+. If you're down with that, then by all means... read on. Obsession, possession, resilience, insanity... Seeking solitude and reprieve from her past failed relationships, Elsa begins her life anew in Richmond, hoping to find the change that she so desperately needs. Things are looking up for her, a new job, new friends... a fresh start.But Victor has different plans for her. From the moment he heard her voice and set his eyes on Elsa, she became next on his to-do list; his Chapter 8. A well-known and respected criminal profiler, his mind is as dark as the people he hunts down. It takes one to know one, after all. Under the guise of making his subjects stronger, he intends to break Elsa down using everything in his arsenal, including pleasure, pain, humiliation, and things unspeakable. Everyone is fair game in his book and he discriminates against no one when he chooses his test subjects.Lonely, still on the mend from a bad break-up and longing for sexual attention, Elsa consents to an odd proposition, unaware of Victor's plans. However, she can't be broken so easily and what he puts her through only fuels the fire burning within her, a flame that begins to blaze out of control as she becomes obsessed with everything about Victor and peeling back his cruel layers in search of the real man hiding beneath his heartless facade.In Victor's world, there is no such thing as happily ever after and Chapter 8 proves to be an infuriating challenger when she flips the tables on his selfish and twisted game, a game they both may end up losing their hearts and minds over.",
  "genres": [
    "Dark",
    "BDSM",
    "Erotica",
    "Adult",
    "Contemporary",
    "Romance",
    "Dark Romance"
  ],
  "author": "Ella Dominguez",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/20611602-grace-street"
}