{
  "title": "Roommate Romance Boxed Set",
  "description": "** Enjoy all four of the Roommate Romance stories in one volume! This collection of erotic novellas is for adults only and contain sexually explicit scenes. **\n- Heart You -** Heart You is roughly 7200 words and contains a hot sexual triad between two female roommates and their Valentine's Day boy toy. **Have you ever wanted something you know you shouldn't? That forbidden fruit. A temptation that will surely lead you down the path of illicit indulgence, and ultimately, pleasure beyond your wildest imaginations.That was the daily torture Samantha put herself through when she thought of her roommate, Kara. Sitting alone on Valentine's Day, Sam found comfort in sharing her innermost secrets with her trusty journal while lusting over the brown-eyed goddess. At least until Kara comes home with a sizzling hot man and a night full of naughty games that would even make cupid blush.- Bind Me -** Bind Me is roughly 6600 words and contains light BDSM scenes between a curious woman and her very dominant male roommate. **Lily had a suspicion her new roommate was the type to always take control, no matter what the situation. It wasn’t until she accidentally peeked in on Chaz dominating another woman, that her suspicions were realized. Lily watched with amazement as Chaz masterfully played the female like a sensual instrument, bringing her the most intense gratification Lily had ever witnessed.After witnessing his sexual expertise from a distance and noticing the careful attention he gives to his lovers, Lily wanted nothing more than to have his hands sculpt every inch of her body. Unable to forget the incredibly erotic scene Chaz so skillfully played out, Lily sought to make her desires known by casually submitting to him throughout their daily lives.To her excitement, Chaz invites Lily to his prestigious art show opening at a local gallery. All it takes is a slinky dress, a pair of kitten heels, and a tiny scrap of lace to drive Chaz wild, causing some very heated moments.- Share You -** Share You is roughly 12,000 words and contains a hot sexual ménage à trois between a young couple and their smexy new tenant. **If Kelli has learned one thing over the years, it would be that desires rule your life—aversion has no place if you truly want to be happy. And she was all about getting what she wanted.It all started on a rather hot, summer day when her husband, Nick, decided they needed to rent a room out in their house in order to make ends meet. Kel knew it was the only way they could continue to afford their lovely home. Still, deep down, she'd always hated the idea—at least until Ava walked through their door.After several grueling tenant interviews, they finally rented the room to the sexy, long-legged blonde, causing Kelli to reassess what she really wanted.- Flatter Me -** Flatter Me is roughly 17,000 words and contains sexual situations between a female barista and three hot Australian men. **Laney knows her life is boring, and now that it’s a new year, she’s looking forward to letting go and giving in to some of life’s simple pleasures. When three men with sexy Australian accents walk into her coffee shop, spouting cheesy one-liners in some desperate form of flattery, her New Year’s resolution is put to the test.It figures that, through several amusing come-ons, she finally finds Trevor—a perfect man who just so happens to be unattainable due to his temporary status in the states. Laney’s days turn into a mixture of carefree desires and tough decisions, causing her to question what she truly wants from life.Will her passionate heart be able to handle the likes of Trevor and his mates? Maybe. How about when she knows there’s the promise of something more to come? Now that’s more like it.",
  "genres": [
    "Erotica"
  ],
  "author": "Rene Folsom",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/20611767-roommate-romance-boxed-set"
}