{
  "title": "James Herriot's Favorite Dog Stories",
  "description": "\"When I decided to be a vet, I knew that I wanted to be a dog doctor, so I could spend all my time with dogs.\" - from the IntroductionJames Herriot would go on to become so much more than a dog doctor. But no animal was dearer to his heart, and no animal provided him with more heartwarming and wonderful tales. With over a million copies sold, James Herriot's Favorite Dog Stories has inspired dog lovers the world over. After being out of print for many years, it is now again available in an affordable, beautifully repackaged hardcover edition, filled with original watercolors that illustrate Herriot's charming and wholesome tales. This classic heartwarming collection of ten stories about dogs - from border collies and sheepdogs to the exploits of Tricki Woo, the unforgettable Pekinese - by the late author of All Creatures Great and Small is prefaced by a moving introduction from Herriot himself - the very last piece of writing the beloved author ever completed. So, follow the master veterinarian as he journeys through Yorkshire, caring for big dogs and small with his characteristic gentleness and peace, profound observation, and deep, loving humor.A warm and joyful collection of James Herriot’s loving tales of our furry friends. From delightful old favorites like Tricki Woo to heartwarming stories of Brandy, Hermann, Jock, and more. James Herriot’s Favorite Dog Stories is a must-have for any dog lover.Contains:“Tricki Woo Goes Crackerdog” * “Prince and the Card Above the Bed” * “Jock Top Dog” * Tricki Woo “A Triumph of Surgery” * “Jake Rides into Town”* Gyp “Only One Woof” * Roy “From Rags to Riches” * Tricki Woo “A Judge of Form” * Hermann “A Happy Ending” * Brandy “The Dustbin Dog”",
  "genres": [
    "Animals",
    "Nonfiction",
    "Short Stories",
    "Dogs",
    "Humor",
    "Memoir",
    "Classics"
  ],
  "author": "James Herriot",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/20613495-james-herriot-s-favorite-dog-stories"
}