{
  "title": "Bad Country",
  "description": "Winner of the Tony Hillerman Prize, winner of the Spur Award for Best Western Contemporary Novel, and a finalist for the Edgar Award for Best First Novel, a debut mystery set in the Southwest starring a former rodeo cowboy turned private investigator, told in a transfixingly original style.Rodeo Grace Garnet lives with his old dog in a remote corner of Arizona known to locals as El Hoyo. He doesn't get many visitors in The Hole, but a body found near his home has drawn police attention to his front door. The victim is not one of the many undocumented immigrants who risk their lives to cross the border in Rodeo's harsh and deadly \"backyard,\" but a member of a major Southwestern Indian tribe, whose death is part of a mysterious rompecabeza-a classic crime puzzler-that includes multiple murders, cold-blooded betrayals, and low-down scheming, with Rodeo caught in the middle.Retired from the rodeo circuit and scraping by on piecework as a bounty hunter, warrant server, and divorce snoop, Rodeo doesn't have much choice but to say yes when offered an unusual case. An elderly Indian woman from his own Reservation has hired him to help discover who murdered her grandson, but she seems strangely uninterested in the results. Her attitude seems heartless, but as Rodeo pursues interrelated cases, he learns that the old woman's indifference is nothing compared to true hatred, and aligned against a variety of creative and cruel foes, the hard-pressed PI is about to discover just how far hate can go.CB McKenzie's Bad Country is a noir novel that is as deep and twisty as a desert arroyo. With confident, accomplished prose, McKenzie captures the rough-and-tumble outer reaches of the Southwest in a transfixingly original style that transcends the traditional crime novel.",
  "genres": [
    "Mystery",
    "Fiction",
    "Audiobook",
    "Crime",
    "Westerns",
    "Mystery Thriller",
    "Thriller"
  ],
  "author": "C.B. McKenzie",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/20613525-bad-country"
}