{
  "title": "Phantom",
  "description": "Phantom, The Crowned Wolff! Check out the reviews! Reviews~ Lori Roughton I can't come up with the words to describe my feelings. Angleo and Sophia; Phantom and Storm....WOW. Special Operatives come together as their destiny unfolds. Adam is a threat to the Wolff Dynasty and Phantom has to face this. From his first knowledge of becoming more than human to the Crowned Wolff...this is a truly amazing story. The best story yet. Great job P.T. Macias. By SelenicMagick I loved this book - then again, what's not to love? It has romance, shifters, military and hot sex. Plus it has conflict and a great story line. This particular book in the Razer 8 series helps to introduce the Tequila 10 series - which is another great series by the woman who brought us the De La Cruz Saga and Razer 8 series. By danielle ~ Phantom is just Hott. This story has alot of elements to it u have intrigue romance and paranormal all wrapped up in one. Great Job P.T. i cant wait to read more about the Razer 8 team keep them coming and we will keep reading them. I cant wait to see who's story is next. By Robin McClelland - I really loved this book. It is one that I couldn't hardly put down. I would recommend this to people who love paranormals. Phantom, Angelo De Amato a Razer 8 operative, is oblivious of his true nature or his destiny. He lives life staying in the dark, silently observing the world turn. He feels that he’s never truly fit or felt at home anywhere. He feels his life is a phantom of what life should be. The notorious half century old prophesy hasn’t been fulfilled. Storm, Sophia Davis, is working on Tequila 10 Special Operative team for the government. The team has special abilities. Storm is waiting for her Chosen to show up to bond her soul and heart. Storm and Phantom are on a mission to gather intel. They’re destined to cross paths and are immediately thrown into a tornado of love, truths, and passions. Are they destined to merge as one? Excerpt ~ She pulls up her hair, fanning herself with her hand. I wonder if I’m going to be able to work. Hmm, it smells like steak and something very, very delicious, she thinks. Storm looks around the living room and walks further in. She turns to look at the furniture. She throws her bag on the sofa, nodding. Oh, yes. It’s nice for being small. I think that Phantom is here and cooking. Damn, what a wonderful boyfriend I have, she thinks, grinning. She pulls up her hair, fanning herself. Oh gawd, I’m dying. She opens up her shirt a little more. “Babe, I’m home,” yells Storm. She walks to the kitchen, smiling. Huh? Babe? Yeah, she’s insane, he thinks. He shakes his head and turns off the water. He turns to greet her. Hell! She’s beautiful and insanely sexy. Oh wow, she totally turns me on, he thinks. He blinks with surprise. Damn, I don’t usually react instantly and with this intensity to women. He shifts to relieve his aching cock. He leans against the counter. His button-up shirt has the last two buttons unbuttoned, so the shirt flaps open as he crosses his arms. Storm stops dead in her tracks. Her smile turns to surprise and pleasure. Omg, omg the scent is him. My Chosen! Oh yeah, it’s him! I love his scent and I’m so ready for him, she thinks. She closes her eyes and inhales deeply with pleasure. Yep, he’s my mate and he’s simply scrumptious. I’ve never smelled anything like his scent. Yep, he’s made for me, only me. He’s totally mine. I’m thrilled that finally I found him. I thought he wasn’t here on earth.",
  "genres": [],
  "author": "P.T. Macias",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/20616972-phantom"
}