{
  "title": "The Righteous and the Wicked",
  "description": "Small moments can seem insignificant until they change the course of a life forever. The sound of a bulldozer. A chance meeting at a gas station. A gust of wind through a chime. Benign events become something more when viewed through the lens of fate.Emma Santori is a prisoner of tragic memories. Locked in a spiral of depression, she leads a desolate and empty life, trapped in her decrepit home. Rooted in routine, she’s numb and vacant. As a lonely Catholic school teacher, her only joy comes from her young students. One Saturday morning, her isolation is infiltrated by a mysterious architect building a home beside hers.That man is Eric Wilder and he’s keeping a secret—a secret that’s destroying his life. Filled with guilt and self-loathing, he’s forced to move often. He chooses the small northeastern town of Pine Lake as his latest refuge, and hopes to make a successful attempt at starting his life over. As always, he’s unable to make that happen.That all changes when he meets Emma.She finds herself drawn to Eric when she accidentally bumps into him, but Eric’s unfazed by their first meeting. When a gust of wind brings these two people together once again, Emma discovers Eric’s secret. She’s forced to battle between her Catholic faith and her desire for this stranger.Their attraction is intense and they soon discover they’re each lonely and longing for what the other has to offer. As their friendship blossoms, Emma realizes her passion and lust for Eric are the remedy to her depression. Eric discovers his feelings for Emma are the only antidote to his secret burden.They begin an erotic journey, which leads these beautifully broken people to discover that love can be both righteous and wicked.",
  "genres": [
    "Romance",
    "Fan Fiction",
    "Contemporary Romance",
    "Chick Lit"
  ],
  "author": "April Emerson",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/20614568-the-righteous-and-the-wicked"
}