{
  "title": "Redfox",
  "description": "Razer 8 takes you into the world of organized crime, kidnapping, politics, military romance and suspense thriller. Razer 8 Delta Force operatives are full of passion. Enjoy these amazing passionate men, a thrilling ride of suspense, and a dash of love. Redfox aka Scott Campbell Redfox, Razer 8 operative mission is to infiltrate the Police Commissioner’s office and home. He has 72 hours to gather the intel on the Commissioner’s dirty business. Redfox charms his way into the Commissioner’s home, throwing him into the arms of his soul mate. The unexpected love rocks his world and the success his mission. The Commissioner’s daughter, Marsha Diane Bryant is a lovely sweet young girl. She falls under Redfox spell and unconditionally bestows her soul. Redfox fears losing his soul mate in the process of completing his mission. Can their love survive the storm? Excerpt “Scott, how long are you going to be at the office with my Daddy,” asks Marsha. She gazes up into his beautiful blue eyes. Hmm, he’s incredible. “Marci, I’m going to be at the office as an intern for a few weeks. I’ll then have several other offices to visit as an intern. You know that I’m going to learn from several different politicians,” says Scott, nodding. Yep, that sounds good. “Scott, you have an amazing presence, a little edge to you. I can see you in politics. You have lots of charm,” says Marci, grinning. She studies his face. Totally a man that looks dangerous even in the tux, she thinks. Oh wow, she’s very perceptive. I have to be extra careful with her, he thinks. Scott grins at her. “Marci, that’s because I’m a dangerous man,” he says. “Would you care to have dinner with me tomorrow?” Marci grins with pleasure, nodding. “Yes, I would love to,” replies Marci. Oh yeah, if I’m lucky I will have a few dances with him. I’ll feel his arms around me, she thinks. “Fantastic, I’ll be looking forward to tomorrow,” says Redfox. He holds her hand, rubbing his thumb over her wrist. Hell yes, her heart beats fast. “I can’t wait. I know that there’s going to be several important guests here tonight. Can I dare hope that you will be my date tonight?” asks Marsha. Redfox takes a step closer; he gazes into her beautiful sapphire blue eyes. “Marci, I don’t plan on leaving your side the entire time that I’m here in my internship. I understand that you’re on a winter break from school. How do you feel about it?” Damn, she’s beautiful. Her fair skin is clear, smooth, and lovely, he thinks. Marsha locks eyes with him. Hmmm he’s so delicious. Oh yeah, I’m his. I’m glad he wants to be near me all the time, she thinks. She bites her lower lip. She smiles, nodding. “I feel that that’s a wonderful plan, Scott. I love the idea of getting to know your likes and your passions,” whispers Marci. She blushes a little, unsure and embarrassed. Oh damn, what if I’m misunderstanding him? Scott grins, thrilled with her comment. He pulls her hand and wraps it around his waist. “Do you now? I would love you to learn everything about me and especially my passions, sweet Marci,” replies Redfox. He moves his other hand to touch her soft rosy check. “Do you think we can start now?” asks Redfox. He pulls her closer to him, shuddering. Wow, I feel him. This is extraordinary and thrilling. I’m lost in his touch, his soul is searing into mine. Yes, that’s what I feel, she thinks. She continues to gaze into his eyes, feeling her soul embedding deeply into his soul.",
  "genres": [],
  "author": "P.T. Macias",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/20616971-redfox"
}