{
  "title": "Behind His Eyes - Truth",
  "description": "BEHIND HIS EYES—TRUTH  is the second of the CONSEQUENCES SERIES reading companions, by New York Times and USA Today bestselling author Aleatha Romig. It is recommended to be read after completing Consequences and Truth. It is not a standalone book and should not be read as such.This reading companion explores the thoughts and motivations of Anthony Rawlings and his struggle to accept the truth behind the consequences. It is not intended as a total rewrite of TRUTH, but meant to enhance the reader’s understanding. BEHIND HIS EYES—TRUTH contains significant scenes from the novel TRUTH, as experienced from Anthony’s point of view. It also contains never before published, behind-the-scenes information, a glossary of the characters, and a timeline that grows from Consequences to include the array of new characters and revelations found in the pages of Truth.BEHIND HIS EYES—TRUTH is the continued journey inside the mind of the man who survived the consequences. This companion allows readers the opportunity to witness first hand as Anthony’s world changes forever. His rules and control begin to slip away, threatened by the most unlikely foes—an experience completely unfamiliar to him. Can something as pure as love and forgiveness wreak havoc on his well-planned existence?BEHIND HIS EYES—TRUTH, because there is more to learn about a man Once upon a time, signed a napkin that he knew was a contract. As an esteemed businessman, he forgot one very important rule—he forgot to read the fine print. It wasn’t an acquisition to own another person as he’d previously assumed. It was an agreement to acquire a soul.—Aleatha Romig, CONVICTEDContinue the long and painful acquisition, as the TRUTH becomes evident, from Behind His Eyes!",
  "genres": [
    "Romance",
    "Dark",
    "Dark Romance",
    "Erotica",
    "Contemporary",
    "Adult",
    "Suspense"
  ],
  "author": "Aleatha Romig",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/20615348-behind-his-eyes---truth"
}