{
  "title": "Carousel Sun",
  "description": "The long‑awaited sequel to Carousel Tides, enchanting contemporary fantasy by Sharon Lee, award‑winning co‑creator of the popular Liaden Universe® saga. When magic meets mundane, sparks fly: these are exciting times in Archers Beach, Maine! A unprecedented Early Season has united townies and carnies in an effort expand into a twelve‑month resort, recapturing the town's former glory.Kate Archer, owner‑operator of the vintage wooden carousel, is caught up in the excitement—and is quite possibly the cause of it. Because Kate leads a double life, as carny, and as Guardian of the land. Her recent return to the home she had forsaken has changed the town's luck—for the better—and energized the trenvay—earth and water spirits who are as much citizens of the Beach as their mundane counterparts.But the town's new energy isn't the only change afoot. Joe Nemeier, the local drug lord, whose previous magical consultant was vanquished by Kate, has acquired a new ally—and this one plays with fire.At the publisher's request, this title is sold without DRM (Digital Rights Management).On Carousel Tides:“[A] pyrotechnic finale that plays out magically behind the ordinary facade of smalltown Maine life, evoking much of the romance and magic of [Lee’s] popular Liaden series.” –Publishers Weekly\"[A] virtuoso ride, full of the spirit of the carnival, aware of the thinness of the veil between the worlds. . .a rollicking tale full of non stop action. . .and yet there's also a quiet at its heart, because there really is this magic in everything and Sharon Lee knows how to spin it.\"–SFsiteOn Sharon Lee & Steve Miller’s Liaden Universe® Space Opera Epic:“Lee and Miller’s novels are full of action, exotic characters, plenty of plot, and even a touch of romance. The world building is outstanding.” –BooklistSharon Lee has been married to her first husband for more than half her lifetime; she is a friend to cats, a member of the National Carousel Association, and oversees the dubious financial schemes of an improbable number of stuffed animals. Despite having been born in a year of the dragon, Sharon is an introvert. She lives in Maine because she likes it there. In, fact, she likes it so much that she's written four novels set in Maine: mysteries Barnburner, and Gunshy, as well as contemporary fantasies Carousel Tides and Carousel Sun. With the aforementioned first husband, Steve Miller, Sharon has written eighteen novels of science fiction and fantasy–many of them set in the Liaden Universe®–and numerous short stories. She has occasionally been an advertising copywriter, a reporter, photographer, book reviewer, and secretary. For three years, she was executive director of the Science Fiction and Fantasy Writers of America, and was subsequently elected vice president, and then president of that organization.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Fiction",
    "Magic",
    "Paranormal",
    "Romance",
    "Science Fiction"
  ],
  "author": "Sharon Lee",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/20614219-carousel-sun"
}