{
  "title": "Three Minutes in Poland: Discovering a Lost World in a 1938 Family Film",
  "description": "Named one of the best books of 2014 by NPR, The New Yorker, and The Boston GlobeWhen Glenn Kurtz stumbles upon an old family film in his parents' closet in Florida, he has no inkling of its historical significance or of the impact it will have on his life. The film, shot long ago by his grandfather on a sightseeing trip to Europe, includes shaky footage of Paris and the Swiss Alps, with someone inevitably waving at the camera. Astonishingly, David Kurtz also captured on color 16mm film the only known moving images of the thriving, predominantly Jewish town of Nasielsk, Poland, shortly before the community's destruction. \"Blissfully unaware of the catastrophe that lay just ahead,\" he just happened to visit his birthplace in 1938, a year before the Nazi occupation. Of the town's three thousand Jewish inhabitants, fewer than one hundred would survive.Glenn Kurtz quickly recognizes the brief footage as a crucial link in a lost history. \"The longer I spent with my grandfather's film,\" he writes, \"the richer and more fragmentary its images became.\" Every image, every face, was a mystery that might be solved. Soon he is swept up in a remarkable journey to learn everything he can about these people. After restoring the film, which had shrunk and propelled across the United States; to Canada, England, Poland, and Israel; and into archives, basements, cemeteries, and even an irrigation ditch at an abandoned Luftwaffe airfield as he looks for shards of Nasielsk's Jewish history.One day, Kurtz hears from a young woman who had watched the video on the Holocaust Museum's website. As the camera panned across the faces of children, she recognized her grandfather as a thirteen-year-old boy. Moszek Tuchendler of Nasielsk was now eighty-six-year-old Maurice Chandler of Florida, and when Kurtz meets him, the lost history of Nasielsk comes into view. Chandler's laser-sharp recollections create a bridge between two worlds, and he helps Kurtz eventually locate six more survivors, including a ninety-six-year-old woman who also appears in the film, standing next to the man she would later marry.Painstakingly assembled from interviews, photographs, documents, and artifacts, Three Minutes in Poland tells the rich, harrowing, and surprisingly intertwined stories of these seven survivors and their Polish hometown. \"I began to catch fleeting glimpses of the living town,\" Kurtz writes, \"a cruelly narrow sample of its relationships, contradictions, scandals.\" Originally a travel souvenir, David Kurtz's home movie became the most important record of a vibrant town on the brink of extinction. From this brief film, Glenn Kurtz creates a poignant yet unsentimental exploration of memory, loss, and improbable survival--a monument to a lost world.",
  "genres": [
    "History",
    "Nonfiction",
    "Holocaust",
    "World War II",
    "Poland",
    "European History",
    "Jewish"
  ],
  "author": "Glenn Kurtz",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/20613824-three-minutes-in-poland"
}