{
  "title": "The Unspeakable: And Other Subjects of Discussion",
  "description": "Winner of the 2015 PEN Center USA Literary Award for Creative Nonfiction\"Daum is her generation's Joan Didion.\" —NylonNearly fifteen years after her debut collection, My Misspent Youth, captured the ambitions and anxieties of a generation, Meghan Daum returns to the personal essay with The Unspeakable, a masterful collection of ten new works. Her old encounters with overdrawn bank accounts and oversized ambitions in the big city have given way to a new set of challenges. The first essay, \"Matricide,\" opens without flinching:People who weren't there like to say that my mother died at home surrounded by loving family. This is technically true, though it was just my brother and me and he was looking at Facebook and I was reading a profile of Hillary Clinton in the December 2009 issue of Vogue.Elsewhere, she carefully weighs the decision to have children—\"I simply felt no calling to be a parent. As a role, as my role, it felt inauthentic and inorganic\"—and finds a more fulfilling path as a court-appointed advocate for foster children. In other essays, she skewers the marriage-industrial complex and recounts a harrowing near-death experience following a sudden illness. Throughout, Daum pushes back against the false sentimentality and shrink-wrapped platitudes that surround so much of contemporary American experience and considers the unspeakable thoughts many of us harbor—that we might not love our parents enough, that \"life's pleasures\" sometimes feel more like chores, that life's ultimate lesson may be that we often learn nothing.  But Daum also operates in a comic register. With perfect precision, she reveals the absurdities of the New Age search for the \"Best Possible Experience,\" champions the merits of cream-of mushroom-soup casserole, and gleefully recounts a quintessential \"only-in-L.A.\" story of playing charades at a famous person's home. Combining the piercing insight of Joan Didion with humor reminiscent of Nora Ephron's, Daum dissects our culture's most dangerous illusions, blind spots, and sentimentalities while retaining her own joy and compassion. Through it all, she dramatizes the search for an authentic self in a world where achieving an identity is never simple and never complete.",
  "genres": [
    "Essays",
    "Nonfiction",
    "Memoir",
    "Short Stories",
    "Audiobook",
    "Book Club",
    "Feminism"
  ],
  "author": "Meghan Daum",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/20613724-the-unspeakable"
}