{
  "title": "Out of the Frying Pan: A Chef's Memoir of Hot Kitchens, Single Motherhood, and the Family Meal",
  "description": "Out of the Frying Pan is an empowering memoir that traces Gillian Clark’s rise from a beginner to a top chef. But managing a kitchen also taught her about parenting. With a wealth of experience and wisdom, and a healthy dash of humor, Gillian now shares her life’s recipes, from the solutions she cooked up for parenting challenges to her favorite culinary creations.In the prime of her life, Gillian Clark abandoned the corporate world to pursue her passion---making mouthwatering food with fresh, homegrown ingredients.  When she became a single parent with two young daughters, though, Gillian had to reconsider her dreams. Moving to the country and running a small, artisanal farm were put on the back burner---supporting her family had to come first. But Gillian’s drive to make delicious food was relentless. She finished her culinary degree, survived the tedious prep work of her first cooking job and the difficulty of training during the day and raising two girls at night, and confronted the challenges of working her way up from the bottom in a profession where only the strongest survive.Beating intense odds, Gillian is now head chef and proprietor of the successful and popular Colorado Kitchen, which is ranked among the top 100 restaurants in Washington, D.C. This puts her simple café in the company of the city’s finest dining establishments.Touching and joyful, Out of the Frying Pan rivals any parenting book and is also chock-full of more than forty delicious recipes, from her first “soup of the day” to her family’s Sunday brunch waffles---even the pink medicine placebo she whipped up for one of her daughters.Her inspirational advice on how she raised her daughters while never giving up her dream is a gem for  parents and foodies alike and will fit at just about any table.",
  "genres": [
    "Food",
    "Nonfiction",
    "Memoir",
    "Food and Drink"
  ],
  "author": "Gillian     Clark",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/1116746.Out_of_the_Frying_Pan"
}