{
  "title": "The Third",
  "description": "Ji Sun, heir to the powerful Lee clan of bloodsuckers brings disgrace to her kind by not only mixing with humans, but leaving the clan to marry one, and she is banished for ever from her family.  After five years, Ji Sun’s happiness is threatened. For although she has no intention of returning to her life as a bloodsucker, she has not yet renounced her inheritance, for to do so is to risk stigmatization and a much shortened life. However, Mun Oh, her younger brother, now fifteen years old and already a formidable bloodsucker, is ordered by his parents to visit his sister and demand that she goes through the Ritual of Renunciation in his favor.But the spoiled and capricious Mun Oh, accustomed to getting his own way the minute he wants something, and his teeth into any human he fancies, encounters more obstacles than he bargains for, especially from Ji Sun’s troubled and troublesome step-daughter Hyeon Jin, the unpopular school bully.Hyeon Jin hates Mun Oh and would get rid of him at all costs if she could. When Hyeon Jin discovers Mun Oh’s secret, she thinks she has found the perfect weapon. Mun Oh, however, detects certain weaknesses under Hyeon Jin’s hard exterior and plays on them ruthlessly. And it seems for while, that he has the upper hand . . . But then the trouble-making bloodsucker Han Kyung makes his appearance. He is jealous of the handsome Mun Oh, and would do anything to reduce him in the eyes of the clan.Events start to spiral out of control. Hyeon Jin discovers what it is like to be on the receiving end of hurtful behavior, and as Mun Oh gets more and more attracted by the human world, he soon transgresses the strict rules of the bloodsucking clan. He is to learn the secret of the Rule of Thirds the hard way. But Will he have to pay the heavy price for his disobedience?It is down to Ji Sun to find a solution. She has to make a choice. But will she have to sacrifice her happiness and that of her beloved husband and step-daughter to do so?",
  "genres": [
    "Paranormal",
    "Vampires"
  ],
  "author": "Zhu Hsia",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/20622457-the-third"
}