{
  "title": "Battlefronts",
  "description": "Carey finds herself caught in Lady Nocturne's web, and shares information about Ironsite Security's involvement in the mutant attack at the Barrett factory days before. Naryx calls in people to raise Gene Front's talon once more, and the mutant group seeks out explosives, and then plans an attack on the research company. Spectral Warden, the star quarterback of the University of Metrocity's football team, takes to the streets as a new hero. He crosses paths with Psystar, Diva, Gene Front, and has a fight with Carey that cuts off her one chance to escape Gene Front. Jacob Davis, the owner of a large private animal reserve and hunting ground to the south of Metrocity, hires a team of assassins to exact revenge upon Sparks. The gunslinger is forced to fight for her life numerous times as she wards off criminals and mutants, and all the while attempts to find the parts and people necessary to save her friend Jazz's life. Blake takes the first steps on setting up his power base, and the heroes discover what happened to Firebane in the Dark Breach. H.E.R.O. - Battlefronts is the 15th book in the most extensive superhero novel series of the last decade. It is an action-packed, full-length written novel of over 115,000 words. The H.E.R.O. series to this H.E.R.O. – Metamorphosis (1) This full book is FREE on all major ebook retailers! Search by the author's name, or by the full name of the book. H.E.R.O. - New Markets (2) H.E.R.O. - Rise and Fall (3) H.E.R.O. - Dark Research (4) H.E.R.O. - Horde (5) H.E.R.O. - Paragon (6) H.E.R.O. - Illustrated Guide H.E.R.O. Shorts – Gatecrasher (7) H.E.R.O. Shorts – Silverlash (8) H.E.R.O. - Gene Front (9) H.E.R.O. - Incursion (10) H.E.R.O. - Dolldrum (11) H.E.R.O. - Malice (12) H.E.R.O. – Dark Breach (13) H.E.R.O. – Nightmonger (14) H.E.R.O. – Battlefronts (15) H.E.R.O. – Riftguard (16) H.E.R.O. – Augments (17) H.E.R.O. – Summoned (18) H.E.R.O. – Bio-Organism (19) H.E.R.O. – Anarchy (20) H.E.R.O. – Cyberhunt (21) H.E.R.O. – Lashback (22) H.E.R.O. – The Agency (23)",
  "genres": [],
  "author": "Kevin Rau",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/20618902-battlefronts"
}