{
  "title": "It's Always Been You",
  "description": "Former Navy SEAL Travis Blake is a rising star in the security business. In two short years, Blake Security Inc. has become highly sought after by the who’s who in Washington DC.But unbeknownst to many, Travis is haunted by the mysterious death of his wife three years before. He carries with him the guilt of not being there to protect the one person who meant everything to him. He has buried his wife, but his heart refuses to accept that the body six feet under is hers. His obsessive search for her leads him deep into the trenches of covert ops—and everything is not what it seems.Caitlin Kincaid has been on the run for a while. The sum of her memories began three years ago when she awakened with a broken arm and leg and a severe concussion. Hunted down by a secret group within the U.S. government, her companion persuades her to stay off the grid because of the standing kill order on their heads. One night, while fleeing assassins, she is left on the side of the road with a cryptic message: “It’s time for you to stop running. I’m not the one you love.” When Travis receives news that the woman who has turned up at the American Embassy in Berlin could be his wife, he wastes no time getting to her. He is unprepared for the devastation that shreds him when Caitlin looks at him with no recognition in her eyes. Amnesia is a challenging enough obstacle for winning the love of his life back. But with lies defining the past three years of her life, Caitlin becomes wary of anyone’s help.Love was never the problem. A marriage cannot survive without trust. As sinister forces threaten the bond they are trying to rebuild, trust must come quickly or one of them will die.* Strong sexual content and language. Disturbing situations.",
  "genres": [
    "Military Fiction",
    "Romance",
    "Romantic Suspense",
    "Contemporary",
    "Second Chance",
    "Contemporary Romance",
    "Suspense"
  ],
  "author": "Victoria Paige",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/20623300-it-s-always-been-you"
}