{
  "title": "The Age of Everything: How Science Explores the Past",
  "description": "Taking advantage of recent advances throughout the sciences, Matthew Hedman brings the distant past closer to us than it has ever been. Here, he shows how scientists have determined the age of everything from the colonization of the New World over 13,000 years ago to the origin of the universe nearly fourteen billion years ago.Hedman details, for example, how interdisciplinary studies of the Great Pyramids of Egypt can determine exactly when and how these incredible structures were built. He shows how the remains of humble trees can illuminate how the surface of the sun has changed over the past ten millennia. And he also explores how the origins of the earth, solar system, and universe are being discerned with help from rocks that fall from the sky, the light from distant stars, and even the static seen on television sets.Covering a wide range of time scales, from the Big Bang to human history, The Age of Everything is a provocative and far-ranging look at how science has determined the age of everything from modern mammals to the oldest stars, and will be indispensable for all armchair time travelers. “We are used to being told confidently of an enormous, measurable that some collection of dusty bones is tens of thousands of years old, or that astronomical bodies have an age of some billions. But how exactly do scientists come to know these things? That is the subject of this quite fascinating book. . . . As told by Hedman, an astronomer, each story is a marvel of compressed exegesis that takes into account some of the most modern and intriguing hypotheses.”—Steven Poole, Guardian “Hedman is worth reading because he is careful to present both the power and peril of trying to extract precise chronological data. These are all very active areas of study, and as you read Hedman you begin to see how researchers have to be both very careful and incredibly audacious, and how much of our understanding of ourselves—through history, through paleontology, through astronomy—depends on determining the age of everything.”—Anthony Doerr, Boston Globe",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Physics",
    "Popular Science"
  ],
  "author": "Matthew Hedman",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/2061909.The_Age_of_Everything"
}