{
  "title": "Taking Flight",
  "description": "Wedding bells ring in the distance as the cold wind, whips through the small town of Dexter Georgia. Angel smiles longingly at her parents as they stand hand in hand exchanges vows. A rough childhood and a bank account full of money has made him the man he is today. Cars are his hobby but women are his passion. The sound of engines and smell of timber fill the waking hours, but at night the darkness fills more than night sky.Can he control himself enough to hold on to the one person who fate brings to his life.Willow, had everything she ever needed in life, until the day her mother passed.  With a controlling money driven grandmother, she falls into line. The life that is expected of her. Allied Linc, is one of the largest finance companies on the Florida coast. It was there she met her soon to be husband Duncan. Struggling with her overpowering family has made life tough for Willow, her every move is reported to the matriarch of the family, thoughts of running away from it all were a daily occurrence until she met Duncan.As time passes the days get easier to bear, with Duncan by her side. Planning their wedding, Willow is distracted from all the lies and deceit that play out in front of her.Running from all she holds dear, everything she called home. She is now faced with one of the biggest challenges of her life. Falling to the mercy of Sharon and her husband her troubles are far from over.The sound of his voice, does more to her than she ever thought possible. Her emotions rage when he is around. Hidden away in his cabin, Parker fights with the attraction. She has fought his every attempt, his money only pushes her farther away.Time passes, as quickly as the night. Avoidance is key, but when tragedy strikes. They are thrown together, holding on to the memories of happier times.",
  "genres": [],
  "author": "Nicky Jayne",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/20619151-taking-flight"
}