{
  "title": "Изплези си езика",
  "description": "Това е първата и последната книга на Ма Дзиен (1953), издадена в родния му Китай. Репресиран през 1983 г. като “буржоазен” художник, той заминава на тригодишно импровизирано пътешествие, от което се връща писател: Изплези си езика е резултат от скитанията му и неговият начин да разкаже Тибет с обичаите, красотите, тъгите и ужасите му. Литературният му дебют – документални наблюдения в художествена обвивка – е окачествен в Китай като “пошла книга, която петни образа на тибетците” и е забранен, заедно с всички следващи произведения на Ма Дзиен. Истината е, че Изплези си езика е пълна със съчувствие и удивление, без помен от цинизъм. Сред величавите пейзажи и разредения въздух на Тибет хората изглеждат дребни, странни и изгубени, но това не пречи на автора да говори за тях с разбиране. Разказите на Ма Дзиен се фокусират върху няколко покъртителни женски съдби, едно “небесно погребение”, едно завръщане от големия град, планински преходи, пасища с якове, сънища, срещи, истории в историите. С предговор за българските читатели от автора и илюстрации на Люба Халева.Да се оплезиш е начин – прост и сигурен – да получиш диагноза. Но то е и гримаса, предизвикателство... Пет терапевтични разказа, пет документални легенди.– Il Sole 24 OreМа пише блестящо за дълбоката самота на тибетските пустоши и за високопланинските плата, но е еднакво умел и в щекотливите или рисковани вътрешни пейзажи... Ефектът: далечни антропологически събития стават толкова вихрено реални за читателя, че го карат да се задъхва.– The IndependentС пестелив език Ма Дзиен ни дава неповторим ракурс към живота на екзотичното, криворазбрано заварено дете на Китай... Разказите му предлагат образ на Тибет, който възбужда сетивата и същевременно разклаща романтичните ни представи за тази култура. Чрез описанията на обикновени хора, чиито преживявания ни стават близки, колкото и несгодите им да са ни непознати, тези истории ни позволяват да излезем от собствените си ограничения... – Words Without BordersМа Дзиен е рядко оригинален писател – книгите му с лекота съчетават нюх за авангардното и неудобен хумор, неизменно подплатени с гняв към социалните процеси, които текат през последните 30 години в Китай.– The GuardianКаква е работата на литературата, ако не да отправи поне някое малко предизвикателство към битийната среда на човека и към самия човек? Дори въпросното предизвикателство да не промени нито обществото, нито индивида, то поне е израз на достойнство. За мен не е важно към кое течение принадлежи Ма Дзиен – от творбите му виждам, че той притежава точно такава смелост и достойнство... Неговите произведения винаги са били резки и директни: в търсенето на литературната форма, той не пренебрегва човешките кризи. С хладен поглед и без да вдига излишен шум, той наблюдава житейските състояния на хората и това придава на творбите му огромна тежест. – Гао Синдзиен, из Отново за отминали нещаТибет от разказите на Ма Дзиен е чужд на екзотиката. Правдивостта в описанията на писателя хроникьор отваря едни съвсем близки врати към тази далечна територия на опасностите.– Página 12Ако в съвременната китайска литература има някой, който да е стигнал до крайност, то това е Ма Дзиен. С години никой друг не е поддържал подобен абсолютен усет към литературата, такова честно отношение, такова неподвластно на ежедневието чисто литературно експериментаторство.– Чън Сяомин, из Крайният Ма ДзиенАбсурдът дотолкова е проникнал в живота на китайците, че може направо да се каже, че се е превърнал в техен начин на живот. Всъщност реалността е далеч по-абсурдна от разказите ми... Да пътуваш сред океан от безсърдечни хора е приключение, по-трудно от изкачване на снежен връх.– Ма Дзиен",
  "genres": [
    "China",
    "Fiction",
    "Short Stories",
    "Asia",
    "Asian Literature",
    "Travel",
    "Historical Fiction"
  ],
  "author": "Ma Jian",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/20624389"
}