{
  "title": "Separation of Church and State",
  "description": "MURDER IN THE HALLS OF THE SUPREME COURTTim Lewis is an up and coming young journalist, a protégé of powerful news executive Anthony Merkel and guest host of the award winning program, Law for Lunch. When Lewis unwittingly records one of Merkel’s private conversations, he discovers his boss is a secret member of the murderous Society for Human Enlightenment and party to a plot to assassinate Supreme Court Justice Benjamin Kahn. Kahn’s elimination is planned as a prelude to the kind of slaughter not seen since the holocaust.Lewis is discovered, but saves the recording and runs, pursued by the relentless Alan Williams and several of the Society’s feared operational security teams. The Fellowship of the Essentials mobilizes Team Leader Ted Kehr and such men as they have, but Lewis trusts no one. In the end, Lewis is the only one standing between the Society and genocide. His only hope is to return to the woman he loves, but knows betrayed him years ago.Praise for the writing of Joseph Max LewisThe Diaries of Pontius Pilate\"Lewis has written a nail-biting thriller that jumps into action on page 1 and doesn't stop until you reach the back cover. Don't open this book unless you're sitting in a comfortable chair with good reading light, because you won't want to move.\" - Thom Lemmons, Christy award winning author of A Novel, and Blameless.Just Verdicts – Literary short stories\"Amazing! Three stories that are so real, so heart-breaking...reads like ripped from the headlines. Very good . . . The author's background sizzles and if you don't know him, you'll want to acquaint yourself promptly.” - Lisa J. Lickel, editor in chief of Creative Wisconsin, the literary magazine of Wisconsin Writers Association.Joseph Max Lewis served as a member of an Operational Detachment in the U.S. Army's Seventh Special Forces Group, the storied Green Berets. During his service Lewis received antiterrorist training and his detachment was tasked to \"Special Projects.\" Afterward, he served as an instructor at the Special Forces Qualification Course. Lewis attended the Pennsylvania State University, where he was elected to Phi Beta Kappa, the University of Tel Aviv in Israel, and the University of Pittsburgh, receiving degrees in International Politics and Law while being certified in Middle East Studies. After living and studying abroad, first in the Middle East and then Southeast Asia, Lewis returned home to practice law. He’s a columnist in the New Bethlehem Leader-Vindicator and currently lives, writes, and practices law in and around Pittsburgh, Pennsylvania.",
  "genres": [
    "Thriller",
    "Christian Fiction",
    "Christian",
    "Fiction"
  ],
  "author": "Joseph Max Lewis",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/20626064-separation-of-church-and-state"
}