{
  "title": "The Downhill Lie: A Hacker's Return to a Ruinous Sport",
  "description": "Ever wonder how to retrieve a sunken golf cart from a snake-infested lake? Or which club in your bag is best suited for combat against a horde of rats? If these and other sporting questions are gnawing at you, The Downhill Lie, Carl Hiaasen’s hilarious confessional about returning to the fairways after a thirty-two-year absence, is definitely the book for you.Originally drawn to the game by his father, Carl wisely quit golfing in 1973, when “Richard Nixon was hunkered down like a meth-crazed badger in the White House, Hank Aaron was one dinger shy of Babe Ruth’s all-time home run record, and The Who had just released Quadrophenia .” But some ambitions refuse to die, and as the years—and memories of shanked 7-irons—faded, it dawned on Carl that there might be one thing in life he could do better in middle age than he could as a youth. So gradually he ventured back to the dreaded driving range, this time as the father of a five-year-old son—and also as a grandfather.“What possesses a man to return in midlife to a game at which he’d never excelled in his prime, and which in fact had dealt him mostly failure, angst and exasperation? Here’s why I did I’m one sick bastard.”And thus we have Carl’s foray into a world of baffling titanium technology, high-priced golf gurus, bizarre infomercial gimmicks and the mind-bending phenomenon of Tiger Woods; a maddening universe of hooks and slices where Carl ultimately—and foolishly—agrees to compete in a country-club tournament against players who can actually hit the ball. “That’s the secret of the sport’s infernal seduction,” he writes. “It surrenders just enough good shots to let you talk yourself out of quitting.”Hiaasen’s chronicle of his shaky return to this bedeviling pastime and the ensuing demolition of his self-esteem—culminating with the savage 45-hole tournament—will have you rolling with laughter. Yet the bittersweet memories of playing with his own father and the glow he feels when watching his own young son belt the ball down the fairway will also touch your heart. Forget Tiger, Phil and Ernie. If you want to understand the true lure of golf, turn to Carl Hiaasen, who has written an extraordinary book for the ordinary hacker.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Humor",
    "Memoir",
    "Audiobook",
    "Biography",
    "Comedy"
  ],
  "author": "Carl Hiaasen",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/2062743.The_Downhill_Lie"
}