{
  "title": "Teaching Emma Box Set: A Contract of Submission",
  "description": "Emma Box Set 40,000 wordsTeaching Week A Contract of Submission (Part I)Emma Heart starts college with an unusual Human Sexuality-Fetish and Lifestyles. She doesn’t know that her new teacher, Mr. Mark Ryan, is equally as unusual as the course.The class begins with a surprise as Mr. Ryan hands out contracts of submission. By signing on the dotted line, they agree to become his subs, empowering him to teach them as a dom. The lessons that follow thereafter will not be learned from a book, but from a body.Teaching The Master/sub Experience (Part II)Having faced week one, Emma anxiously awaits week two's adventures. However, if Emma's stepfather Ray and boyfriend Kyle get their way, she'll think twice before returning to partake in the lesson.Having accepted Emma as his classroom sub, Professor Ryan begins to question his decision. Feeling stronger for his student than expected, he realizes only heartbreak can come from a six week affair. The only choice is to hand her to another. The question is...can he?Teaching Emma Week Freedom of Submission (Finale)After Ray discovers the secret relationship, Emma and Mark are separated. Unable to accept such a punishment, the professor confronts his student’s guardian. The abusive man at home is offered a deal he can’t refuse.Forced to move their class to another location, the Doms and subs continue to receive lifestyle training. While acquiring many new sexual skills, they await completion of the six-week college course. If Emma and Mark can avoid prosecution before semester’s end, their love will endure. Though if Ray gets to them first, he’ll tear them apart forever. This 40,000 word story contains erotic romance, graphic language, BDSM, erotic situations, sex, anal sex, oral sex, public gyno exam, bondage, spanking, exhibition, swinging, voyeurism, domination, submission, humiliation and is a story for adults (18+)",
  "genres": [],
  "author": "J.D. Grayson",
  "average_rating": "4.89",
  "url": "https://www.goodreads.com/book/show/20632436-teaching-emma-box-set"
}