{
  "title": "Broken Promise",
  "description": "While Nial, Winter and Sebastian are on their honeymoon, Nial relates the story of how he once lied and broke his promise. In his own words, Nial describes the horrors of war, and the tangled ideals of loyalty, while revealing the conflict he feels over the long existence of a vampire and the much shorter but sweeter life of humans – especially one of his most favorite humans, Sebastian.  A short story filled with anger, remorse...and love.  WARNING: This romance contains two hot, sexy alpha heroes. There is explicit and frank sexual language. It includes a single heart-stopping sexual scene between the aforementioned sexy heroes. Don't proceed beyond this point if hot love scenes offend you. No vampires were harmed in the making of this story. ___  This is a Blood Drops book. Blood Drops are short and novella length stories featuring the characters and situations in the Blood Stone series. Droplet sized morsels for your reading pleasure.  The Blood Stone series: Blood Stone 1: Blood Knot (#1 Amazon Best Seller, Fantasy Romance) Blood Drops 1.1: Southampton Swindle Blood Drops 1.2: Broken Promise Blood Stone 2: Blood Stone Blood Stone 3: Blood Unleashed Blood Stone 3.5: Blood Drive – Blood Stone Boxed Set 1 Blood Stone 4: Blood Revealed (Upcoming)  These are continuing characters and storylines. Reading the series in order is strongly recommended. Click here for series information.  PRAISE FOR THE BLOOD STONE SERIES:  Intriguing plot and fresh vamp world to explore. I can only hope and pray that Tracy plans on continuing and making this a series of some kind, because I would love to read more about this world she created. Amazon Reader  Tracy Cooper-Posey’s writing keeps you on the edge of your seat, laughing out loud and wanting to use a fan to keep the heat out. Amazon Reader  This is one of those hidden gems in the self-publishing world. The Romance Studio  I don’t want this series to ever end. Amazon Reader. ___  Tracy Cooper-Posey is an Amazon #1 Best Selling Author. She writes erotic vampire romances, hot romantic suspense, paranormal and urban fantasy romances. She has published over 70 novels since 1999, been nominated for five CAPAs including Favourite Author, and won the Emma Darcy Award.  She turned to indie publishing in 2011. Her indie titles have been nominated four times for Book Of The Year and Byzantine Heartbreak was a 2012 winner. She has been a national magazine editor and for a decade she taught romance writing at MacEwan University.  She is addicted to Irish Breakfast tea and chocolate, sometimes taken together. In her spare time she enjoys history, Sherlock Holmes, science fiction and ignoring her treadmill. An Australian, she lives in Edmonton, Canada with her husband, a former professional wrestler, where she moved in 1996 after meeting him on-line.  Her website can be found at http://TracyCooperPosey.com. Tracy appreciates hearing from readers and can be reached at Tracy@TracyCooperPosey.com.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "M M F",
    "Vampires",
    "Paranormal Romance",
    "Novella"
  ],
  "author": "Tracy Cooper-Posey",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/20631679-broken-promise"
}