{
  "title": "Snake Oil is Alive & Well \"The Clash between Myths and Reality: Reflections of a Physcian\"",
  "description": "Dr. Tavel, a physician and internist/cardiologist, has managed patients for many years. He has generated more than one hundred research studies which have appeared in a variety of the major peer-reviewed medical journals and has participated on the editorial boards of several of them. He is the author of an internationally recognized book on cardiovascular disease and has contributed to numerous other medical books. Holding a faculty position (clinical professor) at Indiana University School of Medicine, he regularly instructs medical trainees at all levels.Because of the many misconceptions he has encountered from both laymen and many of those involved in medical care, Dr. Tavel has now turned his attention to the general public. In this hard-hitting book, he attacks misinformation covering health matters of all types. Snake oil is a term metaphorically applied to the many methods of treatment that lack scientific credibility, including quackery of all types, alternative medicine, procedures such as acupuncture and chiropractic medicine, misinformation about diets, vitamins, and other dietary supplementation, antioxidants, and many others.His thoughts also extend to the less obvious myths surrounding such diverse topics as the tricks performed by the so-called ethical pharmaceutical companies, and the illusion surrounding the apparent success of all types of medical management—both conventional and outlandish—much of which can be explained by the so-called placebo effect. Understanding these myths can pave the way toward healthier living and better medical care, while at the same time, reducing personal expenses.In the process of dispelling myths, Dr. Tavel presents a detailed analysis of how biases and myths are formed, which, in itself, can lead the individual toward better self-awareness and more profound understanding of many issues beyond health. These include such diverse subjects as why the self-proclaimed experts are usually wrong about the stock market, odds at sporting events and casinos, and even why our political leaders are so often prone to false conclusions.Dr. Tavel’s insights provide useful information to everyone--especially to those giving or receiving care and advice about matters of health.",
  "genres": [
    "Nonfiction",
    "Science",
    "Medicine"
  ],
  "author": "Morton E. Tavel",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/20630000-snake-oil-is-alive-well-the-clash-between-myths-and-reality"
}