{
  "title": "Elmer Keith's Big Game Hunting",
  "description": "For more books like this, please visit www.SportsmansVintagePress.com Originally published in 1948, there is a very good reason why this book can be regarded as the bible of big game hunting for expert and novice alike. That reason is Elmer Keith, widely-known guide, hunter, marksman, ballistics expert and cartridge designer, writer and editor on big game subjects in the United States. Elmer Keith is no hunting season expert; he lived the year round in the wilds within hiking distance of the haunts of bear, elk, deer, goat and moose, and he lived in the wilds his entire life. He has hunted these and other American big game since he was a boy and his pack trips took him into the remotest sections of British Columbia, Alberta, Alaska and the Yukon. From his years of experience Elmer Keith has winnowed an enormous mass of knowledge about the animals themselves, a rich fund of exciting animal and hunting stories, and endless detailed knowledge about loads, rifles, hunting methods and techniques. His book is an encyclopedia of pertinent and authoritative information presented by a man who is above all a sharp observer. Chiefly, Elmer Keith’s Big Game Hunting is a book of facts. It also contains the flavor of the wilds and glimpses of the scenic grandeur of canyon and mountain, forest and plain. It is a book to be enjoyed by the man who must, temporarily at least, do his hunting vicariously through the experience of others, as well as a book for the active expert. In addition to the author’s original, first-hand, and factual approach to big game, hunters will appreciate the other material in this book. For the first time in a book on big game hunting they will find chapters on How to Look for Game, Judging Trophies before Shooting, Tracking and Managing Wounded Game. And these chapters, as all of the others, offer them the tested methods of a fellow hunter whose own trophies listed in The Record of North American Big Game include three heads of antelope, two for grizzly, one for cougar, and one for stone sheep.",
  "genres": [],
  "author": "Elmer Keith",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/20630205-elmer-keith-s-big-game-hunting"
}