{
  "title": "Lucky 7 Bad Boys Contemporary Romance Boxed Set",
  "description": "***Seven fabulous books on sale for only 99 cents for a short time.***  Get lucky with a bad boy. . . .Whether he's a rock star, a billionaire, or a playboy magician--whether he wears work boots or a suit and tie--bad boys have one thing in common: how good they can make a woman feel. This contemporary romance boxed set sizzles with SEVEN full-length novels by SEVEN bestselling authors, starring SEVEN unforgettable bad boys who will make you melt.The Perfect Mix by Charity Pineiro, New York Times Bestselling Author. Contractor Rey Ramos has good looks, brains, money, and a heart of gold. But Rey also has a deep dark secret that could scare off his new client, Bianca Martinez, the woman who has captivated him. Rey isn't eager to share the ugly reality of his past with Bianca and it would be totally foolish to fall in love with her, but Bianca is too tough to resist. . .Heart Raider by Sophia Knightly, USA Today Bestselling Author. Stranded together during a rampaging hurricane, hot passion explodes between reclusive billionaire, Nick Cameron, and headstrong reporter, Veronique \"Ronnie\" Whitcomb. Ronnie is seeking Nick's exclusive story...a story that could get her killed. Nick will risk his life - and his heart - to keep her alive. Try as he might to deny his feelings for her, keeping Ronnie at arm's length becomes impossible.Naughty Vegas Nights by Tawny Weber, USA Today Bestselling Author. Tired of her jinx-cursed love life, Natasha Stover figures the only way to fix it is to get naked and naughty with the guy who ruined her for all others. And Lady Luck is on her side.... A weekend in Sin City being a bad boy's favorite toy just might be the cure Natasha's been wishing for.Warrior's Bride by Nina Bruhns, International Bestselling Author. Bad boy lawyer Coleton Lonetree never expected to find the love of his life at an Indian powow. But when he takes the beautiful stranger into his arms, he is determined to make her his for all time, and stakes his claim in the most elemental way. The next morning, Rini Herelius finds herself hopelessly in love with her intriguing mystery-man--and pregnant with his child. More than anything she wants to keep him and her baby, but Fate has a way of spinning things out of control...turning heated lovers to passionate enemies.Driven to Date by Susan Hatler, International Bestselling Author. Jill Parnell is all work and no play until her hard-earned promotion is handed to the boss's nephew, Ryan Shaw. Ryan is gorgeous, has the office women swooning, and his blasé work attitude drives Jill insane. To get her mind off work and Ryan, she focuses on dating--every man except the one she can't stop thinking about.Bedding The Wrong Brother by Virna DePaul, National Bestselling Author. After a bad breakup, Melina enlists her childhood friend Max to tutor her in the art of passion. But she's in for a surprise when Max's twin brother Rhys steps up to the challenge.... Both sultry and sweet, this story is rated HHH (\"Heat, Heart & HEA\") and involves a bed mix-up, hot identical twins, sex lessons, naughty word games, light restraint, a shy sex bomb who's afraid she's boring and a playboy hero determined to prove she's got everything he'll ever need.Crazy in Love by Kristin Miller, National Bestselling Author. Historical inn owner Rachael McCoy has one simple rule: Don't date guests. Too bad rock star playboy Cole Turner has come into town and is determined to change her mind. After botching his last performance, Cole's looking for peace and quiet to regain focus, but finds so much more in the shy, but sexy innkeeper.",
  "genres": [
    "Anthologies",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Amazon",
    "Collections",
    "Adult"
  ],
  "author": "Charity Pineiro",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/20631443-lucky-7-bad-boys-contemporary-romance-boxed-set"
}