{
  "title": "Happy Hour is 9 to 5",
  "description": "Hard day at the office? We should expect more from the 9 to 5, argues entrepreneur and happiness expert Alexander Kjerulf. Managers should make it a priority too: this book is packed with data that shows that happier people are more productive, more innovative, more motivated, deliver better customer service AND handle change better. Happiness at work may sound a pipe dream but achieving it is actually quite possible. First, we need to understand what it’s not. It’s not about high-fiving and cheerleading (although it could be for some people). It’s not about eliminating all the bad stuff from our job – it’s about being happy at work even though some of those bad things are present. Research across 30 countries shows that happiness at work rests on results and relationships. Happy Hour is 9 to 5 gives detailed, practical advice on building the skills and energy to improve both.Here you’ll learn how to deal with everything from nightmare bosses, bullies, miserable co-workers, long-running conflicts, stifling bureaucracy and management who refuse to see anything beyond the bottom line. It’s also full of inspiring real-life stories: of a temp worker cheering up her co-workers with small, random acts of kindness. A group of nurses rebel against the hospital’s sour mood and turn their ward into a happy place. A programmer at a bank learns what it takes to turn his department from boring to fun. Alexander speaks from his own experience, both as co-founder of the Danish IT Company Enterprise Systems and as an expert on workplace happiness for clients including Hilton, Microsoft, Lego, Ikea, Shell, HP and IBM. His work has been featured in the Sunday Times, New York Times?, and BBC Radio 4’s In Business. www.positivesharing.com Happy Hour is 9 to 5 is an outstanding book because it reminds us of the importance of our health and wellbeing. Read this book!’ Professor Cary L. Cooper, CBE",
  "genres": [
    "Nonfiction",
    "Business",
    "Self Help",
    "Psychology",
    "Personal Development",
    "Management",
    "Leadership"
  ],
  "author": "Alexander Kjerulf",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/20642240-happy-hour-is-9-to-5"
}