{
  "title": "The Nocturnal",
  "description": "London was no stranger to war. The Blitzkrieg bombing raids by Nazi Germany during the second World War had decimated the city, but they would rebuild. Years of terrorism from the Irish Republican Army threatened its safety, yet London endured. But those were merely human conflicts, fleeting in comparison with a war now being fought in the moonlit streets and blind alleys of England's capital. For decades, battles have been waged in secret between two rivals, the English government and mankind's greatest enemy, the Vampires. Throughout modern history, the clandestine war has been fought in the shadows of the mortal world. The Kilpatrick Organization is a top secret, government sanctioned, watchdog agency tasked with the responsibilities of dealing with the undead, and all other supernatural threats. After countless years of hunting them, the leader of the organization, Jonathan Kilpatrick, knows the war is finally coming to an end. Ten years of bloodshed and population control has resulted in the near extinction of the London coven. The Great Coven of Old Europe sends emissaries to ensure the vampires' continued existence. Though their numbers had been denuded, they would replenish and bring it up to strength. And a new enemy would rise. When a string of gruesome murders connected to a mysterious Symbol arise, the organization's number one operative is ordered to search and destroy. Midian, a rogue vampire employed by the Kilpatrick Organization, is London's guardian angel. A vengeance seeker in his own right, Midian dedicates his life to the eradication of the human's savage enemy. Unruly vampires fill his veins with hatred and revulsion. His tireless quest to rid society of the undead weighs heavily on his shoulders and the organization he serves. Unbeknownst to them, the Kilpatrick Organization finds themselves in the cross hairs of an unknown enemy bent on their destruction. A union forms between the vampires and this new antagonist. And if the situation couldn't get any worse, vampires begin to run a muck in the Greater London Area, breaking the code of secrecy, and turning the city into their own feeding ground. Now, Midian must find the source behind the mysterious Symbol before the city of London falls to the Nocturnal.",
  "genres": [],
  "author": "J.P. Starling",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/20642079-the-nocturnal"
}