{
  "title": "Sergeant Cuddlington and The War At Sea",
  "description": "This anti-war book contains two short stories about war and politics. One story is about a personal experience of war, and how patriotism and pacifism collide for one soldier. The second story is about war and politics at a national level, where the struggle for dominance sees untold numbers go to their grave. Sergeant Cuddlington is about a special operations team leader (Cuddlington) who is gravely wounded and then saved by the medics back at base. Cuddlington’s glittering service record might be of great use as a propaganda tool, if only he has the right attitude. His surgeon, Doc, is determined to find out if he has. The War At Sea surrounds the power struggles between great populations of mutated beans in a cargo ship, which is filled with radiation. The story studies the changing faces of the bean governments as the different societies react to the war to end all wars.Brief background: Sergeant Cuddlington and The War At Sea is my little anti-war book. It’s a small book made up of two short stories, of which Sergeant Cuddlington is the first. Cuddlington is about a wounded teddy bear soldier who is recounting his experiences of the massive war that he’s been a part of for the last three years. The story talks about war at the personal level – what are the Sergeant’s thoughts about the war, does he think it’s right that he’s at war, does he still believe in what he’s doing, what are his thoughts on killing? Through a short interview conducted to test his suitability as a vehicle for propaganda, Cuddlington takes us through the build-up and the fighting and the politics of the conflict that he lives day in and day out, not because he wants to be there, but because it’s his duty.The War At Sea surrounds a cargo of irradiated beans on a container ship that evolve great societies which, inevitably, fall into a tremendous war that sees casualties beyond reckoning. This story looks at war and the politics of war at the national level, with politics in general and the way in which political systems work being examined as the story goes. As a whole, the book looks at war from the personal level to the national level and its message is clear – if the public had unrestricted access to the facts and a true voice in setting policy, wars would be far harder to start and become involved in than they are currently.",
  "genres": [],
  "author": "Michael Pugh",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/20639570-sergeant-cuddlington-and-the-war-at-sea"
}