{
  "title": "Writing Our Song",
  "description": "For aspiring singer, Beatrice Hampton, the future used to be a sweet thing to look forward to, filled with the kind of joy you could write a song about. However, after losing her parents while still in high school, she is left crushed, alone, and harboring a bitter resentment towards the wealthier members of society, whom she partially blames for the destruction of her hopes and dreams. After years of lonely struggle, she can hardly remember the last time she felt happy.That's when she literally stumbles into billionaire Jeremy Holt and things take another turn for the unexpected. Seeking only a temporary escape from the cold and grey confines of her life, Beatrice agrees to go with Jeremy on a short trip to New Zealand. On the surface Jeremy is the exact kind of man she promised herself she would never fall for but, after spending some time with him, she realises that maybe there's a lot more to the successful young entrepreneur than his money. Maybe he's the one person that can make her feel alive again.Beatrice can't deny the spark, the chemistry, between the two of them but her past still haunts her. To be with Jeremy she must face the stresses of life in the public eye and the guilt of broken promises to herself and her parents. To be without him is almost too painful to bear. Will Beatrice and Jeremy get the chance to write the song of their love, or will they each be left with the memory of a beautiful but all too brief time when their lives intertwined?Excerpt: \"...When we entered the house and kicked our shoes off, I led Jeremy by the hand straight up the stairs and paused by the entrance to my bedroom. This was my last chance. If I wanted to stop right here, I could. I could just say goodnight and go to my room alone. If not, then I was lost to the most basic and animalistic needs of my body.I turned and looked up into his eyes, seeing the barely restrained lust I felt reflected in their depths too. My right hand reached up and felt his chest through his shirt, running downwards until I could feel his clearly defined abs through the light material.Each muscular bump of his body under my palm was like another nail in the coffin for my resistance and when Jeremy moved against me, pressing my back against the wall next to my bedroom door, I felt another hard bulge against my stomach that sent my hunger for him into overdrive.Jeremy’s hand buried itself into my hair, gripping lightly but firmly, and pulled me into another kiss, the tip of his tongue reaching out to lightly brush against my own before we parted again and he rested his forehead against mine. Our eyes were only inches apart. If they truly are the window to the soul then it felt like Jeremy had front row seats to mine, like he could see everything and wasn’t running away...\"",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Amazon",
    "Fiction",
    "Music",
    "Chick Lit"
  ],
  "author": "Emma South",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/20643429-writing-our-song"
}