{
  "title": "Summer's Winter",
  "description": "When Jeanine finally connects with film star Jamie Newkirk, the object of her obsession, will it be a dream come true? Or will she be pulled into his family's nightmare of secrets, control, and death? At age ten, preacher's daughter Jeanine fell in love with young movie star Jamie Newkirk and the character he played--Danny Summer. Jeanine believed God Himself promised Jamie would be part of her life--that he would rescue her from boring rural Georgia. But eleven years later, she's graduating college and about to settle into the dreary nine-to-five life with no word from Jamie or God. And then Jamie bursts into her life in an amazing way. There are plans to resurrect the Summer series of books and movies, and Jeanine is right in the middle of it all. Jamie seems to be falling for her, just as she'd dreamed. And yet... She never expected all the dark undercurrents. Jamie is hiding out in Georgia following the suspicious death of his former girlfriend. And isn't it odd that he found his mother dead of a supposed suicide in that same house two years before, and that both women had the same strangely-shaped burn on their bodies? And who knew there would be so many sinister characters involved in Jamie's life, and in the Summer series? There's his young co-star, Charlie--the Summer author died in an unexplained fire at his house. And Jamie's stepfather, Elliott, and uncle Richard seem to be in a vicious competition for control of the Summer series and of Jamie's life. Jamie is obviously hiding things--about his family, about the deaths of his mother and girlfriend. The media and the public have declared him guilty. Jeanine longs to prove his innocence. Unless she can, Jamie's dark secrets may shatter her dreams, her faith--and her life.Even when we mortals don't understand, God's plan is unfolding around us. Summer's Winter is an incredible mystery that teaches us to believe in that divine plan for our lives. The twists and turns in Summer's Winter kept me reading into the night...I couldn't wait to reach the end! Robin Johns Grant's Summer's Winter is a heartwarming read in which good and evil collide. I loved it!~Nancy Grace, HLN host and author of The Eleventh Victim and Death on the D-ListPart murder mystery, part Hollywood dream-world and part thought-provoking Southern lit, Summer's Winter takes the reader on a romantic ride, filled with movie-star moments that plummet into hair-raising hairpin twists and turns. Jeanine and Jamie's relationship crackles with sparring, spirituality and suspense, leading to an ending worthy of your favorite Hollywood finale.~Elizabeth Musser, author of The Swan House and The Sweetest Thing Show less",
  "genres": [
    "Contemporary Romance",
    "Mystery"
  ],
  "author": "Robin Johns Grant",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/20638278-summer-s-winter"
}