{
  "title": "Just a Nice Guy",
  "description": "Is it true that nice guys finish last? It sure seems that way as a divorced man fights his way through a comedic dating scene. Will he ever find his soul mate? Phil has been called the male version of Carrie Bradshaw. Enjoy his humorous essays about relationships and the struggles we all have finding and keeping lovers. Women appreciate his open view into the minds of men. Artist Mike Swaim adds to the hilarity with his brilliant sketches, giving another dimension to Phil's quest for love.Excerpt from Just a Nice Guy - Commitment Test for MenMen say they are ready for monogamy, but are they just saying that to hasten the clothing removal process? I've put together a simple test a woman can give her man to see if he is truly ready or just a horny bastard.1. When I see Kim Kardashian's butt on TV, I ...a.    Drool.b.    Sport wood.c.    Give thanks and praise.d.    Change the channel.2. The thing I look forward to most about getting married is ...a.    The built-in maid I get to have sex with.b.    The bachelor party.c.    Not having to date.d.    Companionship.3. If my woman asks me to stay home with her and watch Grey's Anatomy ...a.    I laugh, grab my keys, and head to the nudie bar.b.    I whine and pout.c.    I agree, as long as she agrees to provide oral favors afterward.d.    I rub her feet while we hang on every word.4. Her friends make me want to ...a.    Touch myself.b.    Wear noise-cancelling headphones.c.    Find excuses to avoid them.d.    Be one of the girls and hang out.5. If times get tough and we have to move in with her parents ...a.    I'll beg to be euthanized.b.    I'll become a meth addict.c.    I'll lock myself in a room and play Xbox.d.    I'll contribute by doing household chores and mowing the lawn.6. A fun honeymoon would include ...a.    My bride's confession of bisexuality.b.    Seats along the third base line.c.    A topless beach.d.    Riding horses on the beach with my new soul mate.7. Once married, I would no longer ...a.    Trim my ball hair as often.b.    Chase curvy women on Plenty of Fish.c.    Hold my farts.d.    Feel incomplete.8. When I come home from work ...a.    Da shawty betta have my dinna ready ... yup, YUP!b.    I hope to find my wife naked on the pool table.c.    I look forward to a peaceful dump while reading the newspaper.d.    I'll hand my lovely wife flowers and ask how her day was.",
  "genres": [],
  "author": "Phil Torcivia",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/11169684-just-a-nice-guy"
}