{
  "title": "American Colossus",
  "description": "In a grand-scale narrative history, the bestselling author of two finalists for the Pulitzer Prize now captures the decades when capitalism was at its most unbridled and a few breathtakingly wealthy businessmen utterly transformed America from an agrarian economy to a world power. The years between the Civil War and the end of the nineteenth century saw the wholesale transformation of America from a land of small farmers and small businessmen into an industrial giant. Driven by unfathomably wealthy and powerful businessmen like J. P. Morgan, Andrew Carnegie and John D. Rockefeller, armies of workers, both male and female, were harnessed to a new vision of massive industry. A society rooted in the soil became one based in cities, and legions of immigrants were drawn to American shores. What’s more, in accomplishing its revolution, capitalism threatened to eclipse American democracy. “What do I care about the law?” bellowed Cornelius Vanderbilt. “Hain’t I got the power?” He did, and with it he and the other capitalists reshaped every aspect of American life. In American Colossus, H.W. Brands portrays the emergence, in a remarkably short time, of a recognizably modern America. The capitalist revolution left not a single area or aspect of American life untouched. It roared across the South, wrenching that region from its feudal past and integrating the southern economy into the national one. It burst over the West, dictating the destruction of Native American economies and peoples, driving the exploitation of natural resources, and making the frontier of settlement a business frontier as well. It crashed across the urban landscape of the East and North, turning cities into engines of wealth and poverty, opulence and squalor. It swamped the politics of an earlier era, capturing one major party and half of the other, inspiring the creation of a third party and determining the issues over which all three waged some of the bitterest battles in American history. Brands’s spellbinding narrative beautifully depicts the oil gushers of western Pennsylvania, the rise, in Chicago, of the first skyscraper, the exploration of the Colorado River, the cattle drives of the West, and the early passionate sparks of union life. By 1900 the America he portrays is wealthier than ever, yet prosperity is precarious, inequality rampant, and democracy stretched thin. American Colossus is an unforgettable portrait of the years when the contest between capitalism and democracy was at its sharpest, and capitalism triumphed.",
  "genres": [
    "History",
    "American History",
    "Economics",
    "Nonfiction",
    "Politics",
    "Business",
    "19th Century"
  ],
  "author": "H.W. Brands",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/11169043-american-colossus"
}