{
  "title": "Deities and Desires",
  "description": "In a world where Zeus and his Olympians have reigned as the undisputed gods of the mortals for eons, these all powerful immortals are being forced to usher in a new era for mankind, one with modern gods, the New Titans. After subjugating mankind to their whims for far too long, the world of man has changed away from the Olympians to desiring gods that will change with it. Zeus and his Olympians have become obsolete and they are now being forced to hand over the 'god' reins to this new breed of gods.These New Titans or Modern Gods were born for the technologically advanced civilization they will soon reign over. Gods like O.P., L.O.L., and T.L.D.R. will take Man to the next level, but there is only one problem: Zeus is taking his time transferring the reins. The world is stuck between old gods that want to milk their rein for as long as possible and new ones that grow more and more impatient for their destiny to begin. Some mortals refuse to accept the New Titans and some cannot wait to get rid of the Olympians. Still, others are seeking another god, one that is old and nearly forgotten by the name of Xenodios. Hector Sole, a mortal man, a believer in the Olympic gods, has seen his share of wrath from them. His faith to them has remained true and unwavering. Even after Athena cursed him and lured him to her bed, he still hangs onto the old faith. But with the ascension of the New Titans, he fears the world as he knows it will change for the worst. Aegila Hart, a mortal woman and believer of the old faith, has seen her share of wrath from the Olympic gods as well. Strong-minded and strong-willed, she had embraced the god Xenodios with all of her being since childhood, believing he is the answer to everything. Her faith endeared Hector to her while he's been under Athena's curse. Now with the world seemingly spinning into chaos, Man begins to question the powers and the motives of these New Titans. They are bland and have failed to inspire greatness. Athena was one Olympian, who had once spurred the likes of Theodore Roosevelt and Napoléon into greatness- yet her New Titan replacements have shown nothing even close to inspirational. This is troubling but instead of turning back to the Olympians, the world slowly begins to divide into Modern Gods zealots and Xenodioceans. It is inevitable that these two faiths will clash and so will their gods. The only trouble is that possibly no one has ever seen Xenodios before. Is he real or just a figurehead to a faith based on half-truths and stories? The New Titans are real. They can be seen and touched and heard. It would seem the same cannot be said for Xenodios. Amidst the speculation and a unforeseen turn of events, Hector commits to Xenodiosism and while visiting Aegila, is thrown into helping the spread of the word of Xenodios in America. Hector isn't prepared for what he experiences. He finds praise, glory and reverence, but also discrimination, hate and pain. It is such a powerful, albeit humbling, experience for him as he has chosen Xenodios over the Olympians and the New Titans. O.P., the ruler of the New Titans, has begun a quest to expose Xenodiosism as a sham and to prove that Xenodios is nothing more than a false god. An all-out war is brewing, a war that could sunder a thousand earths a thousand times over and Hector and Aegila find themselves square in the middle of it. Will their faith be enough to save them or will it fail and destroy everything they believe in? In a gripping showdown that could decide the fate of the world's faith and it's people, Hector finds himself wondering what a mere mortal can do to stave off the New Titans. Will his strength and faith be enough to defend his god or will O.P. prove once and for all that Xenodios is a fake?",
  "genres": [],
  "author": "Ruth Ford Elward",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/20639638-deities-and-desires"
}