{
  "title": "Surviving Love",
  "description": "“She is my heart and the other half of my life, and now, that life no longer exists.\" ~Drake Evans, Surviving LoveFor Drake Evans, life was once happy. He was living the kind of existence that any man would envy. By his side was the woman he loved and a daughter he cherished. Life was truly perfect, until the day demons from the past came crashing into their perfect world, destroying everything he had been so sure would last forever. Today, Drake’s life is shrouded in misery. Every day he faces the unyielding pain of losing the love of his life at the hands of a drug dealing murderer. On top of it all, he has to live with the anguishing betrayal caused by the devastating role his brother played in Presley’s death. Gone are the days of carefree happiness and impending futures. They've all been replaced with the shallow emptiness hollowing out his heart and the undeniable rage pumping through his veins. Drake is only moving through the motions of life, raising his daughter and earning a living, in the only way he can tolerate—alone. Since the day she was banished from her family, Zoe Ledoux lives her life as a free spirit. For the past four years, Zoe’s been moving through life day by day, place by place. She never stays in one area long enough to establish relationships. She refuses to get close to anyone, protecting herself from the fear of once again being left behind. Then a turn of fate sends her to Sulfur Heights where she lands a job working as a bartender. In a chance meeting, an instant connection forms, bringing together the wounded souls of Drake and Zoe. It is together that they begin to cope; to mend the brokenness of their pasts and feel what it is like to truly live again. However, will their newly formed friendship be enough to pull Drake and Zoe from their dark pasts? Can Drake overcome the fear of losing someone he loves and eradicate his anger just enough to let someone in? Will he learn that Surviving Love with Zoe is what he ultimately needs in order to be happy?",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Dark",
    "Family"
  ],
  "author": "M.S. Brannon",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/20646271-surviving-love"
}