{
  "title": "Bride of a Bygone War",
  "description": "From KIRKUS REVIEWS A CIA agent working at the U.S. Embassy in Beirut fears his past has caught up to him in the riveting second volume of the Beirut trilogy. Higher-ups transfer Walter Lukash, a seasoned CIA officer, from his tour of duty in Jordan to Lebanon to act as a liaison for a fragile political party. Lukash’s orders are to inconspicuously gather intelligence in hopes of increasing the party’s cooperation with the U.S. Embassy, but that task quickly proves problematic when Lukash’s girlfriend from Jordan shows up in Beirut with ties to a wily Syrian national and an assassination plot. Conrad Prosser, the protagonist from Fleming’s (Dynamite Fishermen, 2011, etc.) previous novel, travels to war-torn Beirut at the behest of a source looking for his daughter’s missing husband—whose name happens to be an alias used by Lukash five years earlier. The winding plotlines make for a gloriously elaborate story as Fleming adeptly weaves through genres amid the suspenseful distrust among the conniving characters, window-shattering action sequences and the understated romantic tension between Lukash and Muna, the woman he left behind. The drama plays against a fiery backdrop of civil war, a setting well established in Fleming’s prior novel and aptly recreated here. This time, the inescapable violence acts as a foreboding a cease-fire breaks the night Lukash arrives in Beirut, where he sleeps in a building riddled with bullets as explosions light up the sky. The rapidly developing plot burns through pages faster than the first time Fleming took us to Beirut. An intelligent thriller teeming with vigor. PRODUCT DESCRIPTION The second book in the Beirut Trilogy, BRIDE OF A BYGONE WAR is set in the spring of 1981, following the American elections, when Lebanon hopes for fresh political winds that might end their seven-year civil war. Enter Walter Lukash, a midlevel CIA officer assigned as intelligence liaison to the Phalange militia. Lukash soon becomes a pawn in a Levantine game intended to draw the U.S. into conflict with Lebanon’s Syrian occupiers. Unfortunately, Lukash is too distracted by problems arising from having abandoned his Lebanese bride five years earlier to see the trap until it springs. Beirut, 1981. Walter Lukash, a journeyman CIA case officer, has been posted in the Middle East for eight straight years and is ready for a quiet desk job back in Washington. When he is ordered to Beirut instead for a two-month secret liaison assignment with the Phalange militia’s intelligence unit, his superiors believe they understand his reluctance to accept. What they don't know is that, five years earlier, Lukash secretly married a Lebanese woman against Agency rules and abandoned her soon after the outbreak of war. More than that, his new Irish live-in girlfriend, whom the Agency considers a security risk, has followed him to Beirut from Amman and Lukash has defied orders to break off the relationship. When the two-month assignment is extended to two years, Lukash realizes he can no longer avoid painful realities and choices. But before he can straighten things out, he is caught in a deadly three-way intrigue between the Phalange, the U.S. government and Lebanon's ruthless Syrian occupiers that threatens to unleash the full force of Syrian-backed terrorism against Americans in Beirut. BRIDE OF A BYGONE WAR captures the unique atmosphere of Civil War Beirut with a lively and intelligent style that draws the reader into deep identification with the characters and the action.",
  "genres": [
    "Thriller",
    "Fiction",
    "Espionage",
    "War",
    "Novels"
  ],
  "author": "Preston Fleming",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/20644821-bride-of-a-bygone-war"
}