{
  "title": "The Medical Librarian's Guide to Natural Mental Health",
  "description": "The thrust of this book is nutrition and complimentary therapies for digital addiction, anxiety, bipolar, depression, and schizophrenia. Useful resources to find authoritative information on all the included mental disorders from the American medical perspective are included. Truisms that have been passed down through the ages about mental health that have stood the rigors of scientific inquiry are presented. The role of nutrition in ameliorating anxiety is discussed. Light is thrown on the benefits of meditation, yoga, aromatherapy, exercise, the healing power of music, and the detrimental effects of playing too many video games on anxiety. Next, the role of nutrition in helping manage bipolar disorder is included. The effect of light on bipolar disorder and the importance of good sleep hygiene is underlined. Then, how nutrition affects depression is discussed. A question relevant to many of us, “What are the effects of being indoors all the time?” is delved into. A long list of things that can be helpful for ameliorating depression is presented natural herbal remedies, meditation, religion, yoga, the effect of too much or too little light, the role of exercise in fighting depression, the role of music on the mood, the role of a positive social network in recovery, the role of pets, the harmful effects of the digital lives we lead, and the healing power of scent. Finally, the amazing fact that nutrition can sometimes prevent psychosis in its beginning stages before it becomes fully-blown schizophrenia is looked at. The effects of eating right, exercising, meditation, the benefits of certain video games on how the mind works, strategies to keep weight off, and how to minimize the damage to the liver from the unhealthy effects of medicine for schizophrenia are discussed. Additional mental health tips added to second edition.",
  "genres": [
    "Psychology"
  ],
  "author": "William Jiang",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/20647098-the-medical-librarian-s-guide-to-natural-mental-health"
}