{
  "title": "Riding Desire: Alpha Bad Boy Bikers",
  "description": "Whether you crave alpha heroes, possessively wicked boyfriends, sexy inked rock stars, or passionately naughty lovers, Riding Desire will fulfill your bad boy biker fantasies like no other boxed set you’ve ever read.This accountant is about to learn that one rough biker plus three of his friends equals a \nHot Ride\n she'll never forget. By Opal Carew.One sexy rookie cop. One seductive outlaw biker. One unforgettable one-night stand. Sarah Castille's sexually explosive \nBurnout\n is a hot and wild ride you won't want to miss!What happens when a reporter looking for a story is thrown inside an outlaw motorcycle club on the verge of war? Drama, action, and lots of hot sex! \nSavage Heart\n by Sara Fawkes.Combine one sassy biker chick with one badass Australian rocker for a full throttle ride in \nOne Wild Ride\n by Lauren Hawkeye, part of the New York Times bestselling Three Little Words series.When Aubrey Rhodes comes face to face with the mysterious bad boy Caleb West, nothing can prepare her for the wildest ride of her life in \nFull Throttle\n by Adriana Hunter.In \nHeart Racer\n, the first of Marian Tee’s new biker series, notorious underground moto racer Leandro Christopoulos needs to convince snarky philanthropist Roberta “Bobby” Granger he’s in love with her…even if he’s not.Mari Carr's latest romance, \nCrash Point\n, proves nothing could be hotter than a former bad boy biker looking to make good, the sexy photographer he loved and left and those sultry New Orleans nights.Who doesn’t love a little rumblin’ between the thighs? Join Tessa Savage on a wicked ride of corruption and seduction in \nHow to Debauch a Biker\n, the latest in the Savage Series by Daire St. Denis.Listen up, adrenaline junkies: your pulse will roar as if you're street bike racing when you meet gorgeous speed junkie Sawyer Tremaine in \nFast and Mine\n by Sharon Page.Delilah is caught between an old crush and a new attraction...she's in for one wild ride. R.G. Alexander's ménage romance \nDirty Delilah\n is guaranteed to rev you up! If you love snarky socialites and dominating NYPD motor cops than get ready to laugh your ass off with \nLove, Lex\n by Avery Aster.Romance, redemption and chrome-plated sizzle! Nothing can bring this Dominant rock star to his knees like the ex-wife he’s never been able to forget in Eden Bradley’s \nObsession\n!When a birthday girl’s plans go up in dust along with her broken down car and lying jerk of a boyfriend, there’s only one hot mechanic who knows how to make it all better in Roni Loren’s \nNice Girls Don't Ride\n. Rev up the heat and take a ride on the wild side with Rio's sexiest off-road motorcyclist in \nConquista\n by Suzanne Rock.",
  "genres": [
    "Romance",
    "Anthologies",
    "Contemporary",
    "Erotica",
    "Contemporary Romance",
    "Erotic Romance",
    "Menage"
  ],
  "author": "Opal Carew",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/20643897-riding-desire"
}