{
  "title": "Sin with the Sleeping Choir Girl 2: Mary",
  "description": "This was the real deal. The Virgin Mary, right in front of me... Mary's mom and dad said that they didn't know where they went wrong. Their sweet choir girl daughter had been staying out late, hanging out with boys, and her parents even suggest that she'd been drinking! They asked me to talk to her as her trusted spiritual advisor. Unfortunately for Mary, when I saw her in her flowery dress, I knew that it would take me all night to minister the good word to her. One thing was for sure, though: When she fell asleep after drinking my sacramental wine, this Mary wouldn't stay a virgin much longer!This 6700 word breeding story features a horny pastor and a lovely virgin girl who just likes alcohol a little too much. It includes sleep sex, deflowering a virgin, and is capped off with an impregnating creampie!She snapped out of it, stopped rubbing herself. \"And then I wanted more. I knew I didn't want to have sex until marriage, but I wanted all of it. I kissed boys any time I could. I rubbed my boobs in their faces. I sucked on their penises. The boys all called me a tease because I didn't go all the way, but I would never.\" She looked right at me. \"I would never go all the way, Pastor Luke. Because I'm saving myself for marriage.\"I smiled. \"I know you are, sweetheart.\"She smiled back, then took another sip of her wine. She yawned again. \"It sure is warm and comfy in this room, Pastor Luke.\"\"I know it is, child.\"\"Can you wake me up when my Daddy gets here? I gotta put my dress back on,\" she asked. Her words were slurring badly now.\"Of course.\"\"Okay thanks,\" she said, then closed her eyes. I took the mostly full glass of wine from her hand before she could spill it all over the place, and she moved her hand to her tit. Her other hand went to her clit again, slowly rubbing herself. She got slower, and slower, and finally she stopped rubbing altogether.I watched for a few minutes. Her breathing stayed constant, rising and falling beautifully. I wanted to make sure she was asleep, and got my confirmation when she began to snore softly. I grabbed her feet in both hands and squeezed gently, wanting to make sure she was truly asleep. No reaction.I smiled and stood up. I stood next to her admiring her beauty. I had wanted her for hours now, and now I would finally have her. I leaned down and kissed her on the lips...",
  "genres": [],
  "author": "Cassandra Zara",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/20651568-sin-with-the-sleeping-choir-girl-2"
}