{
  "title": "Twilight Garden",
  "description": "After graduating from medical school, Sean passes the summer in Scotland to explore the land of his family ancestry. With only a few weeks left before he must return to the States where his promising new career awaits, he goes for a jaunt through the wood nearby his old cottage to soak up the ambience while he can. Twilight is upon him and as he is reluctantly turning back, he suddenly glimpses an ethereally beautiful faerie with a unicorn at her side and becomes instantly smitten with her. However, she vanishes as soon as she perceives him gazing at her. Desperate to see her again, Sean returns to the wood everyday searching for her, to no avail. With only a week remaining ‘til he must depart, his hope is dwindling that he will ever behold her again. Though when a mishap renders him unconscious, he awakens to find himself in an enchanted land surrounded by a myriad of inquisitive faeries who do not feel compelled to conceal their bodies as do humans. Sean endures being probed, prodded and sexually manipulated by these lusty faeries, all the while scanning for the one who led him to this magical place. Finally he sees her, but in contrast to the others, she is modest and utterly indifferent to him. Ironically enough, she is also the only one who conceals herself.Sean is hopeful when gradually she begins to show some interest in him, coming closer and begins to explore him. When he awakes to a dragon snarling right in his face, he fears for his life. That is, until his shy faerie flits over and fearlessly communicates with the ferocious dragon, saving his life.When they join together, a magical transformation takes place within him. He is blissfully astonished until he detects the chaos among the faeries. Before Sean can understand what is happening, he is abruptly torn away from his love and cast back to the wood from whence he came. Will he ever see her again?",
  "genres": [],
  "author": "Rosalind Scarlett",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/20649307-twilight-garden"
}