{
  "title": "Deadly Delicious",
  "description": "Twelve-year-old Josephine DeLune can’t take the heat this sweltering summer of 1955, and she was out of the kitchen long ago. An awful cook, she ruins recipes left and right, and she certainly can’t compete with her family’s reputation for extraordinary food. Her daddy’s parents ran one of the best restaurants in all of Paris, but Josephine lives in Paris, Missouri. On her mama’s side, she’s up against a long tradition of sinfully delicious soul food. Rumor has it, her Creole ancestors cooked up some voodoo to make tasty even tastier. Josephine knows the secret ingredient: she comes from a long line of conjure witches with spellbinding culinary skills.  Disenchanted, Josephine works as a carhop at Carl and Earl’s Drive-In. Just plain old hamburgers, hot dogs, and curly fries, nothing magical about them. She’s got bigger fish to fry, though, when a grease fire erupts into a devilish creature who hisses her name with desire. Turns out he’s the Ravenous One, the granddaddy of all voodoo spirits, and he’s hungry for her soul. Josephine thinks he’s got the wrong girl—she’s no witch—but a gorgeous, dangerous night-skinned lady named Shaula sets her straight. Josephine is one of the most powerful witches alive, so overflowing with conjure that her out-of-control cooking simply catches fire.  Josephine would love to laugh this off, but Shaula warns her that she must learn to master her magic before the Ravenous One devours her soul. Spurred into action, Josephine breaks out her grandma’s old conjure cookbook and starts cooking. Nothing grand, just the usual recipes for undying friendship and revenge. But soon Josephine can’t escape the consequences of her conjure. When the people of Paris start turning into zombies with a strange fondness for cake, Josephine looks pretty responsible for their undead reawakening…",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Supernatural",
    "Magic",
    "Zombies",
    "Mystery",
    "Historical Fantasy"
  ],
  "author": "K.L. Kincy",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/20652347-deadly-delicious"
}