{
  "title": "Il più grande artista del mondo dopo Adolf Hitler",
  "description": "Più pop di Andy Warhol, più eccentrico di Salvador Dalí, più geniale di Marcel Duchamp, Max Fontana, \"il più grande artista del mondo\" secondo alcuni critici, arriva al successo per caso, a quarant'anni, con un gesto casuale, proprio il giorno in cui aveva deciso di togliersi la vita sentendosi un fallito.Da quel momento si trasforma: capelli verdi dal taglio hitleriano (ma \"spettinati alla Jack Nicholson\"), cappotto stile nazi, Nike Shox ai piedi, non c'è colpo che non mandi a segno. Ogni sua opera scandalizza, sconcerta, fa scalpore, fa inorridire. Inavvicinabile come una rockstar, capriccioso come una diva di Hollywood, spiazzante e provocatorio per il puro gusto di esserlo, arriva perfino a indicare in Adolf Hitler un modello artistico da ammirare. Nella sua nuova esistenza da cinica pop star conserva, però, anche un lato tenero: la piccola Martina, una compagna di vita che, impossibilitata a parlare, comunica usando il linguaggio dei segni.Ma Max Fontana è davvero questo formidabile genio? O è solo un furbo truffatore? O addirittura un killer? E soprattutto: perché è scomparso?Sì, perché dopo essere stato protagonista di sensazionali performance tra Roma e Parigi, New York e Las Vegas, e dopo essersi fatto beffe di colleghi, critici, galleristi e giornalisti, alzando sempre di più la posta del suo rischiosissimo gioco tra arte e vita, qualcosa - ancora una volta per caso - è andato storto, e lui è stato costretto, suo malgrado, a indossare i panni del fuggitivo. Braccato da mezzo mondo, ha dovuto lanciarsi in una fuga via via più incalzante, disperata e piena di poesia. Fino al capolinea, naturalmente da artista. Anzi, da più grande artista del mondo.Scandalosamente intelligente - e intelligentemente scandaloso -, questo nuovo romanzo di Massimiliano Parente è un'opera esilarante, coinvolgente e carica di suspense, una satira senza limiti dell'uomo e della società occidentale, l'epica moderna di un ultimo eroe comico universale. Un libro che è anche un'avventura del pensiero, una profonda riflessione sull'esistenza e sulla creazione artistica. La storia memorabile e donchisciottesca di un uomo capace di trasformare la vita e rendere ogni gesto un evento straordinario.E una cosa è certa: alla fine lo odierete e lo amerete, perché nessun artista si è mai spinto né potrà mai più spingersi fin dove ha osato Max Fontana.",
  "genres": [],
  "author": "Massimiliano Parente",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/20651792-il-pi-grande-artista-del-mondo-dopo-adolf-hitler"
}