{
  "title": "Rhapsody",
  "description": "The only woman Raphael has ever loved does not know he exists...  Raphael is a Guardian Angel with a predicament. He has fallen desperately in love with one of his charges. Ever since Grace was a child, Raphael saw something extraordinary in her. But in her world, she is anything but extraordinary. All her childhood, Grace suffered epileptic seizures, causing her mother to shelter her and her father to ridicule her. Now an adult and on her own, still she is hesitant to liberate herself, when what she really longs for is to do all the things she used to dream of as a child. And worse, she safeguards herself against love, fearing no one will ever truly accept her with her condition. Little does Grace know what— or whom— not only accepts her, but would give up eternity to be with her. To Raphael, Grace is the most compassionate, selfless soul he has ever perceived. A pediatric nurse at The Children’s Hospital of Seattle, she does whatever she can to help others who are less fortunate around her. At home, she creates exquisite art— her favored theme, Angels. From the moment she came into this world— after reviving her from her near fatal birth— Raphael has given excessive attention to protecting Grace. Watching her grow into a delightful young woman, he is stunned to discover he possesses feelings he never knew could exist for a being such as himself. In torment, he observes as she falls in love for the first time, and then ultimately suffers one heartbreak after another. Though she was able as a child, one day Grace suddenly cannot see him anymore— and then she never does again. Anxious to somehow make his presence known to her, Raphael revels in orchestrating phenomena to please her. He thrills in seeing her giggle like a carefree child again. Still, it seems Grace doesn’t connect these occurrences to him. Perhaps she has forgotten all about him. But that will change. The only question is, will it be for better or for worse? If there is one thing Raphael is guilty of, it’s virtually neglecting his Guardian responsibilities over the other humans entrusted to his care. While preoccupied with Grace and obsessing over a potential development in her love life, one of them is murdered. Repulsed and distraught over his failure, Raphael resolves it is time for him to distance himself from her— which turns out to be the worst decision he could have ever made. Grace offers a Good Samaritan act so typical of her, and is brutally attacked. Now in a coma, her life is dangling on the edge and he cannot bear the thought of losing her. The Angel of Death is lingering around her, just waiting to take her away forever. If Grace dies, Raphael knows she will pass out of his own hands, and into his— and he will never see her again. Raphael admits that there isn’t anything he desires more than to be with Grace. So he searches desperately for the solution to something of which he has heard obscure rumors— Angels who have chosen to fall.  When he discovers it for himself, he is faced with the choice that will alter his very existence for all eternity. Will he forsake his eternal life as an Angel of the Seraphic order just to become a mere mortal man and have an ephemeral human life with the only one he has ever loved and cannot bear to give up?",
  "genres": [
    "Angels"
  ],
  "author": "Rosalind Scarlett",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/20648730-rhapsody"
}