{
  "title": "Coming Home",
  "description": "From the nine-time women’s basketball icon and two-time Olympic gold medalist—a raw, revelatory account of her unfathomable detainment in Russia and her journey home.On February 17, 2022, Brittney Griner arrived in Moscow ready to spend the WNBA offseason playing for the Russian women’s basketball team where she had been the centerpiece of previous championship seasons. Instead, a security checkpoint became her gateway to hell when she was arrested for mistakenly carrying under one gram of medically prescribed hash oil. Brittney’s world was violently upended in a crisis she has never spoken in detail about publicly—until now.In Coming Home, Brittney finally shares the harrowing details of her sudden arrest days before Russia invaded Ukraine; her bewilderment and isolation while navigating a foreign legal system amid her trial and sentencing; her emotional and physical anguish as the first American woman ever to endure a Russian penal colony while the #WeAreBG movement rallied for her release; the chilling prisoner swap with Russian arms dealer Viktor Bout; and her remarkable rise from hostage to global spokesperson on behalf of America’s forgotten. In haunting and vivid detail, Brittney takes listeners inside the horrors of a geopolitical nightmare spanning ten months.And yet Coming Home is more than Brittney’s journey from captivity to freedom. In an account as gripping as it is poignant, she shares how her deep love for Cherelle, her college sweetheart and wife of six years, anchored her during their greatest storm; how her family’s support pulled her back from the brink; and how hundreds of letters from friends and neighbors lent her resolve to keep fighting. Coming Home is both a story of survival and a testament to love—the bonds that brought Brittney home to her family, and at last, to herself.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Sports",
    "Biography",
    "LGBT",
    "Biography Memoir"
  ],
  "author": "Brittney Griner",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/206571264-coming-home"
}