{
  "title": "Evidence of Life After Death, Proof of the Afterlife; Heaven is Real, Heaven Exists. Trues Stories of Near Death Experiences and Afterlife Communication.",
  "description": "' Evidence of Life After Death, Proof of the Afterlife; Heaven is Real, Heaven Exists. True Stories of Near Death Experiences and Afterlife Communication.' Is Heaven real? Does Heaven exist? George Gallup, Jr., of Gallup Poll fame, in his book Adventures in Immortality, reports that five percent of the U. S. adult population have had a near-death experience. This percentage equals about 8,000,000 people who have had such an experience. According to expert DNE researcher Rene Jorgenson, Polls show that up to 13 million American’s alone have had Near Death Experiences, and 800 people have one each day. He says, ‘People have reported NDE’s where they have been clinically dead for up to 55 minutes. They were able to accurately describe events occurring during that time when their brain was completely inactive. This leaves science with a challenging paradox; how can people have clear conscious experience when their brains are no longer functioning?’ Dr Bruce Greyson, one of the top NDE researchers says, ‘No one physiological or psychological model by itself explains all the common features of NDE. The paradoxical occurrence of heightened, lucid awareness and logical thought processes during a period of impaired cerebral perfusion raises particular perplexing questions for our current understanding of consciousness and its relation to brain function. A clear sensorium and complex perceptual processes during a period of apparent clinical death challenges the concept that consciousness is localized and exclusive in the brain.’ In other words, it would seem that consciousness is not located in the brain. If that is the case, it would certainly explain the possibility of life after death, for the body is left behind but consciousness, the soul, continues. There are thousands of documented cases of Near Death experiences worldwide. Whilst it is true that all of these cases show brief glimpses into heaven, one cannot help but wish to know more about what Heaven is like, what happens there, and so following on from Book One, ‘Heaven Exist; Heaven is Real’, after a look first at some of the descriptions of Heaven from Near Death experiences, this book seeks to look further; into the phenomenon of DBV’s, or ‘Death bed visions’, and ADC’s, or After-death communications, for more documented and verified proof of life after death and the survival of consciousness. ‘I could see light, in which rainbows seemed to play, pale as the dawn, of gray loveliness. For delicate beauty it seemed I had never seen anything more fascinating or alluring. There were houses, flowers, trees; everything was so life-like it amazed me.' ‘A throng of cheery, brightly smiling, laughter-filled young men and women; their faces radiant. They wanted me to join them. I had never been more at peace; absolute calm surrounded me, within me. Their love tugging me toward them..I wanted to be a part of them more than anything I can remember every wanting.’ ‘What the light conveyed was love. There was love everywhere, it was like love came from the grass, love came from the birds, love came from the trees.’ ‘I know that I and others have been given near death experiences so we can share our experience and make people understand that death is not to be feared and that Heaven is real.’ ‘I’ve seen hundreds of these types of experiences- hundreds! I have worked for hospices for several years and it is normal and common for a dying person to have visions..Their loved ones come to get them, tell them it’s ok.’ ‘I have seen this many times. Someone is getting ready to pass and they reach for someone they can see but we can’t. I know there is something special and breathtaking awaiting us on the other side.",
  "genres": [],
  "author": "Tessy Rawlins",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/20656679-evidence-of-life-after-death-proof-of-the-afterlife-heaven-is-real-he"
}