{
  "title": "Sparrow 59",
  "description": "The Bourne Identity meets Mr. and Mrs. Smith for the New Adult crowd.\nMembers of the CIA’s specialized team Sparrow, who investigate specifically into black market deals involving stolen medical research, were all murdered in one quick sweep. Drew and Samantha, team five-nine, have been more than just partners since their academy training days. Safeguarding their secret tryst from everyone in their professional lives, they trust no one but themselves. But when Samantha finds herself suspiciously spared and Drew missing, she doesn’t want to believe what the CIA claims – that Drew is not only alive and has defected from their organization, but is facilitating the deaths of prominent research developers worldwide. Now the only member of Sparrow who hasn’t been killed off, Samantha finds herself under serious investigation by association – and a prisoner within her own home. Just when she’s on the verge of being labeled a murderer and a traitor herself, Drew activates a beacon only she can see, taunting her from across the world. He knows she’s watching, and she knows he could be gone forever if she doesn't oblige his silent request. With nothing left to lose and everything to gain, Sam goes rogue to track him down and clear her good name. But when she finally catches up to her partner of four years, he hasn’t a clue who he is or what he’s done, and the men chasing him down suddenly want to acquire her as well. Frantic yet determined, Samantha is forced to protect a man she no longer trusts in order to learn why he went astray – and why his associates are determined to retrieve him. But is Drew really a victim himself in a much greater scheme, or will his memories prove lethal, leading Sam into harm’s way like a lamb to slaughter, ultimately risking the life of the only member of Sparrow he managed to save?New Adult Romantic Spy ThrillerRecommended for 17+ for mature and violent situations, language and sexual content. Official Book Page: http://devonashleyauthor.com/books/th...",
  "genres": [
    "New Adult",
    "Mystery",
    "Romance",
    "Suspense",
    "Contemporary",
    "Mystery Thriller",
    "Romantic Suspense"
  ],
  "author": "Devon Ashley",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/20653375-sparrow-59"
}