{
  "title": "Thirty Minutes to Heartbreak",
  "description": "A dark, twisted, sexy paranormal romance with magick and revenge!Three full-length novels are included in this bundle for a seamless reading experience:Thirty Minutes to HeartbreakBook #1: ParamountBook #2. ParabellumBook #3: ParalyzedAbout the novels:PARAMOUNTHe broke her heart. Now, it's time for him to pay...Pax Burnson has been in love with Thorn Kalgren since she was fourteen. Long before he became the CEO of one of the world's largest tech companies, and an arrogant jerk. Their families have always been close due to their shared secret; both Pax and Thorn are descended from devas, powerful demigods with vast supernatural abilities. Years ago, when Pax lost her mother, Thorn became her everything. She depended on him as her friend, mentor, and eventually her lover. His recent betrayal was more than she could bear.Pax has spent a lifetime concealing her goddess heritage, and trying to be normal. She has vowed not to practice her powers, but her newfound anger at Thorn has released a violence that she cannot restrain. She turns to her best friend for help with a complex plan to deceive and destroy her former lover--but this is challenging since her best friend happens to be Thorn's own sister. As it turns out, Amara Kalgren has her own reasons to crave vengeance.The friendship and loyalty between the two girls becomes fortified as they venture down a dark and twisted path, discovering ancient magick and terrifying demons, and struggling against the consuming lust and love for the men who have hurt them. Pax and Amara soon find that they've bitten off more than they can chew...But there's no turning back now.PARABELLUMThe Earth is facing danger like never before. The only hope for survival lies with a few brokenhearted demigods...Best friends Pax and Amara decide to escape the planet and their frustrating ex-boyfriends to engage in the rigorous trials of a realm known as the Pseudosphere. Little do they know what chaos is waiting for them back at home...On Earth, a mysterious dark-skinned woman has been following Thorn and Ash. They cast her aside as one of their many female admirers, only to learn that she is actually a visitor from the future. This young woman has risked everything to travel back in time and warn them of a catastrophic event that has already been set into motion--the world will be changed forever, unless the drunken, lazy men can pull themselves together to prevent the apocalypse.In the midst of heated battle, Pax Burnson struggles with her simultaneous love and resentment for Thornton Kalgren. Personal feelings threaten to get in the way and distract the fire goddess from her purpose; with minutes ticking down on the clock until doomsday, will Pax choose to accept defeat and spend a final night in her lover's arms? Or will she focus on harnessing her inner strength to go down fighting until her final breath?PARALYZEDWhen a goddess throws a temper tantrum, entire worlds will shake beneath her feet.All is not right within the universe. Even after recently saving the planet from an impact that would have obliterated most of humanity, there seems to be no rest for the wicked. All Para wants is to break the hearts of the men who broke her heart, but an old family enemy won't let her play her love games in peace. Suja, the Queen of the Asura, has a growing animosity and fascination with Pax Burnson, and will stop at nothing to win their battle of wit and power. Now Suja has brought a new challenger to bear against Para.Will Para's supercharged union be enough to go up against Suja's newest monstrous creation?",
  "genres": [],
  "author": "Nadia Scrieva",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/20655101-thirty-minutes-to-heartbreak"
}