{
  "title": "Cades Cove: The Life and Death of a Southern Appalachian Community, 1818-1937",
  "description": "Cades CoveThe Life and Death of a Southern Appalachian Community, 1818-1937Durwood DunnWinner of the Thomas Wolfe Literary Award!Drawing on a rich trove of documents never before available to scholars, the author sketches the early pioneers, their daily lives, their beliefs, and their struggles to survive and prosper in this isolated mountain community, now within the confines of the Great Smoky Mountains National Park.In moving detail this book brings to life an isolated mountain community, its struggle to survive, and the tragedy of its demise.\"Professor Dunn provides us with a model historical investigation of a southern mountain community.  His findings on commercial farming, family, religion, and politics will challenge many standard interpretations of the Appalachian past.\"--Gordon B. McKinney, Western Carolina University.   \"This is a fine book. . . . It is mostly about community and interrelationships, and thus it refutes much of the literature that presents Southern Mountaineers as individualistic, irreligious, violent, and unlawful.\"—Loyal Jones, Appalachian Heritage.  \"Dunn . . . has written one of the best books ever produced about the Southern mountains.\"—Virginia Quarterly Review.  \"This study offers the first detailed analysis of a remote southern Appalachian community in the nineteenth century.  It should lay to rest older images of the region as isolated and static, but it raises new questions about the nature of that premodern community.\"—Ronald D Eller, American Historical ReviewNot only is his book a worthy addition to the growing body of work recognizing the complexities of southern mountain society; it is also a lively testament to the value of local history and the variety of levels at which it can provide significant enlightenment.\"—John C. Inscoe,LOCUS",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Biography"
  ],
  "author": "Durwood Dunn",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/2065645.Cades_Cove"
}