{
  "title": "Crooked River",
  "description": "Full of emotion and suspense, Crooked River is an inventive and atmospheric story about family and friendship, good and evil, secrets and lies, grief and forgivenessWhere should I start? With Mom's funeral? Or a week earlier on the Fourth of July, the day she died? Or should I skip all that stuff and get straight to the part where Ollie and I just wanted to go swimming and pretend our lives were ordinary again, but when we got down to the river we found another dead woman instead?Still grieving over the sudden death of their mother, fifteen-year-old Sam McAlister and her ten-year-old sister, Ollie, move from the comforts of Eugene to rural Oregon to live in a meadow in a teepee under the stars with Bear, their reclusive beekeeper father. But soon after they arrive in Terrebone, a young woman is found dead floating in Crooked River and the police arrest their eccentric father for the murder.He is not evil. I am not good.We are the same: broken and put back together again.Sam knows that Bear is not a killer, even though the evidence points to his guilt—including information that she and Ollie have uncovered. Filled with remorse and refusing to accept that her father could have hurt anyone, Sam embarks on a desperate hunt to save him and keep her damaged family together. They had mysteriously lost Bear once before and Sam is terrified they will lose him again. Only this time they won't ever get him back. She needs Ollie to help her, but Ollie has not spoken a word since their mother's death.I see things no one else does.I see them there and wish I didn't. I want to tell and I can't.Ollie, too, knows that Bear is innocent. The Shimmering have told her so. One followed her home from her mom's funeral and continues to hover, a spectrum of colors—pink and rose red, sky blue and honey gold. Now another, coiled and hissing, is following Sam. Both spirits warn Ollie: the real killer is out there, waiting. Somehow, she must warn her sister. But Ollie worries that if she tries to speak—even to write—the Shimmering will slip inside her, take control, and never leave.Sam and Ollie must find the truth quickly—a search that will lead them to unexpected secrets and terrible lies—because the danger is closer to them than either girl knows.Told in Sam's and Ollie's vibrant voices, Crooked River is a family story, a coming-of-age story, a ghost story, and a psychological mystery as haunting as the best Southern gothic fiction that will touch your heart and grip you until the final page.",
  "genres": [
    "Fiction",
    "Mystery",
    "Family",
    "Coming Of Age",
    "Thriller",
    "Suspense",
    "Mystery Thriller"
  ],
  "author": "Valerie Geary",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/20663102-crooked-river"
}