{
  "title": "Composing a Life",
  "description": "Profiles of five women that aim \"to shed light on personal and career obstacles women face in achieving success\" by a cultural anthropologist (Publishers Weekly).Mary Catherine Bateson has been called \"one of the most original and important thinkers of our time\" (Deborah Tannen). Grove Press is pleased to reissue Bateson's deeply satisfying treatise on the improvisational lives of five extraordinary women. Using their personal stories as her framework, Dr. Bateson delves into the creative potential of the complex lives we live today, where ambitions are constantly refocused on new goals and possibilities. With balanced sympathy and a candid approach to what makes these women inspiring, examples of the newly fluid movement of adaptation--their relationships with spouses, children, and friends, their ever-evolving work, and their gender--Bateson shows us that life itself is a creative process. \"A masterwork of rare breadth and particularity, encompassing all the rhythms of five lives and friendships, and interweaving their stories in ways that reveal grand social truths and peculiar personal graces.\"--The Boston Globe\"Well-formulated and passionate . . . Offers nothing less than a radical rethinking of the concept of achievement.\"--San Francisco Chronicle\"As stimulating as it is hopeful . . . shakes up well-meaning truisms . . . adds new dimensions to our views of the world.\"--Elizabeth Janeway, author of Man's World, Woman's Place\"Bateson has an extremely interesting mind and the ability to express herself with extraordinary literary felicity . . . Too much truth steams behind the quiet elegance of these passages.\"--The New York Times Book Review",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Feminism",
    "Womens",
    "Anthropology",
    "Biography Memoir"
  ],
  "author": "Mary Catherine Bateson",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/2065923.Composing_a_Life"
}