{
  "title": "The Complete Quotations of Friedrich Nietzsche",
  "description": "Philosopher, man of Dynamite and self-confessed AntiChrist, Friedrich Nietzsche has become famous- or perhaps infamous- as probably the most radical and influential thinker of the 20th Century.The Complete quotations of Friedrich Nietzsche is an ideal introduction to Nietzsche’s thought for those seeking an immediate and easily digestible understanding of Nietzsche and his message. The very best way of gaining such an understanding is to read the the works themselves! This book is aimed squarely at the introductory reader– it is not an academic or scholarly text. It is meant to entertain, to illuminate and to provide an authentic flavour of Nietzsche. The book is designed to be read cover to cover in a single day. This text is the result of a two year project to select the most illuminating and easily digestible key messages from Nietzsche. The book contains over 500 carefully selected “bite sized” quotations and occasional longer excerpts from all Nietzsche’s works including Notebooks, unpublished works and correspondence. The book covers not only core philosophical questions such as Free Will and man’s place in the cosmos, but also Nietzsche’s thoughts on (amongst other things): The State, Invalids, Charity, Crime, Suicide and Euthanasia, Vegetarianism and Americans.For each such quotation, a reference is provided to the source book and section from which the quotation was taken, thus enabling the reader to explore further where desired.Nietzsche fights a one man war on behalf of a humanity in dire need of a reconnection with its true self. Nietzsche’s passionate aim is to provide a pathway that will elevate mankind beyond the merely human and into the heights of Nietzsche’s envisioned Human 2.0: the Uberman. This path involves the unmasking and unwinding of the forces that seek to keep humanity from realising its full potential. His writings are passionate, brilliant blasts against the forces of Nihilism, Decadence and Religion.Nietzsche writings are honest to the point of harshness. His debunking of the modern ideals of Equality, Fraternity, Compassion and Moral righteousness are without doubt very politically incorrect, even by the standards of today. Nietzsche pulls no punches and requires a reader who is open to and appreciative of being challenged on all fronts.However, for such readers, beyond the harshness and challenge they will also find one of the most human and impassioned voices of the modern age, and a lifelong companion and guide for a modern, secular outlook on life.Lexido publishes key texts that seek to make Friedrich Nietzsche’s works as accessible as possible to the broadest range of modern readers with the object of promoting an understanding and development of the modern secular society. Please visit our Amazon page for more great books http://smarturl.it/Lexido?IQid=NQAMLEXIDO CLASSIC EDITIONS series provide high quality single volume editions of selected classic texts. Our objective is to provide the very best reading experience of classic texts for the Ebook reader. To ensure the best possible enjoyment and ease of understanding whilst reading the book, this edition includes reference material for the benefit of the reader.The LEXIDO edition of Friedrich Nietzsche’s \"Complete Quotations\" has been extensively proof read and Quality Assured to ensure that your Ebook is: - Faithful to the text of the original printed edition - Free from spelling, layout defects and omissions - Excellently reproduced on all Kindle Ebook readers - Easy to navigate via a Table of Contents linking to each chapter.",
  "genres": [
    "Philosophy",
    "Classics",
    "Nonfiction"
  ],
  "author": "Friedrich Nietzsche",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/20660635-the-complete-quotations-of-friedrich-nietzsche"
}