{
  "title": "Village of Secrets: Defying the Nazis in Vichy France",
  "description": "From the author of the runaway bestseller A Train in Winter comes the extraordinary story of a French village that helped save thousands, including many Jewish children, who were pursued by the Gestapo during World War II. Le Chambon-sur-Lignon is a small village of scattered houses high in the mountains of the Ardèche. Surrounded by pastures and thick forests of oak and pine, the plateau Vivarais lies in one of the most remote and inaccessible parts of Eastern France, cut off for long stretches of the winter by snow. During the Second World War, the inhabitants of the area saved thousands wanted by the Gestapo: resisters, freemasons, communists, downed Allied airmen and above all Jews. Many of these were children and babies, whose parents had been deported to the death camps in Poland. After the war, Le Chambon became the only village to be listed in its entirety in Yad Vashem's Dictionary of the Just.Just why and how Le Chambon and its outlying parishes came to save so many people has never been fully told. Acclaimed biographer and historian Caroline Moorehead brings to life a story of outstanding courage and determination, and of what could be done when even a small group of people came together to oppose German rule. It is an extraordinary tale of silence and complicity. In a country infamous throughout the four years of occupation for the number of denunciations to the Gestapo of Jews, resisters and escaping prisoners of war, not one single inhabitant of Le Chambon ever broke silence. The story of Le Chambon is one of a village, bound together by a code of honour, born of centuries of religious oppression. And, though it took a conspiracy of silence by the entire population, it happened because of a small number of heroic individuals, many of them women, for whom saving those hunted by the Nazis became more important than their own lives.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "France",
    "Holocaust",
    "War",
    "Historical"
  ],
  "author": "Caroline Moorehead",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/20663052-village-of-secrets"
}