{
  "title": "A Devil of a Whipping: The Battle of Cowpens",
  "description": "The battle of Cowpens was a crucial turning point in the Revolutionary War in the South and stands as perhaps the finest American tactical demonstration of the entire war. On 17 January 1781, Daniel Morgan's force of Continental troops and militia routed British regulars and Loyalists under the command of Banastre Tarleton. The victory at Cowpens helped put the British army on the road to the Yorktown surrender and, ultimately, cleared the way for American independence.Here, Lawrence Babits provides a brand-new interpretation of this pivotal South Carolina battle. Whereas previous accounts relied on often inaccurate histories and a small sampling of participant narratives, Babits uses veterans' sworn pension statements, long-forgotten published accounts, and a thorough knowledge of weaponry, tactics, and the art of moving men across the landscape. He identifies where individuals were on the battlefield, when they were there, and what they saw--creating an absorbing common soldier's version of the conflict. His minute-by-minute account of the fighting explains what happened and why and, in the process, refutes much of the mythology that has clouded our picture of the battle.Babits put the events at Cowpens into a sequence that makes sense given the landscape, the drill manual, the time frame, and participants' accounts. He presents an accurate accounting of the numbers involved and the battle's length. Using veterans' statements and an analysis of wounds, he shows how actions by North Carolina militia and American cavalry affected the battle at critical times. And, by fitting together clues from a number of incomplete and disparate narratives, he answers questions the participants themselves could not, such as why South Carolina militiamen ran toward dragoons they feared and what caused the \"mistaken order\" on the Continental right flank.<!-- copy for pb \"An exceptionally well-researched and richly detailed treatment of one of the most important battles of the American Revolution.-- Military History of the West\"A superb example of the 'new military history'. . . . Babits comes closer than any previous historian to reconstructing the eighteenth-century soldier's experience of combat and has given us as close to a definitive account of the battle of Cowpens as we are ever likely to have.-- Virginia Magazine of History and Biography\"One of Babits's purposes was the hope that the Cowpens veterans would not be forgotten. The masterful work that he has produced goes far towards achieving that purpose.-- Journal of Southern HistoryOn January 17, 1781, in a pasture near present-day Spartanburg, South Carolina, Daniel Morgan's army of Continental troops and militia routed an elite British force under the command of the notorious Banastre Tarleton. Using documentary evidence to reconstruct the fighting at Cowpens, now a national battlefield, Lawrence Babits provides a riveting, minute-by-minute account of the clash that turned the tide of the Revolutionary War in the South and helped lead to the final defeat of the British at Yorktown. -->",
  "genres": [
    "History",
    "American Revolution",
    "Military History",
    "American Revolutionary War",
    "American History",
    "Military Fiction",
    "Nonfiction"
  ],
  "author": "Lawrence E. Babits",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/206677.A_Devil_of_a_Whipping"
}