{
  "title": "The Controller: Volume I",
  "description": "Three erotic stories from The Controller BDSM series. Each story details the way that The Controller finds to use John's body for his and other's pleasure.In the first story John gets a text from The Controller telling him to drive over to an address in the nude, he has no idea what lies ahead. He only knows that he must do as instructed and submit to whatever the person he is being delivered to wants. How will he handle being used as a private sex slave by a sadistic stranger?In the Hostage parts I and II John receives a text message from The Controller instructing him to go to Union Square. John obeys, but has no idea what is store for him. He waits nervously until a black SUV pulls up and two men in suits force him to strip on the street before they put a hood over his head and push him into the vehicle. They take him to an empty warehouse where The Controller has invited a group of suited strangers to watch John be used and punished. John has no choice but to submit to the painful and humiliating torture that The Controller has prepared as he is used by the men holding him hostage. Will he survive their sadistic games?After the group has finished using his body they leave him chained and hanging in the dark. John has no choice but to submit to the painful and humiliating torture that The Controller has ordered—but as he waits, bound in the darkness he wonders what they will force him to do next and whether they will set him free.Eventually his two captors return and continue his torture and humiliation, pushing John’s limits even further than before. At the end of the night he is beaten, naked and covered in their cum and piss. But will they release him?Discover how The Controller recruited John and how far he is willing to go to serve his master.Contains explicit gay sexual content including anal sex, CBT, WS, BDSM, spanking, enema play, group sex and sadomasochistic themes. Not suitable for minors.",
  "genres": [],
  "author": "J.C. Stand",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/20664212-the-controller"
}