{
  "title": "Lost and Lassoed",
  "description": "She thrives in chaos. He prefers routine. The only thing they have in common? How much they hate each other. From the author of Done and Dusted and Swift and Saddled, the highly anticipated next book in the Rebel Blue Ranch series, a small town romance featuring enemies to lovers and forced proximity.Teddy Andersen doesn't have a plan. She's never needed one before. She's always been more of a go with the flow type of girl, but for some reason, the flow doesn't seem to be going her way this time. Her favorite vintage suede jacket has a hole in it, her sewing machine is broken, and her best friend just got engaged. Suddenly, everything feels like it's starting to change. Teddy's used to being a leader, but now she feels like she's getting left behind, wondering if the life she lives in the small town she loves is enough for her anymore.Gus Ryder has a lot on his plate. He doesn't know what's taking care of his family's 8,000 acre ranch, or parenting his spunky six-year-old daughter, who is staying with him for the summer. Gus has always been the dependable one, but when his workload starts to overwhelm him, he slips up, and he has to admit that he can't manage everything on his own. He needs help. His little sister's best friend, the woman he can't stand, is not who he had in mind. But when no one else can step in, Teddy's the only option he's got. Teddy decides to use the summer to try and figure out what she wants out of life. Gus, on the other hand, starts to worry that he'll never find what he needs. Tempers flare, tension builds, and for the first time ever, Gus and Teddy start to see each other in a different light. As new feelings start to simmer below the surface, they must decide whether or not to act on them. Can they keep things cool? Or will both of them get burned?",
  "genres": [
    "Enemies To Lovers",
    "Westerns",
    "Audiobook",
    "Contemporary Romance",
    "Contemporary",
    "Small Town Romance",
    "Forced Proximity"
  ],
  "author": "Lyla Sage",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/206673322-lost-and-lassoed"
}