{
  "title": "Model Behavior",
  "description": "Being a broke college student is ruining Janay Richard's social life. While her wealthy friends are hitting up the hottest new club in the city, Climax, she's stuck making machiattos & frappes at Spill the Beans Coffee House. And to make matters worse, they're cutting her hours to a few measly shifts per week. So when her work BFF Tessa recommends she get a side hustle, she does just that, landing a gig as a nude model for an art class at a nearby university. But Janay has no idea just how risque this class really is. Not to mention the fact that it will require her to pose in the buff with Gavin , the sexy and mysterious white guy who always comes into her work just to get a look at her... This 6800 word SHORT story includes a bwwm interracial pairing, coffee house flirting, voyeurism, groping, and a whole lot of highly detailed hot sex. 18+ only!***AN EXCERPT***“This is only a 90 minute class, Ms. Richards, do you care to join us anytime soon?” I hear the Professors say, followed by muffled laughter. My nerves stand on end – he sure knew how to make a girl feel even less comfortable.Removing my bra and underwear, I pack everything up tightly and stuff it in the corner of the changing room. I place my hands on the curtain, stalling for a second while I muster up my courage. There's no turning back now.I step outside, my skin feeling prickly all over from the chilly air. I'm totally exposed to everyone now and I feel the heat rising to my cheeks. But the students only give me a bored passing glance, save for one creep in the back who sort of just stares. These are art students – they've seen it all and the naked human form is no big deal to them, obviously. I let out a breath of relief, suddenly feeling a lot more calm.I move towards the platform, where Gavin is already standing there, butt naked with his hands on his hips. He's clearly an exhibitionist.He turns as I step on to the platform next to him and I see his wide amber eyes soften while his pouty lips part slightly. His gaze travels up and down my body, taking all of me in, and he doesn't even try to be discreet about it. It should make me feel uncomfortable (and it does, just a little) but I can't lie – it kind of gives me a confidence boost. The man doesn't exactly hide the fact that he likes what he sees.And so do I.",
  "genres": [],
  "author": "Ingrid Ash",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/20666939-model-behavior"
}