{
  "title": "Commit To Get Fit: Find the Secret to Your Own True and Everlasting Weight Loss",
  "description": "NOT JUST ANOTHER DIET BOOK The failing of most “weight loss” books is that they are strict, regimented plans complete with recipes, rules and long, long lists of do’s and don'ts. This approach is exactly what Chicago author Laura Dion-Jones challenges and changes in her revolutionary new book, Commit To Get Find the Secret to Your Own True and Everlasting Weight Loss. Rather than continuing to bombard readers with one more rigid program aimed at weight loss, Laura simply aims to inspire and change the reader’s approach to weight control through a detailed, self-effacing, fun-filled and yet poignant journey of her own success. The book includes insights, thought processes and other information detailed during her journey to a healthier lifestyle, all of which are intended to positively influence the reader’s view on his or her own attempts at weight loss. It also, while remaining entertaining and positive, stays realistic. Rather than make claims about some secret “trick” that magically transforms your body, as is too rampant in the weight loss industry, it details both Laura’s successes and mistakes, her moments of gratification and of disappointment, which make for a guide that is as honest as it is refreshing. One reader review of an advance copy of Commit To Get Fit has described the book as “careful to skewer the diet industry, entertainingly, from the beginning” and “a valuable read for anyone who wants to lose weight, particularly if you have tried and tried and have given up the ghost on that particular goal.” One of Laura’s goals in writing Commit To Get Fit was to change the way dieters view the process of losing weight by taking control of their own personal lifestyle, rather than following guidelines and those rigid rules that could possibly be unhealthy or not suitable for each and every individual. And putting an end to our country’s obesity epidemic because being over weight is not a disease. Obesity is totally and unequivocally preventable. It all comes down to choice and personal responsibility. Period.",
  "genres": [
    "Health",
    "Food",
    "American"
  ],
  "author": "Laura Dion-Jones",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/20665754-commit-to-get-fit"
}