{
  "title": "Gone Feral: Tracking My Dad Through the Wild",
  "description": "Elizabeth Gilbert, author of The Signature of All Things and Eat, Pray, Love\"I'm so glad Novella Carpenter has written this book... The resulting journey is both brave and honest.\"San Francisco Chronicle“[R]iveting... Carpenter reminds us that sometimes the self is the thorniest wilderness of all.\"Novella Carpenter picks up the phone one day to receive some disturbing her father has officially gone missing. Carpenter’s father, George—a back-to-the-land homesteader and troubled Korean War veteran—has spent decades battling his inner demons while largely absenting himself from his children’s lives. Though George is ultimately found, Carpenter is forced to confront the her time with her dad—now seventy-three years old—is limited, and the moment to restore their relationship is now. Gone Feral is the story of Carpenter’s search for her parents’ broken past in the harsh wilds of Idaho.The story starts in San Miguel de Allende in 1969, where Carpenter’s free-spirited parents meet and fall in love. Their whirlwind romance continues through Europe and ends on 180 acres near Idaho’s Clearwater River. Carpenter and her sister are born into a free, roaming childhood, but soon the harsh reality of living on the land—loneliness, backbreaking labor—tears the family apart. Carpenter’s mother packs the girls and heads for the straight life in Washington State while George remains on the ranch, tied to the land and his vision of freedom.In Gone Feral, Carpenter—now a grown woman leading an untraditional life, not unlike her parents’, raising livestock and growing vegetables in the city—finds herself contemplating a family of her own. Before that can happen, she knows she has to return to Idaho to discover why her father chose this life of solitude. She quickly finds that George is not living the principled, romantic life she imagined, and the truth is more com-plicated—and dangerous—than anything she suspected. As she comes to know the real George, Carpenter looks to her own life and comes to recognize her father’s legacy in their shared love of animals, of nature, and of the written word; their dangerous stubbornness and isolating independence. Finally, Gone Feral sees the birth of Carpenter’s own daughter, an experience that teaches that a parent’s love is itself a wild unknowable, fierce, and ever changing. In reckoning with her past, Carpenter clears the road to her future.Raw, funny, unsentimental, alive with unforgettable characters and pitch-perfect dialogue, Gone Feral marks Carpenter’s transformative passage from daughter to mother, a wry and rough tale of life lived on the margins and redemption between generations.Booklist\"Spurred on by a desire to raise a family of her own and decipher the genetic code for either survival or destruction that she might be passing on, Carpenter performs a wild pas de deux with the cantankerous George, approaching him as one would a wild animal with no trust in humanity. Carpenter chronicles her daring quest for understanding and familial continuity in this sincere and remarkably uninhibited memoir.\"",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography Memoir",
    "Family",
    "Autobiography"
  ],
  "author": "Novella Carpenter",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/20663400-gone-feral"
}