{
  "title": "Midnight in Siberia: A Train Journey into the Heart of Russia",
  "description": "Far away from the trendy cafes, designer boutiques, and political protests and crackdowns in Moscow, the real Russia exists. Midnight in Siberia chronicles David Greene's journey on the Trans-Siberian Railway, a 6,000-mile cross-country trip from Moscow to the Pacific port of Vladivostok. In quadruple-bunked cabins and stopover towns sprinkled across the country s snowy landscape, Greene speaks with ordinary Russians about how their lives have changed in the post-Soviet years.These travels offer a glimpse of the new Russia a nation that boasts open elections and newfound prosperity but continues to endure oppression, corruption, a dwindling population, and stark inequality.We follow Greene as he finds opportunity and hardship embodied in his fellow train travelers and in conversations with residents of towns throughout Siberia.We meet Svetlana, an entrepreneur who runs a small hotel in Ishim, fighting through corrupt layers of bureaucracy every day. Greene spends a joyous evening with a group of babushkas who made international headlines as runners-up at the Eurovision singing competition. They sing Beatles covers, alongside their traditional songs, finding that music and companionship can heal wounds from the past. In Novosibirsk, Greene has tea with Alexei, who runs the carpet company his mother began after the Soviet collapse and has mixed feelings about a government in which his family has done quite well. And in Chelyabinsk, a hunt for space debris after a meteorite landing leads Greene to a young man orphaned as a teenager, forced into military service, and now figuring out if any of his dreams are possible.Midnight in Siberia is a lively travel narrative filled with humor, adventure, and insight. It opens a window onto that country s complicated relationship with democracy and offers a rare look into the soul of twenty-first-century Russia.\"",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir",
    "History",
    "Journalism",
    "Russia",
    "Politics"
  ],
  "author": "David Greene",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/20663701-midnight-in-siberia"
}