{
  "title": "Tennessee Williams: Mad Pilgrimage of the Flesh",
  "description": "John Lahr has produced a theater biography like no other. Tennessee Williams: Mad Pilgrimage of the Flesh gives intimate access to the mind of one of the most brilliant dramatists of his century, whose plays reshaped the American theater and the nation's sense of itself. This astute, deeply researched biography sheds a light on Tennessee Williams's warring family, his guilt, his creative triumphs and failures, his sexuality and numerous affairs, his misreported death, even the shenanigans surrounding his estate.With vivid cameos of the formative influences in Williams's life--his fierce, belittling father Cornelius; his puritanical, domineering mother Edwina; his demented sister Rose, who was lobotomized at the age of thirty-three; his beloved grandfather, the Reverend Walter Dakin--Tennessee Williams: Mad Pilgrimage of the Flesh is as much a biography of the man who created A Streetcar Named Desire, The Glass Menagerie, and Cat on a Hot Tin Roof as it is a trenchant exploration of Williams's plays and the tortured process of bringing them to stage and screen.The portrait of Williams himself is unforgettable: a virgin until he was twenty-six, he had serial homosexual affairs thereafter as well as long-time, bruising relationships with Pancho Gonzalez and Frank Merlo. With compassion and verve, Lahr explores how Williams's relationships informed his work and how the resulting success brought turmoil to his personal life.Lahr captures not just Williams's tempestuous public persona but also his backstage life, where his agent Audrey Wood and the director Elia Kazan play major roles, and Marlon Brando, Anna Magnani, Bette Davis, Maureen Stapleton, Diana Barrymore, and Tallulah Bankhead have scintillating walk-on parts. This is a biography of the highest order: a book about the major American playwright of his time written by the major American drama critic of his time.Winner of the 2015 Sheridan Morley Prize for Theatre Biography American Academy of Arts and Letters' Harold D. Vursell Memorial AwardChicago Tribune Best Books of 2014USA Today 10 Books We Loved ReadingWashington Post 10 Best Books of 2014",
  "genres": [
    "Biography",
    "Nonfiction",
    "Theatre",
    "History",
    "Biography Memoir",
    "LGBT",
    "Plays"
  ],
  "author": "John Lahr",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/20663684-tennessee-williams"
}