{
  "title": "Citizen Coke: The Making of Coca-Cola Capitalism",
  "description": "An absorbing history of how Coke’s insatiable thirst for natural resources shaped the company and reshaped the globe.How did Coca-Cola build a global empire by selling a low-price concoction of mostly sugar, water, and caffeine? The easy answer is advertising, but the real formula to Coke’s success was its strategy, from the start, to offload costs and risks onto suppliers, franchisees, and the government. For most of its history the company owned no bottling plants, water sources, cane or cornfields. A lean operation, it benefited from public goods like cheap municipal water and curbside recycling programs. Its huge appetite for ingredients gave it outsized influence on suppliers and congressional committees. This was Coca-Cola capitalism.In this new history Bartow J. Elmore explores Coke through its ingredients, showing how the company secured massive quantities of coca leaf, caffeine, sugar, and other inputs. Its growth was driven by shrewd leaders such as Asa Candler, who scaled an Atlanta soda-fountain operation into a national empire, and “boss” Robert Woodruff, who nurtured partnerships with companies like Hershey and Monsanto. These men, and the company they helped build, were seen as responsible citizens, bringing jobs and development to every corner of the globe. But as Elmore shows, Coke was usually getting the sweet end of the deal.It continues to do so. Alongside Coke’s recent public investments in water purification infrastructure, especially in Africa, it has also built—less publicly—a rash of bottling plants in dangerously arid regions. Looking past its message of corporate citizenship, Elmore finds a strategy of relentless growth.The costs shed by Coke have fallen on the public at large. Its annual use of many billions of gallons of water has strained an increasingly scarce global resource. Its copious servings of high-fructose corn syrup have threatened public health. Citizen Coke became a giant in a world of abundance. In a world of scarcity it is a strain on resources and all who depend on them.",
  "genres": [
    "Nonfiction",
    "History",
    "Business",
    "Food",
    "Economics",
    "Audiobook",
    "Politics"
  ],
  "author": "Bartow J. Elmore",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/20663709-citizen-coke"
}