{
  "title": "Hold the Dark",
  "description": "A terrifying literary thriller set on the Alaskan tundra confronts the mystery of evil and mankind’s losing battle with nature.At the start of another pitiless winter, the wolves have come for the children of Keelut. Three children have been taken from this isolated Alaskan village, including the six-year-old boy of Medora and Vernon Slone.Stumbled by grief and seeking consolation, Medora contacts nature writer and wolf expert Russell Core. Sixty years old, ailing in both body and spirit, and estranged from his daughter and wife, Core arrives in the remote village of Keelut to investigate the killings. Here, in this alien environment that seems to possess “its own unquenchable hunger, its own secrets, its own icy motives, even its own implacable will” (Tim O’Brien), Core quickly apprehends that Medora, like the hostile and untamed land she inhabits, harbors a dark and unholy truth.This chilling revelation sets in motion a baleful chain of events, as Medora’s husband, Vernon, returns from a desert war to discover his son dead and his wife missing. Aided by his boyhood companion, the taciturn and deadly Cheeon, Vernon begins a methodical pursuit of his missing wife, cutting down anyone who stands in his way and carving a bloody swath across the local landscape. With the help of local police detective Donald Marium, Core attempts to rescue Medora from her husband’s vengeance, pulling both men into an “unforgettable journey into the heart of darkness” (Dennis Lehane) as they race to find Medora before Vernon does.At the furthermost reaches of American soil, Core comes face to face with an unspeakable secret about the ancient bonds of family and the potential beast in the soul of every human being.An Alaskan Oresteia, an epic woven of both blood and myth, Hold the Dark recalls the hyperborean climate and tribalism of Daniel Woodrell’s Winter’s Bone and the primeval violence of James Dickey’s Deliverance.",
  "genres": [
    "Fiction",
    "Horror",
    "Thriller",
    "Mystery",
    "Crime",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "William Giraldi",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/20665580-hold-the-dark"
}