{
  "title": "The Story (NIV): The Bible as One Continuing Story of God and His People",
  "description": "THE GREATEST STORY EVER TOLD IS MORE THAN JUST A CLICHE. God goes to great lengths to rescue lost and hurting people. That is what The Story is all about: the story of the Bible, God s great love affair with humanity. Condensed into 31 accessible chapters, The Story sweeps you into the unfolding progression of Bible characters and events from Genesis to Revelation. Using the classic, yet updated text of the New King James Version Bible, it allows the stories, poems, and teachings of the Bible to read like a novel. And like any good story, The Story is filled with intrigue, drama, conflict, romance, and redemption; and this story s true! From the foreword by Max Lucado and Randy Frazee: This book tells the grandest, most compelling story of all time: the story of a true God who loves his children, who established for them a way of salvation and provided a route to eternity. Each story in these 31 chapters reveals the God of grace the God who speaks; the God who acts; the God who listens; the God whose love for his people culminated in his sacrifice of Jesus, his only Son, to atone for the sins of humanity. Features: The story of the Bible in its own words. Selections from the NIV Bible with short transitions to connect the reader to the continuing story. Events, characters, and teachings of the Bible arranged chronologically Timelines of Bible events New King James Bible text Church families around the globe can now embrace The Story for a full ministry year through worship services, small group studies, and family activities. Learn more about this whole-church experience at TheStory.com. An excerpt from The Story: After Judas left, Jesus gave the disciples a glimpse of what was to come. He foreshadowed the fact that he was going to be broken and poured out he was going to take humanity s punishment for sin on himself. While they were eating, Jesus took bread, and when he had given thanks, he broke it and gave it to his disciples, saying, Take and eat; this is my body. Then he took a cup, and when he had given thanks, he gave it to them, saying, Drink from it, all of you. This is my blood of the covenant, which is poured out for many for the forgiveness of sins. I tell you, I will not drink from this fruit of the vine from now on until that day when I drink it new with you in my Father s kingdom. Jesus warned his disciples that he would be with them only a little while longer. He went on to comfort his confused followers. Do not let your hearts be troubled. You believe in God; believe also in me. My Father s house has many rooms; if that were not so, would I have told you that I am going there to prepare a place for you? And if I go and prepare a place for you, I will come back and take you to be with me that you also may be where I am. You know the way to the place where I am going. Thomas said to him, Lord, we don t know where you are going, so how can we know the way? Jesus answered, I am the way and the truth and the life. No one comes to the Father except through me. If you really know me, you will know my Father as well. From now on, you do know him and have seen him. \"",
  "genres": [
    "Christian",
    "Nonfiction",
    "Religion",
    "Faith",
    "Christianity",
    "Spirituality",
    "Christian Non Fiction"
  ],
  "author": "Randy Frazee",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/20663443-the-story-niv"
}