{
  "title": "The War That Ended Peace: The Road to 1914",
  "description": "NAMED ONE OF THE BEST BOOKS OF THE YEAR BY\"The New York Times Book Review - The Economist - The Christian Science Monitor - Bloomberg Businessweek - The Globe and Mail\" From the bestselling and award-winning author of \"Paris 1919\" comes a masterpiece of narrative nonfiction, a fascinating portrait of Europe from 1900 up to the outbreak of World War I.  The century since the end of the Napoleonic wars had been the most peaceful era Europe had known since the fall of the Roman Empire. In the first years of the twentieth century, Europe believed it was marching to a golden, happy, and prosperous future. But instead, complex personalities and rivalries, colonialism and ethnic nationalisms, and shifting alliances helped to bring about the failure of the long peace and the outbreak of a war that transformed Europe and the world. \" \"\"The War That Ended Peace \"brings vividly to life the military leaders, politicians, diplomats, bankers, and the extended, interrelated family of crowned headsacross Europe who failed to stop the descent into war: in Germany, the mercurial Kaiser Wilhelm II and the chief of the German general staff, Von Moltke the Younger; in Austria-Hungary, Emperor Franz Joseph, a man who tried, through sheer hard work, to stave off the coming chaos in his empire; in Russia, Tsar Nicholas II and his wife; in Britain, King Edward VII, Prime Minister Herbert Asquith, and British admiral Jacky Fisher, the fierce advocate of naval reform who entered into the arms race with Germany that pushed the continent toward confrontation on land and sea.  There are the would-be peacemakers as well, among them prophets of the horrors of future wars whose warnings went unheeded: Alfred Nobel, who donated his fortune to the cause of international understanding, and Bertha von Suttner, a writer and activist who was the first woman awarded Nobel's new Peace Prize. Here too we meet the urbane and cosmopolitan Count Harry Kessler, who noticed many of the early signs that something was stirring in Europe; the young Winston Churchill, then First Lord of the Admiralty and a rising figure in British politics; Madame Caillaux, who shot a man who might have been a force for peace; and more. With indelible portraits, MacMillan shows how the fateful decisions of a few powerful people changed the course of history.  Taut, suspenseful, and impossible to put down, \"The War That Ended Peace\" is also a wise cautionary reminder of how wars happen in spite of the near-universal desire to keep the peace. Destined to become a classic in the tradition of Barbara Tuchman's \"The Guns of August,\" \"The War That Ended Peace\" enriches our understanding of one of the defining periods and events of the twentieth century. Praise for \"The War That Ended Peace\" \"One of the strengths of \"The War That Ended Peace\" is MacMillan's ability to evoke the world at the beginning of the twentieth century. . . . MacMillan's portraits of the men who took Europe to war are superb. . . . The logic of MacMillan's argument is such that even now, as she leads us day by day, hour by hour through the aftermath of the assassination of Archduke Franz Ferdinand in Sarajevo on June 28, 1914, we expect some statesman or other to jump on the lighted fuse. . . . 'There are always choices, ' MacMillan keeps reminding us.\"--\"The New York Times Book Review\" (Editor's Choice)  \"Magnificent . . . \"The War That Ended Peace\" will certainly rank among the best books of the centennial crop. . . . [MacMillan] deftly navigates the roiling currents and counter-currents of the pre-war decades.\"--\"The Economist\"\"From the Hardcover edition.\"",
  "genres": [
    "History",
    "Nonfiction",
    "World War I",
    "War",
    "Politics",
    "European History",
    "World History"
  ],
  "author": "Margaret MacMillan",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/20686225-the-war-that-ended-peace"
}