{
  "title": "The Lion Triumphant",
  "description": "Catharine KingsmanThe Lion Triumphant follows The Miracle at St Bruno's with Catharine, the daughter of Damask, growing up in the new Elizabethan age -- one of the most eventful in English history because of the struggle for power between two mighty rivals had begun.Catharine, smarting from the bitter blow which deprived her of her lover, meets the lusty sea Captain Jake Pennlyon, who makes it clear that he allows nothing to come between him and his desires. Catharine is the chief of these and the battle between two strong-willed and tempestuous people is fought out in the shadow of the growing rivalry between Spain and England. Catharine delights in outwitting the man who would subdue her and before he can have his way a mysterious abduction takes place. A captive on a Spanish galleon, Catharine experiences the terrors of the sea and makes the acquaintance of the mysterious and dignified Don Felipe. In the Hacienda she discovers the reason for her capture and what is demanded of her, which bears out the fact that Jake Pennlyon is a man whose life is inextricably interwoven with her own.His symbol is the Lion and there is no escape from him and his determination to overcome her resistance. He is as sure of his power to subdue her as he is of England's to rule the seas. With her Spanish son Roberto and her English daughter Linnet, Catharine is torn between love and loyalty in a story of lusty adventure on land and sea, when those who lived in the turbulent sixteenth century were caught up in the trmendous events of their times. The fight for survival is Catharine's and Jake's, Roberto's and Linnet's -- as well as England's. From Plymouth, the ships set forth, for the issue will be decided at sea. Here is the most significant engagement of all times when the little ships of England drove off the mighty Spanish galleons of Spain and the Invincible Armada was defeated, leaving the Lion Triumphant.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Historical",
    "Historical Romance",
    "British Literature",
    "Mystery"
  ],
  "author": "Philippa Carr",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/2068595.The_Lion_Triumphant"
}