{
  "title": "The Shadow Legions",
  "description": "Book 7 of the bestselling Crimson Worlds series... The war with the First Imperium is over, and Grand Fleet is limping home from the frontier. Erik Cain, Augustus Garret, and the rest of the high command are grimly satisfied that humanity has been saved from the First Imperium menace. There is no joy, however…no elation at the “victory.” The losses this time were too heavy…too personal…to bear. They did what had to be done to drive back the enemy and save the human worlds from certain destruction. Now they were left to find a way to live with the gut wrenching decisions that victory had required. Augustus Garret needed time. Time for repairs, time to replace losses, time to learn how to go on in the aftermath of what he’d done. But the fleet wasn’t heading for a well-deserved rest…they were moving into another firestorm. A new menace, one as deadly as the First Imperium, was waiting for them, and it threatened to shatter the fragile alliance of the Earth powers and throw all of human space into another desperate war…one that might be the final confrontation. On world after world, mysterious forces are invading, taking control of the most vital colonies. The invaders are well-drilled powered infantry, veteran forces that quickly shattered the planetary militias and established brutal occupation regimes. Garret, Cain, and the leaders of the Alliance’s forces must rally themselves once again to face this new threat…an unknown enemy that is as well trained, experienced, and equipped as the Marines themselves. Indeed, on some colony worlds rumors are already spreading that the invaders are the Marines themselves, that they have come to conquer, to rule…",
  "genres": [
    "Science Fiction",
    "Military Fiction",
    "Space Opera",
    "Fiction",
    "Audiobook",
    "Military Science Fiction"
  ],
  "author": "Jay Allan",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/20684823-the-shadow-legions"
}