{
  "title": "Shark's Bait",
  "description": "Sasha Summers is one smart and savvy businesswoman. Highly educated with a natural knack for business, she's invented a great product that she knows will be a surefire success. But one major problem stands between her and her dreams of becoming a star entrepreneur -- she's broke. With debts piling up and loans in default, she's close to giving up hope.Her luck takes a sharp turn for the better when she gets a call from the casting director of Shark's Bait, a hot new reality series that helps inventors get their products off the ground. Soon enough, Sasha is flying to New York City to pitch her business to two of the countries wealthiest, and sexiest, venture capitalists -- the charming Jonah Peterson , and the brooding Tristan Wade .These two billionaire tycoon's offer her a joint deal that she can't refuse, and soon enough, more than graphs and pie charts are laid out on the boardroom table...This HOT short story - MFM Menage- Billionaires- Interracial BWWM pairings- Light bondage- Lots of descriptive sexFor readers 18+ ONLY.****AN EXCERPT****Sasha watched as the camera panned back to the two execs, and the corner of her mouth curved into a wicked smile. Jonah Peterson and Tristan Wade. In her book, both of these men were certified hotties. While most of her friends preferred bad boy types, there was something about a powerful man in a powerful suit that never failed to turn her on. In her experience, buttoned up businessmen were always freaks in the sheets. Despite their conservative demeanor, there was always something wicked behind their eyes and something absolutely delicious in their pants.On the left sat Jonah with his rugged good looks, pale grayish blue eyes, trademark tan, and 5 o'clock shadow. He always dressed in black and had no use for ties, opting instead for two open buttons that teased a sliver of his sexy, muscled chest. Jonah was the adventurous and out going type with a charismatic $500 smile. He was always hard on entrepreneurs with edible products, a pattern Sasha noticed after watching several clips, and that made her nervous. But it didn't stop her from wanting to run her hands through his wavy black hair.Beside him sat Tristan. Tristan had a sexy British accent and WASPy, aristocratic good looks. He was the epitome of the old money type, with a boy next door appearance that contradicted his reserved and almost brooding nature. With his well coiffed dark blonde hair, he usually wore a variety of jewel tones and had a fondness for ascots. And even though Jonah could grill an entrepreneur like a steak, Tristan was always the more difficult one to crack.Something about the man seemed sadistic. And for reasons she couldn't understand, she liked it.Purchase SHARK'S BAIT now to read the rest!Visit www.INGRIDASH.com to learn more about the author!",
  "genres": [],
  "author": "Ingrid Ash",
  "average_rating": "2.50",
  "url": "https://www.goodreads.com/book/show/20680985-shark-s-bait"
}