{
  "title": "The Innocent",
  "description": "\"I was eaten, plain and simple. It felt like being burned alive, like every cell in my body was exploding. Then everything stopped—my breathing, my heart, my pain. . .\"  Alexa thinks she knows who she is, what she is capable ofand what she wants… until she grows wings. In this multicultural retelling of the Cupid and Psyche myth, getting the man of your dreams has never been more dangerous. Set in New York City, The Innocent is the story of Alexa Wyndham and Cristien LaRoche. She is a beautiful college student who loves romantic novels. He is a cursed 800-year-old medieval knight whose secrets could destroy them both.  Alexa wants to be loved perfectly like a romantic heroine in her favorite novels. This wish pulls her into a myth as old and dangerous as Love itself. Alexa will be lied to, tested, and betrayed. She will even have to face Death to redeem the man of her dreams. Is she strong enough to confront her greatest fears, her worst nightmares, and a mythic creature so old and dark that the mention of its very name would freeze the blood in her veins? Attaining true love has never been more of a heroic journey than in The Innocent. The trials and Romance of Alexa and Cristien are depicted from both points of view. The lovers trade fiery quips, metaphysical questions, and quotes from their favorite literary works all while dark forces and nasty twists of fate conspire to destroy them. The Innocent is a contemporary retelling of Cupid and Psyche that explores the mythic roots of literature’s most favorite Romances* and delves into the very heart and meaning of love, friendship, and forgiveness. It is written in a rich poetic style with literary allusions and multicultural mythic references that are at once captivating and illuminating. The Innocent is crafted to be heartbreaking and humorous, thought-provoking and uplifting. It will take Alexa and Cristien from suffering to heroism, from hatred to forgiveness, from Death to Life. It will teach them to see beyond the skin to the beauty within us all.* The reader will find references to and quotes from Beauty and the Beast, Jane Eyre, Pride and Prejudice, Wuthering Heights, Layla and Majnun, Tristan and Iseult, Romeo and Juliet, and A Thousand and One Nights to name a few. A must read for lovers of myth and literature!",
  "genres": [
    "Paranormal",
    "Romance",
    "Fantasy",
    "Fiction",
    "Paranormal Romance"
  ],
  "author": "Candice Raquel Lee",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/20691929-the-innocent"
}