{
  "title": "Lone Wolf Rising",
  "description": "Rebecca Winters and her pack of misfits face unimaginable dangers as she learns to balance her life in the supernatural world and maintain her identity in the human world. Join her and her family as they learn family secrets that may be better left hidden and they uncover the truth behind her parents' tragic death ten years ago. As she learns to navigate the dangerous werewolf world she meets a couple of amazing men. She may even be lucky to find love; the question is which guy should she choose?Rebecca Winters is a witch, only she doesn't know about the power that runs through her veins because her parents cast a binding spell on her and her siblings before they died ten years ago. Just because she doesn't know about her family heritage, doesn't mean the supernatural world will leave her alone. The Winters’ family is well known on the darker side of the supernatural world and the Matthews family (on her mother’s side) is just as strongly recognized on both light and dark sides. So when she stumbled upon the local werewolf pack her destiny was re-written and she became one of them. She thought she would simply join the battle against the vampires and in return she would have supernatural abilities that would help her discover what really happened to her parents ten years ago. But other forces were in play and two days before her first transformation her entire pack was massacred. Now she has more things to worry about than a case that was closed for lack of evidence years ago. It seems the vampire and werewolf war is the least of her concerns. The other forces at play are far more powerful and than she could have ever imagined. First she will need to rebuild her pack. The rogue wolves in the surrounding areas seem like a good place to start but danger lies in that move. Gabriel Black seems to be her savior in that area of her life. But will she be able to increase her numbers fast enough to keep everyone safe? Next she will find a way to keep her family safe. Her parents and grandmother may have lied to her since she was born, but her twin sister, Savvy and younger brother, Hunter were innocent in all of this. Keeping them safe was going to be a difficult task but she was bound and determined to make that happen. It always helps to ally with a powerful political group. That step will be easy, or so she thinks. “The Authority” has happily embraced her and made her a reluctant council member. They even gave her Lucky Lamont to help her get situated in this strange new world with imposing rules and deadly consequences. But did she choose the right group? But the most important thing she needs to do is find a way to make peace with her alpha wolf. Her wolf sponsor told her that becoming a wolf was like merging two identities into one mind but she never thought it would be this intense. Who enjoys being constantly critiqued by something that thinks it is better than her in every way? Will she be able to maneuver a peace treaty with her wolf in time to create a treaty with the vampire clan? Oh and if everything else falls into place she wouldn't mind graduating high school. Alive.",
  "genres": [
    "Paranormal",
    "Vampires",
    "Urban Fantasy",
    "Fantasy",
    "Romance",
    "Werewolves",
    "Supernatural"
  ],
  "author": "Jami Brumfield",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/20691558-lone-wolf-rising"
}