{
  "title": "Les MISERABLES: Cosette (Les Mis?rables)",
  "description": "Description pour: Les MISERABLES de Victor Hugo Contexte historique Victor Hugo a commence Les Miserables en 1845 sous le titre Les Miseres. Puis il \"les\" a abandonne pendant quinze ans. Il les reprend en 1860, et la premiere partie du livre parait le 3 avril 1862. Le 15 mai, publication des deuxiemes et troisiemes Parties du roman (immense succes populaire, la foule s'amasse des 6 heures du matin devant les grilles des librairies). Le 30 juin paraissent les deux dernieres parties. Dans une lettre a Lacroix du 23 mars 1862, Victor Hugo ecrit: Ma conviction est que ce livre sera un des principaux sommets, sinon le principal de mon uvre. Cette uvre est batie en cinq parties et le recit s'organise au tour de Jean Valjean, ancien forcat, depuis sa sortie de prison en 1815 jusqu'a sa mort, en 1833, dans les bras de Cosette et de Marius. Mais autour de Jean Valjean, apparaissent aussi les destinees d'autres miserables; Fantine, ouvriere obligee de confier Cosette, sa fille, a des inconnus, les Thenardier qui la traiteront comme un esclave. Marius, qui tombe amoureux de Cosette, et qui s'engagera sur les barricades lors de l'insurrection de 1832. Gavroche, gamin de Paris, qui sera tue, en chantant, sur une barricade. Depuis leur parution, Les Miserables sont l' uvre la plus celebre et la plus lue de Victor Hugo. Jean Valjean, Cosette, Gavroche, font maintenant parti des personnages connus de chaque lyceen et lyceenne. Les Miserables apparaissent comme ce \"livre unique\" dont revait le dix-neuvieme siecle. L'ambition demesuree de Victor Hugo est explicite: \" Ce livre est un drame dont le premier personnage est l'infini. L'homme est le second.\"",
  "genres": [
    "Classics",
    "Fiction",
    "France",
    "Historical Fiction",
    "French Literature",
    "Literature",
    "Novels"
  ],
  "author": "Victor Hugo",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/20690420-les-miserables"
}