{
  "title": "Planet of the Bugs: Evolution and the Rise of Insects",
  "description": "Dinosaurs, however toothy, did not rule the earth―and neither do humans. But what were and are the true potentates of our planet? Insects, says Scott Richard Shaw― millions and millions of insect species. Starting in the shallow oceans of ancient Earth and ending in the far reaches of outer space―where, Shaw proposes, insect-like aliens may have achieved similar preeminence― Planet of the Bugs spins a sweeping account of insects’ evolution from humble arthropod ancestors into the bugs we know and love (or fear and hate) today.Leaving no stone unturned, Shaw explores how evolutionary innovations such as small body size, wings, metamorphosis, and parasitic behavior have enabled insects to disperse widely, occupy increasingly narrow niches, and survive global catastrophes in their rise to dominance. Through buggy tales by turns bizarre and comical―from caddisflies that construct portable houses or weave silken aquatic nets to trap floating debris, to parasitic wasp larvae that develop in the blood of host insects and, by storing waste products in their rear ends, are able to postpone defecation until after they emerge―he not only unearths how changes in our planet’s geology, flora, and fauna contributed to insects’ success, but also how, in return, insects came to shape terrestrial ecosystems and amplify biodiversity. Indeed, in his visits to hyperdiverse rain forests to highlight the current insect extinction crisis, Shaw reaffirms just how crucial these tiny beings are to planetary health and human survival.In this age of honeybee die-offs and bedbugs hitching rides in the spines of library books, Planet of the Bugs charms with humor, affection, and insight into the world’s six-legged creatures, revealing an essential importance that resonates across time and space.",
  "genres": [
    "Science",
    "Nonfiction",
    "Nature",
    "Biology",
    "Evolution",
    "Animals",
    "Palaeontology"
  ],
  "author": "Scott Richard Shaw",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/20694737-planet-of-the-bugs"
}