{
  "title": "Bridled and Broken Part One: A Bitter Submission",
  "description": "Before she was MILKED BY ROYALTY, Julia Dorne was BRIDLED AND BROKEN.At just 19-years-old, Julia Dorne thinks she has it a sterling GPA, a magnificent home, and a fiancé dedicated to making her every dream come true.Or so he claims...Within minutes of moving in to his new home, Julia finds herself swept away to the deepest, darkest corners of his suburban lair. She's blindfolded, bound, and…and…So turned on she can hardly contain herself.She shouldn’t like the way Matthew dominates her. She shouldn’t consent to calling him master, but she does. For one night at least, Matthew Jacobs is no longer her fiancé. He’s her master, and she’s his slave, his pet, his…ponygirl. She prances. She performs. She pleasures him just as a good ponygirl should, and just like a good master, he promises never to let her go.Not even when she begs for release.What starts as a simple game, soon turns into something far more sinister. Bound and helpless, Julia quickly learns that no pleasure comes without a price. She gave herself to a man she thought she could trust, and now she must learn to live with her one ultimate submission.No matter how bitter that submission may be.BRIDLED AND BROKEN PART A BITTER SUBMISSION is a 10,000 word erotic tale featuring bondage, leather, whips, ponyplay, and the transformation of one young virgin into a pliant and willing ponygirl. This is a work of fiction meant for an adult audience. All characters are over 18. The author does not condone or endorse any of the behaviors carried out by its characters.For longer works featuring ponyplay, human cow, and other pet play themes, consider reading the author's other works including the 53,000 word BDSM erotic novel, HIS BLACK PEARL, and MILKED INTO THRALL, a 25,000 word erotica containing elements of bondage, lactation, human cow training, and tons of milking. Also available is the 65,000 word companion series, MILKED BY ROYALTY, which features Julia Dorne in an all new the subverted hucow of a rich and powerful English lord.",
  "genres": [],
  "author": "Jena Cryer",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/20692892-bridled-and-broken-part-one"
}