{
  "title": "The Future, Declassified: Megatrends That Will Undo the World Unless We Take Action",
  "description": "Twenty-five years ago when Mathew Burrows went to work for the CIA as an intelligence analyst, the world seemed frozen. Then came the fall of the Berlin Wall and the implosion of the Soviet Union; suddenly, unpredictability became a universal theme and foresight was critical. For the past decade, Burrows has overseen the creation of the Global Trends report―the key futurist guide for the White House, Departments of State and Defense, and Homeland Security. Global Trends has a history of making bold predictions and being * In 2004, it argued that al-Qaeda's centralized operations would dissolve and be replaced by groups, cells, and individuals―the very model of the 2012 Boston bombings.* In 2008, it included a scenario dubbed October Surprise, imagining a devastating late-season hurricane hitting an unprepared New York City.In The Future, Declassified , Burrows―for the first time―has expanded the most recent Global Trends report into a full-length narrative, forecasting the tectonic shifts that will drive us to 2030. A staggering amount of wholesale change is happening―from unprecedented and widespread aging to rampant urbanization and growth in a global middle class to an eastward shift in economic power and a growing number of disruptive technologies. Even our physical geography is changing as sea levels rise and faster commercial shipping routes open up through a warming Arctic region.The book concludes with its most provocative four fictional paths to 2030 with imagined storylines and characters based on analysis by the most authoritative figures in the intelligence community. As Burrows argues, we are living through some of the greatest and most momentous developments in history. Either we take charge and direct those or we are at their mercy. The stakes are particularly high for America's standing in the world and for ordinary Americans who want to maintain their quality of life. Running the gamut from scary to reassuring, this riveting book is essential reading.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Military Fiction",
    "Science",
    "International Relations",
    "Business",
    "Technology"
  ],
  "author": "Mathew J. Burrows",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/20695974-the-future-declassified"
}