{
  "title": "Los filósofos contemporáneos y la técnica: De Ortega a Sloterdijk",
  "description": "Interesantísimo ensayo este Los filósofos contemporáneos y la técnica. De Ortega a Sloterdijk. Se trata de la última obra del profesor de Filosofía de la Universidad de Barcelona Josep M. Esquirol, autor que me atrapó hace un tiempo con su magnífico El respeto o la mirada atenta. En la breve y clara introducción, Josep M. Esquirol explica el sentido de la expresión «era de la técnica», que trata de dar cuenta de una radical transformación técnica del mundo, de la técnica convertida en nuevo mundo, de la modificación no sólo ya de aspectos sectoriales o concretos de la vida humana, sino de aspectos mucho más generales y relevantes: de la manera de pensar, de ver el mundo, de vivir, de organizar la vida política y de legitimar el poder…es decir, de la técnica convertida también en ideología, en megasistema, en poder ilimitado o superación del humanismo… Para comprender esta nueva era y el lugar del hombre en ella, el libro da cuenta de la ya pensado sobre la técnica por ocho filósofos contemporáneos. Cada uno de ellos merece capítulo propio en una obra que sin pretensión de realizar comparativas, evidencia muchas similitudes y algunas diferencias entre el pensamiento de los diferentes filósofos y tiene la gracia de no resultar en absoluto repetitiva, tal es la variedad de acercamientos y riqueza que ofrece la problemática del libro. Los filósofos protagonistas son los siguientes:- José Ortega y Gasset (1883-1955)- Martin Heidegger (1889-1976)- Jan Patocka (1907-1977)- Hannah Arendt (1906-1975)- Jacques Ellul (1912-1994)- Hans Jonas (1903-1993)- Jürgen Habermas (1929)- Peter Sloterdijk (1947) Particularmente iluminador resulta el capítulo dedicado a Jacques Ellul en cuanto a la definición del paisaje técnico en el que habitamos, sin olvidar la lucidez de Ortega y Gasset profundizando en muchos de los males que aquejan al hombre moderno; Heidegger nos alumbra sobre la diferente forma de ver el mundo, la pérdida de un habitar más poético y arraigado en un paisaje que no deja de dar oportunidades para el autoconocimiento; interesantísimo Jan Patocka relacionando perturbación espiritual, comprensión, existencia y sacrificio; Hannah Arendt conecta permanencia e identidad y realiza una apología de la acción y la participación; Hans Jonas apela a la responsabilidad de poseer una técnica que excede con mucho a lo imaginable hace pocas generaciones; Habermas incide en el actuar comunicativo, el lenguaje y la conciencia mientras que Sloterdijk realiza un pensamiento lanzado al futuro. En la pertinente coda final, Esquirol reflexiona sobre el pensamiento y el lenguaje, la conciencia y la armonía, las cosmicidades y el humanismo,...un aire que atraviesa de parte a parte el conjunto de la obra.  Me ha gustado mucho Los filósofos contemporáneos y la técnica, obra rica y de fácil lectura, atractiva y extraordinariamente actual. Enteramente recomendable este título de Josep M. Esquirol.",
  "genres": [],
  "author": "Josep Maria Esquirol Calaf",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/20698111-los-fil-sofos-contempor-neos-y-la-t-cnica"
}