{
  "title": "Make It Ahead: A Barefoot Contessa Cookbook",
  "description": "#1 NEW YORK TIMES BESTSELLERFor the first time, trusted and beloved cookbook author Ina Garten, the Barefoot Contessa, answers the number one question she receives from cooks: Can I make it ahead?If you’ve ever found yourself stuck in front of the stove at your own party, scrambling to get everything to the table at just the right moment, Ina is here to let you in on her secrets! Thanks to twenty years of running a specialty food store and fifteen years writing cookbooks, she has learned exactly which dishes you can prep, assemble, or cook ahead of time. Whether you’re hosting a party or simply making dinner on a hectic weeknight, Ina gives you lots of amazing recipes that taste just as good— or even better! —when they’re made in advance.In Make It Ahead, each recipe includes clear instructions for what you can do ahead of time, and how far in advance, so you can cook with confidence and eliminate last-minute surprises. Make a pitcher of Summer Rosé Sangria filled with red berries, let it chill overnight for the flavors to develop, and you have a delicious drink to offer your friends the minute they arrive. Simmer a pot of Wild Mushroom & Farro Soup , enjoy a bowl for lunch, and freeze the rest for a chilly evening. You can prep the kale, Brussels sprouts, and lemon vinaigrette for Winter Slaw ahead of time and simply toss them together before serving. Assemble French Chicken Pot Pies filled with artichokes and fresh tarragon a day in advance and then pop them in the oven half an hour before dinner. And for dessert, everyone needs the recipe for Ina’s Decadent (gluten-free!) Chocolate Cake topped with Make-Ahead Whipped Cream . Ina also includes recipes for the biggest cooking day of the year—Thanksgiving! Her Ultimate Make-Ahead Roast Turkey and Gravy with Onions & Sage may just change your life.With beautiful photographs and hundreds of invaluable make-ahead tips, this is your new go-to guide for preparing meals that are stress-free yet filled with those fabulously satisfying flavors that you have come to expect from the Barefoot Contessa.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Foodie",
    "Food and Drink"
  ],
  "author": "Ina Garten",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/20697389-make-it-ahead"
}