{
  "title": "Desperately Ever After",
  "description": "AMAZON #1 bestseller for both WOMEN'S FICTION FANTASY and HUMOR! National Indie Excellence Awards FINALIST!Imagine what might happen if our most beloved fairy tale princesses were the best of friends and had the dreams, dilemmas, and libidos of the modern woman. How would their stories unfold after the wedding bells stopped ringing? Set in a fictional realm based on New York City, DESPERATELY EVER AFTER sprinkles women’s fiction with elements of fantasy, and encourages readers to rethink everything they know about happy endings. Years after turning her husband from beast back to man and becoming his queen, Belle finds out she’s finally going to have a child. But before she can announce the wondrous news, she catches him cheating and watches her “happily ever after” go up in flames. Turning to her friends for the strength to land with grace, she realizes she’s not the only one at a crossroads: Cinderella, a mother of four drowning in royal duties, is facing her 30th birthday and questioning everything she’s done (or hasn’t) with her life. Rapunzel, a sex-crazed socialite and one-woman powerhouse, is on a self-destructive quest to make up for 20 years locked away in a tower. Penelopea, an outsider with a mother-in-law from hell, is harboring a secret that could ruin everything at any moment. One part Sex and the City, two parts Desperate Housewives, and three parts Brothers Grimm, DESPERATELY EVER AFTER picks up where the original tales left off—and reimagines them a la Gregory Maguire’s Wicked. With the wit of authors like Jennifer Weiner and the vision of ABC’s Once Upon a Time, the women of DESPERATELY EVER AFTER rescue each other from life’s trials with laughter, wine, and a scandalous new take on happily ever after.Press:“Laura Kenyon makes happily ever after desperately delicious!” ~ Stephanie Evanovich, New York Times bestselling author.“If you are looking for a fun and gossipy story to satisfy the holes left when Sex and the City and Desperate Housewives had their series finales (or even if you’re going through Once Upon a Time withdrawal come season finale time) look no further than Desperately Ever After.” ~ Chick Lit Central“An explosive cocktail that will have you laughing out loud and wanting more and more!” ~ Lost in Chick Lit“Kenyon’s colorful imagery and often quick, lighthearted style makes it easy to keep flipping pages.” ~ The New Canaan Advertiser“This book is hilarious, sweet, and ingenious.” ~ WordsWisdomWhitney“Laura Kenyon’s Desperately Ever After is part Disney princess, part Sex in the City, and part TMZ Celebrity Gossip Site … and it’s fabulous!” ~ Kristy Feltenberger Gillespie, Keep Calm and Write On“There are misunderstandings, secrets kept that should be shared (and vice versa), silly situations and reconciliations a-plenty, so summarizing the rest of the story would be no easy task and, besides, it would take away the fun of reading it.” ~ Girls Love to Read (formerly Chick Lit Reviews and News)“It’s sarcastic, it’s flirty, it’s cheeky, it’s hilarious! Laura gave those girls and their stories such an interesting, contemporary spin with some magic and lots of humor. I couldn’t stop reading and my cheeks hurt from grinning.” ~ Guest post from Maryline at Jenny in Neverland",
  "genres": [
    "Fantasy",
    "Chick Lit",
    "Romance",
    "Fiction",
    "Fairy Tales",
    "Contemporary",
    "Retellings"
  ],
  "author": "Laura Kenyon",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/20696767-desperately-ever-after"
}