{
  "title": "Travels with My Donkey: One Man and His Ass on a Pilgrimage to Santiago",
  "description": "Having no knowledge of Spanish and even less about the care and feeding of donkeys, Tim Moore, Britain's indefatigable traveling Everyman, sets out on a pilgrimage to the cathedral at Santiago de Compostela with a donkey named Shinto as his companion. Armed only with a twelfth-century handbook to the route and expert advice on donkey management from Robert Louis Stevenson, Moore and his four-legged companion travel the ancient five-hundred-mile route from St. Jean Pied-de-Port, on the French side of the Pyrenees, to the cathedral at Santiago de Compostela which houses the remains of Spain's patron saint, St. James.Over sun-scorched highways, precipitous bridges, dirt paths shaded by leafy trees, and vineyards occasionally lashed by downpours, Moore and Shinto pass through some of northern Spain's oldest towns and cities in colorful company. Clearly more interested in Shinto than in Moore, their fellow walkers are an assortment of devout Christian pilgrims, New Age--spirituality seekers aspiring to be the next Shirley Maclaine, Baby Boomers contemplating middle age, and John Q Public just out for a cheap, boozy sun-drenched outdoor holiday.As Moore pushes, pulls, wheedles, cajoles, and threatens Shinto across Spain, the duo overnights in the bedrooms, dormitories, and---for Shinto---grassy fields of northern Spain. Shinto, a donkey with a finely honed talent for relieving himself at the most inopportune moments, has better luck in the search for his next meal than Moore does in finding his inner pilgrim. Undaunted, however, Man and Beast finally arrive at the cathedral and a successful end to their journey. For readers who delighted in his earlier books, Travels With my Donkey is the next hilarious chapter in the travels of Tim Moore, a book that keeps the bones of St. James rattling to this day.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Spain",
    "Humor",
    "Memoir",
    "Animals",
    "Biography"
  ],
  "author": "Tim Moore",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/1117772.Travels_with_My_Donkey"
}