{
  "title": "Forced to Strip",
  "description": "Jeanette's life has never been easy, especially since her mother brought Jack into the picture. Jack loathed her as a child, but as soon as she turned 18 and started to develop, he couldn't take his eyes off her. When she goes off to college she gets a job at the Gilded Gopher, a seedy strip club on the wrong side of town, where her alter ego Raven is quickly becoming one of the more popular dancers. One day she gets a visit from the man she least expected -- and Jack has his own methods of making sure he gets his private lap dance, and maybe a little bit more... This hot 5000 word short story contains taboo PI, humiliation, bareback sex, forced stripping, anal sex, and more! 18+ ONLY!**** AN EXCERPT ****“Sweetie you really should be nicer to me. I've come to rescue you.”I fold my arms in front of my chest and laugh. “I don't need your money. I have plenty of my own, thank you very much.”He cocks his head to the side, his closely cropped brown hair staying perfectly in place. “I'm sure you make a few dollars here and there, getting groped by a bunch of fat, sweaty pervs. ““Funnily enough, those fat, sweaty pervs have a lot more class than you do, Jack.”“You know what, I'm in a generous mood today, so I'm going to ignore that. If you apologize now we can forget this happened, I'll pay your tuition, and you'll never have to work a day until you graduate.”“No thank you. I'd rather work here until I die,” I say with the utmost conviction. “So just go. I'm never taking anything from you.”His smile fades. “Fine. Then I'm ready for my dance.\"Dance? He's really lost his mind now if he thinks I'm going to dance for him. My eyes narrow and I say, “like hell you're getting any dance from me.”“I paid for it, so I'm getting it,” he tells me darkly.I shake my had, refusing him. “No big deal, I'll just tell them to refund you,” I say before I turn away. This is only going to cause trouble with Jaurez, but there's no way I'm going through with it.“Well your mother is going to be awfully disappointed when she finds out what you're doing.”I pause before I get a chance to exit the room. Shit! He wouldn't? Would he? No, he totally would. This is Jack, after all, and I just dug myself into a hole.“Your mother, and all of your relatives and friends back home, of course. And let's just hope your school doesn't take away your scholarship when they find out what you really do.”I slowly turn to face him – even his smug face makes absolutely hot with anger. And worst of all, I don't even care about those other things – I could deal with my friends knowing, I somehow could manage without scholarship, but my mother knowing? It would absolutely kill her.“Ah so it looks like you do need me for something after all.”“What is it that you want, Jack?”He chuckles, smile lines encasing his mouth. “ I told you what I want. It's simple. I want my private dance that I paid for,” he retorts.“You can't do this. It's sick!”“I agree. The fact that you take your clothes off for money is sick, and I offered you a way out and you refused it.”“Quit the games! You know what I mean. It's sick that you want me to dance for you!”He leans forward, voice low and growling. “You're damn straight I want you to dance. You're going to dance for me, Jeanette. And you're going to strip for me, until you're naked. Then you're going to grind on me. And you're going to make it hot and sexy. Because if I don't leave here hard as a rock, all bets are off.”",
  "genres": [],
  "author": "Madeline Monoghan",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/20695875-forced-to-strip"
}