{
  "title": "The Evolutionist: The Strange Tale of Alfred Russel Wallace",
  "description": "The Evolutionist tells the story of one of Britain’s most controversial and misunderstood Victorians, a man Sir David Attenborough called \"the most admirable character in the history of science\" -- Alfred Russel Wallace. In 1858, Wallace earned equal credit with Charles Darwin for the discovery of our modern theory of evolution. But in an era that pitted science against faith, Wallace boldly declared his belief in both -- thus clashing headlong with London's scientific elite, including Darwin. More than 150 years later, Wallace has become the forgotten father of evolution.Book Description/Blurb:1858. The Malay Archipelago. In these remote tropics, a young British naturalist, Alfred Wallace, toils in obscurity. He collects specimens—beetles, moths, ants and birds—that sell for pennies apiece in England. He also investigates ideas that perplex the world’s leading scientific minds, an elite community that spurns him as a mere interloper.One night in his isolated jungle hut, suffering from fever and hallucination, Wallace solves the greatest mystery of the era: the origin of species. To circulate his discovery, he contacts a distant acquaintance—Charles Darwin. Unbeknownst to Wallace, Darwin has been secretly penning a near-identical version of the same evolutionary theory for twenty years. Wallace’s fateful decision to confide in Darwin forges a unique bond between the two men. Darwin achieves world-renown and Wallace earns, if nothing else, widespread grudging respect. But then Wallace returns to England and takes up with the spiritualist movement sweeping the nation. Devotion to spiritualism launches Wallace into a headlong clash not only with London’s scientific establishment, but the man at its very center, Darwin.From oppressive jungle to mid-Victorian London, The Evolutionist tells of one man’s determination to seek out his own truth. It is a story of perseverance and inspiration, science and faith, and ultimately, it is about the resilience of the human heart.",
  "genres": [
    "Biography"
  ],
  "author": "Avi Sirlin",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/20702598-the-evolutionist"
}