{
  "title": "Sleep With One Eye Open",
  "description": "The Zombie Apocalypse doesn’t start in America, China or Europe. It begins in our own backyard; Sydney, Australia.  It’s 2019 and the annual Zombie Horde Parade is about to commence in Sydney. Instead of the usual cast of jovial participants in fancy dress, the Sydney City CBD is inundated by a horde of zombies flooding out from the underground train station in Hyde Park and rampaging into an unsuspecting public. A large scale brawl erupts in the CBD as people suddenly realise that they aren’t just defending themselves, they’re fighting for their lives.  We follow John’s journey as he tries to escape the carnage and savagery. By the time he reaches safety, the media have only sketchy reports of the morning’s events; while the police and riot squad are at a loss to understand the motives of the group responsible for the lethal riot that continues to rage. No matter who John runs into, their story is always the same; they were attacked by a group of psychopaths with an unrelenting thirst for violence and murder.  The scourge of the undead rapidly spreads across the city as people make things worse by engaging in looting and vigilantism. With their attention diverted from the real enemy, hordes of zombies easily overrun entire suburbs within hours. Just when things look to be at their worst, the entire city is plunged into a blackout, allowing looters and thugs to add to the increasingly insurmountable difficulties people are already facing. John’s struggle to survive begins with the knowledge that nowhere is completely safe.  He knows that Sydney will inevitably fall into the grasping hands of the undead, and the thugs and other lowlifes will be there to victimise those not strong or smart enough to escape the necropolis. This is the story of an ordinary man who uses courage and guile to achieve the seemingly impossible.",
  "genres": [
    "Zombies",
    "Horror"
  ],
  "author": "Beau Johnston",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/20701705-sleep-with-one-eye-open"
}