{
  "title": "Prison Noir",
  "description": "\"Reading the fifteen stories in Prison Noir is a sobering experience. Unlike most claimants to that much-abused term, this is the real thing...The power of this collection comes from the voices of these authors, voices suffused with rage (\"3 Block From Hell,\" by Bryan K. Palmer), despair (\"There Will Be Seeds for Next Year,\" by Zeke Caligiuri), and madness (\"Shuffle,\" by Christopher M. Stephen).\"-- New York Times Book Review\"These are stories that resonate with authenticity and verve and pain and truth. Any collection edited by the National Book Award-winning author Oates ( them ; Blonde , A Love Story ) deserves attention, but the contributors are deft and confident, and great writers without her imprimatur....Authentic, powerful, visceral, moving, great writing.\"-- Library Journal , Starred review\"A remarkable anthology of stories written by inmates of correctional institutions across America...Most importantly, this landmark volume amplifies the voices of the incarcerated.\"-- Publishers Weekly , Starred reviewOne of BookRiot 's Must-Read Books from Indie Presses for 2014\"I gobbled it up. The voice in each piece is authentic...A fascinating read.\"-- subTerrain Magazine\"A strong compilation of prison literature, varied, well-written and not always what might be expected.\"-- Reviewing the Evidence\"No matter what side of the bars you live on, Prison Noir is worth doing time with.\"-- Killeen Daily Herald\"Readers will soak up every line...There is no doubt that readers from all walks of life, especially those less knowledgeable about life in prison, will appreciate Prison Noir .\"-- Killer Nashville\"This is a collection of stories that you will want to take your time with, savor, and probably reread a few times.\"-- Jenn's Review Blog\"There is an intensity and melancholy that shines through these fifteen short stories, all written by prison inmates incarcerated throughout the US, and edited by the inestimable Joyce Carol Oates.\"-- A Lit Chick\"Affecting, powerfully written and arresting literature. Well worth seeking out.\"-- BRSBKBLOGAkashic Books continues its groundbreaking series of original noir anthologies, launched with the summer '04 award-winning best seller Brooklyn Noir . Each book is comprised of all-new stories, each one set in a distinct neighborhood or location within the respective geographic range of the book. This anthology, with stories set in different prisons across the US, presents an absolutely new perspective on prison literature.From the introduction by Joyce Carol \" The blood jet is poetry --these words of Sylvia Plath have reverberated through my experience of reading and rereading the stories of Prison Noir . In this case the blood jet is prose, though sometimes poetic prose; if we go a little deeper, in some chilling instances, the blood jet is exactly blood . For these stories are not \"literary\" exercises--though some are exceptionally well-written by any formalist standards, and artfully structured as narratives; with a single exception the stories are stark, somber, emotionally driven cris de coeur...We may feel revulsion for some of the acts described in these stories, but we are likely to feel a startled, even stunned sympathy for the perpetrators. And in several stories, including even murderers' confessions, we are likely to feel a profound and unsettling identification...There is no need for fantasy-horror in a place in which matter-of-fact horror is the norm, and mental illness is epidemic. Vividly rendered realism is the predominant literary strategy, as in a riveting documentary film.\"Featuring brand-new stories Christopher M. Stephen, Sin Soracco, Scott Gutches, Eric Boyd, Ali F. Sareini, Stephen Geez, B.M. Dolarman, Zeke Caligiuri, Marco Verdoni, Kenneth R. Brydon, Linda Michelle Marquardt, Andre White, Timothy Pauley, Bryan K. Palmer, and William Van Poyck.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Crime",
    "Noir",
    "Mystery",
    "Anthologies",
    "Thriller"
  ],
  "author": "Joyce Carol Oates",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/20702486-prison-noir"
}