{
  "title": "The Joey Song: A Mother's Story of Her Son's Addiction",
  "description": "The Joey Song is an ode to parents who love a child---of any age and stage---struggling with the disease of addiction....together we are stronger. When addiction grabs a child, it chokes a parent. I know the life-draining squeeze of its grip. I've never felt so incapable and helpless, so sad, so lonely. Such fear. My child has been stolen from me---stolen from himself---and I mourn Joey's loss and suffering from a very lonely place. There is no broad community empathy or support for the families of addicts. There is no rallying cry of solidarity, no pretty ribbon brigade, and none of the comfort that so often gets baked into meatloaves and muffins. Instead there are closed doors and mouths and minds and hearts. I want addiction to be understood, not misrepresented, misjudged, and mishandled. Not hushed up or hidden away. Nasty things grow most freely in dark corners; the scourge of addiction needs to be dragged out into the light. Addiction has pummeled my family. Beating it back has been one long, hard fight. These mother's hands of mine, these nubby, bloodied claws, have seen battle---the battle between Hanging On and Letting Go; the battle between Barely Hanging On and Hanging in There; the battle to Survive the Unexpected; and the battle Just to Survive. Battered and bruised I may be, but I'm stronger and wiser. I finally understand there's nothing more I can do to help my son other than love him....and support him in a quest to help himself. Still, I carry around the very maternal and human need to do something. And I need to do something with this need to do something. So, I share my story. One mother's story of love and loss and learning. And surviving my son's addiction while coming to terms with the fact that he may not. Written from the place where I live, the place where love and addiction meet. This is The Joey Song.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Psychology",
    "Biography"
  ],
  "author": "Sandra Swenson",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/20702586-the-joey-song"
}