{
  "title": "Secrets: Diary of a Gutsy Teen",
  "description": "SECRETS received the #2015 Silver Medal in Pre-teen Fiction/General category from Moonbeam Children Book Awards!   Perfect # Reading for #Girls, #Tweens, #Parents, #Teachers, #Guidance Counselors Following in the footsteps of The Truth , Diary of a Gutsy Teen begins as the thirteen-year-old protagonist makes a move with her family to a new town. The diary is a perfect coming of age read. The girl has grown up a lot over the past year--and has made a list of everything that's important to her now that she doesn't want to forget when she gets older. But now, as she enters her early teen years, and growing up becomes the order of the day, she begins to write down the secrets she wants to keep--and the ones she has no one to tell about. From new school experiences to a new baby in the family to a new crush, this new teen finally feels empowered on making her own decisions with confidence and keeping those secrets she holds dearest for herself.In a positive and supportive diary-entry format, Dr. Barbara Becker Holstein encourages tween and early teen girls to carry the most precious parts of themselves into adulthood. A great book for mothers and daughters to read together, Secrets is aimed to improve communication, understanding, social skills and self-esteem for young girls as they enter the rocky road of teenager-dom. \" Secrets, Diary of a Gutsy Teen is a perfect book for any young teenager, helping her understand what girls development is all about. Questions & worries most of us have had or will have, are discussed and shared with her \"best friend\"...her diary!Dr. Holstein captures private thoughts that all of us have gone through too. Self-doubt; questioning our looks and our changing body.....are all perfectly addressed. This book is therapy, powerful and perfect for that precious teen in your life. Have her read this book...share your memories...than give her permission to make her own!Great job Barbara....you did it again!\"Eileen StrongProfessional SpeakerPresident of Strong IncentivesStrongIncentives.com",
  "genres": [],
  "author": "Barbara Becker Holstein",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/20702914-secrets"
}