{
  "title": "King of the Cracksmen: A Steampunk Entertainment",
  "description": "How far will the luck of the Irish stretch?The year is 1877. Automatons and steam-powered dirigible gunships have transformed the United States in the aftermath of the Civil War. All of the country’s land west of the Mississippi was sold to Russia nearly fifty years earlier, and “Little Russia,” as it’s now called, is ruled by the son of Tsar Alexander II. Lincoln is still president, having never been assassinated, but he’s not been seen for six months, and rumors are flying about his disappearance. The country is being run as a police state by his former secretary of war Edwin Stanton, a power-hungry criminal who rules with an iron fist.Liam McCool is an outlaw, known among other crooks as “King of the Cracksmen.” But his glory days as a safecracker and the head of a powerful New York gang end when he’s caught red-handed. Threatened with prison unless he informs on his own brethren fighting a guerilla war against Stanton’s tyranny, McCool’s been biding his time, trying to keeping the heat off him long enough to escape to San Francisco with his sweetheart Maggie. But when she turns up murdered, McCool discovers a trail of breadcrumbs that look to lead all the way up to the top of Stanton’s criminal organization. Joining forces with world-famed lady reporter Becky Fox, he plunges deep into the underground war, racing to find Maggie’s killer and stop Stanton once and for all.King of the Cracksmen is an explosive, action-packed look at a Victorian empire that never was, part To Catch a Thief , part Little Big Man , steampunk as you’ve never seen it before.Skyhorse Publishing, under our Night Shade and Talos imprints, is proud to publish a broad range of titles for readers interested in science fiction (space opera, time travel, hard SF, alien invasion, near-future dystopia), fantasy (grimdark, sword and sorcery, contemporary urban fantasy, steampunk, alternative history), and horror (zombies, vampires, and the occult and supernatural), and much more. While not every title we publish becomes a New York Times bestseller, a national bestseller, or a Hugo or Nebula award-winner, we are committed to publishing quality books from a diverse group of authors.",
  "genres": [
    "Steampunk",
    "Fantasy",
    "Historical Fiction",
    "Alternate History",
    "Science Fiction",
    "Fiction",
    "Audiobook"
  ],
  "author": "Dennis O'Flaherty",
  "average_rating": "3.11",
  "url": "https://www.goodreads.com/book/show/20702742-king-of-the-cracksmen"
}