{
  "title": "Scarlet Masquerade",
  "description": "What do you say to the woman you thought died over a century ago? Will time heal all wounds or does it just allow them to fester and grow? A.J. Locke has lived over two centuries and works like a demon, both figuratively and literally. As the owner of a successful pharmaceutical company that specializes in blood research, she has changed the way she can live her life. Wanting for nothing, she has smartly compartmentalized her life so that when she needs to, she can pick up and start all over again, which happens every twenty years or so. Love is not an emotion A.J. spends much time on. Since losing the love of her life to the plague one hundred fifty years ago, she vowed to never travel down that road again. That isn't to say she doesn't have women when she wants them, she just wants them on her terms and that doesn't involve a long term commitment. A.J.'s cool veneer is peeled back when she sees the love of her life in a lesbian bar, in the same town, in the same day and time in which she lives. Is her mind playing tricks on her? If not, how did Clarissa survive the plague when she had made A.J. promise never to change her? Clarissa Graham is a university professor who has lived an obscure life teaching English literature. She has made it a point to stay off the radar and never become involved with anything that resembles her past life. Every once in a while Clarissa has an itch that needs to be scratched, so she finds an out of the way location to scratch it. She keeps her personal life separate from her professional one, and in doing so she is able to keep her secrets to herself. Suddenly, her life is turned upside down when someone tries to kill her. She finds herself in the middle of an assassination plot with no idea who wants her dead.",
  "genres": [
    "Lesbian",
    "Paranormal",
    "Vampires",
    "Urban Fantasy",
    "Romance",
    "Erotica",
    "BDSM"
  ],
  "author": "Jett Abbott",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/11177970-scarlet-masquerade"
}