{
  "title": "#EuroMaidan: Rising for Freedom and Democracy in Ukraine",
  "description": "Ukraine's uprising, which is popularly known as EuroMaidan, begun when the man occupying the seat of president, Yanukovych, refused to sign the Association Agreement with the European Union. But the brutal beatings by a special riot police force, the Berkut, against peaceful protestors pushed it to become much more than this. It became a struggle for democracy and freedom.This isn’t just a people rising over the low wages that they suffer. They rise against a government that steals from the nation’s finances to become amongst the wealthiest in the world while forcing the people into poverty. They rise against constant oppression where the police act more like soldiers for a mafia regime than being there to protect them like they should. The corruption, their wish for freedom, and the need for a people’s government is the real reason why Ukrainians rise up. It is why they continue to fight and what they are willing to die for.\nA Picturesque View\nThis book gives you a photo centric view point on this popular uprising against an oppressive regime. The first of its kind on the market it beholds over 200 photographs of numerous photo journalists from Ukraine capturing the events from the very beginning to the uprisings in late January. These photographs capture the beauty of this important event, along with the humorous and creative nature of these people; most importantly, it reveals the terrifying and sad events that prompted them to push even harder.\nOur Efforts\nWe have two primary goals with the release of this book.It is in our wish to show you the humanity of the people so as to help everyone see that those standing up are just regular folk like you and I. They aren’t extremists but simply people pushed into extreme times. They do exactly what you and I would do if we were in the same circumstances where our freedom and rights were snatched away.In addition to this, it is also in our hopes to raise funds for humanitarian efforts in Ukraine. In 2013 alone, Ukraine ranked 144 out of 177 countries in the corruption index by Transparency International. It was also ranked by others as being the worst country in Europe for journalists. We hope to help fund change this so that Ukrainians can live in a safer and better society. No amount of funding will go toward any political party as we will only fund humanitarian needs.\nSpread the Word\nHelp us as well by spreading the word about EuroMaidan and the people there. Follow the current events on twitter feeds from the numerous accounts. Write to your political representatives to push them to take action. And help to find ways to fund this event if it is still going on. Basically, help us help them!You can see more information on this book and where to buy it at: http://BrineBooks.com/r/euromaidan",
  "genres": [],
  "author": "Chris Brine",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/20699449-euromaidan"
}