{
  "title": "Predictors Of Reading Comprehension Among Children: : Correlations And Various Multiple Regression Techniques",
  "description": "Multiple regression, which is a data analytic technique used to predict a continuous criterion variable based on several predictor variables, is widely used in educational research and acknowledged as a reliable statistical method that provides estimates of the magnitude and statistical significance of the relationships between variables with acceptable levels of accuracy. This paper is aimed to identify predictors of reading comprehension among children. The database used provides the results of a survey of 332 children on their reading and visual perceptions. It contains several independent variables, such as phoneme awareness, visual perception, morpheme awareness, gender and learning style (visual, auditory, or kinesthetic).In Chapter I, descriptive statistics are reported, and the multiple correlation coefficients and their p-values are computed to investigate the relationships between key variables. Chapter II presents the results of three multivariate analyses, namely forced entry, stepwise, and hierarchical multiple regression methods, used to identify whether there is an association between the dependent variable, reading comprehension, and the independent variables under study. It further presents how to dummy code a categorical variable into a set of dichotomous variables that can be entered into the regression model. The ratio of sample size to independent variables is reviewed, as are the assumptions underlying the various regression techniques. Chapter III synthesizes and discusses the findings, whereas Chapter IV concludes the paper.Most noticeably, all three regression methods suggested that phoneme awareness and visual perception are statistically significant predictors of reading comprehension, with phoneme awareness having the strongest association with reading comprehension in the expected positive direction. Thus, cognitive processes, such as visual perception, as well as reading-related linguistic skills, such as phoneme awareness, are likely to influence children’s reading performance.",
  "genres": [],
  "author": "Widad Akreyi",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/20707344-predictors-of-reading-comprehension-among-children"
}