{
  "title": "Angel's Halo",
  "description": "Creswell Springs was a small little town in Trinity Count, California. Population 1,500—maybe. It’s a quiet town, with small town values. Its greatest income is the University just outside of the town limits… and the revenue the local Motorcycle Club brings in.Being part of the MC that was Angel’s Halo was exactly like being part of a family. A scary, powerful, crazy family. It was also like its own society. There are rules, just as there are in every family, every society. But only breaking one of their rules will leave you in a broken, blood pile on the floor…No one touches Raven Hannigan.RavenI was the MC’s only weakness. Or so my father use to tell me as I was growing up. Mad Max Hannigan was once Angel’s Halos’ president. He made the rules and everyone was expected to follow them or come face to fist with the enforcer…I have spent my life in the middle of the MC. I knew the rules—the penalties for breaking those rules. So I knew what would happen to him if I let him break the golden rule… But I loved him, like I have never loved anyone or anything before. I thought my love would protect him.Of course it hadn’t. When our secret was discovered he was beaten.So I shouldn’t blame him for leaving me…BashAs the enforcer I knew the consequences. Knew exactly what was in store for me when Raven’s family found out that I had dared to break my MC’s unforgivable rule. I loved her, so it didn’t matter to me. When her oldest brother delivered my punishment I didn’t scream. Didn’t groan. I took it like the man my MC had made me, and would have done it over and over again if that was what it took to be able to call Raven Hannigan mine.But then my past reared its ugly head and I had a choice to make. One that I have only lived to regret.Taking on the job as Angel’s Halos’ new president was my second chance. But… would my secrets destroy everything Raven and I once had?",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Contemporary Romance",
    "Second Chance",
    "Adult",
    "Audiobook"
  ],
  "author": "Terri Anne Browning",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/20705369-angel-s-halo"
}