{
  "title": "Billionaire on Board",
  "description": "\"Who could seriously get a grip when one's imaginary boyfriend had just materialised like a genie from a bottle, looking larger than life?\"Join us on a cruise to the Mediterranean aboard the world's tubbiest super yacht... But attention: this is no Julia Roberts movie, no matter how hard it tries to be!Jude is happy.She's almost twenty-seven, she has great friends, a great family, a job as a tour guide and a doctoral thesis to write. She lives in a beautiful city, she's single and she likes it.Until the day she finds out she's not invited to her oldest friend's wedding because his madcap bride believes she has designs on him.Without further ado she invents a boyfriend and while she's at it: why not make him rich and handsome?He would need a name of course, something truly jet set, something with flair!She tries to conjure one up when she remembers her time at an English girls' school. One of her schoolmates had an older brother who was outrageously handsome and rich and his name had been Ryan Corvera-Fabergé. Honestly, can it get any more debonair?So Ryan Corvera-Fabergé it is.Too bad the real Ryan Corvera-Fabergé suddenly stands next to her in a five star hotel, two days before the wedding.Even worse, her game is up!The crispy billionaire turns out to be quite a handful and Jude has her work cut out for her.But enjoy her own account of the adventure.It has it all! Drama, romance, fun and passion... in no particular orderSizzle factor: Sexy chick lit (no ten page long in-and-outs, fireworks or chain-climacting pregnant virgins)Language: Characters tend to be outspoken! Nothing truly disgusting, but expect the occasional four letter word and the rare mentioning of body fluids.This book is written in British English. 60.000 words and whatever the oracle claims, the paperback had 234 pages when the author last checked...",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary Romance",
    "Humor",
    "Billionaire Romance",
    "Romantic Comedy",
    "Contemporary"
  ],
  "author": "Dasha G. Logan",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/20705929-billionaire-on-board"
}