{
  "title": "Time After Time",
  "description": "Calling Anna and Bennett's romance long distance is an understatement: she's from 1995 Chicago and he's a time traveler from 2012 San Francisco. The two of them never should have met, but they did. They fell in love, even though they knew they shouldn't. And they found a way to stay together, against all odds. It's not a perfect arrangement, though, with Bennett unable to stay in the past for more than brief visits, skipping out on big chunks of his present in order to be with Anna in hers. They each are confident that they'll find a way to make things work...until Bennett witnesses a single event he never should have seen (and certainly never expected to). Will the decisions he makes from that point on cement a future he doesn't want?Told from Bennett's point of view, Time After Time will satisfy readers looking for a fresh, exciting, and beautifully-written love story, both those who are eager to find out what's next for Time Between Us's Anna and Bennett and those discovering their story for the first time.Praise for TIME BETWEEN US\"A beautifully written, unique love story.\" --Melissa Marr, New York Times best-selling author of The Wicked Lovely series \"A warm, time-bending romance [that] will have readers rooting for the couple that keeps daring fate.\" --Publishers Weekly \"The story will hold readers with its twists and turns, present and future; its love, sadness, and anger; and especially, its surprising secrets.\" --Booklist \"a compelling story of love, fate, and consequences with plenty of sigh-worthy moments, this novel is the perfect choice for readers who want a romance that leaves them with something to think about when it's over. --Bulletin of the Center for Children's Books\"Romantic and passionate, Stone's debut novel is swoon-worthy...will resonate with readers who enjoy their romance mixed with adventure.\" -- School Library Journal\"Time Between Us is the very best kind of love story --heart-pounding, intense, and unputdownable!\" -- Elizabeth Scott, author of Bloom and Perfect You",
  "genres": [
    "Young Adult",
    "Time Travel",
    "Romance",
    "Contemporary",
    "Fantasy",
    "Science Fiction",
    "Paranormal"
  ],
  "author": "Tamara Ireland Stone",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/20706641-time-after-time"
}