{
  "title": "The Seashell Anthology of Great Poetry",
  "description": "The best collection of English and American classics -- new and old. A perfect introduction for those new to poetry, as well as a great selection of old favorites for poetry lovers everywhere. From Geoffrey Chaucer to e.e. cummings, from William Shakespeare to Anne Sexton, here are the great American and British poems of the last 500 years, organized by subject in a new and provocative way. “Great Poetry is personal,” writes Christopher Burns in his introduction to this extraordinary collection. “Like a seashell held to your ear, a poem resonates to the beating of your heart. The poet brings the words, you bring your life, and together you make the song.”Poets as diverse as Tennyson and Teasdale echo the themes of “Western Wind” hundreds of years apart. Maya Angelou and Janet Flanders, like talk show hosts sitting on stools, swap stories about their mothers. Robert Browning and Richard Wilbur, separated by more than a century, talk about the way men look at women. Walt Whitman and Allen Ginsberg describe the America each has found. Here are the poems of Edna St. Vincent Millay and Carl Sandburg, often ignored in the last few years, along with the masterpieces of William Butler Yeats, e. e. cummings, Theodore Roethke, Denise Levertov and Langston Hughes. Some of the poems are funny, others are sad, but all are unforgettable. Great poetry transcends the boundaries of place, time, gender, and race. Although there was no intention to be representative, half the poems were written by Americans and half by English, Irish, Welsh, Scottish and Canadian poets. And this anthology is a third of the poems were written in the last fifty years and a third were written between 1900 and 1945. The poems are organized to follow the contours of the loneliness of the artist, the uses of war, the role of nature, the constancy of love, and the coming on of death. And like all great poems, they are about you. As you read them, be prepared to hear your own heart roaring in your ear.Poets represented by more than one poem John Ashbery, W. H. Auden, Amiri Baraka, John Berryman, William Blake, Rupert Brooke, Elizabeth Barrett Browning, Robert Browning, Robert Burns, Lewis Carroll. Mary Coleridge, e. e. cummings, Walter de la Mare, Emily Dickinson, John Donne, Ernest Dowson, T.S. Eliot, Mari Evans, Robert Frost, Allen Ginsberg, Seamus Heaney, Robert Herrick, Gerard Manley Hopkins, A. E. Housman, Langston Hughes, Randall Jarrell, Robinson Jeffers, John Keats, Rudyard Kipling, Etheridge Knight, D. H. Lawrence, Denise Levertov, Henry Wadsworth Longfellow, Amy Lowell, Robert Lowell, Archibald MacLeish, John Masefield, Claude McKay, W.S. Merwin, Charlotte Mew, Edna St. Vincent Millay, John Mlton, Sharon Olds, Wilfred Owen, Sylvia Plath, Ezra Pound, Charles Reznikoff, Adrienne Rich, Edwin Arlington Robinson, Theodore Roethke, Christina Rossetti, Carl Sandburg, Sigfried Sassoon, Robert Service, Anne Sexton, William Shakespeare, Percy Bysshe Shelley, Gary Snyder, May Swenson, Sara Teasdale, Alfred Lord Tennyson, Dylan Thomas, Walt Whitman, Anna Wickham, Richard Wilbur, C. K. Williams, William Carlos Williams, William Wordsworth, James Wright, Elinor Wylie, and William Butler Yeats.",
  "genres": [
    "Poetry",
    "Reference",
    "Fiction",
    "Anthologies"
  ],
  "author": "Christopher   Burns",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/11178480-the-seashell-anthology-of-great-poetry"
}