{
  "title": "Country Music, U.S.A.",
  "description": "\"Described as \"the Bible for country music history and scholarship\" on its original publication, it is quite simply the cornerstone--and a highly readable one at that--of any shelf devoted to the country's Southern/Western rural class music and should be in any library of America's music heritage.\" -- Texas Books in Review From reviews of the first edition: \"The most accurate, complete and serious study of country music ever published.\" -- Nashville Tennessean \"It will stand as a basic source of reference [on] country music for many years to come-- probably forever.\" -- Stereo Review \"A splendid book...impressively documented, and...beautifully written.\" -- Journal of Southern HistoryFrom reviews of the revised edition: \"[Malone] has done something that most readers thought was impossible and that is to actually improve what most of us thought was a perfect book.\" -- Country Music News \"For almost two decades, Bill Malone's Country Music, U.S.A. has stood as the book in its field; this new edition secures that position. Scholars, music lovers, and general readers will all find it rewarding, whether for the first or second time.\" -- Journal of the West \"A book to be read, re-read, and savored.\" -- Southwest ReviewSince its first publication in 1968, Bill C. Malone's Country Music, U.S.A. has won universal acclaim as the definitive history of American country music. Starting with the music's folk roots in the rural South, it traces country music from the early days of radio to the beginning of the twenty-first century. This second revised edition includes an extensive new chapter that continues the story from 1985 to 2000, along with anannotated listing of books and recordings which came out during that time.",
  "genres": [
    "Music",
    "History",
    "Nonfiction",
    "Folklore"
  ],
  "author": "Bill C. Malone",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/207119.Country_Music_U_S_A_"
}