{
  "title": "A Warrior's Path",
  "description": "Alternate Cover Edition for ISBN-10: 0991127617 / ISBN-13: 9780991127610Winner 2015 Beverly Hills Book Awards for Fantasy! Bronze Medal for General Fantasy in the 2015 Reader's Favorite Awards! Finalist 2015 International Book Awards for Fantasy! Finalist 2015 Indie Excellence Book Awards for Fantasy! The characters, dialogue and action are mature enough to satisfy readers at the older end of the YA range, and the author weaves them all into an attention-sustaining tale...the milieu is markedly original...first rate world-building. Kirkus Reviews. Sweeping from the majestic city of Ashoka to the perilous Wildness beyond her borders, enter a world where Caste determines mystical Talents, the purity of Jivatma expresses worth, and dharma may be based on a lie. Rukh Shektan has always understood duty. As a member of Caste Kumma, the warrior Caste, nothing else is acceptable. He is expected to take part in the deadly Trials, to journey the Wildness and protect the caravans linking Humanity's far-flung cities. Though the mission is dangerous, Rukh's hope and optimism are undaunted. Karma, however, is a fickle fiend. His caravan is destroyed by the monstrous Chimeras; twisted servants of their fearful goddess, Suwraith. While Rukh survives the attack, events force him along an uncertain path. Morality becomes a morass - especially when he encounters a mysterious warrior, Jessira Grey, a woman whose existence ought to be impossible. The holy texts warn against her kind: ghrinas, children of two Castes, abominations. They are to be executed whenever discovered, but for the first time in his life, Rukh defies duty. Jessira may be the key to his city's survival. Meanwhile, a secret society seeks Ashoka's demise; foul murders cloak a deadlier purpose; and behind it all looms Suwraith. But it is the Baels, the leaders of Her Chimeras, who may hide the greatest deception of all. Book 2, A Warrior's Knowledge, is also available.",
  "genres": [
    "Fantasy",
    "Audiobook",
    "Epic Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Magic",
    "High Fantasy"
  ],
  "author": "Davis Ashura",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/20709602-a-warrior-s-path"
}