{
  "title": "Mystic Forest: Wishes",
  "description": "Gracie McKay is terrified, lost and alone in the desolate, mountainous wilderness. One thing she knows for certain: her demise is imminent.When Gracie, a shy city girl of sixteen, accidentally strays from a group of seasoned hikers, panic overwhelms her. She believes all is lost--that is, until she's rescued by an ancient race of humans. The forest people have remained hidden from civilized society throughout the ages by using their mystical powers. Brought into the primitive yet magical world of these antediluvian people, the teen is befriended by Telacki, a forest girl her age. Telacki ushers her into a secret realm of supernatural creatures and untamed wilderness fraught with danger. But not all of Telacki’s people welcome Gracie. Some want her dead.When the girls are captured by an evil clan, help comes in the form of Zari, a fierce teenager. Hardened by his life with the archaic monsters, Zari is surprisingly sympathetic to Gracie’s plight but he’s in for a shock. Beneath her shy demeanor lies a warrior of epic proportions. An unexpected love blossoms between them as they battle everything from snakebites to deadly tunnel monsters on the daunting journey through strange lands. But will their love endure? Can they merge seemingly incompatible worlds to build a future together? First they must survive.Set against a backdrop of lush evergreen forests and majestic mountains, MYSTIC FOREST: WISHES is a coming of age novel about love, loyalty, and high ideals. Its characters experience every emotion from heartrending sorrow to euphoric joy as they face adventures, mortal danger, and narrow escapes. A serendipitous love story, WISHES embraces the old adage that love truly can conquer all.Available on Amazon: http://www.amazon.com/MYSTIC-FOREST-W...Mystic Forest - Wishes is the first book of the Mystic Forest Saga.Praise for Wishes, Award winning Fantasy Author, Frank Tuttle writes: An inspiring, thought-provoking glimpse into a world and a people that inhabit a space a stone's throw from our own. Entertaining, yes, but also full of heart. Highly recommended! -- Frank Tuttle, author of the Markhat Files",
  "genres": [
    "Fantasy"
  ],
  "author": "Melba S. Ketchum",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/20709601-mystic-forest"
}