{
  "title": "Devotion: An Epic Story of Heroism, Friendship, and Sacrifice",
  "description": "For readers of Unbroken and The Boys in the Boat comes an unforgettable tale of courage from America’s “forgotten war” in Korea, by the New York Times bestselling author of A Higher Call.  \n \n Devotion tells the inspirational story of the U.S. Navy’s most famous aviator duo: Lieutenant Tom Hudner, a white New Englander from the country-club scene, and Ensign Jesse Brown, an African American sharecropper’s son from Mississippi. Tom passed up Harvard to fly fighter planes for his country. Jesse became the navy’s first black carrier pilot to defend a nation that wouldn’t even serve him in a bar.   While much of America remained divided by segregation, Jesse and Tom joined forces as wingmen in Fighter Squadron 32. Adam Makos takes us into the cockpit as these bold young aviators cut their teeth at the world’s most dangerous job—landing on the deck of an aircraft carrier—a line of work that Jesse’s young wife, Daisy, struggles to accept. Then comes the war no one expected, in faraway Korea.   Devotion brings us into the foxholes with U.S. Marines and soaring overhead with Tom and Jesse as they battle a North Korean invasion. As the fury of the fighting escalates, Tom and Jesse fly, guns blazing, to save a Marine division cornered at the Chosin Reservoir and outnumbered ten to one. When one of the duo is shot down behind enemy lines and pinned in his burning plane, the other faces an unthinkable choice: watch his friend die or attempt history’s most audacious one-man rescue mission.   A tug-at-the-heartstrings tale of bravery and selflessness, Devotion asks: How far would you go to save a friend?From the Hardcover edition.",
  "genres": [
    "History",
    "Nonfiction",
    "Military Fiction",
    "War",
    "Biography",
    "Aviation",
    "Military History"
  ],
  "author": "Adam Makos",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/20708942-devotion"
}