{
  "title": "Dublin in the Rain",
  "description": "On a rainy day in Dublin, during the spring of 1947, a tragic accident brought devastation to those involved. As the subsequent years pass, unable to come to terms with the accident, the survivors set the path for a deeply troubled future for each generation that followed.Jonathan Melton had a traumatic childhood in which he ended up in foster care, but when he meets the wild, willful, sexually experienced and free spirited Sophia at university, everything changes. At first inept with women, Jonathan’s complex relationship with Sophia evolves from a one-way obsession into a genuine love and shared passion, as the relationship brings happiness, romance and joy to both their lives that neither thought was ever possible. The two marry, and Sophia gives birth to their first child; a beautiful baby daughter. Everything is seemingly perfect, until the evening that their tiny baby is found dead in her cot. As his world falls apart around him, Jonathan slips into a dark depression and, increasingly haunted by his past, becomes distant and dysfunctional as he struggles to cope with the loss of his daughter. His marriage to Sophia disintegrates, and Jonathan along with it as he descends further into darkness after leaving Sophia. Although his close friend David succeeds to some extent in saving him from his demons, Jonathan remains a lost and lonely soul, until his apparent chance meeting with the enigmatic Maolíosa in a Dublin bar. Maolíosa and Jonathan form a unique bond, and she challenges his vision of life and the world around him. Fate intervenes, but it ultimately leads Jonathan to redemption, and a final resolution to the aftermath and consequences of the 1947 tragedy. Inspired by the timeless film, It’s a Wonderful Life, Dublin in the Rain provides a sweeping narrative of love, desire and misfortune, spanning the thirty years of Jonathan Melton’s life. Andrew Critchley’s witty and complex characters reveal how a painful familial legacy can haunt our present and distort our future. Moving and magical, Dublin in the Rain reminds us that while tragedy can blight our journey, life is still very much what we choose to make it.Dublin in the Rain is the first of a trilogy of contrasting stories around the theme of redemption by Andrew Critchley.",
  "genres": [
    "Fiction",
    "Ireland",
    "Historical Fiction",
    "Mystery",
    "Romance",
    "Historical",
    "Novels"
  ],
  "author": "Andrew Critchley",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/20718230-dublin-in-the-rain"
}