{
  "title": "An Inquiry into the Nature and Causes of the Wealth of States: How Taxes, Energy, and Worker Freedom Change Everything",
  "description": "A passionate, detailed, quantified argument for state-level tax reform\"An Inquiry into the Nature and Causes of the Wealth of States\" explains why eliminating or lowering tax burdens at the state level leads to economic growth and wealth creation. A passionate argument for tax reform, the book shows that even states with small populations can benefit enormously with the right policies. The authors' detailed exposition evaluates the impact state and local government policies have on a state's relative performance and economic growth overall, backed up with economic data and analysis.Facts don't lie. But they do point clearly to the failure of so-called progressive tax schemes designed more to curry favor with selected constituencies than to create an economic system that leads to individual wealth as the reward for hard work and entrepreneurial risk taking. \"An Inquiry into the Nature and Causes of the Wealth of States\" is a detailed and critical look at income taxation across the nation, and drills down into an analysis of the economic growth or malaise that results from tax policy. Arguing eloquently that a state cannot tax itself into prosperity, just as the impoverished cannot spend themselves into wealth, the authors point out what many inherently know but often fear to say out loud. The book provides detailed quantitative analysis, and discusses the policy variables that can have enormous effects on the financial well-being of states and individual residents, such as: Personal and corporate income tax ratesTotal tax burden as a percentage of personal incomeEstate and inheritance taxesRight-to-work laws\"An Inquiry into the Nature and Causes of the Wealth of States\" shows everyone how to evaluate state-level fiscal and economic policies to become more competitive.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Politics",
    "Business"
  ],
  "author": "Arthur B. Laffer",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/20726010-an-inquiry-into-the-nature-and-causes-of-the-wealth-of-states"
}