{
  "title": "Inheriting the Trade: A Northern Family Confronts Its Legacy as the Largest Slave-Trading Dynasty in U.S. History",
  "description": "In 2001, at forty-seven, Thomas DeWolf was astounded to discover that he was related to the most successful slave-trading family in American history, responsible for transporting at least 10,000 Africans to the Americas. His infamous ancestor, U.S. senator James DeWolf of Bristol, Rhode Island, curried favor with President Thomas Jefferson to continue in the trade after it was outlawed. When James DeWolf died in 1837, he was the second-richest man in America.When Katrina Browne, Thomas DeWolf's cousin, learned about their family's history, she resolved to confront it head-on, producing and directing a documentary feature film, Traces of the A Story from the Deep North. The film is an official selection of the 2008 Sundance Film Festival.Inheriting the Trade is Tom DeWolf's powerful and disarmingly honest memoir of the journey in which ten family members retraced the steps of their ancestors and uncovered the hidden history of New England and the other northern states.Their journey through the notorious Triangle Trade-from New England to West Africa to Cuba-proved life-altering, forcing DeWolf to face the horrors of slavery directly for the first time. It also inspired him to contend with the complicated legacy that continues to affect black and white Americans, Africans, and Cubans today.Inheriting the Trade reveals that the North's involvement in slavery was as common as the South's. Not only were black people enslaved in the North for over two hundred years, but the vast majority of all slave trading in America was done by northerners. Remarkably, half of all North American voyages involved in the slave trade originated in Rhode Island, and all the northern states benefited.With searing candor, DeWolf tackles both the internal and external challenges of his journey-writing frankly about feelings of shame, white male privilege, the complicity of churches, America's historic amnesia regarding slavery-and our nation's desperate need for healing. An urgent call for meaningful and honest dialogue, Inheriting the Trade illuminates a path toward a more hopeful future and provides a persuasive argument that the legacy of slavery isn't merely a southern issue but an enduring American one.",
  "genres": [
    "History",
    "Nonfiction",
    "Memoir",
    "American History",
    "Africa",
    "American",
    "Historical"
  ],
  "author": "Thomas Norman DeWolf",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/2071924.Inheriting_the_Trade"
}