{
  "title": "The Wine-Dark Sea",
  "description": "First published in the US in 1988 and in the UK in 1990, The Wine-Dark Sea contains eight unsettling stories that explore protagonists' fears and desires, at once illogical and terrifying, and culminate in a disturbing and enigmatic ending. Aickman's 'strange stories' (his preferred term for them) are a subtle exploration of psychological displacement and paranoia; his characters ordinary people that are gradually drawn into the darker recesses of their own minds. For fans of the horror genre, Robert Aickman is a must read.The Wine-Dark SeaThe TrainsYour Tiny Hand Is FrozenGrowing BoysThe FetchThe Inner RoomNever Visit VeniceInto the WoodRobert Fordyce Aickman was born in 1914 in London. In 1951, he published his first ghost stories in a volume called We Are the Dark, written in conjunction with Elizabeth Jane Howard, then went on to publish eleven further volumes of horror stories, two fantasy novels and two volumes of autobiography. Dubbed ‘the supreme master of the supernatural’, he won a World Fantasy Award and British Fantasy Award for his short fiction, and also edited the first eight volumes of The Fontana Book of Great Ghost Stories. Aside from his writing, Aickman was passionate about preserving British canals and founded the Inland Waterways Association in 1946. He died in February 1981.Reece Shearsmith is a talented actor and writer. He is most famous for co-writing and starring in the award-winning The League of Gentlemen, along with Steve Pemberton, Mark Gatiss and Jeremy Dyson. In 2009, Shearsmith and Pemberton won Best New Comedy at the 2009 British Comedy Awards for Psychoville.Reece Shearsmith has just finished filming Ben Wheatley’s horror A Field in England, out in July 2013.©1988 Robert Aickman (P)2013 Audible Ltd",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Weird Fiction",
    "Fantasy",
    "Gothic",
    "Collections"
  ],
  "author": "Robert Aickman",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/20733496-the-wine-dark-sea"
}