{
  "title": "Curses, Fates & Soul Mates: 5 Paranormal New Adult Novels",
  "description": "5 full-length novels from 5 of the hottest authors in New Adult Paranormal Romance!Escape reality and immerse yourself in these steamy paranormal romances. With everything from tattooed bad boys and sexy demons to hot, otherworldly bodyguards, you're going to fall in love. Beware: you'll be up reading well past your bedtime!ONLY AVAILABLE FOR A LIMITED TIME!Retail value = $14.95Recommended for readers 16+Approximately 1,200 pagesTHE SPACE BETWEEN by Kristie Cook: Self-contained dancer Leni Drago and inked-and-pierced playboy Jeric Winters must discover the truth behind their connection as well as their ties to a journal from 1989 - and they must do it fast, before all evidence that they ever existed disappears. Two love stories, one mystery, and a paranormal twist that readers call \"mind blowing.\"FROSTBITE by Lynn Rush: Love is warm and fuzzy for most people, and it would be for eighteen-year-old Amanda Smith, too, if her kisses didn't cause frostbite.CURSED by R.K. Ryals: Sometimes being bad is better... A vintage-loving witch. A cocky demon. An old grimoire. An ancient curse. A family secret that changes everything.RETURN OF THE ASCENDANT by Raine Thomas: Party plans derail for college student Kyra Vaughn when she's nearly killed...twice. She'll have to rely on a sexy stranger with unusual abilities to keep her alive and help her discover who she's destined to be.REPOSSESSION by Rachael Wade: The Invaders have come for Earth, and Skylla Warden's in the very center of the upheaval. On a mission to take back what is rightfully theirs, Earth's population is determined to make sure this isn't the end. But some endings were never theirs to begin with.",
  "genres": [
    "Paranormal",
    "New Adult",
    "Anthologies",
    "Paranormal Romance"
  ],
  "author": "Kristie Cook",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/20734442-curses-fates-soul-mates"
}