{
  "title": "The Story of a Heart: Two Families, One Heart, and the Medical Miracle That Saved a Child’s Life",
  "description": "A riveting and inspiring true story of two families linked by one heart—written by a bestselling author and palliative care doctor. \nThe first of our organs to form and the last to die, the heart is both a simple pump and the symbol of what makes us human; as long as it continues to beat, there is hope. In The Story of a Heart, Dr. Rachel Clarke interweaves the history of medical innovations behind transplant surgery with the story of two children—one of whom desperately needs a new heart. One summer day, nine-year-old Keira Ball was in a terrible car accident and suffered catastrophic brain injuries. As the rest of her body began to shut down, her heart continued to beat. In an act of extraordinary generosity, Keira’s parents and siblings immediately agreed that she would have wanted to be an organ donor. Meanwhile nine-year-old Max Johnson had been in a hospital for nearly a year, valiantly fighting the virus that was causing his young heart to fail. When Max’s parents received the call they had been hoping for, they knew it came at a terrible cost to another family—in what Clarke calls “the brutal arithmetic of transplant surgery.” The act of Keira’s heart resuming its rhythm inside Max’s body was a medical miracle. But this was only part of the story. While waiting on the transplant list, Max had become the hopeful face of a campaign to change the UK’s laws around organ donation. Following his successful surgery, Keira’s mother saw the little boy beaming on the front page of the newspaper and knew it was the same boy whose parents had recently sent her an anonymous letter overflowing with gratitude for her daughter’s heart. The two mothers began to exchange messages and eventually decided to meet. This is the unforgettable story of how one family’s grief transformed into a lifesaving gift. Clarke relates the urgent journey of Keira’s heart and explores the history of the remarkable surgery that made it possible, stretching back over a century and involving the knowledge and dedication not just of surgeons but of countless nurses and technicians, immunologists and paramedics. The Story of a Heart is a testament to compassion for the dying, the many ways we honor our loved ones, and the tenacity of love.",
  "genres": [
    "Nonfiction",
    "Science",
    "Medical",
    "Medicine",
    "Health",
    "Memoir",
    "Audiobook"
  ],
  "author": "Rachel Clarke",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/207293869-the-story-of-a-heart"
}