{
  "title": "The Ogeechee: A River and Its People",
  "description": "Exploring the swampy woods of Georgia's Chatham County some years ago, searching out places to photograph, Jack Leigh turned his car onto an obscure dirt road winding farther into the forest. Finally driving into a clearing on the banks of the Ogeechee, Leigh found himself at Uncle Shed's Fishing Camp, and at the beginning of what would be a two-year discovery of the river and its people, a chronicle in images and words stretching from the Ogeechee's headwaters in Greene County to marsh flats near the Atlantic Ocean. In his photographs and text, Leigh introduces such river natives as George Altman, standing knee-deep in water and reeling out fishing stories as he flicks his line into a shaded area beneath a fallen tree; and Jack Mikell, Sr., whose life on the river is told in the array of frying pans that hang on the wall behind him and in his recollections of long nights tending moonshine stills in backwater swamps. Leigh tells of the many stories the river holds---of the Muck Runners, Louisville men who each winter slog through swamps and deadfalls two hundred miles to Savannah; of Frank Cox, whose journey down river, taken in numerous pieces with as many reluctant partners, fulfilled a childhood dream; and of a woman's baptism in Warren County, at which beads of anointing oil mingled with the cold water of the rushing river. At Uncle Shed's Fishing Camp, as tales of fish fries and courtship conjure up more than fifty years on the Ogeechee, the camera ranges across the clearing, capturing the pattern of river life in the faded letters of a hand-painted sign; in the weathered face of camp matriarch Bessie Dickerson; and in the scattered flowerpots, lawn chairs, ceramic swans, and gravestone that lie cluttered against a cabin wall. Recording the wild ramblings and lazy progress of the Ogeechee, the quiet rituals and raucous stories of its people, Jack Leigh chronicles the course of lives that run with the current of the river.",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "Jack Leigh",
  "average_rating": "4.79",
  "url": "https://www.goodreads.com/book/show/1118035.The_Ogeechee"
}