{
  "title": "Sky Full of Elephants",
  "description": "In this exquisite speculative novel set in a world where white people no longer exist, college professor Charlie Brunton receives a call from his estranged daughter Sidney, setting off a chain of events as they journey across a truly “post-racial” America in search of answers.One day, a cataclysmic event occurs: all of the white people in America walk into the nearest body of water. A year later, Charles Brunton is a Black man living in an entirely new world. Having served time in prison for a wrongful conviction, he’s now a professor of electric and solar power systems at Howard University when he receives a call from someone he wasn’t even sure existed: his daughter Sidney, a nineteen-year-old who watched her white mother and step-family drown themselves in the lake behind their house.Traumatized by the event, and terrified of the outside world, Sidney has spent a year in isolation in Wisconsin. Desperate for help, she turns to the father she never met, a man she has always resented. Sidney and Charlie meet for the first time as they embark on a journey across America headed for Alabama, where Sidney believes she may still have some family left. But neither Sidney or Charlie is prepared for this new world and how they see themselves in it.When they enter the Kingdom of Alabama, everything Charlie and Sidney thought they knew about themselves, and the world, will be turned upside down. Brimming with heart and humor, Cebo Campbell’s astonishing debut novel is about the power of community and connection, about healing and self-actualization, and a reckoning with what it means to be Black in America, in both their world and ours.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Fantasy",
    "Dystopia",
    "Speculative Fiction",
    "Audiobook",
    "Literary Fiction"
  ],
  "author": "Cebo Campbell",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/207293815-sky-full-of-elephants"
}