{
  "title": "The Lone Alpha Unleashed: A Big Girl Meets Bad Wolf Romance",
  "description": "Do you really think you’re the first? That a human hasn’t fallen in love with a shifter before? You might think you love him with all your heart, but you can only ever know half of him and you can’t love what you don’t know.After a string of bad luck, Carrie thinks she’s finally found her perfect man. James is a hunky shifter, an alpha wolf. They have a connection, the sex is amazing and he can’t get enough of her ample curves. But within days of these two lonely souls finding each other, she begins to have doubts. They come from different worlds, how could it ever last? Scared of inevitable heartbreak, she decides it can never be more than a fling and she needs to end it before it becomes anything more.However, when a threat from James’ past puts Carrie in danger, James responds the only way he knows how. Carrie will witness just what lengths her fated mate will go to, to save the woman he loves... And discover that their worlds may not be so different after all.The Lone Alpha Unleashed is a 22000 word novella and a sequel to the bestselling Curves for the Lone Alpha. While it tells a complete story (with a sweet HEA ending that will have you reaching for the tissues), some mysteries remain as it is part of a bigger ongoing story. It is intended for mature audiences, contains explicit language, several scenes of a sexual nature and some moderate violence.Excerpt“Oh…”“Oh?”“How do you do this?”“This?”I giggled at his confusion. I’m not normally a giggler, but I couldn’t help it. “This… how do you do this to my body? You always know exactly what to do. You always know exactly how tooooo….”His hands returned to my chest as he shifted position. The blanket fell away, exposing me to the elements.“I listen…”I chewed my lip and squirmed beneath him. I was beginning to think he was showing off. Every touch, every single touch, made my body sing. “I listen to every little breath and every silent sigh. I hear the beating of your heart and the pulse of the blood in your veins. I notice every time your eyelids flicker, every time your lip trembles. And I taste…”Oh God, his fingers were replaced with warm lips and the prickle of his stubble as he began to repeat his explorations of my chest with lips, teeth and tongue.“Oh… Oh…. is this…. is this a shifter thing?”“Hmph,” he made a noncommittal grunt in the back of his throat before replying, “it’s a shifter thing. It’s an alpha thing. It’s a pride thing.”I got it. He wanted to be the best. He had to be the best. I relaxed and let him be the best. His mouth made his way from my chest, leaving a trail of nibbling kisses down my torso and across my thighs. When he reached his destination I arched my back, rising to meet him as I locked my legs around his neck, my lower body supported by the knotted muscles of his wide shoulders. It wasn’t long before I gave him a lot more to listen to.I had to admit that while I still wasn’t sold on the idea of sleeping under the stars, this was a pretty good way to wake up.",
  "genres": [
    "Paranormal Romance",
    "Shapeshifters",
    "Romance",
    "Paranormal",
    "Short Stories"
  ],
  "author": "Molly Prince",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/20741901-the-lone-alpha-unleashed"
}