{
  "title": "Secrets of Ancient America: Archaeoastronomy and the Legacy of the Phoenicians, Celts, and Other Forgotten Explorers",
  "description": "The real history of the New World and the visitors, from both East and West, who traveled to the Americas long before 1492• Provides more than 300 photographs and drawings, including Celtic runes in New England, Gaelic inscriptions in Colorado, and Asian symbols in the West• Reinterprets many archaeological finds, such as the Ohio Serpent Mound• Reveals Celtic, Hebrew, Roman, early Christian, Templar, Egyptian, Chinese, and Japanese influences in North American artifacts and ruinsAs the myth of Columbus “discovering” America falls from the pedestal of established history, we are given the opportunity to discover the real story of the New World and the visitors, from both East and West, who traveled there long before 1492.Sharing his more than 25 years of research and travel to sites throughout North America, Carl Lehrburger employs epigraphy, archaeology, and archaeoastronomy to reveal extensive evidence for pre-Columbian explorers in ancient America. He provides more than 300 photographs and drawings of sites, relics, and rock art, including Celtic and Norse runes in New England, Phoenician and Hebrew inscriptions in the Midwest, and ancient Shiva linga and Egyptian hieroglyphs in the West. He uncovers the real story of Columbus and his motives for coming to the Americas. He reinterprets many well-known archaeological and astronomical finds, such as the Ohio Serpent Mound, America’s Stonehenge in New Hampshire, and the Crespi Collection in Ecuador. He reveals Celtic, Hebrew, Roman, early Christian, Templar, Egyptian, Chinese, and Japanese influences in famous stones and ruins, reconstructing the record of what really happened on the American continents prior to Columbus. He also looks at Hindu influences in Mesoamerica and sacred sexuality encoded in archaeological sites.Expanding upon the work of well-known diffusionists such as Barry Fell and Gunnar Thompson, the author documents the travels and settlements of trans-Atlantic and trans-Pacific explorers, miners, and settlers who made it to the Americas and left their marks for us to discover. Interpreting their sacred symbols, he shows how their teachings, prayers, and cosmologies reveal the cosmic order and sacred landscape of the Americas.",
  "genres": [
    "History",
    "Science",
    "Nonfiction",
    "Ancient History"
  ],
  "author": "Carl Lehrburger",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/20736617-secrets-of-ancient-america"
}