{
  "title": "Runway RunAway A Backstage Pass to Fashion, Romance & Rock 'N Roll",
  "description": "From the streets of Los Angeles, as a teenage runaway waitressing at The House of Pies, to the catwalks of Paris, France working as a model/muse to Chanel, YSL, and Christian LaCroix, Lorelei Shellist has led a life full of gritty and glamorous extremes.This is her story, a 300 page memoir that at the surface may seem all glitz and glam, but whose beauty runs deep-- an every woman's quest for strength, hope, happiness, understanding and inner-peace.Rebellious, headstrong, independent and on her own at 15 - Lorelei dreamed of being a model. She made that happen through determination and serendipity; a chance meeting with a '70s Southern California Rock Star opened the A-list Hollywood doors to a wondrous world, as well as a full-blown romance.Pounding the pavement in L.A. and New York taught her the hard knocks ofbeing a working class model. Fortitude and sheer will jetted her off to Europe,and where she met the doomed love her life; fiancé Steve Clark of Def Leppard.Theirs was a relationship mired in dizzying highs and bottomless lows, as shewatched Steve drink and drug himself to death, and caught herself in the wakeof his spiraling cycle of addiction and depression, unable to help.Ultimately fleeing and finding the strength to save herself, Lorelei shares hercandid and blatant truth of how she survived the greatest loss in her life, theaftermath and the determination to not only survive, but to heal her-self, andhelp to heal others.Runway Runaway is highlighted by never-before-seen photos of the music and fashion industries, hand written journal entries, agenda pages, and backstage passes illustrating the story of neglected child turned teenage runaway who follows her dreams to become an international model, eventually finding herself in the process.",
  "genres": [
    "Nonfiction",
    "Music",
    "Rock N Roll",
    "Autobiography"
  ],
  "author": "Lorelei Shellist",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/20741741-runway-runaway-a-backstage-pass-to-fashion-romance-rock-n-roll"
}