{
  "title": "Werewolf Love Story Box Set",
  "description": "Three novels in H.T. Night's #1 bestselling Werewolf Love Story series, WEREWOLF LOVE PART ONEFive Years before Vampire Love Story. It is 2006, and Tommy is training hard before his second mixed martial arts match. On a random night he runs across a sexy, mysterious woman named Sasha. Sasha turns Tommy's life upside down and out of control. On a chance encounter, Tommy befriends a vampire named Patrick. Both Patrick and Sasha change everything Tommy has ever known to be true.WEREWOLF LOVE PART TWOTommy meets Maya, the woman of his dreams, and is able to make sense of his new reality. A young Josiah Reign befriends Tommy along the way, and Tommy has to inevitably face his true destiny of becoming a werewolf. Will Tommy choose his destiny, or become something no one had ever thought possible?THE RISE OF KYROTommy is back. Now, he just needs to figure out what it means to be a werewolf while keeping it a secret from young Josiah, his enthusiastic fight prodigy with a superhero complex.**Acclaim for the novels of H.T. Night**\"H.T. Night is a riveting storyteller, capturing the essence of the vampire genre.\"—April M. Reign, author of I.O.U. and Dividing Destiny\"The Werewolf Whisperer is a wonderful story that incorporates friendship and love with a lot of great vampire action.\"—Summer Lee, author of Angel Heart\"A hip and timely vampire novel filled with real characters and some of the coolest vampires since The Lost Boys! You're going to love Night's completely original take on the supernatural.\"—J.R. Rain, author of Moon Dance and The Body Departed\"Bad Blood is fast, hilarious and sexy. Rain, Nicholson and Night just might have created the coolest vampire since Kiefer Sutherland. The Mount Shasta setting is dreamy. The cult is deliciously creepy. And Spider is as sexy as they come. I was pressing the ereader's 'forward' button so fast that I broke it. Let's hope we hear more from Spider.\"—H.P. Mallory, bestselling author of Fire Burn and Cauldron Bubble and To Kill A Warlock",
  "genres": [
    "Fantasy"
  ],
  "author": "H.T. Night",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/11181078-werewolf-love-story-box-set"
}