{
  "title": "The Fun We've Had",
  "description": "Two lovers are adrift in a coffin on an endless sea. Who are they? They are him and her. They are you and me. They are rowing to salvage what remains of themselves. They are rowing to remember the fun we’ve had.\"Michael Seidlinger is a homegrown Calvino, a humanist, and wise and darkly whimsical. His invisible cities are the spires of the sea where we all sail our coffins in search of our stories.\"--Steve Erickson, author of Zeroville“Melding the static, high-concept premise of two humans floating alone on a coffin in a sea devoid of all else with stark and meditative prose, The Fun We've Had evokes a highly unexpected experience, somewhere between Beckett's most hopeless solipsists and the mysterious energy of a child's Choose Your Own Adventure-era dream.”--Blake Butler, author of There Is No Year and Three Hundred Million“It is obvious that Michael J Seidlinger had a great deal of fun writing The Fun We've Had. What more could a reader ask for?”--Michael Kimball, author of Big Ray“The best poets are writing poetry no matter what they are writing, creating entirely new and weird spaces. There is no doubt Seidlinger has made one of the weirdest spaces we will ever inhabit. In The Fun We’ve Had, every visible thing is a love of disturbing tremors, keeping ahead of our ever-curious eyes, hoping to savor every line. What a magnificent book.”--CAConrad, author of The Book of Frank\"Seidlinger’s imagination is a sea unto itself, the reader riding these rollicking waves. This book will have you clutching pages as though they’re life vests. Fans of Calvino and Shelley Jackson will dig the slow submerge into this crazy romp.\"--Joshua Mohr, author of Damascus\"Michael J Seidlinger writes with the kind of weird, wonderful, joyful abandon that reminds the reader that world is still the great unknown. In The Fun We’ve Had, he examines the long blank space between life and death, fills it with love and loss and boats made of coffins, with people clinging to life and using the weight of the past as ballast. This is a fun read, true; but it's also a true read, and that's what makes it so beautifully sad.\"--Amber Sparks, author of The Desert Places and May We Shed These Human Bodies“Ready for an analogy? Here goes: When you need to give a dog a pill, you don’t just jam it down his throat, you wrap that pill in something yummy, like, say, ham. Michael J Seidlinger understands that this principle extends to people and books. So he’s got this pill he wants you to swallow, right? That pill is the truth about love and death and strife and, more generally, the messy mysterious business of being human, and also of being nothingness. Pretty heavy, right? Big old horse pill. But then Seidlinger, no fool, wraps it in the yummy slow-smoked maple goodness of his humor. He obviously had a fine time writing this book, which is precisely the reason you’ll have a fine time reading it.”–Ron Currie Jr., author of Flimsy Little Plastic Miracles",
  "genres": [
    "Fiction",
    "Fantasy",
    "Bizarro Fiction",
    "Novels"
  ],
  "author": "Michael J. Seidlinger",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/20740932-the-fun-we-ve-had"
}