{
  "title": "Remember the Moon",
  "description": "\"Watching myself die, I felt no pain, no emotion, no fear.\" So begins this remarkable novel by Abigail Carter, whose critically acclaimed The Alchemy of A Young Widow's Transformation was called \"Eloquent and honest\" by the Toronto Globe and Mail. Fans of The Lovely Bones and The Alchemist will appreciate Remember The Moon as a beautifully written, inspiring story of everlasting love that reaches far beyond the grave. Clinging to life from the edge of a cliff, Jay, a beleaguered software company executive sees the possibility of rescue in the eyes of the firefighter dangling nearby, but the car lurches and Jay plunges toward his watery grave. He floats above his lifeless body and hears a familiar voice. \"Welcome home J.J.\" Reunited briefly with his father, who died when Jay, a hapless 14-year-old was unable to save him after a canoe accident, Jay is introduced to his afterlife therapist Alice, who will help ease him into a life of being dead. Death isn't all it's cracked up to be. Jay visits his grieving wife Maya and watches helplessly as his seven-year-old son Calder seems bent on joining his dad through reckless skateboarding accidents. Jay longs to ease their pain and tell them how much he loves them. When Maya hires Liz, a lesbian psychic, Jay's excited to finally give his wife his message of love. Instead, he learns her terrible secret and in anger and jealousy, leads her toward an ill-fated romance with a narcissistic, sexually deviant player she believes is \"heaven sent\" from Jay himself. Maya's grief becomes more complicated in the aftermath of another loss, and Calder's alarming behavior prompts Jay to find a way to set them both free or risk the well-being of them all. Confronted with the decision to either follow his mortal instincts or help his wife find new love, Jay must learn to transcend everything he ever was.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Paranormal",
    "Fantasy",
    "Romance"
  ],
  "author": "Abigail Carter",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/20743833-remember-the-moon"
}