{
  "title": "To Think Like God: Pythagoras and Parmenides, The Origins of Philosophy",
  "description": "TO THINK LIKE GOD focuses on the emergence of philosophy as a speculative science, tracing its origins to the Greek colonies of Southern Italy, from the late 6th century to mid-5th century B.C.E. Special attention is paid to the sage Pythagoras and his movement, the poet Xenophanes of Colophon, and the lawmaker Parmenides of Elea. In their own ways, each thinker held that true insight, whether as wisdom or certainty, belonged not to mortal human beings but to the gods.The Pythagoreans sought to approach this otherworldly knowledge by studying numerical relationships, believing them to govern the universe, and that those who know the number of a thing know its true nature. Yet their quest was a hopeless one, bogged down by cultism, numerology, political conspiracies, bloody uprisings, and exile. Above all, number did not turn out as the most reliable of mediums; it was certainly not a key to the realm of the divine. Thus, their contributions to philosophy's inception, while much better publicized, were not the most significant. That particular role was reserved for an unusual challenge and the elaborate reaction it provoked.The challenge came from Xenophanes, who had argued that reliable truth was beyond mortal reach, because even if by accident a human being should state what is exactly the case, he had no way of knowing that he did, all things being susceptible to opinion. This dilemma is sure to have bothered a legislative mind like that of Parmenides, and we find him introducing techniques for testing the veracity of statements. These methods were meant to be carried out by reasoning and argument alone, without relying on physical evidence or mortal sense-perception, which was deemed untrustworthy. Reason was that one faculty shared by gods and humans alike.In time, Parmenides' ingenious arguments have earned him the title of the first logician and metaphysician whose influence on subsequent thinkers was immeasurable. Parmenides taught us that philosophy was not about claims but about proof, which also makes him the father of theoretical science—which, curiously, began as a quest into the mind of God.",
  "genres": [],
  "author": "Arnold Hermann",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/20742556-to-think-like-god"
}