{
  "title": "Fun With My Sleeping Wife",
  "description": "My wife is everything to me, and she has given me everything a man could possibly want. Everything except the one thing that I want the a baby. When her new sleeping pills prove to be more effective than we thought they would, will I be able to stop myself from taking advantage of her? And if I do use her body, what if I cum deep inside her sleeping body? Will she become pregnant, whether she likes it or not?This 3600 word story includes a loving husband and wife who just need a little bundle of joy to bring them closer together. It includes sleep sex, cunnilingus on a shaved pussy, and is capped off by an impregnating creampie!Okay. I could play along. \"Oooh, look how sexy my sleeping wife is over there. I'm going to do naughty things to her while she sleeps.\"No reaction.I put the ring of the condom against my dick, unrolling it. \"Yep. Gonna get to do whatever I want to her, now that she's asleep.\"Nothing.I went back to the bed, dragging her body to the edge of the bed. She was convincing alright, her dead weight having no reaction to my pull. I rubbed my condom-wrapped cock against her panties, trying to excite her.I finally got a response. She began to snore softly.Unbelievable, I thought to myself. Did she really just fall asleep?I decided to test it. I reached up and grabbed one of her boobs, squeezing lightly. Nothing. I massaged it, a little harder than I should, and still got no response.There's only one way to be completely sure. I grabbed her panties at the top and pulled them down her legs, and she didn't resist at all. In fact, I had to struggle to get them off, something she never let me do because she didn't want me to stretch out the waistband.I sighed. Might as well drag her back up into the bed and put a blanket on her. I was sure we'd have a good laugh about it in the morning. I pulled the condom off, throwing it in the trash. At least I don't have to wear one of those when I'm having sex with myself, I thought.I was about to pull her back up on the bed when I looked at her bare pussy. A sheen of moisture was all over it, even dripping a little bit out of her opening and onto the bed. She never gets that horny, I thought.I weighed my options. She had wanted it so bad, and so did I. Plus, I had wanted to have sex with my wife without a condom for so long now...",
  "genres": [],
  "author": "Cassandra Zara",
  "average_rating": "1.67",
  "url": "https://www.goodreads.com/book/show/20745658-fun-with-my-sleeping-wife"
}