{
  "title": "Bronze Magic",
  "description": "Bronze Magic, a fantasy novel of 484 pages, is the first in a series that track the woodfolk legend of Tarkyn, Guardian of the Forest. It is written in an easy flowing style that makes it accessible to both teenagers and adults. The major protagonist, although powerful, spends much of his time trying not to intimidate people, while memorable characters battle with issues of trust, cultural differences and respect against a background of magic and action:In Eskuzor, land of sorcerers, Prince Tarkyn, tempestuous and strong in magic, is forced to flee from his brother the king, leaving a trail of death and destruction behind him.After days on the run, he wanders into the woodlands in the company of an old wizard, only to find himself unable to leave. Even worse, Tarkyn is horrified to discover that he is the unwelcome, bitterly resented liege lord of an elusive people whose oath to him has been spellbound to the welfare of their forest. The prince, moved by his unwilling liegefolk’s plight, modifies his expectations. On the other hand, one woodman, Waterstone, puts aside his own prejudices to offer Tarkyn his friendship, persevering in the face of the prince’s mistrust.Bounty hunters are tracking Tarkyn. Wolves and sorcerers are hunting the woodfolk.Battling the woodfolk’s resentment, Tarkyn holds true to his duty as their liege lord to fight with them against wizard-driven storm, captivity and exposure of their existence to the world beyond the forest. As Tarkyn works side by side with his liegefolk, he not only develops friendships and acceptance but also gains new powers which transform him, in the eyes of the woodfolk, into a figure of their legends, the guardian of the forest.Despite this, their mutual trust is fragile and when Tarkyn discovers that his liegefolk have been concealing the existence of woodfolk not sworn to him, he is driven to extreme lengths to repair the schism in woodfolk society that his presence has caused, so that they can stand united against the greatest threat in their history.",
  "genres": [
    "Fantasy",
    "High Fantasy",
    "Fiction"
  ],
  "author": "Jenny Ealey",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/20744847-bronze-magic"
}