{
  "title": "69 Shades of Green",
  "description": "American professional golfer Dan Green rolls into Heaven, BC in his beat up Corolla. He’s got sandwiches on the front seat, clothes on the back seat, and clubs in the trunk ready to test his re-built golf swing at the Husky Open. Sparks fly when he meets Melissa – a woman of extraordinary beauty, irresistible charm, seductive prowess, and more than her fair share of skeletons. American Dan Green begins his journey on the west coast of Canada in the surf town – yes, surf town – of Tofino, home to a golf guru who holds the answers to Dan’s ailing golf swing. His one month stay in Tofino renews faith in his game, and holds a cathartic quality as he sheds the darkness of a marriage gone bad that had refused to let go. With a cocky swing and a clear head Dan heads east, toward the tiny interior town of Heaven, BC, site of the inaugural Husky Open on the Canadian Tour. Without a position in the field Dan must “Monday-Qualify” in hopes of earning his way into the tournament and a shot at moving up the ranks of championship golf. Already armed with a passion for golf, Dan rekindles a deeper passion he thought he’d lost when he is introduced to his new caddy, Melissa Jones. Intelligent, upbeat, and a physical beauty, Melissa sweeps Dan off his feet and into her home for the week when she learns he has nowhere to stay, and has resorted to sleeping in his car. Behind closed doors the two develop an exciting relationship not generally known between golfer and caddy, and it appears to do no harm to Dan’s golf game or spirit. At least, not at first. But there are some skeletons in Melissa’s closet that come out to threaten more than Dan’s chances at winning a golf tournament. A mix of humor, erotica, and drama 69 Shades of Green will take you on a thrilling ride that will change the way you look at golf pants from here on in.",
  "genres": [],
  "author": "John Westley",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/20743792-69-shades-of-green"
}