{
  "title": "This Crumbling Pageant",
  "description": "Get ready to be swept away into a dark fantasy series that combines swashbuckling adventure, heart-pounding romance and plot-twisting suspense in equal measures.Expect to hear more about Persephone Fury.A lot more.England, 1811. As fashionable Society streams toward London for the start of a new social season, they are unaware of a hidden magical England existing alongside. The Magi cathedrals are temples to the old gods. Reigning on their throne is not poor mad George, but the ailing King Pellinore of the House of Pendragon. But their wars are no less deadly.The Furys are known for their extraordinary music, their powerful magic, and their historic role as kingmakers. But the Furys have their secrets as well, none so dangerous as the daughter whose Shadow magic spills from her, unchecked. Unless her powers are concealed, she’s not only ruined in Society, but marked as a target for those who would use and abuse her magic.Persephone Fury is the Dark daughter, the one they hide. But desperate times call for desperate measures, and a good marriage for this frightening daughter is desperately needed. On the night of her debut, her world comes crumbling down around her when she is abducted from the man she loves by the man she most loathes.Evil powers circle, calling her to the destiny foretold at the moment of her birth, drawing her to the source of her power, to the one place she can finally be free. By embracing the Shadows.  Persephone is ruthless, devious, and clever, but when confronted with the truth, she must make horrifying choices.Can she defy destiny and seize her own fate?So when the last and dreadful hourThis crumbling pageant shall devour,The trumpet shall be heard on high,The dead shall live, the living die,And music shall untune the sky.John Dryden, 1687**NOTE: Content for Upper YA**",
  "genres": [
    "Fantasy",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Mystery",
    "Regency",
    "Young Adult"
  ],
  "author": "Patricia Burroughs",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/20747265-this-crumbling-pageant"
}