{
  "title": "The Color of the Wild",
  "description": "An original, inspiring work of literary non-fiction; an unconventional memoir of woman and land. The Color of the Wild is the beautifully told story of one woman’s life, love, family, resolve and determination. More than a memoir, with stunning stories interspersed and intertwined with powerful poetry, prose, and stunning photographs, Gin’s captivating tone and intimate view bring to life the drama and trauma of one year on her family’s ranch, scenic and secluded, surrounded by and a part of the wild world around them. Set high in Colorado’s San Juan Mountains, along the Headwaters of the Rio Grande, Gin opens her world to the reader with stunning honesty, and compassionate grace, sharing this captivating, personal tale of home, belonging, commitment to land and family. Their life is living testament to the power and clarity of love, life and the natural world. Along the Continental Divide, high in the San Juan Mountains where the Rio Grande is born, lies a wilderness as proud and strong-willed as the woman who chose to build a life there. Here unfolds the story of this woman, her son, horses, and a mountain—and the man who rides with them into a life where no one has lived before. In this country where winters are harsh, wild, and remote, author Gin Getz learns to bend and grow within the trust of shared isolation. Parallel with the story of living on the mountain is a darker tale of heartbreak that threatens to tear apart their attachment to the wilderness. Gin lives under a dark cloud as her husband’s family disintegrates over issues of pride and ownership; a story rarely told but so common throughout the West. Along the way, Gin’s readers enter a world of deep beauty, fresh perceptions, simple humor and breathtaking writing as The Color of the Wild unfolds, season by season, through one year on the mountain.",
  "genres": [
    "Nature"
  ],
  "author": "Gin Getz",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/20744817-the-color-of-the-wild"
}