{
  "title": "Crushing Beauty: Harbingers of Sorrow MC",
  "description": "One bad boy biker. One determined good girl. And a love that could destroy them both…again. \nThey’ve been friends since they were small. They had two blissful years in high school. Both of them knew they’d be together forever—until one night changed everything. They were in his car. They crashed. He left her there alone, broken, bleeding on the rain-soaked pavement and never contacted her again. Now, Britton Ramirez is all grown up and working undercover for the FBI. Her task is to land the notorious leader of the outlaw motorcycle club, the Harbingers of Sorrow. His name is Jagger Stromm—and eight years ago, he left her for dead at the side of the road, in the wreckage of his car. But she still can’t help what he makes her feel. After all these years, she’s never been able to let him go. Jagger doesn’t feel anything these days. His dark past has forced him to make terrible choices, and the worst was having to leave her alone on that fateful night. But he’s always watched over her and her family from a distance. And even though he’s had to bury his emotions to survive in his brutal world, he’s never stopped loving her. When she shows up as a dealer at the Vegas casino he frequents, Jagger can hardly believe it. He has a second chance to prove how much she means to him. It’s always been her—and he’s shocked to find she still wants him, at least in bed. Over and over again, in lust and anger and ecstasy. But she’s hiding something, and trust doesn’t come easy for someone in his position. Anyone could bring him down…even Britton. She’s determined to make the climb to success and leave her broken past behind. He’s in too deep to escape the world of crime, where his gang has become his family. They can’t stay together…but now that they’ve found each other again, they can’t bear to part. \nHe’s a criminal. She’s the law. And short of a miracle, there’s no hope for them.\nThis contemporary biker romance contains graphic sexual content, violence, and strong language. It is intended for mature readers. Crushing Beauty is a complete standalone novel in the Vegas Titans Biker romance series. No cliffhanger.",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "Abuse",
    "Motorcycle",
    "Adult",
    "Contemporary",
    "Second Chance"
  ],
  "author": "Celia Loren",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/20745142-crushing-beauty"
}