{
  "title": "The Blemished Complete Series: Boxed Set",
  "description": "The full boxed set of the Blemished series, including the Fractured novellas!Book 1: The BlemishedA beautiful world comes at a price...The Blemished is a frightening take on a fractured future where the Genetic Enhancement Ministry have taken control of Britain. It will take you on a ride filled with adventure, romance and rebellion.Book 2: The Vanished\"You're part of the vanished now. That's what we all are. The people who have been forgotten.\"Mina Hart fought her way out of Area 14. She made it to The Clans so that she can live a normal life with her friends and her father. But what she finds is no safe haven.Novella 1: The Fractured: ElenaIn a fractured Britain, the Genetic Enhancement Ministry have taken control. Parents buy designer babies and those with genetic faults are labelled Blemished and shunned from society.The Fractured is the first part of a spin off series based on The Blemished, which will focus on some of the secondary characters and their stories. Part one follows the life of Elena as she experiences a life changing event.Novella 2: The Fractured: MaggieMargaret Murgatroyd failed in her mission to capture three Blemished escapees. She fears the Ministry will demote her to full-time teacher and remove her Ministry rights. But Margaret is surprised as she's given a new opportunity with new responsibilities, the only problem is old memories resurfacing after many years. Margaret remembers herself as a young girl, Maggie Powell, and the mistakes she made as a young lab technician working at the Genetic Enhancement Ministry as it first embarked on its take-over of Britain. She remembers the mistakes she made, the people who betrayed her and the way it shaped her as a woman.Book 3: The Unleashed\"I wanted to live. I wanted us to have a future, and there was nothing else on my mind. With Daniel by my side I ran so fast my lungs ached.\"Mina's world is turned upside down as an important person from her past materialises to take her away from the Compound. She finds herself separated from her friends and facing life-changing decisions on her own.Fans of the popular YA dystopia series 'Blemished' will not be disappointed by this thrilling conclusion. It will keep you guessing right up to the very last page.",
  "genres": [
    "Dystopia",
    "Science Fiction",
    "Young Adult"
  ],
  "author": "Sarah Dalton",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/20746826-the-blemished-complete-series"
}