{
  "title": "De macht van een maîtresse: Hoe passie en politiek de laatste prins fataal werden",
  "description": "Hoe passie en politiek de laatste prins van Condé fataal werdenWas het moord? Of zelfmoord?Op 27 augustus 1830 werd Louis Henri Joseph, hertog van Bourbon en de laatste prins van Condé, dood in zijn slaapkamer aangetroffen. Opgehangen aan de spanjolet van een raam. Daarmee begon een raadsel dat tot op de dag van vandaag onopgelost is gebleven. Hoewel zijn maîtresse de barones van Feuchères altijd categorisch heeft ontkend iets met de dood van haar minnaar van doen te hebben gehad, werd ze al spoedig van actieve betrokkenheid beschuldigd. Twee jaar lang was ze het middelpunt van strafrechtelijk onderzoek en civiele processen. Maar veroordeeld werd ze nooit.Toch is ze als femme criminelle de geschiedenis ingegaan.Maar is zij werkelijk het minnares-monster geweest waarvoor zovelen haar hielden en tot op de dag van vandaag meestal nog houden? Wie was de barones van Feuchères eigenlijk, die geboren werd als Sophie Dawes, en in bittere armoede opgroeide in een gezin in Engeland, op het eiland Wight? Die het schopte tot barones in een vreemd land en daar jarenlang intensieve contacten onderhield met de belangrijkste en machtigste mannen en vrouwen van haar tijd. Die mede-erfgenaam werd van een van de grootste vermogens die Frankrijk in die tijd kende. En vooral: waarom is het werkelijke, het gehele verhaal van de gebeurtenissen voorafgaande aan en tijdens die noodlottige augustusmaand van 1830 nooit verteld?De macht van een maîtresse beschrijft de jarenlange zoektocht van René Diekstra naar het geheim van de dood van de laatste prins van Condé. Een onderzoek dat hem door een groot deel van Europa voerde en waarin hij uiteindelijk op de zeer opmerkelijke en pikante hoofdrol van de maîtresse van de prins, dochter van een eenvoudigde visser uit Engeland, en de koning van Frankrijk, Louis Philippe, stuitte. Onderling hebben ze, als opbrengst van de dood van de prins, een van de grootste fortuinen van de Franse adel ooit, verdeeld.Met de ontdekking van tal van eerder onbekende of onbeschreven feiten herschrijft René Diekstra op indringende en psychologisch buitengewoon heldere wijze een belangrijk deel van de Franse en daarmee van onze eigen Europese geschiedenis.De macht van een maîtresse is een opzienbarend boek dat zich bevindt tussen psychologische analyse en historische wetenschap.",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "René F.W. Diekstra",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/11181961-de-macht-van-een-ma-tresse"
}