{
  "title": "Hot & Adorable",
  "description": "Alejandro Andres De La Cruz is the doctor in the familia (family). He’s always there to help everyone in need. Alex loves to ride Luna a palomino on the familia’s hacienda. He's hot, sexy and very warm caring hombre (man).  Carolina Crystal Reyes is a beautiful, sweet, young Medical Physician. She lives in the shadows and steals his heart.  Alex lives a double life. Can anyone help him in his time of need before losing his amor?  Excerpt  A few hours later, Alex drives down the off ramp. “We’re almost there,” he says. He glances over to look at his beautiful esposa. She’s so bella and the dress really is beautiful on her, he thinks, possessively.  Alex stops at the stop light and turns to give her a beso. The light turns green and he proceeds thru the intersection.  Out of nowhere, a car runs the red light and crashes full speed on the right side of Alex’s car. The car is pushed over onto the opposite side of the road. The good thing is that there were no cars on that side. Alex’s car rolls over. The car then stops upside down.  The ambulance attendant pulls Alex out of the car. Alex comes through, dazed.  He immediately looks for Carolina, yelling out her name. “Carolina! Where is Carolina!” yells Alex, in desperation.  The paramedics recognize him and immediately attempt to calm him down. “Dr. De La Cruz, you need to remain calm,” says a Paramedic. They don’t know that Carolina is his esposa.  “Where is my esposa,” he yells out. “I need my esposa.” he looks around frantically, trying to see her.  “Dr. De La Cruz, the young lady in your car has been air lifted to the ER. She received the brunt of the impact and the door caved in. She’s stable but is unconscious,” says the Paramedic.  He takes Alex’s vitals and starts an IV with pain medication. Alex is knocked out instantly.  “Dr. De La Cruz was real frantic about learning the whereabouts of that cute Physician’s Assistant. Did he really call her his wife? He was asking for his esposa and that means wife in Spanish. I heard lots of gossip lately about them,” says one Paramedic to the other.  “I don’t know. I didn't hear him. I hope that the Physician Assistant makes it. She was really hurt,” says the other Paramedic. He shakes his head as they roll Alex onto the ambulance.",
  "genres": [
    "Romance"
  ],
  "author": "P.T. Macias",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/20748107-hot-adorable"
}