{
  "title": "Hanging the Artificial Sun",
  "description": "Mud, whiskey, pole dancers and the girl from homeroom… Welcome to the Marine Corps. This is our story.You and I are going to take journey and it will begin with the photo on my desk of a girl from my high school homeroom. Despite the age of the photo I can still feel her magic and remember how sweet the air smelled every time she walked past me in the hallway so many years ago.The journey begins with her and will lead to Parris Island, Camp Lejeune and to distant lands halfway around the world. As we travel together I’ll introduce you to the raw and raunchy lifestyle of a seagoing U.S. Marine serving in an artillery battery - a rigorous, hardcore world that is not for the fainthearted.We’ll travel by way of ship and go ashore in strange lands where we’ll hang the artificial sun for the grunts while living under conditions that will make you yearn for home. We’ll travel to foreign ports of call and to seedy brothels where we’ll make our business deals, and to the back alleys where we’ll sleep off the whiskey.As we take our journey you will meet my fellow Marines, some of the most colorful and toughest young men God has ever put on this planet. You’ll lie beside us as we sleep in the pouring rain, the driving snow or the 100+ degree heat. You will go hungry, wear the same skivvy drawers for a month at a time, and learn to appreciate the little things in life such as a letter from home tinged with perfume.This will be a journey unlike any you’ve ever taken. But remember, it will revolve around the girl from homeroom. You’ll experience her magic, and understand why I traveled the world as a U.S. Marine only to return to the place where I started, and to the girl that I always knew was meant to be mine.***Hanging the Artificial Sun is a vivid, heartfelt story told in the first person that offers the reader an inside view into the hearts and minds of the young men that serve in the United States Marine Corps. If you have ever served in the Marine Corps or have a family member that is currently serving, or if you just love an adventurous tale you will enjoy this story and find it immensely satisfying and entertaining. The story will leave you with a better understanding of the pride that burns in the heart of every Marine, as well as the power of the love he carries with him for his girl back home, his fellow Marines and his Corps.",
  "genres": [
    "Military Fiction",
    "Biography"
  ],
  "author": "Dale J. Young",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/20745172-hanging-the-artificial-sun"
}