{
  "title": "On the Niemen",
  "description": "In the early 1900s, Eliza Orzeszkowa was repeatedly a top contender, with Leo Tolstoy, for the Nobel Prize in literature. Neither won. Nevertheless, her novels have remained classics of Polish literature, and her most famous, On the Niemen, is not only an unusual love story, but is strikingly relevant today. Unhappy after being abandoned by her fiancé, Justyna, an impoverished young woman who lives in a manor house belonging to relatives, desires a life of greater usefulness. While being pursued by a wealthy aristocrat and by her former love – now married – she meets Jan, a man of lower social standing, who introduces her to a different world: one of closeness to nature, manual labor, and communal enjoyments. To leave the manor for a farmstead would be a very peculiar proceeding, however, and furthermore, the farming community is feuding with Justyna's uncle. Set in the 1880s among the Polish population in a part of what was once the Polish-Lithuanian Commonwealth, the story involves the consequences of the January Uprising, twenty years before, against Russian rule. The characters are drawn from a cross section of society and the novel's topics include love, social justice, egotism and materialism, the psychological effects of war, the emancipation of women, marriage as partnership, drug addiction, dignity, obligations to one's fellow humans, what it means to be civilized – and joy.The use of On the Niemen for school literature has unfairly turned generations of Poles against this beautiful story. However, it should be mentioned that readers who dislike detailed descriptions of rural landscapes and late 19th-century interiors will probably not appreciate it. As I could not find any other translation into English of this novel, I have translated it myself. It was a work of love. ─ The Translator",
  "genres": [
    "Polish Literature",
    "Classics",
    "School",
    "Fiction",
    "Poland",
    "Audiobook",
    "Historical Fiction"
  ],
  "author": "Eliza Orzeszkowa",
  "average_rating": "3.10",
  "url": "https://www.goodreads.com/book/show/20744744-on-the-niemen"
}