{
  "title": "Briefe von Felix: Ein kleiner Hase auf Weltreise",
  "description": "Wenn einer eine Reise tut, dann hat er was zu erzählen. Der Kuschelhase Felix kommt ganz unfreiwillig zu seinen Reiseabenteuern. Er geht seiner Freundin Sophie am Ende der Ferien auf dem Flughafen verloren und nicht einmal Papa, der doch sonst alle Probleme lösen kann, gelingt es, Felix wieder aufzutreiben. Das ist ein trauriges Ferienende für Sophie. Um so mehr freut sie sich, als sie eines Tages von der Schule nach Hause kommt und ein Brief aus London auf sie wartet -- aber dort kennt sie doch gar niemanden. Der Absender ist, man ahnt es schon, kein geringerer als der verloren geglaubte Hase Felix. Aber London ist erst der Anfang seiner Abenteuer-Tour. Felix reist munter weiter: Aus Paris, Rom, Ägypten, ja sogar aus Amerika trudelt Post ein. Natürlich berichtet er Sophie ausführlich über seine neuen Entdeckungen und aufregenden Erlebnisse. Als der erste Schnee fällt und Weihnachten naht, steht für Sophie am Nikolausabend eine große Überraschung vor der Tür. Die Autorin Annette Langen hat für Kinder eine humorvolle und informative Geschichte über das Reisen geschrieben. Die Weltreise des kleinen Hasen Felix wird von der Illustratorin Constanza Droop mit einer Fülle bunter, liebevoller Bilder begleitet. Der Hit des Buches sind die \"echten\" Felix-Briefe, die den passenden und sogar frankierten Umschlägen entnommen werden können. Bereits erste Leseanfänger können diese ohne Mühe selbst entziffern -- denn Felix erledigt seine Korrespondenz in gut lesbaren Großbuchstaben. Die größte Überraschung wartet dann am Ende des Buches, wenn Felix mit seinem buntkarrierten Köfferchen vor der Haustür steht und der kleine Leser selbst die mitgebrachten Reisesouvenirs auspacken darf. Briefe von Felix ist ein exzellentes Kinderbuch mit einer schönen Geschichte und einer ausgefallenen Ausstattung. Alles zusammen trägt mit Sicherheit dazu bei, dass es in kürzester Zeit zum Lieblingsbuch der kleinen Leser und großen Vorleser wird. --Manuela Haselberger",
  "genres": [
    "Childrens",
    "Picture Books",
    "German Literature",
    "Adventure",
    "Travel",
    "Geography",
    "Fiction"
  ],
  "author": "Annette Langen",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/2074967.Briefe_von_Felix"
}