{
  "title": "Sei tu",
  "description": "Nicco non ci può credere. Quella mattina di inizio estate, mai si sarebbe aspettato di trovare la stanza dell'hotel completamente vuota.Senza nessuna traccia di Ann. Lei, la bellissima turista americana con cui ha vissuto giorni da favola, è sparita dalla sua vita. Non gli ha lasciato un biglietto, un recapito, nulla. Si è perfino dimenticata lì il sasso a forma di cuore che hanno trovato insieme sulla spiaggia di Anzio.Peccato, proprio ora che Nicco aveva capito di essere ancora capace di innamorarsi, di avere superato la storia con Alessia. Proprio ora che aveva ritrovato le parole d'amore perdute.Se in Quell'attimo di felicità Federico Moccia ha raccontato la balbuzie di un ragazzo nell'esprimere un sentimento d'amore, in Sei tu ci dice invece che non esistono ostacoli che ci possano fermare quando sentiamo il nostro cuore urlare \"Ti amo!\".Da quella stanza d'albergo vuota comincia un'avventura incredibilmente ricca di incontri e colpi di scena. Nicco decide d'impulso di partire alla ricerca di Ann spalleggiato dal formidabile amico Ciccio. Una decisione assurda e totalmente irrazionale ma soprattutto senza alcuna possibilità di riuscita: l'unico indizio è infatti un indirizzo di New York, strappato con cento euro al portiere dell'hotel. Un indirizzo che, arrivati nella Grande Mela, si rivelerà falso.Ma a volte il cuore è come una bussola, sa captare il magnetismo di due persone che si amano e che il destino vuole fare incontrare di nuovo.Con tantissima fortuna e grande intraprendenza, aiutato da personaggi come il coloratissimo Venanzio e la risoluta manager Pamela, Nicco conquisterà gli Stati Uniti e soprattutto riuscirà finalmente a dare voce ai suoi sentimenti.Quando senti dentro di te un amore così grande, nessun ostacolo può fermarti, meno che mai una lingua straniera.",
  "genres": [
    "Romance"
  ],
  "author": "Federico Moccia",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/20752248-sei-tu"
}