{
  "title": "Fields of Blood: Religion and the History of Violence",
  "description": "From the renowned and best-selling author of A History of God, a sweeping exploration of religion's connection to violence.For the first time in American history, religious self-identification is on the decline. Some have cited a perception that began to grow after September 11, 2001-that faith in general is a source of aggression, intolerance, and divisiveness, something bad for society. But how accurate is that view? And does it apply equally to all faiths? In these troubled times, we risk basing decisions of real and dangerous consequence on mistaken understandings of the faiths around us, in our immediate community as well as globally. And so, with her deep learning and sympathetic understanding, Karen Armstrong examines the impulse toward violence in each of the world's great religions. The comparative approach is new: while there have been plenty of books on jihad or the Crusades, for example this one lays the Christian and the Islamic way of war side by side, along with those of Buddhism, Hinduism, Confucianism, Daoism, and Judaism. Each of these faiths arose in an agrarian society with plenty of motivation for violence: landowners had to lord it over peasants, and warfare was essential to increase one's landholdings, the only real source of wealth before the great age of trade and commerce. In each context, it fell to the priestly class to legitimate the actions of the state. And so the martial ethos became bound up with the sacred. At the same time, however, the faiths developed ideologies that ran counter to the warrior code: around sages, prophets, and mystics within each tradition there grew up communities that represented a protest against the injustice and violence endemic to agrarian society. This book explores the symbiosis of these two impulses and its development as these confessional faiths came of age. But modernity has also been spectacularly violent, and so Armstrong goes on to show how and in what measure religions, in their relative maturity, came to absorb modern belligerence-and what hope there might be for peace among believers in our time.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Philosophy",
    "War",
    "Audiobook",
    "Theology"
  ],
  "author": "Karen Armstrong",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/20758028-fields-of-blood"
}