{
  "title": "Into the Blizzard: Walking the Fields of the Newfoundland Dead",
  "description": "“In June a few years ago I set out to visit some of the World War One battlefields of Europe – the slope and valley and river and plain that the Newfoundland Regiment trained on, and fought over and through and under.”    So begins Michael Winter’s extraordinary narrative that follows two parallel journeys, one laid on top of the other like a sketch on opaque paper over the lines of an old map. The first journey is that of the young men who came from Newfoundland’s outports, fields, villages and narrow city streets to join the storied regiment that led many of them to their deaths at Beaumont-Hamel during the Battle of the Somme on July 1, 1916. The second journey is the author’s, taken a century later as he walks in the footsteps of the dead men to discover what remains of their passage across land and through memory.      Part unconventional history, part memoir-travelogue, part philosophical inquiry, Michael Winter uniquely captures the extraordinary lives and landscapes, both in Europe and at home, scarred by a war that is just now disappearing from living memory. In subtle and surprising ways, he also tells the hidden story of the very act of remembering – of how the past bleeds into the present and the present corrals and shapes the past. As he wanders from battlefield to barracks to hospital to hotel, and finally to a bereft stretch of land battered by a blizzard back home, Winter gently but persistently unsettles us – startling us with the unexpected encounters and juxtapositions that arise from his physical act of walking through the places where the soldiers once marched, this time armed with artifacts and knowledge those earlier souls could not have, yet undone by the reality of their bodily presence beneath the earth.      In this unusual, poignant and beautiful book, Michael Winter gives us a new way of looking at a powerful piece of history that, he reminds us, continues to haunt our own lives.",
  "genres": [
    "History",
    "Nonfiction",
    "Travel",
    "Canada",
    "World War I",
    "Military Fiction",
    "Memoir"
  ],
  "author": "Michael  Winter",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/20758075-into-the-blizzard"
}