{
  "title": "Индия – рецепта за любов",
  "description": "Чана масала с лютив вкус и сватбени камбани...Да си необвързан и да се озовеш в разгара на сватбения сезон в Индия – не е ли ирония на съдбата... Именно в тази ситуация попада авторката Александра Потър. В началото на 2012 г. тя прекарва четири седмици в Раджастан, който е известен като Земя на царете. „Тогава нямах сериозна връзка, бях в компанията на приятелка сред всички тези сватби и си помислих – това е някаква шега... Въпреки всичко беше страхотно, срещах прекрасни хора! Индия наистина е магическо място, което ме вдъхнови за новия ми роман”.„Индия – рецепта за любов” е първата книга от новата поредица на Александра Потър - „Пътешествията на Руби Милър”. Авторката отново предлага на своите читатели романтична комедия с „искрица магия”, както самата тя обича да казва, но този път е добавила и елемента на пътуването, тъй като именно пътешествията са една от големите страсти в живота й.Романът „Индия – рецепта за любов” ни поднася романтика и забавление в съвършена форма.Любовта следва неотлъчно Руби Милър...Тя е писателка на романтични истории с щастлив край. Но нейната собствена не завършва щастливо: когато открива, че годеникът й е лъжлив задник, губи вярата си в любовта. Както и вдъхновението си.Затова, когато сестра й я кани на слънчева ваканция в Индия, за да забрави проблемите си, Руби взема първия самолет и се впуска в шеметно приключение.После всичко се случва прекалено бързо:- сестра й е влюбена в инструктора си по йога и бяга, за да се омъжи тайно- багажът на Руби е откраднат- красив, но досаден американец е единствената й надежда да оцелее в Индия- странен и смешен шофьор на бял амбасадор е техният гид по разнебитените пътища на страната.Руби бързо научава, че индийската храна може и да не е толкова пикантна, колкото е смятала, да яздиш камила не е същото, като да яздиш пони, и едно от най-важните неща в Индия е да имаш винаги под ръка руло тоалетна хартия.Започналото пътуване в търсене на сестра й скоро се превръща във вихрено пътешествие, което я среща с различни романтични места и... истории! И където я очакват сюрпризите на любовта...„Защото такова е положението с любовта – тъкмо когато си мислиш, че си разбрал всичко, и тя има навика да те изненадва.”",
  "genres": [
    "Chick Lit",
    "Romance",
    "Contemporary",
    "Fiction",
    "Adult",
    "Contemporary Romance",
    "Novels"
  ],
  "author": "Alexandra Potter",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/20754174"
}