{
  "title": "Blurred Lines",
  "description": "A growing phenomenon in the queer community is rejecting the strict confines of the gender binary. The need to be 'all boy' or 'all girl' all the time—or to feel like one or the other at all—is a restriction on free gender expression. What does it look like when someone blazes their own path through gender roles? Wearing, saying, and doing what they want, even when it causes confusion or discomfort to others? It takes a strong personality to defy societal norms, and this collection brings together several of them. In \"Werebears and Water\", Rayce and his boyfriend, Vince, take a break from their busy college lives to visit a WereCon, where they hope to meet others like themselves. Most of the attendees are players and posers, but when a sexy spitfire of a girl named Maia comes to share their room after a hotel mix-up, they will find that she's everything they were looking for... and everything they didn't even know they were looking for. Tony tends bar, and whether he's in a suit and tie or a mini-skirt and glitter, he can handle anything from sarcastic comments to the drunk and disorderly—except for the gorgeous George, whose comfort level with Tony's gender fluidity is a little fluid itself. Experience has taught Tony to expect the worst, and he's not about to risk his heart on someone who can't love him, tits and all. Only by \"Defying Expectations\" can George win the fair bartender's heart. Then, in \"Red Blood, White Blood\", Chee, once known as Chen, has sought the guidance of her tribe's spirit creatures, and has received and unorthodox she will not receive the totem's blessing to become a hunter, because that is a man's duty and, despite her body, she is no man. Her horrified family sends her away to another tribe, where a wise woman may have a cure for her strange malady... but the wise woman's cure is acceptance. As Chee teaches Taki, a boy with a similar dilemma (and a woman's body), the ways of men, she learns her own place as a woman of her new tribe, both publicly and in the privacy of a darkened hut. Finally, \"Of All the Days\" to wear the tits, Vesh chose the day ze tried to finger guardsman Jeric's pouch. And later, ze was caught again fingering the big man's private property. And again, when Vesh is finally caught stealing from the wrong person, ze and Jeric are given a joint bump and grind their way through the deadly catacombs beneath the city and bring back their prize alive, and they will walk away with enough gold to hump their way to any other city they wish.",
  "genres": [],
  "author": "Kathleen Tudor",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/20755721-blurred-lines"
}