{
  "title": "The Lucy Chronicles: a lesbian's love of the rod",
  "description": "This book contains numerous graphic descriptions of severe corporal punishment and lesbian sexual activity, so please do not read this work if you are likely to be offended by such accounts.  At a little under 100,000 words, this is a very substantial account of the exploits of Lucinda (Lucy). The story starts when she is taken from an orphanage and made the ward of Madame Natalina, an enthusiastic wielder of both birch rod and cane as a means of maintaining discipline. At eighteen Lucy is sent to a boarding school run by the formidable lesbian headmistress, Anastasia, who is also a strict disciplinarian. We soon discover that Lucy is sexually excited by her whippings, which although very painful also induce lasciviousness and lust in her - feelings that are compounded as she engages in, and witnesses, lesbian activity with a number of her fellow boarders.  This epic tale continues when, having left school Lucy begins a relationship with Lady Amelia who becomes Lucy's lover and disciplinarian. During this phase Lucy is also subject to severe corporal punishment with a number of other women. Later, Amelia takes Lucy on a grand tour of Europe subsequent to which she is left in the hands of her former governess, Mistress Michelle who runs a 'finishing school' for girls, preparing them for lives of total submission to their respective Mistresses  Following this we learn that Lucy has been appointed as an honorary Sister of Discipline for the Order of Flagellants of St. Elizabeth of Hungary. Unfortunately she falls foul of the Mother Superior who accuses her of blasphemy and threatens to have her excommunicated following a severe public birching. But during the punishment, things take an unexpected turn when a fire erupts. A scorchingly hot tale in every respect...",
  "genres": [],
  "author": "Lucinda Shan",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/20755069-the-lucy-chronicles"
}