{
  "title": "Saving Simon: How a Rescue Donkey Taught Me the Meaning of Compassion",
  "description": "In this heartfelt, thoughtful, and inspiring memoir, New York Times bestselling author Jon Katz tells the story of his beloved rescue donkey, Simon, and the wondrous ways that animals make us wiser and kinder people.In the spring of 2011, Jon Katz received a phone call that would challenge every idea he ever had about mercy and compassion. An animal control officer had found a neglected donkey on a farm in upstate New York, and she hoped that Jon and his wife, Maria, would be willing to adopt him. Jon wasn’t planning to add another animal to his home on Bedlam Farm, certainly not a very sick donkey. But the moment he saw the wrenching sight of Simon, he felt a powerful connection. Simon touched something very deep inside of him. Jon and Maria decided to take him in.Simon’s recovery was far from easy. Weak and malnourished, he needed near constant care, but Jon was determined to help him heal. As Simon’s health improved, Jon would feed him by hand, read to him, take him on walks, even confide in him like an old and trusted friend. Then, miraculously, as if in reciprocation, Simon began to reveal to Jon the true meaning of compassion, the ways in which it can transform our lives and inspire us to take great risks.This radically different perspective on kindness and empathy led Jon to a troubled border collie from Ireland in need of a home, a blind pony who had lived outside in a pasture for fifteen years, and a new farm for him and Maria. In the great tradition of heroes—from Don Quixote to Shrek—who faced the world in the company of their donkeys, Jon came to understand compassion and mercy in a new light, learning to open up “not just to Simon, not just to animals, but to the human experience. To love, to risk, to friendship.”With grace, warmth, and keen emotional insight, Saving Simon plumbs the depths of the bonds we form with our animals, and the rewards of “living a more compassionate, considered, and meaningful life.”",
  "genres": [
    "Nonfiction",
    "Animals",
    "Memoir",
    "Biography",
    "Nature",
    "Philosophy",
    "Book Club"
  ],
  "author": "Jon Katz",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/20758046-saving-simon"
}