{
  "title": "Pure Will",
  "description": "*****This book contains some content appropriate for age 17+ and is not suitable for younger readers*****Growing up without a mother, Camden never learned the rules of sex until introduced to them by a bad boy who took advantage of her innocence—breaking her. Will spiraled into a world of darkness following an unbearable hurt…in turn using women and alcohol to dull the pain.Two wounded people…coming together under awkward circumstances…healing each other…until the bad boy from Camden’s past finds her…Does Will have the power to fight for someone worth fighting for?Camden Biggs, the daughter of a professional baseball player…lost her mother at age 9. Eager to be loved, she fell in love with the hottest, bad boy she’d ever met at age 15, Max. Totally off limits and living under the same roof, she succumbed to his manipulations until he was forced out of her life—hanging on to a promise to only give herself to him. Will Denton raised by a trailer trash father and a trust fund mother had a taste of both worlds and all sorts of women—especially when he dove into a world of darkness following a tragedy and loss of his own. Camden, now a senior at the University of Kansas where she tutors the hottest, most talented athletes hides behind her outgoing roommate Kate—who is sexually active enough for both of them; Camden lives vicariously through Kate while still trying to heal her wounds from the past—until Will Denton comes home with Kate one night. Though he slept with Kate, he sets his sights on Cam. Camden finally succumbs to the gorgeous eyes and body of Will Denton. And as Will is finally starting to tear down the walls that Cam has built over the years…Bad Boy Max makes a reappearance to reclaim what was once his.",
  "genres": [
    "Romance",
    "New Adult",
    "Abuse",
    "College",
    "Contemporary Romance",
    "Contemporary",
    "Sports"
  ],
  "author": "Kristi Pelton",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/20756520-pure-will"
}