{
  "title": "Kustaa III ja suuri merisota : taistelut Suomenlahdella 1788-1790",
  "description": "Oli kamalaa nähdä, miten ihmisiä, tankoja, raakoja ynnä muuta ruudin voimasta lensi ilmaan ja miten ihmiset sitten taas putosivat veteen laivamme ympärillä sysimustina ja jäsenet silvottuina. Mitä lähemmäksi tulimme viittä vihollisalusta, jotka yhdessä rantapattereiden kanssa yrittivät sulkea väylän, sitä enemmän lisääntyi kuulien, pommien, kranaattien ja haulien viuhuna. Ne putosivat ympärillemme veteen kuin rakeet... Näin kuvailee Kustaa III:n suomalainen yksityissihteeri J. A. Ehrenström Viipurin kujanjuoksua 3. heinäkuuta 1790. Hän oli mukana kuninkaan esikuntalaivassa Amphionissa ja saattoi silminnäkijänä kertoa kokemistaan kauhun hetkistä. Itämerellä ja Suomenlahdella käytiin lukuisia yhteenottoja kolmen sotavuoden aikana 1788-90 niin kutsutussa Kustaan sodassa, jonka Ruotsin kuningas oli aloittanut serkkuaan Venäjän keisarinnaa Katariina II:ta vastaan. Suuret linjalaivat taistelivat avomerellä, kun taas Ruotsin saaristolaivasto ja Venäjän soutulaivasto kamppailivat Suomenlahden perukassa. Koskaan aikaisemmin eikä myöhemminkään niin suuret laivastot olleet taistelleet Itämeren alueella kuin Kustaa III:n provosoimassa sodassa. Ruotsinsalmen taistelu, joka oli Pohjoismaiden suurin meritaistelu kautta aikojen, päätti 9. heinäkuuta 1790 tämän sotien sarjan merellä.\"Ruotsin historia on ennen vuotta 1809 meidän suomalaistenkin historiaa, olivathan suomalaiset kuningaskunnan itäisen osan alamaisia. Augustin Ehrensvärdin perustama saaristolaivasto oli leimallisesti suomalainen. Sillä oli oma lippunsa ja tukikohtansa telakoineen ja merisotakouluineen Viaporissa. Kirjan kirjoittaja Raoul Johnsson on loistava kynänkäyttäjä ja aiheeseensa perinpohjaisesti perehtynyt tietokirjailija. Hän kuvaa meritaistelut niin elävästi, että lukija tuntee olevansa tapahtumissa itse mukana. Kirjan kuvitukseen ja kuvateksteihin on panostettu todella paljon. Suurin osa kirjan yli 200 kuvasta julkaistaankin nyt ensimmäistä kertaa Suomessa.\"",
  "genres": [],
  "author": "Raoul Johnsson",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/20758496-kustaa-iii-ja-suuri-merisota"
}