{
  "title": "The Wildwater Walking Club: Book 1 of The Wildwater Walking Club series",
  "description": "#1 Amazon Bestseller in Walking!Walking Group Guide and Book Club Questions included.By the USA Today bestselling author of Must Love Dogs, a fun and inspiring novel about women and friendship - and how even big changes happen one step at a time.Join Noreen, Tess and Rosie as they walk and talk, talk and walk, tally their steps, share their secrets, and begin putting their lives back together. You'll be lacing up your own sneakers in no time.\"Lively and inspiring!\"-Hartford Courant \"A great feel-good story.\"-Philadelphia Examiner After losing her boyfriend and her job in one fell swoop, Noreen has no idea what her next step is. So she puts on a new pair of sneakers and a seriously outdated pair of exercise pants, and walks. Before long she's joined by two neighbors as lost as she is and figures out time flies and fitness is actually fun when you're walking with friends. Throw in a road trip to Seattle for a lavender festival, a career-coaching group that looks like a bad sequel to The Breakfast Club, some terrific romantic comedy twists and turns, a quirky multigenerational cast of supporting characters, and the result is a tribute to female friendship that will inspire you to pick up the phone and call all your old friends--or maybe even start your own walking group.\"The Wildwater Walking Club is a quick smart read that will get you thinking about walking, friendship, and making time for the things you love.\" -Bookreporter.com\"Readers who enjoy a celebration of friendship will want to walk the beach alongside the Wildwater trio.\" -Midwest Book Review\"The Wildwater Walking Club reminds us of what's important in life - the joy of friendship, the power of a brisk walk, and of course the importance of a good book. I couldn't put it down. -Anisha Lakhani\"The woman of The Wildwater Walking Club are a delightful trio, full of heart and determination. As they - literally - put one foot in front of the other, the three new friends find unlikely paths that point them toward more fulfilling lives. Their journey left me genuinely inspired (and with the curious urge to go out and buy a clothesline).\" -Jean Reynolds Page",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Womens Fiction",
    "Friendship",
    "Contemporary",
    "Book Club",
    "Audiobook"
  ],
  "author": "Claire Cook",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/20761877-the-wildwater-walking-club"
}