{
  "title": "The Case for Literature",
  "description": "When Gao Xingjian was crowned Nobel Laureate in 2000, it was the first time in the hundred-year history of the Nobel Prize that this honor had been awarded to an author for a body of work written in Chinese. The same year, American readers embraced Mabel Lee’s translation of Gao’s lyrical and autobiographical novel Soul Mountain, making it a national bestseller. Gao’s plays, novels, and short fiction have won the Chinese expatriate an international following and a place among the world’s greatest living writers.The bold and extraordinary essays in this volume—all beautifully translated by sinologist Mabel Lee—include Gao's Nobel Lecture (“The Case for Literature”), “Literature as Testimony: The Search for Truth,” “Cold Literature,” “Literature and Metaphysics: About Soul Mountain,” and “The Necessity of Loneliness,” as well as other essays. These essays embody an argument for literature as a universal human endeavor rather than one defined and limited by national boundaries. Gao believes in the need for the writer to stand apart from collective movements, regardless of whether these are engineered by political parties or driven by economic or other forces not related to literature. This collection presents Gao's innovative ideas on aesthetics, and it constitutes the very kernel of his thinking on literary creation.Praise for Soul Mountain:“A brilliant sprawl of a novel that defies conventional notions of ‘the self’ and ‘literature.’”—Washington Post“Startlingly poetic language . . . Bewitching narrative voices . . .One long immersion in buried strata of history and the psyche.”—Boston Globe“Gao’s wanderer . . . has found survival . . . in words. And ultimately, it is the miracle of those words that wins Nobels.”—Los Angeles Times Book Review",
  "genres": [
    "Literature",
    "Nonfiction",
    "China",
    "Essays",
    "Literary Criticism",
    "Asian Literature"
  ],
  "author": "Gao Xingjian",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/207606.The_Case_for_Literature"
}