{
  "title": "The Dragon's Queen",
  "description": "The Dragon's Queen (Dragon Lords)Dragonshifting RomanceMede of the Draig knows three things for a fact: As the only female dragon shifter of her people, she is special. She can kick the backside of any man. And she absolutely doesn't want to marry.Mede has spent a lifetime trying to prove herself as strong as any male warrior. Unfortunately, being the special, rare creature she is, she's been claimed as the future bride to nearly three dozen Draig--each one confident that when they come for her hand in marriage fate will choose them. When the men aren't bragging about how they're going to marry her, they're acting like she's a delicate rare flower in need of their protection.She is far from a shrinking solarflower.Prince Llyr of the Draig knows four things for a fact: He is the future king of the dragon shifters. He must act honorably in all ways. He absolutely, positively is meant to marry Lady Mede. And she dead set against marriage.Llyr's fate rests in the hands of a woman determined not to have any man. With a new threat emerging amongst their cat shifting neighbors, a threat whose eyes are focused firmly on Mede, time may be running out. It is up to him to convince her to be his dragon queen.About Book 9Before four princes and four noblemen found their brides, before the death of the Var King Attor and the threat of the Tyoe miners, there was a time of peace on the planet of Quirlixen. It was not a strong peace, but it had lasted for quite some time between the catshifting Var kingdom and their northern neighbors the dragonshifting Draig. It lasted because both sides had very little to do with each other. It is here the dragons found their queen.",
  "genres": [
    "Dragons",
    "Romance",
    "Paranormal Romance",
    "Paranormal",
    "Fantasy",
    "Aliens",
    "Shapeshifters"
  ],
  "author": "Michelle M. Pillow",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/20760182-the-dragon-s-queen"
}