{
  "title": "A Glory Days Awakening",
  "description": "This is the paperback containing the novellas Wait For Me, Take Me, and Accept MeWait For Me My name is Liana Miller. I was attacked in place of my best friend. Healing was harder than they told me it would be. The nightmares haunted my sleep, and the one person I needed was gone. When Gory Days goes out on tour, I’m left alone to heal from the attack that left me beaten and broken. Reed Sullivan, the man who held my heart was the rockstar I told myself I’d never love. Fate has a way of proving us wrong, when he is the one to help me back from the depression that makes me do things I’ll never forgive myself for. Take Me Glory Days was finally home from their tour overseas. Reed and I were making an escape to a remote island for some time alone. The goal was to help me heal from the attack that changed my life, but deep down, I knew I’d never be as I once was. When I finally come clean with a secret I’d been keeping since my attack, Reed’s anger bubbles to the surface. My gentle giant hurts for me, and I know there is only one way that he can move on. My secret comes with it questions of my attack, and I soon realize, Reed Sullivan has a secret of his own that he’s been carrying for a very long time. Our future may not be known, but with Reed by my side, I know we can face anything. Accept MeI am better now than I was over a year ago. With Reed’s love, I have bound back to my old self as I dive into writing the story of Glory Days. The upcoming tour will be something new for us, because I will be traveling with them. My dream of a shelter for women, like myself, finally becomes a reality when Ash gifts me with a place in Northern California. My ideas and goals are large, and the time is right for me to wake up and live again. Until a sudden discovery throws us all off our tracks.",
  "genres": [],
  "author": "Theresa Hissong",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/20758429-a-glory-days-awakening"
}