{
  "title": "Abortion Rites: A Social History of Abortion in America",
  "description": "The pre- Roe v. Wade history of U.S. abortion is little understood by most Americans. Opponents of abortion often look at those good old days as a golden age in which abortion was rare and criticism of the practice was adamant. On the other hand, advocates of legalized abortion criticize the bad old days of \"back-alley abortionists\" but argue that through nearly all our nation's history most Americans accepted the right of abortion. Both sides simplify the past and make assumptions favorable to their current stand; both need a greater grasp of the past regarding this crucial issue. Were abortions commonplace in early U.S. history? What types of women received abortions in post-Revolutionary America? Who opposed it then and later, and how and why? To what effect? What led to Roe v. Wade ? In this remarkable and controversial work, Marvin Olasky has written an in-depth analysis of the history of abortion in America. Part One describes the three groups of women who were having abortions through the mid-nineteenth century. Part Two examines the failures and limited successes of anti-abortion Americans as they tried to develop a societal mind-set in which abortion was condemned. Part Three carries the story into the twentieth century, examining the moral transition among physicians and the impact of changing values and economic pressures. The story recounted here is not a simple one. Individual cases described in the historical record sometimes hinge on nuances of evidence rather than overt principles. But it is a story that must be told if we are to go beyond provocative bumper stickers and placards. This is not a book that will please all readers. Instead, it is a fully documented history that tells the truth about abortion in America while clearing away misunderstanding with the established views of both sides in the abortion wars. Most importantly, it surveys and interprets the subject within the framework of the historic Judeo-Christian value system, which provided the basis of American institutions and culture. The result of extensive study, including many, many hours of painstaking research in the Library of Congress, this brilliant work will radically impact the abortion debate. A great book dealing honestly with the foremost moral crisis of our day.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Feminism"
  ],
  "author": "Marvin Olasky",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/2076296.Abortion_Rites"
}