{
  "title": "Braiding Sweetgrass",
  "description": "As a botanist, Robin Wall Kimmerer has been trained to ask questions of nature with the tools of science. As a member of the Citizen Potawatomi Nation, she embraces the notion that plants and animals are our oldest teachers. In Braiding Sweetgrass, Kimmerer brings these lenses of knowledge together to show that the awakening of a wider ecological consciousness requires the acknowledgment and celebration of our reciprocal relationship with the rest of the living world. For only when we can hear the languages of other beings are we capable of understanding the generosity of the earth, and learning to give our own gifts in return.\"Robin Wall Kimmerer writes about the natural world from a place of such abundant passion that one can never quite see the world the same way after having seen it through her eyes. In Braiding Sweetgrass, she takes us on a journey that is every bit as mythic as it is scientific, as sacred as it is historical, as clever as it is wise.\"—Elizabeth Gilbert, author of Eat, Pray, Love and The Signature of All Things\"Robin Wall Kimmerer shows how the factual, objective approach of science can be enriched by the ancient knowledge of the indigenous people. It is the way she captures beauty that I love the most—the images of giant cedars and wild strawberries, a forest in the rain and a meadow of fragrant sweetgrass will stay with you long after you read the last page.\"—Jane Goodall, author of Seeds of Hope and My Life with the Chimpanzees\"Everyone who cares about the environment—and everyone else, period—should have Braiding Sweetgrass on their table. It captures the true reverence between Native Americans and the earth, the relationship that we need to survive.\"—Oren Lyons, Faithkeeper, Onondaga Nation and Indigenous Environmental Leader",
  "genres": [
    "Nonfiction",
    "Science",
    "Audiobook",
    "Indigenous",
    "Book Club",
    "Memoir",
    "Environment"
  ],
  "author": "Robin Wall Kimmerer",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/20763843-braiding-sweetgrass"
}