{
  "title": "Project President: Bad Hair and Botox on the Road to the White House",
  "description": "Project President is a hilarious romp through American electoral history. From short, fat, bald John Adams' wig-throwing tantrums during the 1800 election to Abraham Lincoln's decision to grow a beard in 1860; from John F. Kennedy's choice to forgo the fedora at his inauguration to John Kerry's decision to get Botoxed for the 2004 race; from the Golden Age of Facial Hair (1860-1912) to the Age of the Banker (1912-1960); from Washington's false teeth to George W. Bush's workout regimen, Project President tells the story of America's love affair with presidential looks and appearance, why that often matters more than a politico's positions on the issues, and what might well be coming next. \"I'm constantly citing the power of dress. It's our clothes send a message about how we want to be perceived, and where is this more powerful and evident than in elected offices.In Project President , Ben Shapiro captures presidential semiotics with a potent narrative and deft analysis. It's simultaneously fascinating and hilarious!\"- Tim GunnProject Runway, Liz Claiborne, Inc. \"Ben Shapiro takes a romp through American history and shows how personality--and even haircuts--have elected or defeated presidential candidates. It's a tour through history that fans of both parties will enjoy-and can learn from.\"-Michael BaroneResident scholar, American Enterprise InstituteSenior Writer, U.S. News & World ReportCo-author, The Almanac of American Politics\"Presidential politics has always been more superficial than we'd like to admit. With a stylish and likeable touch befitting a strong candidate, Ben Shapiro takes us deep into the shallowness that has shaped American history.\"-Jonathan AlterNewsweek\"Shapiro deftly explains how height, hair and handsomeness can affect a candidate's campaign as much as issues. A fun, informative read.\"-Glenn BeckNationally syndicated talk show hostHost of CNN's The Glenn Beck Show\"A hilarious and illuminating journey through America's centuries-long fascination with presidential image-making. Whether you're left, right, moderate or apathetic, this lively book will get you ready for the packaging of the '08 races.\"-Jim Hightower\"This is a perceptive, witty-sometimes hilarious-look at the realities behind the faces and the facades, the slogans and the character assassinations, of each presidential campaign from George Washington to today - with much for us to ponder for tomorrow.\"-Sir Martin GilbertOfficial biographer of Winston Churchill \"An entertaining and illuminating romp through the politics of symbolism and personality in our presidential politics. If you're thinking of running for president, read this book before you spend a dime on a political consultant.\"-Rich LowryNational Review Who do you want [for the Supreme Court]? ANN Thank you for asking. I want Ben Shapiro. Ben Shapiro. ANN Yes. He just finished his first year at Harvard Law, 21 years old. You mean for a date or for the court? ANN No, for the court. He's my candidate. He's very bright. He's already written one best-selling book.(CROSSTALK) You want to put a 21-year-old guy on the court? ANN Twenty-one, and he's just finished first year of Harvard Law. So you want someone who's going to be on the court for 50, 60 years? Is that - is that the whole idea? ANN No, I just happen to like Ben Shapiro. Hannity and ColmesFox News ChannelJuly 8, 2005",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "American History"
  ],
  "author": "Ben Shapiro",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/2076481.Project_President"
}