{
  "title": "Green Vanilla Tea: One Family's Extraordinary Journey of Love, Hope, and Remembering",
  "description": "Green Vanilla Tea is a true story of love and courage in the face of a deadly and little understood illness. With literary finesse, compassion, and a powerful gift of storytelling, Marie Williams writes poignantly of her husband Dominic’s struggles with early onset dementia and amyotrophic lateral sclerosis (ALS) at the age of 40, and how their family found hope amidst the wreckage of a mysterious neurological condition.  As the condition develops and progresses, the normally devoted family man and loving partner seems to disappear beneath an expressionless facade, erratic behavior, and a relentless desire to wander that often leaves him lost. The road to diagnosis is long and confusing, and what starts off as perplexing for the family then becomes frightening. The man they love is changing, and no one seems to know why. He no longer turns up to his sons’ high school events. He falls and bumps into things. He becomes verbally disinhibited, emotionally disengaged, and, at times, belligerent. He doesn’t seem to be able to read the social cues of other people. He gets lost in familiar places, as well as on obsessive work trips overseas. He recklessly spends the family money, leaving them in near financial ruin. Despite this, Williams and her children strive to find new ways to keep him safe and to connect with the husband and father they love so dearly.   While the family learns to cope with Dominic’s illness—which they call the Green Goblin—Williams is determined that her children reclaim the dad of their memories. She finds creative ways to make visible the stories of the man beyond the illness, and helps them remember him as the engaged, healthy, and loving man she fell in love with. She humanizes the experience through storytelling and assembling a quilt made up of transferred photographs, painted artwork, family footprints, and personal inscriptions from family and friends. This, along with tea rituals, music, and stories of fatherhood, love and value, support them as fierce advocates for Dominic’s dignity and give the family new ways to be together as they journey through his decline. Spanning between moments of intense joy and incredible sadness, this book is a passionate testament to one family’s unconditional love for one another. It is, “a tale of a strange place—the real world— in which green goblins and hope find a way to live together.”   Above all, it is a love story.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "True Story",
    "Book Club",
    "Australia"
  ],
  "author": "Marie Williams",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/20763682-green-vanilla-tea"
}