{
  "title": "The Wisdom of the Beguines: The Forgotten Story of a Medieval Women’s Movement",
  "description": "The beguines began to form in various parts of Europe over eight hundred years ago, around the year 1200. Beguines were laywomen, not nuns, and thus did not take solemn vows and did not live in monasteries. The beguines were a phenomenal movement that swept across Europe yet they were never a religious order or a formalized movement. But there were common elements that rendered these women distinctive and familiar, including their common way of life, their unusual business acumen, and their commitment to the poor and marginalized. These women were essentially self-defined, in opposition to the many attempts to control and define them. They lived by themselves or together in so-called beguinages, which could be single houses for as few as a handful of beguines or, as in Brugge and Amsterdam, walled-in rows of houses (enclosing a central court with a chapel) where over a thousand beguines might live—a village of women within a medieval town or city. And each region of Europe has its own beguine stories to tell. Among the beguines were celebrated spiritual writers and mystics, including Mechthild of Magdeburg, Beatrijs of Nazareth, Hadewijch of Brabant, and Marguerite Porete, who was condemned as a heretic and burned at the stake in Paris in 1310. She was not the only beguine suspected of heresy, and often politics were the driving force behind such charges. Certain clerics defended beguines against charges of heresy, while other women had to go undercover by joining a Benedictine or Cistercian monastery. Amazingly, many beguine communities survived for a long time despite oppression, wars, the plague, and other human and natural disasters. Beguines lived through—and helped propel—times of great transition and reform. Beguines courageously spoke to power and corruption, never despairing of God’s compassion for humanity. They used their business acumen to establish and support ministries that extended education, health care, and other social services to the vulnerable. And they preached and taught of a loving God who desired a relationship with each individual person while calling to reform those who used God’s name for personal gain. What strength of spirit protected the lives of these women and their beguinages? What can we learn from them? What might they teach us? The beguines have much to say to our world today. This book invites us to listen to their voices, to discover them anew.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "Feminism",
    "Christian",
    "Medieval",
    "Spirituality"
  ],
  "author": "Laura   Swan",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/20763819-the-wisdom-of-the-beguines"
}