{
  "title": "Endure",
  "description": "This is Seth's story. Love follows no rules.  He was the last person I expected to find. He was nothing I wanted but everything I needed. I just hadn’t known it.  When I met him, my heart was heavy, and my soul was starving. And there he was, devastatingly handsome with dark, depthless eyes rimmed by long, dark lashes that created a feathered shadow on his cheek.  I always have been a sucker for beautiful eyes. But it wasn’t just his good looks that attracted me. It was the mischievous smile that graced his lips right before he said something silly. It was his laughter, with wild abandon, that made me want to smile again. It was the way he looked into my eyes when he spoke to me, making me feel as if my words really mattered. Like I was important to him as well. It was all of things and so much more. It was like seeing the world through a different set of eyes, and his excitement was contagious. You couldn’t help smiling back.  There was something about him. When I was with him, wrapped in his arms or kissing his beautiful mouth, I forgot the rest of the world existed. In those precious, stolen moments in time, he was mine. And I belonged to him. All of the trivial things slipped away as he made me feel as if we could do anything together. I believed him.  In the time I knew him, I began to see his soul. I watched him evolve and grow, and there was nothing more stunning than his smile as he talked about the things he loved best. That was the side of him I loved the most, those short moments when he saw himself as I did. With each new achievement, it was a little bittersweet. While I saw him growing and learning, I wanted to clutch tighter and keep him for just a little longer. But a wild heart cannot be tamed. I knew I’d someday have to share him with the world, and I counted down the days we had together. Every time he left, every time I walked out the door, I never knew if it would be the last time I saw him. I’d memorize his kiss, the look in his eyes as we made love, everything… everything. God, how I loved that scar on his lip. I loved all of him. The world tried to tell us it would never work, but they were wrong. I wasn’t quite prepared for the love and wonder, the amazement that I would experience every single day. While I thought I would be teaching him, he was the one teaching me. He taught me that a wounded heart can learn to love again. He taught me to cherish even the smallest things, that time really does fly by and each moment should be cherished. All of them. From disagreements to butterfly kisses and from fear to faith. All of this, he taught me. And more. Most importantly, he taught me that I could do anything if only I tried. What seemed impossible suddenly became possible.  He believed in me.  He helped me believe in me. We defied the odds more than once. I hope, I desperately hope, that we continue to do that every minute of every day –push one another to defy the odds. Together or apart. We’ll always be joined in that way.",
  "genres": [],
  "author": "Sydney Lane",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/20765047-endure"
}