{
  "title": "The Lawman West of the Pecos - Book 1",
  "description": "The western frontier of the United States and Texas in 1870 extended to the Rio Grande River. Into this country came men of every sort, men building the second transcontinental railroad, cattlemen, ranch owners, farmers, cowboys, prospectors, saloon owners, gamblers, outlaws; lots of outlaws and a few lawmen. The Texas Rangers patrolled the area with help from the United States Army; primarily the Buffalo Soldiers of the 9th and 10th U.S. Cavalry. But west Texas was too vast, so outlaws enjoyed it there. The weather only required a canvas tarp for shelter, there was plenty of game and water if you knew where to look and most important, no lawmen! Until 1882, there was a saying along the frontier, \"There's no law west of the Pecos and no God west of...where you happened to be at the moment, Deadwood, Dodge City, Fort Sumner...\" But Roy Bean changed that, he became Judge Roy Bean and the Law West of the Pecos on August 2, 1882. These are accounts of his first few cases. The stories revolve around Judge Roy Bean, his sheriff Sam \"Buck\" Burns and the hardy souls who moved west and struggled to survive. Langtry, Texas in August 1882 had existed for three months. It sprang up out of the prairie as a tent town, Vinegaroon; named for a scorpion that liked the area. There were 8,000 railroad workers building the second transcontinental railroad, a handful of ranch owners and a bunch of cowboys. Into this mix rolled Roy Bean on a freight wagon loaded with canvas tarps as shelter from the sun, tables, chairs and barrels of whiskey. Bean was an entrepreneur! But a poker game with too much whiskey and one man winning too much, led to a murder! They were going to just lynch the man, but Bean demanded a trial. He succeeded in seating a jury of relatively sober men who hadn't seen the shooting. Being the owner of the bar, he appointed himself judge. Witnesses testified, the jury talked it over and reached a verdict, hang him! It took about two hours to find a suitable tree and the deed was done. The Texas Rangers heard about this and figured if Bean was able to stop a lynching, conduct a trial, following relatively reasonable procedures, he'd make a decent Justice of the Peace. So they made the appointment. Phantly Roy Bean was now, Justice of the Peace, Judge Roy Bean of Pecos County, Precinct 6, State of Texas. Civil War veteran Sam \"Buck\" Burns was a New Mexico Ranger when Roy became a judge. He happened to be chasing a band of outlaws who were fleeing through the area and Buck and Roy met in June 1882. This book describes that first meeting and the Judge's first three trials. After his second trial Bean realized he was in over his head and needed a sheriff. He sent Burns a telegram. Buck was ready for a change and reported for duty. The two would service west Texas until 1902 when they both retired.",
  "genres": [],
  "author": "Stephen Hamm",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/20762105-the-lawman-west-of-the-pecos---book-1"
}