{
  "title": "Into the Fire: Ploesti, The Most Fateful Mission of World War II",
  "description": "A detailed and vivid account of the World War II disaster.\"—Booklist\"Into the Fire shimmers with historical parallels and modern resonances. . . . Schultz combed an impressive body of material for this account.\" —Washington Times\"This bittersweet tale of arrogance, wishful thinking, sacrifice, and heroism is recounted with grace and empathy.\" —Military.com\"Schultz combines a historian's meticulous research and a novelist's hypnotic prose to produce this memorable popular history... Shultz's intimate account of this controversial episode is a timely reminder of the horrors of war and a moving tribute to Ploestl's heroes.\" —Publishers Weekly\"We knew it was a disaster and knew that in the flames shooting up from those refineries we might be burned to death. But we went right in.\" —Lt. Norman Whalen\"We were dragged through the mouth of hell.\"—from a Ploesti Mission debriefing reportPlanned by Winston Churchill, authorized by Dwight D. Eisenhower, and executed by five specially trained American bomber units, the attack on the oil refineries of Ploesti, Romania, was among the most daring and dangerous missions of World War II. If the raid succeeded, the Nazi war machine would suffer a devastating blow. On August 1, 1943, nearly two hundred B-24 bombers flew from Benghazi, North Africa, with directions to descend on Ploesti at treetop level, bomb the refineries, and return. The low-level bombers could evade enemy radar and were thought to be more difficult to shoot down. But despite warnings that a German heavy flak train had been moved into the area and that the secrecy of their mission had been compromised, the bombers were sent out. Minutes from the target, one of the commanders made a wrong turn, leading the formations away from Ploesti. Recovering from this mistake, most of the bombers relocated the refineries, but the mission was doomed. The ensuing air-ground battle claimed dozens of the bombers, and many of those that survived the ordeal were forced to ditch in the ocean or in remote areas due to lack of fuel or structural damage.In Into the Fire: Ploesti, The Most Fateful Mission of World War II, Duane Schultz re-creates this great battle, combining original research and interviews with survivors in order to capture the tension, drama, and heroics of the warring sides. More Medals of Honor were awarded for this mission than any other aerial combat enterprise in the history of the United States. But the medals are bittersweet testimony to the courage of the 1,726 young men who risked all on a fateful attempt to cut off the Nazi supply of \"black gold.",
  "genres": [
    "World War II",
    "Aviation",
    "History",
    "Nonfiction",
    "Military Fiction",
    "Military History"
  ],
  "author": "Duane P. Schultz",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/2077293.Into_the_Fire"
}