{
  "title": "Yeah, Well...",
  "description": "I hate poetry. I usually find it self-indulgent, navel-gazing, cloying pap, an archaic art form that's long outstayed its relevance. In this brave new technological world where writing has evolved and anointed screenplay as endgame, poetry has been reduced to little more than a freakish sixth toe, as useful as an appendix. So why am I writing the introduction to a poetry book? Because Joel Landmine, that's why. Since first meeting Joel, I've been mesmerized by his work. A fixture on the San Francisco literary scene for years, he's etched out a name for himself by being exactly what I wish all poetry could be. Accessible. Relevant. Poignant and unforgettable. To quote Willy Wordsworth, Joel employs the \"language really used by men.\" (Yes, I know about the Romantic Poets; I'm not a barbarian.) In short, in the battle of us vs. them, Joel is one of us. (If you have to ask, you are probably one of them.) Joel writes for the butchered and abandoned, the castoff and downtrodden, and is unlike any poet I have ever read, unique in the truest sense of the word. He excels at the conversation of the lowlife, but Joel's work is steeped in the ordinary, too, infusing pop culture with philosophy, eviscerating the minutia and mundane that sometimes yields a world of riches. At least to those of us who have nothing. Squalor paints his scene, dejection his theme-but it's love, however fleeting, bizarre, unholy, perverted or downright religious (in the strictest unorganized sense) that remedies. There is a burning love and passion that colors this work, the desire of one man to reach out in the dark and confusion to say, \"Hey, baby, I'm just as fucked up as you. Let's have a smoke and compare tattoos. Then maybe later, we can get naked. Here, let me light that for you.\" Now that's the kind of poetry I want to read. Joe Clifford, author of 'Junkie Love' (Battered Suitcase Press, 2013)",
  "genres": [
    "Poetry"
  ],
  "author": "Joel Landmine",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/20775955-yeah-well"
}