{
  "title": "Dying to be a Centerfold",
  "description": "Dying to be a Centerfold is my life story. Starting out as a neglected child and not having a nurturing mother was something I was ashamed of. I took care of my mother since I was 5 years old. I don't remember ever being a child. I didn't have friends and was not allowed to leave my mother's side. As I became a beautiful young lady I noticed that men were drawn to me. To me that was love. I threw myself into school and I was a straight A student, I was in theatre productions and Choir and I loved that, When I was at school or on the stage I could pretend to be anybody and I was very good at that. I had learned that my sexuality would be my golden ticket, sometimes I used it to get jobs, or men. I wanted to be loved so bad but didn't know what that looked like. Eventually tiring of my mother I placed myself in a foster home. No matter where I went I got attention. I didn't realize what I had. I was taken advantage of often. I graduated a year early with a full scholarship to college but I had bigger dreams. I wanted to go to Hollywood. So I packed up with a coworker and I went. After struggling to make ends meet as a waitress I was introduced to a strip joint, Quite by accident really. I knew a girl from San Diego who told me about the money she made. I said I could never do that. Then I found a book of matches that said,' The Jet Strip and knew my current boyfriend a news anchor had been there. Filled with jealousy I went to see my friend and saw how beautiful the girls were, I auditioned and made $ 300 on three songs. I would get to perform, be sexy and make a lot of money, I was hooked. So while I was living with Jay the newscaster I met the owner of the Jet Strip. He was Big Mac and he was huge 6'6 300 pounds all muscle and wearing diamonds and fancy clothes. During those first few weeks I met my best friend John Rick Baker a Cop from Compton. During the next few months I was dating a Gangster, a cop, and a newsman all at the same time.",
  "genres": [],
  "author": "Terri Lenee Peake",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/20774425-dying-to-be-a-centerfold"
}