{
  "title": "The Collar of Freedom",
  "description": "\"My body is opening up and while my hips swerve on his desk, I am waiting, ready for penetration. But it’s not coming. My whole being is transgressing though his hand on my behind, one moment petting me and the next smacking me, and his raspy voice driving me mad.“Oh, Amelia…the things I could do to you…”He is restraining himself, I can feel it, and regarding him over my shoulder I want to scream ‘fuck me’ at him. Gyrating harder and harder over the desk I can sense my explosion coming and I know I am not thinking straight when I want him inside of me. Mounting the desk higher …I’m trembling.“Please…..fuck me.” I don’t recognize my whining voice.“Begging, Amelia?” His voice is dark, in control, but his panting is betraying him, he is as aroused as I am and enjoying me like this, feral and helpless.“Yes…..please.” __________________________________________Amelia Jones knows the truth; she lives and breathes it every day. The endless monotony of a loveless marriage, and years of domestic slavery stretch before her in minutes and hours that are destined to end in a mental breakdown. Then Alexander Reeves walks through the door. Her new boss is intriguing, charismatic and clearly driven by unspoken demons, and while Amelia knows she’s playing with fire, she’s relentlessly drawn to the man. Alexander is just as taken by her, but knows that giving into temptation can only end in disaster. When the couple succumb to a passionate, furious battle of the wills, Amelia is thrilled and afraid; Alexander’s erotic preferences are shocking to the uninitiated. The trouble is, wild as his life may seem, Amelia knows that he at least is living. Alexander may bring about her ruin, but he also holds the secret to her salvation, and Amelia prays she might be able to save him too.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Contemporary"
  ],
  "author": "Alexandra Iff",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/20786362-the-collar-of-freedom"
}