{
  "title": "Sexy Just Walked Into Town",
  "description": "Sexy Just Walked Into Town is a collection of delicious erotic and romantic stories from the Brit Babes. These eight British authors have put together a book of tales to tease and tantalise you, each one a sample of the individual Babes’ voices and styles. You’ll find contemporary, BDSM, same-sex loving, ménage a trois, paranormal, sporty, military, Rubenesque and more. There’s something to suit everyone here including a few Brit Babe collaborations.Ranging from sweetly vanilla to so-hot-it-will-blow-your-mind, the Brit Babes aim to please in every literary fantasy department. Their heroes are strong, determined and soul-achingly divine and their heroines sassy, sexy and not afraid to grab what they want. Passion and pleasure is the name of the game, romance and raunch a top priority and it all comes with a delightful sprinkle of kink.With a whole host of awards, best-sellers and accolades between them, the Babes just know you’ll find something in this anthology that will keep you turning the pages and squirming on your seat. Then, if you like what you read here, check out the individual authors’ websites to investigate their collection of published works. Also visit the Brit Babes’ home on the web which acts as a library for the hundreds of books published by them. Tell your friends, spread the word, because one thing you can be sure of, is when the Brit Babes arrive, sexy has just walked into town!Flesh for Fantasy by Lexie BayRed Rag to a Bull by Victoria BlisseThe Doll by Harlem DaeFigment by Natalie DaeThe Wrong End of the Stick by Lucy FelthouseStones by K D GraceTopiary by K D GraceSecret Servicing by Lily HarlemEnd Result by Lily Harlem and Lucy FelthouseThe Wife by Kay JaybeeUnderwear by Kay JaybeeCorporate Punishment by Ruby MadsenCaught Naked by Sarah MastersFrancesca’s Mother by Tabitha RayneThe Scribe by Tabitha Rayne",
  "genres": [
    "Erotica",
    "BDSM",
    "Anthologies",
    "Menage",
    "Romance",
    "LGBT"
  ],
  "author": "Lexie Bay",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/20784067-sexy-just-walked-into-town"
}