{
  "title": "Reinventing Organizations: A Guide to Creating Organizations Inspired by the Next Stage of Human Consciousness",
  "description": "FROM THE BACKCOVERThe way we manage organizations seems increasingly out of date. Deep inside, we sense that more is possible. We long for soulful workplaces, for authenticity, community, passion, and purpose.In this groundbreaking book, the author shows that every time, in the past, when humanity has shifted to a new stage of consciousness, it has achieved extraordinary breakthroughs in collaboration. A new shift in consciousness is currently underway. Could it help us invent a more soulful and purposeful way to run our businesses and nonprofits, schools and hospitals?A few pioneers have already cracked the code and they show us, in practical detail, how it can be done. Leaders, founders, coaches, and consultants will find this work a joyful handbook, full of insights, examples, and inspiring stories.ADVANCE PRAISE\"Congratulations on a spectacular treatise! This is truly pioneering work. In terms of integral sophistication, there is simply nothing like it out there.\"--Ken Wilber, from the Foreword\"The most exciting book I've read in years on organization design and leadership models.\"--Jenny Wade, Ph.D., Author of Changes of Mind\"A book like Reinventing Organizations only comes along once in a decade. Sweeping and brilliant in scope, it is the Good To Great for a more enlightened age. What it reveals about the organizational model of the future is exhilarating and deeply hopeful.\"--Norman Wolfe, Author of The Living Organization\"A comprehensive, highly practical account of the emergent worldview in business. Everything you need to know about building a new paradigm organization!\"--Richard Barrett, Chairman and Founder, Barrett Values Center\"Frederic Laloux has done business people and professionals everywhere a signal service. He has discovered a better future for organizations by describing, in useful detail, the unusual best practices of today.\"--Bill Torbert, Author of Action Inquiry\"As the rate of change escalates exponentially, the old ways of organizing and educating, which were designed for efficiency and repetition, are dying. Frederic Laloux is one of the few management leaders exploring what comes next. It's deeply different.\"--Bill Drayton, Founder, Innovators for the Public",
  "genres": [
    "Business",
    "Management",
    "Leadership",
    "Nonfiction",
    "Entrepreneurship",
    "Psychology",
    "Cultural"
  ],
  "author": "Frederic Laloux",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/20787425-reinventing-organizations"
}