{
  "title": "Always MR. Wrong",
  "description": "Tonight was all about me, Clare Darby, moving on. Well, actually, it was all about my best friend Jess’s cheese and wine party. Her Ladies Circle was raising money for sick children. Or was it animals? I’m not sure which. To be honest I hadn’t taken much notice when Jess invited me. All I could think about was how, although it had been eight months since my divorce, it had been over a year since I’d got myself dressed up, gone out and engaged in adult conversation. For weeks now I had been feeling restless. I couldn’t quite put my finger on why. I had a good job as a midwife at St. Andrews teaching hospital. Twice a week I went to the gym with my girlfriends to Tums and Bums. Afterwards, sweaty and knackered, we would indulge in a couple of glasses of wine and gossip at the bar next door. My finances were in order; I had a wonderful home, a perfect daughter, and a caring family. So what in the world was wrong with me? Then two weeks ago, even though it was the middle of October, my seven-year-old daughter, Olivia, pondered over her Christmas letter to Santa. For a seven-year-old, she is very methodical, a chromosome she has inherited from her father. Unfortunately, her father’s meticulous discipline ceased when it came to fidelity. Before she wrote her letter she made two lists, presents she desperately wanted and presents she would like, but not imperative. Finally, lists cross-checked and narrowed down to one main present and a handful of smaller ones, she asked what I really wanted for Christmas. She would like to add it to her letter. “You never ask Santa for anything, Mummy. What would you really like most?” The answer shone as bright as the star of Bethlehem. I was almost positive as I contemplated my answer the Angel Gabrielle manifested in front of my dining room window, telling me to go forth, and seek, but how could I tell my seven-year-old that what Mummy really wanted was a man. More importantly...to get laid?",
  "genres": [],
  "author": "Joanne Rawson",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/20798259-always-mr-wrong"
}