{
  "title": "The Legend of the Lost Rose",
  "description": "The Legend of the Lost Rose features exciting full touch screen animations, and links to fun merchandise items that make you a part of the story! **Please be advised that all multi-media content in the book is best viewed in Safari.** \"In a time and place apart from our own there is a dying planet governed by the rules of Magick. The mysterious rose perched atop the northernmost mountain is dying with the planet; if it dies, the whole world will fall into darkness. A young frog called Spark spends his days creating beautiful paintings in his cozy underground home. After a while, he can no longer ignore the looming changes coming to his land. With fewer flies to eat each day, Spark musters the courage to open his eyes and see the true nature of the destruction ravaging his beloved planet. Under the watchful eyes of the greedy, dragon-like Apovil creature, Spark decides to seek advice from Iris Buttergrow, the oldest and wisest faery in the land. After the faery Iris Buttergrow reveals the shocking truth behind the impending doom of his planet, Spark embarks on a journey to save the Lost Rose. Spark's crosses vast deserts full of holes and dried seabeds parched by the calamity are just examples of the destruction. On the way he must find the only Magick in the world that can save the planet...the rare blue Pixie Dust. However, Spark's journey isn't just about traveling miles. In fact, the key to the planet's survival is not outside of Spark, but within him. Will he find the hidden strength within himself before it's too late? If he fails, the entire Magickal world will fall into decay and be lost forever. Debut author Daniel L Rappaport releases his first book in The Legend series - children's fantasy stories filled with lovable characters, adventure, and an ever-present struggle for self-acceptance and empathy. \" pazzaria.com **Please be advised that all multi-media content in the book is best viewed in Safari.**",
  "genres": [],
  "author": "Daniel L. Rappaport",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/20793180-the-legend-of-the-lost-rose"
}