{
  "title": "My Bloody Valentine, Vol. 1",
  "description": "Dark romance anthology. Mini Blurbs:Little Red - Tysche Dwai There's something wicked in the woods tonight, and Red's about to find more than she bargained for in Grandma's bed. Butterfly - Decadent Kane The devil's finally caught up with them and Lacey must pay his dues to save the demon she loves. One Way to Say Goodbye - Robin S. Crawford There are many ways to say -goodbye,- but you can only do it once. Last Kiss - D. F. Krieger If you had only hours left with your loved one, would you make them count? No Change in Policy in Room 8 - Torie James In the dark of night, two strangers discover it's not the beast under the bed that needs to be fed but the one on top. The Dark Man - H.K. Sterling What if the world was a simple game of dice or cards? Would you be willing to risk it all for love? Blindfold - Jay Wilburn Hiding from each other and the monsters outside in the world, Tracy and Paul will find out new truths from their game through the wall. Dangerous Desires - Jen Bradlee Writing about dangerous men is one thing. Finding yourself face to face with one, well, that was another matter entirely. Three Little Men - Dianne Hartsock Renting a secluded cabin for Valentine's Day is Billy's idea. One that goes terribly wrong. Awaiting Our Reunion - Christine Morgan A haunting story of patience, perseverance, remembrance, and the tragedy of lovers torn apart. Rhythm and Blues - Brantwijn Serrah At the music festival Ronnie meets her black-magic boy; between heights of ecstasy and terror, he has a proposition to release her from all her sorrows. Tempting Sin - Shelli Rosewarne Sin is designed to be tempting, and sometimes not even an angel can resist. Rebirth with a Rose - Kera Faire These Roses are black. What should I do? Rebirth could be mine, At the expense of you. Invoking Ostara - Lisa A. Adams Macey has trained extensively to complete the sacred ceremony of invoking Ostara, but when madness ensues and threatens her lover, will Ostara hear her pleas? Spider Prince - Iyana Jenna After thinking he was abducted by the monster spider, Ghaelt, Aleich Rhaydyn woke up to something entirely different. Stormy Night in Old Town - Kelly Ryan A freak snowstorm brings Amber into the arms of the man who has haunted her dreams, Damian, or is it something else bringing them together? Aphrodisiac - Roni Sharpe A supernatural predator is drawn to a human female while on his way to a meeting, creating a unique experience for them both. Siren's Call - Shelli Rosewarne When Ciaran meets the mysterious Rae, he is convinced she is his dream woman. But what will he have to do to keep her? Feral - Decadent Kane Is it enough to give up one soul in order to save all of the rest? The Shed - Brantwijn Serrah Rebekah can't sleep—not with the screams and cries of pain coming from her neighbor's shed at night. What dreadful secret can he be hiding? Under the Shadow of Wings - H.K. Sterling Love between Gods and Super-humans can be a dangerous thing.",
  "genres": [
    "Erotica"
  ],
  "author": "Kristen Pavka",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/20799595-my-bloody-valentine-vol-1"
}