{
  "title": "Cevin's Deadly Sin",
  "description": "Cevin’s worst nightmare comes true when he and his mom move to a small Florida town where high fashion is a flannel shirt with the sleeves chopped off, and the only entertainment is the Friday night football games. Cevin wants nothing more than to blend in and get through the year so he can graduate and leave Tilapia forever.When he meets Tessa, an introverted Goth girl, his plans to “not have a life” are forever ruined. She’s friendly to him, and he’s at first suspicious, but her poetic nature draws her to him, and he starts to believe she might be the only one who can accept him for what he is ... if he could just get up the nerve to tell her about his cross-dressing.Cevin, though, has a problem: two of the local bullies have discovered his proclivity for wearing women’s clothing. One of them is Tessa’s brother, who threatens to “out” him if he doesn’t stop seeing his beloved sister. Cevin will do nothing of the kind, and when their bullying escalates, Cevin has to figure out how to survive their viciousness while still seeing Tessa and preserving his own identity -- whatever that is.To add to his problems Cevin has an evangelical mom who thinks he’s doing “that thing the Lord despises” and is determined to set him straight by sending him to gay deprogramming camp. A former biker chick, she found religion after her drunk driving caused a serious motorcycle accident that severed her left hand and killed his sister.A chance meeting with Amy, the school's only outed lesbian, has him joining the rock band Chemical Sandwich that has to get ready for a major competition in just six short weeks. Never mind that Cevin can’t play bass; he’s going to have to learn.When Cevin’s friendship with Tessa develops into something more, he finds someone else who doesn’t fit in and who shares his love of music and poetry as well as his hatred for jocks and bullies. But Tessa has secrets, too. Will her friendship lead Cevin to the fulfillment of his dreams, or to his own demise?",
  "genres": [],
  "author": "Sally Bosco",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/20799064-cevin-s-deadly-sin"
}