{
  "title": "Just Shoot Me",
  "description": "This is book one of a new series called The Cowboy Way, by Becky McGraw, author of the Texas Trouble series. The series is a spinoff from her novella Hope for Christmas, which was included in the anthology SANTA WORE SPURS and is still available on Amazon.com. The Cowboy Way series is a little funnier, a lot hotter and somewhat more intimate without the action/suspense that is included in her bestselling Texas Trouble series.  *******JUST SHOOT ME (#1, Cowboy Way)******* Tina Montgomery needs to find her Texas Tomcat. Her promotion and livelihood depend on it. That promotion could mean a new life for her, her sister and her niece. It's a big risk however, because if she fails in her bid to head up a new menswear line at her company, she could lose everything. That's why finding the perfect model to represent the line has become her sole focus. At the point of thinking she would never find that man, one with both experience and attitude that shows in his face and eyes, she meets Dean Dixon. His gorgeous eyes tell a story she definitely wants to hear and the man has more attitude than any she’s ever met. Physically he's perfect for the job. But that attitude she thought she wanted in her cowboy quickly becomes her biggest downfall when she tries to convince the sexy, but hard-hearted rancher to help her.  Dean Dixon is done with women. His cheating ex-wife has shown him just how untrustworthy women are. He has a ranch to run, and a son who might not be his to raise alone. That's more than enough for any man to handle without dealing with his sister-in-law’s friend who is determined to convince him to model for her company. He has seen what that industry has done to his brother. Dean is a rancher, not a model, and he isn't about to abandon his family or fall into the same trap his brother had. He stands his ground, until his sister-in-law tells him why Tina needs the promotion she’s wanting so badly, and asks for his help. Hope had bailed him and his family out when they needed her the year prior. How could he refuse to help her now?",
  "genres": [
    "Romance",
    "Westerns",
    "Contemporary Romance",
    "Western Romance"
  ],
  "author": "Becky McGraw",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/20799709-just-shoot-me"
}