{
  "title": "A Complete \"How To\" Guide for Rookie Writers",
  "description": "Author Robin Murphy writes a very practical, hands-on and user-friendly book to enable a new writer to learn how to get their newly created work produced and available to readers. Many books and blog posts tell you to go this link, or to that website, but what happens once you get there? While the rookie writer has many concerns and fears about publishing their first book, there are great details concerning: editing, rewrites, cover letters, as well as self-publishing. A Complete 'How To' Guide For Rookie Writers provides excellent information including diagrams and snapshots of images for a clearer, more practical way to enable the reader to see how to perform the process described. This book gives the new writer a definite jump-start and breaks the big picture down into bite size pieces which can be better understood and managed. There are many websites included that provide additional information for the reader to get their material published, as well as tools for product promotion. The reader will quickly learn it isn't enough to write the book. After the book is written, there is another great adventure of promoting and getting the book out there for people to purchase. A book won't just land in a person's hand without some work, so this guide helps the new author to learn how to better promote their book to make sure this happens. There are great details outlining additional social media sites to make the book more widely known. It also describes how to produce your own book trailer to draw a larger crowd toward your work. This is a very easy read with wonderful pictures to lead the reader into a greater understanding of what the author is trying to portray in print. If a reader wants to make quick work of getting their book ready for publication, this would be a very insightful, well organized, and enjoyable book to read.",
  "genres": [
    "Writing"
  ],
  "author": "Robin  Murphy",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/20808721-a-complete-how-to-guide-for-rookie-writers"
}