{
  "title": "Good Girl",
  "description": "Librarian's note: Alternate cover/revised 3rd edition for ASIN: B00B3V6Q2G.  Good Girl, Blended #1  There aren’t many options for a girl who falls in the middle. I wasn’t an athlete or a geek. I wasn’t an artist or a musician. I didn’t shake my pom-poms along with my ass. I was just a good girl, who got good grades, and kept her mouth shut. I didn’t date my high school sweetheart and promptly get married the second I was handed my diploma. I’m not shiny enough to attract notice, nor dark enough to be a problem.  I don’t have a tragic sob story. My daddy didn’t leave us destitute, and I’m not a victim of a bad neighborhood. I am a middle-America, middle of the road, middle class girl with both parents fussing over their youngest daughter, who has no aspirations or goals. I’ve had every opportunity to succeed- supportive parents, stability, and a strong upbringing. I’m wayward and everyone looks at me like I’m an alien.  My philosophy: how should I know what I want to do with the rest of my life the day I graduate? How am I supposed to know the second I turn eighteen what I am destined to become? One moment you are a disillusioned seventeen year old with the world at your fingertips, and the next, congratulations, you’re eighteen and you’re on your own.  Publisher's notice: This 'revamped' third edition of Good Girl is different than the original. Expanded to twice the length, 220,000 words: new premise, new series title, new genre, and new story threads. If you purchased a copy of Good Girl prior to February 2014, you do NOT have to repurchase to get the new edition. Please update your Kindle copy. If unsure how to update Good Girl, please refer to Amazon's help section.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "New Adult",
    "Erotic Romance",
    "M M Romance",
    "Contemporary Romance"
  ],
  "author": "Erica Chilson",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/20809516-good-girl"
}