{
  "title": "Breakaway",
  "description": "Party with your favorite New Adult authors as they celebrate Spring Break with a collection of 13 scorching hot novellas and short stories.Confessions by Jay McLean: A flat tire and a twist of fate bring them together, but it's their pasts and their confessions that keep them there.Spider on a Plane by Ilsa Madden-Mills: When lead guitarist for Vital Rejects boards his plane, he’s assigned to sit next to the most famous, goody-goody in New York. He hits on her; she snubs him. The plane lands, but their journey is far from over…Bunsen Burner Bingo by Penny Reid: Katy Parker likes being the invisible girl almost as much as she obsesses over the campus golden boy, Martin Sandeke. But when she inadvertently overhears a nefarious plot about Martin, she'll have to overcome her fears and summon the courage to be seen.To Steal a Kiss by Pam Godwin: When petty thief, Addy Goldner, is caught with her hands in the pockets of a dark-eyed college boy on spring break, will he turn her in or punish her by stealing something for himself?Ricochet by Missy Johnson: He wasn't supposed to be anything more than a one-nighter to ease my broken heart...he also wasn't supposed to be my best friend's younger brother.Claiming Freedom by Dawn Robertson: Greyson Scott is exactly what Stella Lewis needs for a Spring Break to remember. But when the vacation is over and real life returns, she's shocked to learn he's one fling she can't seem to forget.Color Me Bad by Linda Barlow: Fleeing a dude with a shotgun, Rory McKay seeks help from bad boy townie, Griff O'Malley, only to learn that Griff may have murdered his last girlfriend.Invaluable by Alana Albertson: For Kyle Lawson, former NFL star turned Navy SEAL, a hot one night stand with a USO cheerleader ends in an early morning rescue mission. He will never win MVP, never get the Super Bowl ring, but some heroes don't play games.Bling Ring in Mexico by Carly Carson: When spring break fun turns into crime, Susanna must choose between chasing bling and chasing a hot dolphin trainer. But straight-arrow Joaquin has no intention of being the boy toy of his flighty classmate. Too bad lust has such a good grip on him.Contacts by Farrah Farside: Brooke thinks she's got the best she can get in Liam, but those closest to Brooke make her face the harsh truth: she's Liam's secret after-hours screw.Unbreakable by Nicole Blanchard: Stranded with her ex-boyfriend on an island during a storm, Rue Lawrence will either resist temptation...or surrender to it.Rained In by Cherie Blakeley: Stuck dog-sitting for her boss, Kiera Vane’s spring break plans are looking bleak. When a handsome stranger appears she panics, but soon discovers he’s the least of her worries.In a Daze by M-E Girard: Martie receives an invitation to a women-only evening from Daze, the girl she’s been obsessing over in class. She lands in a throwback to the ’50 butch-femme scene, and if Daze is the femme, then Martie better man up—and fast.",
  "genres": [
    "Anthologies",
    "New Adult",
    "Romance",
    "Contemporary",
    "Short Stories",
    "Novella",
    "Contemporary Romance"
  ],
  "author": "Ilsa Madden-Mills",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/20805592-breakaway"
}