{
  "title": "No, No, No, No, No, Yes. Insights From a Creative Journey",
  "description": "No. It is a word that every CEO, entrepreneur and creative professional has confronted. It is a word that both novices and seasoned professionals dread. It is a word that can easily seem like death to a dream.And yet it is also a word that can point in the right direction. It is a word that motivates us to do something differently, try something else, get better, innovate, keep going. No is a word that looms over every business person's, innovator's, and artist's life. And yet the word is universally met with trepidation and fear because the value of being told No is so little understood.In No, No, No, No, No, Yes. Insights From A Creative Journey, award winning creator of visionary ad campaigns (Cannes Lions, Clios); ad exec (the Shalmor Avnon Amichay/Y&R agency); cartoonist (The New Yorker); speaker (TEDx); and teacher (School of Visual Arts) Gideon Amichay demonstrates that No is not a barrier to success it s a facilitator. No is not the end, but rather an essential tool for direction, motivation and innovation.Based on Amichay s best-selling book in Israel (published by Gordon Books in 2011) and 2013 TEDx talk of the same name, No, No, No, No, No, Yes takes the reader on an illustrated journey of the author s own lifetime confrontation, negotiation and relationship with No . Walking the reader through critical No s in his own 25 year career pitching cartoons to the New Yorker, risky ad campaign concepts as head of one of Israel s biggest ad agencies, impossible outdoor ad installations -- Amichay reveals the wisdom that No rarely ends with an exclamation point.Rather, Amichay demonstrates that No usually ends with a comma:No comma, we don't have the time . No comma, we don't have the budget . No comma, can we see another option ? By discovering which No comma he was confronting, Amichay shows how No s in fact led him to eventual Yes s -- including the waiting, the rejections, and the revisions and demonstrates that No, forces us to reexamine, to explore, to rethink, to change directions, to get better.In No, No, No, No, No, Yes Amichay shares the essential revelation that sometimes No can be the best answer to get.Through illuminating anecdotes from his own illustrious career running the gamut between business and the arts, Gideon Amichay demonstrates unequivocally that No's, whether from colleagues, from clients, from life, or from within have great power, and are simply directions on the map to Yes.Authoritative, funny, whimsical, wise, and pragmatic, No, No, No, No, No, Yes. Insights From A Creative Journey is the essential companion for every executive, innovator and artist to navigate the unavoidable odyssey of No in order to find the eventual Yes.",
  "genres": [
    "Business",
    "Amazon",
    "Nonfiction",
    "Self Help"
  ],
  "author": "Gideon Amichay",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/20806694-no-no-no-no-no-yes-insights-from-a-creative-journey"
}