{
  "title": "Charlie's Secret: Inspired by a true story",
  "description": "After years of torture, a mentally and physically abused daughter finally stands up to her abusers, her own mother and brother, in an attempt to save her life at the risk of losing the only family she's ever known.Inspired by a true story of abuseAs a little girl, Sam had no idea that her life was different than anyone else's. Her days consisted of playing in a nearby pond, banished to the forest until supper by her mother. Thankfully, she wasn't alone out in the woods... her brother, Charlie, was always there to guide and protect her from anything that may bring harm -- however, who was going to protect her from him?Now a teenager, the bruises from Charlie are becoming harder to hide. Camouflaging them behind hairstyles and long-sleeved shirts aren't enough anymore, and Sam can feel the burn of the teacher's eyes as they struggle to figure out what's happening behind closed doors. Torn between two realities, she's terrified of what would happen if someone found out what Charlie's angry outbursts look like, and terrified of what will happen if they don't.After a momentary lapse in judgment, Sam waits for her punishment from her brother. Bolting to her room and slamming the door behind her, she struggles to twist the tiny lock on the knob with sweaty hands. Crawling backwards on her palms and feet, she slides under the bed, curled up in the darkness. The position brings fear, as she knows all-too-well what's coming. Staring at the crack in the door, she listens to the wood floor creak underneath his 200lb body while he inches closer, taunting her. Charlie’s fist bangs on the wood breaking the silence; each pound separates it slightly more from the frame, and she’s praying that it can withstand him for just a few more moments. Closing her eyes and waiting to feel the warmth of his hands around her throat, she comes to a haunting realization ... this might be the end.The sequel, Sam’s Truth, is now available in the kindle store You can order it Check out C.L. Heckman's website for more info on release dates and giveaways www.clheckman.com",
  "genres": [
    "Nonfiction",
    "Abuse",
    "True Crime",
    "Drama"
  ],
  "author": "C.L.  Heckman",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/20809983-charlie-s-secret"
}