{
  "title": "Breaking Beauty: Devils Aces MC",
  "description": "What do you do when the cards are stacked against you, and the only person you can trust is a hot biker covered in tattoos and dripping with attitude? After escaping a childhood that would have broken most people, Romy Adelaide trusts no one. Her fierce self-reliance has earned her a university scholarship and a Las Vegas casino job with benefits. She's going to make it on her own, and she won't owe a single person for her success. Enticed by the casino's offer of a new job in the VIP room, Romy follows the money into a secret, high-roller's world. Too late, she realizes she just sold herself to a mafia boss and his sleazy, rich clientele. Now, the gorgeous guy sitting at her blackjack table--covered in ink and biker leather--may be the only one who can save her. Bryson Vaughn earned his gritty business sense on the streets of Las Vegas, running with the Devils Aces MC. Now, he wants out of the underground. But his infatuation with the fiery Romy will drive him deeper than he's ever been. He doesn't date complicated girls. He doesn't really date at all. He's Bryson Vaughn, of the Devils Aces: women come his way freely, and he loves them in equal measure the way he loves bodies in general. But there is something about Romy Adelaide, the blackjack dealer at The Windsor. He wants her for longer than a single night. He wants to smell her and taste her and lick her and tease her through mornings and afternoons and evenings uncountable, because something about her face says he’ll never be bored with a woman like her. And so, Bryson Vaughn pledges to topple The Windsor, to save beautiful Romy Adelaide from all her tortures...and then he wants to have her, and then he wants to keep her. This contemporary biker romance contains graphic sexual content, violence, and strong language. It is intended for mature readers. Breaking Beauty is a complete standalone novel in the Vegas Titans Biker romance series. No cliffhanger.",
  "genres": [
    "Motorcycle",
    "Abuse",
    "Contemporary Romance",
    "Romance",
    "Adult",
    "Suspense",
    "Erotica"
  ],
  "author": "Celia Loren",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/20809862-breaking-beauty"
}