{
  "title": "Zenith",
  "description": "What if you could change history?What if someone else already had?\nGrounded after a rescue attempt in Earth orbit goes bad, Commander Martin Atkins of the Confederation Navy is approached by the Interscission Project, a consortium of civilian corporations on the verge of perfecting the technology to travel to another star. Despite his misgivings, the chance to get back in the pilot’s seat is too much to pass up, and he convinces his best friend and crewmate, Charles Davenport, to leave the military temporarily and join him as part of the crew of the Zenith, humanity’s first starship.Edward Harlen is a brilliant young engineer, and a key player in the construction of the Zenith to take advantage of the untested technology of foldspace drive. But Edward has his own agenda in joining the project, and a bitterly personal score to settle with his boss, Trevor Sutton, a vendetta of which Trevor is entirely ignorant. When Edward’s sister Stella enters the picture and manages to secure a position on the project, all of Edward’s careful plotting is upset, and she might spell the downfall not only of his plans for revenge, but of the entire Zenith mission.The spark of attraction between Edward and Martin is a complication that Edward can’t afford, but of which he can’t let go. For Edward knows the secret at the heart of the Interscission Project, the hidden potential of the technology that in the wrong hands could become the ultimate assassin’s weapon: the ability to rewrite history, not just once, but many times. As an unseen enemy moves to destroy them, and the body count multiplies in their wake, Martin and Edward must choose whether they will allow the possibility of love to challenge their destinies, or will they instead take up arms in a war to control the most ancient and terrible power in the universe.Time, itself.",
  "genres": [
    "Science Fiction",
    "M M Romance",
    "Time Travel",
    "Audiobook",
    "Romance",
    "Futuristic",
    "LGBT"
  ],
  "author": "Arshad Ahsanuddin",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/20807162-zenith"
}