{
  "title": "Wedded Bliss: Being the Fantasy of Kat McKinney, Wedding Slut",
  "description": "Meet Kat McKinney, Wedding Slut.  She doesn't want to get married. She just wants a wedding.  And to make love to her husband — whoever he is — on the altar.  And to have an orgy to end all orgies at the reception.  And...  Let Kat tell    I don’t really want to get married. I just want to have a wedding.  Marriages are about taxes and compromise, a sleepy march towards death or divorce.  Weddings, on the other hand, are parties so huge that other, smaller, parties orbit them. Think about the engagement party, bridal shower, bachelor party, bachelorette party, and rehearsal dinner. Around the wedding sun there are five party planets, each of them centered on sex, and smaller event moons; dress fittings, cake tasting, flower choosing, present buying, present opening, getting dressed for the wedding, getting undressed after the wedding, making toasts, hooking up. Every moment a small celebration of love and life, friendship and family, beauty of all kinds, rejoicing in the senses. The look and feel of the dress, the scent and color of the flowers, the lush taste of food and drinks, a reason to see friends and family you haven’t seen for ages.  And, hell, that’s not even counting anniversary parties.  Why should this amount of joy and sensual delight be tied to such an outdated bummer of a concept like marriage? Shouldn’t everyone be able to have a party this massive? Even people who don’t want to get married?  I understand, in a way, how and why weddings have been linked with marriages historically. But in a world where marriage is, at best, a fifty-fifty shot at lifelong companionships and tax breaks, why would that be linked with a once-in-a-lifetime party of epic proportions?  Marriages are about compromise; weddings are about the perfect spouse, the perfect day, the perfect dress. Marriages are about the dead-end of your sex life. Weddings are nothing but sex and burgeoning potential. It’s normally considered uncouth to reach up your girlfriend’s dress, remove her undergarment and throw it into a crowd, but at a wedding it’s required! And throwing it makes some kind of prediction about who else is going to get laid that night!  We should all be able to run through a corridor of our friends holding sparklers on our way to go have sex. There is never another time in your life when people will be that celebratory about the fact that someone else is getting laid.  (Multiple partners. For mature audiences only)",
  "genres": [],
  "author": "Mary Cyn",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/20806293-wedded-bliss"
}