{
  "title": "His Dakota Bride",
  "description": "**From NEW YORK TIMES and USA TODAY Bestselling Author Lisa Mondello**The story of the South Dakota McKinnon clan continues in HIS DAKOTA BRIDE, book 5 of DAKOTA HEARTS.Her heart had always belonged to Wade McKinnon...When single mother, Skylar Barnett, came to South Dakota, she thought her life was just beginning. Newly pregnant, she waited for the love of her life, Wade McKinnon, to join her so they could start their life near his family. But her joy quickly shattered after learning Wade was presumed killed during a tsunami that hit the small Asian island they'd both worked on in the Peace Corp. She'd spent the last four years making peace with her decision to marry a man she didn't love so her baby would have a father. But marrying the wrong man when her heart belonged to Wade was the biggest mistake of her life.Secrets and circumstance kept them apart...No one in Wade McKinnon's life knew that his work with the Peace Corp. was just a cover for his real job in a secret military agency. Not even Skylar, the woman he'd fallen hard for the moment he'd laid eyes on her. But when his mission in Asia suddenly became too dangerous and all agents in the field were ordered to disappear, using the tragic events of the tsunami on the island where they'd met seemed like the only way to keep Skylar and their unborn baby safe until the situation cooled down. As much as it killed him, Wade stepped aside when he learned Skylar had moved on with another man. But now that she's free, he's determined to do everything he can to win back her love and claim the life they'd dreamed of sharing.The Dakota Hearts series HER DAKOTA MAN book 1BADLAND BRIDE book 2DAKOTA HEAT book 3WILD DAKOTA HEART book 4HIS DAKOTA BRIDE book 5DAKOTA WEDDING book 6 (later in 2014)",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Novella"
  ],
  "author": "Lisa Mondello",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/20814994-his-dakota-bride"
}