{
  "title": "The Barefoot Journal Guide to Saving $1000s on Air Tickets: How to travel more for less, get the best seats and enjoy your journey",
  "description": "How to get the best seats, save money on flights and enjoy your journey Do you want to travel but are unsure of how you can score cheap flights?Do you know when the best time is to buy your ticket?Do you know how to get the best seats on the plane without breaking the bank? Learn the rules of the airline game Cheap flights, the best seats, upgrades and - it's all a game. Airlines profit from this game because 90% of their customers don't know the rules. For example, people waste money on airline loyalty schemes that don't work or \"discount tickets\" you can get cheaper elsewhere. They also follow hacks that encourage them to spend thousands on their credit card just to get a \"free\" flight. It's seductive but you end up wasting time and money. There is a better way.If, if you know the rules of the game you, too, can profit. I collected over a million air miles in the last 10 years of flying and learning the rules of the game. I've flown everything from $5 seats all the way up to luxury first class cabins. I'm going to share my experience and advice in this guide with you so you can avoid costly travel mistakes. The Barefoot Journal Guide to Air Travel will teach you the rules of the travel game. That means getting the best seats, finding better flights and saving $1000s on tickets. What will you learn in ‘The Barefoot Journal Guide to Air Travel’? Here are some of the tricks featured in the Guide:Cheap Round the World Tickets Don’t waste your money on overpriced Round the World tickets; instead apply savvy research skills to put together your own ticket at a fraction of the choice!Build an Exciting Itinerary Within Your Budget Don’t leave it up to the travel agent, they don’t have all the information you can access and want to scalp you for the most money. Instead, use the recommended tools to put together a cost effective itinerary, avoiding expensive airlines and airports, exploiting irregularities in airline pricing for the cheapest deals.Get the Best Seat Which seats are the best? Which seats have the most legroom in your plane? How can you avoid the lemon seats (seats with limited recline, restricted space in the seat well, seats too near the bathrooms, noisy seats etc)? A little planning and knowledge of the layout of different planes helps.Avoid Unnecessary Baggage Fees How can you play airlines at their own game with baggage allowances? How much can you carry on your person and what type of clothing allows you to max your personal allowance without incurring airline fees?Where to Stay at the Airport So you may have a long layover at the airport, what do you do? Don’t fall into the trap of traipsing around the stores all day. Instead, find out about lounges that you can get access to even without flying business class. Find out about little known airport transit hotels. Find out about which airports have their own rest and sleeping areas. And more! Save $$$s and time on air travel with this short Guide. Hit the Buy button now!",
  "genres": [
    "Travel",
    "Nonfiction"
  ],
  "author": "Graham   Brown",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/20812551-the-barefoot-journal-guide-to-saving-1000s-on-air-tickets"
}