{
  "title": "The Ride",
  "description": "*NEWLY EDITED & REVISED*TankIt had always been about the ride. My love for the ride is what fuels me. It’s what drives me. That freedom of the open road in front of you with not a damn thing holding you back is what I crave. I don’t need much, shit I don’t want much out of life. My bike, my club, my brothers, my money, and occasionally a warm and willing women in my bed is what I need. I liked my life that way. It works for me. I enjoyed the familiarity of it. But slowly things were changing. I can feel that change in the air. It's everywhere. There comes a point in your life where things just change. No matter how much I fight it. No matter how hard I hang on, it's changing. Whether by choice or not. For better or worse it gets turned upside down on its fucking head. The moment I laid eyes on her shit changed forever. Things were on their way to changing, but fuck if she didn't tip that shit right over. She hit me like a blow to the chest crippling me. Rocking my world. That girl completely blew everything I thought I wanted to shit. She took me on a wild ride and for better or worse she changed everything for me.LilThe loud rumble of pipes fills me with a sense of home. Deep gruff male voices remind me of nights spent sitting at the bar listening to the guys tell me stories. The smell of leather, grease, and smoke brings back memories of hot summer days spent around the compound. The sound of classic rock makes me want to dance. A group of rough and mean men makes me smile. Seeing a beautifully crafted bike makes my heart beat a little faster. A man in leather always makes me hot. The feel of the vibration through my body from a perfectly tuned bike takes me right back to my old life. Some things never change. Sometimes those things are never meant to change. Although much hadn't changed since I left, a few things had. The loss of loved ones, the addition of new ones. With one new addition to life things changed for me forever. My life will never be the same. He changed it all. 92,000 plus words",
  "genres": [
    "Romance",
    "Contemporary",
    "Erotica",
    "Contemporary Romance",
    "Motorcycle",
    "Suspense",
    "Romantic Suspense"
  ],
  "author": "Jaci J.",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/20816387-the-ride"
}