{
  "title": "Sutton Capital Series Boxed Set #1-3",
  "description": "Fall in love with the Sutton Capital Series and get caught up in time for the next book coming this year!Legal EaseKelly Bradley is convinced she doesn't need to worry about falling in love when she comes up with her plan to marry Jack Sutton. She's dated so many great guys over the years, but hasn't fallen in love once. Not with any of them. It just isn't in the cards for her. So, when she approaches powerful, sexy Jack Sutton and proposes a temporary marriage-of-convenience, she's not one bit concerned that her heart will be on the line.Jack Sutton is used to having control over things, having things go his way. Things in his life aren't supposed to spin out of control. But Kelly Bradley flips his world upside-down and has him wanting more than he'd ever thought he would have. And, just when he realizes he wants a real marriage with Kelly, Jack finds himself racing to save the woman he loves.Before Jack and Kelly know it, not only are their hearts on the line, but Kelly's life is, too.Penalty Clause Andrew Weston and Jill Walsh had to be the two most unlikely people to fall in love. When Jill's first husband's love for her simply fizzled and died, Jill knew she'd never trust that love could last again. After Andrew's first love betrayed him in the most brutal way possible, he knew he might fall in love again someday, but there was no way he'd ever make himself vulnerable again by confessing those feelings if he did.Fate had a different ending in mind for these two, though, and when Andrew discovers his love for Jill, he knows the only way to get her to stay with him forever is to offer her an iron clad penalty clause in a prenuptial agreement. He stays with her forever or he loses everything he owns. The millions he's worked for, his property, his cars, everything. Now he just needs to hope that's enough to hold onto Jill forever.The Baker's BodyguardJesse Bradley never thought she'd need help going out into the world. But, after her sister was kidnapped, she began to have trouble going anyplace alone. An anxiety attack would start if a stranger asked her what time it was. Before she knew it, she as making up excuses to stay inside. Where things were safe.Zach Harris was going to change all that. The steamy, sexy bodyguard got her into counseling to help her overcome her fears. He went with her everywhere helping her learn to feel safe again.Jesse and Zach both feel the insane chemistry sparking between them. But will there be more than just chemistry for these two? Negotiation TacticsJennie and chad face love, adventure, and a lot more danger than they bargained for in this heart wrenching story of second chances. Jennie Evans' heart broke when she lost her high school sweetheart and husband just after college graduation and she has no interest in trying to heal it. She's built a good life with friends she loves and a job she can finally feel proud of. Chad Thompson couldn't be more different than Jennie. He wants love. He wants the whole deal: marriage, children, and forever with the woman he loves. It's just too bad that the woman he loves can't give her heart to him. When Jennie and Chad's friends scheme to bring them together, she lands in trouble and turns to the only man who's ever made her forget her husband, the one man she wants to avoid. Chad knows he can keep Jennie safe, but can he protect his heart in the process?",
  "genres": [
    "Romance",
    "Amazon",
    "Contemporary",
    "Anthologies",
    "Own",
    "Suspense",
    "Collections"
  ],
  "author": "Lori Ryan",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/20814849-sutton-capital-series-boxed-set-1-3"
}