{
  "title": "Gratitude and Trust: Six Affirmations That Will Change Your Life",
  "description": "Paul Williams is an alcoholic.Tracey Jackson is not.But together, these two close friends have written Gratitude and Trust , a book designed to apply the principles of the recovery movement to the countless people who are not addicts but nevertheless need effective help with their difficulties and pain.Williams, the award-winning songwriter, actor, and performer, has embraced a traditional alcoholism recovery plan for more than two decades of sobriety. Jackson, a well-known TV and film writer—and veteran of many years of traditional therapy—has never been a drunk or a drug abuser, but she realized that many of the tenets of Williams’s program could apply to her. In Gratitude and Trust , Williams and Jackson ask: What happens to those who struggle with vexing problems yet are not full-blown addicts? Are there any lessons to be learned from the foundational and time-tested principles of the recovery movement?Whether you’re tethered to your phone or you turn to food for comfort; whether you’re a perfectionist and can’t let things go or are too afraid to fail to even try; whether you can find intimacy only on the Internet or you’ve been involved in a string of nasty relationships—the first step toward feeling better about yourself and your life is the realization that you are what’s standing in your way. Williams and Jackson have designed a new, positive program, based on a half-dozen new affirmations, that can help conquer your vices, address personal dysfunction, and start to brighten the darkest moods. Gratitude and Trust is an essential, inspirational, and uplifting guide to identifying and changing maladaptive behaviors in order to uncover your most productive, healthiest self.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Psychology",
    "Personal Development"
  ],
  "author": "Paul       Williams",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/20821133-gratitude-and-trust"
}