{
  "title": "Under His Doctor's Supervision",
  "description": "Student athlete Aidan gets a college scholarship offer of a full ride to his top choice school, but it's conditional on a successful physical and drug test. The doctor he chooses turns out to be a gorgeous, roguish Scottish doctor eager to examine the inexperienced young student. The physical leaves Aidan wanting more, so when he gets called back for additional drug tests, it seems like the perfect opportunity to get a little help giving the appropriate samples!  Warning: This short story contains scenes of an explicit nature between consenting adults and is intended only for an 18+ audience.  Approximate length: 5,500 words, or 22 pages.  Excerpt:  After he drove into the city, Aidan waited much more patiently in the waiting room this time. He knew what to expect this time, at least, so he wasn't quite as nervous. Still, there was the very real possibility he would get in trouble for his poor results on the drug tests, even though he knew he couldn't possibly have been exposed to anything. This couldn't stop his chance at a promising university athletics career, could it?  His thoughts were interrupted as Rick led him into an examination room once more. “Dr. McDonald will be right with you.”  Sure enough, seconds later, the doctor entered and smiled at him in that charming way. “Hello, Aidan. Good to see you again.”  “Hi, Dr. McDonald. Thanks for seeing me on such short notice.”  Dr. McDonald shrugged. “Ah, whatever I can do to help. They've given me trouble over athletes and this kind of thing before, so I expected it.” He settled into the rolling chair and wheeled it closer. “But first, I need you to be very straightforward with me. Have you used any drugs within the last few months, including supplements, multivitamins, herbal remedies, prescription medication – anything?”  “No,” Aidan answered and tried to show the honesty of his response in his face. “I really haven't. Not even a damn multivitamin.”  Dr. McDonald nodded and smiled again, straightening up. “Okay,” he said simply. “I believe you. So I'll do a complete panel. Blood, saliva, semen, hair – everything I didn't do last time. I probably got a false positive from the urine test last time, but there's no way they can doubt you if I do it all this time.”  “Semen?” Aidan echoed, certainly surprised by the news. He'd undergone testing before, but not that particular kind. He'd never even heard of it. “And hair?”  “Drug testing is rapidly advancing,” Dr. McDonald told him. “It's not standard, but there are a few tests. More than that, I want to cover all the bases so they don't come back asking for more. Get it all done at once.”",
  "genres": [],
  "author": "E.  Davies",
  "average_rating": "3.13",
  "url": "https://www.goodreads.com/book/show/20817344-under-his-doctor-s-supervision"
}