{
  "title": "Karate Stupid: A True Story of Survival",
  "description": "The Japanese Instructors’ Course is infamous in the Karate world. In 1997 it had been running for 50 years, with less than one hundred people successfully completing it – only four of which had been non-Japanese. In the same year Scott Langley was at the top of his game, a third degree black belt, captain of the British JKS National Team and JKS European and World Champion. He moved to Japan with a secret plan – to be the fifth foreigner to complete the course. This is the true story of Scott’s Journey, spanning five years, chronicling the highs and lows of facing karate’s toughest challenge and how he learnt to survive and never give in.In Autumn 2013 Scott sent this book to his Sensei in Japan for their approval. They responded immediately declaring the book to be full of lies and misrepresentations of Japan and forbade him to publish it. He was suspended for a month and then affectively expelled in January 2014. Suddenly, his 30 year relationship with Japanese karate had abruptly come to an end. This had been major a part of his entire karate life and he had dedicated himself to its values and rules, running a karate organization in Ireland for over ten years. He never wanted to jeopardize his position or damage the reputation of the group. However, unfortunately, the sacrifices he made during this true story are nothing compared to the sacrifices he has had to make to publish it.About the AuthorScott Langley began karate in 1985. Showing a rare combination of aptitude, dedication and love of the art, Scott rose through the grades at a steady rate. In 1991 he gained his black belt. However, this was just the beginning. He quickly began winning national competitions and in 1993 was selected for the Japan Karate Shotorenmei national team. While at university he trained daily at his university club and under the guidance of Sadashige Kato 8th Dan. By the time Scott graduated, he was a 3rd Dan and had become one of the youngest people to win the JKS World Championships. But this was just the foundation of what lay ahead. In 1997 Scott moved to Japan to train full time at the World Headquarters. In 2000 he was invited to enter the elusive instructors’ course and after two years of intensive training, graduated, becoming only the fifth westerner to complete the challenge. He moved to Ireland with a mandate to promote the JKS within the British Isles. Within a decade Scott’s group had become the biggest single style association in the UK and Ireland and was as big at the JKS in Japan. He now teaches fulltime at www.hombudojokarate.com",
  "genres": [
    "Martial Arts"
  ],
  "author": "Scott Langley",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/20818177-karate-stupid"
}