{
  "title": "Reckless: The Racehorse Who Became a Marine Corps Hero",
  "description": "\"Tom Clavin's Reckless reads like a wonderful and inspiring combination of Laura Hillenbrand's Seabiscuit and Unbroken .\"—Nelson DeMille, #1 New York Times Bestselling AuthorFrom the racetracks of Seoul to the battlegrounds of the Korean War, Reckless was a horse whose strength, tenacity, and relentless spirit made her a hero amongst a regiment of U.S. Marines fighting for their lives on the front lines.Her Korean name was Ah-Chim-Hai—Flame-of-the-Morning. A four-year-old chestnut-colored Mongolian racehorse with a white blaze down her face and three white stockings, she once amazed the crowds in Seoul with her remarkable speed. But when war shut down the tracks, the star racer was soon sold to an American Marine and trained to carry heavy loads of artillery shells up and down steep hills under a barrage of bullets and bombs. The Marines renamed her Reckless.Reckless soon proved fearless under fire, boldly marching alone through the fiery gauntlet, exposed to explosions and shrapnel. For months, her drive and determination kept the Marines’ guns blazing, while inspiring them with her singular charm. During one day of battle alone, she made fifty-one trips up and down a crucial hill, covering at least thirty-five miles in the heat of combat. On some of her uphill treks, Reckless shielded human reinforcements. The Chinese, soon discovering the unique bravery of this magnificent animal, made a special effort to kill her. But Reckless never slowed. As months passed and the enemy grew bolder, the men came to appreciate her not just as a horse but as a weapon, and eventually, as a fellow Marine.In Reckless , Tom Clavin, New York Times bestselling coauthor of The Heart of Everything That Is , tells the unlikely story of a racehorse who truly became a war hero, beloved by the Marine Corps and decorated for bravery. A moving reminder of the unbreakable bond between people and animals, Reckless is a powerful tale of courage, survival, and even love in the face of overwhelming odds.",
  "genres": [
    "Nonfiction",
    "History",
    "Horses",
    "Animals",
    "Historical",
    "Sports",
    "War"
  ],
  "author": "Tom Clavin",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/20821059-reckless"
}