{
  "title": "The Book Lovers' Anthology: A Compendium of Writing about Books, Readers and Libraries",
  "description": "A blessed companion is a book—a book that, fitly chosen, is a lifelong friend.”—Douglas William Jerrold “Much reading is like much eating, wholly useless without digestion.”—Robert South “If I had read as much as other men, I should have been as ignorant as they.” —Thomas Hobbes  Can books corrupt? Do badly written books sharpen or dull the minds of their readers? Ought we to take seriously the old saw that excessive reading can damage one’s sight? The Book Lovers’ Anthology offers answers to these questions and many more with a remarkable collection of reflections on books, readers, and libraries— by writers whose books are among the world’s best known and best loved.Throughout the centuries, books have been a source of fascination— and sometimes frustration—for writers. Between the covers of the Anthology are excerpts from the novels of Jane Austen, George Eliot, and Jonathan Swift, among many others, all of whom paused in their fiction to extol the virtues of the written page. Those who are taken with the smell of books will find a like mind in Charles Dickens, who waxed poetic about the “pleasant smell of paper freshly pressed.” Very avid readers might even nod in knowing agreement with John Donne, who declared, “I shall die reading.” Other poets whose musings on libraries or books are excerpted for the Anthology include Shakespeare, Wordsworth, Milton, and Chaucer. These writings are interspersed by the meditations of essayists and diarists of centuries past—among them, Samuel Johnson, James Boswell, John Ruskin, and Michel de Montaigne.With contributions from major writers across ages and genres, this is an essential anthology for which any bibliophile will want to find space on the shelf.",
  "genres": [
    "Books About Books",
    "Nonfiction",
    "Anthologies",
    "Classics",
    "Reference",
    "Writing"
  ],
  "author": "Bodleian Library",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/20820565-the-book-lovers-anthology"
}