{
  "title": "Rogues & Patriots: A Nick Crane Thriller",
  "description": "In the Depths of Corruption…\n\n\n\nIn the Face of Tyranny…\n\n\n\nOne Man's Quest Begins…\n\n\n\nGet ready for a heart-pounding ride through the dark underbelly of America in Patrick H. Moore’s latest thriller, Rogues & Patriots.\nAs the second installment in Moore’s gripping trilogy, this book plunges readers into the dangerous world of veteran LA PI Nick Crane. Locked in a life-or-death struggle with the ruthless Miles Amsterdam and his cabal of aristocratic \"super patriots,\" Crane must navigate a treacherous landscape where power and ideology collide.Eight years after he and his team liquidated Frank Constantine, a murderous military shrink and close personal friend of Miles Amsterdam, Nick Crane finds himself abducted, beaten and threatened with rendition to a black site in Egypt if he refuses to join the Principals’ cause, which includes attempting to incite anti-Muslim violence in every major American city. Crane, however, is rescued by his close friend and business partner, Vietnam War vet Bobby Moore, and the war is on.Packed with well-drawn characters, relentless action, and razor-sharp narration, \n\n\nRogues & Patriots\n\n\n is a scintillating sequel that builds on the momentum of its predecessor, \n\n\n27 Days\n\n\n. As Nick Crane once again emerges as a beacon of resilience and integrity, readers will be drawn deeper into a world where the fate of a nation hangs in the balance.\nAre you ready to uncover the secrets of power and deception where nothing is as it seems, and trust is the ultimate currency?\n\nJoin Nick Crane on a relentless quest for truth in the face of corruption and betrayal. Get your copy of Rogues & Patriots today and start on an adrenaline-fueled journey through a world where the line between hero and villain blurs, and only the brave dare to challenge the status quo.\nCritical Acclaim for \nRogues & Patriots\n:“Nick Crane is the kind of guy you can count on. He’s smart, tough, and persistent, a throwback to the classic American PI, in the mold of Marlowe and Spade, the kind of guy who runs into the burning building rather than hit the fire alarm. So, be prepared to buckle up for this wild ride.” —Charles Salzberg, Three-Time Shamus Award nominee, author of \nMan on the Run\n, and winner of the Beverly Hills Book Award“In \nRogues & Patriots\n, LA PI Nick Crane’s courage and cunning are put to the test as he battles sinister super patriots. A heart-pounding tale of espionage, friendship, and one man’s unwavering resolve against dark forces.” —Michael D. Sellers, award winning-writer and director of \nEye of the Dolphin\n“Moore has written a book to savor––vivid characters and crackling, high-voltage dialogue… Moore is a master of poetic detail that captures the era’s howling rage while creating a dark and menacing mood.” —John Nardizzi, PI of the year and Shamus award finalist for \nThe Burden of Innocence\n“Rogues and Patriots<",
  "genres": [
    "Thriller"
  ],
  "author": "Patrick H. Moore",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/208199276-rogues-patriots"
}