{
  "title": "Living the Secular Life: New Answers to Old Questions",
  "description": "David Brooks, The New York Times\"As secularism becomes more prominent and self-confident, its spokesmen have more insistently argued that secularism should not be seen as an absence — as a lack of faith — but rather as a positive moral creed. Phil Zuckerman, a Pitzer College sociologist, makes this case as fluidly and pleasurably as anybody in his book, Living the Secular Life .\"A Best Book of 2014, Publishers WeeklyOver the last twenty-five years, “no religion” has become the fastest-growing religion in the United States. Around the world, hundreds of millions of people have turned away from the traditional faiths of the past and embraced a moral yet nonreligious—or secular—life, generating societies vastly less religious than at any other time in human history. Revealing the inspiring beliefs that empower secular culture—alongside real stories of nonreligious men and women based on extensive in-depth interviews from across the country— Living the Secular Life will be indispensable for millions of secular Americans.Drawing on innovative sociological research, Living the Secular Life illuminates this demographic shift with the moral convictions that govern secular individuals, offering crucial information for the religious and nonreligious alike. Living the Secular Life reveals that, despite opinions to the contrary, nonreligious Americans possess a unique moral code that allows them to effectively navigate the complexities of modern life. Spiritual self-reliance, clear-eyed pragmatism, and an abiding faith in the Golden Rule to adjudicate moral these common principlesare shared across secular society. Living the Secular Life demonstrates these principles in action and points to their usage throughout daily life.Phil Zuckerman is a sociology professor at Pitzer College, where he studied the lives of the nonreligious for years before founding a Department of Secular Studies, the first academic program in the nation dedicated to exclusively studying secular culture and the sociological consequences of America’s fastest-growing “faith.” Zuckerman discovered that despite the entrenched negative beliefs about nonreligious people, American secular culture is grounded in deep morality and proactive citizenship—indeed, some of the very best that the country has to offer.Living the Secular Life journeys through some of the most essential components of human existence—child rearing and morality, death and ritual, community and beauty—and offers secular readers inspiration for leading their own lives. Zuckerman shares eye-opening research that reveals the enduring moral strength of children raised without religion, as well as the hardships experienced by secular mothers in the rural South where church attendance defines the public space. Despite the real sorrows of mortality, Zuckerman conveys the deep psychological health of secular individuals in their attitudes toward illness, death, and dying. Tracking the efforts of nonreligious groups to construct their own communities, Zuckerman shows how Americans are building institutions and cultivating relationships without religious influence. Most of all, Living the Secular Life infuses the sociological data and groundbreaking research with the moral convictions that govern secular individuals, and demonstrates how readers can integrate these beliefs into their own lives.A manifesto for a booming social movement—and a revelatory survey of this overlooked community— Living the Secular Life offers essential and long-awaited information for anyone building a life based on his or her own principles.New York Times Book Review  (Susan Jacoby)“[A] humane and sensible guide to and for the many kinds of Americans leading secular lives in what remains one of the most religious nations in the developed world.\"",
  "genres": [
    "Nonfiction",
    "Religion",
    "Philosophy",
    "Atheism",
    "Spirituality",
    "Sociology",
    "Theology"
  ],
  "author": "Phil Zuckerman",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/20821056-living-the-secular-life"
}