{
  "title": "Noble Cause",
  "description": "Winner of the John Esten Cook Award for Southern Fiction. Winner of numerous national awards and an Amazon bestselling author, Jessica James has received critical acclaim for this page-turning story of honor, self-sacrifice, and enduring love. Praised by both historians and romance readers since its original release in 2008, the award-winning historical fiction novel Shades of Gray now has a new ending in this special 150th Anniversary of the Civil War Commemorative Edition entitled Noble Cause. James uniquely blends elements of romantic and historical fiction in this deeply personal and poignant tale that, according to one reviewer, \"transcends the pages to settle in the very marrow of the reader's bones.\" This is the tale of Colonel Alexander Hunter, a dauntless and daring Confederate cavalry officer, who, with his band of intrepid outcasts, becomes a legend in the rolling hills of northern Virginia. Inspired by love of country and guided by a sense of duty and honor, Hunter must make a desperate choice when he discovers the woman he promised his dying brother he would protect is the Union spy he vowed to his men he would destroy. Readers will discover the fine line between friends and enemies when the paths of these two tenacious foes cross by the fates of war and their destinies become entwined forever. Destined for an honored place among the classics of the America Civil War, Noble Cause is a book to read, and keep, and remember forever. 2011 John Esten Cooke Award for Southern Fiction 2011 Next Generation Indie Award for Regional Fiction 2011 Finalist in Next Generation Indie Award contest in Romance and Historical Fiction catgories",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Civil War",
    "Historical Romance",
    "Fiction",
    "Historical",
    "Military Fiction"
  ],
  "author": "Jessica           James",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/11190920-noble-cause"
}