{
  "title": "How Adam Smith Can Change Your Life: An Unexpected Guide to Human Nature and Happiness",
  "description": "A forgotten book by one of history’s greatest thinkers reveals the surprising connections between happiness, virtue, fame, and fortune.Adam Smith may have become the patron saint of capitalism after he penned his most famous work, The Wealth of Nations. But few people know that when it came to the behavior of individuals—the way we perceive ourselves, the way we treat others, and the decisions we make in pursuit of happiness—the Scottish philosopher had just as much to say. He developed his ideas on human nature in an epic, sprawling work titled The Theory of Moral Sentiments. Most economists have never read it, and for most of his life, Russ Roberts was no exception. But when he finally picked up the book by the founder of his field, he realized he’d stumbled upon what might be the greatest self-help book that almost no one has read.In How Adam Smith Can Change Your Life, Roberts examines Smith’s forgotten masterpiece, and finds a treasure trove of timeless, practical wisdom. Smith’s insights into human nature are just as relevant today as they were three hundred years ago. What does it takes to be truly happy? Should we pursue fame and fortune or the respect of our friends and family? How can we make the world a better place? Smith’s unexpected answers, framed within the rich context of current events, literature, history, and pop culture, are at once profound, counter-intuitive, and highly entertaining. In reinvigorating this neglected classic, this book provides us with an invaluable look at human behavior through the lens of one of history’s greatest minds.",
  "genres": [
    "Philosophy",
    "Economics",
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Business",
    "History"
  ],
  "author": "Russell \"Russ\" Roberts",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/20821053-how-adam-smith-can-change-your-life"
}