{
  "title": "Forgetting to Be Afraid",
  "description": "A deeply personal memoir by one of the country’s brightest new political stars, Texas Democratic gubernatorial candidate Wendy Davis.On the 26th of June, 2013, Texas state senator Wendy Davis became an overnight political sensation and a hero to womens’ rights supporters across the country. Davis stood and spoke on the floor of the state legislature for nearly eleven hours to run out the clock on a sweeping bill that aimed to close all but five abortion clinics in Texas. During that time, she wasn’t allowed to eat, drink, sit, use the bathroom, speak off-topic, or lean against any furniture. When it was over, President Obama tweeted support to his 40 million Twitter followers, and Wendy Davis was suddenly a household name.But Davis’s personal story is as compelling, if not more so, than her public theatrics. Raised by a single mother with a ninth-grade education, Davis began working after school at age fourteen to help support her mom and three siblings. By nineteen, she had been married and filed for divorce while living with her baby daughter in a trailer park, a single mother trying to hold down two jobs. After putting herself through Texas Christian University and making it to Harvard Law School, then serving for nine years on the Fort Worth city council, Davis set her sights on the Texas state senate—and in 2008 defeated a longtime GOP incumbent in a race widely considered one of the biggest recent upsets in Texas politics.Now, Davis is making a serious run to become the first Democratic governor of Texas in nearly two decades. With her singular narrative and tremendously exciting political future, this is bound to be the political memoir of the year.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Politics",
    "Feminism",
    "Biography",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "Wendy  Davis",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/20821343-forgetting-to-be-afraid"
}