{
  "title": "Stalin: Paradoxes of Power, 1878-1928",
  "description": "A magnificent new biography that revolutionizes our understanding of Stalin and his world It has the quality of myth: A poor cobbler’s son, a seminarian from an oppressed outer province of the Russian empire, reinvents himself as a revolutionary and finds a leadership role within a small group of marginal zealots. When the old world is unexpectedly brought down in a total war, the band seizes control of the country, and the new regime it founds as the vanguard of a new world order is ruthlessly dominated from within by the former seminarian until he stands as the absolute ruler of a vast and terrible state apparatus, with dominion over Eurasia. But the largest country in the world is also a poor and backward one, far behind the great capitalist countries in industrial and military power, encircled on all sides. Shortly after seizing total power, Stalin conceives of the largest program of social reengineering ever attempted: the root-and-branch uprooting and collectivization of agriculture and industry across the entire Soviet Union. To stand up to the capitalists he will force into being an industrialized, militarized, collectivized great power is an act of will. Millions will die, and many more will suffer, but Stalin will push through to the end against all resistance and doubts. Where did such power come from? We think we know the story well. Remarkably, Stephen Kotkin’s epic new biography shows us how much we still have to learn. The product of a decade of scrupulous and intrepid research, Stalin contains a host of astonishing revelations. Kotkin gives an intimate first-ever view of the Bolshevik regime’s inner geography, bringing to the fore materials from Soviet military intelligence and the secret police. He details Stalin’s invention of a fabricated trial and mass executions as early as 1918, the technique he would later impose across the whole country. The book places Stalin’s momentous decision for collectivization more deeply than ever in the tragic history of imperial Russia. Above all, Kotkin offers a convincing portrait and explanation of Stalin’s monstrous power and of Russian power in the world. Stalin restores a sense of surprise to the way we think about the former Soviet Union, revolution, dictatorship, the twentieth century, and indeed the art of history itself.",
  "genres": [
    "History",
    "Biography",
    "Russia",
    "Nonfiction",
    "Politics",
    "Russian History",
    "Soviet Union"
  ],
  "author": "Stephen Kotkin",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/20821221-stalin"
}