{
  "title": "Wealth and Democracy: A Political History of the American Rich",
  "description": "For more than thirty years, Kevin Phillips' insight into American politics and economics has helped to make history as well as record it. His bestselling books, including The Emerging Republican Majority (1969) and The Politics of Rich and Poor (1990), have influenced presidential campaigns and changed the way America sees itself. Widely acknowledging Phillips as one of the nation's most perceptive thinkers, reviewers have called him a latter-day Nostradamus and our \"modern Thomas Paine.\" Now, in the first major book of its kind since the 1930s, he turns his attention to the United States' history of great wealth and power, a sweeping cavalcade from the American Revolution to what he calls \"the Second Gilded Age\" at the turn of the twenty-first century.The Second Gilded Age has been staggering enough in its concentration of wealth to dwarf the original Gilded Age a hundred years earlier. However, the tech crash and then the horrible events of September 11, 2001, pointed out that great riches are as vulnerable as they have ever been. In Wealth and Democracy , Kevin Phillips charts the ongoing American saga of great wealth–how it has been accumulated, its shifting sources, and its ups and downs over more than two centuries. He explores how the rich and politically powerful have frequently worked together to create or perpetuate privilege, often at the expense of the national interest and usually at the expense of the middle and lower classes.With intriguing chapters on history and bold analysis of present-day America, Phillips illuminates the dangerous politics that go with excessive concentration of wealth. Profiling wealthy Americans–from Astor to Carnegie and Rockefeller to contemporary wealth holders–Phillips provides fascinating details about the peculiarly American ways of becoming and staying a multimillionaire. He exposes the subtle corruption spawned by a money culture and financial power, evident in economic philosophy, tax favoritism, and selective bailouts in the name of free enterprise, economic stimulus, and national security.Finally, Wealth and Democracy turns to the history of Britain and other leading world economic powers to examine the symptoms that signaled their declines–speculative finance, mounting international debt, record wealth, income polarization, and disgruntled politics–signs that we recognize in America at the start of the twenty-first century. In a time of national crisis, Phillips worries that the growing parallels suggest the tide may already be turning for us all.",
  "genres": [
    "History",
    "Politics",
    "Economics",
    "Nonfiction",
    "American History",
    "Sociology",
    "American"
  ],
  "author": "Kevin Phillips",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/111917.Wealth_and_Democracy"
}