{
  "title": "Shame On Her: Catfight Edition",
  "description": "Explore your wildest fantasies in a hot new series where women are stripped, shamed, and publicly humiliated before they’re coerced into degrading sexual acts. But in this edition the gloves are off, and each story contains an exciting catfight as well!Shame On Catfight Edition contains the stories “Shaming the Bully,” “Shaming the Waitress,” and “Shaming the Rich Housewife.”“Shaming the Bully” – Randi is a tough but sexy girl who has spent her entire life bullying the kids in her neighborhood. But now that she and the others are all high school seniors, pranks like pulling down someone’s shorts or ripping off someone’s bikini top are more embarrassing than ever. Randi’s favorite victim is Billy, the shy boy who lives next door. But when Billy’s tough cousin Deb comes for a visit, Randi gets a taste of her own medicine. After a no-holds-barred fight in front of Billy and his friends, Randi is stripped and spanked before she has to pleasure Deb as the price of her defeat. Randi also has to get on her knees and “apologize” to Billy for tormenting him for so long! As a final act of humiliation, Billy and his friends dress tomboy Randi up in a sexy dress and high heels then take her to the high school dance, but before long Randi is stripped naked again—this time in front of the entire school!“Shaming the Waitress” – Tori, a young blonde waitress, thinks she can steal tips from the older women she works with. But when brunette Sarah catches her in the act, the two get in a fight behind the diner. Tori ends up stripped and humiliated in front of the whole restaurant staff, then her uniform is taken away when her boss fires her for stealing. Naked and confused, the young blonde winds up servicing the man in the back parking lot as a way to get out of the situation. But before she can escape with the smallest shred of dignity, the police show up and arrest Tori for public indecency, hauling the blonde off to jail totally nude!“Shaming the Rich Housewife” – It’s New Year’s Eve, and spunky redhead Robin finds herself catering a party for a snooty rich couple all by herself. When Tracy, the black-haired housewife, discovers her drunk husband flirting with Robin, she thinks it’s the redhead’s fault. A fight ensues, and both women wind up naked in front of a houseful of guests. Spunky Robin is the victor, and snooty Tracy winds up spanked and humiliated in front of the huge crowd of party-goers. As a final insult, Robin seduces Tracy’s husband in a way that leaves Tracy even messier and more embarrassed than before!",
  "genres": [],
  "author": "K.C. Silkwood",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/20822360-shame-on-her"
}