{
  "title": "The Cousins' Wars: Religion, Politics, and the Triumph of Anglo-America",
  "description": "The question at the heart of The Cousins' Wars is How did Anglo-America evolve over a mere three hundred years from a small Tudor kingdom into a global community with such a hegemonic grip on the world today, while no other European power - Spain, France, Germany, or Russia - did? The answer to this, according to Phillips, lies in a close examination of three internecine English-speaking civil wars -- the English Civil War, the American Revolution, and the American Civil War. These wars between cousins functioned as crucial anvils on which various religious, ethnic, and political alliances were hammered out between the English-speaking cousin-nations, setting them on a unique two-track path toward world leadership - one aristocratic and aloof to dominate the imperial nineteenth century and the other more egalitarian and democratic to take over in the twentieth century. They also functioned as unfortunate and deadly cultural crucibles for African Americans, Native Americans, and the Irish. Phillips's analysis shows exactly how these conflicts are inextricably linked and how they seeded each other. He offers often surprising interpretations that cut across the political spectrum - for instance, that the Constitution of the United States, while brilliant in many respects, was also a fatally flawed political compromise that contributed mightily in setting the stage for the final - and the bloodiest - cousins' the American Civil War. With the new millennium upon us and triggering widespread assessment of our nation's place in world history, The Cousins' Wars provides just the kind of magisterial sweep and revisionist spark to ignite widespread interest and debate. This grand religious, military, and political epic is the multi-dimensional story of the triumph of Anglo-America.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Politics",
    "European History",
    "War",
    "American Revolution"
  ],
  "author": "Kevin Phillips",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/111919.The_Cousins_Wars"
}