{
  "title": "Panther",
  "description": "Razer 8 takes you into the world of organized crime, kidnapping, politics, military romance and suspense thriller. Razer 8 Delta Force operatives are full of passion. Enjoy these amazing passionate men, a thrilling ride of suspense, and a dash of love. Panther aka Mark Alastor Lotus “I want to know everything. I want to be able to control what’s going down. I won’t allow anyone or anything to control my life. I need to learn my environment, position, and fate. That’s the only way to survive and to be first.” Panther, Razer 8 Panther is the lead operative on the Razer 8 team. His harsh childhood shaped him into a tough, reserved, and solitary man. He mastered controlling his emotions, physical endurance, and fate. Tabitha Sparks is a sweet beautiful young author, full of life and dreams. She writes a #1 a thriller, with suspense, and organized crime. The book triggers the Russian mafia's rage. They contact an assassin. Tabitha is oblivious to the threat to her life and continues her work. Panther's mission is to save her life, while endangering his controlled balance. Will he fall under her spell and open his soul? Excerpt ~ Tabby serves two plates and slices the homemade bread. She brings the plates over to the table and quickly returns for the bread. “Taste it, Alastor, please.” says Tabby, smiling. She takes a seat next to him. Panther looks down at the plate, grinning. He inhales deeply, nodding. “Angel, this looks and smells amazing.” He takes his fork and takes a slice of pot roast with some carrots. “Hmm, it tastes great! I love it,” says Panther, looking over at Tabby. Tabby blushes with pleasure, smiling up at him. “Thank you, I’m pleased that you like my cooking.” Panther leans over, closer to her. He looks into her eyes. “Angel, I love a lot of stuff about you. I would like to enjoy tasting everything.” Tabby blushes, pleased. She looks at his full delicious lips. She licks her lower lip, recalling his kisses. “Yes, that would be wonderful. I look forward to you tasting everything,” replies Tabby, blushing. She looks up into his golden honey brown eyes. She blinks and pulls back to take a bite of her food. “I made the bread, it’s nice and warm. I always eat alone. Sometimes my friend Barbie from the café will have dinner with me,” says Tabby. She continues a constant chatter through dinner. Panther eats the delicious meal, smiling at her. He takes a drink of his wine. “Oh wow, so your Mom wants you to return home.” I don’t like that and if I can stop it I will. I want her close so I can see her, he thinks. “Would you care for some apple pie,” asks Tabby, looking at his plate. “I could give you some more pot roast”. Panther leans back, taking the last drink of his wine. He smiles at her. “Angel, the pot roast is delicious but I’m full.” “Awesome, how about the pie?” asks Tabby, grinning. Yeah, like if he would ever get fat. I know and seen him work out. Oh gawd, he’s simply delicious, she thinks. Panther observes her desire as it sparks in her eyes. He leans forward, and takes her hand. He pulls her up from her chair and onto his lap. “Angel, I want some desert but not pie.” Tabby sits on his lap, allowing him to pull her close. She meets his hungry kiss. She moves her left hand up his neck to bury it in his soft light brown hair. He moans when he feels her fingers slide through his long hair. Oh yeah, soft and silky. I’m in heaven. I love everything about Alastor.",
  "genres": [],
  "author": "P.T. Macias",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/20825103-panther"
}