{
  "title": "Ad Infinitum",
  "description": "There is a thread that runs through this universe and the myriad universes that make up the multiverse, a commonality of spirit that connects each of the infinite spheres of time at the quantum core - humanity.   On countless worlds across countless plains of possibility, there exists some form of humanity, of people, and they all share the same creators, a race of beings older than time and of unknown origin called the Sojourners. These omni-terrestrial pioneers literally seed the universe with life, and as they go they leave behind a number of their own to guide the resultant humanity in the process of evolving, and, in order to keep the chain of knowledge unbroken, through reincarnation leap frog through time passing along the history of each generation to the next line of Sojourner elementals.   Yet there was one Sojourner who looked at what it had created and saw nothing but inferior bastard offspring, not children to be nurtured, but slaves to be ruled. It broke off from the Sojourner religion and rebelled against it. It became known only as the Other. And across the multiverse of time and space, there was war between the Other and the Sojourners. And now the war has come to Earth.   Three people – a Bengali mystic, the son of an African shaman, and a prodigy turned schizophrenic who sees things people shouldn’t see – become caught up in the crimes of a man who started life as a gifted, loved and loving child, but through tragedy was usurped by the essence of an evil, ancient and unforgiving, which sets forth on a mission of destruction. It is up to the Sojourner faithful, few in number yet steeped in eons of forgotten knowledge, to find among them the power to overcome the Other and by doing so, forever change the lives of those either fortunate or unfortunate enough to be close to them.",
  "genres": [],
  "author": "William Fripp",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/20824160-ad-infinitum"
}