{
  "title": "Shutout",
  "description": "An Unputdownable College Hockey Brother's Teammate Romance.He's the tall, tattooed stranger I hooked up with on Halloween... and now he's my new roommate.After a sudden cross-country move, I’m stuck crashing with my older brother and two of his hockey teammates for sophomore year. I'm not thrilled about shacking up with three athletes and their stinky gear, rotating door of hookups, and tendency to inhale every snack in the house. Just one reason of many that hockey players aren't my type.When I walk in the front door with an armload of boxes, however, I'm faced with another problem.My anonymous fling from two months ago is Tyler Donahue, the superstar goalie for my brother’s team.We both agree to pretend it never happened, but it quickly becomes clear neither of us can forget. Before I know it, we're exchanging heated glances from across the room, sending spicy texts at all hours of the night, and stealing kisses behind closed doors.Since my overprotective brother would freak out, we decide to keep things between us a secret. There’s no point in rocking the boat when I don't want a boyfriend, and Tyler doesn't have time for a girlfriend with his grueling hockey schedule. But as our no-strings arrangement turns into something deeper and more meaningful, I begin to see a softer side of the broody, closed-off goalie. He's gentle, protective, and giving in every sense of the word. Despite what I told myself going in, I'm falling hard and falling fast.We said we'd keep things casual, but hearts have a way of breaking all the rules.Shutout is a college hockey romance with lots of spice, swoon, and a happily ever after. It’s the second book in the Rules of the Game series and can be read as a standalone.Tropes:forced proximity / roommatesbroody tattooed goalie herosunshine party girl heroinesneaking aroundADHD and anxiety repdual POV",
  "genres": [
    "Sports Romance",
    "Romance",
    "Hockey",
    "Sports",
    "College",
    "Forced Proximity",
    "Contemporary Romance"
  ],
  "author": "Avery Keelan",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/208292996-shutout"
}