{
  "title": "Beginning with Forever",
  "description": "Beginning with Forever (Book 1 of 3) “Carson, I’m freely offering myself to you. Please,” I plead fearlessly. I’m shameless and not above begging for him to take my body. Who is this sex-craved woman anyways? “Sweetness, you’re making it very difficult for me to resist you, to control myself.” He lowers himself intimately close to graze his moist lips over my forehead, bridge of my nose, and then intensely on my lips. The urgency of his need for me is translated through his kiss. Biting down firmly on his lower lip, it appears that he’s forcing the strength of his will to remain tame. Our eye contact is broken when he seals his shut to blind the temptation lying underneath his body. His hands grip the sheets, desperately clawing and fisting. I think this is his last hope of hanging on to his dignity. “Goodnight Lily, only offer your body to me when you believe it in your heart,” he murmurs and rolls off me. Sometimes forever finds you…Love isn’t easy to forget, even when you’re determined to never feel it again. It has a way of finding you, resurfacing raw emotions you’ve buried deep inside. Carson Bradley is the CEO of Bradley Pharmaceutical Corporation, a powerful and influential multi-billion dollar drug empire. His wealth spans beyond anyone’s imagination, but is useless to his lonely soul, which has been dormant since the death of his first love to cancer. Every day he strives for the sake of his research because he’s determined to eradicate that vile disease forever. Lillian Ly is a young, humble medical student whose compassion for people is boundless. Being raised poor by a single parent, she matured quickly and respects the sacrifices her mother has made for her. Lillian’s determination leads her down a stringent five-year path with no room for love. When a tropical storm forces their paths to cross at an unlikely place thousands of miles away from home, they both realize love isn’t a matter of choice or determination—love is powerful and irrepressible, especially between two kind-hearted people with a common interest in healing the world. Carson is familiar with desolation—fifteen years to be exact. With Lillian by his side, he will never return to that dark place again—even if it means dragging her through his ugly past and into his dangerous world of pharmaceutical rivalries. Lillian’s uncomplicated life will soon be a distant memory as she follows her heart to be with the only man she’s ever loved. Together, they will endure any obstacle to hold on to their forever. (Contents are not appropriate for under 18)",
  "genres": [
    "Contemporary Romance",
    "Erotica",
    "Romance",
    "Amazon",
    "Contemporary",
    "College",
    "Adult"
  ],
  "author": "Lan LLP",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/20828245-beginning-with-forever"
}