{
  "title": "Trasig",
  "description": "\"Jag föddes och trasades sönder i Birkenhead. Oönskad, misshandlad, såld, bortbytt, fotograferad, filmad, lämnad att dö, fördärvad, skuldbelagd, sviken och förbigången. Men jag föddes även med en brinnande eld inom mig. Jag kallar den för min Fenixeld. Jag är inget offer - det ordet beskriver bara vad jag råkade ut för. Inte heller är jag en överlevare för det antyder att jag kommit över allting. Jag är en Fågel Fenix och det pågår en ständig process inom mig. Detta är min berättelse.\"Orden kommer från Shy Keenan. Under hela sin barndom blev hon systematiskt våldtagen av sin styvfar. Och hen¬nes mor misshandlade henne så svårt att hon hade både nedsatt hörsel och syn den dag hon började skolan. Vid 10 års ålder var hon nära att dödas av en grupp pedofiler som hon blivit såld till. I vuxen ålder beslutade sig Shy för att berätta sanningen och få de skyldiga ställda inför rätta. Efter en utdragen process dömdes både styvfadern och några av hans medhjälpare till långa fängelsestraff inte bara för vad de gjort mot Shy utan för flera fruktansvärda brott även mot andra barn. Trasig är en av de mest skakande och ärliga skildringar av barns utsatthet som någonsin skrivits. På ett rakt och självutlämnande sätt berättar Shy Keenan om sina fruktansvärda upplevelser. Men hon uppvisar även en inneboende styrka och förmåga att trots allt överleva och vända smärtan till något positivt som kan hjälpa andra i liknande situation.Pressröster om Trasig: \"Jag rekommenderar alla att läsa Trasig, om inte annat för att förstå hur sjuk en del av mänskligheten faktiskt är.\" - Kick Off\"Hur kan någon göra så här mot ett 4-årigt barn. Polisen och de sociala myndigheterna måste ha varit blinda!!! Alla som utnyttjade Shy borde få livstids fängelse. De stal ju hennes liv ...\" - amazon.co.uk",
  "genres": [
    "Nonfiction",
    "Memoir",
    "True Crime",
    "Biography",
    "Abuse",
    "Autobiography",
    "True Story"
  ],
  "author": "Shy Keenan",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/20826890-trasig"
}