{
  "title": "Skyscraper",
  "description": "\"Lynn is a bright, ambitious young woman, living on her own for the first time in 1930s New York City, where the streets and subways teem and throb with life. Each day, Lynn joins the crowds of people who stream into the towering new heart of the cityscape. The Seacoast Building, the gleaming new skyscraper that thrusts itself toward the stratosphere, represents wealth, power, the triumph of engineering over nature - and the masculine world that women must learn to navigate if they seek careers of their own.\" \"Lynn loves the gleaming marble elevators, the rows of polished desks and filing cabinets, the world of paper and numbers and business. Soon, Lynn also loves Tom, the young man she meets in the skyscraper's coffee shop. Lynn and Tom are so in love, if they don't get married, something improper is bound to happen. But jobs are getting scarce in the early years of the Depression, and the Seacoast Company has a strict new policy: Any woman who marries will be immediately dismissed from her job.\" \"Making matters even more complicated is David Dwight - powerful, handsome, charismatic, separated from his wife, and a well-known seducer. Lynn is innocently flattered by what seems to be his fatherly interest in her, which includes invitations to stylish parties and to his spectacular country estate. But fatherly interest is not what David Dwight has in mind, and he usually gets what he wants.\" \"First published in 1931 - the same year the Empire State Building opened its doors - Skyscraper marks the advent of a new kind of romance plot, and Lynn a new kind of heroine. Like so many young women protagonists before her, Lynn faces choices that will determine the course and quality of the rest of her life. But rather than just choose between suitors, Lynn and other working girls like her must decide whether to abandon their jobs, their careers, and their financial independence - or abandon their men. They can't have both - or can they?\" Even as she turned out fast-paced",
  "genres": [
    "Fiction",
    "Pulp",
    "Romance",
    "New York",
    "Womens",
    "Mystery",
    "Novels"
  ],
  "author": "Faith Baldwin",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/208450945-skyscraper"
}