{
  "title": "Country Heaven",
  "description": "Fans who like the family dynamics of the Sullivans by Bella Andre, the small town charm of Cedar Cove by Debbie Macomber, and the sweet romance of Fool's Gold by Susan Mallery will enjoy Ava Miles. USA Today Bestselling Author Ava Miles of the #1 National Bestseller NORA ROBERTS LAND presents the Dare River series set in the South, connected to her bestselling small town Dare Valley series, against the backdrop of country music, Nashville, foodie splendor, family, and sweet forgiveness. Also including thirteen country music songs and a dozen recipes. \"If ever there was a contemporary romance that rated a 10 on a scale of 1 to 5…this one is it!\" The Romance Reviews on COUNTRY HEAVEN When famous—and infamous—country singer Rye Crenshaw saunters into the diner where she cooks, Tory Simmons is certain she’s got him pegged. He’s a bad boy rock star who indulges himself in all things, women included. But while she couldn’t care less about country music or arrogant men, Rye makes her an offer she can’t refuse when he asks her to be his private chef on his multi-city concert tour. The job is the answer to all her it will clear out her debt and finance the fresh start she desperately needs. Rye is certain his sassy new cook is the last woman who’d ever tempt him, but spending time with the wholesome girl next door will do wonders for his damaged public image, whether she likes being forced into the spotlight or not. Her food also happens to be the best he’s ever eaten, both comforting and seductive. But spending time with Tory on the road shows him a new side to her—one that’s as impossible to resist as her food. And when an emergency in his family whisks him home, he does the one thing he’s never he lets a woman into his heart… Soon the emotions Rye faked for the tabloids become all too real, but will the country heaven he’s found in Tory’s arms survive in the real world? Author's All books can easily be read as stand-alone stories. The Small Town Dare Valley Book 1: NORA ROBERTS LAND (Meredith & Tanner) Book 2: FRENCH ROAST (Jill & Brian) Book 3: THE GRAND OPENING (Peggy & Mac) Book 4: THE HOLIDAY SERENADE (Abbie & Rhett) Book 5: THE TOWN SQUARE (Arthur & Harriet) Book 6: THE PARK OF SUNSET DREAMS (Jane & Matt) Book 7: THE PERFECT INGREDIENT (Elizabeth & Terrance) ~ coming Fall 2014 The Dare River Book 1: COUNTRY HEAVEN (Tory & Rye) Book 2: THE CHOCOLATE GARDEN (Tammy & J.P.) ~ coming Summer 2014 \"It {NORA ROBERTS LAND} captures the best of what I love in a Nora Roberts novel...\" BlogCritics “…Finding love like in the pages of a Nora Roberts story.” Publishers Weekly WW Ladies Book Club “I am adding Ava Miles to my list of always reads like Susan Mallery, Jill Shalvis, Kristen Ashley, and NORA ROBERTS.” Marjay's Reading Blog \"An entertaining ride…{and) a full-bodied romance.\" Readers’ Favorite on FRENCH ROAST “Ava Miles is fast becoming one of my favorite light contemporary romance writers.” Tome Tender on THE GRAND OPENING “The latest book in the Dare Valley series is a continuation of love, family, and romance.” Mary J. Gramlich on THE HOLIDAY SERENADE “Ms. Miles’ words melted into each page until the world receded around me…” Tome Tender on THE TOWN SQUARE, Ms. Miles’ ode to Mad Men AUTHOR USA Today Bestselling Author Ava Miles burst onto the contemporary romance scene after receiving Nora Roberts’ blessing for her use of Ms. Roberts’ name in her debut novel, the #1 National Bestseller NORA ROBERTS LAND, which kicked off her small town series, Dare Valley, and brought praise from reviewers and readers alike. Ava has also released a connected series called Dare River, set outside the country music capital of Nashville. She’s fast becoming a favorite author in light contemporary romance (Tome Tender) and is known for funny, emotional stories about family and empowerment.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Music",
    "Fiction",
    "Chick Lit",
    "Amazon"
  ],
  "author": "Ava Miles",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/20833915-country-heaven"
}