{
  "title": "Black Sword",
  "description": "1323 A.D.Devlin de Bermingham, an Irish knight to the core, is the bastard son of the Earl of Louth and the descendent of Irish kings. He is also a strong proponent that the Irish should rule Irish lands. Rebelling against his English overlord, the Earl of Kildare, he captures one of Kildare's castles south of Wicklow. Known as Black Sword, a rebel who is both admired and feared, Devlin has set the events in motion for an enormous Irish revolt. Every Norman settlement in Ireland is at risk because of Black Sword's actions and the stage is set.The Lady Emllyn Fitzgerald is the sister of the Earl of Kildare. When her brother sends his fleet to quell the uprising on his lands, she stows away on one of the vessels in order to follow the object of her affection, a strong young English knight sworn to her brother, into battle. It is her intention to prove to the man she is worthy and brave enough to be his wife, but she truly has no grasp of the seriousness of her folly. As the English fleet makes landfall along the Wicklow coast, disaster strikes - Black Sword and his army of Irish rebels are waiting for them. In a devastating night of blood and mayhem, the English armada is destroyed and Lady Emllyn is taken a prize.Join Devlin and Emllyn as they embark upon a journey of a lifetime where both will face death, defeat, and disaster, but most terrifying of all, face their growing feelings for one another in a world that would see them torn apart. How is it possible for two people from two completely different worlds to find a love so deep that it will see each of them make sacrifices for the other? Will they be able to remain together or will politics and war keep them apart?Join the unforgettable adventure of a lifetime and experience what lengths Devlin and Emllyn with go to in order to be with each other, lengths that will transcend their loyalty to their own people and jeopardize their very freedom. For a love that was never meant to be, they will risk all.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Medieval",
    "Historical",
    "Medieval Romance",
    "Historical Fiction",
    "Irish Literature"
  ],
  "author": "Kathryn Le Veque",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/20838224-black-sword"
}