{
  "title": "Vampire Twist: Two Novels",
  "description": "Two Bestselling Kindle Novels Together in One THE VAMPIRES' LAST LOVERThe Dying of the Dark #1Txema Ybarra is the most unenviable nineteen-year-old girl alive.Smart, pretty, and athletically gifted, this University of Tennessee freshman should be enjoying college life and her entrance into adulthood. And for a moment she does…until the vampires show up.Born with an unusual ‘twin teardrop’ birthmark on her neck, Txema (pronounced Chema) is one of only a handful of females in the world who bear this trait. It marks her as a vessel of eternal youth and beauty for an elite vampire society determined to protect her precious blood….But it also is the only thing standing in the way of a rogue ‘undead’ nation determined to destroy mankind and usurp the power their sexier brethren have held uncontested for centuries.Caught in the middle of this war after all the other bearers of the birthmark are murdered, Txema must flee America and heads to France under the protection of five beautiful vampires who all have a vested interest in her survival. The race is on to save her blood, as well as her very life, to ensure the survival of Les Amantes de Vampire. Otherwise, Txema will be the last one…the vampires’ last lover.DEADLY NIGHTA Ghost Hunters 101 NovelWhen Country singer Candi Starr is found dead along with two close associates in Nashville's esteemed West End, it proves to be just the beginning of a murder spree involving anyone close to the music superstar. This includes ghost hunter and psychic, Fiona Alea, who, along with her handsome rock n' roll husband, Jimmy, head up a local paranormal investigative team known as NVP, or Nash-Vegas Paranormal.Soon Jimmy and Fiona find themselves on a roller-coaster thrill ride through some of Nashville's most renowned historic sites and famous haunts, where a gruesome discovery lies buried in the past. As horrifying revelations come to light, Jimmy and Fiona close in on an enemy both powerful and merciless—and the chilling truth behind Nashville’s darkest secret.Acclaim for the Novels of Aiden “The intense writing style of Aiden James kept my eyes glued to the story and the pages seemed to fly by at warp speed. …Twists, turns, and surprises pop up at random times to keep the reader off balance. It all blends together to create one of the best stories I have read all year.”—Detra Fitch, Huntress Reviews for The Devil’s Paradise“Aiden James has written a deeply psychological, gripping tale that keeps the readers hooked from page one.”—Bookfinds review for The Forgotten Eden“Not only is Aiden James a storyteller par excellence, but his material for his story is riveting.”—Huntress Reviews for The Forgotten Eden“The hook to this excellent suspense thriller is the twists that will keep readers wondering what is going on as nothing is quite what it seems. Adding to the excitement is that the audience will wonder whether the terror is an evil supernatural creature or an amoral human…Aiden James provides a dark thriller that grips fans from the opening.”—Harriet Klausner, Amazon’s #1 book reviewer for The Forgotten Eden“Aiden James writing style flows very easily and I found that Cades Cove snowballed into a very gripping tale. Clearly the strengths in the piece were as the spirit’s interaction became prevalent with the family… The Indian lore and ceremonies and the flashbacks to Allie Mae’s (earthly) demise were very powerful.",
  "genres": [
    "Paranormal"
  ],
  "author": "Aiden James",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/10131236-vampire-twist"
}