{
  "title": "Toxic",
  "description": "Told through Shame’s point of view, the final installment of the Lights of Peril MC takes place on the ‘implied’ wedding day. Shame is plagued with doubts surrounding his love for Mace. He loves her. He’s loved her since she was five years old, but feels he doesn’t deserve her. This uncertainty is surfacing while struggling to forget the loss of his tragic childhood. “What if the trigger has already been set and I’m going to wake up one day and realize I’m my parent’s son in their way of evil? The thought sickens me. I’m no good without Mace. I never have been. She’s the one person in my life I would refuse to live without. If I ever treated her and Ryder like my father treated my mother and I, it would make for an easy decision. I would kill myself.”Shame’s childhood wasn’t filled with happiness and love. It was heart wrenching, and abusive. Used by his father and resented by his mother, a young Neil struggles through his days waiting for an escape; a savior.“As he seethes his anger onto me I feel the spit from his words land on my face and in it I smell his whiskey and coke coming down like rain over my blissful day. I’m working for them now. I’m nine and I’ve just been interviewed and hired for my very first job… running drugs.” Once meeting Doc, Lynda, Mace, Hem, and Sadey - his life changes from desolate to hopeful. “At just five years old, she found her way into my heart and loved me in a way I never thought I could be loved. All that was before I ever even knew I needed her. “Throughout the story you learn why Shame has become the person that he is. Intense, raw, powerful, and most of all – protective of those he loves the most. In the end he finds himself surrounded by everything he had ever hoped for. “The storms I waited out were violent and unstable, but once finding them I found the unconditional love that I’d ached for in my search for them. It’s in this moment, among the sounds of monitors and babies crying and the feel of Mace in my arms, holding me tight, just as she always had, that I realize - I am finally well and truly home.”Authors Note: This book contains sexual content, explicit language, child abuse/neglect and other content that readers may find offensive. Not for readers under 18 years of age.",
  "genres": [
    "Romance",
    "Abuse",
    "Dark",
    "Contemporary",
    "Erotica",
    "Contemporary Romance",
    "Adult"
  ],
  "author": "A.C. Bextor",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/20843860-toxic"
}