{
  "title": "Kuća obrasla bršljanom",
  "description": "Glavni junak ove storije, Aleksa Lakić Laki, na prvi je pogled vrlo kontroverzna ličnost. Vraća se iz inostranstva u pravo vreme da budzašto otkupi obezvređenu imovinu nekog društvenog preduzeća i beskrupulozno zloupotrebljava hiperinflaciju da bi je pretvorio u sopstveni lokal. Robu nabavlja koristeći sluđenost tranzicionih gubitnika. Prema mušterijama nastupa sa prezirom i nipodaštavanjem, a njegovo društvo čini polusvet opasno blizak beogradskom podzemlju.Pa opet, isti taj Laki je čovek koji sanja. Sanja kuću obraslu bršljanom, kuću iz koje je pobegao još 1985. po očevoj sahrani, kuću u koju nije smeo da se vrati. Svet po kome hodi postaje tek skrovište od užasnog zaveštanja što mu ga otac ostavlja. Verovao u kletve ili ne, poslušao je majku i ostao daleko od rodnog sela. Vrativši se iz potucanja po svetu, naseljava se u Beogradu 1993. godine.Dve godine kasnije upoznaje ljubav svog života, Mariju Rani¬tijević. Nažalost, s njom se budi i staro pro-kletstvo. Nehotice, stižu u Lakiće, gde u vanvremen-skom obračunu ginu Marijina baka Magdalena, obdare-na veštičjim moćima, ali i Lakijevi najrođeniji. Tek tada Laki spoznaje da je Marijina loza važna karika drevne kletve. Rastaju se, možda zauvek. Marija odlazi u Pariz.Možda bi već i to bilo sasvim dovoljno za jednu napetu priču, ali daleko od toga da se pripovest tu završava. Mnogo godina kasnije, Lakijev prijatelj Mile Desertić počinje da sanja istu opustelu kuću, sustižu ga naizgled natprirodne nevolje, a Lakija kroz snove vodi tajanstveni dečak i upućuje ga na sve jasnije tragove, na sitnice koje će pokrenuti potragu i Lakija dovesti gene-racijama unatrag, sve do pretka ubice s kojim je prokletstvo započelo. Jedino rešenje je pronaći i sah-raniti mošti njegovih nesrećnih žrtava. Da li će uspeti u svom naumu, samim tim spasiti svog najboljeg prijatelja i povratiti ljubav, saznaćete u ovom vrtoglavom romanu.",
  "genres": [],
  "author": "Lazar Janic",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/20833988-ku-a-obrasla-br-ljanom"
}