{
  "title": "Messages from Estillyen",
  "description": "SEARCHING for destiny Hollie and Goodwin Macbreeze journey to the Isle of Estillyen, a distant land inhabited by an ancient order of monks renowned for dramatic readings given in quaint structures dotted about the isle. The ancient order of message-making monks was founded in 1637. Swiftly and unexpectedly, the couple's lives become intertwined with the isle's most notorious inhabitant, the reclusive Oban Ironbout, longtime resident of The Point. A mystery from the past arises to transform them all. BlueInk Review: \"In his breakout novel of spiritual revelation, William E. Jefferson invites readers on a journey of discovery where 'joy and meaning break through pain.' \"The the themes are deep. Discerning readers will be drawn into the mystery surrounding Ironbout's tortured soul. And the readings interspersed throughout the story offer a unique presentation of the Gospel via the ongoing struggle between the forces of darkness and light, and the necessity for the solution in the 'Word made flesh.' \"The author's writing is skilled, poetic, and reminiscent of the classical period. This is a book to savor, not to gulp; the pace is leisurely. The style is allegorical in part, reminiscent of John Bunyan and C.S. Lewis. The 'readings' hearken to Donne and Milton as well. \"The novel will appeal to readers who appreciate British wit, the skill of a true wordsmith, and the challenge of metaphysical introspection. Christian readers will be especially delighted by the creative way the author brings the Bible to life. \"Jefferson stays true to his motto: 'Words matter, some more than most.' The words in Messages from Estillyen matter. William E. Jefferson, author of the breakthrough novel, 'Messages from Estillyen, ' describes himself as a 'Message Maker.' \"Yes, that's my preferred title,\" Jefferson explains. \"Crafting a story, making meaning with words is such a challenging and rewarding endeavor. Jefferson writes from a small civil-war cottage in the rural Ozarks. He holds an M.Th. in Theology and Media from the University of Edinburgh and an M.A. in Communications from Wheaton Graduate School. He has spent his professional career advancing Scripture mission programs through diverse forms of media. Prior to authoring 'Messages from Estillyen' Jefferson helped to structure and implement global initiatives and programs for prominent organizations such as the American Bible Society, United Bible Societies, the International Bible Society (Biblica), and the Billy Graham Evangelistic Association. With his novel, Messages from Estillyen Jefferson shares much of the insight he has gleaned during his career, that words matter, and that \"Christ alone is the perfect union of Medium and Message.\"",
  "genres": [
    "Fiction"
  ],
  "author": "William E. Jefferson",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/20840727-messages-from-estillyen"
}