{
  "title": "Death of Innocence: The Story of the Hate Crime That Changed America",
  "description": "There are many heroes of the civil rights movement—men and women we can look to for inspiration. Each has a unique story, a path that led to a role as leader or activist. Death of Innocence is the heartbreaking and ultimately inspiring story of one such hero: Mamie Till-Mobley, the mother of Emmett Till—an innocent fourteen-year-old African-American boy who was in the wrong place at the wrong time, and who paid for it with his life. His outraged mother’s actions galvanized the civil rights movement, leaving an indelible mark on American racial consciousness. Mamie Carthan was an ordinary African-American woman growing up in 1930s Chicago, living under the strong, steady influence of her mother’s care. She fell in love with and married Louis Till, and while the marriage didn’t last, they did have a beautiful baby boy, Emmett. In August 1955, Emmett was visiting family in Mississippi when he was kidnapped from his bed in the middle of the night by two white men and brutally murdered. His crime: allegedly whistling at a white woman in a convenience store. His mother began her career of activism when she insisted on an open-casket viewing of her son’s gruesomely disfigured body. More than a hundred thousand people attended the service. The trial of J. W. Milam and Roy Bryant, accused of kidnapping and murdering Emmett (the two were eventually acquitted of the crime), was considered the first full-scale media event of the civil rights movement. What followed altered the course of this country’s history, and it was all set in motion by the sheer will, determination, and courage of Mamie Till-Mobley—a woman who would pull herself back from the brink of suicide to become a teacher and inspire hundreds of black children throughout the country.Mamie Till-Mobley, who died in 2003 just as she completed this memoir, has honored us with her full testimony: “I focused on my son while I considered this book. . . . The result is in your hands. . . . I am experienced, but not cynical. . . . I am hopeful that we all can be better than we are. I’ve been brokenhearted, but I still maintain an oversized capacity for love.” Death of Innocence is an essential document in the annals of American civil rights history, and a painful yet beautiful account of a mother’s ability to transform tragedy into boundless courage and hope.From the Hardcover edition.",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "Memoir",
    "Race",
    "African American",
    "Crime"
  ],
  "author": "Mamie Till-Mobley",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/208405.Death_of_Innocence"
}