{
  "title": "The Babylon Bee Guide to the Apocalypse",
  "description": "From the satirical minds behind the viral sensation The Babylon Bee comes the latest installment of its guide series that will teach you how to survive every potential end-times situation, from the coming communist takeover to the rise of artificial intelligence-powered death robots. The apocalypse is nigh! With the imminent threat of climate change, alien invasion, zombie attacks, dangerous MAGA terrorists, and countless other possible scenarios, the world could literally end before you finish reading this sentence. Oh, good—looks like it didn’t. But that doesn’t mean you're safe. In The Babylon Bee Guide to the Apocalypse, the writers of trusted fake news site The Babylon Bee teach you how to survive in every potential end-times situation, from the coming communist takeover to the rise of artificial intelligence-powered death robots. It’s the only way to be prepared! This book includes literally everything you need to prep for the apocalypse including the Handy attack moves to fight off zombies, commies, and other brainless monsters Easy bunker construction guides so you can get started building your own apocalypse safe space today Interior decorating tips that will wow any guests into your 50-story underground nuclear silo Weapon assembly DIY guides on how to put together the very best tools for fighting off all kinds of post-apocalyptic horrors Reports from the multiverse where we have a reporter on the ground telling you how the world ends in every possible universe Attractive infographics and charts on every page that even YOU can understand Helpful financial tips for what kind of currency and precious metals to hoard for the end of the world Funny stick figures While other books just tell you that we’re doomed and the collapse of Western Civilization is imminent, only The Babylon Bee Guide to the Apocalypse gives you the tools you need to survive it. If you don’t buy a copy, it’s not like it’s the end of the world. OH WAIT—IT IS.",
  "genres": [
    "Humor"
  ],
  "author": "Babylon Bee",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/208541184-the-babylon-bee-guide-to-the-apocalypse"
}