{
  "title": "Het verbond van het water",
  "description": "De nieuwe roman van de auteur van de bestseller De heelmeesters: een groots opgezet en fabelachtig geschreven familie-epos tegen de achtergrond van het India van de twintigste eeuwZuid-India, begin vorige eeuw. Een jonge bruid reist per boot met haar echtgenoot naar haar nieuwe thuis. Ze hebben elkaar die dag voor het eerst ontmoet bij het altaar. Hij is een wat oudere weduwnaar, zwijgzaam en net zo imposant als de olifant die hem helpt op het land. Ze wonen diep landinwaarts, in een wereld van riviertjes en kanalen, een netwerk van meren en lagunes, een doolhof van binnenwateren en lotusvijvers.Na verloop van tijd maken de angst en heimwee van de jonge bruid plaats voor innige liefde voor haar man en diens zoontje, en krijgt ze de bijnaam Big Ammachi (grote mama). Maar dan vindt er een tragedie plaats. Zo komt ze achter het bestaan van ‘de Aandoening’: een mysterie dat in elke generatie van de familie speelt en waardoor er telkens weer iemand op raadselachtige wijze verdrinkt in meertjes, plassen en ander ondiep water.Het verbond van het water vertelt het verhaal van Big Ammachi en haar zoon Philipose, die wordt gehinderd door een lichte vorm van ‘de Aandoening’ maar zich toch ontwikkelt tot een gerenommeerd schrijver. Het is ook het verhaal van haar briljante kleindochter Mariamma, die een heel ander pad inslaat en een opleiding tot chirurg volgt om het raadsel dat haar familie in zijn greep houdt op te lossen. De ontdekking van een gecodeerde stamboom en de aantekeningen van haar vader, een dwangmatige dagboekschrijver, wijzen haar de weg, maar brengen ook nieuwe geheimen aan het licht die haar in de kern van haar wezen raken.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Audiobook",
    "India",
    "Historical",
    "Literary Fiction"
  ],
  "author": "Abraham   Verghese",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/208536184-het-verbond-van-het-water"
}