{
  "title": "Jesus in the Margins: Finding God in the Places We Ignore",
  "description": "Good News UnpackedJesus is our ultimate model for finding identity, acceptance, and legitimacy from the Father. As we pull back the curtain on His life, we discover that Jesus knows what it’s like to be marginalized. He understands how it feels to have society shove you to the side, to not really be accepted, and in the end to be totally rejected. He can identify with life in the margins because when God came to earth in the person of Jesus Christ, He landed in the margins. On purpose. And He chose to land there because it’s in the margins that broken lives get mended, prisoners are set free, and the poor hear the Good News.Reimagine Your LifeWelcome to the crowded margins of life. It’s a place where normal people don’t feel normal. Where the daily grind drowns out the soft cry within that says, “I do not have it together.” Where just beneath the surface we long for meaning and—dare we hope?—wholeness.Rick McKinley writes from Only God can rescue a person from the margins. Why? Because when He came to earth in the person of Jesus Christ, in the margins is where he landed. On purpose. To find you.Don’t wait till you get yourself together. Meet Jesus in the margins just as you are, and reimagine your life through the lens of His transforming love.Story Behind the BookThis book was birthed out of Rick’s ministry at Imago Dei Community Church. Rick’s heart is to communicate God’s Word in an understandable way to those who are outside the reach of traditional churches. He often calls this “unpacking the gospel”—a gospel he sees as the predominant theme in all of Scripture. Rick says the kind of people he ministers to “are not afraid of the language of theology, but the theological ideas need to be brought down from the mountain.”",
  "genres": [
    "Spirituality",
    "Christianity",
    "Theology",
    "Nonfiction",
    "Christian Living",
    "Religion",
    "Christian"
  ],
  "author": "Rick McKinley",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/111956.Jesus_in_the_Margins"
}