{
  "title": "Here One Moment",
  "description": "If you knew your future, would you try to fight fate?\nAside from a delay, there will be no problems. The flight will be smooth, it will land safely. Everyone who gets on the plane will get off. But almost all of them will be forever changed. Because on this ordinary, short, domestic flight, something extraordinary happens. People learn how and when they are going to die. For some, their death is far in the future—age 103!—and they laugh. But for six passengers, their predicted deaths are not far away at all. How do they know this? There were ostensibly more interesting people on the flight (the bride and groom, the jittery, possibly famous woman, the giant Hemsworth-esque guy who looks like an off-duty superhero, the frazzled, gorgeous flight attendant) but none would become as famous as “The Death Lady.” Not a single passenger or crew member will later recall noticing her board the plane. She wasn’t exceptionally old or young, rude or polite. She wasn’t drunk or nervous or pregnant. Her appearance and demeanor were unremarkable. But what she did on that flight was truly remarkable. A few months later, one passenger dies exactly as she predicted. Then two more passengers die, again, as she said they would. Soon no one is thinking this is simply an entertaining story at a cocktail party. If you were told you only had a certain amount of time left to live, would you do things differently? Would you try to dodge your destiny? Liane Moriarty’s Here One Moment is a brilliantly constructed tale that looks at free will and destiny, grief and love, and the endless struggle to maintain certainty and control in an uncertain world. A modern-day Jane Austen who humorously skewers social mores while spinning a web of mystery, Moriarty asks profound questions in her newest I-can’t-wait-to-find-out-what-happens novel.",
  "genres": [
    "Fiction",
    "Audiobook",
    "Mystery",
    "Book Club",
    "Contemporary",
    "Thriller",
    "Mystery Thriller"
  ],
  "author": "Liane Moriarty",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/208516656-here-one-moment"
}