{
  "title": "Endless Knight",
  "description": "My Immortal Knight - All Knight Long By Delilah Devlin Book 3 in the My Immortal Knight series A member of an elite police unit sworn to hunt vampires, Joe Garcia's life is turned upside down when he's transformed into one. On a quest for a cure, his search brings him to New Orleans in a last ditch effort to recover his humanity. Professor Lily Carlson, a renowned expert in vampire lore, has a condition of her own. Her sexual libido has been in hyper-drive for months. Her only defense is to hide behind her glasses and tweed suits and stay as far away from men as possible. However, she's thrilled to discover vampires really do exist when Joe shows up on her balcony. Although Joe deflects her attempts to make him a case study and confirm a few vampire statistics, he is drawn by her powerful allure. When werewolves join the chase and track her through New Orleans, Joe's cop instincts tell him there's a mystery to solve. Intent on protecting her, he must seek help from the last vampire on Earth he wants to ask. While his hopes for deliverance from his fate dwindle, Lily's life is forever altered by an unexpected inheritance. My Immortal Knight - Relentless By Delilah Devlin Book 4 of the My Immortal Knight series To supercop Max Weir, the only good vampire is a dead one. Since his special police unit integrated with vampires, he's had to suppress his natural hatred to work side-by-side with the undead to hunt down and terminate the deadliest killers. Now the unit is hot on the trail of a new menace in town, a pack of werewolves prowling for vampires, who don't care whether humans get in their way. When a stakeout goes awry, Max enters a bar looking for a fight or a woman to help him blow off a little steam. What he finds is a winsome siren who has sexual appetites to match his own. Vampire Pia D'Amato is on a secret mission to take out Max-either by seduction or by turning him. He's become a liability to the Masters' Council setting up jurisdiction in southern Florida, and she isn't leaving until she's done the job. But Max is more man than she bargained for and has a deadly secret of his own.",
  "genres": [
    "Erotica",
    "Paranormal Romance",
    "Vampires"
  ],
  "author": "Delilah Devlin",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/208736.Endless_Knight"
}