{
  "title": "The Book of Cthulhu",
  "description": "The Cthulhu Mythos is one of the 20th century''s most singularly recognizable literary creations. Initially created by H. P. Lovecraft and a group of his amorphous contemporaries (the so-called \"Lovecraft Circle\"), The Cthulhu Mythos story cycle has taken on a convoluted, cyclopean life of its own. Some of the most prodigious writers of the 20th century, and some of the most astounding writers of the 21st century have planted their seeds in this fertile soil. The Book of Cthulhu harvests the weirdest and most corpulent crop of these modern mythos tales. From weird fiction masters to enigmatic rising stars, The Book of Cthulhu demonstrates how Mythos fiction has been a major cultural meme throughout the 20th century, and how this type of story is still salient, and terribly powerful today.Table of Contents:Caitlin R. Kiernan - Andromeda among the StonesRamsey Campbell - The TuggingCharles Stross - A Colder WarBruce Sterling - The UnthinkableSilvia Moreno-Garcia - Flash FrameW. H. Pugmire - Some Buried MemoryMolly Tanzer - The Infernal History of the Ivybridge TwinsMichael Shea - Fat FaceElizabeth Bear - Shoggoths in BloomT. E. D. Klien - Black Man With A HornDavid Drake - Than Curse the DarknessCharles Saunders - Jeroboam Henley''s DebtThomas Ligotti - NethescurialKage Baker - Calamari CurlsEdward Morris - Jihad over InnsmouthCherie Priest - Bad SushiJohn Hornor Jacobs - The Dream of the Fisherman''s WifeBrian McNaughton - The Doom that Came to InnsmouthAnn K. Schwader - Lost StarsSteve Duffy - The Oram County WhoositJoe R. Lansdale - The Crawling SkyBrian Lumley - The Fairground HorrorTim Pratt - CinderlandsGene Wolfe - Lord of the LandJoseph S. Pulver, Sr. - To Live and Die in ArkhamJohn Langan - The ShallowsLaird Barron - The Men from Porlock",
  "genres": [
    "Horror",
    "Short Stories",
    "Anthologies",
    "Fantasy",
    "Fiction",
    "Lovecraftian",
    "Cthulhu Mythos"
  ],
  "author": "Ross E. Lockhart",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/11196925-the-book-of-cthulhu"
}