{
  "title": "The Bank Holiday Murders: The True Story of the First Whitechapel Murders",
  "description": "Jack the Ripper stalked the streets of London’s East End from August through November of 1888 in what is dubbed the ‘Autumn of Terror’. However, the grisly ripping of Polly Nichols on August 31st was not the first unsolved murder of the year. The April murder of Emma Smith and the August murder of Martha Tabram both occurred on bank holidays. They baffled the police and press alike and were assumed by the original investigators to have been the first murders in the series. Where they correct?In this provocative work of literary archeology, author Tom Wescott places these early murders in their proper historical context and digs to unearth new evidence and hard facts not seen in over 125 years.The Bank Holiday Murders is the only book of its kind. It eschews the tired approach of unsatisfying ‘final solutions’ in favor of solid research, logical reasoning and new information. The clues followed are not drawn from imagination but from the actual police reports and press accounts of the time. The questions asked by Wescott are ones first suggested by the original investigators but lost to time until now. The answers provided are compelling and sometimes explosive.Among the revelations are: • New information linking the murders of Smith & Tabram to the same killer(s).• Proof that the police did not believe key witnesses in either case.• Proof that at least one of these witnesses was working with the murderer.• New evidence connecting many of the victims that may lead to their actual slayers.• Information on Emily Horsnell, the ACTUAL first Whitechapel murder victim.• The hidden truth of ‘Leather Apron’ and its role in unraveling the Ripper mystery.• Proof of a corrupt police sergeant who thwarted the investigation. Was he protecting the Ripper?• Much more.The Bank Holiday Murders: The True Story of the First Whitechapel Murders brings us closer than ever to the actual truth behind the Jack the Ripper story and is sure to appeal to fans of Paul Begg, Stewart P. Evans, Philip Sugden, Donald Rumbelow, Ann Rule, Patricia Cornwell as well as readers of Victorian true crime, true life mysteries and historical cold cases in general.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Crime",
    "Mystery",
    "Historical",
    "Victorian"
  ],
  "author": "Tom Wescott",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/20874160-the-bank-holiday-murders"
}