{
  "title": "The End: The Defiance and Destruction of Hitler's Germany 1944-45",
  "description": "From the preeminent Hitler biographer, a fascinating and original exploration of how the Third Reich was willing and able to fight to the bitter end of World War II.Countless books have been written about why Nazi Germany lost World War II, yet remarkably little attention has been paid to the equally vital question of how and why it was able to hold out as long as it did. The Third Reich did not surrender until Germany had been left in ruins and almost completely occupied. Even in the near-apocalyptic final months, when the war was plainly lost, the Nazis refused to sue for peace. Historically, this is extremely rare.Drawing on original testimony from ordinary Germans and arch-Nazis alike, award-winning historian Ian Kershaw explores this fascinating question in a gripping and focused narrative that begins with the failed bomb plot in July 1944 and ends with the German capitulation in May 1945. Hitler, desperate to avoid a repeat of the \"disgraceful\" German surrender in 1918, was of course critical to the Third Reich's fanatical determination, but his power was sustained only because those below him were unable, or unwilling, to challenge it. Even as the military situation grew increasingly hopeless, Wehrmacht generals fought on, their orders largely obeyed, and the regime continued its ruthless persecution of Jews, prisoners, and foreign workers. Beneath the hail of allied bombing, German society maintained some semblance of normalcy in the very last months of the war. The Berlin Philharmonic even performed on April 12, 1945, less than three weeks before Hitler's suicide.As Kershaw shows, the structure of Hitler's \"charismatic rule\" created a powerful negative bond between him and the Nazi leadership- they had no future without him, and so their fates were inextricably tied. Terror also helped the Third Reich maintain its grip on power as the regime began to wage war not only on its ideologically defined enemies but also on the German people themselves. Yet even as each month brought fresh horrors for civilians, popular support for the regime remained linked to a patriotic support of Germany and a terrible fear of the enemy closing in.Based on prodigious new research, Kershaw's The End is a harrowing yet enthralling portrait of the Third Reich in its last desperate gasps.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Germany",
    "Military History",
    "Politics"
  ],
  "author": "Ian Kershaw",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/11197125-the-end"
}