{
  "title": "His Absolute Arrangement",
  "description": "From USA Today Bestselling Author Cerys du Lys ~After marrying the dominant and reclusive Asher Landseer, billionaire CEO of Landseer Enterprises, Jessika thought she'd found love and happiness. With media slander surrounding her, and Landseer Enterprises suffering a severe security breach seemingly centered around her and Asher's marriage, she begins to question whether they can truly have a future together. Can Jessika overcome her anxiety and self-doubt towards the turmoil that seems to follow her everywhere, or would Asher be better off without her at his side?(A Cerys du Lys steamy contemporary romance novel)Jessika Fevrier never meant to become Jessika Landseer, wife to Asher Landseer, the young, handsome, and reclusive billionaire CEO of Landseer Enterprises.She never meant to become involved in one of the biggest corporate scandals in history, either. Her impossible feelings for a man she couldn't love uncovered a plot to destroy his life and his business, bringing her closer to Asher than she ever expected.Everything is in the past now, everything happened over a year ago. But the media coverage surrounding her won't stop. News articles decry her for being involved in infidelity, berate her for being a homewrecker. Despite the fact that she and Asher are married now, the press focuses on the torrid affair they had while he was locked into a marriage of convenience with a woman who never loved him; who tried to ruin him.They say love will find a way, but what if it doesn't? And what if the scandal that began over a year ago isn't over, either?The security of Landseer Enterprises is compromised. Jessika's office is ransacked by an unknown intruder. Optimism quickly becomes doubt and suspicion as the safety and future of Landseer Enterprises is called into question.Jessika and Asher have devoted themselves to each other, but it's becoming harder and harder to tell if this is the right choice. She only causes turmoil, only brings trouble, and despite his reassurance, His Absolute Arrangement, she can't help but wonder if he'd be better off without her...?(This scintillating steamy contemporary romance novel of domination and submission is ~35,000 words in length)",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Erotica"
  ],
  "author": "Cerys du Lys",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/20878319-his-absolute-arrangement"
}