{
  "title": "In A Field of Oranges",
  "description": "Sergeant Lance Smith lost his men in Afghanistan, lost his wife to divorce, and came home to an empty life. He expected to come home with his best friend, Jared. That didn’t happen either. There is one thing he needs to do. He’d promised Jared he would visit his sister if anything happened to him. It doesn’t seem like much, but Lance needs something to keep him moving forward. He just needs to track her down first.  Once a nurturing heart and a competent psychiatrist, Sierra Thomas is now hiding from the world. She tried to make a difference and failed. She couldn’t stop her brother—the brother she’d raised—from enlisting in the Marines. Then she failed her patients, ending her career. She retreated to her family’s orange groves, hoping to forget the pain of her past.   ~ ~ ~ Teaser:  Inside, Sierra still sat on the sofa, looking sleepy. She watched Lance walk in and stood up, reaching for the tray.  “No, let me do that.” He lifted it before she had a chance. “I’ll take this to the kitchen.” She nodded, and that’s when he noticed she was unsteady on her feet. He dropped the tray back on the coffee table and gently took her by the arms. “Maybe you should sit down.”  She didn’t, though. She looked up at him with deep, needy eyes and a face that clearly said, “Kiss me.”  She’s high on that pain pill.  But knowing that didn’t stop the desire rushing through him or keep him from running his hands up the bare skin of her arms. She let her gaze drop to his mouth, and that sent him over the edge. Pure, hot lust spiked right through to his groin. Fighting and losing, he brought a hand to her chin and slowly, thoroughly kissed her. Her lips felt soft and pliant, and her body leaned into his. She was kissing him too, the kiss growing deeper, her body pressing even closer. A pleasurable haze had descended on him, so he almost didn’t feel her stiffen.  She pulled back and looked at him. “That’s why you can’t stay.”",
  "genres": [
    "Romance",
    "Contemporary",
    "Military Fiction"
  ],
  "author": "Kristen James",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/20878682-in-a-field-of-oranges"
}