{
  "title": "Scarred Horizon",
  "description": "An alternate cover edition can be found here.Paul’s story. To be blind was bad enough; to question his sanity was a kick in the teeth; to give him a babysitter to monitor his every move was beyond his hard pressed endurance. Kicked out of the army and queuing at the dreaded job centre, unable to even search for employment himself had been humiliating enough. Having to stand there and wait in line while listening to the vile terrorist who had murdered his team and had taken his sight, was more than Paul could take. The warlord had to die. It was a pity that the public didn’t see it that way and a prevented a raging Paul from dishing out his own form of justice. Convincing the assault trial judge to choose an option preferable to prison was going to be an even harder task to perform. Paul’s former army mates are not going to let him be taken down without a fight but making a soft and fragrant minder a condition of his parole was a mortifying possibility that had never once crossed his mind. Amy would do just about anything so see the big, handsome man sitting in the dock regain his pride but she hadn’t reckoned on Paul’s stubborn independence. Blind beyond reason, she just can’t get through to the obstinate blockhead that she only has his best interests in mind. If her good intentions break her own fragile heart then that is something she will just have to conquer but a month of child-minding the uncooperative ex soldier is becoming even more difficult than her generous spirit can survive. With evil about to enter the beautiful château in the French countryside, will Paul open his mind and expose his hidden emotions for long enough to see the beautiful light in his forever darkened world or will his and Amy’s future perish under a viciously Scarred Horizon? Scarred Horizon gently addresses the issues of disability after injuries sustained in battle. It is an uplifting read full of romance and intrigue suitable for age 16 and above. Contains sensual sex and some swearing.",
  "genres": [
    "Romance",
    "Military Fiction",
    "Disability",
    "Contemporary",
    "Action"
  ],
  "author": "Jackie Williams",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/20875501-scarred-horizon"
}