{
  "title": "Deceptive Cadence",
  "description": "Cadence Anderson has the perfect definition of happily ever after . . .Until she doesn't. A freak earthquake shatters her life as surely as her home, taking away everything she holds dear. She wakes in a hospital to find that her beloved husband and infant daughter have been killed, crushed by the earthquake's wrath. Disoriented, injured, and alone, Cadence refuses to accept the loss. So when a man claiming to be her guardian angel appears and offers her a chance to go back in time to save her family, she doesn't need to give it a second thought. She accepts.Thrust back eleven years, she now faces the ordeal of high school all over again. But this time, she's armed with all the knowledge of her adult life and the determination to do everything better, from preventing the loss of her best friend to avoiding her original, drama-inducing boyfriends. She's focused solely on Austin, her future husband, and is content to bide her time until she meets him again.But then James Gordon crosses her path. Cadence wants to remain single, but James has his sights set. He is determined to win her over, and he's very hard to resist. As Cadence starts to develop unwanted feelings for him, she realizes he threatens to disrupt everything, changing the future and distracting her from her original goal. Now, Cadence must choose: deny the unpredictable and exciting path James offers her, or stay true to the life she had and is trying desperately to resurrect. Second chances are more complicated than they seem.Deceptive Cadence combines the soaring emotion of a heartfelt romance with the innovative storytelling of magical realism, crafting a uniquely moving, intricate tale about love and loss that asks: what would you do if given the chance to right all your wrongs?",
  "genres": [
    "Time Travel",
    "New Adult",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Young Adult",
    "Supernatural"
  ],
  "author": "Katie Hamstead",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/20875301-deceptive-cadence"
}