{
  "title": "The Prince of Punk Rock",
  "description": "I love her, but I also love him. She’s everything to me. He sets my world on fire. It's our dirty little secret, and it’s about to blow our record deal sky high. I’m Tommy Blade, the Prince of Punk Rock, and this is our story.  Warning: This book is for mature audiences only.  Tommy Blade is a man with a secret. It’s a secret he only shares with one person, Jessi Blade – and the men he surrenders to in the bedroom. Jessi’s only condition to their tumultuous sex life is that the men are one night stands. But when Angel Garcia enters their life, it’s like a match to gasoline.  Mega-talented punk rock singer Angel Garcia, with his smoldering ebony eyes, tight leather pants and unstoppable stage presence, is a man who is used to getting what he wants. He has his eyes set on Tommy Blade as his new lead guitarist, and as his life partner.  Jessi Blade, sympathetic to her husband's bisexual needs, loves him enough to share him, but she never counted on Angel Garcia to test the threshold of her marriage. He makes her life hell . . . and heaven. He’s her damnation and her salvation. She wants to hate him. She wants to despise him. But his charm and raw sex appeal are impossible to resist. Without warning, she finds herself falling in love with her husband's gay lover.  At the height of it all, their punk rock band catapults to stardom.  Their lives are marred by secrecy, deception and sacrifice. Feelings of betrayal, backlash from the sensationalistic media and threats of blackmail send them down a hard road filled with tough decisions.  They aren't your ordinary rock stars. They're radical rock stars. And they have a big story to tell.  Excerpt: The faces changed since the last time he was there, but the intention was still the same. It wasn’t a place to socialize or partake in camaraderie or drop in for a drink on your way home. It was a meeting place for men interested in casual sex. The back room served as a shanty for a quick encounter. You could stop in, get your rocks off and be on your way in half an hour. It was a smorgasbord of testosterone, a buffet of muscle and beefcake.  Men flocked around him as soon as he walked through the door. They always did. A guy once told him that it was the mixture of his rugged jaw and strong upper body, offset by the innocence of his big blue eyes that made him so attractive. The ladies always said it was his long blond hair and the guitar.",
  "genres": [
    "Menage",
    "M M F",
    "Romance",
    "M M Romance",
    "Erotica",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Jenna Galicki",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/20878588-the-prince-of-punk-rock"
}