{
  "title": "Southern Seduction Box Set",
  "description": "There's so much heat packed into one set that you'll be fanning yourself from page one until the very end! Be ready...we're going south, where it's hot and steamy...and we're not talking about the weather!Wilder Nights by N.A. Alcorn: \"You're fired.\" Two words a stripper never wants to hear from the only man she's ever loved. \nThe One\n by Jacquelyn Ayres: \"I knew someday I would get caught and everything would go to hell in a hand basket. I just didn't know she would be the one to do the catching. I didn't know she would come along and be the one.\" \nThrow Caution to the Wind\n by Kelly Collins: Seven years ago, Savannah Stone walked away from Louisiana, vowing never to return. With a suitcase in her hand and a scar on her heart she set out on a new path. Seven years later, the death of her best friend has her returning back to the place she promised herself she would never go––home. Can she bury her friend as well as her past? Sometimes you have to throw caution to the wind. \nOne Last Night\n by Laurel Ulen Curtis: Zoey Kapernack thought she was stumbling her way through One Last Night of pranks. What she got instead was Miller Laughlin...and the beginning of her love story. Hard To Handle by Ella Fox: You know what sucks? Gettin’ a Dear John letter from the love of your life five days before your wedding. Know what sucks more? That she’s back, and in order to keep my ranch, I’ve got to marry her. \nOne Summer\n by Elle Jefferson: Fulfilling her mother’s dying wish meant Maddie would be spending time in Dallas with her overbearing father and perfect brother. It was guaranteed to be the worst summer on record until she meets JR. Now her summer is about to heat up. \nSavor Me\n by Aly Martinez: I learned early on that one man wasn't enough for me. I thought Hunter Coy was going to be the one to prove me wrong. But that was before he introduced me to his best friend, Mason Wynn. \nNever Wanted More\n by Stacey Mosteller: Wyatt Parker is the boy from the wrong side of town and Peyton Williams is spoiled, entitled and a little too stuck up for someone like him. She came to college content with the idea that she never wanted more...until she met him. Hold Your Horses by Rochelle Paige: Charlotte thought she was doing the right thing when she decided to go away to college, making Shane wait four long years for her. What happens when the girl who is nervous about settling down to small-town life comes home to the guy who is ready to pop the question? \nSweet Southern Sorrow\n by Tessa Teevan: One unforgettable summer changed the lives of Cheyenne Hamilton and Sawyer Callahan. It was a summer of first love, friendship, and in the end, heartbreak. Nearly six years have passed when Sawyer and Cheyenne cross paths again. Unresolved questions, painful memories, and unwavering love soon begin to rise to the surface, but it may just be too late to recover from the summer that led to a Sweet Southern Sorrow. \nRock Country\n by K. Webster: What happens when a typical bad boy rocker comes across a sad country song? Why, you get the sweet sound of Rock Country.",
  "genres": [
    "Anthologies",
    "Contemporary Romance",
    "Romance"
  ],
  "author": "Ella Fox",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/20877731-southern-seduction-box-set"
}