{
  "title": "Who Could Ever Love You: A Family Memoir",
  "description": "New York Times, USA Today, and Publishers Weekly bestseller!\n\nA New York Times Nonfiction Book to Read this Fall\n\nA People magazine Best Book of September\n\nThe Week Five Riveting Books to Take You Through September\nMary Trump grew up in a family divided by its patriarch’s relentless drive for money and power. The daughter of Freddy Trump, son of wealthy real-estate developer Fred Trump, and Linda Clapp, a flight attendant from a working-class family, Mary lived in the shadow of Freddy’s humiliation at the hands of his father.Fred Trump embodied the ethos of the zero-sum game, and among his five children there could only be one winner. That was supposed to be Freddy, his namesake, but Fred found him wanting—too sensitive, too kind, too interested in pursuits beyond the realm of the real-estate empire he was meant to inherit. In Donald, Fred found a kindred spirit, a “killer,” who would stop at nothing to get his way. Even after Freddy’s short-lived career as a professional pilot for TWA came to an end, he never stopped trying to gain his father’s approval. In Who Could Ever Love You, Mary Trump brings readers inside the twisted family whose patriarch ignored, froze out, and eventually destroyed his own. Freddy Trump’s descent into alcoholism and illness, along with Linda’s suffering after their divorce, left Mary dangerously vulnerable as a young girl. Inadequately and only conditionally loved, there were no adults in her life except for the father she loved but lost before she could know him; and a mother abandoned by her ex-husband’s rich and powerful family who demanded her loyalty but left her with nothing.With searching insight, poignant detail, and unsparing prose, Mary Trump reveals the cold, selfish cruelty that has come to define the Trump family thanks in large part to her uncle, whose malignant ambition has riven America and threatens the world.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Audiobook",
    "Biography",
    "Politics",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Mary L. Trump",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/208840797-who-could-ever-love-you"
}