{
  "title": "Revenge of the Viper",
  "description": "Revenge of the Viper is (Book #2) in the Bestselling series HAVEN, following A Stranger Magic (BOOK #1) which is available as a FREE download on Amazon!  The Great War of Haven ended thirteen years ago but Alisa Dalcome is about to discover that the war did not end for her. Placed on Earth as a sleeper agent for the Majesty of Haven, Alisa had one objective—protect the portal keys at all costs. In the wrong hands the magical keys could jeopardize the safety of everyone on Haven. But Alisa’s relocation was more than just Majesty business; it was also a chance for her to escape her enemies, enemies that still wanted her dead. Alisa wasn’t thinking about herself when she left Haven, she was thinking about her children Sam and Sarah. The Great War had already taken her husband Rylan; she would be damned if she would let it take her children too. But what Alisa didn’t count on was her inquisitive son Sam and his friend Travis. Sam’s world has turned upside down after discovering magic is real. After barely escaping the caves Sam begins to piece together the past day’s events when he stumbles onto his mother’s secret past. With the clues mounting, Sam must dig deeper to uncover the truth that could change his life forever. But Sam doesn’t realize that his mother’s past has already caught up with them. Hidden within the shadows nearby is Haven’s most malevolent predator—the Viper. A hunter forged from the blackest of magic, it watches, waiting for the perfect moment to strike. Can Sam uncover the truth in time or will his mother’s past collide with the present placing them all in grave danger?  HAVEN SERIES: Known as a place of refuge, Haven is a sanctuary for those with supernatural abilities. Decades of peace between the Witches, Vampires, Goblins, Elves, and Orcs is coming to an end. Now the once tranquil world is shrouded in deception and corruption. Dark secrets tear at the very fabric of their alliance, giving way to an evil that stirs in the shadows. Exhilarating and utterly gripping, the HAVEN series is an action-packed journey full of suspense, magic, mystery, and intrigue.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Urban Fantasy",
    "Magic"
  ],
  "author": "D.C. Akers",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/20881080-revenge-of-the-viper"
}