{
  "title": "Deep In The Bin Of Bob",
  "description": "Amardeep Thinqir is a fourteen year old boy, and he’s keeping his thoughts to himself. He lives on a council estate in South London. He has no friends. Adults view him with mistrust. Children think he’s a weirdo. He reads books. He looks out of his bedroom window and imagines the life he wants to live that he isn’t. We join Amardeep as he quietly stands at the foot of the tallest building he’s ever seen, with his hands over his eyes looking up with a mix of disbelief and wonderment. A rainbow coloured hot air balloon crashes into the building. The hot air balloon is something beautiful in Bermondsey: a flower growing through concrete. A girl screams from the rooftop and a big black dog falls from the sky and lands on the bonnet of an old two door car from the eighties. A little old lady needs help balancing three wheelbarrows, and something unusual is happening to the weather. Deep decides to help the old woman, journey to the hot air balloon, save the girl, and stop off along the way to deliver some bad news to the owner of a black dog and a 1984 Ford Fiesta. Deep in the Bin of Bob is dark, funny, philosophical and packed with original thought. This is a story that holds a magnifying glass to the cruelty of man, and delights in pointing out the sublime in the hideous. AWARDS Craig Stone's second novel Life Knocks was shortlisted for the world respected Dundee International Book Prize. INFORMATION ON AUTHOR CRAIG STONE INTERVIEW WITH BBC http://bit.ly/BBCComedyCafe THE DUNDEE INTERNATIONAL BOOK PRIZE http://www.dundeebookprize.com/ http://www.deadlinenews.co.uk/?p=51086 TWITTER https://twitter.com/craigstone_ WEBSITE www.thoughtscratchings.com FACEBOOK https://www.facebook.com/craig.stone.... A MESSAGE FROM THE AUTHOR... The simple truth is, I will get nowhere without your help. I need readers to read #DeepInTheBinOfBob, so if you are looking for a book to read, or want to try a new author, please, try me. It would mean the world if you did. Thank You.",
  "genres": [],
  "author": "Craig  Stone",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/20882991-deep-in-the-bin-of-bob"
}