{
  "title": "Nuclear Threat Thriller Series",
  "description": "Mass Destruction has special guest appearances by Betrayed's Brandt, Davidson, Svengard and Lopez!  From Carolyn McCray the #1 author in Men's Adventure, Action/Adventure, Techno-thrillers and War comes Mass Destruction, the first book in the Nuclear Threat Thriller Series.  **Warning this book is filled with high octane action and roller coaster thrills. Please only buy this book if you are prepared to strap on your seat-belt!  And for those of you who are familiar with the Betrayed universe, this book takes place pre-Rebecca   Praise for Mass Destruction... \"I thought it was brilliant to bring in characters that are known and loved as supporting characters with Van and her team doing most of the heavy lifting. Enough believeable back and forth misdirection to make your head spin and wonder if your own passport has been stamped as you swear you were there too. This book, like most of Ms. McCray's drag you in and make you actually feel for the characters and emote with them at time. I smiled when they smiled, I was worried when they were. It's that kind of writing that makes me come back for the next McCray Novel time and time again.  The underplot was so intriguing as you didn't know what was going to come of it until its conclusion only to find that it opens the door for more story arcs down the road in this series. I cannot wait to read more about Van, her crew and the journey they are about to take. Hopefully there will be more tie-ins in other books but I hope a few books only have limited guest appearances so that Van can shine on her own too.\" Demon Amazon Reviewer  \"Loved it! The twists and turns are dizzying! I loved the female lead character, Van, a cool headed, General's daughter who can match the men and then some.  Of course, I also enjoyed the literary reunion of Brandt's team. I love that Lopez can pull of the impossible, it is fiction after all!  We get to see Brandt's analytical and logistic skills as he is in charge of protecting the president and world leaders from a terrorist threat at the G8 summit. Carolyn has a knack for providing very dynamic and interesting periphery characters too. A really great cat and mouse adventure.\" Kristy Martin Amazon Reviewer  Overview: Did you know that over four DOZEN times a year nuclear material is either lost or stolen? That is where the UN's NMRT (nuclear materials recovery team) comes in. Tracking down rogue spears, broken arrows and suitcase nukes, add in Brandt's team's tendency toward explosive action, and you've got quite a thriller.  More praise for Mass Destruction... \"This first installment to the \"Nuclear Threat Thriller series takes off like a bullet......quite literally in the very first sentence, right over Van's head in a nuclear power plant no less!  Just another brilliant example of how Ms. McCray can take a subject that has been done over & over and put such a spin on it that it takes on a whole new life and direction of it's own... Just believe me when I tell you that you are in for a sit back and buckle up kind of ride that can only come from the mind of Carolyn McCray!!!!\" Anna Salaman Amazon Reviewer  If you enjoy Tom Clancy, Brad Thor or James Rollins, you are going to love the roller coaster adventure of Mass Destruction!  **If you were looking for the new collection with Van, Adian, Brandt and Lopez simply search under Nuclear Threat Thriller Series.",
  "genres": [
    "Thriller",
    "Science Fiction"
  ],
  "author": "Carolyn McCray",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/20880013-nuclear-threat-thriller-series"
}