{
  "title": "The Taste Of Metal",
  "description": "\"It's like I've got a shotgun in my mouth, with my finger on the trigger, and I like the taste of the gun metal...\" - Robert Downey Jr.The drugs just sort of happened. It's not like I'd traveled to Denver, Colorado to become immersed in the burgeoning marijuana scene, although it was hard to avoid. When I showed up, the pot industry in the Rocky Mountains was booming and with the recent passing of Amendment 64, was on the tipping point of becoming revolutionary. Still, legal weed was the furthest thing from my mind on the day I abruptly quit my job at the office, cashed out my 401k retirement fund and hopped a plane from the east coast to the Mile High City. I did this under the false impression that it was to help out an old best friend who was in need, but really, it was all in the name of a forbidden love that I'd been repressing for years.I was only supposed to stay in Denver for a week, but when I met Reed, an Iraq war vet who managed a marijuana dispensary and smoked copious amounts of his product to deal with his PTSD symptoms, he hooked me up with a job delivering weed to dispensary patients, and my trip was perpetually extended. While I coped with the maddening futility that comes along with the wanting of something I couldn't have, I found myself escaping into a lifestyle entrenched in concerts, bars, drugs, and masochism, all set against the neon of Denver's notoriously wicked Colfax Avenue. What followed was a furious, chaotic journey through the emotional depths of a bittersweet addiction. And even though it nearly killed me, I grew to embrace it, I even begged for it; the precarious situations, the constant killing of time, the sleepless nights, the loneliness, the fear, the desire, the ache, the denial, the inconceivable belief that I could actually control the cravings and the constant longings and the endless capacity to never, ever get enough, while my haunted soul thumped in unison with my old heart, mercilessly demanding more and more and more and more...  But I guess that's the whole point. I'm not even talking about the drugs anymore, at least not the ones you're thinking of.",
  "genres": [],
  "author": "Joe Hnida",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/20882572-the-taste-of-metal"
}