{
  "title": "Taken By Storm",
  "description": "From New York Time Bestselling Author Opal CarewWhen Jessica is almost run over by a red hot rock musician on a motorcycle, she knows he’s exactly the kind of dangerous character she needs to avoid. But he insists on turning her safe little world upside-down... and she finds herself losing her heart.Storm doesn’t expect to find the excitement he’s seeking in this tiny little town. Until he meetsJessica. She’s sweet and sexy. And she’s the first woman to see past his defenses to the real him. But settling down is not on his agenda, so when she starts to fall for him... and he’s feeling that same dangerous stirring... he knows it’s time to hit the road.5 “Taken by Storm is another scorchingly hot erotic story by the talented Opal Carew.”Summer’s Book Blog Taken by Storm is the prequel to His to Possess and His to Claim.~ ~ ~To hear about Opal’s latest releases, sign up for her newsletter at OpalCarew.com/newsletterYou can keep in touch using the following  OpalCarew.com OpalCarew.com/newsletter facebook.com/OpalCarewRomanceAuthor @opalcarew opalcarew.tumblr.com/ bit.ly/OpalsBlogPinterest pinterest.com/opalcarew/ goodreads.com/author/show/206712.Opal...~ ~ ~Praise for Opal's other 5 Stars!\"No one writes stories about erotic fantasies better than Opal Carew...Kudos to Opal Carew for another well-written erotic romance. I look forward to where she takes us next.\"~ Jennifer Porter, Romance Novel News4.5 Stars!\"...there are a lot of twists to this roller coaster ride of a story... A scorcher of a read, I was unable to put this one down.\"~ Sensual Reads4.5 Kisses!\"another blazing hot romance not to be missed by erotic author Opal Carew. Once I started this book, I just couldn’t put it down... [her] erotic story-writing talent shines through... one wild ride of a book that just whets my appetite for more erotic romance by Opal Carew!\"~ Victoria, TwoLips Reviews\"4.5 Blue Ribbons!\"a blazing hot erotic romp... A fabulously fun and stupendously steamy read for a cold winter's night. This one's so hot, you might need to wear oven mitts while you're reading it!\"~ Romance Junkies4 Cups!\"There is little chance of reading anything more sexually stimulating than a book by Opal Carew.\"~ Lototy, Coffee Time Romance More",
  "genres": [
    "Erotica",
    "Contemporary",
    "Romance",
    "Anthologies"
  ],
  "author": "Opal Carew",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/20890159-taken-by-storm"
}