{
  "title": "National Singles Day",
  "description": "Ladies & gentlemen, buckle those seat belts . . .\nThe moment I stepped onto the plane and Jack handed me a flute of champagne, I knew I was in trouble.Our hands brushed, and I lost myself in his crystalline gaze.Gah! Just stop!That sounds like some kind of sappy romance. I'm a freakin' baseball player, a strong guy, a real dude. Sure, I play for the Memphis Mangos, basically the Harlem Globetrotters of America's pastime, but I'm a serious player, doggonit.I would never turn to mush or have wobbly legs over a guy, certainly not in front of a planeload of men who'd love nothing more than to give me sh.. for the next twelve days of our vacation.And I would never give him my phone number and email address, then let him fly me to his hometown for a five-day first date.That would be insane, right?Man, it was awesome. He was so amazing and hot and . . .And yes, every time Jack looks at me, my world tilts. When that stupid curl falls across his forehead and refuses to stay back, no matter how many times I shove it into place for him, I swoon just a little bit more.But I don't need a man. I'm single and happy. I'm totally self-sufficient. Romance is for wimps.And then he kissed me and . . .Man, I’m screwed.National Singles Day is a hilariously romantic, low angst, utterly irreverent m/m romance in which men separated by distance find love and comfort in each other's arms—and in the claws of a cat. A found family of lifelong friends rounds out this cast of smokin' hot, cheeky, sometimes snarky characters who will make you laugh until you piddle.Yeah, you. I see you. You're a piddle in the making. While 96.7% of this novel is humorous and light, there is one scene in which a character grapples with unresolved feelings from a relative's suicide that occurred sometime in the past.Aside from that, the book is basically a warm blanket and hot chocolate on a wintery day - oh, and there's spice. Lots of spice. Don't burn your tongue.",
  "genres": [
    "M M Romance",
    "LGBT",
    "Romance",
    "Sports",
    "Military Fiction",
    "Contemporary",
    "Gay"
  ],
  "author": "Casey Morales",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/208853384-national-singles-day"
}