{
  "title": "The Information: A History, a Theory, a Flood",
  "description": "Gleick, James. The Information: A History, a Theory, a Flood. London, Fourth Estate, 2012. 13 cm x 20 cm. 527 pages. With several illustrations. Original softcover. Excellent condition with only minor signs of external wear. Some underlining by preowner on several pages. Otherwise clean inside with solid binding. Includes the following chapters: Drums That Talk / The Persistence of the Word / Two Wordbooks / To Throw the Powers of Thought into Wheel-Work / A Nervous System for the Earth / Information Theory / Into the Meme Pool / New News Every Day etc. Winner of the Royal Society Winton Prize for Science Books 2012, the world's leading prize for popular science writing. We live in the information age. But every era of history has had its own information revolution: the invention of writing, the composition of dictionaries, the creation of the charts that made navigation possible, the discovery of the electronic signal, the cracking of the genetic code. In ‘The Information’ James Gleick tells the story of how human beings use, transmit and keep what they know. From African talking drums to Wikipedia, from Morse code to the ‘bit’, it is a fascinating account of the modern age’s defining idea and a brilliant exploration of how information has revolutionised our lives. (Amazon) James Gleick (born August 1, 1954) is an American author and historian of science whose work has chronicled the cultural impact of modern technology. Recognized for his writing about complex subjects through the techniques of narrative nonfiction, he has been called 'one of the great science writers of all time'. Gleick's books include the international bestsellers Chaos: Making a New Science (1987) and The Information: A History, a Theory, a Flood (2011). Three of his books have been Pulitzer Prize and National Book Award finalists; and The Information was awarded the PEN/E. O. Wilson Literary Science Writing Award in 2012 and ..",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Technology",
    "Philosophy",
    "Computer Science",
    "Audiobook"
  ],
  "author": "James Gleick",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/11199737-the-information"
}