{
  "title": "The Red Team Series Boxed Set #1-3",
  "description": "Red Team 1-3 Boxed Set is a complete collection of the first three sexy romantic suspense stories in the series--a combined page count of over 1100 pages, including:  1) The Edge of Courage  Haunted by memories he cannot reach, stalked by an enemy bent on revenge . . .  Rocco Silas has come home to Wyoming after long years as a Red Team operative in Afghanistan. It isn't easy returning to civilian life, especially burdened as he is with a staggering case of PTSD or hunted as he is by an enemy determined to seek an eye-for-eye--neither of which can he battle until he confronts the truth of what happened one fateful day in the high mountain ranges of the Hindu Kush.  . . . She alone holds the key to his sanity.  Mandy Fielding's dream of opening a therapeutic riding center on her family's ranch is almost within her grasp--until she hires Rocco Silas, a dangerous ex-Spec Ops friend of her brother's. His haunted eyes and passionate touch promise a love she never dared believe possible. Can they confront the truth of his past and build a future together or will the enemy stalking him destroy them both?  2) Shattered Valor Every step leads her deeper into danger...  Eden Miller has her life arranged exactly as she wants it--until a reunion with her high school BFFs places her in the middle of a turf war with a ruthless prison gang, their terrorist allies, and the hunters tracking them. Her every move draws her deeper into the danger surrounding Ty Bladen and his team of terror fighters, but his seductive charm and engaging smile make her believe his promises of protection.  A secret is a dangerous thing...  When the terrorists Ty Bladen is tracking infiltrate his remote ranch in Wyoming, he learns the past he buried cannot be so easily escaped. Though he's recovering from a bullet wound he received in Afghanistan and is hunted by an unseen enemy, he knows he can't leave Eden alone to face the danger swirling around her, danger he and his team have brought to her--even if he has to risk letting her near his frozen heart. But when she learns his terrible secret, will she stay or will she run?  3) Honor Unraveled Love Isn't a Battle... Kit Bolanger, ex-spec ops soldier, has followed the trail of an international drug lord back to his childhood town, the one place he swore never to return. He and his team of terrorist hunters are the only thing standing between the town's residents and the evil threatening them. It doesn't help to know that she's here--the woman who betrayed his trust and shredded his heart.  ...It's a War and He's Offering No Quarter Deciding to put roots down, Ivy Banks has brought her daughter home to the sleepy ranching community of Wolf Creek Bend, Wyoming--the one place where she was certain she'd never run into her high school flame. But he's back, fighting a global enemy and homegrown terrorists in a hidden war that puts their lives and their hearts in jeopardy. He was bad news in high school, and he's even worse news now.  Surrendering to him is not an option...but it's the only thing he'll accept.  ---------------------------------------------------------------------------------------------- Ages: 18 & up (collection contains sex, profanity, and violence) Length: over 1100 pages combined!",
  "genres": [
    "Contemporary Romance",
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Military Romance",
    "Anthologies",
    "Contemporary"
  ],
  "author": "Elaine Levine",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/20888094-the-red-team-series-boxed-set-1-3"
}