{
  "title": "The Complete Emi Lost & Found Series",
  "description": "Emi Lost & Found series - Winner of the Best Happily Ever After of 2013 - HEA Bookshelf“THE BEST BOOKS YOU'RE NOT READING. This series runs the gamut of emotions. I felt everything from pure joy and happiness to absolute devastation.” - Kelli, Alphas, Authors and Books Oh My“Lori Otto managed to pull me in to the story so that I was so engrossed, entwined with it, so much that I didn’t know where the story ended and I began.” - StacyHGG, Books Unhinged Book BlogThis special edition contains Not Today, But Someday; Lost and Found; Time Stands Still; Never Look Back; and two short stories: Love, Lost and In the Mind of a Dying Man.Not Today, But Someday (prequel)Nate Wilson knows he wants Emi Hennigan from the moment he sees her. Emi knows she needs Nate after one night together. A life-long friendship is born, and a pact is made to ensure that nothing will come between them.Lost and Found (book one)After swearing off love with Emi in a silly high school pact, Nate has been seeing other women in hopes of finding one that evokes stronger feelings than the ones he’s been harboring for Emi since he was a teen. Over the span of a year, boundaries are crossed, feelings are confessed, and their unique friendship begins to blossom into something more. With a promising future ahead of them both, fate intervenes to bring two soul mates together.Time Stands Still (book two)No man could compete with Nate, Emi thought, until one night – one evening, one party, one journey, one second alters her course completely. That night, her brother’s best friend, Jack Holland, comes back into her life with a mission. In a year’s time, he slowly finds a comfortable place in Emi’s life, but only time will tell if it’s right for Emi – and enough for him.Never Look Back (book three)To say Emi’s life over the past two years has had its share of peaks and valleys is an understatement – and her friends and family would agree. In the conclusion to Emi Lost & Found, Jack guides Emi through a year of self-discovery, and teaches her that faith in true love – and in soul mates – can yield happiness from even the darkest of places.Plus two bonus short stories!Love, Lost and In the Mind of a Dying ManPhotographer and Cover Designer : Christi Allen CurtisPhotography Assistant : Katrina Boone",
  "genres": [
    "Romance",
    "Contemporary",
    "New Adult",
    "Contemporary Romance",
    "Friends To Lovers",
    "Young Adult",
    "Death"
  ],
  "author": "Lori L. Otto",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/20888295-the-complete-emi-lost-found-series"
}