{
  "title": "Enjoying Research from Canada to Argentina: Autobiography of a Biomedical Investigator",
  "description": "One often wonders how much of life is predetermined and how much is due to chance. Without a doubt, genes play a role in determining a vocation but the actual path we tread depends on subjective decisions and when chance steps in, we can make the most of it. By choosing between two possible paths -taking one and rejecting the other- destiny is forged. As I begin this the story of my life, I wish to emphasize how the different paths I have taken, have given me very particular satisfaction. I have always liked and enjoyed my life. My story covers a period of more than ninety years during which many important cultural and scientific changes have occurred. I have been both a spectator and a participant in the profound changes in the role of women in society and in science. Born in France, and raised in Canada, I eventually took up Argentine citizenship. As a result I was exposed to three well-defined cultures: French, English and Argentine. After falling in love with Argentina, I fell in love with an Argentine, Rodolfo Pasqualini whom I married. Together we raised five children who have given us great pleasure as well as seventeen grandchildren and twelve great-grandchildren. From a very early age, I knew that I had inherited a vocation for science from my father and grandfather. I have been doing full-time research in the biomedical field since I was nineteen years old. At first, I worked with Hans Selye, Alejandro Lipschütz, C.N.H. Long and Bernardo Houssay. After that, I continued to work in different types of research as a member of the Research career of the Argentine National Research Council (CONICET) and I finally became an Emeritus Investigator. I have trained many students, some of whom went on to occupy important positions in Argentina and abroad. I am the first woman to occupy a permanent chair in the National Academy of Medicine and it took sixteen years to elect a second woman. I have led a double life, one of which is my family and the other my research. Both are priorities for me. I am now ninety three years old and I still hold the fort. I continue to enjoy my work, my children, my grandchildren and my friends. The culmination of a good life, so why not tell the story?",
  "genres": [],
  "author": "Christiane Dosne Pasqualini",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/20892319-enjoying-research-from-canada-to-argentina"
}