{
  "title": "Bernard Bolzano: Theory of Science",
  "description": "A classic of Western philosophy available in English for the first time A wide-ranging work which revolutionized logic, and offered a radically new approach to the theory of knowledge Bolzano's work is a model of clarity and precisionThis is the first complete English translation of Bernard Bolzano's four-volume Wissenschaftslehre or Theory of Science, a masterwork of theoretical philosophy. Bolzano (1781-1848), one of the greatest philosophers of the nineteenth century, was a man of many parts. Best known in his own time as a teacher and public intellectual, he was also a mathematician and logician of rare ability, the peer of other pioneers of modern mathematical logic such as Boole, Frege, and Peirce. As Professor of Religion at the Charles University in Prague from 1805, he proved to be a courageous and determined critic of abuses in church and state, a powerful advocate for reform. Dismissed by the Emperor in 1819 for political reasons, he left public life and spent the next decade working on his \"theory of science,\" which he also called logic. The resulting Wissenschaftslehre, first published in 1837, is a monumental, wholly original study in logic, epistemology, heuristics, and scientific methodology. Unlike most logical studies of the period, it is not concerned with the \"psychological self-consciousness of the thinking mind.\" Instead, it develops logic as the science of \"propositions in themselves\" and their parts, especially the relations between these entities. It offers, for the first time in the history of logic, a viable definition of consequence (or deducibility), and a novel view of probability. Giving constant attention to Bolzano's predecessors and contemporaries, with particular emphasis on Kant, this richly documented work is also a valuable source for the history of logic and philosophy. Each volume of the edition is accompanied by a detailed introduction, which alerts the reader to the historical context of Bolzano's work and illuminates its continued relevance.Readership: Scholars and advanced students in philosophy, logic, and intellectual history.*Copied from the Oxford University Press website: http://ukcatalogue.oup.com/product/97...",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Logic"
  ],
  "author": "Bernard Bolzano",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/20891021-bernard-bolzano"
}