{
  "title": "Becoming An Authority: Stop Waiting For Permission To Dominate Your Niche And Start Making A Difference",
  "description": "Becoming An AuthorityStop Waiting For Permission To Dominate Your Niche And Start Making A DifferenceIn the past, becoming an authority in anything meant waiting for gatekeepers to tell you that you had permission. “Someone else” had the power to decide if your social status was “good enough” to be taken seriously or if you had the “proper credentials” to become what you wanted.Fast forward to today and there is no permission needed. You can be whatever you want and there is no one that can stop you! WE KNOW, this sounds like what your Mom told you growing up, but she was right!In this book, we will try and help you see defining yourself as an Authority in a little different manner, showing you how to step out of the shadows and into an amazing new life with or without the blessing of an indefinable “someone” with perceived “higher jurisdiction”.Who this book is for... Anyone who has a dream of turning their passions into reality Authors Speakers Coaches and trainers Bloggers Podcasters Professional services people who want to segue out of day to day practice People who are not using their education (right now) Stay at home parents who want to return to the workforce but do not want a \"job, job\" Students who are just entering the workforceIncluded in the book:IntroductionBuilding Authority Takes Time- The Path To AuthorityAccreditation- A college degree or advanced degree- A franchised opportunity- Made up accreditationsAchievement- But what if someone asks what qualifies you to be an Authority?Authority- Choosing What To Be An Authority In- 10 Steps To Becoming An Authority In Your Industry- 10 Ways To Actively Show Your Authority-nessFAQsConclusionAbout The Authors (or, what gives us the Authority?)Copyright and DisclaimerAbout The AuthorsThe Marketing & Media Monsters dynamic duo, Tara Jacobsen and Rebekah Welch, are a power house of knowledge armed with a plethora of education, experience, and real-life successes. With two distinctively different marketing styles, The Monsters are true pros at recognizing the unique gifts and skills that each one of their eager students and clients offer the world, and designing systems and strategies completely geared toward and supportive of the things that come the most naturally to those they lead. They don’t believe in tearing people down or disabling what they have in place, rather they pull all the best pieces and show their clients how to work with what the already have. By employing this simple approach they are able to equip small business owner with tools that they can feel comfortable using and will provide focused, measurable results quickly.",
  "genres": [
    "Business"
  ],
  "author": "Tara Jacobsen",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/20891229-becoming-an-authority"
}