{
  "title": "Not Fade Away: A Memoir of Senses Lost and Found",
  "description": "Even a darkening world can be brilliantly lit from within.Born with a rare genetic mutation called Usher Syndrome type III, Rebecca Alexander has been simultaneously losing both her sight and hearing since she was a child, and was told that she would likely be completely blind and deaf by age 30. Then, at 18, a fall from a window left her athletic body completely shattered. None of us know what we would do in the face of such devastation. What Rebecca did was rise to every challenge she faced. She was losing her vision and hearing and her body was broken, but she refused to lose her drive, her zest for life and – maybe most importantly – her sense of humor. Now, at 35, with only a sliver of sight and significantly deteriorated hearing, she is a psychotherapist with two masters’ degrees from Columbia University, and an athlete who teaches spin classes and regularly competes in extreme endurance races. She greets every day as if it were a gift, with boundless energy, innate curiosity, and a strength of spirit that have led her to places we can't imagine.  In Not Fade Away , Rebecca tells her extraordinary story, by turns harrowing, funny and inspiring. She meditates on what she’s lost—from the sound of a whisper to seeing a sky full of stars, and what she’s found in return—an exquisite sense of intimacy with those she is closest to, a love of silence, a profound gratitude for everything she still has, and a joy in simple pleasures that most of us forget to notice.Not Fade Away is both a memoir of the senses and a unique look at the obstacles we all face—physical, psychological, and philosophical—exploring the extraordinary powers of memory, love, and perseverance. It is a gripping story, an offering of hope and motivation, and an exquisite reminder to live each day to its fullest.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Disability",
    "Biography",
    "Health",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Rebecca  Alexander",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/20893350-not-fade-away"
}