{
  "title": "The Celtic Fan",
  "description": "The Celtic Fan. It's a number one bestseller on every list. It's a love story for the ages. And it's a mystery. At least its author is. Nick Roberts has never been seen. He doesn't do interviews. He doesn't answer fan mail. He doesn't do late-night talk shows, or book signings, or conferences. No one knows who he is. Everyone is looking for him; websites have been set up offering rewards for finding him. Four old friends plan their annual road trip. It's been a toss-up every year, with each being different (and some not so good). But this year Russ's idea is to find Nick Roberts. With an address stolen from the accounting files of the publishing house that's home to The Celtic Fan, the four friends set out to find the elusive Roberts and make names for themselves. And as three begin to get distracted - Russ by women, Michael by liquor, and Jim by porn or who knows what - only one stays the course: Steve Riley, a journalist from Knoxville, is determined to find Roberts and land the story of the century. His dedication to his mission is complicated by a deluge, a flash flood, and an obviously incorrect address. But as time has its way, Steve begins to wonder if his trip will be successful in other ways. And if his suspicions are correct, what will he do when they're confirmed? Even more unsettling is the real question: If he finds Nick Roberts, will he tell? Set in the foothills of the beautiful Smokey Mountains, The Celtic Fan is two stories - the story of a journalist following his biggest story ever, and of a wounded soldier and the girl with whom he falls in love post-World War II. Throughout the pages, Bill and Claire's tragic tale winds its way through Steve's story, a sweet and sensual account he never thought he'd tell. Take the time to savor and enjoy his telling, and bring your tissues - you'll need them.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "Historical",
    "Contemporary"
  ],
  "author": "Deanndra Hall",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/20892760-the-celtic-fan"
}