{
  "title": "On the Road with Janis Joplin",
  "description": "One of Parade 's Top Ten Rock n' Roll ReadsAs a road manager and filmmaker, he helped run the Janis Joplin show—and record it for posterity. Now he reveals the never-before-told story of his years with the young woman from Port Arthur who would become the first female rock and roll superstar—and depart the stage too soon. In 1967, as the new sound of rock and roll was taking over popular music, John Byrne Cooke was at the center of it all. As a member of  D.A. Pennebaker’s film crew, he witnessed the astonishing breakout performances of Janis Joplin and Jimi Hendrix at the Monterey Pop Festival that June. Less than six months later, he was on a plane to San Francisco, taking a job as road manager for Janis and her band, Big Brother and the Holding Company. From then on, Cooke was Joplin’s road manager amid a rotating cast of musicians and personnel, a constant presence behind the scenes as the woman called Pearl took the world by storm. Cooke was there when Janis made the difficult decision to leave Big Brother and form a new band. He was with her when the Kozmic Blues Band toured Europe in the spring of 1969, when they performed at Woodstock in August, and when Janis and Full Tilt Boogie took their famous Festival Express train trip across Canada. He accompanied Janis to her friend and mentor Ken Threadgill’s 70th birthday party, and was at her side when she attended her tenth high school reunion in Port Arthur, Texas. This intimate memoir spans the years he spent with Janis, from her legendary rise to her tragic last days. Cooke tells the whole incredible story as only someone who lived it could. INCLUDES PERSONAL PHOTOGRAPHS",
  "genres": [
    "Nonfiction",
    "Music",
    "Biography",
    "Memoir",
    "History",
    "Audiobook",
    "Autobiography"
  ],
  "author": "John Byrne Cooke",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/20893478-on-the-road-with-janis-joplin"
}