{
  "title": "Coral Hare: Atomic Agent",
  "description": "An intrepid teenage OSS agent goes behind enemy lines to stop the Japanese atomic bomb project during World War II. Sweet-yet-sassy, Mina was once your average 1940s teenager. She watched Saturday afternoon serials, slurped cherry Cokes, and delighted in Frank Sinatra and big band swing. Then she watched her father die trying to save a U.S. Navy sailor from the burning wreckage of Pearl Harbor, as he is strafed by a Zero fighter plane. And oh yeah—Mina is Japanese American. Fighting racial prejudice, Mina joins the OSS (the precursor to the modern-day CIA) to avenge her father, and this Hawaiian-born schoolgirl becomes embroiled in a war she never thought she would be part of. Her life becomes a whirlwind odyssey of redemption, loss—and vindication. Code-named \"Coral Hare,\" this undercover doe-eyed, gun-toting firebrand is Uncle's Sam's secret weapon against the Empire of Japan. But the Empire of Japan has an ace up its sleeve—the development of a devastating new weapon that will usher in a new era—the atomic bomb. Armed only with her wits and a handful of real-life gadgets, Mina must venture alone behind enemy lines to stop the Empire of the Rising Sun from extending its rays across the face of the globe. With details woven together from actual historical events surrounding Japan's World War II atomic weapons projects, the journey follows this pint-sized Hawaiian princess from the streets of Tokyo, to the rustic outback of Korea, to the malaria-infested jungles of the Pacific in her mission to prevent atomic annihilation. Seamlessly blending poignant moments of heartache with blast-from-the-past, high-octane derring-do, Coral Hare is an elegantly woven tale of perseverance and courage that everyone from our Greatest Generation to Millennials can savor.",
  "genres": [
    "Thriller",
    "Historical Fiction",
    "Espionage",
    "Young Adult",
    "World War II",
    "War",
    "Spy Thriller"
  ],
  "author": "Clive Lee",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/20894676-coral-hare"
}