{
  "title": "Impossibly",
  "description": "Two shattered souls...backed into a corner and ready to fight for their lives, for each other, for their impossible love... \nKassenia Bennett isn't your normal 25-year-old spoiled rich girl from Fairfield, Connecticut. Her life was ruined forever when her father killed her entire family in a tragic murder-suicide. Willing to do whatever it takes, she's determined to make a life for herself. Start her own business. Change the world. Declan knows the feel of pain, he knows the taste of blood, and he knows what it's like to be alone. The muscled, tattooed outlaw biker only cares about one thing in this world, his club Dante's Nine—they're the only family he's ever known...and he's willing to pay the ultimate price to save his brothers from ruin. Desperate to get the cash his club needs, Declan agrees to fight in a series of underground death matches—where the stakes are high, and only one man leaves the ring alive. With three fights down and one more to go, the Dante's Nine MC is almost back on its feet. When Kassenia answers an unlikely Craigslist ad for a dream summer internship in Las Vegas, she has no idea she's about to fall into the web of the dangerous and mysterious badass biker Declan Tiberi. He'll move her out to Vegas, give her the funding, resources, and business connections to start her company...the only catch: she has to sign a contract promising that she won't fall in love with Declan—if she does she'll lose everything. Kassenia knows he's off-limits, untouchable, that he's the worst man she could possibly want. Declan knows she's the sexiest woman he's ever laid eyes on, and he'll have her...even if it's the last thing he does. Their relationship is built on lies and deceit from the very beginning. Declan knows she's falling for him, but he can't tell her the ultimate truth: that he has to throw the final fight at the end of the summer—or his club gets nothing. This Contemporary Biker Romance novel contains graphic sexual content and violence. It is intended for mature readers. 80,000+ Words. Standalone, no cliffhanger.",
  "genres": [
    "Romance",
    "Fighters",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "Adult",
    "Suspense"
  ],
  "author": "Colleen Masters",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/20896563-impossibly"
}