{
  "title": "The Vampire and the Case of the Secretive Siren",
  "description": "Sex, drugs and siren songs.Ok, so not much sex is going on. The closest I’ve gotten to some action is a date with Stan which ended in disaster. But with all the eye-candy walking around this small town, including the sexy vampire leader, Connor, I’m definitely re-thinking my ‘no dating’ rule. I don’t get the chance to do much about it though because some ruffians think it’s funny to break into the Grimes’ moonshine shop.It doesn’t take too long to identify the shifters responsible, but it opens up a whole can of worms. Inebriated worms, like the ones you find in tequila. The kids weren’t just drunk, they were high. High on a new kind of drug that’s washing into Portlock. Literally. We found bags of the stuff floating in the harbour and it quickly becomes clear that this drug is anything but recreational. It can make you high, or it can shut down your organs quicker than you can say ‘shotgun funeral’.We need to find the dealers and shut them down, before any more of our town gets hoodwinked by this powerful stuff.Oh, and there’s a small problem with the barrier. The barrier that keeps us all safe from the cryptid monster that lurks beyond its confines. That barrier. Rips have been appearing in it, and if it falls, we’re all doomed.An average day in Portlock then.Dive into this fast-paced urban fantasy series if you love mystery, humour, found family and a slow-burn romance.Don't miss the other Portlock Paranormal adventures!The Vampire and the Case of her Dastardly DeathThe Vampire and the Case of the Wayward WerewolfThe Vampire and the Case of the Secretive SirenThe Vampire and the Case of the Baleful Banshee>/i>",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Vampires",
    "Paranormal",
    "Magic",
    "Mystery",
    "Shapeshifters"
  ],
  "author": "Heather G. Harris",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/208956326-the-vampire-and-the-case-of-the-secretive-siren"
}