{
  "title": "She's a Wild One",
  "description": "She's a Wild One is a Small Town, Enemies to Lovers, Rival Family romance in the Wilds of Montana series, featuring Millie Wild!From New York Times Bestselling author Kristen Proby comes the final installment in her beloved Wilds of Montana series, featuring a small town, marriage of convenience, second chance love for the ages!I have loved Millie Wild for more than eight years. Since that summer long ago when we were inseparable, stealing moments, keeping our love a secret.And my girl has hated me for just as long.When my father found out about my love for Millie, the daughter of the rival family next door to us, he threatened everything I love the most if I didn’t let her go. My father didn’t give idle threats.I had to hurt her to save her.And for eight long years, I stayed away. But now, my father is dead and buried, leaving a caveat in the will that in order to inherit what’s rightfully mine and my sisters’, I have to marry and stay that way for one full year.There’s only one woman in the world that I would consider saying I do to.Millie is happy with her life, owning her coffee shop, enjoying her family. I deserve her glares, her snarky comments. Every moment of pain, from her or self-inflicted, is mine to own. She deserves so much more than me, standing on her doorstep, asking her to marry me. To help me.But she says yes. Yes to one year of being mine, and I plan to show her that she’ll be mine until the stars fall from the sky.With the name Lexington, I know that I’ve caused pain for not only Millie but the entire Wild family. Will I be able to convince my wild rose that I’m in love with her for all of the right reasons, or will the centuries-old family rivalry tear her away from me?",
  "genres": [
    "Romance",
    "Second Chance",
    "Westerns",
    "Small Town Romance",
    "Enemies To Lovers",
    "Contemporary Romance",
    "Audiobook"
  ],
  "author": "Kristen Proby",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/209021052-she-s-a-wild-one"
}