{
  "title": "Melting the Ice",
  "description": "Multimillionaire, Ava Talbot, is on the verge of 40 and very happily single. Having been badly burned by her son's father, she has adopted a strict \"catch and release\" policy when it comes to men. And as far as she's concerned, that policy is written in stone. Called home suddenly after an extended absence, she heads out to the local dive bar with her best friend to catch up. After a few too many drinks, she lets the handsome young Ken pick her up and spends a few hours letting the hot young stud distract her from her problems. Though the sex was great, she is appalled by the stupidity of her actions the next morning and vows never again. She thinks herself home free...until her son's friend, Cian Secord, arrives at her home the next day and turns out to be none other than Ken! It was a simple misunderstanding but now she's stuck with the hard-bodied, 27 year-old hottie laying low in her home for the time being. Ava finds herself undeniably attracted to the younger man but refuses to consider continuing an affair with a man that is twelve years her junior, a friend of her son’s and currently residing in her house…no way…but can she really resist Cian’s persistent efforts to get her back in his bed? Does she really want to? She would if she knew the rest of the story…Cian Secord isn’t hiding from a stalker ex, but from the national media. They have hunted him relentlessly since his supermodel ex got the hot, young superstar hockey player arrested over her drug use. With no peace to be found for Cian or his family, he agrees to lay low at his friend’s home in West Virginia until the whole media frenzy blows over. His plans didn't include ending up in bed with his friend’s mother but now that he’s been there, he wants back in. What starts out as a fun challenge to get Ava back in his bed though, suddenly becomes more. He never counted on falling in love with Ava and finds himself in a dilemma. If she finds out the truth, she'll make him leave and he'll never convince her to give him a chance. But can his love melt the ice around her heart?",
  "genres": [],
  "author": "Amy Leigh Napier",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/20898882-melting-the-ice"
}