{
  "title": "The Latter Rain Covenant",
  "description": "The Latter Rain Covenant! Who ever heard of it before? Of course we have read about \"The Days of Heaven on the Earth,\" in Deuteronomy, but who has seen that those days were to be introduced through the spiritual outworkings of this Covenant? What a wonderful God. No man could have thought these lectures out; they bear the imprint of Heaven's teaching. How marvelous the BOOK! It's treasures are deep and lie hidden, except to the mind of the Spirit, who reveals them to whomsoever He will. These lectures with the exception of the \"Pentecostal Psalm\" were delivered in the Stone Church, Chicago, at a Pentecostal convention called in the Spring of 1909 for ten days but which continued under the blessing of God for twenty five days. Prayer as well as reading, will be necessary to a clear, spiritual understanding of these lectures. Language fails to express the blessing they have been to me. By Wm. Hamner Piper, Pastor, The Stone Church, Chicago, IL February 1910 - Chicago, Illinois The book became the classical definitive apologetic for the validation of the Pentecostal outpouring as the fulfillment of the expected \"Latter Rain.\" The publication also received a high recommendation from Vicar Alexander A. Boddy of Sunderland, England. Boddy was an Anglican Vicar who was baptized in the Holy Spirit and is considered one of the founders of Pentecostalism in Britain. Boddy wrote in the introduction for Myland's The Latter Rain Covenant and Pentecostal Power, \"There has been much literature issued of late in connection with the Baptism in the Holy Spirit, but nothing more scriptural or more satisfying has been printed than this remarkable book by Pastor D. Wesley Myland, which I now warmly commend to God's people everywhere. Boddy went on to write that Myland's book, \"Should be found in every Pentecostal home,\" Because, \"It is an invaluable work of reference on the all-important subject of the Baptism in the Holy Spirit.\" WWW.REVIVALPRESS.NET Follow us on Twitter @revivalpressLike us on Facebook facebook.com/revivalpress",
  "genres": [],
  "author": "D. Wesley Myland",
  "average_rating": "1.00",
  "url": "https://www.goodreads.com/book/show/20899043-the-latter-rain-covenant"
}