{
  "title": "The Talisman",
  "description": "Purchase of this book includes free trial access to www.million-books.com where you can read more than a million books for free. This is an OCR edition with typos. Excerpt from CHAPTER III. THE warriors arose from their place of brief rest and simple refreshment, and courteously aided each other while they carefully replaced and adjusted the harness, from which they had relieved for the time their trusty steeds. Each seemed familiar with an employment, which, at that time, was a part of necessary, and, indeed, of indispensable duty. Each also seemed to possess, as far as the difference betwixt the animal and rational species admitted, the confidence and affection of the horse, which was the constant companion of his travels and his warfare. With the Saracen, this familiar intimacy was a part of his early habits; for, in the tents of the Eastern military tribes, the horse of the soldier ranks next to, and almost equal in importance with, his wife and his family; and, with the European warrior, circumstances, and indeed necessity, rendered his war-horse scarcely less than his brother-in-arms. The steeds, therefore, suffered themselves quietly to be taken from their food and liberty, and neighed and snuffed fondly around their masters, while they were adjusting their accoutrements for farther travel and additional toil. And each warrior, as he prosecuted his own task, or assisted with courtesy his companion, looked with observant curiosity at the equipments of his fellow-traveller, and noted particularly what struck him as peculiar in the fashion in which he arranged his riding accoutrements. Ere they remounted to resume their journey, the Christian knight again moistened his lips, and dipped his hands in the living fountain, and said to his Pagan associate of the \" I would I knew the name of this delicious fountain, that I might hold it in my grateful remembrance ; for never did water slake more deliciously a more oppressive thirst than I ha...",
  "genres": [
    "Classics",
    "Historical Fiction",
    "Fiction",
    "Adventure",
    "Historical",
    "Literature",
    "Romance"
  ],
  "author": "Walter Scott",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/2090256.The_Talisman"
}