{
  "title": "Wealth and Democracy: How Great Fortunes and Government Created America's Aristocracy",
  "description": "For over 30 years, Phillips' insight into American politics & economics has helped make history as well as record it. His bestselling books, including The Emerging Republican Majority (1969) & The Politics of Rich & Poor (1990), have influenced presidential campaigns & changed the way America sees itself. Acknowledging him as one of the nation's most perceptive thinkers, reviewers have called him a latter-day Nostradamus & our 'modern Thomas Paine.' Now, in the first major book of its kind since the 30s, he turns attention to the USA's history of great wealth & power from the American Revolution to what he calls 'the 2nd Gilded Age' at the turn of the 21st century. The 2nd Gilded Age has been staggering enough in its concentration of wealth to dwarf the original 100 years earlier. However, the tech crash, and then the events of 9/11, pointed out that great riches are as vulnerable as ever. Wealth & Democracy charts the ongoing saga of great wealth--how it's been accumulated, its shifting sources & its ups & downs over more than two centuries. It explores how the rich & politically powerful have worked together to create or perpetuate privilege, often at the expense of national interests & usually at the expense of middle & lower classes. With intriguing chapters on history & bold analysis of present-day America, he illuminates the dangerous politics that go with excessive wealth concentration. Profiling wealthy Americans--from Astor to Carnegie & Rockefeller to contemporary wealth holders--he details the peculiarly American ways of becoming & staying a multimillionaire. He exposes the corruption spawned by a money culture & financial power, evident in economic philosophy, tax favoritism & selective bailouts in the name of free enterprise, economic stimulus & national security. Finally, Wealth & Democracy turns to the history of Britain & other world economic powers to examine the symptoms that signaled their declines: speculative finance, mounting international debt, record wealth, income polarization & disgruntled politics--signs seen in America at the start of the 21st century. In a time of crisis, he worries that the growing parallels suggest the tide may already be turning for us all.Table of Contents1. The Great Waves of American Wealth- The 18th & 19th centuries: from privateersmen to robber barons- Serious money: the three 20th-century wealth explosions- Millennial plutographics: American fortunes & misfortunes at the turn of the century2. The Origins, Evolutions & Engines of Wealth: Government, Global Leadership & Technology- The world is our oyster: the transformation of leading world economic powers- Friends in high places: government, political influence & wealth- Technology & the uncertain foundations of Anglo-American wealth3. Wealth & Democracy: the Rhythm of Politics & Confrontation- Wealth & politics in the United States- Wealth, money-culture ethics & corruption- The cup always runneth over: greed, speculative bubbles & reform- Great economic power decline & the politics of resentment4. Thinking ahead- Afterword: Wealth & Democracy: The U.S. & The New Century",
  "genres": [
    "History",
    "Politics",
    "Economics",
    "Nonfiction",
    "American History",
    "Sociology",
    "American"
  ],
  "author": "Kevin Phillips",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/1120178.Wealth_and_Democracy"
}