{
  "title": "The Myth of Male Power",
  "description": "The Myth of Male Power documents how virtually every society that survived did so by persuading its sons to be disposable--disposable in war, disposable at work--and therefore, indirectly, disposable as dads. Universities teach our children that we live in a patriarchal world controlled by men to benefit men at the expense of women. Dr. Warren Farrell’s The Myth of Male Power says “false”: the world has not been controlled by men, but by the need to survive. By redefining power as “control over one’s life” and examining the sacrifices both moms and dads made so their children's lives would be better than theirs, The Myth of Male Power paves the way to love and appreciation between the sexes. Dr. Farrell says failure to understand men hurts everyone. It makes women feel oppressed and angry; it makes men feel unloved and unappreciated. It fuels hate between the sexes at a point in history that would otherwise possess great potential for love between the sexes. It does this by keeping us ignorant of male pain and powerlessness. The Myth of Male Power is a captivating journey around the world, throughout history, biology, the Bible, the law, and everyday life, challenging every currently-held assumption about men, women and the family. It empowers both sexes to ask the questions we need to began a genuine dialogue, such as: If men are the powerful sex… • Why are they the suicide sex? (Why are we unaware that our grandfathers are 1350 percent more likely to commit suicide than our grandmothers?) • Why did men live one year less than women in 1920 but five years less than women in 2013? • Why are our dads more likely to die earlier of the leading causes of death even as we have seven federal offices of women’s health, and none of men’s health? • Why are our sons still sex expected to pay more for the 5 D’s: drinks; dinners; dates; driving expenses; and diamonds (as in “every kiss begins with Kay”)? • Why do myths such as “men earn more money for the same work” persist even though they’ve been disproven? • Why do men receive longer prison sentences for identical crimes? Dr. Warren Farrell is the only man ever elected three times to the Board of the National Organization for Women (NOW) in New York City. He started more than 300 men and some 200 women’s groups. He is the developer of a new method of highly-effective couples’ communication, Cinematic Immersion. Dr Farrell has listened to both sexes for about a half century. Unique in his ability to write in a way that articulates men’s feelings, he helps women feel more love for the men in their lives. He helps us understand: • Why feminism freed women to discover alternative senses of purpose to raising children, but nothing has freed men to find an alternative purpose to raising money; • How this void of purpose contributes to a boy crisis; • Why the very process required for men to succeed at work often leads them to fail at love; • Why no one benefits when we feel that God could be a she but not that the devil could also be a she; • What both sexes can do to minimize date rape and domestic violence. Dr. Farrell contends that the historic “battle of the sexes” has become a war in which men put their heads in the sand and hope the bullets will miss. He proposes neither a women's movement blaming men nor a men's movement blaming women, but a gender liberation movement that fosters a transition from rigid roles of our past to more flexible roles for our future.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Politics",
    "Feminism",
    "Sociology",
    "Gender",
    "Philosophy"
  ],
  "author": "Warren Farrell",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/20901195-the-myth-of-male-power"
}