{
  "title": "Ridin' Dirty",
  "description": "Good girls don’t follow the Diablo MC. Young, broke and living out of her car, Blanca finds herself tending bar at Hades, the home base of the Diablo MC. It doesn't take much time for her long legs and wild hair to catch the eye of the club leader, Dax. Blanca quickly finds herself thrown in the middle of a war between two feuding gangs. What will happen when Blanca falls into the hands of the club's fiercest enemy, the Outlaw MC?  This 9,300+ word story contains graphic language and wild and rough pleasure between the leader of the Diablo motorcycle club and the young woman who gets caught up in his world. Intended for MATURE AUDIENCES 18+ only!  The men who rode with the Diablos were part of the 1% of bikers that weren’t upright and law-abiding citizens. They ran guns and drugs and treated most women like property. They weren’t the kindly bikers that collected toys for orphans. They were criminals, and they owned this city. You can’t blame a girl for wanting to get as close as possible to the source of the power, and it poured off Dax in waves. I looked away for a moment, trying not to stare, but my eyes traveled back to him like a magnet. This time, his cold blue eyes were gazing right back at me. Silently, he crooked a finger at me. “Something I can get for you boys?” I asked. Acting like a timid little flower got you nowhere in this world. “What’s your name, sweetheart?” Dax drawled. “Blanca,” I replied, holding his gaze. I knew I was attractive. My long legs tapered to a thin waist with a flat stomach that came more from being broke than from spending hours at the gym. The tight tank top I wore clung to my round, perky breasts, the word HADES scrawled across them emphasizing my lack of a bra. A wild mane of ebony curls framed my dark eyes. I might be younger than Dax’s usual playthings, but he was definitely looking. “Whiskey,” he said. “Four glasses and leave the bottle.” ***All characters are over 18 and fictional***",
  "genres": [],
  "author": "Ruby Winchester",
  "average_rating": "3.10",
  "url": "https://www.goodreads.com/book/show/20901748-ridin-dirty"
}