{
  "title": "Green: The History of a Color",
  "description": "In this beautiful and richly illustrated book, the acclaimed author of Blue and Black presents a fascinating and revealing history of the color green in European societies from prehistoric times to today. Examining the evolving place of green in art, clothes, literature, religion, science, and everyday life, Michel Pastoureau traces how culture has profoundly changed the perception and meaning of the color over millennia—and how we misread cultural, social, and art history when we assume that colors have always signified what they do today.Filled with entertaining and enlightening anecdotes, Green shows that the color has been ambivalent: a symbol of life, luck, and hope, but also disorder, greed, poison, and the devil. Chemically unstable, green pigments were long difficult to produce and even harder to fix. Not surprisingly, the color has been associated with all that is changeable and fleeting: childhood, love, and money. Only in the Romantic period did green definitively become the color of nature.Pastoureau also explains why the color was connected with the Roman emperor Nero, how it became the color of Islam, why Goethe believed it was the color of the middle class, why some nineteenth-century scholars speculated that the ancient Greeks couldn’t see green, and how the color was denigrated by Kandinsky and the Bauhaus.More broadly, Green demonstrates that the history of the color is, to a large degree, one of dramatic reversal: long absent, ignored, or rejected, green today has become a ubiquitous and soothing presence as the symbol of environmental causes and the mission to save the planet.With its striking design and compelling text, Green will delight anyone who is interested in history, culture, art, fashion, or media.",
  "genres": [
    "Art",
    "History",
    "Nonfiction",
    "Art History",
    "Design",
    "Cultural",
    "Microhistory"
  ],
  "author": "Michel Pastoureau",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/20912126-green"
}