{
  "title": "REVENGE: A BDSM tale of fraud and deceit",
  "description": "REVENGE is a 50,000 word BDSM story of fraud and deceit by John Gemini.Millions of pounds have gone missing from the Department of Education, cleverly embezzled by a person who’s convinced they’ve thought of everything, covered every track.The missing millions will never be discovered.Using the money, an opulent château has been purchased in France, where the fraudster and partner will live in luxury on their ill gotten gains.It’s perfect….until an ingenious computer nerd who harbours a long-standing grudge uncovers the fraud. He stumbles on it accidentally, but once he’s got the fraudster in his sights he’s determined to exploit this to the full. He's prepared to resort to extreme measures to achieve this, after all, the best way to catch a thief is to think like one.And he’ll make it fun, his love of BDSM and all things kinky lead to intricate plans on how to take revenge and redistribute the money, whilst building himself a new kink empire; a sanctuary for him and fellow kinksters to indulge their darkest desires. If a few people need to get abducted, tortured and used along the way, that’s just fine by him. It will make it even more enjoyable.Extract…The helpless and naked woman lay on the now familiar unforgiving hard mattress within the confines of her small prison cell. She had been stripped of her freedom and dignity as well as her clothes; her wrists shackled by hefty steel manacles that bound her arms securely behind her back. She was uncomfortable, vulnerable and exposed.The darkness enveloped her like a shroud, suffocating her senses. As if the inescapable cell and manacles weren't enough, her head was encased within a heavy leather sensory deprivation hood. Its purpose was clear and effective – to isolate her from the outside world entirely. Not only did it block out sight, but the noise cancelling headphones built into it made her deaf too, leaving her completely disoriented and alone.In this state of silence and pitch-blackness she felt utterly lost, trapped in a void where time seemed to stand still. Her mind reeled as she tried to piece together the duration of her imprisonment, but this was impossible. Time had lost all meaning, one seemingly endless period that had transpired since her arrival; it felt like months but in reality, it was more likely to be days or weeks.The uncertainty gnawed at her and the cruel beating she had suffered just before being locked away leapt into her confused mind. Her once pristine skin now bore evidence of the pain inflicted upon her by the cane. It had left raw, red lines across her bottom and upper thighs, a constant reminder of the sheer power these people wielded over her.",
  "genres": [],
  "author": "John Gemini",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/209147038-revenge"
}