{
  "title": "Formas Ideologicas de la Nación Panameña",
  "description": "El presente trabajo intenta sistematizar las conclusiones más señaladas a que nos condujo la docencia temporal de la cátedra de Historia de Panamá en la Facultad de Filosofía, Letras y Educación. Intenta, por otra parte, actualizar muchas de las perspectivas y materiales expuestos hace diez años en nuestro estudio de análoga temática, bien que limitado a la pasada centuria: Pensamiento Panameño y Concepción de la Nacionalidad durante el siglo XIX (presentado a la Facultad en 1953 y publicado en 1954). En el decurso de los últimos años la imperatividad de una promoción de la historiografía nacional se hace sentir cada vez más con mayor intensidad. La actualización de las perspectivas a que nos referimos obedece, precisamente, al deseo de aportar planteamientos que en el campo específico de la Historia de las Ideas coadyuven a la tarea renovadora. Renovación, claro está, que no puede agotar su impulso en la hipostasación de ideas, en la discusión metodológica o en la fetichización de las fuentes. Los problemas histórico-culturales a que nos abocamos en este estudio no exceden las posibilidades reales de un enfoque científico —aun cuando se haya pretendido lo contrario—. La mayor o menor apropiación conceptual de la riqueza de nuestro contenido histórico cultural podrá ser discutida, pero permanecemos seguros en todo caso de que nuestro alineamiento ideoló-gico y metodológico nos ha permitido una comprensión más certera que la de los desalineados pero alienados ideopuristas de nuestro hacer historiográfico.Permítasenos observar, finalmente, que las conclusiones alcanzadas plantean como tarea impostergable el desenmascaramiento ideológico de las corrientes políticas y filosóficas que en el presente intentan imponer los clanes académicos comprometidos y solidarios con la crisis de la oligarquía nacional. Ese comprometimiento regresivo conduce hoy, particularmente en nuestra Universidad, a la negación no disimulada de toda “moral para intelectuales”. Estas líneas intentan una búsqueda en nuestro pasado hístórico-cultural que explique la crisis actual. En este sentido la visión retrospectiva sugiere el esquema de las tareas y prospectos del presente. Panamá, agosto de 1963.",
  "genres": [],
  "author": "Ricaurte Soler",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/20914719-formas-ideologicas-de-la-naci-n-paname-a"
}