{
  "title": "In God's Path: The Arab Conquests and the Creation of an Islamic Empire",
  "description": "In just over a hundred years--from the death of Muhammad in 632 to the beginning of the Abbasid Caliphate in 750--the followers of the Prophet swept across the whole of the Middle East, North Africa, and Spain. Their armies threatened states as far flung as the Franks in Western Europe and the Tang Empire in China. The conquered territory was larger than the Roman Empire at its greatest expansion, and it was claimed for the Arabs in roughly half the time. How this collection of Arabian tribes was able to engulf so many empires, states, and armies in such a short period has perplexed historians for centuries. Most accounts of the Arab invasions have been based almost solely on the early Muslim sources, which were composed centuries later to illustrate the divinely chosen status of the Arabs. Robert Hoyland's groundbreaking new history assimilates not only the rich biographical information of the early Muslim sources but also the many non-Arabic sources, contemporaneous or near- contemporaneous with the conquests.In God's Path begins with a broad picture of the Late Antique world prior to the Prophet's arrival, a world dominated by two superpowers: Byzantium and Sasanian Persia. In between these empires, emerged a distinct Arabian identity, which helped forge the inhabitants of western Arabia into a formidable fighting force. The Arabs are the principal actors in this drama yet, as Hoyland shows, the peoples along the edges of Byzantium and Persia--the Khazars, Bulgars, Avars, and Turks--all played critical roles in the remaking of the old world order. The new faith propagated by Muhammad and his successors made it possible for many of the conquered peoples to join the Arabs in creating the first Islamic Empire. Well-paced, comprehensive, and eminently readable, In God's Path presents a sweeping narrative of a transformational period in world history.",
  "genres": [
    "History",
    "Islam",
    "Nonfiction",
    "Religion",
    "World History",
    "Military History",
    "Medieval"
  ],
  "author": "Robert G. Hoyland",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/20911273-in-god-s-path"
}