{
  "title": "Stormling",
  "description": "In an age when Stormlings have only known peacetime, one man's desperate action threatens not only the stability of the mystical world of Mordana, but Earth as well.Teenager Ophelia Drewe discovers a jewel that has been lost from its homeworld, and whilst she thinks she can keep it, demonic forces believe otherwise.She’s not alone, but who can she trust? The head Stormling, Anadyr, hasn’t been to the Earth in 500 years, but go there he must – if the jewel is not returned, it will destroy both Ophelia’s world and his own…* * *A Lost Jewel. A World in Chaos. A Quest Unlike Any Other.When a jewel is lost from the mystical realm of Mordana, and found on Earth, so begins a race against time to ensure the safe return of the jewel to its rightful place. With news that the jewel has now been located, two warring factions fight for the control of Mordana. Anadyr, the strongest and bravest of the Stormlings, is sent on a quest to retrieve the jewel, as the survival of his race depends on it, but he finds there are some on Earth that are out to stop him as well. On Earth, teenager Ophelia Drewe discovers the jewel. Anadyr needs to win her trust, but the task is made more difficult as Ophelia finds herself in conflict with dark mages, sorceresses, elves, demons, giant-folk, and more.However....Evil stirs East of Mordana, with the minions of Andus Rey also working together to release The Fourth – the entity who was a good Stormling at one time, but has since turned to darkness.Even if Anadyr helps to restore order to Mordana, his quest will not be truly complete until he announces his successor from a group of trusted, but untested Stormlings.The evil in Mordana knows this too, and is just waiting for the right moment to strike, to set in motion a new and terrifying age of darkness....",
  "genres": [
    "Fantasy",
    "Young Adult"
  ],
  "author": "John    Hennessy",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/20911307-stormling"
}