{
  "title": "The Slow Farm",
  "description": "In this coming-of-age memoir, Tarn Wilson explores the gifts and burdens of a counterculture childhood. In the early 1970s, Wilson’s hippie parents packed the family into a converted school bus with “Suck Nixon” painted on the side and aimed for the Canadian wilderness. They planned to raise their two young children close to the earth and free of shallow middle class values. When they settle on a remote island in British Columbia, their idealism smacks up against reality and threatens to tear apart the family.Between each short lyric chapter, Wilson incorporates “artifacts” that illuminate the cultural forces shaping her parents’ decisions, such as letters, recipes, photographs, timelines, newspaper clippings, and provocative excerpts from A Radical Approach to Child Rearing.With both empathy and clear-eyed honesty, Wilson deconstructs the simplified narratives of the counterculture movement by sharing the story of one young, eager, flawed family’s efforts to live the ideal. The book celebrates the power of the natural world, invites us to ask questions about how we raise children, and takes us on a journey of forgiveness. Ultimately, Wilson’s story, although unusual, is all of the path “from the world as we wish it were to the one that exists,” with all its beauty and imperfections.Stanford Magazine says, “Tales of her youthful fits and starts could spark nostalgia even in those who didn’t grow up romping around in the words with near complete freedom.”Lia Purpura, award-winning poet and essayist, writes that Wilson “reconstructs the powerful atmosphere of a past era, its magic, contentment and freedom, its restrictions and losses.”The genre-defining essayist Judith Kitchen says, “Tarn Wilson deftly turns memoir into an interactive project.” Brenda Miller, co-author of the bestselling guide to creative nonfiction Tell It Slant , praises “a textured memoir of childhood that captures the zeitgeist of the 60s . . .”",
  "genres": [
    "Memoir",
    "Nonfiction"
  ],
  "author": "Tarn Wilson",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/20907679-the-slow-farm"
}