{
  "title": "Instant City: Life and Death in Karachi",
  "description": "From the host of NPR's Morning Edition, a deeply reported portrait of Karachi, Pakistan, a city that illuminates the perils and possibilities of rapidly growing metropolises all around the world. In recent decades, the world has seen an unprecedented shift of people from the countryside into cities. As Steve Inskeep so aptly puts it, we are now living in the age of the \"instant city,\" when new megacities can emerge practically overnight, creating a host of unique pressures surrounding land use, energy, housing, and the environment. In his first book, the co-host of Morning Edition explores how this epic migration has transformed one of the world's most intriguing instant cities: Karachi, Pakistan.Karachi has exploded from a colonial port town of 350,000 in 1941 to a sprawling metropolis of at least 13 million today. As the booming commercial center of Pakistan, Karachi is perhaps the largest city whose stability is a vital security concern of the United States, and yet it is a place that Americans have frequently misunderstood.As Inskeep underscores, one of the great ironies of Karachi's history is that the decision to divide Pakistan and India along religious lines in 1947 only unleashed deeper divisions within the city-over religious sect, ethnic group, and political party. In Instant City, Inskeep investigates the 2009 bombing of a Shia religious procession that killed dozens of people and led to further acts of terrorism, including widespread arson at a popular market. As he discovers, the bombing is in many ways a microcosm of the numerous conflicts that divide Karachi, because people wondered if the perpetrators were motivated by religious fervor, political revenge, or simply a desire to make way for new real estate in the heart of the city. Despite the violence that frequently consumes Karachi, Inskeep finds remarkable signs of the city's tolerance, vitality, and thriving civil society-from a world-renowned ambulance service to a socially innovative project that helps residents of the vast squatter neighborhoods find their own solutions to sanitation, health care, and education.Drawing on interviews with a broad cross section of Karachi residents, from ER doctors to architects to shopkeepers, Inskeep has created a vibrant and nuanced portrait of the forces competing to shape the future of one of the world's fastest growing cities.",
  "genres": [
    "Pakistan",
    "Nonfiction",
    "History",
    "Travel",
    "Asia",
    "Journalism",
    "Sociology"
  ],
  "author": "Steve Inskeep",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/11202557-instant-city"
}