{
  "title": "First Love",
  "description": "Six years ago, Amber fled her hometown and family heart broken and humiliated. Now, after walking in on her fiancé holding another woman’s legs in the air and screaming her name, Amber is headed back home to Oakville, ready for a fresh start in the town she’s always loved.Determined to get back to her life, Amber gets a waitressing job at KC’s Bar & Grille. After a few weeks of working there, she finally sets in to a happy routine with help from her new friend, Holly. That is, until she meets KC, the owner, her boss, and the man who just happens to be the reason she left so many years ago. The man she never got over. Enter Kyle. He’s sexy, charming, the lead singer of a small town band, and owner of KC’s Bar & Grille. When Amber left all those years ago, he became a shell of the man he was. Broken, confused, and desperate, Kyle began his new life where nothing mattered aside from music and women, sometimes more than one at a time. Finally realizing that he hated the person he was becoming, he moves back to Oakville with his band to focus on the bar. Still playing a few small gigs here and there, Kyle and his band return home after a month only to walk straight into Amber, the girl who broke his heart and left without a word. With a short, heated conversation revealing that it was all just a misunderstanding, Kyle and Amber are determined to start over again and let the past stay in the past. This is the second chance neither of them dreamed they would get and they aren’t going to waste it. Unfortunately, living in this small town isn’t as safe as it would seem. With people determined to tear them apart and old flings resurfacing, will Amber and Kyle be able to hold onto their second chance? Or will it all slip through their fingers?",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Kathy-Jo Reinhart",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/20920911-first-love"
}