{
  "title": "Near-Death Experiences; True stories of Near-Death Experiences told by real people. True stories of those who went to Heaven.",
  "description": "Near Death Experiences; True stories of Near Death Experiences told by real people. True stories of those who went to Heaven. “I feel now as though I have stolen a piece of heaven and brought it back to earth and feel as if each time I’m able to share it with somebody, I break a piece of that heaven off and hand it to them.” “It felt like the whole time I was in somebody's arms. Like somebody was holding me.” “I have to tell you that the joy I felt was absolutely beyond description, because I doubt that there is such a word in any human language.” “The place I had just come back from was the place I knew. God is real; heaven is absolutely real.” “Heaven is such a beautiful place and heaven is for real.” “It was mind-blowing and breathtaking” “A current of love so deep, it seemed unfathomable that such a place had existed without my knowing. How could I have been blind all my life to this bright river of love, peace, joy that cradled me?” “It felt like all the love of everybody in the world, everybody I knew, was hugging me,” \"I know without a doubt there's no such thing as death.” From Tessy Rawlins, comes more astonishing, affirming and comforting true stories of those who went to Heaven, and came back to tell of the beauty, and the love that is waiting for us too. It seems that more and more people feel the desire to speak out about their life-changing experiences of going to Heaven. No longer do people feel they must keep quiet about what happened to them; and often they feel compelled to share their experience with as many people as will listen to them. They have a message, and that message is always of the unconditional love and acceptance of Heaven. Of the forgiveness, of the all-encompassing, loving light that wraps around them as though embracing them, and of the re-uniting with their loved ones... Near Death Experiences; True stories of Near Death Experiences told by real people. True stories of those who went to Heaven. Here follows some of those stories...",
  "genres": [],
  "author": "Steph Young",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/20924685-near-death-experiences-true-stories-of-near-death-experiences-told-by-r"
}