{
  "title": "The Christmas Daughter: A Marienstadt Story",
  "description": "Novel (70k words) Family Drama-- Return to Marienstadt! For readers who loved the Pennsylvania Dutch town of Marienstadt in Kathleen Valentine's \"The Whiskey Bottle in the Wall: Secrets of Marienstadt\", her new novel, \"The Christmas Daughter\", offers a welcome return. For those who have never visited Marienstadt, \"The Christmas Daughter\" is a warm and charming introduction. In this novel readers will meet the rambunctious Wilde family. Years ago Kit and Boone Wilde were Marienstadt's favorite bad boys. All the girls thought them heart-throbs and all the boys wanted to be part of their motorcycle club, The Pilgrims. But when the club came to a sudden, tragic end Kit and Boone roared out of Marienstadt on their Harleys vowing never to return. Now twenty years have passed and their father, Big Zach, dies leaving their mother, Minnie Werner Wilde, to run the Wilde Hotel and Tavern on her own. Boone leaves the Montana cattle ranch where he works to help Minnie put things in order but once in Marienstadt he decides to build a new life. He renews his friendships with his cousin, Chief of Police Henry Werner, and his high school girlfriend, Stella Loeffler. Boone takes over the management of the family business and begins a flirtation with Marienstadt's new pediatrician, Dr. Grace Winter. Then, during a New Year's Eve party, Boone gets a phone call from an old girlfriend, who is dying. She tells Boone that he has a twelve-year-old daughter who is about to be motherless. Charity is a small, under-nourished girl, who has been neglected most of her life and is afraid of almost everything. It is up to tough-guy Boone to help this child he never knew learn about family and trust—while he learns about unconditional love. Bonus Marienstadt Story: \"The Rhubarb Epidemic\"—In Marienstadt a bumper crop of rhubarb is creating havoc—including unwanted surprises dumped in Chief of Police Henry Werner's car, and a feud between chainsaw artist Juney Wickett and cranky old Mrs. Hauber.",
  "genres": [],
  "author": "Kathleen Valentine",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/20924632-the-christmas-daughter"
}