{
  "title": "See Here, Private Hargrove",
  "description": "Private Marion Hargrove, ASN 34116620, approaches life from a number of angles peculiarly his own. He approached the United States Army in the same way. Quite a number of sergeants who have served over Hargrove will testify to that. Indeed he lets them testify in the pages of his book about what happened to him, and to the Army, when he joined it in response to a letter from Washington which began: \"The President of the United States to Marion Hargrove. Greetings...\" As the delighted reader begins to discover the Army through Hargrove's eyes, and Hargrove through the Army's, he realizes that there is, after all, a certain amount of excuse for sergeants.Here is something different from any previous writing about the life military--a high good humor, a zest for the experience as a whole. The reader will find in it the authentic flavor of a youthful generation which is being molded into the most modern and efficient fighting force we have ever put into the field. When it was finally complete, we sent the manuscript down to Washington to the War Department's Bureau of Public Relations. Not that we could detect any aid of comfort to the enemy in a single Hargrovian line, but just because we felt the Army ought to have an opportunity to answer back if it wanted to. The script returned, and as we went through its unaltered pages we came on one of the most eloquent testimonials which any book has probably ever received. On page 83, Private Hargrove was dealing, in a thoroughly genteel manner, with what he refers to as the \"vitamin deposits\" which are distributed by the cavalry as a surplus commodity and used to enrich the good earth of Fort Bragg's flowerbeds. \"Speaking as a cavalryman,\" said a neatly pencilled note at the bottom of this delicate passage, \"this page is wonderful.\" So are the others, practically all of them. SEE HERE, PRIVATE HARGROVE is a law and a book unto itself.N.B. A last minute dispatch from Fort Bragg brings the almost incredible announcement that Private Hargrove is no more. He is Corporal Hargrove now. We still find it hard to believe. So will you.",
  "genres": [
    "Nonfiction",
    "World War II",
    "Humor",
    "Military Fiction",
    "Autobiography",
    "Memoir",
    "History"
  ],
  "author": "Marion Hargrove",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/1120368.See_Here_Private_Hargrove"
}