{
  "title": "Academic Exercises",
  "description": "Academic Exercises is the first collection of shorter work by master novelist K.J. Parker, and it is a stunner. Weighing in at over 500 pages, this generous volume gathers together thirteen highly distinctive stories, essays, and novellas, including the recent World Fantasy Award-Winner, “Let Maps to Others”. The result is a significant publishing event, a book that belongs on the shelf of every serious reader of imaginative fiction.The collection opens with the World Fantasy Award-winning “A Small Price to Pay for Birdsong”, a story of music and murder set against a complex mentor/pupil relationship, and closes with the superb novella “Blue & Gold”, which features what may be the most beguiling opening lines in recent memory. In between, Parker has assembled a treasure house of narrative pleasures. In “A Rich, Full Week”, an itinerant “wizard” undergoes a transformative encounter with a member of the “restless dead.” “Purple & Black”, the longest story in the book, is an epistolary tale about a man who inherits the most hazardous position imaginable: Emperor. “Amor Vincit Omnia” recounts a confrontation with a mass murderer who may have mastered an impossible form of magic.Rounding out the volume — and enriching it enormously — are three fascinating and illuminating essays that bear direct relevance to Parker’s unique brand of fiction: “On Sieges”, “Cutting Edge Technology”, and “Rich Men’s Skins”.Taken singly, each of these thirteen pieces is a lovingly crafted gem. Together, they constitute a major and enduring achievement. Rich, varied, and constantly absorbing, Academic Exercises is, without a doubt, the fantasy collection of the year.Contents:- A Small Price to Pay for Birdsong (2011)- A Rich, Full Week (2010)- Amor Vincit Omnia (2010)- On Sieges (2009)- Let Maps to Others (2012)- A Room with a View (2011)- Cutting Edge Technology (2011)- Illuminated (2012)- \nPurple and Black\n (2009)- Rich Men’s Skins; A Social History of Armour (2013)- The Sun and I (2013)- One Little Room an Everywhere (2012)- \nBlue and Gold\n (2010)Cover illustration by Vincent Chong",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Collections",
    "High Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "K.J. Parker",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/20919846-academic-exercises"
}