{
  "title": "The Soldier and the State: The Theory and Politics of Civil–Military Relations",
  "description": "In a classic work, Samuel P. Huntington challenges most of the old assumptions and ideas on the role of the military in society. Stressing the value of the military outlook for American national policy, Huntington has performed the distinctive task of developing a general theory of civil–military relations and subjecting it to rigorous historical analysis.Part One presents the general theory of the \"military profession,\" the \"military mind,\" and civilian control. Huntington analyzes the rise of the military profession in western Europe in the eighteenth and nineteenth centuries, and compares the civil–military relations of Germany and Japan between 1870 and 1945.Part Two describes the two environmental constants of American civil–military relations, our liberal values and our conservative constitution, and then analyzes the evolution of American civil–military relations from 1789 down to 1940, focusing upon the emergence of the American military profession and the impact upon it of intellectual and political currents.Huntington describes the revolution in American civil–military relations which took place during World War II when the military emerged from their shell, assumed the leadership of the war, and adopted the attitudes of a liberal society. Part Three continues with an analysis of the problems of American civil–military relations in the era of World War II and the Korean the political roles of the Joint Chiefs of Staff, the difference in civil–military relations between the Truman and Eisenhower administrations, the role of Congress, and the organization and functioning of the Department of Defense. Huntington concludes that Americans should reassess their liberal values on the basis of a new understanding of the conservative realism of the professional military men.",
  "genres": [
    "Military Fiction",
    "Politics",
    "History",
    "Nonfiction",
    "Political Science",
    "War",
    "Philosophy"
  ],
  "author": "Samuel P. Huntington",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/209179.The_Soldier_and_the_State"
}