{
  "title": "Firestorm",
  "description": "He thought his life was over…and then she walked back in. Charlie Benning has always been a rescuer—first with the Last Chance County Fire and Rescue team, and now as a firefighter with the Jude County Hotshots. But this summer isn’t about saving lives—it’s about hiding his own terrible secret. A secret he’s keeping from his estranged daughter, Alexis. But fate is about to intervene.Will their secrets destroy their second chance? Jayne Price raised her son, Orion, on her own just fine, thank you. And now, she runs Wildlands Academy, a summer camp that teaches kids how to fight forest fires and confront their own teenage angst—kids like Alexis Price, who clearly has a chip on her shoulder about her semi-estranged, firefighter father. And Jayne has her own issues, like not wanting her only son to join the elite smoke jumping corps. It’s enough that he’s risking his life as a hotshot on the Jude County team. Then the wildfire turns its force onto the camp and suddenly the hotshots show up to help her fight it. Only problem…the last person she expects is for her former flame, Charlie Benning—the man she can’t forget—to show up working alongside her son. Rather, his son. Who he doesn’t know exists. And then Charlie discovers the secret she’s been keeping, and he’s torn between anger and the long-simmering love that refuses to die. And Jayne isn’t about to let go of the man she loves a second time. But if the blazing wildfire isn't enough, a dangerous and relentless killer is on the prowl in the woods…Now, with the camp cut off from the outside world and the fire closing in, it’s a race against time as Charlie, Jayne, Orion, and a team of courageous smokejumpers join forces to protect the campers against a merciless inferno and a murderer. But the biggest threat of all might be Charlie’s devastating secret that could destroy the happy ending they’ve waited for so long.",
  "genres": [
    "Christian Fiction",
    "Romance",
    "Suspense",
    "Fiction",
    "Contemporary",
    "Christian",
    "Adventure"
  ],
  "author": "Lisa     Phillips",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/209286105-firestorm"
}