{
  "title": "Big Gator",
  "description": "Curvy alligator shifter Brandy Guyette is more than just a BBW. She's a BBG – a Big Beautiful Gator. As the biggest female gator ever measured in the Southeastern U.S., Brandy has the hotter-than-hot wildlife expert and famous gator wrestler Jake McEvans equally enthralled. McEvans fell in love with her as a primo reptilian specimen the day he fished her out of a swimming pool in Miami and made her the starring attraction of Animal Sphere, his famous theme park in South Florida. Soon, McEvan's relationship with his model girlfriend starts crumbling when she realizes she can't compete with an alligator. But Brandy wants McEvans to see her as more than just a big gator to wrestle – she wants him to notice her as a human woman. Brandy comes from a long line of shifters, the descendants of a Louisiana man struck with a Hoodoo curse, courtesy of the legendary Madame Eve LaBelle. Brandy's kin are not the only alligator shifters around. Madame LaBelle put the juju on pretty much everyone who pissed her off circa 1884, and now their descendants are spread out all over the Gulf Coast. There's plenty of downside – as curses are supposed to deliver – but for Brandy being a BBW in the Floridian shifter community earns her respect and admiration, from both men and women, for being the biggest and most desirable alligator around. She's also not one to be trifled with. Brandy is known for delivering 'swamp justice' whenever someone has it coming.When Brandy accidentally shifts in front of McEvans, events are set into motion that enflame both their passions with potential risk. And soon the legacy of Madame Eve LaBelle rises from the grave in the form of another Conjure Woman who is just learning how to use her own power, with very direct implications for Brandy and McEvan's burgeoning relationship.",
  "genres": [],
  "author": "Annora Soule",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/20930847-big-gator"
}