{
  "title": "Taking Rights Seriously",
  "description": "What is law? What is it for? How should judges decide novel cases when the statutes and earlier decisions provide no clear answer? Do judges make up new law in such cases, or is there some higher law in which they discover the correct answer? Must everyone always obey the law? If not, when is a citizen morally free to disobey?A renowned philosopher enters the debate surrounding these questions. Clearly and forcefully, Ronald Dworkin argues against the \"ruling\" theory in Anglo-American law--legal positivism and economic utilitarianism--and asserts that individuals have legal rights beyond those explicitly laid down and that they have political and moral rights against the state that are prior to the welfare of the majority.Mr. Dworkin criticizes in detail the legal positivists' theory of legal rights, particularly H. L. A. Hart's well-known version of it. He then develops a new theory of adjudication, and applies it to the central and politically important issue of cases in which the Supreme Court interprets and applies the Constitution. Through an analysis of John Rawls's theory of justice, he argues that fundamental among political rights is the right of each individual to the equal respect and concern of those who govern him. He offers a theory of compliance with the law designed not simply to answer theoretical questions about civil disobedience, but to function as a guide for citizens and officials. Finally, Professor Dworkin considers the right to liberty, often thought to rival and even preempt the fundamental right to equality. He argues that distinct individual liberties do exist, but that they derive, not from some abstract right to liberty as such, but from the right to equal concern and respect itself. He thus denies that liberty and equality are conflicting ideals.Ronald Dworkin's theory of law and the moral conception of individual rights that underlies it have already made him one of the most influential philosophers working in this area. This is the first publication of these ideas in book form.",
  "genres": [
    "Philosophy",
    "Law",
    "Nonfiction",
    "Politics",
    "Political Science",
    "Justice",
    "Academic"
  ],
  "author": "Ronald Dworkin",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/209328.Taking_Rights_Seriously"
}