{
  "title": "The Unofficial Hunger Games Cookbook: From Lamb Stew to \"Groosling\" - More than 150 Recipes Inspired by The Hunger Games Trilogy",
  "description": "\"Here's some advice. Stay alive.\" --Haymitch AbernathyWhen it comes to The Hunger Games, staying alive means finding food any way possible. Katniss and Gale hunt live game, Peeta's family survives on the bread they make, and the inhabitants of the Seam work twelve-hour days for a few handfuls of grain--all while the residents of the Capitol gorge themselves on delicacies and desserts to the heart's desire.For the first time, you will be able to create delicious recipes from the humble District 12 to the extravagant Capital, including:French Bread from the Mellark Family BakeryKatniss's Favorite Lamb Stew with Dried PlumsRue's Roasted ParsnipsGale's Bone-Pickin' Big Game SoupCapitol-Grade Dark Chocolate CakeIf you're starving for more from Katniss, Peeta, and Gale, this cookbook is sure to whet your appetite!\"Fans Cook Up Recipes for Food Featured in Fantasy Novels. . . This month, The Unofficial Hunger Games Cookbook was published, with 150 recipes for rustic, gamy fare.\" —Wall Street Journal\"Hungry for the dishes served up in Suzanne Collins' Hunger Games trilogy? The Unofficial Hunger Games Cookbook: From Lamb Stew to \"Groosling\" —More Than 150 Recipes Inspired by The Hunger Games Trilogy is ready to rock fans' kitchens.\" —USA Today\"The Hunger Games movie is just a few months away, and really, who isn't secretly super-excited for the teen post-apocalyptic book trilogy to make it to the big screen? Watching the trailer on repeat is pretty fun. . . but now comes an even better way to sate your appetite—literally—until the film comes out. The Unofficial Hunger Games Cookbook!\" —Village Voice",
  "genres": [
    "Cookbooks",
    "Nonfiction",
    "Cooking",
    "Food",
    "Dystopia",
    "Media Tie In",
    "Reference"
  ],
  "author": "Emily Ansara Baines",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/11206339-the-unofficial-hunger-games-cookbook"
}