{
  "title": "Hell for Hire",
  "description": "The CrewA hulked-out wrath demon who eats gamer rage and loves cats, a shapeshifting lust demon who enjoys their food a bit too much, and a void demon who doesn’t see the point of any of this. They’re not the sort of mercenaries you'd hire on purpose, but Bex wouldn’t trust her life to anyone else.Ever since the ancient Mesopotamian king Gilgamesh decided death wasn’t for him, killed the gods, and conquered the afterlife, times have been rough for a free demon. But the denizens of the Nine Hells aren’t the quitting sort, and Bex and her team have been choking a living out of the Eternal King’s lackeys for years. It’s not honest work, but when Heaven itself declares you a non-person, you smash-and-grab what you can get.This next gig looks like more of the same…until Bex meets the client.The JobAdrian Blackwood is a witch with a problem. His family has skirted the edges of King Gilgamesh’s ire for centuries, but thanks to a decision he made as a child, Adrian is personally responsible for putting his entire coven in Heaven’s crosshairs.Determined to set things right, Adrian drags his broom, caldron, and talking cat thousands of miles across the country to Seattle where he can fight the Eternal King’s warlocks without bringing the rest of his family into the fray. But witchcraft--like all crafts--takes time, and if the warlocks catch him before his spells are ready, he’s dead. So Adrian does what any professional witch would do and hires a team of mercenaries to keep the warlocks off his back. He didn’t expect to get demons, but when you’re already on the killing-edge of Heaven’s bad side, what’s a bit more fuel on the fire?Sometimes you get more than you paid for.Neither Adrian nor Bex knew what to expect when they signed their contract, but witch-plus-demon turns out to be a match made in the Hells. With this much chaos at their fingertips, even impossible dreams can come back into reach, because Bex wasn’t always a mercenary. She used to be the Eternal King's biggest nightmare, and now that she’s got a witch in her corner, it’s time to put the old magics back on the field and show Adrian Blackwood just how much Hell he’s hired.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Witches",
    "Magic",
    "Demons",
    "Fiction"
  ],
  "author": "Rachel Aaron",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/209360206-hell-for-hire"
}