{
  "title": "Time Capsule II - Backward Glance",
  "description": "In the first Time Capsule, Sheriff Warren Price RIP, an experimental project conducted by the United States Navy went in another direction when one of its capsules was transported back into time. The Navy's project was an experiment in the use of quickly transportable units that could be used to defend locations coming under attack such as embassies, temporary military bases and airstrips around the world. These capsules were made to create an electrical force with the idea of confusing the trajectory of incoming radio controlled missiles. Each capsule was set up for a crew of three, who would be able to monitor incoming missiles and adjust the strength and frequency of the electrical field.  Seeing the potential of having a time capsule which could be used to change the outcome of traumatic events in our past such as Pearl Harbor or Nine-Eleven, the experiment was reclassified and placed under the command of a highly sensitive and secretive investigative unit at the Pentagon which pursued the development of unorthodox weapons.  One of the unexplained characteristics of this capsule was that it only went to one location and one time period: a closed mine shaft in New Mexico a few years after the Civil War. While scientist tried to determine the reason why only one of the many capsules produced traveled to the past; the Pentagon continued with a program of collecting data, putting together a manual on time travel and training a crew to make the voyage back to that time period to live among the inhabitants.  The first journey back in time only intensified the interest of the Pentagon in time travel. Using the knowledge gained from the successes and failures of the first mission, training was continued and the staff was expanded waiting for the time scientists would be able to unlock the secret of the first capsule. Approximately one year later, Doctor Richter, the Director of the Los Alamos National Laboratory, announced that a capsule was ready. This is the story of the capsule christened ‘Backward Glance’ which effected the lives of people in the 19th, 20th and 21st Centuries, and the valiant crew who dared to journey between the present and the past.",
  "genres": [],
  "author": "P.A. Amancio",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/20937223-time-capsule-ii---backward-glance"
}