{
  "title": "The Priest's Secret",
  "description": "An ancient mystery, a lost treasure and the search for the most sought after relics in all antiquity. \"This exciting adventure will appeal to fans of Michael Crichton, Clive Cussler and James Rollins.\" NY Book Reviews) \"A story full of thrills, excitement and suspense to satisfy all readers who yearn for adventure and escapism. Highly recommended.\" (Indie book club) THE PRIEST'S SECRET - Book 2 of the TOMB, the TEMPLE, the TREASURE “An exciting action adventure that took me to many places I would have liked to explore. The final chapter is one of the best I have read. Buy it, read it, enjoy it.” (cosmo lit) “I had been looking forward to the second installment of the Tomb, the Temple, the Treasure for some time now since reading Beginnings, which I thoroughly enjoyed. So when I received the review copy I began reading it at the first opportunity. From the first chapter I was hooked and found it difficult to stop turning the pages. Ben’s easy writing style I first encountered in Beginnings, continues in this second installment to make for an effortless read. The locations are atmospheric. The characters are interesting. The story thrilling and well written. The ending was completely unexpected, which I found enormously satisfying. My only criticism of the Priest’s Secret is that it concluded the story. I would have liked it to continue but perhaps that is just me being selfish. An excellent novel that I have no qualms about recommending.” (Indy-review-USA) SYNOPSISAfter surviving the trap-filled catacombs below Rosslyn Chapel and the two assassins sent below to kill him, Ben travels to France to join forces with Jon Creed, whose grandfather was Abbé, Rivière, the priest who heard Saunière’s death bed confession.Together they hatch a dangerous plan to safeguard the Tomb and its cache of priceless artifacts.The task will not be an easy one as THEY also want the artifacts.The Rex Deus, the mysterious Order of the Compagnie du Saint-Sacrament, the Knights Templar and the Vatican, all move in on the duo to reclaim that which they believe to be rightfully theirs.Intent on revenge for the death of her two brothers, Raven, a sexy and beautiful assassin also seeks out Ben. (See Beginnings)Facing danger at every turn, the thrilling story started in book 1 – BEGINNINGS, concludes beneath the Temple Mount in Jerusalem.A story filled with Ancient Crypts, Tombs, Murder, kidnapping, atmospheric locations, exciting chases, daring escapes and a trip to Jerusalem to enter the tunnels beneath the Temple Mount, concludes the thrilling story started in Beginnings.Includes flashbacks to the life and times of Bérenger Saunière, the priest of Rennes-Le-Château.The Priest' Secret continues from Beginnings - Book 1 of the Tomb, the Temple, the Treasure, and includes the novelization of some of the Myths and Legends associated with the tiny hill top village of Rennes-le-Chateau and the surrounding countryside. Most of the locations mentioned in this book are real locations, including the caves, the remainder is from the authors imagination.NEW updated edition uploaded 14-4-2019",
  "genres": [],
  "author": "Ben Hammott",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/20938796-the-priest-s-secret"
}