{
  "title": "Lethal Standoff",
  "description": "Justice can be elusive. Family secrets can be deadly. The stakes are high, and the clock is ticking in a volatile criminal case filled with unanswered questions. And Carrington Reed is running short on time to piece together clues that will solve the puzzle.Hostage negotiator Carrington Reed is called to the scene when reports come in that fifteen hostages are being held by the Kendrix brothers in an abandoned house in south Texas. When she arrives on site, Carrington quickly learns that the brothers are armed and refuse to release their victims, a group of undocumented immigrants, until the local police identify their father’s murderer.Working closely with Levi Ehrlich, a handsome investigative reporter who has covered some of Carrington’s negotiations in the past, she finds herself being undeniably drawn to him. Carrington digs deeper into the death of the Kendrixes’ father and begins to notice that some details surrounding his death aren’t adding up.As Carrington investigates the brothers’ claims and tries to piece together their motive for taking innocent people captive, it soon becomes clear that they are trying to hide something and that revenge for their father’s death may not be what they’re really bargaining for after all. To protect the hostages and ensure the brothers don’t carry out the rest of their sinister plot, Carrington must get to the bottom of one family’s secret and the truth they’re trying so hard to hide before time runs out.Award winning author DiAnn Mills delivers pulse-pounding romantic suspense about secrets, betrayal, and finding a path to forgiveness.Includes discussion guide for book groups.A clean contemporary thriller from Christy Award–winning author DiAnn MillsFor fans of action-packed romantic suspense in the vein of Lynette Eason, Irene Hannon, and Dani PettreyFrom the popular author of Facing the Enemy",
  "genres": [
    "Christian Fiction",
    "Romantic Suspense",
    "Romance",
    "Christian",
    "Mystery",
    "Fiction",
    "Contemporary"
  ],
  "author": "DiAnn Mills",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/209399741-lethal-standoff"
}