{
  "title": "Submerged: How a Cold Case Condemned an Innocent Man to Hide a Family's Darkest Secret",
  "description": "An explosive work of investigative journalism revealing the travesty of justice that sent an innocent man to prison and let the real murderer of a teenage girl go free.For most families that have suffered the unsolved murder of a loved one, a successful cold case investigation can finally bring closure to their tragedy and, ideally, bring the perpetrator to justice. But in 2013, when LaPorte, Indiana, police detectives arrested Jason Tibbs for the murder of sixteen-year-old Rayna Rison twenty years before, they sent an innocent man to prison and they also removed a cloud over the victim’s brother-in-law, Ray McCarty. McCarty had previously been indicted for killing her and, three years before that, impregnating her at the age of twelve. Today, Tibbs sits in an Indiana prison serving a forty-year sentence for killing Rayna Rison. His conviction in 2014 was partly due to failures in his defense and evidence that the judge would not permit in the trial. But the fact that charges were dropped against McCarty and then filed against Tibbs speaks to the remarkable influence of politics on the criminal justice system in northwestern Indiana. It also shows how easy it can be to concoct a capital case against an innocent man and how the touted triumphs of the justice system can sometimes go horribly wrong. Submerged tells the full story of the Rayna Rison case for the first time in meticulous detail. Drawing on countless interviews and a deep examination of the legal record, Hillel Levin tells the tragic story of a girl tortured by her family and failed by the justice system and proves Tibbs’s innocence so that some justice in this story might still emerge.",
  "genres": [
    "Crime",
    "True Crime",
    "Thriller",
    "Mystery Thriller",
    "Nonfiction",
    "Mystery",
    "Detective"
  ],
  "author": "Hillel Levin",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/209364636-submerged"
}