{
  "title": "Indebted: A Sin from Ashes",
  "description": "*Warning*  This story is NOT your standard Happily Ever After. It contains various supernatural beings, scenes of extreme violence, elements of the BDSM lifestyle, group sex, dubious consent, revenge, unrequited love, and a LOT of profanity. It is not for the Prudish, Squeamish, or Those easily offended by a woman who owns her sexuality. Because this story contains some scenes with extreme Violence please use caution when reading, as it may be a trigger for some readers.  Apparently it also needs to be said. Even though clearly my keywords are not little kid friendly. So hear it THIS STORY IS INTENDED FOR ADULTS. THAT'S PEOPLE OF CONSENTING AGE IN THEIR RESPECTIVE COUNTRIES. HELL LET'S JUST JUST MAKE THIS EASY. MAKE SURE YOU'RE 18+ BEFORE YOU ONE CLICK! PLEASE AND THANKS (Turns down volume on caps lock. )    Theodore calls the last person in the world he knew would willingly help him, Artisyn. The beautiful seductress from his past. Because of their not so amicable parting he has to force her hand by calling in his claim on the vow she made to repay him.  After two years of self-imposed exile, Ex-Special Operative Artisyn Daniels receives a phone call from the last person in the world that she wants to hear from. Theodore Mezzanetti and he is summoning her to return.    She is thrust in with a team of Theodore's men, who are to help her assimilate back into the world of espionage, sex, and BDSM, to find the person responsible for killing women in an abusive and sadistic manner. Her goal... Repay her debt, then cut all ties to her past life, once and for all. Will she be able to trust Theodore to keep his word?  Will they be able to complete the mission before the killer strikes again? Emotions run high, as feelings develop, truths are revealed, and a dark secret comes to light.",
  "genres": [
    "Erotica",
    "BDSM",
    "Paranormal Romance"
  ],
  "author": "Khai L. Bayne",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/20945351-indebted"
}