{
  "title": "Transparent Is a Color",
  "description": "Perry's mother told him he'd develop the superpower of flight, like his grandfather. She even named him Peregrine, so folks would call him \"The Falcon.\" Spoiler— they don't. Because when he did come into his power, all he got was the ability to change colors. Not even himself, like some kind of Chameleon Man, but the color of objects. He can de-pukify the shade of his bedroom curtains, turn a bully's sweatshirt pink, or even turn a red traffic light green. (Not a good idea.) He hasn't told anyone except his disappointed mom about his power. What would they call him? The Interior Decorator? Back in high school, under stress, he did convince his power that transparent was just another color. Now that ability's sometimes fun in an illicit way. Then one morning, in the mailroom at work, he turns a cardboard box transparent and sees a bomb inside. And Perry's ordinary life explodes. Sergeant Deckard of the Nova City Bomb Squad never thought much about superheros, or supervillains for that matter. He has plenty of work with ordinary humans and their explosives. Until he and his bomb-sniffing dog, Nix, get called to a possible-explosives situation in a highrise mailroom. The guy who reported the bomb is a nerdy twink in dark-framed glasses who pushes all of Deck's buttons. When he finds out the young man has a weird superpower and may be the target of a villain, every protective instinct comes into play.Deckard's goal is to keep his job, his dog, Nova City, and Perry intact. His libido can just sit down, shut up, and take a number. But as their attraction gets hotter and the villain closes in, their future might be blown apart before it even has a chance to start.Transparent Is a Color is a part of the multi-author Subparheroes MM romance series.",
  "genres": [
    "M M Romance",
    "Romance",
    "Fantasy",
    "Paranormal",
    "Superheroes",
    "Mystery",
    "Urban Fantasy"
  ],
  "author": "Kaje Harper",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/209447669-transparent-is-a-color"
}