{
  "title": "Hers Series Box Set #1-2.5",
  "description": "Only for a limited time, you can enjoy all three Hers Series books, including two full length novels, and one novella for discounted price!  Enjoy Hers, Finding Willow and Kink the Halls.  *Hers* (Brand new, re-edited file!) I am weak. I am lonely. I am a slut. I am strong. I am Dominant. I am independent. I am Seven James.  My entire life, no one has wanted me, and that was fine, because I sure as shit didn't need anyone else. Blah, Blah Blah, insert sad story here about negligent parents, and shitty siblings, and you have my life story in a nut shell. When my college boyfriend dumped me, it was just icing on the cake. Five years, and a booming career later I am here to collect my revenge.  That was until a delicious plaything walked into the kink club I frequent, and rocked my typically un-rockable world. Causing me to break the one rule I have lived by since Daniel Alexander walked out of my life, never have sex with the same person twice. Ever.  Warning!!!! Hers contains sexually explicit situations that may be uncomfortable for some. These include FF, FMF, and MFM interactions.  *Finding Willow* Where do you turn when all the bridges you have built in life have gone up in flames? When the ones you love don’t protect you from the monsters lurking in the dark?  I never thought at twenty-eight-years-old I would have nothing to show for my life. A child given away for strangers to raise. A childhood ruined. A life full of dead ends, drug abuse, and one night stands.  I'm at a crossroads, and I have a choice to make. I choose salvation. I choose life. I choose myself, for the first time ever.  I will find her. I will find the life I was forced to give up. I just pray that he stays out of my way.  I am Starburst Bloom and this is my story.  Finding Willow contains mature content, 18+.  *Kink the Halls* Best selling author Dawn Robertson treats us to a short Christmas novella featuring your favorite characters from the Hers series.  'Tis the Season for an dysfunctional Christmas tale!  Seven and Levi are celebrating their first holiday together. Star is pretending to be domesticated. And new love is blooming.  Seriously, what more do you expect from the Seven James-Parker/Star Bloom crew?  One thing is for sure, this is a Christmas no one will be forgetting anytime soon!  Special box set in anticipation for the release of the 4th Hers Series book, This Girl Stripped in March!",
  "genres": [],
  "author": "Dawn  Robertson",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/20941097-hers-series-box-set-1-2-5"
}