{
  "title": "Good Dream, Bad Dream: The World's Heroes Save the Night!",
  "description": "Heroes and heroines have always helped kids make their dreams good. Multicultural and mythological, this tale features comic book art and a bilingual Spanish translation.From time immemorial, children like Julio have had bad dreams! But at Julio's bedside, his dad comforts anyone can summon the help of brave avengers to conquer their fears. Every culture has its own legendary champions who can vanquish scary monsters or villains. So Julio learns one's powerful imagination can turn any dreams into good ones.Take a trip through time and across the continents! From mythology and legend, superheroes and superheroines help children who deserve a sound night’s sleep! Together they confront the crowd of creatures that go bump in the night. The story labels nearly 100 characters so readers can learn more about them! Kids and parents deserve a super bedtime story! Leaping from history and fable onto spectacular spreads, courageous defenders are on your side. Families will marvel at guardians such as Artemis from Greece, Thor from Scandinavia, The Monkey King from Asia, and more specials guests too!Illustrating the world's superheroes in a vibrant comic book style, this adventure has universal appeal with its bilingual Spanish translation. Teachers and librarians will see this sensational storybook will fly off the shelves as students admire the fantastic action in this Junior Library Guild pick!“ Good Dream, Bad Dream has a powerful message about inspiration, hope, and facing one's fears, and is highly recommended for personal and public library bilingual children's collections.”- Midwest Book ReviewDesde tiempos inmemoriales, niños como Julio han tenido malos sueños! pero el padre de Julio le cuenta esta cualquiera puede pedir ayuda a míticos héroes para vencer sus miedos. Cada cultura tiene sus campeones legendarios o heroínas míticas que vencen cualquier aterrador villano o monstruo. Julio así aprende como su imaginación puede convertir un mal sueño en uno bueno.",
  "genres": [
    "Picture Books",
    "Monsters",
    "Mythology",
    "Childrens",
    "Spanish Literature",
    "Superheroes"
  ],
  "author": "Juan Calle",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/20949636-good-dream-bad-dream"
}