{
  "title": "Tehran Noir",
  "description": "Vali Khalili's story \"Fear Is the Best Keeper of Secrets\" has been named a finalist for the Private Eye Writers of America Shamus Award for Best P.I. Short Story!Named a Notable Translation of 2014 by World Literature Today\"This entry in Akashic's noir series takes the gritty sensibilities born out of American film and fiction to Tehran.\"-- Publishers Weekly\"A tour de force not to be missed.\"-- World Literature Today\" Tehran Noir is not only a solid crime collection, but an illuminating look into day-to-day life in the Middle East, with religious and political implications galore, as well as racial tensions bubbling just beneath the surface...The stories in Tehran Noir aren't always easy to read, but they are engaging in the extreme.\"-- San Francisco Book Review\"The 15 stories in this collection also come from a stellar and diverse cast of Iranian writers....A collection such as this is able to bring Iran to life for the foreign reader in a way other fiction and non-fiction cannot....Superb.\"-- PopMatters\" Tehran Noir is a worthy addition to Akashic's collection...bloody and beautiful.\"-- Digging Through the Fat\" Tehran Noir will prove fascinating reading to anyone with an interest in Iran. It will be equally intriguing for a reader who is simply curious about a theocratic society in the 21st century, or what became of a vibrant, cosmopolitan society after the fall of its dynastic ruler.\"-- Gumshoe ReviewLaunched with the summer '04 award-winning best seller Brooklyn Noir , Akashic Books continues its groundbreaking series of original noir anthologies. Each book is comprised of all-new stories, each one set in a distinct neighborhood or location within the city of the book.Includes brand-new stories Gina B. Nahai, Salar Abdoh, Lily Farhadpour, Azardokht Bahrami, Yourik Karim-Masihi, Vali Khalili, Farhaad Heidari Gooran, Aida Moradi Ahani, Mahsa Mohebali, Majed Neisi, Danial Haghighi, Javad Afhami, Sima Saeedi, Mahak Taheri, and Hossein Abkenar.From the Introduction by Salar \"There is something of both the absolutely spectacular and positively disgraceful about Tehran. But most writers around the world are inclined to think that their own sprawling metropolis is the capital of every imaginable vice and crime, of impossible love and tenderness and cruelty and malice in measures that seldom exist anywhere else. For me, Tehran's case is no different--except that there really is a difference here. The city may be a hothouse of decadence, a den of inequity, all that. But it still exists under the watchful eye of a very unique entity, the Islamic Republic. The city enforces its own morality police, and there are regular public hangings of drug dealers and thieves. Because of this, there is a raging sense of a split personality about the place--the imposed propriety of the mosque rubbing against the hidden (and more often not so hidden) rhythms of the real city...There is always an element of the end of the world about this place. A feeling of being once removed from the edge of the precipice. Elsewhere I have called it the \"Seismic City\"--the seismic sanctuary. All of this will end one day. Yes. And maybe sooner than later. And when it does, by God, we will miss it.\"",
  "genres": [
    "Iran",
    "Short Stories",
    "Mystery",
    "Noir",
    "Crime",
    "Anthologies"
  ],
  "author": "Salar Abdoh",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/20949595-tehran-noir"
}