{
  "title": "Shame On Her Volume 2",
  "description": "Explore your wildest fantasies in a hot new series where women are stripped, shamed, and publicly humiliated before they’re coerced into degrading sexual acts, with a little blackmail or bribery as extra incentive. The action is so intense that sometimes the women get aroused themselves!Each volume contains three short stories.VOLUME 2“Shaming the Maid” – Young Maria, a Brazilian beauty, gets caught stealing money and jewelry by the teenage son of one of her clients. She’s forced to clean the house in the nude, then clean part of the young man’s anatomy—with her mouth. Maria’s humiliation continues as she has to clean the windows and do yard work in the nude as well, trying her best to avoid the neighbors.“Shaming the Camp Counselors” – Two rookie female counselors quickly learn that the hazing ritual at Camp Hillcrest is no picnic. First the two young lovelies are ordered to do all sorts or chores around the camp wearing only their underwear. The next morning, they’re marched to the exercise field totally nude and forced to complete an exhausting work out—including jumping jacks, push-ups, and an obstacle course—in front of both the male and female counselors.“Shaming the New Secretary” – Lisa loves being the hottest girl at the insurance agency, until the night she passes out on a sofa after sleeping with her boss during a wild office party. The young brunette panics when she wakes up the next morning and can’t find her dress. Totally naked and desperate to find some clothes before her coworkers arrive, she services a member of the cleaning crew in exchange for his coveralls. But the deal goes sour and Lisa remains naked until a few of the other secretaries arrive. The older ladies, jealous of Lisa from the start, force her to do office tasks in the nude then take turns spanking the poor girl. Lisa thinks her ordeal is finally over when another secretary lends her a blouse to wear, but the humiliation is just beginning.",
  "genres": [],
  "author": "K.C. Silkwood",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/20950720-shame-on-her-volume-2"
}