{
  "title": "Rescued by the Buccaneer",
  "description": "When Frederica Beauchamp boards a ship for the Americas, she dreams of a life filled with adventure, but she gets more than she bargained for when her passenger ship is attacked by pirates. The heartless men kidnap her and force her to serve their captain—a fate that might be worse than death, since though he does not have his way with her, the captain delights in baring her, shaming her, and thrashing her bare bottom as punishment for every imagined disobedience.After the pirates bring aboard an injured man found floating in the sea, Frederica tends to his wounds and learns that he is Gaston Galette, a survivor of a shipwrecked vessel. Gaston seeks her help to overthrow the vile captain, but when their plan goes awry he is forced to use all of his wiles to save them. As the naïve girl and the seasoned sailor navigate one perilous situation after another, he informs Frederica that the only way they can survive is if he is in command, and that if she thinks things can be otherwise, she will be taken over his knee for a bare bottom spanking.As he watches the proud, willful Frederica bow to his authority, however, Gaston worries that her growing hold on his heart will be his downfall. He knows he cannot take a woman with him when he returns to his ship and crew, but when Frederica accepts his lustful dominance completely, submitting to him with grace and beauty no other woman could match, Gaston realizes that he may never be able to let her go.Publisher’s Note: Rescued by the Buccaneer is the first book of the Pirates of the Jolie Rouge trilogy. It is an adventure and erotic romance novel that includes spankings, sexual scenes including elements of BDSM and humiliation, and more. If such material offends you, please don’t buy this book.",
  "genres": [
    "Historical Romance",
    "Pirates",
    "Romance",
    "BDSM",
    "Historical",
    "Erotica",
    "Erotic Romance"
  ],
  "author": "Normandie Alleman",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/20958715-rescued-by-the-buccaneer"
}