{
  "title": "Shadowplay",
  "description": "Passion comes at a price.  The Prince Winter Vaughan is the light in my darkness, pulling me from the shadows. Which is exactly why I should stay away from her—for her safety and mine. I vowed never to return to D.C., and yet here I am, fighting in vain to outrun the demons planning to drag me back to hell. My focus should only be on helping my son heal and mending the rift I’ve caused with my absence in his life. But Winter and I? We’re like magnets—pulled by an irresistible force that grows stronger the longer we’re together. We’re destined to collide. I just hope we can survive the crash. The Survivor Hunter Brigham is the definition of danger and a forbidden temptation I know I should avoid at all costs. Being with him could unravel everything I've fought so hard to overcome and put my entire future at risk. Yet, despite what’s at stake, I’m drawn to him—a prisoner to the growing desires I thought I'd buried long ago. He's the darkness I can't resist, even as it threatens to consume me. But as our connection deepens, I'm forced to confront a raw Our love may be the very thing that destroys us. Ghosts of our pasts and shady political alliances threaten to tear us apart. The question is…will we let them win? Shadowplay is a gripping tale of forbidden love and dangerous secrets—where the consequences of passion unfold in a world dictated by the rules of the wealthy and the covert forces that keep them in power. Can Hunter and Winter navigate the shadows of their desires, or will their story be written by sinister influences beyond their control? Shadowplay is book 1 in The Devils in D.C. series and features a billionaire single dad who falls first in this opposites attract dark romance. Part thriller, part suspense (and 100% spicy romance). This book is told in dual first-person POV and ends on a cliffhanger. A complete list of the CWs can be found on the author's website.",
  "genres": [
    "Dark Romance",
    "Dark",
    "Suspense",
    "Romance",
    "Slow Burn",
    "Romantic Suspense"
  ],
  "author": "Angel M. Shaw",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/209558540-shadowplay"
}