{
  "title": "Divergent Series Ultimate Four-Book Collection: Divergent; Insurgent; Allegiant; Four",
  "description": "Available together for the first time—all three books in the #1 New York Times bestselling Divergent trilogy, plus the companion volume told from the perspective of the immensely popular character Tobias. Perfect for established fans who want to own the full Divergent library or readers new to the series, this ebook bundle includes Divergent, Insurgent, Allegiant, and  A Divergent Collection. One choice can transform you. Veronica Roth's #1 New York Times bestselling debut is a gripping dystopian tale of electrifying choices, powerful consequences, unexpected romance, and a deeply flawed \"perfect society.\" One choice can destroy you. Veronica Roth's second #1 New York Times bestseller continues the dystopian thrill ride. As war surges in the factions all around her, Tris attempts to save those she loves—and herself—while grappling with haunting questions of grief and forgiveness, identity and loyalty, politics and love. The explosive conclusion to Veronica Roth's #1 New York Times bestselling Divergent trilogy reveals the secrets of the dystopian world that has captivated millions of readers. A Divergent A companion volume to the worldwide bestselling Divergent series, told from the perspective of Tobias. The four pieces included—\"The Transfer,\" \"The Initiate,\" \"The Son,\" and \"The Traitor\"—plus three additional exclusive scenes, give readers a fascinating glimpse into the history and heart of Tobias, and set the stage for the epic saga of the Divergent trilogy.And don't miss The Fates Divide, Veronica Roth's powerful sequel to the bestselling Carve the Mark!",
  "genres": [
    "Young Adult",
    "Dystopia",
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Romance",
    "Adventure"
  ],
  "author": "Veronica Roth",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/20957429-divergent-series-ultimate-four-book-collection"
}