{
  "title": "The Age of Reagan: The Fall of the Old Liberal Order, 1964-1980",
  "description": "The Age of Reagan brings to life the tumultuous decade and a half that preceded Ronald Reagan's ascent to the White House. Based on scores of interviews and years of research, Steven F. Hayward takes us on an engrossing journey through the most politically divisive years the United States has had to endure since the decade before the Civil War. Overseas, we were embroiled in a war we couldn't win; at home our streets had become battlefields; and in Washington, the old liberal order was collapsing under the weight of a long string of failed policies. \"It seemed that an era of American optimism and progress had come to a close,\" Hayward writes. \"The concatenation of Vietnam, Watergate, the recurrent energy crisis, the swooning economy, the increasingly disorderly world scene, and the failed presidencies associated with these events robbed Americans of their native optimism for the future.\"Meanwhile, from out of the West arose a new conservative movement led by Ronald Reagan, a one-time Hollywood actor whose speech in 1964 in support of the doomed candidacy of Barry Goldwater not only electrified a national television audience but also created a political star who would change the course of history.With meticulous detail, Hayward captures an America at war with itself—and an era whose reverberations we feel to this very day. He brings new insight into the profound failure of Lyndon Johnson's Great Society, the oddly liberal nature of Richard Nixon's administration, the significance of Reagan's years as California's governor, and the sudden-death drama of his near defeat of Gerald Ford in the 1976 Republican primary, the listlessness of Jimmy Carter's leadership, and the political earthquake that was Reagan's victorious presidential campaign in 1980.Provocative, authoritative, and majestic in scope, The Age of Reagan is an unforgettable account of the rebirth and triumph of the American spirit.",
  "genres": [
    "History",
    "Politics",
    "Biography",
    "Presidents",
    "American History",
    "Nonfiction",
    "American"
  ],
  "author": "Steven F. Hayward",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/209541.The_Age_of_Reagan"
}