{
  "title": "Uncle Tom's Cabin: The powerful anti-slavery novel, with bonus material: 12 Years a Slave by Solomon Northup",
  "description": "EXCEPTIONAL UNABRIDGED EDITION Read two of the greatest American works of all time in a unique edition:  Uncle Tom's Cabin by by Harriet Beecher Stowe.  Twelve Years a Slave by Solomon NorthupUncle Tom's Cabin or \"Life Among the Lowly\" is an anti-slavery novel by Harriet Beecher Stowe (1811-1896), an American active abolitionist and author.  First published in 1852, this best seller follows the lives of two slaves in Southern United States: Eliza, who escapes slavery with her son, and Tom, African-American slave who must endure humiliation, abuse, and torture inflicted by his wealthy owners.This fiction embodies the conflict lived among America North and South and has contributed to the outbreak of the Civil War. It also asserts the author's strong belief that Christian love can overcome the worst injustices and reaffirms the importance of women's influence.This outstanding work is a story of faith, courage, determination, perseverance and the struggle for freedom. It is credited with helping fuel the abolitionist cause in the 1850s.Referred to as \"Great American Novel,\" it is doubtless the greatest book of anti-slavery ever written.Twelve Years a Slave, first published in 1853, is a memoir and slave narrative by American Solomon Northup (1808-1863?).Northup, a black man who was born free in New York state, details his being tricked to go to Washington, D.C., where he was kidnapped and sold into slavery in the Deep South.  After having been kept in bondage for 12 years in Louisiana by various masters, Northup was able to write to friends and family in New York, who in turn secured his release with the aid of the state.Northup's captivating and terrifying narrative provides extensive details on the slave markets in Washington, D.C. and New Orleans, and describes at length cotton and sugar cultivation and slave treatment on major plantations in Louisiana.This outstanding work was published eight years before the Civil War, soon after \"Uncle Tom's Cabin,\" to which it lent factual support.  Northup's book, dedicated to Stowe, was an instant bestseller in its own right.Find the masterpieces referred to as \"Great American Novels\" in a beautiful book series by the editor Atlantic Editions:  The Last of the Mohicans, by James Fenimore Cooper  The Scarlet Letter, by Nathaniel Hawthorne  Moby-Dick, by Herman Melville  Uncle Tom's Cabin, by Harriet Beecher Stowe  The Adventures of Tom Sawyer and Huckleberry Finn, by Mark Twain",
  "genres": [],
  "author": "Harriet Beecher Stowe",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/20957940-uncle-tom-s-cabin"
}