{
  "title": "Gabby, Angel of God",
  "description": "Supernatural Romantic Thriller that feels like falling in love!    The story starts out with a young widower, Bo, raising two small children and the three heartbeats that will change his life. Ride along as stunningly beautiful Gabby, takes this human man on the no-holds barred adventure of a lifetime!    If you've ever lost a loved one this story is for you!  A story of Peace, Love, Hope, Charity and the strength of Faith, you'll love Gabby, Angel of God.    Gabby, is gorgeous, powerful, and able to take on forces that would make the most powerful armies turn and run for their lives. You'll be addicted in no time!  Pure Fun...an Adrenaline Rush! Just when a young man feels he has lost everything he meets an angel and finds out that his life is just beginning. Gabby is an angel of God who shows him that life is always full of surprises, adventures and a lot more meaning than we can easily fathom. She shows Bo how to help others, be open to love again and find the hidden strength that lies within all of us. It is a story with heart and hope that will take you on an adventure of faith with one amazing angel.   Gabby, Angel of God will take you on one heck of a ride!   Gabby, Angel of God is a Supernatural Romance Thriller, it involves an angel, Gabby, short for Gabriella - Basically, a man during a visit to Bar Harbor, Maine encounters a beautiful angel named Gabby; quite accidentally, he is told - she wasn't supposed to make him aware of her existence. His purity of spirit, kindness and capacity for love has revealed her to him. Naturally he falls hopelessly in love with the beautiful creature, as humans can not resist angels. The book is titled Gabby, Angel of God, Guardian and Messenger (Keeper of the Peace, Love, Hope, Charity and Faith. She's quite something and they go on a quick but exciting adventure helping people in trouble. There's even some horror thrown into the mix. Gabby fits nicely in the Supernatural, Romantic Thriller, Paranormal and Time Travel genres. Think Angel Encounter, Angel Romance Thriller, or Angel Adventure, and Paranormal Romance.",
  "genres": [],
  "author": "Greg Sandora",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/20958825-gabby-angel-of-god"
}