{
  "title": "Callsign Doubleshot: Knight and Deep Blue",
  "description": "In 2011, Jeremy Robinson released a series of eight novellas—deemed the ‘Chesspocalypse.’ Each novella follows a single member of the Chess Team from his Jack Sigler thriller series. The stories take place after the events of Threshold, the third full-length novel in the series, and before the events of Ragnarok, the fourth. The novellas are all co-authored by Jeremy Robinson and one of six other fantastic authors. The Chesspocalypse novellas are designed to introduce readers to the series. If you haven’t read the novels, no worries. Enjoy the ride! The stories were released in the following King – Book 1 Queen Rook King – Book 2 – Underworld Bishop Knight Deep Blue King – Book 3 – Blackout This collection contains the Knight and Deep Blue stories. The three King books were collected in the bestselling King – The Brainstorm Trilogy. The Queen, Rook and Bishop stories were collected in the Callsign – Triple Shot collection. KNIGHT When a team of Delta operators goes missing in Shenhuang, one of China’s newly constructed ghost cities, Shin Dae-jung— Knight, is called in to assist. But the Osprey transporting him to the scene falls prey to an EMP attack and is forced to crash land atop a parking garage. With a wounded pilot in tow, Knight explores the empty city for signs of life and finds two terrified children, who warn him that something monstrous is stalking the city. When the pilot disappears, leaving a pool of blood and spent bullet casings behind, Knight doesn’t doubt their story. As bullets fly and bodies drop, Knight must protect the children, uncover the fate of the missing Delta team and defend against an unstoppable killer, whose ability to regenerate and whose horrible appearance reminds him of something he’s faced before—the mythological Hydra. But he’s not alone in the surreal abandoned city. A team of SAS soldiers, along with Anna Beck, a former member of Manifold Genetics’ private security force, join the fray. Together, they fight—and die—against a nightmare that follows its objective to the kill them all. DEEP BLUE Tom Duncan— Deep Blue, former Army ranger, former president of the United States and handler of the black ops force known as Chess Team, is visiting the team’s new secret headquarters. The underground facility, known as Alpha, once belonged to Manifold Genetics, a corrupt corporation shut down by Chess Team. But despite being abandoned for years, Alpha still hides secrets. Security doors slam shut and lock, sealing Duncan and his assistants inside. As Matt Carrack, the leader of Duncan’s security team, attempts to gain access, Duncan discovers they are not alone inside the abandoned facility. High tech intruders have infiltrated the base, their goal unknown. But a far greater threat rises from the subterranean depths beneath Alpha—failed regenerative experiments from the days of Manifold, and they’re fast, hostile and hungry. While the security team are beset by ingenious death traps, determined mercenaries and vicious creatures that defy their imaginations, Duncan and his personal bodyguard must battle the growing tide of creatures, stave off the incursion of enemy forces and prevent the violent intruders from releasing the horror currently contained inside Alpha, to an unsuspecting outside world. And as the battle rages, a bomb quietly counts down in the shadows.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Thriller"
  ],
  "author": "Jeremy Robinson",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/20958964-callsign-doubleshot"
}