{
  "title": "Of Fur & Fangs",
  "description": "Things don’t shift any better than this! Of Fur & Fangs brings you six sizzling dark dangerous paranormal reads from five best-selling authors.  FANG CHRONICLES: MANDY’S STORY by D’Elen McClain- Every beastkind knows you don’t mess with a Kodiak bear—everyone that is except Mandy, the wolf-pack Alpha’s sister. When Mandy hears whispers that the bad attitude bear, Honey, has chosen a mate, she takes matters into her own hands because her wolf decided months before that Honey was hers.  BIG BAD BEAST by Skhye Moncrief- Each wants the other, but neither can stand to be in the same room together…And each has secretly lusted for the other like a dark explosive sin. Stand back and watch the fireworks light up the Minnesota Territory’s post-apocalyptic sky because the BIG BAD BEAST can’t help but to huff and to puff and to blow Josie’s house in…  FERAL FASCINATIONS by Skhye Moncrief- Their blood lust flares hotter than a solar storm…She seduced an earthling to create their were-assassin blood bond. Shanghaied to fight a war between vampires and werewolves, his gut shouts escape. But humanity needs a hero. Colliding in a universe of psychic mind-reading games, each realizes trusting the other is as dangerous as buying into their FERAL FASCINATIONS.  THE GEORGIAN EMBRACE by Sky Purington- Everything changes for eighteenth century Isabel when Devin, a mysterious stranger claiming to be from the future, appears on her Georgian's worksite. Even as smoldering, unavoidable desire ignites between them they must struggle to stay one step ahead of the time-warping house caught in Calum's Curse. Better yet, the rival werewolf determined to finish the legacy it began.  CARNAL THIRST by Celeste Anwar- When Danior found the woman being drained of life by one of his clan, for some unfathomable reason, he knew he could not allow her to die. Against the ruling of the council, Danior secrets her away, taking her through the change from human into vampire and forever changing life as she knows it. But the move ensures they will be outcasts--hunted to the death by his people.  THE PROTECTORS DAMON by Teresa Gabelman- The Vampire Council Warriors have been ordered to train social workers how to protect themselves against vampire attacks. VC Warrior Damon DeMaster’s and social worker Nicole Callahan clash at their first meeting. Even as sparks fly and tensions mount, Nicole and Damon depend on each other to protect the children of both races against the new drug hitting the streets, Crimson Rush.",
  "genres": [],
  "author": "D'Elen McClain",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/20961264-of-fur-fangs"
}