{
  "title": "Three Days to Never",
  "description": "When Albert Einstein told Franklin Roosevelt in 1939 that the atomic bomb was possible, he did not tell the president about another discovery he had made, something so extreme and horrific it remained a secret . . . until now. This extraordinary new novel from one of the most brilliant talents in contemporary fiction is a standout literary thriller in which one man stumbles upon the discovery Einstein himself tried to keep hidden.When twelve-year-old Daphne Marrity takes a videotape labeled Pee-wee's Big Adventure from her grandmother's house, neither she nor her college-professor father, Frank Marrity, has any idea that the theft has drawn the attention of both the Israeli Secret Service and an ancient European cabal of occultists—or that within hours they'll be visited by her long-lost grandfather, who is also desperate to get that tape.And when Daphne's teddy bear is stolen, a blind assassin nearly kills Frank, and a phantom begins to speak to her from a switched-off television set, Daphne and her father find themselves caught in the middle of a murderous power struggle that originated long ago in Israel and Germany but now crashes through Los Angeles and out to the Mojave Desert. To survive, they must quickly learn the rules of a dangerous magical chess game and use all their cleverness and courage—as well as their love and loyalty to each other—to escape a fate more profound than death.A pulse-pounding epic adventure that blurs the lines between espionage and the supernatural; good and evil; past, present and future, Three Days to Never is an exhilarating masterwork of speculative suspense from the always remarkable imagination of the incomparable Tim Powers.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Time Travel",
    "Thriller",
    "Urban Fantasy",
    "Alternate History"
  ],
  "author": "Tim Powers",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/209688.Three_Days_to_Never"
}