{
  "title": "Plain Dealing",
  "description": "The death of a woman forces a small rural town to uncover its first murder in more than fifty years. In a town so small, where everyone knows every intimate detail about each other, thanks to the town’s ever-churning gossip mill, it should be easy to find the killer amongst them. Or is it?  From the beginning, rumors of who the murderer is point in one single direction. Dr. Tell, a native of New Orleans, and therefore a newcomer to Plain Dealing, is the owner and chief of staff of the hospital where the slain woman worked. And rumor is Dr. Tell’s has an unquenchable dark side. Whispered of having a penchant for preying on the nurses inside his hospital, for most in the town it’s an open and shut case. If this is so, why hasn’t the town’s sheriff made any arrests?  Alison Saunders knows all too well that every rumor spoken inside of the Snack and Eat Diner, which doubles as the town’s gossip headquarters, isn’t true. As a victim of these rumors, she’s had to live her entire life as an unwanted resident. Living alone is what she’s used to, and although she’s hated it seems by everyone, she refuses to imbibe from the well of pity. Determined to make the most of her life, she takes each day as it comes, unaware that deep down inside her lonely heart is pleading for someone – anyone – in Plain Dealing to give her a chance at friendship. This chance finally comes when unusual circumstances pair her with Dr. Tell. As one of his nurses, will she be the town’s next victim?  With the rumor mill grinding at a swift speed, the sheriff and his deputies try and beat the clock to uncover the killer that everyone in town is looking for. Meanwhile, Alison’s new friendship with Dr. Tell unexpectedly sends her spiraling into a sexual lifestyle she never knew existed. After more women are murdered, Alison must ask herself. Is she finally living or is she setting up her own demise?  Plain Dealing is a story about stepping out of a small town caste, learning of one’s independence, building friendships and finding love in those who others around have deemed unlovable. With a fast pace and filled with levity, it’s a book you won’t be able to put down, and when you do you understand just how powerful spoken words truly are.",
  "genres": [],
  "author": "Shelley Young",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/20959457-plain-dealing"
}