{
  "title": "Cinderella's Sisters: A Revisionist History of Footbinding",
  "description": "The history of footbinding is full of contradictions and unexpected turns. The practice originated in the dance culture of China's medieval court and spread to gentry families, brothels, maid's quarters, and peasant households. Conventional views of footbinding as patriarchal oppression often neglect its complex history and the incentives of the women involved. This revisionist history, elegantly written and meticulously researched, presents a fascinating new picture of the practice from its beginnings in the tenth century to its demise in the twentieth century. Neither condemning nor defending foot-binding, Dorothy Ko debunks many myths and misconceptions about its origins, development, and eventual end, exploring in the process the entanglements of male power and female desires during the practice's thousand-year history.Cinderella's Sisters argues that rather than stemming from sexual perversion, men's desire for bound feet was connected to larger concerns such as cultural nostalgia, regional rivalries, and claims of male privilege. Nor were women hapless victims, the author contends. Ko describes how women—those who could afford it—bound their own and their daughters' feet to signal their high status and self-respect. Femininity, like the binding of feet, was associated with bodily labor and domestic work, and properly bound feet and beautifully made shoes both required exquisite skills and technical knowledge passed from generation to generation. Throughout her narrative, Ko deftly wields methods of social history, literary criticism, material culture studies, and the history of the body and fashion to illustrate how a practice that began as embodied lyricism—as a way to live as the poets imagined—ended up being an exercise in excess and folly.",
  "genres": [
    "History",
    "Nonfiction",
    "China",
    "Asia",
    "Gender",
    "Feminism",
    "Gender and Sexuality"
  ],
  "author": "Dorothy Ko",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/209641.Cinderella_s_Sisters"
}