{
  "title": "All We Thought We Knew",
  "description": "She was so sure she knew her family’s story . . . Now she wonders if she was wrong about all of it.1969. When Mattie Taylor’s twin brother was killed in Vietnam, she lost her best friend and the only person who really understood her. Now, news that her mother is dying sends Mattie back home, despite blaming her father for Mark’s death. Mama’s last wish is that Mattie would read some old letters stored in a locked trunk, from people Mattie doesn’t even know. Mama insists they hold the answers Mattie is looking for.1942. Ava Delaney is picking up the pieces of her life following her husband’s death at Pearl Harbor. Living with her mother-in-law on a secluded farm in Tennessee is far different than the life Ava imagined when she married only a few short months ago. Desperate to get out of the house, Ava seeks work at a nearby military base, where she soon discovers the American government is housing Germans who they have classified as enemy aliens. As Ava works to process legal documents for the military, she crosses paths with Gunther Schneider, a German who is helping care for wounded soldiers. Ava questions why a man as gentle and kind as Gunther should be forced to live in the internment camp, and as they become friends, her sense of the injustice grows . . . as do her feelings for him. Faced with the possibility of losing Gunther, Ava must choose whether loving someone deemed the enemy is a risk worth taking, even if it means being ostracized by all those around her.In the midst of pain and loss two women must come face-to-face with their own assumptions about what they thought they knew about themselves and others. What they discover will lead to a far greater appreciation of their own legacies and the love of those dearest to them.Includes discussion guide for book groupsStandalone Southern, historical family drama about enduring hope amid personal tragedyClean, suspenseful historical fiction, perfect for fans of Susan Meissner or Lisa WingateDual timeline set during the Vietnam War and WWII.",
  "genres": [
    "Historical Fiction",
    "Christian Fiction",
    "Fiction",
    "Historical",
    "Christian",
    "Audiobook",
    "World War II"
  ],
  "author": "Michelle Shocklee",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/209606292-all-we-thought-we-knew"
}