{
  "title": "In the Name of Salome",
  "description": "The Barnes & Noble Review - La Musa de la Patria  In recent years, novelists Mona Simpson (Anywhere But Here), Karla Kuban (Marchlands) and Susannah Moore (My Old Sweetheart), among numerous others, have memorably explored the mother-daughter relationship, showing us the conflicted, often painful intersections of the lives of their multigenerational characters. But in Julia Alvarez's new novel, In the Name of Salome, the mother, Dominican poet and political muse Salomé Ureña, only lives long enough to hear her three-year-old daughter Camila recite one of her consumptive mother's poems. What we get, then, is a compelling work of fiction based on remarkably tireless research and shaped by Camila's reach into the past, into her mother's history and her mother's place in history, in order to make sense of the choices she has made about her own.  A masterful manipulator of time, Alvarez alternates points of view, shuttling us not only back and forth between Salomé and Camila, but also moving us forward in Salome's life as she moves us backward in Camila's. Salomé writes in secret as a child, publishes briefly under a pseudonym and soon emerges as herself, a figure of inspiration for a nation. But all the while she longs for that other kind of passion, the one her family and her readers would like to believe she is above: the passionate love of a man. Sadly, though she finds that love in Papancho, he is never fully hers. He belongs in turn to his country, to his studies, and inevitably to another woman. How Salomé withstands losing this managain andagain has to do with what we all withstand  wisely and unwisely  in the name of love.  Camila writes poetry only as a mature woman. As a child her life is shaped by the political values that shape Papancho's life. Those values find only cautious expression in the U.S. where she studies at the University of Minnesota and later becomes a professor at Vassar. But in Cuba, where she spends the last 13 years of her life, she fulfills the dream of both her mother and father as a vital and dedicated participant in Fidel Castro's \"revolutionary experiment.\"  Through skillful mechanics Alvarez makes characters of time itself and the history that marks it. And what troubling history it is, spanning over 100 years (1856-1973) in the life of the Dominican Republic, where the government changes hands with as much frequency as a señorita changes her linens, and \"Depending on the president, the pantheon of heroes changes, one regime's villain is the next one's hero, until the word hero, like the word patria, begins to mean nothing.\".  But if history renders language meaningless, what is left? Only the struggle to make meaning, and only love makes that struggle real and worthwhile; on this matter mother and daughter agree. So this is also a love story, in which Salomé discovers that she will give up everything  her writing, her social activism, finally her health  for the man she loves, and Camilla discovers that she will sacrifice her secure teaching position in the U.S., the approval of family, friends and erstwhile lovers for the very thing her mother's passionate poetry taught her: love for the land and the people who give life to it.  Alvarez's skillful prose styling distinguishes the two women not only through the details of their lives but also through their meticulously wrought voices. Moreover, just as interesting as what distinguishes them from one another is what unites them: the pull of public life on their private lives and the challenges presented by the conventions that govern their lives as women. And they and we thrill equally to the ultimate discovery we're all reaching for, \"that hushed and holy moment...when the word becomes flesh.\"  In a book rich in extended metaphor, where poetry and idealism play a huge role, we are never encumbered with abstraction. This is a writer going at full tilt: wry, wise, ironic, forgiving. She, like both the women of this novel, is an educator, though neither didactic nor condescending. Even though we know from the beginning the details about the end of both mother's and daughter's lives, Alvarez manages to sustain an air of suspense throughout, the point being not what happens, but how it comes about, and at what cost.  Susan Thames is the author of a book of short stories, AS MUCH AS I KNOW. Her novel I'll Be Home Late Tonight was a Barnes & Noble Discover Great New Writers selection.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Novels",
    "Latino",
    "Historical",
    "Book Club",
    "Latin American"
  ],
  "author": "Julia Alvarez",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/11210.In_the_Name_of_Salome"
}