{
  "title": "Callsign - Tripleshot",
  "description": "In 2011, Jeremy Robinson released a series of eight novellas—deemed the 'Chesspocalypse.' Each novella follows a single member of the Chess Team from his Jack Sigler thriller series. The stories take place after the events of Threshold, the third full-length novel in the series, and before the events of Ragnarok, the fourth. The novellas are all co-authored by Jeremy Robinson and one of six other fantastic authors. The Chesspocalypse novellas are designed to introduce readers to the series. If you haven't read the novels, no worries. Enjoy the ride!The stories were released in the following order:Callsign: King–Book 1Callsign: QueenCallsign: RookCallsign: King–Book 2–UnderworldCallsign: BishopCallsign: KnightCallsign: Deep BlueCallsign: King—Book 3—BlackoutThis collection contains the standalone Queen, Rook and Bishop stories.CALLSIGN: QUEENAt the beginning of her search for Rook, a missing Chess Team member, Zelda Baker, Callsign: Queen, is redirected to Pripyat, Ukraine, a ghost town on the radioactive outskirts of Chernobyl. Intel indicates that splinter cell of Manifold Genetics—a ruthless corporation dismantled by Chess Team—may be operating in the area. Tasked with confirming the existence of a Manifold facility, Queen begins a recon sweep of the abandoned town in search of clues, but soon finds herself fighting for her life. Something sinister lurks beneath the decaying, surreal remnants of Pripyat's never-used amusement park, and it rises up to greet Queen.In Pripyat, the streets are empty, the derelict buildings crumble, but the bodies...are fresh.CALLSIGN: ROOKAfter a failed mission claims the lives of his five-man support team, Stan Tremblay, Callsign: Rook, flees Siberia and finds himself on the secluded coast of Norway, north of the Arctic Circle. Exhausted, cut off from the outside world, and emotionally beaten from his defeat in Russia, Rook just wants to find a place to rest. The small coastal town of Fenris Kystby seems like the perfect place.Within hours of arriving, he discovers that the town is not as tranquil as it appears. The townspeople are mistrustful of outsiders, a pack of mysterious wolves stalk the local tundra, and two villagers have been killed by a creature that defies explanation. To make things worse, there are rumors of something sinister, something the townspeople refuse to discuss.Despite the hostility of the locals, Rook commits to stopping the creature murdering townspeople. As the body count rises, he quickly learns that the greatest threat might walk on two legs. And when he uncovers the town's hidden past, Rook knows only one thing for certain: something is rotten in Norway.CALLSIGN: BISHOPAn Iranian terrorist cell has gotten their hands on weaponized Ergot-B—a compound that causes violent hysteria, madness and death within 24 hours—and plan to unleash the weapon on major cities around the world. Successful deployment would begin a bloodbath, as those exposed would kill everyone they encountered before succumbing to the compound's lethal effects.Erik Somers, Callsign: Bishop, is called in to investigate, but his first discovery shocks him to the core. Dawoud Abbasi, the terrorist leader planning to unleash Ergot-B, is his biological father.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Thriller"
  ],
  "author": "Jeremy Robinson",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/20958971-callsign---tripleshot"
}