{
  "title": "Pledge: Darker Bond Edition",
  "description": "Journey to the dark side of Sefaera with Ollie and Gabe with scenes not included in the original edition...\"This is a quick, sexy, delight of a book that passes all the vibe checks! I hope the author publishes more in this universe soon!\"\"Eleanor Rose’s writing is lush, vivid, and captivating. If you’re worried about the fantasy aspects, don’t be. This is relatable, readable, and sexy fun!\"\"MM Fantasy Romance that will satisfy all of your trope cravings while still bringing you something FRESH\"From the vision of acclaimed authors Eleanor Rose, August Oliver, and Chase St. Clare, dive into the intense and alluring world of love, lust, betrayal, and ancient magic that binds soulmates together through passion. Billionaire orphan Gabe, with his striking blue eyes and Hollywood charm, walks a treacherous path of self-destruction, haunted by the ghosts of his past.Olympio, the demon prince with flaming copper hair and unsettling yellow eyes, has a mission. He has been watching over Gabe, his destined soulmate, for nearly two decades, waiting for the right moment to claim what is rightfully his. But when danger threatens to take Gabe's life, Olympio's killer instincts take over, leading him to make a rash decision that will forever change the course of their intertwined fates.Whisked away to the majestic realm of Sefaera, Gabe's defiance and resistance to Olympio's control burns bright. This world of magic and power is unlike anything he's ever known. This leaves Olympio, torn between love and duty, alone to navigate the treacherous waters of palace intrigue and age-old vendettas, with enemies lurking in every shadow, waiting for a single misstep.As love, lust, betrayal, and ancient traditions converge, both Gabe and Olympio will face tests of loyalty and trust. Will their bond be their salvation, or will it be the chain that binds them to tragedy?Step into a world where love is not just instant but earned, where each decision can tip the scales of destiny, and where the journey is just as heart-wrenching as the destination. Prepare your heart for Pledge.*The Darker Bond Edition contains additional scenes not included in the first edition due to being darker in nature. This edition contains instances of dubcon and might be triggering for some individuals.",
  "genres": [
    "Fantasy"
  ],
  "author": "Eleanor  Rose",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/209781871-pledge"
}