{
  "title": "We Are Not Ourselves",
  "description": "The instant New York Times bestseller The Washington Post calls a superbly rendered novel, and Entertainment Weekly describes as a gripping family saga, maybe the best since The Corrections. Born in 1941, Eileen Tumulty is raised by her Irish immigrant parents in Woodside, Queens, in an apartment where the mood swings between heartbreak and hilarity, depending on how much alcohol has been consumed. From an early age, Eileen wished that she lived somewhere else. She sets her sights on upper class Bronxville, New York, and an American Dream is born.Driven by this longing, Eileen places her stock and love in Ed Leary, a handsome young scientist, and with him begins a family. Over the years Eileen encourages her husband to want more: a better job, better friends, a better house. It slowly becomes clear that his growing reluctance is part of a deeper, more incomprehensive psychological shift. An inescapable darkness enters their lives, and Eileen and Ed and their son Connell try desperately to hold together a semblance of the reality they have known, and to preserve, against long odds, an idea they have cherished of the future.Described by The New York Times Book Review as \"A long, gorgeous epic, full of love and caring, one of the best novels you'll read this year, We Are Not Ourselves is a testament to our greatest desires and our greatest frailties. Through the lives of these characters, Thomas charts the story of the American Century. The result is stunning. The joys of this book are the joys of any classic work of literature, for that is what this is destined to become, superbly rendered small moments that capture both an individual life and the universality of that person's experience\" (The Washington Post).",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Literary Fiction",
    "Book Club",
    "Contemporary",
    "Historical",
    "Novels"
  ],
  "author": "Matthew  Thomas",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/20975187-we-are-not-ourselves"
}