{
  "title": "The Curse of the Thrax",
  "description": "Jaykriss is a typical teenager. He’s bored with school, the girl he loves doesn’t even know he’s alive, and he and his mother disagree—a lot.  Not everything is typical in Jaykriss’s life, however. Glyndich the Great, Jaykriss’s warrior father, died fighting a dragon—and in doing so lost the Bloodsword, a treasured heirloom that is the family’s symbol of power.  Jaykriss lives in the Godswood,a tiny village deep in the forest near the ancient Priestbain, the fortress home of the Godswood priests. The priests rule the Godswood through their close relationship with the all-powerful Dark King. Jaykriss and the rest of the villagers just barely get by, surviving day-to-day despite nefarious plots by the priests, constant threats by groups of half-human mutants—and, of late, by the Thrax itself, an enormous dragon once thought to be extinct.  But one day, all of that changes.  On a routine hunting trip, Jaykriss and his best friend are chased by the Thrax. Terrified, they seek refuge in a forest cave hidden behind a waterfall. The cave shelters an eccentric hermit, a refugee from the Dark King, whose home is filled with books and devices from ancient times. The hermit teaches Jaykriss that all is not as it seems in his world. The mutants and dragons are actually relics of a biological disaster that ravaged the planet years before. The Dark King, revered as a god, is a vicious ruler who will do anything to stay in power. Jaykriss realizes that although he is not a warrior like his father, he can use his instincts and intellect to confront the Thrax, recover the Bloodsword and save his family. He may, in fact, be The One who Leads, prophesied to save the entire human race. But is Jaykriss ready for his destiny--or will it consume him?",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Monsters",
    "Fiction",
    "Dragons"
  ],
  "author": "Mark   Murphy",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/20980878-the-curse-of-the-thrax"
}