{
  "title": "De grote geest der Saha Sapa",
  "description": "The brainchild of Amazon Kindle Number One bestselling western writers Mike Stotter and Ben Bridges, PICCADILLY PUBLISHING is dedicated to reissuing classic fiction from Yesterday and Today!  DAKOTA TERRITORY  The big strike had hit the Dakota Territory and Sundance found himself hip-deep in the action. A money-hungry head of a band of buffalo hunters swore he would grab the lion’s share of the loot. Before Sundance faced him in a showdown, he would tangle with General George A. Custer, a kill-crazy Sioux medicine man and Lucille, the beautiful, hot-blooded boss of the Hills’ wildest saloon.   ABOUT THE AUTHOR  Benjamin Leopold Haas was born in Charlotte, North Carolina, in 1926. His imagination was inspired by the stories of the Civil War and Reconstruction as told by his Grandmother, who had lived through both. Ben’s father was also a pioneer operator of motion picture theatres, “ ... so I had free access to every theatre in Charlotte and saw countless films growing up, hooked on the lore of our own South and the Old West.”  Largely self educated (he had to drop out of college in order to support his family), Ben wrote his first story, a pulp short for a western magazine, when he was just eighteen. But when he was drafted into the Army, his dreams of becoming a writer were put on hold. He served as a Sergeant in the U.S. Army from 1945 to 1946, and saw action in the Philippines.  Returning home to Charlotte (and later Sumter, in South Carolina) in 1946, Ben married Douglas Thornton Taylor from Raleigh four years later. The father of three sons (Joel, Michael and John), Ben was working for a steel company when he sold his first novel in 1961. The acceptance coincided with being laid off, and thereafter he wrote full time.  A prolific writer who would eventually pen some 130 books under his own and a variety of pen-names, Ben wrote almost twenty-four hours a day. “I tried to write 5000 words or more every day, scrupulous in maintaining authenticity,” he later said.  Ben wanted to be a mainstream writer, but needed a way to finance himself between serious books, and so he became a paperback writer. Ben’s early pen names include Ben Elliott (his grandmother’s maiden name), who wrote Westerns for Ace; and Sam Webster, who wrote five books for Monarch. As Ken Barry he turned out racy paperback originals for Beacon with titles like The Love Itch and Executive Boudoir. But his agent was not happy about his decision to enter the western market, and suggested he represent himself on those sales. Ben had sent a trial novel to Harry Shorten of Tower Books. Ben’s family remembers it being A Hell of A Way to Die, written for Tower’s new Lassiter series. It was published in 1969, and editor Shorten told his new author to create a western series of his own. The result was Fargo.  The success of Fargo led to the Sundance series. Jim Sundance is a half-Cheyenne gunslinger who takes on the toughest jobs in order to raise funds to fight the corrupt Indian Ring back in Washington. The short-lived John Cutler series followed, and then perhaps Ben’s crowning achievement, the Rancho Bravo novels, published under the name Thorne Douglas.  Ben Haas died from a heart attack in New York City after attending a Literary Guild dinner in 1977. He was just fifty-one.  Fan favourite James Reasoner has hailed Ben as “one of the best action writers of all time”. In TWENTIETH CENTURY WESTERN WRITERS, David Whitehead wrote that Ben Haas “ranks among the most influential and under-rated Western writers of recent times… the hard-hitting adventures of Neal Fargo and Jim Sundance were largely responsible for creating the Western Series market vi",
  "genres": [
    "Westerns"
  ],
  "author": "John Benteen",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/20975522-de-grote-geest-der-saha-sapa"
}