{
  "title": "Family Strategies: Practical Tools for Professionals Treating Families Impacted by Addiction",
  "description": "Addiction passes through families generationally, and is said to be the gift that goes on giving. The use of Family Strategies is an opportunity for the gift to become that of recovery, the possibility of changing the individual, the immediate family, and the intergenerational transmission of addictive disorders. Change begins with one person. From a systematic viewpoint, when one person changes the way he or she functions within the family system, that system will change. This is readily evident when addiction enters a family system, and it is just as apparent when recovery enters that system. In a therapeutic setting it is easy for the practitioner, the addicted person, and the family to view the addicted person as the identified client, the addicted person is the predominant focus. Family Strategies facilitates shifting perspective to the family members as clients. Giving principal consideration to the family system or the primary relationship with the addicted person makes them the focus. The strategies presented are those proven most effective in primary family systems therapy when addiction is either still active or the addicted person is in early recovery, irrespective of the type of addiction, whether it is substance addiction, behavior, or process addiction. This workbook is composed of five · Viewing the Family Addiction· Stepping Out of the Shadows· Recognizing the Family Dance· Developing Emotional Clarity· Walking the Path of Recovery A sampling of sessions included · Codependency As An Addiction· Sharing the Disease· Giving Up Control· Role Patterns· Identifying Boundary Extremes· Impaired Family· Portrait of Feelings· Shame Attacks· Emotional Sociogram· Drama Triangle· Portrait of Recovery· Codependency First Step This book is intended for use by clinicians, addiction counselors, and mental health care practitioners who are already skilled in understanding addictive disorders and their impact on families, and those who work with a family member or members in a relationship with someone actively in addiction or in recovery. It is used quite effectively with spouses, partners, parents, and adolescent or adult age children. In many sessions it is appropriate to include the addicted person, but that is at the facilitator's discretion. In many of the strategies sections, ideas and formats are presented for structured interventions. The use of handouts in the form of written exercises, checklists, sentence stems, structured dialogues and/or art activities is an integral part of this therapeutic technique. All handouts are designed for clinicians to reproduce and use without restriction as to copyright permission. The audio CD, Letting Go Imageries, offers meditations on healing and recovery for anyone involved in a troubled family system and it can be used in a group or individual setting.",
  "genres": [],
  "author": "Claudia Black",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/11210740-family-strategies"
}