{
  "title": "Unchain My Heart",
  "description": "The Princess & The Biker – A modern day Romeo & Juliet.Their two worlds collide, but the Biker and his Princess fight to be together. Their story continues in “Unchain My Heart” as the modern day Romeo and Juliet have fallen in love against the odds—but their families persist in trying to tear them apart. Especially Harrison, who has an unhealthy hatred for bikers and uses his position as a cop to keep Ryder Knox away from his younger sister. Can Jade ever forgive him for the untold grief he brings to her and her man? Ryder’s family of bikers is no better. Fearing for the club, Cobra is dead set against Ryder being with Jade. Who will Ryder choose? His Scorpio Stinger MC brothers OR his Princess? Will Ryder and Jade be able to overcome the many obstacles in their way? Can their love survive the loss they suffer and the choices they must make? The Beauty & The BeastEva has never known a man so lost, so broken, yet so cocky and confident at the same time. Harrison Summers can unravel her with a mere look, set her heart beating with a touch, make her wanton with his words. Harrison demands her submission. Will she ever be able to surrender, willingly, to a man? Eva doesn’t know the answer, but she’s prepared to try. After the first taste, she wants more. Never one to take the easiest route, she wants to push to the edge of her limits. Eva is willing to give her body to Harrison. But her heart? No way. He’s too guarded with his own. He’s hard, cold and distant. Set on revenge. A beast. Eva knows heartbreak when she sees it. Harrison Summers will trample her heart to pieces and not give a damn. Intelligent, graceful and poised. She’s the beauty, he’s the beast.Fiercely independent, Eva Ryder isn’t used to taking orders from anyone. Harrison believes it will make her submission so much sweeter. Will she choose to live on the edge? Surrender to him?Never before has he wanted anything this much. It destroys his plans of living for his career and not getting involved with a woman. Sex once and let go. No ties, no tomorrows. That’s how he operates. Add to that his uncontrollable desire for revenge and he’s one messed up dude.But Eva?Harrison hates change. But there’s absolutely nothing he can do to stop it. He’s in too deep already. Is Eva the beauty who can tame the beast?The one who can Unchain His Heart?",
  "genres": [
    "Erotica",
    "Contemporary Romance",
    "Contemporary",
    "Adult",
    "BDSM",
    "Love",
    "Motorcycle"
  ],
  "author": "Jani Kay",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/20985987-unchain-my-heart"
}