{
  "title": "ФОРТ РОСС: историко-приключенческий роман",
  "description": "Эта книга, являясь, как любое художественное произведение, плодом фантазии автора, в своей основе содержит четыре малоизвестных (или хорошо скрываемых!) факта российской истории, которые и послужили отправным пунктом для создания этого историко–приключенческого романа с головокружительным детективным сюжетом.Знаете ли вы, что “Русская Америка”, историко–географическое понятие XVIII – XIX веков, – это не только Аляска? Это огромная территория Северо–Запада американского континента, простиравшаяся в то время до Северной Калифорнии. А Форт Росс, и поныне стоящий на берегу залива Бодега (бывший залив Румянцева) в 90 милях к северу от Сан–Франциско, являлся южным форпостом российских территорий.В 1799 году, благодаря стараниям камергера императорского двора Николая Петровича Резанова, была основана Русско–Американская компания. “Высочайшим повелением” императора Павла I компании было даровано монопольное право “добычи, использования и эксплуатации богатств Русской Америки”. Именно этой компании и принадлежала вся территория Русской Америки, включая Форт Росс.После убийства Павла внешнеполитический курс России, направленный, благодаря Нессельроде, на сближение с англо–американцами, серьезно вредил не только российским геополитическим интересам, но в первую очередь интересам Русско–Американской компании (РАК) – могущественной “олигархической” единице того времени, богатейшей и единственной в стране. Со смертью Александра I ситуацию еще можно было поправить. Случайность ли, что практически все “ключевые” декабристы были либо членами, либо держателями крупных пакетов акций Российской Американской Компании? Между тем, это исторический факт. А что вы скажете, если узнаете, что Кондратий Федорович Рылеев, один из организаторов восстания 14 декабря 1825 года на Сенатской площади, был также управляющим канцелярией Российской Американской Компании. Не слишком ли много совпадений?На этом историческом фоне и разворачивается действие романа.Туда, в Форт Росс начала 19 века, случай забрасывает главных героев повествования – кстати, наших современников. В запутанных интригах и тайнах герои попытаются разобраться при помощи необычного прибора – весьма своеобразной «машины времени», которая случайно оказывается у них в руках. Во что бы то ни стало они должны выяснить историческую правду, и ради этого путешествуют сквозь века. Попадая то в вигвамы индейцев, то во дворцы царей и вельмож, то на поля битв, герои романа – Дмитрий, Фимка и Марго – «растут» и становятся другими. Меняются они вместе с тем, как в их жизни появляется новая цель и смысл. В начале это довольно циничные журналисты одного из русско–американских телевизионных каналов, а в итоге – яростные защитники национальных интересов России.Но можно ли повлиять на ход истории? Даже если тебе, как гроссмейстеру, склонившемуся над шахматной доской с записью сыгранной партии, доподлинно известно дальнейшее развитие событий? В какой точке мировой истории временной поток устремился в нежелательном для России направлении? И можно ли изменить его русло?Совершенно неожиданно ответ на этот вопрос герои находят на Сенатской площади 14 декабря 1825 года. Их открытие ошеломит вас и заставит совершенно по-новому взглянуть на известные исторические события.Но готовы ли вы узнать правду?Написанный динамично и остроумно, роман «Форт Росс» порадует всех, кто любит увлекательное чтение и не разучился думать.",
  "genres": [],
  "author": "Dmitri Poletaev",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/20985119"
}