{
  "title": "Touched by Sunlight",
  "description": "IF WE ARE LUCKY, LIFE SENDS US ONE TRUE FRIEND. When Solaris left Tristan in San Diego to pursue her photojournalist career, she thought goodbye was forever. But six years and ten thousand miles did not erase their special friendship. While she is working freelance in Peru, Tristan finds her. But trouble follows him to the Amazon jungle. In one moment, her entire world is torn apart. His small decision to see Solaris ripples through their lives with devastating effect. Nothing will ever be the same. Solaris is coming home to San Diego. Courage to travel the world is gone. Her career is shattered. Her brother Wyatt is the only person she can trust. Joshua Archer dreams of danger, sending him cross-country with his sister Madison on a journey to save Solaris. Leaving their Boston life behind, they arrive on peaceful Coronado Island near San Diego to discover the beautiful woman they are destined to protect is surrounded by secrets. Her entire past is a lie. Solaris doesn't remember the day the lies began. Her young mind chose to forget all the beautiful things her heart lost. She got lucky. She survived. But someone very special died. Powerful corrupt people have dedicated their lives to concealing the truth and will destroy anyone who threatens their secrets. The truth is deadly. People meant to love you forever can be the most deceptive. Love must be stronger than fear to survive. Without courage, justice will be impossible. Solaris must risk everything to find the truth. But she is not alone. Someone is watching. Someone wants her dead. But someone else loves her. If we are lucky, Life gives us one true friend. \"Touched by Sunlight\" is the dramatic story of that courageous friendship and the sacrifice love must make. This Extraordinary Journey Romance travels through the Amazon to track a jaguar, will sweep along the shores of San Diego where dolphins play in the surf, and races across the warm sand on a beach that glistens gold in the summer sunlight. Fast-paced and emotionally involved, with charismatic characters that jump from the pages, \"Touched by Sunlight\" is addictive and unforgettable.",
  "genres": [],
  "author": "Leslie D. Stuart",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/20984821-touched-by-sunlight"
}