{
  "title": "CUT UP! An Anthology Inspired by the Cut-Up Method of William S. Burroughs & Brion Gysin",
  "description": "CUT UP! An Anthology Inspired by the Cut-Up Method of William S. Burroughs & Brion GysinEdited by A.D. Hitchin, Joe AmbroseIn Paris in the late Fifties the Beat Generation writer William Burroughs and his sidekick Brion Gysin developed the cut-up method. It involved taking a piece of finished text and cutting it into pieces – then rearranging those pieces to create a new text or work of art. Burroughs wrote that: “When you cut into the present the future leaks out.” The cut-up had a profound effect on music, writing, painting, and film. Devotees of the cut-up include David Bowie, Radiohead, and Kathy Acker. In addition to bringing together new work by new people, CUT UP! also salutes some better known 20th Century voices who kept the spirit of Burroughs and Gysin alive.Contributors include Kenji Siratori, Claude Pélieu, Nina Antonia, Billy Chainsaw, Cabell McLean, Mary Beach, Marc Olmsted, Allen Ginsberg, Spencer Kansa, Michael Butterworth, Robert Rosen, Nathan Penlington, Sinclair Beiles, Gary J. Shipley, D M Mitchell, Ben Szathani, and Edward S. Robinson.“Burroughs used the cut-ups to write beautiful poetry, or he would cut up his friends’ personalities and see what emerged. The cut-ups are the runway to the magic universe. Everybody should cut their lovers up for better sex. Everyone should get themselves CUT UP!”Victor Bockris, author of Transformer – The Lou Reed Story; Andy Warhol – The Biography“Since Gysin sliced the papers and with Burroughs saw the realm of the possible, the cut-ups have always been essential as experiments across all media. This volume returns to theories, texts and images; it looks back, looks forward, and cuts.”Jack Sargeant, author of Naked Lens: Beat Cinema; Deathtripping: The Cinema of Transgression",
  "genres": [
    "Poetry"
  ],
  "author": "A.D. Hitchin",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/20981138-cut-up-an-anthology-inspired-by-the-cut-up-method-of-william-s-burroug"
}