{
  "title": "True Gretch: What I've Learned About Life, Leadership, and Everything in Between",
  "description": "From trailblazing Michigan governor and rising Democratic star Gretchen Whitmer comes an unconventionally honest, personal, and funny account of her remarkable life and career, full of insights that guided her through a global pandemic, showdowns with high-profile bullies, and even a kidnapping and assassination plot.When Gretchen Whitmer was growing up, her beloved grandmother Nino taught her that you can always find something good in other people. “Even the meanest person might have pretty eyes,” she would say. Nino’s words persuaded Whitmer to look for the good in any person or situation—just one of many colorful personal experiences that have shaped her political vision. (And, as Whitmer writes, one that resonated more than another piece of advice her grandmother offered, to “never part your hair in the middle.”)In this candid and inspiring book, Whitmer reveals the principles and instincts that have shaped her extraordinary career, from her early days as a lawyer and legislator and her 2018 election as governor of Michigan, to her bold and innovative actions as she led the state through a series of unprecedented crises. Her motto in politics, she writes, is to “get shit done.”Whitmer shares the lessons in resilience that steered her through some of the most challenging events in Michigan’s history, such as the Covid-19 pandemic, a five-hundred-year flood, the rise of domestic terrorism, and the fierce fight to protect reproductive rights.Along the way, she tells stories about the outsize characters in her family, her lifelong clumsy streak, the wild comments she’s heard on the campaign trail, her self-deprecating social media campaigns (including her star turn as a talking potato with lipstick), and the slyly funny tactics she deploys to neutralize her opponents.Written with Whitmer’s trademark sense of humor and straight-shooting style, True Gretch is not only a compelling account of her remarkable journey, but also a blueprint for anyone who wants to make a difference in their community, their country, or the world. It is a testament to the power of humor, perseverance, and compassion in the face of darkness.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Politics",
    "Audiobook",
    "Biography",
    "Biography Memoir",
    "History"
  ],
  "author": "Gretchen Whitmer",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/209812423-true-gretch"
}