{
  "title": "Bitch, You're Just Not Approachable. How You Can Be THAT Girl",
  "description": "\"I want to be THAT girl who is confident about her weight, her hair, her clothes, her smile— THAT girl who is more approachable.\" If you've had this thought you're not alone. It's a thought that has crossed the minds of most women; even many of the most beautiful women in the world. So, what does that girl have that you don't? Believe it or not - Nothing. She's just learned a few simple things you haven't discovered yet. In fact, you may not know it yet, but you’re closer to being THAT girl than you think!Are you feeling like you’re in a rut? Do you feel like you have tried everything but guys still just don't seem to notice you? Do you feel depressed or insecure? Do you wonder why other girls seem to get so much more attention than you?If you answered yes to any of those questions, you NEED to read Christine Robb’s game changing book Bitch, You’re Just Not Approachable. How You Can Be THAT Girl. Rather than focusing on the little things that get us down, Christine gives tangible take-action advice that allows any girl - including you - the ability to be that confident radiant woman you've only dreamed of being until now. By taking you through her own journey, struggles and accomplishments, Christine shares how to focus on the positive in your everyday life and become a better version of yourself. The end result? Becoming more approachable and having men flock to you like metal to a magnet.Bitch, You’re Just Not Approachable. How You Can Be THAT Girl helps you realize what has truly been holding you back and gives you doable and realistic action steps that will not only change they way you see yourself, but also change the way men see you.Here's a little of what you'll discover…* What do men want?…. The answer is different from what you've always thought.* What really attracts men?…. Christine asked real guys for real answers about what they look for in a potential girlfriend.* How to get his attention…. This isn't like the other relationship and dating advice for women you've heard before. * Easy ways to increase your confidence, self-image and self-esteem without getting a \"makeover.\"*The only thing that is holding you back from being more confident, happy and approachable. Full of real advice, inspiring quotes, informative statistics and real life stories, Bitch, You’re Just Not Approachable. How You Can Be THAT Girl  is the guide you need to bring yourself to the next level. Become the magnetic girl in the room, become the girl you’ve always wanted to be, become who you really are. You can be THAT girl. I dare you.",
  "genres": [],
  "author": "Christine Robb",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/20990776-bitch-you-re-just-not-approachable-how-you-can-be-that-girl"
}