{
  "title": "Love, Lies And Murder",
  "description": "Telling Tales By Shiloh Walker Sheriff Kellan Grant has been dreaming of Darci Law for a very long time. Wild, sexy dreams. But he was badly burned once, and is interested in only one thing when it comes to women. Kellan knows that Darci will make him want more than one night in her arms, so he keeps his distance. Darci's dreams about Kellan are so intense that they leave her shaking and feeling obsessed. She can't stop thinking about the sexy sheriff the way he walks, the way he talks, the way he... But he never so much as looks in her direction. So when Kellan shows up at her front door, she is understandably a little confused, but ready to take advantage of any opportunity to finally get close to the man who haunts her dreams. Hot, liquid excitement swamps her system as midnight images rush through her head. He is finally within reach... Then Kellan tells her why he has come. There has been a murder. And she is his number one suspect. His Every Desire By Shiloh Walker \"I want your wife.\" In the past twenty years, Joel Lockhart had crossed a lot of lines on his quest for vengeance. But this was a new one. He was demanding exclusive sexual access to another man's wife. One look at Tracy Grainger though, and he couldn't stop himself. She was battered, beaten, but not quite broken not yet. He made the demand of the crime lord with every intention of seeing it through. Anything to get her away from her vicious husband. He never expected to fall in love. When he looked into Tracy's eyes, he felt something stir in the emptiness of his heart. An emotion that was unknown to him. It didn't take long for Joel to realize that he is willing to give up everything to have her, to hold her, to keep her safe. But the price to stay with her will be high. Staying with her might require letting go of his quest for vengeance. Giving up his need to put his sister's killers in the ground. Joel has to decide what is stronger his need for vengeance or his need to have Tracy with him always.",
  "genres": [
    "Erotica",
    "Suspense",
    "Erotic Romance",
    "Romance"
  ],
  "author": "Shiloh Walker",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/2099471.Love_Lies_And_Murder"
}