{
  "title": "فتاتان من شنغهاي",
  "description": "(فتاتان من شنغهاي Shanghai Girls) رائعة الروائية الأميركية المولد والصينية الهوى \"ليزا سي\" فبعد نجاحها في \"زهرة الثلج\" و\"موعد مع القدر\" تبحر بنا هذه المرة إلى مدينة شنغهاي مروراً بهونغ كونغ ثم لوس أنجلوس. في ثلاثينيات القرن الماضي لنشهد معها مفصلاً تاريخياً مهماً من تاريخ شنغهاي، باريس الشرق الأقصى في ذلك الوقت قبل أن تجتاحها اليابان، فبدا الحلم بالهجرة والهروب إلى أرض الفردوس الأخضر (أميركا) أملاً للكثيرين. ولكن، التعايش بين ثقافتين بدا أمراً مستحيلاً. عندما نقرأ \"ليزا سي\" نعرف أنها ستأخذنا إلى عالم أنثوي بامتياز كلما توغلنا داخله؛ نفاجأ أكثر بنساء يعرفن كيف يصبرن ويتقبلن الهزيمة ويتحملن الألم الجسدي والروحي معاً. في \"فتاتان من شنغهاي\" تتخذ الروائية من شخصيتي الجميلتين \"ماي\" و\"بيرل\" الأختين محوراً رئيساً لعملها. تعيش هاتان الفتاتان حياة مترفة في ظل عائلة تعيش حياة غربية صرفة لا تكترث بالتقاليد الصينية المتوارثة. تعملان عارضات للرسامين المتخصصين في الإعلانات التجارية، وتتصدر صورهما الرزنامات السنوية التي تباع في الأسواق، وبعد جلسات الرسم تذهبان إلى نادي كازانوفا، للقاء الأصدقاء المختلفين من أميركيين وصينيين وأوروبيين. تنقلب حياة هاتين الفتاتين رأساً على عقب حين يدبر لهما والدهما زواجاً تقليدياً من شابين صينيين يحملان الجنسية الأميركية، وهنا تكتشف الفتاتان بأن والدهما قد خسر تجارته في لعب القمار وأن العائلة معرضة للتشرد إن لم تتم تلك الصفقة. فتتزوج \"بيرل\" من \"سام\" و\"ماي\" من \"فيرنون\" الذي يصغرها بعدة أعوام. وتبدأ إجراءات السفر إلى لوس أنجلوس ولكن القدر بدا أنه يخبئ متاعباً ومفاجآت غير سارة. تتوالى الأحداث في الرواية لتكتشف بيرل وماي أنهما بيعتا للعم \"لوي\" والد العريسان لولادة الأحفاد، وبأنهما مدينتان له، وبأنهما لا تحتكمان على أي مال حتى تسدا دينهما، وبأن وجودهما في أميركا مرتبط بأوراق هذا العجوز، وبأن العم \"لوي\" يبدو غنياً في الصين ولكنه فقير في أميركا، وبأن شنغهاي مدينة يحيا فيها الفقراء والأغنياء معاً، لكن لوس أنجلوس مدينة البيض وكل من لا يملك العرق الأبيض يسكن في القاع! كل تلك الأمور تجعل الفتاتان تفكران في الهرب... محطات كثيرة، وأحداث مؤلمة تنتظرنا ونحن نتابع مصير ماي وبيرل في خضم تحولات شهدتها الصين، وألقت بظلالها على مختلف الصعد من سياسية واجتماعية واقتصادية، وخصوصاً عندما تُهزم اليابان في الحرب العالمية الثانية وتصبح الصين شيوعية ويصبح كل صيني في نظر المخابرات الأميركية هو شيوعي متواطئ وتبدأ حملة التفتيش عن الأوراق الثبوتية للصينيين وعن حقيقة ولادتهم في أميركا، ويبدأ مسلسل سحب الجنسية وتهجير المواطنين الصينيين إلى موطنهم الأصلي. إنها أكثر من رواية، هي ملحمة تجسد تاريخ مضى، ولكن إرهاصاته باقية، فالاختلاف بين الثقافات وعدم قبول الآخر المختلف عرقياً ونضال الغرباء، في بلاد الدولار الأخضر، له ثمنه الباهظ، وهذا ما أجادت بالتعبير عنه \"ليزا سي\" مشرعة الأبواب في رواية غير مكتملة وإنما مفتوحة، يتداخل فيها الاجتماعي مع الثقافي المعرفي لتاريخ بلادها في محطات مختلفة.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "China",
    "Historical",
    "Audiobook",
    "Asian Literature"
  ],
  "author": "Lisa See",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/11211725"
}