{
  "title": "Maelstrom",
  "description": "A Regency Romance... Margaret swept the crowd with her gaze, identifying Lucy's smile among the group of young men she always collected like iron filings to a magnet. Then, with a glance that released Toby to make his own way, for he was in no wise her escort, she moved toward the group of matrons seated in a semi-circle across from the musicians. Lady Fyfe and the Countess of Nettingworth instantly made room for her. Though she was fifteen years younger than the next youngest of them, she preferred this place because even the most rakish of the Blades rarely sought the company of these women, perceived as chaperones who did not dance, and thus she was fairly safe from imposings and lustings anywhere along the spectrum from hidden to blatant. For a moment or two she watched Toby, very handsome in a charcoal gray frock coat and pale gray trousers, as he lifted a glass of champagne from the tray of a circulating waiter, and then she turned her courteous and yet distant gaze back to the women beside her, who were commenting on the gowns and manners of many of this Season's new Marriageables. Seeming to pay attention, Margaret let her mind wander, hoping she would not be called upon to speak. Since the matrons would not wish his hovering presence, Foracre moved unobtrusively to a place at the wall, from which he could watch Margaret and the rest of the room. He declined the champagne one of the waiters offered him. The dance music began, and stately couples filled the dance floor. In the middle of the third dance, Margaret's world stopped for a heartbeat, then continued with the comfortable direction of her life completely changed. The Pelham family had not left their place at the door, for latecomers would still straggle in for the next few minutes. Between one beat of the music and the next, a man appeared in the doorway, lithe as a jungle cat, unexpected as a shout. He was danger in a black frock coat, the white ruffled front of his shirt a dazzling contrast to sun-browned skin and dark, restless eyes. He stepped bare-handed into a room full of gloves, bringing with him to the polite, mannered *ton* something raw, something savage. For the moments before Josh Foley stepped forward to greet him, with genuine delight, a paralysis seemed to claim those closest, as if they sensed the power of the spell cast by his presence, and that awareness of something highly unusual happening spread outward into the room so strongly that eyes turned toward his entrance, even among the dancers, even among the musicians, even among the matrons. For a split second, no more, Margaret lost control of her reactions. Her quick, indrawn breath was unstoppable, for without it she was certain she would have smothered. With a control made infinitely more difficult by its absolute necessity, she wrenched the serenity back over her face and made herself sit calmly, detachedly relaxed, as if nothing unusual had occurred. With almost every eye in the room on the stranger, only one person saw Margaret's moment of hesitation, her emotional stumble over a rock she hadn't known was in her path. Foracre observed the sharp motion of her gasp, noted the completely unguarded expression on her face in the instant before she controlled it, and recognized it for what it was. It was not fear, nor anguish, nor even hunger. It was a fierce, naked, exultant joy. And then she mastered it, but he knew beyond doubt that this was the man she'd cried out for in the delirium through which he had nursed her. Foracre acknowledged the sea change in their lives with a motionless nod to himself and a secret smile, then turned his regard upon the man to whom Lady Graham was somehow bound. \"Roby James writes with passion and intelligence.\" —Jack McDevitt, Nebula Award Winner \"Look out, Robert Jordan!\" —Barnes & Noble Booksellers Newsletter",
  "genres": [],
  "author": "Roby James",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/20990583-maelstrom"
}