{
  "title": "Old Man's Ride",
  "description": "He chuckled as he zipped his pants. “Not until you beg for it. And I didn’t say you were allowed to beg yet.”   Stubborn, hot-headed Lily only has three options - get married, get on her back, or get the hell out. The local MC makes the rules, and they rule the town. She chooses to leave. Nobody tells her what to do. Nobody bosses her around. Until she meets Nomad. He’s the former president of the Dust Bowl Devils. When he offers her a ride to LA, she jumps onto the back of his bike without looking back. But he’s got a different sort of ride in mind…  Warning: This 20,000+ word novella contains explicit language and graphic adult content including wild and rough sex between a young woman and a dominating older biker.  Excerpt:  “We’ll be staying in this town for a day or two,” he said as he stood. I followed him back outside. “I’ve got some business to attend to. You’ll wait in the motel unless I take you out, understand? You don’t go anywhere alone.” “What?!” That was just too much. He may have been doing me a favor, but I wasn’t his prisoner. He raised an eyebrow at me. “How about you ask like someone that has some manners?” I knew I was being deliberately shitty. I couldn’t help it. I was stressed and far from home, and his calm about the whole situation was making me angry. “Care to tell me what the fuck, please, sir?” We’d reached his bike. He paused to kick the stand up, intending to walk it to the gas station just in the next lot. He didn’t look at me as he spoke. “Oh, honey. You’re going to pay for that.” Goosebumps rose on my arms. I followed him to the gas pumps, a few steps behind. What did he mean by “pay”? I should have taken off right then. Fact was, I wasn’t his prisoner and I wasn’t his family, and if I wanted to run screaming, no one would take his side. Hell, he might not even try to follow me. I could make my own way to LA, or to anyplace else. But something stopped me. That hint of promise in his threat.",
  "genres": [
    "Erotica",
    "Contemporary",
    "Romance"
  ],
  "author": "Britten Thorne",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/20987449-old-man-s-ride"
}