{
  "title": "Practicing New Historicism",
  "description": "For almost twenty years, new historicism has been a highly controversial and influential force in literary and cultural studies. In Practicing the New Historicism, two of its most distinguished practitioners reflect on its surprisingly disparate sources and far-reaching effects.In lucid and jargon-free prose, Catherine Gallagher and Stephen Greenblatt focus on five central aspects of new recurrent use of anecdotes, preoccupation with the nature of representations, fascination with the history of the body, sharp focus on neglected details, and skeptical analysis of ideology. Arguing that new historicism has always been more a passionately engaged practice of questioning and analysis than an abstract theory, Gallagher and Greenblatt demonstrate this practice in a series of characteristically dazzling readings of works ranging from paintings by Joos van Gent and Paolo Uccello to Hamlet and Great Expectations.By juxtaposing analyses of Renaissance and nineteenth-century topics, the authors uncover a number of unexpected contrasts and connections between the two periods. Are aspects of the dispute over the Roman Catholic doctrine of the Eucharist detectable in British political economists' hostility to the potato? How does Pip's isolation in Great Expectations shed light on Hamlet's doubt?Offering not only an insider's view of new historicism, but also a lively dialogue between a Renaissance scholar and a Victorianist, Practicing the New Historicism is an illuminating and unpredictable performance by two of America's most respected literary scholars.\"Gallagher and Greenblatt offer a brilliant introduction to new historicism. In their hands, difficult ideas become coherent and accessible.\"— Choice\"A tour de force of new literary criticism. . . . Gallagher and Greenblatt's virtuoso readings of paintings, potatoes (yes, spuds), religious ritual, and novels—all 'texts'—as well as essays on criticism and the significance of anecdotes, are likely to take their place as model examples of the qualities of the new critical school that they lead. . . . A zesty work for those already initiated into the incestuous world of contemporary literary criticism-and for those who might like to see what all the fuss is about.\"— Kirkus Reviews , starred review",
  "genres": [
    "Nonfiction",
    "History",
    "Literary Criticism",
    "Criticism",
    "Philosophy",
    "Theory"
  ],
  "author": "Catherine Gallagher",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/210006.Practicing_New_Historicism"
}