{
  "title": "An Interest in Ponygirls",
  "description": "This tale continues the adventures of Aaron Clarke, a budding slaver setting up a franchise operation in Miami, Florida. Business and adventure literally fall his way as Aaron sets about creating identities, bases of operations, and a client base; all accomplished with the guidance of his partner Steve Austin. Aaron quickly discovers that the various illegal enterprises present him an opportunity for acquiring enticements too good to pass up and the windfall of millions of dollars leads him to reanalyze his business ethics and personal morals. Aaron Clarke determines that it is so easy to find prey worthy of punishment that he adjusts his business model accordingly, punishing the guilty and using his illicit gains to help others; all immensely sexy women that remain available for his enjoyment. In An Interest in Ponygirls, Doctor Joan Miller acts upon her burgeoning interest in Ponygirls. While she thought she understood the world of B&D from her occasional attendance at the Miami B&D club where she doubled as the club’s physician, and from her few dealings with the Aaron Clarke, she had far to go. Doctor Joan Miller, the talented Miami Beach surgeon, was to learn that for each irretrievable action taken, there could be unforeseen consequences that might not have been apparent before her poorly thought out plan was undertaken. During what should have been a night of romance with Robert Morgan, a series of missteps by Joan ruined the evening. Forced to confess her reasons for the romantic evening, Joan admitted that she wished that Robert would dominate her sexually and if satisfied by the experience, she hoped to ask Robert to get her an invitation to be a guest Mistress at a secretive Ponygirl Ranch. Her biggest mistake was her additional request to serve a day as a Ponygirl, pulling surreys around the countryside. Given Joan’s mistakes during the evening, mostly driven by arrogance, Robert only agreed to the requests after admitting to Joan that he only did so based upon her egregious behavior. Inwardly, he had misgivings about the wisdom of her request.",
  "genres": [
    "BDSM"
  ],
  "author": "Desert Dog",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/21014867-an-interest-in-ponygirls"
}