{
  "title": "The Call to Duty",
  "description": "Courageous. Brave. Fearless. Valiant. These synonyms are often used to describe firefighters/paramedics, police officers, and military personnel. They face danger and lay their lives on the line when they leave for work. What are their struggles? Could that hinder their job proficiency? Who is taking care of those who are taking care of the citizens of this country?Casey Carter is a 'newbie' to the firefighting family of Engine Company 15. Not only does she have to prove herself as a probationary firefighter, but she also has to battle misconceptions of females within her newly chosen profession. As situations begin to arise, can she count on the firefighter brotherhood to have her back? Will she be able to pass the tests placed before her, or are there aspects that she was not even aware existed? Often in life there are two realms in play. There is the physical realm - what is right before you; the other is the spiritual realm - what is unseen. Each can directly affect you, whether you believe they exist or not. Can Casey keep them in balance when she is not exactly sure what she is fighting? Can a group of men help her see what cannot be readily seen, hear what cannot be readily heard, and be able to overcome what she never knew existed? Will they be able to show Casey her true Call To Duty?Ephesians 6:12-13:12 For we wrestle not against flesh and blood, but against principalities, against powers, against the rulers of the darkness of this world, against spiritual wickedness in high places.13 Wherefore take unto you the whole armour of God, that ye may be able to withstand in the evil day, and having done all, to stand.(A portion of the proceeds of this series will go to Airborne Angel Cadets of Texas – a non-profit group of hardworking volunteers who send care packages to our soldiers overseas.)",
  "genres": [
    "Christian Fiction",
    "Christian",
    "Amazon"
  ],
  "author": "C.J.  Peterson",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/21007647-the-call-to-duty"
}