{
  "title": "A Hazard of New Fortunes",
  "description": "Set against a vividly depicted background of fin de siécle New York, this novel centers on the conflict between a self-made millionaire and a fervent social revolutionary-a conflict in which a man of goodwill futilely attempts to act as a mediator, only to be forced himself into a crisis of conscience. Here we see William Dean Howells's grasp of the realities of the American experience in an age of emerging social struggle. His absolute determination to fairly represent every point of view is evident throughout this multifaceted work. Both a memorable portrait of an era and a profoundly moving study of human relationships, Excerpt:The following story was the first fruit of my New York life when I began to live it after my quarter of a century in Cambridge and Boston, ending in 1889; and I used my own transition to the com mercial metropolis in framing the experience which was wholly that of my summs literary adven turer. He was a character whom, with his wife, I have employed in some six or eight other stories, and whom I made as much the hero and heroine of Their Wed ding Journey as the slight fable would bear. In ventur ing out of my adoptive New England, where I had found myself at home with many imaginary friends, I found it natural to ask the company of these familiar acquaint ances, but their company was not to be had at once for the asking. When I began speaking of them as Basil and Isabel, in the fashion of Their Wedding Jour ney, they would not respond with the effect of early middle age which I desired in them. They remained wilfully, not to say woodenly, the young bridal pair of that romance, without the promise of novel function ing. It was not till I tried addressing them as March and Mrs. March that they stirred under my hand with fresh impulse, and set about the work assigned them as people in something more than their second youth.",
  "genres": [
    "Fiction",
    "Classics",
    "American",
    "Literature",
    "19th Century",
    "Novels",
    "School"
  ],
  "author": "William Dean Howells",
  "average_rating": "3.24",
  "url": "https://www.goodreads.com/book/show/210126.A_Hazard_of_New_Fortunes"
}