{
  "title": "High Class Harlot",
  "description": "The language in this book is rough, but I feel it's a must due to the setting of the book. If you liked Trailer Park Princess and liked Mando then you already know she is over the top, but she is a lot to take in when it's nonstop. If you don't like foul, crude, mouthy females don't read this book. Trailer Park Princess finished where you could be content simply because Mando's story isn't for everyone. I am well aware of that. Release Date July 1, 2014People spend their whole lives being condescending cockstars. Assuming they know something when they don’t. Assuming they know who someone is when they have no idea. Assuming that, because they can see something, they understand it. Let me tell you right now, STOP ASSUMING! Until you walk a day in someone’s gold-studded hooker heels, you do not know them or their story. Do not assume your struggle is worse simply because it’s yours. Do not assume they are ok just because they look to be so. And do not assume you are a better person simply because someone chooses to sin differently than you. My family has money. We buy what we want without fear of being destitute, and we will never worry about having food or any other necessities. My struggle in life is not with the money, but where it comes from. My father’s secret is carrying a hefty price tag that I can no longer afford. My soul is priceless, and he is stripping it away from me. My world isn’t all rainbows, sparkle, and diamonds falling from my exit hole like Rory’s story portrayed. For every high, there is a low, and the higher you go, the further you have to fall.I have the best things in life, except for life itself. Everyone I love has moved away; my passion to exist has deflated; my job is a joke; but more than anything, I hate who I am allowing myself to become. Is there anyone strong enough to hold my hand on this road to self-preservation, or am I to travel it alone?  If you start my story, please find it in yourself to finish it before you judge me. Don’t assume you can know where I am headed without seeing where I have already been. I am Amandolette Riaz, and I am a glitzed-up glitch in today’s delicate world.",
  "genres": [],
  "author": "Delia Steele",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/20999523-high-class-harlot"
}