{
  "title": "The Bema: A Story About The Judgment Seat Of Christ",
  "description": "This is the book that inspired the life-changing drama that has been presented in churches across America. In the tradition of Jerry Jenkins' and Tim La Haye's Left Behind series, The Bema describes what Left Behind left what happens to Christians who are caught up in the rapture. Based solidly on biblical and theological research, this fictional account imagines what it will be like to experience the rapture of the church, see what heaven is like, meet your guardian angel, and appear before the Judgment Seat of Christ to receive your eternal reward for the way you have lived your life. If you have read non fiction books about the Judgment Seat of Christ like Your Eternal Reward by Erwin Lutzer or This Was Your Life by Rick Howard and Jamie Lash, you will especially appreciate seeing this Bible doctrine dramatized in your mind when you read The Bema . Most people who have seen the drama or read the book are profoundly affected by its message and give more thought to spiritual growth and Christian service. When THE DAY finally comes and you stand in the presence of the resurrected Christ to see with His eyes a review of your life, nothing that you thought was important will matter then. Only what you did that was pleasing to Christ will determine how you will be rewarded in eternity. On THE DAY you will wish you had done more to serve Christ and less to gratify your own selfish desires. By identifying with the experience of the main character, Daniel Matthewson, you will see how much more you could have had in eternity if you had been more serious about living the Christian life.The good news is that it is not too late. You still have time to live for Christ, to earn heavenly rewards that will last for eternity. Identifying with the main character will help take your eyes off the cares, pleasures and distractions of the world and re-orient your life around service to Christ and being pleasing to Him. Also, it is a great read. The story is so riveting you will not want to put the book down until you have read to its startling end.",
  "genres": [
    "Christian Fiction",
    "Christian"
  ],
  "author": "Tim Stevenson",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/2100610.The_Bema"
}