{
  "title": "Hat Dance",
  "description": "Emilia Cruz, Acapulco's first and only female police detective, will risk a dance with the devil to catch an arsonist and find a missing girl. But the music comes with a price no honest cop can afford to pay.By coincidence at the same restaurant as Acapulco's popular mayor, Emilia's date with hotel manager Kurt Rucker is cut short by an explosive fire that kills half of the mayor's security detail. Emilia is assigned to investigate what quickly is dubbed an assassination attempt on the politician. Frightened by the fire and the raw emotion it has sparked not only inside herself but across the city, Emilia isn't helped by a boss who is more concerned with his own demons than hers, and a new partner who comes with a bad attitude. Moreover, Kurt Rucker could leave Acapulco for a lucrative new job in Belize.When the involvement of the Mexican Army seems likely and would-be vigilantes post threatening videos on YouTube, Acapulco erupts with a wave of violent demonstrations. But even as pressure mounts for a fast arrest, Emilia remains bound by a promise to look for a girl who has disappeared from her own neighborhood. It doesn't take long before Emilia uncovers some nasty family secrets and turns to the city's most notorious hooker for answers, only to end up on the wrong side of a dirty Vice cop.As fires, death threats, and the fallout from hasty decisions circle around her, Emilia will doubt both her skills as a detective and ability to survive amid the sharks. She'll start making deals for access and information, but the one she makes with the devil could be her last.HAT DANCE is the second book in the Emilia Cruz mystery series. It follows CLIFF DIVER, the novel that Kirkus Reviews called \"Consistently exciting . . . A clever Mexican detective tale that will leave readers eager for the series' next installment.\" The Emilia Cruz mystery series is as raw and action-filled as the headlines coming out of Mexico today, but just like the country, Emilia is both resilient and warm-hearted. With hot nights on the beach and suspense straight out of the news, the series goes inside Mexico's drug war with a fearless style and a woman who will be hard to forget.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Mystery Thriller",
    "International",
    "Crime"
  ],
  "author": "Carmen Amato",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/21015877-hat-dance"
}