{
  "title": "Chances",
  "description": "Adelida Broussau took a big chance by saying she was Rueben Hamilton's new bride. But even a rat will stand up and fight when it's cornered and she was surely feeling the pinch of being pushed in the corner. Her sister, Maria, was dead. Her sorry, Yankee loving brother-in-law, Victor, had issued her an ultimatum to be out of New Orleans by night, or else; then stole the rest of her money so she couldn't leave. Then there was Rueben, hit on the head for attempting to thwart a bank robbery, his memory gone and leavingtown that very day. All she had to do was say she was truly his wife. Everyone in the chaos after the robbery already thought they were newlyweds. So she took a big chance andlet them go right on believing she was. Rueben Hamilton went to New Orleans from southern Pennsylvania at the request of the President of the United States to help with the reconstruction of Louisiana after the Civil War. He'd gone into the bank to finish his business before boarding The Queen for the first leg of his journey home. He didn't remember the bank robbery. All he remembered was awakingwith a headache, no memory, and a wife fresh from the Acadian bayou country. None of it made a bit of sense. It was supposed to take a month for them to reach Love's Valley, an obscure little valley near Shirleysburg, Pennsylvania. That was if everything went according to plan and Rueben's memory didn't return; if he didn't toss Adelida off at the next port of call to fend for herself, or worse,throw her overboard. But fate played her hand and dealt the two of them some unforeseen cards that turned their world upside down. Their hearts didn't care that there'd been a war and it was the worst possible time for a Yankee soldier and a Louisiana bayou woman to fall in love. But listening to the stirrings of hearts bound for love isn't an easy thing to do.",
  "genres": [
    "Romance",
    "Historical",
    "Historical Fiction",
    "Fiction",
    "Clean Romance",
    "Adventure"
  ],
  "author": "Carolyn Brown",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/2103242.Chances"
}