{
  "title": "Parts of Us",
  "description": "The Game Series, #14 • Doll Parts Sequel • MMMM • M/s • DD/lb • Hurt/Comfort • Found Family • Angst • HEAGrab your favorite stuffie and join Cam, Lucian, KC, and Noa as they jump over life’s hurdles together with their kinky friends as support. Brat shenanigans are to be expected, starting with an Easter Egg Hunt—that has a twist—and continue until they’re off on their Caribbean cruise.I could admit, when my boyfriend and I finally got together with our Master and Daddy Dom, I’d thought that this was it. I was going to cruise through the rest of my life high on love.Six months later, I knew that the reality of a happily ever after was much more complex, messy, and beautiful. I learned to see it in the little things. Like in the smiles between Master and Daddy that whispered of their thirty-year-long friendship, in how my boyfriend lit up when he got a new stuffie, and in how we painted the walls of our home with all the raw emotions life brought. I saw it in the way our dynamics evolved, how we truly were four parts of a whole, and how we overcame obstacles.We did have one obstacle we couldn’t postpone any longer. My boyfriend still hadn’t told his mother that he wasn’t dating only me. He was dating her ex-husband, the man who’d been his stepfather. We also had to convince our Master to cut down on work because he was stressing himself out, and his blood pressure was already high.Then one night, I lost my footing when he collapsed and an ambulance drove off with him.We couldn’t be us without him. If one was missing, we were just…parts.____The Game Series is a BDSM series where romance meets the reality of kink. Sometimes we fall for someone we don’t match with, sometimes vanilla business gets in the way of kinky pleasure, and sometimes we have to compromise and push ourselves to overcome trauma and insecurities. No matter what, one thing is certain. This is not a perfect world—and maybe that’s why the happily ever after feels so good.The characters in the Game Series cross over in multiple books, as we follow not only new love interests but the background friendships and dynamics of a thriving kink community. This is the second story that follows KC, Noa, Cam, and Lucian. Parts of Us is best enjoyed if you’ve read Doll Parts first.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Romance",
    "Contemporary",
    "M M M",
    "LGBT",
    "Polyamory"
  ],
  "author": "Cara Dee",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/210177546-parts-of-us"
}