{
  "title": "A Chef's Story",
  "description": "Personal Chef, Robbie B, grew up in a poverty-stricken, working class area of the West Midlands, in the UK. We’re not talking gangs and violence and drugs here, just extreme hardship, suffering and survival ‘against all odds.’ Everyone in the neighbourhood was either a tradesman or an engineer, and Robbie’s creative impulses were not encouraged.With both of his parents dead by the time he was 16, Robbie realised he had a house to maintain and bills to pay. Many people twice his age have been defeated here, and it wasn’t long before Robbie found himself living in the cold and the dark in a house with no power. He learned to fight, to drink and to steal, and it seemed his life was set on a downward spiral. He was angry, terrified, and alone, but he was becoming hard, strong and resilient, yet it was his resilience that took over, surviving sometimes on impulse alone.Robbie travelled to the South Coast of England in search of employment and found it in the form of kitchen work in hotels, learning the finer arts of the classically-trained chef. These times were interspersed with spells of homelessness, living on the beach, but Robbie was gradually turning his life around, finding his passion in the chaotic environment of the kitchen.He travelled to California and later on to New York, where he arrived with just $10 in his pocket. He discovered the food scene in America to be a complete disaster, lacking the refinement of European cuisine, and set out to prove what he could to.He met his wife in New York, and cooked at the Caxton Club for almost ten years, although life still wasn’t easy. Surviving a horrific knife attack, Robbie and his wife decided it was time to leave the city and move up-state, where he opened his own gourmet shop and catering business.Robbie cooked for Michael Crichton for ten years, and has cooked for such names as Chevy Chase, Keith Richards, Paul McCartney, to name but a few, and the book details many anecdotes from these days, along with discussing the role of the personal chef in the homes of the rich and famous. The profession of chef is certainly a tough one, and Robbie tells his story with honesty and stoicism.Written with vitality and a conspicuous absence of self-pity, ‘A Chef’s Story’ is imbued on every page with Robbie’s distinctive wry humour and endurance. He discusses what makes for a real plate, a real dish and his own favourite foods, both to cook and to eat. He feels that what is missing in American kitchens is culture.Robbie rarely, if ever, cooks from recipes, believing he can always improve the dish by taking away or adding. “That’s the real chef! That’s the skill. That’s the difference between a Picasso and a house-painter. That’s the difference. And I would urge anyone reading these words that may be planning a dinner party for the weekend to give this a go. You’ll have a basic idea of what you want to serve up, so stand in your kitchen and go inside your head for a few minutes. Listen to that tiny voice that says try this or try that, and you may be very pleasantly surprised.”The book finishes with Robbie describing his home and his family and the life he’s built for them against all odds.",
  "genres": [],
  "author": "Karl Wiggins",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/21032439-a-chef-s-story"
}