{
  "title": "Roadkill",
  "description": "Dave Lewis' eight book is a new collection of contemporary poetry.  \"Dave Lewis' new work opens with Henry Thoreau's famous quote, 'The mass of men lead lives of quiet desperation'. Very apt in our Twitter-twatter, X-Box-Factor age when apathy, indifference and resignation is the norm and the - increasingly - lost generation slumber party away their lives wearing Onesies. This book of verse is polemical, confessional, a slap in the face wake-up call and a much needed challenge to all 'those up there' who should have, and could have made it better. Sadly, therefore, not likely to be very popular with the Arts Council aficionados but speaking and reaching out to all those that really count. 'The Voice', is for real here and poetry is back where it belongs, right there at the heart of the matter\". - John Evans  \"Alive, daring, challenging and thoroughly modern. A primal scream of passionate despair, a rant at injustice and a socially aware commentary on our lives today. Once again we experience Lewis' keen eye for the world around us. Emotion pours out of every line. Intense, confessional, observational, tender. A writer who is not afraid, this is a great book of poetry in a world of shallow pretenders.\" - Mark Davies  \"‘A remarkable collection from Dave Lewis's heart and soul. From the stark 'Roadkill' to 'Run Towards the Fire' his honesty doesn't flinch. Achingly good.\" - Sally Spedding  \"At times witty, at times gritty, Dave Lewis has produced a fascinating collection on human connection. The humour is dark, the love is bright, the poetry is touching, taunting, spewing, galling, tender. Modern life is out there and engulfing but the passion for truth still lives. Roadkill overflows with personality, it's a roller-coaster ride, and to use the words of the poet 'I’m smiling like Tenby'.\" - Eloise Williams",
  "genres": [],
  "author": "Dave  Lewis",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/21036291-roadkill"
}