{
  "title": "Denkwürdigkeiten eines Nervenkranken",
  "description": "Daniel Paul Schreber began Memoirs of my Nervous Illness in February 1900 while confined in an asylum, as part of an appeal for release. Schreber, second son (the first committed suicide) of an abusive father, was at the peak of a brilliant career in Leipzig when he was appointed Presiding Judge of the Saxon High Court of Appeals. Alas, the stress of his new job proved too much for him, and before long he was hearing voices and feeling suicidal. Within weeks he was committed, having rapidly descended into madness, and was placed under the care of Dr. Paul Emil Flechsig. From the start, Schreber struggled to make sense of what he was seeing and hearing, and in fact Memoirs is so lucid and self-aware, so internally consistent and insightful, that he was released on its strength. Still, reading this man's prose is a lesson in subjective reality, by turns funny and terrifying.I existed frequently without a stomach.... In the case of any other human being this would have resulted in natural pus formation with an inevitably fatal outcome; but the food pulp could not damage my body because all impure matter in it was soaked up again by the rays.As Christianity alone could not explain what seemed to be happening to him, Schreber pieced together a complex theology involving a divided God with dark and light incarnations, whose \"rays\" and \"nerves\" interacted in various ways with humans. God was also his personal tormentor, in league with Flechsig to commit \"soul-murder\" by manipulating his nerves. Further, Schreber believed that he was being literally \"unmanned\" so that God could sexually violate him and conceive a new human race: \"But as soon as I am alone with God ... I must continually or at least at certain times strive to give divine rays the impression of a woman in the height of sexual delight...\"Schreber had a hard time believing in the \"fleeting-improvised-men\" who flitted in and out of his life, and grew convinced that he was the only human left in a world of shadows. But he did know that something was wrong. He would hear the birds in the asylum's garden ask him, over and over, \"Are you not ashamed?\" And he was aware that his bellowing, banging on the piano, and other bodily manifestations of God's manipulation of his nerves (or \"miracles\") were startling to others, to say the least. Many of Schreber's delusions had to do with escaping his body—the constant babble of thousands of voices in his head were infuriating, as was his inability to cease thinking: The sound which reaches my own ear—hundreds of times every day—is so definite that it cannot be a hallucination. The genuine \"cries of help\" are always instantly followed by the phrase which has been learnt by rote: \"If only the cursed cries of help would stop.\"Memoirs of My Nervous Illness succeeds on many levels: as a memoir, as imaginative literature, and as a serious work of mythology. Flechsig makes a menacing and inscrutable villain, representing materialistic thinking and conventional reality—no help at all. Schreber, meanwhile, is the classic hero, struggling to stay sane in a cruel and capricious universe.—Therese Littleton",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Mental Health",
    "Mental Illness",
    "German Literature"
  ],
  "author": "Daniel Paul Schreber",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/11214179-denkw-rdigkeiten-eines-nervenkranken"
}