{
  "title": "The Devil at His Elbow: Alex Murdaugh and the Fall of a Southern Dynasty",
  "description": "Power, privilege, and blood—this is the definitive and thrilling true story of Alex Murdaugh’s violent downfall, from a veteran Wall Street Journal reporter who has become an authority on the case. Alex Murdaugh was a benevolent dictator—the president of the South Carolina trial lawyers’ association, a political boss, a part-time prosecutor, and a partner in his family’s law firm. He was always ready with a favor, a drink, and an invitation to Moselle, his family’s 1,700-acre hunting estate. The Murdaugh name ignited respect—and fear—for a hundred miles.When he murdered his wife, Maggie, and son Paul at Moselle on a dark summer night, the fragile façade of Alex’s world could no longer hold. His forefathers had covered up a midnight suicide at a remote railroad crossing, a bootlegging ring run from a courthouse, and the attempted murder of a pregnant lover. Alex, too, almost walked away from his unspeakable crimes with his reputation intact, but his downfall was secured by a twist of fate, some stray mistakes, and a fateful decision by an old friend who’d finally seen enough.Why would a man who had everything kill his wife and grown son? To unwind the roots of Alex’s ruin, award-winning journalist Valerie Bauerlein reported not just from the courthouse every day but also along the backroads and through the tidal marshes of South Carolina’s Lowcountry. When the jurors made their pilgrimage to the crime scene, trying to envision Maggie and Paul’s last moments, she walked right behind them, sensing the ghosts that haunt the Murdaughs’ now-shattered legacy.Through masterful research and cinematic writing, The Devil at His Elbow is a transporting journey through Alex’s life, the night of the murders, and the investigation that culminated in a trial that held tens of millions spellbound. With her stunning insights and fearless instinct for the truth, Bauerlein uncovers layers of the Murdaugh murder case that have not been told.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Audiobook",
    "Crime",
    "History",
    "Biography",
    "Adult"
  ],
  "author": "Valerie Bauerlein",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/210454076-the-devil-at-his-elbow"
}