{
  "title": "De Moray: An epic companion poem in Scots and English on the life and times of Sir Andrew de Moray, hero of the Wars of Scottish Independence.",
  "description": "What battle would on 11th September 1297 that marked as freedom from oppression, right in the middle of Scotland, would also reflect, by heraldic signs, through a world-changing event in Judea exactly 1300 years before to the day. signified by celestial events. ? Join Paraig MacNeil in 2,000 in lines of epic rhyme, set out not only in old Scots but with a rhyming rendering in English, through eyes of the traditional-tale-teller, as he follows the campaign of Sir Andrew de Moray during the 1st War of Scottish Independence. Opening out with Clan Moray (now spelled Murray) heraldry and enigmas from the heavens and the deep, Celtic philosophy, pride in ancestry, laced with its heart for attachment, and soul for honour, the question of cultural and national identity expressed through the oral tradition in the light of the human family as whole is also explored. We then enter the clan’s history, the rise of the wars of independence, following this great patriot through his Northern Rising, capture, escape, 2nd rising in the north, recapturing of his ancient family strongholds, and more. The final 200 lines of this 2,000 line epic, is devoted to the ingenious Battle Stirling Bridge, and the elegy. Here with his co-commander, Sir William Wallace they together win their greatest victory that would ultimately cost Moray not only his life but proper recognition. This poem exemplifies not only the strategic genius of Sir Andrew De Moray, as master of maneuver, but the mercy and compassion to foes exhibited by the Scots warrior throughout the ages, making them as a people yet a shining light to humanity. Therefore as per Blin’ Harry’s medieval epic The Wallace, which was the inspiration for the blockbuster movie Braveheart, so might De Moray also serve to highlight the life and times yet another selfless hero. “... This a major achievement, a great read and the fascinating tale of a true Scottish hero.” Scottish Field magazine July issue, 2014, page 221. \"… an excellent way to start our series of poems on Hopes for Scotland, since de Moray is praised for the virtues of “compassion and couthy welcome” as the bard sets out the standards of the Scots, what distinguishes them among the “blood brothers of mankind…” Scots Language Centre Poem of the Month March, 2014",
  "genres": [],
  "author": "Paraig MacNeil",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/21048626-de-moray"
}