{
  "title": "Nika: Escape of The GRU Assassin",
  "description": "Nika is a 12-year old girl, a genetically engineered human child and heavily trained GRU killer working for the Russian strategic military intelligence. She is one of several children created by a secret military research project begun under the Soviet Union.Nika lives in the underground complex on the territory of a secret military base near Moscow. Agents like her are very valuable. The military created the best conditions for them for training and living.Nevertheless, discontent is growing. Dissatisfied with doing a dirty job for the Russian government, the girl decides to accept a CIA agent's offer and escapes from the project through the territory of Ukraine.She is strong, has many special skills, has an exceptional memory, encyclopedic knowledge, and a sharp mind.Nika can kill with one touch because she knows human anatomy and lethal points well but she avoids using brute force when it is not necessary.The girl looks no different from most of children and that's her advantage.She is cheerful, easily finds a common language with any person, understands people and psychology.Nika is the character of sci-fi action books published in 2004 and 2005.The books about Nika were popular in Ukraine and Russia.The closest analogy are the characters of such movies as The Bourne Identity (2002), La femme Nikita (1997), Hanna (2011).The book has a hidden anti-war subtext. Nika explains, using her example, to children and adults why she is fleeing the world of cruelty and military rule.The secret project gave her life, but took away her childhood. And although Nika is different from other children at the genetic level, deep down at heart she is an ordinary child. She would not wish her cruel fate on any of the other children.Particular attention is paid to the problem of bullying, which most teenagers in different countries face. Nika runs into it while performing an assignment at a regular school. A teenage gang is causing her real problems, despite all her amazing abilities.The story of friendship and first love with an ordinary boy Misha becomes the main reason for the escape.The cover is AI-assisted using Leonardo AI and Adobe Photoshop in accordance with the author's vision of his character.",
  "genres": [],
  "author": "Viktor  Seleznev",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/210329271-nika"
}