{
  "title": "Citizen: My Life After the White House",
  "description": "A powerful, candid, and richly detailed memoir from an American icon, revealing what life looks like after presidency: triumphs, tribulations, and all.On January 20th, 2001, after nearly thirty years in politics—eight of them as President of the United States—Bill Clinton was suddenly a private citizen. Only fifty-four years old, full of energy and ideas, he wanted to make meaningful use of his skills, his relationships with world leaders, and all he’d learned in a lifetime of politics, but how? Just days after leaving the White House, the call came to aid victims of a devastating earthquake in India, and Clinton hit the ground running. Over the next two decades, he would create an enduring legacy of public service and advocacy work, from Indonesia to Louisiana, Northern Ireland to South Africa, and in the process reimagine philanthropy and redefine the impact a former president could have on the world.Citizen is Clinton’s front-row, first-person chronicle of his post-presidential years and the most significant events of the twenty-first century, including 9/11 and the runup to the Iraq War, the Haiti earthquake, the Great Recession, COVID-19, the January 6th insurrection, and the enduring culture wars of our times. Yet Citizen is more than a presidential memoir. These pages capture Clinton in a rare and unforgettable light: not only as celebrated former president and foundation leader, but also as a father, grandfather, and husband. He shares his support for Hillary Clinton during her tenure as senator, secretary of state, and presidential candidate, and openly details the frustration and pain of the 2016 election.With clarity and compassion, President Clinton also weighs in on the unprecedented challenges brought on by a global pandemic, ongoing inequality, a steadily warming planet, and authoritarian forces dedicated to weakening democracy. In this landmark publication, the highly anticipated follow-up to the best-selling My Life, Clinton pens a clear-sighted account of American democracy on a global stage, offering a frank reflection on the past and, with it, a fearless embrace of our future. Citizen is a testament to one man’s unwavering commitment to family and nation, a self-portrait of equal parts eloquence, insight, and candor.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Memoir",
    "Biography",
    "History",
    "Presidents",
    "Autobiography"
  ],
  "author": "Bill Clinton",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/210410458-citizen"
}