{
  "title": "Big Cherry Holler",
  "description": "BIG CHERRY HOLLER, the extraordinary sequel to BIG STONE GAP, takes us back to the mountain life that enchanted us in Adriana Trigiani’s best selling debut novel. It’s been eight years since the town pharmacist and long time spinster Ave Maria Mulligan married coal miner Jack MacChesney. With her new found belief in love and its possibilities, Ave Maria makes a life for herself and her growing family, hoping that her fearless leap into commitment will make happiness stay. What she didn’t count on was that fate, life, and the ghosts of the past would come to haunt her and, eventually, test the love she has for her husband. The mountain walls that have protected her all of her life can not spare Ave Maria the life lessons she must learn.BIG CHERRY HOLLER is the story of a marriage, revealing the deep secrets, the power struggle, the betrayal and the unmet expectations that exist between husband and wife. It is the story of a community that must reinvent itself as it comes to grips with the decline of the coal mining industry. It is the story of an extended family, the people of Big Stone Gap, who are there for one another especially when times are tough—including bookmobile librarian and sexpert Iva Lou Wade Makin, savvy businesswoman Pearl Grimes, crusty cashier Fleeta Mullins, and Rescue Squad captain Spec Broadwater, who faces the complications of his double life. Ave Maria’s best friend Theodore Tipton, now band director at the University of Tennessee, continues to be her chief counselor and conscience as he reaches the pinnacle of marching band success.When Ave Maria takes her daughter to Italy for the summer, she meets a handsome stranger who offers her a life beyond the Blue Ridge Mountains. Ave Maria is forced to confront what is truly important: to her, to her marriage, and to her family. Brimming with humor, wisdom, honesty, and the drama and local color of mountain life from Virginia to Italy, BIG CHERRY HOLLER is a deeply felt, brilliantly evoked story of two lovers who have lost their way and their struggle to find one another again.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Romance",
    "Audiobook",
    "Adult Fiction",
    "Adult",
    "Southern"
  ],
  "author": "Adriana Trigiani",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/2103524.Big_Cherry_Holler"
}