{
  "title": "On Wings of Blood",
  "description": "What do you get if you mix Harry Potter with Fourth Wing, Zodiac Academy, a dash of Arthurian legend, and lots and lots of vampires? Bloodwing Academy.  I didn't sign up for this.A half-fae in a school of highblood vampires? That's a recipe for torment.I'm Medra Pendragon—last of the dragon riders, or so they tell me. Funny thing is, there are no dragons left. Not a single one. But somehow, that hasn't stopped the vampires from deciding I'm worth capturing. Now I'm stuck at Bloodwing Academy, where the highbloods run everything and blightborn like me? We're just blood in their veins, pawns in their games.But that's not even the worst part. Enter Blake Drakharrow. Cold, arrogant, and way too gorgeous for his own good. He's been tormenting me since the moment we met, and now, thanks to some ancient ritual, we're betrothed. He acts like he owns me, but I'm not going down without a fight.Bloodwing isn't just a school—it's a battlefield. Highbloods fight for power, and if you're weak? You're dead.Between deadly competitions, lies that could get me executed, and a dragon-shaped secret looming over my head, all I have to do is survive. Easy, right? Except I'm starting to think the real danger isn't the academy—it's what I'm becoming in this twisted game of power.And Blake? He might just be the one who pushes me over the edge.They think they can control me. They think they can use me.But they have no idea what they've awakened.  Bestselling epic fantasy author Briar Boleyn returns with a new series perfect for fans of hate to love romance, heart-pounding action, and dark magic.  On Wings of Blood is a dark academia fantasy romance featuring a bully villain with Draco Malfoy energy who (eventually) gets the girl, all the tension and banter, and a tantalizingly dangerous blend of court and school intrigue all set in an intricately crafted world with unique vampire and dragon lore. Bloodwing Academy may have crossover characters from the world of Blood of a Fae, but can be read completely independently. If you're a fan of original mythology, unique world-building, and character-driven romantasy books such as Crowns of Nyaxia, From Blood and Ash, and A Court of Thorns and Roses, you won't want to miss out on this riveting new saga.",
  "genres": [
    "Fantasy",
    "Romantasy",
    "Vampires",
    "Dragons",
    "Fantasy Romance",
    "Romance",
    "Enemies To Lovers"
  ],
  "author": "Briar Boleyn",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/210428052-on-wings-of-blood"
}