{
  "title": "Here With Me",
  "description": "He’s helping her stay. She’s making sure he can leave. This second chance at love in a small town will tug at your heart and make you believe in love all over again.\"Sadie and David’s journey to salvage love and a family legacy will steal your breath and reaffirm your belief in second chances. A must-read for anyone who cherishes a heart-pounding romance as much as a heartwarming happy-ever-after.\" USA Today best-selling author Susan May WarrenLove ignites in a last-chance hardware store, but will their hearts, like the failing family business, require a rescue?She just wants a fresh start…Inheriting her best friend’s daughter and a store on the brink of collapse, Sadie Hoover is determined to provide Lottie a stable life and keep the family business afloat. But her resolve is tested when the past walks in, wearing a tool belt and a smile that still weakens her knees.Is he back to break her heart? David Williams, once the love of Sadie’s life, returns to Heritage not as the missionary he was, but as a man in search of healing and purpose. Tasked with community service, he’s thrown into the daily grind of nuts and bolts, unaware that the hardware store’s troubles—and Sadie’s struggles—are more than just loose hinges and unpaid bills.What will it cost her to fall for him again? As they grapple with financial peril and the echoes of a love once lost, David and Sadie are forced to confront what they truly want. The store’s impending foreclosure looms over them, a testament to their joint past and the future they must shape.If the store fails, they lose not just a legacy, but the second chance life has offered them. Can they rekindle their love while saving the heart of Heritage, or will their dreams rust away like forgotten tools?Can love be rebuilt from the ruins of their shared history, or will the fight for survival drive the final wedge between them?HOME TO HERITAGEYou’re the ReasonHere With MeChristmas With YouRESTORING HERITAGEP.S. Goodbye (prequel novella)You Belong With MeUntil I Met YouWhile It Was Snowing (novella)Since You’ve Been GoneUpon a Midnight Snow (Christmas novella)",
  "genres": [
    "Contemporary",
    "Romance",
    "Christian Fiction",
    "Fiction",
    "Christian",
    "Christian Romance",
    "Inspirational"
  ],
  "author": "Mandy Boerma",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/210653798-here-with-me"
}