{
  "title": "A Memory of Fictions (or) Just Tiddy-Boom",
  "description": "“Gaiter’s lively prose presses against the confines of every sentence… A distinctive, fragmentary story of an artist’s painful coming of age.” – Kirkus ReviewsA PW Booklife “Editor’s Pick” – “Gaiter defies conventional prose to offer a lyrical narrative that is both tender in recollection and brutal in anger… The novel’s challenges and charged insights will reward those fascinated by the pain and work of self-invention.”“…a bold novel. Sometimes beautiful, sometimes brutal, the prose is always thoroughly engrossing.” - IndieReader5 stars \"From the ribald humor to the raw honesty and tender moments, the novel offers a multifaceted exploration of identity, family, and societal pressures with elegant use of dialogue and intimate narrative moments of true vulnerability and pain.- K.C. Finn, Reader’s Favorite\"If Ernest Hemingway was black, gay, and writing about growing up in the [1960s], he would have written something like Leonce Gaiter's \"A Memory of Fictions (or) Just Tiddy-Boom.\"- Jessica Dickenson, Reader Views\"Loved it! I loved the author’s writing style, character development and overall message of learning to live in your truth.”- Marquita Douglas, ReedsyA Memory of Fictions (or) Just Tiddy-Boom is a modern, jazzy bildungsroman that uses everything from personal memoir, a fugue-like structure, poetry, images, lyrics, and diaries to paint a vivid, eloquent and human portrait of gay, black, Jessie Vincent Grandier and the striving African American middle class that spawned him in the late 1950s.Born to a high-yellow, upper-crust New Orleans Creole mother and a lowborn, Louisiana bayou-bred, military father, Jessie steadfastly battles to reconcile his existence with expectations and preconceptions of those around him -- black and white. He shoulders the weight of his black bourgeois family’s hopes through the ‘60s and ‘70s, his mother’s death, and the resulting familial melodrama that tears him and his family apart. If not broken, then seemingly irreparably bent, he wends his way through Harvard in the ‘70s and drinks his way through the Reagan ‘80s in gay bars from the LA barrio to Beverly Hills. When Jessie’s grandiose ambitions have abandoned him when he’s almost beaten, and when it’s a breath away from too late, he looks back, regards the jagged shards of his life and pieces them into a remarkable whole.The post-modern writing careens from pure ribaldry, to brutal honesty, to deeply tender, to “gonzoesque,” but at the intelligent heart of the novel is the internal struggle of dislocation, and the deconstruction of an African-American family. It is a completely unique look at race, sex, and finding redemption the hard way.",
  "genres": [],
  "author": "Leonce Gaiter",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/210491491-a-memory-of-fictions-or-just-tiddy-boom"
}