{
  "title": "No Tears for My Father: A true story of incest",
  "description": "Trapped in a web of deceit and confusion spun by her father from the age of 11, the author shares her true story of incest in the hopes that by coming out from under years of sexual abuse, other victims will be encouraged to do the same. This is an important, no-holds-barred book complete with graphic scenes and language because \"that’s the way it happened and that’s how it must be told. Victims’ own voices are the best weapons against child sexual abuse.\" This 291-page story comes with a \"trigger warning advisory\" as it details the mental, physical, and sexual abuse inflicted on the author by her biological father. Victims of similar abuse need to realize this story could cause flashbacks of their own as they identify with scenes and language that mirror their own experiences. Those who have never suffered sexual abuse may be shocked by what the author's father put her through and the utter control he had of all areas of her life until she finally got away.  This book will frighten and enlighten readers as they learn what goes on behind the closed doors of too many homes and is rarely talked about or acknowledged, or, worse yet, is even denied by family members who know it is going on.  WHO SHOULD READ THIS BOOK?  1) Those who truly care about children’s welfare and want to know the truth about what can and does go on in thousands of families worldwide. These readers want to understand how incest affects children as they grow into adulthood and what the long-lasting effects of incest can be like. 2) Those who are in denial and refuse to believe this kind of child sexual abuse actually occurs at the hands of fathers, mothers, sisters, brothers, aunts, uncles, and other close family relatives  WHO SHOULDN’T READ THIS BOOK?  1) Those who think incest is an acceptable and enjoyable activity between family members 2) Those who think this is another Fifty Shades of Gray and are looking for sexual stimulation via books 3) Those who are still very raw in their own healing and recovery from incest and could be easily triggered by graphic scenes and language 4) Those victims looking for a book on healing or how to recover from childhood sexual abuse. This is a story only. Those seeking help in healing should consult a therapist, join a self-help group, or purchase one of the many excellent books available for healing purposes, such as The Courage to Heal.  No Tears for My Father contains actual photos from the family archives and is enhanced with poems by the author set against beautiful colour graphics. Reviewers have called this book \"honestly unforgettable,\" and more than one reader has said, \"I couldn't put the book down!\" Read No Tears for My Father and find out why one reviewer said, \"Viga makes me believe survival is possible for any injustice that we experience in our life. What a great read!\"",
  "genres": [
    "Nonfiction",
    "Abuse",
    "Biography",
    "True Crime",
    "Autobiography",
    "Memoir"
  ],
  "author": "Viga Boland",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/21062507-no-tears-for-my-father"
}