{
  "title": "Old Filth",
  "description": "Sir Edward Feathers has had a brilliant career, from his early days as a lawyer in Southeast Asia, where he earned the nickname Old Filth (FILTH being an acronym for Failed In London Try Hong Kong) to his final working days as a respected judge at the English bar. Yet through it all he has carried with him the wounds of a difficult and emotionally hollow childhood. Now an eighty-year-old widower living in comfortable seclusion in Dorset, Feathers is finally free from the regimen of work and the sentimental scaffolding that has sustained him throughout his life. He slips back into the past with ever mounting frequency and intensity, and on the tide of these vivid, lyrical musings, Feathers approaches a reckoning with his own history. Not all the old filth, it seems, can be cleaned away.Borrowing from biography and history, Jane Gardam has written a literary masterpiece reminiscent of Rudyard Kipling's Baa Baa, Black Sheep that retraces much of the twentieth century's torrid and momentous history. Feathers' childhood in Malaya during the British Empire's heyday, his schooling in pre-war England, his professional success in Southeast Asia and his return to England toward the end of the millennium, are vantage points from which the reader can observe the march forward of an eventful era and the steady progress of that man, Sir Edward Feathers, Old Filth himself, who embodies the century's fate. Old Filth was nominated for the 2005 Orange Prize. Jane Gardam lives with her husband and three children in England. She has won Katherine Mansfield Award, the PEN Macmillan Silver Pen Award, the Whitbread Novel Award (twice), and has been shortlisted for the Booker Prize. She was recently awarded the Heywood Hill Literary Prize in recognition of a distinguished literary career.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "British Literature",
    "Literary Fiction",
    "Historical",
    "Novels"
  ],
  "author": "Jane Gardam",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/21071433-old-filth"
}