{
  "title": "Dog Days In The Fortunate Islands: A new life in hidden Tenerife",
  "description": "On the brink of retirement, John and his wife Sally are determined to end a life at the grindstone in grimy and wet Lancashire. Together with their beloved Jack Russell/Staffie cross, Freddie, a rescue dog from the local RSPCA, they embark on the journey of a lifetime and relocate to the island of Tenerife. Selling up, they make the move to the north of Tenerife, a part almost unknown to the casual tourist – their very own hidden paradise, a world away from the 'tourist trap' that is the south of the island. Relaxed and surrounded by stunning coastal views, life in their new home, set amidst orange groves and banana plantations, is very different indeed! The weather is fantastic, the temperature idyllic, the people so friendly and the cost of living outrageously low… what more could they ask for? Adjusting to life abroad, and all of the costs that come with it, are explained in the book – from buying a new home and sorting out living taxes, to integrating into the local community and taking the dreaded Spanish driving test. Follow John and Sally as they learn a new language and take on a couple of new hobbies, while Freddie takes off on some unbelievable (but true!) exploits with his new canine friends. With a colourful collection of characters, travelling anecdotes that stretch from the English Midlands and all the way through mainland Spain in an old classic car, and some not so perfect moments that bring us back down to earth from time to time, this is a series of adventures that you will not want to miss. Dog Days In The Fortunate Islands is an ideal read for those contemplating retirement, moving to the Canary Islands or an extended trip through Spain. The book will also appeal to any dog lovers and holidaymakers who enjoy an interesting story.",
  "genres": [
    "Memoir",
    "Spain",
    "Animals",
    "Nonfiction"
  ],
  "author": "John Searancke",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/21068117-dog-days-in-the-fortunate-islands"
}