{
  "title": "A Life That Matters: The Legacy of Terri Schiavo -- A Lesson for Us All",
  "description": "In 2004-2005, when the Terri Schiavo case divided the country, one side of the story was buried under the avalanche of politics and power. Now, Terri Schiavo's parents, brother, and sister speak out, for Terri and themselves. A Life That Matters may well change every assumption you have about Terri's too-brief life and prolonged, agonizing death.Here the people who loved her and knew her best tell the story not only of the 15 years Terri struggled to stay alive, but of a gentle child who brought happiness to everyone she touched. This is the story of a normal adolescent who blossomed into the beautiful young woman who captured Michael Schiavo's heart. And it is the inside story of their troubled relationship, for the members of Terri's family were witnesses to a growing tension, and were her confidants as she struggled in her marriage with the husband who would later crusade for her premature and unnecessary death.A book that stakes clear moral ground without a political aim, A Life That Matters takes us inside Terri's family when the courts ordered her feeding tube removed, and it leads inexorably to a scene that will haunt readers forever: a bereft family barred by the police from their daughter's hospice room in the final moments of her life.A Life That Matters separates lies from truth, myth from facts, and politics from people. It challenges us to hear the words and feel the emotions of the warm, intensely private family who never sought the media storm that accosted them, or the devastating legal battle that broke their hearts. The book asks us what we would do if we found ourselves, as the Schindlers did, wanting nothing more than to love and care for a daughter as long as she could live.",
  "genres": [
    "Biography",
    "Nonfiction",
    "True Crime"
  ],
  "author": "Mary Schindler",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/11216794-a-life-that-matters"
}