{
  "title": "Pressing Matters",
  "description": "Press for Change (founded in 1992) was a hugely successful campaign for the civil rights of transgender people in the UK -- achieving in the first 12 years a string of legislative successes that included protection against discrimination in employment, the right to NHS treatment and ultimately the process for full legal recognition of transsexual people in their acquired gender in 2004. The organisation continues to this day.  These are the memoirs of Christine Burns MBE, one of the leading figures in that campaign until 2007. Christine tells the story of how she personally became involved in campaigning and how that involvement entwined in her home, work and political life.  This is no conventional trans biography, nor is it a conventional political history. Christine tells the story of a remarkably successful campaign from her personal perspective, at the centre of much of the action. Her perspectives provide valuable insights into how such a successful campaign planned its strategy and grew, working all the while on a minuscule budget.  The historical perspective is backed up with extensive contemporaneous material (including her personal correspondence) written to document events as they happened. And the personal perspective is full of revealing insights into Christine's inner life, her loves, her setbacks and concerns.  Nobody has ever before published an account of this amazing period in the development of civil rights for trans people. And few transsexual people have written in this detail about their lives and career development on the \"other side\" of the transition from one gender to the other.  This first volume covers the background to why trans people sought civil rights in the UK and Christine's personal recollections from childhood until 1997 when the major elements of the campaign were in place. The second volume will cover the period from 1998 onwards -- successes and failures -- leading to the passage of the Gender Recognition Act in 2004 and afterwards.",
  "genres": [],
  "author": "Christine Burns",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/21077209-pressing-matters"
}