{
  "title": "Of Thee I Zing: America's Cultural Decline from Muffin Tops to Body Shots",
  "description": "While Laura Ingraham was walking through a Northern Virginia shopping mall one Saturday afternoon, it all became clear to her. Everywhere she turned, she saw signs of the impending disaster: zombie teens texting each other across a café table; a man having his eyebrows threaded at a kiosk; a fiftyish woman shoe-horned into a tube top and skinny jeans; and a storefront ad featuring a Victoria’s Secret model spilling out of her push-up bra and into the faces of young passersby. Ingraham wondered to herself, “Is this it? Is this what our forefathers fought for? What my parents struggled for? I wonder if Victoria’s Secret is still having that two-for-one sale?” A menacing force surrounds us. We see it, we feel it, we know it. The country we love is in grave peril. While politicians and “experts” prattle on about the debt crisis at home, and terrorism abroad, a more insidious homegrown threat is emerging. It endangers our future and undermines our present. The uncomfortable truth is: We have become our own worst enemy. The culture we have created is now turning on us. We’re on the verge of drowning in our ignorance, arrogance, gluttony . . . can you believe there are only three shots of vanilla in a Caramel Macchiato?!? Now in an act of patriotic intervention the most-listened-to woman in talk radio casts her satirical eye upon all that ails American society. In this sharp-witted, comic romp, Laura Ingraham takes you on a guided tour through ten levels of our cultural hell. You know we’re in trouble when . . . • Airplane seats shrink—just as the passengers expand. • Celebrity baby names go from the peculiar (Apple, Stetson, and Daisy Boo) to the pathetic (Bamboo, Blanket, and Bronx). • People meticulously tend their virtual crops on Farmville, while their children eat takeout. • “Breaking News” usually means it happened yesterday. • The weddings last longer than the marriages. • Facebook has become a verb and reading has become an ancient art form. Of Thee I Zing is cultural commentary too funny to ignore, igniting a national conversation long past due. America, your cultural recovery begins here.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Humor",
    "Cultural",
    "Essays",
    "Audiobook",
    "American"
  ],
  "author": "Laura Ingraham",
  "average_rating": "3.11",
  "url": "https://www.goodreads.com/book/show/11215993-of-thee-i-zing"
}