{
  "title": "Heart in Pieces: The Men of Shadow Surveillance",
  "description": "5-star READERS' FAVORITE!\"Curiosity is a dangerous game, Mr. Reed. Especially when one doesn’t know the rules—or all the players.”In the small town of Eagle Lake, retired FBI profiler Jake Reed seeks refuge from a near-fatal encounter with a sadistic serial killer. But tranquility is short-lived when The Wolf, a twisted nemesis, resurfaces with a new set of victims and cryptic clues. Enter the beautiful and resilient Alexis Forrester, who becomes entangled in Jake's dangerous game of cat-and-mouse. As they delve deeper into The Wolf's depravity, both Jake and Alexis are forced to confront their own personal demons and past traumas. But as the body count rises and secrets are unearthed, they must also confront a shocking The Wolf may be closer to them than they realize. Can their fragile alliance withstand the darkness that surrounds them? Will they be able to defeat The Wolf before it's too late? Get ready for a thrilling and adrenaline-fueled ride through the world of BDSM as Jake and Alexis battle against time and treachery.Adult Contains graphic sexual content. Be warned, this story is not for the faint of heart. It delves into dark and twisted themes that may make you uncomfortable.5 Stars - Reviewed by Lex Allen for Readers’ FavoriteThree authoring skills are exceptionally well presented in Heart in Pieces. The first skill is Rivers' expertise in delivering a first-person narrative alternating between the two main characters, the ex-FBI profiler Jake Reed and the submissive Alexis Forrester, throughout the plot. The second is describing BDSM scenes in a way that is neither crude nor pornographic; instead, these scenes are painted as an emotional rollercoaster exhibiting highs and lows within a mixture of fear, pain, sexual stimulation, and release using language that accentuates the beauty of trust between the dominant and submissive in a potentially dangerous exercise. The third skill that Rivers presents is mixing two primary plotlines into one overarching story that is simultaneously intriguing, suspenseful, and full of surprising twists and turns. Montana Rivers delivers a fast-paced, first-rate erotic/detective mystery for mature audiences guaranteed to stimulate the reader's senses while introducing a cult-like attachment nestled in a mysterious and erotic whodunnit thriller.5-star review- Reviewed by K.C. Finn for Readers’ FavoriteAuthor Montana Rivers has crafted an electrifying novel from start to finish that creates a fabulous balance between romantic suspense and thriller drama. The suspenseful narrative is well-paced and suitably detailed, and I loved the way the moments of tense exposition were suddenly filled with twists and turns that take you through new revelations, and back to tension again. The dynamic between Jake and Alexis also follows this rollercoaster pattern, weaving in between the shocks and surprises of the narrative as they navigate their inner struggles while battling their formidable foe. The dialogue style was unique to both of them and characterized them instantly, but the way they spoke to one another also developed well and offered a lot of suspense and new thrills between the lines. The exploration of BDSM elements was an extra layer of intrigue that complemented their tension-fuelled dynamic so well. Overall, Heart in Pieces delivers a heart-pounding thrill ride that readers won't soon forget, and I’d recommend it as a must-read for anyone craving a suspenseful and adrenaline-fueled story.",
  "genres": [],
  "author": "Montana Rivers",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/210840469-heart-in-pieces"
}