{
  "title": "Citizen Hollywood",
  "description": "Hollywood, 1939: When Tinseltown begins to woo wunderkind Orson Welles, he stashes himself at the Chateau Marmont until he’s ready to make his splashy entrance. But gossip columnist Kathryn Massey knows he’s there.  Kathryn has been on the outs with Hollywood since her ill-fated move to Life, but now that she’s back at the Hollywood Reporter, she’s desperate to find the Next Big Thing. Scooping Welles’ secret retreat would put her back on the map, but by the time she hears rumors about his dangerous new movie, she’s fallen prey to his charms. She needs to repair her reputation, find out if Welles will take on the tycoon, and extricate herself from an affair with a man whose kisses make her melt like milk chocolate.  Hollywood writers are only as good as their last screen credit, but Marcus Adler is still scrambling for his first. His \"Strange Cargo\" will star Clark Gable after \"Gone with the Wind\" wraps, but Machiavellian studio politics mean Marcus’ name might not make it to the screen. It’s time to play No More Mr. Nice Guy. Opportunity knocks when his boss challenges the writing department to outdo \"The Adventures of Robin Hood,\" and Marcus is confident—until the love of his life bursts back onto the scene. How can he write another word until he knows for once and for all whether he and Ramon Navarro will be together? And to make matters worse, it seems like someone in town is trying to sabotage him.  Everyone knows if you haven’t made it in Hollywood by the time you’re thirty, it’s curtains . . . and Gwendolyn Brick is starting to panic. She’s considering moving to a naval base in the Philippines with her baby brother, but she wants to give Hollywood one last go before she gives up. When she saves Twentieth Century Fox honcho Daryl F. Zanuck from an appalling fate at a poker game that goes awry, he rewards her with a chance at a role in a major movie. Gwendolyn needs to win before her ship sets sail.  When William Randolph Hearst realizes \"Citizen Kane\" is based on him, he won’t be happy—and when Hearst isn’t happy, nobody’s safe. Marcus, Kathryn, and Gwendolyn need to go for broke, and the clock is ticking.",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Martin Turnbull",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/21089868-citizen-hollywood"
}