{
  "title": "Andariasmeni, the Buildings and her Friends",
  "description": "“I am afraid that the building can react unexpectedly, we don't really know what it is hidden inside it. We mustn't forget that its temperament and its powers are constantly developing from the incidents and the feelings of its environment.” “So, I guess our feelings aren't strong enough...”  “No, they aren't. Our feelings are usually stable. Our nature regarding emotions is simpler...\"  Andariasmeni is a girl who dreams a lot. During her dreams she meets creatures that look a lot like humans and experiences many adventures. She becomes a Queen, saves a sailor and finds herself inside a whale. There, she meets a talking seagull, a captain and two ladies from a past era. However, whenever Andariasmeni wakes up, she faces a tough reality, more bizarre even than her dreams. Andariasmeni lives in a town where everyday people try to climb on living buildings. These buildings are fed by negative feelings, so they torture their climbers. Andariasmeni considers this kind of life miserable and is trying to find out why all this is happening. Still, everyone seems to be avoiding the discussion. Grandmother Efthalia is distant and never explains why Andariasmeni's parents are missing, her teacher is strict, the school Headmasters try to make her adjust to this completely regulated and controlled environment and her friends think differently from her. One day, she decides to go to the buildings and confront them all by herself assuming that no one will help her. Nonetheless, her friends from both reality and imagination will look for her and they will all meet up at the biggest and meanest of the buildings, where an extraordinary battle among humans, creatures and buildings will take place. A battle which is different but still very much vicious, even if it isn’t fought with guns but with strange keys, emotions and sounds.",
  "genres": [],
  "author": "Konstantina Koraki",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/21089817-andariasmeni-the-buildings-and-her-friends"
}