{
  "title": "Star Chamber Brotherhood",
  "description": "“A full-bodied thriller relayed by a consummate storyteller.” KIRKUS REVIEWS “Politically charged entertainment with an engaging protagonist and a tightly machined plot moving smoothly toward resolution.” PACIFIC BOOK REVIEW “An engaging fast-paced thriller. Reader will spend pleasant hours rooting for a team of assassins.” BOOKPLEASURES.COM The second book in the Kamas Trilogy begins five years after the Kamas revolt. A Kamas survivor who returns to Boston is ordered by the prisoners’ covert Star Committee to kill the commandant who crushed the revolt. BOSTON. 2029. Five years after the Kamas revolt. Frank Werner, a Boston businessman arrested for dissident political activity, has survived a brutal government assault on a mutinous corrective labor camp in Kamas, Utah, and a year at hard labor in a remote Yukon tungsten mine. He gains amnesty during a brief political thaw and returns to Boston illegally in search of his only surviving daughter, Marie. No sooner does Werner gain a foothold in Boston as a bootlegger-bartender and move in with a widowed pediatrician than his new life begins to unravel. A former Kamas rebel leader who twice saved his life assigns him a mission by authority of the prisoners’ covert Star Committee. The to execute the warden who quelled the Kamas revolt five years before. Werner, now nearly sixty, accepts the assignment reluctantly and recruits four trusted friends for his team. Each has a dark past and a different reason for joining the conspiracy. But the mission goes awry twice. After the second failed attempt on the former warden, who has been reassigned to Boston, each of the other team members is killed or leaves the field. Left alone, Werner resolves to complete the operation on his own. Before he can follow through, however, his missing daughter suddenly reappears. Now, by attacking, he risks any chance he might have of rejoining her. Star Chamber Brotherhood offers unforgettable characters, rapidly mounting suspense and a richly imagined vision of an America gone terribly wrong. With his distinctive understated prose, Preston Fleming manages to evoke strong emotions and force wrenching choices in a new book that more than fulfills the promise of Forty Days at Kamas.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Mystery",
    "Dystopia",
    "Thriller",
    "Action",
    "Adventure"
  ],
  "author": "Preston Fleming",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/21093276-star-chamber-brotherhood"
}