{
  "title": "The Decline and Fall of the Human Empire: Why Our Species Is on the Edge of Extinction",
  "description": "By the award-winning author of A (Very) Short History of Life: a history of humanity on the brink of decline.We are living through a period that is unique in human history. For the first time in more than ten thousand years, the rate of human population growth is slowing down. In the middle of this century population growth will stop, and the number of people on Earth will start to decline - fast. In this provocative book, award-winning science writer Henry Gee offers a concise, brilliantly-told history of our species--and argues that we are on a rapid, one-way trip to extinction. The Decline and Fall of the Human Empire narrates the dramatic rise of humanity, how a scattered range of small groups across several continents eventually inbred, interacted, fought, established stable communities and food supplies, and began the process of dominating the planet. The human story is relatively brief—the oldest fossils of H. Sapiens date to approximately 300,000 years ago—yet the spread of our species has been unstoppable…until recently. As Gee demonstrates, our population has peaked, and is declining; our environment is becoming inimical to human life in many locations; our core resources of water, arable land, and air are diminishing; and new diseases, simmering conflicts, and ambiguous technologies threaten our collective health. Can we still change our course? Or is our own extinction inevitable? With assured narration, dramatic stories, and his signature sprightly humor, Henry Gee envisions new opportunities for the future of humanity—a future that will reward facing challenges with ingenuity, foresight, and cooperation.",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Anthropology",
    "Evolution"
  ],
  "author": "Henry Gee",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/211003737-the-decline-and-fall-of-the-human-empire"
}