{
  "title": "Perilous Question",
  "description": "Antonia Fraser’s Perilous Question is a dazzling re-creation of the tempestuous two-year period in Britain’s history leading up to the passing of the Great Reform Bill in 1832, a narrative which at times reads like a political thriller.The era, beginning with the accession of William IV, is evoked in the novels of Trollope and Thackeray, and described by the young Charles Dickens as a cub reporter. It is lit with notable characters. The reforming heroes are the Whig aristocrats led by Lord Grey, members of the richest and most landed cabinet in history yet determined to bring liberty, which would whittle away their own power, to the country. The all-too-conservative opposition was headed by the Duke of Wellington, supported by the intransigent Queen Adelaide, with hereditary memories of the French Revolution. Finally, there were revolutionaries, like William Cobbett, the author of Rural Rides, the radical tailor Francis Place, and Thomas Attwood of Birmingham, the charismatic orator. The contest often grew violent. There were urban riots put down by soldiers and agricultural riots led by the mythical Captain Swing.The underlying grievance was the fate of the many disfranchised people. They were ignored by a medieval system of electoral representation that gave, for example, no votes to those who lived in the new industrial cities of Manchester, Leeds, Sheffield, and Birmingham, while allocating two parliamentary representatives to a village long since fallen into the sea and, most notoriously, Old Sarum, a green mound in a field. Lord John Russell, a Whig minister, said long afterwards that it was the only period when he genuinely felt popular revolution threatened the country. The Duke of Wellington declared intractably in November 1830 that “The beginning of reform is the beginning of revolution.” So it seemed that disaster must fall on the British Parliament, or the monarchy, or both.The question Could a rotten system reform itself in time? On June 7, 1832, the date of the extremely reluctant royal assent by William IV to the Great Reform Bill, it did. These events led to a total change in the way Britain was governed, and set the stage for its growth as the world’s most successful industrial power; admired, among other things, for its traditions of good governance—a two-year revolution that Antonia Fraser brings to vivid dramatic life.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "European History",
    "British Literature",
    "19th Century",
    "Audiobook"
  ],
  "author": "Antonia Fraser",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/21090268-perilous-question"
}