{
  "title": "Who Goes There?",
  "description": "A remote scientific research expedition at the North Pole is invaded by a monstrous alien, reawakened after lying frozen for centuries after a crash-landing. The alien is intelligent, cunning and a shape-changer who can assume the form and personality of anything it destroys and soon it is among the men of the expedition, killing and replacing them, using its shape-changing ability to lull the scientists one by one into inattention and destruction. The transformed alien can seemingly pass every effort at detection and the expedition seems doomed...WHO GOES THERE?, according to the science fiction historian Sam Moskowitz (1920-1997), had an autobiographical Campbell's mother and aunt were identical twins and enjoyed the \"game\" of substituting for one another in his care as an infant and young child, confusing him again and again with false identity. It was this uncertainty, this susceptibility to masquerade and his terror at the game which, Moskowitz said, Campbell funneled into this last and greatest of his magazine pieces. (A short novel, THE MOON IS HELL, was published only in book form in the early 1950's.) Carefully and rigorously extrapolated in its portrait of the menaced expedition, the novelette is regarded as perhaps the greatest horror story to emerge form the field of science fiction. It was the basis for one of the great early science fiction films and its excellent remake decades later.Campbell had become the editor of ASTOUNDING five months before the early 1938 publication of the story. As editor of that magazine, he insisted upon rigorous scientific background, humanized characters and values and a standard of writing comparable to that in the leading consumer magazines of the time. In pursuit, Campbell found a generation of new writers - Isaac Asimov, Robert A. Heinlein, L. Sprague de Camp, A.E. Van Vogt, Henry Kuttner, Lester del Rey among them - who collectively (and individually!) produced an extraordinary body of work. WHO GOES THERE? provided the basis of the 1951 cult horror film THE THING FROM ANOTHER WORLD and was remade into John Carpenter's The Thing (1982), also regarded as a classic science fiction film, who's prequel THE THING launched in 2011. The copyright of the novelette was, typically of the time, owned by Street & Smith Publications to whose magazine Campbell had sold all of the rights. Hawks paid Street & Smith $900 for all film rights, $500 of that was paid over \"voluntarily\" by Street & Smith to Campbell. \"Don't you feel cheated?\" Isaac Asimov said he asked Campbell at the time of the film's successful release. \"No,\" Campbell said. \"If it's a good film and it will get more people to read science fiction and take it seriously, then it's all a very good thing.\"",
  "genres": [
    "Horror",
    "Science Fiction",
    "Fiction",
    "Classics",
    "Short Stories",
    "Novella",
    "Audiobook"
  ],
  "author": "John W. Campbell Jr.",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/21092877-who-goes-there"
}