{
  "title": "The Silla Project",
  "description": "The Killing Fields meets The Hunt For Red October.Mitch Weatherby was raised on stories of his father testing nuclear bombs in the Pacific. Glowing mushroom clouds rising into the stratosphere. Sunburns from fifty miles away. Manmade tsunamis. So he majored in physics, earned a Ph.D. and went to work at Los Alamos National Laboratory like his father before him. He knew the days of testing bombs were long gone, but maintaining the nuclear stockpile, the nation’s first line of defense, was an important job for God and Country.Mitch’s life seemed perfect until his wife was killed when his house was raided by the FBI. Accused of trying to build a nuclear bomb in his basement, Mitch is convicted and sentenced to life in prison. But he knows he is innocent and the ‘evidence’ they found at his house must have been planted to cover up their mistake. Mitch is not a hardened criminal and knows what happens to people like him when imprisoned, so when strangers bust him out in a daring raid, he doesn’t argue.It isn’t long before Mitch learns that his ‘rescuers’ are North Koreans, and he finds himself on a ship steaming to their country. He knows why they want him – to help them with their nuclear weapons program. He also knows his wife was murdered by the U.S. Government and they framed him to cover it up. Everything inside Mitch tells him to take the torture and die with his secrets. Everything except the rage filling his soul… his wife murdered, railroaded by the system, convicted in what was, to him, a kangaroo trial. He can think of no good reason to accept what he knows is coming if he says “no” for a nation that betrayed him.North Korea, he discovers, is a place governed completely by political ideology and fealty to the late, Great Leader, Comrade Generalissomo Kim Il-sung, and his quirky but pathologically sadistic son, Kim Jong-il. But the people are not the psychotic fanatics portrayed in the media. Yes, they prostrate themselves in public, but the ever-present fear of the concentration camps is a powerful motivator. But how to know who is truly committed and who is pretending?Having had his own life ripped from him, Mitch can sympathize with their plight, until he meets Chun Hyon-hui, a beautiful but politically zealous North Korean chemist working on the nuclear program. Being politically undesirable due to her partial Russian ancestry, she is even more ostracized than the “imperialist yangkee”, though tries to make up for it with over-hyped zeal. Both on the outside looking in, they begin to take comfort in one another’s plight. And as Mitch’s stony heart thaws, so the rage driving his actions is slowly curbed.With the evil of his own actions suddenly laid bare before him, Mitch must figure out how he can take back the secrets he has shared and escape with the woman he has come to love. Especially when he discovers why he is really in North Korea. But how does one escape from a secret base within a prison as large as a nation?The Silla Project is at once a glimpse into the nuclear program of a rogue nation and a stark look at the reality of life inside the most reclusive, oppression nation the world has ever seen.",
  "genres": [
    "Thriller",
    "Fiction"
  ],
  "author": "John C. Brewer",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/21088567-the-silla-project"
}