{
  "title": "The Ride: Paul Revere and the Night That Saved America",
  "description": "Timed for the 250th anniversary of one of America’s most famous founding Paul Revere’s legendary ride, newly told with fresh research into little-known aspects of the myth that every American learns in schoolOn April 18, 1775, a Boston-based silversmith, engraver, and anti-British political operative named Paul Revere set out on a borrowed horse to fulfill a dangerous but crucial task to alert American colonists of advancing British troops, which would seek to crush their nascent revolt. Revere was not the only rider that night, and indeed, he had completed at least 18 previous rides throughout New England, disseminating intelligence about British movements. But this ride was like no other, and its consequences in the months and years to come—as the American Revolution morphed from isolated skirmishes to a full-fledged war—became one of our founding legends.In The Ride, Kostya Kennedy presents a dramatic new narrative of the events of April 18 and 19, 1775, informed by fresh primary and secondary source research into archives, family letters and diaries, contemporary accounts, and more. Kennedy reveals Revere’s ride to be more complex than it is usually portrayed—a coordinated series of rides by numerous men, near-disaster, capture by British forces, and finally success. While Revere was central to the ride and its plotting, Kennedy reveals the other men (and, perhaps, a woman with information about the movement of British forces) who helped to set in motion the events that would lead to America’s independence.Thrillingly written in a dramatic, unstoppable narrative, The Ride re-tells an essential American story for a new generation of readers.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "American History",
    "Audiobook",
    "American Revolution",
    "Historical"
  ],
  "author": "Kostya Kennedy",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/211003706-the-ride"
}