{
  "title": "Horse Tales",
  "description": "It was a disaster beyond most people’s comprehension. There was nothing left standing of the barn, it had burned completely to the ground. Among the rubble and smoking wood, you could see the smoking corpses - which had once been some of the finest thoroughbred stallions in the Tennessee and Kentucky area. Unnoticed, among these ruins, were the burned remains of Aaron Nunamaker, owner of ‘Nunamaker Stables’, and one of the best known horse breeders and stud farm owners in West Tennessee.Killing a human being brings the wrath of the law and the accompanying sorrow and grief from loved ones. Killing a helpless animal brings wrath that is unequaled to that associated with killing a person. This sorrow and grief continues long after the grief over human loss has left. Mankind will forget their own losses, but they never forget similar betrayals to animals. Odd isn’t it?The fire had, obviously, been set and was a deliberate murder of innocent animals - horses. Horses, that could not free themselves from their comfortable stable, horses that trusted their caregiver and felt safe in their home. Horses that died a terrible death, and horses that would never know how they became involved in such a terrible scheme and plan.Tracks reveled that many of the doomed horses had been led from another barn to the one that was burned. This made it more than an act of revenge or rage, but one intended to destroy the animals, all at once, and all at one time.Other than car and horse tracks, the clues were minimal or non-existent. Police roped off the area and considered it an accident or a rival/revenge act, until they found the body. Then things changed.He had been shot once at close range with a high powered rifle. The bullet entered his center chest and exited to some unknown parts of the barn or maybe the surrounding ground. His body was burned beyond normal recognition, like the horses, but his engraved Horseshoe ring, which he always wore proudly on his right hand ring finger, made preliminary identification possible.",
  "genres": [],
  "author": "Gerald W. Darnell",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/21087013-horse-tales"
}