{
  "title": "Beyond All Frontiers",
  "description": "Set in India at the time of the Raj, Beyond All Frontiers is a mesmerizing historical novel that seems to sum up an entire era through the lives of its characters. The story of a resourceful, courageous woman, Charlotte Scott, it is also the story of Britain's first war with Afghanistan, which ended with a brutal massacre in the Khyber Pass. And it is a novel about the Empire: how the British gained it - and why they would lose it at last.Returning to India in 1837 after a sheltered childhood in England, seventeen year old Charlotte Scott finds not a loving mother but a cold, beautiful woman dismayed because her plain daughter cares more for politics and good works than for husband-hunting and frivolity. Charlotte finds her intelligence and sensitivity have no place in the peculiar world of the British army station, where full-dress balls and cricket matches are held amid Indian dust, heat, and sqaulor. Only one person truly befriends her: the athletic, handsome, unpretentious Richard Lingarde, considered the most eligible bachelor on the station. An engineer and speaker of native tongues, Richard knows what his fellow officers choose to ignore: the natives, both Indian and Afghan, despise the British and will defeat them in the end.Although bewitched by her mother's exotic cavalier, Major Dpres, Charlotte agrees to marry Richard - and soon alienates him unforgiveably. Richard is sent to war-torn Kabul, where he embarks upon a life of danger and depravity. As Charlotte sets out on a treacherous journey through the Khyber Pass to find him, she begins to grow from a naive young girl into a woman of valor.A love story of extraordinary depth and power, Beyond All Frontiers is a masterful combination of history, courage, surprise, and passion - a novel that makes us hope desperately to see the hero and heroine learn to care for each other as much as we care for them.",
  "genres": [
    "Historical Fiction",
    "India",
    "Romance",
    "Historical Romance",
    "Historical",
    "Epic",
    "Asia"
  ],
  "author": "Emma Drummond",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/2109211.Beyond_All_Frontiers"
}