{
  "title": "The First and Last King of Haiti: The Rise and Fall of Henry Christophe",
  "description": "The essential biography of the controversial rebel, traitor, and only king of Haiti. Henry Christophe (1767 - 1820) is one of the most richly complex figures in the history of the Americas, and was, in his time, popular and famous the world over: in The First and Last King of Haiti, a brilliant, award-winning Yale scholar unravels the still controversial enigma that he was.Slave, revolutionary, traitor, king, and suicide, Henry Christophe was, in his time, popular and famous the world over. Born to an enslaved mother on the Caribbean island of Grenada, Christophe first fought to overthrow the British in North America, before helping his fellow enslaved Africans in Saint-Domingue, as Haiti was then called, to gain their freedom from France. Yet in an incredible twist of fate, Christophe ended up fighting with Napoleon's forces against the very enslaved men and women he had once fought alongside. Later, reuniting with those he had betrayed, he offered to lead them and made himself their king. But it all came to a sudden and tragic end when Christophe--after nine years of his rule as King Henry I--shot himself in the heart, some say with a silver bullet.Why did Christophe turn his back on Toussaint Louverture and the very revolution with which his name is so indelibly associated? How did it come to pass that Christophe found himself accused of participating in the plot to assassinate Haiti's first ruler, Dessalines? What caused Haiti to eventually split into two countries, one ruled by Christophe in the north, who made himself king, the other led by President Pétion in the south?The First and Last King of Haiti is a riveting story of not only geopolitical clashes on a grand scale but also of friendship and loyalty, treachery and betrayal, heroism and strife in an era of revolutionary upheaval.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Biography Memoir"
  ],
  "author": "Marlene L. Daut",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/211025400-the-first-and-last-king-of-haiti"
}