{
  "title": "Realm of Ice and Sky: Triumph, Tragedy, and History's Greatest Arctic Rescue",
  "description": "Two-time National Outdoor Book Award-winning author Buddy Levy's thrilling narrative of polar exploration via airship―and the men who sacrificed everything to make history.Arctic explorer and American visionary Walter Wellman pioneered both polar and trans-Atlantic airship aviation, making history’s first attempts at each. Wellman has been cast as a self-promoting egomaniac known mostly for his catastrophic failures. Instead he was a courageous innovator who pushed the boundaries of polar exploration and paved the way for the ultimate conquest of the North Pole—which would be achieved not by dogsled or airplane, but by airship.American explorer Dr. Frederick Cook was the first to claim he made it to the North Pole in 1908. A year later, so did American Robert Peary, but both Cook’s and Peary’s claims had been seriously questioned. There was enough doubt that Norwegian explorer extraordinaire Roald Amundsen—who’d made history and a name for himself by being first to sail through the Northwest Passage and first man to the South Pole—picked up where Walter Wellman left off, attempting to fly to the North Pole by airship. He would go in the Norge, designed by Italian aeronautical engineer Umberto Nobile. The 350-foot Norge flew over the North Pole on May 12, 1926, and Amundsen was able to accurately record and verify their exact location. However, the engineer Nobile felt slighted by Amundsen. Two years later, Nobile returned, this time in the Italia, backed by Prime Minister Benito Mussolini. This was an Italian enterprise, and Nobile intended to win back the global accolades and reputation he believed Amundsen had stripped from him. The journey ended in disaster, death, and accusations of cannibalism, launching one of the great rescue operations the world had ever seen.Realm of Ice and Sky is the thrilling narrative of polar exploration via airship―and the men who sacrificed everything to make history.",
  "genres": [
    "Nonfiction",
    "History",
    "Adventure",
    "Travel",
    "Science",
    "Biography",
    "Audiobook"
  ],
  "author": "Buddy Levy",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/211003941-realm-of-ice-and-sky"
}