{
  "title": "When the Earth Was Green: Plants, Animals, and Evolution's Greatest Romance",
  "description": "Winner, A Friend of Darwin Award, 2024A gorgeously composed narrative nonfiction book about the longstanding relationship between prehistoric plants and life on Earth.Immaculately framed by ancient stone, the leaves look as if they were pressed between the gray pages of a great geological diary. If we were to see the plant alive, we would simply pass it by, but the fossil is a whisper from a time more than 55 million years ago, when alligators dwelled within the Arctic Circle and gigantic dragonflies buzzed through the air. This little plant is an entry-point into this lost world. Past, present, and future, this ancient specimen has roots in all of them.We often retell the history of life on Earth as a series of great moments in which fascinating animal life springs forth, all the while forgetting the plants that made these moments possible. But we can’t understand our own history without them. Or, our future. Dinosaurs, saber-toothed cats, and all mammals would be nothing without the efforts of their leafy counterparts. Even humans would likely not exist had plants not taken root to sow the land for our amphibious ancestors.Using the same scientifically-informed narrative technique that readers loved in the award-winning The Last Days of the Dinosaurs, in When the Earth Was Green, Riley Black brings readers back in time to prehistoric seas, swamps, forests, and savannas where critical moments in plant evolution unfolded. Each chapter stars plants and animals alike, underscoring how the interactions between species have helped shape the world we call home. As the chapters move upwards in time, Black guides readers along the burgeoning trunk of the Tree of Life, stopping to appreciate branches of an evolutionary story that links the world we know with one we can only just perceive now through the silent stone, from ancient roots to the present.",
  "genres": [
    "Nonfiction",
    "Science",
    "Nature",
    "History",
    "Biology",
    "Animals",
    "Audiobook"
  ],
  "author": "Riley Black",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/211003956-when-the-earth-was-green"
}