{
  "title": "Amoretti And Epithalamion",
  "description": "Amoretti and Epithalamion is a collection of sonnets and a long poem by Edmund Spenser, a prominent English poet of the Renaissance era. The collection is divided into two Amoretti, which consists of 89 sonnets, and Epithalamion, which is a single long poem. The sonnets in Amoretti are all love poems, written in the Petrarchan tradition. They follow a typical structure, with the first eight lines (the octave) presenting a problem or question, and the final six lines (the sestet) providing an answer or resolution. The sonnets in Amoretti tell the story of Spenser's courtship of his eventual wife, Elizabeth Boyle, and are notable for their use of elaborate imagery and complex wordplay.Epithalamion, on the other hand, is a celebratory poem written to commemorate Spenser's wedding day. It is a long and complex work, consisting of 365 stanzas, each with nine lines. The poem is structured around the progress of the wedding day, beginning with the morning and ending with the consummation of the marriage at night. Along the way, Spenser weaves in a variety of themes and motifs, including the beauty of nature, the power of love, and the importance of marriage.Overall, Amoretti and Epithalamion is a masterful collection of poetry that showcases Spenser's skill as a writer and his ability to capture the complexity of human emotion. It is a must-read for anyone interested in the poetry of the Renaissance era, and a testament to Spenser's enduring legacy as one of England's greatest poets.My Hungry Eyes Through Greedy Couetize, Still To Behold The Obiect Of Their With No Contentment Can Themselues Suffize, But Hauing Pine And Hauing Not Complaine.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Poetry",
    "Classics",
    "School",
    "Read For School",
    "Fiction"
  ],
  "author": "Edmund Spenser",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/211059.Amoretti_And_Epithalamion"
}