{
  "title": "How to Be Enough: Self-Acceptance for Self-Critics and Perfectionists",
  "description": "Are you your own toughest critic? Learn to be good to yourself with this clear and compassionate guide.Do you set demanding standards for yourself? If so, a lot likely goes well in your life: You might earn compliments, admiration, or accomplishments. Your high standards and hard work pay off.But privately, you may feel like you’re falling behind, faking it, or different from everybody else. Your eagle-eyed inner quality control inspector highlights every mistake. You try hard to avoid criticism, but criticize yourself. Trying to get it right is your guiding light, but it has lit the way to a place of dissatisfaction, loneliness, or disconnection. In short, you may look like you’re hitting it out of the park, but you feel like you’re striking out.This is perfectionism. And for everyone who struggles with it, it’s a misnomer: perfectionism isn’t about striving to be perfect. It’s about never feeling good enough.Dr. Ellen Hendriksen—clinical psychologist, anxiety specialist, and author of How to Be Yourself—is on the same journey as you. In How to Be Enough, Hendriksen charts a flexible, forgiving, and freeing path, all without giving up the excellence your high standards and hard work have gotten you. She delivers seven shifts—including from self-criticism to kindness, control to authenticity, procrastination to productivity, comparison to contentment—to find self-acceptance, rewrite the Inner Rulebook, and most of all, cultivate the authentic human connections we’re all craving.With compassion and humor, Hendriksen lays out a clear, effective, and empowering guide. To enjoy rather than improve, be real rather than impressive, and be good to yourself when you’re wired to be hard on yourself.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Mental Health",
    "Health",
    "Audiobook",
    "Personal Development"
  ],
  "author": "Ellen Hendriksen",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/211004934-how-to-be-enough"
}