{
  "title": "Such a Good Mom",
  "description": "Bestselling author Julia Spiro's Such a Good Mom is a brilliant standalone mystery that's the perfect beach read. In the heat of summer, a murder on Martha's Vineyard rocks one new mom to the core, leaving her to search for answers.With a healthy newborn baby, a devoted husband, a successful career, and a busy life on Martha’s Vineyard, Brynn Nelson should be the happiest she’s ever been. But Brynn is struggling. Her husband, Ross, grows more distant by the day, and the challenges and exhaustion of postpartum make Brynn feel like she’s slowly losing pieces of herself to motherhood. Pieces that she might never get back.But it’s summer on the Vineyard, a beacon for wealthy visitors, and a place so beautiful that it seems immune to tragedy and crime. Except for locals, like Brynn, who know all too well that tragedy can strike at any point. And this time, it hits close to home when a friend of the family is found washed ashore. Dead. And Brynn’s already hectic life is turned upside down when Ross is arrested for the crime.Left reeling with more questions than answers, Brynn’s only path forward is to find out who really killed Cecelia Buckley, even if it means it was her husband. She’s not sure who she’s able to trust anymore. And with dizzying, endless cycle of sleepless nights, diapers, and bottles, Brynn’s not even sure she can trust herself. She’s not sure of anything anymore, but she won’t stop until she finds the truth.Bestselling author Julia Spiro is known for writing characters readers instantly connect to. With Such a Good Mom, Spiro brings the real and layered Martha’s Vineyard to life through the eyes of a new mom trying to get her family out of the eye of the storm that is a murder investigation.",
  "genres": [
    "Mystery",
    "Mystery Thriller",
    "Fiction",
    "Thriller",
    "Suspense",
    "Adult",
    "Audiobook"
  ],
  "author": "Julia Spiro",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/211004215-such-a-good-mom"
}