{
  "title": "The Gettysburg Gospel: The Lincoln Speech That Nobody Knows",
  "description": "The words Abraham Lincoln spoke at the dedication of the Soldiers' National Cemetery at Gettysburg comprise perhaps the most famous speech in history. It has been quoted by popes, presidents, prime ministers, and revolutionaries around the world. From \"Four score and seven years ago...\" to \"government of the people, by the people, for the people,\" Lincoln's words echo in the American conscience. Many books have been written about the Gettysburg Address and yet, as Lincoln scholar Gabor Boritt shows, there is much that we don't know about the speech. In \"The Gettysburg Gospel\" he reconstructs what really happened in Gettysburg, Pennsylvania, on November 19, 1863. Boritt tears away a century of myths, lies, and legends to give us a clear understanding of the greatest American's greatest speech.In the aftermath of the bloodiest battle ever fought in North America, the little town of Gettysburg was engulfed in the worst man-made disaster in U.S. history: close to 21,000 wounded; very few doctors; heroic women coping in houses, barns, and churches turned into hospitals; dead horses and mules rotting in farmyards and fields; and at least 7,000 dead soldiers who had to be dug up, identified, and reburied. This was where Lincoln had to come to explain why the horror of war must continue.Planning America's first national cemetery revitalized the traumatized people of Gettysburg, but the dedication ceremonies overwhelmed the town. Lincoln was not certain until the last moment whether he could come. But he knew the significance of the occasion and wrote his remarks with care -- the first speech since his inauguration that he prepared before delivering it. A careful analysis of the Addressand the public reaction to it form the center of this book. Boritt shows how Lincoln responded to the politics of the time and also clarifies which text he spoke from and how and when he wrote the various versions. Few people initially recognized the importance of the speech; it was frequently and, at times, hilariously misreported. But over the years the speech would grow into American scripture. It would acquire new and broader meanings. It would be better understood, but also misunderstood and misinterpreted to suit beliefs very different from Lincoln's.\"The Gettysburg Gospel\" is based on years of scholarship as well as a deep understanding of Lincoln and of Gettysburg itself. It draws on vital documents essential to appreciating Lincoln's great speech and its evolution into American gospel. This is an indispensable book for anyone interested in the Gettysburg Address, Abraham Lincoln, the Civil War, or American history.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American History",
    "American Civil War",
    "Presidents",
    "Civil War History"
  ],
  "author": "Gabor S. Boritt",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/211040.The_Gettysburg_Gospel"
}