{
  "title": "Never Planned on You",
  "description": "A glittering, laugh-out-loud second chance romance that reminds us true love is sometimes the one thing you never planned on.Ali Rubin has a reputation for spontaneity. Like that time she made a drunken bet in London that led to matching tattoos with a stranger. Her joie de vivre is one of her best qualities; she lives every day to the fullest and follows her dreams wherever they take her. And now, they’re taking her from her career as a chef in New York City back home to Baltimore, where she’s interning as a wedding planner.Despite the occasional fantasy about her British tattoo twin, Ali never expected to see Graham again. So no one is more surprised than she is when he turns up in Baltimore, ordering a latte at her favorite cafe. When they reconnect during an enchanting evening together, Ali can’t help but wonder if Graham might be someone special.At the same time, she's desperate to succeed in her new career and prove that she isn’t the family flake. When she gets a job planning a high profile wedding at a historic hotel, it seems like things are finally falling into place. That is, until Graham turns out to be the groom.Graham’s family owns the once-grand, now struggling Black-Eyed Susan, and he’s returned to Baltimore to help his grandmother get it back on its feet. He’s certain that hosting a wedding at the hotel is just the publicity boost it needs. Ali’s boss agrees, and promises Ali a full-time gig if the affair goes off without a hitch. Unfortunately, Ali and Graham can't seem to ignore their rekindled chemistry, especially when it’s revealed that Graham and his fiancée are planning a marriage of convenience. Still, staying away from each other is the best thing they can do, since giving in to their growing feelings might cost them everything.Because when it comes to love, all bets are off.",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction",
    "Chick Lit",
    "Second Chance",
    "Contemporary Romance",
    "Adult"
  ],
  "author": "Lindsay Hameroff",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/211003861-never-planned-on-you"
}