{
  "title": "The Queens of Crime",
  "description": "The New York Times bestselling author of The Mystery of Mrs. Christie returns with a thrilling story of Christie’s legendary rival Dorothy Sayers, the race to solve a murder, and the power of friendship among women.London, 1930. The five greatest women crime writers have banded together to form a secret society with a single goal: to show they are no longer willing to be treated as second-class citizens by their male counterparts in the legendary Detection Club. Led by the formidable Dorothy L. Sayers, the group includes Agatha Christie, Ngaio Marsh, Margery Allingham and Baroness Emma Orczy. They call themselves the Queens of Crime. Their plan? Solve an actual murder, that of a young woman found strangled in a park in France who may have connections leading to the highest levels of the British establishment.May Daniels, a young English nurse on an excursion to France with her friend, seemed to vanish into thin air as they prepared to board a ferry home. Months later, her body is found in the nearby woods. The murder has all the hallmarks of a locked room mystery for which these authors are famous: how did her killer manage to sneak her body out of a crowded train station without anyone noticing? If, as the police believe, the cause of death is manual strangulation, why is there is an extraordinary amount of blood at the crime scene? What is the meaning of a heartbreaking secret letter seeming to implicate an unnamed paramour? Determined to solve the highly publicized murder, the Queens of Crime embark on their own investigation, discovering they’re stronger together. But soon the killer targets Dorothy Sayers herself, threatening to expose a dark secret in her past that she would do anything to keep hidden.Inspired by a true story in Sayers’ own life, New York Times bestselling author Marie Benedict brings to life the lengths to which five talented women writers will go to be taken seriously in the male-dominated world of letters as they unpuzzle a mystery torn from the pages of their own novels.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Historical",
    "Mystery Thriller",
    "Audiobook",
    "Thriller"
  ],
  "author": "Marie Benedict",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/211003830-the-queens-of-crime"
}