{
  "title": "Learning to Breathe: My Yearlong Quest to Bring Calm to My Life",
  "description": "Priscilla Warner has had a great a supportive husband, a flourishing marriage, two loving sons, and a bestselling book, The Faith Club. Despite all her good fortune and success, she suffers from anxiety and panic attacks so debilitating that they leave her unable to breathe. She’s tried self-medicating—in high school, with a hidden flask of vodka—and later, with prescription medications—daily doses of Klonopin with a dark-chocolate chaser. After forty years of hyperventilating, and an overwhelming panic attack that’s the ultimate wake-up call, Warner’s mantra becomes “Neurotic, Heal Thyself.” A spirited New Yorker, she sets out to find her inner Tibetan monk by meditating every day, aiming to rewire her brain and her body and mend her frayed nerves. On this winding path from panic to peace, with its hairpin emotional curves and breathtaking drops, she also delves into a wide range of spiritual and alternative health practices, some serious and some . . . not so much.Warner tries spiritual chanting, meditative painting, immersion in a Jewish ritual bath, and quasi-hallucinogenic Ayurvedic oil treatments. She encounters mystical rabbis who teach her Kabbalistic lessons, attends silent retreats with compassionate Buddhist mentors, and gains insights from the spiritual leaders, healers, and therapists she meets. Meditating in malls instead of monasteries, Warner becomes a monk in a minivan and calms down long enough to examine her colorful, sometimes frightening family history in a new light, ultimately making peace with her past. And she receives corroboration that she’s healing from a neuroscientist who scans her brain for signs of progress and change.Written with lively wit and humor, Learning to Breathe is a serious attempt to heal from a painful condition. It’s also a life raft of compassion and hope for people similarly adrift or secretly fearful, as well as an entertaining and inspiring guidebook for anyone facing daily challenges large and small, anyone who is also longing for a sense of peace, self-acceptance, and understanding.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Spirituality",
    "Buddhism",
    "Inspirational"
  ],
  "author": "Priscilla Warner",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/11218426-learning-to-breathe"
}