{
  "title": "The Art of Power: My Story as America's First Woman Speaker of the House",
  "description": "The most powerful woman in American political history tells the story of her transformation from housewife to House Speaker how she became a master legislator, a key partner to presidents, and the most visible leader of the Trump resistance.When, at age forty-six, Nancy Pelosi, mother of five, asked her youngest daughter if she should run for Congress, Alexandra Pelosi answered: ';Mother, get a life!' And so Nancy did, and what a life it has been.InThe Art of Power, Pelosi describes for the first time what it takes to make history not only as the first woman to ascend to the most powerful legislative role in America, but to pass laws that would save lives and livelihoods, from the emergency rescue of the economy in 2008 to transforming health care. She describes the perseverance, persuasion, and respect for her members that it took to succeed, but also the joy of seeing America change for the better. Among the best-prepared and hardest-working Speakers in history, Pelosi worked to find common ground, or stand her ground, with presidents from Bush to Biden.She also shares moving moments with soldiers sent to the front lines, women who inspired her, and human rights activists who fought by her side.Pelosi took positions that established her as a prophetic voice on the major moral issues of the day, warning early about the dangers of the Iraq War and of the Chinese government's long record of misbehaviour. This moral courage prepared her for the arrival of Trump, with whom she famously tangled, becoming a red-coated symbol of resistance to his destructive presidency. Here, she reveals how she went toe-to-toe with Trump, leading up to January 6, 2021, when he unleashed his post-election fury on the Congress.Pelosi gives us her personal account of that day: the assault not only on the symbol of our democracy but on the men and women who had come to serve the nation, never expecting to hide under desks or flee for their lives and her determined efforts to get the National Guard to the Capitol. Nearly two years later, violence and fury would erupt inside Pelosi's own home when an intruder, demanding to see the Speaker, viciously attacked her beloved husband, Paul. Here, Pelosi shares that horrifying day and the traumatic aftermath for her and her family.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Memoir",
    "Biography",
    "History",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Nancy Pelosi",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/211143818-the-art-of-power"
}