{
  "title": "Full Fathom Five",
  "description": "From the co-author of the viral New York Times bestseller This is How You Lose the Time War.“This is the best kind of urban fantasy, filled with diverse characters and thought-provoking philosophies.” —The Washington PostMax Gladstone's Craft Sequence chronicles the epic struggle to build a just society in a modern fantasy world.On the island of Kavekana, Priestess Kai builds gods to order—sort of. Kai's creations are perfect vehicles for Craftsmen and Craftswomen operating in the Old World. For beyond the ocean, true deities still thrive, untouched by the God Wars that stransformed the city-states of Alt Coulumb and Dresediel Lex.When Kai tries to save a friend's dying idol, she's graveley injured—then sidelined from the business, her near-suicidal rescue attempt offered up as proof of her instability. But when Kai gets tired of hearing her boss, her coworkers, and her ex-boyfriend call her crazy, and digs into the cause of the idol's death, she uncovers a conspiracy of silence and fear that will break her if she can't break it first. Set in a phenomenally built world in which lawyers ride lightning bolts, souls are currency, and cities are powered by the remains of fallen gods, Max Gladstone's Craft Sequence introduces readers to a modern fantasy landscape and an epic struggle to build a just society. Also Available by Max Craft Sequence1. Three Parts Dead2. Two Serpents Rise3. Full Fathom Five4. Last First Snow5. Four Roads Cross6. Ruin of AngelsThe Craft Wars1. Dead Country2. Wicked ProblemsLast ExitEmpress of ForeverThis is How You Lose the Time War (with Amal El-Mohtar)At the Publisher's request, this title is being sold without Digital Rights Management Software (DRM) applied.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Fiction",
    "Science Fiction",
    "Queer",
    "LGBT",
    "Magic"
  ],
  "author": "Max Gladstone",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/21122672-full-fathom-five"
}