{
  "title": "Archaeology of Precolumbian Florida",
  "description": "\"A comprehensive and compelling archaeological Baedeker to Precolumbian Florida that addresses a complex subject in straightforward, no-nonsense language that both scholars and lay readers will find refreshing.\" - Peter A. Young, editor-in-chief, Archaeology \"Milanich is easily Florida's most unconventional and widely read archaeologist.  He presents a well-told story of solitary Ice Age hunters lurking on dark sinkhole ledges to spear giant tortoises; of the uniquely preserved wooden art objects from thousand-year-old fishing villages; and of the elaborate ritual games of those agricultural chiefdoms who met and defeated the first Spanish Conquistadors. . . A vivid and thoughtful interpretation of twelve millennia of human experience in the Sunshine State.\" - David Brose, Royal Ontario Museum and University of TorontoThis record of precolumbian Florida brings to life the 12,000-year story of the native American Indians who lived in the state.  Using information gathered by archaeological investigations, many carried out since 1980, Jerald Milanich describes the indigenous cultures and explains why they developed as they did. In a richly illustrated book that will appeal to professional and avocational archaeologists, scholars, tourists, and local history buffs, Milanich introduces the material heritage of the first Floridians through the interpretation of artifacts and archaeological sites.  Weaving together discoveries from such sites as the Lake Jackson mounds in the panhandle, Crystal River on the Gulf coast, and Granada on the Miami River, he relates the long histories of the native groups whose descendants were decimated during the European conquest of the sixteenth and seventeenth centuries. Milanich begins with an overview of the history of archaeology in Florida.  He then describes the earliest aboriginal cultures: the Paleoindians and the people of the Archaic period.  The later, regional cultures (Weeden Island, Fort Walton, Glades, Caloosahatchee, and many others) are correlated with geographical and environmental regions and then compared to provide insights about the nature of chiefdom societies, the effects of wetlands on precolumbian settlement systems, and the environmental history of the state. Maps and illustrations document this history of archaeological research in Florida and of the sites and artifacts (including spectacular Weeden Island pottery vessels and Belle Glade wooden carvings) left behind by the precolumbian people.Jerald T. Milanich is curator in archaeology and chair, Department of Anthropology, at the Florida Museum of Natural History, Gainesville.  He is the author or editor of ten books and monographs, including (with Charles Hudson) Hernando de Soto and the Indians of Florida (UPF, 1993) and (with Susan Milbrath) First Encounters:  Spanish Exploration in the Caribbean and the United States, 1492-1570 (UPF,1989).",
  "genres": [
    "Archaeology",
    "History",
    "Anthropology"
  ],
  "author": "Jerald T. Milanich",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/2111097.Archaeology_of_Precolumbian_Florida"
}