{
  "title": "Win from Within for Total Business Success: The 3-Phase Strategy to Take Your Business Stratospheric",
  "description": "Skyrocket Results With This 3-Phase Strategy This book demonstrates and explains exactly how to achieve success by motivating and fully enabling individuals and teams to perform at their best. Gillen worked with Olympic Gold Medal Winners and Olympic coaches to convert their sports coaching techniques and strategies into business terachniques and strategies. Gillen's business expertise was the catalyst that converted sports performance excellence into business performance excellence. The book is a clear manual and a straightforward roadmap based on years of applying the principles and the specific actions in all lines and sizes of business on both sides of the Atlantic. Follow the complete 3-phase strategy in a real-world business scenario and then see it broken down and fully explained in the Executive Summary. The Exec Summary includes links to each scenario chapter. Learn the theory, and then “watch it” applied by the characters in the scenario. The Three Phases 1) The Five Questions of Leadership as a basis for business growth. 2) The Nine Points of Personal Performance focus individuals and teams on every action they take to ensure maximum achievement. It also helps everyone to agree on the value and purpose of an intervention. 3) The ACED Coaching Model enables team leaders and team members to coach each other and themselves so they perform their tasks perfectly. Performance Coaching is a skill which operates most effectively as part of an overall structure. The Five Questions and the Nine Points provide that structure. Two Roll-Out Plans The roll-out plans are just that. Individuals and team leaders use them to launch the strategy and actions in their own organizations quickly and easily. Tony Gillen is a retired performance coach, skills trainer, and entrepreneur. He was General Manager of The Grass Roots Group Training Division. He worked with Sir John Whitmore, Dr. David Hemery, and David Whitaker to develop the GROW coaching model into a business coaching model. GROW became the foundation of business coaching. Gillen further developed GROW into ACED to broaden its application, reinforce its power, and make it part of the total structure found in this book.",
  "genres": [],
  "author": "Tony Gillen",
  "average_rating": "2.67",
  "url": "https://www.goodreads.com/book/show/21123886-win-from-within-for-total-business-success"
}