{
  "title": "Anthology of Black Humor",
  "description": "This is the first publication in English of the anthology that contains Breton's definitive statement on l'humour noir, one of the seminal concepts of Surrealism, and his provocative assessments of the writers he most admired. While some of the authors featured in The Anthology of Black Humor are already well known to American readers--Swift, Kafka, Rimbaud, Poe, Lewis Carroll, and Baudelaire among them (and even then, Breton's selections are often surprising)--many others are sure to come as a revelation.The entries range from the acerbic aphorisms of Swift, Lichtenberg, and Duchamp to the theatrical slapstick of Christian Dietrich Grabbe, from the wry missives of Rimbaud and Jacques Vache to the manic paranoia of Dali, from the ferocious iconoclasm of Alfred Jarry and Arthur Craven to the offhand hilarity of Apollinaire at his most spontaneous. For each of the forty-five authors included, Breton has provided an enlightening biographical and critical preface, situating both the writer and the work in the context of black humor--a partly macabre, partly ironic, and often absurd turn of spirit that Breton defined as \"a superior revolt of the mind.\"\"Anthologies can aim to be groundbreaking or thought-provoking; few can be said to have introduced a new phrase--or a new concept--into the language. No one had ever used the term \"black humour\" before this one came along, unless, perhaps, it was from a racial angle.\"--The GuardianAndre Breton (1896-1966), the founder and principal theorist of the Surrealist movement, is one of the major literary figures of the past century. His best-known works in English translation include Nadja, Mad Love, The Manifestoes of Surrealism, The Magnetic Fields (with Philippe Soupault), and Earthlight. Mark Polizzotti is the author of Revolution of the Mind: The Life of Andre Breton.",
  "genres": [
    "Fiction",
    "Humor",
    "Short Stories",
    "France",
    "Poetry",
    "Anthologies",
    "French Literature"
  ],
  "author": "André Breton",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/211235.Anthology_of_Black_Humor"
}