{
  "title": "Song of the Dark Wood",
  "description": "For centuries, the people of remote Ballybrine have kept the peace with their gods by sacrificing a Red Maiden to ferry souls from the Mother’s realm of the living, through the Dark Wood, to the Wolf’s realm of the dead. Soon it will be Rowan’s turn.Ripped from her family as a young girl, Rowan Cleary has been forced into a cloistered life learning to please the wolf and wield her spirit-enchanting voice. Though none of the previous maidens have survived their five-year term, Rowan is determined to beat the odds and protect the women who have become family to her.When a deathly blight breaks out in the Dark Wood, and the acting maiden is murdered, Rowan vows to strike a new bargain with the god of death to ensure her survival. The Wolf has always been someone to fear—even more so now that the townspeople blame him for the blight—but he’s far from the vengeful death god she expects.To unravel the mystery, Rowan must seduce the Wolf. Soon, the attraction between them grows into a relentless magical force, threatening to shatter the delicate balance between realms and unleash a darkness eager to swallow their world.SONG OF THE DARK WOOD is a standalone gothic fairy tale fantasy romance that blends a fractured Red Riding Hood retelling with a hint of Hades and Persephone. This \"coming of rage\" character-driven romance follows Rowan Cleary as she tries to free herself from an oppressive religion and seduce the grumpy god of death Wolf. SONG is a spicy, dark romantasy perfect for fans of feminine rage, strong female friendships, unique magic systems, angsty romance, and ominous mysteries. This book will appeal to readers who enjoyed Rachel Gillig's ONE DARK WINDOW, Rebecca Ross's A RIVER ENCHANTED, and Hannah Whitten's FOXGLOVE KING.",
  "genres": [
    "Fantasy",
    "Romance",
    "Romantasy",
    "Retellings",
    "Fantasy Romance",
    "Gothic",
    "New Adult"
  ],
  "author": "Sheila Masterson",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/211231086-song-of-the-dark-wood"
}