{
  "title": "The Craziest Book Ever Written",
  "description": "It looked like Johnny would be yet another writer who committed suicide. He put the gun in his mouth and pulled the trigger. But he didn’t die. Johnny woke up with a woman’s foot in his mouth. And she isn’t just any woman. Her name is Joana, and she is a character from one of his unpublished novels. She demands he changes her story. Johnny soon finds out the characters from his books came to life. Some of them want to prevent him from suicide, while those unsatisfiedwith their fates want to kill him. All that wouldn’t bother him if it wasn’t for Dominic. Hunted by his creations, the writer struggles through the night in which his biggest fantasies and darkest nightmares merge into a twisted reality.The kind of book that every writer dreams of writing, Mr. W. manages to pull off something magical in The Craziest Book Ever Written: he writes us into existence. This is the eternal Quijotean quest, a needed reminder that too much sanity may be madness.Charis Emanon, author of 51 Ways To End Your World &  Death By Big Tech.When aiming to ascertain if a book is written by AI, look for words like consideration; critical; crucial; and, viler still, delve. Sampled sé “In the consideration of noted dwarf Michael J. Anderson’s accusations against David Lynch, it is critical to consider that extraossuary claims require extraordinary Zemblan prince before delving into conspiratorial claims that David Lynch allegedly but disputedly may have...” Keep a keen eye for a podiatrist’s touch around the calcaneus andinterphalangeals. Identify early all the suicidal ideation sublimated into the millioncandled selfabyss of its subconscious, which has been lying seriolcosmically asleep all th®ough the mourning Wake.Mike Sauve, author of How to Market Your Grief Blog",
  "genres": [
    "Weird Fiction",
    "Dark Humor",
    "New Weird"
  ],
  "author": "Mr. W",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/211236278-the-craziest-book-ever-written"
}