{
  "title": "Cancer Moon: How I Survived the Best Years of My Life",
  "description": "For fans of You’ll Grow Out of It, this comedic patchwork of flash-prose, essay, and poetry snapshots a millennial performance artist’s journey from late bloomer to adult, inviting twenty-something women to embrace their self-worth, sexuality, and own-your-weird mentality.Growing up in Santa Barbara, California, way too close to the Hollywood dream machine, Jenna Tico’s self-worth wanes to invisibility when her identity becomes enmeshed with validation from celebrities and spiritual F-boys . . . until she claws her way back to empowerment. Here, Tico shares vulnerable personal essays, stories, and poetry—all grouped following the cycles of the moon—chronicling her journey from late bloomer to full grownup. Observing the world of twenty-something relationships from perspectives as diverse as a bachelorette houseboat, a music festival afterparty, and the airplane ride to a death bed, she validates the experiences of women who feel like they have been abandoned by the generation that came before them. Her self-reflective stories encourage healthy life choices for young women without telling them where, what, or how to live their lives—and always with a healthy dash of humor on the side. Simultaneously hilarious and poignant (without the whiff of morality play), Cancer Moon invites readers to embrace their twenties—aka the “age of wallowing”—as a humorous and necessary step toward understanding how we become who we want to be in the world.\"...Tico’s form is bold, as Cancer Moon mixes straight-ahead memoir with pages of intimate blank verse that dig deep into ideas and feelings . . . Rousing, bold, funny story of growing into one’s power.”—BookLife Review, Editor’s Pick“A fever dream of genre and memory, reading Cancer Moon is like sitting barefoot and cross-legged late into the night with your wisest and funniest friend.”—Ellen O'Connell Whittet, author of What You Become in Flight",
  "genres": [
    "Memoir"
  ],
  "author": "Jenna  Tico",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/211350345-cancer-moon"
}