{
  "title": "Sleeping in the Sun",
  "description": "When two visitors arrive to the boarding house in India where an American boy is coming of age during the British Raj, truths unravel, disrupting his life and challenging the family’s sense of home. A unique historical angle ideal for fans of The Poisonwood Bible and The Inheritance of Loss.In the last years of the British Raj, an American missionary family stays on in Midnapore, India. Though the Hintons enjoy white privileges, they have never been accepted by British society and instead run a boarding house on the outskirts of town where wayward native Indians come to find relief.Young Gene Hinton can’t get out from under the thumb of his three older brothers, and the only person he can really relate to is Arthur, his family’s Indian servant. But when Uncle Ellis, a high-ranking British judge, suddenly arrives and announces he’ll be staying indefinitely in their humble house, far from his prestigious post in Himalayan foothills, life as Gene knows it is interrupted. While his brothers are excited at the judge’s arrival, he is skeptical as to why this important man is hiding out with them in the backwaters of Bengal.Also skeptical is Arthur. Then an Indian woman appears on their doorstep—and, after growing close to her, he learns the sinister truth about the judge. Torn between a family that has provided him shelter, work, and purpose his whole life and the escalating outrage of his countrymen, Arthur must decide where his loyalties lie—and the Hintons must decide if they can still call India home.Praise for Sleeping in the Sun:“Sleeping in the Sun is a stunning novel that grabs your emotions and doesn’t let go.” — Ginny Kubitz Moyer, author of A Golden Life“Set against the backdrop of India in the 1930s, Sleeping in the Sun tells the story of the Hintons, a family of American missionaries sent to bring Christianity to the city of Midnapore. Told from the point of view of Gene, the Hintons’ youngest son, and Arthur, their Indian servant, this sweeping historical novel flawlessly transports readers to another time and place. Political, racial, and interpersonal conflicts ensure you won’t be able to put it down. I know I couldn’t.” — Susen Edwards, author of What a Trip and Lookin’ for Love“Exquisitely rendered and highly nuanced ... Sumptuously written and detailed, this novel is destined to become a classic. A triumph!” — Ashley E. Sweeney, author of Eliza Waite",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "India"
  ],
  "author": "Joanne Howard",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/211350354-sleeping-in-the-sun"
}