{
  "title": "The Favorites",
  "description": "To the world, they were a scandal. To each other, an obsession.An epic love story set in the sparkling, savage sphere of elite figure skating about a woman determined to carve her own path on and off the iceShe might not have a famous name, funding, or her family’s support, but Katarina Shaw has always known that she was destined to become an Olympic skater. When she meets Heath Rocha, a lonely kid stuck in the foster care system, their instant connection makes them a formidable duo on the ice. Clinging to skating—and each other—to escape their turbulent lives, Kat and Heath go from childhood sweethearts to champion ice dancers, captivating the world with their scorching chemistry, rebellious style, and rollercoaster relationship. Until a shocking incident at the Olympic Games brings their partnership to a sudden end.As the ten-year anniversary of their final skate approaches, an unauthorized documentary reignites the public obsession with Shaw and Rocha, claiming to uncover the \"real story\" through interviews with their closest friends and fiercest rivals. Kat wants nothing to do with the documentary. But she can't stand the thought of someone else defining her legacy either. So, after a decade of silence, she's telling her story: from the childhood tragedies that created her all-consuming bond with Heath to the clash of desires that tore them apart. Sensational rumors have haunted their every step for years, but the truth may be even more shocking than the headlines.Inspired by the powerful love and hate that fuel Emily Bronte’s classic, Wuthering Heights, The Favorites is an exhilarating dance between passion, ambition, and what it truly means to win.",
  "genres": [
    "Romance",
    "Fiction",
    "Audiobook",
    "Contemporary",
    "Sports",
    "Sports Romance",
    "Book Club"
  ],
  "author": "Layne Fargo",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/211399784-the-favorites"
}