{
  "title": "Something Lost, Something Gained: Reflections on Life, Love, and Liberty",
  "description": "What would it be like to sit down for an impassioned, entertaining conversation with Hillary Clinton? In Something Lost, Something Gained, Hillary offers her candid views on life and love, politics, liberty, democracy, the threats we face, and the future within our reach.She describes the strength she draws from her deepest friendships, her Methodist faith, and the nearly fifty years she’s been married to President Bill Clinton—all with the wisdom that comes from looking back on a full life with fresh eyes. She takes us along as she returns to the classroom as a college professor, enjoys the bonds inside the exclusive club of former First Ladies, moves past her dream of being president, and dives into new activism for women and democracy.From canoeing with an ex-Nazi trying to deprogram white supremacists to sweltering with salt farmers in the desert trying to adapt to the climate crisis in India, Hillary brings us to the front lines of our biggest challenges. For the first time, Hillary shares the story of her operation to evacuate Afghan women to safety in the harrowing final days of America’s longest war. But we also meet the brave women dissidents defying dictators around the world, gain new personal insights about her old adversary Vladimir Putin, and learn the best ways that worried parents can protect kids from toxic technology. We also hear her fervent and persuasive warning to all American voters. In the end, Something Lost, Something Gained is a testament to the idea that the personal is political, and the political is personal, providing a blueprint for what each of us can do to make our lives better.Hillary has “looked at life from both sides now.” In these pages, she shares the latest chapter of her inspiring life and shows us how to age with grace and keep moving forward, with grit, joy, purpose, and a sense of humor.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Politics",
    "Audiobook",
    "Biography",
    "History",
    "Biography Memoir"
  ],
  "author": "Hillary Rodham Clinton",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/211366684-something-lost-something-gained"
}