{
  "title": "King of the Night",
  "description": "\"DJ Williams' KING OF THE NIGHT is chocked full of everything I love in a novel: international intrigue, political gamesmanship, strange science, and a hero—Chase Hardeman—who is a juggernaut of skill and vengeance. Think Jack Reacher tossed into a Tom Clancy novel. Grab this rollercoaster of a thriller and hold on with both hands!\" —James Rollins, #1 New York Times bestseller of Tides of FireChase Hardeman Returns! What is Ryan Steck, author of Out For Blood and founder/editor in chief of The Real Book Spy, the industry's number one source for mysteries and thrillers, saying about the sequel? \"Fast, knee-deep in conspiracies and intriguing characters, D.J. Williams' King of the Night is a sensational thriller from an author who should be watched closely moving forward.\"Chase Hardeman, who fought the war on terror in the shadows under the secretive direction of the Oval Office, is on an international hunt for revenge. After the kidnapping of an FBI agent, who the government refuses to acknowledge, Hardeman and his partner Dexter Thompson embark on a dangerous globetrotting journey against the clock to rescue a woman who betrayed them.Caught in the crosshairs of a takeover within the Bratva, Hardeman and Thompson must shadow their enemy as they navigate the treacherous underworld of international espionage while in the dark corridors of the White House the Commander in Chief battles between a re-election campaign and decisions he's kept from the American people.Hardeman and Thompson will return to the darkness through shocking alliances, heartbreaking losses, and world-shattering revelations in a fight for freedom as they uncover a scandalous truth that threatens to fracture the United States beyond the swamp of Washington's elite.With the pulse-pounding action of Robert Ludlum's Jason Bourne and the relentless determination of Lee Child's Jack Reacher, D.J. Williams' Chase Hardeman will keep you on the edge of your seat. Perfect for fans of fast-paced espionage and military thrillers.Readers have praised Williams' gripping storytelling, comparing it to the likes of James Patterson, David Baldacci, Daniel Silva, and Brad Thor. Don't miss out on this sensational read that will leave you breathless and craving for more!",
  "genres": [],
  "author": "D.J.  Williams",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/211443073-king-of-the-night"
}