{
  "title": "The Sixteenth Grave: A love beyond sight, a crime beyond words.",
  "description": "THE LANDLORDCareer-obsessed Ryan Shale is a detective in a dilemma. He's been fortunate to get rid of his scruffy, guitar-plucking lodger before the man's blasted rug rat is born. After all, there would have been no chance of him passing his Inspector's exams with a sprog screaming in Jake's basement rooms. But if the guy's departure was such a lucky break, why does coming home at night now feel so cold and unwelcoming?THE LODGERBlind spirit finder Jake Taberner is a man in a mess. On midsummer's night, he stormed out on his infuriating 'clean freak' of a landlord, but months later, still can't find anywhere permanent to live. With his son's birth imminent, his surrogate has threatened to put the baby up for adoption if he doesn't find somewhere fast. How could his lifelong dream of becoming a dad be slipping through his fingers?As year-end approaches, Ryan stumbles upon a mystery that reignites the embers of their painful feud. A body found in a snowbound forest bears a scar identical to one on Jake. As the cold case heats up, so does the tension between the prickly detective and the forensic psychic who once worked alongside him. Jake guards his childhood secrets as closely as Ryan conceals his heart's desires, but with young lives hanging in the balance, can the pair bridge the chasm of mistrust? The quest for justice leads them down a path so dark that only the bravest of confessions can light the way. As Ryan and Jake wrangle with hidden truths and suppressed feelings, they're forced to confront the ultimate Can the urgency of the mission defeat Jake's lifelong fears and allow him to open up about his terrifying history? This tale of suspense pulls readers into a world where the past is never truly buried, but the best rewards await those who dare to unearth it.",
  "genres": [
    "Crime"
  ],
  "author": "Dan  Garrett",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/211340052-the-sixteenth-grave"
}