{
  "title": "White Trash",
  "description": "It all started when someone called an African American toddler \"cute little niglet.\" White Trash was created in tribute to this unknown child. It has a hilarious cast and shocking storyline based on real people and true events in a small rural town in Texas. When Thia Franks returns to her home of Granby, Texas, the very place to which she’d vowed never to return, Granby’s worst and best elements force the new single mother to face both her past and her destiny. At first, it seems that nothing has changed: Chester Kennedy’s goats continue to run rampant through the town, Officer Tina Wolfe stands accused of racial profiling the growing Hispanic community, Thia’s gun-wielding neighbor believes a squirrel has it in for her, and the town’s local newspaper owner prints only what she believes the citizens should know. But when a young black man—an upstanding and popular citizen of the small, east-central Texas town—is brutally murdered, everything changes. Everyone is being watched. Everyone is being judged.White Trash is a fast-paced, laugh-out-loud book that also serves as a bitter social commentary on American hypocrisies and prejudices. As Thia Franks comes to terms with the murder, and the small police department works the biggest whodunit in Granby history, a startling underworld of domestic abuse, gunrunning, drug use, illicit sex, and child molestation is revealed. While the murder is horrendous and some of the citizens of Granby are appalling, many stand up for what is right, and the total package is endearing. You’ll want to read White Trash more than once in order to capture all of the tale’s insights as it neatly summarizes the reality of every American small town peopled with neighbors you can’t get away from, you can’t stop talking about, and you may not want to leave.",
  "genres": [
    "Humor",
    "Mystery"
  ],
  "author": "Alexandra  Allred",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/21170785-white-trash"
}