{
  "title": "How to Successfully Recover from Having Been Cheated On",
  "description": "Have you been cheated on and need to recover? Learn how to come to terms with having been cheated on. Understand why this happened to you, and the necessary steps you need to take to successfully move forward with your life - starting right now ... so this NEVER happens to you again. Are you the victim of a: • Cheating husband or boyfriend?• Cheating wife or girlfriend?• Your spouse's Midlife Crisis Affair?The answers you need to recover from this tragedy are here! If you've been cheated on, I know first-hand that words cannot possibly describe what you are feeling right now. The emotional pain ... the feelings of betrayal and abandonment ... they are so very foreign. You want to throw up ... every waking moment. How could this have happened? How could something like this have happened TO YOU? How could you possibly have deserved this? What do you do now? How do you move forward with your life when you feel this way ... about yourself? How can you let it all go? How can you possibly recover from THIS - the ultimate betrayal? And if you are married and/or have children with the person who cheated on you - what should you do? What if he or she is the sole breadwinner in the house? How do you deal not only with the cheater, but with the emotional and financial aftermath? These issues can be so overwhelming that you become a deer in the headlights ... frozen in time, and not knowing what to do next. But if you do nothing ... then just like the deer in the headlights, you stand an excellent chance of being run right over ... by the very person who has betrayed you. And you definitely don't want that to happen.Well - I am here to tell you that this was not your fault ... that you CAN and WILL get through this ... and that you will wind up being a better person as a consequence of the healing process that I'm going to take you through. It won't be easy ... it will take some time ... but I guarantee that if you follow my advice to the letter, and go through the entire process completely, and to the best of your ability ... then you absolutely will successfully recover from this infidelity. And - you will ultimately find the happiness that you do deserve.\"How to Successfully Recover from Having Been Cheated On\" will take you through a precise set of steps that will result in your complete recovery from this cheating disaster. You will learn: • SUSPECT infidelity? I'll show you how to be 100% certain whether it happened, or not.• WHY did this infidelity happen? To You??? There are actually a number of causes of infidelity, and many of them have NOTHING to do with you! We'll look at all of them.• Things you need to RECOGNIZE and ACCEPT before you can begin to move forward with your life, after having been cheated on.• 16 Actions You Should Take IMMEDIATELY to start getting yourself safely and quickly through all of this mess.You will also learn how to create your own personalized recovery plan, and document it for yourself - so that you continue to learn from your efforts, and fine-tune your actions over time ... so that this NEVER happens to you again. [Many people repeat the same mistakes, and never learn how to avoid the people and circumstances that lead to infidelity ... but that won't happen to you, if you follow the recovery plan I take you through in this book.] I am Gregory Smith, the author - and I'm also the Founder of midlifebachelor.com ... which since 2007, has coached and counseled thousands of people who have been the victims of midlife crisis affairs, extra-marital affairs, sexual addictions, boyfriend / girlfriend cheating, one-night stands, philandering, etc.",
  "genres": [],
  "author": "Gregory  Smith",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/21172522-how-to-successfully-recover-from-having-been-cheated-on"
}