{
  "title": "Climbing in Heels",
  "description": "Capturing the fast, furious—and, for the first time, female—dealmaking that gave us blockbuster movies and stars in the go-go 1980’s, first-time novelist Goldsmith Thomas takes the William Morris Agency as her setting, and rivalry, competition and power as her intertwined themes.It was called \"the boys club,\" and for years it was just that. The men had the offices, and the women serviced them – bringing coffee, answering phones, looking pretty, polite, subservient. But by the 80’s women were releasing themselves from cutting the bras and girdles and phone cords wrapped around their bodies; everything that tied them down, keeping them small. It wasn’t that their dreams were bigger or their opportunities more available. It was just their time. But the men didn’t yield easily.CLIMBING IN HEELS is the story of three women - Beanie Rosen, Ella Gaddy, and Lara Baxter – whose backgrounds were as unique as their talent, whose passion was as fierce as their rage, and whose unwillingness to settle for less in a world where less was expected rose with grit, stood on each other’s shoulders, balancing, stretching, reaching to touch the top. It was thick, that glass ceiling, and they only scratched the surface. But in scratching it they brought the biggest theatrical agency in the world, William Morris, to its knees. It’s also the story about how sometimes they became the very monsters they fought against.Beanie, Ella and Lara are more than ambitious—they’re quick-thinking (Beanie), devil-may-care (Ella) and calculating (Lara) predators. Colleagues, friends, sometime roommates and frequently frenemies, they manipulate an already cutthroat business to make places for themselves.Sexy, plot-rich, and full of the details that made the talent agencies businesses of fascination and front page news, CLIMBING IN HEELS brings all the swagger, customs and costumes of Los Angeles in the ‘80s to life. It’s like turning THE SEVEN HUSBANDS OF EVELYN HUGO inside out and discovering that the lives of the starmakers are even more gripping than the lives of the stars themselves.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical"
  ],
  "author": "Elaine Goldsmith-Thomas",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/211692045-climbing-in-heels"
}