{
  "title": "The Tragedy of Victory: On-the-spot Account of the Nigeria-Biafra War in the Atlantic Theatre",
  "description": "The Tragedy of On-the-Spot Account of the Nigeria-Biafra War in the Atlantic Theatre is a chronological narrative of the war that lasted from July 6, 1967 to January 15, 1970. With about 500 photographs and maps and facts, told with accuracy, the well-organised and efficient Third Marine Commandos, earlier commanded by Col. Benjamin Adekunle (with Lt. Col. G. Alabi-Isama, as the Chief of Staff) had already controlled the Atlantic coast from Bonny to Calabar before Col. Olusegun Obasanjo’s arrival as the new commander . This most revealing book is in three parts. The first part is an account of the author’s early life and his first encounter with the army. Under the watchful eyes of a mother who gave the best in moral education to a son of promise, Alabi-Isama’s life got shaped by a pre-destined career where the cap really fitted. The second part is about the real combat. It outlines, in detail, the strategies and tactics the commandos employed during the historic 480km trek from Calabar to Port Harcourt and narrates the hostile climate, terrain environment, health and survival hazards they had to surmount on the 30-day march. The think-tank, the mapping out of operations and disciplined control of men and materials by Alabi-Isama, the chief of staff, as well as the officers of 3 Marine Commando Division of the Nigerian army, sustained the Nigerian side of the conflict. This section concludes with the final successful push by the commandos into Uli-Ihiala, Biafra’s ‘centre of gravity,’ a move that ended the war following the surrender of Biafra. The third part is an expose on Obasanjo’s book, My Command. The author contests Obasanjo’s claims about the war as being inconsistent with the truth and maintains that it is a tragedy that the real fighters of the war for the unity of Nigeria had not been acknowledged to date. Rather, they wallow in poverty and are discredited by their military leaders who assumed political offices with all the accompanying largesse.The book is a rich manual, a repository of invaluable information, a document that gives a precise and veritable first-person account of the Nigerian civil war, in the Atlantic theatre. It is a must for every serving and retired member of the armed forces to own. Other Nigerians and international bodies will find it particularly useful in reconstructing the events of Nigeria’s civil war.",
  "genres": [
    "Africa",
    "History",
    "Nigeria"
  ],
  "author": "Godwin Alabi-Isama",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/21165527-the-tragedy-of-victory"
}