{
  "title": "The Colour Of Letters",
  "description": "PRAISE FOR GERALDINE RYAN-LUSH: *American Booksellers' Pick Of The Lists. *School Library Journal Review Pick. *Merit Magazine Studio Award. *Alcuin Society Design Award. Glowing Reviews From: Copley News Services, Washington, DC. School Library Journal, N.Y. London Free Press; CBC Radio; Books In Canada; Quill & Quire; The Observer, Montreal; Canadian Materials; Canadian Children's Literature; Canadian Library Association; The Toronto Star; Kitchener/Waterloo Record; The Evening Telegram. ABOUT THE COLOUR OF LETTERS: Jacqueline O'Rielly is a divorced and lonely teacher in St. John's, Newfoundland. Aleksandr Bovka (Sasha) is a handsome , married seaman from the Baltics who is not looking to have his world turned upside down when, shipwrecked, he finds himself staring across at her over the dingy expanse of tables at a harbourfront pub one misty November night. The ship is in port for just a week, and he must leave. But a week is long enough for him to realise he can't live without her. Broken-English letters over the undulating waves of the turbulent Atlantic keep their love alive-until the last one, the colour of tragedy.   Spanning a decade and three countries is this moving saga of interrupted, impossible love between two polar-opposites; of tragedy and choice; of ecstasy and promise; of bitterness and loss; of soulful,unadulterated passion between a man and a woman from opposite ends of the world, and a testament to the ultimate power of love forbidden.   EDITORIAL REVIEWS:   This book has something of a \"Bridges Of Madison County\" theme, but much better written. This author is a master of character development, plot , pacing, and place. This book is movie material, and has high international appeal, given the European flavour of the supporting characters Tatiana, and her father, Sasha, who at middle age, is the victim of a tortured love triangle on the other side of the ocean. So much happens! There is the accident, the cruel letter of goodbye, and a span of eight years, when one doesn't know where the other is. This agony keeps the pages turning. We want to know. We want, against all impossibles, for these two people to make it. During their long goodbye, Sasha realizes a hidden dream of becoming a painter. There is great depth to his character, and we understand what Jackie saw in him that first foggy night. Men AND women can enjoy this story, as it is told from both Jackie's and Sasha's perspective. Brilliant writing. The ending is beautiful, and we weep at the \"blessed christening of completeness.\" A magnificent read from a great storyteller.",
  "genres": [],
  "author": "Geraldine Ryan-Lush",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/21183001-the-colour-of-letters"
}