{
  "title": "100 Best Things to Do in Barcelona",
  "description": "Although Greek mythology mentions the origins of Barcelona to that of Hercules, fact shows the city was under the rule of Emperor Augustus and a strategic Roman colony.Today, Barcelona is considered one of the top destinations in Europe. The city is both a cultural Mecca and a paradox. It is a part of Spain but the Catalan culture is seeping in, so much so, that the Spanish language is frowned upon by its inhabitants. A little Catalan will go a long way in this haven of Joan Mirò, Gaudi and architecture gazing.Barcelona is the second largest city in Spain after Madrid and the capital of the province of Catalonia. The culture is not that of Castilian Spain since it was once an independent nation. Catalan is the main language spoken.From one neighborhood to the next, discover the architecture, museums filled with art and delightful festivals. So join in and make Barcelona a lifelong memory engulfed with history from the ancient Romans to the birthplace of Modernism and more recently, the new Renaissance now taking place.Recently, a more somber history has exposed itself from Barcelona as being the testing grounds for pre-WWII. Spain was isolated from the rest of the world. This piece of history is now being revealed in the many museums within the city.Since the Olympic games of 1992, the major reconstruction effort still continues and has revived its old quarters, created new luxurious hotels, revitalized its sea front and the entire infrastructure of the city. Ultimately, this effort has paid off and has made Barcelona a top-notched cosmopolitan destination.Barcelona is now being compared to New York and Paris with its own flavor. Art, history, music and more make for a jam-packed appreciation of this delightful city.Beginning with the 100 best things to do in Barcelona is the place to start ...",
  "genres": [],
  "author": "Tripify",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/21200926-100-best-things-to-do-in-barcelona"
}