{
  "title": "Cold War, Cool Medium: Television, McCarthyism, and American Culture",
  "description": "Conventional wisdom holds that television was a co-conspirator in the repressions of Cold War America, that it was a facilitator to the blacklist and handmaiden to McCarthyism. But Thomas Doherty argues that, through the influence of television, America actually became a more open and tolerant place. Although many books have been written about this period, \"Cold War, Cool Medium\" is the only one to examine it through the lens of television programming.To the unjaded viewership of Cold War America, the television set was not a harbinger of intellectual degradation and moral decay, but a thrilling new household appliance capable of bringing the wonders of the world directly into the home. The \"cool medium\" permeated the lives of every American, quickly becoming one of the most powerful cultural forces of the twentieth century. While television has frequently been blamed for spurring the rise of Senator Joseph McCarthy, it was also the national stage upon which America witnessed--and ultimately welcomed--his downfall. In this provocative and nuanced cultural history, Doherty chronicles some of the most fascinating and ideologically charged episodes in television history: the warm-hearted Jewish sitcom \"The Goldbergs\"; the subversive threat from \"I Love Lucy\"; the sermons of Fulton J. Sheen on \"Life Is Worth Living\"; the anticommunist series \"I Led 3 Lives\"; the legendary jousts between Edward R. Murrow and Joseph McCarthy on \"See It Now\"; and the hypnotic, 188-hour political spectacle that was the Army-McCarthy hearings.By rerunning the programs, freezing the frames, and reading between the lines, \"Cold War, Cool Medium\" paints a picture of Cold War America that belies many black-and-white clich?s. Doherty not only details how the blacklist operated within the television industry but also how the shows themselves struggled to defy it, arguing that television was preprogrammed to reinforce the very freedoms that McCarthyism attempted to curtail.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Tv",
    "American",
    "American History",
    "War"
  ],
  "author": "Thomas Doherty",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/212034.Cold_War_Cool_Medium"
}