{
  "title": "Bazoomerangs",
  "description": "A boomer ex-flower child still living like it’s 1969,a Gen X Buick-driving, religious Trumper,and a Gen Z twenty-year-old trans woman—all under one roof….What could possibly go right?Here’s what the book’s characters have to say:“I don’t mean to drive her crazy. It just comes naturally.”~Jaye, the youngest of the 3“Could’ve been worse. Wait…give me a minute…I’m trying to think of how it could’ve been worse.”~Starr, the oldest“And what’s your James up to?”“Oh, about six-two. Six-five with heels on.”~Alice and an acquaintanceVery deep yet laugh-out-loud funny, too, Bazoomerangs explores the goings-on inside the minds and in the lives of three generations of women. Following their thoughts, histories, interactions, and possible futures, we laugh at their dismay over not only their differences, but even more over their surprising similarities…that boomerang—even bazoomerang—through the generations.For Alice, the mom of the trans daughter, this is not a politically correct discourse on the trans realm, as her reaction overflows with fear, regret, confusion, angst, and misunderstanding. Her politics and viewpoints are quite a change for someone who was conceived at Woodstock and grew up in a chicken coop. Will she come around before it’s too late?Meanwhile, the daughter travels her journey of being trans as well as of accepting where her mother is. Follow all three on their personal paths, which take us places far from the expected, including lost dreams and new hopes, plus a prevailing familial love that overrides all differences.“If there’s anyone in the world I felt close to, it’s you, my one and only child. No, I didn’t know this. If this wasn’t you, then I have absolutely no idea who you are. I miss you—the you I thought I knew.”~AliceBazoomerangs*is a great primer for anyone unfamiliar with the transgender world.*is a wonderful book for trans folks to give to loved ones who don’t “get” it—they may gain more understanding.",
  "genres": [],
  "author": "Ann  Crawford",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/212007152-bazoomerangs"
}