{
  "title": "No Rest for the Dead",
  "description": "In this New York Times bestseller, twenty-six renowned thriller authors team up to create a first-rate serial novel—a collaboration that combines the skills of America’s greatest storytellers to produce a single gripping, spellbinding mystery.“The lineup of writers who have contributed to this mystery is akin to the Murderers’ Row of the 1927 New York Yankees. There is not a weak spot in the bunch.” —David Baldacci, from the Introduction  Alexander McCall Smith. Sandra Brown. Faye Kellerman. J.A. Jance. Jeffery Deaver. Kathy Reichs. Lisa Scottoline. Jeff Lindsay. These are only a handful of the names that make up the all-star lineup of authors behind No Rest for the Dead, a tale of vengeance, greed, and love that flows seamlessly, in the words of David Baldacci, “as it passes from one creator’s mind to the next.” When Christopher Thomas, a ruthless curator at San Francisco’s McFall Art Museum, is murdered and his decaying body is found in an iron maiden in a Berlin museum, his wife, Rosemary, is the primary suspect, and she is tried, convicted, and executed. Ten years later, Jon Nunn, the detective who cracked the case, is convinced that the wrong person was put to death. In the years since the case was closed, he’s discovered a web of deceit and betrayal surrounding the Thomases that could implicate any number of people in the crime. With the help of the dead woman’s friend, he plans to gather everyone who was there the night Christopher died and finally uncover the truth, suspect by suspect. Solving this case may be Nunn’s last chance for redemption…but the shadowy forces behind Christopher’s death will stop at nothing to silence the past forever. In this innovative storytelling approach, each of these twenty-five bestselling writers brings their distinctive voice to a chapter of the narrative, building the tension to a shocking, explosive finale. No Rest for the Dead is a thrilling, page-turning accomplishment that only America’s very best authors could achieve.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Audiobook",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "Andrew Gulli",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/11221793-no-rest-for-the-dead"
}