{
  "title": "PLAY HIM PLAY HER: A Psychological Thriller Series",
  "description": "Secret Window meets Deep Water in this \"irresistible domestic drama\" (Booklist, Utah) from the award-winning author of No Good Lie and the Detective Temeke Crime Series, in which a woman's death reveals the perilous sacrifices an actor makes—and the secrets he keeps—in the pursuit of fame.If all the world's a stage, who can you really trust?Celebrity actor Zane Osborne plays London’s renowned plastic surgeon and secret serial killer, Ethan Holloway, in the hit series Play Him, Play Her. Zane’s wife Lilja, former chef and 39-year-old mother, simply wants to live out her dream of starting a restaurant. None of the perks of fame make up for Zane treating her coldly, drinking too much, and neglecting his family. When Lilja discovers Zane is having an affair with his assistant Nic, the polished facade of their life splits wide open.Zane’s process of method acting has often resulted in the entanglement of his life with Holloway’s, and as the lines between reality and script blur beyond recognition, Zane loses sight of not only who he is, but what he has done. When Nic goes missing after his birthday party, a popular podcast speculates Zane is the prime suspect. As Lilja fears for her and her daughter’s safety and Zane struggles to detach his identity from his character’s, they will have to discover if it’s possible for Zane to play an adulterer and a serial killer without becoming one himself.Told in dual points of view, PLAY HIM, PLAY HER combines the toxic relationships of The Wife Upstairs by Rachel Hawkins meets the propulsive suspense of A Good Marriage by Kimberly McCreight.Praise for PLAY HIM PLAY HER‘Filled with tension, it draws you in from the very first paragraph. A psychological thriller of the very best.’ – KRISTIN GLEESON, USA Today bestselling author of the Women of Ireland series.‘Seriously good! So unique and sophisticated. It’s a ready-made skip straight to Netflix!’– B.A. MORTON, Bestselling author of the Detectives Fuller & Harte series.",
  "genres": [
    "Psychological Thriller"
  ],
  "author": "Claire Stibbe",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/212188917-play-him-play-her"
}