{
  "title": "BARBAROSSA THE PIRATE: English Edition",
  "description": "A forgotten manuscript, buried for centuries in the crypt of a remote and isolated monastery in the island of Kithira, brings to light the bloodstained 'course' of the pirates, brothers Barbarossa.From a small and insignificant fishermen's village in Lesvos to the Sultan's courts in Constantinople and from the dark and humid dungeons of the Venetian castles to the luxurious palaces in Algiers and northern Africa, this story - of the most unrelenting pirates of the Mediterranean - spins forcefully like a tornado and carries the reader away. It transports him to a historical era where he can breathlessly watch ruthless but gallant fortune - hunters, conspirator leaders and insidious representatives of the Church.History interweaves with fiction forming an 'exuberant' canvas of vivid pictures about passion and revelation. Characters are successfully revealed and their passions and weaknesses are unveiled and exposed. In this novel, the writer (George Leonardos), through his thorough and meticulous research of historical facts, his ability to create a 'myth' and his explicitness, achieves to entice, lure and fascinate his readers. He manages to transform an historical text into a striking historical novel. The whole drama of the struggle for survival in medieval southern Europe is enlivened once more in the pages of his novel shedding light to the murk side of conventional truths that schools teach students about. Good people become evil, evil ones prove they have emotions and weaknesses. Pirates become admirals, leaders and people of high ranks and titles. At the same time kings and noblemen are transformed into base, vile and vicious schemers and unreliable conversant.Arouz and Hayredin Barbarossa, Andrea Doria, Suleiman the Magnificent Francois of France, Isabella of Spain and a few others are some of the characters of the book which having been dispossessed of their historical 'attributes' are metamorphosed into active and vigorous personalities. With their rivalry, antagonism, hatred, passion for power and authority, corruption, assassinations, and criminal acts but also with their sagacity and military wisdom carve the material which makes this last work of the writer stand out as an exciting and irresistible novel.Through the pages of this book, it also emerges the colossal struggle of the inhabitants of the islands of the Aegean and the Ionian Seas to defend and protect their families and their meager possessions from the lethal raids of the pirates of the open seas as well as the voracity and insatiate thirst of the despots of the state fleets at that time. Greeks and Turks, Christians and Moslems, Berbers, Venetians, Genovese, Spaniards and French all participate in a frenetic dance of plunder and looting, manslaughter and slavery. The ravage of the island of Kithira, the massacres in Crete, the assails in Aegina, Chios, Paros and Naxos, the fatal conflicts on the coastline of northern Africa and the coasts of Italy breathe life once more with the frantic rhythm of modern American movie productions. The reader experiences the events, empathizes with the heroes and shares their agony, their enthusiasm and their despair. Barbarossa, the hero in this book, abandons the dusty shelves of history and guides us with a unique and direct way to the years of anarchy, despotism, terror and Piracy.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "George Leonardos",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/21208264-barbarossa-the-pirate"
}