{
  "title": "Drowning in the Shallow End",
  "description": "A confessional real life memoir about a secret obsession, revealing the depths to which people can sink, before they realise they’re in too deep… For years, all Charlie Mellor wanted was to meet the alluring Pennie Fenton. Unfortunately for him, this wish came true. Captivation with the corrupting Miss Fenton quickly developed into an overpowering obsession which sent his life spiralling out of control and jeopardised everything he held dear. It was because of Miss Fenton that he turned his back on his wife and children, lost touch with his friends, got involved with the occult, upset members of the Greek Underworld and even volunteered one of his own fingers to be crushed by a sadistic stranger. Before he could free himself from her curious charms, he would need to uncover her real identity and expose the deep, dark secret she had kept hidden from him. Only then, would he find the courage to rebuild himself through a bizarre appearance on national television, where in front of millions of viewers, he’d abandon all dignity and reveal the full extent of his downfall. This candid tale chronicles one man’s epic struggle to free himself from a cruel and manipulative companion. Peppered with black humour, it unveils the damaging impact of any unyielding obsession. The memoir taps into the universal themes of human desire, infatuation and compulsive behaviour and is positioned as a tale of psychological intrigue. It includes irreverent observations on love, loss and the enormous void between these two. Only by the end of the book do readers see that nothing is quite what it seems and this is in fact, a modern day parable about the redeeming power of love. ‘Amusing and engaging. Full of intrigue… the hints at the drama to come work well to build to… an absolute shock for the reader. The twist in the plot is both clever and unexpected’.‘Quirky, funny and surprisingly touching’.'Mellor writes with a deft hand, his offbeat comedy has a light, wry touch, combined with a self-depreciating sense of irony that is utterly endearing’.‘Conclusive proof that the truth really is stranger than fiction’.‘An excellent narrative, one that is controlled and skilful’. ‘Cohesive and heartfelt… a confident and well-crafted memoir’.If you like well written memoirs with a dark twist in the tale, you'll enjoy reading Drowning in the Shallow End.",
  "genres": [
    "Amazon"
  ],
  "author": "Charlie Mellor",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/21221669-drowning-in-the-shallow-end"
}