{
  "title": "The Vampire Nemesis and Other Weird Stories of the China Coast",
  "description": "- Annotated - Unique online edition- Full navigation\"Dracula meets Edgar Allen Poe\" describes this early classic Vampire legend, since it matches up a traditional neck-biting, blood-sucking monster with back-stories of love, betrayal and the quest for grisly revenge. \"Vampire Nemesis\" was written in 1905, a scant eight years after Dram Stoker's \"Dracula,\" and it shows strong elements of that influence. To add to the intrigue, the scene of the action is set along the British-colonized coast of China with an element of exotic Asian mystery. The three other accompanying stories deal with vampire-like happenings in the same region. Written five years after Sigmund Freud's \"Interpretation of Dreams,\" they, like \"Vampire Nemesis,\" are psychological thrillers that require the reader to decide what is real and what is imagined in the mind of the narrator. \"Death-Grip\" deals essentially with a vampire of the mind who uses hypnosis to lure his prey. Appropriate for the genre, love and horror mesh, innocence and depravity are in conflict, and all is not as it seems. \"Cerberus\" is the tale of a vampire disguised in animal form, who takes advantage of a human weakness for hallucinogenic drugs. \"The 'Leonid' \" serves up the highest body count of all, as a meteorite crashes into the South China Sea near a merchant ship. To tell more would spoil the horrific surprise.This public domain title, printed in 1905, has been mediated by hand and compared through human intervention, page by page, against the original print edition in order to eliminate character errors typically generated in OCR editions. For accuracy we have retained British forms of spelling (”realise,” “ardour,” “pretence”) and verbatim conventions of early 20th-century orthography (”to-day,” “river-side,” “for ever”), but we have corrected a small number of obvious typographical errors found in the original.",
  "genres": [],
  "author": "Dolly",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/21218683-the-vampire-nemesis-and-other-weird-stories-of-the-china-coast"
}