{
  "title": "The Assassins' Village",
  "description": "THE DIANA RIVERS SERIES The Assassins’ Village #1 in Women Sleuths - an Awesome Indie novel #1Noir, #1 Crime #2Vigilante Justice #5Series The Surgeon’s Blade #1 in Suspense & Psychological thrillers - an Awesome Indie novel Children of the Plantation #2 in Suspense & Mystery. Camera Action...Murder! Childhunt! an Awesome Indie novel A Deadly Learning A Brutal Trade “The Assassins’ Village”introduces, Diana Rivers, writer, sometime actor and amateur sleuth. NB. Although the Diana Rivers mystery suspense murder novels are a 'series', they can be read in any order. When an expatriate theatrical group gather to discuss their next play there will be murder. A blackmailer stalks their picturesque Cypriot village. The group is riven with jealousies, rivalry, sexual tension and illicit affairs. Unbeknown to each other they all attempt to find solutions to their problems. Some believe it lies in murder. Can they find the blackmailer? And can they find that all important ‘little black book’ – the chronicle of their misdeeds. A body is discovered and Diana turns detective to draw up a suspects list. After the police get involved one of the suspects is found hanged – is this another murder or suicide? Was he indeed hanged? A visit to a villager’s home uncovers an ancient assassin’s device. Could this be the murder weapon? Is it possible that an assassin lives at the heart of this formerly peaceful and idyllic mountain village? Love, hate, murder and high drama all feature in this classic historical detective story. With a long list of suspects, some dramatic twists and the odd red herring, the reader is left guessing until the final curtain. (Approx 93,000 words). Other books include; Historical Romance & The Seeds of Time (Book 1 in the Crossing series). Harvest (Book 2 in the Crossing series). (The Very Affair Series) A Very French Affair A Very English Affair On Christmas Hill ~ A Seasonal Affair **A NEW Christmas romance due out in Nov/Dec 2104 Psychological Thriller 'Dark Minds' Series On Devil's Brae Behind a Twisted Smile (November 2014) Sandstorm in my Heart The Bamboo Mirror Thank you & I sincerely hope you enjoy your read.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Suspense",
    "Crime",
    "Mystery Thriller"
  ],
  "author": "Faith Mortimer",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/11222190-the-assassins-village"
}