{
  "title": "Cold War Canada: The Making of a National Insecurity State, 1945-1957",
  "description": "Canadians might expect that a history of Canada's participation in the Cold War would be a self-congratulatory exercise in documenting the liberality and moderation of Canada set against the rapacious purges of the McCarthy era in the United States. Though Reg Whitaker and Gary Marcuse agree that there is some evidence for Canadian moderation, they argue that the smug Canadian self-image is exaggerated. Cold War Canada digs past the official moderation and uncovers a systematic state-sponsored repression of communists and the Left directed at civil servants, scientists, trade unionists, and political activists. Unlike the United States, Canada's purges were shrouded in secrecy imposed by the government and avidly supported by the RCMP security service. Whitaker and Marcuse manage to reconstruct several of the significant anti-communist campaigns. Using declassified documents, interviews, and extensive archival sources, the authors reconstruct the Gouzenko spy scandal, trace the growth of security screening of civil servants, and re-examine purges in the National Film Board and the trade unions, attacks on peace activist James G. Endicott, and the trials of Canadian diplomat Herbert Norman. Based on these examples Whitaker and Marcuse outline the creation of Canada's Cold War policy, the emergence of the new security state, and the alignment of Canada with the United States in the global Cold War. They demonstrate that Canada did take a different approach toward the threat of communism, but argue that the secret repression and silent purges used to stifle dissent and debate about Canada's own role in the Cold War had a chilling effect on the practice of liberal democracy and undermined Canadian political and economic sovereignty.",
  "genres": [
    "History",
    "Canada"
  ],
  "author": "Gary Marcuse",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/212077.Cold_War_Canada"
}