{
  "title": "Three",
  "description": "This is the first story in the scorching THREE series! (Note that the THREE series (including this story) is available at almost the same price as this one story in the THREE HAPPY ENDINGS boxed set.) Hot steamy dreams... a handsome stranger... and his two brothers... all add up to an exciting adventure she'll never forget. Lori's steamy dreams about a hot hard stranger are hitting fever pitch. She needs way more than eye contact and a smile across a crowded subway station. An instant connection sizzled between them and now Lori, who's never believed in love at first sight, is its helpless victim. When Lori goes to her best friend's cabin for the weekend to spend time with Marie, her new husband and his brothers, she's surprised to wind up face-to-face with her fantasy stranger. But he's Marie's husband! When she meets his brothers, however, she finds that there just might be a way to make her dream come true. Now Lori is experiencing her wildest fantasy yet, three gorgeous, muscular men all focused on her. But she wants more than a steamy dream brought to life. Because she's in love. But can her handsome stranger return her love? This intriguing short story is scorching hot, with more than one handsome hunk to bring your wildest fantasies to life. Consider yourself warned! ~ ~ ~ Praise for Opal's 4.5 Stars! \"...there are a lot of twists to this roller coaster ride of a story... A scorcher of a read, I was unable to put this one down.\" Sensual Reads 4.5 Kisses! \"another blazing hot romance not to be missed by Opal Carew. Once I started this book, I just couldn't put it down... [her] story-writing talent shines through... one wild ride of a book that just whets my appetite for more by Opal Carew!\" Victoria, TwoLips Reviews 4.5 Blue Ribbons! \"a blazing hot romp... A fabulously fun and stupendously steamy read for a cold winter's night. This one's so hot, you might need to wear oven mitts while you're reading it!\" Romance Junkies 4 Cups! \"There is little chance of reading anything more stimulating than a book by Opal Carew.\" Lototy, Coffee Time Romance & More \"Opal Carew is a genius at spinning the most [steamy] stories by tapping into forbidden fantasies and visiting emotions that bring the characters literally to their knees. A steamy-hot read! WOW!\" Mandy Burns, Fresh Fiction\" Be prepared for an all out sensual feast.... sizzling.... Step outside of the ordinary for something adventuresome....\" Romance Reviews Today ~ ~ ~ Opal Carew is a New York Times and USA Today bestselling author of poignant contemporary and sci-fi romance. Her books have won several awards, including the National Readers’ Choice Award (twice), the Golden Leaf Award (3 times), the Golden Quill (4 times), the CRA Award of Excellence, and Silken Sands. Opal writes about passion, love, and taking risks. Her heroines follow their hearts and push past the fear that stops them from realizing their dreams… to the excitement and love of happily-ever-after.   Opal loves nail polish, cats, crystals, dragons, feathers, pink hair, the occult, Manga artwork, Zentangle, and all that glitters. She grew up in Toronto, and now lives in Ottawa with her husband, huge nail polish collection, and five cats.",
  "genres": [
    "Menage",
    "Erotica",
    "Romance",
    "Erotic Romance",
    "Adult",
    "Contemporary Romance",
    "Family"
  ],
  "author": "Opal Carew",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/11222192-three"
}