{
  "title": "Honeysuckle and Bone",
  "description": "On the run from her own dark secrets, a teen girl becomes the nanny for a prestigious family on their extravagant Jamaican estate—but things aren't quite as they seem, and she quickly discovers even paradise may be haunted.   Carina Marshall is looking to reinvent herself, and what better place to do it than Jamaica, her mother’s alluring homeland where she conveniently has access to an au pair gig for the wealthy and politically powerful Hall family. After months of being the target of vicious rumors and hate online (which she just might deserve), the luxurious Blackbead House seems to hold everything she wants, a world of mango trees, tropical breezes, and glamorous parties—and a place to disappear. Once there, Carina joins up with her fellow junior staff members, the self-named Young Birds, and finds herself sinking right into her busy, but comfortable, new life. Yes, the Halls run a tight ship, and yes, there is some tension amongst the family, but she’s content flying under the radar, doing her job, and hanging out with her new friends—not least, the handsome and charming Aaron. But when inexplicable things start happening to her in the house, only getting worse each night, Carina realizes that someone—or something—is out to get her. Is it the house itself? The Halls? Or, worse, is it her own past catching up with her? With the help of Aaron, she must figure out what is haunting her, and fast, before she is forced out of Blackbead House for good.   Eerie, propulsive, and full of intrigue, Honeysuckle and Bone is a deliciously atmospheric, young adult novel, following an imperfect yet courageous teen as she seeks to remake herself in the homeland she always idealized, only to discover that new beginnings don’t always come easy.",
  "genres": [
    "Horror",
    "Young Adult",
    "Fantasy",
    "Paranormal",
    "Gothic",
    "Thriller",
    "Fiction"
  ],
  "author": "Trisha Tobias",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/212203126-honeysuckle-and-bone"
}