{
  "title": "The Devil Himself",
  "description": "Growing up, I spent every night tucked under my mother’s arm, dreamily listening to tales from her favorite book series—Legend Has It by Darby Donovan, a collection of spooky folklore about a town called Glenshire and the lonely, gray-eyed fairy prince who haunted the woods there. I knew they were just stories, but when my mother died and left me in the care of my cold, abusive father, that fictional fairy prince suddenly became very, very real to me. It was as if he was always there, hiding in the shadows, offering me his silent comfort. I turned him into an imaginary friend when I needed one most. And thirteen years later, I’m doing it again. When my coastal Irish town is bombed by the new Russian president, a Bratva leader seeking revenge on the United Irish Brotherhood, those missiles destroy everything I’ve ever known—my home, my family, and evidently my sanity—because when I pull an injured Russian Navy officer out of the sea, a man who led the charge against my town, I can’t bring myself to let him die. Secluded together in my secret hiding spot, we’re safe from the Mafia war raging outside, but the overwhelming connection I feel to this stranger is a battle I fight every single day. I hate him with everything that I am, but when he looks at me with those smoky gray eyes, all I see is my friend. When he touches me, all I feel is desire. And when he wraps his lips around the sustenance I offer him, all I want is to feel them pressed against mine, loving me, putting me back together. But no one can live in a fantasy world forever, and when reality finally finds us, the truth about him is worse than anything I could have imagined. The man I rescued is no fairy prince. He’s the goddamn Devil himself. AUTHOR'S NOTE: The Devil Himself is a continuation of Devil of Dublinand is not intended to be read as a standalone. It contains the same dark themes, graphic violence, and explicit content as Book 1, but if you have questions about specific subject matter, a comprehensive content warning can be found on my website. Thank you, and enjoy!",
  "genres": [
    "Dark Romance",
    "Mafia Romance",
    "Romance",
    "Enemies To Lovers",
    "Romantic Suspense",
    "Dark",
    "Ireland"
  ],
  "author": "B.B. Easton",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/212164011-the-devil-himself"
}