{
  "title": "The Myth Of Alzheimer's: What You Aren't Being Told About Today's Most Dreaded Diagnosis",
  "description": "Dr. Peter Whitehouse will transform the way we think about Alzheimer’s disease. In this provocative and ground-breaking book he challenges the conventional wisdom about memory loss and cognitive impairment; questions the current treatment for Alzheimer’s disease; and provides a new approach to understanding and rethinking everything we thought we knew about brain aging.The Myth of Alzheimer’s provides welcome answers to the questions that millions of people diagnosed with Alzheimer’s disease – and their families – are eager to Is Alzheimer’s a disease?What is the difference between a naturally aging brain and an Alzheimer’s brain?How effective are the current drugs for AD? Are they worth the money we spend on them?What kind of hope does science really have for the treatment of memory loss? And are there alternative interventions that can keep our aging bodies and minds sharp?What promise does genomic research actually hold?What would a world without Alzheimer’s look like, and how do we as individuals and as human communities get there?Backed up by research, full of practical advice and information, and infused with hope, THE MYTH OF ALZHEIMER’S will liberate us from this crippling label, teach us how to best approach memory loss, and explain how to stave off some of the normal effects of aging.Peter J. Whitehouse, M.D., Ph.D., one of the best known Alzheimer’s experts in the world, specializes in neurology with an interest in geriatrics and cognitive science and a focus on dementia. He is the founder of the University Alzheimer Center (now the University Memory and Aging Center) at University Hospitals Case Medical Center and Case Western Reserve University where he has held professorships in the neurology, neuroscience, psychiatry, psychology, organizational behavior, bioethics, cognitive science, nursing, and history. He is also currently a practicing geriatric neurologist. With his wife, Catherine, he founded The Intergenerational School, an award winning, internationally recognized public school committed to enhancing lifelong cognitive vitality.Daniel George, MSc, is a research collaborator with Dr. Whitehouse at Case Western Reserve University in Cleveland, Ohio, and is currently pursuing a Doctorate in Medical Anthropology at Oxford University in England.“I don’t have a magic bullet to prevent your brain from getting older, and so I don’t claim to have the cure for AD; but I do offer a powerful therapy—a new narrative for approaching brain aging that undercuts the destructive myth we tell today. Most of our knowledge and our thinking is organized in story form, and thus stories offer us the chief means of making sense of the present, looking into the future, and planning and creating our lives. New approaches to brain aging require new stories that can move us beyond the myth of Alzheimer’s disease and towards improved quality of life for all aging persons in our society. It is in this book that your new story can begin.\" -Peter Whitehouse, M.D., Ph.D.",
  "genres": [
    "Nonfiction",
    "Medical",
    "Medicine",
    "Health",
    "Neuroscience"
  ],
  "author": "Peter J. Whitehouse",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/2121372.The_Myth_Of_Alzheimer_s"
}