{
  "title": "When The Edelweiss Flowers Flourish",
  "description": "FIRST ENGLISH TRANSLATION OF RENOWNED SOVIET SCIENCE FICTION WRITER. ORIGINAL PUBLISHED 1969 A spectacular insight into life in the Soviet Union in the late 1960's made all the more intriguing by its setting within the Sovet Republic of Kyrgyzstan. The story explores Soviet life, traditional Kyrgyz life and life on planet Earth through a Science Fiction story based around an alien nations plundering of the planet for life giving herbs. The author reveals far sighted thoughts and concerns for conservation, management of natural resources and dialogue to achieve peace yet at the same time shows extraordinary foresight with ideas for future technologies and the progress of science. The whole style of the writing gives a fascinating insight into the many facets of life in a highly civilised yet rarely known part of the world. Communism and local traditions are explored on many levels to show both the positive and negative aspects as the main story revolves around the principle character of a young man named Melis. His exploits in training to become a shepherd, develop his relationship with his true love Rena and his encounters with Aliens from a far of world invading his beloved mountains leads to a story that gallops along similar to a wild Kyrgyz stallion. The English translation was undertaken by the authors niece in the Scottish literary centre of Edinburgh. Reviews: Peter Wullen: I think it is a very enchanting book. I don't even think this is science fiction. It's kind of dreamlike! I would even call it a religious or mystic novel and this in times of communism. I did read some echoes of Manas too. The description of the beauty of the Ala Too mountains and lake Song Kul are just great. Ian Claytor: ....an interesting read in itself especially for aficionados of the genre, something that can be fascinating to someone who knows something about the subject - the geography, the history or the culture, which help to bring some of the details to life.",
  "genres": [],
  "author": "Begenas Sartov",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/21209088-when-the-edelweiss-flowers-flourish"
}