{
  "title": "Тютюн",
  "description": "Първо издание на оригинала.През 1946 г. е отпечатан първият откъс от романа „Тютюн“ („Литературен фронт“, № 2, 28.09.1946), озаглавен „Тютюнев склад“. 2 години по-късно излиза нов откъс — „Двубой“ („Литературен фронт“, №20, 31.01.1948), след още 1 г. — „Тютюн“ (глава от роман) в сп. „Септември“ (1949, № 7). През 1951 романът е завършен окончателно, предаден в издателство „Народна култура“ и в края на 1951 стига до читателите и до своите „злополучни критици“.„Тютюн“ се оказва не само един от най-четените романи в българската литература, но и спъни-камъкът на българската марксическа критика. Популярността му напуска романовото пространство и обсебва всичко за и около творбата. Започнал с тридневното „обсъждане“ на „Тютюн“ (8, 11 и 13.02.1952) в СБП, спорът се пренася в периодичния печат („Лит. фронт“, № 10. б.03.1952, и № 11, 13.03.1952) и кулминира в редакционната статия на в. „Работническо дело“ — „За романа `Тютюн` и неговите злополучни критици“ (16.03.1952) — спор не толкова за достойнствата на романа, колкото за границите и възможностите на догматичното литературоведско мислене.Единодушно изказаното мнение, че „Тютюн“ се нуждае от „преработване“, настойчивите подканвания, дългите обсъждания и оказаният натиск карат Димитър Димов, макар и с неохота, да се съгласи да промени романа си, като разшири описанието на работническия свят и въведе нови герои; това увеличава обема на книгата с нови 250 страници. Работата по II редакция протича съвместно с ангажирания от изд. „Народна култура“ литературен критик Яко Молхов — редактор и помощник на Димов през 1953 г., а през 1954 г. „Тютюн“ се появява в новия си вид. През 1955 излиза III издание на романа, в което Д. Димов извършва допълнигелни поправки върху текста, но и в двата случая литературната критика предпочита да се дистанцира от категорични преценки. В крайна сметка „Тютюн“ заживява в новия си вариант и едва през 1992 се появява отново в първоначалния си образ.В различните си редакции „Тютюн“ е роман и за ужасната самотност на личността в капиталистическото общество, за огромния натиск на живота върху нравствените принципи в света на капитала, и за историческата обреченост на олигархиите в България, за социалнопсихологическите причини за тяхната гибел; роман и за потиснатите от монопола на тези олигархии, за техните икономически и политически борби, и за сложния психологичен лабиринт на човешките взаимоотношения както в зловещия свят на „Никотиана“`, така и извън него. Романът е екранизиран през 1961 (режисьор Н. Корабов). До 1962 година целият роман е преведен на 10 езика (китайски, латвийски, немски, полски, румънски, руски, словашки, украински, унгарски и чешки), а части от него са преведени на английски, арабски, есперанто, испански, италиански и френски.",
  "genres": [
    "Bulgarian Literature",
    "Classics",
    "Fiction",
    "School",
    "Historical Fiction",
    "Bulgaria",
    "Historical"
  ],
  "author": "Dimitar Dimov",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/2124105._"
}