{
  "title": "Lies My Teacher Told Me: Everything Your American History Textbook Got Wrong",
  "description": "The national bestseller and winner of the American Book Award, thoroughly updated for the first time since its initial publication to include textbooks written since 2000 and featuring a new chapter on what textbooks get wrong about 9/11 and Iraq.Since its initial publication in 1995, Lies My Teacher Told Me has gone on to win an American Book Award and the Oliver Cromwell Cox Award for Distinguished Anti-Racist Scholarship, and to sell one million copies in its various editions.What started out as a survey of the twelve leading American history textbooks has ended up being what the San Francisco Chronicle calls \"an extremely convincing plea for truth in education\" beginning with the pre-Columbian period and ranging over characters and events as diverse as Reconstruction, Helen Keller, the first Thanksgiving, and the My Lai massacre.In this revised and updated edition, James Loewen surveys six new high school history textbooks written since the first edition of Lies was published. In his inimitable style, he adds material to each chapter noting where the new books have gotten more accurate and where they are still fatally flawed. Loewen also writes at length about the way these textbooks treat the 2001 terrorist attacks and our \"response\" in Iraq. In fact, while researching this new edition Loewen made the front page of the New York Times in 2006 when he discovered that publishers were passing off as original virtually identical passages on important recent events in a number of history books. And in yet another example of the failure of American history textbooks, he found that \"celebrity\" historians whose names appear as authors in some cases have never read, let alone written, the texts attributed to them.",
  "genres": [
    "History",
    "Nonfiction",
    "Education",
    "Politics",
    "American History",
    "Historical",
    "Teaching"
  ],
  "author": "James W. Loewen",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/2124441.Lies_My_Teacher_Told_Me"
}