{
  "title": "The CIA at War: Inside the Secret Campaign Against Terror",
  "description": "With the CIA at the core of the war on terror, no agency is as important to preserving America's freedom. Yet the CIA is a closed and secretive world-impenetrable to generations of journalists-and few Americans know what really goes on among the spy masters who plot America's worldwide campaign against terrorists.Only Ronald Kessler, an award-winning former Washington Post and Wall Street Journal investigative reporter, could have gained the unprecedented access to tell the story. Kessler interviewed fifty current CIA officers, including all the agency's top officials, and toured areas of the CIA the media has never seen. The agency actively encouraged retired CIA officers and officials to talk with him as well. In six years as director, George J. Tenet has never appeared on TV shows and has given only a handful of print interviews, all before 9/11, but Tenet agreed to be interviewed by Kessler for this book. He spoke candidly and passionately about the events of 9/11, the war on terror, the agency's intelligence on Iraq, and the controversies surrounding the agency.The CIA at War tells the inside story of how Tenet, a son of Greek immigrants, turned around the CIA from a pathetic, risk averse outfit to one that has rolled up 3,000 terrorists since 9/11, was critically important to winning in Afghanistan and Iraq, and now kills terrorists with its Predator drone aircraft.The book portrays Tenet as a true American hero, one who overcame every kind of Washington obstacle and the destructive actions of previous director John Deutch to make the agency a success. As Tenet said in a recent speech, \"Nowhere in the world could the son of an immigrant stand before you as the director of Central Intelligence. This is simply the greatest country on the face of the earth.\"The CIA at War discloses highly sensitive information about the CIA's unorthodox methods and its stunning successes and shocking failures. The book explores whether the CIA can be trusted, whether its intelligence is politicized, and whether it is capable of winning the war on terror. In doing so, the book weaves in the history of the CIA and how it really works. It is the definitive account of the agency.From the CIA's intelligence failure of 9/11 to its critical role in preventing further attacks, The CIA at War tells a riveting, unique story about a secretive, powerful agency and its confrontation with global terrorism.",
  "genres": [
    "History",
    "Espionage",
    "Nonfiction",
    "War",
    "Terrorism",
    "Research",
    "Military Fiction"
  ],
  "author": "Ronald Kessler",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/212440.The_CIA_at_War"
}