{
  "title": "A Warrior's Redemption",
  "description": "Our story begins with a boy named Roric. Raised sheltered in the countryside he is ill prepared for the event of watching his family die violently, only to then see his entire world crumble as everything he thought he knew is turned to fantasy and he is forced to find himself chained into the life of a slave. A slave struggling to survive in the gladiatorial arena where every match means death for someone, but he survived and one day he escaped. A Warrior's Redemption is the tale of one man's journey from being a slave to becoming a warrior, who changes the fate of an entire world. It is a story of intrigue, honor, passion and the hope of redemption that is available to all and not just in fantasy. In the story we follow Roric, as he becomes a man and then a leader and eventually a legend. This book is but the beginning of an epic fantasy saga that spans five books in length. The underlying message of, A Warrior's Redemption, is the story of life that many of us face, but few choose to except. A hero of the people grapples with the long held secrets of his family and unlike his father before him, decides to fight so that his people can remain free. He rises above his humble past to become a leader that inspires a nation in its fight for survival and becomes a legend beyond the realms of fantasy. - EXCERPT - The marketplace was filled with tradesmen hawking their goods. Prospective buyers filled out the rest of the market’s space. My attention throughout the walk from the cell had been drawn to a woman ahead of me. She would have been quite attractive, if it hadn’t been for the hard lines etched deeply into the skin around her mouth and eyes. She had a mean look about her, too. She held a baby in her left arm almost carelessly, while her right hand gripped the forearm of a young girl that walked beside her. The girl’s cinnamon red hair hung all the way to her waist. She was sure to be noticed by the whore buyers, even though she had yet to show the maturity of a grown woman. Something told me that these two must have been the two I had overheard the night before. A sudden disturbance off to our left caused them and the guards to all turn and glance over in that direction. I kept walking forward though. I’m not sure what possessed me to do what I did, but it felt like the right thing to do and I didn’t question my actions any further than that. My manacled hands separated apart and, as her face was turned to the side, I raised a fist and swung hard at the girl’s head. I intentionally sideswiped her left cheek with the chunky metal protrusion of the manacles binding my hands, instead of with my whole fist. Blood spurted from where the edge of my rough manacles caught her high on the cheekbone and lower down on the cheek, ripping the flesh badly. The force of the blow, even though I had pulled the majority of the strength behind the punch off to the side, knocked her forwards breaking her mother’s hold on her arm. She fell heavily into a muddy puddle of water, which splashed all over her, dowsing her in the dirty water of the marketplace gutters. Complete shock at the unjustified hit had widened her eyes in a questioning gaze, as she looked up at me from where she lay in the muddy water. Blood trickled down her face in abandon and I mouthed two words. “I’m sorry!” I had barely gotten the words out when I was slammed to the ground from behind by the guards. I was only pulled back up to my feet after I had been kicked and whipped several times savagely. My aggressive actions got me placed in a group of other surly individuals, who were unified in their dislike of me. Hitting a woman was bad, a girl worse and a fellow slave even worse. No matter, I didn’t regret what I had done. They just didn’t understand. Now the only thing the girl would be selected for was a field laborer, which from having overheard the conversation I had last night that was exactly what",
  "genres": [
    "Fantasy",
    "Christian",
    "Christian Fiction",
    "Adult",
    "Amazon",
    "Historical"
  ],
  "author": "Guy S. Stanton III",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/21235941-a-warrior-s-redemption"
}