{
  "title": "Six Days in Bombay",
  "description": "From the New York Times bestselling author of THE HENNA ARTIST, this sweeping novel follows a young Anglo-Indian nurse who embarks on a journey from her home in Bombay, through Prague, Florence, Paris, and London, to uncover a mystery and prove her innocence after a famous painter dies in her care.When renouned painter Mira Novak arrives at Wadia hospital in Bombay after a miscarriage, she's expected to make a quick recovery, and Sona is excited to spend time with the worldly woman who shares her half-Indian identity, even if that's where their similarities end. Sona is enraptured by Mira's stories of her travels, and shocked by accounts of the many lovers she's left scattered through Europe. Over the course of a week, Mira befriends Sona, seeing in her something bigger than the small life she's living with her mother. Mira is released from the hospital just in time to attend a lavish engagement party where all of Bombay society. But the next day, Mira is readmitted to the hospital in worse condition than before, and when she dies under mysterious circumstances, Sona immediately falls under suspicion.Before leaving the hospital in disgrace, Sona is given a note Mira left for her, along with her four favorite paintings. But how could she have known to leave a note if she didn't know she was going to die? The note sends Sona on a mission to deliver three of the paintings—the first to Petra, Mira's childhood friend and first love in Prague; the second to her art dealer Josephine in Paris; the third to her first painting tutor, Paolo, with whom both Mira and her mother had affairs. As Sona uncovers Mira's history, she learns that the charming facade she'd come to know was only one part of a complicated and sometimes cruel woman. But can she discover what really happened to Mira and exonerate herself?Along the way, Sona also comes to terms with her own complex history and the English father who deserted her and her mother in India so many years ago. In the end, she'll discover that we are all made up of pieces, and only by seeing the world do we learn to see ourselves.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "India",
    "Mystery",
    "Travel",
    "Audiobook"
  ],
  "author": "Alka Joshi",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/212378278-six-days-in-bombay"
}