{
  "title": "Country Music Originals: The Legends and the Lost",
  "description": "In this sparkling collection, \"roots\" music authority Tony Russell offers vivid portraits of the men and women who created country music, the artists whose lives and songs formed the rich tradition from which Hank Williams, Elvis Presley, Bob Dylan, The Dixie Chicks, and so many others have drawn their inspiration. Included here are not only such major figures as Jimmie Rodgers, The Carter Family, Fiddlin' John Carson, Charlie Poole, and Gene Autry, who put country music on America's cultural map in the 1920s and '30s, but many fascinating lesser-known figures as well, such as Carson Robison, Otto Gray, Chris Bouchillon, Emry Arthur and dozens more, many of whose stories are told here for the first time. To map some of the winding, untraveled roads that connect today's music to its ancestors, Russell draws upon new research and rare source material, such as contemporary newspaper reports and magazine articles, internet genealogy sites, and his own interviews with the musicians or their families. The result is a lively mix of colorful tales and anecdotes, priceless contemporary accounts of performances, illuminating social and historical context, and well-grounded critical judgment. The essays are enhanced by more than 200 illustrations, many of them seldom seen and some never before published, including artist photographs, record labels, song sheets, newspaper clippings, cartoons, advertisements, and magazine covers, recreating the look and feel of the entire culture of country music. Each essay includes as well a playlist of recommended and currently available recordings for each artist. Country Music Originals is a collection of gems which will delight the aficionado and first-time enthusiast as well as the scholar of American folk music.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Biography"
  ],
  "author": "Tony Russell",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/2124791.Country_Music_Originals"
}