{
  "title": "Breaking the Chain: The Guard Dog Story",
  "description": "From the award-winning syndicated comic strip Mutts, the long-awaited “Guard Dog” story is now collected and presented in full color along with supplementary material, timed for the 30th anniversary Guard Dog made his debut in the Mutts comic strip in 1995 and quickly became one of the strip’s most beloved characters. As a chained dog longing for freedom, he’s played an important role in raising awareness about the cruelty of tethering and has inspired countless Mutts readers to become involved in animal welfare.   In October 2023, nearly three decades after his debut, Guard Dog’s freedom story began to unfold in newspapers and online. After being abandoned by his owner, left alone and suffering, Guard Dog was discovered by his animal friends Mooch and Earl, and ultimately rescued by Doozy, a kindly neighborhood girl, and Ozzie, Earl’s guardian. After years of visiting Guard Dog to provide him with comfort and support, Doozy adopted him—marking the end of a long life of neglect and the beginning of one filled with love and safety. The story line concludes with Guard Dog not only getting a new home but also a new name—Sparky—a nod to Patrick McDonnell’s greatest artistic inspiration, Charles M. Schulz, creator of Peanuts.   As Guard Dog found his happy ending, McDonnell received requests from readers all over the world, many of whom had been invested in Guard Dog’s plight for decades, hoping that the long-anticipated story would be made into a book. This collected volume answers the demands of those passionate readers.   Brought to life with Patrick McDonnell’s warm and intimate art, and featuring the complete story, now in color for the first time, Breaking the Chain is an emotionally resonant vignette whose grounding in the real-life animal neglect issues that affect millions of chained dogs worldwide will move both long-time Mutts fans and first-time readers.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Animals",
    "Graphic Novels Comics"
  ],
  "author": "Patrick McDonnell",
  "average_rating": "4.77",
  "url": "https://www.goodreads.com/book/show/212716947-breaking-the-chain"
}