{
  "title": "Running Away to Home: Our Family's Journey to Croatia in Search of Who We Are, Where We Came From, and What Really Matters",
  "description": "A middle class, Midwestern family in search of meaning uproot themselves and move to their ancestral village in Croatia \"We can look at this in two ways,\" Jim wrote, always the pragmatist. \"We can panic and scrap the whole idea. Or we can take this as a sign. They're saying the economy is going to get worse before it gets better. Maybe this is the kick in the pants we needed to do something completely different. There will always be an excuse not to go…\" And that, friends, is how a typically sane middle-aged mother decided to drag her family back to a forlorn mountain village in the backwoods of Croatia. So begins the author's journey in Running Away to Home . Jen, her architect husband, Jim, and their two children had been living the typical soccer- and ballet-practice life in the most Middle American of Des Moines, Iowa. They overindulged themselves and their kids, and as a family they were losing one another in the rush of work, school, and activities. One day, Jen and her husband looked at each other–both holding their Starbucks coffee as they headed out to their SUV in the mall parking lot, while the kids complained about the inferiority of the toys they just got–and asked \"Is this the American dream? Because if it is, it sort of sucks.\" Jim and Jen had always dreamed of taking a family sabbatical in another country, so when they lost half their savings in the stock-market crash, it seemed like just a crazy enough time to do it. High on wanderlust, they left the troubled landscape of contemporary America for the Croatian mountain village of Mrkopalj, the land of Jennifer's ancestors. It was a village that seemed hermetically sealed for the last one hundred years, with a population of eight hundred (mostly drunken) residents and a herd of sheep milling around the post office. For several months they lived like locals, from milking the neighbor's cows to eating roasted pig on a spit to desperately seeking the village recipe for bootleg liquor. As the Wilson-Hoff family struggled to stay sane (and warm), what they found was much deeper and bigger than themselves.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Travel",
    "Biography Memoir",
    "Biography",
    "Book Club",
    "Family"
  ],
  "author": "Jennifer  Wilson",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/11222943-running-away-to-home"
}