{
  "title": "Bitter House",
  "description": "Vera Bitter is dead, but her secrets have yet to be buried.After the tragic death of Bridget’s parents, her grandmother took her in. Vera Bitter raised her from behind a closed door—cold and uncaring from the moment she arrived at Bitter House. After Bridget’s high school graduation, Vera kicked her out without so much as a goodbye, and Bridget never heard from her again. Which is why, when she receives word of Vera’s passing and discovers she’s inherited the family manor, she’s immediately filled with dread.Those worries are amplified when she arrives at Bitter House after years away to find an enigmatic piece of her past waiting for her. Growing up, there was only one person Bridget distrusted more than her grandmother, and that was Cole Warner—the son of Vera’s house manager and the bane of her childhood existence. Now, he’s her new housemate.Owning the house she was once forced to leave with a man she’s always despised forces Bridget to confront feelings and questions she’s been running from since the day she was driven away from Bitter House.Then the first letter arrives.And with it, a world of secrets, darkness, and deception is unlocked. Years ago, Bridget tried and failed to find sanctuary inside the shadowy halls of Bitter House, and as she struggles to imagine a future there now, she discovers a terrifying behind the iron gate and stone walls of the old estate, nothing is quite what it seems. Bitter House has secrets and, if she can’t decide whom to trust, danger lies in wait.From million-copy bestselling author Kiersten Modglin comes a bone-chilling, compulsively page-turning, and achingly addictive thriller set within the walls of a mysterious old manor with a sinister secret.",
  "genres": [
    "Audiobook",
    "Thriller",
    "Mystery",
    "Suspense",
    "Mystery Thriller",
    "Fiction",
    "Psychological Thriller"
  ],
  "author": "Kiersten Modglin",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/212703563-bitter-house"
}