{
  "title": "The Skeleton Count, or The Vampire Mistress",
  "description": "The Skeleton Count, or The Vampire Mistress (1828) is a penny dreadful by Elizabeth Caroline Grey. Although the novel’s authorship is frequently disputed, The Skeleton Count, or The Vampire Mistress is likely the first vampire tale to be written and published by a woman. Like most penny dreadfuls, the novel makes up for a lack in style with an abundance of horror and romance. “When he had concluded the impious formula, an awful silence reigned in the turret, and he perceived the sheet gently agitated by the quivering of the limbs, which betokened returning animation. Then a shudder pervaded his frame in spite of himself, as he perceived the eyes of the corpse slowly open, and the dark dilated pupils fix their gaze on him with a strange and stolid glare.” Desperate to live to eternity, Count Rodolph makes a dangerous deal with the devil. Invigorated with his newfound power, Rodolph reanimates the corpse of the beautiful Bertha, a fitting bride to accompany him in his quest for everlasting life. Will she be a loyal and irresistible vampire mistress, or will the Count’s creation turn against him? The Skeleton Count, or The Vampire Mistress is an entertaining tale of terror and the occult from a prolific author of nineteenth century penny dreadfuls. This edition of Elizabeth Caroline Grey’s The Skeleton Count, or The Vampire Mistress is a classic penny dreadful reimagined for modern readers.Since our inception in 2020, Mint Editions has kept sustainability and innovation at the forefront of our mission. Each and every Mint Edition title gets a fresh, professionally typeset manuscript and a dazzling new cover, all while maintaining the integrity of the original book. With thousands of titles in our collection, we aim to spotlight diverse public domain works to help them find modern audiences. Mint Editions celebrates a breadth of literary works, curated from both canonical and overlooked classics from writers around the globe.",
  "genres": [
    "Vampires",
    "Horror"
  ],
  "author": "Elizabeth Caroline Grey",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/21282463-the-skeleton-count-or-the-vampire-mistress"
}