{
  "title": "Lonely Planet Discover India",
  "description": "Lonely Planet: The world's leading travel guide publisherLonely Planet's Discover India is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Be awed by the Taj Mahal, take a sacred dip in Varanasi, soak up rays and creature comforts in Goa, or shop 'til you drop in Delhi; all with your trusted travel companion. Discover the best of India and begin your journey now!Inside Lonely Planet's Discover India:Full-colour maps and images throughoutHighlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interestsInsider tips save you time and money, and help you get around like a local, avoiding crowds and trouble spotsEssential info at your fingertips - including hours of operation, phone numbers, websites, transit tips, and pricesHonest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping, and hidden gems that most guidebooks missCultural insights give you a richer and more rewarding travel experience - including history, architecture, art, cinema, cuisine, the Indian way of life, religion, customs/etiquette, landscapes, wildlife, and moreFree, convenient pull-out Delhi map (included in print version), plus over 63 colour mapsUseful features - including Top Itineraries, Walking Tours, Month-by-Month (annual festival calendar), and Family TravelCoverage of Delhi and the Taj Mahal, Mumbai (Bombay), Rajasthan, Goa, Kerala, Darjeeling, Varanasi, and the northern mountains, and moreThe Perfect Choice: Lonely Planet's Discover India, our easy-to-use guide, is perfect for travellers who seek the most popular attractions a destination has to offer. Filled with inspiring and colourful photos, this guide focuses on the best of the best.Looking for a comprehensive guide that recommends a wide range of experiences, both popular and offbeat, and extensively covers all the country has to offer? Check out Lonely Planet's India guide.Looking for a guide for Delhi, Kerala, Goa or Mumbai? Check out Lonely Planet's Rajasthan, Delhi & Agra guide, Lonely Planet's South India & Kerala guide, and Lonely Planet's Goa & Mumbai guide for a comprehensive look at all those cities have to offer.Authors: Written and researched by Lonely Planet, Daniel McCrohan, Michael Benanav, Joe Bindloss, Lindsay Brown, Mark Elliott, Paul Harding, Trent Holden, Amy Karafin, Bradley Mayhew, Kate Morgan, John Noble, Kevin Raub, and Sarina Singh.About Lonely Planet: Started in 1973, Lonely Planet has become the world's leading travel guide publisher with guidebooks to every destination on the planet, as well as an award-winning website, a suite of mobile and digital travel products, and a dedicated traveller community. Lonely Planet's mission is to enable curious travellers to experience the world and to truly get to the heart of the places they find themselves in.TripAdvisor Travelers' Choice Awards 2012 and 2013 winner in Favorite Travel Guide category'Lonely Planet guides are, quite simply, like no other.' -The New York Times'Lonely Planet. It's on everyone's bookshelves; it's in every traveller's hands. It's on mobile phones. It's on the Internet. It's everywhere, and it's telling entire generations of people how to travel the world.' -Fairfax Media (Australia)",
  "genres": [
    "Travel",
    "India",
    "Asia",
    "Nonfiction",
    "Reference"
  ],
  "author": "Lonely Planet",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/21276062-lonely-planet-discover-india"
}