{
  "title": "An Economy of Want",
  "description": "Imagine that you go to take a train and are told at the railway station “Sorry madam, your journey will take much longer today as all the trains are running slow”.“Why is that?” you ask? “What do the engineers say?”“The engineers are all on holiday madam, but an economist told us that it’s a worldwide railway ‘slump’ when railways everywhere slow down for a few years”.“What sort of ‘explanation’ is that!” You exclaim, “and anyway why hasn’t this train that’s just come in got any seats in the carriages?”“Well madam, we’re in competition with China now, so we can’t afford seats any more …”. “the economist said if we could ‘grow’ the railways, we might be able to get the seats back …”.“But we invented railways in Britain, how can that be?” You reply.“wouldn't know madam, but I'm off now; I've been made redundant. The management say station staff are 'uneconomic'. Good luck.”Such explanations sound ridiculous ... yet if we ask questions about the economy they sound all too familiar.One economic ‘system’ is now dominant throughout most of the world. But despite the triumph of free market capitalism and globalisation, we are beset by economic problems and problems with their roots in the functioning of the economy:Environmental destruction. Human economic activity is causing the mass extinction of other species and threatening the habitability of the planet, in particular by the rapid climate change caused by burning fossil fuels.Poverty in the midst of plenty. The persistence of unemployment and deprivation even in countries considered wealthy, plus widespread poverty in the world’s poorer and less industrialised countries.Insecurity. Prosperity and development have not brought security even for the better-off citizens of the world. Public infrastructure and facilities we could formerly afford are often under threat. New ‘labour-saving’ technology paradoxically results in pressure to work harder and for longer hours.Politicians and economists claim that they want to tackle these issues but even in the wealthiest and most technologically advanced countries are apparently unable to do so. The only solution proffered is growth and more growth, despite the fact that in the richer countries we have already had centuries of growth, and despite the looming environmental catastrophe that has resulted.This book, written by an engineer not an economist, aims to provide a straightforward explanation of how our economy operates and why it fails to solve such problems, or worse, actually creates them. It’s not a book about an 'alternative' economy, but an alternative economics analysis of the existing economy. You could read it with no intention of changing anything. But of course most of us do want to solve these problems, so there is a second part that considers what sorts of changes we would have to make to get a fairer and more sustainable economy, and one that most people would hopefully find a happier and more fulfilling one to live in.",
  "genres": [],
  "author": "Donald Power",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/212901299-an-economy-of-want"
}