{
  "title": "Desecration: Winchester 1642",
  "description": "“Charles Cordell, a former soldier, writes with bravura confidence.” The TimesWinchester, England, December 1642.A desperate ride, a city stormed, a final stand, a forlorn hope. Humiliation, desecration, cleansing fire and bitter wind sweep through Winchester’s streets, castle, cathedral close and sacred aisles.Ordinary men and women face each other and the brutal reality of civil war. All have answered a call to save England. Now brother must kill brother.An English Civil War short story in the Divided Kingdom series.Praise for the Divided Kingdom ‘Stirring. A great read! You can almost hear the roar of cannon and the thunder of hooves.’ Ben Kane, Sunday Timesbestselling author, The Forgotten Legion, Hannibal and Lionheart‘Heart-pounding action, heart-breaking loss as a nation tears itself apart. You can smell the sweat of fear. … Not to be missed.’ David Gilman, award-winning author of the Master of War series, The Last Horseman and The Englishman.‘Fast-paced and authentic. With characters that are colourful and believable. There are not enough tales like this.’ Michael Arnold, author of the Civil War Chronicles and Highwayman series‘An exciting minute-by-minute story of the English Civil War … from the soldier’s point of view … the historical accuracy is fantastic … the storyline and writing style tremendously exciting.’ \nHistorical Novels Review\nMore in the Divided Kingdom GOD'S VINDICTIVE WRATH – from the Battle of Edgehill to the barricades at Brentford, via Oxford and the Battle of Aylesbury, autumn 1642.THE KEYS OF HELL AND DEATH – from the Battle of Lansdown Hill to the Storming of Bristol, via the Siege of Devizes and Roundway Down, summer 1643.Each book in the Divided Kingdom series can be read as a standalone story, or in series.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Charles Cordell",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/212899351-desecration"
}