{
  "title": "George Foreman's Big Book Of Grilling Barbecue And Rotisserie: More than 75 Recipes for Family and Friends",
  "description": "King of the ring and king of the grill, George Foreman joins forces with chef Barbara Witt to provide all-new dishes for grill and rotisserie cooking. The recipes in this book can be prepared indoors, using an electric or stovetop grill; or outdoors, on an electric, charcoal, or gas-powered barbecue.Grilling is healthful and quick. If you do a little work in advance, once you fire up the grill, dinner can be ready in a matter of minutes. So dishes like Rib Roast with Rosemary and Roasted-Garlic Wine Sauce, Chicken Breasts with Peanut Sauce, Ginger Honey Duck, and Curried Salmon Steak become easy weeknight dinners instead of party fare.Foreman and Witt have created delicious recipes for grilled meats, poultry, seafood, vegetables, innovative grilled salads and pasta sauces -- even pizza. Complete with full nutritional information, the recipes reflect an international range of flavors -- Caribbean, Pan-Asian, and Latin -- and provide new twists on all-American favorites. In the recipe introductions and in the vegetable chapter, there are suggestions for side dishes, some of which can be prepared on the grill alongside the main course.You'll find everything you need to know about equipment; ways to maximize flavor by using seasoning rubs, pastes, marinades, and brines; and there are sources for the best meats and ingredients. While these dishes are full of big flavors, the ingredients can be found in any well-stocked supermarket. Whether you want a quick-fix family meal, a backyard barbecue feast, or an elegant dinner party, you'll find the perfect recipe in George Foreman's Big Book of Grilling, Barbecue, and Rotisserie.",
  "genres": [
    "Cookbooks",
    "Cooking"
  ],
  "author": "George Foreman",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/2129302.George_Foreman_s_Big_Book_Of_Grilling_Barbecue_And_Rotisserie"
}