{
  "title": "Ennobling Love: In Search of a Lost Sensibility",
  "description": "\"Richard, Duke of Aquitaine, son of the King of England, remained with Philip, the King of France, who so honored him for so long that they ate every day at the same table and from the same dish, and at night their beds did not separate them. And the King of France loved him as his own soul; and they loved each other so much that the King of England was absolutely astonished at the vehement love between them and marveled at what it could mean.\"Public avowals of love between men were common from antiquity through the Middle Ages. What do these expressions leave to interpretation? An extraordinary amount, as Stephen Jaeger demonstrates.Unlike current efforts to read medieval culture through modern mores, Stephen Jaeger contends that love and sex in the Middle Ages relate to each other very differently than in the postmedieval period. Love was not only a mode of feeling and desiring, or an exclusively private sentiment, but a way of behaving and a social ideal. It was a form of aristocratic self-representation, its social function to show forth virtue in lovers, to raise their inner worth, to increase their honor and enhance their reputation. To judge from the number of royal love relationships documented, it seems normal, rather than exceptional, that a king loved his favorites, and the courtiers and advisors, clerical and lay, loved their superiors and each other.Jaeger makes an elaborate, accessible, and certain to be controversial, case for the centrality of friendship and love as aristocratic lay, clerical, and monastic ideals. Ennobling Love is a magisterial work, a book that charts the social constructions of passion and sexuality in our own times, no less than in the Middle Ages.",
  "genres": [
    "Medieval",
    "History",
    "Medieval History",
    "Nonfiction",
    "Psychology"
  ],
  "author": "C. Stephen Jaeger",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/212814.Ennobling_Love"
}