{
  "title": "Rogues of Regalia",
  "description": "It’s a new semester at Regalia University, and by the end of it, five men will die.My sister was good, kind, loving, and the Royals of Regalia bullied her till she killed herself.I set foot on campus ready to right some wrongs when the most handsome bunch of stone-cold weirdos asked if I needed a little help…Don’t get me started on Lucien. He fancies himself a vampire—complete with sharpened canines, cape, and a coffin, but if anyone knows how to make a man bleed, it’s him.Wilder’s on another level, and you’re not allowed. He’s out to expose every conspiracy from Area 51’s alien relocation program to the trackers implanted in our brains. The man doesn’t kiss a woman without patting her down twice, but if you need to get your hands on an arsenal, his is unmatched.My growling, snapping Cato escaped his last mental institution. Now he has a new obsession: ripping out the throat of anyone who looks at me sideways. Don’t worry, he can’t bite you through the muzzle.Then, of course, there’s their leader, Rafael. The son of a hitman dances his way around campus, and only takes his headphones off to hear the obscene amount you’ll pay him to take care of your problems. Otherwise, stay out of his blissful world, or he’ll blow it up with you inside.These four are as determined to make up for not protecting my sister as they are to protect… and keep… me.They’re freaks. Weirdos. Psychos. But damned if they’re not taking my heart like they do everything else—without mercy or permission.It’s the five of us against the most powerful and untouchable of Regalia. No one thinks we can win, but I like my chances.To take down a Royal, you need a Rogue.And I have four.The Rogues of Regalia is a dark contemporary reverse harem romance and book one of the series. It gets wild in these pages, if you can handle that, dive in!",
  "genres": [
    "Reverse Harem",
    "Dark",
    "Romance",
    "College",
    "Dark Romance",
    "New Adult",
    "Contemporary"
  ],
  "author": "Ruby Vincent",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/212765377-rogues-of-regalia"
}