{
  "title": "Au plaisir de Dieu",
  "description": "En hommage à la mémoire de son grand-père, symbole de la tradition, contraint de s'éloigner à jamais de la terre de ses ancêtres, le cadet d'une vieille famille française enfermée dans l'image du passé raconte ce qui a été et qui achève de s'effondrer. Le berceau de la tribu, le château de Plessis-Lez-Vaudreuil, est au centre de cette longue chronique qui embrasse, depuis les croisades jusqu'à nos jours, l'histoire du monde, du pays, du clan, de tout ce que la lignée a incarné et en quoi elle a cru, et qui s'est peu à peu effrité. Un mariage d'amour et d'argent, les idées contemporaines et subversives, les livres, les mœurs nouvelles ouvrent successivement des brèches dans la forteresse de la tradition. L'histoire du XXè siècle, avec ses situations paradoxales, précipite la mutation et la décadence d'une famille qui avait su, à travers tous les cataclysmes, maintenir ses privilèges et conserver son charme. Le narrateur n'ignore pas qu'il est le dernier à connaître une forme de vie condamnée. Se jouant de la chronologie et de l'imagination, il brosse avec désinvolture et nostalgie, sur la vaste toile de fond du siècle, une galerie de portraits et de croquis où ne manquent ni l'émotion ni l'ironie. Tout le livre est empreint d'une mélancolie qui lui donne sa résonance et sa poésie. On passe d'un épisode dont l'humour rappelle celui de Proust à une page poignante et presque désespérée. C'est le \" regret souriant \" et c'est le charme du temps perdu et retrouvé dans le souvenir. C'est ici l'histoire d'une famille imaginaire brillamment repensée, avec une sorte, à la fois, de lassitude et d'allégresse. Le lecteur ne pourra s'empêcher de lui chercher des modèles. Mais au-delà des clés qu'on ne se fera pas faute de découvrir, c'est tout un pan de la société française que nous voyons s'écrouler sous nos yeux.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "France",
    "Literature",
    "Roman",
    "Novels"
  ],
  "author": "J. Ormesson",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/2127990-au-plaisir-de-dieu"
}