{
  "title": "Murder, Inc.: The Story of the Syndicate",
  "description": "“Murder, Inc.” was the moniker of the Syndicate’s firing squad, a ruthless group of men guilty of professionally committing 1,000 murders. Murder, Inc. is the book that exposed the Syndicate to the eyes of the world. First published in 1951, it rose to the top of the best-seller list, but later fell out-of-print. Now, here is a new edition of the classic that tells all about the great gangsters of the late ’30s and ’40s: Frank Costello, Louis ”Lepke” Buchalter, Meyer Lansky, Lucky Luciano, Buggsy Siegel, Johnny Torrio, Willie Sutton, Joey Adonis, Dutch Schultz. Here are the stories of how Pittsburgh Phil and Buggsy Goldstein literally set Puggy Feinstein on fire; how and why Kid Twist Reles sang to the D.A. for twelve straight days, confessing dozens of murders; how the killers’ boss, Albert Anastasia, slipped through the arms of the law.From the highest levels of the U.S. government down to the lowest levels of street crime, the Syndicate infiltrated American life. Murder, Inc. tells how it was formally organized by the nation’s ranking mob lords at the end of Prohibition to control all crime, from gambling to crooked politics to labor extortion and murder. It describes the carefully built organization with its board of governors and its kangaroo court, and shows how this massive and powerful organization was finally broken.For it was only from the murderers themselves that the truth could be learned. And no man was more qualified to tell the whole story than Burton Turkus, the Brooklyn assistant D.A. who listened to the killers’ tales and who sent seven of them to the electric chair. Together with Sid Feder, a veteran journalist, they produced Murder, Inc., the definitive work on the most dangerous group of gangsters the law has ever known.",
  "genres": [
    "True Crime",
    "History",
    "Crime",
    "Nonfiction",
    "Historical",
    "American History"
  ],
  "author": "Burton B. Turkus",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/1122424.Murder_Inc_"
}