{
  "title": "The Eternal Plan - Revealed: The Automatic Writings of a Happy Medium",
  "description": "The man, the entity, as I have learned to describe him, that I knew as my father for all my life, is known to me as Colin Jones. He gave me a few carrier bags in 1999 and asked me to read the contents and write a book on it, if I could.  At that time, time did not seem pressing and I put the bags in my safe at home. He passed away a few years later on his 72 birthday, the 21st February.  I, and all our family were devastated, but I did nothing about ‘his papers’. I had no idea what to do.  I moved abroad and wrote a novel. That took five years, although it is still unpublished. In 2011, I started a new venture publishing ebooks that I had written myself.  The courage to write these ebooks had come from writing the first book. I looked for ways to circumvent traditional publishing and came across Amazon’s Kindle.  I learned how to publish my ebooks through them and realised how to publish Dad’s book.  It took me a long time, but I think that I was guided by spirit.  My Dad, Colin Jones, would never have said that these writings are his own. Rather he would say that he was inspired, in the true sense of the word. People told him what to write.  All of our family witnessed this over five or six decades. Sometimes, Dad would be sitting with us watching TV, but Dad’s eyes would be shut and he would be writing the pieces that you see in this ebook. He did automatic drawings too.  My brothers and I are very privileged to have been born with such a person, but as with most instances with parents, we realised it too late.  I hope that you enjoy this book. I will expand it in later editions.  One last point, my father’s mother, Lavinia Jones, founded a spiritualist church in Barry, South Wales, which is still going to this day.",
  "genres": [
    "Spirituality"
  ],
  "author": "Colin Jones",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/21301053-the-eternal-plan---revealed"
}