{
  "title": "Starcrossed: Perigee",
  "description": "Aric Brennan is a whisperer - a perfectly engineered human/alien hybrid, designed specifically to charm and seduce. When Lucy is stalked by his unearthly creators, she has no choice but to trust him to help her navigate a way through a horrifying reality - a reality filled with creatures which should really only exist in nightmares.\"...His face drew nearer, and I caught my breath at the closeness of such an impossibly perfect person. Despite every instinct which told me I was in danger, I couldn’t help but stare back at him, and be pulled into the spell he was weaving. The panic receded as I looked into his eyes and listened to the hypnotic timbre of his voice. The room filled with a strange buzz which permeated my body, vibrating and pulsing through every part of me. I didn’t care - I was still listening to his voice. Paralysis overtook me, but I had no will to fight it. The creatures moved closer and he backed away...”Synopsis:\"Star-crossed - a pair of lovers whose relationship, ordained by the stars, is thwarted by outside forces.\"\"There are many things in this world, Lucy, that are not what they seem. Humans go about their business with their heads in the sand. They have no idea what's really going on.\"After surviving a peculiar and unsettled childhood, Lucy Doyle's relatively normal teenage existence is turned upside down with the arrival of the enigmatic, impossibly good looking Aric Brennan - her uncle's new ranch hand. Lucy's suspicion that there's something 'different' about Aric is confirmed when she learns that his uncanny ability to mind read and charm the socks off of any female isn't just an accident - he was bred for this purpose. Aric is a 'whisperer' - a genetically manipulated human hybrid created by the Innaki - an alien race involved in a sinister abduction program.When Lucy is stalked by Aric's unearthly creators, she must put her trust in the charismatic, 'perfect' stranger, unaware he holds a chilling secret which could destroy her world forever.If you're into X File type aliens and ufos, vampiric creatures, weird powers, romance and fast paced adventure, then Starcrossed: Book 1 Perigee, by Tracey Lee Campbell is a must read!\"What girl wouldn't wish for the perfect guy? Unfortunately for Lucy, he was created that way for a reason...\"Check out https://www.facebook.com/starcrossedt... pinned post to find out who stocks this book!",
  "genres": [
    "Young Adult",
    "Paranormal",
    "Aliens",
    "Romance",
    "Fantasy",
    "Science Fiction",
    "Paranormal Romance"
  ],
  "author": "Tracey Lee Campbell",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/11224175-starcrossed"
}