{
  "title": "Craving Red",
  "description": "It is the night of the snow moon. Sweden, 1790. Maiden Kaia is days away from being married to the handsome Leif when her mother suddenly becomes gravely ill. Desperate to save his wife, her father sends his only daughter to the village on his horse to obtain help for her beloved mother. But Kaia will not be returning home.Out on the path, wolves emerge from the trees, surrounding her and spooking her horse. Fainting in sheer terror, the next thing Kaia knows, she is being dragged through the snow back to their lair. Shivering cold, half naked and bound, she startles awakes to the feel of warm breath blowing out over her body. The following day, she realises she sees no wolves around, but does see several other women there. Noticing they are all pregnant, Kaia fears her fate. Her fears are validated when one of them complacently informs her that her initiation is imminent. The moment her scent is ripe, she is to be mated by all males of the pack.Still worse than that is the struggle she is having with herself upon being presented with so much blatant man flesh walking about, leaving Kaia flustered with the responses of her body which are swiftly summoning forth to betray her. And then, she feels herself drawn to the strikingly gorgeous Dane, with his hair black as night, and eyes blue as the sky. He is also the baby of the pack. No matter how good he may seem, still she fights against the feelings threatening to overtake her. How can she allow herself to fall for one of them? Will Kaia ever escape this primitive place to see her family again? And if she does, will she be able to suppress the primal need she feels awakening in her? Worse yet, will she want to?Also in the Erotic Kingdom Series:'Her Queen Mistress': The Erotic Adventures of Snow White, Vol. I'The Huntsman': The Erotic Adventures of Snow White, Vol. II 'The Enchanted Forest': The Erotic Adventures of Snow White, Vol. III (Feb 10th 2015)'The Seven Woodsmen': The Erotic Adventures of Snow White, Vol. IV (March 15th 2015)'Rose Red': The Erotic Adventures of Snow White, Vol. V (April 15th 2015)'Thanking Sir Prince': The Erotic Adventures of Snow White, Vol. VI (May 15th 2015)",
  "genres": [
    "Erotica",
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Fantasy",
    "Paranormal Romance",
    "Dark"
  ],
  "author": "Rosalind Scarlett",
  "average_rating": "2.64",
  "url": "https://www.goodreads.com/book/show/21301260-craving-red"
}