{
  "title": "All on the Line",
  "description": "Jaci Nichols thinks nothing can make her feel as alive as fighting wildfires--man against nature, standing up to danger every day. Until her crew chief, Cal Sinclair, kisses her after a close call on the fire line. Wow.  Now she’s craving more, but he wants to keep his distance. Cal Sinclair doesn’t want to screw up his first year as crew chief, so he keeps his distance from the members of his hot shot crew. Hard to do when the sexy rookie gets under his skin. Something about her draws him, and makes him want to put it All on the Line.Excerpt:Camp was quiet when they rolled in, but not sleeping, never sleeping, not with the odd comings and goings of the crews. When the Blackwolfs rolled out of the truck, some headed straight for the mess, others for tents. Jaci, he saw, headed for the showers. He considered taking the same path, but his growling stomach had other ideas. He’d chosen not to eat his last MRE in anticipation of real cooking. He stumbled instead toward the mess.Wildland firefighting ate up a lot of calories. Otherwise he’d never consider eating biscuits and gravy and pancakes and eggs and sausage. He sat at one of the long picnic tables and admired the abundance of food on the tray before him before he dug in.He was halfway through his pancakes and halfway toward stuffed when the bench across from him creaked. He looked up to see Jaci, shiny and clean, wearing her Blackwolf t-shirt but apparently no bra. He’d thought he was too tired to have a reaction, but his dick had other ideas.“You smell good,” he murmured.“Better than you,” she teased. “Did you eat all of that?” She pointed to the empty plates on his tray. “Was hungry.”“Is it good?”He shoved the tray with its half-eaten stack of pancakes toward her. “Not bad.”She took a bite. “Not bad,” she agreed.“The line’s open. You can get your own tray.”She shook her head, folded her arms on the table, and lowered her head to them, like a kid in trouble at school. “Too tired to chew.”Yet she was here instead of her own tent. He lifted a brow in question. She sighed and sat up, then dragged his tray closer, used his fork and took a dainty bite. Then another. Then polished off his pancakes, sopping them through every last drop of syrup. She looked up and grinned, her lips sticky and so damned appealing. He wanted to lean across the table and lick the syrup from her mouth.“Want more?”“I’m good. Thanks.” She blinked sleepily and rose on a stretch that lifted her shirt and showed her belly. “You might want to hit the showers while you have a chance.”He was so damned tired he had decided to skip a shower, but knew he’d sleep better after one. “We head out again at three.”She grimaced and stepped over the bench. “Okay. See you.” She stumbled away, so tired he hoped she could find her tent.",
  "genres": [
    "Romance",
    "Firefighters",
    "Contemporary Romance",
    "Suspense"
  ],
  "author": "Emma Jay",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/21300159-all-on-the-line"
}