{
  "title": "Coal Gets In Your Veins",
  "description": "Penny Harbour was once a booming coal mining town, full of industry and possibility. But jobs like that come at a price. Accidents. Cave-ins. Explosions. The residents fed the ground with their blood, and coal dust settled inside them. Eventually, the world moved on from coal. The mines closed, the jobs left, and the grief stayed rooted in the people. Laurel is trying to carve out a decent life in what remains of the town. Her family has lived in the Harbour for generations. She’s seen the best and worst it has to offer. But no matter what she wants for herself, her husband's boot is still on her neck. She’s survived him for two decades, and she's just about out of reasons to stay.Just up the hill, Spencer is wading through his eternity mourning the deaths of his great loves. Penny Harbour is his own personal purgatory. He’s a queer vampire in a dying, conservative rural community, and everyone’s blood is full of grit and ashes. It’s the perfect place to slip into isolation and punish himself for all he’s lost. But Penny Harbour has a life all its own. Children with a penchant for lighting fires. Unmarked graves when mines used to be. Traditions built to lift each other out of grief. Personal hells that live behind closed doors. And when the town sinks its teeth into someone, it would sooner rip their throat out than let them go. Part romantic vampire horror, part rural Atlantic Canadian memorial pyre, Coal Gets In Your Veins is a novel about generational trauma and what it will do to keep its claws in you. —This book is part of a queer paranormal horror series with romantic themes and handles heavy, complicated topics such as generational trauma, spousal abuse, grief, and cheating. A full list of trigger warnings can be found on Cat’s website.",
  "genres": [
    "Fantasy",
    "Romance",
    "Queer",
    "Vampires",
    "LGBT",
    "Horror",
    "Adult"
  ],
  "author": "Cat Rector",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/213229809-coal-gets-in-your-veins"
}