{
  "title": "The Union Square Cafe Cookbook: 160 Favorite Recipes from New York's Acclaimed Restaurant",
  "description": "Union Square Cafe serves some of the most imaginative, interesting, and tasty food in America. The restaurant and its owners, Danny Meyer and chef Michael Romano, have been lauded for their outstanding food and superb service by Gourmet, Food & Wine, the New York Times, and the James Beard Foundation. Now its devoted fans from down the block and across the globe can savor the restaurant's marvelous dishes, trademark hospitality, and warm decor at home. Offered are recipes for 160 of Union Square Cafe's classic dishes, from appetizers, soups, and sandwiches to main courses, vegetables, and desserts. Hot Garlic Potato Chips, Porcini Gnocchi with Prosciutto and Parmigiano Cream, Grilled Marinated Fillet Mignon of Tuna, Herb-Roasted Chicken, Eggplant Mashed Potatoes, and Baked Banana Tart with Caramel and Macadamia Nuts are some of the all-time favorites included in this long-awaited collection. Union Square's recipes are easily mastered by home cooks. They call for ingredients that are widely available (mail-order sources are listed for those few that are not), employ familiar techniques, and take a reasonable amount of time to complete. Amateurs and pros alike will find the dishes here as accessible as they are irresistible. Beyond just providing recipes, The Union Square Cafe Cookbook inspires confidence in home cooks by sharing Michael Romano's tips for success. Readers learn that soaking baby onions in warm water makes them easier to peel (in the recipe for Sweet Peas with Escarole, Onions, and Mint); that the Corn and Tomatillo Salsa served with Polenta-Crusted Sea Bass also goes well with barbecued chicken or pork; that leftover Sautéed Spinach with Garlic makes a great sandwich filling; and that yesterday's sourdough bread should be kept for such soups and salads as Ribollita and Sourdough Panzanella. Danny Meyer's wine suggestions, inspired by the restaurant's remarkable cellar, accompany almost every recipe. The Union Square Cafe Cookbook does the rare job of capturing the bustling energy and ebullient enthusiasm of the restaurant itself and the spirited personalities—those of Danny and Michael—that drive it. Folks will still go out of their way to eat at Union Square Cafe, but this cookbook—filled with the restaurant's vitality, warm artwork, and tempting recipes—ensures that its pleasures are as close as your bookshelf.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Reference"
  ],
  "author": "Danny  Meyer",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/213282.The_Union_Square_Cafe_Cookbook"
}