{
  "title": "Oceansong",
  "description": "“…This a brilliant and moving addition to the fantasy genre, each page brimming with all the rhythm and depth of the Bering Sea.”- Thea Guanzon, New York Times and USA Today bestselling author of THE HURRICANE WARS“…making Oceansong a must-read for those who enjoy a blend of romance, mystery, and fantasy.” - Readers Favorite (5 star review)BookFest Award Winner in Romance and FantasyFish are mysteriously disappearing, starving the people in Angie Song’s Alaskan hometown. Angie, a snarky, guarded aspiring marine biologist and dock worker, enthusiastically joins the hunt to find out where the fish are gathering. When her family and the villagers discover that merfolk are responsible, they vow to destroy every last one. In the midst of the conflict, Angie faces off with a merman and fails to pull the trigger.Inquisitive Mer-Prince Kaden is just as snarky as Angie, but he’s willing to talk and stop the brutal massacring of his people. The two form a cautious alliance to broker peace between the humans and mer before any more of them die.Angie’s family becomes suspicious of her time near the water and threatens her future career. If the Mer-King and Queen learn of Kaden fleeing to the surface from an engagement he doesn’t want and falling for a landwalker, he’ll be exiled.As tensions clash in this modern-day Romeo and Juliet meets The Little Mermaid, no one is safe in the desperate fight to control the sea’s resources. Despite the risks, Angie and Kaden’s forbidden relationship ignites. And as she learns about the mer’s mysterious world and the reason why the fish are gone, Angie starts to question who the true monster is, and where her loyalties lie. Taking the wrong side means choosing between family and her job, or the man she’s fallen for and the merfolk she’s come to respect—or losing it all.CWs: Blood, Violence, Imprisonment and Torture (off screen) of mythical creatures, Parental Death (mentioned), non-consensual kiss (off screen, not involving main couple)",
  "genres": [
    "Fantasy",
    "Romance",
    "Mermaids",
    "Romantasy",
    "Adult",
    "Fiction",
    "Fantasy Romance"
  ],
  "author": "C.W.   Rose",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/213357783-oceansong"
}