{
  "title": "Fae for Pay",
  "description": "His family is Hollywood royalty, though I think the infuriating wolf prince’s scepter may have lodged itself in his royal, uh, ego.My name is Teremie—yes, it’s a T, not a J, thanks for asking—Summers. Maybe you’ve heard of me? Only Fae. Ring any bells? I might not be an A-lister in Hollywood, but you’d be surprised how many people will spend good coin to see me dress—and undress—like a sexy elf. Not sure why so many fans are into a mythical creature when we’ve already got real vampires and wolves, but I don’t judge. I guess everyone likes to believe in a little magic, right?Speaking of magic and Hollywood . . . when my best friend asks me to come along for moral support to his audition for The Prince’s Quest for the Cursed Coin, an up-and-coming epic fantasy adventure, I expect to do a lot of handholding. Instead, I’m cast in a starring role . . . as an elf, not the prince.No, that role goes to the once-cute-teen-star, turned smokin’ hot, all grown up, wolf-shifter Kade Savage. His star shone super bright fifteen years ago, but like a shooting star, lit up the sky and vanished. This movie is his ticket back to fame, so he’s all business and allergic to fun of any sort—including the carnal kind.Annoyingly, Kade’s not swayed by my considerable charms, even if I catch him giving me big-bad-wolf eyes when he thinks I’m not looking. Worse, the wolf pretty much hates me. The feeling’s mutual, even though his low, growly voice sends tingles down my spine and makes my heart beat a little faster.When a gold prop coin keeps ending up in my pocket during filming, I can’t help thinking someone’s pulling some kind of silly prank. That joke turns into a nightmare when we suddenly end up in a fantasy scene that doesn’t seem to be part of any movie set. My wolf prince has transformed into a dragon, I’ve developed actual elf ears, and murderous creatures are definitely not using prop weapons. In fact, someone really wants us dead. Trapped together, we have to get home. Or die trying. And it seems—unless this stupid prop coin has some luck stored in it—we just might.Fae for Pay is a part of the multi-author series, Fortune Favors the Fae. From spicy to sweet, zany romps to epic adventures, there’s something for everyone in this mystical series. Discover destiny and true love, and follow the coin on its fickle journey to the next world and a new magical adventure.",
  "genres": [
    "M M Romance",
    "Fantasy",
    "Romance",
    "Urban Fantasy",
    "Fae",
    "Paranormal",
    "Shapeshifters"
  ],
  "author": "Meghan Maslow",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/213200543-fae-for-pay"
}