{
  "title": "Public Offerings: Complete Series",
  "description": "Kirkus Reviews said of Public Offerings Book One (Birthright) - \"…A densely plotted thriller that churns out suspenseful scenes… Characters are refreshingly intricate. Protagonist Dave isn’t a flawless hero; he seems to be an obsessive workaholic. The bad guys are even better.\" Over a million people will die… OR just one innocent young girl whose devoted father must make the choice…A powerful new voice in literature and suspense. Winner of the prestigious Writers League of Texas manuscript contest for best thriller! Save now and get all four books of this popular series in this single volume.Dave Clement has it a wife and daughter he treasures, a deep faith in God, a satisfying career fighting disease, and a job about to make him rich through an initial public offering. Then his 15 year old daughter, Liv, inexplicably contracts HIV, ripping his life and soul apart.When Dave discovers that his own work in West Africa may be responsible for Liv’s disease, he scrambles for a cure, only to become embroiled in a genocidal cabal of wealthy conspirators, including his business partner Claire McQuaid, head of a powerful pharmaceutical firm. Liv’s fate is attached to the outcome of the genocide. If Dave doesn’t cooperate, she and everything he cherishes are doomed.Helped by a missionary priest and a tribal chief in Sierra Leone (where there is an all too real Ebola outbreak today). Dave peels back the conspiracy’s layers, seeking a way to fight back. But Claire anticipates all possible moves, stopping Dave at every turn. Disease and war loom ominously as the stakes escalate. Then, the final countdown begins, forcing Dave to choose. He must play God with his own child and over a million innocents. Who will live and who will die? And how will Dave live with himself?A breathtaking roller coaster ride ascends the snowy peaks of northern Colorado and hurtles through the rainforests of West Africa as Claire and her associates drive their new world order forward. With everything that ever mattered to him on the line, Dave races the clock to outwit the powerful plotters and to save Liv.Public Offerings is a four book series. This is the complete series of all four books in one volume.",
  "genres": [],
  "author": "Bob LiVolsi",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/21330001-public-offerings"
}