{
  "title": "The Glass Books of the Dream Eaters",
  "description": "In The Glass Books of The Dream Eaters three most unlikely but nevertheless extraordinary heroes become inadvertently involved in the diabolical machinations of a cabal bent upon enslaving thousands through a devilish 'process':Miss Temple is a feisty young woman with corkscrew curls who wishes to learn why her fiancé Roger broke off their engagement...Cardinal Chang was asked to kill a man, but finding his quarry already dead he is determined to learn who beat him to it and why...And Dr Svenson is chaperone to a dissolute Prince who has become involved with some most unsavoury individuals...An adventure like no other, in a mysterious city few have travelled to, featuring a heroine and two heroes you will never forget.\"In the winter of 2004 I was selected for jury duty (at the very same time Martha Stewart went to trial in the next building over — we all had to walk past the fifteen media vans to get to our courthouse). Since the courts in Manhattan are near Chinatown, I like jury duty, as it means a few days of excellent lunches. Instead, New York was hit with a ferocious, sub-zero ice storm that went on for days, where it was impossible to wander in the way I had hoped, and so, with the grind of the trial itself, we jurors were marooned for close to 4 hours each day in the jury room. The second night of the trial, however, I had a strange dream where a friend of mine appeared in the exact garb of one of The Glass Books' three main characters, Doctor Svenson, and together we faced a mystery in a strange, dark, Victorian building involving prisoners in a creepy upstairs room without a door. While I very rarely remember my dreams, the next morning I found this one percolating in my head quite vividly. But then, for no reason I can recall, I took out a notebook, and began — instead of the Doctor, who I would get to almost off-handedly in another 100 pages or so — writing about a willful young woman from the West Indies whose fiancée has abandoned her without explanation, making it up as I went along. By the end of the trial I had the first chapter. I am by trade a playwright, and had not written prose fiction of any kind for nearly 20 years, but I found myself hooked on the story and the characters — perhaps out of my own desire to know what happened next — and so persisted, putting aside most everything else, writing for the most part in coffee shops and on the subway, until I finished the book almost exactly one year later.\"--Gordon Dahlquist",
  "genres": [
    "Fantasy",
    "Steampunk",
    "Fiction",
    "Mystery",
    "Science Fiction",
    "Historical Fiction",
    "Adventure"
  ],
  "author": "Gordon Dahlquist",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/2132429.The_Glass_Books_of_the_Dream_Eaters"
}