{
  "title": "The Secret Hotel in Berlin",
  "description": "Berlin, 1944. ‘It is a great honour to have you here, Herr Hitler.’ Lili doesn’t stumble over the lie, her hand steady as she pours champagne. Everything must be perfect, no one can suspect a thing…Lili Rodenberg and her husband Marius run the Edel, Berlin’s most glamorous hotel. For its wealthy guests, it is an escape from the destruction outside, with its elegant piano bar and fine amber brandy. But Lili is Jewish, a secret she is terrified will end in tragedy for her and their beloved little girl.Lili’s only choice is to hide in plain sight, her heart racing each time uniformed officers step through the Edel’s grand entrance. As Berlin becomes a more frightening place, Lili pleads with her husband to help shelter those in danger but Marius is he will not risk the lives of his wife and daughter. Until the day he is called to the front – and goes missing in action.Left in sole charge of the Edel, a heartbroken Lily fixes her smile as she serves men who would have her killed in an instant if they knew the truth. She decides she must fight back, hiding Jews in the hotel’s wine cellar before moving them to safety. Though she is seized with terror, it gives her the strength to carry on.But her courage catches the attention of the Resistance. What they ask of her is impossible.Lili has protected her daughter by living a life full of secrets. Can she risk it all now and put her child in danger for the sake of her country?An absolutely unforgettable and heartbreaking story of bravery, love and sacrifice that will keep you turning the pages and reaching for the tissues. Fans of The Nightingale and The Book of Lost Names will be swept away by this stunning novel.Readers love Catherine ‘Phenomenal… Literally broke my heart… Unputdownable… I was drawn into the story at the flip of the first page and I went through an entire box of Kleenex by the time I arrived at the last page. This masterpiece of a story is one that I highly recommend.’ Page Turners, ⭐⭐⭐⭐⭐‘Simply extraordinary!… I was hooked before reaching the bottom of the first page until I finished the last with a satisfied sigh… It was a privilege to read it… One of the best books I’ve read.’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘So gripping… so shockingly absorbing I couldn’t put it down… Omg what a rollercoaster of a ride... Fantastic.’ Netgalley reviewer, ⭐⭐⭐⭐⭐‘Heartbreaking… An eye-opener… This page-turner World War 2 novel pulls you in and won’t let you go… Such a gripping and unputdownable book… One of the best WW2 historical fiction books I have read.’ Short Book Thyme, ⭐⭐⭐⭐⭐‘Amazing… I was totally absorbed in the story… 10 stars. One of my best reads this year.",
  "genres": [
    "Historical Fiction",
    "World War II",
    "Fiction",
    "Historical"
  ],
  "author": "Catherine Hokin",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/213542248-the-secret-hotel-in-berlin"
}