{
  "title": "After the Silence",
  "description": "Perfect for fans of The Killing or The Bridge, After the Silence is an utterly compelling crime debut set in Amsterdam. Jake Woodhouse's second novel, Into the Night, published March 2015. ***A body is found hanging on a hook above the canals of Amsterdam's old town, a mobile phone forced into the victim's mouth.In a remote coastal village, a doll lies in the ashes of a burnt-down house. But the couple who died in the fire had no children of their own. Did a little girl escape the blaze? And, if so, who is she and where is she now?Inspector Jaap Rykel knows that he's hunting a clever and brutal murderer. Still grieving from the violent death of his last partner, Rykel must work alongside a junior out-of-town detective with her own demons to face, if he has any hope of stopping the killer from striking again.Their investigation reveals two dark truths: everybody in this city harbours secrets - and hearing those secrets comes at a terrible price ...After the Silence introduces Inspector Jaap Rykel in a gripping debut police procedural from Jake Woodhouse, which is sure to appeal to fans of Ian Rankin, Peter Robinson and Stuart MacBride. This is the first novel in The Amsterdam Quartet series.PRAISE FOR After the Silence:'This gripping detective novel will thrill fans of The Girl With the Dragon Tattoo and bears comparison to Fatherland ... Utterly unputdownable' The Sun'Utterly enthralling ... looks set to be one of the key sequences in modern crime fiction' Barry Forshaw, Crimetime'After the Silence is as dark and twisty as the Amsterdam it navigates and Rykel a fascinating and original protagonist. A promising start to what could be a great series.' Stav Sherez, author of A Dark Redemption'Complex ... intriguing ... keeps the reader hooked' EurocrimeJake Woodhouse has worked as a musician, winemaker and entrepreneur. He now lives in London with his wife and their young gundog. After the Silence is the first book in his Amsterdam Quartet.",
  "genres": [
    "Crime",
    "Fiction",
    "Mystery",
    "Thriller",
    "Mystery Thriller"
  ],
  "author": "Jake Woodhouse",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/21353331-after-the-silence"
}