{
  "title": "EMDR Within a Phase Model of Trauma-Informed Treatment",
  "description": "A practical guide to learning and using EMDR Trauma is a potential source of most types of emotional or behavioral problems. Extensive research has shown EMDR to be an effective and efficient trauma treatment. EMDR Within a Phase Model of Trauma-Informed Treatment offers mental health professionals an accessible plain-language guide to this popular and successful method. The book also introduces the \"Fairy Tale Model\" as a way to understand and remember the essential phases of treatment and the tasks in each phase.This manual teaches a clear rationale and a systematic approach to trauma-informed treatment, including often-neglected elements of treatment that are essential to preparing clients for EMDR. The reader is led step by step through the treatment process, with scripted hands-on exercises to learn each skill. In addition to presenting the fundamental EMDR procedures, EMDR Within a Phase Model of Trauma-Informed Treatment teaches a treatment system that can be applied to a variety of cases. Using research-supported and proven-effective methods, this book takes you through the treatment process with easily-understood dialogues and examples. Explicitly guided exercises produce hands-on skills and familiarize you with ways to explain trauma to clients and prepare them for EMDR. You will also learn to problem-solve challenging cases using the trauma framework. EMDR Within a Phase Model of Trauma-Informed Treatment also includes an Instructor's Manual with:sample syllabusteaching tipsPowerPoint slidestest bank.Additional discussions address: why trauma mattersposttraumatic symptomsthe \"trauma wall\"the structure of trauma treatmentthe role of EMDRthe eight phases of EMDRpreparing clients for EMDRlegal and medical issues in EMDRproblem solving strategies in EMDR sessionstreatment strategies for a variety of presenting problemsusing EMDR with children and adolescentsuse and application of the \"fairy tale model\"on-line and digital resourcesDesigned to be a comprehensive primer, companion/supplemental textbook, and valuable reference resource, EMDR Within a Phase Model of Trauma-Informed Treatment is ideal for clinicians already trained in EMDR, those actively learning EMDR, and mental health professionals interested in EMDR. Note that to practice EMDR requires formal supervised training.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Counselling"
  ],
  "author": "Ricky Greenwald",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/2135349.EMDR_Within_a_Phase_Model_of_Trauma_Informed_Treatment"
}