{
  "title": "An Empire Divided: The American Revolution and the British Caribbean",
  "description": "There were 26—not 13—British colonies in America in 1776. Of these, the six colonies in the Caribbean—Jamaica, Barbados, the Leeward Islands, Grenada and Tobago, St. Vincent; and Dominica—were among the wealthiest. These island colonies were closely related to the mainland by social ties and tightly connected by trade. In a period when most British colonists in North America lived less than 200 miles inland and the major cities were all situated along the coast, the ocean often acted as a highway between islands and mainland rather than a barrier.The plantation system of the islands was so similar to that of the southern mainland colonies that these regions had more in common with each other, some historians argue, than either had with New England. Political developments in all the colonies moved along parallel tracks, with elected assemblies in the Caribbean, like their mainland counterparts, seeking to increase their authority at the expense of colonial executives. Yet when revolution came, the majority of the white island colonists did not side with their compatriots on the mainland.A major contribution to the history of the American Revolution, An Empire Divided traces a split in the politics of the mainland and island colonies after the Stamp Act Crisis of 1765-66, when the colonists on the islands chose not to emulate the resistance of the patriots on the mainland. Once war came, it was increasingly unpopular in the British Caribbean; nonetheless, the white colonists cooperated with the British in defense of their islands. O'Shaughnessy decisively refutes the widespread belief that there was broad backing among the Caribbean colonists for the American Revolution and deftly reconstructs the history of how the island colonies followed an increasingly divergent course from the former colonies to the north.",
  "genres": [
    "History",
    "American Revolution",
    "American History",
    "Nonfiction"
  ],
  "author": "Andrew O'Shaughnessy",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/2135900.An_Empire_Divided"
}