{
  "title": "Gerald Visits The Facility",
  "description": "Follow Gerald, a man who has made a living out of exploiting and selling submissive women, as he takes a tour of The Facility for Females, a shadow organization that has been silently correcting the secretly huge imbalance of women to men around the world, for centuries, reprogramming them to be the useful, intelligent, feminine, and insanely desirable creatures that they were meant to be.There is only one due to the possibility that any woman could be the next great changer of the world, be she an inventor or civil rights activist or anything, all women must remain ignorant of The Facility, as some just might choose a life of submission, and that could be disastrous in an era of equal rights for men and women. Once they are pulled in, however, they will quickly learn their place, through methods that range from devious to horrible.Gerald is joined by Amy, a fully trained inhabitant of The Facility, who essentially belongs to him while he is on the tour, acting as his guide while simultaneously driving him mad with desire and submissively explaining everything about the technologically advanced establishment as they go.Will his intuitive questions bring down the walls of her training, exposing the real Amy beneath? Or will she show him that the women of The Facility aren't reprogrammed at all, but deprogrammed, released from the social expectation that they should be anything like a man, as she truly seems to believe?Will Gerald's personal reservations about the wholesale subjugating of women prohibit him from taking a job offer, or will he somehow be otherwise convinced? The things that he will see, the things inflicted on the poor women who are brought to The Facility, will be far more intense than anything he has ever seen or done to a woman.Will he decide that this treatment of women is acceptable, or despicable?This novel, which is an account of Gerald's tour through The Facility contains over 70,000 words.No one will be bored with a tour through The Facility!",
  "genres": [],
  "author": "FerranArtist",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/21371029-gerald-visits-the-facility"
}