{
  "title": "Les Feluettes, ou La répétition d'un drame romantique",
  "description": "Originaire du Lac-Saint-Jean, Michel Marc Bouchard est l'un des dramaturges québécois les plus importants de sa génération. Outre Les Muses orphelines, il a écrit plus d'une vingtaine de pièces. Ses œuvres, pour lesquelles il a obtenu de nombreuses récompenses, sont traduites en plusieurs langues et présentées un peu partout dans le monde.  Les Feluettes est sans conteste la pièce maîtresse de Michel Marc Bouchard, celle qui l'a révélé au grand public et l'une des plus jouées de son répertoire – elle a été présentée, entre autres, à Paris, à Lyon et à Bruxelles. En 1952, un groupe d'anciens détenus séquestrent un évêque pour lui jouer des événements ayant eu lieu une quarantaine d'années auparavant – et ayant mené à la condamnation injuste de l'un des prisonniers, accusé du meurtre de l'homme qu'il aimait. Autour de cette intrigue, au contenu homosexuel explicite, gravitent des personnages étranges, frôlant l'irréalité : une comtesse folle à force d'attendre le retour de son mari et d'espérer la monarchie, un aristocrate français ruiné et un prêtre qui se sert du théâtre pour assouvir ses fantasmes homosexuels.  Dans le vocabulaire québécois, feluette est un terme péjoratif qui signifie homosexuel. Le fait que tous les personnages soient entièrement incarnés par des hommes, y compris les rôles de femme, ainsi que le mélange d'ironie féroce et de violence implacable contenu dans la pièce ont fait de cette œuvre un classique du répertoire québécois contemporain, qui a remporté de nombreux prix et distinctions. Lilies, la version cinématographique anglaise a reçu, entre autres, le grand prix du jury du Outfest Film Festival de Los Angeles, le prix du meilleur film au Lesbian and Gay Film Festival de San Francisco et le Génie du meilleur film canadien. --Anne-Marie Cloutier",
  "genres": [
    "Plays",
    "Theatre",
    "LGBT",
    "Drama",
    "Queer",
    "School",
    "Canada"
  ],
  "author": "Michel Marc Bouchard",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/2136690.Les_Feluettes_ou_La_r_p_tition_d_un_drame_romantique"
}