{
  "title": "Raising Skinny Elephants...",
  "description": "THIS 'CYMRU NOIR' CRIME THRILLER WILL KEEP YOU TURNING THE PAGES UNTIL THE FINAL LINE!One of the most authentic British crime thrillers you will read.A real rollercoaster ride that continues the story of Welsh serial killer Hagar.Raising Skinny Elephants is the second book in the series.Hal Griffiths is in Kenya taking photographs for National Geographic magazine, but cyber slayer Hagar is there too and wants revenge. As the grid begins to close around the serial killer there is another, outrageous twist in the tail. From the seedy bars of Nairobi to the beautiful shoreline of Lake Naivasha and the stunning vista of the Great Rift Valley Hal must once again fight for his life.A first rate sequel to Ctrl-Alt-Delete. Fast action, graphic violence, black comedy and drug-crazed sex – what more could a reader want!Praise for 'Ctrl-Alt-Delete'“I couldn't put this bloody book down! I was hooked from the start.”“A great thriller from David Lewis, gripping, scary stuff.”“I highly recommend this novel, it's a fantastic read and completely unputdownable.”“For anybody with a Facebook page this is a must read book.”“Thundering good read.”“A witty and intelligent read, with a helluva twist at the end.”\"More twists and turns than a Swiss mountain road this crime thriller starts in Africa and is the sequel to Ctrl-Alt-Delete.\"Authentic, fast-paced, and with a touch of black humour, you won’t want to put down ‘Raising Skinny Elephants' until the nail-biting conclusion.THE AUTHORDave Lewis has been a science teacher, BBC web producer, doorman, photographer & builder's labourer. He has a Zoology degree from Cardiff University and has travelled the world looking for wildlife. He is an award-winning writer and poet who founded the international Welsh Poetry Competition. Now he works full time as a book publisher and writer. If you enjoy crime thrillers, action, adventure, murder mystery, black comedy, technothrillers with bouts of juicy sex you can visit his writing website - www.david-lewis.co.ukThe Hagar TrilogyBook 1: Ctrl-Alt-DeleteBook 2: Raising Skinny Elephants...Book 3: iCommand",
  "genres": [],
  "author": "Dave  Lewis",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/21358999-raising-skinny-elephants"
}