{
  "title": "Symptoms of Homesickness",
  "description": "Collection of twenty original poems by expatriate Australian poet Nathanael O'Reilly. First published as a chapbook by Picaro Press in Australia in 2010.Praise for Symptoms of “Joseph Brodsky, the Russian Nobel laureate, once remarked that memory and art have in common the ‘ability to select, a taste for detail.’ In the work of Nathanael O'Reilly, memory and art come together to bring us poems that remember what cannot---what must not---be forgotten, in rich and telling detail and with a taste for quiet but incisive irony.” - Paul Kane, author of A Slant of Light, Work Life and Australian Romanticism and Negativity “These wonderfully crafted narrative poems capture the diasporic identity, somewhere between home and elsewhere, a metaphor for the unknown. I particularly enjoy their realism, the way in which they evoke the yearning for a reckless, peripatetic youth spent in rural towns, for teenage friendships, mateships, encounters with, or dreams of post-pubescent love. I like the arrangement of the poems too; it’s a fine, understated debut.” – Michelle Cahill, author of The Accidental Cage, Ophelia in Harlem and Vishvarupa “With an unmistakable Australian sensibility, O’Reilly summons the courage to face the places he’s left behind in these frank, but as often heartfelt poems. Readers both near to, and far away from, the particulars here will easily and equally relate as he mines the things, boyhood, sport, car trips, girls, that are familiar to growing up everywhere and with language that feels completely true.” - Jonathan Bennett, author of Here is my street, this tree I planted and Civil and Civic “Nathanael O’Reilly’s poems sound the major themes of Australian landscape, displacement, yearning, and above all a critique of cultural narrowness. O’Reilly’s plain-spoken diction is often laced with understated wit, but is given ballast by its principled grounding in lived experience.” - Nicholas Birns, author of Theory after Theory and co-editor of A Companion to Australian Literature Since 1900 “Poetry rich with imagery but controlled by emotional truth … a potent poetic combination … The most significant poems have me excited about the future possibilities that we are likely to see from this poet.” - E.A. Gleeson, author of In Between The Dancing “…will resonate with many Australian readers’ own experiences of growing up” – Deb Matthews-Zott, author of Shadow Selves and Slow Notes .",
  "genres": [
    "Poetry"
  ],
  "author": "Nathanael O'Reilly",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/21372849-symptoms-of-homesickness"
}