{
  "title": "Underground",
  "description": "They live below our cities, unknown but to a select few. Sara is pulled into their world when she is abducted off the street—disappearing from the human world as if she’d ceased to exist. Now she faces all new challenges. Will she become one of them? Will she fight the change and the people who abducted her? Or will she accept what happened? What will she do about her attraction to the man who took her out of her world and into his? No matter her choices she faces mortal danger, and it will take courage to see this through to the end.This is the sequel Fate is also available on Amazon. Praise for the \"Romantic and suspenseful!! Very well written…\"\"I couldn't put it down…\"\"I loved this novel! It's not easy to put down; it's sharp, witty, and keeps you guessing…\"(18+) Sexual Content This book has adult scenes, and is only suitable for adult entertainment. Themes include romance, romantic suspense, vampire, fiction, paranormal romance and many more.xxx About The Author xxxSandy was born and raised in Iowa, moved all over Minnesota and has finally put down roots in Texas. She attended the University of Northern Iowa, the University of Minnesota, and St. Mary’s University in Winona, Minnesota. She has four outstanding boys and a cat and dog. She has been writing since she was fourteen.Sandy always appreciates reviews and feedback on her work. If you buy this book or receive a copy though a KDP promotion, please tag and review it.xxx Exclusive Excerpts xxxTruth be known, he scared her badly. In spite of his gentleness with her so far, there was something hard and unforgiving about him. She could imagine him killing her if necessary. After all, he might have to anyway if she didn’t become infected. And what was this infection? Would she become sick? Was this some sort of plague? Biological warfare? Would she become heartless and whatever else John was? Would she too bring people in off the streets to make them like her? What would be the point of that? She couldn’t imagine any of it.And was any of his story true? All she really knew was that she was a captive here. Maybe what he called an infection was an analogy for something else? And what if this is what happened to everyone who disappeared? Her thoughts shied away from that thought. No one ever returned. No, that couldn’t be it. There had to be some other explanation. Maybe this was some sort of creepy porn ring? Yeah, probably more likely to go back to the dream scenario.As she felt weariness pressing in on her, she decided to sleep now and possibly explore later. She curled up on the bed, marveling that only hours ago she had been on her way to the impound lot to get her car. What if she had taken a different street? Or asked for directions? As she drifted into sleep, she wondered if she could be pregnant. Then an exhausted sleep took her away.xxxShe took off her clothes, gritting her teeth to keep them from chattering. Maybe he should bite her instead. Maybe he just used that to keep his women willing. No, in case he was telling the truth, she didn’t want it. She had experienced enough pain today. Besides, the sex hadn’t been terrible, far from it. But she was still angry with him, and was afraid of him, and afraid for herself. And she was tired. Horribly tired.She lay on the bed without a word, determined to lie there like a dead thing. As if he would care anyway. She felt the bed move as he stretched out next to her, and felt his breath stir her hair. She shivered.He touched her gently, neutrally, on her shoulder, and she shivered again. He didn’t kiss her but moved his hands over her, awakening her senses against her will. At some point, she realized that she was breathing faster and was anxious for him to get on with it. Her eyes flew open, and he turned to kiss her. She turned her face away. He stopped.",
  "genres": [],
  "author": "Sandy Holden",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/21365975-underground"
}