{
  "title": "The Lost: A Search for Six of Six Million",
  "description": "In this rich and riveting narrative, a writer's search for the truth behind his family's tragic past in World War II becomes a remarkably original epic—part memoir, part reportage, part mystery, and part scholarly detective work—that brilliantly explores the nature of time and memory, family and history.The Lost begins as the story of a boy who grew up in a family haunted by the disappearance of six relatives during the Holocaust—an unmentionable subject that gripped his imagination from earliest childhood. Decades later, spurred by the discovery of a cache of desperate letters written to his grandfather in 1939 and tantalized by fragmentary tales of a terrible betrayal, Daniel Mendelsohn sets out to find the remaining eyewitnesses to his relatives' fates. That quest eventually takes him to a dozen countries on four continents and forces him to confront the wrenching discrepancies between the histories we live and the stories we tell. And it leads him, finally, back to the small Ukrainian town where his family's story began, and where the solution to a decades-old mystery awaits him.Deftly moving between past and present, interweaving a world-wandering odyssey with childhood memories of a now-lost generation of immigrant Jews and provocative ruminations on biblical texts and Jewish history, The Lost transforms the story of one family into a profound, morally searching meditation on our fragile hold on the past. Deeply personal, grippingly suspenseful, and beautifully written, this literary tour de force illuminates all that is lost, and found, in the passage of time.***Depuis qu’il est enfant, Daniel Mendelsohn sait que son grand-oncle Shmiel, sa femme et leurs quatre filles ont été tués, quelque part dans l’est de la Pologne, en 1941. Comment, quand, où exactement ? Nul ne peut lui en dire plus. Et puis il découvre ces lettres désespérées écrites en 1939 par Shmiel à son frère, installé en Amérique, des lettres pressant sa famille de les aider à partir, des lettres demeurées sans réponse... Parce qu’il a voulu savoir ce qui s’est passé, parce qu’il a voulu donner un visage à ces six disparus, Daniel Mendelsohn est parti sur leurs traces, rencontrant, année après année, des témoins épars dans une douzaine de pays. Cette quête, il en a fait un livre, puzzle vertigineux, roman policier haletant, plongée dans l’Histoire et l’oubli – un chef-d’œuvre. « Daniel Mendelsohn a écrit une œuvre puissamment émouvante sur le passé \" ; perdu \" ; d’une famille, qui rappelle à la fois l’opulence des œuvres en prose de Proust et les textes elliptiques de W.G. Sebald. Une réussite exceptionnelle. » Joyce Carol Oates « Les Disparus est une bouleversante enquête de détective à part entière, doublée d’un questionnement sur les interventions énigmatiques de Dieu dans les affaires humaines, et approfondie par une réflexion sur la part d’inéluctable et d’incompréhensible que le hasard introduit dans l’Histoire. » John Maxwell Cœtzee « Entre épopée et intimité, méditation et suspense, tragédie et hilarité, Les Disparus est un livre merveilleux. » Jonathan Safran Fœr « Mendelsohn réussit à assembler un tableau immensément humain dans lequel chaque témoin a un visage et chaque visage une histoire et un destin. » Elie Wiesel",
  "genres": [
    "Nonfiction",
    "History",
    "Holocaust",
    "Memoir",
    "World War II",
    "Biography",
    "Jewish"
  ],
  "author": "Daniel Mendelsohn",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/112286.The_Lost"
}