{
  "title": "Eterna Magia",
  "description": "Uma graphic novel sobre uma bruxa ciumenta, uma maldição arrasadora e a jornada de uma garota para salvar sua família a qualquer custo.A jovem Vonceil vive na fazenda da família em Oklahoma, nos Estados Unidos. Quando Elber, seu irmão mais velho, volta para casa depois de servir na linha de frente da Primeira Guerra Mundial, as coisas não ocorrem como ela esperava. As experiências de Elber na guerra o transformaram em um homem sério e responsável que não tem mais tempo para a irmã. Para piorar, ele se casa com a mulher que havia deixado antes de ir à guerra.Um dia, uma mulher bela, elegante e misteriosa aparece na fazenda e confronta Elber por tê-la abandonado na França. Quando ele se recusa a deixar a esposa, ela lança uma maldição no poço da família, transformando todo o abastecimento da cidade em água salgada. Quem é essa senhora toda vestida de branco? O que ela fez com a fazenda? Como salvar sua família?Assim começa a premiada graphic novel Eterna Magia, de Hope Larson e Rebecca Mock. Os darksiders já conhecem Larson por sua adaptação para quadrinhos do clássico Uma Dobra no Tempo, de Madeleine L’Engle. Agora é a hora de conhecer uma de suas obras em parceria com Mock, em uma história que mistura fantasia, western, aventura e drama familiar, vencedora do prêmio Eisner na categoria de Melhor Publicação para Crianças de 9 a 12 anos, e citada em várias listas de leitura dos Estados Unidos.A arte de Mock é descontraída e fluida. Cada quadro cintila com um trabalho de cores preciso e um jogo de sombras eficiente, destacando o lado sombrio do mundo imaginado por Larson, que mistura entre o fabuloso e o histórico e vai encantar os leitores.Para salvar a família, Vonceil terá que se aventurar sozinha e mergulhar fundo no mundo da bruxaria, enfrentando parentes perigosos, animais que se transformam, uma bruxa bondosa, porém cheia de caprichos, e a misteriosa e ameaçadora Dama de Branco. Eterna Magia é uma leitura perfeita para fãs de O Príncipe e a Costureira, Francis, Mooncakes, O Fantasma de Anya e A Canção Fantasma. A atmosfera bruxesca também conecta a marca DarkSide® Graphic Novel com a magia do universo Magicae.Hope Larson é ilustradora e quadrinista. Conhecida pelos roteiros das histórias da Batgirl, da DC Comics, recebeu um Eisner Award em 2007. Além de sua adaptação do clássico Uma Dobra no Tempo, de Madeleine L’Engle (DarkSide® Books, 2018), ela publicou títulos como Gray Horses, Compass South, Knife’s Edge e Goldie Vance. Atualmente, vive na cidade de Asheville, nos Estados Unidos.Rebecca Mock é quadrinista. Ilustrou as graphic novels Compass South e Knife's Edge, ambas escritas por Hope Larson. Seu trabalho também apareceu em várias publicações, incluindo o New York Times e The New Yorker. Participou da organização da antologia Hana Doki Kira. Mora no Brooklyn, em Nova York.“Com detalhes suntuosos em todos os aspectos, leitores de todas as idades serão fisgados por esse conto de fadas único e moderno. Hope Larson e Rebecca Mock pegam uma história repleta de fantasia e imaginação e a revestem com grande humanidade e profundidade. Um livro para ser lido várias e várias vezes” — Jen Wang, autora de O Príncipe e a Costureira“A alquimia perfeita de ilustração deslumbrante e uma história ricamente imaginada.” — Victoria Ying, autora de City of Secrets",
  "genres": [
    "Graphic Novels",
    "Fantasy",
    "Middle Grade",
    "Historical Fiction",
    "Historical",
    "Young Adult",
    "Fiction"
  ],
  "author": "Hope Larson",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/213868332-eterna-magia"
}