{
  "title": "The River of Lost Footsteps: Histories of Burma",
  "description": "For nearly two decades Western governments and a growing activist community have been frustrated in their attempts to bring about a freer and more democratic Burma--through sanctions and tourist boycotts--only to see an apparent slide toward even harsher dictatorship. But what do we really know about Burma and its history? And what can Burma's past tell us about the present and even its future?In \"The River of Lost Footsteps,\" Thant Myint-U tells the story of modern Burma, in part through a telling of his own family's history, in an interwoven narrative that is by turns lyrical, dramatic, and appalling. His maternal grandfather, U Thant, rose from being the schoolmaster of a small town in the Irrawaddy Delta to become the UN secretary-general in the 1960s. And on his father's side, the author is descended from a long line of courtiers who served at Burma's Court of Ava for nearly two centuries. Through their stories and others, he portrays Burma's rise and decline in the modern world, from the time of Portuguese pirates and renegade Mughal princes through the decades of British colonialism, the devastation of World War II, and a sixty-year civil war that continues today and is the longest-running war anywhere in the world.\"The River of Lost Footsteps\" is a work both personal and global, a distinctive contribution that makes Burma accessible and enthralling. Thant Myint-U, educated at Harvard and Cambridge, has served on three United Nations peacekeeping operations, in Cambodia and in the former Yugoslavia, and was more recently the head of policy planning in the UN's Department of Political Affairs. He lives in New York City.",
  "genres": [
    "History",
    "Nonfiction",
    "Asia",
    "Travel",
    "Politics",
    "Biography",
    "Historical"
  ],
  "author": "Thant Myint-U",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/112293.The_River_of_Lost_Footsteps"
}