{
  "title": "Shattered Resistance",
  "description": "Everyone has a secret…Lady Myranthe Delmare has two wishes—to ensure the right man rules her kingdom and uncover why her sister has suddenly fallen mute. Her efforts to uncover the answer to both place her directly in the path of the very man she’s sent to spy on—King Naturo Endarison. When efforts to undermine both king and kingdom place everyone in danger, Myranthe finds herself trapped in an agreement that demands her own silence. As war looms, Myranthe is forced to choose between condemning her family or her kingdom…and the king who conceals a deadly secret.Librarian Elmery Nemorio has no idea why a group of deranged lunatics want her dead, but she does know she will lose her sanity if she has to spend one more minute with her sarcastic bodyguard, Vladic Cindari. Unfortunately, as danger grows and more attempts on her life are made, she begins to suspect Vladic is the least of her worries. Forced from her home and into a life of peril and unwanted adventure, Elmery doesn’t know what the next day will bring. Joined by the annoying Vladic, she finds herself immersed in a renewed battle not only for her home, but for all the lands. As loyalties are questioned and evil threatens the Coastlands’ hard-won peace, a king must rise, an unwilling soldier must again fight, and a noblewoman and librarian caught in the crossfire of schemes and danger must decide if standing for the truth is worth losing those they love.Shattered Resistance is a New Adult Christian fantasy Little Mermaid retelling, and is the third book in The Shattered Lands series.The Shattered LandsShattered Revision - Prequel (Available for Preorder)Shattered Reflection - Book OneShattered Reaction - Book TwoShattered Resistance - Book ThreeShattered Redemption - Book Four (Available for Preorder)Shattered Risk - Novella (Coming late 2025)",
  "genres": [
    "Fantasy",
    "Romance",
    "Christian Fantasy"
  ],
  "author": "Madisyn Carlin",
  "average_rating": "4.91",
  "url": "https://www.goodreads.com/book/show/213866168-shattered-resistance"
}