{
  "title": "A Land of Fire",
  "description": "In A LAND OF FIRE (BOOK #12 IN THE SORCERER S RING), Gwendolyn and her people find themselves surrounded on the Upper Isles, besieged by Romulus dragons and his million man army. All seems lost when salvation comes from an unlikely source. Gwendolyn is determined to find her baby, lost at sea, and to lead her nation-in-exile to a new home. She travels across foreign and exotic seas, encountering unthinkable dangers, rebellion and starvation, as they sail for dream of a safe harbor. Thorgrin s finally meets his mother in the Land of the Druids, and their meeting will change his life forever, make him stronger than he has ever been. With a new quest, he embarks, determined to rescue Gwendolyn, to find his baby, and to fulfill his destiny. In an epic battle of dragons and of men, Thor will be tested in every way; as he battles monsters and lays down his life for his brothers, he will dig deeper to become the great warrior he was meant to be. In the Southern Isles, Erec lies dying, and Alistair, accused of his murder, must do what she can to both save Erec and absolve herself of guilt. A civil war erupts in a power struggle for the throne, and Alistair finds herself caught in the middle, with her fate, and Erec s, hanging in the balance. Romulus remains intent on destroying Gwendolyn, Thorgrin, and what remains of the Ring; but his moon cycle is coming to an end, and his power will be severely tested. Meanwhile, in the Northern province of the Empire, a new hero is rising: Darius, a 15 year old warrior, who is determined to break off the chains of slavery and rise up amongst his people. But the Northern Capitol is run by Volusia, a 18 year old girl, famed for her beauty and famed also her barbaric cruelty. Will Gwen and her people survive? Will Guwayne be found? Will Romulus crush the Ring? Will Erec live? Will Thorgrin return in time?",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Adventure",
    "Audiobook",
    "Magic",
    "Epic"
  ],
  "author": "Morgan Rice",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/21393717-a-land-of-fire"
}