{
  "title": "The Essentials of Parental Alienation Syndrome: It's Real, It's Here and It Hurts",
  "description": "We are seeing an increase in high conflict, adversarial divorce cases in mental health practices and in the courtrooms around the country. These cases present with a significant amount of parental conflict and, as a consequence, represent a threat to the children caught in the middle of these conflicts. Curiously, there is a great commonality among these cases in terms of the tactics alienators use to separate a parent from his or her children. It is almost as if they, the favored parent, were reading from a published playbook. Many evaluators and clinicians include Parental Alienation (PA) as well as Parental Alienation Syndrome (PAS) in the same category when discussing this topic. PAS is acknowledged as being extremely controversial. It is controversial within the mental health profession and equally controversial within the legal profession. The purpose of this work is to share ideas, thoughts, background, theory and some experiences in working with high conflict families. It is important for professionals to get a sense of both sides of the PAS issue. Whether one uses PAS as a term, the problems brought by these cases are very real. The reluctance to consider PAS by name in the psychological and legal communities tends to contribute to the perpetuation of the problem in a variety of ways. Like any other designation, PAS can be and is misapplied and misused. Whether or not it is the appropriate diagnosis or description of behavior in a case must be determined by facts of that case and supported by evidence and data from multiple sources. An appropriate diagnosis and identification of PAS, along with a description of the severity, can make the difference between timely and effective interventions or allowing parents and children to be scarred for the rest of their lives.This work was compiled from a number of recordings of continuing legal education workshops and seminars that the authors had conducted over the last few years. In addition, the content was embellished with content from a number of papers that the authors published along the way. Some of these can be seen on the authors’ websites, www.drbobevans.com and www.jmichaelbone.com . Also, the works of Richard Gardner (1998), the original author of the disorder referred to as Parental Alienation Syndrome, were reviewed and selected ideas and content are inserted into this work. Both authors are contributors to the proposed diagnosis for inclusion into the next edition of the Diagnostic and Statistical Manual published by the American Psychiatric Association and some of that work is include herein.The authors are very grateful for having the experience and honor of working with Dr. Gardner when he was alive. He was a man of unusual talent, a prolific writer and a pioneer in the field of forensic psychiatry. Unfortunately, much of his work is misquoted, exaggerated and at times misunderstood. This book is simply a snapshot or overview of Parental Alienation and Parental Alienation Syndrome and should be used as an outline in working with this disorder. Readers are encouraged to read Dr. Gardner’s works and others thoroughly in order to have a working knowledge so they can work with the children and families who have become victims of this terrible malady.",
  "genres": [],
  "author": "J. Michael Bone",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/21378394-the-essentials-of-parental-alienation-syndrome"
}