{
  "title": "The Captain's Coin",
  "description": "The Captain’s Coin is the story of an immigrant 13 year old youth escaping the web of starvation and death in his native County Cork during the Potato Famine. Michael Brady, young, naïve and afraid sets foot in a strange city, intent on surviving. His story will resonate well with anyone who has had to reexamine the direction of their lives while readjusting to the realities of life’s challenges. The Captain’s Coin is a fictional account of Michael Brady’s journey from Ireland to America in 1848 aboard a ‘coffin ship’ to New York City at the height of the Irish Potato Famine. Once aboard, Michael wins the respect of the captain who gives him a token ‘good luck coin’ and a letter of recommendation to a leading New York businessman. This opening allows him to rise up the corporate ladder, marry an abolitionist only to suffer the loss of this young wife at the onset of the Civil War. Volunteering his services to offset his grief, he saves the Union at the Battle of Antietam, his ‘lucky coin,’ deflecting a life-threatening wound and thus saving his life. He returns home a hero and is elected to the NYS Assembly, rising to Speaker and running for Governor in 1888. Michael Brady’s journey is a journey from destitution to the pinnacle of political power. His story will enrich those who have had to cope with sudden and catastrophic challenges. It is a story of strength and hope and the ultimate will to survive. Born in Troy, New York, John V. Amodeo now lives in the Hell's Kitchen area of Manhattan. For three decades, Amodeo worked for the NYC public school system as assistant principal and history department head; now retired from that post, he is an adjunct professor of American history and political science at Mercy College. Amodeo exercises his love for NYC as a part-time tour guide. His previous books 'Voices of Hell's Kitchen,' a fictional account of the myriad personalities of his unique neighborhood. In addition, he wrote, 'Believe--Journey from Jacksonville,' a biography of former world boxing champion, Ken Norton and 'Blessed or Cursed,' a biography of WBF current light heavy champion, Rayco Saunders. Currently, he is working on his next project, a biography of Paul Vaden, former world light middleweight champion in upcoming 'Answer the Bell.'",
  "genres": [],
  "author": "John V. Amodeo",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/21378445-the-captain-s-coin"
}