{
  "title": "A Knight's Duty",
  "description": "He has a duty to his king and country and has no time or interest in love... Enemies to the throne roam the land, threatening the security of the kingdom just as rumors and accusations of high treason reach King Edward's ear. In an effort to provide security to the state, the king dispatches Derrik d'Evant, a trusted young knight and royal envoy, to locate the mastermind behind the threat, and bring the traitorous lord to stand trial. When Derrik arrives at Stanbury Castle, the lord's beautiful daughter greets him with hostility. But even with the cold reception and knowing that it is unwise to become entangled with a traitor's daughter, he is unable to resist the fiery beauty or her magnetic allure. And as he accompanies her on her quest, she invokes within him a long neglected and scorching need that grows, threatening to consume him in its power. Yet through all this, he knows that he must cast aside his feelings for her, remembering all too well that he is on a mission -- a mission where failure cannot occur.She acts out of devotion for her family and discovers love of a different kind... Amelie de Calmette, forced to acknowledge the consequences of the treasonous allegations against her father, knows that few people live to see the light of day if they are accused of this serious crime. Her heart and mind convinces her that her father is innocent. And while the handsome knight assists her in searching for answers, she cannot bring herself to fully trust him, nor can she fight the spark of desire that ignites and burns whenever he is near.And even as they follow their own agendas, they must suspend their suspicions long enough for them to join forces. Then as they get closer to finding the truth, they become ensnared in a complicated web of royal treachery, dangerous temptation, and cruel deception. They must choose either to distrust each other or believe what is within their hearts, for nothing is as it seems when duty and passion While this story is part two of The Knights of Honor Trilogy, it can be read as a stand-alone book.",
  "genres": [
    "Historical Romance"
  ],
  "author": "Dana D'Angelo",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/21383500-a-knight-s-duty"
}