{
  "title": "No One Will Save Us",
  "description": "Winner of the Independent Press Award for African American Fiction • Winner of the Reader Views Literary Award for Global-Africa Fiction • Finalist for the Reader Views Literary Award for Historical Fiction • Finalist for the CIBA Chaucer Award • Finalist for the CIBA Award for alternative-history fiction“In a time when many women across the world may be fearful of losing their rights and voices, Julie L. Brown provides audiences with a book as a reminder to them to never surrender.”—Reader Views“Imagine a cross between Chinua Achebe’s masterpiece Things Fall Apart and the first Black Panther movie—that’s how good this novel is.”—JJ Amaworo Wilson, author of NazaréHer destiny was certain. Until it wasn’t.Exploring her beloved forest, young Princess Chibuike “Chi” encounters a man unlike any she has seen. His skin is as pale as the moon that watches over the Queendom of Kana, a land where women rule fiercely and freely.Ten dry seasons later, in 1619, Chi, now a seasoned warrior in the Kanaian army, and preparing for her own future as queen, faces a mystery that threatens the existence of Kana. The once-peaceful queendom is upended when nearby villagers disappear en masse, including their ruling families—and one of Chi’s closest friends. Chi vows to find her missing landspeople and bring them home, no matter where they are. She and the women warriors travel across the ocean to Jamestown, Virginia to face down the pale men who have built a trade in human beings.To change the course of history for her people and herself requires Chi to discover a new kind of bravery and her true destiny.Julie L. Brown’s No One Will Save Us is a sweeping novel of alternative history that explores what it means to be free and the resilience it takes to keep it.",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Julie L.  Brown",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/213914291-no-one-will-save-us"
}