{
  "title": "The Paths We Choose: A Memoir",
  "description": "With over ten million albums sold and multiple Grammy nominations, the hard rock band Godsmack has become one of the most successful groups of the last decade. The band's driving beats and searing lyrics have garnered widespread acclaim, while their well-known work ethic has earned the industry's respect. Fans who attend Godsmack concerts are sure to be rewarded with a fiercely energetic show. The force behind the band comes largely from founder and front man Sully Erna. Onstage, growling into the microphone with characteristic intensity, he appears perfectly at home, and it's no wonder. Erna has been immersed in the world of rock ever since he got his first drum set at the age of five. Given his achievements, that early start might suggest that his career was a straight shot to the top. The truth is, Erna took so many detours during the years between his first drums and Godsmack's first contract that, more than once, he nearly forgot his destination. In The Paths We Choose, he relates the turbulent story of his life before the platinum albums and packed arenas. \"The Lawrence I remember was full of murderers, thieves, and rapists and half the time those people were your next-door neighbors,\" Erna writes of his childhood hometown in the gritty Boston suburbs. Although the danger of the streets was a constant reality, young Sully's world really revolved around music. From the day he convinced his mom to pay for drum lessons, \"beating the skins\" was all he ever wanted to do. As he grew older, Erna began devoting all his energy to one band after another. Life as a marginally-successful (and sometimes downright unsuccessful) musician was always unpredictable, and Sully's good times were equally matched by his frustrations. He learned that talent and passion were not enough; he also had to know who to trust. Beautiful blondes attracted Erna like a moth to an open flame, and his affairs with them were intense and often unstable. Outwardly hardened, yet privately vulnerable, he couldn't open up. This, combined with his high-adrenaline lifestyle, seemed bound to catch up with him and did. Here, Sully delves with surprising sensitivity into the emotional struggles that almost forced him to abandon his ambitions. Musical fame was never a given for Sully Erna. He could easily have continued to be \"just another punk on the streets.\" The extraordinary success he now enjoys with Godsmack only came by an unlikely combination of talent, sweat, lucky breaks, and hard falls. Any one of the decisions he made along the way could have brought him to a dead end. But that just might be the whole point. Sully's story shows us that whatever hardship we may face, ultimately, our choices determine our destiny. He's made the most of every advantage and obstacle he has faced, and reminds us that we can, too. But for Sully, career success is not an ultimate destination. Every day brings a new fork in the road another path to choose.",
  "genres": [
    "Nonfiction",
    "Music",
    "Biography",
    "Autobiography",
    "Memoir"
  ],
  "author": "Sully Erna",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/213750.The_Paths_We_Choose"
}