{
  "title": "Constricted",
  "description": "The world sundered and the demons arose, warring against those neither God nor Satan had wanted. Humanity ended. The nephilim, elioud, vampires, and witches inhabited the shards around the globe and rose in power, as the gates of Hell unleashed in the south. The world quickly lost technology and industry, as innovation and invention plummeted, and reverted to steam power and bio-fuel. Korrigan trained most of her life as a courtesan, submitting to the will of men and caring for the other brothel inhabitants. Beyond the brothel walls of Hampshire House, lay a broken world torn deep into the final stages of Revelation. Beaten, used, and starved, all Korrigan understood were the rules her master enforced, and there was no escape, hope, or love for women in her situation. What she learned of the world around her wasn’t the reality.Petre searched for the perfect woman to break his immortal curse.Three hundred years ago, the young Baron witnessed his brother’s heinous crime. Petre’s family forced him to lie, thus spared his twin brother’s death and their family name. The warlock Hestin sought retribution, and his revenge transpired, hexing both brothers with immortality to atone for their sins. Cursed, the brothers roamed through life, slipping closer to their demonic sides, until he saw her. Sold to Petre in Arcadia, Korrigan stumbled through her journey of love, treachery, and forgiveness. Secrets and lies whispered in the dark recesses of her mind as her past haunted her sleeping moments. What if all her master taught her proved to be wrong? The weight of her new world compounded on her shoulders. Torn between her heart and revenge, Korrigan hatched a plan to liberate the brothels and tear down the walls, but could she put her pride and wrath aside to save the one she loves?Beyond the Brothel Walls Saga #1Lust ruled the demons. Seven signs had come and gone. Sloth ruled the vampires. Seven angels fell to the Earth. Envy ruled the courtesans. Seven keys lay hidden amongst the seven nephilim families. Gluttony ruled the rich. Seven families rose and fell. Wrath ruled the Horsemen. One family would bring the world to its knees. Pride ruled the Morning Star. The Horsemen must seize the keys. Greed ruled the world.*The Beyond the Brothel Saga is a dark, post-apocalyptic paranormal romance written for mature adults and contains graphic sex not suitable for audiences under 18 years of age.",
  "genres": [
    "Paranormal",
    "Dark",
    "Vampires"
  ],
  "author": "Rae Z. Ryans",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/21394717-constricted"
}