{
  "title": "Sapphire Shade",
  "description": "What if human beings are merely the ancestors of a highly intelligent master race, called the Ikhälea, which controls everything in the universe from dreams to the afterlife? When it is discovered that the balance of evolution has been upset and the people of Earth are on a path to eventual self-destruction, a young Irish immigrant learns that she is only one who can save humanity from extinction.Twenty-one-year-old Asiah O’Connor, the youngest daughter of a poor Irish fisherman, received a peculiar portent on the passage from Ireland to America nearly nine years ago. Now, as the country suffers through the Great Depression, Asiah has all but forgotten about the fleeting premonition until she meets a dark stranger one windy afternoon in Chicago. Chase Brandon, the only remaining Ikhälean Conjurer on Earth, nearly stumbles over the beautiful young woman for whom he’s been searching for over seven centuries in the middle of a busy street. He is exhilarated at first that, in finding her, his mission is nearly complete and his long, desolate existence is finally at an end.While Asiah comes to terms with her new destiny, she must decide between the two men in her her wealthy fiancé, Walter, who promises to support her struggling family through the economic crisis, and the mysterious sorcerer whose touch sets her skin on fire. With his death imminent, Chase also must choose between his unexpected feelings for Asiah and his sacred duty to instruct her in the ancient arts of the Ikhälea.Told from alternating points of view, this first installment in the romantic fantasy series about ill-fated love travels from Chicago’s underground speakeasies to a dodgy insane asylum, to a secluded cottage where magic isn’t just a myth, it is the key to humanity’s survival.",
  "genres": [
    "Romance",
    "Fantasy",
    "Science Fiction"
  ],
  "author": "Ann Serafini",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/21395247-sapphire-shade"
}