{
  "title": "Eating for Life: Your Guide to Great Health, Fat Loss and Increased Energy!",
  "description": "Did you truly enjoy the food you ate today? Do you really like the way you look and feel? Are you consistently enjoying great health and high energy?Bill Phillips, author of the #1 New York Times bestseller Body-for-LIFE, believes your answer to all of the above questions should be, \"Yes!\" He feels that food should be a source of pure pleasure. A source of positive, abundant energy! A \"sure thing\" in a world of much uncertainty.Phillips, who's widely regarded as today's most successful fitness author, has firm beliefs which go against the grain of today's popular weight-loss methods. \"Diets, all of them, are potentially dangerous, most always dumb and ultimately a dead-end street!\" he insists. \"Eventually, anyone and everyone who's at all concerned with their health must learn how to feed their body, not how to starve it.\"Instead, Phillips encourages a safe and sound solution which includes eating balanced, nutrient-rich meals, frequently throughout the day. \"This is what works in the long run,\" he explains.Rich with common sense and science, Eating for Life has rhyme and reason. It is specific. There are very clear dos and don'ts which help people enjoy food and improve their overall fitness.Bill's approach, which he calls the \"Eating for Lifestyle,\" has already helped thousands of people break free from the dieting dilemma and discover that, contrary to pop-culture belief, food is friend, not foe. Used intelligently, it nourishes the body and mind, satisfies the appetite, calms cravings, renews health and lifts energy.Like Bill Phillips' Body-for-LIFE, this is a tell-it-like-it-is book. There's no promise of a quick fix. No metabolic tricks or so-called miracles. Just straightforward, clear, concise, practical and appropriate principles for eating right... for life.",
  "genres": [
    "Cookbooks",
    "Health",
    "Nonfiction",
    "Cooking",
    "Self Help",
    "Food",
    "Reference"
  ],
  "author": "Bill Phillips",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/1123.Eating_for_Life"
}