{
  "title": "An Imperfect Offering: Humanitarian Action in the Twenty-first Century",
  "description": "As Albert Camus wrote, the doctor’s role is as a witness–to witness authentically the reality of humanity, and to speak out against the horrors of political inaction. . . . The only crime equaling inhumanity is the crime of indifference, silence, and forgetting.—James OrbinskiIn 1988, James Orbinski, then a medical student in his twenties, embarked on a year-long research trip to Rwanda, a trip that would change who he would be as a doctor and as a man. Investigating the conditions of pediatric AIDS in Rwanda, James confronted widespread pain and suffering, much of it preventable, much of it occasioned by political and economic corruption. Fuelled by the injustice of what he had seen in Rwanda, Orbinski helped establish the Canadian chapter of Médecins Sans Frontières (Doctors Without Borders/MSF). As a member of MSF he travelled to Peru during a cholera epidemic, to Somalia during the famine and civil war, and to Jalalabad, Afghanistan.In April 1994, James answered a call from the MSF Amsterdam office. Rwandan government soldiers and armed militias of extremist Hutus had begun systematically to murder Tutsis. While other foreigners were evacuated from Rwanda, Orbinski agreed to serve as Chef de Mission for MSF in Kigali. As Rwanda descended into a hell of civil war and genocide, he and his team worked tirelessly, tending to thousands upon thousands of casualties. In fourteen weeks 800,000 men, women and children were exterminated. Half a million people were injured, and millions were displaced. The Rwandan genocide was Orbinski’s undoing. Confronted by indescribable cruelty, he struggled to regain his footing as a doctor, a humanitarian and a man. In the end he chose not to retreat from the world, but resumed his work with MSF, and was the organization’s president when it was awarded the Nobel Peace Prize in 1999.An Imperfect Offering is a deeply personal, deeply political book. With unstinting candor, Orbinski explores the nature of humanitarian action in the twenty-first century, and asserts the fundamental imperative of seeing as human those whose political systems have most brutally failed. He insists that in responding to the suffering of others, we must never lose sight of the dignity of those being helped or deny them the right to act as agents in their own lives. He takes readers on a journey to some of the darkest places of our history but finds there unimaginable acts of courage and empathy. Here he is doctor as witness, recording voices that must be heard around the world; calling on others to meet their responsibility.Ummera, ummera–sha is a Rwandan saying that loosely translated means ‘Courage, courage, my friend–find your courage and let it live.’ It was said to me by a patient at our hospital in Kigali. She was slightly older than middle aged and had been attacked with machetes, her entire body rationally and systematically mutilated. Her face had been so carefully disfigured that a pattern was obvious in the slashes. I could do little more for her at that moment than stop the bleeding with a few sutures. We were completely overwhelmed. She knew and I knew that there were so many others. She said to me in the clearest voice I have ever heard, “Allez, allez. Ummera, ummera-sha”–‘Go, go. Courage, courage, my friend–find your courage and let it live.’—From An Imperfect Offering",
  "genres": [
    "Nonfiction",
    "Medicine",
    "Medical",
    "Africa",
    "Memoir",
    "Biography",
    "History"
  ],
  "author": "James Orbinski",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/2140743.An_Imperfect_Offering"
}