{
  "title": "Writing A Non-Fiction Business Book The Ultimate Authority Marketing Piece",
  "description": "How long have you wanted to be able to say that you are an author?how to write a non fiction business bookThere are many different reasons to write a business book and just as many excuses for why most \"aspiring authors\" never publish. This book will walk you through the steps of discovering a topic, titling your book, figuring out the best platform for publication and more.We wrote this book for serious business people who have achieved success and now want to share that knowledge by writing a book.The big myth today is that everyone is an author. There are actually a very small percent of the people who dream of writing a book who actually publish a book. Putting yourself out there is an act of bravery that few are willing to attempt.Who is this book for? Business owners and entrepreneurs Successful business people who have overcome all obstacles to get where they are today Experts in industry who have a message to share Industry titans who know they can help ˃˃˃ The Topics That Are Covered Include:IntroductionHow To Pick A TopicResearching Current TitlesWho Is Your ReaderBook-Book or EbookTraditional or Self PublishedWriting Your BookGenerating OpportunitiesDominating Your NicheWays To Monetize Your BookConclusion˃˃˃ Stop wondering what to do and get started on your non-fiction business bookReading through all the gimmicky titles for how to write a non fiction book can be very discouraging (and a little creepy). There are no get \"rich quick tips\" or \"how to write a book in a weekend\" ideas, just solid advice from published authors who have been right where you are now - wondering how to write a business book that will showcase your knowledge and help others get to where you are now, just with fewer troubles along the way.",
  "genres": [
    "Writing"
  ],
  "author": "Rebekah Welch",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/21406568-writing-a-non-fiction-business-book-the-ultimate-authority-marketing-pie"
}