{
  "title": "In an Instant: A Family's Journey of Love and Healing",
  "description": "In one of the most anticipated books of the year, Lee Woodruff, along with her husband, Bob Woodruff, share their never-before-told story of romance, resilience, and survival following the tragedy that transformed their lives and gripped a nation.In January 2006, the Woodruffs seemed to have it all–a happy marriage and four beautiful children. Lee was a public relations executive and Bob had just been named co-anchor of ABC’s World News Tonight. Then, while Bob was embedded with the military in Iraq, an improvised explosive device went off near the tank he was riding in. He and his cameraman, Doug Vogt, were hit, and Bob suffered a traumatic brain injury that nearly killed him.In an Instant is the frank and compelling account of how Bob and Lee’s lives came together, were blown apart, and then were miraculously put together again–and how they persevered, with grit but also with humor, through intense trauma and fear. Here are Lee’s heartfelt memories of their courtship, their travels as Bob left a law practice behind and pursued his news career and Lee her freelance business, the glorious births of her children and the challenges of motherhood.Bob in turn recalls the moment he caught the journalism “bug” while covering Tiananmen Square for CBS News, his love of overseas assignments and his guilt about long separations from his family, and his pride at attaining the brass ring of television news–being chosen to fill the seat of the late Peter Jennings.And, for the first time, the Woodruffs reveal the agonizing details of Bob’s terrible injuries and his remarkable recovery. We learn that Bob’s return home was not an end to the journey but the first step into a future they have learned not to fear but to be grateful for.In an Instant is much more than the dual memoir of love and courage. It is an important, wise, and inspiring guide to coping with tragedy–and an extraordinary drama of marriage, family, war, and nation.A percentage of the proceeds from this book will be donated to the Bob Woodruff Family Fund for Traumatic Brain Injury.From the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Autobiography",
    "Biography Memoir",
    "Book Club",
    "Family"
  ],
  "author": "Lee Woodruff",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/214049.In_an_Instant"
}