{
  "title": "The Painted Pink Dress: A Daughter’s Story of Family, Betrayal, and Her Search for the Truth",
  "description": "A passionate memoir about identity, resilience, and the healing power of forgiveness“Fans of Dani Shapiro's Inheritance memoir and Family Secrets podcast will appreciate the suspenseful twists of this familial mystery as well as Cash’s gripping, vulnerable storytelling.”—Leah LeMoine, Phoenix magazineFrom her earliest memories, Minu felt like an outsider. It wasn’t just her peculiar name, but also her light skin and cinnamon-swirl hair—so unlike the dark features of her Mexican family—that drew comments from neighbors and strangers.No one took her questions seriously, leaving her yearning for answers. Meanwhile, she had to endure her father’s violence, her mother’s negligence, and the poverty and drugs in Cashion, Arizona.Determined to carve out her own destiny, Minu embarked on a journey to uncover the mysteries of her past. After years of lies and mistreatment, she finally found the strength to confront the one person who knew the truth—the one person who could give her the peace she so desperately longed for.Written with passion and grit, The Painted Pink Dress is an extraordinary true story about overcoming trauma and forging a path forward. Most of all, it is about the power of forgiveness and resilience in the face of hardship.Readers are loving The Painted Pink Dress:“A real eye-opener! I absolutely couldn’t put this book down. Minu writes in a way that puts you in the center of the story. Marvelous!”—Goodreads reviewer, 5 stars“I really enjoyed this book! . . . I'm glad it had a good ending!”—Goodreads reviewer, 5 stars“Heartwarming and inspirational. I laughed, I cried, and I marveled at the strength and perseverance of Minu through all phases of her life. Excellent read.”—Goodreads reviewer, 5 stars“A quick, thought-provoking read.”—Goodreads reviewer, 5 stars“This book was incredibly moving and the writing swept me away instantly.”—Goodreads reviewer, 5 stars“A wonderful page-turner from this first-time author . . . The book will leave you with a grateful heart and a feeling that we can overcome great struggles in our lives and still find happiness.”—Goodreads reviewer, 5 stars“A top favorite for me. A story that will make you laugh and cry. An incredible story of becoming!”—Goodreads reviewer, 5 stars“Very powerful read, heartbreaking story, but incredibly inspiring . . . I couldn’t put the book down!”—Goodreads reviewer, 5 stars",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography"
  ],
  "author": "Minu Cash",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/214048877-the-painted-pink-dress"
}