{
  "title": "Culture and Prosperity: The Truth About Markets - Why Some Nations Are Rich but Most Remain Poor",
  "description": "A witty and accessible tour de force that is immersed in the latest economic thinking, Culture and Prosperity is an indispensable guide to the world around us and destined to become a classic text for understanding the politics of globalization. Guided by the belief that a combination of lightly regulated capitalism and liberal democracy -- the American business model -- is not just appropriate for America at the dawn of the twenty-first century, but a universal path to freedom and prosperity, the United States is an unrivaled colossus seeking to remake the world in its own image. After a decade of successive market revolutions around the world, beginning with the collapse of the Berlin Wall and continuing in countries as diverse as Argentina and New Zealand, the effectiveness of the market economy as a route to prosperity and growth is not in question, but a more sophisticated appreciation of the strengths and limits of markets is urgently required. In this new and illuminating analysis of the nature and evolution of the market economy, John Kay attacks the oversimplified account of its operation, contained in the American business model and favored by politicians and business people. He even questions whether it offers an accurate description of the success of the American economy itself. In an absorbing argument that rewards close reading, and rereading, Culture and Prosperity examines every assumption we have about economic life from a refreshingly new angle. Taking the reader from the shores of Lake Zurich to the streets of Mumbai, from the flower market of San Remo to the sales rooms at Christie's, John Kay reveals the connection between a nation's social, political, and cultural context and its economic performance.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Business",
    "Finance",
    "Politics",
    "History"
  ],
  "author": "John Kay",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/112318.Culture_and_Prosperity"
}