{
  "title": "Impact",
  "description": "From the author of \"Voyage of the Dead\" and the \"Sovereign Spirit Saga\" comes a whole new type of apocalypse. Inspired by \"Lucifer's Hammer\" and other epic science fiction novels, David Forsyth brings the fear, suspense and thrilling action of \"end of the world as we know it\" fiction into focus aboard a cruise ship en route to Australia when an asteroid strikes the Central Pacific Ocean. Whatever image that description evokes is nothing compared to the epic forces of nature, human drama, and pain of loss you will encounter in this book. Not for the faint of heart. The author takes no responsibility for decreased bookings on cruise ships. Read at your own risk. The scariest part is that this story is based on true possibilities. Are you game?  For fans of Forsyth's other work, sorry, no zombies in this one. But if you like the idea of facing the end of the world on a ship at sea (as in Voyage of the Dead), then you should enjoy this adventure too. Who needs zombies when the world itself turns against you?  Sedulity: noun. Constant in purpose and intent. Assiduous, steadfast, tireless, indefatigable.  Praise for Forsyth's Voyage of the Dead and Sovereign Spirit Saga: \"It's Clive Cussler meets Max Brooks.\" \"I've read over 130 zombie books(retired and a lot of time). This one is by far the best one so far.\" \"I was so caught up in the story I had stayed up all night to finish the book and even then I couldn't wait for the next one!\" \"After reading the first book,which I could not put down.I couldn't wait for 2&3' now I just rate all other zombie genre books against these...so far,,these are the best.\" \"The writing is so good, the story so captivating and the characters so compelling that I have plowed through all three books in the trilogy in four days.\" \"Read all three back to back, really good storyline and characters.I would recommend this book and all others by David.\"  David P. Forsyth is the founder of ApocaCon, an event and group dedicated to the promotion of apocalyptic fiction. Visit the author at www.davidpforsyth.com or on Facebook at the ApocaCon page and group. Welcome aboard and bon voyage!",
  "genres": [
    "Post Apocalyptic",
    "Fiction",
    "Suspense",
    "Science Fiction",
    "Survival",
    "Apocalyptic",
    "Adventure"
  ],
  "author": "David P. Forsyth",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/21403452-impact"
}