{
  "title": "How the Body Knows Its Mind: The Surprising Power of the Physical Environment to Influence How You Think and Feel",
  "description": "An award-winning scientist offers a groundbreaking new understanding of the mind-body connection and its profound impact on everything from advertising to romance.The human body is not just a passive device carrying out messages sent by the brain, but rather an integral part of how we think and make decisions. In her groundbreaking new book, Sian Beilock, author of the highly acclaimed Choke , which Time magazine praised for its “smart tips...in order to think clearly...and be cool under pressure,” draws on her own cutting-edge research to turn the conventional understanding of the mind upside down in ways that will revolutionize how we live our lives.At the heart of How the Body Knows Its Mind is the tantalizing idea that our bodies “hack” our brains. The way we move affects our thoughts, our decisions, and even our preferences for particular products. Called “embodied cognition,” this new science—of which Beilock is a foremost researcher—illuminates the power of the body and its physical surroundings to shape how we think, feel, and behave. Beilock’s findings are as varied as they are surprising. For example, pacing around the room can enhance creativity; gesturing during a speech can help ensure that you don’t draw a blank; kids learn better when their bodies are part of the learning process; walking in nature boosts concentration skills; Botox users experience less depression; and much more. From the tricks used by advertisers to the ways body language can improve your memory, Beilock explains a wealth of fascinating interconnections between mind and body and how mastering them can make us happier, safer, and more successful.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Science",
    "Health",
    "Self Help",
    "Brain",
    "Personal Development"
  ],
  "author": "Sian Beilock",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/21412336-how-the-body-knows-its-mind"
}