{
  "title": "Sovereign Erotics: A Collection of Two-Spirit Literature",
  "description": "Two-Spirit people, identified by many different tribally specific names and standings within their communities, have been living, loving, and creating art since time immemorial. It wasn’t until the 1970s, however, that contemporary queer Native literature gained any public notice. Even now, only a handful of books address it specifically, most notably the 1988 collection Living the Spirit: A Gay American Indian Anthology. Since that book’s publication twenty-three years ago, there has not been another collection published that focuses explicitly on the writing and art of Indigenous Two-Spirit and Queer people. This landmark collection strives to reflect the complexity of identities within Native Gay, Lesbian, Bisexual, Transgender, Queer, and Two-Spirit (GLBTQ2) communities. Gathering together the work of established writers and talented new voices, this anthology spans genres (fiction, nonfiction, poetry, and essay) and themes (memory, history, sexuality, indigeneity, friendship, family, love, and loss) and represents a watershed moment in Native American and Indigenous literatures, Queer studies, and the intersections between the two.Collaboratively, the pieces in Sovereign Erotics demonstrate not only the radical diversity among the voices of today’s Indigenous GLBTQ2 writers but also the beauty, strength, and resilience of Indigenous GLBTQ2 people in the twenty-first century. Contributors:, Indira Allegra, Louise Esme Cruz, Paula Gunn Allen, Qwo-Li Driskill, Laura Furlan, Janice Gould, Carrie House, Daniel Heath Justice, Maurice Kenny, Michael Koby, M. Carmen Lane, Jaynie Lara, Chip Livingston, Luna Maia, Janet McAdams, Deborah Miranda, Daniel David Moses, D. M. O’Brien, Malea Powell, Cheryl Savageau, Kim Shuck, Sarah Tsigeyu Sharp, James Thomas Stevens, Dan Taulapapa McMullin, William Raymond Taylor, Joel Waters, and Craig Womack",
  "genres": [
    "Poetry",
    "Queer",
    "Indigenous",
    "Short Stories",
    "LGBT",
    "Nonfiction",
    "Anthologies"
  ],
  "author": "Qwo-Li Driskill",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/11233128-sovereign-erotics"
}