{
  "title": "The Bully Pulpit: Theodore Roosevelt and the Golden Age of Journalism",
  "description": "One of the Best Books of the Year as chosen by The New York Times, The Washington Post, The Economist, Time, USA TODAY, Christian Science Monitor, and more. &#8220;A tale so gripping that one questions the need for fiction when real life is so plump with drama and intrigue; (Associated Press).Doris Kearns Goodwin’s The Bully Pulpit is a dynamic history of the first decade of the Progressive era, that tumultuous time when the nation was coming unseamed and reform was in the air.The story is told through the intense friendship of Theodore Roosevelt and William Howard Taft; a close relationship that strengthens both men before it ruptures in 1912, when they engage in a brutal fight for the presidential nomination that divides their wives, their children, and their closest friends, while crippling the progressive wing of the Republican Party, causing Democrat Woodrow Wilson to be elected, and changing the country’s history.The Bully Pulpit is also the story of the muckraking press, which arouses the spirit of reform that helps Roosevelt push the government to shed its laissez-faire attitude toward robber barons, corrupt politicians, and corporate exploiters of our natural resources. The muckrakers are portrayed through the greatest group of journalists ever assembled at one magazine; Ida Tarbell, Ray Stannard Baker, Lincoln Steffens, and William Allen White; teamed under the mercurial genius of publisher S.S. McClure.Goodwin’s narrative is founded upon a wealth of primary materials. The correspondence of more than four hundred letters between Roosevelt and Taft begins in their early thirties and ends only months before Roosevelt’s death. Edith Roosevelt and Nellie Taft kept diaries. The muckrakers wrote hundreds of letters to one another, kept journals, and wrote their memoirs. The letters of Captain Archie Butt, who served as a personal aide to both Roosevelt and Taft, provide an intimate view of both men.The Bully Pulpit, like Goodwin’s brilliant chronicles of the Civil War and World War II, exquisitely demonstrates her distinctive ability to combine scholarly rigor with accessibility. It is a major work of history; an examination of leadership in a rare moment of activism and reform that brought the country closer to its founding ideals. One of the Best Books of the Year as chosen by The New York Times, The Washington Post, The Economist, Time, USA TODAY, Christian Science Monitor, and more. &#8220;A tale so gripping that one questions the need for fiction when real life is so plump with drama and intrigue1; (Associated Press).Doris Kearns Goodwin’s The Bully Pulpit is a dynamic history of the first decade of the Progressive era, that tumultuous time when the nation was coming unseamed and reform was in the air.The story is told through the intense friendship of Theodore Roosevelt and William Howard Taft; a close relationship that strengthens both men before it ruptures in 1912, when they engage in a brutal fight for the presidential nomination that divides their wives, their children, and their closest friends, while crippling the progressive wing of the Republican Party, causing Democrat Woodrow Wilson to be elected, and changing the country’s history.The Bully Pulpit is also the story of the muckraking press, which arouses the spirit of reform that helps Roosevelt push the government to shed its laissez-faire attitude toward robber barons, corrupt politicians, and corporate exploiters of our natural resources. The muckrakers are portrayed through the greatest group of journalists ever assembled at one magazine; Ida Tarbell, Ray Stannard Baker, Lincoln Steffens, and William Allen White; teamed under the mercurial genius of publisher S.S. McClure.Goodwin’s narrative is founded upon a wealth of primary materials. The correspondence of more than four hundred letters between Roosevelt and Taft begins in their early thirties and ends only months before Roosevelt’s death. Edith Roosevelt and Nellie Taft kept diaries. The muckrakers wrote hundreds of letters to one another, kept journals, and wrote their memoirs. The letters of Captain Archie Butt, who served as a personal aide to both Roosevelt and Taft, provide an intimate view of both men.The Bully Pulpit, like Goodwin’s brilliant chronicles of the Civil War and World War II, exquisitely demonstrates her distinctive ability to combine scholarly rigor with accessibility. It is a major work of history; an examination of leadership in a rare moment of activism and reform that brought the country closer to its founding ideals.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Politics",
    "American History",
    "Presidents",
    "Audiobook"
  ],
  "author": "Doris Kearns Goodwin",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/21412350-the-bully-pulpit"
}