{
  "title": "At Home with Madame Chic: Becoming a Connoisseur of Daily Life",
  "description": "Approach life at home the Madame Chic way: a beautiful, illustrated toolbox of tips and ideas for organizing, entertaining, and savoring a stylish life.When she arrived at Madame Chic’s Parisian apartment as a foreign exchange student, Jennifer Scott was a casual California girl who thought sweatpants were appropriate street attire. Madame Chic took Jennifer under her wing and tutored her in the secrets of how the French elevate the little things in life to the art of living.Years later, Jennifer was back in California with a husband, two young daughters, a dog, and her first home. Every day she confronted mundane duties like folding laundry and unloading the dishwasher, and she began to think about Madame Chic’s home—how the breakfast table was set beautifully the night before, the music that always played in the background, the calm of Madame and Monsieur Chic’s ritual cocktail hour together. Jennifer wanted that life. She decided to see what would happen if she didn’t perform her chores impatiently or mindlessly, if, instead, she could live like Madame Chic.At Home with Madame Chic reveals the secrets to having a happy, fulfilling, and passionate life at home. Jennifer explains the morning send-off need not be chaotic, it’s possible to look stylish with minimal time and effort, a little forethought makes it possible to serve a home-cooked dinner every night, and details like music and scented candles can set the tone for the whole family’s evening. Organized by the pleasures that can be found throughout the day, this charming, helpful book is full of ideas, playlists, recipes, beauty routines, and advice that can turn an irritating day into an enjoyable experience.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "France",
    "Fashion",
    "Audiobook",
    "Personal Development",
    "Memoir"
  ],
  "author": "Jennifer L. Scott",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/21412155-at-home-with-madame-chic"
}