{
  "title": "Dalithan: An Autobiography",
  "description": "The life and work of K.K. Kochu, one of the foremost Dalit thinkers in Kerala, challenges dominant narratives—of the Congress as well as the Communists—that exclude the Dalit experience. Among his most significant works, his autobiography is not merely a gritty story of the life of an individual, but also a thought-provoking history of modern Kerala, from a subaltern perspective.Growing up in a village called Madhuraveli in a flood-prone region of Kottayam district, fishing in the clear waters of nearby canals and eating wild fruit, Kochu was also a promising student, reading everything he could lay his hands on. Even as a boy, troubled by the unquestioning submission of his Pulaya community to their Namboodiri landlords, he distinguished himself by his curiosity, keenly observing the present and preserving in his young mind precious oral histories of Pulaya life. His thirst for knowledge would sustain him through the long years of tragedy for the family, and periods of unemployment. It would also lead him to study—and work towards ending—the marginalization of the lower-castes and the erasure of their contributions to society. Starting his political activism in college with the Naxalites, he would go on to form a Communist Youth Forum, sympathetic though not affiliated to them. Working with leading figures in the cultural and political space, as well as many that rarely find mention in written histories, he would later move from a Maoist to an Ambedkarite path of anti-caste struggle—a perspective that would guide him in subsequent efforts to build unity among Dalits, Adivasis and minority groups.Dalithan is a work of scholarship as much as it is an autobiography. By combining a view from below of raw life with an account of the broader socio-cultural, economic and intellectual trajectories in Kerala, it stands out as a unique contribution to Dalit life-writing in Malayalam, available for the first time to an English readership in a brilliant and faithful translation.",
  "genres": [],
  "author": "K.K. Kochu",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/214119642-dalithan"
}