{
  "title": "If You Find This Letter: My Journey to Find Purpose Through Hundreds of Letters to Strangers",
  "description": "A heartwarming memoir of love and faith from Hannah Brencher, founder of The World Needs More Love Letters, who has dedicated her life to showing total strangers that they are not alone in the world.Fresh out of college, Hannah Brencher moved to New York, expecting her life to look like a scene from Sex and the City. Instead, she found a city full of people who knew where they were going and what they were doing and didn't have time for a girl still trying to figure it all out. Lonely and depressed, she noticed a woman who looked like she felt the same way on the subway. Hannah did something strange--she wrote the woman a letter. She folded it, scribbled If you find this letter, it's for you on the front and left it behind. When she realized that it made her feel better, she started writing and leaving love notes all over the city--in doctor's offices, in coat pockets, in library books, in bathroom stalls. Feeling crushed within a culture that only felt like connecting on a screen, she poured her heart out to complete strangers. She found solace in the idea that her words might brighten someone's day.Hannah's project took on a life of its own when she made an offer on her blog: She would handwrite a note and mail it to anyone who wanted one. Overnight, her inbox exploded with requests from people all over the world. Nearly 400 handwritten letters later, she started the website, The World Needs More Love Letters, which quickly grew. There is something about receiving a handwritten note that is so powerful in today's digital era. If You Find This Letter chronicles Hannah's attempts to bring more love into the world,and shows how she rediscovered her faith through the movement she started.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Writing",
    "Audiobook",
    "Book Club",
    "Inspirational"
  ],
  "author": "Hannah Brencher",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/21412144-if-you-find-this-letter"
}