{
  "title": "The Train to Crystal City: FDR's Secret Prisoner Exchange Program and America's Only Family Internment Camp During World War II",
  "description": "The dramatic and never-before-told story of a secret FDR-approved American internment camp in Texas during World War II; where thousands of families, many US citizens, were incarcerated.From 1942 to 1948, trains delivered thousands of civilians from the United States and Latin America to Crystal City, Texas, a small desert town at the southern tip of Texas. The trains carried Japanese, German, Italian immigrants and their American-born children. The only family internment camp during World War II, Crystal City was the center of a government prisoner exchange program called \"quiet passage\". During the course of the war, hundreds of prisoners in Crystal City, including their American-born children, were exchanged for other more important American diplomats, businessmen, soldiers, physicians, and missionaries behind enemy lines in Japan and Germany.Focusing her story on two American-born teenage girls who were interned, author Jan Jarboe Russell uncovers the details of their years spent in the camp; the struggles of their fathers; their families subsequent journeys to war-devastated Germany and Japan; and their years-long attempt to survive and return to the United States, transformed from incarcerated enemies to American loyalists. Their stories of day-to-day life at the camp, from the ten-foot high security fence to the armed guards, daily roll call, and censored mail, have never been told.Combining big-picture World War II history with a little-known event in American history that has long been kept quiet, The Train to Crystal City reveals the war-time hysteria against the Japanese and Germans in America, the secrets of FDR's tactics to rescue high-profile POWs in Germany and Japan, and how the definition of American citizenship changed under the pressure of war.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Book Club",
    "War",
    "American History",
    "Historical"
  ],
  "author": "Jan Jarboe Russell",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/21412283-the-train-to-crystal-city"
}