{
  "title": "Luminous",
  "description": "A highly anticipated, sweeping debut set in a unified Korea that tells the story of three estranged siblings—two human, one robot—as they collide against the backdrop of a murder investigation to settle old scores and make sense of their shattered childhood, perfect for fans of Klara and the Sun and We Are All Completely Beside Ourselves.In a reunified Korea of the future, robots have been integrated into society as surrogates, servants, children, and even lovers. Though boundaries between bionic and organic frequently blur, these robots are decidedly second-class citizens. Jun and Morgan, two siblings estranged for many years, are haunted by the memory of their lost brother, Yoyo, who was warm, sensitive, and very nearly human. Jun, a war veteran turned detective of the lowly Robot Crimes Unit in Seoul, becomes consumed by an investigation that reconnects him with his sister Morgan, now a prominent robot designer working for a top firm, who is, embarrassingly, dating one of her creations in secret. On the other side of Seoul in a junkyard filled with abandoned robots, eleven-year-old Ruijie sifts through scraps looking for robotic parts that might support her failing body. When she discovers a robot boy named Yoyo among the piles of trash, an unlikely bond is formed since Yoyo is so lifelike, he’s unlike anything she’s seen before. While Morgan prepares to launch the most advanced robot-boy of her career, Jun’s investigation sparks a journey through the underbelly of Seoul, unearthing deeper mysteries about the history of their country and their family. The three siblings must find their way back to each other to reckon with their pasts and the future ahead of them in this poignant and remarkable exploration of what it really means to be human.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Mystery",
    "Fantasy",
    "Science Fiction Fantasy",
    "Dystopia",
    "Adult"
  ],
  "author": "Silvia Park",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/214151232-luminous"
}