{
  "title": "I'll Never Write My Memoirs",
  "description": "Legendary influential performer Grace Jones offers a revealing account of her spectacular career and turbulent life, charting the development of a persona that has made her one of the world’s most recognizable artists.As a singer, model, and actress—a deluxe triple threat—Grace has consistently been an extreme, challenging presence in the entertainment world since her emergence as an international model in the 1970s. Celebrated for her audacious talent and trailblazing style, Grace became one of the most unforgettable, free-spirited characters to emerge from the historic Studio 54, recording glittering disco classics such as I Need a Man and La Vie en Rose. Her provocative shows in underground New York nightclubs saw her hailed as a disco queen, gay icon, and gender defying iconoclast.In 1980, the always ambitious Grace escaped a crowded disco scene to pursue more experimental interests. Her music also broke free, blending house, reggae, and electronica into a timeless hybrid that led to classic hits such as Pull Up to the Bumper and Slave to the Rhythm. In the memoir she once promised never to write, Grace offers an intimate insight into her evolving style, personal philosophies, and varied career—including her roles in the 1984 fantasy-action film Conan the Destroyer alongside Arnold Schwarzenegger and the James Bond movie A View to a Kill.Featuring sixteen pages of stunning full-color photographs, many from her own personal archive, I’ll Never Write My Memoirs follows this ageless creative nomad as she rejects her strict religious upbringing in Jamaica; conquers New York, Paris, and the 1980s; answers to no-one; and lives to fight again and again.s.",
  "genres": [
    "Memoir",
    "Music",
    "Biography",
    "Nonfiction",
    "Autobiography",
    "Biography Memoir",
    "Feminism"
  ],
  "author": "Grace Jones",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/21412387-i-ll-never-write-my-memoirs"
}