{
  "title": "Slave of the Legion",
  "description": "BETA THREE WANTED REVENGE. THE MOUND WAS IN HIS SIGHTS.“There’s no way the O’s are going to inherit this world. It’s going to glow in the dark first.”When squad Beta is sent on a recon mission to Uldo in the Gassies, they find the Omni’s—deadly aliens with unstoppable psychic power loose in the wrong universe. In a snowy landscape they discover the Mound, a massive, mysterious structure built by the O’s. Approaching, they find the way lined with the impaled bodies of innocent humans. Allying with the infamous System against a common enemy, the Legion has decided the O’s that have never been stopped, will be—on Uldo, at the Mound.ABOUT THE SERIESSoldier of the Legion is an action-packed, fast-paced science fiction series in the tradition of Starship Troopers. It chronicles the adventures of a squad of young soldiers dedicated to honor and duty who stand as the only shield to save humankind from those bent on their destruction.\"In book three of this exceptional series, the Beta warriors are harder and colder, stunned by the ongoing war with the Omnis. Thinker, Snow Leopard, Psycho, Priestess, and Dragon have survived. Half their team is dead, and new replacements can't compare with seasoned comrades of the Omni wars. The Beta team feels doomed, resigned to dying as they take the battle deep into Omni-held territory to penetrate a frightening place called The Mound. Deep inside The Mound, Beta will find the answer to defeating the Omnis.\" — Midwest Book ReviewBOOKS IN THE SOLDIER OF THE LEGION SERIESSolider of the LegionMarch of the LegionSlave of the LegionSecret of the LegionCross of the LegionCurse of the LegionABOUT THE AUTHORMarshall S. Thomas is a retired U.S. Government official who served overseas in East Asia for most of his 35 year career. Marshall attended the Georgetown University School of Foreign Service, the University of New Mexico and the University of Miami with a major in Government/International Affairs and a minor in History.Marshall currently lives in Williamsburg, Virginia with his wife Kim Lien. His youngest son Alexander, 22, is now in college studying biochemistry. His eldest son Christopher is a graduate of Radford University who studied art and graphic design. Marshall loves to write, and especially enjoys writing science fiction He is a member of the Virginia Writers Club, Goodreads, the Authors Den, and C.E. Winterland's Mindsight Forum.AWARDS2010 Foreword Magazine Book of the Year Finalist for Science Fiction (Curse of the Legion)2009 Foreword Magazine Book of the Year Finalist for Science Fiction (Cross of the Legion)2003 IBPA Ben Franklin Award Finalist for Popular Fiction (Solider of the Legion)2002 Foreword Magazine Book of the Year Finalist for Science Fiction (Soldier of the Legion)",
  "genres": [
    "Science Fiction"
  ],
  "author": "Marshall S. Thomas",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/11234245-slave-of-the-legion"
}