{
  "title": "Beowulf: A Translation and Commentary, together with Sellic Spell",
  "description": "The translation of Beowulf by J.R.R. Tolkien was an early work, very distinctive in its mode, completed in 1926: he returned to it later to make hasty corrections, but seems never to have considered its publication. This edition is twofold, for there exists an illuminating commentary on the text of the poem by the translator himself, in the written form of a series of lectures given at Oxford in the 1930s; and from these lectures a substantial selection has been made, to form also a commentary on the translation in this book. From his creative attention to detail in these lectures there arises a sense of the immediacy and clarity of his vision. It is as if he entered into the imagined past: standing beside Beowulf and his men shaking out their mail-shirts as they beached their ship on the coast of Denmark, listening to the rising anger of Beowulf at the taunting of Unferth, or looking up in amazement at Grendel’s terrible hand set under the roof of Heorot. But the commentary in this book includes also much from those lectures in which, while always anchored in the text, he expressed his wider perceptions. He looks closely at the dragon that would slay Beowulf \"snuffling in baffled rage and injured greed when he discovers the theft of the cup\"; but he rebuts the notion that this is \"a mere treasure story\", \"just another dragon tale\". He turns to the lines that tell of the burying of the golden things long ago, and observes that it is \"the feeling for the treasure itself, this sad history\" that raises it to another level. \"The whole thing is sombre, tragic, sinister, curiously real. The ‘treasure’ is not just some lucky wealth that will enable the finder to have a good time, or marry the princess. It is laden with history, leading back into the dark heathen ages beyond the memory of song, but not beyond the reach of imagination.\" Sellic spell, a \"marvellous tale\", is a story written by Tolkien suggesting what might have been the form and style of an Old English folk-tale of Beowulf, in which there was no association with the \"historical legends\" of the Northern kingdoms.",
  "genres": [
    "Classics",
    "Fantasy",
    "Poetry",
    "Fiction",
    "Mythology",
    "Literature",
    "Medieval"
  ],
  "author": "Unknown",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/21413663-beowulf"
}