{
  "title": "Practice to Deceive",
  "description": "This New York Times bestseller—from “America’s best true-crime writer” ( Kirkus Reviews ) and the author of The Stranger Beside Me —is a shocking tale of greed, sex, scandal, and murder on an isolated and eerie island in the Pacific Northwest.With more than 50 million copies of her books in print—from her chilling personal account of knowing Ted Bundy to sixteen collections in her #1 bestselling Crime Files series—Ann Rule is a legendary true crime writer. Here, in Practice to Deceive , Rule unravels a shattering case of Christmastime murder off the coast of Washington State—presented with the clarity, authority, and emotional depth that Rule’s readers expect.Nestled in Puget Sound, Whidbey Island is a gem of the Pacific Northwest. Accessible only by ferry, it is known for its artistic communities and stunning natural beauty. Life there is low-key, and the island’s year-round residents tend to know one another’s business. But when the blood-drenched body of Russel Douglas was discovered the day after Christmas in his SUV in a hidden driveway near Whidbey’s most exclusive mansion—a single bullet between his eyes—the whole island was shocked. At first, police suspected suicide, tragically common at the height of the holiday season. But when they found no gun in or near the SUV, Russel’s manner of death became homicide .Brenna Douglas, Russel’s estranged and soon-to-be-ex wife, allowed him to come home for a Christmas visit with their children. The couple owned the popular Just B’s salon. Brenna’s good friend Peggy Sue Thomas worked there, and Brenna complained often to her that Russel was physically and emotionally abusive. Peggy Sue’s own life has been one of extremes. Married three times, hers is a rags-to-riches-and-back-again tale in which she’s played many roles, from aircraft mechanic to “drop-dead gorgeous” beauty queen as a former Ms. Washington. But in 2003, her love affair with married guitarist Jim Huden led the two Whidbey Island natives to pursue their ultimate dreams of wealth and privilege—even at the expense of human life.Unravel the tangled web woven by Russel Douglas’s murder in Practice to Deceive , a heart pounding true-crime tour de force.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Mystery",
    "Audiobook",
    "Adult",
    "History"
  ],
  "author": "Ann Rule",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/21412353-practice-to-deceive"
}