{
  "title": "Collared by the Cowboy",
  "description": "Alternate cover edition of ASIN B00IWHG0AWThe room at the end of the hall in Spurs & Leather, a private club in Paris hasn't seen any action of late. Brandon as head Dom locked the doors after his last lover burned him good. Diving into his work at Evermore Ranch, he's got his hands filled with taming wild horses until a red-leather wearing woman crosses his path. Tempted back into the saddle, he sets his sights on taming a different type of filly...one with a sassy little mouth, a mind of her own, and hot body that won't quit. He's got the goods, if she willing to let him take the lead both in and out of bed.Last semester of grad school and all Mia needs is a stellar thesis that will skyrocket her chances of landing a therapist job somewhere far, far away from small towns and small minds. Case studies in female sexuality sure as hell aren't the ticket out of Texas and Mia sets her sights on learning all she can about why women enjoy being dominated--thank you fifty shades of I'm out of here by May! Undercover, she enters the secretive BDSM world within a club known to offer decadent delights. With one minor SNAFU: she becomes the target of the head Dom, a man with a reputation of equal parts bark and bite. When the door marked no is thrown open by one commanding cowboy, Mia can't resist temptation waiting on the other side.Now, Mia is wearing Brandon's collar, calling him Sir, and loving every minute of being dominated by her powerful lover. Yet Mia can't have her cake and eat it too. Torn, she must decide if her future involves walking away Brandon when her heart is telling her to stay, stay, stay. The following story is intended for an adult audience and contains mature themes, strong language including graphically detailed sex, violence, and drug use portrayed in a fictional setting.",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Westerns",
    "Contemporary Romance",
    "Erotic Romance"
  ],
  "author": "Susan Arden",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/21414722-collared-by-the-cowboy"
}