{
  "title": "Ruth's Journey: The Authorized Novel of Mammy from Margaret Mitchell's Gone with the Wind",
  "description": "Authorized by the Margaret Mitchell Estate, here is the first-ever prequel to one of the most beloved and bestselling novels of all time, Gone with the Wind. The critically acclaimed author of Rhett Butler’s People magnificently recounts the life of Mammy, one of literature’s greatest supporting characters, from her days as a slave girl to the outbreak of the Civil War.“Her story began with a miracle.” On the Caribbean island of Saint Domingue, an island consumed by the flames of revolution, a senseless attack leaves only one survivor—an infant girl. She falls into the hands of two French émigrés, Henri and Solange Fournier, who take the beautiful child they call Ruth to the bustling American city of Savannah.What follows is the sweeping tale of Ruth’s life as shaped by her strong-willed mistress and other larger-than-life personalities she encounters in the South: Jehu Glen, a free black man with whom Ruth falls madly in love; the shabbily genteel family that first hires Ruth as Mammy; Solange’s daughter Ellen and the rough Irishman, Gerald O’Hara, whom Ellen chooses to marry; the Butler family of Charleston and their shocking connection to Mammy Ruth; and finally Scarlett O’Hara—the irrepressible Southern belle Mammy raises from birth. As we witness the difficult coming of age felt by three generations of women, gifted storyteller Donald McCaig reveals a portrait of Mammy that is both nuanced and poignant, at once a proud woman and a captive, and a strict disciplinarian who has never experienced freedom herself. But despite the cruelties of a world that has decreed her a slave, Mammy endures, a rock in the river of time. She loves with a ferocity that would astonish those around her if they knew it. And she holds tight even to those who have been lost in the ravages of her days.Set against the backdrop of the South from the 1820s until the dawn of the Civil War, here is a remarkable story of fortitude, heartbreak, and indomitable will—and a tale that will forever illuminate your reading of Margaret Mitchell’s unforgettable classic, Gone with the Wind",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Civil War",
    "Southern",
    "Audiobook",
    "Novels"
  ],
  "author": "Donald McCaig",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/21412403-ruth-s-journey"
}