{
  "title": "Fun With My Sleeping Wife and Au Pair",
  "description": "The two of them looked angelic, as if they had just passed out on a cloud... After a night of sleep sex with our family's new au pair, the young girl gives me the cold shoulder. Was she really that mad over passing out due to my wife's sleeping pills? When my wife Anna goes and talks to her, the threesome I've always wanted is practically guaranteed. However, Tamara has a surprise for my wife. It's a surprise for me as well, and when I find the two women passed out in my bed, I know I'm in for the greatest sex of my life...This 5800 word story includes a loving husband and wife and the au pair who becomes a much more integral part of their relationship than they ever could have guessed. It features sleep sex, some soft kissing between two women, two pairs of nice big boobs, and one guy filling both women with an impregnating creampie!Tamara smiled. \"I slipped the second to last pill into her wine.\" She slipped her top off, releasing those perky, large boobs. Her jean shorts came next, and then she crawled into bed with Anna. Anna smiled, her eyes still closed, but her lips pursing. Tamara came over and kissed her, and Anna seemed to be making out with her in her sleep.Tamara slipped Anna's tank top over her head, releasing her tits. Anna opened her eyes and looked over at me sleepily. She giggled, then began to work her own pants off. As the pants fell off her ankles, her head dropped into the pillow, and she fell asleep again.Tamara giggled, and began to work Anna's panties off her ass. I went to the foot of the bed and took them the rest of the way off, then watched as Tamara took her own panties off. She began to kiss Anna again. The two of them looked so beautiful there, kissing softly, their breasts touching. I began to rub their legs, and suddenly Tamara leaned her head up against Anna's.She shook herself, then looked up at me. \"I guess it hit me quicker than I thought it would,\" she said. \"But then again, this bed is soooo comfy.\" She laid down on her back, snuggled into the white sheets, and leaned over to give my wife one last kiss. Anna rolled from her side onto her stomach, placing her arm over Tamara and pulling her close...***I suddenly had a great idea. I grabbed the back of Anna's head and brought her closer to Tamara, then did the same to Tamara. They were close enough to begin kissing, and they did, smiling as they did so and sleepily grasping each other's bodies.I moved their faces apart slightly, bring my cock in between them as I did so. It worked just as I had hoped it would. Both women began kissing my cock, their tongues darting in and out of their mouths. Their hands continued to touch each other, but in their dazed states, they were unaware that they were no longer kissing each other. It felt amazing, and as I began to move my cock up and down, both women kissed up and down my shaft. It was probably the single sexiest thing I had ever seen...",
  "genres": [],
  "author": "Cassandra Zara",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/21415177-fun-with-my-sleeping-wife-and-au-pair"
}