{
  "title": "Flaws in the Ice: In Search of Douglas Mawson",
  "description": "Douglas Mawson  was determined to make his mark on Antarctica as no other explorer had done before him. What really happened on the ice has been buried for a century. Flaws in the Ice  is the untold true story of Douglas Mawson’s 1911-1914 Antarctic Expedition, mistakenly hailed for a century as a courageous survival story from the Heroic Age of Antarctic Exploration. Prize-winning historian David Day takes off on a five-week odyssey in search of the real Douglas Mawson, famed colleague and contemporary of Ernest Shackleton and Robert Falcon Scott. Beginning his book on board an expedition ship bound for the Antarctic, Dr. Day asks the difficult questions that have hitherto lain buried about Mawson —, his leadership of the ill-fated Australasian Antarctic Expedition of 1911–14, his conduct during the trek that led to the death of his two companions, and his intimate relationship with Scott’s widow. The author also explores the ways in which Mawson subsequently concealed his failures and deficiencies as an explorer, and created for himself a heroic image that has persisted for a century.To bolster his career and dig himself out of debt, Mawson would have to return from Antarctica with a stirring story of achievement calculated to capture public attention. South Pole expeditions, by-among others--Robert Falcon Scott and Roald Amundsen--were going on at same time With Amundsen having reached the South Pole-- and Scott having died on his return--Mawson would be forgotten if he did not return with an exciting story of achievement and adversity overcome. Mawson obliged, though the truth was something entirely different.For many decades, there has been only one published first-hand account of the expedition —Mawson’s. Only now have alternative accounts become publicly available. The most important of these is the long-suppressed diary of Mawson’s deputy, Cecil Madigan, who is scathing in his criticisms of Mawson’s abilities, achievements, and character that he instructed that his diary was not to be published until the last of Mawson’s  children  had died. At the same time, other accounts have appeared from leading members of the expedition that also challenge Mawson’s official story. While most historians ascribe the deaths of the two men to bad luck, the author’s re-examination of the existing evidence, and a reading of the new evidence, reveals that the deaths of two men on the expedition were caused by Mawson’s relative inexperience, overweening ambition, and poor decision-making. In fact, there’s some suggestion that Mawson was consciously responsible for one’s starvation so that Mawson himself could survive on the limited food rations. After the death of his companions, Mawson’s bungling of his return to the ship forced a team to remain for another full year during which he recovered his strength and began to craft an image of himself as a courageous and resourceful polar explorer. The British Empire needed heroes, and Mawson was determined to provide it with one.In this compelling and revealing new book, David Day draws upon all this new evidence, as well as on the vast research he undertook for his international history ofAntarctica, and on his own experience of sailing to the Antarctic coastline where Mawson’s reputation was first created.  Flaws in the Ice  will change perceptions of Douglas Mawson—one of the icons of the Heroic Age of Antarctic Exploration— forever.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Adventure"
  ],
  "author": "David  Day",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/21413647-flaws-in-the-ice"
}