{
  "title": "The Man Who Would Not Be Washington: Robert E. Lee's Civil War and His Decision That Changed American History",
  "description": "The riveting true story of Robert E. Lee, the brilliant soldier bound by marriage to George Washington's family but turned by war against Washington's crowning achievement, the Union. On the eve of the Civil War, one soldier embodied the legacy of George Washington and the hopes of leaders across a divided land. Both North and South knew Robert E. Lee as the son of Washington's most famous eulogist and the son-in-law of Washington's adopted child. Each side sought his service for high command. Lee could choose only one. In The Man Who Would Not Be Washington, former White House speechwriter Jonathan Horn reveals how the officer most associated with Washington went to war against the union that Washington had forged. This extensively researched and gracefully written biography follows Lee through married life, military glory, and misfortune. The story that emerges is more complicated, more tragic, and more illuminating than the familiar tale. More complicated because the unresolved question of slavery--the driver of disunion--was among the personal legacies that Lee inherited from Washington. More tragic because the Civil War destroyed the people and places connecting Lee to Washington in agonizing and astonishing ways. More illuminating because the battle for Washington's legacy shaped the nation that America is today. As Washington was the man who would not be king, Lee was the man who would not be Washington. The choice was Lee's. The story is America's. A must-read for those passionate about history, The Man Who Would Not Be Washington introduces Jonathan Horn as a masterly voice in the field.",
  "genres": [
    "History",
    "Biography",
    "Civil War",
    "American History",
    "Nonfiction",
    "American Civil War",
    "Biography Memoir"
  ],
  "author": "Jonathan Horn",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/21412355-the-man-who-would-not-be-washington"
}