{
  "title": "The Resistance Painter",
  "description": "An evocative work of historical fiction, examining the little-known story of Poland’s extraordinary WW ll resistance army and the contemporary lives of two artists, grandmother and granddaughter, inextricably linked by a wartime betrayal.Warsaw 1939. Irena Marianowska’s dreams of attending art school in Paris are crushed when the Nazis invade Poland. Instead, she joins the Home Army and, together with her resistance cell, risks her life guiding people to safety through the sewers of Warsaw. In 1942, after a harrowing mission, she returns home to learn that her sister, Lotka, has been abducted by the Gestapo. In her search for Lotka, Irena encounters a host of characters who lead her into greater danger.Toronto 2010. Jo Blum lives in Toronto with her beloved grandmother, a lauded painter of WWII and a decorated war hero. Jo has a budding career creating sculptures for grave sites based on the life stories of her dying clients. Her recorded interviews with Stefan, her new Polish client, unveil an heroic wartime past eerily similar to her grandmother’s. But Jo’s quest to uncover the truth about Stefan and her grandmother opens an explosive Pandora’s box whose shockwaves threaten everything she’s known about her family.The Resistance Painter will resonate with fans of The Berlin Apartment, The Secret History of Audrey James, Woman with the Blue Star, The Book of Lost Names, The Tattooist of Auschwitz, The German Girl, and The Dutch Wife, confronting questions about the stories we tell about our lives and whether buried secrets should stay buried.“The story of the Hitler’s invasion of Poland has been neglected by historical novelists. Kath Johnson has leapt into the breach with great success. The Resistance Painter is an inspiring tale of suffering, courage, fortitude, and sisterly love.” -Roberta Rich, bestselling author of The Jazz Club Spy“An elegant, riveting, dual-timeline novel about betrayals that haunt generations, and the redemptive power of art.” -Genevieve Graham, #1 bestselling author of The Secret Keeper“This dramatic story pays tribute to the youthful resistance fighters who risked their lives hundreds of times in the underground sewers of Warsaw, saving their fellow citizens from certain death. At times I had to lay down the book, unable to read for my tears of rage and sorrow. The Resistance Painter illuminates a forgotten chapter of Polish history, one that deserves to be floodlit for all eternity.”-Elinor Florence, bestselling author Finding Flora",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "World War II",
    "Canada",
    "Poland",
    "Art"
  ],
  "author": "Kath Jonathan",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/214151604-the-resistance-painter"
}