{
  "title": "March of the Legion",
  "description": "IN THE ERA OF TOTAL GALACTIC WAR, CAN ONE SQUAD REALLY MAKE A DIFFERENCE?On a hostile planet, Legion trooper Thinker and his comrades of Squad Beta are ordered to assault the invading encampment of alien Omins. But the moment they are dropped into the atmosphere of Andrion 3, little goes as planned. Only months out of training, Beta find themselves marooned on a world of smoke, ash, and lava, facing giant exosegs, and an enemy who attacks their very minds. The fate of ConFree, perhaps the whole of mankind, lies in their hands. To survive all they need do is destroy the Omni menace. The only problem—no one has ever defeated the Omnis.ABOUT THE SERIESSoldier of the Legion is an action-packed, fast-paced science fiction series in the tradition of Starship Troopers. It chronicles the adventures of a squad of young soldiers dedicated to honor and duty who stand as the only shield to save humankind from those bent on their destruction.\"It's been a long wait for the second in this exciting series of sci-fi books. I must admit that the attraction for me is Marshall Thomas's writing style and story telling ability. This book picks up where the last left off, with the Legion facing a scourge that threatens all life forms throughout the universe—the Omnis. Once again, the action is heart pounding, the characters believable and well developed. This time, adding interest to the plot, the Legion juggles political intrigue and betrayal along with fighting the Omnis.\" — Midwest Book ReviewBOOKS IN THE SOLDIER OF THE LEGION SERIESSolider of the LegionMarch of the LegionSlave of the LegionSecret of the LegionCross of the LegionCurse of the LegionABOUT THE AUTHORMarshall S. Thomas is a retired U.S. Government official who served overseas in East Asia for most of his 35 year career. Marshall attended the Georgetown University School of Foreign Service, the University of New Mexico and the University of Miami with a major in Government/International Affairs and a minor in History.Marshall currently lives in Williamsburg, Virginia with his wife Kim Lien. His youngest son Alexander, 22, is now in college studying biochemistry. His eldest son Christopher is a graduate of Radford University who studied art and graphic design. Marshall loves to write, and especially enjoys writing science fiction He is a member of the Virginia Writers Club, Goodreads, the Authors Den, and C.E. Winterland's Mindsight Forum.AWARDS2010 Foreword Magazine Book of the Year Finalist for Science Fiction (Curse of the Legion)2009 Foreword Magazine Book of the Year Finalist for Science Fiction (Cross of the Legion)2003 IBPA Ben Franklin Award Finalist for Popular Fiction (Solider of the Legion)2002 Foreword Magazine Book of the Year Finalist for Science Fiction (Soldier of the Legion)",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Adventure"
  ],
  "author": "Marshall S. Thomas",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/11234244-march-of-the-legion"
}