{
  "title": "Spirit of the Wolves: A Novel",
  "description": "The third and final title in The Wolf Chronicles: Kaala the young wolf fulfills her destiny—to either help humans and wolves to live in peace, or bring war that will destroy them all.Fourteen thousand years ago in southern Europe, a wolf cub named Kaala discovers that she alone can link wolves and humans, thus keeping humans from growing distant from and destroying the world around them. In Promise of the Wolves and Secrets of the Wolves, Kaala came to understand her role. Born of a forbidden, mixed blood litter, and alone after her mother’s exile, Kaala struggled to earn her place in the Swift River pack. When she saved the life of a human girl, she put her hard-won place in the pack at risk, and responsibility for keeping peace between wolf and humankind fell to her. So far, she has failed. Now, in Spirit of the Wolves, Kaala has one last chance. She leaves her home in the Wide Valley with her packmates, the human girl she loves, and an obnoxious raven. Together, they travel to the land outside the valley, only to discover that new challenges await them. Kaala’s mother has no answers, a faction of ruthless Greatwolves will stop at nothing to maintain control, odd little wolves seek to take Kaala’s place, and, in the mysterious village of Kaar, humans are undergoing a transformation that could destroy everything she is working for. Only by calling on all of her strength and on the bonds of love with her human, raven, and wolf companions can Kaala hope to succeed. But it might not be enough. In this satisfying conclusion to The Wolf Chronicles, Kaala will have to fight and sacrifice in ways she never imagined, and she must decide how far she is willing to go for peace…when every step she takes leads wolfkind and humankind toward war.",
  "genres": [
    "Fantasy",
    "Wolves",
    "Animals",
    "Historical Fiction",
    "Animal Fiction",
    "Fiction",
    "Young Adult"
  ],
  "author": "Dorothy Hearst",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/21412352-spirit-of-the-wolves"
}