{
  "title": "Waste Wars: The Wild Afterlife of Your Trash",
  "description": "A globe-trotting work of relentless investigative reporting, this is the first major book to expose the catastrophic reality of the multi-billion-dollar global garbage trade.Dumps and landfills around the world are overflowing. Disputes about what to do with the millions of tons of garbage generated every day have given rise to waste wars waged almost everywhere you look. Some are border skirmishes. Others hustle trash across thousands of miles and multiple oceans. But no matter the scale, one thing is true about almost all of them: few people have any idea they’re happening.Journalist Alexander Clapp spent two years roaming five continents to report deep inside the world of Javanese recycling gangsters, cruise ship dismantlers in the Aegean, Tanzanian plastic pickers, whistle-blowing environmentalists throughout the jungles of Guatemala, and a community of Ghanaian boys who burn Western cellphones and televisions for cents an hour, to tell readers what he has figured out: While some trash gets tossed onto roadsides or buried underground, much of it actually lives a secret hot potato second life, getting shipped, sold, re-sold, or smuggled from one country to another, often with devastating consequences for the poorest nations of the world. Waste Wars is a jaw-dropping exposé of how and why, for the last forty years, our garbage — the stuff we deem so worthless we think nothing of throwing it away — has spawned a massive, globe-spanning, multi-billion-dollar economy, one that offloads our consumption footprints onto distant continents, pristine landscapes, and unsuspecting populations. If the handling of our trash reveals deeper truths about our Western society, what does the globalized business of garbage say about our world today? And what does it say about us?",
  "genres": [
    "Nonfiction",
    "Science",
    "Nature",
    "Audiobook",
    "History",
    "Environment",
    "Social Science"
  ],
  "author": "Alexander Clapp",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/214175143-waste-wars"
}