{
  "title": "Curse of the Legion",
  "description": "WHAT DO YOU OWE THE FUTURE, AND WHAT DO YOU OWE THE PAST?With the hated totalitarian System on the verge of collapse and the dreaded alien Omnis observing an unexpected truce, veteran soldier of the Legion Thinker has finally found happiness with his wife Priestess in a cozy home raising his children and teaching new Legion recruits. It is a dream he never thought possible, a haven of peace and comfort. It is also short-lived, as a savage massacre of Outworlder settlers on the Outvac planet Fortuna leads the Confederation of Free Worlds to all out war with the Gassies world Asumara. Only not everything is as it appears, and soon the Legion finds itself fighting for the survival of its civilization against a shadowy enemy willing to do the unthinkable to destroy ConFree.Return to the Legion for this final chapter of the Soldier of the Legion Series.ABOUT THE SERIESSoldier of the Legion is an action-packed, fast-paced science fiction series in the tradition of Starship Troopers. It chronicles the adventures of a squad of young soldiers dedicated to honor and duty who stand as the only shield to save humankind from those bent on their destruction.\"I'm a little sad to see this excellent sci fi series end. I've fought horrific battles with the characters, visited frightening or beautiful worlds, stood my ground with them as life exploded in flames around them, and watched them mature through every harrowing assignment. With skill and compassion, the author brought these characters to life for me. I'll miss these courageous Legion immortals, forever young and strong as they seek truth and justice throughout the known universe.\" — Midwest Book ReviewBOOKS IN THE SOLDIER OF THE LEGION SERIESSolider of the LegionMarch of the LegionSlave of the LegionSecret of the LegionCross of the LegionCurse of the LegionMore information can be found www.soldierofthelegion.comABOUT THE AUTHORMarshall S. Thomas is a retired U.S. Government official who served overseas in East Asia for most of his 35 year career. Marshall attended the Georgetown University School of Foreign Service, the University of New Mexico and the University of Miami with a major in Government/International Affairs and a minor in History.Marshall currently lives in Williamsburg, Virginia with his wife Kim Lien. His youngest son Alexander, 22, is now in college studying biochemistry. His eldest son Christopher is a graduate of Radford University who studied art and graphic design. Marshall loves to write, and especially enjoys writing science fiction He is a member of the Virginia Writers Club, Goodreads, the Authors Den, and C.E. Winterland's Mindsight Forum.AWARDS2010 Foreword Magazine Book of the Year Finalist for Science Fiction (Curse of the Legion)2009 Foreword Magazine Book of the Year Finalist for Science Fiction (Cross of the Legion)2003 IBPA Ben Franklin Award Finalist for Popular Fiction (Solider of the Legion)2002 Foreword Magazine Book of the Year Finalist for Science Fiction (Soldier of the Legion)",
  "genres": [
    "Science Fiction",
    "Fiction"
  ],
  "author": "Marshall S. Thomas",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/11234246-curse-of-the-legion"
}