{
  "title": "Monoculture: How One Story is Changing Everything",
  "description": "Winner of the George Orwell Award. One of The Atlantic's best books of the year. As human beings, we've always told stories: stories about who we are, where we come from, and where we're going. Now imagine that one of those stories is taking over the others, narrowing our diversity and creating a monoculture. Because of the rise of the economic story, six areas of your world - your work, your relationships with others and the environment, your community, your physical and spiritual health, your education, and your creativity - are changing, or have already changed, in subtle and not-so-subtle ways. And because how you think shapes how you act, the monoculture isn't just changing your mind - it's changing your life.“A single lucid narrative that’s bound to first make you somewhat uncomfortable and insecure, then give you the kind of pause from which you can step back and move forward with more autonomy, authenticity and mindfulness than ever.” - Maria Popova, BrainPickings“A thin, enrapturing gem. It’s accessible, sensible—exactly the sort of book that should have (and still could + should!) take off and create a tiny little dent in books.” - The Kenyon Review“Michaels offers a smart and realistic guide to first recognizing the monoculture and the challenges of transcending its limitations, then considering ways in which we, as sentient and autonomous individuals, can move past its confines to live a more authentic life within a broader spectrum of human values.” - The Atlantic“5 stars: The cause and effect of our world is more surprising than you’d think. With intriguing notions about the driving ideas of stories in every shape of our life, “Monoculture” is an incredibly fascinating look at how the mind works and today’s consumer culture.” - Midwest Book Review“If you just read one book this year, read this one…You won’t just be considering the narrative of the culture in which you live, you’ll be considering the everyday choices you make in your life. But the best part of the story is that the author affords you the opportunity to pick up your pen and demand a rewrite…A mind-altering work.” - BuriedInPrint.com",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Sociology",
    "Philosophy",
    "Economics",
    "Cultural",
    "Society"
  ],
  "author": "F.S. Michaels",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/11234794-monoculture"
}