{
  "title": "Bloody Harvests",
  "description": "Even your soul isn't safe in death…On the outskirts of shimmering Johannesburg, Detective Harry Mason and his crew are summoned to a grisly crime scene. By all accounts, discovering the mutilated corpse of a young child is a horrific and heart-wrenching task. But in the South African city, where some citizens still cling to the nation's mythological past, there is much more at stake.Mason and his team must discover whether this gruesome death is the work of a serial killer on the loose; or the work of a cult leader practicing a tribal muti killing---in which children are sacrificed for their body parts in order to elicit powerful \"medicine.\" Discerning between the two is even more complicated than it seems, especially in a city rife with cultural and social tensions---and they're sure the killer will strike again.Mason's police partner, Jacob Tshabalala, is also faced with his own questions. Both a tribesman and a cop, he is forced to reconsider his beliefs as he becomes increasingly convinced that this time they are dealing with a genuine witch---perhaps one powerful enough to subvert the investigation itself. The two friends' relationship deteriorates as the case progresses and cultural tensions grow between them. They are still no closer to identifying the killer when a second murder occurs.Meanwhile Nina Reading, a young reporter, has been conducting her own investigation into slave trafficking, thus putting herself in deadly danger. Harry's discoveries and Nina's revelations unite and lead them ever deeper into a chilling spiritual underworld in the slums of Johannesburg, where money, superstition, and fear reign supreme. But their enemies will stop at nothing to protect their bloody harvests. International Praise for Bloody Harvests\"Kunzmann has a seasoned and individual voice.\"--- Publishing News (UK)\" Bloody Harvests is a valuable addition to the South African canon. It is a brilliant first novel by an engaging author. It charts new ground for the thriller/crime genre in South African literature.\" --- The Cape Times (South Africa)\"Kunzmann has turned South African crime statistics and African myths into a beautifully written piece of fiction. . . . It reads very much like a Hollywood blockbuster set in Jo'burg . . . a great read for thrill seekers.\"--- The Mercury (Australia)\" Bloody Harvests , a fast and grisly thriller, hails Kunzmann as an impressive new talent in this genre. This is Jozie noir . . . he's telling ripping stories in a contemporary setting.\" --- Sunday Times (South Africa)\"A gripping thriller, Richard Kunzmann's story is not only an addictive page-turner, it also teaches as much as it enthralls.\"--- Daily Echo (UK)\" Bloody Harvests gave me sleepless nights, yet kept me enthralled until the very last page.\"--- Pretoria News (South Africa)\" Bloody Harvests is an ambitious work and an interesting read . . . a fascinating story.\"--- The Citizen (South Africa)",
  "genres": [
    "Fiction",
    "Africa",
    "Mystery",
    "South Africa",
    "Crime"
  ],
  "author": "Richard Kunzmann",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/2141953.Bloody_Harvests"
}