{
  "title": "11,984",
  "description": "This is the older edition. Litterbot409 has a mind capable of predicting spills three days in advance, and a body fast enough to dust the museum of post-modern art in 20 millidays. The only problem is: nothing gets dirty in the super high tech world of the year 11,984, where cups are spill-proof, and rarely worn clothes are dirt-proof.\tEveryone lives in peace, sharing unlimited technology and wealth, in this perfect society without sexism, guns, money, names, obsolete punctuation marks, or unanswered questions. Life is pretty boring until Litterbot discovers the sky is glowing red. He warns his family of humans, but they never listen; he's just a garbage can with legs. But when the sky glow continues to grow brighter, and changes colors, it draws the attention of the world. Parent2, who happens to be the world's leading hydrologist/interior decorator, discovers all the water is going to evaporate from Earth in 203 days! The world prepares for mass evacuation.\tThen something happens that hasn't in a very long time: people are exhibitng aggressive behavior. The number of incidents increases until there is utter pandemonium. \tThe sky colors keep intensifying, as the family constructs their ship. It creates static in the computers, and unbeknownst to them, alters their minds. When the world is in red light, it makes everyone agitated. When the sky glows green, it sedates everyone. Periods where everything looks blue cause mass irritability. Eventually they figure it out, and must resist to finish in time. \tThe radiation grows so strong, it causes them all to mutate, which helps them work faster, but crashes world-computer, forcing them to search for paper books, and rely more on Litterbot. \tAlso, the moon is on its way down, growing bigger and bigger, orbiting faster and faster. Its gravity lifts everything in the air. PMS becomes cataclysmic. The air stirs into a hurricane of dirt, blackening the sky, and stranding them on a solar powered ship with no light. Will Litterbot go out into the dirt storm to clear the vents, sacrificing himself, so they can escape?",
  "genres": [
    "Science Fiction"
  ],
  "author": "Scott Talbot Evans",
  "average_rating": "3.14",
  "url": "https://www.goodreads.com/book/show/21423372-11-984"
}