{
  "title": "The Missing Pieces",
  "description": "In brief, laconic evocations, Henri Lefebvre lists a series of works that are either unfinished, lost, forgotten, destroyed, or that were never even made. This inventory of lacks becomes an incantation: if only for an instant, it transmits a presence to these \"units\" that had previously been lost to the history of human creativity and thought.- A boarder for two years following a national funeral, Mirabeau is removed from the Pantheon and transferred to the cemetery of Clamart when his pornographic novels are discovered - A photograph taken by Hessling on Christmas night, 1943, of a young woman nailed alive to the village gate of Novimgorod; Hessling asks his friend Wolfgang Borchert to develop the film, look at the photograph, and destroy it - The Beautiful Gardener, a picture by Max Ernst, burned by the Nazis -- from \"The Missing PiecesThe Missing Pieces\" is an incantatory text, a catalog of what has been lost over time and what in some cases never existed. Through a lengthy chain of brief, laconic citations, Henri Lefebvre evokes the history of what is no more and what never was: the artworks, films, screenplays, negatives, poems, symphonies, buildings, letters, concepts, and lives that cannot be seen, heard, read, inhabited, or known about. It is a literary vanitas of sorts, but one that confers an almost mythical quality on the enigmatic creations it recounts -- rather than reminding us of the death that inhabits everything humans create.Lefebvre's list includes Marcel Duchamp's (accdidentally destroyed) film of Man Ray shaving off the Baroness Elsa von Freytag-Loringhoven's pubic hair; the page written by Balzac on his deathbed (lost); \"Spinoza's Treatise on the Rainbow\" (thrown into a fire); the final seven meters of Kerouac's original typescript for \"On the Road\" (eaten by a dog); the chalk drawings of Francis Picabia (erased before an audience); and the one moment in Andre Malraux's life in which he exclaimed \"I believe, for a minute, I was thinking nothing.\" \"The Missing Pieces\" offers a treasure trove of cultural and artistic detail and will entertain even those readers not enamored of the void.\"",
  "genres": [
    "Poetry",
    "Art",
    "Nonfiction",
    "History",
    "France",
    "Essays",
    "Philosophy"
  ],
  "author": "Henri Lefebvre",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/21422875-the-missing-pieces"
}