{
  "title": "Letters from Vietnam: Voices of War",
  "description": "“No heroes, everyone did their part, and everyone was scared to death.”They are the words of soldier Mark W. Harms in 1968, summing up his combat experience during the Vietnam War. His stunning letter home is just one of hundreds featured in this unforgettable collection, Letters from Vietnam . In these affecting pages are the unadorned voices of men and women who fought–and, in some cases, fell–in America’s most controversial war. They bring new insights and imagery to a conflict that still haunts our hearts, consciences, and the conduct of our foreign policy.Here are the early days of the fight, when adopting a kitten, finding gold in a stream, or helping a local woman give birth were moments of beauty amid the brutality . . . shattering first-person accounts of firefights, ambushes, and bombings (“I know I will never be the same Joe.”–Marine Joe Pais) . . . and thoughtful, pained reflections on the purpose and progress of the entire Southeastern Asian cause (“All these lies about how we’re winning and what a great job we’re doing . . . It’s just not the same as WWII or the Korean War.” –Lt. John S. Taylor.)Here, too, are letters as vivid as scenes from a film–Brenda Rodgers’s description of her wedding to a soldier on the steps of Saigon City Hall . . . Airman First Class Frank Pilson’s recollection of President Johnson’s ceremonial dinner with the troops (“He looks tired and worn out–his is not an easy job”) . . . and, perhaps most poignant, Emil Spadafora’s beseeching of his mother to help him adopt an orphan who is a village’s only survivor (“This boy has nothing, and his future holds nothing for him over here.”)From fervent patriotism to awakening opposition, Letters from Vietnam captures the unmistakable echoes of this earlier era, as well as timeless expressions of hope, horror, fear, and faith.",
  "genres": [
    "Nonfiction",
    "War"
  ],
  "author": "Bill Adler",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/2142391.Letters_from_Vietnam"
}