{
  "title": "Culture of Revival – A Revivalist Field Manual: Vol. 1 Perseverance with Joy",
  "description": "Revival is birthed in the heart of God and transferred to anyone who has faith for the impossible. When John Wesley first visited Herrnhut, Germany, to see the Moravian movement, his response was, \"When will this Christianity fill the earth?\" The kingdom of God is indeed filling the earth today. In this book you will learn how to maintain an unoffendable heart; use your voice effectively to prepare the way; demonstrate a lifestyle of love; marry the land; live effectively in consecrated community; be grounded in the Word; persevere to win the prize; be activated through intimacy with Christ. No matter your age, you can be a part of this band of committed disciples who come together under the banner of holy devotion and unwavering commitment to contend for God's kingdom to come. \"This book is filled with insights to equip the reader for a lifestyle of sustained revival. The authors are all torchbearers for this great move of God, yet their instruction is profoundly practical, paving the way for a generation to complete the mandate given by God. Read as one who has no options but to please God with every breath, and you, too, will burn with a holy fire!\" Bill Johnson, Bethel Church - Redding, CA \"Culture of Revival is an crucial message to bring revelation for what a cultural reformation will look like in this current global wave of God. These young leaders are full of godly character and fresh articulation, calling a generation into abandonment and total obedience to Jesus and His teachings.\" Mike Bickle, International House of Prayer - Kansas City, MO \"My heart is so deeply moved to see this new breed of young men and women who love and honor their spiritual fathers and who carry a double portion of their love, their anointing, their vision, and their sacrifice. When I read this book, hope erupts in me like never before with expectation for a glorious revival manifestation and an earth-shaking cultural transformation.\" Lou Engle-www.thecall.com",
  "genres": [],
  "author": "Sean Feucht Jeremy Bardwell and Brian Brennt Andy Byrd",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/21425300-culture-of-revival-a-revivalist-field-manual"
}