{
  "title": "Pearls, Politics, and Power: How Women Can Win and Lead",
  "description": "Pearls, Politics, and Power is a call to action for new political engagement and leadership from the women of America. Informed by conversations with elected women leaders from all levels, former three-term Vermont Governor and Ambassador to Switzerland Madeleine M. Kunin What difference do women make? What is the worst part of politics, and what is the best part? What inspired these women to run, and how did they prepare themselves for public life? How did they raise money, protect their families' privacy, deal with criticism and attack ads, and work with the good old boys? Kunin's core message is that America needs an infusion of new leadership to better address the major problems of our time. To see how women can achieve that goal, she combines her personal experience in politics; the lessons of past women's movements; the stories of young women today who have new ideas about their role in society; and interviews with a wide range of women in positions of power, looking for clues to their leadership, as well as the effects of gender stereotyping. She interviews Senator Hillary Rodham Clinton, analyzes her campaign, and addresses the \"Is the country ready?\" Other interviewees include U.S. Representatives Loretta Sanchez, Linda Sanchez, Deborah Pryce, and Tammy Baldwin, and U.S. Senators Susan Collins, Amy Klobuchar, and Carol Moseley Braun, and Governors Kathleen Sibelius and Janet Napolitano. The next generation of women will be inspired to lead by seeing women like Nancy Pelosi wielding the gavel, and seeing themselves reflected in the portraits in statehouses, courthouses, corporate and university boardrooms, and the White House. Pearls, Politics, and Power will help ensure that this inspiration is not soured or deflected, but channeled into successful candidacies by America's leaders of tomorrow. What will it take for women to assume their rightful places in the political corridors of power?",
  "genres": [
    "Politics",
    "Nonfiction",
    "Womens",
    "Leadership",
    "Gender Studies",
    "Feminism"
  ],
  "author": "Madeleine Kunin",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/2143486.Pearls_Politics_and_Power"
}