{
  "title": "Chasing Stars",
  "description": "Nestled in a towering fir forest on British Columbia’s famous Vancouver Island, Three Rivers Campground is calling you to come relax, explore, and maybe even fall in love...Clover Rivers is completely, totally over her ex.Sure, her first ever relationship with a girl might have ended in a catastrophic breakup people still whisper about, but Clover is done with it. The four years since have made her stronger. Smarter. Four years have turned her into the kind of woman who doesn’t believe in wishes on stars or miraculous second chances. As an aspiring environmental scientist, Clover puts her faith in cold, hard data, and the data says there’s no way anything good can come of messing around with a girl who already broke her heart.Neavh Beaudoin is completely, totally still in love with Clover Rivers.When a series of disasters lands her living on her cousin’s couch—and back in the small island town she never thought she’d see again—Neavh is forced to confront the truth: leaving Clover behind was the biggest mistake of her life, and she’d give every star in the sky for another chance.As cramped small town life makes it impossible to ignore the way the two women still spark like a wildfire, Clover realizes Neavh’s reasons for leaving might not have been so straightforward, and the future she’s planned for herself in the meantime might not fit as well as she thought.The data suggests they’re only in for another heartbreak, but every theory’s got the tiniest chance to be proven wrong—especially when your last shot at love might depend on finally getting things right.Chasing Stars is part of the Three Rivers series, a trilogy of interconnected sapphic standalones. Grab your tent and get ready for an adventure in this steamy romance from bestselling author Katia Rose.",
  "genres": [
    "Romance",
    "Lesbian",
    "Second Chance",
    "Fiction",
    "Contemporary",
    "LGBT",
    "Queer"
  ],
  "author": "Katia Rose",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/214340151-chasing-stars"
}