{
  "title": "The Other F-Word",
  "description": "There are some words that a woman must overcome to find her own happiness. For the women of The Other Words series, each girl has to struggle through the obstacles of her scary word to accept the love of the hot, handsome man that awaits her. Every woman deserves to be loved for who she is, but will these girls be able to get over their fears to accept the commitment of forever so they can have a life of passion and belonging?Join Marley, Emmie, Stevie and Billie, as they tackle their words, and find out with the help of a supportive family, some awesome tunes, and plenty of humour, a woman can do just about anything! So pull up a chair, enjoy some dessert with us and let’s start dishing!Book Two in the In Other Words seriesDamien Wolfe is ferociously sexy. Emmie Mason is fastidiously stubborn. When fate brings them together, they are both challenged by the other F-word…forever.Fashionable forty-four-year-old, Emmie Mason is content with her fastidious life. She has everything she needs in her loving family and friends. Her eldest daughter, Marley, has married the man of her dreams, and she has a new grandchild. What more could a woman ask for?She isn’t prepared for fate to slap her in the face in the form of a bridal bouquet. Or worse, to run into the fantasy-inducing, eye-catching, panty-dropping, swoon-worthy man she’s been thinking about for over a year, even though they only danced together once.As it turns out, thirty-year-old real estate mogul Damien Wolfe has been thinking about her too. Damien’s flirty, funny and forthright personality challenges Emmie and tilts her world. But it’s his kind soul and compassionate demeanor that really frighten her.He’s easy to fall for, but how could she ever recover if she risked her heart to him? Can they both overcome their fears and commit to that other F-word…Forever?MK SchillerMK Schiller is a hopeless romantic in a hopelessly pragmatic world. By day, she dons a magic cape, calculator (sometimes an abacus), and an assortment of gel pens for her work in the world of finance. But by night, she sits by the warm glow of her computer monitor, and conjures up handsome heart-warming heroes and the vivacious heroines they love.A wife and mother of two loveable, but angst-ridden teenagers, she enjoys movies, gardening, and travelling. Although she loves to write, she is a reader first and enjoys nothing more than curling up with a good book and some tasty Italian (the food, of course!). She hopes you will enjoy her stories and write to her.",
  "genres": [
    "Romance",
    "Humor",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Erotica",
    "Family"
  ],
  "author": "M.K. Schiller",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/21443354-the-other-f-word"
}