{
  "title": "A Little of What You Fancy",
  "description": "'Teetotal!' Ma said. 'It's a libel. He'll never live it down. He'll never be able to hold his head up again. Whatever will people think? What's he going to say when anybody asks him to have one?' ' 'No,' 'said Dr Conner. 'You'll have to strap him down,' Ma said. 'You'll have to put the handcuffs on.' And so after a mild heart-attack - caused by rather too much of what you fancy - Pop Larkin finds himself off the booze, off the good food and off the good life generally, much to his own and everyone's else's horror and upset. And while Ma tries to find ways around 'doctor's orders', young Primrose is finding her own way round a rather flustered - not to say flushed - Mr Candy...This is the fifth of the five immensely popular comic novels consisting of ‘The Darling Buds of May’ (1958), ‘A Breath of French Air’ (1959), ‘When the Green Woods Laugh’ (1960), ‘Oh! To Be in England’ (1963), and ‘A Little of What You Fancy’ (1970). Bates, speaking of how he was inspired to create the Larkin family, recalled the real junkyard that he often passed near his home in Kent; and he remembered seeing a family -- a father, mother and many children, sucking at ice-creams and eating crisps in a \"ramshackle lorry that had been recently painted a violent electric blue\". He tried writing a brief tale based on the family, but soon decided that he couldn’t waste such a rich gallery of characters to a short story.\" Pop is a wonderful character who hates pomp, pretension and humbug; loves his family, but doesn’t hesitate to break a few rules... and his and the Larkins' secret is “that they live as many of us would like to live if only we had the guts and nerve to flout the conventions.\"",
  "genres": [
    "Fiction",
    "Humor",
    "Classics",
    "Comedy",
    "Audiobook",
    "Novels",
    "20th Century"
  ],
  "author": "H.E. Bates",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/2143539.A_Little_of_What_You_Fancy"
}