{
  "title": "For Your Sake",
  "description": "Hidden at the northern-most point of the Mountain State of West Virginia was the quiet town of Tippitt, home to less than twenty thousand residents as well as the Mountain Skulls Motorcycle Club. Under a veil of good standing and legitimate business, the 1% outlaws maintain a tight watch on their surroundings while conducting affairs which bring in the ‘real’ money.Ben Lawson isn’t just the club’s enforcer, but the one called upon when debts got settled. Big, strong and fiercely loyal, his unassuming calm belies a man willing to get his hands dirty for a club who’d been his only family. But when the deaths of two brothers hits too close to home, it cracks that detatched exterior, sending him on collision course which literally lands him in the path Eva Sinclair.Beautiful and independent, Eva has wrapped her life around her business and new home in an effort to bury memories best left behind. Anyone she ever cared for has either died or left, causing her to emotionally push away anyone who gets too close. But when near-fatal circumstances puts her on Ben’s radar, she finds herself being shadowed by a man as dangerous as his club’s whispered reputation. Before she knows it, Eva finds herself breaking her own protective rules, allowing the imposing biker into her life where his outlaw lifestyle challenges her civilian one. Their attraction is instant and explosive – and one neither one can afford……nor resist. But when the club finds a connection between Eva and a current threat, it jeopardizes the fragile trust between her and a man who holds no forgiveness for betrayal– and may wind up his target because of it.\nContains language, violence and explicit sex.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Motorcycle",
    "Crime",
    "Erotica",
    "Adult"
  ],
  "author": "Elayne DiSano",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/21441949-for-your-sake"
}