{
  "title": "Taken Altogether",
  "description": "If you want a story of passionate love, loss, heartbreak, and healing, written in an accessible style with humour and warmth, then this is the book for you.It explores the relationship between Nicholas, the handsome and commanding CEO of a successful London marketing company, and Eleanor, the creative and somewhat impetuous head of his design department.Nicholas, at thirty-three, with a failed marriage behind him and a rather cynical view of love, has developed a protective veneer of emotional detachment, and a guarded approach towards relationships. Although outwardly confident and self-assured, his calm composure masks an inner turmoil that he usually manages to repress by keeping a tight rein on his feelings, and satisfying his deep-seated need for control through the sexual domination of willingly submissive partners.Eleanor, by contrast, is not in the least guarded, being very open and responsive, strong-willed though possibly slightly naïve, and, as far as she is aware, not the least bit submissive. When Eleanor is summoned to Nicholas' office to explain discrepancies in her department's accounts, she cannot hide the instant attraction that she feels, despite finding his cool demeanour initially intimidating, and Nicholas finds himself drawn to Eleanor's natural and guileless charm and spontaneity, in a way that surprises and challenges him.As they embark on a sensual and tempestuous affair, they both struggle to reconcile their feelings and desires.Nicholas doesn't believe in love.Eleanor believes in fairy tales.Can Eleanor be with Nicholas without being destroyed by him?Does Nicholas want more than she can give?Can he control her? Will he love her?Can they find a way to be with each other?This novel tells the story of two people falling in love and establishing the parameters of a Dominant/submissive dynamic, while struggling to overcome their own doubts, and the malevolent actions of those who seek to destroy them. Previously published in three parts as the 'Love by Design' trilogy - 'Taken in Hand; 'Taken Further' and 'Taken Completely'.'Taken Altogether' is the complete novel, fully revised and edited.Comments made in four and five star reviews, on the U.S. and U.K. Amazon sites, for the three volumes of the previously published trilogy that comprise this novel, include words such as 'juicy'; 'spicy'; 'interesting'; 'well-written' and 'entertaining', with reference to how the main characters are likable, the plot believable, and the hero and heroine a good match whose love for each other is evident. The term 'an enjoyable read' is used several times.This is a love story for the modern age and as such contains adult material, including explicit language and descriptions of activities involving BDSM and consensual sex, which make it unsuitable for persons under 18yrs of age.",
  "genres": [],
  "author": "J.R. James",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/21433562-taken-altogether"
}