{
  "title": "Braving the Storm",
  "description": "From international best-selling author Elliott Rose comes a new forbidden-love series.I’m not supposed to feel this way…I never wanted to disappear more than while around my family. Briar Lane, the girl only useful for one thing: my surname.A business handshake and pawn to be traded. My father’s chess piece shuffled between empires. That was my life back in L.A. but all it took was finding the dirty secret stuffed in a jacket pocket, and my entire world unraveled.So, I fled to the one place I knew they could never find me. Crimson Ridge. Arriving in this snowy, harsh world, I thought I’d be starting over on my own, but it turns out I couldn’t have been more wrong. The abandoned mountain cabin I inherited isn’t what it seems. This mountain hides secrets. An ex-pro bull rider consumes this space, and now, my every thought with it... Stôrmand Lane. My father’s adopted brother.We should never have found ourselves isolated out here in the mountains together, each trying to outrun our pasts.All it took was one misunderstanding, one line almost crossed, and everything changed. A girl like me isn’t supposed to know what those tattooed hands feel like, and I’m certainly not meant to feel butterflies anytime that pair of piercing blue eyes land on mine.He might be my every fantasy, a cowboy I constantly dream about, but he’s a temptation I have to ignore. A man I absolutely cannot find myself attracted to. Even when he’s looking at me with the kind of hunger that can only spell ruin for us both.Long, dark nights spent in this tiny cabin can’t be the excuse to step into forbidden territory. Or can they?Braving The Storm is an interconnected stand-alone, book 2 in the Crimson Ridge series, and can be read separately. Intended for ages 18 and over.",
  "genres": [
    "Romance",
    "Westerns",
    "Forced Proximity",
    "Small Town Romance",
    "Contemporary",
    "Dark Romance",
    "Contemporary Romance"
  ],
  "author": "Elliott Rose",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/214382636-braving-the-storm"
}