{
  "title": "Haven Found (The Guard Trilogy Extended Series, Book 6): The Guards of Haven",
  "description": "Do dreams really come true?Unfortunately for Lynn, they sometimes do.Plagued for months by recurring dreams of a suspended angel brutally stripped of his wings, Lynn managed the visions as best she could, but when her daughters begin experiencing the same horrific dreams, she can no longer ignore the dark images that haunt her. Had she missed something on that first stealthy visit to the lab in Ottawa? Or had this brutal attack occurred elsewhere, out of reach of those who might save this nameless angel? Were Lynn’s earlier dreams a glimpse into the past, the present, or were they foreboding messages of things to come?As for the dreams of others…Kris never dreamed he would see Jana again, nor did he ever consider she could be a part of his life. Then, like a daydream… there she was, standing at the entrance of his new restaurant.Thaddeus’s dream of creating a superior race hasn’t wavered, though his pursuit of Ms. Westlake has taken a detour. His interests have shifted now to Brazil and a remote branch of science. And while Thaddeus is away, the mice are playing. Lyndon’s affections for Lane have grown, so much so, he’s requested an alternate tracker investigate the latest lead on this allusive target. Loyalties, too, are shifting while lies, deception, and secrets come to the forefront.And Dr. Stone’s dreams, they have taken on a vivid realness that may be affecting her ability to counsel her latest patient.What would you do if you sensed someone was in pain? Would you risk your own life to find them—save them? What if the loyalties you believe were solid shifted because of your actions or inactions? Would you put yourself in danger to pursue the answer? What if your actions changed… everything?Book 6, Haven Found, is the next in The Guard Trilogy Extended Series - The Guards of Haven. Although the original three books of The Guard Trilogy can stand alone as a complete story, and even though these next novels adhere to the original storyline, readers should complete the trilogy before going on to read the next books in the extended series.",
  "genres": [],
  "author": "N.L. Westaway",
  "average_rating": "4.77",
  "url": "https://www.goodreads.com/book/show/214388299-haven-found-the-guard-trilogy-extended-series-book-6"
}