{
  "title": "Charlotte & Leopold: The True Story of The Original People's Princess",
  "description": "The tragic story of the doomed romance between Charlotte, heir to the English throne, and Leopold, uncle of Queen Victoria and first King of the Belgians. A story that Jane Austen famously declined to tell, “I could no more write a romance than an epic poem.” Charlotte was the only legitimate royal child of her generation, and her death in childbirth resulted in a public outpouring of grief the like of which was not to be seen again until the death of Diana, over 150 years later. Charlotte’s death was followed by an unseemly scramble to produce a substitute heir. Queen Victoria was the product. James Chambers masterfully demonstrates how the personal and the political inevitably collide in scheming post-Napoleonic Europe, offering a vivid and sympathetic portrait of a couple whose lives are in many ways not their own. From the day she was born, Charlotte won the hearts of her subjects and yet, behind the scenes, she was used, abused, and victimized by rivalries—between her parents; between her father (the Prince Regent, later King George IV) and (Mad) King George III; between her tutors, governesses, and other members of her discordant household; and ultimately between the Whig opposition and the Tory government. Set in one of the most glamorous eras of British history, against the background of a famously dysfunctional royal family, Charlotte & The True Story of The Original People’s Princess is an accessible, moving, funny, and entertaining royal biography with alluring contemporary resonance. James Chambers is a professional historian and author of many books on British and colonial history, including The Daily Telegraph History of the British Empire , which sold over 250,000 copies. He has also written extensively for television and made countless BBC TV and radio appearances.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Historical",
    "British Literature",
    "19th Century",
    "Regency"
  ],
  "author": "James Chambers",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/2145185.Charlotte_Leopold"
}