{
  "title": "The Aspern Papers",
  "description": "The Aspern Papers is a novella by American writer Henry James, originally published in The Atlantic Monthly in 1888, with its first book publication later in the same year.In this classic novella, an anonymous narrator relates his obsessive quest to acquire some letters and other private documents that once belonged to the deceased Romantic poet Jeffrey Aspern. Attempting to gain access to the papers, the property of Aspern's former mistress, he rents a room in a decaying Venetian villa where the woman lives with her aging niece. Led by his zeal into increasingly unscrupulous behavior, the narrator is faced in the end with relinquishing his heart's desire or attaining it an an overwhelming price.Inspired by an actual incident involving Claire Clairmont, once the mistress of Lord Byron, this masterfully written tale incorporates all those elements expected from James: psychological subtlety, deft plotting, the clash of cultures, and profoundly nuanced representation of scene, mood, and character.Excerpt:...I had taken Mrs. Prest into my confidence; in truth without her I should have made but little advance, for the fruitful idea in the whole business dropped from her friendly lips. It was she who invented the short cut, who severed the Gordian knot. It is not supposed to be the nature of women to rise as a general thing to the largest and most liberal view—I mean of a practical scheme; but it has struck me that they sometimes throw off a bold conception—such as a man would not have risen to—with singular serenity. “Simply ask them to take you in on the footing of a lodger”—I don’t think that unaided I should have risen to that. I was beating about the bush, trying to be ingenious, wondering by what combination of arts I might become an acquaintance, when she offered this happy suggestion that the way to become an acquaintance was first to become an inmate. Her actual knowledge of the Misses Bordereau was scarcely larger than mine, and indeed I had brought with me from England some definite facts which were new to her. Their name had been mixed up ages before with one of the greatest names of the century, and they lived now in Venice in obscurity, on very small means, unvisited, unapproachable, in a dilapidated old palace on an out-of-the-way this was the substance of my friend's impression of them. She herself had been established in Venice for fifteen years and had done a great deal of good there; but the circle of her benevolence did not include the two shy, mysterious and, as it was somehow supposed, scarcely respectable Americans (they were believed to have lost in their long exile all national quality, besides having had, as their name implied, some French strain in their origin), who asked no favors and desired no attention....",
  "genres": [
    "Classics",
    "Fiction",
    "Italy",
    "19th Century",
    "American",
    "Literature",
    "Novella"
  ],
  "author": "Henry James",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/214528.The_Aspern_Papers"
}