{
  "title": "Stars in Their Eyes",
  "description": "A sexy and swoony new adult romance...Celebrity photographer and college senior Jess Leighton desperately needs to crash the wedding of the year. Snapping just one pic of the A-list Hollywood couple tying the knot will pay her way through grad school. But with security tighter than the bride-to-be's corset, she'll need more than her camera and smarts, she'll need help from her biggest rival--hot, British, motorcycle-riding William Harrigan, whose sexy accent can melt the panties off any woman. He’s the last person Jess should trust, but he's her only ticket in.William Harrigan wants one thing – to stay in L.A. past college graduation. With a student visa set to expire, the clock is ticking. When he lands a gig that pairs him with the beautiful blond spitfire Jess, he’s scored his best shot at living out the American dream. Winning her trust would be a whole lot easier, however, if he didn’t have ulterior motives...But there’s no faking the intense attraction between them. Try as they might to resist each other, soon sparks are flying, as they devise a plan to sneak into the ceremony. But when Jess' new celebrity client raises the stakes, she starts to smell blackmail, and soon she and Will are chasing down cheating directors, staking out clandestine trysts, and making fake IDs, all while sneaking scene-stealing kisses and hot nights together.The audience loves a happy ending, but in a town where everyone's acting and no one's playing by the rules, can Jess and William find their own ever after in time?**STARS IN THEIR EYES is a spin-off of the New York Times & USA Today Bestselling CAUGHT UP IN LOVE series. It is the start of the new adult series WRAPPED UP IN LOVE.**",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Amazon",
    "Chick Lit"
  ],
  "author": "Lauren Blakely",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/21447131-stars-in-their-eyes"
}