{
  "title": "The Very Old Painter and Her Husband",
  "description": "Judith Weinshall Liberman wrote THE VERY OLD PAINTER AND HER HUSBAND in the 1990s, but it was not until 2012 that she first published the story. In 2013, she decided to publish the story as a picture book. The book tells the tale of a woman artist who expresses her feelings about the human condition through her paintings, and of her devoted husband, who appreciates the importance of her artworks. The husband tries to bring his wife's art to the attention of others, but his efforts are unsuccessful. It is only after the painter's death, as the public becomes aware of the monetary value of her art, that interest in her paintings becomes widespread. The husband's reaction to the public's sudden interest in the painter's artworks provides a surprise ending.  ABOUT THE AUTHOR  Born in Israel (then called \"Palestine\"), Judith Weinshall Liberman came to the United States in 1947 to pursue higher education. She earned four American university degrees, including two in law. After settling in the Boston area in 1956, she studied art and creative writing. Beginning in the early 1960s, and for four decades thereafter, Ms. Liberman created numerous series of artworks. Her art has been widely exhibited, and is represented in the collection of museums and other public institutions. During her long career in visual art, Ms. Liberman wrote and published several books, among them some children's books. Her book THE BIRD'S LAST SONG (Addison-Wesley, 1976), which she wrote and illustrated, won a citation as one of the \"fabulous books of the year.\" In 2012, she published her second children's book, ICE CREAM SNOW (Dog Ear Publishing), which she also illustrated, and in 2013 her third, THE LITTLE FAIRY (illustrated by Gail Davis, Dog Ear Publishing). Judith Weinshall Liberman's archives can be found in the Arts Department of the Boston Public Library and at the Smithsonian Archives of American Art.  ABOUT THE ILLUSTRATOR  In 2013, Judith Weinshall Liberman decided that her story THE VERY OLD PAINTER AND HER HUSBAND would make a meaningful picture book if properly illustrated. Since she did not feel that, in light of her deteriorated eyesight, she could do justice to illustrating the book herself, she selected a fine artist, Ms. Gail Davis, to create the illustrations under the author's guidance. The two had previously collaborated on THE LITTLE FAIRY (Dog Ear Publishing, 2013). Since THE VERY OLD PAINTER AND HER HUSBAND was semi-autobiographical, it was clear to both the author and the illustrator that it would be important to feature the author's own paintings as part of the illustrations, and thus introduce readers to Judith Weinshall Liberman's art. Ms. Davis' illustrations for THE VERY OLD PAINTER AND HER HUSBAND not only skillfully integrate the author's paintings into the illustrations, but also delightfully capture the spirit of the story and of the characters.",
  "genres": [],
  "author": "Judith Weinshall Liberman",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/21445441-the-very-old-painter-and-her-husband"
}