{
  "title": "Salamander Cotton",
  "description": "A dark, chilling mystery set in the brooding, atmospheric lands of South Africa In his debut thriller, Bloody Harvests, Richard Kunzmann gave readers a glimpse into the turbulent South African landscape. Now Detective Inspector Jacob Tshabalala and his former colleague Harry Mason return with another beautifully spellbinding thriller combining murder, revenge, greed, and the classic struggle between good and evil. A wealthy ex--mining boss has been found beaten and burned to death at his home in suburban Johannesburg. His estranged wife, however, does not seem particularly surprised by this cold-blooded murder, but keeps insisting that the killer will be found in the Northern Cape, where the victim owned a farm with a dark secret. It’s a remote and desolate landscape of extreme poverty, burdened with a bleak history as an asbestos-mining community. When Tshabalala persuades Mason to investigate a link between the man’s murder and the disappearance of his daughter thirty years before, Harry has no way of knowing he will soon be plunged into a menacing world of rumored supernatural attacks, corporate cover-ups, ruthless hijackers, and bitter vengeance. Kunzmann returns with a strong force, capturing the bitter landscape and people of Johannesburg and beyond---captivating readers with his plot twists, dramatic action, and engaging characters. Salamander Cotton is a representation of poverty and a portrait of a country whose values of freedom and justice are only just emerging. Praise for Bloody Harvests “Not since James McClure’s outstanding 1970s South African police series has there been this serious an attempt to revisit that culture. . . . A gritty exploration of South Africa’s dark heart. This outstanding novel is sure to win readers everywhere.” --- Library Journal (starred review) “The author does a fine job of depicting the city’s combustible mix of poverty, ignorance, intolerance, and crime, and the handful of brave men who seek to douse the flames when that mix ignites.” --- Publishers Weekly “Kunzmann’s debut is an impressive successor to James McClure’s apartheid procedurals.” --- Kirkus Reviews “Kunzmann has a seasoned and individual voice.” --- Publishing News“A valuable addition to the South African canon . . . a brilliant first novel by an engaging author. It charts new ground for the thriller/crime genre in South African literature.” --- The Cape Times“A fast and grisly thriller . . . hails Kunzmann as an impressive new talent in this genre.” --- The Sunday Times",
  "genres": [
    "Crime",
    "Africa",
    "Mystery"
  ],
  "author": "Richard Kunzmann",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/2144599.Salamander_Cotton"
}