{
  "title": "Wishful Kisses",
  "description": "How do you convince the man you love to believe the impossible?  Poor Kimberly has spent her entire life pining for a man that will never return her affections. After spending a fantastic week in the summer of 1990 together, handsome and charming Tony Frontera made a promise that he would return to Kim after Operation Desert Storm. Unfortunately, he broke that promise when he was killed in action.  Kim spent the next two decades trying to fill the hole that he left in her life, but it never happened. Despite a rewarding career, she never found true happiness, the happiness that she should have had with Tony...  When the Fountain of Love suddenly grants her deepest wish, she finds herself back in 1990 in her old body, able to change the hand that fate dealt her. However, the power of the fountain is limited- in order to change Tony's fate, she must do the impossible. Although she had dreamt about saving Tony, she never thought about how she would do it. With only your words, how do you convince your soul mate that you are from the future? How do you tell them to abandon their country and leave everyone they know behind?  If you enjoyed Champagne Kisses, you will love this side story to Rachel and Dean's timeless love story.  An excerpt:  \"Who are you?\" I whispered, staring at the penny.  \"My name is Diana. I created this fountain a long time ago,\" she replied. Her hand released mine.  \"Does that mean that you're going to grant my wish?\" I asked, my voice hopeful. I gripped the penny tightly in my hand, afraid that if I let it go, this really would be nothing but a dream.  \"That's up to you, child.\" Diana's perfectly arched brows came together. \"It is a larger choice than you think.\"  \"But I could have Tony back?\"  Her face relaxed into a soft smile. \"I can send you back in time. Give you the chance to save him.\"  \"Tony...\" I whispered, not even meaning to speak.  \"But there is a risk.\" She touched my cheek, turning me to look into her green eyes. They were magically vibrant, with shades of emerald, green apple, and evergreen. \"Playing with time changes everything. Everything you now have will be gone. Choices unmade for better and for worse. You even hazard being written out of time completely.\"  \"But I could get Tony back?\" I asked stubbornly. She gave a solemn nod. \"Then, yes. Whatever I have to do, I say yes.\"  \"Are you sure? You risk all,\" she said. She waved her hand over the water in the basin. Images appeared in the water of my paintings, my apartment, my friends. They all faded into mist and then back to clear water. \"You risk all that you are and all that you have by choosing this.\"  I looked at her, meeting her eyes. \"Yes. I would risk everything and more to save Tony...\"",
  "genres": [],
  "author": "Krista Lakes",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/21455049-wishful-kisses"
}