{
  "title": "Color in Our World",
  "description": "ABOUT THE BOOK  This book presents spectacular color photographs, each appearing side by side with its desaturated, gray version, thus demonstrating in a clear visual form the richness that color contributes to our universe. The story-poem that connects the photographs in this book is based on a lyric that Judith Weinshall Liberman wrote for her musical play TO BE AN ARTIST, which was published in her book ON BEING AN ARTIST: Three Plays and a Libretto (iUniverse, 2012). The musical includes an encounter between Judith, herself a visual artist, and the noted artist Vincent van Gogh, during which van Gogh sings a hymn to color while conjuring up a dull world that is all gray. This book is a visual presentation of van Gogh's - and the author's - hymn to color in our world.  ABOUT THE AUTHOR  Born in Israel (then called \"Palestine\"), Judith Weinshall Liberman came to the United States in 1947 to pursue higher education. She earned four American university degrees, including two in law. After settling in the Boston area in 1956, she studied art and creative writing. Beginning in the early 1960s, and for four decades thereafter, Ms. Liberman created numerous series of artworks. Her art has been widely exhibited, and is represented in the collection of museums and other public institutions. During her long career in visual art, Ms. Liberman wrote and published several books, among them picture books. Her book The Bird's Last Song (Addison-Wesley, 1976), which she wrote and illustrated, won a citation as one of the \"fabulous books of the year.\" Later, she published four additional picture books, Ice Cream Snow (Dog Ear Publishing, 2012), The Little Fairy (Dog Ear Publishing, 2013), Haifa (Dog Ear Publishing, 2014), and The Very Old Painter and Her Husband (Dog Ear Publishing, 2014). Judith Weinshall Liberman's archives can be found in the Arts Department of the Boston Public Library and at the Smithsonian Archives of American Art.",
  "genres": [],
  "author": "Judith Weinshall Liberman",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/21445444-color-in-our-world"
}