{
  "title": "I Blew Up Juarez",
  "description": "It's her 33rd birthday, but drug trafficker Johnny Saucedo won't be celebrating until her next job is done. Plagued with inexplicable surges of energy that leave her incapable of controlling her own body, and haunted by events from her past, Johnny seeks refuge from her troubles in the home of her best childhood friend, the incorrigible and mystic-minded Phoebe Maclaggan, who lives conveniently close to Johnny's new assignment. But the job might not be what it appears to be, and Phoebe's insistence on tagging along doesn't make things any easier for Johnny. A heated altercation breaks out between the two women, and the mysterious energy surges out of Johnny's body, decimating the entire city of Juárez, Mexico, and leaving Johnny in a near comatose state. During her state of unconsciousness Johnny meets an enigmatic being named Jossara, who informs Johnny that her powers have only just begun to surface. Unfortunately, so have her problems. Labeled a traitor in the trafficking industry, and a possible-terrorist by the military, Johnny now must lace up her combat boots for the fight of her life. But the stakes are bigger than she can even begin to imagine.Written in the spirit of folly, I Blew Up Juarez is a fiction work steeped in social observation trained on the status of 21st century American society. Inspirations for this novel include William Shakespeare, Edgar Allen Poe, Martin Heidegger, Aldous Huxley, Ayn Rand, Henry David Thoreau, Simone de Beauvoir, Friedrich Nietzsche, Amit Goswami, Carl Sagan, Stephen Hawking, Neil DeGrasse Tyson as well as the Bhagavad-Gita. Modern film fans of the blissful nihilism in The Big Lebowski as well as the metaphysical absolutism of From Dusk Til Dawn will find an alternate home in this intense, humorous, fast-paced story of action and intrigue that will have the reader on the edge of their seat.",
  "genres": [],
  "author": "Von Simeon",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/21447757-i-blew-up-juarez"
}