{
  "title": "Nietzsche Against Dracula: Part One",
  "description": "This book is no longer available.“You are going to meet the Devil! Do not go to the castle!”“Please do not worry on my account,” I joke. “I need not fear the Devil – I am the Anti-Christ.”An eerie sucking sound fills the room as every Romanian draws a sharp breath. A dozen arms do a dance of fear as they cross themselves. Somewhere, a pottery beer mug drops and shatters, its fragments fleeing across the floor. All eyes turn to the priest. “Pray God forgives your blasphemy,” gasps the beadsman.“Have you not heard? God is dead!” I throw back my head and laugh.It is October 1888. In his lodgings in Turin the German philosopher Friedrich Nietzsche pours out his thoughts in long, feverish days of writing. Committed to ‘revaluing all values’, book after iconoclastic book tumble from his pen. It is a torrent of ink that continues to pour even though – perhaps because – Nietzsche is almost completely neglected, his books unread and often unpublished. Nietzsche Against Dracula takes the small historical liberty of asking what if…What if Nietzsche, sick, poverty-stricken and dejected, found he had a hitherto unknown admirer – one who seemed to truly appreciate his challenging work? What if this would-be patron presented Nietzsche with an invitation to holiday in luxury at his estate in the Austro-Hungarian province of Transylvania? What if Nietzsche found himself dragged into a world of physical danger and desperate action unfamiliar since his time as a medical orderly during the Franco-Prussian War?What if he was plunged into emotional turmoil by two beautiful women  – one exemplifying culture and intellect; another sensuality and animal passions?What if Nietzsche found that his host – let us call him by his nickname, Dracula – had misunderstood his philosophy in ways he couldn’t have imagined? What if he realised that the forceful opinions he had deliberated over with such care, and expressed with lovingly crafted eloquence, threatened to unleash a vortex of destruction that could devastate the next century?What would Nietzsche do?Embark on the journey to find out in Part One of Nietzsche Against Dracula.",
  "genres": [],
  "author": "Steven Prizeman",
  "average_rating": "1.67",
  "url": "https://www.goodreads.com/book/show/21455380-nietzsche-against-dracula"
}