{
  "title": "The Fine Print and Other Yarns",
  "description": "The Fine Print and other Yarns is a collection of nine stories. The first seven are set in Paris of 1980s and 1990s when India was a poor, developing country with a closed economy, and France still considered as one of the leading world powers. During those pre Internet and pre mobile telecommunication days, when exchange rules allowed one to carry only five hundred dollars abroad, few Indians could think of visiting Paris leave apart staying there for a long period. These stories are about a cross section of young and not so young Indians in Paris of those days. They provide an insight into their minds as they struggle to come to term with the life in Paris with their resilience and adaptability, which is considered as the hallmark of the Indian diaspora. The last two stories are about the social transformation in India that started towards the end of the last century with the advent of mobile phones and opening up of it economy. This collection is like a kaleidoscope, each turn of which presents an eminently interesting and unforgettable character in an intriguing situation. ‘Buddy The Impressionist’, the first story, is about Buddhadeb, popularly known as Buddy, who has a fixation for the bohemian life of the Impressionist painters in Paris. He gets a rare opportunity to visit Paris for two days after attending a seminar in England under a cultural exchange program. Hoping to experience first-hand how his favorite painters and artists lived in Paris, Buddy goes around searching for something that would correspond to his image of life in Paris which is based primarily on his reading of Moon and Sixpence and Lust for Life by Irving Stone. Finally, a chance remark by a waiter in a bar in Montmartre when he asks him for a glass of absinthe provides him a clue to what he was looking for unsuccessfully.‘The Fine Print’ is about Krishnan who is pursuing an MBA at a reputed Business School in Paris and aspiring to become a marketing guru. Living on a shoe string budget, Krishnan is thrilled when he gets an invitation from a class mate for her birthday party in an upscale restaurant in a chic quarter of Paris. That dinner in that expensive restaurant proves to be a valuable lesson in marketing skills for Krishnan that he ends up learning the hard way.‘The Transformation’: When Amitabh and his friends arrives in Paris to attend a training course they are overwhelmed by how much the city has to offer, most of which however they can ill afford given their meagre monthly allowances which is barely enough to make the two ends meet. Though they are all in the same situation his friends have great expectations from Amitabh who is known to be a generous and hospitable person. After indulging them for a few days Amitabh realizes that he would not be able to sustain it and starts following the adage ‘when in Rome do what the Romans do’. It soon leads to an interesting rivalry in which each one is trying to boast about his exploits in Paris and new possessions yet remaining secretive and unwilling to provide any further details to the others.‘The Visitor’: Dr Chopra, a widely traveled Indian doctor, who wants always to have the final word when it comes to foreign travel, decides to visit Paris on his way back to India after attending a conference in USA. Not knowing a word of French and unable to communicate with anyone at the airport, the jet setting doctor finds himself driven to despair. Cursing himself why he chose to halt in Paris he toys with idea of taking a flight back to Delhi the same day but unable to do so. He has a harrowing experience finding his hotel and decided not to step out of it till Amitabh, one of whose close friends has requested him to take Dr. Chopra around in the city arrives. Nevertheless, before he leaves after his brief stay there, he is so smitten by Paris that he is already making plans for his next visit.‘Another Visitor’: Amitabh gets a letter from Dr. Singh, a distant relative who is a professor of Sanskrit, informing him about his forthcoming visit to Paris as a part of his international tour. He is worried how a person like him will find his way in a place like Paris, where even a seasoned traveler like Dr. Chopra had such a harrowing experience as he could not speak French. He is however in for a great surprise when not only Dr. Singh manages to reach him at his suburban hostel on his own but narrates to him his exploits in the city.‘Pieter Van Der Polder’: Pieter, a Dutch research scholar, can be seen in the common kitchen of the hostel at fixed time every evening, cooking his dinner with a finesse and attention to details that reminds one of a classical music performer. Though friendly, he likes to remain aloof and is generally left to himself by the others. However, when a Belgian girl shifts into the hostel on his floor, his serene existence gets disrupted as he is drawn into an interesting battle of wits with her.‘The Mobile Phone Dealer’: A young mobile phone dealer in Delhi, who became a multimillionaire selling mobile phones, soon after the introduction of mobile telephones in Indian markets and then got reduced to penury due to a sudden reversal of his fortunes, is once again on an upward trajectory in his business. Travelling from New Delhi to Chennai by train, he relates to his fellow passengers the tale of his shady business deals in a very brash and candid manner, not knowing that there is a person among his audience who may prove to be very dangerous for him.‘Bawa and His Fiat’: Bawa, a corporate executive in New Delhi buys a Fiat—his first car, towards the end of nineteen eighties. After the influx of a host of new generation Japanese and German cars in the Indian market over the next decade, Bawa sees his car getting transformed into virtually a piece of antique. He notices people in plush new cars driving alongside him giving him strange looks. His friends and colleagues are forever making remarks about his old car. One day even his daughter, whom he drops at her school every morning, tells him that all her friends come in new cars while his car is so old looking. It remains a moot point if he will go for a new one.Some reviews of the first edition:“Parisian adventures: Stories that skirt around the bothersome issues of crossing cultures.” (Literary Review, The Hindu)“A smorgasbord of unforgettable characters.” (India Today)“A kaleidoscope, each turn of which presents an eminently interesting and unforgettable character.” (The Sunday Tribune; Spectrum)“The stories provide a keen insight into the mind of an average Indian abroad, his resilience and adaptability.” (Asian Age)",
  "genres": [],
  "author": "Dinesh  Verma",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/11236874-the-fine-print-and-other-yarns"
}