{
  "title": "The Boy Who Knew Me When",
  "description": "Librarian's note: This is an alternate cover edition for ASIN: B00J0OOUOE.AUTHOR UPDATE 3/29 Book has been updated with newly improved formatting. Contact Amazon to update your copy.Jemma Hayes has been waiting for the day that she could say goodbye to Taylor, TX the town where her past holds her back and weighs on her heart more and more with each waking hour. A past that has cost her the ability to trust, love and live her life like a normal teenage girl should. A past that violently stole from her everyone that she loved when she was only 8 years old right before her eyes. The small town and the people who dwell beyond it's boundaries constantly remind her of the horrific events that led up to the moment that her world changed forever and she cannot take another second of the horrible memories tearing her apart. After graduating from high-school and ending the relationship with the man who held her together for the last 4 years she finally has her chance to free herself from the past that torments her dreams and prevents her from moving forward. Moving to Austin with her best friend Brea the two begin their lives in college, partying and living it up like they have never done before. But just as things begin to look up Jemma is confronted by her past dead on. How will she cope when the return of a long lost friend turns her world upside down, bringing all of her demons out to play while igniting in her emotions she never thought possible? Will her past doom her to the same fate of the ones she loved and lost or will it be the very thing that saves her? 'The Boy Who Knew Me When' deals with subject matter of a sensitive nature including graphic scenes of violence as well as adults in extreme sexual situations. This book is for mature readers 18+ and up The boy who knew me when is book one in Boys to Men trilogy and can be read as a stand alone novel.",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary Romance",
    "Erotica",
    "Amazon"
  ],
  "author": "J.L. Bostick",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/21461893-the-boy-who-knew-me-when"
}