{
  "title": "The Ragpicker King",
  "description": "In the epic follow-up to the New York Times bestseller Sword Catcher, praised by George R. R. Martin as “everything I look for in fantasy,” Lin and Kel must chart a perilous course between love and lies.Kel Saren, body double to Conor, crown prince of the dazzling city of Castellane, is caught between two worlds. In order to protect his beloved prince, Kel must find the culprits responsible for a massacre at the royal palace—and the only clues are held by the Ragpicker King, the notorious criminal who rules Castellane’s underworld. The trail Kel follows leads back to the Hill, where among decadent nobles and glittering parties a dark conspiracy to destroy the royal family has taken hold—a conspiracy headed up by the monstrous Artal Gremont, the man engaged to marry the woman Kel adores. Meanwhile, Lin Caster must face the aftermath of the greatest risk she’s ever taken. To save the life of a dying friend, Lin has falsely claimed to be the Goddess Reborn, the legendary heroine destined to save her people. Now the terrifying—but strangely magnetic—leader of her people has arrived to test her powers. The price of failure is exile, and only through her alliance with the Ragpicker King can she continue to access the magic that may save her. Then Prince Conor reappears in her life, demanding that she use her healing powers to cure the madness of his father, the King. Lin soon realizes the King is gripped by an ancient and terrible magic, one whose lure she cannot deny any more than she can deny her growing passion for Conor. As the simmering tensions in Castellane reach a fever pitch, Lin and Kel must decide who to trust when any false move means death—or worse.",
  "genres": [
    "Fantasy",
    "Romance",
    "Adult",
    "Romantasy",
    "High Fantasy",
    "Audiobook",
    "Fiction"
  ],
  "author": "Cassandra Clare",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/214591924-the-ragpicker-king"
}