{
  "title": "Captivate Me",
  "description": "Our angelic origins give us power. Our blood is why they hunt us.After an incident at school that reveals her powers, Kat's parents ship her off to Midland Pines, a boarding school for the paranormally gifted, where she hopes to finish her senior year in peace. She makes new friends and has the attention of an illusionist name Levi, though something about his easy smile and crowding nature gives her pause.It's not long before the shadows in the woods call to her. There's a pull to them she can't ignore, and she swears one night that a boy watches her from the wood line--the same boy who appears in her dreams while a secret admirer leaves her flowers. One by one, students go missing. The school goes on lockdown, and the place she suspects she'll find the answers is the one place she knows she shouldn't go.What she finds there is more than she's ready for, including Gabe, a dark and captivating Half-breed like her. Their Nephilim origins mean more than just a source of divine power, it also means their blood is precious to those who need it for their own wicked purposes. He and his adoptive family claim they can keep her safe. Hidden. But because their existence must remain a secret, she'll also have to make an impossible choice to leave her old life behind.But not everything is as it seems, and she quickly learns that not everyone has her best interests in mind. She'll have to sort friend from foe, truth from lies, before time runs out. Her life, and everyone else's at Midland Pines, depends on it.Fans of HUSH, HUSH by Becca Fitzpatrick, FALLEN by Lauren Kate, and the HOUSE OF NIGHT series by P.C. and Kristin Cast will devour this Young Adult Paranormal Romance with plenty of action, danger, swoon-worthy teenage love, and a plot twist you'll never see coming. It has also been nominated for multiple awards for BEST VILLAIN! Complete series available now...",
  "genres": [
    "Paranormal",
    "Young Adult",
    "Romance",
    "Paranormal Romance",
    "Angels",
    "Fantasy",
    "Magic"
  ],
  "author": "S.J. Pierce",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/21459571-captivate-me"
}