{
  "title": "All Fall Down",
  "description": "All Fall A deadly game of Ring around the Rosie is the second book in the new series, The Nursery Rhyme Murders , by none other than the #1 Police Procedural and Hard Boiled Mystery bestselling author Ben Hopkin!Praise for All Fall Down ...\"Fans of Ben Hopkin... get ready for a read like no other! As we progress in the hunt for Humpty Dumpty the serial killer, we know that Coop is really having a tough time with working through her issues and as things gear up Coop gets worse. Everywhere they turn Humpty Dumpty is there, Pennsylvania, Texas, back at Quantico it's just like he is a step ahead at all turns! The team takes a real beating. From page one to the last page I found myself holding my breath, I just couldn't stop reading. Every time I figured things out, they'd change and YOU will not believe the ending!!!!!! Never in a multi-million years was I ready for this. You already know that Ben and Carolyn are the masters at raising the emotions in their stories and this one is no different, pain, guilt, laughter, and confusion will build till that last page, and will keep you wanting more. Don't miss this highly involved chase to the end of All Fall Down.\"DD GottAmazon Reviewer\"All Fall Down was an epic follow-up to the previous book and to me, was even more intense than the previous book as well... The ending shall not be told by me but I will say that it rocks everyone to the core. Will there be a need for another installment? You'll have to read to find out.\"Mike S.Amazon ReviewerContinuing the chase for Humpty Dumpty, the team travels into a hellish landscape to track down a devastating killer intent on destroying everything in sight.Full of the twists and turns you expect from Hopkin, All Fall Down is a page turning thriller for mystery fans.More praise for All Fall Down ...\"The crewmembers are so torn, individually and collectively. I felt so sorry for each of them. The harder they try to catch a break, the more cruel actions hit them. Ben and Carolyn have woven a story that is so hard to put down, you will be tempted to read it at one sitting. Can't wait for next chapter (book)!\"KrispyB  Amazon Reviewer\"Ben Hopkin and Carolyn McCray return with their unlikely cast of characters from Humpty Dumpty .  All Fall Down is full of suspense, action, mystery, misdirection, out right confusion for the team and an ending that will shock you to the core. Even though I suspected it just minutes before it happened, I was still just floored and I am left wondering if the team can survive the latest development in brutal chase to capture Humpty.\"dreamsgate  Amazon Reviewer\"This novel is an excellent sequel to the previous book...The turns and twists, especially the end, are fantastic and I never would have guessed how the story ended. The characters and their developments are close to reality and I could relate to each of them. So, if you are looking for something special and really entertaining, then just grab this novel. You will love it!\"Jennifer90  Amazon ReviewerIf you enjoy the pace of Patterson, the glorious gore of Harris and the wit of Cornwall, you are going to LOVE All Fall Down .**Want all of the stories from Humpty Dumpty and All Fall Down in one place, including 3 short stories? Take a look at The Nursery Rhyme Murders Collection**If you were looking for Hopkin's other #1 Police Procedural/Hard Boiled Mystery series, search under The Darc Murders Collection**If you were looking for Amazon Top 20 bestselling mystery check out, Plain A Patterson-style mystery with a dash of Hannibal**If you were looking for an amazing crime collection, check out Down & Dirty**If you were looking for an incredible thriller collection, check out Got Thrills?",
  "genres": [],
  "author": "Ben Hopkin",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/21459453-all-fall-down"
}