{
  "title": "Nothing Sacred",
  "description": "NOTHING SACREDDOUGLAS WICKARDA sacred practice…A rite of passage…A ritual ceremony passed down from generation to generation.One hundred million of the world’s women are currently affected by this brutal act.\n“In her bestselling 1992 novel, Possessing the Secret of Joy, Alice Walker opened a painful door to the attention of the reading public…”\nIn Douglas Wickard's controversial new novel NOTHING SACRED, a psychological thriller set against the backdrop of contemporary Charleston, South Carolina… this vicious act comes home. Traumatized by the recent separation from his family, and ricocheting back after the untimely death of his partner, Detective Dan Hammer of the Charleston Police Department investigates the bizarre case surrounding a local teenage girl, found half-dead, stumbling along Old Towne Road after dark.Dr. Sydia Garrison, fifth year surgical resident at The Medical University of South Carolina performs the emergency surgery that saves the young girl’s life. The case quickly turns sour when a second victim is discovered, tied-up in ritualized fashion and not nearly so lucky. Harry Wright’s plan for an early retirement from Quantico, Virginia’s FBI Behavioral Science Unit falls on deaf ears as he undertakes one of his most challenging cases. After a life-long career of profiling serial killers, Harry is forced to leave his wife’s bedside, suffering life’s greatest killer; terminal cancer. The one murderer Harry can’t contain.A task force is formed. “The Mutilator,” as dubbed by local Charleston press, The Post and Courier attracts national, frenzied attention. The sleepy seaside town of Charleston is about to be put on the map when the dreaded news arrives: another girl is missing.Detective Dan Hammer and FBI Agent Harry Wright must work against time to piece together a scenario of unfathomable horror. What appears to be the work of a psychotic, sadistic killer quickly turns personal when Dan Hammer's daughter, Alexandra becomes the killer's next victim. \nIs there nothing sacred?\n  **WARNING**NOTHING SACRED contains graphic descriptions that may be offensive to some readers. Parental discretion is advised.5.15.14",
  "genres": [
    "Thriller"
  ],
  "author": "Douglas Wickard",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/21461459-nothing-sacred"
}