{
  "title": "Just One Night, Part 2",
  "description": "NEW YORK TIMES and USA TODAY BESTSELLING AUTHOR, ELLE CASEY, brings readers PART 2 in the 6-part contemporary romance serial novel, JUST ONE NIGHT.[This book is PART 2. Readers should begin by reading PART 1 first.] Jennifer is suffering a serious man hangover when her best friend Mia swoops in and forces her out of her apartment for a night of good old-fashioned girlfriend fun. It seems like just the ticket to help her move on and follow through with her plan for a new perspective on life and men ... until everything goes really right and then just as quickly goes really wrong. William would love to focus on his work to the exclusion of all else, but his annoying assistant and nagging calendar have other ideas. When the two of them are joined by his father (the boss) and the threat of the unleashing of his brother (the troublemaker), he has little choice but to obey their commands and attend the event that just might net them some new clients. Or, perhaps, something none of them were bargaining for. This ebook is Part 2 of the contemporary romance serial novel, JUST ONE NIGHT, 21,000 words or 85 paper pages long. The story continues with Parts 3-6.Content warning: Due to sexy situations and content, this book is definitely not appropriate for younger readers.A note from Elle about this series: Hello readers! I had such a great time writing this serial. Like you, I had no idea what was going to happen from one part to the next. I didn't even know how many parts there would be. It was great having all the feedback from my readers as each part was released; it definitely influenced the end result. Edward's story, JUST ONE WEEK, is coming soon in 2016. Add it to your Goodreads shelf today!",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Adult",
    "Humor",
    "Erotica",
    "Contemporary",
    "Erotic Romance"
  ],
  "author": "Elle Casey",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/21463665-just-one-night-part-2"
}