{
  "title": "خارطة الحب",
  "description": "Ahdaf Soueif's The Map of Love is a massive family saga, a story that draws its readers into two moments in the complex, troubled history of modern Egypt. The story begins in 1977 in New York. There Isabel Parkman discovers an old trunk full of documents--some in English, some in Arabic--in her dying mother's apartment. Incapable of deciphering this stash by herself, she turns to Omar al-Ghamrawi, a man with whom she is falling in love. And Omar directs her in turn to his sister Amal in Cairo. Together the two women begin to uncover the stories embedded in the journal of Lady Anna Winterbourne, who traveled to Egypt in 1900 and fell in love with Sharif Pasha al-Barudi, an Egyptian nationalist. To their surprise, they stumble across some unsuspected connections between their own families. Less surprising, perhaps, is the persistence of the very same issues that dogged their ancestors: colonialism, Egyptian nationalism, and the clash of cultures throughout the Middle East. The past, however, does offer some semblance of omniscience:  That is the beauty of the past; there it lies on the table: journals, pictures, a candle-glass, a few books of history. You leave it and come back to it and it waits for you--unchanged. You can turn back the pages, look again at the beginning. You can leaf forward and know the end. And you tell the story that they, the people who lived it, could only tell in part.  With its multiple narratives and ever-shifting perspectives, The Map of Love would seem to cast some doubt on even the most confident historian's version of events. Yet this subtle and reflective tale of love does suggest that the relations between individuals can (sometimes) make a difference. \"I am in an English autumn in 1897,\" Amal confesses at one point, \"and Anna's troubled heart lies open before me.\" Here, perhaps, is a hint about how we should read Soueif's staggering novel, using words as a means to travel through time, space, and identity. --Vicky Lebeau",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Egypt",
    "Africa",
    "Novels",
    "Romance",
    "Book Club"
  ],
  "author": "Ahdaf Soueif",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/11237385"
}