{
  "title": "The Time Travel Collection",
  "description": "The award winning author of the Mystic Saga is offering three of his bestselling time travel novels in one affordable book.\nSaving Brooksie\n Eddie inherits a house that people believe stole the life of his cousin many years ago. Some say the house is haunted. Eddie is about to discover something much better... There's a door in his basement that leads directly to a local amusement park, but this particular park was razed sometime in the 50's. Now the year is 1928 and Patience Webb is at the top of her Hollywood game. Unfortunately, at the age of 25, her successful movie career comes to a sudden and mysterious end… Patience Webb is gone! That same year, nearly 2400 miles away in Silver Falls, Nena Brooks – also known as Brooksie appears out of nowhere and she wants nothing to do with anyone and she seems to be hiding something. Eddie tries to remain just a sightseer in the 1920's because he knows that getting attached to the past can cause problems. But what happens when he stumbles upon an intriguing woman named Brooksie? And what if history still demands a tragic ending? \nTalking to the Moon\nAt the sight of his abusive father lying wounded in the driveway; 16 year-old Sean finds himself at his mother’s side being urged to flee. He doesn’t recall what happened, but he reluctantly obeys. Later at a friend’s house, Sean is presented with a place to hide out where no one could ever come searching for him - a safe-house within his own neighborhood, yet fifty years in the past. 1958 welcomes Sean with its trusting neighbors, rock and roll records, sturdy, fast cars without insurance or airbags, and even a spot on the high school football team. Best of all, 1958 welcomes him with a beautiful girl named Clara. Sean is captured by all that his heart could ever desire in this life. As far as he’s concerned, nothing could ever make him return to the life he abandoned… unfortunately, a decision like that may not be his alone to make. \nBeyond the Event Horizon\nSkylar Rains has made a significant breakthrough regarding the future of time travel. Testing this theory however leaves him stranded 1100 years in the future with no hope of return. What he discovers is a frightening world devoid of all life. Now he must sift through the clues to learn what became of the world he once knew. Much to his surprise, he finds that these clues may lead him to another planet nearly 12 light years away.",
  "genres": [
    "M M Romance",
    "Time Travel"
  ],
  "author": "Scott McElhaney",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/21464720-the-time-travel-collection"
}