{
  "title": "Carrying the Billionaire's Baby: The Complete Erotic Romance Novella",
  "description": "An erotic romance novella collecting the best-selling CARRYING THE BILLIONAIRE'S BABY series!Billionaire businessman Alexander Atherstone wants April O’Connor to be his surrogate and deliver him a child — but he wants to impregnate her the old fashioned way. April is reluctant to buy into the mysterious man’s unorthodox ways, but the billionaire has an offer that’s hard to refuse. Will April sign the billionaire’s contract and agree to let him impregnate her? And will April and Mr. Atherstone’s relationship stay purely professional, even through their nights of passion?WARNING: This 30,390-word novella is a work of erotic romance with scenes of vividly-described sex between a regular girl and a powerful alpha male billionaire, impregnation, breeding, oral sex and a powerfully erotic conclusion.EXCERPTMy body tensed as I lay naked on the bed. I shut my eyes, darkening things further. His footsteps drew closer on the tile floors of the penthouse. I knew he was close.I drew a deep breath in as I heard him approach. I was nervous. Nervous but excited. Scared, yes, but somehow I knew this would all end up okay.“Turn over,” he said. His voice was soft but firm.I complied. I didn’t think twice. After all, this was more than just sex — this was a job. This was a contract.Rolling over, my face buried in a pillow, flat on my stomach, I waited. I ran my hands up and touched the headboard above me. His belt buckle jingled as he slipped it off his waist. I could hear the soft rustle of his clothing being placed aside. I tried not to peek, but couldn’t help myself — with hair over my face, I glanced behind me, and saw him.I saw all of him.Mr. Atherstone was in perfect shape for a man his age, with a smooth stomach and toned arms. But it was his manhood that really stood out. He was hard, sticking straight out, long and thick. I felt my own arousal building again as he watched him move toward me.His eye caught mine — I was never very good at furtive glances — and he gave me that same half-smile. Then he reached down and ran a hand up and down the length of his manhood, keeping his eyes locked with mine.He stepped toward me quickly. “Put your hips up,” he said again. I obeyed without thinking. I had never had a lover who had been so direct — so certain about what they desired of me. I liked that he didn’t mince words.I raised my naked rear-end up, supporting myself on my knees. And then I felt him step onto the bed. He lowered his body over mine, enveloping me with warmth and the sweet subtle scent of his cologne. I could feel him against my back, throbbing again and again.He drew a hand over my arm, lightly — barely touching my skin. But his touch was electric. I had to fight not to squirm beneath him.“I’m so glad you said yes, Ms. O’Connor,” he whispered, his lips so close to my neck that I could feel the words brush up against me.",
  "genres": [],
  "author": "Gwendolyn Bridges",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/21467430-carrying-the-billionaire-s-baby"
}