{
  "title": "Murder on Tiki Island",
  "description": "Murder, Sex, Exotic Cocktails and Exotic Women. And of course, some very eerie phantoms...Volume II in the Bill Riggins Mystery This murder mystery/ghost story deals with adult themes, horror, violence and language, and is not intended for children. If it were a movie it would be rated NC-17. It's a fairly long book for people who love to read, not someone looking for a \"quick read\". You've been warned. Immerse yourself in a different time, a different place...Set in New York City and the Florida Keys in 1956, Murder on Tiki Island is a noir-style murder mystery which follows Detective Bill Riggins (Murder Behind the Closet Door, Murder Under the Boards) through a journey of strange, unexplained events surrounding a murder and paranormal phenomena on Florida's world-famous Tiki Island Resort. Influenced by the style made famous by pulp fiction's greatest authors from Raymond Chandler to Mickey Spillane, Murder on Tiki Island weaves an intricate web of lies, murder, and the occult shaken with a shot of hot dames and a chaser of cool tropical breezes. Penned by \"Tiki\" Chris Pinto, author of the noir mystery ghost story Murder Behind the Closet Door, this 1950s style thriller will keep you hanging on edge from the first sentence to the last. Swing back to 1956, when jazz and rock 'n' roll both ruled the airwaves, giant finned cars ruled the roadways and Tiki Bars were the hottest spots on the nightlife scene. Riggins, a New York City detective, takes a 'forced vacation' to Tiki Island in the world-famous Florida Keys and Key West. Once there he gets mixed up with the seductive daughter of the resort's wealthy owner; gets taken for a wild ride by a beautiful blonde bombshell; and gets himself suspected of a brutal murder. Skeletons, mermaids, Mai Tais, Exotica music, fishing and phantoms all come together to make this Key West murder mystery a fun, old-fashioned pulp noir novel with a modern edge that's sure to please anyone who digs the mid-century scene, or just loves plain old fashioned noir-style detective novels. Tiki Chris Pinto's Florida Keys murder mystery will have you spooked and guessing throughout the entire story, with a few twists that will get you saying, \"Wow, daddy-o! Dig that crazy scene!\"Excerpts from Review by Everett Peacock, Author & Hawaiian Culture \"I read the previous work by this author, Murder Behind the Closet Door, and was an automatic pre-sold reader of whatever he might do next. I was not disappointed, in fact I like this novel much better....Character development is ensured and rich and that alone would sell me on this book...Lastly, being a Tiki fan of the first order, I enjoyed the weaving of that theme throughout the book. This book frames quite a the tropical heat, the thunderstorms offshore dancing with the sea and a little island beneath it all. It fit very well with the islands of Florida, a favorite place of mine since the late 1950s...\"",
  "genres": [],
  "author": "Christopher Pinto",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/11237207-murder-on-tiki-island"
}