{
  "title": "Blood Deep",
  "description": "Bad can feel good, Jessie. Bad can feel as good as it can get.The tattoos covering Eden Reece’s arm tell the tale of a con with an appetite for danger. Even so, arriving at The Circus – the criminal heart of Blackthorn – and demanding an audience with the notorious Pummel, is the sign of a death wish.Jessie knows that Eden is trouble. Serious trouble. Held captive by Pummel, despite her powers, she also knows how dangerous a game Eden is playing. Yet she can’t ignore a connection far deeper than the physical spark between them – because Jessie has seen Eden before...Jessie is the only one who can help Eden save those he loves. But as he uncovers her secrets one by one, he can’t ignore the emotions she stirs in him – feelings neither of them dare face. He risks death. If she trusts him, she risks a fate far worse.As Pummel’s twisted plans become clear, there’s no doubt all hell risks breaking out in Blackthorn. With time running out, together Jessie and Eden might be the only ones that can stop it.In a thrillingly sensual novel, the stakes in the dark world of Blackthorn just got higher.What readers are saying about Blackthorn…‘I am officially addicted to this series. Why, you ask? Because Lindsay Pryor is my kind of fearless author. She isn’t afraid to “go there”, to create characters and situations that challenge me as a reader.’ The Demon Librarian‘Not only are Pryor’s characters and fathomlessly dark love stories fabulous, but her continual world building of Blackthorn blows me away.’ Gravetells.com‘A shining, brilliant new talent in the Paranormal genre!’ CC MacKenzie‘She writes paranormal romance mixed with urban fantasy the way I like it – clever world-building, intense characters and no easy options for them to take.’ Nocturnal Book ReviewsThe Blackthorn Series1.\tBlood Shadows2.\tBlood Roses3.\tBlood Torn4.\tBlood Deep",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Vampires",
    "Urban Fantasy",
    "Romance",
    "Fantasy",
    "Angels"
  ],
  "author": "Lindsay J. Pryor",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/21465178-blood-deep"
}