{
  "title": "Hunter's Choice",
  "description": "Jessamine Connors  I lead a simple life on the Olympic Peninsula running Moonchild Owl Haven, a bird sanctuary for sick and injured owls.  When I'm not doing that? I work a regular shift at the animal hospital fulfilling my day job.  Life is pretty great, what with my best friend Charlie coming around daily to help with my fly babies, but it's also lonely. I mean, Charlie is old enough to be my grandad and the only other man in my life? A not even legal teen that’s like a younger brother.  Meeting people out here in the sticks is tough. Tougher still for a girl like me who can't string two words together without stuttering so bad she can't be understood. For the most part I'm okay with that, but sometimes I wish I could do away with my whiteboard and just tell people how it is, what I'm feeling…  After all, a man wants someone he can talk with, not just someone he can talk at.  At least that's what I've been told...  Hunter Grayson  I am older than time… A god amongst men…  No really, that's not just me being arrogant. I really am the descendant of two gods.  Half cursed by my father's uncle because of my mother's betrayal, I can change from human to owl at will. It's a lonely existence for the most part, I can only stay someplace until my lack of aging becomes a problem. So I wander, never staying anyplace longer than a few months and spending almost as much time in the freedom of my owl's form than in my human one.  So who would have thought, that after centuries upon centuries of living I would find myself a broken and bleeding pile of feathers in the middle of a modern highway?  Who also would have thought that this would be the end of my self imposed solitude when she came, plucking me off the asphalt, carefully putting me back together.  She saved my life, and after weeks of being under her care… Watching her move silent and alluring between myself and the rest of her charges...  Well, I just had to know everything about her.  *Mature Audiences Only* *Recommended 18+* *Violence & Sexual Content*",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Fantasy",
    "Shapeshifters",
    "Romance"
  ],
  "author": "Timber Philips",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/21468122-hunter-s-choice"
}