{
  "title": "The Mammoth Book of SF Stories by Women",
  "description": "33 outstanding science fiction stories by womenTravel by train to the Moon, discover living spaceships born in gas giants and explore the constellations, alternate universes and post-apocalyptic worlds of this compelling collection of SF written by women.Whether crossing the stars or constructing the future of our planet, women have always written powerful, important science fiction. This anthology showcases the most exceptional SF stories written by women in recent decades, from classic stars Ursula K. Le Guin and Angélica Gorodischer; science fiction greats Karen Joy Fowler and Nancy Kress; new award-winning talents Elizabeth Bear, Nnedi Okorafor and Aliette de Bodard; and many more.Contents:Girl hours / Sofia Samatar --Excerpt from a letter by a social-realist Aswang / Kristin Mandigma --Somadeva: a sky river sutra / Vandana Singh --The queen of Erewon / Lucy Sussex --Tomorrow is Saint Valentine's Day / Tori Truslow --Spider the artist / Nnedi Okorafor --The science of herself / Karen Joy Fowler --The other graces / Alice Sola Kim --Boojum / Elizabeth Bear & Sarah Monette --The eleven holy numbers of the mechanical soul / Natalia Theodoridou --Mountain ways / Ursula K. Le Guin --Tan-Tan and Dry Bone / Nalo Hopkinson --The four generations of Chang E / Zen Cho --Stay thy flight / Élisabeth Vonarburg --Astrophilia / Carrie Vaughan --Invisible planets / Hao Jingfang --On the Leitmotif of the Trickster Constellation in Northern Hemispheric star charts, post apocalypse / Nicole Kornher-Stace --Valentines / Shira Lipkin --Dancing in the shadow of the once / Rochita Loenen-Ruiz --Ej-Es / Nancy Kress --The cartographer wasps and the anarchist bees / E. Lily Yu --The death of Sugar Daddy / Toiya Kristen Finley --Enyo-Enyo / Kameron Hurley --Semiramis / Genevieve Valentine --Immersion / Aliette de Bogard --Down the wall / Greer Gilman --Sing / Karin Tidbeck --Good boy / Nisi Shwal --The second card of the Major Arcana / Thoraiya Dyer --A short encyclopedia of lunar seas / Ekaterina Sedia --Vector / Benjanun Sriduangkaew --Concerning the unchecked growth of cities / Angélica Gorodischer --The radiant car thy sparrows drew / Catherynne M. Valente.",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Fantasy",
    "Feminism",
    "Science Fiction Fantasy"
  ],
  "author": "Alex Dally MacFarlane",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/21471316-the-mammoth-book-of-sf-stories-by-women"
}