{
  "title": "Ambush at Fort Bragg",
  "description": "Bantam Doubleday Dell Audio, Compact Disk, $24.95/$34.95(Can), ISBN: 0-553-45568-0He's been called the inventor of the New Journalism--and possessor of the age's most distinctive prose style. Now in this original novella, serialized to critical acclaim in Rolling Stone magazine in December 1996, Tom Wolfe, author of the bestseller The Bonfire of the Vanities, turns his penetrating eye and devastating wit to the world of TV news...As the producer of a prime-time TV newsmagazine, Irv Durtscher fancies himself the Federico Fellini of television journalism. For who else can draw 50 million viewers, satisfy the network's gluttony for profits, and advance the cause of social justice? The only problem is that no one else recognizes Irv's genius. Instead, all the accolades go to the blonde bombshell anchor who won't give balding, near-sighted Irv the time of day. But suddenly Irv has a chance to break the most sensational story of his career--one that will surely catapult him into the national spotlight and into Madame Bombshell's heart. For months the wheels of justice have ground to a halt as three soldiers from Fort Bragg have categorically denied that they savagely beat and murdered a member of their company because he was gay. Now, Irv Durtscher, self-proclaimed soul of a soulless industry, is poised to expose the truth. With a fortune in surveillance equipment, he has infiltrated a bar near Fort Bragg, in the hopes that the unwitting soldiers will hang themselves on videotape. What he gets is pure dynamite. But Irv's story won't be complete until he arranges to ambush the three young toughs and show them the footage. What happens when one of New York's mediaelite confronts the Lords of Testosterone?...not what you think. Ambush at Fort Bragg is classic Wolfe--a blistering send-up of one man's drive for fame and glory and the lengths to which the media will go to showcase their version of the truth. This is Wolfe at his very best--timely, relevant, and right on the money about many aspects of 90s America: the media, the military, the South, discrimination, and homophobia.A graduate of Yale University and the Columbia School of Theatre Arts, Edward Norton's film credits include Everyone Says I Love You, The People Vs. Larry Flynt and Primal Fear, for which he received an Oscar nomination.Not available in any book format, Ambush at Fort Bragg has been published by BDD Audio on cassette and CD.",
  "genres": [
    "Fiction",
    "Military Fiction",
    "Audiobook",
    "Crime",
    "The United States Of America",
    "Thriller",
    "Novels"
  ],
  "author": "Tom Wolfe",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/214722.Ambush_at_Fort_Bragg"
}