{
  "title": "The Erotic Adventures of Snow White: The Complete Collection",
  "description": "The Erotic Adventures of Snow White: The Complete Collection is a box set of eight novellas.Snow White, the fairest maiden of the land, has more erotic adventures than any submissive could hope for— some welcome and others not— while journeying through the Kingdom of Lust to her ultimate destiny and Master. Volume I: Her Queen MistressWhen the insatiable Queen of the Kingdom of lust sees Snow for the first time while riding through her village, she simply must have her for her collection of sex slaves. Snow is brought back to the Queen's lair and stripped of all dignity, undergoing a long initiation before the Queen's audience, where she is forced to endure a variety of BDSM erotic torment before finally surrendering her virginity to the Queen herself.Then she must withstand a rigorous training period, learning to be sexually receptive on demand. Once her training is complete, Snow spends years entertaining her Mistress with an endless array of carnal performances.Volume II: The HuntsmanA sudden rude awakening has the handsome Huntsman dragging Snow to the woods. Upon discovering that the Queen has ordered her killed, Snow pleads with him for her life. His covetous eyes perusing over the alluring Snow, he is quick to devise a fair exchange which she cannot refuse and thanks him copiously for sparing her. Snow begs for him to be her new Master. After respectfully declining her enticing offer, he tells her to run far away, lest the Queen discover her alive.Volume III: The Enchanted ForestOn her own for the first time in her life, Snow wanders aimlessly through the Enchanted Forest, encountering perils as well as unexpected pleasures of this magical place filled with lusty mystical creatures. Volume IV: The Seven WoodsmenSnow comes upon a cottage in the woods and makes herself quite comfortable. When the seven woodsmen come home to find the enticing Snow in their bed, they graciously invite her to stay for as long as she likes— so long as she provides them a service in return. She naively believes that to mean help with the domestic chores. When they discover she is wanted by the Queen, they agree to keep her identity a secret, if she will submit to their carnal demands.  After having finally escaped the Queen’s perverse control of her, Snow vowed to be on her best behaviour. However, that proves to be more difficult than she thought it would be. If only she could keep her eyes off their glistening muscles when they return home from a long day of work, not to mention the growing bulges so obviously straining against their trousers as she flits carefree about the house. Is Snow woman enough to satisfy seven masters?Volume V: Rose RedRose Red, Snow’s bubbly red-haired stepsister, is elated to have found Snow after all these years. The Woodsmen explain to her that Snow was put under a sleeping death spell by the Wicked Queen. Rose and the Woodsmen try everything to rouse her awake to no avail. When Sir Prince arrives, there is hope once more.Volume VI: Thanking Sir PrinceSir Prince kisses Snow White, thus breaking the spell. Upon awaking, Snow is surprised to see her sister, Rose Red there. Snow knows that Sir Prince is the Master for which she has always hoped and is anxious to show him her deepest appreciation.While Snow and the Prince take time to get better acquainted, Rose Red is more than happy to keep the Woodsmen entertained. After revealing an enchanting secret of his own, Sir Prince proposes to Snow and divulges to Rose of his identical twin brother back at the Castle who has an affinity for redheads.Volume VII: A Royal WeddingSnow White and Rose Red are taken back to Sir Prince’s Kingdom where they meet his identical twin brother, James. A lavish double wedding is arranged. In preparation for the wedding, the Princes have a group of women come to dote upon the brides, making sure they are pampered and relaxed for the big day and their every need heeded. The brides-to-be anxiously anticipate their wedding night.Volume VIII: Carnally Ever AfterDuring their long honeymoon, the four newlyweds enjoy countless pleasurable diversions together. When the two mischievous Princes devise a lascivious trick on the girls and swap places, the Princesses unwittingly play along. But when the girls catch on to their naughty ruse, they surprise the boys by suggesting a ménage a quatre. For the first time as a Submissive, Snow must balance the emotion of love with the desire to please her Master.Will she be able to obey her Master’s every command or will her feelings get in the way?",
  "genres": [
    "Fantasy Romance",
    "Paranormal Romance",
    "Erotic Romance"
  ],
  "author": "Rosalind Scarlett",
  "average_rating": "2.86",
  "url": "https://www.goodreads.com/book/show/21473597-the-erotic-adventures-of-snow-white"
}