{
  "title": "Fury",
  "description": "This is book 1.5 in the FIERCE series, and it's a retelling of book 1 from Hunter's POV with lots of unique, previously undiscovered scenes!Would you risk everything for love?Life has held nothing but hardships for Hunter Bane. Growing up with a learning disability wasn't easy, especially when you're poor. With only his brother to support him, Hunter clings to the short moments of happiness in life. Like when he meets Autumn Blakewood.Autumn Blakewood is a geek at heart. Reading is her passion, and she can't spend one day without her books. She's always locked up in her room studying, trying to avoid trouble. Until Hunter comes into her life.Hunter can't resist the temptation to get closer to Autumn. She is his complete opposite, and yet he's drawn to her in ways he can't explain. But when his brother is caught dealing drugs and sent to prison, Hunter's world shatters.To save his brother, Hunter has to join the gang he's feared his entire life. Now he's forced to choose between his family and the one girl he loves. Fighting for both, his fury is all he needs...A New Adult Contemporary Romance with a Happy Ever After (HEA)320 pages in printNo Cliffhanger--------------------REVIEWS--------------------\"I received this as an ARC and let me say I freakin' loved it. Hunter Bane is Smokin!! I don't often enjoy books that are purely in the male POV but this one was fantastic. Looking forward to more Hunter and Autumn!\" -- Michelle N.\"I was looking forward to reading fierce but when I finally did I was emensly blown away.\" -- Azra\"OMG!!! I received an arc for an honest review. I started reading earlier today and couldn't stop. I loved this book. You really feel for Hunter, and how he tries to do the right thing. I thought I loved Fierce, but Fury is by far my favorite. I just loved hearing Hunter's side.\" -- Gwenny",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Contemporary Romance",
    "Fighters",
    "Mixed Martial Arts",
    "College"
  ],
  "author": "Clarissa Wild",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/21471071-fury"
}