{
  "title": "The Self-Made Map: Cartographic Writing in Early Modern France",
  "description": "The Self-Made Map argues that during the Renaissance in France a \"new cartographic impulse\" affected both the \"graphic and imaginary forms of literature.\" In this wide-ranging and fascinating work, Tom Conley demonstrates that as new maps were plotted during this period, a new sense of self emerged, one defined in part by the relationship of the self to space.Conley traces the explosion of interest in mapmaking that occurred with the discovery of the New World, and discusses the commensurate rise of what he defines as cartographic writing-writing that \"holds, penetrates, delineates, and explores space.\" Considering the works of such writers as Rabelais, Montaigne, and Descartes, Conley provides a \"navigation\" through the printed page, revealing the emerging values of Renaissance France. In his examination of the placing of words, letters, and graphic elements in books, he exposes the playful and sometimes enigmatic relation between spatial organization and text.Conley also exposes the ideological exercise inherent in mapmaking, arguing that Renaissance cartography is inseparably bound up with the politics of the era. He undertakes close readings of maps and illustrations, discussing the necessity of viewing Renaissance maps in the context of their typographic layout, graphic reproduction, and literary and ideological import.Richly illustrated throughout, The Self-Made Map combines studies of art, geography, history, literature, and printing to show a clear historical transformation, along the way linking geographical discoveries, printing processes, and political awareness. Conley's provocative analysis discloses how early modern printed literature and cartography worked together to crystallize broader issues engaging the then emergent status of cultural identity, nation, and individuality.",
  "genres": [],
  "author": "Tom Conley",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/11238544-the-self-made-map"
}