{
  "title": "The Gallery of Regrettable Food",
  "description": "WARNING:This is not a cookbook. You'll find no tongue-tempting treats within -- unless, of course, you consider Boiled Cow Elbow with Plaid Sauce to be your idea of a tasty meal. No, The Gallery of Regrettable Food is a public service. Learn to identify these dishes. Learn to regard shivering liver molds with suspicion. Learn why curries are a Communist plot to undermine decent, honest American spices. Learn to heed the advice of stern, fictional nutritionists. If you see any of these dishes, please alert the authorities.Now, the good news: laboratory tests prove that The Gallery of Regrettable Food AMUSES as well as informs. Four out of five doctors recommend this book for its GENEROUS PORTIONS OF HILARITY and ghastly pictures from RETRO COOKBOOKS. You too will look at these products of post-war cuisine and ask: \"WHAT WERE THEY THINKING?\" It's an affectionate look at the days when starch ruled, pepper was a dangerous spice, and Stuffed Meat with Meat Sauce was considered health food.Bon appetit!The Gallery of Regrettable Food is a simple introduction to poorly photographed foodstuffs and horrid recipes from the Golden Age of Salt and Starch. It's a wonder anyone in the 1940s, '50s, and '60s gained any weight. It isn't that the food was inedible; it was merely dull. Everything was geared toward a timid palate fearful of spice. It wasn't nonnutritious -- no, between the limp boiled vegetables, fat-choked meat cylinders, and pink whipped Jell-O desserts, you were bound to find a few calories that would drag you into the next day. It's just that the pictures are so hideously unappealing.Author James Lileks has made it his life's work to unearth the worst recipes and food photography from that bygone era and assemble them with hilarious, acerbic commentary: \"This is not meat. This is something they scraped out of the air filter from the engines of the Exxon Valdez.\" It all started when he went home to Fargo and found an ancient recipe book in his mom's cupboard: Specialties of the House, from the North Dakota State Wheat Commission. He never looked back. Now, they're not really recipe books. They're ads for food companies, with every recipe using the company's products, often in unexpected and horrifying ways. There's not a single appetizing dish in the entire collection.The pictures in the book are ghastly -- the Italian dishes look like a surgeon had a sneezing fit during an operation, and the queasy casseroles look like something on which the janitor dumps sawdust. But you have to enjoy the spirit behind the books -- cheerful postwar perfect housewifery, and folks with the guts to undertake such culinary experiments as stuffing cabbage with hamburger, creating the perfect tongue mousse when you have the fellas over for a pregame nosh, or, best of all, baking peppers with a creamy marshmallow sauce. Alas, too many of these dishes bring back scary childhood memories.",
  "genres": [
    "Humor",
    "Food",
    "Nonfiction",
    "Cooking",
    "History",
    "Cookbooks",
    "Pop Culture"
  ],
  "author": "James Lileks",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/101359.The_Gallery_of_Regrettable_Food"
}