{
  "title": "The Philosopher's Apprentice",
  "description": "A brilliant philosopher with a talent for self-destruction, Mason Ambrose has torpedoed a promising academic career and now faces a dead-end future. Before joining the ranks of the unemployed, however, he's approached by a representative of billionaire geneticist Dr. Edwina Sabacthani, who makes him an offer no starving ethicist could refuse. Born and bred on Isla de Sangre, a private island off the Florida coast, Edwina's beautiful and intelligent adolescent daughter, Londa, has recently survived a freak accident that destroyed both her memory and her sense of right and wrong. Londa's soul, in short, is an empty vessel—and it will be Mason's job to fill it. Exploring his new surroundings, our hero encounters a lush Eden abounding in bizarre animals and strange vegetation engineered by Edwina and her misanthropic collaborator, Dr. Vincent Charnock. And Londa, though totally lacking a conscience, proves a vivacious young woman who quickly captivates her new teacher as he attempts to recalibrate her moral compass with the help of Western civilization's greatest ethical thinkers, living and dead. But there's trouble in this tropical paradise. Mason soon learns that he isn't the only private tutor on Isla de Sangre, nor is Londa the only child in residence whose conscience is a blank slate. How many daughters does Edwina Sabacthani really have, and how did she bring them into being? Undaunted by these mysteries, Mason continues to instruct Londa, hoping that she can lead a normal life when she eventually ventures forth into human society. His apprentice, however, has a different agenda. Her head crammed with lofty ideals, her heart brimming with fearsome benevolence, and her bank account filled to bursting, Londa undertakes to remake our fallen world in her own image by any and all means necessary.",
  "genres": [
    "Fiction",
    "Philosophy",
    "Fantasy",
    "Science Fiction",
    "Contemporary",
    "Novels",
    "Adult"
  ],
  "author": "James K. Morrow",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/2148148.The_Philosopher_s_Apprentice"
}