{
  "title": "Animosity",
  "description": "Animosity is the story of Andrew Holland, a bestselling horror writer whose life begins to mirror the fictional nightmares of his novels after he finds himself in the wrong place at the wrong time.  Andy’s wife recently left him for another man. To keep from getting too depressed about that, Andy has thrown himself into his writing more vigorously than ever, when he’s not spending as much time with his daughter, Samantha, as joint custody allows. His neighbors seem proud to know him (although none of them would admit to reading “that kind of stuff”). The author is the closest thing to a celebrity most of Poinsettia Lane’s residents will ever meet.  Everything changes, however, the day Andy discovers the body of a murdered child just several hundred yards from his front door.Almost instantly, his neighbors start to turn on him. Though the authorities clear him of any wrongdoing, as weeks pass with no arrest the local media insinuates connections between the gruesome subject matter of Andy's novels and his tragic discovery. His neighbors’ derision is subtle at first – a nasty look, a friendly wave that is not reciprocated. Ben Souther, with whom Andy once enjoyed cold beers and baseball banter on warm summer nights, offers the writer advice which now hints of something more unsettling than the sly wisdom normally found in his “Let us not make imaginary evils when we have so many real ones to encounter”.His neighbors soon take their disdain to a frightening new level. His phone rings, and when he answers muffled voices curse him, spitting vile accusations. They vandalize his home, trash his vehicle.And just when he thinks things can’t possibly get any worse, another child’s body is found.Andy is no longer sure if he will survive this ordeal with his sanity intact…assuming he does survive.Animosity is a disturbing look into how otherwise good people can allow themselves to be misled by gossip, rumors, and a mob mentality. It is a retelling of the “The Monsters Are Due On Maple Street” for the modern age, a morality-play-meets-horror-story in which the monsters wear all-too-familiar faces. Rather than bloodthirsty vampires or brain-eating zombies beating at the door, they are our own friends, our families, our peers…and what in any horror writer’s twisted imagination could be more terrifying?",
  "genres": [
    "Horror",
    "Thriller",
    "Mystery",
    "Mystery Thriller",
    "Suspense",
    "Fiction",
    "Crime"
  ],
  "author": "James Newman",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/21480298-animosity"
}