{
  "title": "Sons of Wichita: How the Koch Brothers Became America's Most Powerful and Private Dynasty",
  "description": "Not long after the death of his father, whose heart gave out suddenly in November 1967, Charles Koch--then in his early thirties--discovered a letter his father had written when his four sons were small. \"My dear boys,\" it began, \"when you are twenty-one, you will receive what now seems to be a large sum of money. It may either be a blessing or a curse.\" \"Above all,\" he cautioned, \"be kind and generous to one another.\"In the ensuing decades, Fred's legacy became a blessing and a curse.Two of his sons, Charles and David, joined forces to build Koch Industries, one of the largest private corporations in the world. But they ended up in an epic feud with brothers Bill and Frederick that spanned nearly two decades, tearing the family apart--and nearly Koch Industries along with it. Bill would start his own energy company and attain a modicum of fame as a litigious wine collector and yachtsman. After being marginalized by the patriarch because of his effete manner, Frederick became a patron of the arts and a fastidious refurbisher of historic estates.Starting with their boyhood when fraternal disputes were sometimes settled in the boxing ring, Sons of Wichita takes you inside this highly private family and traces the evolution of these four distinct personalities, as well as their corporate, philosophical, social, and political ambitions. Influenced by the conservative, anticommunist sentiments of their father, a founding member of the John Birch Society, Charles and David devised an ambitious strategy to foist their ideological agenda upon the nation--quietly channeling millions of dollars of their fortune into a web of free market think tanks, academic programs, advocacy groups, and more, while also building what amounts to a shadow Republican Party, replete with a donor network capable of raising as much in an election cycle as the Republican National Committee. Never before did they flex their political muscles as vigorously as they did during the 2012 campaign, when Charles and David clashed with the Obama administration in what Charles described as the \"mother of all wars.\"Like the Rockefellers before them, the Koch brothers are a great American dynasty. Unlike the Rockefellers, they have never before been the subject of a major biography.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Politics",
    "Business",
    "History",
    "Economics",
    "Biography Memoir"
  ],
  "author": "Daniel   Schulman",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/21483816-sons-of-wichita"
}