{
  "title": "Last Light Falling",
  "description": "If your fate has already been chosen for you, would you change it? Fifteen-year-old Arena Power blindly accepts her destiny in a world filled with tragedy, chaos, and a lingering wickedness that will tempt every man's soul until the last days on Earth. Set in the United States in the year 2053, America, like most of the world, has undergone catastrophic earthquakes, famine, and an economic collapse, which has rendered the nation hopeless. It has turned to other nations, like Russia and China, to help restore what was once a world power. Unfortunately, the new America has grossly caused civil unrest that will eventually be the precursor to a much bigger war of biblical proportions.  Orphaned at the age of nine, Arena and her twin brother, Gabe, have learned to rely on each other through the toughest times. Not only do they share the same birthday and the tragic loss of their parents, they both have a birthmark on the back of their necks in the shape of a crucifix. This is only but a small sign of the destiny that will follow. On their fifteenth birthday, they receive a mystery letter and key from their estranged Uncle Finnegan. This key will unlock their fate, and it will be up to a priest, who has vowed to protect them since birth, to unfold the layers of their destiny-to undo the evil that has spoiled the world, and to help unleash God's wrath upon those who have turned from Him in the last days of history.  Last Light Falling weaves righteousness with evil, treachery with truth, and shows just how far the will of man can survive on faith alone. Arena and Gabriel's fate will determine that course of history for which has already been written. They were not born to save the world; they were chosen to prepare it for the final days.",
  "genres": [
    "Fantasy",
    "Dystopia",
    "Young Adult",
    "Science Fiction"
  ],
  "author": "J.E. Plemons",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/21483545-last-light-falling"
}