{
  "title": "Bryant & May and The Bleeding Heart",
  "description": "London's wiliest detectives, Arthur Bryant and John May, are back on the case in this fiendishly clever new mystery . . . and when a cemetery becomes the scene of a crime, neither secrets--nor bodies--stay buried.  Romain Curtis sneaks into St. George's Gardens one evening with his date, planning to show her the stars. A centuries-old burial ground, the small, quiet park is the perfect place to be alone. Yet the night takes a chilling turn when the two teenagers spy a strange figure rising from among the tombstones: a corpse emerging from the grave. Suffice it to say that wherever there's a dead man walking, Bryant and May and the Peculiar Crimes Unit are never far behind. As the PCU investigates the sighting, a second urgent matter requires their unusual brand of problem-solving. Seven ravens have gone missing from their historic home in the Tower of London, and legend has it that when the ravens disappear, England will fall. Bryant has been tasked with recovering the lost birds, but when Romain is suddenly found dead, the two seemingly separate mysteries start to intertwine and point to a plot more sinister than anyone could ever imagine.  Soon Bryant and May find themselves immersed in London's darkest lore, from Victorian-era body snatchers, to arcane black magic, to the grisly myth behind Bleeding Heart Yard, a courtyard long associated with murder. And as the body count spikes and more coffins are unearthed, they will have to dig deep to catch a killer and finally lay these cases to rest.  Inventive, darkly funny, and fast-paced, \"Bryant & May and the Bleeding Heart \"is a brilliantly twisting puzzle, as only Christopher Fowler can write. Praise for Christopher Fowler's ingenious novels featuring the Peculiar Crimes Unit  \"A brilliant series.\"--\"The Denver Post \"  \"\"The Invisible Code\" has immense charm, but its plotting will satisfy serious mystery fans. . . . Best of all are the two main characters, particularly Bryant, whose fine British stodginess is matched perfectly by the agility of his crime-solving mind.\"--\"The New York Times\"  \"Spiced with a little screwball-comedy dialogue and a touch of the occult.\"--\"The Washington Post\",\" \"on\" The Memory of Blood\"  \"Fowler, like his crime-solvers, is deadpan, sly, and always unexpectedly inventive.\"--\"Entertainment Weekly\"\" \" \"May and Bryant make a stellar team.\"--\"The Wall Street Journal\"  \"\"Grumpy Old Men\" does \"CSI\" with a twist of Dickens! Bryant and May are hilarious. I love this series.\"--Karen Marie Moning, #1 \"New York Times\" bestselling author of the MacKayla Lane novels  \"[A] trademark mix of whimsical humor and macabre thrills.\"--\"Publishers Weekly\" (starred review)  \"[Christopher] Fowler reinvents and reinvigorates the traditional police procedural.\"\"--The Boston Globe\"",
  "genres": [
    "Mystery",
    "Crime",
    "Fiction",
    "Mystery Thriller",
    "Audiobook",
    "Detective",
    "British Literature"
  ],
  "author": "Christopher Fowler",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/21480719-bryant-may-and-the-bleeding-heart"
}