{
  "title": "The She-King: The Complete Saga",
  "description": "This ebook set contains all four volumes of The She-King, L. M. Ironside's saga of the Thutmosides of ancient Egypt.  This set contains:  The Sekhmet Bed: Book 1 Thirteen-year-old Ahmose is given as Great Royal Wife to the new king, to legitimize his rule. But her elder sister Mutnofret has been raised to expect the privileged station. As Ahmose fights the currents of Egypt's politics and Mutnofret's vengeful anger, her youth and inexperience carry her beyond her depth and into the realm of sacrilege. To right her wrongs and save Egypt from the gods' wrath, Ahmose must face her most visceral fear: bearing an heir. But the gods of Egypt are exacting, and even her sacrifice may not be enough to restore the Two Lands to safety.  The Crook and Flail: Book 2 Hatshepsut longs for power, but a woman on the throne defies the sacred order. As God's Wife of Amun, she believes she has found the perfect balance of peace and order. But when the powerful men of Egypt plot to replace her, she must decide whether to surrender her birthright to a man, or take for herself the throne of the Pharaoh.  Sovereign of Stars: Book 3 Never in Egypt's long history has a woman reigned as king. As Hatshepsut wrestles with foreign enemies and domestic politics, her heart grows ever more troubled, for her daughter Neferure is haunted by a brutal and demanding god. Hatshepsut's fight to retain her hold on power, peace, and Neferure will carry her on an incomparable journey to the legendary kingdom of Punt. There, in the god's own valley, she must confront the bleakness of fate and the terrible frailty of eternity.  The Bull of Min: Book 4 Conspiracy and treason simmer in the Two Lands. When an unexpected challenger to the succession arises, the royal family must face impossible choices. To protect what she most loves, the young queen Meryet will match wits against a demon from the past. Hatshepsut stands on the brink of the ultimate sacrifice. And Thutmose, torn between throne and family, must commit an unthinkable act against Hatshepsut...or allow Egypt to fall into the hands of an unpredictable killer.",
  "genres": [],
  "author": "Libbie Hawker",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/21480168-the-she-king"
}