{
  "title": "A Time To...",
  "description": "A TIME TO… is a story about Al Masterson, a baby boomer and a risk manager who worked in the World Trade Center on 9/11. As Tower One collapsed on him and his companions, he was taken away on a mysterious guided tour of his life. He revisited his childhood in the ‘50s when he had a hard time adapting to his New York City home. A teacher had rescued him from a disastrous year so he gave her a special gift; he couldn’t imagine how that gift would later impact his life.In the turbulent ‘60s, he struggled to become a man, but, his attempt to join a street gang led to a terrible loss that would haunt him for years. His life drifted into the ‘70s until he left New York for Ethiopia where he served as a Peace Corps Volunteer. While there, he experienced a world full of fascinating people and situations. In the process, his life had purpose once again.Jobs as a broadcast journalist and a public relations executive in the 80’s gave him a front row seat to social events that defined the times. But, he learned that high-profile glamorous jobs can be more trouble than they are worth. At the end of his journey, thanks to everything he had experienced on it, he learned that love, faith, hope and charity all survived 9/11 and that his life would never be the same again.\"The Best, Most Original Book I've Read in Years,\" says Michelle Danko of Faith Filled Family Magazine. \"A TIME TO... is a captivating book right from the beginning. The author's use of words draws readers directly into the story and captivates their interest by making them feel as if they were there...Overall, A TIME TO... is well written, and relatable. It is the best, most original book that I have read in years. It is clearly written, and well thought out. I would highly recommend it.\"\"A GREAT new spiritual book!\" says Rutherford Card. Johnson, Anglo-Catholic News Service. \"I have had very little time for discretionary reading these days, so when I not only read a book, but call it a page turner, that ought to say something. That is precisely what I would call A Time To... by Ronald Louis Peterson. The novel claims to be a baby boomer's spiritual journey, and it is just that. But, the message is one that ought to resonate with every man, woman, and child, no matter what their age.\"\"A TIME TO... is not a book merely to entertain. It is a book that could provide a healing venue for those who lost loved ones on September 11 and the days afterward. Al Masterson represents all the victims of this tragedy… I highly recommend this book to readers who enjoy a well-written novel intertwined with historical facts,\" says Tannia E. Ortiz-Lopés (catholicfiction.net) and publisher of \"An Engaging Exploration of Faith, Trust and Hope,\" says Shaeri Richards, author of Dancing with your Dragon. \"If you enjoy exploring issues of trust, faith and hope, 'A Time To...' will provide you with many hours of reading pleasure. I enjoyed reading this book, and my soft heart was melted to tears more than once.\"\"A Must Read for Peace Corps Volunteers, Past and Present,\" says Barbara Henkin, Peace Corps Volunteer (Jamaica, 1969-71). \"Being able to reflect on past experiences and then being able to put them into perspective is a rewarding thing to do. Al Masterson's opportunity to do this (albeit frightening) is an inspiration for readers of this book to do the same. The author, through Al, is very skillful in helping us to answer the 'why' questions we all face in our own lives. Lessons learned during the Peace Corps experience do indeed enhance and enrich the lives of those who serve...the old but true adage that material things don't equal happiness; that we need to give back; that life isn't always fair; that we should always try to look at the \"big picture\"; that taking risks can cause the discovery of unknown talents; that smiles can equal an \"international currency\"; that it is so important to \"listen to your soul\"; and many more.\"",
  "genres": [],
  "author": "Ronald Louis Peterson",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/11239251-a-time-to"
}