{
  "title": "Battle of Lion Rock",
  "description": "“From the very first page, Battle of Lion Rock is sharp, gripping, and captivating. A pulse-quickening, soul-searching, epic journey walks a tightrope from the edge of this world into stunningly terrifying realms. Such a thrilling and thought-provoking adventure draws you deeper into the world of Beacon Hill, leaving you gasping for breath until the end.” - JOHN TELLEGEN, executive producer and writer on the DreamWorks Dragons franchise.A thrilling third installment in the Beacon Hill YA fantasy series which Ryan Steck* praised as “a blistering, high-stakes, fast-paced supernatural thriller that’s impossible to put down.”Ladened with guilt over the innocent lives lost in the war, Jack Reynolds is more determined than ever to honor his sister’s promise. He must fulfill a quest to unite supernatural artifacts missing for centuries and hunted by the Cherub, followers of Elyon, and the Merikh, an evil group seeking world domination. With Eden’s Star as their guide, Jack and Emma journey from this world into other realms to uncover ancient secrets buried in a legendary battle. What they discover could alter the course of history.Back at Beacon Hill, tensions are rising among the Cherub. Friendships and alliances are tested as great loss divides the followers of Elyon. While the thief of Dragon Soul seeks greater power, a dark force from centuries ago has awakened in a realm untouchable since the Mercy Covenant. Revenge rooted in the past collides with the present, forcing Jack to fight against his greatest fear as a legendary warrior’s unrelenting power threatens the destruction of everything and everyone he loves.Battle of Lion Rock is the third novel in the Beacon Hill series, an epic young adult supernatural fantasy that launches you on an action-packed quest for ancient artifacts, secret realms, and true allies. This book is for readers who love fantasy, incredible world building, adventure, found family, loyal friendships, a taste of romance, and the ultimate forgiveness.The Beacon Hill Series Hunt for Eden’s StarSecrets of the HighlandsBattle of Lion Rock*author of Fields of Fire and editor-in-chief of The Real Book Spy",
  "genres": [
    "Fantasy"
  ],
  "author": "D.J.  Williams",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/214758217-battle-of-lion-rock"
}