{
  "title": "Σκηνές από τον βίο του Ματίας Αλμοσίνο",
  "description": "Το μυθιστόρημα \nΣκηνές από τον βίο του Ματίας Αλμοσίνο\n είναι η ανοιχτή παλάμη ενός χεριού που ακουμπάει στον χάρτη της Ευρώπης του 17ου αιώνα ενώ κάθε δάχτυλο της αφήγησης δείχνει και σε διαφορετικό σημείο του ορίζοντα.Η Αγγλία του Νεύτωνα και της Βασιλικής Εταιρείας, το ανεξίθρησκο Άμστερνταμ των εμπόρων, η παγωμένη Πετρούπολη του τσάρου μεταρρυθμιστή, η Βενετία της μάσκας. Ο καρπός του χεριού αγγίζει την οθωμανική απεραντοσύνη, τη Θεσσαλονίκη, την Κωνσταντινούπολη και τον Χάνδακα, τα όρια της Ευρώπης.Ο Ματίας Αλμοσίνο, κρυπτοεβραίος στη Βασιλεία της Ελβετίας, διασχίζει από τρυφερή ηλικία τη Respublica Cristiana, τη χριστιανική επικράτεια, ορφανός με τον τρόπο του Ντίκενς και δέσμιος της θεοκρατικής καταδυνάστευσης της εποχής του. Κτίζει την ενηλικίωσή του μέσα από περιπέτειες καθώς αλλάζει μάσκες θρησκευτικής και φυλετικής ταυτότητας, διχασμένος σχεδόν ως το τέλος από το μέγα διακύβευμα που εγκαινιάζει ο αιώνας του: τη γέννηση του επιστημονικού λόγου και την ανάφλεξη του ορθολογισμού απέναντι στη νοσταλγία του θαύματος και στις πιο ακραίες μεσσιανικές προσδοκίες. Ο Σπινόζα και απέναντί του οι πιο μισαλλόδοξες συγκρούσεις, ο Ντεκάρτ και ο Σαμπετάι Σεβί, το σύμπαν με τα μάτια της νέας επιστήμης ως καλοκουρδισμένη μηχανή και αντίκρυ η αναμονή του τέλους του κόσμου στα 1666 μ.Χ.Το μυθιστόρημα εξιστορεί τη ζωή ενός προικισμένου ανθρώπου, γιατρού και πολυπράγμονα στοχαστή, που δρασκελίζει χώρες, γλώσσες, πολιτισμούς, που περιπλανιέται σε ανθρώπους και ιδέες.Ένα βιβλίο για την ιστορία της ιατρικής και της Ευρώπης, ένα χρονικό της νοσταλγίας του Θεού και της συνάντησης των θρησκειών, ένα οδοιπορικό στη μελαγχολία, στην αναζήτηση της φιλοσοφικής καταφυγής, στον άλλο άνθρωπο και στο πρόσωπό του.Οι τόποι των ταξιδιών αλλάζουν ραγδαία σε μια πλούσια σκηνογραφία: μια διάβαση στις Άλπεις, η Βενετία της παροικίας των Εβραίων και των Γραικών, η Θεσσαλονίκη του Σαμπετάι Σεβί, η Πάντοβα και το φημισμένο της πανεπιστήμιο, το Τζάντε, η πτώση του Χάνδακα, η Κωνσταντινούπολη των θαυμάτων, το Λονδίνο της νέας επιστήμης, τόποι της Γερμανίας, οι ρουμανικές χώρες των ορθόδοξων ηγεμόνων, η επικράτεια του Μεγάλου Πέτρου με τις στέπες και τα ξεχειλισμένα ποτάμια και, τέλος, ένα όρος που το είπανε άγιο.Όλα είναι σκηνές από τη διάρκεια μιας ζωής σκηνές μόνο, γιατί ακόμη και το μυθιστόρημα αδυνατεί να αναπαραστήσει τον ανθρώπινο βίο στην ολότητά του.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Literature",
    "Unfinished",
    "Drama"
  ],
  "author": "Ισίδωρος Ζουργός",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/21476405"
}