{
  "title": "Around the World in 57 1/2 Gigs",
  "description": "The strengths of Bidini’s two best-loved books, On a Cold Road and Tropic of Hockey , music and travel to unlikely places, come together in this account of his search for rock ‘n’ roll.When it looks as if the Rheostatics are breaking up after more than twenty years together, Dave Bidini is left feeling adrift from his moorings and decides to go on a very long road trip, playing solo and finding out about the state of rock ’n’ roll around the world. Accompanied much of the way by his friend Al, who also has a solo act, Bidini sets out for London, England, his springboard for travel to Finland, Russia, China, Sierra Leone, and Ghana, punctuated by trips to Newfoundland and Gananoque in Canada, and to New York City.What Bidini finds is that the rock ’n’ roll machine has not yet flattened the globe, as each place has taken what suits it from the West’s dominant music and ignored the rest. Metal may have had its heyday in North America, but it still suits the quiet Finns just fine as a soundtrack for suicidal thoughts. In China, where Bidini plays with the Rheos-Not-Rheos as part of the Maple Rhythm Festival, he has to coach the crowd sitting quietly in plastic chairs how to clap rhythmically. In Russia, where live rock still lurks in hard-to-find places, the British band Smokie is far more popular than even the Rolling Stones, and the first Western band Mongolian audiences wanted to hear live was Boney M. In Africa, Bidini finds out just how far rock has wandered from its roots, and in Newfoundland, just how true it has stayed.Peopled with hosers, the über-hip, and the profoundly baffled, and brimming with tales of playing in strange venues to bemused locals and the odd drunk, Around the World takes readers on an unforgettable, ear-opening swing through the world of rock ’n’ roll.",
  "genres": [
    "Nonfiction",
    "Music",
    "Canada",
    "Music Biography",
    "Travel"
  ],
  "author": "Dave Bidini",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/2148428.Around_the_World_in_57_1_2_Gigs"
}