{
  "title": "The Making of Stanley Kubrick’s '2001: A Space Odyssey'",
  "description": "The ultimate trip: Science fiction's greatest masterpiece explored in depth In March 1964, Stanley Kubrick decided that his next project would be to make the proverbial good science-fiction movie. Fifty years after the film's conception, TASCHEN looks back at the process of making the most important science-fiction film of all time. Though 2001 has arguably spawned more critical texts and scholarly analyses than any other film, this publication marks the first time that a truly exhaustive book has been devoted to it. TASCHEN readers enjoyed a sampling of previously unseen 2001 material in The Stanley Kubrick Archives; this four-volume set revisits the subject, exploring in great depth every aspect of the film and its making: the groundbreaking technical effects, the extraordinary set designs, and the fascinating collaboration between Kubrick and Arthur C. Clarke. Made in exclusive collaboration with the Kubrick estate and Warner Brothers, this copiously illustrated work features hundreds of unique 2001-related documents, concept artworks, and superb behind-the-scenes photographs from the Kubrick Archives most of which have never been published before as well as exclusive material from co-screenwriter Arthur C. Clarke s archives. The Making of Stanley Kubrick s '2001: A Space Odyssey' is a landmark book for film fans and a celebration of technical special-effects innovation before the digital age, conceived by the very designers of TASCHEN's instant collectible Stanley Kubrick's Napoleon: The Greatest Movie Never Made. The Making of Stanley Kubrick's '2001. A Space Odyssey' Four volumes contained in a monolith-shaped case, designed by M/M Paris: Volume 1: Film stills Volume 2: Behind the scenes (including new interviews with lead actors, senior production designers, and key special-effects experts) Volume 3: Facsimile of original screenplay Volume 4: Facsimile of original 1965 production notes Limited to a total of 1,000 copies: Art Edition No 1-500 (Art Edition A and B) and Collector's Edition No. 501-1,500\"",
  "genres": [
    "Film",
    "Art",
    "Media Tie In",
    "Nonfiction",
    "Space",
    "Design"
  ],
  "author": "Piers Bizony",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/21488853-the-making-of-stanley-kubrick-s-2001"
}