{
  "title": "The Dark Cave Between My Ribs",
  "description": "After disaster, there is always the possibility to love again. Poet Loren Kleinman invites us to witness snapshots of a complex life-including accounts of abuse, grief, suicide, love, and loss-rendered poetic yet accessible. The Dark Cave Between My Ribs appeals to all who crave an authentic voice that is tangible, unique, and universal. Loren Kleinman's poetry is staring you dead in the face and daring you to blink. Not much so stark, has ever dared to be so cleanly beautiful - the lines crisp, the silences their own loud singing. Nothing lets you look away; lets you be left alone. -Roger Bonair-Agard , Cave Canem fellow , Two-time National Poetry Slam Champion,  author of Tarnish and Masquerade- Loren Kleinman's poems in  The Dark Cave Between My Ribs  are explorations of love and loss, longing and passion. Kleinman peels away at the scrim we try to hide behind so we don't see our own scars or the scars we have inflicted on the world. Her universe is filled with images of the terrible atrocities of concentration camps as well as the one-on-one betrayal of rape. The poet struggles are often rendered in nightmare landscapes, which she runs through in order to reach some semblance of safety and peace. This book is an amazing achievement. - Maria Mazziotti Gillan , Winner, American Book Award  & Barnes & Noble Writers for Writers Award from Poets & Writers- In this beautiful collection, Loren Kleinman writes about longing and loving, touch and loss, truth, absence, and ultimately, the soul. The poems are moving, the sentiment naked, and the language irresistible. I'm grateful to have been invited to into this writer's mind and heart and world. -Beverly Donofrio, author Riding in Cars with Boys- Loren Kleinman's  The Dark Cave Between My Ribs  is as much a keening behind the destructive nature of assault and addiction as it is an instruction for survival itself.  These poems build a raw and unflinching collection that travels across the individual lens to the unspeakable human wreckage of Nazi Death Squads in Lithuania.   The speaker in these poems refuses to dodge grief, to look away. Instead, she \"Somehow, I'll know what to do. /touch the skin of this world. /Peel it back.\" It is in this stark and brave examination of the physical world that Kleinman reveals a necessary truth for us all. -Sean Nevin, author of Oblivio Gate- These poems are an intimate look into the heart written with such power.   The Dark Cave Between My Ribs  is beautiful, sad, intense and will grab the reader and not let go. Loren Kleinman's poems capture the dark side of things that happen in life but yet, show such courage in the writing. \"I'm  broken winged, a fallen bird on the road\" can sum up many of these poems, but that bird survives, rises up and flies. -Gloria Mindock, Editor and Publisher, Červená Barva Press- Every now and then fate introduces me to a poet whose poetic work captures my attention. Such is the case with regard to poet Loren Kleinman and her new collection of poetry entitled  The Dark Cave Between My Ribs . In a world where there is a plethora of published prose poetry, this collection stands out in my mind. I say so because beginning with the first poem, the collection gathers strength, as if a tea kettle filled with water gathering steam. Once the whistle blows, you know you have water ready for tea. I am confident readers of this work will walk away having been emotionally impacted by this collection. More importantly, it feels like it has award-winning quality. That is my hope for this powerful work of poetry by poet Loren Kleinman. -Emmett Wheatfall, author of Bread Widow-",
  "genres": [
    "Poetry"
  ],
  "author": "Loren Kleinman",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/21488431-the-dark-cave-between-my-ribs"
}