{
  "title": "The Dating of Beowulf: A Reassessment",
  "description": "This book will be a milestone, and deserves to be widely read. The early Beowulf that overwhelmingly emerges here asks hard questions, and the same strictly defined measures of metre, spelling, onomastics, semantics, genealogy, and historicity all cry out to be tested further and applied more broadly to the whole corpus of Old English verse. Andy Orchard, Rawlinson and Bosworth Professor of Anglo-Saxon, University of Oxford.The datingof Beowulf has been a central question in Anglo-Saxon studies for the past two centuries, since it affects not only the interpretation of Beowulf , but also the trajectory of early English literary history. By exploring evidence for the poem's date of composition, the essays in this volume contribute to a wide range of pertinent fields, including historical linguistics, Old English metrics, onomastics, and textual criticism. Many aspects of Anglo-Saxon literary culture are likewise examined, as contributors gauge the chronological significance of the monsters, heroes, history, and theology brought together in Beowulf . Discussions of methodology and the history of the discipline also figure prominently in this collection.Overall, the dating of Beowulf here provides a productive framework for evaluating evidence and drawing informed conclusions about its chronological significance. These conclusions enhance our appreciation of Beowulf and improve our understanding of the poem's place in literary history.Leonard Neidorf is a Junior Fellow at the Harvard Society of Fellows. Frederick M. Biggs, Thomas A. Bredehoft, George Clark, Dennis Cronan, Michael D.C. Drout, Allen J. Frantzen, R.D. Fulk, Megan E. Hartman, Joseph Harris, Thomas D. Hill, Leonard Neidorf, Rafael J. Pascual, Tom ShippeyTable of ContentsIntroductionBeowulf and Language History - R D FulkGermanic Legend, Scribal Errors, and Cultural Change - Leonard NeidorfNames in Beowulf and Anglo-Saxon England - Tom ShippeyThe Limits of Conservative Composition in Old English Poetry - Megan E. HartmanThe Date of Composition of Beowulf and the Evidence of Metrical Evolution - Thomas A. BredehoftBeowulf and the Containment of Scyld in the West Saxon Royal Genealogy - Dennis CronanHistory and Fiction in the Frisian Raid - Frederick M. Biggs'Give the People What They Want': Historiography and Rhetorical History of the Dating of Beowulf Controversy - Michael D. C Drout'Give the People What They Want': Historiography and Rhetorical History of the Dating of Beowulf Controversy - Emily Bowman'Give the People What They Want': Historiography and Rhetorical History of the Dating of Beowulf Controversy - Phoebe BoydA Note on the Other Heorot - Joseph HarrisBeowulf and Conversion History - Thomas D HillMaterial Monsters and Semantic Shifts - Rafael J. PascualScandals in Kaluza's Law and Transliteration Errors - George Clark Beowulf and Everything Else - Allen J. Frantzen",
  "genres": [],
  "author": "Leonard Neidorf",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/21488093-the-dating-of-beowulf"
}