{
  "title": "For Single Parents: Black & White Edition Without Illustrations",
  "description": "Are you ready to start your Happiness Program for boosting your emotional and relationships life? I am a single parent, at least at the time when I wrote this book! Being single is not at all bad; most partners expect you to be totally self-confident, self-reliant, self-sufficient (also in the bedroom!) a perfectly do-it-by-yourself living concept. This is not a lack of cooperation, but rather the evolution of the times... Our Men are sons of the women who first created nuclear families (no-longer 3 generations living under the same roof!). And our Women are daughters of women who started to really enjoy similar rights as men, both at work and in the social arena. I wrote the book \"For Single Parents\" because everybody deserves to be happy, but we single parents need to be much happier compared to individuals living in a family idyll. Don't you agree? The part relevant to much more will be my task in this guide. You don't have to worry about how you will get this result. Important changes are not always the product of big fatigue and years of learning and preparation, especially when Happiness is the target. I will help you make those Small Changes in your Attitude, which will produce Big visible and Permanent Results!You are going to read distilled concepts; not philosophy, but real tips and ideas, expressed in few, everyday understandable words. My job here is to inspire you, rather than educate you, although some exercises are there to be done as required, because there is no other way to go forward and try to be a grown up and responsible adult, than learning through experience. Experience produces stories...stories produce feelings...and feelings are our direct gateway to our inner Self! Then, it's a lot funnier to learn through feelings and inspiration than through Fig. 1 or Fig. 2. Isn't it? This learning way is accepted by almost every Self; whereas some Selves are resistant to dogmas and rules. I have this kind of resistant Self myself!\"FOR SINGLE PARENTS\" will lightly channel new ways to see your roles and your future.\"\"There is no worst parent than an unhappy parent\"\" - Rossana Condoleo, from HAPPY DIVORCE.Sustaining a double role (mother & father), especially when the other parent is not there, doesn't cooperate, or is taking care of your children from above the sky, requires double strength-motivation-happiness. A whole of energies which you will be able to get from inside yourself, as a matter of FACT. Children are very sensitive to mom and dad moods and react accordingly; therefore you cannot do them a better favor than working at yourself and at your own happiness, while helping your children to develop the same strong commitment to existential and universal principles, those which regulate and feed also the everyday life of a happy person. As light as it may appear, my book will provide you with a big deal of material for self-growth and development, enabling everybody to attain a few important goals, like being emotionally in a position to keep a hand on your life, whatever happens!I am divorced, and as said, single parent of a seven year old witty and talkative girl. I know myself what it means having to carry so much responsibility at home without having a partner for sharing, and lighten this burden through shots of love and understanding! You will find tips to be more successful in the dating arena, but I will focus more about improving you as a package.Think that you are not alone, that the author of this book talks to you as a Life-Coach, as a Writer and as a Friend who wants to see your face turned on by a permanent, happy smile. Whatever happens in your mind happens also all over your body! Self-improvement has positive side effects on your general health and appearance, starting from your charisma.Now...let me take your hand and guide you to a short, inspiring, pleasant journey into HAPPINESS AND LOVE!Rossana Condoleo",
  "genres": [
    "Self Help",
    "Parenting"
  ],
  "author": "Rossana Condoleo",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/21485959-for-single-parents"
}