{
  "title": "A Journey Towards Enlightenment: A Bashful Country Boy Goes on Walkabout",
  "description": "At this period of time in the history of man, there is probably more individual searching being done into the theories behind the origin of the human race, what happens after death, the possibility of life on other planets, and what our relationship is to these life forms, if they do exist. There are millions of people who are questioning the existence of God, who he really is, and what is my relationship with him? Is he someone who mysteriously floats around on a cloud watching and judging us from above like some bigger than life Santa Claus, or is he, like many of the esoteric sciences claim, a part of our inner Self, whom we have constant contact with, someone whom we and everything in the universe are connected and are thus one? Each of us in our own way is experiencing what God is, and thus we are each a part of God, thus we are God! This book is a brief account of my search for my own truth as I know it today, everything stated actually happened, according to my own perception. It has been an exciting search, at times very frustrating, very rewarding, and above all, very fulfilling. My main purpose in writing this book is to show that anyone, even a bashful unfamous country boy can have these awakenings, you don't have to be rich or well-known to find your connection to Divine Source. I began taking notes for this book over thirty years ago, at the time, writing a book was the farthest thing from my mind. My only thought was to have a journal to read over when I got older. As a result, I didn't record some of my references, many of the references were from Aboriginal and Mayan elders themselves, many of which has been the victim of the ravages of time. Hence my book is short on references, but long on experience, I hope you understand.",
  "genres": [],
  "author": "Gary Wonning",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/21485786-a-journey-towards-enlightenment"
}