{
  "title": "The Logoharp: A Cyborg Novel of China and America in the Year 2121",
  "description": "The Logoharp is now a Literary Titan Gold Book Award winner (August 2024) and a \"Finalist\" in the American Book Awards 2024 (Science Cyberpunk category).\"She reports the future. Then it happens.\"Naomi,, half-human and half-cyborg, is beyond prescient. She’s a Reverse Journalist, working for China in the 22nd century. Naomi’s job is to foresee and report the events and personalities of the future. Unlike conventional journalists who frame contemporary events, Naomi extrudes the “truth of probable outcomes” to ensure the smooth progression of history.Driven by voices she hears in her Logoharp, a universal translator of instructions and signals from sources she can’t identify, Naomi listens, speaks and broadcasts in all world languages, ensuring citizen compliance. But an encounter with a leading architect, Naomi’s former lover who abandoned her in youth, forces recollections of her human inheritance and the role that chance, culture, and racism played in her early life.Naomi is tasked with finding a flaw in the architect’s system that “balances” births and deaths on behalf of the State. But she grows uncomfortable, then furious. Guided by the dissonant Logoharp, Naomi experiences “unintentional contradiction.” The rest isn’t silence. She acts.  ADVANCE PRAISE FOR THE LOGOHARP“Loved The Logoharp!  It’s genuinely original, disturbing in a provocative way, occasionally funny and erotic, creative and well-paced — and I can’t get those ice sleighs out of my head! Naomi is one strange —and beguiling—heroine.”—Laura Berman, feature writer, columnist, The Detroit News“Prepare to be swept away by an imperfect yet wildly relatable heroine. This ancient, futuristic world will make you angry, frustrated, hopeful, in love, and inspire an uprising within.”—Grace Diida, L.L.M., Venture Capital Research\"This novel, about Naomi, a half-human cyborg journalist, may be as significant as Orwell's 1984.\" —Sonya DiPalma, Chair, Communications, Univ. of North Carolina Asheville.“In Arielle Emmett’s fevered imaginings one great and ancient state is able to dominate the rest using an unbeatable secret weapon. Logoharps. Creatures able to see into the future, ensuring the state is always a step ahead. That is, until one rebels. Imagine Mona Lisa Overdrive meshed with The Wind-Up Girl. That's the kind of sci-fi ride you're in for with The Logoharp.\"—Kevin Sites, author of The Ocean Above Me (HarperCollins)\"Set a century from now, Emmett’s bold, brainy, and provocative fiction debut explores urgent issues of truth, mis- and disinformation, and what it means to be human, all from the perspective of a winged, part-cyborg “Reverse Journalist” (or RJ) in the employment of the Mother Country, China.... A plot eventually kicks in, involving a coverup, a Human Recycling program, orders to engineer the downfall of an “algorithmic imposter,” and a surprise from Naomi’s past. All of this is gratifyingly twisty, with conflicts extrapolated from our present with rare conceptual rigor, but the richness of imagination and moral inquiry take priority over narrative momentum.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Arielle  Emmett",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/214970250-the-logoharp"
}