{
  "title": "Birds of Prey",
  "description": "Annie Wilkes from Misery...John Doe from Se7en...Hannibal Lecter...For everyone who thinks the bad guys are so much more fun to read than the good guys, we’ve written a book just for you.In the annuls of modern thriller fiction, the villains always steal the show. We love to read and watch great villains. In many cases, they’re the best, most entertaining parts of our books, so it only made sense to write a book featuring every major villain we’ve ever written. They’re all here...Lucy and Donaldson from Serial, Orson and Luther from Desert Places, Locked Doors, and Break You, Mr. K from Shaken, Alex and Charles Kork from Whiskey Sour and Rusty Nail, Isaiah from Abandon, Javier from Snowbound, and many, many more from the Crouch and Konrath/Kilborn books including Trapped, Run, Bloody Mary, Afraid, Endurance, and Shot of Tequila.If you liked Serial Uncut and Killers, Birds of Prey is going to blow your mind, scar your soul, and scare you to death.If you haven’t read anything by Crouch, Kilborn, or Konrath, Birds of Prey is the perfect introduction to the dark side of their universe.And if you enjoy a good bad guy (or bad girl), you’re going to love this.Because there are TWENTY-ONE of them featured in this book.Beyond a thrilling piece of horrifying suspense, Birds of Prey also takes the collaborative literary experiment begun in Serial and Killers to the next level, with most of the novel having been written in a Google Doc, where the authors could simultaneously write in real time. All bets were off, and may the best psycho win.Birds of Prey is a 40,000-word stand-alone novella.NOTE: The three novellas in this series are: Serial Uncut, Killers, and Birds of Prey.These novellas are also available in a variety of compilations.Killers Uncut = Killers + Birds of Prey.Serial Killers Uncut = Serial Uncut + Killers + Break You + Birds of Prey.",
  "genres": [
    "Horror",
    "Thriller",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "Blake Crouch",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/11240714-birds-of-prey"
}