{
  "title": "Love of the Game - The Complete Collection",
  "description": "If you enjoy a combination of hot professional athletes, strong women, and sexy love stories...then this sports romance anthology is for you!How you play is just the beginning…Ready to Rumble – Demitria Stavos has been secretly in love with her father's star performer, Nikolai \"Granite\" Petrov for years. When they're thrown together on a promotional tour, each may have finally met their match.wrestling romanceBreaking the Ice – Diesel LeBlanc notices MacKenzie Rhodes and decides he has to have her. He finally gets what he wants - on her terms - and heads off to live the fabulous life of a professional hockey player. Years later, a chance meeting when he’s traded to the Boston Bruins brings them together again. This time, he doesn’t plan to let her get away. hockey romanceTime to Make the Doughnuts – Josie Channing doesn't trust men anymore. Especially professional athletes. When Max Grant - star receiver for the Pittsburgh Steelers - enters her bakery in a bizarre moment of weakness, she draws her weapon and prays he doesn't make her use it. Max is as patient in love as he is on the gridiron. football romanceWin, Lose, or Raine – After a single night of passion, Raine Storm runs away without ever knowing her lover’s name. The day Rangers catcher, Jake Forrest arrives to do physical therapy at her clinic, she understands why no other man has measured up since. He’s ready to show her why he’s considered the best catcher in the league. baseball romanceThe Three Pointer – Harley Jamison has known her older brothers’ friends all her life. Beckham Pierce broke her young heart while Dex Rutledge covered for him. She cuts them off without looking back. Years later, she’s forced to confront them again. Now star players for the Phoenix Suns, the men realize they may have changed but Harley hasn’t. It’s going to take an aggressive game to get her back. basketball romanceA set of five hot, emotional love stories by Always the Good Girl, Shayne McClendon!",
  "genres": [
    "Sports",
    "Romance"
  ],
  "author": "Shayne McClendon",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/21495452-love-of-the-game---the-complete-collection"
}