{
  "title": "Decoded",
  "description": "Decoded is a mind-bending thriller that challenges everything we thought we knew about history, power, and the untold stories of remarkable women. When investigative journalist Amalia Rose stumbles upon a blog post claiming that the enigmatic Voynich Manuscript holds the key to a lost matriarchal civilization, she embarks on a thrilling journey to unravel the cryptic clues and decipher the manuscript's true meaning.Partnering with her brilliant but frustrating ex-boyfriend, Bastian Ham, Amalia races from the dusty archives of ancient libraries to cutting-edge ocean research facilities. They follow a trail of breadcrumbs left by historical figures like cryptologist Elizebeth Friedman and author Ethel Voynich, uncovering tantalizing clues about a lost civilization, an ancient wisdom tradition, and a powerful psychedelic elixir.As they delve deeper, Amalia and Bastian stumble into shocking revelations about the Eleusinian Mysteries, the Antikythera Mechanism, and the suppressed history of powerful women. Aided by the Order of the Nine Realms, a secret society of librarians, they must outwit shady government agents, fanatical cults, and Neo-Nazi conspirators at every turn.Alternating between Amalia's present-day narrative and glimpses into the ancient past, Decoded explores gender power dynamics, the intersection of science and spirituality, and the enduring search for truth. Real-life luminaries brush shoulders with memorable original characters in a genre-defying narrative that weaves together archaeology, artificial intelligence, and mysticism.Decoded is a thought-provoking love letter to the unsung heroines of history, raising questions about truth, storytelling, and the importance of preserving marginalized voices. From the streets of New York to the rolling hills of Tuscany and the sun-drenched Greek isles, time is running out—will Amalia and Bastian decipher the code before an ancient wisdom is erased from history forever?Editorial Reviews\"What starts as a fun, flirty caper evolves into a thought-provoking exploration that will have your assumptions challenged by real life facts that are stranger than fiction. Blending meticulous research with edge-of-your-seat suspense, Ms. Rose entertains and educates. Decoded is both cerebral and big-hearted. A rare gem!\" — Dr. Nikolaos Latsis, director of the Cycladic Archaeological Society.Color EditionThis color edition of \"Decoded\" offers readers an enhanced experience, bringing the world of Amalia Rose's investigation vividly to life. It Selected pages from the Voynich Manuscript, allowing readers to examine its enigmatic illustrations and text up close.Photographs of key archaeological artifacts mentioned in the story, providing visual context for the historical mysteries Amalia uncovers.Portraits and images of historical figures central to the investigation, helping readers connect faces to the names that shape the narrative.A curated selection of images relevant to Amalia's maps, notes, letters, etc.The color edition brings an extra layer of depth to the story, making the adventure even more immersive and engaging.The SeriesEmbark on an unforgettable journey with your friends and family as you transform into intrepid investigative journalists, unraveling the secrets of the mysterious artifacts together. Dive headfirst into the captivating world of encryption, ancient unsolved mysteries, and cutting-edge research.",
  "genres": [
    "Feminism",
    "Mystery"
  ],
  "author": "Amalia Rose",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/214912138-decoded"
}