{
  "title": "Grand Adventures",
  "description": "On September 1, 2011, TJ Klune wrote, \"...it's not about the ending, it's about the journey...\" in a review of Eric Arvin's Woke Up in a Strange Place. With those words, two men began a journey of love and invited us to ride along. TJ and Eric have shared so much with us: their wonderful books, their smiles, their humor, their lives, and their inspiring devotion to each other. In December of 2013, their journey took a detour when Eric was taken to the emergency room. He survived the surgery to remove a cavernous hemangioma from his brain stem, but the challenges TJ and Eric face are far from over.The authors in this anthology donated their talent as a way to support Eric's continued recovery, to help bring strength to TJ, and to show both of them just how much love surrounds them. Grand Adventures is a diverse range of stories about the journey of love. We’re going on some grand adventures for a great cause. Thank you for joining us.One hundred percent of the income from this volume goes directly to TJ and Eric.Foreword by S.A. McAuleyAn Unexpected Thing by John AmoryThe Twinkie Ignition by J.E. BirkWhen Friendship Becomes More by Sophie BonasteIsle of Waiting by Sue BrownThe Jogger by KC BurnHolding Court by Cardeno C.For Dear Life by Mary CalmesUnder the Full Moon by Ellis CarringtonStripped by Shae Connor (2nd Edition)That Place Across the Hall by C.C. DadoMistaken MD by Phoenix EmrysCops and Comix by Rhys FordLast First Kiss by LE FranksTomorrow by John GoodeFrom Fantasy to Friends by CR GuilianoWitness Protected by Dawn Kimberly JohnsonWater Under the Bridge by Mia KerickA Gentle Shove of Human Kindness by Amy LaneAir (Roads #1.75 million) by Garrett LeighAn Atheist and a Yoga Instructor Walk into a Bar by Rowan McAllisterStalking 101 by Moria McCainSimple Desires by Tempeste O'RileyObject of Care by Zahra OwensKid Confusion by Madison ParkerFall Train by Jaime SammsThe Exhibition by Andrea SpeedWhat You Will by TinneanPrologue by Brandon Witt",
  "genres": [
    "Anthologies",
    "M M Romance",
    "Romance",
    "Contemporary",
    "Short Stories",
    "Audiobook",
    "LGBT"
  ],
  "author": "S.A. McAuley",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/21508457-grand-adventures"
}