{
  "title": "Bend",
  "description": "Kick\n by C.D. Reiss\nUnRaveled\n by K. Bromberg\nCome\n by J.A. Huss\nRed & Wolfe\n by Ella James\nThe Devil In Me\n by K.I. Lynn\nWorth\n by Shay Savage\nThese Men\n by Andrea SmithSTILL by Alessandra TorreKick by C.D. ReissThe first novella in Songs of PerditionFiona Drazen, sex addict, submissive slave, celebutante, trapped in a mental ward until Dr. Elliot Chapman can help her remember why she's there. But once she does, she might not want to go home to the Master she tried to kill.***************************************************************Unraveled by K. BrombergOne night.One mistake.Filled with fear.Sated by pleasure.Robbed of control.Blindfolded and bound.Shamed she liked it.Doomed to want it.Limits tested.Boundaries pushed.Desire awakened.Inhibition unleashed.An identity unraveled.Lives changed forever.***************************************************************COME by J.A. HussHe must have her, take her, control her, keep her. She will submit. But she will do it when she is ready and willing. The bond is uneasy and the future uncertain. But one thing’s for sure.Alone… Harper and James are dangerous.Together… they are unstoppable.***************************************************************Red & Wolfe by Ella JamesAfter years attempting to contact her estranged grandmother, an artist who lives on a remote island, Sarah “Red” Ryder is surprised to receive an invitation. When she arrives at the island, she’s shocked to find it is now the home of J. Wolfe, the reclusive artist, who has his own plans for her.***************************************************************The Devil in Me by K.I. LynnIn search of strength and guidance at a nearby church, Jared happens upon a temptation. One he cannot hope to resist. Each time he sees her, the overwhelming urge to have her consumes him. The lust is overpowering, dragging him deeper and deeper with each encounter, exposing the devil within.***************************************************************Worth by Shay SavageAn injured Roman Tribunus finds comfort in the touch of the slave commanded to tend to his wounds. As a slave, her value is measured as a couple of coins, but as Tribunus Faustus learns more about her, he begins to understand her true worth.Still, a man of his station can never acknowledge feelings for a slave, and she is already owned by another man.***************************************************************These Men by Andrea SmithPaige Matthews has a lot to learn, and more than just about being an intern with the F.B.I. Inexperience with all types of relationships leaves her looking for a new place to live. Eli Chambers and his partner, Cain Maddox, are looking for a roommate. It's the perfect arrangement, but one that will change all their lives forever.***************************************************************STILL by Alessandra TorreI was raised right. To mind my manners, keep my knees together, to put my napkin in my lap. But somehow, with one look at the dark sexuality that is Brett Jacobs, I forgot my Southern graces. They may have gotten lost in the pushmeupagainstthewall and takemehere action that occurred. In the clothes-ripping ohmygod action that followed. They may have, along with my sanity and common sense, deserted me, leaving me with bruised lips, ripped panties, and multiple orgasms.***************************************************************This set will only be available for a limited time, so get it before it disappears.",
  "genres": [
    "Anthologies",
    "Erotica",
    "Romance",
    "BDSM",
    "Dark",
    "Novella",
    "Amazon"
  ],
  "author": "K.I. Lynn",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/21504374-bend"
}