{
  "title": "A Dangerous Hunger",
  "description": "Dr. Talia Maris had lived her entire life as a freak—a too tall, too plain, too odd woman who sees and senses the presence of otherworldly entities. A total recluse, Talia spends all of her time on her research, living a contented, quiet life with only her loyal feline companion for company. Until that sedate existence comes crashing down around her when she starts being pursued by demon Evils. And if there’s one thing she hates…it’s demons. She ditches every one of them until Sentinel demon, Drew Winston, finally wins the game of pursuit by trapping her with a deceitful, underhanded trick. Not only is she infuriated by Drew’s stunt, but when he tells her she’s his mate, Talia wonders if the too handsome, too tall, too sexy Sentinel demon needs some serious psychological help. All she wants is to get rid of Drew as quickly as possible! But the stubborn Irishman isn’t budging, and her resistance slowly crumbles as she gets pulled deeper and deeper into the world of the Sentinels by the relentless attempts of the Evils to capture her. And what is she supposed to do with Drew Winston, a Sentinel demon who would do anything, even sacrificing his own life, to protect her?There are two things Drew Winston loves about his life: being a billionaire Sentinel demon and food. He loves having everything he wants, and he’s perfectly happy slaying Evils and rescuing unsuspecting humans, until the irritating Dr. Talia Maris evades him one time too many. Yeah…sure…maybe he was a little devious in the method he used to finally meet her face-to-face, but he ends up being the one who is actually surprised when he discovers the elusive woman is actually his mate. Worse yet, she’s being pursued by ancient Evils, and it brings every protective instinct he has to the surface, making him want to kill anything that might hurt Talia. Maybe Drew had never wanted or expected a mate of his own, but once he has Talia in his grasp, he’s determined to keep her safe and make her want to stay with him forever.18+ Plus Only. Not intended for Teens.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Demons",
    "Romance",
    "Fantasy",
    "Erotica"
  ],
  "author": "J.S. Scott",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/21520850-a-dangerous-hunger"
}