{
  "title": "When To Quit",
  "description": "As a world renowned virologist Dr. Dawson Curgalff ( one of the winners of the coveted Conway Awards ) finds herself on the fringe of a life overwhelmed. In addition to searching the world for the animal hosts of zoonotic lethal viruses she has steadily collected war orphans and extracted them from combat zones. Unknown to her public admirers she is also a formidable opponent on the battle field. After a lifetime of struggling to rescue war orphans from the clutches of insurgent generals she has accumulated enemies and left a long trail of rotting corpses. In certain circles the mere mention of her name brings on a certainty of fear. She hasn't survived by just getting through experiences. She has survived by damaging those who have opposed her without conscience or remorse. The Conway Award was supposed to provide extreme funding for people who were brilliant enough to stop the extinction of mankind. She hadn't done that and knew her efforts had been fought to a standstill.  On her way to receive more money from the Conway Foundation she learns that the first love of her life, Bradford Ramsden was recently shot. After the award dinner in New York Mr. Conway asks her to go an identify the body which is being held in a morgue in Newark. Ramsden had disappeared suddenly from her life, and the world, just after getting his award over thirty years ago. She is accompanied on this quest by Liam Stephens, her fellow award winner who also had also been friends with Ramsden decades ago. When they see the body they both realize that it is not Brad but a body double. Agreeing to identify the corpse as Brad they begin to investigate why there is a body double. Apparently Ramsden had created a decades long, deep cover identity.  Shortly thereafter events begin to spiral dramatically out of control. Liam Stephens is killed. Shot right through the head by the same caliber bullet that killed Brad. She is now being investigated for her connections to both murders and three others committed by the same assassin. She becomes fatally ill from an unknown dehydrating disease and goes blind as well.  Awaking in the hospital late in the night she realizes that Brad is sitting on the floor in her hospital room. He is very much alive and has achieved the Conway Award goal, after a fashion. He is going to implement a plan that will force governments around the world to decrease the sizes of their standing armies and destroy all of their weapons of mass destruction.  Dawson isn't sure what to do. Instantly she is drawn back to this man, the first real love of her life- like a lemming to the edge of a very high cliff she is compelled. He wants her to be part of his plan. He cures her blindness and the dehydration and convinces her what he has is real.  How does she know the plan has power? Brad is the one who struck her down and made her blind and now has healed her. She is furious but compelled by the reality, ruthlessness and audacity of his action. He wants her to be the spokesperson to the world and announce his plan and vision for humanity. The leaders of the world must step back immediately from the edge of the extinction abyss they have lead us to. There can be no compromise no negotiation- failure to comply will result in their immediate and personal demise.  She begins this journey reluctantly but with intention...",
  "genres": [],
  "author": "M.J. Milner",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/21517522-when-to-quit"
}