{
  "title": "SAGE Handbook of Play and Learning in Early Childhood",
  "description": "′This  Handbook  offers diverse perspectives from scholars across the globe who help us see play in new ways. At the same time the basic nature of play gives a context for us to learn new theoretical frameworks and methods. A real gem!′- Beth Graue, Department of Curriculum and Instruction, Wisconsin Center for Education Research, USA Play and learning scholarship has developed considerably over the last decade, as has the recognition of its importance to children’s learning and development. Containing chapters from highly respected researchers, whose work has been critical to building knowledge and expertise in the field, this  Handbook  focuses on examining historical, current and future research issues in play and learning scholarship. Organized into three sections which The  Handbook′ s breadth, clarity and rigor will make it essential reading for researchers and postgraduate students, as well as professionals with interest in this dynamic and changing field. Liz Brooker  is Reader in Early Childhood in the Faculty of Children and Learning at the Institute of Education, University of London. Mindy Blaise  is an Associate Professor of Early Childhood Education in the Department of Early Childhood  Education at the Hong Kong Institute of Education. Susan Edwards  is Associate Professor in Curriculum and Pedagogy at Australian Catholic University.This handbook′s International Advisory Board Jo Aliwood , The University of Newcastle, AustraliaPat Broadhead, Leeds Metropolitan University, AustraliaStig Brostrom, Aarhus University, DenmarkHasina Ebrahim, University of the Free State, South AfricaBeth Graue, Wisconsin Center for Education Research, USAAmita Gupta, The City College of New York, CUNY, USAMarjatta Kalliala, University of Helsinki, FinlandRebecca Kantor, University of Colorado Denver, USAColette Murphy, Trinity College, Dublin, Republic of IrelandEllen Sandseter, Queen Maud University College of Early Childhood Education, Norway",
  "genres": [],
  "author": "Liz Brooker",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/21508872-sage-handbook-of-play-and-learning-in-early-childhood"
}