{
  "title": "Peter Pan in Scarlet",
  "description": "In August 2004 the Special Trustees of Great Ormond Street Children's Hospital, who hold the copyright in Peter Pan, launched a worldwide search for a writer to create a sequel to J.M. Barrie's timeless masterpiece. Renowned and multi award-winning English author Geraldine McCaughrean won the honor to write this official sequel, Peter Pan in Scarlet. Illustrated by Scott M. Fischer and set in the 1930s, Peter Pan in Scarlet takes readers flying back to Neverland in an adventure filled with tension, danger, and swashbuckling derring-do!    Amazon.com Exclusive [image]Tony DiTerlizzi on Illustrating the Cover for Peter Pan in ScarletI grew up with J. M. Barrie's Peter and Wendy and later read Peter Pan in Kensington Gardens which was illustrated by the great turn-of-the-century artist, Arthur Rackham. Peter's carefree spirit and nature is what I adored as a child and long for now as an adult. And these are the feelings I tried to convey into my rendition of the boy-who-would-not-grow-up.  In working on an image for the American jacket of this authorized sequel, I went through many designs trying to capture the spirit of the 100-year-old character while making him intriguing to the readers of today. This, of course, is much easier said than done.  Many of us have an idea of what Peter Pan should look like based on stage plays, movies, and the myriad of illustrated books, but in actuality both J. M. Barrie and Geraldine McCaughrean describe very few of his physical features. This opens up a lot of room for visual interpretation for an illustrator, however anything too severe in redesign would lead to confusion of identifying who this iconic and (dare I say) mythic character is. So I tried to breathe some new life into his appearance, but still remain faithful to the Peter Pan we all know and love.  --Tony DiTerlizzi",
  "genres": [
    "Fantasy",
    "Childrens",
    "Fiction",
    "Middle Grade",
    "Young Adult",
    "Adventure",
    "Pirates"
  ],
  "author": "Geraldine McCaughrean",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/2151432.Peter_Pan_in_Scarlet"
}