{
  "title": "Mrs. Malory: Detective in Residence",
  "description": "British from the tips of her sensible shoes to the lapels of her classic tweed suit, the delightfully civilized Mrs. Sheila Malory of Taviscombe, England, has a talent for solving the most frightfully uncivilized of crimes. In this fifth outing into the dark byways of homicide, she leaves her cat and her village behind to teach a literature course at a small American college...and finds herself right at home instructing the local police in the ABCs of murder. Mrs. Sheila Malory gazes at a fabulously attractive man at the faculty party welcoming her to Wilmot College. Unfortunately, Professor Carl Loring shares a penchant for malice with his brother, Max Loring, the curator at the nearby Whittler Institute. Between them they have destroyed reputations, committed character assassinations, and killed colleagues' careers. Nearly everyone in this close-knit academic community nestled in a Pennsylvania river valley wants to see them get their comeuppance. And someone wants to see them dead. Mrs. Malory is soon plunged into a moral and most emotional dilemma amid the groves of academe. The discovery first of Max's dead body, then Carl's, brings divorced, middle-aged Police Lieutenant Mike Landis onto the scene and into her life. Landis enjoys Mrs. Malory's company, shares a passion for Shakespeare, and welcomes her help in solving a case where clues are few, but suspects are many. Mrs. Malory's close friend and hostess, Linda Kowolski, has motive and opportunity for committing at least one of the crimes. So do a gorgeous graduate student who has been sexually harassed, a soft-spoken writing professor who finds his future in jeopardy, and a powerful local businessman who may have blown millions on a forged work of art. One by one the incomparable Mrs. Malory uncovers the facts that add up to the shocking truth.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Cozy",
    "Fiction",
    "Mystery Thriller",
    "British Literature"
  ],
  "author": "Hazel Holt",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/2151247.Mrs_Malory"
}