{
  "title": "Same River, Twice: Putin's War on Women",
  "description": "Blending the journalistic rigor of Masha Gessen with the call to action of We Should All Be Feminists, a startling denunciation of Vladimir Putin’s war on women that reveals how modern Russia’s history of weaponizing sexual violence against women is part of the Russian leader’s strategy to retain political influence and domination.On March 22, 2023, the Swedish Academy organized a conference on threats to freedom of expression and democracy, featuring a roster of stellar speakers, including Arundhati Roy, Timothy Snyder, and Sofi Oksanen. Oksanen’s address—“Putin's War on Women”—generated such interest that the acclaimed Finnish writer used it as the basis for a larger, in-depth look at Putin’s threat to women. The result is Same River Twice, a devastating expose that builds on the themes and arguments introduced in Oksanen’s urgent and incisive speech.During the Soviet occupation of Estonia, Oksanen's great aunt was arrested and brutally interrogated—a terrifying experience that permanently traumatized her, leaving her silent for the rest of her life. Same River Twice uses this family story to illustrate the systematic crimes perpetrated by Russian soldiers and the Russian government for nearly a century. From the Russian military's entry into Berlin in 1945 to its modern invasion of Ukraine, Russia has continually employed violence against women when fighting its enemies—including using rape as instrument of war. But as Oksanen reveals, such violence has never before been used on such a widespread scale. Life for women in Putin's Russia is little better; gender equality is in decline, women are silenced by the legal system, and rape is used to humiliate victims, especially women in media.Oksanen's sober analysis exposes how, under Putin, genocide and misogyny are inextricably misogyny undergirds Russia’s international alliances, threatening the rights of women and minorities worldwide. As Oksanen ominously reminds us, “In Ukraine, sexual violence is an integral part of genocide. In domestic politics, misogyny is a tool used by the Kremlin to prevent women from rising to power. In international politics, it is a tool of Russian imperialism.”As the threats to democracy grow stronger around the globe, this powerful and timely book is a warning that must not be ignored.Translated from the Finnish by Owen F. Witesman",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Politics",
    "History",
    "Essays",
    "Ukraine",
    "Audiobook"
  ],
  "author": "Sofi Oksanen",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/215115126-same-river-twice"
}