{
  "title": "Devil's Dance",
  "description": "Lainey thought she had won. She survived the brutal and humiliating initiation and now she was riding with the notorious Devil's Due Motorcycle Club with her arms wrapped around the gorgeous and mysterious Cade Turner.But there are no fairy tale endings in the dark and dangerous world of the outlaw M.C.. Lainey very quickly finds herself plunged into the middle of conflicts both outside the club and within the ranks. Old truces are broken and old crimes are revisited on Lainey's road to meet the sadistic President of the whole club. Staying alive and staying by Cade's side will require a delicate dance. One misstep could be fatal.This is a dark, gritty and dangerously sexy sequel that takes the reader farther and deeper into the mysteries and dangers that surround the Devil's Due M.C. It contains scenes of violence and intense sexuality and is not intended for readers under the age of 18.The complete novel is now available! The Devil's The Novel is now on sale on Amazon! Get the whole saga for one low price!The Devil's Due Motorcycle Devil's DueDevil's DanceDevil's DoorDevil's DreamDevil's DayI brought my knees to my chest and hugged them close. Cade was still looking away from me but the rage had gone out of his stance. His shoulders hung and once again this proud, strong man looked defeated. The voice that rumbled back at me was gentle and resigned. \"That was just our chapter, Lacey-girl,\" he said softly, speaking my name for the very first time. \"Now you have to be approved by the president of our whole club.\"The way he said those last words made me shudder instinctively. \"Who's he?\"\"Moloch.\" He spat out the word like a curse.A small memory stirred in the back of my brain. It was a distant memory, from Cora and her Bible study classes. \"Like...like the demon?\"Cade nodded. \"We give him his due,\" he recited mechanically.The words of his tattoo were facing me, a bright, blaring warning right there in front of my face. And I was too blind to see them for what they were. They were a promise of danger and suffering. They were the price you pay for freedom.And true freedom comes from having nothing to lose. I couldn't go back. I wouldn't go back to Flint Springs and Darryl's trailer and a life of being beaten around by a miserable drunk. I wasn't going back. I was moving forward. If this was the path I was on, so be it. I squared my shoulders.\"What's he like?\"Cade turned at the new note in my voice. He looked at me searchingly. \"You're going through with this?\"\"I've got nothing else.\" My fingers touched the bruise on my cheek again. It wasn't nearly as painful now, more of a memory than a bruise. Like my old life, it was fading quickly.",
  "genres": [],
  "author": "Vivian Lux",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/21521484-devil-s-dance"
}