{
  "title": "The Orphan Conspiracies: 29 Conspiracy Theories from The Orphan Trilogy",
  "description": "The Orphan Conspiracies: 29 Conspiracy Theories from The Orphan Trilogy, written by novelists and filmmakers James Morcan & Lance Morcan with a foreword by leading scientist Dr. Takaaki Musha and an afterword by renowned historian Professor Richard Spence, contains hard-to-find knowledge. This non-fiction book is based on the political, scientific and financial insights in the Morcans' bestselling international thriller series The Orphan Trilogy (novels that merge fact with fiction by incorporating real-world theories on public figures and major organizations). Now the authors provide detailed analysis for each one of those controversial theories.In many ways, this exhaustively-researched work is the secret history of the 20th and 21st Centuries. But more than a history, it reveals what is happening right now behind the scenes - in underground bunkers, in the corridors of power, in prime banks and meetings of the world's elite.The Morcans connect the dots between many nefarious events in recent times and strip away the seemingly infinite classified layers of governments and intelligence agencies. Shockingly, they expose a splinter civilization operating in our midst that has at its disposal extraordinary suppressed technologies, unlimited resources and enormous black budgets - all inadvertently financed by everyday taxpayers.Garnering evidence from court cases, declassified government files and mainstream media reports, the authors disclose little-known facts on a wide range of topics. Diverse subjects such as mind control, eugenics, false flag operations, The Queen's hidden assets, secret prisons, The Catcher in the Rye enigma, political assassinations, medical cover-ups, genius learning techniques, Yamashita's Gold, the Jonestown mystery, Americanized Nazis, the bankrupting of Third World nations, underground bases, the US Federal Reserve, the New World Order, forbidden science, the War on Drugs, subliminal messages and even extraterrestrials.The criminals caught like deer in the headlights of these whistleblowing revelations include corrupt officials, racists, secret society members, warmongers, compromised journalists, economic hitmen, modern-day Doctor Frankensteins and mysterious individuals rumored to have wealth that would dwarf the net worth of Bill Gates and others on Forbes' so-called Rich Lists.Written from multiple perspectives; at times giving voice to conspiracy theorists; on other occasions siding with sceptics; vacillating between serious investigative writing and tongue-in-cheek, self-deprecating humor - The Orphan Conspiracies delivers a balanced exposé of some of the most important issues of our time.In their unflinching quest for truth and justice, the Morcans take no prisoners as they 'subpoena' the global elite - be they banksters, US Presidents, British Royals, Big Pharma, the Vatican, the FBI, the CIA, the Military Industrial Complex or the founders and CEO's of multinational corporations like Facebook, Shell, Google, BP and Microsoft. No suspicious individual or organization is granted immunity in this no-holds-barred trial conducted on behalf of The People.Go beyond rumors and conspiracy theories to documented facts and confirmed reality and find out just how deep the rabbit hole goes...",
  "genres": [
    "Nonfiction",
    "Conspiracy Theories",
    "Science",
    "History",
    "Politics",
    "Philosophy",
    "Social Justice"
  ],
  "author": "James Morcan",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/21521893-the-orphan-conspiracies"
}