{
  "title": "That Man 3",
  "description": "The steamy and suspenseful conclusion to the bestselling THAT MAN trilogy!Let’s cut to the chase. A sweet little Midwestern girl with a dimpled smile had shown me there was a connection between my cock and my heart. She was in my bloodstream bringing them together. Making me feel emotions and sensations I’d never felt with anyone.~The Kiss had changed everything. This painting had turned my heart upside down and torn me apart. I could no longer deny my feelings. I missed him for only one reason. I was in love.~Blake and Jennifer finally succumb to their passion and are unable to get enough of one another. A shocking discovery, however, threatens to pull them apart. And danger looms. Will the two of them survive an outside force that promises to bring their love to a cruel and tragic end ?AN EXCERPT: Blake is up to his shenanigans, but there's so much more!\"Blake! What are you doing here?” she gasped as I made my way to her bed after kicking shut the door and locking it.“What does it look like? I’m getting into bed with you,” I responded, squeezing into her tiny twin bed before she had a chance to notice my hard on. I snuggled next to her. Man, this bed was barely big enough for one person, let alone two.“You can’t sleep here! What if my parents come in?”“They won’t, and besides, I’ve locked the door.” “What if I still say no? Are you going to fuck me into submission?”My cock flexed and a cocky smile curled on my lips. “That’s Plan B.”Her eyes widened. “What’s Plan A?”One of my hands came up from under the cover. In it was a small gift box wrapped in hot pink paper and topped off with a small silver bow. I had kept it hidden behind my back when I’d crept into her room.“What’s that?”“It’s just a small Christmas present.”A combination of guilt and curiosity flickered in her green-as-a-Christmas-tree eyes. “You’re making me feel bad. I don’t have anything else to give you. I mean , I didn’t know—”I cut her off. “Don’t worry, you’ll be giving me what I wished for on Christmas shortly. Now, open it up.” “It’s from Gloria’s Secret,” she commented, noticing the famous GS logo on the paper. “Is it some sexy piece of lingerie?”While that would have been a fine gift too, one I would have bit off her sweet ass, this one was way more creative. And it was going to be way more fun.“No. Just open it.” She was making my cock twitch with anticipation. I watched as she carefully tore off the wrapping. She stared blankly at the package. “What is this, Blake?”“It’s a toy. You can’t have Christmas without getting a toy.”“My Secret Vibrating Egg?”“It’s a sex toy. You’re going to love playing with it. Open the package.”She fumbled getting the box opened. I think I already had her aroused.She lifted the sparkly little pink egg out of the carton and examined it.“I was almost going to get you a regular vibrator, but then I remembered how much you seemed to enjoy eggs when we had breakfast together at the beach.” “I do love eggs.” She smiled sheepishly, still studying the toy. “How do you use this?”My face lit up and my cock stirred. The fun was about to begin.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "Contemporary",
    "Adult",
    "Erotic Romance",
    "New Adult"
  ],
  "author": "Nelle L'Amour",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/21522865-that-man-3"
}