{
  "title": "The Firecracker King",
  "description": "THE SUMMER OF '65 WAS HOT...AND DEADLY. \"I LOVED IT! Richly atmospheric and haunting, this coming of age tale, set against a 1965 backdrop, investigates the murder of a beautiful teenage girl. A blazingly great new novel.\" - Caroline Leavitt - New York Times #1 bestselling author. \"A WICKED, MARVELOUS BOOK.\" - David Corbett, award-winning author of THE DEVIL'S REDHEAD, and DONE FOR A DIME \"Witty and gritty and paced like a rocket, Matt Bayan’s The Firecracker King is an utter gas to read. A kicker of a plot, wily characters deftly portrayed, a sneakily straightforward style that betrays a subtle, insightful mind—I was smiling with every turn of the page, when I wasn’t laughing out loud. Please excuse the all-too-obvious pun, but this book is an absolute blast. \"Matt Bayan understands a sneaky, subtle that the harshest realties always come salted with an earthy wit. My God, what a funny, jarring, gripping book. You will be laughing as you compulsively turn the pages, wondering; how can this man known so much? How can he convey it so wryly? How can he understand the human condition so unapologetically. What a wicked, marvelous book. What a treat for any serious reader.\" ----- --A.C. Crispin - New York Times bestselling author. (The STARBRIDGE Series, Star Wars - THE HAN SOLO TRILOGY; Pirates of the Caribbean - THE PRICE OF FREEDOM) \"Bayan's description of the firecracker slugfest out on the lake had me howling with laughter. Not many authors can say they've achieved that. The only thing I can compare the writing to (and it holds up very favorably) is Stephen King's THE BODY – the story that inspired the film STAND BY ME.\" ----------------------------------------------------------------- Set in 1965, The Firecracker King depicts a quiet lakeside neighborhood that is shocked by the brutal murder of a beautiful teenage girl. Jake’s idealism is battered by hatred and betrayal as he tries to survive in a dangerous adult world. Part mystery, part coming-of-age story, part thriller, THE FIRECRACKER KING builds its pace to a breakneck ending, yet along the way contains a full measure of humor and insight.",
  "genres": [
    "Mystery"
  ],
  "author": "Matthew Bayan",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/21524508-the-firecracker-king"
}