{
  "title": "Dragon Defenders of Destia: Six Book World Boxset",
  "description": "As dark magic threatens to engulf Destia, a young mage and an orphan may be the kingdom’s only hope… Eva Thirsk is no dragon rider, cleaning out the stable is as close as she’ll ever come. Perrell is a pack dragon who longs to fly into battle but is too small for combat. Courage burns in their hearts, but it seems destined to remain untested.Then the warlock Malcolm Venistrare escapes his magical prison, and everything changes.Eva finds herself imbued with powerful new magical abilities that transform her and Perrell into the dragon-riding team they’ve always dreamed of being. But within that power lies a dangerous secret about Eva’s bloodline.Will Destians support Eva’s battle against the warlock—or will the kingdom turn against her once the truth is revealed?Meanwhile, Winnie has always dreamt of being a mage. So when she’s chosen to travel with a delegation to the capital of Fantis, she seizes the chance to prove herself to the Fairspell Magic Academy. But Winnie’s determination soon plunges her into a mystery that threatens the kingdom’s magic.Imprisoned and tormented by a dark force's experiments, Winnie becomes bound to a fierce dragon named Kygo.But the experiment that binds them together makes Winnie’s newfound powers erratic and dangerous. And she’ll need every ounce of that power to face a treacherous enemy. With Kygo at her side, Winnie must unearth the secrets of a source of power strong enough to defeat the greatest magic.Can this unlikely pair harness their new abilities in time to save the kingdom?From Queen of the Dragons Ava Richardson comes the Dragon Defenders of Destia—two epic dragon-riding fantasy adventure trilogies. Fantasy readers will love this six-book boxset filled with dragons, magic, and determined heroines!",
  "genres": [],
  "author": "Ava Richardson",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/215268258-dragon-defenders-of-destia"
}