{
  "title": "What He Desires",
  "description": "Book 5 of the My Alpha Billionaire series.He blew into my life like a raging storm, upending everything. Violent and yet beautiful. Powerful. Massive. I wasn’t the type to cower or run. I faced his lust and fury head-on. I fought back. I resisted. I refused to submit to his demands, though my body ached to surrender.Little did I know that my strength would be my undoing.SAMPLEHe captured my arms, like he loved to do, and pinned them behind my back. Then he jerked me against him and glared down into my eyes.“Feel better?” he asked.“No.”He yanked me closer yet. Now, when he inhaled, I felt the rise of his chest. “Are you ready to talk?”Carnal need coiled around me, quiet but deadly, curling up from my legs, around my chest, my stomach, twisting in my center. “No.”“If you won’t talk then…” He smashed his mouth over mine.The air left my lungs in a sharp whoosh and I parted my lips to re-inflate them. Taking advantage of the opportunity, he pushed his tongue inside, filling my mouth with his decadent flavor. It stroked and tasted, even as I writhed against him, struggling to break free. Using my tongue as a defense, I tried to force him out, to break the kiss and end the torment. But he was so strong. I couldn’t win this battle. But I was determined, somehow, to win the war.Lips, tongue, teeth. He used them expertly, conquering my will. He didn’t just kiss. He possessed. Not just my mouth but my body and my mind. He banished all thoughts of resistance. Before I realized it, I was whimpering from the agony, kissing him back. My blood pounded through my body, burning between my legs. A throbbing ache was gathering deep inside. Never had I hurt so badly from a kiss. Never had I surrendered so quickly, so easily.He skimmed his free hand up my side, tracing the curve of my hip, the dip of my waist. His kiss, his touch…I craved more. I needed more. Even though I didn’t want to. Shallow little pants replaced long, even breaths as my suffering intensified. “Say it,” he whispered in my ear.His warm breath tickled. My skin dimpled, goose bumps burning my arm and chest.“Say what?” I asked.That hand moved around to my back, gliding down the arch of my spine and over the swell of my ass.I shuddered. God, how he possessed me.“Say it,” he demanded, this time his voice harder, sharper. He traced a line down the column of my neck with the tip of his tongue. I tingled. I quivered. I curled my fingers, weaving them together, clutching them behind my back.“Say what?” I repeated, this time on a moan.He leaned over me, hand sliding down between my trembling legs. My knees were wobbling. I couldn’t breathe. I wanted to crumple like a ragdoll. I wanted him to scoop me up, take me to the bed, and make the burning stop.“I…” I mumbled. Sharp teeth bit my neck and my knees gave out. A thick arm slid under them, scooping me up and then I was bouncing across the room, landing on the bed, sprawled, looking up into eyes so dark and dangerous my muscles locked in fear.His lip curled into a sneer. “I don’t want to want you like this. I tried to resist. But…dammit…” He shot an arm out, grabbing my hair, fisting it and jerking it, forcing my head back.I couldn’t move. I shut down. Shock. Fear. Need. I was so overwhelmed I couldn’t do anything but sit there waiting for his next move. My scalp burned, but I didn’t cry out. That pain was nothing compared to the agony pounding through the rest of my body.Pain so good.So, good but not enough. I wanted more. I needed more. A lot more.Oh, God. He’d succeeded. Without even realizing it.He’d created a new addict.I didn’t want to run from the darkness anymore. I wanted to relish in it. I wanted it to become a part of me.",
  "genres": [],
  "author": "Tawny Taylor",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/21531151-what-he-desires"
}