{
  "title": "Desolation Run",
  "description": "70-something Oreny \"Big\" Johnson has a problem. Actually, he has two. Or maybe three. The first is that he'll be dead from cancer, less than a year, which doesn't particularly concern him: \"Things I've been through, dying is just one more page in a long bad book.\" But spending his last living days, taking his last living breath, behind steel bars does. That's the second problem: Inmate #78903 in the notorious level-four Washington State prison known as Horseneck Bay.Then there's the money. Two million dollars of stolen military payroll, supposedly buried in some remote and mysterious south-Texas mountain range called Los Despoblados, or The Uninhabited, which sounds to Oreny like one of those places his Mama Maybell always told him to avoid. But he'll worry about that later. He has to get there first. Problem number three.That's when he brings those two smoldering dynamite sticks he's attached himself to--his Luke-boy and Jaime--on board to help his tired old body break out of Horseneck and go dig up that money and then hightail it across the border into Mexico. And when they do break out, and Luke decides to bring his girlfriend Lauren along, and her enraged ex comes after them, and then the manhunt starts multiplying faster around them than those cancer cells inside him, Oreny still thinks he can control them. The problems, that is. At least, until Cade arrives.Cade, the prison investigator Oreny knows is dangerous and unpredictable as a six-foot-two wolverine on eight gallons of adrenalin gone bad. And who won't stop until he catches them and does to them what Cade does best.Cade, Oreny knows better than anything else, is their biggest problem of all.\"Simultaneously brutal, bloody and beatific, this is crime fiction done right. A relentlessly paced, unpredictable page-turner powered by well-developed characters.\" Kirkus Reviews",
  "genres": [
    "Thriller",
    "Fiction",
    "Suspense",
    "Amazon",
    "Crime"
  ],
  "author": "James   Snyder",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/21529894-desolation-run"
}