{
  "title": "My Last Best Year: The Journal of Lilly Rose",
  "description": "To Whom it May Concern, This is a journal that I wrote for my own use and benefit. It covers the dates from May – August, 2012. I am now publishing it in the hope that it might help others like me. I have considered modifying the entries to make the events that transpired more clear when looked at chronologically but in the end I have decided that for the integrity of the document I will leave it as it was originally written. The only clarifications that I will make I will make here in the I am a witch and a necromancer. I hear voices. Most specifically the voices of the dead. I did not realize that this experience was unique to me until I was eighteen years of age. Your perspective of “normal” colors your perspective of the world and everyone and everything in it. Your normal is reflected in how you behave towards others and how you perceive their behavior towards you. My epiphany came when I met a man named Jack. He is the person who guided me to my true self and it is his love and support that has allowed me to begin this process of self-discovery and the discovery of those like me. Jack taught me to see my talents as a blessing instead of a curse. We are scattered but we are legion. It is imperative that we find one another. We are the witches, wizards, shifters, light and dark fae, majiks of all casts and colors. We are the lost clans and covens. Our histories have been destroyed and much of our learning lost but we are still here. I have found bits and pieces that if put with others may eventually lead to the rediscovery of the lore of our races. I know there are more of us out there. I am reaching out, find me, find each another. With each day that passes fewer and fewer of us survive and more is lost. Time is our greatest enemy. FIND ONE ANOTHER This journal records my path to the discovery of the source of my power. If you see yourself in this come find me, come find us. We will never stop looking. Sincerely, Lillian Rose Gardner, Witch, Necromancer, Archaeologist",
  "genres": [],
  "author": "Caroline Stuchlik",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/21529474-my-last-best-year"
}