{
  "title": "Unlocking the Social Potential in Autism",
  "description": "In her new book, Unlocking the Social Potential in Autism, Dr. Poirier shares her years of working with children with autism and similar cognitive disorders into an easy-to-follow road map explaining the likely causes of and treatment for autism. Her Developmental Curriculum comprises the second half of the book. While thorough, it is designed for ease-of-use by therapists and caregivers who work with autistic children on a daily basis. This book is written for ordinary people facing extraordinary challenges. Dr. Poirier has provided in simple, easy-to-comprehend language, an overview of child development, a descriptive explanation of how autism affects each developmental area, and guidelines for advancing a child’s functioning in all developmental domains. She outlines the diagnoses and treatments of autism, dispelling some pervasive myths along the way. While autism is not curable, you can suppress its worst symptoms, especially if you start early enough. The book features sample lessons from the Poirier Developmental curriculum, which begins with language, focusing specifically on semantics (the actual meanings of the words we say) before moving on to cognitive skills, play skills, and seven other functional concepts an autistic child must master to successfully take her place in society. Most lessons cover multiple subtopics and take a simple yet detailed approach to teaching each concept. The curriculum is carefully paced to accommodate the unique needs and attention span of the autistic child, with the ultimate goal of guiding her onto a social path that leads to full mainstream acceptance. The hope is that by adulthood, the autistic child will blossom into an individual who lives a fulfilling life, which includes typical, healthy friend and family relationships and a career. From the Back Cover“Where can I go for autism answers I can trust?” That is the question families ask when they are trying to get the straight story on autism. Very few people can answer autism questions with clarity, but Dr. Karina Poirier does a masterful job in her book, Unlocking the Social Potential in Autism. Dr. Karina Poirier wrote this book with parents and other caregivers in mind, to help you understand what autism is, where it comes from, how to treat it—and why it doesn’t have to mean a lifetime of loneliness for your child. Dr. Poirier describes in clear, everyday language how to help children with autism achieve their maximum potential, using evidence-based teaching and learning methods.",
  "genres": [
    "Autistic Spectrum Disorder",
    "Nonfiction"
  ],
  "author": "Karina Poirier",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/21527079-unlocking-the-social-potential-in-autism"
}