{
  "title": "The Fall of the Ottomans: The Great War in the Middle East",
  "description": "In 1914 the Ottoman Empire was depleted of men and resources after years of war against Balkan nationalist and Italian forces. But in the aftermath of the assassination in Sarajevo, the powers of Europe were sliding inexorably toward war, and not even the Middle East could escape the vast and enduring consequences of one of the most destructive conflicts in human history. The Great War spelled the end of the Ottomans, unleashing powerful forces that would forever change the face of the Middle East.In The Fall of the Ottomans, award-winning historian Eugene Rogan brings the First World War and its immediate aftermath in the Middle East to vivid life, uncovering the often ignored story of the region's crucial role in the conflict. Bolstered by German money, arms, and military advisors, the Ottomans took on the Russian, British, and French forces, and tried to provoke Jihad against the Allies in their Muslim colonies. Unlike the static killing fields of the Western Front, the war in the Middle East was fast-moving and unpredictable, with the Turks inflicting decisive defeats on the Entente in Gallipoli, Mesopotamia, and Gaza before the tide of battle turned in the Allies' favor. The great cities of Baghdad, Jerusalem, and, finally, Damascus fell to invading armies before the Ottomans agreed to an armistice in 1918.The postwar settlement led to the partition of Ottoman lands between the victorious powers, and laid the groundwork for the ongoing conflicts that continue to plague the modern Arab world. A sweeping narrative of battles and political intrigue from Gallipoli to Arabia, The Fall of the Ottomans is essential reading for anyone seeking to understand the Great War and the making of the modern Middle East.",
  "genres": [
    "History",
    "Nonfiction",
    "World War I",
    "War",
    "Politics",
    "Military History",
    "World History"
  ],
  "author": "Eugene Rogan",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/21535310-the-fall-of-the-ottomans"
}