{
  "title": "Writing on the Wall: Selected Prison Writings of Mumia Abu-Jamal",
  "description": "\"Revolutionary love, revolutionary memory and revolutionary analysis are at work in every page written by Mumia Abu-Jamal … His writings are a wake-up call. He is a voice from our prophetic tradition, speaking to us here, now, lovingly, urgently. Black man, old-school jazz man, freedom fighter, revolutionary—his presence, his voice, his words are the writing on the wall.\"— Cornel West , from the foreword From the first slave writings to contemporary hip hop, the canon of African American literature offers a powerful counter-narrative to dominant notions of American culture, history and politics. Resonant with voices of prophecy and resistance, the African American literary tradition runs deep with emancipatory currents that have had an indelible impact on the United States and the world. Mumia Abu-Jamal has been one of our most important contributors to this canon for decades, writing from the confines of the U.S. prison system to give voice to those most silenced by chronic racism, impoverishment and injustice. Writing on the Wall is a selection of more than 100 previously unpublished essays that deliver Mumia Abu-Jamal's essential perspectives on community, politics, power, and the possibilities of social change in the United States. From Rosa Parks to Edward Snowden, from the Trail of Tears to Ferguson, Missouri, Abu-Jamal addresses a sweeping range of contemporary and historical issues. Written mostly during his years of solitary confinement on Death Row, these essays are a testament to Abu-Jamal's often prescient insight, and his revolutionary perspective brims with hope, encouragement and profound faith in the possibility of redemption. \"Greatness meets us in this book, and not just in Mumia's personal courage and character. It's in the writing. This is art with political power, challenging institutional injustice in the U.S. while catalyzing our understanding, memory and solidarities for liberation and love. Writing on the Wall can set the nation aflame—yes, for creating new possible worlds.\"— Mark Lewis Taylor , Professor of Theology and Culture, Princeton Theological Seminary Mumia Abu-Jamal is an award-winning journalist and author of two best-selling books, Live From Death Row and Death Blossoms . Johanna Fernández is a Fulbright Scholar and Professor of History at Baruch College in New York City. Cornel West is a scholar, philosopher, activist and author of over a dozen books including his bestseller, Race Matters. He appears frequently in the media, and has appeared on Real Time with Bill Maher , The Colbert Report , CNN and C-Span as well as Tavis Smiley .",
  "genres": [
    "Nonfiction",
    "Race",
    "Social Justice",
    "Politics",
    "Essays",
    "History",
    "United States"
  ],
  "author": "Mumia Abu-Jamal",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/21535639-writing-on-the-wall"
}