{
  "title": "First Blush",
  "description": "This edition is no longer available.First Blush is the first book in the five book \"Suzy & Katie Series\" The book and the series are based on two central character, who as my might have already guessed are named Suzy and Katie. Both are professional business women in their mid thirties. One is married to a research scientist and the other is an open \"Out of the Closet\" lesbian. First Blush, as the title implies, begins with their first meeting, and continues forward as their friendship and relationship grows and deepens. While these books all contain a lesbian theme, I feel that they are first and foremost Romantic Love Stories, Filled with real life situations, passion, romance, adventure and pure fun. Whether you are Lesbian,Bi, or Straight, these books are filled with the love, emotions and day to day activities of professional and lovers. All five books of the series are written, and have been published as e-books, which are currently only available through one supplier. I plan on releasing the entire series through Smashwords, so that they can be downloaded in any format and through multiple outlets. Each book will be released through Smashwords as it's exclusive period ends. The other titles, in order, are: Growing Love, Surprises, Suzy & Kate, and A Piece of Heaven.' to 'A story of love and romance. First Blush is the first book in a five book series. The story, as well as the series, is centered around the title characters of the series Suzy and Katie. First Blush begins with the chance encounter of the Suzy and Katie, who are both in their mid thirties, at a local gallery opening. The story evolves, from an electrically charged first meeting, to a night of uninhibited sexual enjoyment, and into what rapidly becomes an affair of the heart for both. (Even though Suzy is married!)",
  "genres": [],
  "author": "D.D. Story",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/21534255-first-blush"
}