{
  "title": "The Occult, Witchcraft And The Devil's Feast In Old Mother Russia",
  "description": "THOSE INTERESTED IN THE WORKS OF MADAME BLAVATSKY AND NICHOLAS ROERICH, AS WELL AS T. LOBSANG RAMPA, WILL FIND THIS GREATLY EXPANDED UPDATED WORK TO BE A MOST REWARDING VENTURE INTO A FROZEN LAND OF MYSTERY AND INTRIGUE. TURN BACK THE PAGES OF TIME FOR A VISIT TO THE SHADOWS OF THE GLOOMY EAST -- A LAND THAT HAS JUST IN MODERN DECADES STARTED TO BRIGHTEN! UNHOLY SPIRITS IN THE GLOOMY EAST? DISCOVER THE MYSTERIOUS 'DARK SIDE OF OCCULTISM IN OLD RUSSIA The officially atheistic government of Russia tried its best to cover up such embarrassing transgressions against the State. They did not want to be associated with these throwbacks, with what they saw as primitive paganism. Rumors of executions and forced exile in Siberia kept interest to a minimum, yet accounts of devil worship and involvement with other Black Arts did not subside. In fact, they persisted and often grew in importance. . There was proof that the now unorthodox, but formerly \"traditional,\" schools of religion and occultism had been preserved and their prescriptions and \"superstitious\" practices, having endured through the centuries, were being handed down from generation to generation, though typically there was a great deal of secrecy associated with them. The Sorcerers were thought of as being older people who possessed the secret science of curing men and animals of diseases, of appeasing demons whenever they waxed into a great fury, of staunching blood, freeing insect-infested dwellings of vermin, de-haunting houses, tracking horse thieves, invoking the souls of the dead, foretelling the future and discovering hidden underground treasures. The Wizards, Witches, Shamans, and Hags were performing what seemed like \"miracles,\" and so a noted Polish-born scientist, activist and explorer, who had gained a reputation as a believer in reincarnation and cloistered underground cities like Agharta, went on a quest throughout Mother Russia to ascertain the truth about all matters involving the occult.",
  "genres": [
    "History",
    "Audiobook",
    "Nonfiction"
  ],
  "author": "Ferdynand Antoni Ossendowski",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/21536208-the-occult-witchcraft-and-the-devil-s-feast-in-old-mother-russia"
}