{
  "title": "King Charles III",
  "description": "\"The most spectacular, gripping and wickedly entertaining piece of lèse-majesté that British theatre has ever seen... blessed with wit, clarity and moments of deeper feeling. Outstanding and provocative... There is barely a moment when the fizz goes out of the writing and the narrative keeps springing surprises.... tremendous.\" - TelegraphMike Bartlett's provocative ‘future history play’ explores the people beneath the crowns, the unwritten rules of our democracy, and the conscience of Britain’s most famous family.Queen Elizabeth II is dead. After a lifetime of waiting, her son ascends the throne. A future of power. But how to rule? The play draws on the style and structure of a Shakespearean history play, with much of the dialogue written in blank verse, a comic subplot, and even the occasional appearance of a significant ghost.King Charles III premiered at the Almeida Theatre, London, in April 2014.\"Bold, brilliant and unstoppably entertaining... all the intrigue and forward momentum of a real history play. The grandeur too... King Charles III makes us care, makes us laugh, and no doubt will make us argue too. Theatre doesn’t get much better than this.\" - The Times\"A meaty, hilarious, dizzyingly audacious state of the nation political thriller... elevates the tawdriness of the Royal soap opera into something sublime and serious... a thrilling working through of ideas about modern Britain.\" - Time Out (London)\"Immensely enjoyable....convincingly plausible... remarkable and thought provoking.\" - What's On Stage\"Wonderfully original… Bartlett's brilliant text pulses with Shakespearean resonances… a right royal triumph.\" - The StageMike Barlett is an Olivier Award-winning playwright whose plays have been seen at theatres including the National Theatre, Royal Court Theatre, Bush Theatre and Sheffield Theatres in the UK, and off-Broadway in New York.",
  "genres": [
    "Plays",
    "Drama",
    "Theatre",
    "Fiction",
    "21st Century",
    "British Literature",
    "School"
  ],
  "author": "Mike Bartlett",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/21535463-king-charles-iii"
}