{
  "title": "A War of Shadows",
  "description": "“One of the finest memoirs of behind-the-lines work during the Second World War. Honest, powerful, and authentic.”—Dr. Roderick Bailey, SOE author and historian A War of Shadows is W. Stanley Moss’s sequel to his classic Ill Met by Moonlight . A former British operative who, along with Patrick Leigh Fermor, once kidnapped a Nazi general (as told in Ill Met), Moss offers this rousing account of his World War II adventures as an agent in Crete, Macedonia, and the Siamese jungle—rife with ambushes, double-dealing, and back-door missions. “Billy Moss was one of those daring adventurers, the like of which we no longer see. This book, reissued after 52 years, tells of his further exploits in Crete, Macedonia, and Siam—the story of a man of initiative and great courage.”—Hugo Vickers, author and historian “The romance and adventure of resistance operations, with splendid companions, the spates of violence and maddening hitches to plans presumably perfected, the nuances of bravery, courage, heroism—and fear—again this is one of the most personally descriptive reportings of one phase of the past war.”— Kirkus Reviews Praise for Ill Met by Moonlight : “The remarkable story of how [Moss] and a fellow British commando [Patrick Leigh Fermor] infiltrated a Nazi stronghold in Crete, kidnapped a German general, and spirited him back to Egypt. Though based on fact, this could rival any best-selling espionage novel.”— Library Journal “This amazing story is marvelously well told, in an exuberant, racing style that makes it impossible to lay the book aside once the first page is read.”— San Francisco Chronicle W. Stanley Moss was a World War II hero and later a best-selling author. He traveled extensively after the war, notably to Antarctica with a British Antarctic Expedition. Eventually he settled in Kingston, Jamaica.",
  "genres": [
    "Nonfiction",
    "War",
    "History",
    "Memoir",
    "World War II"
  ],
  "author": "W. Stanley Moss",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/21535346-a-war-of-shadows"
}