{
  "title": "Rocks: My Life In and Out of Aerosmith",
  "description": "In the tradition of the mega-bestseller Life by Keith Richards, Aerosmith’s Joe Perry opens up for the first time about the wild, inside story of his life in the legendary band he cofounded in 1970—which is still going strong today.In Rocks, Joe Perry exposes his unrepentant, unbridled life as the lead guitarist of Aerosmith. He delves deep into his volatile, profound, and enduring relationship with singer Steve Tyler and reveals the real people behind the larger-than-life rock-gods on stage. The nearly five-decade saga of Aerosmith is epic, at once a study in brotherhood and solitude that plays out on the killing fields of rock and roll.With record-making hits and colossal album sales, Aerosmith has earned their place in the Rock and Roll Hall of Fame. But theirs is ultimately a story of endurance, and it starts almost half a century ago with young Perry, the rebel whose loving parents wanted him to assimilate, but who quits school because he doesn’t want to cut his hair. He meets Tyler in a restaurant in New Hampshire, sways him from pop music to rock-and-roll, and it doesn’t take long for the “Toxic Twins” to skyrocket into a world of fame and utter excess. From the mega-successful song and music video with Run DMC, “Walk This Way,” to the realization that he can’t pay his room service bill, Perry takes a personal look into the human stories behind Aerosmith, the people who enabled them, the ones who controlled them, and the ones who changed them. In his own words, Rocks is the whole story: “the loner’s story, the band’s story, the recovery story, the cult story, the love story, the success story, the failure story, the rebirth story, the re-destruction story, the post-destructive rebirth story.”Foreward by Johnny Depp.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Biography Memoir",
    "Rock N Roll"
  ],
  "author": "Joe  Perry",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/21535769-rocks"
}