{
  "title": "Confessions from the Massage Couch: A Massage Therapist's Musings on the Meaning of Life",
  "description": "Spirit and Destiny \"(...) spills the beans on a variety of topics, including what a massage therapist really thinks of you as she kneads your knotty tissue. There's even a chapter on what happens if there's the odd embarrassing moment, so you may find yourself giggling or wincing - probably both. A great read.\"    \"This was a thought provoking page turner. Great stuff Paola! My first time reading a memoir but certainly not my last! PURE GENIUS I SAY GENIUS!!\" Jenny, Goodreads  AMAZON \"is spot on\" \"interesting and enjoyable\" \"a lot of insight into the human condition\" \"packed with information\" \"enlightening moments on alternative therapy\"  Hear Paola Bassanese read Confessions from the Massage Couch  What's the meaning of life? The intimacy and comfort of the massage room brings out amazing insights. This book is a collection of thoughts from conversations between a massage therapist and her clients.  A NOTE FROM THE AUTHOR PAOLA  The massage therapy room is a strictly titillation-free zone. The confessions in this book are meant to help the reader gain insight into the meaning of life.  There's plenty of navel-gazing in this book – from the physical to the metaphysical.  I have condensed 10 years' worth of experience as a therapist into this book which covers all major life events that can happen to any of us, while referencing to various resources in the field of philosophy, alternative therapies and general health.   Sometimes I wonder how many times the average person will ask herself what the meaning of life is and what is her life's mission. Are we really so busy that we have stopped asking this question? Or, even if we did seek ways of living a more meaningful life, did we just give up at the first hurdle?  Only because a question is difficult does that mean that is it impossible to answer it?  This book has been completely revised in August 2014",
  "genres": [],
  "author": "Paola Bassanese",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/21537790-confessions-from-the-massage-couch"
}