{
  "title": "Inga's Zigzags",
  "description": "\"In this well-written debut novel... Miller engagingly presents a heroine caught between contradictions: New York and Moscow; flashy glamour and self-pitying nostalgia; certainty and doubt. A sexy tale with plenty of Russian atmosphere..\"-- Kirkus Reviews\"A thrilling ride that zigzags right to your heart.\" -- Lara Vapnyar, Author of The Scent of PineInga's Zigzags is the story of a 28-year-old Russian woman who, after a decade in New York, returns to post-perestroika Moscow to start her own business. When her prospects fall through and she finds herself far from the heart of the action, she meets Emma and Alexandra, a pair of wealthy and well-connected magazine publishers, who lure Inga into their bed and then propose to launch a company together. When the threesome starts to fall apart, Inga is forced to make some difficult choices to find her way through the labyrinth of Moscow's intrigues and heartbreaks, to reclaim her destiny. The book is about evolving, finding one's place in life, about a yearning to belong and feel accepted. Inga Belova is a New Yorker who has an MBA but feels misplaced. She is a double single - as in, divorced with no boyfriend - but then she finds double love. Yet she continues to feel in between - countries, jobs, lovers. She questions her sexuality, national identity, career and loyalty. Will she ever settle? Whom does she love? What is her life's calling? To find the answers, we follow her from New York to Moscow to St. Petersburg to Miami to London and then to Moscow again. \"Tradition demands that heroines in Russian literature fare poorly. Tolstoy's Karenina jumps in front of a train; Karamzin's Poor Liza drowns herself in a pond, Pasternak's Lara dies in the Gulag. In Inga's Zigzags, Vica Miller's saucy first novel, that tradition may have met its match. Meet Inga Belova, love child of Perestroika, Glasnost, and the global economy, whose vocational ambitions are exceeded only by her appetite for sex. Inga doesn't throw herself in front of trains; she is the train.\" - Peter Selgin, author of Drowning Lessons, winner of the 2007 Flannery O'Connor Award for Fiction",
  "genres": [
    "Adult",
    "Fiction"
  ],
  "author": "Vica Miller",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/21539249-inga-s-zigzags"
}