{
  "title": "Un-Agoraphobic: Overcome Anxiety, Panic Attacks, and Agoraphobia for Good",
  "description": "“Mathew not only delivers assurance to those suffering from panic attacks and agoraphobia but provides a way through difficult situations.\" ― Deborah Bigelow ,  Library Journal  Hal Mathew knows what it’s like to suffer from phobias. For 30 years of his life, he could not leave his home without his phobias overwhelming him. But now, he’s sharing with us how he took control of his thinking, found stress and anxiety relief, and overcame his phobias. You are not alone.  The National Institute of Mental Health estimates that nearly 1.5% of the U.S. population suffers from agoraphobia at some point in their lifetime. That's 4.5 million people. No matter how alone your phobias may make you feel, there are others out there who understand and who can help. Hal Mathew is one such individual. After three decades of fearing fear, Mathew pieced together a plan for overcoming anxiety and his phobias and resuming a regular life. And it worked. Retrain your brain, reset your life.  Recent neuroscience research shows us that the brain is retrainable―at any age. With this information in mind, Mathew reveals a new way of thinking that allows those who suffer from phobias to take control of their lives. His self-designed phobia treatment, based on neuroscience research, freed him―and he knows it can do the same for others. Mathew guides you through writing practices, visualization techniques, even cooking and eating routines to help you feel anchored and safe and ready to take your first trips out of the house. Open up Un-Agoraphobic and Readers of  Dare ,  The Anxiety and Phobia Workbook , The Agoraphobia Workbook , or  Badass Ways to End Anxiety & Stop Panic Attacks!  will benefit from  Un-Agoraphobic  by Hal Mathew.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Mental Health",
    "Health",
    "Audiobook"
  ],
  "author": "Hal Mathew",
  "average_rating": "3.04",
  "url": "https://www.goodreads.com/book/show/21543949-un-agoraphobic"
}