{
  "title": "Red Dust",
  "description": "Red Dust follows Gillian Slovo's remarkable memoir Every Secret Thing. The novel tells the story of what happens to Smitsrivier, a small town in the Karroo when the Truth and Reconciliation Commission comes to visit. Sarah Barcant, a successful prosecutor now living in New York is summoned back to help her former mentor discover what happened to a young black activist, Steve Sizela. Steve's comrade, Alex Mpondo, will give testimony against a crony of the policeman suspected in the matter of Steve's disappearance and it is hoped that this will provide an opportunity to break the case. Slovo tracks the changes in South African political power dynamics adroitly. Here is an encounter between the former torturer now in the dock and his victim: Not just any man, Alex Mpondo. Alex who was smart in a black suit and a flash yellow shirt that looked like it might have been sewn from silk ... The changes covered every aspect of the man. He seemed taller, more confident, more at ease and even slightly fatter ... Dirk shook himself. Prison must be making him stupid. What else had he expected? Mpondo was no longer a prisoner. He was an MP. No wonder he looked different.  While the moral universe of the novel is a complex one--the double-crossings and uncertainties allow Red Dust to read like a thriller, and no-one gets off lightly--the characters themselves feel somewhat schematic. We have also met them all before in more compelling guises. James Sizela, the missing Steve's father is something straight out of Alan Paton's Cry the Beloved Country. Pieter Muller, the murderous policeman, is a loving husband and an upright family man. While Red Dust is a rollicking good read, perhaps it moves a little too fast, risking becoming Truth and Reconciliation lite in the process. --Neville Hoad",
  "genres": [
    "Fiction",
    "South Africa",
    "Africa",
    "Historical Fiction",
    "Contemporary",
    "School",
    "Mystery"
  ],
  "author": "Gillian Slovo",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/2154304.Red_Dust"
}