{
  "title": "What Women Want: An Agenda for the Women's Movement",
  "description": "American women fare worse than men on virtually every major dimension of social status, financial well-being, and physical safety. Sexual violence remains common, and reproductive rights are by no means secure. Women assume disproportionate burdens in the home and pay a heavy price in the workplace. Yet these issues are not political priorities, and worse, there is a lack of consensus that there still is a serious problem, or at least one that women have any reason or capacity to address. This \"no problem\" problem helps explain why women fail to mobilize around issues that materially affect the quality of their lives. Why is this, why does it matter, and how can we best respond? What Women Want focuses on the policy agenda for women. Deborah L. Rhode, one of the nation's leading scholars on women and law, brings to the discussion a broad array of interdisciplinary research as well as interviews with heads of leading women's organizations. Is the women's movement stalled? What are the major obstacles it confronts? What are its key priorities and what strategies might advance them? In addressing those questions, the book explores virtually all of the major policy issues confronting women. Topics include employment and appearance discrimination, the gender gap in pay and leadership opportunities, work/family policies, childcare, divorce, same-sex marriage, sexual harassment, domestic violence, rape, trafficking, abortion, poverty, and political representation. Discussion focuses on the capacities and limits of law as a strategy for social change. Why, despite four decades of enforcement of equal employment legislation, is women's workplace status so far from equal? Why, despite a quarter century's effort at reforming rape law, is America's rate of reported rape the second highest in the developed world? Part of the problem lies in the absence of political mobilization around such issues and the underrepresentation of women in public office. In an age where many women are reluctant to identify as feminists, the \"war on women\" is a potent political weapon, and Lean In tops the bestseller list, a broad-ranging, expert look at where American women are today is more necessary than ever. This path-breaking book explores how women can and should act on what they want.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Philosophy",
    "Womens"
  ],
  "author": "Deborah L. Rhode",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/21538036-what-women-want"
}