{
  "title": "Transylvanian Moonrise",
  "description": "This is the Bulgarian edition of the book \"Transylvanian Moonrise: A Secret Initiation in the Mysterious Land of the Gods” English title: \"Initiation in the Mysterious Land of the Gods: 12 Days in the Thickets of Alchemy and Tibetan Mysticism.\"В ръцете си държите книга, разказваща ни истински събития. Тя не е роман и е пряко продължение на „Подземните тайни на румънския сфинкс: из окултните архиви на Департамент Нула“ от същия автор, в която се разкрива съществуването на подземен археологически комплекс с извънземен произход на територията на Румъния. Интригата зад това е комплексна, поради многоаспектната история, която предхожда тези събития.През август 2003 г., американски и румънски военни части, намиращи се в загадъчен и безпрецедентен съюз, провеждат експедиция в недрата на т. нар. „румънски сфинкс“ в планините Бучеджи, където откриват най-голямата археологическа находка на всички времена: мистериозна зала на около 50 000 години, с холографска технология, надхвърляща и най-смелите мечти на човека.Въпреки политическите и окултни интриги, вълненията и ограничения достъп до това велико откритие, водачът на експедицията позволил на Раду Чинамар да посети и проучи тези артефакти. Породена от тези събития се ражда и вече споменатата първа книга на автора, в която хронологията на горните събития е представена в детайли. Оттогава насам, животът на Раду се превръща в сложен лабиринт от необичайни обстоятелства и загадъчни взаимоотношения с необикновени хора.В тази втора част нашият герой разказва за 12 дни от живота си, в които той преживява неща отвъд всяко въображение. Озовавайки се в Тибет чрез междупространствен портал, през който преминава с помощта на загадъчен лама, Раду е на път да преживее среща, надминаваща рамките на този свят, която ще го промени завинаги. Обстоятелствата, предшестващи това пътуване, са не по-малко мистериозни и са свързани с тайнствен алхимик, чийто предци живeели в продължение на векове, практикувайки тайната традиция на „Великото дело“, която удължава живота за неопределено време, докато човек успее да се самоосъществи отвъд ограниченията на физическата реалност.Необикновените приключения на Раду Чинамар разширяват представата ни за онова, което е възможно, а следговорът към изданието продължава да изследва множеството смислови нишки, от които е изплетен този сложен гоблен, запазвайки по този начин традициите от първата част на книгата. Това е издание, което може да ви асистира по безценен начин в преосмислянето на всичко, свързано със света на окултното.(Предговора към книгата можете да прочетете безплатно тук: http://parallelreality-bg.com/images/....)(taken from the official website of the publisher: http://shop.parallelreality-bg.com/?1...)",
  "genres": [
    "Science Fiction"
  ],
  "author": "Radu Cinamar",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/11245805-transylvanian-moonrise"
}