{
  "title": "The Rani of Jhansi: Gender, History, and Fable in India",
  "description": "Rani Lakshmi Bai is an iconic figure of the nationalist movement in India. Her fight against the imperialist power has a significant place in the cultural and feminist history of South Asia. She is considered not only a heroine, and a great warrior, but also a protector of her people in Jhansi. Her pictures on horseback, with her son tied to her back and a sword in one hand, represent her as an embodiment of feminine power or Shakti. This book uses fictional, cinematic and popular representations of the Rani to analyze the convergence of colonial and postcolonial literary, historical, sexual and cultural imperatives in the figure of this legendary woman. This book also extends the discussion to what constitutes the gendered subaltern historical archive. By analyzing a range of literary and cinematic texts produced between 1857 and 2007, it tries to understand the various agendas that are at stake in the use of the Rani as a figure of nationalist Indian history and imperial British narrative. There is also an attempt to compare representations of the Rani in both these contexts. EndorsementsThe author brilliantly reveals how the rule of colonial and postcolonial difference forecloses the possibility of archival or historical ‘settling’ of the figure of the Indian woman. This is an essential reading for anyone interested in the ‘woman question’, one that resonates in both historical and contemporary debates of representation and politics. — Inderpal Grewal, Yale UniversitySingh provides a compelling genealogy of production under colonial conditions that works its way through an impressive array of archives and genres from the aesthetic experiments of both British and Indian cultural producers, to the more recuperative cultural efforts of postcolonial feminists and/or historians. — Anjali Arondekar, University of California, Santa CruzIt is one of the first works in the arena of South Asian Studies to provide a feminist account of a rebellion against empire; a theme totally unique and much needed in explicating India’s complex relationship to Britain. Moreover, the author’s intellectual gambit of bypassing numerous routine, historico-political accounts that are regurgitated to bolster colonial and/or postcolonial theses is noteworthy. — Gita Rajan, Fairfield UniversityIt is a rebellious book, in its own way. Eschewing the ‘historical’ Rani of Jhansi, in favor of the Rani of literature, fable, folk history, film, and rumor, Singh undertakes an extraordinary engagement with this pivotal figure of the politics and aesthetics of the ‘colonial encounter.’ The book takes as central motifs the sexual configurations of ‘India’ through the metaphor of the Rani. —Christian Lee Novetzke, University of Washington",
  "genres": [
    "History",
    "Nonfiction",
    "India",
    "Feminism"
  ],
  "author": "Harleen Singh",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/21552079-the-rani-of-jhansi"
}