{
  "title": "The Book of Lies: A Novel",
  "description": "Bright, ambitious, and handsome, Ross Ohrenstedt is a high flier in the fashionable field of queer studies. He has just taken a prestigious university position in Los Angeles and has been appointed to oversee the collection of papers and works of a leading light of the gay literary salon known as the Purple Circle. Ross stumbles across a \"lost\" work by an unknown author and his quest to identify the mystery writer and achieve the glory of scholastic tenure unveils increasingly bizarre and unbalanced facts about a group of writers who in the 1970s and 1980s broke new ground in the creation of a gay literary sensibility. But the dark truth contained within The Book of Lies is even more startling. With biting wit and a lush sense of place and character, Felice Picano's daring novel is at once a stylish mystery, a comical roman à clef, and a wicked send-up of the new Ivory Tower.\"Leave it to Felice Picano to add a walloping dose of melodrama and intrigue to a tale already redrawing genre boundaries...What Picano does is take an academic mystery (subject matter that might have proved tedious or solipsistic in lesser hands) and morphs it into something new--a page-turning, often campy, occasionally serious critique of academia and historical truth, literary celebrity, and the imminent future of America.\"- Philadelphia TribuneFelice Picano is the author of 19 books including the best-selling novels Like People In History, Looking Glass Lives, The Lure and Eyes as well as the literary memoirs Ambidextrous, Men Who Loved Me, and A House On the Ocean, A House On the Bay. He is also the author with Dr. Charles Silverstein of The New Joy of Gay Sex. A native of New York, Felice Picano now lives in Los Angeles.",
  "genres": [
    "Gay",
    "LGBT",
    "Mystery",
    "Fiction",
    "Queer",
    "Contemporary",
    "Gay Fiction"
  ],
  "author": "Felice Picano",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/215461.The_Book_of_Lies"
}