{
  "title": "The Amoeba in the Room: Lives of the Microbes",
  "description": "A cup of seawater contains 100 million cells, which are preyed upon by billions of viruses. Fifty million tons of fungal spores are released into the atmosphere every year. And the human gut is home to somewhere between 500 and 1,000 species of bacteria. The more we learn about microbial biodiversity, the clearer it becomes that the vast majority of life has long gone unseen, and unobserved. The flowering of microbial science is revolutionizing biology and medicine in ways unimagined only a few years ago, and is inspiring a new view of what it means to be alive.In The Amoeba in the Room, Nicholas Money explores the extraordinary breadth of the microbial world and the vast swathes of biological diversity that can be detected only using molecular methods. Although biologists have achieved a remarkable level of understanding about the way multicellular organisms operate, Money shows that most people continue to ignore the fact that most of life isn't classified as either plant or animal. Significant discoveries about the composition of the biosphere are making it clear that the sciences have failed to comprehend the full spectrum of life on earth, which is far more diverse than previously imagined. Money's engaging work considers this diversity in all its forms, exploring environments from the backyard pond to the ocean floor to the \"mobile ecosystem\" of our own bodies. A revitalized vision of life emerges from Money's lively narrative of the lowly, one in which we are challenged to reconsider our existence in proper relationship to the single-celled protists, bacteria, and viruses that constitute most of life on earth. Proposing a radical reformulation of biology education and research in the life sciences, The Amoeba in the Room is a compelling romp through the least visible and yet most prodigiously magnificent aspects of life on earth.",
  "genres": [
    "Science",
    "Biology",
    "Nonfiction",
    "Nature"
  ],
  "author": "Nicholas P. Money",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/21546131-the-amoeba-in-the-room"
}