{
  "title": "Veiled Warriors: Allied Nurses of the First World War",
  "description": "Caring for the wounded of the First World War was tough and challenging work, demanding extensive knowledge, technical skill, and high levels of commitment.Although allied nurses were admired in their own time for their altruism and courage, their image was distorted by the lens of popular mythology. They came to be seen as self-sacrificing heroines, romantic foils to the male combatant and doctors' handmaidens, rather than being appreciated as trained professionals performing significant work in their own right.Christine Hallett challenges these myths to reveal the true story of allied nursing in the First World War - one which is both more complex and more absorbing. Drawing upon evidence from archives across the world, Veiled Warriors offers a compelling account of nurses' wartime experiences and a clear appraisal of their work and its contribution to the allied cause between 1914 and 1918, on both the Western and the Eastern Fronts.Nurses believed they were involved in a multi-layered battle. Primarily, they were fighting for the lives of their patients on the 'second battlefield' of casualty clearing stations, transports, and military hospitals. Beyond this, they were an integral component of the allied military machine, putting their own lives at risk in field hospitals close to the front lines, on board hospital ships vulnerable to enemy submarine attack, and in base hospitals subject to heavy bombardment.As working women in a sometimes hostile, chauvinistic world, allied nurses were also fighting to gain recognition for their profession and political rights for their sex. For them, military nursing might help to win not only the war itself, but also a more powerful voice for women in the post-war world.",
  "genres": [
    "History",
    "Nonfiction",
    "World War I",
    "Womens",
    "War"
  ],
  "author": "Christine E. Hallett",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/21548148-veiled-warriors"
}