{
  "title": "Tei, A Memoir of the End of War and Beginning of Peace",
  "description": "Shortly after WWII, in a nation still in ruins, Tei Fujiwara wrote her memoir Nagareru Hoshiwa Ikiteiru (Shooting Stars Are Alive) about her harrowing journey through North and South Korea with her three young children. Tei’s riveting story resonated with millions of her countrymen who faced an unknown future. Today her memoir can provide insight into the plight of refugees everywhere.Tei’s story begins in August 1945 in Manchuria. The Soviet Union has declared war on Japan a few days after the United States dropped the atomic bomb on Hiroshima and Nagasaki. Tei, her husband and her children flee from the invading Soviets into North Korea, but the Soviets take her husband, along with all the able-bodied Japanese men to work in the gulag, forced labor camps in Siberia. Tei’s small group of women and children must rely on each other to survive the harsh winter, starvation and the long journey home. In a race against time, Tei knows she and her children must cross the 38th Parallel before it closes and traps them behind the Iron Curtain.The family endure terrible hardship but manage to be saved by the US-run refugee camps in South Korea. After Tei and her children made it back to her hometown in Japan, she wrote what she thought would be her last testament for her children. But she survived and her memoir was published in 1949. Since then, Tei’s story has been reprinted at least forty-six times in Japan and has been retold as a movie and a television drama. Empress Michiko urged her subjects to read Tei’s memoir to understand the Japanese war experience. Tei Fujiwara was born in Japan in 1918 and moved to Manchuria in 1943 to join her husband who worked for the Shinkyo Meteorological Observatory. After her memoir became a bestseller, her husband also began writing, using the pen name, Jiro Nitta. Her son, Masahiko Fujiwara also wrote several books. publishing “An Introduction to the World’s Most Elegant Mathematics” with the writer Yoko Ogawa in 2006. Tei Fujiwara passed away November 15, 2016 and is survived by her children and grandchildren.Print and audiobook editions are also available through Amazon.",
  "genres": [
    "Japan",
    "Memoir",
    "History",
    "Nonfiction",
    "War",
    "Japanese Literature",
    "Asia"
  ],
  "author": "Tei Fujiwara",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/21568649-tei-a-memoir-of-the-end-of-war-and-beginning-of-peace"
}