{
  "title": "Sinfully Supernatural",
  "description": "On sale for the low price of .99 for a limited time!Eight tales with supernatural lust, love, and happily ever after from some of today's bestselling authors.Including stories from:New York Times and USA Today Bestselling author Sharon Hamilton:\nHeavenly Lover\n - Claire, an unconventional Guardian angel, sent to save a sexy Brazilian-born painter from killing himself discovers a powerful dark angel has preyed upon Daniel. She is in danger of losing her own when attraction to her handsome charge blooms into a forbidden love.USA Today Bestselling author Melissa Schroeder:\nCallum: The Cursed Clan\n - His duty to the Clan was all that mattered until he fell for the one woman who could expose their secret.Brandy Walker: \nCraving More: Tiger Nip\n - A late night tryst finds two tigers discovering their mates and two humans stunned. Add a brother, a best friend, a crazy ex-girlfriend, and you have a recipe for disaster.Buffy Christopher: \nThe Mating Moon\n - Ivy Landry fights a mystery attacker and tries to find a mate before the full moon. Can she find him and fight for her life at the same time?Crystal-Rain Love: \nMoonlit Dream\n - Ming's true love is brought to her with a little magical help, but before they can reach their happily ever after, they must outrun the bloodthirsty wolf pack on their heels.Christle Gray: \nForever, My Love\n - With a visit from her dead husband, Eric, Darcy Abrams is sure she’s losing her mind. Or will Eric’s promise of forever turn her entire world inside out instead?Heather Long: \nMarshal of Hel Dorado (Fevered Hearts)\n - Sam Kane is the oldest brother, the steadfast son and the confident marshal. He's never met a problem too hot to handle until he caught Scarlett robbing the town’s bank.Saranna DeWylde: \nHow to Lose A Familiar in 10 Days\n - Hemlock Butterbean's familiar from hell isn't really a cat at all, but a warlock under a curse. When her fantasies make him flesh, she finds out just how familiar he can be.",
  "genres": [],
  "author": "Melissa Schroeder",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/21567711-sinfully-supernatural"
}