{
  "title": "In Search of Lost Frogs: The Quest to Find the World's Rarest Amphibians",
  "description": "A magnificent record of the global hunt for \"lost\" frog species.Dr. Robin Moore has a passion for frogs and a fascination with finding new and \"lost\" species. In 2010, he spearheaded the worldwide \"Search for Lost Frogs\" campaign, which coordinated the efforts of 33 teams of scientists in 19 countries on five continents in a quest to find 100 species of amphibian not seen in over a decade.\"In Search of Lost Frogs\" is a stunning record of Moore's journey and what he and his team did (or did not) find. The book is overflowing with exquisite close-up photographs by Moore that display the frogs' remarkable coloring and camouflage, and reveal their diminutive size -- many of the frogs are less than 5 cm long, if that. Moore's engaging text tells the story of the expedition, its highs and lows, discoveries and failures, and the campaign's ongoing work.The book's first half covers what frogs do for the health of the planet, the slippery slope of extinction, what is being done to monitor frog populations and find lost species, the Lazarus project (which aims to \"revive\" lost species) and the author's career-long resolve to find the Mesopotamia Beaked Toad.The second half of the book is about the searches. Moore describes the struggles, victories and dangers as well as the science. He takes readers along as his team trudge through rainforest, climb mountains and paddle rivers in search of the lost frogs, some not seen for more than a century. He tells a story of perseverance, disappointment, rediscovery, resilience, but ultimately of hope, written with passion and illustrated with superb photographs. And a surprise ending: they found 15 lost frogs.They include: In Ecuador, the Rio Pescado Stubfoot Toad, not seen since 1995 In Haiti, six rediscoveries, including the Ventriloquial Frog and Mozart's Frog, both lost for 20 years In India, the Dehradun Stream Frog, last seen (and only once) in 1985; the Elegant Tree Frog (1937); the Chalazodes Bubble Nest Frog (1874); the Anamalai Dot-Frog (1938) In Democratic Republic of Congo, the Omaniundu Reed Frog (1979) In Ivory Coast, the Mount Nimba Reed Frog (1967).Naturalists, lovers of all things frog, schools and interested general readers will enjoy the stunning photographs, the science and the adventurous stories of discovery.",
  "genres": [
    "Nonfiction",
    "Nature",
    "Science",
    "Animals",
    "Biology",
    "Natural History",
    "Adventure"
  ],
  "author": "Robin  Moore",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/21563969-in-search-of-lost-frogs"
}