{
  "title": "Love and Shock: Perkawinan Antar Bangsa",
  "description": "Menikah dengan orang asing masih dipandang sebagai hal yang negatif oleh sebagian besar anggota masyarakat Indonesia. Belum ada informasi yang cukup membahas masalah dalam perkawinan antarbangsa mendorong penulis untuk menulis buku ini. Seperti pernikahan pada umumnya, perempuan Indonesia yang menikah dengan WNA pun menemui beberapa masalah dan konflik dalam kehidupan perkawinannya. Apalagi dengan adanya perbedaan kebudayaan yang melatarbelakangi kehidupan sehari-hari. Melalui buku ini pula, penulis berusaha membagi cerita mengenai suka dan duka kehidupan pernikahan dari enam perempuan Indonesia pelaku perkawinan campur (mixed marriage) yang memiliki latar belakang pendidikan dan karir yang memadai.Di bab pertama, penulis membahas mengenai definisi, kelebihan serta kekurangan dari perkawinan campur. Selain itu, bab ini juga membahas tentang beberapa faktor yang perlu diperhatikan sebelum menikah dengan WNA dan juga beberapa tips untuk mendapatkan lelaki WNA yang sesuai dengan kondisi dan keinginan. Sub bab yang juga penting adalah mengenai ragam permasalahan umum yang sering dihadapi para perempuan pelaku perkawinan campur. Salah satunya adalah topik yang berhubungan dengan sistem perundang-undangan yang berlaku di Indonesia terkait imigrasi dan status anak hasil perkawinan campur.Di dalam bab kedua, pembahasan lebih difokuskan kepada kejutan budaya yang dihadapi oleh para pelaku perkawinan campur. Di sini, penulis menggunakan beberapa teori dari sisi ilmu antropologi dan sosiologi. Di sub bab bagian akhir dibahas pula mengenai cara mengatasi kejutan budaya.Kisah nyata mengenai hidup di negara beda budaya, sikap resistensi para wanita Indonesia di negeri asal suami, dan perubahan peran dari wanita bekerja di kantoran menjadi ibu rumah tangga. Bagaimana mengatasi kejutan budaya dan hal–hal baru yang ditemukan ketika pertama kali datang dan menetap di negara suami , serta bertemu dengan orang tua dan keluarga suami.Berbagai ragam pengalaman para pelaku perkawinan campur yang tinggal di luar negeri dapat dibaca dalam bab ketiga. Kisah mereka lebih terfokus pada kondisi Eropa karena mereka semua menikah dengan pria dari benua Eropa, yaitu Yunani, Italia, Swedia, Rusia, Belanda dan Swiss. Setiap kisah memiliki permasalahan tersendiri dan cara yang beragam dalam penanganannya.Disayangkan lay-out buku belum tertata baik. Ada gambar yang ditampilkan buram, salah letaknya dan tidak sesuai keterangan gambarnya. Jenis huruf (font) buku yang dipilih tidak sesuai dengan jenis buku ini.Buku ini dapat menjadi dua buku yang terpisah, sebab isi bab ke-4 memberi informasi lengkap mengenai enam negara asal para suami wanita yang menulis di buku ini. Secara umum buku ini sangat bermanfaat sebagai informasi tambahan bagi perempuan Indonesia sebelum melangkah ke jenjang pernikahan dengan WNA dan hidup di negara lain, khususnya keenam negara di Eropa tersebut di atas. Namun, buku ini juga berguna untuk membuka wawasan masyarakat umum bahwa pernikahan dengan WNA tidak semudah yang dibayangkan.",
  "genres": [],
  "author": "HARTATI NURWIDJAYA",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/2156082.Love_and_Shock"
}