{
  "title": "That's a Lie",
  "description": "Seth is back.  When he walked back into my life, it almost felt like the pieces of my broken heart could be fixed. I thought we could go back to being best friends, but then I started to feel what I had been blocking out for years. I tried. Boy, did I try! But once I started to let him in, I wanted nothing more than to cross that line from friendship into something more…  Just when I think I can move on and let myself be happy, an ugly reminder from my past comes storming in and threatens to destroy the sliver of hope that's been growing since Seth came back.  Do I even deserve to be loved?  “I’m not asking to fix your heart. I’m not asking to mend you. I love each and every shattered piece of you. I’m asking that you let me love you. Let me love each piece of your broken heart, and I swear to you I will make up for every heartache you have ever experienced.”  I came back for Josie.  I knew I'd have to fight for her, but with the loss of her dad and the truth about what happened with her and Blake, I quickly realized that making her mine was going to be a lot harder than I first thought. The problem is, I can’t pretend like she’s just my best friend. I can’t pretend I don’t want more.  I'm willing to do anything to get her to admit she has the same passionate feelings for me, because I know once she opens up and stops lying to herself, I can show her what it really means to be loved. It's a battle of wills, but my love for her is stronger than her will to stop me.  So I fight for her. I fight because I know she deserves it.    **This is book two in the Promises, Promises series, and book one should be read before you read this one. Also, this book is for mature readers (17+), so if you do not like getting turned on or reading hot steamy scenes, this book is NOT for you!**",
  "genres": [
    "New Adult",
    "Contemporary Romance",
    "Romance"
  ],
  "author": "Victoria Klahr",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/21568761-that-s-a-lie"
}