{
  "title": "What About the Hair Down Their? Cancer Chuckles and Chemo Tears",
  "description": "What if Lake Wobegon’s favorite teacher were diagnosed with cancer?What About the Hair Down There? Chemo Chuckles and Treatment Tears: One Woman’s Story of Family, Friends, Love & Sex After Being Diagnosed with Breast Cancer is the autobiographical story of Abby Brown, a 25-year veteran educator in the little elementary school on a hill perched above the St. Croix River in Minnesota — a teacher who has been beloved by two generations of school children in the small town upon which Garrison Keillor largely based his fictional Lake Wobegon. When she was diagnosed with breast cancer, the entire town took to the Caring Bridge website to support every step of her discovery and recovery.Both witty and wistful, terrifying and beautiful, this is not just a cancer journal. It’s a secret guide both to the horrors of cancer treatment, and to the incredible power and stability of true love — both familial and romantic. Although this doesn’t read like a romance novel, Abby’s at-times gritty, at times steamy, love for her husband knows no bounds, and his support and love for her is the red thread that holds the book’s chronological narrative together. Her two boys and their wide-eyed innocence and fear are incredibly poignant, and the author doesn’t hold back in describing the altogether too common, yet complex struggles of a family trying to cope with the fallout of a cancer diagnosis.Abby writes in her Introduction about the loss of her hair (which the title of the book is based on): “In musing about possible titles for this book, I considered, What About the Hair Down There? At first, it seemed too bold for the front cover, but it was an honest question I had in my own mind as I started the “road trip” of my cancer treatment. Mine left, like all body hair, and returned with a new look – straight and dark, in contrast to the silver waves that grew back on top of my head. With enough length, some “curl” has returned. I’m not embarrassed to share this with others. It’s a fact. And this book isn’t ‘Fifty Shades of Grey’. It’s real life.”This is a story not only of overcoming breast cancer, but of revisiting the value of family, love, vocation, and faith. Bring out the tissues — there are tears of sadness and joy in these pages.",
  "genres": [
    "Memoir"
  ],
  "author": "Abby Brown",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/21564489-what-about-the-hair-down-their-cancer-chuckles-and-chemo-tears"
}