{
  "title": "To Walk in the Way of Lions",
  "description": "Librarian Note: Alternate Cover Edition for ASIN: B008HHPVDO.TO WALK IN THE WAY OF LIONS is the second in the powerful Original Series by H. Leighton Dickson and picks up where TO JOURNEY IN THE YEAR OF THE TIGER leaves off. This is a sweeping post-apocalyptic tale of genetically altered lions and tigers, wolves and dragons in a world that has evolved in the wake of the fall of human civilization. Half feline, half human, their culture blends those of Dynastic China, Ancient India and Feudal Japan where humans are legend and kingdoms have risen in their stead. Fans of Tolkien, GAME OF THRONES, REDWALL or Japanese anime will be entertained in these intelligent and beautifully written pages in a blend of science, fantasy and zoological speculation.“World-building on par with Zelazny!”The conclusion to the sweeping epic that began in 'TO JOURNEY IN THE YEAR OF THE TIGER, the story picks up where Journey leaves off, in the harsh deserts of Khanisthan. The team is running under a very set of different dynamics than before, for not only will they be forced to confront enemies tracking from the North and a hostile force from the Palace following from the South, but they must face their own demons that are plaguing them from within. It's man against man, cat against cat, Seer against Alchemist, knowledge versus ‘the Way of Things’ – a Sci-Fi 'Pride and Prejudice and Lions', like you’ve never read it before.From the ruthless wilds of Khanisthan to the wind-swept shores of the Mediterranean Sea, the beauty and savagery of the Upper Kingdom unfolds like a living thing before them as they travel and Kirin will find out what it means to follow the code of Bushido to the gates of death and beyond…This is the journey of six individuals as they travel beyond the edges of the known Empire, into lands uncharted and wild. Theirs is a journey of magic and mystery, science and swords, romance and intrigue. It is a journey of different perspectives and unexpected kharma and love found in surprising places. It is a journey that takes place five thousand years or so in the future, naturally in the Year of the Tiger.",
  "genres": [
    "Fantasy",
    "Amazon",
    "Science Fiction"
  ],
  "author": "H. Leighton Dickson",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/21564013-to-walk-in-the-way-of-lions"
}