{
  "title": "Dell",
  "description": "A heart touching story of science fiction that is comprised of deep and humanistic emotion. Taking place in the future of our world, as an accidental creation came to easily coexist among The \"computer\" people, but they are a compassionate, free thinking, and existing populous who rival our intelligence. Emphasizing the family structure in the misty, hazy pages of this wonderfully compelling book of rare insights. \"DELL\" ,the main character of this story, born with a fatal virus that is considered the \"scourge\" of these poor people. Emotions and acts of dedication, as well as the overwhelming willingness to succeed continuously clash as the parent of this beautiful and precious child, born dying and infected, advocates forevermore, and \"makes\" the medical and technical world listen to the powerful truths that are obviously seen and experienced by both this man, and his first born son, DELL. \"Dell Jr. 0043867\" ,was the fixation of the world, as this virus ridden \"computer\" child unknowingly aided these medical/technical, and social professionals with valuable information that became milestones. Despite his disablements one can surely see a \"learnnerd\" spirit that peacefully smiles at the world, as well as with an ever loitering threat demise concerning the bodily realm. The ever loving trust this little one carried unto all who are the closest to him as he required continuous care until his suffering ceased. This heart warming story touches the fragile threads of humanity through the unceasing joy of simply being present in the very same soul of this beautiful child, although dying with a virus as he is a \"living computer\" composite like the rest of his people here. The need to be loved, nurtured, and cherished, hence achieving miracles when one is the recipient. The child known as \"DELL\" will touch you're So will his virus.",
  "genres": [],
  "author": "Milkweed L. Augustine",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/2157771.Dell"
}