{
  "title": "Zipporah, Wife of Moses",
  "description": "In the time of the Pharaoh, a tiny infant is rescued from the banks of the Red Sea. She is named Zipporah, “the little bird.” Although she is a Cushite by birth—one of the black people of the lands to the south—she is taken in by Jethro, high priest and sage of the Midianites. Jethro adores his adopted daughter, and she is an honored member of his family. But the blackness of Zipporah’s skin sets her apart and will decide her she will be an outsider, and the men of her adopted tribe will not want her as a wife.But when she becomes a young woman, Zipporah’s destiny changes forever. While drawing water at a well one day, she meets a handsome young man, a stranger. Like her, he is an outsider, a foreigner. His name is Moses. A Hebrew raised in the house of the Pharaoh, Moses is a fugitive, forced to flee his homeland of Egypt after murdering one of the Pharaoh’s cruel overseers. Zipporah knows almost immediately that this man will be the husband and partner she never thought she would have.At first Moses wants nothing more than a peaceful life with the Midianites. He is content in his role as Zipporah’s lover and the honorary son of Jethro the sage. But Zipporah refuses to let Moses forget his past or turn away from what she believes to be his true destiny. Although he is the love of her life and the father of her children, Zipporah won’t marry Moses until he agrees to return to Egypt to confront Pharaoh and free his people. When God reveals himself to Moses in the burning bush, his words echo Zipporah’s, and Moses returns to Egypt with Zipporah by his side. A passionate lover and a generous, thoughtful wife, Zipporah becomes the guiding force in Moses’ struggle. With the help of her powerful father, she teaches the rebellious young man about the rule of law and the force of justice. Because of Zipporah—the outsider, the black-skinned woman—Moses becomes a defender of the oppressed and a liberator of the enslaved.A woman ahead of her time, Zipporah leaps from the pages of this remarkable novel. Bold, independent, and a true survivor, she is a captivating heroine, and her world of deserts, temples, and ancient wonders is a fitting backdrop to an epic tale.As Zipporah and Moses came closer to the queen of cities, the road parted company with the riverbank, and they found themselves facing a vast expanse of palm groves between the river and the hills and ocher cliffs, beyond which the desert began. And there, finally, rising into the blue sky, were the temples of Pharaoh.There were about ten of them, the largest surrounded by smaller ones, as if they had given birth to them. Seeming to grow out of the rock, the tops reaching up into the sky, they defied belief, so fantastically huge that beside them, even the cliffs seemed mere hillocks. Their faces shimmered in the heat like oil against the transparent sky. The neatly laid brick road leading to them burned in the sun.Zipporah remembered Moses’ words about the splendor of Pharaoh’s temples, but their hugeness surpassed anything she could have imagined. Nothing here was on a human scale. Not even the stone monsters with the heads of men and the bodies of lions that stood guard before them.Farther on, beneath great pyramids, they could see vast building sites. Colonnades and needles of white limestone and walls carved and painted with thousands of figures rose on the fronts of palaces hollowed out of the cliffs. There were unfinished monsters without wings, and statues without heads. In places, the roads became mere dirt paths, with bricks piled at the sides. And everywhere, the slaves swarmed, working, carrying, hammering, creating a din that rose into the heat of the day and was carried on the air from the farthest reaches of the building sites. —FROM ZIPPORAHLook for the Reader’s Group Guide at the back of this book.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Biblical Fiction",
    "Historical",
    "Biblical",
    "Christian Fiction",
    "Religion"
  ],
  "author": "Marek Halter",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/2158108.Zipporah_Wife_of_Moses"
}