{
  "title": "Not Some Random Clown: A Youth Football Coaching Legend's Rise to Glory",
  "description": "Set in a small town in Northeast Georgia, Not Some Random Clown chronicles the rise of Three Year Letterman, America's most beloved youth football coaching legend. Coach Letterman still wears his high school football letter jacket proudly in his mid-thirties and is a rabid Unviersity of Georgia football fan. After getting fired as a youth football defensive backs coach during a contentious encounter at a funeral home in 2013, Coach Letterman swears revenge and spends the next two years attempting to create the most dominant youth football team in America. His win-at-all-costs tactics include falsifying residency papers, recruiting players who are clearly over the league's age limit, hiring legal counsel, intentionally making his \"useless\" players quit, and bribing a vice principal to change grades. These methods and his general attitude toward life, which prioritizes football success and belittles any academic or artistic endeavor, frequently brings him into conflict with his players' parents, league officials, opposing coaches, and even his own family members.This book provides a panorama of life in small town Northeast Georgia by introducing many of the colorful characters in Coach Letterman's life, including Dale Chosewood, his volatile best friend and defensive coordinator, Uncle Gary, his uncle who drives a tractor-trailer without a CDL and loves Hooters, Barb Wade, a chainsmoking former WPBA player who rules the local bowling alley with an iron fist, his cousin Brad, a workers’ compensation attorney who failed the bar exam several times, and Leon Sutton, his offensive assistant who is on probation for selling bootlegged DVDs. His memorable players include the DT with the Rat Tail, the Likely Overage QB with Tracings of a Mustache, \"Chainsaw\" Wade, the Piccolo Player, the Ventriloquist, the Vegan, and Lord Stonehands, a British exchange student Coach Letterman drafts by mistake.Not Some Random Clown is masterpiece of Southern literature that won't soon be forgotten.",
  "genres": [
    "Sports"
  ],
  "author": "Three Year Letterman",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/215725677-not-some-random-clown"
}