{
  "title": "Jackie: A Novel",
  "description": "In this mesmerizing novel about Jacqueline Kennedy Onassis, acclaimed author Dawn Tripp has crafted an intimate story of love and power, family and tragedy, loss and reinvention.The world has divided my life into three:Life with JackLife with OnassisLife as a woman who goes to work because she wants to.My life is all of these things, and it is none of these things. They continue to miss what’s right in front of them. I love books. I love the sea. I love horses. Children. Art. Ideas. History. Beauty. Because beauty blows us open to wonder.Even the beauty that breaks your heart.Jackie is the story of a woman—deeply private with a nuanced, formidable intellect—who forged a legacy out of grief and shaped history even as she was living it. It is the story of a love affair, a complicated marriage, and the fracturing of identity that comes in the wake of unthinkable violence.When Jackie meets the charismatic congressman Jack Kennedy in Georgetown, she is twenty-one and dreaming of France. She has won an internship at Vogue. Kennedy, she thinks, is not her kind of adventure: “Too American. Too good-looking. Too boy.” Yet she is drawn to his mind, his humor, his drive. The chemistry between them ignites. During the White House years, the love between two independent people deepens. Then, a motorcade in Dallas: “Three and a half seconds—that’s all it was—a slivered instant between the first shot, which missed the car, and the second, which did not. . . . A hypnotic burst of sunlight off her bracelet as she waved.”This vivid, exquisitely written novel is at once a captivating work of the imagination and a window into the world of a woman who led many lives: Jackie, Jacks, Jacqueline, Miss Bouvier, Mrs. Kennedy, Jackie O.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "Book Club",
    "Politics",
    "Adult"
  ],
  "author": "Dawn Tripp",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/215752492-jackie"
}