{
  "title": "Suppressed Inventions and Other Discoveries: Revealing the World's Greatest Secrets of Science and Medicine",
  "description": "A scientist with a revolutionary cure for AIDS is incarcerated without explanation. Valuable artifacts are mysteriously misplaced by a prominent archaeological institution. Three celebrated astronauts perish in a suspicious fire after voicing their criticism of the US space program. Yet our world’s most powerful agencies hastily dispel these alarming reports as conspiracy theories, and bury them in padlocked archives. The fact is that a suppression syndrome exists in our society. Suppressed Inventions and Other Discoveries exposes the startling degree of truth behind the rumors.Jonathan Eisen has collected over forty intriguing stories of scientific cover-ups and programs of misinformation concocted to conceal some of the most phenomenal innovations in mankind’s history. These no-holds-barred accounts force us to confront the naiveté—and danger—of trusting our academic and political leaders to act always for the common good. Suppressed Inventions and Other Discoveries presents documented evidence that corporate self-interest, scientific arrogance, and political savvy have contrived to keep us in the dark about technological breakthroughs or interplanetary contact that may shift the current balance of power.Prepare yourself for a revealing look at the research and development to which we’ve been denied access. Suppressed Inventions and Other Discoveries begins by examining the ties that bind the medical establishment to powerful pharmaceutical corporations. Then it details the struggle of the independent research against Orthodox Science and its code of conduct, the Scientific Method. Next, the book investigates the cover-up of information concerning UFOs and extraterrestrial life that’s certain to make you reconsider what you thought was science fiction. The final section discusses just a few of the numerous alternate energy resources and fuel savers that, if put on the market today, would soon run the fossil fuel monopolies out of business.",
  "genres": [
    "Science",
    "History",
    "Technology",
    "Conspiracy Theories",
    "Health",
    "Reference",
    "Nonfiction"
  ],
  "author": "Jonathan Eisen",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/2157754.Suppressed_Inventions_and_Other_Discoveries"
}