{
  "title": "Celtic Spirit",
  "description": "Can a man be redeemed of his ills of the past? Derek Campbell did not know the answer to that. All he knew was the pain and suffering he had caused…and the pain he now felt from the fateful fall from the tree limb that now lay splintered beneath him. As certain death was about to befall him, he was granted a chance of redemption. Somehow, he was deemed worthy of a second chance but it would come with a price. The price would plunge him into a world between the living and the dead, where isolation was his only companion. Isolation and time….Those were things he would have an abundance of to ponder the misdeeds he had wrought throughout his life. Old hatreds of the past prevented Derek from opening the path of redemption. Love would be the only thing to save his soul from the endless years spent not quite a man; not quite a ghost. His punishment was severe and an ancient curse prevented him from satisfying his human needs in every sense. He knew want; he knew loneliness. Only in the Tower, protected by the Guardians of the past, could he claim his humanity. The tower held the key to unlock Derek Campbell from the prison of his soul and of his heart. Kiera Callum was running from a failed relationship and a career with a sadistic and abusive boss. The Highlands of Scotland seemed like just the balm to soothe her battered spirit. She never dreamed that taking the menial job as a tour guide would afford her to actually live in the main quarters of Castle Campbell. She also could not imagine that the Keep came complete with a 700 year old spirit. It seemed Kiera ran from many things in her life when the going got tougher. One of those things was her ability to sense the spirits of those who had gone before. She had denied that gift her entire life because it marked her as a freak. Only now there was nowhere to run. Kiera had to finally face everything she had run from in order to help the trapped soul of a medieval man whose presence was the most vital thing she had ever encountered. She would have to learn to trust in the things that could not be explained. Things are not always as they appear… Could love end his torment? Would Kiera be able to open her heart enough to release him from the prison of isolation? Would her love be strong enough to let him go? Celtic Spirit spans six and half centuries where the past and present collide. Love can bridge time and space. Love is eternal.",
  "genres": [],
  "author": "Ria Cantrell",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/21570700-celtic-spirit"
}