{
  "title": "Beverly Hills is Burning",
  "description": "\"It was just after midnight when the girl in the blue diamond necklace fell out of the sky.\"In Hollywood, an ex-con movie producer, fresh out of San Quentin, is lucky if he can get a valet to take his car at The Ivy. Teddy Chessman got his own studio.Why? Because Teddy controls the most important motion picture property to hit town since agents were invented. And attached to this expected critical and financial bonanza is the biggest female action star in the world, Valentine Jones.But good plans die horrible deaths, and foolproof ones, worse. And now, the guy who loaned Teddy the money to buy the joint--Rail Black, a former Delta Force operator with a private fortune--is forced to take possession of Teddy's dream. And the bad news is just beginning.Exploding from ninety years in the past--when gangsters and movie tycoons roamed Hollywood and scratched each other's wallets--Rail issucked into a quicksand of unsettled scores, duplicity and death, where a couple of billion dollars in boxoffice seems like small change.From Southern California to New York, Venice, Havana, Mexico and Cyprus, Rail must disentangle the past from the present and come to terms with his feelings for Barrie Fontaine, a long dead woman--andextraordinarily brave pilot--he has never met.And somewhere, out there, is Matty Aspirins, a hitman on a mission all his own.Welcome to Beverly Hills is Burning.There will be no intermission.\"Neil Russell is the king of adventure thrillers... BEVERLY HILLS IS BURNING is a tour-de-force of hot action, cool suspense, and steamy sex. ...a once-in-a-lifetime ride with producers, screenwriters, Mafiahitmen, and money. Lots of money. You'll love this book.\"Gayle Lynds, New York Times bestselling author of THE BOOK OF SPIES\"Neil Russell's BEVERLY HILLS IS BURNING is everything a thriller should be. Former Delta Force operator, Rail Black is a contemporary knight errant, patrolling the seedy boulevards of La-La Land...reminding me of John D. MacDonald's iconic Travis McGee.\"Description and dialogue are edged weapons, employed expertly...acerbic wit and indelible metaphors paint a mordant portrait of L.A. corruption as only a veteran Hollywood insider could.\"Warning: This is a tough tale about bad people who use gutter language and do ugly things... You shouldn't wait a minute longer to dive in...\"Robert Bidinotto, Bestselling author of HUNTER: A Thriller",
  "genres": [],
  "author": "Neil   Russell",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/21574033-beverly-hills-is-burning"
}