{
  "title": "The Life of Anna, Tenth Anniversary Edition: Act One",
  "description": "Raised in shadows, molded by cruelty, Anna was never meant to have a choice.\n\n\nAfter losing her parents at age twelve, Anna is raised by an abusive guardian who molds her into the perfect tool for Devin Andersen's machinations, her unique gifts making her invaluable in his quest for power.At sixteen, Anna's world begins to shift when Devin claims her, coinciding with dreams of a mysterious man who inexplicably brings her comfort. But it's not until she turns twenty that Anna's life truly transforms. As she steps into a world of manipulation and dark desires, she finds herself torn between two masters: Devin, whom she's known since childhood, demanding her obedience, and Alex, a handsome stranger who offers the promise of freedom and safety.As Devin achieves a crucial step towards his ultimate goal of power, his cruelty drives Anna to her first act of rebellion. Caught between love and forces of evil, Anna must navigate a life she never wanted, while Alex works tirelessly to give her something Devin can never take away.\n\n A NOTE ABOUT THE TENTH ANNIVERSARY EDITION For the past ten years, The Life of Anna has set the standard for Dark Fiction in many reader’s minds.There are times when you will question your sanity, question reality, and question the value of continuing reading. You will love it, or you will hate it. There is no in between.Originally published in five parts, this new Ten-Year Anniversary Edition has been revised, re-edited and restored to its original format of one (very long) story, although split into two Acts for publishing purposes. New scenes have been added as well.Be warned, this is a hard book to read. While Anna’s story is not categorized as a romance, it does contain romantic elements. It is Anna’s story, told in all its bloody, violent, beautiful, twisted truth.",
  "genres": [
    "Dark",
    "Abuse"
  ],
  "author": "Marissa Honeycutt",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/216137827-the-life-of-anna-tenth-anniversary-edition"
}