{
  "title": "Astro-Diagnosis Or A Guide To Healing Including The Occult Principles Of Health And Healing",
  "description": "Astro-Diagnosis Or A Guide To Healing Including The Occult Principles Of Health And Healing is a comprehensive book written by Max Heindel. This book is a guide to healing that includes the occult principles of health and healing. The book is divided into two parts, the first part deals with the principles of diagnosis and the second part deals with the principles of healing.In the first part, the author explains the principles of diagnosis, including the use of astrology and the interpretation of the horoscope. He also explains the principles of anatomy and physiology, and how they relate to the diagnosis of disease. The author also provides information on the different types of disease and their causes.In the second part, the author explains the principles of healing, including the use of diet, exercise, and natural remedies. He also explains the use of spiritual healing and the principles of mental healing. The author also provides information on the use of drugs and surgery in the treatment of disease.Overall, Astro-Diagnosis Or A Guide To Healing Including The Occult Principles Of Health And Healing is a comprehensive guide to healing that provides valuable information on the principles of diagnosis and healing. The book is written in a clear and concise manner, making it easy to understand and use. It is an excellent resource for anyone interested in natural healing and the principles of health and wellness.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Astrology"
  ],
  "author": "Max Heindel",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/2160600.Astro_Diagnosis_Or_A_Guide_To_Healing_Including_The_Occult_Principles_Of_Health_And_Healing"
}