{
  "title": "Songs to Make the Desert Bear Fruit",
  "description": "SONGS TO MAKE THE DESERT BEAR FRUIT is the story about the summer when Nathan Gauer attends the first Lakota Sundance in the Black Hills in over a century, an encounter with the unsettled debts of America’s past that will forever shape his relationship with its future.In 1999, Nathan and his mother set out on a six-week-long road trip hours before his high school graduation. With the open country unfolding before them like a song, Nathan is unsure if he is running from something or toward something. After tracking down an old family friend to repay a debt his mother refers to only as “the favor,” they accept an invitation to attend a Lakota Sundance in the Black Hills. It is here, camping beyond the margins of society among an unforgettable group of would-be writers, wanderers, and revolutionaries, that Nathan meets Gabrielle. The niece of the medicine man responsible for organizing the Sundance, Gabrielle is fierce, funny, capable of reciting classic hip hop albums from memory, and despite her circumstances, unwilling to indulge in self-pity.She is also a single mother determined to move her sixteen-month-old daughter away from the Rosebud Indian Reservation at any cost. When the Sundance ends, she invites Nathan to return with her to her uncle's home on the reservation. Against the backdrop of a community at once generous, desolate, and crackling with the threat of violence, they gradually begin to see a future together. But when the harsh realities of her world collide with their plans, Nathan must discover what it means to find his own song capable of making the desert bear fruit. By turns gritty and meditative, romantic and realistic, SONGS TO MAKE THE DESERT BEAR FRUIT transports the reader headfirst into one of America’s last hidden worlds and into the lives of people that linger with you long after turning the final page.",
  "genres": [],
  "author": "Nathan Gauer",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/21597494-songs-to-make-the-desert-bear-fruit"
}