{
  "title": "Hot Soldier Boxed Set",
  "description": "HOT SOLDIERSis an exciting new anthology from authors of the bestselling STRANDED WITH A BILLIONAIRE,with the fabulous additions of Charisma Knight and Jamallah Bergman.Hot Soldiers features six hot, romantic novellas of strong men and the stronger women who love them. COMING HOME by Seraphina Donavan(bestselling author of Dragon's Lair and The Boss' Bad Girl) Morgan Donnelly planned to live out his days in the military, but an IED changed all that. Returning to his hometown, struggling with PTSD and adapting to a life he hadn't envisioned, he finds himself drawn to the sweet and shy younger sister of his former fiancee. Lexi Flynn has her own issues. The curvy pastry shop owner finds it hard to believe that a man like Morgan would want her. Can Morgan and Lexi overcome their fear and insecurity to claim the happiness that is right in front of themWRONG GIRL by Kate Baum (author of the Girl Series) Ernestine “Ernie” Rose learned early on in life from her bitter and angry mother that she didn't need a man to succeed. While she learned those lessons well, they've made for a lonely life. It isn't until Ernie accompanies her extremely nervous friend on a blind date that Ernie discovers there's more than one way to need a man. Sparks fly between Ernie and the blind date's wingman, Chase. He inspires Ernie to do something she's never done before... let go of her inhibitions. THE LAST TOUR by Charisma Knight (author of the Raven's Fall Series) Watching his entire unit get cut down in Afghanistan has left Sgt. Sebastian McElvoy questioning his sanity and whether or not he deserved to survive. Coming home to the wife he loves, the joy and peace that Rayna gives him fills him with guilt. But Sebastian isn't alone in wondering if the changes in him will allow them to resume their life together. Rayna looks at her husband and sees a man who is a ghost of his former self. Can she save him, and if she does, what will be the ultimate cost?THE SOLDIER AND THE WRITER by Jamallah Bergman (author of the Cipriano's of Kellington Series) As a romance author, Ione Finn has been making people fall in love with heroes for years. She never imagined she'd make a real life hero fall in love with her. Wounded soldier, Sgt. Mark Phillips, has one bright spot in his long recovery, the letters he receives from Ione. What begins as a friendship between pen pals quickly grows into so much more, and when Mark finally goes home, he's eager to turn their long distance romance into a long and lasting love. SUSPICIOUS MINDS by Siobhan MacKenzie (Author of 'His Man' Series) Jordan Blair is the prime suspect in the death of the man who caused him to lose his leg in Afghanistan – his former sadistic commanding officer. Recently promoted MP, Lt Rachel Carmichael, is in charge of the case and she is sure she has her killer in her sights. But there’s something about the wounded warrior that changes her mind. Rachel is drawn to him in spite of her suspicion. Proving his innocence might just be the first step towards healing…and love. ANGEL WATCH by Leanore Elliott (Bestselling author of the Beasts series) Mags is a cop. Lives it, breathes it, and everything else takes a backseat to it. Sure, she knows that her curvy figure grabs attention, and she knows that her partner has the hots for her. But the only thing she's interested in is tracking the vigilante who's targeting criminals on her beat. There's only one likely suspect for Mags, and that's Rem Tarken, her partner's best friend. The only problem is that this solider and expert sniper ignites more in Mags than just suspicion. He shows her that she's a woman...And he never misses a target.",
  "genres": [
    "Military Fiction",
    "Romance",
    "Contemporary Romance"
  ],
  "author": "Seraphina Donavan",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/21595975-hot-soldier-boxed-set"
}