{
  "title": "Patriot at the River: A Novel of the American Revolution",
  "description": "The fight he got wasn’t the fight he wanted.It’s 1780, and North Carolina is a battleground. Backcountry scout Benjamin Woodbridge is guarding a Patriot camp when he sees the king’s men pursuing a civilian. Never one to stand by while someone is in trouble, Benjamin steps in to help the stranger and finds an unexpected ally.But the same British officer who targeted the stranger is also targeting Benjamin’s settlement. After Benjamin is wounded on a lonely mountain trail, he watches Sunrising fall to the man who crushed his father’s cause nine years earlier. Benjamin’s fight has come home to the very people he wanted to protect—his shy younger sister and the woman who has given them both a home.Now, with the help of some unlikely comrades and the indomitable Aunt Kate, Benjamin must fight for what he loves before his settlement goes up in flames. But only if he can fight himself first.For fans of Christian historical fiction and tales of bravery and redemption, Patriot at the River is a must-read filled with engaging characters and biblical truth. Read now and step into an adventure of faith and freedom.“A fast-paced tale, Patriot at the River captures the spirit of the American Revolution in spades. Through courageous flesh-and-blood characters in the Carolina backcountry who are the embodiment of soul liberty, this well-layered novel offers a fresh look at freedom and those who fought to win it not only for themselves but generations to come. Huzzah!”—LAURA FRANTZ, Christy Award–winning author of The Frontiersman’s Daughter“I am so impressed with Jayna Baas and this story! Intense, at times heartstopping, richly textured and steeped in an authentic Carolina backcountry voice. Reading it felt like visiting old friends that I hadn’t yet met.”—SHANNON MCNEAR, Selah Award–winning author of Daughters of the Lost Colony“If you’re looking for a story filled with adventure, faith, biblical values, history, and characters you’ll love, look no further than Patriot at the River.”—KRISTINA HALL, author of Trouble in Dry Springs",
  "genres": [
    "Historical Fiction",
    "American Revolution",
    "Christian Fiction",
    "American Revolutionary War"
  ],
  "author": "Jayna Baas",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/216130335-patriot-at-the-river"
}