{
  "title": "Between the Lines",
  "description": "Fantasy-enthusiast Rory Whatley returns home a decade after her life fell spectacularly apart and must weigh her love for her estranged best friend against her fear of losing him all over again. This friends-to-lovers second chance romance with genderbent grumpy/sunshine and slow burn mutual pining is perfect for fans of Emily Henry and Carley Fortune.\nThey say home is where the heart is, and Rory Whatley knows better than most just how true that is. Neglected by her parents from a young age, she found \"home\" in Sam Capshaw, a shy but big-hearted boy who welcomed her into his family when they were seven years old. He was her entire world until a friendship-ending argument ripped it all out from under her. She's spent the last decade trying to pretend that Sam never existed, drowning her sorrow in fantasy novels by her favorite author, the reclusive J. Edward Michael. Now back in Asheville, she's determined to start anew, but those plans quickly crumble when she learns Sam has also moved home and their mutual friends make seeing him again an inevitability. When she and Sam reconnect, it's as though no time has passed at all. He's still the same sweet, people-pleasing guy he used to be-and the same guy who broke her heart when they were eighteen years old.Then a mysterious Advanced Reader Copy of J. Edward Michael's next book turns up on her doorstep, with a plot that seems to parallel her complicated relationship with Sam. As her feelings for Sam grow stronger and the book becomes more uncanny in its detail, Rory is forced to reflect on the relationships that have defined her for most of her life. Told in alternating timelines between their childhood and the present, Between the Lines perfectly encapsulates the nostalgia of childhood friendships and first loves interwoven with the struggle of forgiving old hurts and the fear of losing the people who matter most.",
  "genres": [
    "Romance"
  ],
  "author": "Sarah R. Chapman",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/216345205-between-the-lines"
}