{
  "title": "Overtime",
  "description": "Down and out with an injury keeping him away from the game, Assassins’ defenseman Jordie Thomas lives for the blades of his skates on the ice and the feeling of oblivion off it. With no choice but to heal, he’s forced away from the sport that runs through his veins. With everything at stake and darkness setting in, he quickly finds himself spiraling even further out of control. As his life begins to come crashing down around him and his contract with the Nashville Assassins on the line, he’s given an ultimatum. Ready or not, Jordie is forced to face his past, the fears that consume him, and the one woman he let walk away. Kacey King had her professional dreams come true, yet her heart was battered and broken. With an Olympic gold medal around her neck, she’s ready to look forward to the future but without the one man she wanted in it. She’s missing the key pieces of her heart she left months ago with the only person who was capable of destroying it, causing her to falter in all her plans to move on. In the game of life, there are winners and losers, and neither Jordie nor Kacey want to be on the losing bench. If only Jordie could convince Kacey he’s a changed man and that he wants her right by his side as his MVP for the biggest and best parts of a life they build together. With emotions running high and the game on the line, can two proud people find happiness with each other, or will their hearts and souls be left in the cold? Will they see that sometimes having someone by your side who knows the good, bad, and broken is better than going it alone and losing everything through the back of the net? They are out of time on the game clock and fighting for the win of their lives. But overtime was made for an Assassin like Jordie.",
  "genres": [
    "Sports",
    "Romance",
    "Sports Romance",
    "Hockey",
    "Contemporary Romance",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Toni Aleo",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/21624179-overtime"
}