{
  "title": "The Shadow King's Kiss",
  "description": "NicaThe De Luca name means power, wealth, and a darkness that chills me to the bone. They're a viper's nest, and my father was killed by their fangs. Now, I want revenge.But then I see him. Elio De Luca. His sharp jawline, effortlessly tousled dark hair, and intense eyes pull me in, even though I know I should hate him. My heart races, and a flush creeps up my neck.Is this really the same boy who used to build sandcastles with me and sneak me candy? The memory throws me off balance. How can my childhood friend now control an empire built on blood? His eyes meet mine—a flicker of recognition, then a cold mask. Is he playing games, or is there something left of the boy I knew beneath that ruthless facade?Stepping into Elio’s world, a world I left behind as a child, could cost me more than just my heart—it might cost me my life.ElioThe scent of cinnamon hits me, a ghost from a past I thought was long gone.It’s Nica.My gaze sweeps over her curves, and I can't help but linger. Her long, dark hair frames a face that draws me in effortlessly. Her lips part, and I wonder how they would taste. Everything about her makes it impossible to look away.Victoria Galli. My best friend—until she wasn’t. I remember her fiery spirit and that laugh that could chase away shadows. But now her eyes are filled with a fury I can't decipher, and my heart tightens. She doesn’t belong here. Not in this world. My world.Part of me wants to reach out, explain the darkness I’ve become. But will Nica only see the monster the rest of the world fears?If you love The Mafia King by Rina Kent and Bound by Honor by Cora Reilly, then The Shadow King's Kiss by Raven Reeves is the perfect read for you. With a mix of enemies-to-lovers, forced proximity, dark mafia romance, and dual POV, the story will keep you hooked until the end. And yes, there's a HEA/HFN waiting for you!\"This story has me on my knees craving the next in the series. A gripping, exciting love and suspense-filled read!\" ⭐⭐⭐⭐⭐ - Amazon review.\"OMG this was the best dark romance ever as it was an action-packed of drama and emotions.\" ⭐⭐⭐⭐⭐ - Amazon review.\"The Shadow King’s Kiss is the first book that I have read by Author Raven Reeves, and she did NOT disappoint with this amazing dark mafia romance.\" ⭐⭐⭐⭐⭐ - Amazon review.\"I ate this book up and hated putting it down. - Reader Review ⭐️⭐️⭐️⭐️⭐️",
  "genres": [],
  "author": "Raven Reeves",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/216157068-the-shadow-king-s-kiss"
}