{
  "title": "ELIS: Irish call girl",
  "description": "An intimate look at the oldest “profession” through the eyes of someone who was never meant to be there!Caught between worlds, living a life she never wanted…Elis - Irish Call Girl - Based on true events, this story is set in Ireland and reveals a raw and untold reality.Elis delves deep into the life of Anna, a young woman who finds herself in harsh and unforgiving situations in Ireland.However, this is not merely a tale of sorrow—Anna surprises you with her sharp wit and biting sarcasm, offering moments of levity even in the most challenging times. This narrative brings an authentic and raw perspective to the struggles she faces, making it all the more poignant.Her resilience shines through as Anna navigates the complexities of her world, from love and loss to the darker corners of society. Her ability to find humour amidst adversity is both refreshing and inspiring. The book’s illustrations don’t just complement the narrative; they enhance the storytelling, bringing key moments to life with a playful and ironic twist. Each image echoes the story’s emotional depth while adding a unique, unforgettable charm.Elis combines raw emotion with moments of humour and visual artistry. The narrative will linger in your mind long after you finish the book. Anna’s journey is about survival, strength, and the belief that even during the darkest times, a bit of sarcasm and a well-timed joke can make a world of difference.\nEDITORIAL \nPublished by Global CommentThis review was originally published on Global Comment, written by Alan Ludlum. \"Elis is a raw, honest, and surprisingly often humorous look at a shady world that is not well understood - offering a glimpse into a shadowy world, with lessons that resonate deeply.\"Published by Story Circle\"I'll say this Elis is an absolutely incredible book. Funnily enough, you'll find yourself laughing a lot when you read this book as well. Anna is very funny in how she describes the people she met, the places she has been to, and the situations she found herself in. That she is able to treat some of the awful experiences she had to deal with in a joking way is inspiring. The book is very well written, and there are some lovely pictures that she has drawn to help tell her story.\"",
  "genres": [],
  "author": "Anna Rajmon",
  "average_rating": "4.89",
  "url": "https://www.goodreads.com/book/show/216183491-elis"
}