{
  "title": "Gluten Brains: the brain–grain connection",
  "description": "Headaches? Migraines? Convulsions?Moody? Depressed? Psychotic? Exhausted?Behavior or Learning problems? ADHD? Autism?Tummy ache? Gastric reflux? Constipated? Tired?~When your brain and nerves are damaged by gluten,all of this can happen.~Are you affected? Find out before it’s too late.This ebook is the revised edition of the book – “Full of the shocking truth about gluten.”Yes, brains and nerves get damaged by gluten. Medical research reveals that gluten commonly causes nerve damage, brain disease, mental disturbance, learning disorders, fatigue, and poor growth. But most sufferers from gluten-harm remain completely unaware of it! Read the stories of suffering and ‘miracle cures’ by quitting gluten. Are you and your family affected? Find out before it’s too late.~This ebook goes on to tell you what to look for and how to make a diagnosis. Yes, you can feel well again! Gluten makes you sick and grumpy, it causes an amazing range of symptoms. It saps your energy and leaves you feeling exhausted. Families tell of years of unnecessary suffering, when simple blood tests can give a diagnosis. Going gluten-free can change your lifeoOoContents gluten-sensitivity a neurological diseaseThe hypothesisThe new ideas~Chapter 1. Gluten – friend or foe?The problem with glutenGluten – invading your foodProblem symptoms have been officially “hidden”AutismThe gluten problem is hugeYou can’t tell unless you testMore voices speaking outGluten is addictiveGluteo-morphinesLeaky GutThe zonulin storyLeaky gut problems~Chapter 2. Gluten SyndromeGluten-related disordersRecognize your symptomsThe 'Big List' of gluten-sensitive illnessWhy so many symptoms?Celiac Disease - the great masqueraderIs there an epidemic?You cannot tell unless you test~Chapter 3. Your tummy brainWhat is your gut doing?OesophagusStomachSmall bowelLarge bowelWhat is your brain doing?How does your brain control your gut?Autonomic nervous systemGut feelingsFight and flightWorry tummy~Chapter 4. Gluten can strike your brainSymptom evidenceGluten-brain connectionsNeurological findings commonPoor response to gluten-free dietsAuto-antibody damageGluten causing inflammationExcito-toxinsInterfering with neurotransmitters~Chapter 5. Headaches and migrainesMedical evidenceBrain blood flowPeople tell their stories~Chapter 6. Nerve damage – stunted growthNeuropathyPeripheral neuropathyMotor neuropathyDevelopmental delayAutonomic neuropathyAtaxiaGluten-driven brain inflammationNeurological dysfunction of unknown causeEpilepsyStunted growthGrowth hormone suppressionThe growth hormone evidenceGluten-sensitivity and poor growthTest all short children~Chapter 7. Mood and behaviorLethargy, low energyAngryADHD and learning problemsAutismDepressionBread madness~Chapter 8. Tummy troublesGastro-intestinal motility disorderGastro-oesophageal refluxConstipation and soilingDiarrhoea and abdominal painAbdominal migraine~Chapter 9. Got it? Grain-brain connectionGrains and your brainsSo ... have you got it?The criticsThe criticismsMore answers to your questionsYou can use the eClinicThe gluten-sensitive patientsThe storytellerstTG and gliadin antibody resultsDramatic responses to gluten-free dietsLast words~Chapter 10. References~Chapter 11. Web links and booksebook SeriesAbout the Dr Rodney FordConnect with Dr Rodney Ford Online",
  "genres": [],
  "author": "Rodney Ford",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/21637648-gluten-brains"
}