{
  "title": "Doohickey: A Novel",
  "description": "Nick Fashon is having a bad day. He's just found out his estranged grandfather has died mysteriously in the Arizona desert. Then he meets his potential father-in-law, who turns out to be an ex-cop with a screw loose and a penchant for bean dip. To top it off, he returns home to find his successful clothing shop has just burned to the ground and taken his upstairs apartment with it. Love & Fashion was Nick Fashon and Vince Love's thriving clothing store until it went up in flames -- the work of an arsonist, police say. Suddenly Nick is homeless and disillusioned, and both the insurance investigators and the police want a word with him. Where can he turn for help? He's wearing out his welcome with his archaeologist girlfriend, Gretchen, who's developing her own suspicions about him. His business partner and best friend, Vince, isn't much help either, as Nick discovers more and more disturbing clues that point to Vince as the one who set the blaze. Things begin to look up when Nick finds out his eccentric late grandfather has left him an unusual a thriving pet-coffin business and a barn full of peculiar inventions, including one particularly interesting doohickey called the HandyMate. The HandyMate is the ultimate kitchen gadget -- a simple tool that can cut, core, chop, slice, and potentially transform the domestic world. Full of entrepreneurial zeal, Nick is determined to see one in every kitchen drawer in America. But Nick isn't the only one planning to strike it rich with the HandyMate. Yola Fuentes, Nick's grandfather's irresistibly sexy business partner, is so determined to get the HandyMate that she makes Nick an offer he can't refuse. And Robo Fuentes, her jealous ex-husband, has a bullet with Nick's name on it if he takes her up on that offer. Nick quickly finds himself caught in a situation where a twisted thing of plastic might end up costing him his girlfriend, his self-respect -- and his life. With the help of a cast of colorful characters, master storyteller Pete Hautman delivers a stylish and funny mystery with more twists and turns than the HandyMate itself.",
  "genres": [
    "Mystery",
    "Fiction",
    "Humor"
  ],
  "author": "Pete Hautman",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/216465.Doohickey"
}