{
  "title": "Quicker",
  "description": "Quicker is a near future SciFi/Thriller whose young heroine Ell Donsaii is an intrepid athletic phenom who reminds one of David Weber's Honor Harrington. Like Stieg Larsson's Lisbeth Salander (The Girl With the Dragon Tattoo) Ell is also a mathematical genius who, instead of counting sheep, works on her own theory of quantum mechanics to help her drift off to sleep. At once shy and concerned about her social skills, yet well loved by those around her, she finds herself at the center of a terrorist plot at the Olympics. The terrorists never contemplated trying to hold a hostage with the unbelievable quickness and athleticism of Ell Donsaii!A tradition of young, strong, brilliant, female heroines like Honor, Lisbeth, and Katniss Everdeen is continuedExcerpt“Oh, come one. Just one little kiss.”She leaned back with a shy grin on her face and looked him in the eye, “Nope, maybe we’ll get to know each other better if we both get into the same academy?”That reminded him that he was never going to see her again, so he got a firmer grip on her shoulder and turned her toward him, leaning in harder. “Oh, come on.”“I said no!” Ell felt her heart pounding and her world started to slow down. Her gut clenched as she realized what was happening to her. She was falling into the zone and something bad might happen.Phil mistook her tone for intimidated fear and thought she was about to buckle. He exerted just a little bit more of the power that had won him so many wrestling matches, drawing her closer.“Stop!” Her hand swung back with a little handbag in it.He pulled a little harder, laughing inside at the thought of being hit by a purse - right up to the moment it exploded against the side of his face. He staggered back and, though he never saw it coming, a second blast of agony came from his crotch. To his dismay he found himself writhing on the ground, curled about his ravished groin, holding his face, unable to breath. Waves of agony pulsed slowly through him.",
  "genres": [
    "Science Fiction",
    "Young Adult",
    "Thriller",
    "Mystery Thriller",
    "Action",
    "Book Club",
    "Crime"
  ],
  "author": "Laurence E. Dahners",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/21642297-quicker"
}