{
  "title": "Spinneret",
  "description": "We are not alone in the universe. As Earth vessels ventured out to explore near interstellar space, they found not one alien race, but many. There were no planets that hadn't already been colonized or inhabited by some space faring race other than our own. Until finally we humans discovered Astra. Elation was short lived, however, when it was realized that this habitable world contained no real metals.So Astra became a planet to be used as a minor experiment. A group of Americans under UN charter set out to make a colony on Astra, eager to make a home where they could live in peace and without the fear of terrestrial wars. All was fairly routine, until the planet began to play tricks on the colonists.First there were magnetic-field shifts; then all metal in contact with the ground disappeared. Colonel Merideth, in charge of the colony, was having enough trouble with unrest among farmers without the specter of bizarre planetary characteristics. But when the first metal cable erupted from what had appeared to be a dormant volcano, Merideth realized that Astra was not merely a metal-poor planet. An unknown race, dubbed the Spinners, had left a working artifact behind. Suddenly, he was in charge of a hot property, one fervently desired by all who had ignored it before: the UN, the U.S., and the alien races in nearby space, the Rooshrike, the Ctencri, the Poms, the Whissst, and the Orspham.Being in charge and staying in control are two different things, and Merideth and his crew would need all their wits, as well as considerable Yankee horse sense, to keep from being overrun by dangers -- from Earth, or from the stars. Only when they discover the ultimate secret of the race of Spinners will the Astrans know the key to their own future.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "Timothy Zahn",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/216446.Spinneret"
}