{
  "title": "Bonds of the Wolf",
  "description": "Moya’s ugly past left her fearful of dominant males. And now, when males push her, rather than giving in, she punches them. One morning, after hours of being harassed by the wolf pack’s belligerent alpha, she mistakenly hits a blameless male—a wolf-shifter new to town.To Moya’s dismay, the wolf-shifter and his brother are under-paw everywhere.Confident and powerful, darkly gorgeous Patrin exudes a terrifying dominance. His brother Fell is blond, muscular, and obviously deadly. When they step in to save a couple of cubs from a bully, she’s torn between her heart and her fears.Patrin thinks the tiny female who punched him is adorable,and his silent brother actually laughs. Fell rarely speaks and hasn’t since they were children, imprisoned and trained as assassins by the brutal humans in the Scythe. Free for only a year, Patrin, Fell, and the other shifter-soldiers, are eliminating the Scythe to keep their people safe. He and Fell have been sent to this small town to serve as bait.Patrin and Fell have never considered staying in one place, and they’re surprised to be welcomed by the shifter community. After so many years with humans, they’ve never felt part of a clan. They certainly never considered getting involved with anyone.But there’s something about the tiny shifter female with the quick fists…Two heart-wounded, powerful brothers, a feisty bookstore wolf, a loyal wolf pack, and a whole territory of shifters must fight to survive a malicious pack alpha and the merciless Scythe humans. found family, belonging, slow-burn to steamy menage, small-town romance, coffee and books, cooking lessons, pack runs in moonlit forests, and singing to the moon.",
  "genres": [
    "Paranormal",
    "Shapeshifters",
    "Paranormal Romance",
    "Fantasy",
    "Romance",
    "Urban Fantasy",
    "M F M"
  ],
  "author": "Cherise Sinclair",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/216421121-bonds-of-the-wolf"
}