{
  "title": "Turtle Valley",
  "description": "My memories are so like that hat full of butterflies, some already deteriorating the moment they are collected, some breathed back to life now and again, for a brief moment, by the scent on a passing wind–the smell of an orange, perhaps, or a whiff of brown-sugar fudge–before drifting away, just out of my reach. How much of myself flits away with each of these tattered memories? How much of myself have I already lost? (Turtle Valley, p. 289)Kat has returned with her disabled husband and young son to her family’s homestead in Turtle Valley, in British Columbia’s Shuswap-Thompson area. Fire is sweeping through the valley in a ruthless progression toward the farm and they have come to help her frail parents pack up their belongings. Kat’s mother, Beth, (the now elderly protagonist of Anderson-Dargatz’s first novel, the award-winning The Cure for Death by Lightning) is weighed down by her ailing husband, Gus, and by generations of accumulated detritus. But there is something else weighing her down, a secret she has guarded all her life. Kat is determined to get to its source before fire eats up all that is left of the family’s memories.Kat has her own burdens. Her father is dying, and the family has chosen to keep him home as long as possible in defiance of the approaching flames. Beth is showing signs of early dementia. And her husband, Ezra, is a husk of his former self, stolen from her years ago by a stroke and now battling frightening mood swings and a trick memory. Once filled with passion and hope, their relationship has become more like that of nursemaid and invalid. Now thrust into contact with her parents’ neighbour Jude, her lover before Ezra, Kat finds his strength attractive, as well as his ongoing passion for her. As she considers her choices in love, Kat discovers that her grandmother, Maud, to whom she bears an uncanny resemblance, was once faced with a similar dilemma when forced to choose between the capricious violence of her shell-shocked husband, John Weeks, and the rugged constancy of their neighbour Valentine Svensson. Leafing through Maud’s scrapbooks and long-hidden love letters, Kat begins to unravel the mystery of her grandfather’s disappearance in the mountains. She is to find that like most family secrets, this one is tangled amidst generations of grief. As sparks rain down upon them, Kat tries to hold her family together, soothing Ezra’s rages, comforting their son, Jeremy, tending to her mother’s fragile mental state and striving to keep her father at home and comfortable as he nears death. Masses of ladybugs swarm through the house and panicked birds smash windows. Shadowy ghosts flit in and out of the encroaching smoke. All around them the landscape burns and terrible choices must be made. What can be salvaged? What will survive after Turtle Valley has burned?Turtle Valley is a novel of reconciliation and hope in the midst of terrible loss. Part ghost story, part mystery, part romance, the novel transcends these genres and carries its readers into new territories of forgiveness and acceptance of the difficult choices we all must make in finding our way through life and love.From the Hardcover edition.",
  "genres": [
    "Canada",
    "Fiction",
    "Family",
    "Literature",
    "Contemporary",
    "Literary Fiction",
    "Adult Fiction"
  ],
  "author": "Gail Anderson-Dargatz",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/2164768.Turtle_Valley"
}