{
  "title": "IMMORTALITY: Epocalypse",
  "description": "In the aftermath of the Epocalypse, the paradise of Babylon thrives in isolation safeguarded by a pair of Artificial Intelligences. For those deemed worthy, immortalization is within reach of a chosen few but they will pay a price far greater than anyone imagined for eternal life.\"Immortality\" is a gripping page-turner that thrusts the reader into 2063, where Mankind faces existential obsolescence with the advent of synthetic eternal life. As the conflict between technological advancement and spiritual integrity intensifies, the battle to define immortality, divinity, and humanity is further complicated by the enigmatic nature of consciousness itself.An exploration of Man’s view of himself, through the lens of self-perception, and one’s belief in a life beyond that of their mortal self. It is a cautionary tale. Like a toddler with a handgun, or Oppenheimer’s Manhattan Project, humanity invites disastrous consequences when our capabilities outstrip our competence.Immortality is already getting high praise from critics“A compelling, frightening look into the future as A.I. rules the world and determinesoutcomes. ‘Immortality’ delves into the inherent conflict between seeking eternal lifethrough the use of machines and trying to live without them.This post-apocalyptic talemakes for a thrilling ride to a life of robot rule and beyond.”John J. Kelly, Detroit Free Press\"A novel written by someone who knows advanced computing and human behavior extremely well, will take you down AI paths you never imagined…Keep an open mind and buckle up for a fascinating ride through time, space, energy and life.\"Brad Butler, Author, \"Without Redemption\"5-Stars“Readers will both be engulfed by the story and provoked into thought about a question that scientists, theologists, philosophers, storytellers, politicians, and free-thinkers have asked for decades: Could Artificial Intelligence, as it keeps moving toward its full potential, evolve or destroy humanity?”Chris Cordani, Host of Book Spectrum, 5-stars“A completely captivating epic saga – and an invitation to consider all possibilities of AI…Brilliant!”Grady Harp, Amazon Top 100 Hall of Fame Reviewer, 5-Stars“This is a prescient thriller that will leave one breathless and wanting to read again!”Kathryn Picard, Librarian Book Connoisseur, 5-Stars",
  "genres": [],
  "author": "David Martorano",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/216653561-immortality"
}