{
  "title": "Creatures of the Night: Vicious Vampire Tales",
  "description": "Immerse yourself in a world of terror and darkness with three vampire horror novellas.“Return of the Blood-Feeders” by Simon  Viking vampires, and their latest vicious recruits, swarm through tunnels beneath the present-day town of Leppington. The Norse gods have created a Vampyrrhic army to wreak vengeance on people that turned their backs on Odin. Just two fragile humans stand in their way—a down-at-heel drifter who is struggling to recover from a severe head injury, and a dreamer with a drink problem. Together, they must become extraordinary. Together, they must defeat something that is much, much worse than vampires.‘Return of the Blood-Feeders’ is set in the world of Simon’s Vampyrrhic series of novels.“Perspective” by Kevin J. \"This is a story of my re-awakening, and vampires.\" A couple's lives are thrown into turmoil when a body is dumped at their door. The vampires are catapulted into a blood-drenched journey to the gates of hell. Fortunately, they have some werewolf friends who want to come along for the ride.“Beneath Still Waters” by Gord  On May 16, 2020, disaster struck the small Canadian mining town of Beckley, Nova Scotia. An explosion deep in Shaft 3 unleashed a massive torrent of water from an underground stream, quickly flooding the lower levels and dooming the workers below. Sixty-five people lost their lives that night, the tragedy one of the worst mining disasters in the province’s history. The Red Spruce Gypsum Mine would never reopen.The town tried to turn the heartbreak into something positive, converting the flooded quarry into a natural swimming hole for people to cool off in during the hot summer months. But something has awakened from within the abandoned mine shafts and staked its territory in the deepest part of the lake. Something ancient. Something savage. Something hungry…If you're a fan of extreme horror books, gothic suspense, and supernatural terror, this collection is your gateway to fear. Dive into these suspenseful gothic horror novellas and discover why this horror anthology is a must-read for lovers of vampire fiction.Don’t miss out on this dark adventure. Order your copy now and let the nightmares begin!Proudly represented by Crystal Lake Publishing—Tales from the Darkest Depths.",
  "genres": [
    "Horror",
    "Vampires"
  ],
  "author": "Simon Clark",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/216729423-creatures-of-the-night"
}