{
  "title": "The Eternal Plan: Revealed",
  "description": "The Eternal Plan - RevealedI grew up in a family half of whom were spiritualists. My father's half that was, but my mother believed in it too. Do you know what spiritualism is? Well, it is probably different things to different people, depending on how much they can see; or how aware they are.In my case, we were encouraged to talk about our dreams at breakfast and no matter what you said, no one laughed. I also remember 'coming downstairs' as a toddler to tell my father that I could not sleep because 'the Red Indians were making too much noise\".There were no complaints. My Dad, Colin Jones, just took me back to bed and told the Indians to keep the noise down or go elsewhere. It worked and I can hear you unbelievers saying 'a trusting child'. Yes, that was true, but my father's attitude never changed one iota over the next forty odd years.I saw my father carrying out automatic writings and drawings in full view of the family with his eyes shut. There was never a mistake or an alteration and the scripts were signed and different signatories wrote in different handwriting. However, when one guide came to dad twice, the hanwriting would be the same.I was about ten before I realized that not everyone was the same; that not everyone had parents (and my father's parents) like I had. No one ever told me that Dad was a medium.Decades later he would joke that he was 'a happy medium'.This brings me to think about the word 'medium'. Nowadays, we think of a medium as a 'go between' - something that passes on information. In the early days, it was usually a town crier, then a newspaper and now a hard-drive, flash drive or whatever.However, presumably there have been human mediums since the beginning of the human race and maybe even before, so what were people like that called then?Shaman, seer, witch doctor, old wife, witch, warlock? Perhaps.A human spiritual medium is still a go-between though. A converter or transformer.A human medium is the modulator that converts high-frequency spirit messages into low-vibration human activity such as speach, text, art and music. For make no mistake about it, artists are inspired and the best artists are the most inspired whether they know it or not, which is why I said at the beginning of this article that one's understanding of spiritualism depends on one's level of awareness, although this does not mean that just because you know it works like that that you can hear spirit any clearer.It just means that you don't hang up the phone so quickly because it's a bad connection.",
  "genres": [
    "Spirituality"
  ],
  "author": "Owen  Jones",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/21662018-the-eternal-plan"
}