{
  "title": "Byzantium: The Surprising Life of a Medieval Empire",
  "description": "Byzantium. The name evokes grandeur and exoticism - gold, cunning, and complexity. In this unique book, Judith Herrin unveils the riches of a quite different civilization. Avoiding a standard chronological account of the Byzantine Empire's millennium - long history, she identifies the fundamental questions about Byzantium - what it was, and what special significance it holds for us today.Bringing the latest scholarship to a general audience in accessible prose, Herrin focuses each short chapter around a representative theme, event, monument, or historical figure, and examines it within the full sweep of Byzantine history - from the foundation of Constantinople, the magnificent capital city built by Constantine the Great, to its capture by the Ottoman Turks.She argues that Byzantium's crucial role as the eastern defender of Christendom against Muslim expansion during the early Middle Ages made Europe - and the modern Western world - possible. Herrin captivates us with her discussions of all facets of Byzantine culture and society. She walks us through the complex ceremonies of the imperial court. She describes the transcendent beauty and power of the church of Hagia Sophia, as well as chariot races, monastic spirituality, diplomacy, and literature. She reveals the fascinating worlds of military usurpers and ascetics, eunuchs and courtesans, and artisans who fashioned the silks, icons, ivories, and mosaics so readily associated with Byzantine art.An innovative history written by one of our foremost scholars, Byzantium reveals this great civilization's rise to military and cultural supremacy, its spectacular destruction by the Fourth Crusade, and its revival and final conquest in 1453.",
  "genres": [
    "History",
    "Nonfiction",
    "Medieval",
    "Medieval History",
    "European History",
    "Religion",
    "Ancient History"
  ],
  "author": "Judith Herrin",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/2166088.Byzantium"
}