{
  "title": "EVERYTHING ABOUT HAPPY LONGEVITY - EVIDENCE-BASED MEDICINE: EAST MEETS WEST",
  "description": "Happiness engenders longevity. Longevity without happiness is meaningless. Dr. P. Albert Chan is a preventive cardiologist. In this new book, Everything About Happy Longevity, he reminds us of that rule #1 of longevity is not to die young. Nowadays, dying before 90 years old is considered dying young. Everyone should understand one’s risk for the 5 devils – heart disease, stroke, cancer, diabetes, and dementia. This book will teach you how to prevent and reverse these 5 devils.All the recommendations in this book are based on Dr. Chan’s many years of research and practicing medicine experience and backed up by current evidence-based medicine. It is a comprehensive guide on Happy Longevity.Diet and exercise remain the best anti-aging therapies while all the billionaires, dictators and celebrities are searching for the anti-aging magic drugs. What kind of diet is the best currently? Why AI-Gym will be the ideal exercise program for everyone? The book also covers some of the newest medical topics on longevity – Long Covid on life expectancy, newest anti-obesity injection medicine, whole body MRI scanning as a screening test, new Alzheimer’s disease medication, inflammation, alcohol consumption – the Sin vs Joy effect on longevity.The whole book is presented with simple English without jargons or complicated medical parlance. It consists of many simple guidelines to obtain a happy, healthy, long, and independent life with stamina. There is a 5Fs recommendation for Happy Longevity – Fitness, Family, Fortune, Fame, and Fun. A Clinic for Happy Longevity should be the ideal place for proactive preventive medicine.Important issues like keeping your companion healthy and alive, or at least get a dog, aging at home instead of a nursing home will add many happy years to your life. The chapter on East Meets West shows what we can learn from the East on a happy and long life. All are presented as a no-nonsense, concise, and accurate way.The final chapter will shine some light on what we will expect from the newest anti-aging life while what we all should do now to ensure a Happy Longevity no matter how old you are.",
  "genres": [],
  "author": "Dr. P. Albert CHAN",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/216704417-everything-about-happy-longevity---evidence-based-medicine"
}