{
  "title": "Roan",
  "description": "Long ago, the Tinkers exiled themselves, sailing from the west of Ireland, their women weeping in despair over the men folk who had consorted on the sand with the shape-shifting Roan, non-human beings from Celtic myth. The sea-wives had returned in the shape of seals bearing pups that transformed to human children as soon as they touched the sand. 'Dark ones', the Tinkers called these offspring and claimed them as their own. Traveling to the New World, they found the spot where two rivers flowed together–a thin place, where myths from many cultures converged and legends came to life. There, for a century and a half, the 'dark ones' stayed hidden and the town kept their secrets.That’s how Conor Archer heard it in the days after he arrived at Tinker’s Grove, Wisconsin. Three days earlier, the night his mother died, the seventeen year old was playing in a pickup band at a downtown Chicago Irish bar. A strange biker approached him, looked at Conor’s webbed hands, pronounced him kin, and then took a chunk out of the boy’s palm with weird pointed teeth. Racked with pain, he found himself at Buckingham Fountain, bleeding and delirious. He saw a woman there, washing her hair in the sparkling water. Dazzled by her beauty, he allowed her to wrap his bleeding hand in a piece of her dress. Incredibly, she aged to an old crone before his eyes, and then told him he had less than twenty-four hours to live. Conor made it back home to hold his mother as she passed, her last words a whisper for him to go to Tinker’s Grove, his only hope for salvation.He did as she said; his fever left only when Malachy, the Abbot from the town monastery, took him down to the river where an old Indian Mound stood. With the twins, Jace and Beth Michaels by his side, they watched in wonder as something came out of the Mound, vaguely human, and healed the boy. A murky prophecy was spoken about Conor, but what he remembered more clearly was looking out at the river and seeing a shadow there of Piasa, the legendary Native American river demon, gazing at him with hungry eyes. Most of all he remembered Emily, his aunt, aged but loving, who took him in and gave him a home.No peace for him though--he was changing. He ran in the night like a wolf and flew through the trees like an owl. Strange visions of what might be, and glimpses of otherworldly beings in the forest troubled him.Conor’s nemesis is Caithness McNabb, wealthy landowner, who has a plan for power and riches for her and her three misbegotten sons. Selling land to a genetics company, she hires Dr. Nicholas Drake, respected bio-geneticist, to come and learn the secret of the ‘dark ones.’ Cate is motivated by Piasa, who whispers fame and glory to her in the night as she walks the banks of the Wisconsin River. The monster has told her who lives in the Mound, an immortal Welsh prince named Madoc, exiled by his countrymen centuries ago because of his strange affinity with the Roan. He’s Piasa’s mortal enemy, and an alliance with Cate will give Piasa the chance it needs to rise to power, spreading evil and chaos through town and countryside.Into this web step Conor and his friends. When children go missing, townspeople panic thinking that their secret sins have come back to demand vengeance. Drake has abducted them and begins to experiment on them, seeking the source of their shape-shifting power.All that Conor and his friends can do is awaken the power of the land and allow long dead myths to come to life. Conor, however, runs from who and what he is, becoming his own worst enemy. Beth carries his child and those who hate Conor need the infant to rise to power.All seems lost as science and technology clash with myth and legend–two dying worlds trying to survive. The outcome will rest on whether Conor will accept who and what he is. Set in the present, but spanning centuries, a battle for humanity and the future of the world begins anew.",
  "genres": [
    "Fantasy",
    "Young Adult"
  ],
  "author": "E.R. Barr",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/21687329-roan"
}