{
  "title": "Inquest",
  "description": "What would you do if your destiny was to bring chaos, and the end of the world?For Libby Sparks, turning sixteen means only one thing…death. Guardian rule demands she attend the ritualistic Inquest that will unveil her talents and secure her place in society. But that isn’t all that will be revealed in Libby’s case.The more talents you have the better, at least to some degree. Four or five talents will guarantee you a life of luxury, but seven…that is the mark of the Destroyer. Libby knows her Inquest will reveal her to be the Guardians’ greatest enemy. Their law requires her death before her eighteenth birthday. If she lives, prophecy foretells that the world will fall into chaos and destruction.Once her destiny is revealed, Libby is abandoned when her mother throws her out, her boyfriend tries to kill her, and her best friend shuts her out. Only Milo, a slightly grungy outcast, seems willing to be her friend—but Libby soon realizes he has secrets of his own. His secrets may very well have everything to do with her own destiny.In order to make it to her eighteenth birthday, Libby must bury her talents and convince the world she is harmless. Her plan only lasts until Milo is put in danger and Libby is forced to choose. Abandon her friend to save her own life, or embrace her destiny and truly become the Destroyer.Praise for Inquest:\"Delsheree Gladden’s breathtaking dystopian young adult novel, Inquest, is one of the most brilliant books of 2012. The characters are full of life and the story will keep you turning pages until the very end. It’s a thrill ride you’ll never forget.”—Apryl Baker, author of The Promise and The Awakening“Inquest is pure story, and I love it. Gladden seamlessly blends realities from our world with the extraordinary fantasies from hers, to create a story that’s easy to get lost in. Her characters are flawed and perfectly irrational like the rest of us, and it was nice to read a YA novel with a protagonist that was more human than hero. I’d honestly recommend this book to anyone that’s a fan of fiction.\"—Jesse Anderson, author of Trailer Park Juggernauts",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Dystopia",
    "Romance",
    "Magic",
    "Fiction"
  ],
  "author": "DelSheree Gladden",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/21682367-inquest"
}