{
  "title": "The Four Million",
  "description": "The Four Million (1906) is a collection of short stories by American writer O. Henry. Inspired by his experiences as a fugitive and in prison, these stories address themes of poverty, persecution, and hope.The Four Million refers to the population of New York City, where O. Henry was living at the time of its composition. Containing twenty-five works of short fiction, the collection includes several of the author's best-known stories. \"The Gift of the Magi\" is a heartwarming story of a young married couple who struggle to afford gifts for one another in the days leading up to Christmas. Delia, placing her husband's happiness before her own, sells her own hair in order to afford a platinum pocket watch chain. When she returns home, however, she finds that Jim has made a similar sacrifice. In \"The Skylight Room,\" a typist named Miss Leeson tries to find work while renting the smallest room at Mrs. Parker's boarding house. In a moment of quiet desperation, she names a star \"Billy Jackson\" while staring out of the room's tiny skylight, a view she soon struggles to afford. \"The Cop and the Anthem\" follows a homeless man named Soapy. As winter approaches, he commits a series of petty crimes in order to be taken to the shelter of jail. When his attempts fail, however, he discovers that justice has a cruel way of revealing itself. The Four Million, one of O. Henry's finest works, is an exemplary collection of short fiction that showcases the author's empathetic and hopeful outlook on poverty and American life. With a beautifully designed cover and professionally typeset manuscript, this edition of O. Henry's The Four Million is a classic of American literature reimagined for modern readers.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Classics",
    "Literature",
    "American",
    "Audiobook",
    "Anthologies"
  ],
  "author": "O. Henry",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/2168736.The_Four_Million"
}