{
  "title": "New Prize for These Eyes: The Rise of America's Second Civil Rights Movement",
  "description": "In this highly anticipated follow-up to Eyes on the Prize, bestselling author Juan Williams turns his attention to the rise of a new 21st-century civil rights movement.More than a century of civil rights activism reached a mountaintop with the arrival of a Black man in the Oval Office. But hopes for a unified, post-racial America were deflated when Barack Obama’s presidency met with furious opposition. A white, right-wing backlash was brewing, and a volcanic new movement—a second civil rights movement—began to erupt. In New Prize for These Eyes, award-winning author Juan Williams shines a light on this historic, new movement. Who are its heroes? Where is it headed? What fires, furies, and frustrations distinguish it from its predecessor? In the 20th century, Black activists and their white allies called for equal rights and an end to segregation. They appealed to the Declaration of Independence’s defiant assertion that “all men are created equal.” They prioritized legal battles in the courtroom and legislative victories in Congress. Today’s movement is dealing with new realities. Demographic changes have placed progressive whites in a new role among the largest, youngest population of Blacks, Hispanics, and Asians in the nation’s history. The new generation is social media savvy, and they have an agenda fueled by discontent with systemic racism and the persistent scourge of police brutality. Today’s activists are making history in a new economic and cultural landscape, and they are using a new set of tools and strategies to do so. Williams brilliantly traces the arc of this new civil rights era, from Obama to Charlottesville to January 6th and a Confederate flag in the Capitol. An essential read for activists, historians, and anyone passionate about America’s future, New Prize for These Eyes is more than a recounting of history. It is a forward-looking call to action, urging Americans to get in touch with the progress made and hurdles yet to be overcome.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Politics",
    "Social Justice",
    "Audiobook"
  ],
  "author": "Juan Williams",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/216926749-new-prize-for-these-eyes"
}