{
  "title": "pov - a breakup : for the little miss overthinkers",
  "description": "Feeling stuck in breakup blues? Flip through these poems and find the light in your heartache with poetry made just for teen and young adult girls.Love and romance are great when it's great, but when it goes wrong, losing a relationship can be hard and confusing. pov - a breakup: for the little miss overthinkers is a relatable poetry collection designed to guide teens and young adults through the ups and downs of a breakup. Packed with witty and comforting verses, this book takes you on a journey from the initial sting of heartache, to the sweet moments of self-discovery. Organized into fun, easy-to-digest prompts, each poem captures the everyday experiences of getting over a breakup - from changing your look, to dancing to that one song that used to be \"your song\".Reflect & rise above with poems for the dayswhen you've just broken upwhen you start to miss himwhen you see him again for the first timewhen someone else likes himwhen you change your hairwhen maybe you're getting over himwhen that one songs starts to playwhen you're back to loving himwhen you finally give him upwhen you want to give up on loveand much more...Whether you're stuck in a whirlwind of what-ifs or just need a little poetic pick-me-up, this collection is here to remind you that you're not alone. With a mix of accessible and classic poetry, pov - a breakup: for the little miss overthinkers turns the drama of heartache into a chance for growth and laughter.Grab your favorite blanket, curl up with these poems, and let them help you turn those tearful nights into stepping stones toward a brighter, more resilient you.For every teen who’s ever overthought a breakup and felt trapped in heartache -- this book is for you! Grab your copy today, and turn your breakup into a bright new chapter of your life.",
  "genres": [
    "Poetry"
  ],
  "author": "echo ㅈ",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/216953624-pov---a-breakup"
}