{
  "title": "Once Upon A Vale",
  "description": "- Once Upon A Vale (book 1) is a dark novel that hauntingly blends Victorian Gothic while offering a modern take on dark fantasy. Perfect for fans of Anne Rice and Shirley Jackson, among others - \nWhen seventeen-year-old Liana Vale fails to get into an elite academy that made her mother the most powerful dark witch of this age, she finds herself struggling to live up to her family's name. In order to prove herself as a skilled enchantress, she teams up with her kindred companion Brenda to create a long-lost plant rumored to hold unparalleled powers.On the same night, Liana's former lover, Abe, arrives, and with his assistance, the girls succeed. But when a formidable coven launches a daring heist to steal the plants, Liana discovers this audacious theft is merely the beginning of a looming threat: the resurrection of a dark lord, searching for an object he believes the Vales have.As she delves deeper into his grim world, she stumbles upon a revelation that shatters everything she ever knew about herself, forcing her to confront a whispered prophecy that links everything else back together.But as her mind begins to battle with light over dark—leading her closer to this mysterious object, Liana soon realizes that all along she's been trapped inside a perilous game of deceit, and the only way out, may be to lose herself to a world of darkness, where not even the crows come cawing.--please note that this book contains graphic depictions of violence and adult themes, as well as sensitive topics that some readers may find disturbing. Reader discretion is advised.--What you will find:Complex, unforgettable charactersSisterhood & found familiesIntricate world-building with flashbacksSuspenseful, twisty plotsDark magic & themes - Now, for my dearest readers:A fair warning—many of my books are emotional journeys that may bring tears to your eyes. But fear not my loves, for there will always be a glimmer of hope, a beacon of light that will await you at the end of these dark and stormy paths. With that being said, if you choose to embark on any of my series, know that the emotional investment will be rewarded with moments of joy and triumph. So, my dearest reader, take my hand, and together, let's walk through the dark, dark shadows . . .",
  "genres": [],
  "author": "J.A.  Lucas",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/216812805-once-upon-a-vale"
}