{
  "title": "Climate Confusion: How Global Warming Hysteria Leads to Bad Science, Pandering Politicians and Misguided Policies That Hurt the Poor",
  "description": "The current frenzy over global warming has galvanized the public and cost taxpayers billons of dollars in federal expenditures for climate research. It has spawned Hollywood blockbusters and inspired major political movements. It has given a higher calling to celebrities and built a lucrative industry for scores of eager scientists. In short, ending climate change has become a national crusade. And yet, despite this dominant and sprawling campaign, the facts behind global warming remain as confounding as ever. In Climate Confusion, distinguished climatologist Dr. Roy Spencer observes that our obsession with global warming has only clouded the issue. Forsaking blindingly technical statistics and doomsday scenarios, Dr. Spencer explains in simple terms how the climate system really works, why man's role in global warming is more myth than science, and how the global warming hype has corrupted Washington and the scientific community. The reasons, Spencer explains, are numerous: biases in governmental funding of scientific research, our misconceptions about science and basic economics, even our religious beliefs and worldviews. From Al Gore to Leonardo DiCaprio, the climate change industry has given a platform to leading figures from all walks of life, as pandering politicians, demagogues and biased scientists forge a self-interested movement whose proposed policy initiatives could ultimately devastate the economies of those developing countries they purport to aid. Climate Confusion is a much needed wake up call for all of us on planet earth. Dr. Spencer's clear-eyed approach, combined with his sharp wit and intellect, brings transparency and levity to the issue of global warming as he takes on wrong-headed attitudes and misguided beliefs that have led to our state of panic. Climate Confusion lifts the shroud of mystery that has hovered here for far too long and offers an end to this frenzy of misinformation in our lives. --This text refers to the Hardcover edition.",
  "genres": [
    "Science",
    "Politics",
    "Nonfiction",
    "Climate Change",
    "Global Warming",
    "Political Science",
    "Environment"
  ],
  "author": "Roy W. Spencer",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/2169922.Climate_Confusion"
}