{
  "title": "Nothing Daunted: The Unexpected Education of Two Society Girls in the West",
  "description": "In the summer of 1916, Dorothy Woodruff and Rosamond Underwood, close friends from childhood and graduates of Smith College, left home in Auburn, New York, for the wilds of northwestern Colorado. Bored by their society luncheons, charity work, and the effete young men who courted them, they learned that two teaching jobs were available in a remote mountaintop schoolhouse and applied;shocking their families and friends. \"No young lady in our town,\" Dorothy later commented, \"had ever been hired by anybody.\" They took the new railroad over the Continental Divide and made their way by spring wagon to the tiny settlement of Elkhead, where they lived with a family of homesteaders. They rode several miles to school each day on horseback, sometimes in blinding blizzards. Their students walked or skied on barrel staves, in tattered clothes and shoes tied together with string. The man who had lured them out west was Ferry Carpenter, a witty, idealistic, and occasionally outrageous young lawyer and cattle rancher. He had promised them the adventure of a lifetime and the most modern schoolhouse in Routt County; he hadn't let on that the teachers would be considered dazzling prospective brides for the locals. That year transformed the children, their families, and the undaunted teachers themselves. Dorothy and Rosamond learned how to handle unruly children who had never heard the Pledge of Allegiance and thought Ferry Carpenter was the president of the United States; they adeptly deflected the amorous advances of hopeful cowboys; and they saw one of their closest friends violently kidnapped by two coal miners. Carpenter's marital scheme turned out to be more successful than even he had hoped and had a surprising twist some forty years later. In their buoyant letters home, the two women captured the voices and stories of the pioneer women, the children, and the other memorable people they got to know. Nearly a hundred years later, New Yorker executive editor Dorothy Wickenden, the granddaughter of Dorothy Woodruff, found the letters and began to reconstruct the women's journey. Enhancing the story with interviews with descendants, research about these vanished communities, and trips to the region, Wickenden creates an exhilarating saga about two intrepid young women and the settling up of the West.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Book Club",
    "Memoir",
    "Historical",
    "Westerns"
  ],
  "author": "Dorothy Wickenden",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/11250706-nothing-daunted"
}