{
  "title": "Elven Blood",
  "description": "WINNER of the High Fantasy category in the American Fiction Awards 2024WINNER Gold - Literary Titan Book Awards 2024WINNER of the Dark Fantasy category in the Firebird Book Awards 2024Amazon Hot New Release August 2024!\"Mark Stanley demonstrates remarkable storytelling and world-building skills… His descriptive writing style effortlessly brings to life the diverse and intricate settings.\" 5 Star Independent Review - Literary TitanWELCOME TO VELLHOR—WHERE ANCIENT ENEMIES, FORBIDDEN LOVE, AND THE BALANCE OF KINGDOMS TEETER ON THE BRINK OF DESTRUCTION.Gunnar, destined heir of the Draegoor Dwarves, is irresistibly drawn to Anwyn, a formidable Elven exile. Their illicit love threatens to upend their worlds, forcing them on a perilous journey rife with betrayal and peril. To make matters more dangerous, a malevolent force is rapidly consuming their realm.Meanwhile, haunted by her past, a former assassin partners with an emerging mage to unravel a developing mystery. Before long, they’ll become ensnared in a web of treachery, binding their fates to the encroaching shadows.When darkness finally falls over Vellhor, the fate of the realm will rest in the hands of Gunnar and Anwyn.But each step toward the final battle will demand unimaginable sacrifice that will push their courage and resolve to its breaking point.How far are they willing to go to save their world?Immerse yourself in “Elven Blood”, an award winning tale of epic battles, indomitable spirits, and the relentless quest for hope. Ideal for readers who crave richly-woven fantasy worlds and unforgettable characters, this is one enthralling adventure until the very end!\"Elven Blood by Mark Stanley is an enthralling epic fantasy, blending forbidden love, perilous adventures, and escalating wars. The richly woven world and gripping narrative make it a must-read.\" 5 Star Independent Review - Readers Favorite“A dramatic epic fantasy that will draw in readers who want a great sword-and-sorcery fantasy read with more than just swords-and-sorcery! A great read!” 5 Star Independent Review - Fiona McLaren, Reedsy",
  "genres": [
    "Fantasy",
    "High Fantasy",
    "Epic Fantasy",
    "Fiction"
  ],
  "author": "Mark Stanley",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/216955322-elven-blood"
}