{
  "title": "Elizabeth's Education: The Inheritance",
  "description": "One year later.Elizabeth is facing the one year anniversary of having been collared by the dashing Lord Michael and is convinced marriage must be close at hand. But alas Lord Michael can never be taken for granted, as his spanking hand so deftly reminds her. Her disappointment at the lack of a proposal is quickly forgotten when she is jolted from her comfortable existence and transported to Hanley Hall, the home of her dearest Uncle Alf. Elizabeth is faced with the tragedy of his passing, and it is Lord Michael's Mastery that rescues her from the depths of despair.Elizabeth finds herself the owner of the impressive estate, but Hanley Hall offers far more than she could ever have imagined. She is unaware a secret lurks within its walls, which Lord Michael not only discovers, but uses to guide her to new depths of passion and depravity.But trouble skulks in the form of a handsome and wicked horse trainer working at the property's stable, bound and determined to have his way with the impressionable young woman. When Lord Michael departs for a trip to the city the man seizes his opportunity.After learning a very hard lesson, Elizabeth finds herself facing the most important trial of her young life. The Initiation into the inner circle of a secret society - COME - The Circle of Masters Extraordinaire. While she had to endure Lord Michael's personal test to win the collar, this is something else entirely. She must conquer all her inhibitions and fears if she is to pass the ultimate examination, exhibiting her depths of passion and complete submission in front of its members. But she is determined to prove herself for her Master, and when Elizabeth is determined - nothing gets in her way!",
  "genres": [
    "BDSM",
    "Erotica",
    "Historical Romance",
    "Contemporary Romance"
  ],
  "author": "Maggie Carpenter",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/21701603-elizabeth-s-education"
}