{
  "title": "Fourplay",
  "description": "'Friends With Benefits' takes on new meaning when two couples explore an inclusive lifestyle. Initially rife with mistrust and confusion, they grow together with love, commitment, and lots of wild sex. As the four of them explore their sensuality, they ultimately find the path that suits them best--intimate friendship with unlimited sexual benefits.An erotic love story for and about couples, told from the viewpoints of all participants.EXCERPT:\"I asked Sue if you and she would like to go on a swapped date with Kyle and me this Saturday. She seemed pretty interested.” Marlene’s squeals blasted Vic’s ear. He pictured Kyle’s enthusiastic squeeze at the news. “Are you?”“Are you kidding? What did you say to get her to take such a big step?” Relief flooded Vic’s body.“I was honest with her,” Marlene scolded. “Completely and utterly. She responded as any honest person does--with gratitude and eagerness to know more. What’s happened to you, Vic? Is your job making you so cynical you forgot how to love?”Vic laughed. “Maybe so. We’ll let you know the answer ASAP. I know how much Kyle likes to anticipate a new partner.”“He’s not the only one, lover. I’ve missed you, too.” Marlene’s sensual timbre turned Vic hard in two seconds flat. “But don’t rush Sue. I don’t want her scared or hurt in any way. I…I really like her.”“Marlene, that’s great!” Vic’s hopes soared. “Maybe we could hike first so she can get more comfortable with Kyle, too. That might help”Kyle’s voice returned. “My wife apparently earned her trust, buddy. Now it’s your turn. Remember what I said. Don’t lose your own moral compass and mess this up. Take a deep breath, and it will all work out. You can’t rush law enforcement, and you can’t rush feelings.”“You’re right, as always, Kyle,” Vic admitted aloud. His friend deserved the ego boost. “Thanks for being there for me…and us. Marlene, too.”“Anytime, Vic.” Kyle’s voice resonated with suggestiveness. “To really thank me, give Sue a great big wet kiss for me, would you? It’s up to you whether you tell her it’s from me or you, though….”Chuckling, he broke the connection, leaving Vic to stare out the window. The setting sun’s tangerine glow washed over the shadowed landscape below. He slammed the steering wheel, unable to stop a silly grin. Sue was interested in a swapped foursome! Vic started his Jeep and left the overlook, tires squealing, racing for home.",
  "genres": [],
  "author": "Mia Mann",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/21703711-fourplay"
}