{
  "title": "Quickies in New York: Stories, Winter To Spring",
  "description": "Winter to Spring is a collection of thirty-seven erotic stories from the popular blog Quickienewyork.com. The stories follow the life of Guy New York as he navigates the sexiest city in the world with his friends and lovers. From dive bars to underground parties, the book explores the emotional, intellectual, and often graphic sides of love, sex, and relationships.Moving between polyamory and buddhism, and from bondage to first love, the stories move from the cold snows of a New York winter to the final blossoming of Spring. Sometimes explicit, and sometimes heartbreaking, Winter to Spring is the story of real sex between real people (often two or three at a time).\"If Henry Miller were alive today (and had a visual sense as acute as his intellect) he'd be doing something like this. What I particularly love is that this is erotica that appeals to my mind and spirit as much as my blood and balls. In both words and images, Quickies in New York finds eroticism everywhere from street-level vulgar to penthouse sublime. It doesn’t shy away from the chaos and emptiness that sometimes comes on the heels of ecstasy. The work is classy, gorgeous, and thoughtful.\"--Christopher Ryan, New York Times Bestselling Author of Sex at Dawn\"Quickies in New York is a delightful original content Tumblr that features erotic photos and stories showcasing aspects of New York sex... The blog is a real gem. Bravo!\"--Violet Blue, Forbes Web Celeb, CBSi/ZDNet blogger and columnist, a high-profile tech personality and one of Wired's Faces of Innovation.“New York keeps its name for the sexiest city in the world, and it’s shown with something as simple as this photographic diary about a guy in the city who reflects on eroticism, nudity, sensuality, and sex.”--Playboy Espanol (www.playboy.es)Featured on Filthy/Gorgeous ThingsRecorded for and published on SonicErotica.comVoted #9 out of the top 100 sex blogs on Betweenmysheets.com",
  "genres": [
    "Erotica"
  ],
  "author": "Guy New York",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/11251511-quickies-in-new-york"
}