{
  "title": "I'm Over All That: And Other Confessions",
  "description": "“IN THIS THIRD ACT OF MY LIFE, MUCH HAS BECOME CLEARER. SO MUCH IS OVER, AND I AM OVER SO MUCH . . .” At a certain time in life, we all come to realize what is truly important to us and what just doesn’t matter. For Shirley MacLaine, that time is now. In this wise, witty, and fearless collection of small observations and big-picture questions, she shares with readers all those things that she is over dealing with in life, in love, at home, and in the larger world . . . as well as the things she will never get over, no matter how long she lives.Among the things that Shirley is over: people who repeat themselves (“when you didn’t care what they said the first time”); conservatives and liberals; ill-mannered young people; the poison of celebrity (“Why do so many people want to be famous when they see how it can destroy your life?”); being polite to boring people (“If they won’t stop talking, I go into a trance and meditate”); getting older in Hollywood (“How peaceful it is not to have to look particularly pretty anymore or to wear a size 6”).In the opposite camp, there are some things Shirley will never get over: good lighting (“Marlene Dietrich taught me how to light myself”); gorgeous costars (“The vanity of male actors is an impossible wall to scale”); performing live (“Yes, it is better than sex”); and above all, brave people with curious minds (“Fear is the most powerful weapon of mass destruction”).Along the way, she recalls stories of some of the true greats she has known—Alfred Hitchcock, Elizabeth Taylor, Frank Sinatra, the two Jacks (Lemmon and Nicholson)—and ruminates on the state of Hollywood past and present. She recollects her relationships and romances with politicians (including two prime ministers), scientists, journalists, and costars.An unabashed seeker of truth and unrepentant free spirit, Shirley looks squarely at a world that can irritate, confuse, and provoke her, but that can also delight her with its beauty, humor, and future promise. Reading I’m Over All That will make you feel you have been reunited with an old friend who tells it like it is but never takes herself too seriously.Shirley MacLaine may be over all that, but this irresistible book ensures that we will never get over her.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Audiobook",
    "Biography Memoir",
    "Autobiography",
    "Spirituality"
  ],
  "author": "Shirley MacLaine",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/10136504-i-m-over-all-that"
}