{
  "title": "Bigger than All the Night Sky: The Start of Spiritual Awakening. A Memoir.",
  "description": "What can bring more meaning to your life?Do you long for a more vibrant connection to God?You’re in good company. For decades, Rose Rosetree struggled with her Divine connection. Bigger than All the Night Sky is a multi-layered memoir about coming of age spiritually.At age five, Rose re-lived her Planning Meeting before birth. To her surprise, she recalled why she volunteered for The Awakening Project. (Many of you readers may have signed up for it too.)Share this teacher’s seeking-seeking-seeking from birth to age 23. Her wry sense of humor brings colorful stories to life, including:WHERE Rose’s teenage bedroom featured the pin-up image of… Picasso’s eyes.HOW this prolific author once struggled to overcome writer’s block.WHAT most students of Maharishi Mahesh Yogi have never seen even once: When Rose read him a poem, “Fealty,” it moved him to tears. (Incidentally, that same poem appears in this memoir.)Encounter a collection of Teaching Tales, all designed to resonate for you as a person who seeks more truth. Reading this book may bring your spiritual awakening to the next level.Rose Rosetree is the founder of Energy Spirituality®. Author of the international bestseller Aura Reading through All Your Senses, she now teaches an on-demand online workshop for moving past writer’s block, Creativity Secrets with Soul.Rosetree has given over 1,000 media interviews, including The View, USA Today, The Los Angeles Times, and The Washington Post. In Japan, she broke records as the most popular healer for VOICE in its 28-year history.Categories of Interest for ReadersThis nonfiction book is a Memoir. The following categories and keywords will also be relevant if you're seeking a book with the power to bring you greater clarity in life.Spiritual Memoir and Spiritual Awakening both apply.As does the concept of Spiritual But Not Religious.This book is also relevant to those with an interest in meditation, Transcendental Meditation, Maharishi Mahesh Yogi, and/or Baba Ram Dass.This could be considered a near-death experience memoir as well.It’s a Baby Boomer memoir, set in New York in the Sixties (that is, the 1960s).Many chapters qualify this to be considered a Hippie Book. Including personal references to Timothy Leary.Secular Jews – this memoir is relevant to readers who are interested in Jewish-Americans, First-Generation Americans, and American Immigrants.Finally, in a very unusual way, this memoir is about Premature Babies, i.e., Preemies. Usually such memoirs concern the parents, and how they coped with a premature child. By contrast, this book recounts personal experience of the Preemie. What it was like, moving on from the incubator and, in some respects, taking decades to catch up to normal development.Learn More about Rose Rosetree’s Books and PublicationsAs the founder of Energy Spirituality®, Rose has obtained 11 trademarks. Check her website for her latest blogposts and online workshops.Note: This book, published in 2024, is the second editon of Bigger than All the Night Sky.",
  "genres": [
    "Spirituality",
    "Memoir"
  ],
  "author": "Rose  Rosetree",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/217059446-bigger-than-all-the-night-sky"
}