{
  "title": "Dynasty",
  "description": "Being the youngest sons of the most important person in the galaxy is a demanding job -- especially when she insists they carry her scientific legacy into the future!Can Evan and Josef keep up with Stefan, or is Mother showing favoritism? When Mother suddenly announces their training at a banquet, how does everyone react? Did Stefan's last girlfriend turn him off women completely? Is Josef's lady just using him? Will Evan's girlfriend be able to keep Imperial Family secrets? And what could be causing Mother's sudden fainting spells and episodes of aphasia?As Princes Stefan, Josef, and Evan work to assimilate Empress Felice Sinclair's immensely critical stargate enterprise, they struggle with their regular University educations and political duties as well as their love lives. The concatenation of social and emotional turmoils propels them into their destinies, for they fear their mother's recent debilitation will result in the loss of her intellectual legacy to them.To also strive for their personal goals threatens to overwhelm the three princes, who are torn between the expectations of their social class and their desires to find ladies as brilliant and determined as their headstrong mother. But all previous concerns become meaningless when an Attican attack upon the Stargate Fleet tries to capture the Empress!With the Galactic Assembly following their achievements as the lifeline to humanity’s future, will the Imperial Sons be able to provide stargates on their own from now on? And will their love lives suffer from long absences, demanding production schedules, and the need for absolute secrecy?This science fiction romance is the fifth book of the seven-part To Be Sinclair series. The saga continues with DYNASTY and its companion volume LOYALTY, which detail the romances and political struggles of the youngest Imperial siblings of the Sinclair Demesnes. A few scenes describe sexually explicit behavior.",
  "genres": [],
  "author": "Eva Caye",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/21727010-dynasty"
}