{
  "title": "Stories That Crafted The Earth",
  "description": "This rare book offers tales from a host of ancient indigenous cultures on the theme of how our world was made. Gathered from the deserts of the Aboriginal Australian Dreamtime, the deep forests of the Yanomami people in the Amazon, the island nations of Native Canadians, the tall cliffs of the Hopi in the Grand Canyon, the valleys amidst active volcanoes in Bali, and sky kissing temples of the Tibetan monks high in the Himalayan mountains, the author Adrian Beckingham has left no stone unturned to bring you this rich heritage of how our human ancestors saw the beginnings of creation. In a very rare endorsement, Survival International the world's only global charity focusing uniquely on the rights of indigenous peoples worldwide, have written the concluding chapter and the book carries their logo. These stories are authentic and honour their cultural origins, passed down across the millennia through oral tradition. Nothing lasts thousands of years, passed down with no break in the chain from elders to listeners, unless it has huge value to the human spirit. As a professional storyteller the author has found human beings have a sustainable appetite for tales such as these. He has taken these stories into hundreds of schools, libraries, museums, festivals, castles, and prisons, where they never fail to inspire listeners. Considered 'medicine stories' by the cultures who have been their custodians for time immemorial, these tales are enthralling, but they are much more than that. The author is booked regularly by mental health practitioners and teachers, using these medicine tales to improve emotional well being. As Llama Khenpo Rinpoche, Official President of Buddhism in Nepal, exclaimed, \"This book will help all beings and bring peace to the world.\" These stories are a testament to the sanctity of the human spirit, the uniqueness of ourselves, and our connection to the wider world. They truly release locks in the human psyche and allow the sun to shine.",
  "genres": [],
  "author": "Adrian Beckingham",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/21729961-stories-that-crafted-the-earth"
}