{
  "title": "Rope: How a Bundle of Twisted Fibers Became the Backbone of Civilization",
  "description": "A unique and compelling adventure through the history of rope and its impact on civilization, in the vein of single subject bestsellers like Salt and CodTim Queeney is a sailor who knows more about rope and its importance to humankind than most. In Rope, Queeney takes readers on a ride through the history of rope and the way it weaves itself through the story of civilization. Considering Magellan’s world-circling ships, the 15th century fleet of Admiral Zheng He, or a Polynesian multihull with crab claw sails, he shows how without rope, none of their adventurous voyages and their discoveries would have been possible. Time traveling, he describes the building of the pyramids, the Roman Coliseum, Hagia Sofia, Notre Dame, the Sultan Hasan Mosque, the Brooklyn Bridge and countless other constructions that would not have been possible without rope. Not content to just look at rope’s past, Queeney looks at its future and how the re-invention of rope using steel strands to make wire rope and later synthetic fibers will likely provide the strength for cables to support elevators into space. Making the story or rope real for readers, Queeney tells remarkable nautical stories of his own reliance on rope to survive - “While approaching Buzzard’s Bay in the dark of night, we were hit by a fierce squall…The wrong line was eased, and the 200-pound hunk of wood that holds the top of the sail, went flying out of control, swaying wildly and threatening to knock us into the inky ocean. Finally, the proper ropes were located in the dark, firm hands hauled them taught and the gaff was brought under control. It was a sobering display of rope’s often unacknowledged role and uncredited importance.” Rope is history, adventure and the story of one of the world’s most common tools that has made it possible for humans to advance throughout the century.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Tim Queeney",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/217387948-rope"
}