{
  "title": "Ask a Matchmaker: Matchmaker Maria's No-Nonsense Guide to Finding Love",
  "description": "From renowned, fourth-generation matchmaker, Maria Avgitidis, comes a fresh, modern dating book that meets anyone navigating the world of dating and relationships where they're at, helping them to attract and grow the partnership of their dreams.We’ve all heard the complaints and struggles of dating in today’s world, where apps reign over real-life interactions and in-person meetups are routinely preceded by days of awkward messaging. Although it’s hard to let go of the dream of a romcom-worthy meet cute, interfacing with the seemingly infinite number of promising dating apps is unavoidable – but swiping through those endless profiles can make a search for “The One” feel increasingly futile, not to mention the onslaught of questions that come up once you do enter a What if my partner doesn’t want to be exclusive? How soon is too soon to move in together? Are soulmates even real?Maria Avgitidis, or Matchmaker Maria, is a fourth-generation, award-winning matchmaker, whose content is relatable, eye-opening, and revelatory. In Ask a Matchmaker, Maria is the no-nonsense friend who will give you straight, no bullshitting and absolutely no placating advice. Ask a Matchmaker will fill the gap between outdated dating books and people looking for love in today’s ever evolving dating landscape, by covering everything from personality typing systems to compatibility to Maria’s own developed rules and theories. Presented with unflinching honesty, humor, and clarity, Ask a Matchmaker doesn’t just answer questions – it equips the reader to diagnose their own relationship dilemmas and address them accordingly. Whether you’re single and floundering in a sea of dating apps or in a relationship and want to keep the spark alive, Maria is the voice of reason you’re seeking and this book is the guide you need.",
  "genres": [
    "Nonfiction",
    "Self Help"
  ],
  "author": "Maria Avgitidis",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/217387804-ask-a-matchmaker"
}