{
  "title": "Look Before You Leap",
  "description": "The second hilarious and heartwarming novel in the Miss Pretence’s Protégées Regency romp of a seriesNine years ago, Lord Guy Harrowby, Viscount of Wennington, was publicly humiliated when a reckless romantic gesture went very wrong. Despite that, his mother held tight to the promise he made her then: that she would have a house full of grandchildren by his thirtieth birthday. Still single, embittered, and swiftly approaching that milestone birthday, there’s not a grandchild in sight. His heart now lies with his land and work is his life. In desperation, his mother decides that if he refuses to venture back into society to find her future daughter-in-law, the only solution is to bring society to him via a weeklong houseparty so that she can find one for him. The first Guy knows about her plan is when her hand-picked gaggle of debutantes arrive at his estate, all competing to be his wife.After failing miserably as a governess, Lottie Travers isn’t proving to be any better at being a lady’s companion. As the only girl in an all-male household growing up, she’s developed several bad habits she can’t shake and keep getting her dismissed. Even after years of Miss Prentice’s teachings, Lottie still climbs a tree better than she embroiders, and still cannot seem to curb the desire to gallop astride a horse in breeches whenever an opportunity arises. But with the family farm in trouble, and her father now in dire need of her wages to keep it afloat, she’s determined to conquer her wildness once and for all and concentrate on her career.Even with his home full of eligible women, there is only one that catches Guy’s eye, as much as he tries to deny it. And succeeding in her new role is easier said than done for Lottie when the Wennington Estate is filled with horses and she can’t help but feel a spark around the grumpy Lord. By the end of the week, will the two of them remain stuck in their ways, or will they learn that they may just be the perfect match?",
  "genres": [
    "Romance",
    "Historical",
    "Historical Romance",
    "Historical Fiction",
    "Regency",
    "Adult",
    "Regency Romance"
  ],
  "author": "Virginia Heath",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/217387682-look-before-you-leap"
}