{
  "title": "Some Fatal Effects of Curiosity and Disobedience",
  "description": "In this campy, contemporary retelling of the Bluebeard myth, Laura Madeline Wiseman charts the love of three sisters who each marry the same man upon the demise of the sister who preceded her. Bluebeard is usually framed as a story of blood and gore, but Wiseman focuses on the love each of his unfortunate wives felt, the first blush of romance and young marriage, the complicated turns of mature desire and the past we bring into our present affections. Praise for Some Fatal Effects of Curiosity and DisobedienceSome Fatal Effects of Curiosity and Disobedience is an ingenious narrative of poems that transposes the Bluebeard myth to our contemporary lives with a chilling authenticity. The juxtapositions of desire and danger, trust and betrayal, innocence and cunning all seem absolutely modern, as if they could be happening down the street or in our own lives, even as we recognize their ancient, terrible truths. Laura Madeline Wiseman’s command of the language and balance between irony and dead seriousness is pitch-perfect and this is a haunting book. —Ellen BassWhat happens when a woman dares to enter forbidden spaces? Tucked into legend, the poems in this collection shift from sensual to sexy and from enchanting to haunting, as they explore the question. Laura Madeline Wiseman is both poet and storyteller, deftly moving back and forth through time, weaving breathtaking parts into a heart-stopping whole. —Tania Rochelle Predicated on the Bluebeard tale, Wiseman weaves a contemporary mythology that reaches more deeply and pervasively into the very human psychology and psychosis we name love. These poems traverse a dark storm of sexuality—the forbidden, the cruel, the guilty-pleasures. Lunacy and denial pulse mysteriously as mating ritual, as in these lines from “Solo Artist, Another Late Wife”: “…and she pretends for a moment / that this cheap condo is Carnegie Hall and his hands / that rain down on her are applause…” Control and conviction are knives bladed as sharply as the key to truth. Some Fatal Effects of Curiosity and Disobedience is erotic, disturbing, and utterly compelling. This collection, the stuff of nightmarish transformations, may cause you to see an altered face when you gaze in your day-lit mirror. —Lana Hechtman Ayers Wiseman’s imagination is expansive, sultry, and wild. Some Fatal Effects of Curiosity and Disobedience is a masterpiece of antonyms. Wiseman’s speaker first appears to be a traditional woman: married, want of secrets, but curious and complex. Like many women, she wrestles with society’s fetters, which is easily identifiable and sympathetic. It is in this way she acts as a great literary heroine; the reader, perhaps lost themselves, roots for her to find her footing. Just as we think we have her understood, the book quickly transforms from a biography of a marriage into a lesson in the subversive. Wiseman’s speaker does reference work in the taboo. She struggles with the direction of her sexuality, fidelity, even marrying her late sister’s dangerous husband seems to be out of her control. She has simultaneous desires: to be dominant, to be taken, to be voyeur/watched, to be pursued/left alone, to be safe, to be killed. Ultimately, this book begs the question: how well can we ever know those closest to us? And perhaps more importantly, how well can we ever know ourselves? —Danielle SellersDrawing from Bluebeard and other renderings of misogynistic myth, Wiseman captures the universal experience of love skewed by an imbalance of power. Seduction, eroticism, betrayal, self-knowledge in the aftermath—it’s all here in this beautiful book, in fierce, aching lines chiseled with elegance and compression. —Rebecca Foust",
  "genres": [
    "Poetry"
  ],
  "author": "Laura Madeline Wiseman",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/21729874-some-fatal-effects-of-curiosity-and-disobedience"
}