{
  "title": "Shadowmancer",
  "description": "​ NEW YORK TIMES BEST SELLERThis novel, Shadowmancer , reached #1 on the New York Times Best Sellers List in 2004 and has been translated into 48 languages. The second novel,  Wormwood is another New York Times best seller which was nominated for a Quill Book Award.  G. P. Taylor also authored  The Shadowmancer Returns : The Curse of Salamander Street, Tersias the Oracle , and Mariah Mundi . An apocalyptic battle between good and evil is vigorously, violently fought in British author G.P. Taylor's suspenseful, action-packed fantasy. The story, set in the 1700s on the Yorkshire coastline, revolves around Vicar Obadiah Demurral, a corrupt-but-inept, dead-conjuring \"shadowmancer\" who desires to control the universe by overthrowing God, or Riathamus. When two hard-luck near-orphans, (13-year-old Thomas Barrick, a bitter enemy of Demurral, and his troubled friend Kate Coglund) band together with a young African stranger named Raphah, they spend the rest of the book trying to stop the wicked Vicar as if their very souls are at stake...they are. Along the way, the three youths meet an enormous cast of friends and foes, some agents of Riathamus, others of Satan (Pyratheon), and some godless (but not for long) smugglers like Jacob Crane. Readers who love fanciful storybook characters will find mermaidlike Seloth, smelly hobs, leg-dragging servants, goodhearted whores, and benevolent boggles. Age-old superstitions abound, though old magic and witchcraft are clearly denounced here as the work of the devil. Indeed, the author, an English vicar himself, tells a very Christian story and his often deliciously dramatic adventure lapses into stiffly presented glowing-halo Touched by an Angel moments(readers will be lured into the Enchanted Forest, but tricked into Sunday school). Nonetheless, Shadowmancer, the first of a series, is a pageturner bursting with magic and myth, and will appeal to fantasy lovers who don't mind the Bible mixed in with their boggles. (Ages 11 and older) --Karin Snelson --This text refers to an out of print or unavailable edition of this title.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Christian Fiction",
    "Childrens",
    "Magic",
    "Christian"
  ],
  "author": "G.P. Taylor",
  "average_rating": "2.83",
  "url": "https://www.goodreads.com/book/show/2173618.Shadowmancer"
}