{
  "title": "Many Untouchable Castes",
  "description": "The book is about caste competition in feudal Rajasthan in the mid-20th century. About groups segregated by highcaste Hindus in the Marvar desert region. Castes heavily burdened by ageold customs prescribed by the feudal elite. The behaviour towards ritual untouchables. Attempts to rise in the society by leaving work disdained by others. As narrated by Tan Dan, a villager of the area.Tan Dan shows, how the villagers try to adjust to two caste ranking systems, one religious and one feudal. The changes in the ranking systems as a consequence of changed economic order. The way the new freedom of low ranked castes is used to imitate their former feudal lords, instead of building up an egalitarian welfare society. The reasons why caste traditions are maintained in a most prestigious way, rather than being phased out as a thing of the past.Customs and dictates in ancient religious texts sanctioning untouchability and discrimination, and their detrimental consequences for people treated as untouchables and as of low caste.The book deals with useful work of the badly treated feudal serfs. Such as leather work and weaving. The big social movement for leaving leather work in 1952, and the fate of a family who got outcasted by its own untouchable caste people, as the family continued to work with leather.The highly skilled but largely unnoticed work of the untouchable village weavers. The relation to the spinning of yarn, which was done within several castes. A few descriptions of the life of some women wearing traditional handwoven skirts.Cattle removal and the use of the carcass. Castes eating carrion meat. How food and water are used for displaying the caste hierarchy.Narrations about untouchable groups making a living as entertainers for other villagers. Also untouchable castes had their customary entertainers, linking families for generations.Told in a way that make seemingly incomprehensive behaviour understandable. Viewed from the angle of the villagers rather than from that of outsiders. Men, women, children, all are given a personal presentation in a sympathetic light. The closeness of some personal relationships across the caste barriers is a welcome indication of more natural contacts between human beings in future.Within the big jati (caste, species) of Homo sapiens.",
  "genres": [],
  "author": "Son Lal",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/21738087-many-untouchable-castes"
}