{
  "title": "Disavowals: Or Cancelled Confessions",
  "description": "Memories? Choice morsels. My soul is fragmentary.--from DisavowalsClaude Cahun (1894-1954), born Lucy Schwob, was a poet, performer, resistance fighter, prisoner, Surrealist, \"constructor and explorer of objects,\" photographer, and \"queer freak\" who invented her life by flaunting the interchangability of roles and playing with the ambivalence of identity. Whether feigning vulnerability on the arm of her lover and stepsister Suzanne Malherbe aka Marcel Moore (\"the other me\"), making theatrical public appearances in disguise (sailor, gymnast, gypsy), or making herself up (vampire, Buddha, mannequin, angel) for self-portraits and installations, she rendered opposites inoperative and exposed the thinness of gender and power constructs by reducing them to mere surface costumes. In May 1930 Editions Carrefour of Paris published 500 copies of a book called Aveux non avenues, in which Cahun explored these same dialectics in book form. It is the nearest thing to a memoir Cahun wrote, but in fact the book is an anti-memoir, a critique of autobiography, where she uses subversive photomontages and statements to present herself as a force of genius possessed of the need to resist identification and to maintain within herself \"the mania of the exception.\" Disavowals is the first appearance of that work, widely considered to be her most important text, in English. Reproductions of the original photomontages introduce the various sections, which in turn explore Cahun's distinctive ideas and obsessions--self-interrogation, narcissism, metamorphosis, love, gender-switching, humor, fear. An extensive introduction by Tate curator Jennifer Mundy sets the text in the context of Cahun's life and art. Also included is a translation of the original preface by Cahun's friend Pierre Mac Orlan, a comment by her biographer, Francois Leperlier, a note on the translation by Susan de Muth, and a postscript by Agnes Lhermitte.\"",
  "genres": [
    "Art",
    "Queer",
    "Poetry",
    "Nonfiction",
    "Essays",
    "Memoir",
    "LGBT"
  ],
  "author": "Claude Cahun",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/2172464.Disavowals"
}