{
  "title": "Water for Gotham",
  "description": "Water for Gotham tells the spirited story of New York's evolution as a great city by examining its struggle for that vital and basic element--clean water. Drawing on primary sources, personal narratives, and anecdotes, Gerard Koeppel demonstrates how quickly the shallow wells of Dutch New Amsterdam were overwhelmed, leaving the English and American city beleaguered by filth, epidemics, and fires. This situation changed only when an outside water source was finally secured in 1842--the Croton Aqueduct, a model for urban water supplies in the United States.As the fertile wilderness enjoyed by the first Europeans in Manhattan vanishes and the magnitude of New York's water problem grows, the reader is introduced to the plans of Christopher Colles, builder of the first American steam engine, and of Joseph Browne, the first to call for a mainland water source for this island-city. In this vividly written true-life fable of the \"Fools of Gotham,\" the chief obstacle to the aqueduct is the Manhattan Company. Masterminded by Aaron Burr, with the complicity of Alexander Hamilton and other leading New Yorkers, the company was a ruse, serving as the charter for a bank--today's Chase Manhattan. The cholera epidemic of 1832 and the great fire three years later were instrumental in forcing the city's leaders to finally unite and regain New York's water rights.Koeppel's account of the developments leading up to the Croton Aqueduct reveals it as a triumph not only of inspired technology but of political will. With over forty archival photographs and drawings, Water for Gotham demonstrates the deep interconnections between natural resource management, urban planning, and civic leadership. As New York today retakes its waterfront and boasts famous tap water, this book is a valuable reminder of how much vision and fortitude are required to make a great city function and thrive.",
  "genres": [
    "History",
    "New York",
    "Nonfiction"
  ],
  "author": "Gerard Koeppel",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/217333.Water_for_Gotham"
}