{
  "title": "The Taking",
  "description": "In his critically acclaimed novel, Longing, J. D. Landis explored the volatile nature of passion as he brought to life the extraordinary marriage of Robert and Clara Schumann. It was a fervent love story that unfolded against the lavish backdrop of the Romantic Age. Now Landis tells a haunting story set amid a sylvan cluster of towns, villages, and graveyards in New England— nestled in a valley that would be purposely flooded in the late 1930s to create the Quabbin Reservoir. Communities would be destroyed, lives uprooted, connections to places of birth severed, and the dead would be exhumed and reburied.The fate of Swift River Valley holds a strange fascination for seventeen-year-old Sarianna Renway, a wayward student obsessed with the life and work of poet Emily Dickinson. Sarianna finds herself drawn to this little world whose end is predetermined and whose time is drawing near. In the small hamlet of Greenwich Village—abandoned, beautiful, doomed—Sarianna takes a job tutoring a minister’s son.A man of deep faith, Jeremy Treat strives to instill hope into a town destined to be taken and lost forever. He vows to be the last one in the valley to ensure his remaining flock leaves safely. Eleven-year-old Jimmy, “the perfect representation of God on earth,” is a curious and compassionate child prodigy. The matriarch of the household is twenty-six-year-old Una, a voluptuous eccentric who embraces scandal—and pines for the one true love who disappeared almost twelve years ago on the day she became Jeremy’s wife. When the mysterious Ethan Vear resurfaces, none will emerge unchanged—especially Sarianna, who finds herself ensnared in a triangle of shifting identities and warring passions. In lush, evocative prose, J. D. Landis takes these vivid characters—their secrets, their temptations, their desires—and creates a stunning New England gothic novel of sexual awakening, profound loss, and thwarted love.",
  "genres": [],
  "author": "J.D. Landis",
  "average_rating": "2.67",
  "url": "https://www.goodreads.com/book/show/1125213.The_Taking"
}