{
  "title": "Immortal Dreams- Book 1: Isabel",
  "description": "I have never had a way with men, other than the random acts of nature that seemed to strike down their advances at every chance. Thanks mom, you could’ve saved me a hell of a lot of humiliation if you had let me know about all of this before now. I’m also not a looker, not like some Holleywood actress or model. I’m tall and thin enough, but I’ve got curves and by no means have I ever stopped traffic.Enter two of the most beautiful men that I have ever lay eyes upon. Make that Immortal men while we’re at it. And I suppose I should call them ‘male’ since there’s nothing human about them. All male actually, in every sense of the word. I couldn’t be more of a fool than I am around them it turns out but they keep coming back. And both of them keep telling me I’m the one. Yeah. Right. Oh, and somehow, I’m supposed to be able to determine in 10 days which one is a liar and which one really is ‘made’ for me. Things stir deliciously when either one is around and my experiences in my world are few and far between. The are both Gods in their own right and I am just one measly human. Or am I? For a little longer I suppose I am....Oh and Amele, when I’m stronger I will kick your ass for this. While I’m thankful you’re on my side, you should’ve prepared me for this! I know I know, the damned curse. But there must have been a way. The storm of Uglies grows thicker in my world and I feel completely powerless against them. For now, I’m content just kicking theirs. Powerless against the war and powerless against the advances of these gorgeous creatures that should not even exist. Whatever you do, forget everything you ever thought you’ve learned about faeries, and please, do not ever call them that!",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Fae",
    "Fantasy",
    "Fantasy Romance",
    "Erotica",
    "Magic"
  ],
  "author": "Jennifer Sage",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/21751963-immortal-dreams--book-1"
}