{
  "title": "At the Duke's Wedding",
  "description": "As society gathers at Kingstag Castle for the wedding of the year, matrimony is in the air. But who will be the bride? With swoonworthy lords, witty ladies, eccentric relatives, a gaggle of free-spirited girls, not to mention the world’s best high perch phaeton, it’s a recipe for mayhem—and romance. Award winning, best-selling authors Katharine Ashe, Caroline Linden, Miranda Neville and Maya Rodale serve up delectable Regency fun and a sexy contemporary twist in this anthology of original novellas. Four authors, four couples, four deliciously romantic surprises. When it comes to love, anything can happen… That Rogue Jack by Maya Rodale Jack, Lord Willoughby is charming, handsome, and utterly irresponsible. In other words, he’s the worst person to entrust with the ducal wedding ring. Miss Henrietta Black is prim, proper and the ideal person to help find the priceless family heirloom that’s gone missing… as long as she isn’t distracted by Jack’s gorgeous smile and tantalizing attempts at seduction. They MUST find the ring before the wedding… if they aren’t too busy falling in love. P.S. I Love You by Miranda Neville Handsome, inarticulate Frank Newnham asks for his cousin, Christian's help when he woos Rosanne Lacy by letter. Rosanne falls for Frank's delicious prose, but when they meet in person at the duke's wedding party, Rosanne can't understand why Frank seems so... dull. And why is she drawn to the dark brooding Earl of Bruton, with his scarred face and air of melancholy? When I Met My Duchess by Caroline LindenGareth Cavendish, Duke of Wessex, believes he’s chosen the perfect bride… until he meets her sister, and lightning strikes—literally! Now, he’s the only member of society dreading the wedding of the season. Or is he? Cleo Barrows can’t fathom why her knees weaken every time the handsome duke approaches, or why her sister isn’t in the clouds at the prospect of marrying him. But the more often wedding plans throw Cleo and Gareth intimately together, the faster time is running out to turn the celebration of the summer into the scandal of the year. How Angela Got Her Rogue Back by Katharine AsheWhen gorgeous Lord Trenton Ascot beckons to history grad student Angela Cowdrey from the pages of a comic book, she thinks she’s going crazy. When Trent rescues her from a lake, and she claims she’s from the future, he knows he is. But a blackmailer is threatening Trent’s family, and Angela is determined to help. While unraveling the mystery of her time-travel trip to the duke’s wedding, this modern girl and Regency lord just might discover a passion that defies centuries.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Anthologies",
    "Historical",
    "Regency",
    "Historical Fiction",
    "Novella"
  ],
  "author": "Caroline Linden",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/21744188-at-the-duke-s-wedding"
}