{
  "title": "So Gay for You: Friendship, Found Family, and the Show That Started It All",
  "description": "A intimate, hilarious memoir of art, friendship, queerness, and found family by Kate Moennig and Leisha Hailey, stars of The L Word—including never-before-shared stories and photos from behind the scenes of the show and their personal lives.  \"The point is we're all connected, see? Through love, through loneliness, through one tiny, lamentable lapse in judgment. All of us, in our isolation, we reach out from the darkness, from the alienation of modern life, to form these connections.\" — Alice Pieszecki, Season 1, Episode 2, \nThe L Word\nIn the early aughts, Kate Moennig and Leisha Hailey—both young artists trying to figure it all out—met at auditions for what they thought was just an unknown little TV show. Given that it was a show about lesbians living in LA, with the first ever ensemble cast of openly queer female characters, Kate and Leisha knew the project was going to be unlike anything else out there.What they didn't foresee was just how huge The L Word would become. One million people watched the premiere, and the show quickly turned into a groundbreaking phenomenon. Its influence on pop culture, in the political arena, and in the lives of queer—and straight—viewers has been lasting, impactful, even life-saving. But in addition to changing the course of television history, The L Word also changed Kate and Leisha's lives forever.From their first day on set, Kate and Leisha have always had each other’s backs, inseparable to the degree that the cast joked they were like a pair of pants—you couldn't have one leg without the other. Hence the name for their podcast, PANTS, born during the pandemic and now downloaded over 20 million times.So Gay for You is a love letter to a life-defining friendship over the decades, and following Kate and Leisha's unlikely and extremely entertaining journey stumbling from closeted queer kids to LGBTQ+ activists to successful actresses, podcasters, and business owners. Full of never-before-shared glimpses into the making of The L Word, Kate and Leisha's real-life loves and losses, and their status as queer icons, So Gay for You is, at its heart, a book about a deep meaningful connection with your ride or die and the gift of finding your chosen family.",
  "genres": [
    "LGBT",
    "Nonfiction",
    "Queer",
    "Memoir",
    "Audiobook",
    "Biography"
  ],
  "author": "Leisha Hailey",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/217388362-so-gay-for-you"
}