{
  "title": "American Renaissance: Missions Dangerous",
  "description": "# Critically Acclaimed by Booklife Spotlight, and winner of the Gold Badge of Literary Achievement from the International Review of Books, American Renaissance: Missions Dangerous is the first-person account of a cinematic espionage thriller series set in Paris but ripped-from-the-pages of art history and the news headlines of our current post millennial political crisis. His Code Name is \"Amadeo Effscott.\" The sole survivor of a mission of unspeakable Evil and secrecy. But why is he being hunted down now by an anonymous U.S. General and Vatican emissary on the streets of Paris, France? Part spy novel, part true biographical murder mystery, it is the haunting riddle behind a brutal police investigation that leads our narrator to try and piece together the cryptic clues of a terrifying assassination plot in real time. If indeed the artist, Sean Dorian Knight, truly lived - Who was he and why did he disappear – and why did his body of work become inexplicably erased from the historical record? Delving deep into the secrets of Biblical scripture and art history, U.S. foreign policy, and the millennial religious fervor of the day – accused of murder in the wake of the terrible reckoning and the countless deaths to occur in the streets of Paris – this first-person testimony reads like an eyewitness to history. Taking us on a gripping philosophical exploration of art, its meaning for spiritual salvation, and the ultimate consequences for civilization being revealed by a conspiracy that runs to the highest levels of government. As we come to realize what perhaps could be the greatest unreported crime in centuries to be rooted in the enigmatic role played by the CIA in the founding of Modern art. Yet in trying to understand the fate of his love and the devastating truth about why he was tasked with the historical necessity and terminal orders for the assassination of his best friend, we find ourselves squarely in the shoes of the narrator, confessing the extreme circumstances behind the deadly mission while struggling with thoughts of revenge. Questioning whether there’s a sense a higher purpose that was meant for the lethal training and combat skills, he obtained on the battlefield now about to be transferred onto the civilian plain of contemporary ideological war.A thrilling, intellectual spy mystery of historical suspense for fans of:•\t“The Sympathizer” (the 2016 Pulitzer Prize in Fiction),•\tThe Flamethrowers (a 2013 National Book Award Finalist) by Rachel Kushner•\tDonna Tartt’s “The Secret History” – or the commercial instincts of •\t“The Davinci Code” & John Le Carre – it also brings a philosophical depth which evokes the mark of a soon-to-be literary classic. A sumptuous story sprung from the pivotal crisis of our zeitgeist that is not to be missed. The unique blend of critical commentary and true espionage action in American Renaissance has the ability to intellectually engage as well as hilariously entertain on widely differing levels. It is the opening salvo in an epic spy trilogy long in the making for this 21st century moment we are living in with so much at stake.",
  "genres": [],
  "author": "Amory Patrick Blaine",
  "average_rating": "4.89",
  "url": "https://www.goodreads.com/book/show/217474474-american-renaissance"
}