{
  "title": "Black Mariah - \"A Calling\"",
  "description": "****Spoiler Alert****The author would like to alert all readers who might be interested in this new book series that you might want to skip this “longer description” provided by the publisher.Many readers may want to discover the storyline along the way rather than being given all the information contained below. Reading the details below would be similar to seeing a movie trailer that reveals much of the plot of the film in two minutes.So proceed forward with caution…Ten years ago, an alien creature, who became known as Black Mariah, came out of nowhere to stop a potential terrorist plot that would have killed thousands of people.The creature’s initial appearance caused dismay and confusion with the general public. But the alien’s repeated efforts over the years left no doubt that Black Mariah’s sole purpose was to help humanity.Now, a decade later, only a few people – criminals, terrorists, and power hungry sociopaths - choose not to celebrate Black Mariah’s long list of victorious interventions.Even the media has nothing but praise for the world’s savior calling Black Mariah a genuine hero. Most of press glorifies the creature’s invincibility because despite repeated deadly attacks, no weapon seems to harm the alien. Just when the creature seems to have suffered a mortal wound, Black Mariah will appear again, ready to do whatever it takes to save the lives of innocent people.But hidden from the world is the truth behind the Black Mariah phenomenon.THE TRUTH: The alien creature is not invincible. Over the last ten years, there have actually been twelve different Black Mariahs.Jeri Asher and Chris Dixon work for an organization that is secretly connected to the Black Mariah program. The two are the best at what they do as they recruit, train, and guide a human volunteer through a special program that prepares the volunteer to take on the responsibility of becoming the next Black Mariah.Recently, Jeri has developed grave doubts concerning the clandestine organization she works for and the true nature behind the genesis of the alien creature. She is torn about continuing with her job or revealing the secret sacrifice eleven people have made for the purpose of keeping the rest of the world safe.“BLACK MARIAH – A Calling” is the beginning of a new SF/Thriller Book Series with an original and provocative premise. Each of the novels in this series will have fast- paced mysterious storylines, driven by unexpected revelations, emotional conflict, and breathtaking action.The first book in the “BLACK MARIAH” series threatens to cause casual and jaded readers alike to sit up and take notice.",
  "genres": [],
  "author": "Richard Finney",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/21741611-black-mariah---a-calling"
}