{
  "title": "Monster",
  "description": "Powerful men, bound to one another by the common thread running through their veins— magic. In a world of Dreamwalkers, Elementals, Vamps, and any number of other beings, torrid sex as hot and dangerous as an Incubus is certainly one thing found in abundance. But the quest for true love can be a little rough, and that’s putting it lightly.  Brought together by their desire for one another and the spells of powers they wield, unlikely pairs discover the wonders of relationships that have a healthy dose of magic on the side. And when sex, sin, and supernatural powers are all put on a collision course, the results will leave you spellbound.    Monster by Erik Clarke    Book Two in the Spellbound series   Scarred. Resentful. Alone… Six years away from Max may have changed Syler too much for him to risk rekindling their relationship.   Syler Rike is a Fire Elemental and a Hunter—a member of the magical law enforcement. He’s one of the best, forced to face off against the most brutal criminals in the world. Of course, he’s also an asshole who couldn’t care less about the rules, but Syler loves his job… Even though the years have taken their toll, and he’s had to leave a lot behind.  One of those things was Max York, his Were-Shifter ex-boyfriend. When Syler left him without a word six years earlier, he figured he’d never see the man again. But now, after yet another covert-breaching show of magic in front of humans while Hunting, Syler’s been put on probation. He’s banned from using any spell-work until a trial can determine if his powers will be taken away permanently. To make things worse, he’s dumped in the town of Kelvin under the watchful eye of Will and his Vampire clan until he’s given a verdict. When he runs into Max there for the first time in years, it’s hardly the reunion either had expected.  Time has changed each man more than the other could know. Forced together by their circumstances, secrets and pain come to a head. Meanwhile, something big is happening in Kelvin, something everyone is determined to keep Syler from finding out. His trial looms, his relationship with Max has never been worse, and he can’t even use his magic. Has too much changed for them to get back what they had?",
  "genres": [
    "M M Romance"
  ],
  "author": "Erik Clarke",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/21740265-monster"
}