{
  "title": "Shadows Bright as Glass: The Remarkable Story of One Man's Journey from Brain Trauma to Artistic Triumph",
  "description": "On a sunny fall afternoon in 1988, Jon Sarkin was playing golf when, without a whisper of warning, his life changed forever. As he bent down to pick up his golf ball, something strange and massive happened inside his head; part of his brain seemed to unhinge, to split apart and float away. For an utterly inexplicable reason, a tiny blood vessel, thin as a thread, deep inside the folds of his gray matter had suddenly shifted ever so slightly, rubbing up against his acoustic nerve. Any noise now caused him excruciating pain.After months of seeking treatment to no avail, in desperation Sarkin resorted to radical deep-brain surgery, which seemed to go well until during recovery his brain began to bleed and he suffered a major stroke. When he awoke, he was a different man. Before the stroke, he was a calm, disciplined chiropractor, a happily married husband and father of a newborn son. Now he was transformed into a volatile and wildly exuberant obsessive, seized by a manic desire to create art, devoting virtually all his waking hours to furiously drawing, painting, and writing poems and letters to himself, strangely detached from his wife and child, and unable to return to his normal working life. His sense of self had been shattered, his intellect intact but his way of being drastically altered. His art became a relentless quest for the right words and pictures to unlock the secrets of how to live this strange new life. And what was even stranger was that he remembered his former self.In a beautifully crafted narrative, award-winning journalist and Pulitzer Prize finalist Amy Ellis Nutt interweaves Sarkin’s remarkable story with a fascinating tour of the history of and latest findings in neuroscience and evolution that illuminate how the brain produces, from its web of billions of neurons and chaos of liquid electrical pulses, the richness of human experience that makes us who we are. Nutt brings vividly to life pivotal moments of discovery in neuroscience, from the shocking “rebirth” of a young girl hanged in 1650 to the first autopsy of an autistic savant’s brain, and the extraordinary true stories of people whose personalities and cognitive abilities were dramatically altered by brain trauma, often in shocking ways.Probing recent revelations about the workings of creativity in the brain and the role of art in the evolution of human intelligence, she reveals how Jon Sarkin’s obsessive need to create mirrors the earliest function of art in the brain. Introducing major findings about how our sense of self transcends the bounds of our own bodies, she explores how it is that the brain generates an individual “self” and how, if damage to our brains can so alter who we are, we can nonetheless be said to have a soul.For Jon Sarkin, with his personality and sense of self permanently altered, making art became his bridge back to life, a means of reassembling from the shards of his former self a new man who could rejoin his family and fashion a viable life. He is now an acclaimed artist who exhibits at some of the country’s most prestigious venues, as well as a devoted husband to his wife, Kim, and father to their three children. At once wrenching and inspiring, this is a story of the remarkable human capacity to overcome the most daunting obstacles and of the extraordinary workings of the human mind.",
  "genres": [
    "Nonfiction",
    "Science",
    "Art",
    "Medicine",
    "Biography",
    "Memoir"
  ],
  "author": "Amy Ellis Nutt",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/10136855-shadows-bright-as-glass"
}