{
  "title": "Salvación",
  "description": "In this Latinx YA fantasy inspired by El Zorro, Lola de La Peña becomes the masked heroine Salvación in order to save her family and town from a man who would destroy it for the magic it contains...if she doesn't fall in love with one of his men first.Lola de La Peña yearns to be free from the societal expectations of a young Mexican lady of her station. She spends her days pretending to be delicate and proper while watching her mamá cure the sick and injured with sal negra (black salt), a recently discovered magic that heals even the most mortal of sicknesses and wounds. But by night, she is Salvación, the free-spirit lady vigilante protecting the town of Coloma from those who threaten its peace and safety among the rising tension in Alta California after the signing of the Treaty of Guadalupe Hidalgo.But one night, a woman races into Coloma, barely alive, to tell the horrifying tale of how her town was obliterated by sal roja, a potent, deadly magic capable of obliterating anything it comes into contact with and the man who wields it: Damien Hernández. And when Hernández arrives the next day with a party of fifty strong and promises of returning Alta California to México, Lola knows it’s only a matter of time before he brings the region under his rule—all Hernández needs is the next full moon and the stolen, ancient amulet he carries to mine enough sal roja to conquer the land. Determined to protect everything she loves, Lola races against time as Salvación to stop his plans. What she didn’t count on was the distracting and infuriating Alejandro, who travels with Hernández but doesn't seem to share his ambitions. With the stakes higher than ever and Hernández getting closer to his goals, Lola will do anything to foil his plans, even teaming up with Alejandro—who she doesn’t fully trust, but can’t help but fall in love with.",
  "genres": [
    "Young Adult",
    "Fantasy",
    "Retellings",
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Romance"
  ],
  "author": "Sandra Proudman",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/217421173-salvaci-n"
}