{
  "title": "The Other Side of Now",
  "description": "A hilarious and heartfelt novel about how loves and lives are never truly lost, for fans of Rebecca Serle and Taylor Jenkins Reid. With a leading role on a hit TV show and a relationship with Hollywood's latest heartthrob, Meg Bryan appears to have everything she ever wanted. But underneath the layers of makeup and hairspray, her happiness is as fake as her stage name, Lana Lord. Following a small breakdown at her thirtieth birthday party, she books an impromptu trip where she knows the grass is greener: Ireland. Specifically, the quaint little village where she and her best friend Aimee always dreamt of moving—a dream that fell apart when an accident claimed Aimee’s life a decade ago.When Meg arrives, the people in town are so nice, treating her not as a stranger, but a friend. Except for the (extremely hot) bartender giving her the cold shoulder. Meg writes it all off as jetlag until she looks in the mirror. Her hair is no longer bleached within an inch of its life, her skin has a few natural fine lines, and her nose looks like… well, her old nose. Her real nose.Her phone reveals hundreds of pictures of her life in this little town: with an adorable dog she doesn’t know; with the bartender who might be her (ex?) boyfriend; and at a retail job unrelated to acting. Eventually, she comes to accept that she somehow made a quantum slide into an alternate version of her life. But the most shocking realization of all? In this life, her best friend Aimee is alive and well…but wants nothing to do with Meg.Despite her bewilderment, Meg is clear-eyed about one thing: this is a once-in-a-lifetime chance to reconnect with her friend and repair what she broke. She finagles an opportunity to act in the play Aimee is writing and directing and as the project unfolds, Meg realizes that events as she remembers them may not be the only truth, and that an impossible choice looms before her.",
  "genres": [
    "Romance",
    "Fiction",
    "Magical Realism",
    "Contemporary",
    "Time Travel",
    "Fantasy",
    "Adult"
  ],
  "author": "Paige Harbison",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/217388211-the-other-side-of-now"
}