{
  "title": "The Bachelorette Party",
  "description": "Scream meets The Guest List in this wickedly compelling and compulsively page-turning thriller of friendship and murder from the author of The Lost Village, Camilla Sten.On a remote, craggy island nestled off the coast of Sweden, four friends—Tilly, Anna, Linnea and Evelina—meet every year. Best friends since childhood, the idea is to drink beer, dance by the water, and shake off the weight of life's expectations. The location of the island is a secret to everyone but them. One night of reckless fun and secret-sharing, and then they return to their normal lives.Ten years later. Ever since she was a teenager, Tessa Nilsson has been consumed by the story of four friends who disappeared on their annual trip to a remote island together. As her true crime fervor turned into a wildly popular podcast, Tessa urgently covered Sweden’s most gruesome cases, but could never find the answers behind what happened to these women who disappeared, leaving a few maddening clues but no concrete answers. Now Tessa’s podcast has crashed and burned, any chance she had at uncovering the truth vanishing with it.Anneliese is Tessa’s best friend, and before she walks down the aisle, she wants to have a bachelorette party. The Baltic Vinyasa, a sleek, sophisticated yoga retreat on a small island off the coast—one with such similar characteristics to the tragedy years ago that it raises the hair on Tessa’s neck. The idea is to drink gallons of cava, do sunrise yoga, and get in their last chance to bond with the bride. Tessa will not pass this up. It’s her last chance to find out what happened to the four women, once and for all.And it’s someone else’s last chance to get revenge.",
  "genres": [
    "Thriller",
    "Mystery",
    "Mystery Thriller",
    "Fiction",
    "Adult",
    "Romance",
    "Suspense"
  ],
  "author": "Camilla Sten",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/217388429-the-bachelorette-party"
}