{
  "title": "Up from Orchard Street",
  "description": "In the tradition of Like Water for Chocolate and A Tree Grows in Brooklyn , this exhilarating novel centered around a memorable immigrant family brings to vibrant life the soul and spirit of New York’s legendary Lower East Side.Up from Orchard Street......where three generations of Roths live together in a crowded tenement flat at number 12. Long-widowed Manya is the family’s head and its mother of dapper Jack, mother-in-law of frail and beautiful Lil, and adored bubby of Elka and Willy. She’s renowned throughout the teeming neighborhood for her mouthwatering cooking, and every noontime the front room of the flat turns into Manya’s private restaurant, where the local merchants come to savor her hearty stews and soups, succulent potato latkes and tzimmes, preserved fruits and glorious pastries.She is just as renowned for her fierce sense of honor, her quick eye for charlatans, and her generosity to those in need. But Manya is no soft touch–except, perhaps, where her adored granddaughter Elka is concerned. It is skinny, precocious Elka who is her closest companion and confidante–and the narrator of this event-packed novel. Through Elka’s eyes we come to know the fascinating characters who come in and out of the Roths’ relatives, eccentric locals, doctors, busybody neighbors–as well as the many men who try fruitlessly to win voluptuous Manya’s favors. We live through the bittersweet world of these blunt, earthy, feisty people for whom poverty was endemic, illness common, crises frequent, and zest for living intense. Money may have been short but opinions were not, and their tart tongues and lively humor invest every page. In this riveting story lies the heart of the American immigrant a novel at once wise, funny, poignant, anguishing, exultant–and bursting with love.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "New York",
    "Jewish",
    "Book Club",
    "Audiobook",
    "Chick Lit"
  ],
  "author": "Eleanor Widmer",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/217696.Up_from_Orchard_Street"
}