{
  "title": "Echoes of Fortune: The Search for Braddock's Lost Gold",
  "description": "Can one man change his past with the discovery of a lifetime?Echoes of Fortune: The Search for Braddock’s Lost Gold, a gripping historical thriller—2024 PenCraft Book Awards Winner for Best Thriller and the #1 Amazon New Release Mystery/Thriller (September 2024)—takes readers on an exhilarating ride spanning centuries.Be transported between the heat of battle during the French & Indian War and the high-stakes hunt of today. As Major General Braddock faces his final battle, a fortune in payroll disappears—centuries later, Jack Sullivan must follow the echoes of the past “Dan Brown-style” to find it.Love and loyalties will be tested, lives will be risked, and only those willing to pay the ultimate price will uncover the truth buried beneath centuries of secrecy.Described as \n“National Treasure meets Indiana Jones,”\n this action-packed historical thriller weaves cryptic codes, deadly traps, aggressive adversaries, and intense suspense, taking readers on an edge-of-your-seat adventure.Echoes of Fortune is a must-read for fans of riveting and rich historical fiction.Editorial praise for Echoes of Fortune:•\t“A thrilling race that promises both excitement and reflection. While the novel’s fast pace and layered mysteries captivate, the real charm lies in the exploration of heroism, sacrifice, and loyalty amidst the lure of untold riches.” – Books Shelf•\t“A captivating mix of history and action, seamlessly moving between timelines. The historical depth truly shines, and the themes of loyalty, a sense of duty, and the cost to people at the expense of ambition were profoundly felt.” – Anthony Avina•\t“This action-packed adventure is a showcase. David Leng is great, definitely one to watch.” – Matt McAvoyDon’t miss out on the adventure! Grab your copy of Echoes of Fortune today and join the unforgettable journey through history and mystery!",
  "genres": [],
  "author": "David R. Leng",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/217542463-echoes-of-fortune"
}