{
  "title": "Monster Stick & Other Appalachian Tall Tales",
  "description": "Brothers Paul and Bil Lepp have been winners of the Vandalia Festival Liars Contest 10 times between them, and they can truly spin a yarn. What is the Monster Stick? It's Paul's mythical nine-foot, surf casting fishing rod sporting 6 miles of 50 pound Stren carp cord, with which Paul has caught bears, boats, motor homes, and an airborne DC-6. The Monster Stick opens with a foreword by Ken Sullivan, founder of the Liars Contest, who calls the Lepps about the best natural prevaricators he's ever seen. Many of Bil's stories are about Buck-dog, Bil's extraordinary hunting dog whose mamma was a German shepherd but whose daddy was a determined and extremely prolific basset hound. You'll find hilarious stories about women, carp, catfish and bass, trains, hunting and cars. \"A man spends many sleepless nights on the riverbank trying to understand women and many sleepless nights in bed trying to understand carp.\"What's the Monster Stick? It's Paul's \"nine-foot, surf casting rod full of six miles of brand new 50-pound test Stren Carp cord with 20 pound, custom made, stainless steel, slip-sliding sinkers.\" The adventures Paul finds himself in from the day the Monster Stick comes into his life rival those of Paul Bunyan but add a modern twist, as when he somehow sets the hook in a DC-10 flown by drug smugglers. Then there's Buck-dog, Bil's \"extraordinary hunting dog, whose mama was a German shepherd but whose daddy was a determined and extremely prolific basset hound.\" Buck is smarter than your average human and stronger than four CS&X train engines pulling in unison, which he proves repeatedly as he takes on anything, including the government. These tall tales led the Lepp brothers to so many championships in the West Virginia State Liars' Competition that their amateur status was nearly revoked. But that's another tale ...AWARDSﾠ PLA/ALLS Best New Books for New Adult ReadersStorytelling World Award",
  "genres": [
    "Short Stories",
    "Humor"
  ],
  "author": "Paul Lepp",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/2176104.Monster_Stick_Other_Appalachian_Tall_Tales"
}