{
  "title": "Atom Heart John Beloved",
  "description": "Rainbow Award winner Atom Heart John Beloved chronicles the lives of two boys who become friends at age thirteen. The story is told by eighteen-year-old John, who quietly whispers to his best friend one night in bed, \"Do me.\" This novel is a breathtaking love story and an intense coming of age story that resembles no other book. John's narrative voice is one of the most unique in gay literature. Atom Heart John Beloved is literate, intimate, erotic, and delightful, delivering unexpected moments of grace.\"This novel is good . . . disturbingly good.\" - Elisa Rolle, Elisa Reviews\"A refreshing novel that makes one feel alive again.\" - Rainbow Awards\"A brilliant, funny and disturbingly honest look at teen sexuality, sensibilities, and fantasies.\" - The Wilde Writers CollectivePublisher’s Luke Hartwell has spent the past two years rewriting all of his previously published books. As his publisher, Watersgreen House has debated how to handle the new editions, which we believe to be universally better than the old. Industry guidelines suggest that for minor changes in fiction titles, a new edition labeled “revised” will suffice, but for major changes, the work needs a new title. We have deemed that the majority of Luke’s books need new titles. Here, we will offer guidance to those customers who have read the majority of Luke’s previously published work.To begin, two early Hartwell works that were published not only under different titles but under a different name have been rewritten, given new titles, and added to Hartwell’s catalogue. This includes the book that remains his masterpiece, Memory and Madness, as well as his semi-autobiographical work Who You Are and Where You Come From. We believe the newly revised Memory and Madness is a must read, even for readers who have read the earlier version, which was titled Clicking Beat on the Brink of Nada in Europe and Cody in the U.S.A.Hartwell’s other best-selling title, Atom Heart John Beloved, has retained its title even though Hartwell made some nice changes to the book. We simply love the title and didn’t want to lose it. Hartwell’s short stories “Michael” and “Nothing Strikes Back!” have also retained their titles as the revisions to them are not extensive, although both stories have been improved.The two new titles we believe Hartwell readers will want to read again (or listen to, as several of his titles are now available in audiobook format, with more to come) are Love Underneath and Space. Although the opening chapters of Love Underneath will sound familiar to those who read Hartwell’s Locomotives in Winter, Love Underneath is not the same book. Hartwell has used the opening chapters of Locomotives as a base, but the opening section has been expanded, with a new character added, and the second part of the book, while maintaining some similarity to Locomotives, contains an enormous amount of new material and a very different ending, one which we think readers will applaud.Hartwell also completely rewrote his novel Nathan’s Story to make it a stand-alone work not connected with Atom Heart John Beloved. The new work is titled Space and is available both as a single volume bearing that name and also as part of Hartwell’s collection of shorter fiction, Four Walls and a Passion. As with Love Underneath, the new book is much better than the old and contains a very powerful ending. With Love Underneath and Space, we feel readers will be missing a lot if they don’t experience the beautiful changes Hartwell has made to these books.- Michael Wilson, PublisherWatersgreen House",
  "genres": [
    "M M Romance",
    "LGBT",
    "Young Adult",
    "Gay",
    "Contemporary",
    "Romance",
    "Coming Of Age"
  ],
  "author": "Luke Hartwell",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/21758028-atom-heart-john-beloved"
}