{
  "title": "The Man with the Iron Heart",
  "description": "What if V-E Day didn’t end World War II in Europe? What if, instead, the Allies had to face a potent, even fanatical, postwar Nazi resistance? Such a movement, based in the fabled Alpine Redoubt, was in fact a real threat, ultimately neutralized by Germany’s flagging resources and squabbling officials. But had SS Obergruppenführer Reinhard Heydrich, the notorious Man with the Iron Heart, not been assassinated in 1942, fate might have taken a different turn. We might likely have seen a German guerrilla war launched against the conquerors, presaging by more than half a century the protracted conflict with an unrelenting enemy that now engulfs the United States and its allies in Iraq. How might today’s clash of troops versus terrorists have played out in 1945?In this imagined world, Nazi forces resort to unconventional warfare, using the quick and dirty tactics of terrorism–booby traps, time bombs, mortar and rocket strikes in the night, assassinations, even kamikaze-style suicide attacks–to overturn what seemed to be a decisive Allied victory. In November 1945, a truck bomb blows up the Nuremberg Palace of Justice, where high-ranking Nazi officials are about to stand trial for war crimes. None of the accused are there when the bomb goes off, but their judges, all of them present and accounted for, are annihilated. Worse acts of terrorism follow all over Europe.Suddenly the Allies–especially the United States–must battle an invisible enemy and sacrifice countless lives in a long, seemingly pointless, unwinnable conflict. On the home front, patriotism corrodes, political fortunes are made and lost in the face of an antiwar backlash, and a once-proud country wonders how the righteous fight for freedom overseas has collapsed into a hopeless quagmire. At once a novel of thrilling military suspense, intriguing alternate history, and profound insight into contemporary affairs, The Man with the Iron Heart is a tour de force by a storyteller of exceptional imaginative power.",
  "genres": [
    "Alternate History",
    "Fiction",
    "Science Fiction",
    "Historical Fiction",
    "Fantasy",
    "Audiobook",
    "Military Fiction"
  ],
  "author": "Harry Turtledove",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/2175864.The_Man_with_the_Iron_Heart"
}