{
  "title": "Blood and Chrysanthemums",
  "description": "Becoming a vampire was easier than she had ever dreamed … Living as a vampire was more complicated than she had ever expected … Understanding what it means to be a vampire would prove harder than she had ever imagined …Ardeth Alexander surrendered her mortal life in a night of despair and desire, initiated into a new existence by the five-hundred-year-old vampire, Dimitri Rozokov. Fleeing Toronto, Ardeth and Rozokov settle in the tourist town of Banff, Alberta. While she tests her new strength against the mountains by climbing, Rozokov returns to astronomy, the science of his youth. Together they hunt the dark reaches of the park, preying on the animals they find there, upholding an unspoken agreement not to taste human blood. Yet all their activity cannot disguise their restlessness and soon their fragile happiness is shattered by bitter conflict and inevitable betrayal. Angry and unhappy, Ardeth returns to Toronto to try to recatpure the life she believed she had left behind forever. What Ardeth and Rozokov do not know is that they are being hunted. A member of the yakuza, the Japanese underworld, is on their trail, seeking the fulfillment of his most secret ambition. So is his employer, Sademori Fujiwara, a vampire whose extraordinary history is revealed to Rozokov through his diary. From the seductive nights in the imperial court of the eleventh century to the horror and tragedy of the darkest days of the twentieth, Fujiwara’s story is a tale of poetry and violence, of delight and despair. In his life, Ardeth and Rozokov see the promise of the answers to the questions of love, mortality and morality that have torn them apart.",
  "genres": [
    "Vampires",
    "Horror",
    "Urban Fantasy",
    "Fantasy",
    "Fiction",
    "Canada",
    "Paranormal Romance"
  ],
  "author": "Nancy          Baker",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/2178272.Blood_and_Chrysanthemums"
}