{
  "title": "A Lover's Mentality: All or Nothing",
  "description": "Over time, I have learned that friendship, relationships, life, and, at times, dealing with others can equal to a lot of bullshit! Someone has to go through it, so why not let it be me? Everything happens for a reason right? That's what they say. But why me? Why so many ups and downs and so many trials and tribulations. I mean, is it worth the struggle? Between Shame and I, things have been chaotic! Life with me is something to talk about. I didn't kill anyone; I didn't rob anything, and I wasn't addicted to any drug. I loved, I learned, and I lived. I must admit I do have my flaws and misunderstandings, but I can only be me. I'm about lies, secrets, pain, honesty, and some other things boxed up into one personality. But at the end of the day, I will always have a story to tell.\tEver since meeting Shame, love for me has become tainted. Love has become a lesson. Love is an obstacle, a journey, a feeling. I have found and lost love many times. At least that's what I think. I have come to realize that as a child growing up it was only puppy love. I have told story after story after story, until I came to the conclusion that this is what my life is based upon. Something only you can relate to. Something he, she, and they can actually think about. That's only in my opinion. Something may be of your interest, and with me being able to tell you about me, Yemya LaShay Smith, flaws and all.\tLet me introduce you to my inside outs and twisted ways in search of love. About my deepest and darkest secrets, about my thoughts and feelings on love and the shit I had to go through only to have never gotten it. These are the chapters of my life, pages combined into one story after another. Of course, who wouldn't want to know what goes on behind closed doors? We all have skeletons in our closets. After all, this is what you have been waiting for, isn't it?",
  "genres": [],
  "author": "Sade L. Collins",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/21792535-a-lover-s-mentality"
}