{
  "title": "Mastering Mari",
  "description": "(Mastering Mari is the sequel to NY Times best-seller Training Tessa and Controlling Krysta)Watch out. Cousin Chase Maddox is back in town.Dr. Chase Maddox never felt a connection to another person like the one he felt with Mari—a girl he met at summer camp when they were teenagers. The innocent afternoon they spent alone together confirmed to him they were soul mates. She left the next day with his phone number, promising to call him soon and to meet him at camp the next year. But he never heard from her. For fifteen years, he’s been unable to learn her full name, unable to contact her…unable to forget.When she walks into his office one day as his new medical supply sales rep, he’s elated, sure his soul mate will remember him, even though he's changed drastically since his days as a small, scrawny teenager. She's sure to have a good explanation for why she never contacted him. When she doesn’t know him at all, his mind reverts to dark fantasies in which he controls her, making her bend to his will, teasing and tormenting her body until she realizes no one can bring her pleasure like he can. Then, he’ll send her away as revenge for the pain she caused him.Marissa Montero, who’s new to the job, thinks her colleague Debra is ridiculous when she tells her the doctor-clients are her real bosses and will expect her to comply with any request. Until she encounters movie-star handsome Chase Maddox who requires that she come in after hours and has her disrobe and “demonstrate” her products with him. Although Marissa feels an instant connection and is incredibly aroused by his demands, they are stepping way beyond the bounds of professional behavior. Besides, she’s sure he’s enjoying flaunting his dominance over the new sales rep. She has to stop this before it goes any farther, and the best way is to turn the account over to someone else.When he suddenly has another new sales rep, Chase is livid at being rejected by Mari again. Until he attends his cousin Mason’s 4th of July party, and Krysta \"introduces\" him to her friend Marissa. Now, all Chase has to do to make his darkest fantasies come true is entice Mari to his own secluded ranch house, right up the road.",
  "genres": [
    "BDSM",
    "Erotica"
  ],
  "author": "Lyla Sinclair",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/21775341-mastering-mari"
}