{
  "title": "Defining the Wind: The Beaufort Scale, and How a 19th-Century Admiral Turned Science into Poetry",
  "description": "“Nature, rightly questioned, never lies.” —A Manual of Scientific Enquiry, Third Edition, 1859Scott Huler was working as a copy editor for a small publisher when he stumbled across the Beaufort Wind Scale in his Merriam Webster Collegiate Dictionary. It was one of those moments of discovery that writers live for. Written centuries ago, its 110 words launched Huler on a remarkable journey over land and sea into a fascinating world of explorers, mariners, scientists, and writers. After falling in love with what he decided was “the best, clearest, and most vigorous piece of descriptive writing I had ever seen,” Huler went in search of Admiral Francis Beaufort hydrographerto the British Admiralty, man of science, and author—Huler assumed—of the Beaufort Wind Scale. But what Huler discovered is that the scale that carries Beaufort’s name has a long and complex evolution, and to properly understand it he had to keep reaching farther back in history, into the lives and works of figures from Daniel Defoe and Charles Darwin to Captains Bligh, of the Bounty, and Cook, of the Endeavor.As hydrographer to the British Admiralty it was Beaufort’s job to track the information that ships relied where to lay anchor, descriptions of ports, information about fortification, religion, and trade. But what came to fascinate Huler most about Beaufort was his obsession for observing things and communicating to others what the world looked like.Huler’s research landed him in one of the most fascinating and rich periods of history, because all around the world in the mid-eighteenth and nineteenth centuries, in a grand, expansive period, modern science was being invented every day. These scientific advancements encompassed not only vast leaps in understanding but also how scientific innovation was expressed and even organized, including such enduring developments as the scale Anders Celsius created to simplify how Gabriel Fahrenheit measured temperature; the French-designed metric system; and the Gregorian calendar adopted by France and Great Britain. To Huler, Beaufort came to embody that passion for scientific observation and categorization; indeed Beaufort became the great scientific networker of his time. It was he, for example, who was tapped to lead the search for a naturalist in the 1830s to accompany the crew of the Beagle; he recommended a young naturalist named Charles Darwin.Defining the Wind is a wonderfully readable, often humorous, and always rich story that is ultimately about how we observe the forces of nature and the world around us.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Nature",
    "Biography",
    "History Of Science",
    "Maritime"
  ],
  "author": "Scott Huler",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/2177857.Defining_the_Wind"
}