{
  "title": "Seventy Three",
  "description": "Located in central London, England, the offices of the Oakham Group provide an outlet for submissive women, both single and married. With membership through word of mouth and recommendation only, the group are able to safeguard their own, and the members privacy. With names and locations altered, and for the first time, the group have approved one of its ladies to tell her story…Catherine Adams is fairly typical of the women who apply to join the group. Happily married to Richard for eight years the couple enjoy a comfortable lifestyle without putting themselves in the ‘wealthy’ bracket. Together with her friend Helen, Catherine owns and runs a small art gallery in the city centre. At 42 years of age and with a close knit circle of friends and caring family Catherine would be the envy of many who were unaware of her secret – her desire to be sexually submissive.Suppressing her urges for many years seemed to be the sensible option. With husband Richard aware of her interest in such matters, the couple had dabbled with some light bedroom bondage, and whilst good fun it didn’t go far enough to satisfy her desire to take things much further.On a studio visit, Catherine becomes aware of the artists submissive nature and her involvement with the Oakham group. The excitement of finding somebody actually doing what she had only dreamed about provided an opportunity not to be missed.Facing the possible repercussions of admitting the true depth of her feelings to Richard proved to be a risk worth taking. With his active support the couple set out to fulfil her dreams, searching for that elusive goal.Accepted by the group, Catherine is sent to Colonel Mason for training. Being the middle aged, middle class product of a conservative upbringing conflicts begin to emerge. Facing the demeaning use of her body for sexual acts and punishment proves to be more demanding than expected, causing Catherine to question her previously held moral values and beliefs. Not wishing to keep her activities concealed from her close friends, Catherine begins to wonder whether they too have needs similar to her own.When in service at the Boardroom, a London club owned by Oakham, Catherine is recognised by a malicious adversary from her previous life. Misuse of his power over her causes major conflicts which escalate to the point where her dream could be shattered…",
  "genres": [
    "BDSM",
    "Erotica"
  ],
  "author": "Rebecca Symmons",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/21787636-seventy-three"
}