{
  "title": "Which Lie Did I Tell?: More Adventures in the Screen Trade",
  "description": "Something odd, if predictable, became of screenwriter William Goldman after he wrote the touchstone tell-all book on filmmaking, Adventures in the Screen Trade (1983), he became a Hollywood leper. Goldman opens his long-awaited sequel by writing about his years of exile before he found himself--again--as a valuable writer in Hollywood. Fans of the two-time Oscar-winning writer (Butch Cassidy and the Sundance Kid, All the President's Men) have anxiously waited for this follow-up since his career serpentined into a variety of big hits and critical bombs in the '80s and '90s. Here Goldman scoops on The Princess Bride (his own favorite), Misery, Maverick, Absolute Power, and others. Goldman's conversational style makes him easy to read for the film novice but meaty enough for the detail-oriented pro. His tendency to ramble into other subjects may be maddening (he suddenly switches from being on set with Eastwood to anecdotes about Newman and Garbo), but we can excuse him because of one fact he is so darn entertaining.Like most sequels, Which Lie follows the structure of the original. Both Goldman books have three stories about his movies, a deconstruction of Hollywood (here the focus is on great movie scenes), and a workshop for screenwriters. (The paperback version of the first book also comes with his full-length screenplay of Butch; his collected works are also worth checking out). This final segment is another gift--a toolbox--for the aspiring screenwriter. Goldman takes newspaper clippings and other ideas and asks the reader to diagnose their cinematic possibilities. Goldman also gives us a new screenplay he's written (The Big A), which is analyzed--with brutal honesty--by other top writers. With its juicy facts and valuable sidebars on what makes good screenwriting, this is another entertaining must-read from the man who coined what has to be the most-quoted adage about movie-business \"Nobody knows anything.\" --Doug Thomas",
  "genres": [
    "Nonfiction",
    "Film",
    "Writing",
    "Memoir",
    "Media Tie In",
    "Biography",
    "Humor"
  ],
  "author": "William Goldman",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/21777.Which_Lie_Did_I_Tell_"
}