{
  "title": "The Gamma Boy",
  "description": "Ever wonder what really happens behind the closed doors of a fraternity house full of the sexually-charged bodies of hot young men? The Gamma Boy is a romantic thriller that is sure to make your heart pound.When college freshman Will pledges to the exclusive Gamma Alpha Gamma fraternity, he encounters a world where sex is ever-present among beautiful, brilliant, and intimidating men. But innocent Will slowly realizes the Gamma House is more than just a fraternity. Something dark and dangerous lurks behind those stately columns.The older boy, David, who violated him and tricked him into pledging, becomes Will’s closest confidante and lover. David and Will launch a daring and secretive – and wildly passionate -- affair. But can Will really trust David?Erotic and deeply moving, The Gamma Boy is a powerful romantic thriller that will capture your imagination and spark your desires.This book is intended for mature audiences.Other works by John Shepherd:Talented Boys: The First SemesterKevin is an eager young college freshman in his first semester away from home. Exposed to the wild and hot gay scene, he loses his virginity one sultry night to a seductive older man. Before long, a parade of men turn Kevin’s adorable little body into a wild sex machine. But Kevin discovers that true love is harder to find than wild sex. And it’s hard to keep your grades up with all those men keeping your pants down!http://www.amazon.com/dp/B00IJI5YOCTalented Boys II: The Dean’s ListKevin’s first semester of college didn’t go as planned. He’d become a wild little gay slut, and his grades had suffered. But his loving boyfriend had a plan to get Will’s life back on track. But could Kevin resist the allure of hot sex and refocus on his studies?http://www.amazon.com/dp/B00IK8E4H4Talented Boys 3: Making the GradeWho hasn’t been hot for an innocent college boy? Will’s first semester of his freshman year ended in disaster: he lost his scholarship and was kicked out of school. But can he use his talents as a model – and in the bedroom – to turn his life around?The third book in the 'Talented Boys' series by noted eroticist John Shepherd, Making the Grade is a graphic work of erotic gay romance.http://www.amazon.com/dp/B00ISBEPKY",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Erotica",
    "College",
    "Gay Erotica",
    "Short Stories",
    "Gay"
  ],
  "author": "John  Shepherd",
  "average_rating": "2.75",
  "url": "https://www.goodreads.com/book/show/21794829-the-gamma-boy"
}