{
  "title": "The Seelie King",
  "description": "Tuath Stories remembered the fates of the Wishers well. Thousands of years ago, the sovereigns of the Fae lands issued a decree: The Wishers would die. Powerful magics were called forth, and in an act never before or since accomplished, both light and dark, both Seelie and Unseelie gathered together in their courts and combined their powers. The Wishers were annihilated.However... legends told how the strongest and most fortunate few managed to escape and hide themselves amongst humans in the mortal realm. But thousands of years passed with no sign of these legendary Wishers. They were declared extinct. And in its rareness, in its extinctness, the lost, most powerful class of the fae, in fact became sacred.There are a lot of things Selene Trystaine would change about the world if she could. Injustices press in, apathy reigns, and unkindness seems to have taken hold in the crevices of humanity. So when she learns that she is not who she has always believed herself to be and destiny presents her with her birthright, she must battle with her inner demons, even while the handsome and powerful king of those who’d once attempted to destroy her kind discovers her – and begins an all-out attack of seduction on her senses.No one knows Avery’s true name. He’s the king of the Seelie Fae, a powerful and ancient man who has ruled a beautiful and dangerous world in solitude for longer than human history has been recorded. And he has no reason to believe this solitude will ever change…. Until the other sovereigns of the thirteen kingdoms begin finding their queens one after another. And suddenly, on a hot Spring day, Selene Trystaine appears beside the river Thames like a mirage made real.A fiery soul, a gift of untold magic, and a Changeling without a clue as to who she is are about to turn the supernatural world upside down. But as a new and terrible war is sparked between good and evil, and the losses become insurmountable, Selene and Avery are going to learn that no matter who or what you are… you must be careful what you wish for.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Fantasy",
    "Romance",
    "Fae",
    "Magic",
    "Vampires"
  ],
  "author": "Heather Killough-Walden",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/21796457-the-seelie-king"
}