{
  "title": "Fallen Angel, Part 2",
  "description": "When Brooke Stiles had said, “It was in a small room in an office block in Washington, DC, that my life changed, forever,” she had no idea of the enormity of that statement.Just a few short months ago, Brooke, had lived a quiet suburban life in the UK. She now owns a closet of clothes she could only dream about and has been swept off her feet by trouble with a capital T.Once Robert Stone came to terms with the fact that he was in love with Brooke, he knew he could never let her go. Not letting her go means introducing her to his life, past and present. However, when Robert’s past and present collide, Brooke does the one thing that Robert begs her not to. Does it change her? Has that light that he sees in her eyes been extinguished? This is a story of an ordinary girl who finds the strength to become the extraordinary woman, and keeps her promise to the man she owes her existence to.Fallen Angel, Part 2 - A Mafia romance - contemporary romance for readers over the age of 18. Contains graphic scenes of sex.So what is the Fallen Angel series...This is a mafia 'romance', with the emphasis on the romance. The four books are narrated by Brooke, a British woman who travels to Washington, DC, and falls in love. This is her story, her journey into a world she has only ever seen in a movie. As is traditional, Brooke will be shielded from any 'mafia' activity, she won't know what's going on, what she finds out will be a surprise. Please don't go into this book expecting a gun-slinging mafia moll from the 1950's :) This is a modern take on what the mafia are now, in the twenty-first century. There is a reason for the title, you'll discover this throughout the books. There are four books in this story so, no, you won't know it all in book one. I wanted to explore what it would be like for me, or you, to fall into a world we have no knowledge of. It's my belief that perhaps, we as British women, wouldn't take it seriously, perhaps we'd find it exciting. Our major reference into that world is a movie made a lot of years ago :) I hope you enjoy the read.This book is not paranormal, has nothing to do with angels, fallen or otherwise.",
  "genres": [
    "Romance"
  ],
  "author": "Tracie Podger",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/21793386-fallen-angel-part-2"
}