{
  "title": "Dreams to Action Trailblazer's Guide",
  "description": "You need more than a dream to get what you want. You need a rock-solid plan of action to get you there.Dreams to Action Trailblazer’s Guide is your essential guide with everything you need to transform you dream into reality. Julie Connor will inspire and motivate you with practical tools to clarify your dream, create a personal vision and mission, align your purpose with your core values, and build attainable goals that lead to success. As a popular keynote-speaker, leadership expert, goal-setting strategist, and best-selling author, Dr. Julie Connor has shown students and adults, schools and churches, businesses and adults how to dream big, work smart, and plan for success for more than 30 years. Dreams to Action Trailblazer’s Guide is packed with Julie’s best tips to reach your goals. Learn more at www.DrJulieConnor.com.Dr. Julie Connor redefined goal setting and built a “dream-setting” framework that is pragmatic, easy to follow, and extremely comprehensive. The steps she takes you through will open your heart, your mind, and your soul to the dreams that live within you. Through her innovative tactics, you will not only have the tools to give birth to your dreams, but envision them like never before!Rebekah Radice, social media & content marketing expert, Los Angeles, CADr. Julie Connor’s book is thought-provoking and insightful as you pursue your dreams. It is laid out like a guidebook to take you from point A to point B with grace and ease. I encourage you to take the next step on your journey and move your dreams to action.Dr. Michelle Robin, author of Wellness on a Shoestring, Shawnee, KSDreams to Action Trailblazer’s Guide distills the process of creating a soul-satisfying and fulfilling life into accessible, approachable steps. If you follow the roadmap developed through Julie’s own inspiring journey, expect to be enlivened and transformed!Dr. Christy L. Johnson, Intuitive Heal LLC, Williston, VTDr. Julie Connor’s work is dedicated to helping people clearly define their dreams, identify their resources, and discover the means to uncovering their greatness. Read and apply the wisdom contained in Dreams to Action Trailblazer’s Guide – you will be given a clear road map to envisioning and manifesting your destiny. You will be glad you did.Brian K. Knight, host of Success Profiles Radio, Chandler, AZ",
  "genres": [
    "Self Help"
  ],
  "author": "Julie Connor",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/21793696-dreams-to-action-trailblazer-s-guide"
}