{
  "title": "The Entrepreneur Blueprint: How To Fix Your Focus & Mindset To Develop A Successful Game Plan",
  "description": "Are you on of those \"crazy entrepreneurs?\"get inspired and motivated!As an entrepreneur, you are probably used to experiencing the highest of highs and lowest of lows. You may be accustomed to flashes of brilliance and dealing with way more failures than you ever saw coming. You’re familiar with questioning your decision to “go it alone”, and making difficult sacrifices for a minimum of returns all in the name of building your dream business.After all, no one becomes a successful entrepreneur without spending sleepless nights wondering if they are ever going to get over the hump and finally get going on the right track. Our hope for you is that this book will help you understand that you are not alone (although you may very well be “crazy”), and that the power to control your focus, creativity, and results rests firmly in your own hands.What you can expect to learn about! Inspiration Motivation Business self help Avoiding guilt Validation˃˃˃ Who is this book for?If you have been an entrepreneur for any length of time you have experienced some of the highs and lows we talk about in this book. You have felt the need to justify your passion and wonder when you are going to get permission to feel okay about it.We are sure it is no newsflash to you that almost no one around you can understand your entrepreneurial zeal. Most \"normal\" people are not excited by the prospect of trying something new and can't understand why you can't just \"get a real job\".But if you are a true entrepreneur, the thought of a real job is about the worst thing you can imagine!˃˃˃ Some of the topics we coverIntroduction To EntrepreneurshipWe Identify With You, Heck We Are YouFocus Schmocus, Goal Setting And Working HardHow You Do Anything Is How You Do EverythingThe Company You KeepFinding Your PassionHaving Great Ideas, A Get Rich Slow Kind Of SchemeThe Difference Between Failing and Not WorkingObstacle Illusions, Good Is Good EnoughTin Cup, When Do You Give UpConclusion - Go Big Or Go Home˃˃˃ You are not alone!This book is chock full of great information, encouragement and examples of people who have been right where you are and come out successful on the other side.Whether you need a kick in the pants to get going or a soft place to land, you will see your hopes and fears, struggles and triumphs on each page!",
  "genres": [
    "Business"
  ],
  "author": "Tara Jacobsen",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/21796574-the-entrepreneur-blueprint"
}