{
  "title": "Let's Misbehave",
  "description": "Over 3.5 million readers have fallen in love with the women in Kate Perry's bestselling Laurel Heights series. Now get scandalous with her Summerhill sisters...Summerhill, Book 3Imogen Summerhill, box office darling, has never wanted to be in the spotlight less.When racy photos—and video!—are leaked by her sleazy ex, her studio couldn't be happier. All press is good press, and this will only enhance the intrigue about her upcoming blockbuster. But how is Gigi supposed to be taken seriously as an actress with all this inappropriate buzz? She’s Cate Blanchett, not Kim Kardashian.But then Gigi meets Merrick Graham, the Bad Boy of Politics. The last thing either of them wants is to be tainted by more he needs the support of the conservatives, and she wants to untarnish her image.Only they can't resist each other—separately they're good, but in the bedroom they're even better. They can’t be seen together in public, but in private all’s fair game, and there’s plenty of room to misbehave...Fall in love with the Summerhills...Book 1: Say You WillBook 2: Lost in LoveBook 3: Let's MisbehaveBook 4: Stay the NightTake a trip to San Francisco's Laurel Book 1: Perfect for YouBook 2: Close to YouBook 3: Return to YouBook 4: Looking for YouBook 5: Dream of YouBook 6: Sweet on YouBook 7: Tamed by YouBook 8: Here with You All for YouBook 9: Mad about YouBook 10: Loved by YouLike strong independent women and the sexy alpha heroes who love them? Are you a fan of the greats like Bella Andre, Kristan Higgins, and Marie Force? Then try Kate's quirky romances. We think you'll love them, too.\"Kate Perry is on my auto buy list.\" –Night Owl Romance\"Hot! Recommended!\" –Bookpleasures\"Kate's brilliant, as evidenced by the fact that she married me.\" - the Magic Man, Kate's husband\"I can't help the ear-to-ear smile I have plastered to my face when reading any of Kate's books… She makes me laugh out loud, even on a crowded bus!\"–Donna, Public Transit Romance Reviewer\"Perry's storytelling skills just keep getting better and better!\" –Romantic Times Book Reviews\"Kate's writing is fluid, with a touch of sexiness and loads of romance, just what you need to relax after a long, hard-working day.\"–Gabby, Romance Reader Extraordinaire\"Kate writes books?\" –Kia, Kate's brother\"Kate Perry's Laurel Heights series is of my most guilty pleasures. ;) Keep on keepin' on and kickin' ass!\" –R, Closet Romance Fan\"Reading Kate Perry's books is my favorite way to spend an afternoon (well..okay, my second favorite way, the husband insists I clarify...)\" –M.W., Bedroom Enthusiast\"A winning and entertaining combination of humor and pathos.\" –Booklist",
  "genres": [
    "Romance",
    "Contemporary",
    "Amazon",
    "Chick Lit",
    "New Adult",
    "Contemporary Romance"
  ],
  "author": "Kate Perry",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/21793894-let-s-misbehave"
}