{
  "title": "Phoenix Rising",
  "description": "How can Fairy Godmothers help their charges find love in the modern world when nobody believes in magic anymore? Simple, they run a dating agency!Rhys Spencer is determined to prevent his rich father from shutting down the charity he set up for kids in gangs, but he needs the money from a trust fund to do it. However, his grandmother has withheld the funds until he proves himself to be a mature, responsible person. To her mind, that means Rhys being in a serious relationship. Rhys turns to the Fairy Tale Match to find a woman he can use as a fake girlfriend. He will do all it takes to claim the money that will thwart his father’s selfish plans. The feisty woman the agency sets him up with, will not stand in his way.Taylor Shore has more complications in her life than anyone should have to deal with. Guardian to her two half-siblings since their parents’ deaths, she has her hands full with their constant troublemaking. The last thing she needs is to win the prize in a dating agency competition she never entered. Furious to find her friend entered for her, Taylor is determined to send her prize packing. The guy that turns up to stay with her for three weeks, however, has other plans in mind. Refusing to be ordered from her house, the arrogant man offers her a deal she’d be a fool to refuse.As Rhys inserts himself into Taylor’s problems, he begins to turn her life around. The angry fireworks between them gives way to a passionate love. Just as they find happiness, a vicious lie told by Taylor’s sister breaks them apart. Flo and Lotta have their work cut out for them to bring Rhys and Taylor back together. Time is against them and tragedy lurks on the horizon. Can Flo and Lotta save the day, or will Rhys and Taylor lose the precious love they have found forever….Although the third book in the series, this can be read as a stand alone novel.",
  "genres": [
    "Romance"
  ],
  "author": "Danielle Rose-West",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/21794599-phoenix-rising"
}