{
  "title": "Learning to Ride",
  "description": "\"He walked back towards the office and I cleaned myself off a bit. He might be willing to let me work on his bike and even take a ride, but I was sure he wouldn't want me getting oil on it. When my hands were clean I tossed my rag in a bucket and went over to a dirty mirror that was hanging on the wall. I gave myself a looking over to make sure I wasn't too filthy. I definitely looked like I had been working in a garage all morning, but everything was still in place. I wondered what Cash saw when he looked at me. Was I a pretty young mechanic that he felt like protecting, or did he see the woman I was underneath the grime?\"Emma Percy has never been like the other girls. She's a mechanic. When it comes to machines, whether they've got two wheels or four, she knows how to keep them running. When the call of the open road and a life of possibilities leads her to the small town of San Viero, she finds that affairs of the heart require more than simple mechanical knowledge.With only one place to turn for work, Emma finds herself surrounded by the members of the Dead Men Motorcycle Club. Though their rough exteriors and a lifetime of warnings from her father about such men keeps her distant at first, she soon discovers that the passion for riding that these men feel can be turned to other purposes as well.Get ready for the ride of your life as Emma explores her feelings for the Dead Men and their leader, the enigmatic Cash. Will she resist temptation for the sake of safety or throw caution to the wind and explore the shared attraction between her and the club's mysterious President? Will she let the pressures of being the only woman in the garage get to her or will she thrive, just to see the looks on their faces?This story contains depictions of adult situations between consenting adults. All characters are at least 18 years of age. This story is a work of fiction. Any similarities between characters appearing in Learning to Ride and anyone else are coincidental. Any similarities between Emma's life and your own is extremely hot.",
  "genres": [],
  "author": "Angelica Siren",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/21799861-learning-to-ride"
}