{
  "title": "Samantha Moon Boxed Set",
  "description": "Bundle of eight #1 bestselling \"Vampire for Hire\" mystery novels, plus one novella:MOON DANCE (1)Mother, wife, private investigator...vampire. Six years ago federal agent Samantha Moon was the perfect wife and mother, your typical soccer mom with the minivan and suburban home. Then the unthinkable happens, an attack that changes her life forever. And forever is a very long time for a vampire. Now the world at large thinks Sam has developed a rare skin disease, a disease which forces her to quit her day job and stay out of the light of the sun. Working the night shift as a private investigator, Sam is hired by Kingsley Fulcrum to investigate the murder attempt on his life, a horrific scene captured on TV and seen around the country. But as the case unfolds, Sam discovers Kingsley isn't exactly what he appears to be; after all, there's a reason why he survived five shots to the head.VAMPIRE MOON (2)Sam finds herself hunting down a powerful crime lord and protecting an innocent woman from her ruthless ex-husband—all while two very different men vie for her heart. And as the stakes grow higher and her cases turn personal, Sam will do whatever it takes to protect the innocent and bring two cold-blooded killers to justice—her own brand of justice.AMERICAN VAMPIRE (3)Sam receives a heartbreaking phone call from a very unlikely source: a five-year-old girl who's been missing for three months. Now on the hunt, Sam will use her considerable resources—including her growing supernatural abilities—to locate the missing girl before it's too late. And as she gets closer and closer to the horrible truth, she receives devastating news on the home front. Now with her world turned upside down, Sam is forced to make the ultimate choice of life and death.MOON CHILD (4)Sam is faced with an impossible decision—a decision that no mother should ever have to make. A decision that will change her life, and those she loves, forever. And through it all, Sam finds herself in a lethal game of vampire vs. vampire as a powerful—and desperate—enemy will stop at nothing to claim what he most desires.CHRISTMAS MOON (4.5)Now with Christmas just around the corner, Sam finds herself taking on a very strange case. A mysterious family treasure has been stolen, something priceless that's been passed down through the generations, something buried in secrets.VAMPIRE DAWN (5)Someone is leaving victims drained of blood, and all signs point to the killer not being a vampire. Meanwhile, Sam can't help but notice the changes coming over her son... fantastical changes that will leave her searching desperately for answers. As Sam tracks down a ruthless killer, and as her own humanity slips further and further away, an ancient relic holds a secret that will rock her world...and open up a whole new one.VAMPIRE GAMES (6)Sam is hired to look into the suspicious death of a popular fighter—and quickly discovers there’s far more to the story than meets the eye. As she uncovers clues into the boxer’s past, she will come face-to-face with something unexpected...and something only whispered about.MOON ISLAND (7)Sam is hired to look into the mysterious drowning of a super-rich hotel tycoon. The death occurred exactly one year ago, at the family's annual retreat on a private island in the Pacific Northwest. Now, as the family gathers again, Sam is asked to find a ruthless killer—all while a massive storm bears down upon the small island.MOON RIVER (8)Sam is asked to look into a string of bizarre murders, murders that are looking more and more like the handiwork of a bloodthirsty vampire. But when her sister, Mary Lou, goes missing, Sam takes the fight underground... into the dark heart of a vampire's lair.",
  "genres": [
    "Paranormal",
    "Vampires",
    "Fantasy",
    "Mystery",
    "Amazon",
    "Action",
    "Urban Fantasy"
  ],
  "author": "J.R. Rain",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/21801589-samantha-moon-boxed-set"
}