{
  "title": "Fragile Truths",
  "description": "***WARNING*** This book contains explicit sex scenes and strong language. No rape or sexual violence is included, however it does feature scenes with extreme violence and cruelty.  To live is to suffer; to survive is to find some meaning in the suffering. Friedrich Nietzsche  Frankie The bitterness is consuming. Its intensity slashes and claws at my insides, its hatred wrenching my soul as it curls and nurtures my need for revenge. His torture only feeds my vice. I won’t let him break me, only strengthen me. The pain he gives is welcomed, its rawness fuelling the loathing inside with each of his thrashes and tears on my pale skin, with every harsh truth he breathes in my ear and with each of his crippling holds. I have waited too long for this and I'll never let the bastard win. He will have to end me before I give in. But now he has a weapon against me. Something I swore throughout my life I would never let in; Love. Tate.  Tate Her strength astounds me. He doesn’t seem to break her. His relentless persecution and determination to bury her under his furious reign and brutality eats at my soul. It has found that dark place inside me, the pit of hell I had locked and secured away, and enriched it, demanded its flourish and ripened its ferocity. The family wrath. She'll never give in, and I pray every night as I guide her through the darkness that tomorrow will bring the light to her soul before it is consumed, finally, by the plague of him; Evil. Jude.  Jude She blossoms under my torture, the soft suppleness of her skin ripping and tearing as though her soul is trying to break free from the agony. I'll allow it, because I can. Because I need her soul. I crave the sustenance it feeds my rage with, my thirst for cruelty quenched by the sounds of her desolate screams and my hunger for blood, nourished by the slow drip of her life force at my feet. She thinks I won't break her, so does he. They underestimate the blood that slithers through my veins. It's sustained by pain and suffering. It's the blood that tenures those around me. The Bloodthirsty. The Shadows of Sin.  .",
  "genres": [
    "Dark",
    "Erotica",
    "Romance",
    "Dark Romance",
    "Abuse",
    "Adult",
    "Adult Fiction"
  ],
  "author": "D.H. Sidebottom",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/21806488-fragile-truths"
}