{
  "title": "الزوجة الباريسية",
  "description": "هل سبق لك يوماً الرغبة في تحطيم القيود، والخطو في المجهول لتحقيق حلم راودك؟ هل ترددت وجبنت وتراجعت في اللحظات الأخيرة؟ بالتأكيد ليس هذا ما فعله إيرنست هيمنغواي وزوجته هادلي حين تخطيا الحواجز، واندفعا إلى أحضان باريس المجهولة لهما في سبيل تحقيق حلمهما.في \"الزوجة الباريسية\" تقول باولا ماكلاين حكاية الطموح المحفوفة بالمخاطر وحب المغامرة والبحث عن حياة أفضل، وعليه نقع في هذه الرواية على سرد خيالي لوقائع السنوات الأولى من زواج إيرنست همنغواي وبداياته الأدبية في باريس العشرينيات من القرن الماضي، كما روتها زوجته هادلي. وصاغتها باولا بتقنية الحلم وبخطاب روائي يزاوج بين السرد والحوار، ويجاور بين الذكريات والوقائع والتوقعات، ويتحرك بسهولة بين الداخل والخارج، وعبر لغة حيوية، تحقق مستوى راقياً يلامس الفن والأدب معاً، ما يوهم بواقعية الرواية، ويمنحها صدقاً فنياً هو أساس في تحقيق روائية الرواية.تقول باولا ماكلاين عن روايتها هذه: \"إن هذه ليست قصة بوليسية، ولا هي قريبة منها حتى؛ فأنا لا أرغب بأن أقول للقارئ: حذار من تلك الفتاة التي ستأتي يوماً وتفسد كل شيء، لكن هذا ما سيحصل بكل الأحوال. ستأتي بحذائها الأنيق وعلى كتفيها معطف من الفرو الرائع، وشعرها الناعم البني القصير المصفف بإتقان على نحو ملاصق لرأسها سيجعلها تبدو كبضاعة جميلة في مطبخي. ستأتي بابتسامتها العذبة وحديثها الشيق، في الوقت الذي يكون فيه إيرنست مستلقياً على السرير غير حليق، كملك مستبد، وهو يقرأ في كتابه من دون أن يلقي إليها بالاً، ليس في بادئ الأمر على الأقل. وسيغلي الماء في إبريق الشاي، وسأروي حكاية نعرفها أنا وهي جيداً عن فتاة في سانت لويس قبل مئة عام، وسنشعر كلتانا كما لو أننا صديقتان منذ زمن. وفي تلك الأثناء، سيبدأ كلب في المنشرة بالنباح، وسيستمر بنباحه من دون أن يثنيه عن ذلك شيء\".\"الزوجة الباريسية\" رواية مشوقة تجمع بين المعاناة والسعادة، الإخلاص والخيانة في سلسلة أحداث تنقلك إلى حياة الكاتب إيرنست همنغواي، وإلى أجواء باريس الثقافية ومقاهي مونتبارناس في عشرينيات القرن الماضي لتشهد الفوضى الرائعة في زواياها وهو تعج بالرسامين الفرنسيين والراقصين الروس والكتّاب الأمريكيين، وإلى كل ما هو نادر وحقيقي في حياة العظماء.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Historical",
    "Romance",
    "France",
    "Audiobook"
  ],
  "author": "Paula McLain",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/21805306"
}