{
  "title": "Don't Look Behind You and Other True Cases",
  "description": "I'll be watching you.Walking home on a dark night, you hear footsteps coming up behind you. As they get closer, your heart pounds harder. Who is closing in with dangerous intent -- a total stranger? Or someone you know and trust? The answer is as simple as turning around, but don't look behind you...run. Ann Rule, who shared her own nerve-jangling account of unknowingly befriending sadistic sociopath Ted Bundy in The Stranger Beside Me, chronicles other fateful encounters with the hidden predators among us in this riveting collection, fifteenth in the bestselling series drawn from her personal files. First in line is a stunning case that spanned thirty years and took a determined detective to four states -- ending, finally, in Alaska -- where he unravelled not one but two murders. A second case appears to begin and end with the hunt for the Green River Killer, focusing on a Washington State man who was once cleared as a suspect in that deadly chain of homicides. But the millionaire property owner believed he had successfully buried his own murderous past and the awful truth behind his young wife's disappearance. She vanished soon after she left for a day at the Seattle World's Fair, and her three small children grew up believing their mother had abandoned them. But one amazing witness remained -- the missing woman's best friend, who heard her last words in a frantic phone call -- \"He's coming!\" -- before the line went dead. Only since Robert Hansen's suicide has the monster within been revealed. In another true story, a petite woman went to a tavern, looking only for conversation and fun. Instead, she met violent death in the form of a seven-foot man who had seemed shy and harmless. You'll feel a chill as you uncover these and numerous other cases of unfortunate victims who made one tragic mistake: trusting the wrong person -- even someone they'd known intimately, or thought they knew.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Mystery",
    "Audiobook",
    "History",
    "Short Stories"
  ],
  "author": "Ann Rule",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/11254934-don-t-look-behind-you-and-other-true-cases"
}