{
  "title": "Thunderbird",
  "description": "...Continuing the Hell Yeah! series with the thirteenth book, and starting the Hell Yeah! Equalizers series.Soulmates. Twin souls. Two people destined to be together. Their journey to love is never an easy one, but when they meet – their hearts beat only for one another.Kyle Chancellor is a hero, an honest to God hero. After winning the Heisman, he turns down a lucrative career as a professional football player to fight in Afghanistan. Not many know he enlisted because his heart was broken. When his time is up, Kyle comes home to form the Equalizers with the members of former Seal Team 7, they band together to fight battles for those who cannot fight for themselves.Hannah Montenegro is a woman who has sacrificed her life to help her family, never knowing the joys and freedom a young girl should enjoy. She lives in constant fear of being discovered in a country where she has no citizenship and no hope for the future.But fate has a plan…the night Kyle comes back to Texas, they meet in a bar where he is drowning his sorrows and she is spreading her wings to learn how to fly. From the moment they touch, the heat between them is undeniable. But unfortunate circumstances separate them and neither dares dream they will see one another again.Kyle is from a powerful Texas family. Because of his work with the Equalizers, his stance on stem-cell research and internet security, he is the only one surprised to find the people of the Lone Star state want him to run for Governor. Many get behind him, including the McCoys. But the one person he wants at his side eludes him.Hannah is always on his mind. From the beginning their relationship is complicated, but when she comes back into his life, he grabs onto her with both hands. Politics, a sex tape, immigration issues and a baby complicates their pathway to happiness. But Kyle is the Thunderbird and Hannah is his soulmate in the truest sense of the word. Their journey to love is one you’ll never forget.A modern day Cinderella story with a twist…**Content Warning: Intended for 18+ audience due mature themes, situations and language.**",
  "genres": [
    "Erotica",
    "Romance",
    "Westerns",
    "Contemporary",
    "Contemporary Romance",
    "Erotic Romance",
    "Military Fiction"
  ],
  "author": "Sable Hunter",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/21802247-thunderbird"
}