{
  "title": "The Condition",
  "description": "The Condition tells the story of the McKotches, a proper New England family that comes apart during one fateful summer. The year is 1976, and the family, Frank McKotch, an eminent scientist; his pedigreed wife, Paulette; and their three beautiful children has embarked on its annual vacation at the Captain's House, the grand old family retreat on Cape Cod. One day on the beach, Frank is struck by an image he cannot forget: his thirteen-year-old daughter, Gwen, strangely infantile in her child-sized bikini, standing a full head shorter than her younger cousin Charlotte. At that moment he knows a truth that he can never again unknown something is terribly wrong with his only daughter. The McKotch family will never be the same.Twenty years after Gwen's diagnosis with Turner's syndrome, a genetic condition that has prevented her from maturing, trapping her forever in the body of a child, all five family members are still dealing with the fallout. Each believes himself crippled by some secret pathology; each feels responsible for the family's demise. Frank and Paulette are acrimoniously divorced. Billy, the eldest son, is dutiful but distant, a handsome Manhattan cardiologist with a life built on compromise. His brother, Scott, awakens from a pot-addled adolescence to a soul-killing job, a regrettable marriage, and a vinyl-sided tract house in the suburbs. And Gwen is silent and emotionally aloof, a bright, accomplished woman who spurns any interaction with those around her. She makes peace with the hermetic life she's constructed until, well into her thirties, she falls in love for the first time. And suddenly, once again, the family's world is tilted on its axis.Compassionate yet unflinchingly honest, witty and almost painfully astute, The Condition explores the power of family mythologies, the self-delusions, denials, and inescapable truths that forever bind fathers and mothers and siblings.",
  "genres": [
    "Fiction",
    "Book Club",
    "Family",
    "Contemporary",
    "Adult Fiction",
    "Audiobook",
    "Relationships"
  ],
  "author": "Jennifer Haigh",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/2180222.The_Condition"
}