{
  "title": "Not in the Stars",
  "description": "Since the dawn of human expression, man has gazed up at the heavens in wonder, inspired by the wheeling of the stars to explain his surroundings. While our perception of those surroundings have changed, from thinking of the Earth as a flat, stable plane to realizing we’re falling through space in a tiny atmospheric bubble, our wonder remains constant.Space stations, alien races, far-flung planets—join the Mischief Corner authors as they explore the possibilities the stars might offer. The catch? Returning to mundane old Earth might be harder than you think.Finding Connor: The Borillian Twist, Book 1 - Toni GriffinMark, a RAAF fighter pilot, is on leave for the first time since the aliens decided to say 'Hello'. He meets Connor, a numbers man for a casino, at a gay bar and danced the night away. Their one night together changes their entire lives and what people think they know about life on Earth.The Usual Conventions: Unconventional Romances 1 - Mathilde WatsonWhen Chris meets the alien—man—of his dreams, \"Ensign Brodeich Geinn\" aka actor Brody Gates, it's as one of the coordinators for the first annual OBX Science Fiction Convention in North Carolina. To his delight, Brody seems to return his interest, albeit in typical alien \"Brodeich\" fashion. Awkward alien or not, Chris is more than willing to play out any sexual fantasy for his SciFi crush, especially when Brody fumbles over the simplest of human conventions.Feel Me - Freddy MacKayOne terrorist blast changed Master Tobias Zimmer's entire existence, relegating him to being nothing more than just a \"Coppies\" because of the metal replacing his flesh. As the once future Shogun of moon colony Orion 1, he now idles his time away keeping tabs on the Loyalists while his father and brother broker negotiations with the Earth Consortium.A confrontation with his childhood enemy, Dr. Thorsten Nordenfelt, sets into motion events that cannot be undone and puts Tobias's sheltered heart at the center of the colony's attempts to free itself from the repressive Earth's rule.Shax's War: Brimstone 3 - Angel MartinezThe boys desperately need a vacation. With the not-quite-ill-gotten gains from the Frog incident, Shax takes the Brimstone's crew to the exclusive resort planet, Opal. What could possibly go wrong there?",
  "genres": [
    "Anthologies",
    "M M Romance",
    "Romance"
  ],
  "author": "Erika Orrick",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/21803334-not-in-the-stars"
}