{
  "title": "Inferno: The World at War, 1939-1945",
  "description": "From one of our finest military historians, a monumental work that shows us at once the truly global reach of World War II and its deeply personal consequences.World War II involved tens of millions of soldiers and cost sixty million lives—an average of twenty-seven thousand a day. For thirty-five years, Max Hastings has researched and written about different aspects of the war. Now, for the first time, he gives us a magnificent, single-volume history of the entire war.Through his strikingly detailed stories of everyday people—of soldiers, sailors and airmen; British housewives and Indian peasants; SS killers and the citizens of Leningrad, some of whom resorted to cannibalism during the two-year siege; Japanese suicide pilots and American carrier crews—Hastings provides a singularly intimate portrait of the world at war. He simultaneously traces the major developments—Hitler’s refusal to retreat from the Soviet Union until it was too late; Stalin’s ruthlessness in using his greater population to wear down the German army; Churchill’s leadership in the dark days of 1940 and 1941; Roosevelt’s steady hand before and after the United States entered the war—and puts them in real human context.Hastings also illuminates some of the darker and less explored regions under the war’s penumbra, including the conflict between the Soviet Union and Finland, during which the Finns fiercely and surprisingly resisted Stalin’s invading Red Army; and the Bengal famine in 1943 and 1944, when at least one million people died in what turned out to be, in Nehru’s words, “the final epitaph of British rule” in India.Remarkably informed and wide-ranging, Inferno is both elegantly written and cogently argued. Above all, it is a new and essential understanding of one of the greatest and bloodiest events of the twentieth century.",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "World War II",
    "Military History",
    "Military Fiction",
    "Audiobook"
  ],
  "author": "Max Hastings",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/11256415-inferno"
}