{
  "title": "Brothers in Valor",
  "description": "It is the year 2315, the 33rd year of the Krag Wars. The tide has been running against humankind and its allies. One small destroyer, the USS Cumberland, under the command of its young Cajun skipper, Max Robichaux, fights along with the rest of the Union and Allied navies to preserve the very existence of the human race.Having delivered the Union's response to the Krag ultimatum, the USS Cumberland is ambushed on its way home by an overwhelmingly powerful enemy task force. Max, with the brilliant Dr. Ibrahim Sahin at his side as ship's surgeon, adviser, and friend, must use all his skill to defeat the enemy, only to find that Admiral Hornmeyer has an even more challenging mission for the destroyer and her intrepid crew. The Cumberland must slip deep into enemy held space and attack a key fuel and supply depot that the Krag must have to defeat an upcoming Union and allied offensive. And, if Max and his crew survive that, they must then hunt down a brilliant and elusive Krag commander, code named \"Admiral Birch\" to prevent him from masterminding the Krag defense to the impending attack.Oh, and one more thing, not only is Admiral Birch hopping from star system to star system in an armed convoy, there is a very good chance that the whole mission is an elaborate trap designed to destroy the Cumberland and kill its promising new commander. \"Brothers in Valor\" is the third volume of the \"Man of War\" military science fiction trilogy. It concludes the first phase of the continuing story of Captain Max Robichaux and Dr. Ibrahim Sahin during the Krag Wars, and sets up the next cycle of the story--the \"Brothers of the Black Sky\" trilogy, the first volume of which, \"To Stations My Lads\" is due out in late 2015.",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Military Fiction",
    "Military Science Fiction",
    "Space",
    "Fiction",
    "Adventure"
  ],
  "author": "H. Paul Honsinger",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/21816259-brothers-in-valor"
}