{
  "title": "Counting from Zero",
  "description": "Can a security expert save the Internet from a catastrophic zero day cyber attack by a network of zombie computers, known as a botnet? At what cost? “Credible and believable, this story is told by a subject matter expert. I could not wait to find out what happened next.” – Vint Cerf, Internet pioneer “The threat to the Internet from worms, viruses, botnets, and zombie computers is real, and growing. Counting from Zero is a great way to come up to speed on the alarming state of affairs, and Johnston draws you in with his story and believable cast of characters.” – Phil Zimmermann, creator of Pretty Good Privacy (PGP) the most widely used email encryption program Today, every computer connected to the Internet is under constant attack from viruses, worms, port scans, and spam. Security professionals continually fight to contain newly unleashed cyber attacks, known as ‘zero day' attacks, only to have new attacks launched. Millions of computers have already succumbed, and, without their owner’s knowledge, have become slave computers - remotely controlled ‘zombies’. Under the control of organized crime and backed by foreign governments, these computers are morphing into collections known in the industry as botnets, short for robot networks. Internet security expert Mick O’Malley is the only one who recognizes the growing threat of the ultimate zero day attack on the Internet from a massive botnet, and his unique hacker skills and network of colleagues enable him to fight back. More cyber prep than cyber punk, Mick uses real-life tools and techniques to encrypt all his communications, and uses these skills to break the encryption used by the botnet. Mick uses encryption on a personal level, too, having multiple passports and multiple names and identities. While crisscrossing the globe in the air, on land, and at sea investigating the threat, Mick becomes the target of attacks on his reputation, his identity, and ultimately his life. Along the way, Mick meets Kateryna Petrescu, a beautiful Romanian firewall expert. Mick’s attraction to Kateryna develops as they work closely together and share the excitement and danger. Why is the government following Mick and trying to intercept his communications? Can he stop the zero day attack before it is unleashed? What will be the cost to Mick for his single mindedness? Unfolding across three continents, the new techno thriller \"Counting from Zero\" gives a realistic insider’s view of the thrust and parry world of computer security and cryptography, and the very real threat of botnets.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Thriller",
    "Mystery"
  ],
  "author": "Alan B. Johnston",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/11257244-counting-from-zero"
}