{
  "title": "Blackbirds and Sparrows",
  "description": "CHRONICLES OF RHIANNA - BOOK IIn the far off land of the Continent; a land which stretches from the cold ice fields of Snowfeld through the beautiful land of Rhianna to the swamps and deserts of Great Zabhia; life is born, it serves out its time and then it surrenders to the void. But life doesn't meander randomly along with the waves of time - destiny plays its hand steering the ship at every twist and turn. Prophecies rise from the dust, some wither away unheeded but others shape nations. The funny thing about Prophecies though - is it can basically be all down to interpretation...Jrack was a down to earth sort of guy - nothing much phased him. Prophecies, the arts, the mysteries; politics, war and peace - Jrack just took what life threw at him - and life had dealt him some cruel blows in its time. Jrack was a survivor. At 15 his family was butchered, he survived but was captured and taken as a slave to the diamond mines. Many died during the ordeal but he survived and escaped when he was 18. He joined the army and went to war but survived whatever military campaigns he was thrust into. What did not destroy him made him stronger. Life had shaped him into a formidable warrior...Jrack was fates trump card and one day when he was least expecting it he was summoned to do his duty. Jrack was a Blackbird, one of the King's elite guards, sworn to protect the King with his life. The King was in exile but it was soon time to return to his rightful thrown - after all - it WAS Prophesised! Jrack and his companions were about to undertake a remarkable journey that was to take them through love and loyalty, honour and betrayal, the real and the unreal.This fantasy heroic trilogy depicts this amazing journey, the first book - Blackbirds and Sparrows - describes the return to the homeland of Rhianna where the seeds of destiny are all sown...Jrack's escape from the diamond mines is a key trigger event in the path of the Prophecy, and is the incident that started the course of events that moulded Jrack into the warrior that he has become.The exiled King of Rhianna has now been invited down to Great Zabhia for a secret meeting with a leading politician who wishes to seize power in Western Great Zabhia. The known heads of revolutionary groups in Western Great Zabhia and the heads of the power families in Eastern Great Zabhia were also invited. He knew that the meeting was probably a ruse to flush him out of his sanctuary in Snowfeld, but he had to take the chance to build allies who may assist with his bid to return to power in Rhianna and it is up to Jrack to get him there safely.\"Operation Sparrow\" is the first stage of the journey and it takes them into the lion's den...",
  "genres": [],
  "author": "Jolyon Grace",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/21821700-blackbirds-and-sparrows"
}