{
  "title": "The Complete Now Series",
  "description": "This box set of The Complete Now Series contains the following three full-length novels:  Now and Then (Now Series, #1)   Now Emmaline Carson has settled into her career as a graphic designer, though she’d rather be painting or shopping with her sister Layla. But then – in the years before she went to art school in Paris – she was a shy, awkward teenager with frizzy hair, a flat chest and a massive crush on the boy across the street, Cole Marlowe. Too bad her incredibly hot neighbor only had eyes for Layla.  Cole is now a confident, laid-back attorney who’s even hotter than he used to be. He’s planning to stay single while working his way up the corporate ladder – until he’s knocked off course by a chance run-in with Emma.  Everything is different between Cole and Emma now. He finally sees her in a way she only dreamed of, and their hot chemistry is fueled by a growing friendship. But Emma’s deception of her sister – who wants Cole for herself – and the secret Cole’s been keeping for more than a decade threaten to tear apart what’s only just begun. Because sometimes the only thing standing in the way of now is then.  Now and Again (Now Series, #2)  Once again, 26-year-old Layla Carson has the attention of a man eager to satisfy her. Ben Montrose, the hot, confident cop who gets off on frustrating her, is eager to show her just how arresting he can be. But as a reforming sexaholic, Layla’s sworn off casual hookups, and doesn’t miss the days of her early 20s –much.   Ben’s caught off-guard when the sexy, outspoken attorney turns him on and then turns him down. But the confident former Marine knows he can handle the simple seduction of a beautiful woman. He finds Layla’s weak spot – competition, which he happens to share – and challenges her to a game that could make them, or destroy them.   As they compete to crown the master of seduction, Ben and Layla discover there’s more to their game than power and foreplay. But as the stakes go up, they realize the game has changed, and they both stand to lose more than they bargained for.  Now and Forever (Now Series, #3)  Now that Emma and Layla Carson have landed the men of their dreams, it’s time for happily ever after. Or is it?   Emma’s with childhood crush Cole Marlowe, and Layla finally found Mr. Right in alpha cop Ben Montrose. But both couples face unexpected obstacles that will test their relationships. Layla and Emma find solace in each other as battle lines are drawn, and they rediscover the close friendship they lost over Cole.   It’s all on the line as the sisters struggle to find the answer to the most difficult question they’ve ever faced: is the love they have now meant to last forever?   ** Warning** This book contains adult language and situations.",
  "genres": [
    "Romance",
    "Anthologies"
  ],
  "author": "Brenda Rothert",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/21825897-the-complete-now-series"
}