{
  "title": "Forever Knight",
  "description": "Against the backdrop of Medieval Scotland, two enemies fight a desperate battle against destiny and desire.BRAWNY. BOLD. BRAVE. Laird Gavynn MacEuann's a man of action and skill. Both in battle and with the lasses. Notorious for towering strength and matchless features, he takes what he wants and never loses - but conquering this particular castle is easy compared with claiming and then controlling the beautiful, spike-tongued lass he frees by mistake.STUNNING. SPOILED. STUBBORN. Lady Brielle Dilbin is headstrong. Proud. She'd rather molder in a dungeon than accept her father's will. If the mud-covered Highlanders would give her a moment, she'd tell them so. Or make their leader understand. Or do something other than deal with passions and forbidden lusts that no gently-bred lady should have to endure; especially connected to the man who orders her silence and then demands obedience as well. --short story originally published in the Mammoth Book of Scottish Romance, Jan 2011EXCERPTShe'd be the death of him yet.Gavynn ducked his head before pulling back up and sliding his hands along his hair to sluice water, ignoring where the lass stood, arms wrapped about her while she shivered in place. The burn was hip-deep on him. Cold, clean, fast moving, and difficult to hear over. Gavynn amended that. He couldn't hear much over his own heartbeat. All of it made him vulnerable. This wasn't a good idea, but he hadn't had one since meeting her. His chest and belly were tender with bruising, his muscles throbbed with the work he'd forced on them, and the woman's linen under-dress was as useless as a film of white mist would be.She was true beauty; in form as well as face. Well-formed. Lush. Curved in all the proper places. Possessing heavy, hand-filling breasts, a narrow waist, and hips well-rounded to greet and satisfy a man. When she'd bent forward to wash her face, his groan almost made it through clenched lips. Gavynn grabbed hand-scoops of water, angrily splashing cold and wet all over. Then he bent his knees, dipping to his armpits in chill. All in an effort to divert the pressure building in his groin as blood filled the area, engorging and hardening, and angering him with how little his mind controlled anything.Nothing worked. He couldn't keep his eyes and thoughts off her. Gavynn lifted his head to the twilit sky, close to howling his frustration. And when he brought his head back down he got a full dose of his utter stupidity. He hadn't even heard them. Gavynn sent the curses soundlessly before rising to face a solid wall of armor-clad men atop horses. They carried torches. Possessed full weaponry. And all he claimed was the sword at his back.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Scotland",
    "Medieval",
    "Novella"
  ],
  "author": "Jackie Ivie",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/11257264-forever-knight"
}