{
  "title": "Angel's Puppies",
  "description": "About the Book  ANGEL'S PUPPIES tells the story of a young girl, Lisa, who is quite lonely because her parents are away on a long trip, leaving her in the care of a housekeeper, Bertha. Lisa's main companion is Angel, a black mutt. Bertha resents the fact that, in addition to having to do the household chores, she also has to take care of a dog. Bertha becomes especially angry when Angel becomes pregnant and gives birth to three puppies. Bertha wants Lisa to get rid of the puppies, and she is not satisfied until Lisa promises to give the puppies away as soon as they are old enough. When the time comes, Lisa gives the puppies as a gift to solders at a nearby army camp, where she and Angel can visit them frequently. The story is a fictionalized version of an experience the author underwent while growing up in Israel (then called \"Palestine\") during World War II.  About the Author  Born in Israel (then called \"Palestine\"), Judith Weinshall Liberman came to the United States in 1947 to pursue higher education. She earned four American university degrees including two in law, a J.D. from the University of Chicago Law School and an LL.M. from the University of Michigan Law School. After settling in the Boston area in 1956, she studied art and creative writing. Beginning in the early 1960s, and for four decades thereafter, Ms. Liberman created numerous series of artworks. Her art has been widely exhibited, and is represented in the collection of museums and other public institutions. During her long career in visual art, Ms. Liberman wrote several books, among them some children's books. Her book THE BIRD'S LAST SONG (Addison-Wesley, 1976), which she also illustrated, won a citation as one of the \"fabulous books of the year.\" In 2012, she published her second children's book, ICE CREAM SNOW (Dog Ear Publishing), which she also illustrated. Her third children's book, THE LITTLE FAIRY (illustrated by Gail Davis, Dog Ear Publoishing) was published in 2013, and in 2014 she published her fourth children's book, THE VERY OLD PAINTER AND HER HUSBAND ((illustrated by Gail Davis, Dog Ear Publoishing). Judith Weinshall Liberman's archives can be found in the Arts Department of the Boston Public Library and at the Smithsonian Archives of American Art.  About the Illustrator  This is the third book on which Judith Weinshall Liberman, the author, has collaborated with Gail Davis, the illustrator. Since she did not feel that, in light of her deteriorated eyesight, she could do justice to illustrating ANGEL'S PUPPIES herself, Ms. Liberman selected a fine artist, Ms. Gail Davis, to create the illustrations under the author's guidance. The two had previously collaborated on THE LITTLE FAIRY (Dog Ear Publishing, 2013) and on THE VERY OLD PAINTER AND HER HUSBAND (Dog Ear Publishing, 2014). In the present book, Ms. Davis beautifully captures not only the spirit of the story and of the characters, but also the landscape and the atmosphere of Israel as it was at the time when the events which inspired this story took place.",
  "genres": [],
  "author": "Judith Weinshall Liberman",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/21820484-angel-s-puppies"
}