{
  "title": "Satan's High Priest",
  "description": "From the days when Joseph's father, the charismatic Dexter Warren, established his prosperous mercantile and mortuary business, the occult opportunities the Warrens offered held a powerful allure for many of the townsfolk in their quiet community. The dark underside of Dexter's magnetism came to light in secret backroom meetings at his funeral parlor, where he presided over a coven of Satan worshipers that included people of authority and influence in the town. At home, Dexter's rigid morality and stern discipline made him a figure of awe and terror to his younger son, Joe, who was equally damaged by his mother's negligence and her subsequent death. Powerless against his father, Joe submitted to the teachings of satanism with rites of alcohol and drugs, sexual orgies, and humiliating physical torture, in a cycle that continued throughout his youth. Joe was free to leave the cult in early adulthood - but while college enrollment and excelling at football gave an outward appearance of normalcy, his cult training was deliberately calculated to ensure he would return. In his only act of personal revolt, Joseph overthrew his own father to claim the cult's highest position of power, to fulfill his destiny as sole commander of Satan's followers. Illuminating both the \"why\" and \"how\" behind the rise of Joseph Warren and others like him, Judith Spencer explores the compulsions behind the physical and emotional abuse inflicted, to lend a greater understanding of satanic cult behavior - and the incredible state of mental dissociation that allows an everyday person to partake in rituals with no memory of his or her \"other\" self. Against the chilling backdrop of Joseph Warren's colliding worlds oflight and darkness - where the effects of his destructive extremes continue to challenge all those he drew into his relentless service of evil - Judith Spencer unlocks the mysteries of the satanic cult phenomenon, and exposes its dark and deadly traps.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Horror"
  ],
  "author": "Judith Spencer",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/21825701-satan-s-high-priest"
}