{
  "title": "Once Upon A Rose",
  "description": "A cursed lord, a feisty librarian, and their disguised pet dragon.Being the first librarian in their small town is everything Beatrice Montgomery has ever dreamed of–except no one in town knows what to make of her, or the library. But spending her days surrounded by books is an occupation beyond her wildest dreams, and she'll do whatever it takes to make the library a success.Lord Alexander Dunham's time is running out. Providing for his estate and the people dependent on him before his curse ruins his life is his first priority--and that means he needs a wife, immediately. Proposing a marriage of convenience to the feisty librarian seems like the perfect he gets a wife, she gets funds for her library, and the sorcerer trying to steal his estate gets nothing.Even with his lips sealed about the curse, a transforming dragon watching his every move, and a wife who's winning over everyone on their estate, their marriage of convenience should have solved all of Alexander's problems. Unfortunately, he's falling for his wife, and it's causing a new he's no longer willing to die. Can Alexander and Beatrice outwit the most powerful sorcerer in the Northlands, or will Beatrice lose the man she's growing to love?Once Upon A Rose is a Beauty and the Beast fairytale retelling and the second book in the Galamere Chronicles. Each standalone book is a retelling of a beloved story or fairy tale, with the swoon-worthy sweet romance of a Hallmark movie, the wholesome and heartwarming feeling of cozy fantasy, and the comfort of a found family of friends, with a sprinkling of danger and a dash of magic.❤️ Marriage of Convenience❤️ Beauty and the Beast Retelling❤️ Forced Proximity❤️ Grumpy/Sunshine",
  "genres": [
    "Fantasy",
    "Beauty and The Beast",
    "Retellings",
    "Fairy Tale Retellings",
    "Romance",
    "Fairy Tales",
    "Clean Romance"
  ],
  "author": "Gabrielle Landi",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/218221656-once-upon-a-rose"
}