{
  "title": "The Song and the Pendant",
  "description": "The Song and the Pendant is an epic science fiction romantic fantasy comedy; a pseudo-fictional work of archaeological theology and speculative futurist super-hero quasi-Victorian space drama that will shatter your expectations, and possibly even your heart. This is the typical age-old tale of girl meets boy, boy is gay, space vortex almost kills them, girl goes to opera, boy and girl get sucked into interstellar time war, girl punches dinosaur, boy meets other boy, girl throws piano at super villain, Jesus discusses his favorite band, the creation of the universe is at least partially explained... you know, just your average, run of the mill science fiction romance time travel dragon karate super power nanotechnology love story about a girl who doesn't get along with her dad. It is the tale of Clara Edmonds, recent college graduate, and an independent, internally romantic young woman faced with a difficult choice between a career imagined for her by her parents, and the insistent dictates of her spirit. Her willingness to obey these mandates of passion and purpose will lead her on an adventure far beyond her intended destination of San Francisco, and even beyond our world. This is a tale of passion, of opera, of lost loves and strange wars which span vast chasms of space and time. It is a whirling, violent, and quietly beautiful poem through which we experience her deliciously naive feelings for an enigmatic pianist from another planet. It is at times a kaleidoscopic dirge in which we are stung by her anger and fear as she punches a dinosaur in the face, and hurls a grand piano at a well-mannered, super powered butler in the employ of a time traveling, psychopathic, warrior aristocrat. This is a triumphant ballad of human culture in which grown men fall in love, a flying priestess vaporizes a mansion with her eyeball lasers, portals to hell are opened, and two ageless masterminds engage in a ruthless shadow war of archaeology, religion, physics, and brute preternatural force. Most importantly, this is the origin story of the greatest and most powerful super hero in the history of human literature. Actual Length: 246,000 words (~900 pages, if it were a paperback.)",
  "genres": [],
  "author": "Magnus Von Black",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/21825794-the-song-and-the-pendant"
}