{
  "title": "Lussuria",
  "description": "Librarian's note: This is an alternate cover edition for ASIN: B00GWOXKPA.An emotional erotic heart-wrenching story of lust, love and light.File U for upside down. Lexi Robertson's carefully constructed life is about to be turned upside down.Recently hired as Club di Energia's physiotherapist, the stunning yet insecure twenty-six year old finally thinks she has a handle on her physically and mentally damaging past. The only way Lexi can cope is by compartmentalizing her feelings with a unique, internal filing system. To maintain order, Lexi has a firm set of boundaries in place, and she never lets anyone too close.File N for not happening. Lexi has no intention of giving in to the charming Lucca Caruso when he comes into her clinic for an emergency physiotherapy session. Despite his painstakingly handsome face and Italian that renders her speechless, Lexi is able to resist.A Tuscany vacation with her best friend is just what Lexi needs to stop worrying about life and start enjoying it. A cooking course at a villa near the Chianti hills, just outside of Florence, will take her mind off a certain set of mesmerising azure blue eyes.File F for fate. Lexi never expected to see the Italian god again, but they're staying at the same villa.For someone that purposely refuses to feel, Lexi finds herself on a journey of self-discovery, helplessly folding, melting, and crumbling under the temptation of her heart's desire.An emotional, erotic, heart-wrenching story of lust, love, and light.Lexi struggles to confide in Lucca, slowly learning how to love and trust. Lucca is a gentle, patient lover with a heart of gold, but his need for Lexi is insatiable. He's the man we all want and can't get enough of. Through the passion of lust and the sweetness of love, Lexi spreads her wings towards the light … until her past comes back to haunt her.A hot and sexy story of survival, acceptance, learning to trust, and believing. One woman's destiny to find her light, and the one man who can take here there. Welcome to the Luminara series.Please note. Lussuria was first published in November 2013. SJ Molloy has worked on a developmental edit and republished the book. This is version two, with two extra chapters, bonus scenes and flashbacks.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "Abuse",
    "Adult",
    "Suspense",
    "Contemporary"
  ],
  "author": "S.J. Molloy",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/21839208-lussuria"
}