{
  "title": "His Black Beauty",
  "description": "BOOK TWO OF THE THRALL SERIES NOW AVAILABLE.  Marissa Black was born to run…or at least she thought she was.  Ever since she was a child, she always seemed to be running from something, though towards what she never knew. So when a foreign recruiter offers her the opportunity to become part of his country’s fledgling Olympic team, she jumps at the chance to leave her old life behind.  And that’s exactly what he’s counting on.  Mr. Mason has lured countless women to Thrall. He’s stripped them of their freedom. He’s denied them any voice. He’s forced them to surrender all fear, all shame, and all inhibitions in order to become whatever base creature their future masters desire.  And ultimately they thanked him for it…or at least he thought they did.  But Marissa is different. She’s his Beauty. She’s the only woman who’s ever made him truly question his life’s work, and the only woman he knows he’ll never be permitted to possess.  But that won’t stop him from trying.  If Marissa hopes to keep her soul, she’ll have to fight temptation like she never has before. She might have been able to run from the demons of her past, but she knows Mason is one devil that will never let any of his victims go. Not her. Not her best friend. Not anyone.  So she’ll have to be smart. She’ll make the deal of her life, and she’ll submit. She’ll give up every last bit of herself in exchange for the hope—the slimmest hope—that in turn she can help another. And Mason will take her up on her deal. He’ll convert her. He’ll train her. He’ll transform her into a creature whose only desire is to please and be pleasured.  And she will be pleasured.  He’ll show her so much pleasure she’ll barely be able to resist. But no matter how tempting that slippery slope into submission might be, she can’t slide all the way down it just yet. Marissa isn’t a slave, and she certainly isn’t a punya. She’s a woman. She has to remember that. Otherwise she’ll lose her freedom, her sanity, and maybe even her soul. And that’s much too high a price to pay for pleasure. She knows it is. But once she’s begun her descent into Thrall, logic matters little compared to her body’s needs.  And those needs might just be darker than even her own soul could ever bear.  HIS BLACK BEAUTY is a 118,000 word erotic romance featuring BDSM themes including slavery, bondage, domination, submission, pony play, pet play, sexual interactions, and master/slave relationships. All characters depicted in this work are over 18. This is a work of fiction meant for an adult audience. The author does not condone or endorse any of the behaviors carried out by its characters.",
  "genres": [
    "BDSM",
    "Erotica",
    "Dark",
    "Dark Romance"
  ],
  "author": "Jena Cryer",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/21826672-his-black-beauty"
}