{
  "title": "Beware The Smart Kids",
  "description": "Paterson Prize for Books for Young People Co-Winner Grades 7-12 (2025)\nSometimes the people we cast aside are the ones with the most to teach us. A brilliant, troubled teenager on the verge of expulsion finds an unlikely mentor in an aging ex-convict and former high school teacher, whose hard-won lessons might be the key to saving them both.Good Will HuntingTuesdays with MorrieFinding ForresterThe Giver... are wrapped into one in this heartfelt coming-of-age tale about loss, self-acceptance, and learning to be happy again. Misfit troublemaker Nolan Sussman badly wants two things before high school ends: the attention of Gabi Meyers and the return of his runaway sister, Sarah. But when his latest prank goes awry, Nolan is nearly expelled. He's forced to spend his summer doing yardwork for Mr. Barno, a reclusive former high school teacher who spent 25 years in prison.Nolan soon finds that despite the tragic mistake that landed Mr. Barno in prison, the old man has something even more elusive than Gabi and Sarah: happiness. Now, Nolan is determined to learn how to be happy, too. It's his chance to matter. His shot at a future. But secrets in Mr. Barno's past are preventing the once-beloved educator from having the will to ever teach again. Secrets the two outcasts will have to face together.\"Through mysteries untangled, shared heartbreak, and ultimately, redemption, you'll laugh and cry though the pages of this beautiful story.\" - author Annie James Thomas\"A must-read book for anyone who is struggling to find happiness or who loves someone who is struggling to find happiness.\" - author James Wallace Birch\"A story that will tug at your heartstrings and remind you of the goodness in the world.\" - Goodreads Review\"Nothing short of wonderful...this story resonated with me on so many levels.\" - Goodreads ReviewEditorial ReviewsBeware the Smart Kids is a story for teenagers...those who feel invisible, those who are hiding their pain, those who think they'll never find the answers, those who are yearning for something but don't know what. And it's a story for 'former teenagers' who are now trying to raise and love a teenager, but who have likely forgotten the hard parts of being one. Kushin's debut novel is a poignant coming-of-age story with relatable characters and a powerful message on finding happiness.- Margaret Standafer, best-selling author of I Know an Old Lady.In his remarkable debut novel, Matthew Kushin explores the delicate, sometimes painful journey to understanding, kindness, and that most precious of attributes, empathy. Saddled with self-doubt and a long simmering guilt, Kushin's main character steps outside himself to understand through another's eyes what it truly means to be isolated and reviled, yet remain true to who and what he might be. This is powerful writing, immensely engaging, and distinctive in both tone and theme. It merits a place on the bookshelf of any serious reader.–Greg Fields, Through the Waters and the Wild, 2022 Winner, Independent Press Award for Literary FictionWith Beware the Smart Kids, Matthew seamlessly weaves philosophy, humor, and an honest look at teenage life in the twenty-first century. As the cast of characters search for meaning, purpose and happiness, I couldn't help but see myself in each of them. The book uplifts the spirit, challenges the mind, and opens the heart towards a kinder universe. Plainly put, it will change the lives of those who read it.—Derek Gallagher, High School Psychology TeacherAbout The AuthorMatthew J. Kushin, Ph.D. is the author of Beware the Smart Kids. He's a 2024 West Virginia Professor of the Year finalist. He lives in West Virginia, though he follows the atlas wherever it takes him.",
  "genres": [],
  "author": "Matthew J. Kushin",
  "average_rating": "4.77",
  "url": "https://www.goodreads.com/book/show/218274736-beware-the-smart-kids"
}