{
  "title": "A Sketch of the Life of Elizabeth T. Stone, and of Her Persecutions: With an Appendix of Her Treatment and Sufferings While in the Charlestown McLean Assylum, Where She Was Confined Under the Pretence of Insanity",
  "description": "Originally published in 1842, A Sketch of the Life of Elizabeth T. Stone and of Her Persecutions is one of the earliest exposés of mental hospitals.Excerpt: Feeling that the public is very much deceived concerning the treatment and situation of a poor afflicted class of the human family, who are placed in the McLean Assylura at Charlestown, by their relatives, and are left in the hands of strangers, subjected to the treatment of those whose hearts are hardened by being long accustomed to human suffering, and who are ignorant and unqualified, I will expose this matter to the public, in behalf of the afflicted, in connection with the awful, brutal outrage that has been committed upon me in consequence of indisposition resulting from hard labor and persecution, so the public may be warned against placing their friends here, especially if they would not have them ill-treated or suffer unnecessarily. First, I shall give a short sketch of my life down to the time when I was carried to the Hospital; then an account of the crime in connection with the treatment I received there, until I was taken out. I feel that this should particularly interest the christian world; but whether it is believed or not, I am determined to publish it, that the people of God may take care of their own people in time of persecution at the expense of one's life, whether father, mother, brother, or sister step in between. The unconverted do not understand spirituality, therefore a weak, persecuted christian should not be consigned to their hands. If others who have suffered this cruelty before me (as Dr. Fox says that both male and female christians have been destroyed there before) had published and exposed the wicked crime to the world, I might have been saved from suffering here and hereafter. I is covered up under the garb of \"derangement,\" but I am willing to let the world know it, that others may be saved from these awful outrages of the wicked at the present day. I know that the world in general is ignorant of this crime - of the fact that Doctors do possess knowledge of giving medicine to take away from a person the spirit of Christ, - but I have suffered it. I was born in Westford, Mass. My father was a mechanic, and poor; my mother being often sick, with a family of 7 boys and 3 girls, we were all sent out young upon the world, to get our own living. It being the youngest girl, was left at home alone. The peculiar situation which I sustained in the family, being early disowned by my father his lawful child, he being intemperate at the time, may be imagined.",
  "genres": [],
  "author": "Elizabeth T. Stone",
  "average_rating": "2.60",
  "url": "https://www.goodreads.com/book/show/10137650-a-sketch-of-the-life-of-elizabeth-t-stone-and-of-her-persecutions"
}