{
  "title": "Ender's War",
  "description": "Twice the buggers — as we call them — invaded our solar system and tried to annihilate us. We defeated them in the last war by a fluke. but we won't trust to luck again. When they return — and they will return. even if decades go by and the horror fades into myth — we must be ready..ENDER'S GAME (An expansion of the novelette of the same name). He was the third of his parents' children to be monitored. Peter. his older brother had been too uncontrollably violent: Valentine, his sister, seemed incapa- ble of violence altogether. So they pinned their hopes on Andrew Wiggin — nicknamed Ender because of Val- entine's childish mispronunciation of his name — and took him to Battle School to begin his military education. He was SIX years old.Only EarthS best made it to Battle School, where student armies fought mock wars 'n zero gravity \"games\" intended to develop the tactics and strategies human soldiers would need against the alien enemy. The training was tough, but for Ender they made it tougher still — changing the rules of the game without warning. forcing him to stand alone without fnends to rely on, pushing his natural abilities to the limit. For, ultimately, if Ender Wiggin proved himself less than brilliant, there was no hope left for the human race.SPEAKER FOR THE DEAD. Be. cause of their vague resemblance to certain creatures of old Earth, the people of the Lusitania colony called them \"p•ggies.\" They were the first Intelligent life we had encountered in the 3,000 years since the bugger wars, and the Starways Congress was determined not to contaminate their culture. Therefore the colony was re- stncted to a fenced-in area, and while the resident xenologsts were permit- ted contact, they were forbidden by law to reveal any information about human society.But. of course. the insulation couldn't work. The pigg•es had their own ideas about contact With mankind . . and their own secrets to keep. It was only after they murdered Pipo, the human who had first befnended them, that a Speaker for the Dead — Ender Wiggin himself — came to find the real meaning of PipoS life and death. and the astounding truth about the piggies owas revealed.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Science Fiction Fantasy",
    "Young Adult",
    "Adult",
    "Space Opera"
  ],
  "author": "Orson Scott Card",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/2183571.Ender_s_War"
}