{
  "title": "The Academy: Book 2",
  "description": "Every six months, 450 fifteen-year-olds are kidnapped from their homes across the world. These kidnappings happen in the span of a week, as reliable as clockwork. The victims don’t know each other, or their kidnappers. The fifteen-year-olds either end up with a ‘missing persons’ file gathering dust in a filing cabinet, or they are assumed dead. No one ever discovers what happens to them. The families move on, forever missing their lost loved one. Unknown to them, their child, grandchild, or sibling, has been taken to the Academy. The Academy, as its members will boast, is the most secretive, powerful organization in the world. The workings of the organization are revealed on a need-to-know basis, and the organization has decided that no one, other than its most trusted members, need to know its true business. Outsiders don’t even know it exists. Occasionally, a hunter or hiker will stumble upon the Academy’s remote location. They are quickly taken care of. When Asa Palmer, age fifteen, is out running in the woods behind his house, he is taken. Twelve hours later, after being tied and bound, and transported through an underground train station, he finds himself amidst a series of beautifully crafted structures that rest in between a circle of five secluded mountains. He has been chosen as a candidate for the Academy. Each six months, the Academy kidnaps more recruits than they can actually use. For Asa Palmer to live he must undergo body-altering mutations and compete with his cohorts in a series of dangerous and strategy ridden tasks to prove that he is worthy of the Academy’s time. This book follows Asa Palmer through his second semester in the Academy. The work is 197,000 words long.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Paranormal",
    "Science Fiction",
    "Urban Fantasy",
    "Fiction"
  ],
  "author": "Chad Leito",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/21839814-the-academy"
}