{
  "title": "One Urge, One Plea, Keep Me Trilogy Set",
  "description": "“Tie me up, so I can be free.” –Alayna.Erotica romance author and owner of one of the largest publishing companies, Damon Lear, has a secret that keeps him out of relationships and into behavior that is taboo to many. He is willing to set his strict rules aside for one memorable night with romance writer, Alayna Wynn, who he meets at his friend’s wedding. He fails at propositioning her, but they share one heated kiss, and he assures her they will meet again.Damon gets his opportunity to seduce her when he rescues Alayna, keeping her from being stranded in an airport. Unable to leave his penthouse for days, she discovers it is impossible to resist the handsome, mysterious man who wants nothing more than to make her submissive.When Alayna’s needs are not met, they both try to move on, but Damon sees that living the way he did before she walked in and out of his life is now impossible. He lures her back, and Alayna falls deeper into his world of BDSM. She is surprised to find it thrilling and wants to please Damon more than ever, being a willing participant in his hot fantasies. Their relationship is soon threatened when details from Damon’s past are leaked to the media, forcing him to share with her his darkest secrets. Exes resurface, family interfere, and paparazzi stalk them, causing chaos. During it all, Damon battles to hold on to control by pushing Alayna sexually, introducing her to new, enthralling experiences. He soon realizes he’s losing the hold on his heart when he witnesses Alayna fighting for the both of them and submitting to him completely. This is a sexy, steamy erotica romance that will leave you wanting more.For a mature audience due to explicit sexual scenes and harsh language.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Amazon",
    "Anthologies"
  ],
  "author": "Scarlet Wolfe",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/21843029-one-urge-one-plea-keep-me-trilogy-set"
}