{
  "title": "Inner Reflections of the Muse",
  "description": "Available on Amazon: http://www.amazon.com/Inner-Reflectio...Preface What does it take to be a Fearless Wordsmith? It need not necessarily mean my writings should be fierce and unruly for along with the freedom of expression goes the responsibility of the writer to communicate with his readers effectively and fairly, to be able to touch lives and make them feel they are part of the stories, poems that you compose. I consider myself as a modernist writer and poet. I have my own writing style without conforming with the traditional, much like James Joyce’s “Stream Of Consciousness” but with my own twist. I am always left amazed when my constant readers ask me: “Was this piece written for me? I can very well relate to it.” If people can very well “see” or “feel” themselves in your compositions, then you have done your job effectively! Raw and real emotions are the things that embody a good write. I have always dreamt of becoming a writer even when I was just in my grade school days, being this once shy and quiet lass who prefers to just jot down notes rather than reciting in front of the class which makes me all jittery. I didn’t give up my dreams of becoming a published writer and it came true with the publication of my first international poetry book with a publisher from UK after winning an international competition last 2012. This is my second book and is a special collection of my works that have appeared on my blog site on Life, Love and Relationships, “Seasons and Reflections of The Muse” http://seasons-reflections-of-the-mus... and my All About The Love section in Inner Child The Magazine. You can also get to read some of my most recent poetry compositions along with poem collaborations with fellow foreign poets and my own quotes that have appeared on my Goodreads Author Page http://www.goodreads.com/author/show/... featuring the wisdom quotes of Bry who happens to be my cover artist also. The publication of this special book is also another wonderful dream that came true with the help of the loving people of Inner Child Press. I hope to leave you with smiles on your faces after reading some of the contents of my book – there is an article, a poem or a quote that I know you could relate yourselves with. Let me leave you with this favorite quote “Writing and art for that matter is a soap box with which you can get a glimpse of a life other than your own once in a while.”",
  "genres": [],
  "author": "Elizabeth E. Castillo",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/21841237-inner-reflections-of-the-muse"
}