{
  "title": "Cowboy Sandwich",
  "description": "Barry Logan’s day starts out shitty and continues to go down the crapper. His car breaks down in the Middle of Nowhere, Colorado. The only mechanic for miles is out of town, forcing Barry to hole up and await his return. Bored and hungry, Barry goes to the town’s only bar in search of food and entertainment. The former is almost inedible, but his interest in the latter is piqued when two specimens of cowboy perfection walk in.  Barry has always had a thing for cowboys, and he’s been on a mission to get up close and personal with as many as possible before flying home to England. Having two cowboys at the same time would be a new experience, and one Barry is eager to try. So when the two men leave the bar, Barry follows in hot pursuit. He overhears them arguing about whose turn it is to bottom that night. Without thinking, Barry offers his services.  Jimmy Pierce and Jake Wilson drive Barry back to the Double J ranch for a night of wild passion he won’t forget. The next morning, Barry wakes in an empty bed to a beeping smoke alarm. It seems the ranch cook quit the night before, leaving Jimmy, Jake, and their three ranch hands to fend for themselves.  Barry immediately takes charge. His cooking meets with everyone’s approval, and he agrees to stay on both in the kitchen and in Jimmy’s and Jake’s bed. The two cowboys are physically demonstrative, both with each other as well as with Barry, who finds himself falling fast for both of them. It’s like a dream come true -- Barry has two men and a job he loves.  But petty jealousies, rivalries, and miscommunications threaten to shatter the dream, and when Barry’s scheming ex shows up, things get even worse. Sandwiched between two cowboy lovers, has Barry bitten off more than he can chew?",
  "genres": [
    "M M Romance",
    "Westerns",
    "M M M",
    "Menage",
    "Romance",
    "Contemporary",
    "Fiction"
  ],
  "author": "Drew Hunt",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/21842335-cowboy-sandwich"
}