{
  "title": "Call To Crusade",
  "description": "IN CALL TO CRUSADE, TOM VETTER BEGINS THE SIEGE MASTER SERIES, THE EPIC STORY OF THE FIRST CRUSADE TOLD AS NEVER BEFORE: AS LIVED BY A KNIGHT WHO BATTLES TURKS, TRAITORS, STARVATION AND DEATH ITSELF TO WIN A CRUSADE AND REGAIN HOLY JERUSALEM. The year is 1070. King Malcolm of Scotland has finally reached a peace of sorts with William, Norman conqueror of England. To his battle companion, Baron Euan MacDougal and wife Lady Mildred, companion of Queen Margaret, is born son Godric MacEuan. Raised, educated and trained to knighthood amid the royal family's princes, Godric's life is ideal.Then Sir Euan and Lady Mildred die tragically, leaving 11-year old Godric in the hands of his evil older half-brother, Andrew, who hates Godric and resents the favor he has with the Scottish royals.Andrew enslaves Godric as a blacksmith, and his future looks bleak. But the son of a great knight will stay no slave, and Godric frees himself and his friends by his own hand.His fortunes restored, Godric becomes a squire under Count Robert of Flanders, a Peer of France, accompanying the great count on his historic pilgrimage to Jerusalem. That journey, the men who make it and the deeds they perform ultimately set the world afire and launch the First Crusade. And though he is only a squire, it is Godric’s deeds that put the match to the fuse.A gripping story of faith, bravery, and holy war for a worthy cause, Call to Crusade sets the stage. In the Siege Master series, readers will relive the entire First Crusade at Godric’s side and rediscover why this forgotten conflict still matters so much to every person living today. ***Call to Crusade, first book in the ‘Siege Master’ series, begins the epic story of Baron Godric MacEuan, Scottish knight in the army of Count Robert II of Flanders, who fights in all the critical battles and witnesses the gripping key events of the First Crusade. At Godric’s side, readers live through the glory and horror of that epic struggle, a conflict of religions and civilizations that still echoes a thousand years later, overshadowing our world today.“Deus lo volt! God wills it!” The book is fiction . . . but the story is true.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Tom Vetter",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/21839933-call-to-crusade"
}