{
  "title": "If the Ring Fits",
  "description": "When Life Gives You Lemons, Fake an EngagementWhen investment banker Adrian and software engineer Rowena started the day, they didn’t expect to end it engaged! But Adrian has invented a fake fiancée to impress his CEO, regretting the lie almost immediately, and now he is in hot water. Meanwhile, Rowena's career has just gone up in flames, leaving her unemployed, unexpectedly expecting with no father in the picture, and short of options.When fate throws these two hot messes into a meet-cute of epic proportions, it's a match made in rock-bottom heaven. They say love is blind, and with nothing to lose, Adrian gets down on one knee… and Rowena says yes!The rules of engagement are simple:Pretend to be madly in loveKeep their real lives separateAbsolutely, positively do NOT catch feelingsHowever, faking it is harder than they thought, especially when every overnight stay comes with only one bed and zero personal space—blurring that imaginary line between ‘just business’ and ‘definitely personal.’Soon, their carefully constructed charade starts to feel alarmingly... real. Can Adrian and Rowena stick to their engagement pact, or will their fake relationship graduate to something authentically messy, complicated, and wonderful?Find out in this hilarious, heartwarming tale of two strangers who said \"I do\" before they even said \"Hello.\" Because sometimes, the worst day of your life just might lead to the best mistake you'll ever make.If the Ring Fits is an age gap, marriage of convenience rom-com with a multi-millionaire MMC and a STEM FMC perfect for fans of Lynn Painter, Sarah Adams and Fallon Ballard.Praise for Camilla \"He's a billionaire and so is she! This is no ordinary billionaire romance. It is a romcom full of wit, charm, sexual chemistry and brains.\" Laura Carter\"Sexy, funny, romantic and heartfelt - this book has it all - a must read.\" Sandy Barker\"A fast-paced, entertaining will-they-won't-they that kept me on tenterhooks to the end.\" Phoebe MacLeod",
  "genres": [
    "Romance",
    "Contemporary",
    "Audiobook",
    "Fiction",
    "Contemporary Romance",
    "Forced Proximity",
    "Billionaire Romance"
  ],
  "author": "Camilla Isley",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/218426995-if-the-ring-fits"
}