{
  "title": "The Vitandi",
  "description": "Nestled high atop a mountain range in his father's mansion, sexy, 'emo' vampire KELLAN DONNOLLY is living a life of carefree immortality. Born in 1003 in Ireland, to a peasant woman named Catherine, and the apostle SIMON, Kellan is bound by an ancient prophecy decreed by God, one that must be fulfilled or the entire vampire race will be destroyed. Simon, along with the other eleven apostles, were punished by Christ, forced to live as vampires by drinking Christ’s blood from the Holy Grail at the Last Supper for their roles of betrayal in his crucifixion. Now, Kellan must find a descendant of Christ, his niece in fact, and father a child with her to keep their species alive. In New York City, spunky NICOLE ERWIN, a country girl from Coalmont, VA., and her friend, MIA ROUNDTREE, a sassy, outspoken, Chicagoan, work part-time at Harbor Way Orphanage, and soon discover working part-time in a big city, doesn't pay the bills. When Mia sees an ad in the paper offering two hundred dollars for blood donations taken by The National Bloodmobile, she presents the idea to Nicole, who reluctantly agrees to go for the extra cash, unaware her donation will change her destiny. While at the bloodmobile, Mia gets a date, and commits Nicole into accompanying her by setting her up with her date’s friend. Born with an ugly, scar shaped birthmark on her left wrist and raised by a cold, uncaring father, Nicole has acquired a defensive nature but decides to go on the date and soon learns finding Mr. Right is a lot harder than she thought. After centuries of hiding for fear of detection, Kellan and the Apostles, lose track of The Daughter of Christ. In the twentieth century, the Apostles resurfaced and formed The National Blood Association, establishing blood banks all over the globe to live among humans undetected and to renew their search for The Daughter. When the time of the prophecy is at hand, The Daughter's identity is still unknown. The Apostles become concerned with Kellan's lack of interest in finding her, and Simon reveals to Kellan a secret he's kept hidden for over twenty years. In 1986, when a new form of technology DNA extraction, was unveiled The Apostles utilized its potential. They enlisted the aid of WINSTON DEFRIES, a smart, arrogant, biotechnology scientist who was the first man to extract and successfully match DNA to an individual. To keep Winston in the dark of their intentions JOHN THE APOSTLE, approached him and offered a job with The National Blood Association, under the ruse of finding a cure for HIV by testing blood donations taken from their blood banks and linking a genetic protein found in uninfected donors. Little does Winston know his quest will help an ancient sect of vampires locate the savior of their race. When The Apostles learn The Daughter of Christ's lineage is in New York City, it is up to Kellan to win her trust, while The Apostles try to keep Lucifer's demon scout, ARIUS, from destroying her. Kellan finds Nicole and reluctantly pursues her, expecting to fulfill the prophecy and return to his life of immortal luxury. To his amazement, he discovers Nicole means more to him than just the salvation of his people and together, they embark on an adventure full of suspense and drama, with an unexpected 'Savior' who will aid Kellan and The Apostles on their journey for survival.",
  "genres": [],
  "author": "Denver Batiste",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/21840278-the-vitandi"
}