{
  "title": "Forbidden Love",
  "description": "The complete Unravel Me series from New York Times and USA Today bestselling author, Kendall Ryan  Unravel Me Psychology student Ashlyn Drake's neat, orderly life takes a turn for the crazy when she finds the perfect subject for her amnesia thesis - a young man without any memory of his previous life, including the murder he's accused of committing.  Against all common sense, Ashlyn's drawn to him like a moth to a flame. Perhaps it's that he's so incredibly male, and even handcuffed to his hospital bed he could pass for a cologne ad - Scent de Insanity. Or perhaps it's because she's spent too many lonely nights studying. Either way, she's determined to help him solve the mystery of his past. She begins to unravel who he was before, using his cryptic tattoos, and his paintings that scream of a dark past as her only clues. When she finally learns his secret there's no telling which one is the real him, the gentle lover she's fallen for or the troubled man with a dark past.  Make Me Yours Emotionally crippled Liz isn't looking for a relationship when she meets delish boy-next-door, Cohen. He's several years younger, a volunteer firefighter, oh...and a virgin, making him totally off limits. But never one to back away from a challenge, she develops a close friendship with Cohen while she continues to satisfy her physical needs elsewhere.  Even as she spends her evenings in another man's arms, she somehow finds herself curled up in Cohen's bed each night. It's been a long time since she had a true honest-to-goodness make out session, but Cohen's showing her just how much fun not having sex can be.  When Cohen's injured in the line of duty, her real feelings for him rise to the surface, and she has to decide if she's willing to take a risk on love after enduring so much heartbreak in her past.",
  "genres": [
    "Romance"
  ],
  "author": "Kendall Ryan",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/21843282-forbidden-love"
}