{
  "title": "Into The Abyss",
  "description": "Turns out: \"The Demon Weed\" really is a Gateway Drug!  Who knew?Tom Perkinje certainly didn't. He had never smoked anything in his life, but as the new kid in town trying to make friends, he'd gone to a party and had foolishly let his new buddy Reggie talk him into trying a joint that he'd picked up from a new dealer. Before he knew it, Tom was having a seriously bad trip; a total out of body experience where the world had dissolved around him. A few puffs in and he'd gotten this massive case of tunnel vision where the entire party seemed to be happening at the other end of a long tunnel; soon it was like he was having this weird out of body experience looking down at himself. The next thing Tom knew, there were these deranged myopic wizards from some place called Astlan calling on him in some sort of pig Latin mumbo jumbo. They had somehow mistaken Tom for a demon! He tried to flee but the wizards were relentless and were determined to conjure him into their world and bind him as their demon slave for all of eternity! Oh, yeah, and those crazy wizards? Turns out they were going to war and planned to use their new demon slave as a secret weapon to obliterate the enemy!_______________________________________________ Jenn was a journeyman Thaumaturge at Lenamare's Academy of Wizardry. School was a living hell. Oh, she was learning a lot, thanks to Master Trisfelt, but the Head Master and Head Mistress were insufferable egomaniacs. Head Mistress Jehenna seemed intent on making Jenn's life a living hell.If this wasn't bad enough, the Head Master, Lenamare, had gone and got in a squabble with another wizard, Exador and now Exador was marching his army on the school. And to top it off, during what was supposed to be a routine classroom demonstration on demon summoning, Lenamare and the class had stumbled upon what they thought was a minor demon and tried to bind it. But unfortunately it wasn't a minor demon. It was a Greater Demon, something so powerful and Evil that they were almost never conjured onto the Planes of Man. Naturally being an egomaniac, Lenamare insisted on trying to bind it to his will and use it to destroy Exador and his army. So the question was: Would Exador's army ravage and kill her, or would the school's newest defense consume her immortal soul?",
  "genres": [
    "Fantasy",
    "Demons",
    "Magic",
    "High Fantasy",
    "Young Adult",
    "Dragons",
    "Audiobook"
  ],
  "author": "J.L. Langland",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/21846804-into-the-abyss"
}