{
  "title": "Les Suprêmes",
  "description": "Elles se sont rencontrées à la fin des années 1960 et ne se sont plus quittées depuis : tout le monde les appelle “les Suprêmes”, en référence au célèbre groupe de chanteuses des seventies. Complices dans le bonheur comme dans l’adversité, ces trois irrésistibles quinquas afro-américaines aussi puissantes que fragiles ont, depuis leur adolescence, fait de l’un des restaurants de leur petite ville de l’Indiana longtemps marquée par la ségrégation leur quartier général où, tous les dimanches, entre commérages et confidences, rire et larmes, elles se gavent de nourritures diététiquement incorrectes tout en élaborant leurs stratégies de survie.Née dans un sycomore, l’intrépide Odette, qui mène son monde à la baguette, converse secrètement avec les fantômes et soigne son cancer à la marijuana sur les conseils avisés de sa défunte mère, tandis que la sage Clarice endure les frasques de son très volage époux pour gagner sa part de ciel. Toutes deux ont pris sous leur aile Barbara Jean, éternelle bombe sexuelle que l’existence n’a cessé de meurtrir. D’épreuves en épreuves, l’indissoluble trio a subsisté contre vents et marées dans une Amérique successivement modelée par les ravages de la ségrégation raciale, l’insouciance des années hippies, la difficile mise en route de “l’ascenseur social”, l’embourgeoisement, sous la houlette des promoteurs immobiliers, des quartiers naguère réservés aux Noirs et les nouveaux catéchismes de la modernité mondialisée.Invitation à une lecture aussi décalée que féconde de la problématique raciale aux États-Unis, ce formidable et attachant roman de l’amitié et de la résilience emmené par d’époustouflants personnages et porté par l’écriture imagée et subversive d’Edward Kelsey Moore, s’affirme avant tout comme une exemplaire défense et illustration de l’humanisme conçu comme la plus réjouissante des insurrections.",
  "genres": [
    "Fiction",
    "Book Club",
    "Historical Fiction",
    "Humor",
    "Audiobook",
    "Friendship",
    "African American"
  ],
  "author": "Edward Kelsey Moore",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/21847889-les-supr-mes"
}