{
  "title": "TWISTED",
  "description": "Can you conceive of an injustice, criminal in nature, encroaching upon your life's course? Yes, you, reading this. Does your status, as it were, have you so psychologically fractured you honestly believe you're immune? If thought occupies you for more than a second, you're entrenched in ignorance you favor.What should be an innate appreciation of society holds little to no relevance today. Your financial footing takes priority over just about any and everything. Being alive, able bodied, and breathing isn't enough. What happens when that's all stripped away?The choice to exist in the creation of social media was yours, where a mere accusation, or negative posting could damage what should be held in the highest regard, your reputation. The cyber establishment's choke-hold is fierce, and you feel it, yet you constantly wonder why you can't breathe, but hey, you're \"woke,\" right?Your foundation, personal and or financial might be buckling, but you're clueless, even though it was you who shared every delicate and secular aspect of your life. Our brand has replaced moral fiber, dictating and tampering with the control of humanity. Are we waiting for the catastrophic crash of mankind? It appears so, when you step back from the edge, watch and listen? That's a predicament that wasn't even on your radar, but here you are, \"woke,\" right?A roof over your head, clothes on your back, sustenance, hell, even the air you breathe, all taken for granted. This should be a daunting notion I'm setting before the appetite of your consciousness, but perhaps it remains far-fetched. The question you should be asking yourself is, how woke are you; really?Regardless of gender, a simple compliment, smile, assistance, or jealousy can ignite a desire to stalk or destroy a person. - The only untainted bubble any of us occupied was in utero, so you are not above reproach of any kind. Whatever self-made bacterial hubris you've placed yourself in, outside of that, speaks to the degree of self-importance encasing you, so it's impossible for you to appreciate what it is to be \"woke,\" in the real world.",
  "genres": [
    "Book Club",
    "Novels",
    "Drama",
    "Contemporary"
  ],
  "author": "Fayton Hollington",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/218487053-twisted"
}