{
  "title": "The Colors of April: Fiction on the Vietnam War’s Legacy 50 Years Later",
  "description": "Fifty years after the Vietnam War ended, literary voices of the Vietnamese American diaspora and authors currently living in postwar Vietnam speak to the experience of those who left and those who stayed in this anthology of new short fiction edited by Quan Manh Ha and Cab Tran.For much of the twentieth century, Vietnam played an outsized role on the global stage, charting the destinies of superpowers and reshaping the world’s politics. Now fifty years after the end of the Vietnam War comes The Colors of April, an anthology of fiction that finally speaks to the Vietnamese voices of both those who left and those who stayed, what was gained and lost in the half century since, and for the generations that followed—what it means to be Vietnamese. More than two dozen distinct literary voices are featured in this collection, including those of Viet Thanh Nguyen, Andrew Lam, Barbara Tran, and Vi Khi Nao, among others. The stories are as diverse in style, tone, and subject matter as the ancestral lands of the Vietnamese people. From the rubble of the Ancient Citadel in Quảng Trị to the makeshift orphanages outside Sài Gòn, from Palo Alto to a tony Lincoln Park apartment in Chicago, the narratives straddle continents and generations, the political as well as the personal. But what they share is much greater than their differences. They speak to a common language, to a culture steeped in history and myth and storytelling that vividly captures the enduring spirit of the Vietnamese people.Editor Quan Manh Ha is Professor of English at the University of Montana and the co-translator of Other Vietnamese Short Stories of the American War and Its Aftermath, among other titles. Co-editor Cab Tran holds an MFA from University of Michigan’s Helen Zell Writers’ Program. His fiction and nonfiction have appeared in  Bulgaria’s English Monthly, Black Warrior Review, The Iconoclast, and elsewhere. He teaches fiction for Gotham Writers Workshop. In 2023, Ha and Tran co-translated and co-edited Bảo Ninh’s Hà Nội at Midnight.",
  "genres": [
    "Short Stories",
    "Anthologies",
    "Fiction"
  ],
  "author": "Quan Manh Ha",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/218519085-the-colors-of-april"
}