{
  "title": "Irène",
  "description": "Pierre Lemaitre is known for writing crime fiction with an alchemical mix of white-knuckle intensity, fearlessly unconventional plotting, and psychologically intricate character development. In Irene Lemaitre ingeniously uses five contemporary and classic literary murder scenes--from William McIlvanney''s Laidlaw to Bret Easton Ellis''s American Psycho--as the framework on which to craft a diabolical prequel to his Crime Writers'' Association International Dagger Award-winning novel Alex.Camille Verhoeven, whose diminutive stature belies his fierce intensity, has reached an unusually content (for him) place in life. he is respected by his colleagues and he and his lovely wife, Irene, are expecting their first child.But when a new murder case hits his desk--a double torture-homicide that''s so extreme that even the most seasoned officers are horrified-Verhoeven is overcome with a sense of foreboding.As links emerge between the bloody set-piece and at least one past unsolved murder, it becomes clear that a calculating serial killer is at work. The press has a field day, taking particular pleasure in putting Verhoeven under the media spotlight (and revealing uncomfortable details of his personal life).Then Verhoeven makes a breakthrough discovery: the murders are modeled after the exploits of serial killers from classic works of crime fiction. The double murder was an exquisitely detailed replication of a scene from Bret Easton Ellis''s American Psycho, and one of the linked cold cases was a faithful homage to James Ellroy''s The Black Dahlia.The media circus reaches a fever pitch when the modus operandi of the killer, dubbed \"The Novelist,\" is revealed. Worse, the Novelist has taken to writing taunting letters to the police, emphasizing that he will stop leaving any clues behind unless Verhoeven remains on the case.For reasons known only to the killer, the case has become personal. With more literature--inspired murders surfacing, Verhoeven enlists the help of an eccentric bookseller and a professor specializing in crime fiction to try to anticipate his adversary''s next move. Then Irene is kidnapped.With time running out, Verhoeven realizes that all along he''s been the unwitting dupe in The Novelist''s plans to create an original work of his own. Now, the only person in the world the commandant truly cares for is in danger, and a happy ending seems less and less likely as it becomes clear that the winner of this deadly game may be the man with the least to lose.",
  "genres": [
    "Thriller",
    "Crime",
    "Mystery",
    "Fiction",
    "France",
    "Mystery Thriller",
    "Noir"
  ],
  "author": "Pierre Lemaitre",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/21855348-ir-ne"
}