{
  "title": "The Past As Present: Forging Contemporary Identities Through History",
  "description": "Understanding our past is of critical importance to our present.Many popularly held views about the past need to be critically inquired into before they can be taken as historical. For instance, what was the aftermath of the raid on the Somanatha temple? Which of us is Aryan or Dravidian? Why is it important for Indian society to be secular? When did communalism as an ideology gain a foothold in the country? How and when did our patriarchal mindset begin to support a culture of violence against women? Why are the fundamentalists so keen to rewrite history textbooks?The answers to these and similar questions have been disputed and argued about ever since they were first posed. Distinguished historian Romila Thapar has investigated, analyzed and interpreted the history that underlies such questions throughout her career; now, in this book, through a series of incisive essays she argues that it is of critical importance for the past to be carefully and rigorously explained, if the legitimacy of our present, wherever it derives from the past, is to be portrayed as accurately as possible. This is especially pertinent given the attempts by unscrupulous politicians, religious fundamentalists and their ilk to try and misrepresent and wilfully manipulate the past in order to serve their present-day agendas. An essential and necessary book at a time when sectarianism, bogus ‘nationalism’ and the muddying of historical facts are increasingly becoming a feature of our public, private and intellectual lives.Interesting factsA new collection of essays from renowned historian Romila Thapar, one of the most important Indian academics writing today.Well-researched and thoroughly accessible, this volume is sure to become essential reading for those interested in Indian history and religion.Includes her experience of writing history textbooks for school, analysis of ancient history and interpretations of the epics, and the role history plays in contemporary politics.Understanding our past is of critical importance to our present.Many popularly held views about the past need to be critically inquired into before they can be taken as historical. For instance, what was the aftermath of the raid on the Somanatha temple? Which of us is Aryan or Dravidian? Why is it important for Indian society to be secular? When did communalism as an ideology gain a foothold in the country? How and when did our patriarchal mindset begin to support a culture of violence against women? Why are the fundamentalists so keen to rewrite history textbooks?The answers to these and similar questions have been disputed and argued about ever since they were first posed. Distinguished historian Romila Thapar has investigated, analyzed and interpreted the history that underlies such questions throughout her career; now, in this book, through a series of incisive essays she argues that it is of critical importance for the past to be carefully and rigorously explained, if the legitimacy of our present, wherever it derives from the past, is to be portrayed as accurately as possible. This is especially pertinent given the attempts by unscrupulous politicians, religious fundamentalists and their ilk to try and misrepresent and willfully manipulate the past in order to serve their present-day agendas. An essential and necessary book at a time when sectarianism, bogus ‘nationalism’ and the muddying of historical facts are increasingly becoming a feature of our public, private and intellectual lives.Interesting factsA new collection of essays from renowned historian Romila Thapar, one of the most important Indian academics writing today.Well-researched and thoroughly accessible, this volume is sure to become essential reading for those interested in Indian history and religion.Includes her experience of writing history textbooks for school, analysis of ancient history and interpretations of the epics, and the role history plays in contemporary politics.",
  "genres": [
    "History",
    "Nonfiction",
    "India",
    "Politics",
    "Essays",
    "Indian Literature"
  ],
  "author": "Romila Thapar",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/21854094-the-past-as-present"
}