{
  "title": "The Sacrifice Series - Volumes One - Three",
  "description": "Volumes One - Three of The Sacrifice Series rolled into one action packed romantic adventure for your enjoyment!Volume 1 - FateChasca Leon grew up in foster care and never spent a lot of time making friends. There were things about her people just wouldn’t understand. Things even she didn’t understand. She lived a very quiet life, going to work, and going home, never intentionally seeking adventure. This is, until she was kidnapped. Chasca cannot comprehend why someone would kidnap her and she only discovers why once she is rescued by two gorgeous militant men. While under their protection she learns that she is not human and that the strange things that have been occurring all her life were all because she is of the Nephilim bloodline.Fate has never been a thing Chasca has concerned herself with but once she learns that she is part of an ancient prophecy she begins to understand that she is truly in danger. Her protectors do everything they can to keep her out of harm’s way but there’s only so much that can be done when your ward is a headstrong mouthy woman.Volume 2 - ChancePandora has been under the care of The Sapient since she was a young child. This is the life that she knows. When an army of men from The Order led by Aiden Ripley break into the prison in which she is kept, she is forced to make the decision to stay or leave. What The Order does not know is that Pandora’s captivity is for the good of all men. Once her abilities have been unleashed, terror and death will rain down on everyone around her.Convinced that she can control her abilities and live as normal as is possible within the care of The Order, Pandora leaves her captors. Pandora comes to be known as simply Dora to those she befriends. She forms a fast bond with those around her while hiding her capabilities for fear of dismissal. However, when the lives of those she loves are endangered by the very same men she had escaped she is forced to make one of the hardest choices of her life. All decisions are based on possibilities and chances. Whether the results are joyful or dire rests in the hands of a young woman who knows nothing save for the life lived as a captive with clutches for the control to reign herself and her abilities.“Chance knows not of the divine, nor the strands of fate. It is but a ripple in our precarious existence, easily overseen, seldom noticed.”Volume 3 - WillMaddix Ripley is a natural born killer. Or at least that’s how she sees it. Her Elioud heritage caused her to be born with extremely heightened senses and after years of training, her skills are undeniable. After spending years on the street as a vigilante, of sorts, she has compiled a list of the most ruthless souls she has come across and she’s hell bent a determined to take them all out. Personally. But the terrible events in her past leave her emotionally scarred and hesitant to trust anyone. Living at the compound and working with the members of The Order, Maddix quickly becomes attached to all of them, which is something she never allows herself to do.Angelo Deluca wasn’t something Maddix was looking for but he just might be something she needs. She never believed that she was made to be someone’s other half but Angelo has her wishing she was. They’re both broken and jaded which leaves Maddix questioning their love as well as her sanity. But when one of her vigilante stunts goes horribly wrong and she’s forced to call him for help she left with a choice. Does she stay with the people she loves and risk their lives? Or does she leave, leaving her heart behind as well.“One’s mental fortitude, one’s mettle, aligned with one’s will is the most formidable human attribute. No man, machine, nor divine intervention can supersede. The will to persevere, no matter the odds, ignites the soul like a beacon. Illuminating the obstacles on their path and turning them to dust in its wake.”",
  "genres": [],
  "author": "A.C. Heller",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/21855438-the-sacrifice-series---volumes-one---three"
}