{
  "title": "Seduced by the Game",
  "description": "It’s time to drop the gloves and fight! Support the Fight against cancer that is. This anthology of 8 novellas is hot enough to melt the ice these players skate on. Featuring spell-binding novels from popular New York Times & USA Today, Amazon, and Barnes and Noble bestselling authors, including Toni Aleo, Cassandra Carr with Cindy Carr, Jami Davenport, Catherine Gayle, Jaymee Jacobs, V.L. Locey, Bianca Sommerland, & Nikki Worrell. Bianca Sommerland BLIND PASS (The Dartmouth Cobras 0.5): Nothing could stop Tim Rowe, the assistant coach of the Dartmouth Cobras, from falling in love with Madeline, but love alone can’t satisfy every need. Sometimes, to reach the goal, you have to take the chance with a . . . Blind Pass.Jami Davenport Crashing the Boards (Seattle Sockeyes 1.5): Professional party crasher, Izzy Maxwell, needs the cooperation of reluctant party guest Cooper Black, the team captain of Seattle’s new hockey team, but Cooper can’t get past his anger over the team’s relocation to Seattle. Can Izzy melt Cooper’s frozen heart or will this party crash along with her fledgling business?Cassandra Carr and Cindy Carr Hooking Hannah: When Hannah attends the NHL All-Star game, she doesn't expect a hockey player of all people to turn her world upside down. Her sister is married to a player and Hannah never wanted that life. But Scott could change everything. For Scott's part, he has to know the woman who stirred his blood with just a look, and once he does, he realizes he wants Hannah to be his forever. Now to convince her...Catherine Gayle Taking A Shot (Portland Storm 2.5): Katie Weber has had a crush on Jamie Babcock for almost two years, since he joined her father’s NHL team, the Portland Storm as an eighteen-year-old rookie. When cancer takes her health, her hair, and even her friends, she can’t bear to go to senior prom…until Jamie intervenes. Toni Aleo Tangled in the Laces (The Assassins series: Prequel to Laces and Lace):In Tangled in the Laces, Karson King is on the fast track to the NHL. Lacey Martin is coming back from a hard fight against cancer and is terrified of him but the attraction is too much to ignore. Soon their love is so intense, neither of them see the rest of their lives without the other. Will Karson prove that he will protect her heart at all costs, or will he leave Laceyto pick up the pieces of her life once again?V.L. Locey HEIR APPARENT: Superstar Cam Evans is fighting to climb out of a slump that`s growing worse with each day of living in denial. Fresh from the minors, Jacobi Neal is hungry for this chance to play back-up for the legendary goalie. Can two men battle each other, their inner demons, and the sizzling attraction building between them?Jaymee Jacobs A VALUABLE TRADE: Bryan's life gets turned upside when he gets traded to the Dallas Comets, and things get even messier when he meets Georgiana, the Director of Team Services. He's got a lot of work to do to prove his worth to his new team, but Georgiana's sure he'll prove to be a valuable trade.Nikki Worrell Captain My Captain (Prequel to the NHL Scorpions Series): Keith Lambert is the captain of the Philadelphia Flyers—until he’s not. To everyone’s shock, he’s traded to the San Diego Scorpions. As if that’s not bad enough, Phoebe, his girlfriend of two years, decides she doesn’t love him enough to follow.All alone in a new town, Keith is drawn to Kelly, his take out delivery girl. When she shows up at ice girl tryouts, he’s lost. She’s all he can see. Can he convince her to forget her past and take a chance on him or is he destined to be alone in a new town a little bit longer?",
  "genres": [
    "Sports",
    "Hockey",
    "Romance",
    "Sports Romance",
    "Contemporary Romance",
    "Anthologies",
    "Erotica"
  ],
  "author": "Toni Aleo",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/21854679-seduced-by-the-game"
}