{
  "title": "A Sweet Life Boxed Set",
  "description": "Featuring a foreword by #1 New York Times Bestselling Author Debbie Macomber.I Only Have Eyes For You by Bella Andre (The Sullivans)The only woman wealthy Irish pub owner Jake McCann wants is the one he can't have--Sophie Sullivan, his best friend's off limits sister. But when the beautiful librarian appears on his doorstep as his every fantasy come to life, even though Jake knows loving Sophie isn't the right thing to do...how can he possibly resist?On A Night Like This by Barbara Freethy (Callways #1)From #1 NY Times Bestselling Author Barbara Freethy comes the first book about the Callaways, a big Irish family born to serve and protect, many as San Francisco firefighters.May Day! By Heather GrahamMembers of the Krewe of Hunters team plan a relaxing vacation to jolly old London for the English celebration--they never figured that a May Pole just might be murder.Shopping for a Billionaire by Julia KentWhen mystery shopper Shannon Jacoby meets billionaire Declan McCormick with her hand down a toilet in the men's room of one of his stores, it's love at first flush.Built to Last by Susan MalleryThe tale of Aaron Cross, a man who doesn't know he needs saving...until he meets Marissa Spencer, a heroine inspired by the real life founder of the Motheread/ Fatheread Literacy Program.A Baby of Her Own by Brenda NovakDelaney is tired of waiting for the right man--all she wants is a baby. After seducing a handsome stranger, she returns to Dundee to find that same man is actually taking up residence on a ranch just outside of town--where he will very likely realize she's expecting.Dare to Love by Carly PhillipsIn relationships, Ian Dare offers the bare minimum--until one glimpse of sensual Riley Taylor changes his perspective. Their affair heats up and love comes into play, but Riley's secret past just might cost them everything.Executive Seduction by Jennifer ProbstWhen Chandler Santell turns to Logan Grant, the most ruthless CEO in the finance industry to save her beloved Yoga and Arts Center, she never intended to have seduction as part of the plan...In Too Deep by RaeAnne ThayneThough fiercely drawn to the comfort of Andrea McPhee's arms, Will Tanner isn't sure he can find room for a woman like her in a life focused on vengeance--until he discovers she has secrets of her own.Every Girl Does It by Rachel Van DykenAmanda gets a flash from the past when the nerdy kid she rejected in high school suddenly reappears in her life...dead sexy, he's all man and he wants her.Homecoming Season by Susan WiggsMiranda Sweeney and her family find hope and healing while spending an autumn at Willow Lake after Miranda survives breast cancer.",
  "genres": [
    "Anthologies",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Fiction",
    "Mystery"
  ],
  "author": "Bella Andre",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/21857185-a-sweet-life-boxed-set"
}