{
  "title": "Adam's Ambition",
  "description": "Meet Adam, the first of five unforgettable characters in the Emerald Springs Legacy. Life in the small town of Emerald Springs, Washington, is anything but slow and peaceful. An old feud between former business partners Whitman and Sanders keeps competition on a high burner, fueling resentment, renewing rivalries … and love. Now someone is trying to bring down Emerald Tea Farm, and it’s up to both families to protect their future while still wrangling over the past.Oldest son Adam Whitman never planned to take his place at the helm of the family business, and he’s living the life he always wanted. When his father asks him to come home to consider his options, he reluctantly leaves his high-powered job in Los Angeles and heads to Emerald Springs, determined to help his father make the transition to retirement and quickly get back to his own life. What he didn’t count on was the pull of the one person he’d left behind to chase his dreams.Getting over Adam was the hardest thing Zoe Miller ever had to do, and she’s in no hurry to do it again. She’s focused on her new life running Emerald Springs’s finest bakery, and she’s finally put the heartache of losing Adam behind her. When he rolls back into town, she knows it would be wiser to keep her distance from her high school sweetheart, but some things are easier said than done. A broken heart would be more devastating the second time around, but can she resist the lure of the man he’s become?Now everything Adam took for granted is suddenly threatened, and he’s caught between his newly awakened attachment to Emerald Springs and the career he built with his hands. He wants it all—the girl, the farm, the corner office—but first Zoe has to find it her heart to give him a second chance at all.",
  "genres": [
    "Romance",
    "Contemporary Romance"
  ],
  "author": "Monica Tillery",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/21859704-adam-s-ambition"
}