{
  "title": "The Consecration",
  "description": "The Five Points of this Pentangular Tale of Diabolical Suspense… Point One: The chief executive officer of the Smithsonian Institute reads an obituary notice posted at an online memorial. Before you know it, both the Smithsonian and the World Health Organization are hot on the trail of a particular souvenir that was brought back home by a U.S. Army Corporal at the end of WWII – or are they? Point Two: There is an epidemic of a mutated strain of the rabies virus that’s currently threatening Europe and the United States with the potential of becoming a worldwide pandemic. Point Three: From the brooding jungle of Bolivia, an army of vicious killers calling themselves the Soldiers of Satan are on a crusade. Their solitary goal, according to the mysterious and unknown leader is to eradicate Christianity from the face of the Earth. Moving steadily north, the campaign is holding true to its cause, spreading death and destruction in the wake of heinous and unspeakable atrocities. Point Four: A host of medieval vampires show up, led by an eight-hundred and fifty year old knight-errant; ostensibly Russian mafia involved with an international smuggling ring. They take up residency at an old abandoned paper factory in upstate New York. With its interior completely redesigned the old factory becomes their fortress and center of operations for their actual goal – which includes, among other things, the acquiring of an encrypted scroll that retains an ancient message of immense significance. Point Five, is two-fold: First, there’s Francis Macheath, known regardfully on the streets of New York City as Frankie Mack – a 21st century rendition of Mack the Knife. This singularly unique individual is more than equal to the task of unraveling each and every mystery surrounding these occurrences, which are all somehow linked. At the same time Macheath must also deal with the irresistible allurement of the highly suspicious femme fatale and her rivalry with his child consort – a fiery Puerto Rican bruja. Second, Ithiel Town – The Unknown Entity of the story… Is he an ancient vampire?... A demon?... Or even Satan himself?... Are Macheath and he on the same side? Kin to one another?… Could they be – Brothers? Or, are they implacable enemies… In a world where there’s no room for both…. \"Dichotomy of Evil\" tells a thrilling story of pending catastrophe. It tells of evil from the past, evil in the present, and the greatest evil of all planned for the future. Rendering a thrilling paranormal mystery filled with good old fashioned action, romance and intrigue. All of which is superbly carried out by a cast of interesting characters. The sort of people we see on the street everyday, perhaps even know. They all have private agendas – are not exactly honest – and none are what they claim to be. \"Dichotomy of Evil\" pits the bad against the worse in a no holds barred war between unequivocal evil and its alter ego… When reading this engrossing tale of chaotic perplexities, just remember – nothing in it is as it seems and everyone in it is worse than you may assume.",
  "genres": [],
  "author": "Jesse Merwin",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/21857232-the-consecration"
}