{
  "title": "Josh's Wild Imagination",
  "description": "Disclaimer: Kids please DO NOT try this at home. Climbing inside a refrigerator or freezer is extremely dangerous! You can only get to Midian to visit the Fruggies within the contents of these books.Meet Josh, a happy little 4 year old boy who has an active imagination. Josh always wondered what went on inside the refrigerator when no one was there. One day while Josh is looking in the fridge for some cheese sticks he meets The Fruggies. Join Josh on his adventures inside the refrigerator.Editorial ReviewReviewed by Jane Finch for Readers' FavoriteJosh’s Wild Imagination by Pam Funke immediately grabs the attention with the catchy title. I wondered from the start what Josh was going to get up to and it was amusing as his tummy began to grumble and he looked everywhere for a monster, not realising what was making the noise. When he finally realises it’s his tummy making the noises, he goes to the refrigerator to find something to eat. That’s when the adventure begins and his wild imagination takes over. A magic cookie takes Josh on a mystical journey to a another world with his new friends, The Fruggies.The author, Pam Funke, delves into every young child’s imagination in this story. Why can’t bananas have names or a potato talk? The writing style is ideal for the target age, perfect for a parent to read to a young child, and the simple drawings help to bring the story to life. As Josh journeys through the new world he has discovered, the author introduces characters and stories from the Bible, which was a bit of a surprise. Josh has heard his mother talk of Jesus and so the names and stories are not new to him, although the introduction is rather unexpected. But the end result is that the story of Josh’s wild imagination blends with a Christian viewpoint and, for children from a Christian family, this would not seem out of place. The writing flows nicely and the characters are well developed; this would certainly be the type of book a parent could read to a child with perhaps explanations along the way.Reader's Favorite 4 Star Review",
  "genres": [],
  "author": "Pam Funke",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/21858287-josh-s-wild-imagination"
}