{
  "title": "Ida: A Sword Among Lions",
  "description": "In the tradition of towering biographies that tell us as much about America as they do about their subject, Ida: A Sword Among Lions is a sweeping narrative about a country and a crusader embroiled in the struggle against lynching: a practice that imperiled not only the lives of black men and women, but also a nation based on law and riven by race.At the center of the national drama is Ida B. Wells (1862-1931), born to slaves in Mississippi, who began her activist career by refusing to leave a first-class ladies’ car on a Memphis railway and rose to lead the nation’s firstcampaign against lynching. For Wells the key to the rise in violence was embedded in attitudes not only about black men but about women and sexuality as well. Her independent perspective and percussive personality gained her encomiums as a hero -- as well as aspersions on her character and threats of death. Exiled from the South by 1892, Wells subsequently took her campaign across the country and throughout the British Isles before she married and settled in Chicago, where she continued her activism as a journalist, suffragist, and independent candidate in the rough-and-tumble world of the Windy City’s politics.In this eagerly awaited biography by Paula J. Giddings, author of the groundbreaking book When and Where I Enter, which traced the activisthistory of black women in America, the irrepressible personality of Ida B. Wells surges out of the pages. With meticulous research and vivid rendering of her subject, Giddings also provides compelling portraits of twentieth-century progressive luminaries, black and white, with whom Wells worked during some of the most tumultuous periods in American history. Embattled all of her activist life, Wells found herself fighting not only conservative adversaries but icons of the civil rights and women’s suffrage movements who sought to undermine her place in history.In this definitive biography, which places Ida B. Wells firmly in the context of her times as well as ours, Giddings at long last gives this visionary reformer her due and, in the process, sheds light on an aspect of our history that isoften left in the shadows.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Race",
    "Feminism",
    "Politics",
    "African American"
  ],
  "author": "Paula J. Giddings",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/1126292.Ida"
}