{
  "title": "The Choice",
  "description": "This edition is no longer available for purchase.\nWhat’s a good girl to do when she discovers Satan is her grandfather?  There has only ever been one real war between good and evil. All the rest, have just been distraction and delusion.  Satan started the war, when he and all who fought with him sought to oust God and put Satan on the throne. From the moment he fell from Heaven he has been plotting and battling to return and take over Heaven. This time he plans on winning, no matter what the cost.  Mystery Williams is a college student with big dreams and no clue that from her first breath she has been Satan’s most desired prize for this battle. Then one night her father is killed and her world implodes. The protection spell that had been keeping her hidden and her powers bound comes crashing down and so does everything she believes in.  Mystery tries do what she knows in her heart to be right; she teams up with those who are fighting against Satan. She uses her newfound powers to wage war against the forces of darkness. Her choice seems so easy until…  Mystery discovers Satan is her grandfather and his followers, the Roodmasi have kidnapped her son. Whispers tell her if she just comes back to the Roodmasi, she can be with her son and her people; the world will go on as it has for millennia. Everything but her heart knows this is a lie.  According to prophecy, if Mystery stays with good and fights, Satan will not be able to ascend. If she does not go to the Roodmasi, they will kill her to prevent her turning against them and ruining their plans, and they will kill her son. If Mystery goes to them and they have been lying to her about the fate of humankind, she will set in motion the events that will plunge the world into permanent darkness.  The balance of this battle hangs on Mystery’s choice.",
  "genres": [],
  "author": "Tanya R. Simon",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/21857978-the-choice"
}