{
  "title": "Haifa: My Home Town",
  "description": "ABOUT THE BOOK  In 2013, Judith Weinshall Liberman wrote a poem about her native city of Haifa, Israel, and published it in her book PASSION: Poems of Love and Protest (iUniverse, 2013). Although many decades had passed since she left Haifa and settled in the United States, her memories of her native city remained vivid and her love for old Haifa was unabated. It was for this reason that she conceived the idea of making her poem about Haifa the basis for a picture book that would convey to the reader, young or old, her memories of a magical past. The touching story and the glorious illustrations are sure to awaken in the reader a longing for all that was good in a world gone by.  ABOUT THE AUTHOR  Born in Israel (then called \"Palestine\"), Judith Weinshall Liberman came to the United States in 1947 to pursue higher education. She earned four American university degrees, including two in law. After settling in the Boston area in 1956, she studied art and creative writing. Beginning in the early 1960s, and for four decades thereafter, Ms. Liberman created numerous series of artworks. Her art has been widely exhibited, and is represented in the collection of museums and other public institutions. During her long career in visual art, Ms. Liberman wrote and published several books, among them picture books. Her book THE BIRD'S LAST SONG (Addison-Wesley, 1976), which she wrote and illustrated, won a citation as one of the \"fabulous books of the year.\" Later, she wrote two additional children's books, ICE CREAM SNOW (Dog Ear Publishing, 2012), which she also illustrated, and THE LITTLE FAIRY (Dog Ear Publishing, 2013). Judith Weinshall Liberman's archives can be found in the Arts Department of the Boston Public Library and at the Smithsonian Archives of American Art.  ABOUT THE ILLUSTRATOR  Radu Costea was born and raised in Iasi, Romania, where he studied computer science. In 2001 he moved to the United States to work in the information technology industry. He has designed product packaging and logos and has had extensive experience in publishing. His well-developed artistic sense is evident from the illustrations he has created for the present book.",
  "genres": [],
  "author": "Judith Weinshall Liberman",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/21865402-haifa"
}