{
  "title": "Callahan's Con",
  "description": "The discreet little bar that Jake Stonebender established a few blocks below Duval Street was named simply The Place. There, Fast Eddie Costigan learned to curse back at parrots as he played the house piano; the Reverend Tom Hauptman learned to tend bar bare-chested (without blushing), Long-Drink McGonnigle discovered the margarita and several señoritas, and all the other regulars settled into comfortable subtropical niches of their own. Nobody even noticed them save the universe.Over time, the twice-transplanted patrons of Callahan’s Place attracted a collection of local zanies so quintessentially Key West pixilated that they made the New York originals seem, well, almost normal. The elfin little Key deer, for instance--with a stevedore’s mouth; or the merman with eczema; or Robert Heinlein’s teleporting cat.For ten slow, merry years, life was good. The sun shone, the coffee dripped, the breeze blew just strongly enough to dissipate the smell of the puns, and little supergenius Erin grew to the verge of adolescence. Then disaster struck.\t\t Through the gate one sunny day came a malevolent, moronic, mastodon of a Mafioso named Tony Donuts Jr., or Little Nuts (don’t ask). He’d decided to resurrect the classic protection racket in Key West--and guess which tavern he picked to hit first? Then, thanks to very poor accessorizing (she chose the wrong belt--and no, we’re not going to explain that one), Jake’s wife, Zoey, suddenly found herself in a place with no light, no heat, and no air. And no way home. The urgent question was where--precisely where--but that turned out to be a problem so complex that even the entire gang, equipped with teleportation, time travel, and telepathic syntony (you can look it up) might not be able to crack it in time.And while all this was going on, Death himself walked into The Place. But this time he would not leave alone. . . .",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Humor",
    "Science Fiction Fantasy",
    "Time Travel",
    "Audiobook"
  ],
  "author": "Spider Robinson",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/218670.Callahan_s_Con"
}