{
  "title": "Magical Wands: A Cornucopia of Wand Lore",
  "description": "It was only an old book that the professor found while traveling by train through Scotland. A scholar of medieval history, Professor George Smith was on sabbatical studying Scottish legends and myths when he chanced to meet an aged Scotsman and his granddaughter on their way to her new boarding school in the Isle of Skye. The young girl had accidentally left her book behind, and the professor picked it up meaning to send it on to her. But then he looked inside and discovered it was no ordinary book. It was a school textbook on magic.Could it be real? Could it have actually been left by accident and found by chance? Or was it all an elaborate hoax played on the unsuspecting professor? Did he ever find the secret Isle of Skye School of Magick? Did he ever discover the hidden world of wizards and witches implied by the book's very existence? Or did they find him? The professor vanished soon afterwards, and the answers are unknown. Read the book and decide for yourself.\"Magical Wands: A Cornucopia of Wand Lore\" is that textbook from The Isle of Skye School of Magick. The first chapter begins with a basic overview of magic wands followed by an introduction to magical theory including the four planes of existence (Astral, Spectral, Physical, and Daemonic), the five metaphysical elementals (Quintessence, Air, Fire, Earth, and Water), and the three preternatural phases of Light, Twilight, and Darkness. It also contains sets of the commonly used spells associated with each of these elementals and phases. The first chapter then describes the different types of wands, their components, how they are crafted, and how they are used to cast spells. Chapter two teaches the 17 principles of wand making. Chapters three through six comprehensively cover the materials used to make magic wands including magical creatures (both beings and beasts), magical woods, mystical crystals, and mystical metals. Chapter seven documents 26 famous and infamous witches and wizards, their wands, and how well their wands suited their needs. Chapter eight concludes the textbook by nicely summarizing the contents of the entire textbook. Each of the chapters ends with student exercises, the answers of which are included in the back of the textbook which also includes a glossary, references, and afterword by the editor.If you have ever wondered what young witches and wizards actually study in their hidden magic schools, then this book is for you.",
  "genres": [
    "Fantasy"
  ],
  "author": "Wolfrick Ignatius Feuerschmied",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/21867290-magical-wands"
}