{
  "title": "What Your Doctor Won't Tell You About Your Lower Back: Avoid the Pitfalls, Scams, Shysters, Con Men, Charlatans, and Quacks",
  "description": "Easy to understand, entertaining explanation of the causes and treatments of back pain. The prevention of back pain and maintenance for the prevention of injury are detailed. Scams and bogus treatments to avoid are discussed. Written by a physician who wants your lower back to stop hurting and never hurt again, he demonstrates how to make your lower back feel better and how to avoid injury and re-injury. The best ways to recover from an injury are explained. Treatments available, including non-invasive, injections, and surgery are explained, showing what works, what doesn't and why. While reading this book, you need to remember two things. We outlive our backs and we overuse them. They were designed by evolution to last a lifetime. Unfortunately, that lifetime was one of a hominid hunter-gatherer who lived 35-40 years before he succumbed to disease, was caught in the open by a predator, or suffered a career-ending injury climbing a tree or a steep cliff. The human vertebral column filled its role admirably for 200,000 years. Social evolution, public health, modern society, and modern medicine changed our life style and lengthened our life span. We do things our ancestors would never have done (sit on our butts all day, for one). In addition, we live twice as long as they did. After age 40, it is probably a good idea to think of your spine the way an owner of a classic automobile thinks of his car. Given good care and attention, he can drive it daily for as long as he lives. He has to be willing to do the preventative maintenance and avoid putting it in danger. A classic automobile lasts longer if it was well taken care of when it was new, also. After a collision, it can be rebuilt, but it will never be quite the same.",
  "genres": [
    "Self Help",
    "Health"
  ],
  "author": "Bill Yancey",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/21867344-what-your-doctor-won-t-tell-you-about-your-lower-back"
}