{
  "title": "Born Is Unborn - Between Heaven and the Brain",
  "description": "God came to give messages to a child that \"He\" did not exist in the figures of gods and goddesses, which people worshipped around him. Instead, God explained that \"He\" existed as a mystery, hidden from the world, who could not be seen, felt or touched by any one. Since then the child developed a secret friendship with God. However, there was an understanding between the child and God that the child will not divulge this secret encounter with the Divine to anyone in the outside world. When he stepped into adulthood, God started revealing Himself in a different way: In the same physical body two different existences started emerging. One was bound to the will and ego-bound mind, with whom he could identify himself as a person, while on the other side, there existed a Divine Being, who could penetrate the physical state and incarnate in a physical body - a phenomenon which could not be grasped by the human intellect. Later in life, as a highly creative person, with wide knowledge in many fields of science and arts, he grappled to understand these personal experiences, which defy all scientific knowledge and reason. The book throws lights on the questions: \"Do these experiences represent a case of a brain damage, resulting in wrong neural circuitry, which generate the messages of God in the mind, or does there truly exist God, who is beyond intellectual comprehension of even a very sophisticated human mind? Without finding any convincing answer, a nuclear scientist and a cosmologist, after undergoing intense dilemma and conflicts for more than fifty years, remains at bay. On one hand this book reveals a hidden world, which has disturbed, puzzled and created agony and despair, while on the other hand it has illumined the mind with knowledge and vision, not accessible through intellectual process of the mind. It is a story of pain and joy, suffering followed by profound ebullience of a spirit which is one with the cosmos and resides in us.",
  "genres": [],
  "author": "Anup Rej",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/21872753-born-is-unborn---between-heaven-and-the-brain"
}