{
  "title": "Robert Altman's McCabe & Mrs. Miller: Reframing the American West",
  "description": "Robert Altman has made a dozen films that can be called great in one way or another, but one of them is perfect, and that one is McCabe & Mrs. Miller.—Roger Ebert in The Great MoviesWhen he died in 2006, director Robert Altman left a rich legacy of films, from MASH, his breakthrough black comedy, through masterpieces like Nashville , Short Cuts , and Gosford Park . But many would agree that his crowning achievement was McCabe & Mrs. Miller , a daring downbeat film about a gambler and a prostitute. Robert Self now provides an illuminating new look at this long neglected classic.A snowbound version of High Noon , Altman's film has been described as a revisionist western, an antiwestern, and even a hippie western. Featuring cinematic icons Warren Beatty and Julie Christie at the zenith of their careers and a haunting soundtrack from legendary troubadour Leonard Cohen, it provided a new way of looking at the western and the West.Placing the film within the contexts of Altman's career, its critical and popular reception, and the history of American cinema, Self shows how Altman's idiosyncratic interplay between story and style reframed the American West for a new generation. Viewing McCabe as a kind of precursor to the New Western History, he argues that it both embraces and revises the conventions associated with the Western movie genre, especially with its antiheroic protagonist. He also highlights the film's portrayal of the contemporary counterculture, pitting the loner against corporate power and mainstream religion and granting women a newfound voice.In addition, Self sheds light on the film's production, showing how its rare sequential filming reflected the seamless collaborative efforts of director, actors, cinematographer, and set designer. Here, too, are Altman's trademark overlapping dialogue, painterly visuals, signature pan and zoom shots, crowded and communal mise-en-scenes, and a musical soundtrack mirroring the narrative—all in the service of Altman's inimitable storytelling and indelible gallery of fascinating characters. Self's beautifully written, admiring, and insightful study of this great film should significantly enhance its reputation and reinforce Altman's place in the pantheon of American filmmakers.",
  "genres": [
    "Film"
  ],
  "author": "Robert T. Self",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/2187412.Robert_Altman_s_McCabe_Mrs_Miller"
}