{
  "title": "Clausewitz: His Life and Work",
  "description": "The classical distinctions between \"strategy,\" \"operations,\" and \"tactics\" in warfare derive from two basic sources―Carl von Clausewitz and Antoine-Henri de Jomini, both veterans of the Napoleonic wars who translated their experiences into books outlining general precepts about the nature and rules of military engagement. Nearly two centuries after the publication of these works, Jomini has been all but forgotten, but Clausewitz's On War remains perhaps the most significant work of military theory ever written. He has become a global brand, one constantly refreshed by a flow of books and articles debating his ideas and arguing what he truly meant in various passages of On War. The masterwork appears in an array of translations sweeping from Arabic to Vietnamese. Military staff colleges the world over use Clausewitz's text, largely to prepare their officers for staff positions and higher command. Military historian Donald Stoker here offers an incisive biography of Carl von Clausewitz, sketching out his life and career and exploring the various causes that led to the formulation of his theories about war. Though On War remained unfinished at the time of his death in 1831, Clausewitz's devoted wife, Marie, organized the papers he had left behind and arranged for their publication. The ten volumes of Clausewitz's collected works appeared from 1832-1837, with On War encompassing the first three volumes. Stoker considers both the merits and detriments of the works, but also pays careful attention to the life and experiences of Clausewitz himself. In doing so, he notes that those discussing Clausewitz's legacy as a theorist today have largely forgotten what was most important to him: being a soldier, and one of renown. Clausewitz is often remembered merely as staff officer, someone pushing papers and not in the midst of battle. Though Stoker notes that Clausewitz certainly spilled his share of ink, he also spilled blood ― his as well as that of the enemy. He experienced the mass warfare of his age at its most intense and visceral. He knew what it was like to be wounded, to be a prisoner, to have friends killed and wounded, to suffer hunger and thirst, and to have the heat and cold try to kill him after the enemy's best efforts had failed. Success on the field of battle-success meaning victory as well as distinguishing one's self above one's comrades, who are also brave and daring men ― this, Stoker shows, is what drove Clausewitz. Stoker also considers the continuing relevance of Clausewitz's work today, particularly focusing on its effect on strategic thinking in American foreign policy. The result is a brilliant reassessment of both the man and his legacy, one that adds to our understanding of Clausewitz and his place in today's military and political landscape.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Germany"
  ],
  "author": "Donald Stoker",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/21874473-clausewitz"
}