{
  "title": "What They Did There: Profiles from the Battle of Gettysburg",
  "description": "This book first drew breath as a blog begun in the winter of 2013 during the run-up to the 150th anniversary of the Battle of Gettysburg in early July of that same year. The blog was to be my first sustained piece of writing since 2008, when I’d left the newspaper business after 25 years as a features writer and editor. If the venue had changed, my approach did not. During my career, I’d specialized in short profiles of celebrities, mostly from the field of television. I was never much for longer pieces of writing, preferring punchy vignettes that I’d hoped nonetheless were both informative and entertaining. I brought this stylistic template to profiling people who had been involved in the Battle of Gettysburg, my interest in which dates back to my childhood in the ‘60s. The 1960s, that is. My intent was to write 150 profiles to dovetail with the 150th anniversary. I didn’t really know if I could find that many people of interest to write about, but as it turned out I found more than I’d expected, especially considering that I had little interest in profiling those who had been profiled silly since the last shot was fired in the battle. So, no Robert E. Lee or George Meade or Winfield Scott Hancock or George Armstrong Custer and so on. As an example, take Gen. Gouveneur Warren, who has a striking monument on the field owing to his repute as “the Savior of Little Round Top.” I didn’t think yet another profile of Warren was needed, so I opted to write about one of his aides, a young engineering officer named Washington Roebling, who long after the battle smoke had cleared from his eyes became the principal engineer of the Brooklyn Bridge. What you’ll find here are roughly 175 profiles, not just of combatants blue and gray, but of civilians, doctors, nurses, artists, photographers, Samaritans; saints, sinners and the moral terrain in-between; men, women, children.",
  "genres": [
    "Civil War",
    "History",
    "Military Fiction",
    "Nonfiction"
  ],
  "author": "Steve Hedgpeth",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/21872478-what-they-did-there"
}