{
  "title": "White Doves at Morning",
  "description": "For years, critics have acclaimed the power of James Lee Burke's writing, the luminosity of his prose, the psychological complexity of his characters, the richness of his landscapes. Over the course of twenty novels and one collection of short stories, he has developed a loyal and dedicated following among both critics and general readers. His thrillers, featuring either Louisiana cop Dave Robicheaux or Billy Bob Holland, a hardened Texas-based lawyer, have consistently appeared on national bestseller lists, making Burke one of America's most celebrated authors of crime fiction.  Now, in a startling and brilliantly successful departure, Burke has written a historical novel -- an epic story of love, hate, and survival set against the tumultuous background of the Civil War and Reconstruction.  At the center of the novel are James Lee Burke's own ancestors, Robert Perry, who comes from a slave-owning family of wealth and privilege, and Willie Burke, born of Irish immigrants, a poor boy who is as irreverent as he is brave and decent. Despite their personal and political conflicts with the issues of the time, both men join the Confederate Army, choosing to face ordeal by fire, yet determined not to back down in their commitment to their moral beliefs, to their friends, and to the abolitionist woman with whom both have become infatuated.  One of the most compelling characters in the story, and the catalyst for much of its drama, is Flower Jamison, a beautiful young black slave befriended, at great risk to himself, by Willie and owned by -- and fathered by, although he will not admit it -- Ira Jamison. Owner of Angola Plantation, Ira Jamison is a true son of the Old South and also a ruthless businessman, who, after the war, returns to the plantation and re-energizes it by transforming it into a penal colony, which houses prisoners he rents out as laborers to replace the slaves who have been emancipated.  Against all local law and customs, Flower learns from Willie to read and write, and receives the help and protection of Abigail Dowling, a Massachusetts abolitionist who had come south several years prior to help fight yellow fever and never left, and who has attracted the eye of both Willie and Robert Perry. These love affairs are not only fraught with danger, but compromised by the great and grim events of the Civil War and its aftermath.  As in all of Burke's writings, White Doves at Morning is full of wonderful, colorful, unforgettable villains. Some, like Clay Hatcher, are pure \"white trash\" (considered the lowest of the low, they were despised by the white ruling class and feared by former slaves). From their ranks came the most notorious of the vigilante groups, such as the Ku Klux Klan, the White League and the Knights of the White Camellia. Most villainous of all, though, are the petty and mean-minded Todd McCain, owner of New Iberia's hardware store, and the diabolically evil Rufus Atkins, former overseer of Angola Plantation and the man Jamison has placed in charge of his convict labor crews.  Rounding out this unforgettable cast of characters are Carrie LaRose, madam of New Iberia's house of ill repute, and her ship's-captain brother Jean-Jacques LaRose, Cajuns who assist Flower and Abigail in their struggle to help the blacks of the town.  With battle scenes at Shiloh and in the Shenandoah Valley of Virginia that no reader will ever forget, and set in a time of upheaval that affected all men and all women at all levels of society, White Doves at Morning is an epic worthy of America's most tragic conflict, as well as a book of substance, importance, and genuine originality, one that will undoubtedly come to be regarded as a masterpiece of historical fiction.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Civil War",
    "Historical",
    "American Civil War",
    "Crime"
  ],
  "author": "James Lee Burke",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/218735.White_Doves_at_Morning"
}