{
  "title": "The DASH Diet Fish and Seafood Cookbook: 30 Delicious Low Salt Fish and Seafood Recipes for Lowering Blood Pressure, Losing Weight and Improving Your Health",
  "description": "US News and World Report the DASH Diet as the best dietary approach available for the 4th year running.The DASH Diet is taking the health and fitness world by storm. But, what is the DASH Diet? It is a dietary approach that was created by the National Heart, Lung and Blood Institute with the specific purpose of lowering blood pressure. In addition to lowering blood pressure, adopting the diet has been shown to protect the body against cancer, heart disease, diabetes, osteoporosis and strokes. DASH is an acronym for Dietary Approaches to Stop Hypertension. The diet lives up to its name, and the other benefits mentioned above, by following some key dietary choices such as greatly reducing sodium intake and eating wholefoods. Key foods in any successful DASH diet are fish and seafood… In this book you will discover 30 amazing DASH diet fish and seafood recipes that are easy to cook, absolutely delicious and that are packed full of nutritious goodness. Everything from scallops to mussels and tilapia to salmon is covered in this book and I guarantee that if you follow the recipes you will never tire of eating fish again. Oh, I forgot to mention that in addition to all of the DASH Diets amazing benefits it also greatly promotes fat loss. This means that as you work your way through the recipes in this book you will actually be losing weight… effortlessly. So, if you’re looking for a new healthy approach to food then the DASH Diet may be perfect for you. Buy the book now and learn how to cook the most delicious low salt, DASH Diet fish and seafood recipes available. P.S. For buying the book you also get a free gift, so don’t forget to check it out!",
  "genres": [],
  "author": "Sarah Sophia",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/21869076-the-dash-diet-fish-and-seafood-cookbook"
}