{
  "title": "Agnes Canon's War",
  "description": "Agnes Canon is tired of being a spectator in life, a small-town schoolmarm and an invisible daughter among seven sisters, meat for the marriage market. The rivers of her Pennsylvania countryside flow west, and she yearns to flow with them, explore new lands, know the independence that is the usual sphere of men. This is a story of a woman's quest for freedom, both social and intellectual, and her education on the journey to freedom. She learns that freedom can be the scent and sound of unsettled prairies, the glimpse of a cougar, the call of a hawk. The struggle for freedom can test the chains of power, poverty, gender, or the legalized horror of slavery. And to her surprise, she discovers it can be found within a marriage, a relationship between a man and a woman who are equals in everything that matters. It's also the story of Jabez Robinson, a man who has traveled across the continent and seen the beauty of the country and the ghastliness of war, as he watches his nation barrel toward disaster. Faced with deep-seated social institutions and hard-headed intransigence, he finds himself helpless to intervene. Jabez's story is an indictment of war in any century or country, and an admission that common sense and reasoned negotiation continue to fail us. As Agnes and Jabez struggle to keep their community and their lives from crumbling about them, they must face the stark reality that whether it's the freedom of an African from servitude, of the South from the North, or of a woman from the demands of social convention, the cost is measured in chaos and blood. This eloquent work of historical fiction chronicles the building of a marriage against the background of a civilization growing - and dying - in the run-up to civil war.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Civil War",
    "Historical",
    "19th Century",
    "The United States Of America"
  ],
  "author": "Deborah Lincoln",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/21882293-agnes-canon-s-war"
}