{
  "title": "Somewhere With You",
  "description": "This is the tale of first and last loves. And those that come in between... Jack Harrison is a relentless overachiever who leaves little in the way of compromise. A businessman to the core--he's hell-bent on being at the top of the food chain. After all, no one can trip you up if you're on top, as he likes to say. The problem for Jack is there's only one thing that continually trips him up -- and that's her. Amelie Rose, with a name like poetry and a heart of gold, as her father always said, is a free-spirited photographer who has managed to land a job at one of the top travel magazines in the world. This is both a blessing and a curse since Amelie never stays in one place for long and has refused to commit to anything -- ever. It might seem to the casual observer that these two have almost nothing in common. But fate would disagree. The story chronicles Jack and Amelie's lives from childhood into adulthood, beginning when they meet as then eight- and ten-year-olds at summer camp specifically designed for children who've lost too much. As fate steps in, and that first summer seals the deal, they come to depend on each other in ways neither of them expected, with each summer bringing them closer than the last. As they come to terms with life and loss, with hanging on and letting go, they'll teach each other that some bonds are meant to last. Together, they will travel the world, meeting in various places where they'll come together, and fall apart, all the while struggling to discern if the other could possibly be the one. This unlikely love story takes us on an adventure where two people come of age, fall in and out of love, and question the role timing plays in it all. Their story is proof that neither time nor distance -- perhaps not even death -- can destroy what love creates. So it seems the only question left to ask is whether love is enough?",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Fiction",
    "Contemporary",
    "New Adult",
    "Friends To Lovers",
    "Chick Lit"
  ],
  "author": "Britney King",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/21882321-somewhere-with-you"
}