{
  "title": "Paths of Anguish",
  "description": "Primeval Origins: Paths of Anguish (2nd Edition) - Book #1 in this epic story revealing mankind's undiscovered history and ancient origins bringing rise the legendary Four Horsemen. Join Nikki, a paleo-archeological graduate student suffering life altering happenings turning her life upside-down and sending her on the run from forces unknown as she learns of and experiences our undiscovered and hidden history. A history filled with terrible tyrannies, deadly dinosaurs, brutal beasts, ancient gods, and heroic hearts as the origins of our End Times is revealed, answering the question, \"What if all of our myths and legends are true?\"Primeval Origins: Paths of Anguish (Book #1 in this Epic Saga, 2nd Edition)AWARDS and HONORS * Young Adult Book of the Year, 2014/2015 Reader Views Literary Awards. * Finalist, Fantasy Book of the Year, Readers Favorite 2016 Book Awards * Finalist, Fantasy Book of the Year, 2016 International Book Awards * Distinguished Favorite, Epic Fantasy Book of the Year, 2017 Independent Press Awards * Fantasy Book of the Year, 2017 NYC Big Book Award * Winner, Science Fantasy, National Association of Book Entrepreneurs (NABE) Winter 2018 Pinnacle Book Achievement Award Epic Fantasy, Science Fantasy, Fantasy, Science Fiction, Young Adult, Action & Adventure, Myth & Legend, Dystopian, Good and Evil, Christian Fantasy, Kindle, Nook, iBook/iTunes...and maybe more truth than is expected.Myths and Legends…just fables and fantasies for those taught to scoff at the misunderstood, as I was taught when a graduate student in the sciences; scorn and ridicule the forbidden. Myths are just…myths. Legends are just…legends. Then, I discovered different, in a South American dig where my life went upside down after finding what should not be with what we thought we knew so much about. My consciousness, my Light, plunged through a maelstrom bound to those of our undiscovered history. I witnessed through the eyes of ancient warriors, Rogaan and others, a wondrous human civilization of old, grand beasts and dinosaurs, and celestial gods of myth in what the modern Hopi and Maya branded our First World-Age. An age deep in blood and conflict born of gods and new man covetous of true powers and self-motivations loosing upon their world tyrannies, energy forces…sorceries, and abominations affronting Creation. Sealing the fates of the age, sword-messengers, warrior angels, risen new to bring forth the Harbinger of Creation’s Judgments, slayers of civilizations…both of men and gods, the Horsemen. I am bound to them. In the here and now, standing at the precipice at the end of mankind’s Fourth World-Age, I fear what is to come from the others…the Horsemen of Prophecy. And yet, I have hope for what follows. As our ancients did in tablets of clay teaching us our undiscovered past, I Nikki, now share these steel bound epics with you before the sounding of the trumpets.Visit the Primeval Origins websites at: primevalorigins.com celestialfurypublsihing.com facebook.com/primevalorigins The websites are loaded with news, the Primeval Origins Encyclopedia and Lexicon (all the background elements that you just can't stuff into the books).",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Young Adult",
    "Christian",
    "Thriller",
    "Science Fiction Fantasy",
    "Epic Fantasy"
  ],
  "author": "B.A. Vonsik",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/21877358-paths-of-anguish"
}