{
  "title": "A House Divided",
  "description": "Equal parts Edgar Allan Poe, Anne Rice, and Stephen King -- with a generous helping of jambalaya and crawfish pie -- Louisiana-born-and-bred horror maven Deborah LeBlanc's A House Divided is a supernatural thriller about a greedy building contractor who, after dividing and moving an old house, stirs up spirits better left undisturbed. When Keith Lafleur discovers that he can obtain a majestic old farmhouse for free -- all he has to do is move it -- he jumps at the opportunity. But the spot where he wants to place it is too small, so he splits the house in half and creates two separate buildings. After renovations, one house is rented by friends Laura Toups and Tawana Batiste, who open a salon on the first floor and live above the shop with Tawana's mentally challenged cousin, Moweez. Matt Daigle rents the second structure, turning the ground floor into a café and living upstairs with his eight-year old son, Seth. But when unexplainable calamities start occurring -- Lafleur becomes afflicted with necrotic lesions, Seth is tormented by children's voices, Moweez begins drawing horrific premonitions, etc. -- the inhabitants of the house divided must get to the bottom of the ghostly mystery before it's too late With just three novels under her belt (Family Inheritance, Grave Intent, and A House Divided), LeBlanc has already amassed a huge cult following. This can be attributed not only to her ultra-smooth and richly descriptive writing style but also to her unique blend of sardonic wit and Lovecraftian nightmare. Her stories are not only frightening, they're great fun in a macabre sort of way. In A House Divided, for example, she portrays Lafleur not only as a repulsive villain but also as a kind of comedic cautionary example. Gruesome, creepy and chock-full of jaw-dropping plot twists, this novel is, above all else, wildly entertaining. Paul Goat Allen",
  "genres": [
    "Horror",
    "Paranormal",
    "Fiction",
    "Ghosts",
    "Thriller",
    "Adult",
    "Mystery"
  ],
  "author": "Deborah Leblanc",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/218756.A_House_Divided"
}