{
  "title": "Nation Builder: John Quincy Adams and the Grand Strategy of the Republic",
  "description": "“America goes not abroad, in search of monsters to destroy”―John Quincy Adams’s famous words are often quoted to justify noninterference in other nations’ affairs. Yet when he spoke them, Adams was not advocating neutrality or passivity but rather outlining a national policy that balanced democratic idealism with a pragmatic understanding of the young republic’s capabilities and limitations. America’s rise from a confederation of revolutionary colonies to a world power is often treated as inevitable, but Charles N. Edel’s provocative biography of Adams argues that he served as the central architect of a grand strategy that shaped America’s rise. Adams’s particular combination of ideas and policies made him a critical link between the founding generation and the Civil War–era nation of Lincoln.Examining Adams’s service as senator, diplomat, secretary of state, president, and congressman, Edel’s study of this extraordinary figure reveals a brilliant but stubborn man who was both visionary prophet and hard-nosed politician. Adams’s ambitions on behalf of America’s interests, combined with a shrewd understanding of how to counter the threats arrayed against them, allowed him to craft a multitiered policy to insulate the nation from European quarrels, expand U.S. territory, harness natural resources, develop domestic infrastructure, education, and commerce, and transform the United States into a model of progress and liberty respected throughout the world.While Adams did not live to see all of his strategy fulfilled, his vision shaped the nation’s agenda for decades afterward and continues to resonate as America pursues its place in the twenty-first-century world.",
  "genres": [
    "History",
    "Biography",
    "American History",
    "Nonfiction",
    "Politics",
    "Us Presidents",
    "American"
  ],
  "author": "Charles N. Edel",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/21878116-nation-builder"
}