{
  "title": "UnDone",
  "description": "Single, tough, and hardheaded, twenty-eight-year-old Samual Cade McNotty is tired of the humdrum-rut his life has fallen into and has him considering perhaps returning to his childhood home and his large, loving family in Montana. As Sam is deeply lost in his morose thoughts, a blizzard blows the perfect woman in the doors of the gas station where he works, making things all the worse as he’s sure he’ll never see the gorgeous, seductive, captivating creature again. He couldn’t know that a fateful tragedy will soon entrench them firmly into each other’s lives in ways neither of them has ever imagined as his training and expertise are put to good use in a seemingly insurmountable test. Independent, smart, and happy-go-lucky, twenty-five-year-old Belinda Day Whisper—Billy for short—is blindsided by the mysterious, beautiful, provocative man she meets late one night at a convenience store she uncharacteristically decides to stop at. Even though she doubts their paths will ever cross again after she leaves the store, she can’t shake the magnetic pull of his memory, or her unreasonable attraction to him. After an unexpected mischance reunites them, she finds herself and her heart gravitating ever more in the direction of the seductively intriguing, almost overbearing man in ways that defy logic, to the point that spending so much time with him as ‘just friends’ simply isn’t enough. Come along and experience this emotionally charged story, and the sparks which Sam and Billy’s mutual attraction create as they both try to fight an ultimate yearning that’s too intense to ignore. Get to know their loving, witty, somewhat quirky, yet extremely loyal friends and families as you follow the chain of events that lead to the kind of profound love neither of them had ever thought attainable or even possible.",
  "genres": [
    "Romantic Suspense"
  ],
  "author": "L.M. Randem",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/21895750-undone"
}