{
  "title": "A Newbery Christmas: Fourteen Stories of Christmas by Newbery Award-Winning Authors",
  "description": "Christmastime and the Newbery Medal seem an almost irresistable combination. For what better time than Christmas, that most family-oriented of holidays, to read stories written by authors honored as winners of the John Newbery Medal for their contribution for literature for children? This collection comprises stories by authors today's children know and love, from E.L. Kongsburg and Nancy Willard to Beverly Cleary. It also contain stories by writers familiar to their parents and, perhaps, to their grandparents, from Ruth Sawyer and Rachel Field to Lois Lenski, Eleanor Estes, and Madeleine L'Engle.Some of these stories are humorous. Childen will laugh at the antics of Ramona Quimby in \"Ramona, the Sheep Suit, and the Three Wise Persons\" and at Eliot Miles's Christmas wish in E.L. Kongsburg's \"Eliot Miles Does Not Wish You a Merry Christmas Because...\" Others of the collection recall the christmases of years past, as in \"Once in the Year\" by Elizabeth Yates and \"The Hundred Dresses\" by Eleanor Estes. And others, like Madeleine L'Engle's \"A Full House,\" remind us again of the true meaning of Christmas.This is a collection to savor and to read aloud. It's a book that can be read by the fire, on the beach, in the car on the way to Grandmother's house, or on any available lap. Most of all, it's a book for sharing and for celebrating the joys of Christmas.A portion of the royalties from this book will be donated to the American Library Association, administrators of the John Newbery Medal.Introduction / Carol-Lynn Rossel Waugh --Babouscka / Carolyn Sherwin Bailey --The hundred dresses / Eleanor Estes --A letter from Santa Claus / Eleanor Estes --Eliot Miles does not wish you a Merry Christmas because ... / E.L. Konigsburg --A full house / Madeleine L'Engle --Once in the year / Elizabeth Yates --The merry history of a Christmas pie / Nancy Willard --The Christmas fake / Lois Lenski --Woodrow Kennington works practically a miracle / Katherine Paterson --All through the night / Rachel Field --The Christmas apple / Ruth Sawyer --A candle for St. Bridget / Ruth Sawyer --The galloping sleigh / Hugh Lofting --Ramona, the sheep suit, and the three wise persons / Beverly Cleary --About the authors --About the editors",
  "genres": [
    "Christmas",
    "Short Stories",
    "Childrens",
    "Fiction",
    "Middle Grade",
    "Holiday",
    "Classics"
  ],
  "author": "Martin H. Greenberg",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/2189469.A_Newbery_Christmas"
}