{
  "title": "Everything - The untold story of the Rich Young Ruler",
  "description": "\"Sell everything,\" Jesus of Nazareth had told the rich young man who had traveled so far to meet him.  This can't be the Messiah, Addi thought as he walked away from the encounter. The Messiah would have known he had dedicated his whole life to God and had built a deep and powerful financial kingdom right under Pilate and Herod's noses, a financial kingdom ready to equip and supply the Messiah's army when he returned. He and the secret organization he was a member of just needed the Messiah to step forward, claim his kingdom, and drive out the armies of Rome as the prophecies of old had foretold. Therefore, he can't be the Messiah.  Yet Addi could not deny the miracles this Jesus had demonstrated, even driving out demons, so surely God must be with him. The man was fearless and bold when he taught the people, his message powerful and amazing, yet different from what the Pharisees and Sadducees were teaching; teaching that had not gone unnoticed by them.  What must I do to inherit eternal life? Addi shook his head, feeling a little confused. Of all the questions he had wanted to ask the man, that was not one of them. Or was it?  About the story The Apostle John stated at the end of his gospel if every one of Jesus’ acts and encounters were to be written down, the whole world would not have room for the books that would need to be written. What is even more difficult to grasp is the idea each of those acts and individual encounters with the Son of God had an even deeper story and history leading up to, and following, that brief meeting. A story and history we will never know fully until we see Jesus. This book tells the story of one of those hundreds of encounters we read about in the four Gospels. It is the story of the Rich Young Ruler and the journey that led him to ask Jesus what would ultimately end up being the most important and revealing question of his life. What must I do to inherit eternal life?  In looking at the young man before him, the creator of the universe knew there was far more going on behind, within, and around this influential and wealthy young man than the simple question he had asked Jesus. There always is. In the same all knowing way, Jesus’ response had far more meaning behind it than the young man could have ever imagined, or perhaps wanted to hear. At the end of his encounter with Jesus, we read the rich young man went away sad, because he was asked to give up everything if he were to follow Jesus. Jesus goes on to explain to his disciples how hard it is for the rich to enter the kingdom of God. Afterward their only response was, \"Who then can be saved?\" Jesus' replied; \"With man, this is impossible, but with God all things are possible.\"  For many, that is where the story of the rich young ruler ends. However, there is a strange verse in Mark 14:51, about a \"young man\" who was following Jesus in the Garden of Gethsemane, as Jesus was led away after his arrest. The verse does not seem to belong or have a purpose behind it, but God always has a reason for everything.  This novel is not about the ending of this young man's life after his initial encounter with Jesus, but about the beginning of it. It is the untold story of the dangerous and impossible road he would have to travel if he were to find his Savior, his purpose, and ultimately his quest for eternal life. With God, all things are possible.",
  "genres": [
    "Christian",
    "Fiction"
  ],
  "author": "Richard A. Hackett Jr.",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/21899508-everything---the-untold-story-of-the-rich-young-ruler"
}