{
  "title": "Born to Ride - A Clubhouse Collection",
  "description": "From some of todays bestselling authors comes this awesome anthology of full length biker novels.Fighting To Stay by Kasey Millstead“Wanna take a ride, sugar?”After enduring a tough childhood, Lacey has spent her life running when things get too hard. When her boyfriend hits her, she runs again and ends up in Alabama. She meets Mayhem MC Vice Pesident, Roam, and falls hard and fast. When curveballs are thrown and lies are told, will Roam be able to convince her that it’s time she started Fighting to Stay?Storm by Nina Levine\"Baby, it's always been you. Always.\"Madison Cole’s family is the Storm Motorcycle Club. Two years ago she walked away from them and the world they live in. Jason Reilly has sacrificed a lot for the Storm MC, and two years ago he made the biggest sacrifice of all; he gave up the woman he loved for them. Now they've been thrown back together; can they overcome their past and discover love again or will the harsh reality of their world break them both?Angels in Leather by Bella JewelA Girl On The RunHer father gave her one task before he died - deliver a package. Now she's got the baddest biker in the state after her - He wants what she's got. Secrets of the past and present threaten to destroy everything she's worked for. A dark love, a jagged past, two worlds will collide to make something explosive.Welcome to Sugartown by Carmen JennerAna Belle never wanted anything more than to hang up her apron, jump on her Vespa and ride off into the sunset, leaving Sugartown in the dust.Elijah Cade never wanted anything more than a hot meal, a side of hot arse and a soft place to lay his head at night where he could forget about his biker past. She'd be willing to hand over everything tied up in a big red bow, but when Elijah's secrets come to light, their relationship is pushed to breaking point. And you thought small towns were boring. Welcome to Sugartown.Holding Out by Lila Rose\"I'd love to taste you right now, babe, but my woman wants me to fuck her, so that's what I'm gonna do.\"Zara Edgingway is a twenty-six-year-old secretary and about to face her next obstacle in life, the one she ran from six years ago: her ex husband. Talon Marcus is the president of the Hawks Motorcycle Club. For two years, he's had his eye on the quiet, yet sassy, neighbor Zara. The time has come were she'll need, not only his protection, but the help from his biker brothers. Now, if only she'd stop fighting him along the way.Ryder by Jani Kay“Princess was my Juliet and I was her Romeo – I would give my last breath for her.”Ryder wants inner peace and freedom from the torment of his childhood. Adopted by the Scorpio Stinger MC after a stint in juvie, he owes his life and loyalty to his brothers. What he doesn’t want is a judgemental, smart mouthed princess who thinks she is better than him.Jade, a newly qualified lawyer, wants a man who is perfect for her and will give her the charmed life she is accustomed too. She doesn’t want a demanding and foulmouthed biker in her life. But neither can get the other out of their head. Their undeniable chemistry is off the charts. Ryder wants Jade, but she has a secret that will stop them from ever being together. Until one fateful night when Ryder rescues Princess on his metal horse.",
  "genres": [
    "Anthologies",
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "Amazon",
    "Motorcycle"
  ],
  "author": "Kasey Millstead",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/21902087-born-to-ride---a-clubhouse-collection"
}