{
  "title": "The Forever Trilogy",
  "description": "The New York Times Bestselling Trilogy is now in a complete set. 3 books: Forever Black, Forever You, Forever Us. \nForever Black\n: When Ellery moved to New York with her boyfriend, she thought they’d live happily ever after in their small New York apartment. She never thought he’d pack his bags and leave because he “needed space.” With her newfound single status and fear of being alone, Ellery buries herself in her artwork and paintings until one night she helps a mysterious intoxicated stranger get home safely. Little did she know the mysterious stranger is none other than CEO and millionaire Connor Black. After finding Ellery in his kitchen the next morning and assuming she broke his #1 rule about sleepovers, he becomes intrigued, not only by her stubbornness and defiance, but by her kindness. Connor Black, emotionally dead and damaged, that stemmed from a personal tragedy, made a vow to never love or fall in love with a woman, until Ellery Lane walked into his life by accident. After she opens up and shows him her world, Connor starts to feel emotions and feelings he never knew existed. Despite the rumors and warnings regarding Connor Black and his use and misuse of women, Ellery finds herself being drawn into his world. Ellery knows they can never be together because she is harboring a deep secret that could destroy Connor emotionally forever. Join Connor and Ellery as they embark on a journey of courage, love and strength. Will it be enough to save them? \nForever You\n: Connor Black’s life consisted of his company and his use of multiple women. There was never going to be love, relationships or a fairy-tale life. Emotionally dead and damaged, that stemmed from a personal tragedy, Connor Black vowed never to love or fall in love with a woman, that was until Ellery Lane walked into his life by accident and changed him forever. He starts experiencing feelings and emotions he never felt before and finds himself being drawn into her world. You took the journey with Connor and Ellery as their love, courage and strength was put to the test. You watched their worlds come together through her eyes in Forever Black. Now it's time to take the journey through his in Forever You. \nForever Us\n: The story of Connor and Ellery Black continues in the last installment of the Forever Black Trilogy, Forever Us. You took Connor and Ellery’s journey of love, courage, and strength as Ellery’s illness threatened their future in Forever Black. You continued their journey through the eyes of Connor Black in Forever You as you watched them get their happily ever after through marriage and planning for their first child. Join Connor and Ellery once again as they face the challenges of parenthood. Take their journey in Forever Us as they learn to cope with the demands of a new baby, a demanding career, and the onset of a new challenges in which Connor and Ellery must confront for the sake of their family.",
  "genres": [
    "Romance",
    "Contemporary",
    "Erotica",
    "Amazon"
  ],
  "author": "Sandi Lynn",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/21901747-the-forever-trilogy"
}