{
  "title": "Kick Ass Heroines & Hot Heroes",
  "description": "A collection of romances that will thrill and captivate readers with their strong heroines and oh-so-hot heroes.The Wedding WagerRegina DukeMegan leaves the hospital whole, but in despair. Can Kevin heal her heart and save his fortune? Sweet romance from USA Today Bestselling Author Regina Duke.The Silver CrossDebra L MartinDetective Lacy Gardner is the best at what she does - hunting down vampires that prey on the good citizens of Boston. Her skills will be sorely tested when a powerful new adversary comes to town, but her greatest threat will be losing her heart to one she may have to kill.Murder Mi AmoreCara MarsiJewel thieves, murder and terrorists intrude on American Lexie Cortese's Roman holiday; can she trust the sexy, mysterious Dominic Brioni who comes to her aid?Kiss Me, TateKaren Cantwell, USA Today Bestselling AuthorTate Kilbourn was Bunny Bergen's secret high school crush, but that was 24 years ago, and a lot has happened since. When she lands a job at the nature center where Tate is the lead naturalist, will sparks fly, or will Bunny be disappointed all over again?Eyes Of JadeTess St. JohnAfter multiple attempts on her life--that oddly mirror her action movies--America's sweetheart, Eve Knight, must put her faith in the FBI agents assigned to her case. After Agent Jake Dane's special care of her, not only is her life at risk, but so is her heart.Target of BetrayalMelissa OhnoutkaKathleen Landon thought her life would finally get back to normal after the bizarre death of her husband. But a \"chance\" meeting with an old boyfriend throws her and her family on a dangerous and emotional journey full of secrets and betrayal.Love by SecretsDebra ElizabethEmily Stanton is falling for the dashing and handsome Connor Preston, but when her father objects and forces her to accept the proposal from Lady Tisbury's shy nephew instead, her heart is broken. How can she love her new husband when her heart belongs to the man who wrote her such beautiful love letters?Forgotten SoulSandra EdwardsA con-artist, hired to locate a buried treasure, finds more than she bargains for in this enchanting tale from NY Times & USA Today Bestselling Author Sandra Edwards.",
  "genres": [],
  "author": "Sandra Edwards",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/21900028-kick-ass-heroines-hot-heroes"
}