{
  "title": "Unchain My Heart",
  "description": "This novella is a paranormal fantasy love story set against the romantic backdrop of Luxor in Egypt. It is the story of village family life, two sisters and two thwarted lovers, and the invocation of mysterious forces beyond their control, which may or may not be benign.It was always understood, but never spoken, that Ahmad and Mona, childhood friends would one day marry. But Mona, held back by religious and village customs, is much too reserved to voice her love, and although her father approves of marriage outside the family and would have welcomed the match, Ahmad’s parents have other plans for him and when his engagement to Hannah is announced, Mona is devastated.Mona’s younger sister, Amira is convinced Ahmad loves Mona and tries her best to encourage her sister to tell Ahmad of her feelings. But Mona is sure she has lost Ahmad as he seems to be completely bewitched by the deceitful Hannah, and her conniving mother.Amira, undaunted, and in a headlong rush to help her sister, unwittingly sets off an irreversible and bewildering chain of events. But before she can realize her plan to reunite the star-crossed lovers, she is struck down by a bus. Grievously wounded, she sinks into a coma.Now any hope of Mona and Ahmad ever getting together has all but disappeared. However, while Amira fights for her life, two invisible forces”\"one benign, the other malign”\"struggle for control. But only Amira knows the secret. Will she wake from her coma to reveal the ugly plots and deceptions surrounding the lovers?As Ahmad is sucked further and further into the plans for his wedding, Mona is almost resigned to the fact that she has lost him . . . almost. But once again, she has reckoned without her little sister. . .If you're a fan of Jani Kay, Jessica Sorensen or Adrianne Brooks then you'll love Natashiah Jansen and Zhu Hsia's new paranormal romance fantasy book too. This book is not only for the young adult, it is also for the new adult that likes some adventure coupled with paranormal romance fantasy elements.",
  "genres": [],
  "author": "Zhu Hsia",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/21900212-unchain-my-heart"
}