{
  "title": "The Whole Duty of Man, According to the Law of Nature",
  "description": "Samuel Pufendorf's seminal work, \"The Whole Dutyof Man, According to the Law of Nature\" (firstpublished in Latin in 1673), was among the first tosuggest a purely conventional basis for natural law.Rejecting scholasticism s metaphysical theories, Pufendorf found the source of natural law in humanity sneed to cultivate sociability. At the same time, hedistanced himself from Hobbes s deduction of such needsfrom self-interest. The result was a sophisticated theory ofthe conventional character of man s social persona andof all political institutions.Pufendorf wrote this work to make his insightsaccessible to a wide range of readers, especiallyuniversity students. As ministers, teachers, and publicservants, they would have to struggle with issues ofsovereignty and of the relationship between church andstate that dominated the new state system of Europe inthe aftermath of the Peace of Westphalia (1648).\"The Whole Duty\" was first translated into English in1691. The fourth edition was significantly revised byanonymous editors to include a great deal of the veryimportant editorial material from Jean Barbeyrac sFrench editions. This was reproduced in the fifth editionfrom 1735 that is republished here. The English translationprovides a fascinating insight into the transplantationof Pufendorf s political theory from a German absolutistmilieu to an English parliamentarian one.Samuel Pufendorf (1632 1694) was one of the most important figures in early-modern political thought. Anexact contemporary of Locke and Spinoza, he transformed the natural law theories of Grotiusand Hobbes, developed striking ideas of toleration and of the relationship between church andstate, and wrote extensive political histories and analyses of the constitution of the German empire.Jean Barbeyrac (1674 1744) wasa Huguenot refugee who taughtnatural law successively in Berlin, Lausanne, and Amsterdam, and editedand translated into French the majornatural law works of Grotius, Pufendorf, and Cumberland.Andrew Tooke (1673 1732) was headmaster of Chaterhouse School and professor of geometry at Gresham College, London.Ian Hunter is Australian Professorial Fellow in the Centre for the History of European Discourses, University of Queensland.David Saunders is ProfessorEmeritus in the Faculty of Arts atGriffith University.Knud Haakonssen is Professor ofIntellectual History at the University ofSussex, England.\"",
  "genres": [
    "Philosophy",
    "Law",
    "Politics"
  ],
  "author": "Samuel von Pufendorf",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/21909503-the-whole-duty-of-man-according-to-the-law-of-nature"
}