{
  "title": "Too Close For Comfort: The Sgt. Windflower Mystery Series Book 15",
  "description": "Sgt. Windflower Mysteries Best Selling and Award-Winning Light Mysteries\n\n# 1 Best Selling Cozy Mystery on Amazon\n\nWinner of the Bony Blithe Award for Best Light Mystery\n\nSilver Medallist at Reader’s Choice Awards\n\nShort-Listed for LOLA 2024 Must Read Book of the Year\n\nWelcome back to Grand Bank, where a mystery is just around the corner and danger is often too close for comfort…\nWinston Windflower is back with the RCMP, this time as Acting Inspector, hoping for a peaceful life in the tiny town of Grand Bank, Newfoundland. But when suspicious fires erupt and an outsider’s body is discovered in one of them, his hopes are quickly dashed. Now, they have a murder to solve.As the investigation deepens, Windflower uncovers connections to a major gold heist on the mainland, introducing a host of nefarious characters who begin to wreak havoc on the local police force. To make matters worse, Windflower receives a cryptic message in a dream warning that his friend and colleague, Eddie Tizzard, is in grave danger.Windflower must protect Eddie and those he loves as he tracks down a murderer while keeping the town safe from harm in this page-turning mystery full of intrigue and suspense and a Windflower’s signature humour and warmth.Praise for the Best-Selling and Award-Winning Sgt. Windflower Mysteries“Reading this series is like taking a deep cleansing breath and feeling relaxed and happy while visiting with Windflower and his family and workmates.”\nJem’s Books\n“Readers cannot get enough of Windflower and this series. Fall in love with the relationships, the cases, the town and when they talk about food… I highly encourage you to grab a snack and a drink, go to your comfy seat and dig in.”\nCozy Mystery Book Reviews\n“Be prepared to be charmed by Windflower, a food-loving sergeant who could possibly be Canada’s most polite Mountie.”\nHalifax Chronicle-Herald\n“If you love murder mysteries that are well-crafted, majorly entertaining, and interesting enough to keep you reading way past your bedtime, I can recommend trying the latest Sgt. Wildflower Mystery”\nPerfect at Midnight blog",
  "genres": [
    "Drama",
    "Contemporary",
    "Novels",
    "Book Club",
    "Family"
  ],
  "author": "Mike  Martin",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/219055410-too-close-for-comfort"
}