{
  "title": "Barefoot in Pearls",
  "description": "A brand new full length (365 pages) set in Barefoot Bay! New York Times bestselling author Roxanne St. Claire takes readers back to the beach with more of the “Barefoot Brides” -- destination wedding planners who are experts at dreamy “I do’s” but haven’t yet found their happily ever after.As her two best friends settle into their happily ever afters, destination wedding designer Arielle Chandler is beginning to wonder if the promise of “The One” – one true love, meant only for her – is merely folklore passed down from her Native American grandmother. But when a mysterious man nearly mows her down on a hill overlooking Barefoot Bay, the legend of destined love suddenly feels very real. That is, until Ari learns of Luke McBain’s plans to demolish a piece of land she believes is sacred.Luke isn’t proud of the fact that he spent ten years as a mercenary warrior, fighting battles for another country. With those dark days behind him, he’s focused on creating a new life instead of destroying others, so he’s moved to Barefoot Bay to launch a contracting business and build a house for an old friend. But when an enigmatic dark-eyed beauty steals his attention and stops his progress with her announcement that he is about to flatten a native burial ground, Luke has a new battle to fight.While their immediate and potent attraction grows complicated, Luke and Ari discover the hills of Barefoot Bay could be hiding something far different – and even more valuable – than ancient art or graves. They are determined to discover the truth, but that will come at a cost. Will they risk their chance at once-in-a-lifetime love to uncover secrets that could change the landscape of Barefoot Bay forever?",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Adult Fiction",
    "Mystery",
    "Romantic Suspense"
  ],
  "author": "Roxanne St. Claire",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/21911522-barefoot-in-pearls"
}