{
  "title": "The History of the Snowman: From the Ice Age to the Flea Market",
  "description": "Who made the first snowman? Who first came up with the idea of placing snowballs on top of each other, and who decided they would use a carrot for a nose? Most puzzling of How can this mystery ever be solved, with all the evidence long since melted?The snowman appears everywhere on practically everything -- from knickknacks to greeting cards to seasonal sweaters we plan to return. Whenever we see big snowballs our first impulse is to deck them out with a top hat. Humorist and writer Bob Eckstein has long been fascinated by this ubiquitous symbol of wintertime fun -- and finally, for the first time, one of the world's most popular icons gets his due.A thoroughly entertaining exploration, The History of the Snowman travels back in time to shed light on the snowman's enigmatic past -- from the present day, in which the snowman reigns as the King of Kitsch, to the Dark Ages, with the creation of the very first snowman. Eckstein's curiosity began playfully enough, but soon snowballed into a (mostly) earnest quest of chasing Frosty around the world, into museums and libraries, and seeking out the advice of leading historians and scholars. The result is a riveting history that reaches back through centuries and across cultures -- sweeping from fifteenth-century Italian snowballs to eighteenth-century Russian ice sculptures to the regrettable \"white-trash years\" (1975-2000).The snowman is not just part of our childhood memories, but is an integral part of our world culture, appearing -- much like a frozen Forrest Gump -- alongside dignitaries and celebrities during momentous events. Again and again, the snowman pops up in rare prints, paintings, early movies, advertising and, over the past century, in every art form imaginable. And the jolly snowman -- ostensibly as pure as the driven snow -- also harbors a dark past full of political intrigue, sex, and violence.With more than two hundred illustrations and a special section of the best snowman cartoons, The History of the Snowman is a truly original winter classic -- smart, surprisingly enlightening, and quite simply the coolest book ever.",
  "genres": [
    "Nonfiction",
    "History",
    "Christmas",
    "Holiday",
    "Historical",
    "Humor",
    "Art"
  ],
  "author": "Bob  Eckstein",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/2190568.The_History_of_the_Snowman"
}