{
  "title": "Maximum Offense",
  "description": "With Death’s Head, David Gunn rocketed onto the scene in the most explosive and entertaining science fiction debut since Richard Morgan’s Altered Carbon. Now Gunn is back–and so is Sven Tveskoeg: antisocial, antihero, anti-you-name-it, a one-man killing spree whose best friend is an intelligent handgun with a bad attitude and whose worst enemy is, well, just about everybody else.And if Sven weren’t dangerous enough already, add in the lethal alien parasite that resides in his throat . . . and is capable of bending space and time. Then there’s the fact that Sven’s genetic makeup is only 98.2 percent human, the rest being undetermined but possibly contributing to his enhanced healing abilities, superior strength, unusual agility, and notable sociopathic tendencies. The result is one seriously badass soldier with a hair-trigger temper and a chip on his shoulder the size of a small moon. These are qualities that would doom a man to prison or worse in any decent society.Luckily, Sven doesn’t live in a decent society. He lives in the empire of OctoV, a tyrant who is part machine, part boy, part god, and all evil. Sven’s qualities have brought him to OctoV’s personal attention and earned him a lieutenant’s commission in the Death’s Head, the elite corps of assassins and enforcers whose purpose in life is to kill and die for the greater glory of OctoV.Sven’s new assignment? Lead his ragtag band of Death’s Head rejects–the Aux, short for auxiliaries–to the artificial world of Hekati. It seems that a citizen of the United Free, an empire not only vaster than OctoV’s but far more technologically advanced, has gone missing there. Now it’s up to Sven to rescue the poor soul.But Hekati turns out to be a vicious den of backstabbing and betrayal, where nothing and no one can be trusted, least of all the greenhorn colonel put in charge of the mission at the last moment. It looks like somebody wants Sven Tveskoeg dead.So what else is new?From the Hardcover edition.",
  "genres": [
    "Science Fiction",
    "Military Science Fiction",
    "Fiction",
    "Military Fiction",
    "Space Opera",
    "War",
    "Action"
  ],
  "author": "David Gunn",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/2191152.Maximum_Offense"
}