{
  "title": "Perfect (mis)Match",
  "description": "Some people get meet-cutes. I get a meet-crash.When Vincent Forde rear-ends my car, I expect an apology—instead he tosses me a scowl that could melt steel and acts like I’m the problem.Charming, right?With his designer suit, smoldering glare, and ego the size of his bank account, Vincent is the very definition of an entitled bosshole.I figure that’s the last I’ll ever see of Mr. Too-Rich-and-Ridiculously-Handsome.Except life loves a good punchline.Guess who struts into my brother’s engagement party like he owns the place?Yeah, it’s Mr. I’m-Too-Sexy-To-Drive-Properly, lounging by the bar like he’s posing for GQ.I think I hate him.Only now, there’s something he wants from me.There’s a rare perfume ingredient he desperately needs for his fragrance empire.And Lord of the Scowl is willing to pay me ridiculous money to help get it.Oh and he also wants me to pretend to be his girlfriend.As if there’s anything remotely boyfriend-material about him.Vincent might be the king of the scowl and a walking ego trip, but he’s offering me a deal I can’t refuse.Even if it means pretending to like the guy who drives me insane.The more we fake it, though, the more the line between acting and real starts to blur. His charm is aggravating. His confidence is infuriating. His smile is entirely too distracting.This wasn’t part of the plan. I’m supposed to hate him, not want him. But pretending to be his perfect match is starting to feel all too real...Perfect (Mis)Match is a sizzling enemies-to-lovers romance packed with sharp banter, fiery chemistry, and all your favorite billionaire bosshole, fake relationship, and brother’s best friend. With a grumpy, guarded hero and a heroine who’s more than ready to knock him down a peg, get ready for the perfect storm of wit, tension, and heart-stopping twists.",
  "genres": [
    "Romance",
    "Enemies To Lovers",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Leslie North",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/219105182-perfect-mis-match"
}