{
  "title": "Under Siege",
  "description": "It has been almost two years since the Michaluk Virus outbreak began, and Remy Angellette has helped her friends establish Woodside, a walled-in community of survivors in South Carolina. But underneath the veneer of simplicity of their day-to-day lives, not all is as it seems. Dr. Derek Rivers, a former CDC scientist who was involved in the virus’s testing, has come close to a cure for the virus, and he’s used it to cure Ethan Bennett—who promptly begins to show strange side-effects from the cure. Despite her pleas, Derek delays giving the cure to Remy, who has found herself beginning to dance a fine line between sanity and madness as the virus continues its relentless attack on her brain.When Dominic Jackson smuggles Remy out of the community on a supply run and brings back a set of twins that they’ve rescued, hundreds upon hundreds of infected follow them back to Woodside. Within hours, the community is besieged by the infected, who attack the main gates and slowly begin to surround the community. Desperate to get the cure and all the information about it out of Woodside before the infected get in, two members of the community pack the doctor’s samples and notes and slip out of Woodside to search for a still-operational CDC facility—but not before Remy steals a dose of the cure and injects herself with it.As the community’s gates collapse under the assault from the other side, one of the community’s members manages to get in touch with the military, begging them for assistance before they all end up dead. But will they be able to survive until the military shows up to help them—or will they end up dead at the hands of the infected after nearly two years of survival?",
  "genres": [
    "Zombies",
    "Post Apocalyptic",
    "Horror",
    "Apocalyptic",
    "Adult",
    "Survival",
    "Science Fiction"
  ],
  "author": "Jessica Meigs",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/21911129-under-siege"
}