{
  "title": "Death by Midnight",
  "description": "Killer or Killer Climax?That's the question Dr. Debra Powers is trying to answer after a night of erotic combat with a stranger.Debra is a Boston psychiatrist with a booming clientele but an irresistible compulsion. She has a dark side that must remain a secret. This psychologicl thriller starts with a gruesome call to the city morgue that unleashes an inner voice Debra thought she had under control. Instead of resisting, she gives in to it. Her decision to break out of her normal life for one evening of wild abandon lands her in the middle of a life-threatening sexual encounter and a serial murder investigation. If she doesn't act quickly, she'll lose everything.Don't Forget... Jack the Ripper was a Surgeon too...Debra must enter the psyche of an arrogant physician to save herself. Doctor Dan Matthews is a brilliant surgeon who slices people for a living. He has a mystical talent for saving lives, but his staff hates him. Sometimes, he goes too far to achieve his goals.Lieutenant Lewis is the investigator who must unravel the threads of this mysterious murder case. The medical examiner thinks it's an isolated sexual encounter gone bad. Lewis, an expert on serial killers, wonders if it's the latest in a series of sexual killings.This erotic murder mystery is a roller-coaster ride that will keep you on the edge of your seat until the very end, when all you thought you knew about an innocent woman's mysterious murder is turned upside down.If you're offended by erotic encounters that come within a razor's breadth of the grave, this book isn't for you.If you believe that love, sex and death are all part of life, pick up this book, snuggle into your favorite reading spot, and get ready to stay up all night.------------------------------------Mystery, Thriller, Suspense Book Catagories:> Psychological Thriller> Medical Suspense> Erotic Mystery in BostonBuy this book and meet two twisted doctors who sometimes forget that an orgasm doesn't have to end in death.",
  "genres": [],
  "author": "J.W. London",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/21912927-death-by-midnight"
}