{
  "title": "One Foolish Night",
  "description": "NEW YORK TIMES & USA TODAY Bestselling Author Tina Folsom At his friend's wedding, Paul Gilbert meets Holly Foster and is enchanted with her. After one amazing night in her arms, he finds out that Holly is a professional escort. He feels deceived and rejects her. However, when his wealthy family tries to pressure him into marrying an heiress he has no interest in, he enlists Holly's help. But is Holly more than he can handle?While Holly is devastated by Paul's rejection, she finds she has a bigger problem to deal an unexpected pregnancy. When Paul contacts her out of the blue, can she accept his unusual offer for the sake of her unborn child or must she decline it, because she fears she won't be able to keep their new relationship all business when her heart and her body long for something far more personal . . .One foolish Night is the first book after the trilogy of Lawful Escort, Lawful Lover, and Lawful Wife, which chronicled Daniel and Sabrina's love story. Now it's time for the other seven sexy members of the Eternal Bachelors Club to find love.\"Scorching and sensual, Lawful Escort is a sexy and romantic treat not to be missed!\" - Bella Andre, New York Times and USA Today Bestselling AuthorEternal Bachelors Club (contemporary romance):Lawful EscortLawful LoverLawful WifeOne Foolish NightOne Long Embrace (December 2014)Scanguards Vampires Book 1: Samson's Lovely MortalBook 2: Amaury's HellionBook 3: Gabriel's MateBook 4: Yvette's HavenBook 5: Zane's RedemptionBook 6: Quinn's Undying RoseBook 7: Oliver's HungerBook 8: Thomas's ChoiceBook 8 1/2: Silent Bite (A Scanguards Wedding Novella)Book 9: Cain's Identity (November 2014)Out of Olympus Series (A romantic comedy series about Greek Gods):Book 1: A Touch of GreekBook 2: A Scent of GreekBook 3: A Taste of GreekVenice Vampyr Novella Venice Vampyr (#1)Venice Vampyr (#2): Final AffairVenice Vampyr (#3): Sinful TreasureVenice Vampyr (#4): Sensual DangerStealth Guardians Lover Uncloaked (#1)",
  "genres": [
    "Romance",
    "Contemporary",
    "Adult",
    "Contemporary Romance",
    "Fiction",
    "Audiobook",
    "Erotic Romance"
  ],
  "author": "Tina Folsom",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/21908966-one-foolish-night"
}