{
  "title": "Living the Personal Myth: Making the Magic of Faerie Real in One's Own Life",
  "description": "Living the Personal Myth was written by Zardoa Silverstar of the Silver Elves. It is a unique narrative about a psychological study of the magic of living one's personal myth, in effect, making one's dream and vision of one's self come true by living it. It is a personal guide to becoming one's true s'elf as one inwardly knows one's s'elf to be. What makes this book particularly interesting is that the author considers himself to be an elf, yet he has an astute scientific mind that he uses to psychologically examine his identification with the otherkin world. He explores his personal myth and life as an elf and demonstrates how basing one's myth on real events in one's life empowers one's myth and one's magic. Whatever or whoever you are, this book is a potent guide to realizing one's genuine, and potentially powerful, magical and fantastic, nature. The author uses dream work techniques, oracle readings, and active imagination to take us through a depth psychology exploration of his own experience in the individuation process of becoming a whole person whose unconscious and conscious elements are integrated and who is a unique individual. Much of the material in this book is based on a depth process study he conducted at Sonoma State University in the Depth Psychology Department in 2005. This work suggests \"Personal Myth\" to be an understanding of the self that incorporates the symbolic, imaginal and fantasy elements of the unconscious and accepts them as real within their own realms of being. It is the author's belief that the Personal Myth is the unconscious' understanding of the individual spirit's Cosmic aspirations and potentialities. In that way, Personal Myth is seen as the personality of the unconscious and of the individual's spirit.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Philosophy",
    "Witchcraft",
    "Mythology"
  ],
  "author": "The Silver Elves",
  "average_rating": "4.88",
  "url": "https://www.goodreads.com/book/show/21916488-living-the-personal-myth"
}