{
  "title": "Penn Center: A History Preserved",
  "description": "The Gullah people of St. Helena Island still relate that their people wanted to “catch the learning” after northern abolitionists founded Penn School in 1862, less than six months after the Union army captured the South Carolina sea islands. In this broad history Orville Vernon Burton and Wilbur Cross range across the past 150 years to reacquaint us with the far-reaching impact of a place where many daring and innovative social justice endeavors had their beginnings. Penn Center’s earliest incarnation was as a refuge where escaped and liberated enslaved people could obtain formal liberal arts schooling, even as the Civil War raged on sometimes just miles away. Penn Center then earned a place in the history of education by providing agricultural and industrial arts training for African Americans after Reconstruction and through the Jim Crow era, the Great Depression, and two world wars. Later, during the civil rights movement, Penn Center made history as a safe meeting place for organizations like Martin Luther King Jr.’s Southern Christian Leadership Conference and the Peace Corps. Today, Penn Center continues to build on its long tradition of leadership in progressive causes. As a social services hub for local residents and as a museum, conference, and education complex, Penn Center is a showcase for activism in such areas as cultural, material, and environmental preservation; economic sustainability; and access to health care and early learning. Here is all of Penn Center’s rich past and present, as told through the experiences of its longtime Gullah inhabitants and countless visitors. Including forty-two extraordinary photographs that show Penn as it was and is now, this book recounts Penn Center's many achievements and its many challenges, reflected in the momentous events it both experienced and helped to shape.",
  "genres": [
    "History"
  ],
  "author": "Orville Vernon Burton",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/21922664-penn-center"
}