{
  "title": "Principles and Methods of Social Research",
  "description": "Used to train generations of social scientists, this thoroughly updated classic text covers the latest research techniques and designs. Applauded for its comprehensive coverage, the breadth and depth of content is unparalleled. Through a multi-methodology approach, the text guides readers toward the design and conduct of social research from the ground up. Explained with applied examples useful to the social, behavioral, educational, and organizational sciences, the methods described are intended to be relevant to contemporary researchers.The underlying logic and mechanics of experimental, quasi-experimental, and non-experimental research strategies are discussed in detail. Introductory chapters covering topics such as validity and reliability furnish readers with a firm understanding of foundational concepts. Chapters dedicated to sampling, interviewing, questionnaire design, stimulus scaling, observational methods, content analysis, implicit measures, dyadic and group methods, and meta-analysis provide coverage of these essential methodologies. The book is noted for -Emphasis on understanding the principles that govern the use of a method to facilitate the researcher’s choice of the best technique for a given situation.- Use of the laboratory experiment as a touchstone to describe and evaluate field experiments, correlational designs, quasi experiments, evaluation studies, and survey designs.-Coverage of the ethics of social research including the power a researcher wields and tips on how to use it responsibly. The new edition -A new co-author, Andrew Lac, instrumental in fine tuning the book’s accessible approach and highlighting the most recent developments at the intersection of design and statistics.-More learning tools including more explanation of the basic concepts, more research examples, tables, and figures, and the addition of bold faced terms, chapter conclusions, discussion questions, and a glossary.-Extensive revision of chapter (3) on measurement reliability theory that examines test theory, latent factors, factor analysis, and item response theory.-Expanded coverage of cutting-edge methodologies including mediation and moderation, reliability and validity, missing data, and more physiological approaches such as neuroimaging and fMRIs.-A new web based resource package that features Power Points and discussion and exam questions for each chapter and for students chapter outlines and summaries, key terms, and suggested readings. Intended as a text for graduate or advanced undergraduate courses in research methods (design) in psychology, communication, sociology, education, public health, and marketing, an introductory undergraduate course on research methods is recommended.",
  "genres": [
    "Philosophy",
    "Psychology"
  ],
  "author": "William D. Crano",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/21921134-principles-and-methods-of-social-research"
}