{
  "title": "The Civil War Diary of Gideon Welles, Lincoln's Secretary of the Navy: The Original Manuscript Edition",
  "description": "Gideon Welles’s 1861 appointment as secretary of the navy placed him at the hub of Union planning for the Civil War and in the midst of the powerful personalities vying for influence in Abraham Lincoln’s cabinet. Although Welles initially knew little of naval matters, he rebuilt a service depleted by Confederate defections, planned actions that gave the Union badly needed victories in the war’s early days, and oversaw a blockade that weakened the South’s economy.   Perhaps the hardest-working member of the cabinet, Welles still found time to keep a detailed diary that has become one of the key documents for understanding the inner workings of the Lincoln administration. In this new edition, William E. and Erica L. Gienapp have restored Welles’s original observations, gleaned from the manuscript diaries at the Library of Congress and freed from his many later revisions, so that the reader can experience what he wrote in the moment. With his vitriolic pen, Welles captures the bitter disputes over strategy and war aims, lacerates colleagues from Secretary of State William H. Seward to General-in-Chief Henry Halleck, and condemns the actions of the self-serving southern elite he sees as responsible for the war. He can just as easily wax eloquent about the Navy's wartime achievements, extoll the virtues of Lincoln, or drop in a tidbit of Washington gossip.   Carefully edited and extensively annotated, this edition contains a wealth of supplementary material. The several appendixes include short biographies of the members of Lincoln’s cabinet, the retrospective Welles wrote after leaving office covering the period missing from the diary proper, and important letters regarding naval matters and international law.",
  "genres": [
    "History",
    "Civil War"
  ],
  "author": "Gideon Welles",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/21920875-the-civil-war-diary-of-gideon-welles-lincoln-s-secretary-of-the-navy"
}