{
  "title": "Joni-Pip",
  "description": "The AMERICAN CHRONICLE March 2010 All Hail the King All hail the King ... Carrie King that is. Carrie King is an author who happens to live in England, so shes the King of England. All right, enough fun for the moment. Ms. King has written a brilliant book, The Life in the Wood with Joni-Pip, that can stand beside the likes of Catcher in the Rye, The Old Man and the Sea, or Walden and not shrink in importance, yet it can be next to Winnie the Pooh, Alice in Wonderland, Huckleberry Finn or Treasure Island, and seem right at home. Joni-Pip is a must for any library; for those who know and love quality writing. Joni-Pip's adventures begin when her family moves to Sherwood Forest to escape the World War Two bombing of Bath, England. Joni-Pip even meets Robin Hood there. I'll leave how this happens as another reason for you to get and read the book. Suffice to say, Ms. King cleverly makes the unbelievable easily believable and sensible. Augmented with drawings and asides to the reader, Joni-Pip is what some of the younger set are calling spiffy. That's actually an old word meaning sharp in appearance or dress, the modern slang term means, something on the order of beyond excellent. The Life in the Wood with Joni Pip is indeed beyond excellent. Ms. King can and does craft her writing in a spellbinding way. You won't want to put the book down, so be sure you have a good block of time to hide away from the real world to step into the wild, wonderful world of Joni-Pip. Most reviewers tell you the basic story in brief. I'm not going to do that here, there's just no way to do this beautifully written piece of work justice in a few sentences. Want to know the secret of the stars in the sky? Want to understand the orbit of life and other secrets of the Universe? You'll just have to get The Life in the Wood with Joni-Pip and read it for yourself; then swear to keep them secret Dave Broughton",
  "genres": [],
  "author": "Carrie  King",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/2191611.Joni_Pip"
}