{
  "title": "Sunsets & Other Dangerous Things",
  "description": "A sunshine vampire who can't help falling in love, a grumpy grad student who's followed by bad luck, and a cure that could bring them together or end them forever.Ashley, a jobless millennial, thought becoming a vampire sounded romantic in the mid-aughts. Now she’s dodging vampire-hunting witches and student loans while trying to regain some of the security she lost years ago when her girlfriend vanished shortly after changing her. The join an established vampire family. All they want is for Ashley to first complete one year of undergrad without giving away her undead status. This proves challenging as, despite her lack of heartbeat, Ashley's romantic tendencies are alive and well as she finds herself falling head over feet for her class’s cute but prickly graduate assistant.Esther just wants to finish her master’s program and never talk to people again. As a walking bad luck charm, she finds solace in following the rules and regulations of her archive internship and graduate assistant duties. Until she’s paired for a school project with the girl in class whose smile inexplicably makes her knees weak... and also happens to be a vampire. Hoping to figure out what these warm, fuzzy feelings are about, Esther agrees to help Ashley navigate Christmas with her family as her fake girlfriend.But the witches have their own plan brewing. They’ve created a cure for vampires that will give Esther a chance at a new life with Ashley by releasing Ashley from the forever-life she regrets. All Esther has to do is betray Ashley by giving the witches what they need to complete the spell, leaving Ashley to choose between the stability of the vampire family or a happily ever after that will only last a few decades.",
  "genres": [
    "Romance",
    "Lesbian",
    "Fantasy",
    "Vampires",
    "LGBT",
    "Paranormal",
    "Urban Fantasy"
  ],
  "author": "Dani  Frank",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/219149819-sunsets-other-dangerous-things"
}