{
  "title": "The Revised Divine Liturgy According to Our Holy Father Ambrose of Milan",
  "description": "This Missal is designed for Liturgical usage especially for Priests who travel. The second edition of this work has included the four early Post-Sanctus prayers that exist within our Liturgy. The full Agnus Dei for use within the Requiem Liturgy has been included. This is a further example of the Romanization of the Ambrosian Liturgy. There has been a general consensus that the Roman blessing at the end of the Liturgy be dropped in favor of the more ancient Ambrosian blessing. The Ambrosian blessing gained greater acceptance over time and it has been now introduced as the official final blessing for Liturgical usage. This blessing is Gallican in its origin and bears a remarkable similarity to the final blessing used within the Liturgy of St John Chrysostom. It is a well known fact that St Ambrose and St John Chrysostom were friends and that the Penitential Litanies we call the Divinae Pacis and the Dicamus Omnes came directly from John to his friend Ambrose. The Creed rightly retains its place after the offertory and does not include the filioque clause thus conforming to the original Nicene Creed. The Liturgy is a lesson in theology. It was Ambrose’s good friend Augustine who stated that, “we pray as we believe”. The heavy Christological emphasis was deliberately placed there against Arianism. In medieval depictions, St Ambrose carries a whip in his hand to fight heresy and to beat down heretics. We pray for St Ambrose’s intercession today to help us fight our modern day heresies which attack the Church from all sides…….especially from within. Finally, the Litany for Persecuted Christians has been added to be said after the Liturgy has concluded. This Litany is extra Liturgical and of modern penmanship. St Ambrose, pray for us !!!",
  "genres": [],
  "author": "Bishop Michael Scotto-Daniello",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/21916186-the-revised-divine-liturgy-according-to-our-holy-father-ambrose-of-milan"
}