{
  "title": "Vision of Love",
  "description": "**Recommended for 17+ due to mature themes and sexual content.** New Adult Contemporary Romance You can say I had it all. The fancy house, top of the line car, lots of friends and more money than anyone could ever imagine. On the outside, we were the perfect family. No one knew about my abusive father and my mother who drank herself into oblivion every night. My name is Karly and I have scars, deep scars that no one knows about, and when my parents died I was left alone and on my own, to fight through life with no help.When it came to life and happiness, I had it all until my world was turned upside down. My name is Nicholas and my wife, the love of my life, left me and our new baby girl without as much as an explanation. I didn’t want to accept it, but after our divorce was final and four long years passed, I started to lose hope that she’d ever come back. Emma was growing so fast and I needed help. My sister recommended that I hire her friend, Karly, as Emma’s nanny. I took a chance on bringing another woman into my little girl’s life. Did I do the right thing? As many days and nights are spent together, feelings can no longer be denied and a relationship is formed.Life is about taking chances and learning how to fall, but when the past comes back, will they be strong enough to fight through and trust each other? Or will all they worked for fall apart?**Editorial Reviews** “This is a different style of book than the author has written before.” Stephanie from Stephanie’s Book Reports“This is the second book of S.Moose’s that I’ve had the pleasure of reading and in true S.Moose fashion, I was left ugly crying.” Ange from Cover to Cover Book Blog“It truly is a beautiful love story with two very broken individuals who deserve so much happiness, you can't help but cheer for them the entire book. “ Beatriz from Cover to Cover Book Blog“Break out the cold drinks and fan because Nicholas and Karly are all over the sweet sentiments and sexy scenes. This 1st book in the Infinity Series will have your emotions all over the place, loving every minute of it, and begging for more!” Megan from There’s This Book Blog“I don’t know what to do with myself S.Moose! I will always love your books! Such amazing writing! I have to say…I loved your Never Letting Go series, but Vision of Love! WOW!” Christina from Miscellaneous Thoughts of a Bookaholic“Pain, heartache, happiness. Vision of Love takes you on an emotional roller coaster with some twists and turns leaving you content and rooting for a happy ending between two amazingly broken people. S.Moose writes with beauty and turns heartache and pain into love and passion. This book had me from page one and kept me intrigued and wanting more page after page!! Loved Vision of Love!!” Raquel from For the Love of Books Blog",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "New Adult",
    "Abuse",
    "Erotica",
    "Amazon"
  ],
  "author": "S. Moose",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/21920146-vision-of-love"
}