{
  "title": "Finding Serenity",
  "description": "Mollie Malone's mom skipped out on her. Her biker dad, always loose and easy with the law, still was able to make her feel loved, and to keep her safe. But thirteen years ago, when his luck finally ran out and he landed in prison, Mollie found herself a new family - a group of friends in the sleepy little college town of Cavanagh, Tennessee, where now they all attend the local university. These girls know about the rotten roots of her family tree but accept her anyway, and the bond between them is so strong and supportive that Mollie is finally able to see past graduation to a future that is bright and secure. But sometimes the past doesn't stay buried. Suddenly, inexplicably, there's a shadow behind every step Mollie takes. Someone is lurking in that shadow, threatening not only Mollie, but also the new family she has claimed for herself. And it isn't just the past that has Mollie's life in upheaval. Hunky former Marine Vaughn Winchester - who Mollie really would like to get to know much better - thinks Mollie is just a kid; he's made it clear she wouldn't ever be able to understand the demons haunting him. But if that's what he believes, then why does he keep sticking his nose in her business? And if he thinks she's such a kid, why does he keep trying to kiss her? Vaughn's mind games are frustrating, especially since Mollie knows enough about secrets to be convinced that there's something he isn't telling her, something he's so far been able to keep hidden. But when that secret is revealed, Mollie is forced into a situation that tests her loyalty and threatens even her closest friendships - just when the shadow of her past returns, and she's going to need them the most. 'Finding Serenity' is book two in the Seeking Serenity series.",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary Romance",
    "College",
    "Military Fiction",
    "Amazon",
    "Young Adult"
  ],
  "author": "Eden Butler",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/21916343-finding-serenity"
}