{
  "title": "Black Triangle",
  "description": "52,000 words.  A UFO sighting in broad daylight changes the life of curvy and smart, but down-on-her-luck Julene Castro, when she moves back home to working-class Cobs Harbor in order to pull her life together.  Unexpectedly, Julene gets swept up in a series of UFO sightings along the Atlantic Coast and swept off her feet by a younger man – Jimmy – her little brother's best friend, who has grown up into a hunk of an auto mechanic. Jimmy confesses that he has had a crush on Julene ever since he was a kid, and now that she's available and he's a grown man, he intends to finally make his move.  At the same time, Julene develops an unexpected friendship with Cobs Harbor's new mayor, the handsome but mysterious Scandinavian – Njord Vanir. Njord's seemingly impossible mission is to revive the community's fishing industry and improve Cobs Harbor's infrastructure to help it withstand the devastating threat of a potential 20-foot-rise in sea level over the next few years, the result of Global Warming.  As the winter rages along the dramatic shoreline of her hometown, sightings of UFOs that defy the traditional “flying saucer” model start to increase. These aircraft instead are black and triangular in shape, quasi-military, and they can park mid-air in full defiance of gravity. Then it starts to become obvious that Julene and her brother are among the very few who can always see them, possibly because of a genetic anomaly they both share that affects their vision.  The one man who might know what is really going on is Crazy Captain Earl, who claims that many of Cobs Harbor's residents are really the descendents of Nordic-Viking aliens, and that a number of the Norse gods themselves are buried in the deep ocean off the coast of Massachusetts. Soon, Crazy Captain Earl won't seem so crazy anymore...",
  "genres": [],
  "author": "Annora Soule",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/21918832-black-triangle"
}