{
  "title": "Counting On Forever",
  "description": "First is the worst.Second is supposed to be the best.I’m counting on this truth, as our first try ended miserably.Julia. In the span of six months, I’ve lost my Paris patisserie, my fiancé, and my self-confidence. My only choice is to return to Topaz Falls, Montana and fulfill the requirements of my aunt’s will. After ninety days, I can return to Paris and never look back. This year will become a bad and distant memory. One thing I didn’t take into account was the tight-knit community and how often I’d run into my first love, Declan Ambarsan. I forced myself to leave him when we were eighteen. It was the hardest thing I’ve ever done, but it was necessary for him to have what mattered the most. I’ll keep my heart locked up tight because although some people were meant to have second chances—I’m not one of them. I did what needed to be done, and I’ll do it again when the ninety days are up. Declan. Eight years ago, the only woman I’ve ever loved left without saying goodbye. I wear her promise ring on a chain around my neck as a reminder to never let my heart fall in love again. That is until Julia Fournier returns to my small hometown and turns my world upside down. It takes one touch, a single whispered breath, and her smile to remind me why I fell in love with her. This time around, it doesn’t matter where she goes. When she leaves Topaz Falls this time, I’ll be by her side. I might be the only Ambarsan sibling who wants to continue the family orchard, but my heart belongs to Julia. In my parents’ absence, running the orchard and preparing for the apple harvest festival falls on my shoulders. I’ll try my best until my parents can return, then I’ll put in my notice. This time around, I’m choosing us above all else. This is the second chance I’ve always wanted.",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary Romance",
    "Chick Lit"
  ],
  "author": "Taryn Nikolic",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/219210842-counting-on-forever"
}