{
  "title": "Second Time's The Charm: A Nine Book Second Chance Romance Boxset",
  "description": "Who says Cupid’s arrow never strikes twice?\nGiven the chance, would you seize a second chance at love? That’s what’s at stake for the couples in this dazzling nine-book boxset from the authors you’ve come to love—Leslie North, Mary Sue Jackson and Katie Knight.First DownTessa has loved pro football player Mark Coleridge for as long as she can remember. But she knew if she told him she was pregnant back in high school, it would have sidelined his dreams of playing in the NFL. She couldn’t bring herself to bench him back then. Can she let him into her life now?Protecting MandyMandy adored Chance McCallister once—until he smashed her teenage heart into a million painful pieces. Now, the former Navy SEAL is back in town, and looking hotter than a summer heatwave. Before long Mandy find herself in real danger…and not just of falling for Chance again.Rancher’s Pregnant WifeSilas Anderson will stop at nothing to make his ranch the best—even if it’s meant pushing his wife Bea to the edge. With a baby on the way, Bea decides to chase her own dreams for once. Realizing he’s about to lose her, Silas is determined to win back the love of his life…if it’s not already too late.Protecting his Pregnant LoverOlive Owen can’t believe a steamy one-night stand with her high school crush left her pregnant. Even worse—Levon is off on a SEAL mission when she finds out. Months later, he comes back, right as she stumbles into danger from a local gang. Levon vows to keep her safe…but can he also protect her heart?Snowed in with the RancherOlivia Wickham never forgot her passionate romance with sexy cowboy, Tate McConnell. How could she? He gave her beautiful twin daughters. Now, years later, Tate appears out of nowhere to rescue them from a raging blizzard. Is fate offering Olivia and Tate a second chance at love?The Rancher’s Second ChanceSamantha Jenson’s life plan hits a snag when she has to step in to save her family’s ranch from a shady cousin. She soon realizes she needs help. Enter Cole tough, distant, undeniably sexy. She’d loved him once. But she won’t let him near her heart again…even if she can’t get him out of her head.Coming to her RescueHanna’s one night with sexy Navy SEAL Jake Hendrix gives her the surprise of her life—a positive pregnancy test! Before she can tell Jake, one of her high-profile clients is murdered. And Hanna is certain she’s next. Jake promises to protect Hanna…but her greatest danger could be falling in love.The Protective SEALAfter a career ending injury, former Navy SEAL Jack Williams is struggling to start over when he stumbles across a car in a ditch. Only this is no random citizen in distress. He knows the pretty face behind the wheel. Intimately. In fact, there’s a good chance the baby in her arms is his…Wild LoveJake Cafferty never told anyone, but Zoe Wilson broke his heart when they were kids. Years later, she comes back to help on the ranch, and the gruff cowboy vows there’s no way he’ll let it happen again. Especially since her dreams could take her far from the ranch…and out of his life forever.",
  "genres": [],
  "author": "Leslie North",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/219240841-second-time-s-the-charm"
}