{
  "title": "Grumpy Billionaire Bossholes: A Six Book Bosshole Grump-Sunshine Billionaire Romance Boxset",
  "description": "Contents include six grumpy billionaires, six women who are absolutely not impressed by six-pack abs and private jets (okay, maybe a little), and enough sexual tension to fry your e-reader.Falling for these bossy billionaires is not part of the plan—but life’s got a sense of humor, and so do these sassy heroines. With grumps, jerks, and cocky CEOs galore, this boxset serves up snark, steam, and a whole lot of chaos as six fierce women turn their billionaire bosses’ worlds upside down.Mr. GrumpNanny Kaitlyn has one never fall for the boss. Especially not when he’s grumpy, gruff, and entirely too gorgeous for his own good. But when she sees a softer side of him—a caring dad who adores his daughter—her rule starts to bend. Will it snap completely?Mr. JerkWhen billionaire sports agent Noah Parker mistakes Maddy for an escort, she’s not amused. Now she’s his assistant, and she’s determined to keep things professional. But Noah has a way of making everything personal—especially when it comes to stealing her heart.Mr. CockyPhotographer Maxine never imagined she’d be roped into playing billionaire Theo Barnes’ fake girlfriend. He’s arrogant, insufferably handsome, and breaking all the rules—including their “no PDA” agreement. But when their pretend sparks ignite for real, Maxine might just fall for his cocky charm.The Bossy OneOlivia St. James knows better than to fall for her boss. Declan Byrne is grouchy, demanding, and frustratingly Irish in all the best ways. But when his bossy exterior gives way to a sweeter, sexier side, Olivia starts to think some rules were made to be broken.The Grumpy OneNatalie Greenwood never planned to mop floors—or nearly decapitate billionaire CEO James Branson with her cleaning supplies. But when he discovers her hidden talent for design, James offers her the job of her dreams. All she has to do is focus on work… and ignore her maddeningly attractive boss. Simple, right?The Grouchy OneFelicity wasn’t looking for love. Then billionaire jeweler Cameron O’Connor stole her cab—and her patience. Now she’s stuck faking a relationship with the man who drives her crazy. But the line between love and hate gets dangerously thin when Cameron shows her there’s more to him than meets the eye.Fall hard for these infuriatingly irresistible billionaires in Leslie North’s steamy, feel-good boxset. Happily-ever-after has never been this deliciously bossy!",
  "genres": [],
  "author": "Leslie North",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/219276455-grumpy-billionaire-bossholes"
}