{
  "title": "Crossfire",
  "description": "In the early nineties, Nancy Kress took the SF world by storm with her multiple award-winning novella, \"Beggars in Spain,\" which became the basis for her extremely successful Sleepless Trilogy (comprising Beggars in Spain, Beggars and Choosers, and Beggars Ride ). Since then she has written more than a dozen novels, most recently the well-received Probability Trilogy , which Booklist praised saying \"Kress's characterizations are as sound as ever, but many will be agreeably surprised at her proficiency with military hardware and action scenes. Very impressive.\"And Kirkus, in a starred review, simply raved: \"Kress's always excellent characters wrestle with a splendid array of puzzles and problems, human, alien, and scientific: another resounding success for this talented sure-footed writer.\" Now comes a brand-new science fiction epic: CrossfireCrossfire is the story of a human colony settling on a distant planet, a colony formed by Jake Holman-- a man trying to escape a dark past. But as this diverse group of thousands comes to terms with their new lives on a new world, they make a startling discovery: primitive humanoid aliens. There are only a few isolated villages, and the evidence seems to indicate the aliens aren't native to the planet-even though they live in thatched huts and possess only primitive tools. When the humans finally learn the truth, they find themselves caught up in an interstellar war.In the end, this handful of human colonists will have to choose sides in the struggle. A lot is riding on their decision--not just the fate of their new home, but the fate of all humanity.At the publisher's request, this title is being sold without Digital Rights Management software (DRM) applied.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Aliens",
    "Science Fiction Fantasy",
    "Adventure",
    "Young Adult",
    "Queer"
  ],
  "author": "Nancy Kress",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/219233.Crossfire"
}