{
  "title": "The Accidental Superpower: The Next Generation of American Preeminence and the Coming Global Disorder",
  "description": "The freshman book of New York Times Bestselling Author of  The End of the World is Just the Mapping the Collapse of Globalization.An eye-opening assement of American power and deglobalization in the bestselling tradition of The World is Flat and The Next 100 Years .Near the end of the Second World War, the United States made a bold strategic gambit that rewired the international system. Empires were abolished and replaced by a global arrangement enforced by the U.S. Navy. With all the world's oceans safe for the first time in history, markets and resources were made available for everyone. Enemies became partners. We think of this system as normal - it is not. We live in an artificial world on borrowed time. In The Accidental Superpower , international strategist Peter Zeihan examines how the hard rules of geography are eroding the American commitment to free trade; how much of the planet is aging into a mass retirement that will enervate markets and capital supplies; and how, against all odds, it is the ever-ravenous American economy that - alone among the developed nations - is rapidly approaching energy independence. Combined, these factors are doing nothing less than overturning the global system and ushering in a new (dis)order. For most, that is a disaster-in-waiting, but not for the Americans. The shale revolution allows Americans to sidestep an increasingly dangerous energy market. Only the United States boasts a youth population large enough to escape the sucking maw of global aging. Most important, geography will matter more than ever in a de-globalizing world, and America's geography is simply sublime.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "Economics",
    "Audiobook",
    "Business",
    "International Relations"
  ],
  "author": "Peter Zeihan",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/21926865-the-accidental-superpower"
}