{
  "title": "The Daughter of Kurdland: A Life Dedicated to Humankind",
  "description": "In this intimate and riveting narrative, Dr. Widad Akreyi, an emblem of peace and courage, chronicles her extraordinary story. The best-known symbol of Kurdish culture describes for the first time what it takes to make history.Born the daughter of the East, destined to be a daughter of the West, Widad is a loyal daughter of the world. Nothing could stop her from serving – not persecution, or violence, or wars. Not even a cardiac arrest and eleven surgical operations.In a world where indifference and divisions abound, Dr. Widad Akreyi stands out as a breath of fresh air. Ranked among the most influential public figures, including JF Kennedy, Mother Teresa, Desmond Tutu and Dalai Lama, she is an internationally-acclaimed leader, global health expert, author, and peacebuilder in the finest sense of the word. By embracing her diverse identities and using her platform to promote meaningful change, she is determined not to let pain define her future. The Daughter of Kurdland is the full sweep of her illuminating life, public and private, compellingly and touchingly told in a book both wise and witty, both timeless and timely.  Widad wears her heart on her sleeve and recounts the events that forced her to leave Kurdland for the picturesque northern hemisphere, deftly weaving the intricacies of identity, solidarity, and the pursuit of passion-driven purpose. She brings her whole self to her readers: her innermost joys, her disappointments, and valuable lessons learned.Exquisite in its details and insights, The Daughter of Kurdland is intensely readable, a vibrant reminder of why Widad inspires others to achieve greatness and how her legacy is a shining example of leadership when leadership matters.",
  "genres": [
    "History",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Politics",
    "Sociology",
    "Social Issues"
  ],
  "author": "Widad Akreyi",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/219289903-the-daughter-of-kurdland"
}