{
  "title": "Fox",
  "description": "A spellbinding novel of literary and psychological suspenseabout the dark secrets that surface after the shocking disappearance of a charismatic, mercurial teacher at an elite boarding school—by the legendary author 'who is surely on any shortlist of America’s greatest living writers' (New York Times Magazine)'Eerie, shocking, provoking, and beautifully written, Fox is yet further proof Oates is one of the greatest writers among us today' Gillian FlynnWho is Francis Fox? A charming English teacher new to the idyllic Langhorne Academy, Fox beguiles many of his students, their parents, and his colleagues at the elite boarding school, while leaving others wondering where he came from and why his biography is so enigmatic. When two brothers discover Fox’s car half-submerged in a pond in a local nature preserve and parts of an unidentified body strewn about the nearby woods, the entire community, including Detective Horace Zwender and his deputy, begins to ask disturbing questions about Francis Fox and who he might really be.A hypnotic, galloping tale of crime and complicity, revenge and restitution, victim vs. predator, Joyce Carol Oates’s Fox illuminates the darkest corners of the human psyche while asking profound moral questions about justice and the response evil demands. A character as magnetically diabolical as Patricia Highsmith’s Tom Ripley and Vladimir Nabokov’s Humbert Humbert, Francis Fox enchants and manipulates nearly everyone around him, until at last he meets someone he can’t outfox. Written in Oates’s trademark intimate, sweeping style, and interweaving multiple points of view, Fox is a triumph of craftsmanship and artistry, a novel as profound as it is propulsive, as moving as it is full of mystery.",
  "genres": [
    "Thriller",
    "Fiction",
    "Dark Academia",
    "Literary Fiction",
    "Suspense",
    "Adult",
    "Dark"
  ],
  "author": "Joyce Carol Oates",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/219301718-fox"
}