{
  "title": "Future Arctic: Field Notes from a World on the Edge",
  "description": "In one hundred years, or even fifty, the Arctic will look dramatically different than it does today. As polar ice retreats and animals and plants migrate northward, the arctic landscape is morphing into something new and very different from what it once was. While these changes may seem remote, they will have a profound impact on a host of global issues, from international politics to animal migrations. In Future Arctic, journalist and explorer Edward Struzik offers a clear-eyed look at the rapidly shifting dynamics in the Arctic region, a harbinger of changes that will reverberate throughout our entire world. Future Arctic reveals the inside story of how politics and climate change are altering the polar world in a way that will have profound effects on economics, culture, and the environment as we know it. Struzik takes readers up mountains and cliffs, and along for the ride on snowmobiles and helicopters, sailboats and icebreakers. His travel companions, from wildlife scientists to military strategists to indigenous peoples, share diverse insights into the science, culture and geopolitical tensions of this captivating place. With their help, Struzik begins piecing together an environmental puzzle: How might the land’s most iconic species—caribou, polar bears, narwhal—survive? Where will migrating birds flock to? How will ocean currents shift? And what fundamental changes will oil and gas exploration have on economies and ecosystems? How will vast unclaimed regions of the Arctic be divided? A unique combination of extensive on-the-ground research, compelling storytelling, and policy analysis, Future Arctic offers a new look at the changes occurring in this remote, mysterious region and their far-reaching effects.",
  "genres": [
    "Nonfiction",
    "Science",
    "Environment",
    "Nature",
    "Climate Change",
    "Politics",
    "Education"
  ],
  "author": "Edward Struzik",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/21929640-future-arctic"
}