{
  "title": "Welcome to Braggsville",
  "description": "Welcome to Braggsville. The City that Love Built in the Heart of Georgia. Population 712Born and raised in the heart of old Dixie, D'aron Davenport finds himself in unfamiliar territory his freshman year at UC Berkeley. Two thousand miles and a world away from his childhood, he is a small-town fish floundering in the depths of a large, hyper-liberal pond. Caught between the prosaic values of his rural hometown and the intellectualized multicultural cosmopolitanism of Berzerkeley, the nineteen-year-old white kid is uncertain about his place until one disastrous party brings him three idiosyncratic best friends: Louis, a \"kung-fu comedian\" from California; Candice, an earnest do-gooder claiming Native roots from Iowa; and Charlie, an introspective inner-city black teen from Chicago. They dub themselves the \"4 Little Indians.\"But everything changes in the group's alternative history class, when D'aron lets slip that his hometown hosts an annual Civil War reenactment, recently rebranded \"Patriot Days.\" His announcement is met with righteous indignation, and inspires Candice to suggest a \"performative intervention\" to protest the reenactment. Armed with youthful self-importance, makeshift slave costumes, righteous zeal, and their own misguided ideas about the South, the 4 Little Indians descend on Braggsville. Their journey through backwoods churches, backroom politics, Waffle Houses, and drunken family barbecues is uproarious to start, but will have devastating consequences.With the keen wit of Billy Lynn's Long Halftime Walk and the deft argot of The Brief Wondrous Life of Oscar Wao, T. Geronimo Johnson has written an astonishing, razor-sharp satire. Using a panoply of styles and tones, from tragicomic to Southern Gothic, he skewers issues of class, race, intellectual and political chauvinism, Obamaism, social media, and much more.A literary coming-of-age novel for a new generation, written with tremendous social insight and a unique, generous heart, Welcome to Braggsville reminds us of the promise and perils of youthful exuberance, while painting an indelible portrait of contemporary America.",
  "genres": [
    "Fiction",
    "Book Club",
    "Literary Fiction",
    "Race",
    "Contemporary",
    "Southern",
    "Audiobook"
  ],
  "author": "T. Geronimo Johnson",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/21936845-welcome-to-braggsville"
}