{
  "title": "His Pretty Little Duet: The Orphan & The Mafia Don",
  "description": "The #1 Bestseller in Women’s Crime Fiction & Organised Crime is available for the first time in one convenient, discounted edition. It combines His Pretty Little burden and His Pretty Little Queen, with over 6000 5-star reviews on the individual books. A little deer walks into the wolf’s den.I want answers.I know nothing of love, family, or stability, having been raised in the foster system and spat out at eighteen, pregnant, and with no memory of how that came to be.I try to find my estranged father, a man rumoured to be in the Mafia, hopeful he will use his influence to discover what really happened the night someone took my innocence.But I don’t find my father. I walk straight into the den of his associate, the Don of the Cosa Nostra.Clay Butcher.He is a cold, calculated killer. An emotional island in a perfectly tailored suit.He orders me to stay in his mansion and wait for my father to return. But living with Clay Butcher stirs feelings deep inside of me. Starved of attention all my life, I find his possessive gaze intoxicating. His rules ground me, his discipline holds me accountable, and his praise sets my skin ablaze.But he is a liar.What I don’t know is that he plots to use me. I am not just the daughter of his colleague, but a girl with a powerful heir in her belly.The heir to part of Clay Butcher's legacy.Author His Pretty Little Burden is part of The Kids of The District series. A series of interconnecting standalones that follow the infamous Butcher brothers. His Pretty Little Duet features a powerful Mafia Don and his endearing tortured heroine. His Pretty Little Burden has an age gap dynamic that some people may find uncomfortable. It is an epic romance story, with spice, and dark themes. Enjoy.",
  "genres": [
    "Dark Romance",
    "Mafia Romance",
    "Romance",
    "Found Family"
  ],
  "author": "Nicci Harris",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/219386631-his-pretty-little-duet"
}