{
  "title": "Dead Man's Hand: An Anthology of the Weird West",
  "description": "HOW THE WEST WAS WEIRD! From a kill-or-be-killed gunfight with a vampire to an encounter in a steampunk bordello, the weird western is a dark, gritty tale where the protagonist might be playing poker with a sorcerous deck of cards, or facing an alien on the streets of a dusty frontier town. Here are twenty-three original tales—stories of the Old West infused with elements of the fantastic—produced specifically for this volume by many of today’s finest writers. Included are Orson Scott Card’s first “Alvin Maker” story in a decade, and an original adventure by Fred Van Lente, writer of Cowboys & Aliens. Other contributors include Tobias S. Buckell, David Farland, Alan Dean Foster, Jeffrey Ford, Laura Anne Gilman, Rajan Khanna, Mike Resnick, Beth Revis, Fred Van Lente, Walter Jon Williams, Ben H. Winters, Christie Yant, and Charles Yu, with an introduction by editor John Joseph Adams.CONTENTS:01 - Joe R. Lansdale, The Red-Headed Dead02 - Ben H. Winters, The Old Slow Man and his Gold Gun from Space03 - David Farland, Hellfire on the High Frontier04 - Mike Resnick, The Hell-Bound Stagecoach05 - Seanan McGuire, Stingers and Strangers06 - Charles Yu, Bookkeeper, Narrator, Gunslinger07 - Alan Dean Foster, Holy Jingle08 - Beth Revis, The Man With No Heart09 - Alastair Reynolds, Wrecking Party10 - Hugh Howey, Hell from the East11 - Rajan Khanna, Second Hand12 - Orson Scott Card, Alvin and the Apple Tree13 - Elizabeth Bear, Madam Damnable's Sewing Circle14 - Tad Williams, Strong Medicine15 - Jonathan Maberry, Red Dreams16 - Kelley Armstrong, Bamboozled17 - Tobias S. Buckell, Sundown18 - Jeffrey Ford, La Madre del Oro19 - Ken Liu, What I Assume You Shall Assume20 - Laura Anne Gilman, The Devil's Jack21 - Walter Jon Williams, The Golden Age22 - Fred Van Lente, Neversleeps23 - Christie Yant, Dead Man's Hand",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Anthologies",
    "Westerns",
    "Horror",
    "Urban Fantasy",
    "Fiction"
  ],
  "author": "John Joseph Adams",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/21938494-dead-man-s-hand"
}