{
  "title": "Her Troika: The Complete Story",
  "description": "Two strict Doms, one brave sub, and a slave auction…\n Kurt Erickson has been offered a Dom’s dream job. He picks his own hours, answers to no one, and gets to train submissive women all day. One of those submissive women happens to be his willing wife. Making Breanna's deepest, darkest fantasy come true is the easy part. It may be trickier to persuade his best friend Derek to ... buy her. Breanna Erickson prides herself on being ready for anything. From the courtroom to the bedroom, she can handle it all. But when her strict, but loving, husband gives her the chance to live out a dream, she finds there are things no woman can be ready for. Derek’s marriage ended because he buried dark needs that proved incompatible with a vanilla wife. He’s buried those needs, those truths, deep down, determined to never let them hurt him again. Being Kurt’s best friend has many benefits, but some of them are much more than Derek is ready for -- or so he thinks. Then one night, an auction. Only a select few women agree to a Term of Service to the shadowy organization known as the Dominion Trust. One of them is Breanna. For Kurt, thrilling, tantalizing possibilities are laid out before him. For Breanna, it’s the chance to realize a dark, erotic dream -- and to heal a broken heart. And for Derek, forced to confront who he really is -- and what he never realized he needed -- he must take that first step. All he has to do is bid on her … Publisher's Warning: Intended for mature readers. 18 and over only! This BDSM book contains the following acts or themes: Consensual sexual slavery (auctioning), pony play, D/s, total power exchange, bondage, corporal punishment, forced exhibitionism, objectification, humiliation. MFM menage BDSM erotic romance. There is no sexual interaction between the males in this story. 120,000 words 381 pages NOTE: This novel collects the entire Her Troika story (Parts I - V) into one volume.",
  "genres": [
    "BDSM",
    "Erotica",
    "M F M",
    "Menage",
    "Dark"
  ],
  "author": "Trent Evans",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/21936632-her-troika"
}