{
  "title": "Bangtails, Grifters, and a Liar's Kiss",
  "description": "* Author I have never used AI in my writing.Book 2 of 3 of the O’Shaughnessy Investigations Inc. Mystery SeriesThe Homefront, summer 1943, Brooklyn, New York.Smalley Pauley is missing. His brother, gangster Guido Bonasccoro, hires reluctant O’Shaughnessy Detective Agency partners Maeve O’Shaughnessy and Vic Marino to find him.A year after Vic Marino walked into the O’Shaughnessy detective agency office and told Maeve he was going to help her make a go of an agency on the brink of collapse, they have managed to keep it going thanks to the challenging murder case they solved the previous year. This second year provides newer, darker, more dangerous cases as they find themselves caught in the middle of a gangster turf war and forced to do risky work for G-men.Maeve’s teenage brother Jimmy is a junior in high school and as his guardian Maeve is concerned about providing him the attention and stability he needs. With the help of Father Jakob Tomek both Maeve and Vic have an anchor to keep them grounded.Several of the “side issues” from neo-noir mystery Book 1 are carried over to Book 2, including the Blue Star Diner murders, the unusual goings on at The Lila Restaurant, the death of a close friend, Maeve’s soldier boyfriend overseas, Evan, the black market, and the corruption of the Police Chief who wants to destroy Vic.Characters from Book 1 also make their appearance in Book 2 including Vic’s former police partner Gerry Loughty, barber-in-the-know Slinky, Maeve’s childhood former boyfriend Irish crime boss Lory, gambler and mob-connected informant Lev, and briefly, the red-headed bombshell Rosaleen, as well as a host of new characters.Maeve and Vic carry on their cases against the backdrop of World War II that rages on. Rationing continues with more challenges for women to make good tasting meals with fewer ingredients. Victory gardens are considered part of citizens’ patriotic duty. So is buying War Bonds. So is contributing to rubber, metal, and book drives, considered precious resources needed to help the “boys” overseas. Women have never had so much freedom to work outside the home as they contribute to the war effort by taking over jobs men did before they were sent off to War. Jazz clubs, movies, horseracing, and Coney Island present moments of respite in a dangerous and treacherous world.The most dramatic “sacrifices” are those of GIs’ families who receive telegrams/visits informing them of missing or dead loved ones. Yet, the majority of Americans supported the War but prayed for a faster resolution and end to the devastating World War that dominated the globe.Find out how Maeve and Vic deal with the greed, threats, and secrets of the times in this neo-noir/ historical fiction novel.Content Please be aware this book contains issues of violence, war violence, killing, racism and racial slurs (in the context and vernacular of the times), sexism, mob activity, verbally abusive language, and physical abuse.",
  "genres": [
    "Drama",
    "Book Club",
    "Contemporary",
    "Novels"
  ],
  "author": "A.G. Russo",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/219360073-bangtails-grifters-and-a-liar-s-kiss"
}