{
  "title": "Hosts",
  "description": "Repairman Jack returns in a sequel to the New York Times bestseller, The Tomb!Repairman Jack has been tearing up the urban adventure scene ever since he was introduced in the New York Times bestseller The Tomb. As his fans know, Repairman Jack doesn't deal with electronic appliances; he's a situation fixer, no matter how weird or deadly a situation may be. Repairman Jack has no last name, no Social Security number, and no qualms when it comes to getting the job done-even if it means putting himself in serious danger.After fifteen years of separation, Jack is contacted by his long-lost sister, Kate, to help her track down the source of her girlfriend Jeanette's sudden trance-like behavior. Referred by a mysterious stranger who gives only Jack's name and phone number, Kate is shocked to find out that the \"repairman\" she seeks is none other than her little brother-and not altogether happy to find out what little \"Jackie\" has been doing with himself for all these years. With Jack leading the way, Kate finds out that Jeannette's behavior can be traced back to the experimental therapy she underwent for a brain tumor: now Jeannette's brain and those of several other subjects are infected by a mutated virus. Like any good virus, it wants to multiply-and if Jack can't stop the virus in its path, there will be deadly results.Meanwhile, Jack is traveling on the 9 train when suddenly a passenger goes berserk and starts shooting at random-leaving Jack no choice but to throw himself into the spotlight by putting the shooter down. Worse for Jack, one of his fellow passengers is a reporter for the local tabloid, The Light, who sees Jack's heroism as his ticket to journalistic stardom. The reporter promises to make Jack a celebrity hero, a household name-which could mean the end of Repairman Jack as we know him.",
  "genres": [
    "Horror",
    "Thriller",
    "Urban Fantasy",
    "Fiction",
    "Fantasy",
    "Mystery",
    "Supernatural"
  ],
  "author": "F. Paul Wilson",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/219402.Hosts"
}