{
  "title": "Why Did the Chicken Cross the World?: The Epic Saga of the Bird that Powers Civilization",
  "description": "Veteran journalist Andrew Lawler delivers a “fascinating and delightful…globetrotting tour” (Wall Street Journal) with the animal that has been most crucial to the spread of civilization—the chicken.In a masterful combination of historical sleuthing and journalistic adventure, veteran reporter Andrew Lawler “opens a window on civilization, evolution, capitalism, and ethics” (New York) with a fascinating account of the most successful of all cross-species relationships—the partnership between human and chicken. This “splendid book full of obsessive travel and research in history” (Kirkus Reviews) explores how people through the ages embraced the chicken as a messenger of the gods, an all-purpose medicine, an emblem of resurrection, a powerful sex symbol, a gambling aid, a handy research tool, an inspiration for bravery, the epitome of evil, and, of course, the star of the world’s most famous joke. Queen Victoria was obsessed with the chicken. Socrates’s last words embraced it. Charles Darwin and Louis Pasteur used it for scientific breakthroughs. Religious leaders of all stripes have praised it. Now neuroscientists are uncovering signs of a deep intelligence that offers insights into human behavior. Trekking from the jungles of southeast Asia through the Middle East and beyond, Lawler discovers the secrets behind the fowl’s transformation from a shy, wild bird into an animal of astonishing versatility, capable of serving our species’ changing needs more than the horse, cow, or dog. The natural history of the chicken, and its role in entertainment, food history, and food politics, as well as the debate raging over animal welfare, comes to light in this “witty, conversational” (Booklist) volume.",
  "genres": [
    "History",
    "Nonfiction",
    "Animals",
    "Science",
    "Food",
    "Birds",
    "Nature"
  ],
  "author": "Andrew Lawler",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/21942957-why-did-the-chicken-cross-the-world"
}