{
  "title": "Allegiance",
  "description": "Book 2 of the Betrothed Series  Harry Potter’s magic, Twilight’s heartache... with a message that love and confidence make everything possible – a faery fantasy with a reality check.  “The twist and turns will have you turning pages and say 'just one more chapter'. But once you start Allegiance you will be hooked until the end. Not to mention that will leave you counting down the days until the next book on the beautiful series flies onto our shelf.” - Kylie Kniess  “While people could mistake this book in being a purely romance novel, the thing I like about it is it highlights the importance of all kinds of love and bonds – with family, friends and romantic partners. I loved the fact all the characters are flawed and because of this, so too are their relationships. This book highlighted that just because you are meant to be in someone’s life doesn’t make it easy – you have to keep an open mind, be able to compromise and all the while stick up for yourself and what you believe in – tough work – no wonder all the characters fumble!  All in all I’ve loved getting lost in the glorious dream world that is Faera. Now bring on the next book in the series, ‘Confused’!” - Krystina, Goodreads  \nTHE BEAUTIFUL BETROTHED SERIES RETURNS – AS DARKNESS APPROACHES  Allegiance\n is the second novel in Wanda Wiltshire’s spellbinding six-part \nBetrothed\n series, inviting readers on an astonishing journey of dreamy landscapes and beguiling characters, with a racy love triangle.  Wanda Wiltshire traps key character Marla between two worlds – Earth and the enchanting land of Faera.  Hidden on Earth for her own protection, Marla discovers she is a faery and is betrothed to the drop-dead gorgeous Leif – prince of the Faery Kingdom of Telophy - a world where nothing is as perfect as it seems. But a shocking deal she strikes with the King of Telophy forces her to abandon her new Faery home.  \nAllegiance\n begins with Marla returning to Australia, consumed with sadness and conflict, eroding the little self-confidence she has left. Her family, terrified for her health are taken aback when all of a sudden Marla seems to forget her passion for the faery Prince Leif... and develops a love for her human best friend, Jack, that seems to magically jolt her out of her pit of despair.  But Leif journeys to Earth to win Marla back, and everything changes. Marla discovers she is not alone – with other fae also hidden on Earth – and when Leif learns a dark, sinister force threatens Faera – the Shadow King – he insists that Marla and Jack return to Faera with him to help vanquish the deadly threat.  As the evil Shadow Fae challenge Leif’s father, King Telophy, by enslaving many of his subjects, Jack conceives a way to stop them – by risking everything and drawing Marla and Leif into the shadows. Can they save Faera in time?  Who will Marla choose? Jack or Prince Leif?  By taking her Earth-born characters back into the magical faery kingdom, Wiltshire skilfully speaks to the angst and turmoil many young people will relate to – a path of self discovery and finding one’s place in the world. Wiltshire places Marla in great jeopardy, facing choices with far-reaching consequences that affect her adopted Earth family, her best friend Jack and a lost twin brother.",
  "genres": [
    "Fantasy",
    "Romance",
    "Supernatural",
    "Magic",
    "Young Adult",
    "Paranormal",
    "Fairies"
  ],
  "author": "Wanda Wiltshire",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/21943097-allegiance"
}