{
  "title": "Riding the Alligator: Strategies for a Career in Screenplay Writing and Not getting Eaten",
  "description": "A bestseller that is the first artist-friendly screenwriting guide to success by an Oscar nominated Hollywood insider whose productions have grossed more than a billion dollars. Riding the Alligator is different from other screenwriting books in that it takes a non-dogmatic approach to finding your own personal creative process, and shares Pen’s best kept secrets for selling your creations and yourself. Pen is your own, warm, funny, personal mentor as you read this book.  Actress Robin Wright says: “It is like getting a UC screenwriting course for under $30!!!”.  Pen draws from his own extremely simple breakthrough techniques, shares his inspiring philosophy of finding a personal well of creativity from your inner voice, to overcoming the many challenges in a unique business, managing stress, the real secrets to selling your work, finding the right agent and being true to one's nature to create a lasting and passion filled career. The book is hailed by Hollywood luminaries like Ron Howard, Paul Haggis, Jeff Bridges, Morgan Freeman, as well as heads of major motion picture studios and academics from top film schools including USC, UCLA, NYU and AFI. Also included are short, personal essays by A-List Hollywood scripters such as Shane Black (Lethal Weapon, Kiss Kiss Bang Bang), Nia Vardalos (My Big Fat Greek Wedding), Eric Roth (Forrest Gump), Robin Swicord (Memoirs of a Geisha), Ron Shelton (Bull Durham/White Men Can't Jump), Laeta Kalogridis (Shutter Island/Avatar), Todd Robinson (White Squall/Phantom), Andrea Berloff (World Trade Center), Anthony Peckham (Sherlock Holmes) and more. Additionally, Pen provides an ‘Instant Library’ summarizing 10 other popular books on Hollywood, as reviewed by his USC Film Students.",
  "genres": [
    "Writing"
  ],
  "author": "Pen Densham",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/10138605-riding-the-alligator"
}