{
  "title": "Midnight: A McKenna Chronicle",
  "description": "I fell willingly into his bed, stolen moments of passion so intense they blurred the lines of responsibility and reason. The passion we’ve unlocked could be the key to our salvation or the path to damnation. This is my story, my fall into love and fear that it could end in a heartbeat... One destined meeting. It alters journalist, Charlise \"Charlie\" Carter’s course. When asked to work on a Republican candidate's campaign, she’s unprepared for the intense reaction she has toward the young, handsome presidential hopeful, Colin McKenna. Unable to resist Charlie’s allure, McKenna succumbs to his desire and they find themselves exploring a passionate, physical relationship that is soon tested by not only their own secrets, but his political advisers. Traveling the country in pursuit of the presidential nomination, his career aspirations and complications from the past collide with their desire to be together, threatening to tear them apart forever. Midnight tells a compelling story of burgeoning trust, intense passion and secrets that could cause it all to unravel in a heartbeat. Midnight is an adult contemporary romance, due to strong language and sexual content this book is not intended for readers under the age of 18. Excerpt from Midnight “So good. It’s too good . . .” he mumbles against my mouth. And it is. So intense and so good my toes curl as I wrap my legs around his backside. I’m close to overwhelmed, the feel of him buried in me, knowing I’m really here in this moment, and his voice whispering in my ear to hold on, don’t hold back, give me everything . . . I almost can’t hold on, falling deeply into every sensation and losing myself in them.",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "Contemporary",
    "Amazon",
    "Erotica",
    "M F Romance",
    "Adult"
  ],
  "author": "Elizabeth  Miller",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/21942663-midnight"
}