{
  "title": "Hogfather",
  "description": "\"Exceptionally amusing and enjoyable.\" —Michael Moorcock'Twas the night before Hogswatch and all through the house . . . something was missing. Don't miss this hilarious and irreverent installment in the beloved Discworld series from New York Times bestselling author Sir Terry Pratchett.It’s the most wonderful time of the year, Hogswatchnight, when the Hogfather himself dons his red suit and climbs in his sleigh pulled by—of course—eight hogs, to shower gifts across Discworld. But when the fat man goes missing, someone has to sit in. It’s up to Death to take up the reigns—otherwise the sun won’t shine tomorrow . . . or ever again.Who would want to harm Discworld's most beloved icon? Very few things are held sacred in this twisted, corrupt, heartless—and oddly familiar—universe, but the Hogfather is one of them. Yet here it is, Hogswatchnight, that most joyous and acquisitive of times, and the jolly, old, red-suited gift-giver has vanished without a trace. And there's something shady going on involving an uncommonly psychotic member of the Assassins' Guild and certain representatives of Ankh-Morpork's rather extensive criminal element. Suddenly Discworld's entire myth system is unraveling at an alarming rate. Drastic measures must be taken, which is why Death himself is taking up the reins of the fat man's vacated sleigh . . . which, in turn, has Death's level-headed granddaughter, Susan, racing to unravel the nasty, humbuggian mess before the holiday season goes straight to hell and takes everyone along with it.The Discworld novels can be read in any order, but Hogfather is the fourth book in the Death series. The collection MortThe Reaper ManSoul MusicHogfatherThief of Time",
  "genres": [
    "Fantasy",
    "Fiction",
    "Humor",
    "Christmas",
    "Comedy",
    "Science Fiction Fantasy",
    "Audiobook"
  ],
  "author": "Terry Pratchett",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/219427214-hogfather"
}