{
  "title": "WATER MARKED",
  "description": "WATER MARKEDby ASHER GREYThis riveting mystery takes the reader across the Western Hemisphere as a sharp scientist and a disgraced FBI agent scramble to save themselves and the planet from high-power foes that won’t stop until they control everything - Even the life force that sustains us.Quinn Gavrel, a keep-to-herself hydrologist, works at SHIFT, an environmental think tank in Austin, Texas. Her only interest is doing research, and letting others handle its ramifications. After all, she has experienced first-hand what happens to scientists who speak out too loudly about the world's pressing environmental issues - You end up in the crosshairs, and that leaves a mark.So when Quinn discovers that Peter Guernsey, a high-profile scientist and rival, has been killed in a robbery gone wrong, she's ashamed to feel relieved. He won't be tormenting her, or any other scientist, anymore. Or, so she thinks.From beyond the grave, Guernsey throws her back into hot water, surprising her with a new quandary, one he trusted only she could solve. At first, Quinn is reluctant to investigate. But, she's a scientist. She can't help herself. As her curiosity takes her outside the confines of her lab, she discovers Guernsey kept a secret, one that marked him for death.Entangled in a web of deception, conspiracy, and murder that stretches into the highest echelons of government and finance, Quinn realizes she too has been marked. With the help of Rand McNair, a discredited FBI Agent and the only one who believes her, she races against time to expose a for-profit plot that will change the way the world works and her life forever.Inspired by the controversy surrounding the Keystone XL Pipeline, designed to carry oil from the tar sands in Alberta, Canada down to the Gulf of Mexico, WATER MARKED is an action-packed environmental mystery. ASHER GREY takes us into the worlds of computer hacking, private equity, and climate change science, weaving compelling, real-world suspense that will leave you thirsting for more.",
  "genres": [],
  "author": "Asher Grey",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/21941458-water-marked"
}