{
  "title": "Argentina Seen As It Is",
  "description": "The late nineteenth and early twentieth centuries saw millions upon millions of Italian emigrants going to what they believed to be a new and wonderful life in the Americas. While today the focus is on the success that their descendants have had in those adopted countries, the fact is that many of these poor, illiterate people, because of their lack of education, complaisant nature toward authority and burning hope for a better life, were easily led to the dream of riches and then exploited and abused. Reality was far from the picture painted by the enticing propaganda of the time. Not everyone, however, was indifferent to the plight of those who left and those who still dreamed of leaving.One newspaper in Italy, the Corriere Della Sera of Milan, chose to do what would be called today an investigative exposé. From November, 1901 to September, 1902, they published articles written by journalist Luigi Barzini, who sent in his stories while making the trip from Italy to Argentina with the emigrants, then traveling around Argentina to see the conditions for himself. His aim was simple: to tell the real story of emigration, not the concocted fairy tales of easy riches and a life of leisure that so many of his fellow countrymen believed. He also described in detail the serious problems and ineffectual solutions of Argentina at that time, which Barzini found at the root of his countrymen’s misery. The modern-day reader will recognize many of these problems and solutions almost as if they came from today’s headlines. He saw first-hand the humiliations, the injustices, the deprivations that many emigrants from Italy faced, made all the worse because their expectations were so high. Once his stories began to be published, those who had a financial stake in the status quo tried to undermine his efforts. He faced angry mobs and was attacked in the indigenous newspapers. He continued, however, to write his stories in order that the truth be known back home.Wishing to keep interest high in the situation facing the emigrants, the Corriere and Barzini subsequently published these newspaper articles as a collection in this book. In it the reader will find a chronicle of Barzini’s experiences in Argentina and his fervent arguments against the wholesale emigration of Italians to the new world.",
  "genres": [],
  "author": "Luigi  Barzini",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/21945292-argentina-seen-as-it-is"
}