{
  "title": "The Price of Thirst: Global Water Inequality and the Coming Chaos",
  "description": "“There's Money in Thirst,” reads a headline in the New York Times. The CEO of Nestlé, purveyor of bottled water, heartily agrees. It is important to give water a market value, he says in a promotional video, so “we're all aware that it has a price.” But for those who have no access to clean water, a fifth of the world's population, the price is thirst. This is the frightening landscape that Karen Piper conducts us through in The Price of Thirst —one where thirst is political, drought is a business opportunity, and more and more of our most necessary natural resource is controlled by multinational corporations. In visits to the hot spots of water scarcity and the hotshots in water finance, Piper shows us what happens when global businesses with mafia-like powers buy up the water supply and turn off the taps of people who cannot border disputes between Iraq and Turkey, a “revolution of the thirsty” in Egypt, street fights in Greece, an apartheid of water rights in South Africa. The Price of Thirst takes us to Chile, the first nation to privatize 100 percent of its water supplies, creating a crushing monopoly instead of a thriving free market in water; to New Delhi, where the sacred waters of the Ganges are being diverted to a private water treatment plant, fomenting unrest; and to Iraq, where the U.S.-mandated privatization of water resources destroyed by our military is further destabilizing the volatile region. And in our own backyard, where these same corporations are quietly buying up water supplies, Piper reveals how “water banking” is drying up California farms in favor of urban sprawl and private towns. The product of seven years of investigation across six continents and a dozen countries, and scores of interviews with CEOs, activists, environmentalists, and climate change specialists, The Price of Thirst paints a harrowing picture of a world out of balance, with the distance between the haves and have-nots of water inexorably widening and the coming crisis moving ever closer.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Environment",
    "Economics",
    "Science",
    "Climate Change",
    "History"
  ],
  "author": "Karen Piper",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/21944612-the-price-of-thirst"
}