{
  "title": "Fay",
  "description": "Larry Brown's Fay picks up at the precise moment when its 17-year-old heroine walks out of his 1991 novel Joe. And really, who could blame her? Fay's father, Wade Jones, was one of the most enduring villains in recent fiction, the kind of man who would trade a son for a car and a daughter's virginity for a few $20 bills. Reared in migrant camps, tarpaper shacks, and, most recently, an abandoned cabin, Fay herself is pretty, goodhearted, astonishingly ignorant: in other words, trouble in a too-tight dress and a pair of rotting tennis shoes. Fleeing her father's advances, she takes to the Mississippi road in a passage that, with its rough music, is pure Brown:  She came down out of the hills that were growing black with night, and in the dusty road her feet found small broken stones that made her wince. Alone for the first time in the world and full dark coming quickly. House lights winked through the trees as she walked and swung her purse from her hand. She could hear cars passing down the asphalt but she was still a long way from that.  For the first time, Brown narrates most of a novel from a woman's point of view, and while the result is every bit as gripping as his previous work, it is also more inward-looking. Joe, for instance, reads like something carved out of a block of granite; in Fay, Brown feels somehow closer to the story--almost tender, or as tender as a writer with such an unflinching gaze can be. As Fay hitchhikes her way down Highway 55, from the woods near Oxford to the beaches and strip bars of Biloxi, she draws both men and violence to her like a magnet. Utterly without envy or self-pity, she is a force of nature, pure and simple, and Fay illuminates just how deadly her kind of innocence can be.  It's no value judgment to say this book is about white trash. Brown knows it, the reader knows it, Fay knows it; at one point, she even muses, \"She never had been called a white trash piece of shit before but she'd been called white trash.\" But don't mistake Brown's work for mere trailer-park sociology. Despite the redneck trappings, the Jones family has been with us since the beginning of time, and their story, like all tragedies, is both larger than life and just like it too. \"White trash,\" after all, is just another way of saying \"not many choices.\" In writing about lives stripped down to their essentials, Brown reminds us of the dark truths our choices sometimes allow us to forget. --Mary Park",
  "genres": [
    "Fiction",
    "Southern",
    "Southern Gothic",
    "Book Club",
    "Gothic",
    "Crime",
    "Coming Of Age"
  ],
  "author": "Larry Brown",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/2194397.Fay"
}