{
  "title": "My Five Stages of Grief - A Father's Journey to Recovery from Bereavement",
  "description": "My Five Stages of Grief by Darren Heart is an emotional chronicle of the author's ten year journey to recovery and healing from the grief and overwhelming sense of loss caused by the tragic deaths of his long term partner, and shortly afterwards, his step son. The Prologue for this book summarizes the author's moving love story up until the moment tragedy strikes at the heart of his family. The main body of the book is represented by five chapters dedicated to the five stages of grief, namely; Denial, Anger, Bargaining, Depression and Acceptance. Each chapter is broken down to include a brief clinical definition for a particular stage, followed by the author's own observations and experiences, closing with a number of poems written by the author, intended to reflect upon the various emotions and thoughts experienced during that particular stage of the grieving process. My Five Stages of Grief concludes with an Epilogue where the author describes life \"post-acceptance\", and offers words of hope, inspiration and encouragement to those who may be wading through the grief and mourning process, and feeling misunderstood or isolated. Containing emotional, thought provoking, and inspirational poems related to the various five stages of grief, capturing the author's raw thoughts and emotions associated with each stage. For those who have suffered the loss of a loved one, this book explores a mourner's need to acknowledge death and embrace the pain of loss and bereavement. Also explored are the many facets that make each individual's grief unique, and the many normal thoughts and feelings that someone currently grieving may have. At one time or another, we will all find ourselves facing a dark journey through the grieving process. My Five Stages of Grief is written to provide support and comfort for a person who is in the wake of despair following the loss of a loved one. This powerful book will help support readers throughout their five stages of grief by sharing a number of relate-able biographic experiences, using poetry and prose, breaking down the walls of isolation that can leave a mourner feeling utterly alone, in preparation for the end of the journey, peace.",
  "genres": [],
  "author": "Darren Heart",
  "average_rating": "4.89",
  "url": "https://www.goodreads.com/book/show/21946240-my-five-stages-of-grief---a-father-s-journey-to-recovery-from-bereavemen"
}