{
  "title": "The Forbidden Worlds of Haruki Murakami",
  "description": "In an “other world” composed of language—it could be a fathomless Martian well, a labyrinthine hotel or forest—a narrative unfolds, and with it the experiences, memories, and dreams that constitute reality for Haruki Murakami’s characters and readers alike. Memories and dreams in turn conjure their magical counterparts—people without names or pasts, fantastic animals, half-animals, and talking machines that traverse the dark psychic underworld of this writer’s extraordinary fiction.Fervently acclaimed worldwide, Murakami’s wildly imaginative work in many ways remains a mystery, its worlds within worlds uncharted territory. Finally in this book readers will find a map to the strange realm that grounds virtually every aspect of Murakami’s writing. A journey through the enigmatic and baffling innermost mind, a metaphysical dimension where Murakami’s most bizarre scenes and characters lurk, The Forbidden Worlds of Haruki Murakami exposes the psychological and mythological underpinnings of this other world. Matthew Carl Strecher shows how these considerations color Murakami’s depictions of the individual and collective soul, which constantly shift between the tangible and intangible but in this literary landscape are undeniably real.Through these otherworldly depths The Forbidden Worlds of Haruki Murakami also charts the writer’s vivid “inner world,” whether unconscious or underworld (what some Japanese critics call achiragawa, or “over there”), and its connectivity to language. Strecher covers all of Murakami’s work—including his efforts as a literary journalist—and concludes with the first full-length close reading of the writer’s newest novel, Colorless Tsukuru Tazaki and His Years of Pilgrimage.",
  "genres": [
    "Nonfiction",
    "Literary Criticism",
    "Japan",
    "Writing",
    "Criticism",
    "Japanese Literature",
    "Asian Literature"
  ],
  "author": "Matthew Carl Strecher",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/21944445-the-forbidden-worlds-of-haruki-murakami"
}