{
  "title": "فتح أمريكا: مسألة الآخر",
  "description": "إن توقيت نشر كتاب \"فتح أمريكا: مسألة الآخر\" لتزفتان تودوروف، مترجماً إلى العربية فى عام 1992، له دلالاته العميقة والمتشبعة. فعام 1992 يشكل النصف الألفى لـ \"اكتشاف\" كريستوفر كولومبوس للقارة \"الأمريكية\". خمسة قرون مضت على هذه الرحلة الاستكشافية، لكننا اليوم نتحرج من استخدام مصطلح \"اكتشاف\" لأن الكلمة فى هذا السياق تتضمن عنصرية وتمحوراً أوروبياً ومركزية غربية. فالمكتشف (بكسر الشين) أوروبى والمكتشف (بفتح الشين) هو القارة التى كانت حينذاك مجهولة بالنسبة لأوروبا والعالم القديم، ولكنها معروفة عند أهلها وعامرة بسكانها الأصليين ذوى الحضارة العريقة مثل الآزتيك والإنكا والمايا وغيرهم. إن \"الاكتشاف\" هنا هو اكتشاف من وجهة نظر الأوروبى، لا من وجهة نظر أهل البلاد القاطنين فيها. وبهذا تكون كلمة \"اكتشاف\" التى استخدمتها أوروبا التوسعية حاملة فى ثناياها إيديولوجية تضخم الذات الأوروبية وتغييب الآخر اللا أوروبى. فهى حتماً تعبير لا يمكن أن يستخدمه سكان القارة الأصليون، لأن هذا الحدث لم يكن اكتشافاً لهم على الإطلاق، وإنما كان اكتشافاً من وجهة نظر الآخر فقط.  وبالإضافة إلى أن عام 1492 هو عام \"اكتشاف\" الآخر الذى أدى إلى القضاء على هذا الآخر، فقد كان أيضاً العام الذى بدأ فيه مسلسل طرد الآخر من أوروبا، فهو العام الذى سقطت فيه غرناطة وبدأت أسبانيا فى التخلى عن أندلسيتها والتنكر لرافدها العربى والإسلامى، وقامت بترحيل كل من شكل آخر فى عرفها، مسلماً كان أو غير ذلك من الأقليات الدينية والطائفية. ولهذا يمكن أن يقال أن عام 1492- الذى تتم المراسيم والاحتفالات على مرور خمسمائة عام عليه- هو عام الآخر، بغزوه وإبدته واستبعاده، بتصفيته جسدياً وحضارياً، بنفيه وإزاحته بعيداً: هو عام القضاء الرسمى على التعددية فى أسبانيا وعام بداية اختراق الآخر عالمياً، هذا الاختراق الذى أدى إلى توزيع العالم الثالث إلى ممتلكات أوروبية وأحياناً ممتلكات خاصة وفردية لملوكها. وباسم الحضارة وباسم التمدن وباسم التبشير بالرفيع والسامى استمر لمدة خمسة قرون نهب العالم نهباً أوروبياً منسقاً ومخططاً ومتصاعداً، مجملاً بالإعلام المزيف والادعاءات المشوهة والمغالطات التى روج لها المنظرون فى كافة الحقول المعرفية وكان فى مقدمتهم المستشرقون. وهذا إنجاز لا يستهان به، يقدم لنا تودوروف صفحة من صفحاته المعتمة التى كتبت بالدم فى المكسيك فى القرن السادس عشر الميلادى.  والمؤلف على وعيه بشناعة ما كان وبتمثله للحضارة المغلوبة تمثلاً متعاطفاً، إلا أنه لم يقتصر على موقف الإدانة الذى استهل الكتاب به، وإنما تساءل: كيف تم هذا الإنجاز الجهنمى؟ كيف يمكن أن تغلب فئة ما هذا المجتمع الآخر الراسخ بحضارته الثرية والمعقدة كما كان فى المكسيك؟ الكتاب إذن يطمح إلى كشف المستتر والمسكوت عنه فى فتح أمريكا كشفاً علمياً دقيقاً تفصيلياً، وذلك بتشريح عملية الإزاحة والهيمنة كى لا تتكرر وكى يتعلم المغلوبون مقاومة تفكيكهم وسحقهم، كما يتكشف للعالم ثمن الغزوة الأمريكية.",
  "genres": [
    "History",
    "Nonfiction",
    "Anthropology",
    "Philosophy",
    "Politics",
    "Academic",
    "Historical"
  ],
  "author": "Tzvetan Todorov",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/11274772"
}