{
  "title": "Her Ordinary Joe",
  "description": "“Polly Winslow is the last woman on earth I’d ever consider getting involved with.”Ellie Winslow thinks her new fifth-grade teacher, Mr. Matthews, will be the perfect husband for her Aunt Polly. He’s tall and good-looking and he has blue eyes, just like every hero in the romance books her aunt writes. A con-artist in the making, Ellie tells a little white lie to get Mr. Matthews to her aunt’s doorstep. Mr. Matthews and Aunt Polly just have to look in each other’s eyes and all will be happily ever after. Right?Not quite.From his early years, Joe Matthews has striven for perfection in all facets of his life. Polly Winslow is the complete opposite of the ideal mate he’s envisioned for himself. Pretty and charming she may be, but she’s way too free-spirited—a chaotic, whimsical whirlwind that reminds him too much of everything he’s been running away from since he was a boy.“I don’t care if he’s the last single guy on the planet. I’m not interested. Period.”Joe may have the most gorgeous blue eyes that Polly's ever seen, but he’s no match for the larger-than-life fictional heroes that stand front and center in both her daydreams and the romance novels she writes. In her opinion, he’s just an average, ordinary guy, and he’s way too neat and fastidious. Besides—no matter how much her fingers itch to remove his tie and muss up his hair—she’s keeping all thoughts of real-life romance on the back burner until her goal of becoming a published writer is realized.Maybe it’s time for two stubborn people to let go of long-held ideals and perceptions and open their minds and hearts to the extraordinary love that is waiting on the doorstep.This Clean Romance is part of a series but can be read and enjoyed as a stand-alone.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Fiction"
  ],
  "author": "Margaret Desmond",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/21947904-her-ordinary-joe"
}