{
  "title": "A Match Made in Coven",
  "description": "He’s a prime suspect. She’s supposed to arrest him, not fall for him. But what if he’s the only one she can trust? Rival covens, a forbidden romance, and supernatural suspense come to a head in this spookily fun, enemies to lovers romcom.When magical enforcer Sarah Michelle Callidora gets a call about a gruesome murder in Salem just before Halloween, she’s ready for a long night of witchy detective work. What she’s not prepared for is her principal the infuriatingly charming and inconveniently attractive Lorcan Black, heir to a rival coven and a wizard with a past as dark as his family’s reputation.Lorcan has two problems. First, his business partner’s been murdered with his enchanted dagger, making him suspect number one. Second, the detective assigned to the case is the stubbornly beautiful witch he’s expected to consider an enemy. Despite their centuries-old family feud, sparks fly—and not the magical kind.To clear his name and solve the murder, Lorcan offers to team up with Sarah Michelle. But the closer they get to the truth—and to each other—the harder it is to deny the sizzling chemistry between them. With time running out, they must unravel a web of secrets—past and present, confront their deepest fears, and resist falling into a dangerously tempting alliance that could prove more heated than the case they’re trying to crack.A Match Made in Coven is a bewitching romantic comedy filled with magic, mystery, and a love story that breaks all the rules. Get ready for a spellbinding ride that will leave you laughing, swooning, and turning pages faster than a witch on a broomstick.If you’re looking for witchy books to read with light spooky vibes, a cozy fall witch romance with lots of banter, and plenty of magical twists, this paranormal witch romance is the perfect choice. With a captivating blend of mystery, humor, and charm, it’s a paranormal romance with HEA sure to enchant you.Perfect for fans of Erin Sterling, Kate Johnson, and Jennifer Chipman.",
  "genres": [
    "Romance",
    "Romantasy",
    "Fantasy",
    "Fantasy Romance",
    "Witches",
    "Halloween"
  ],
  "author": "Camilla Isley",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/219471116-a-match-made-in-coven"
}