{
  "title": "Surviving the Slaughter: The Ordeal of a Rwandan Refugee in Zaire",
  "description": "Though the world was stunned by the horrific massacres of Tutsi by the Hutu majority in Rwanda beginning in April 1994, there has been little coverage of the reprisals that occurred after the Tutsi gained political power. During this time hundreds of thousands of Hutu were systematically hunted and killed.Surviving the Slaughter: The Ordeal of a Rwandan Refugee in Zaire is the eyewitness account of Marie Béatrice Umutesi. She tells of life in the refugee camps in Zaire and her flight across 2000 kilometers on foot. During this forced march, far from the world’s cameras, many Hutu refugees were trampled and murdered. Others died from hunger, exhaustion, and sickness, or simply vanished, ignored by the international community and betrayed by humanitarian organizations. Amidst this brutality, day-to-day suffering, and desperate survival, Umutesi managed to organize the camps to improve the quality of life for women and children.    In this first-hand account of inexplicable brutality, day-to-day suffering, and survival, Marie Béatrice Umutesi sheds light on a backlash of violence that targeted the Hutu refugees of Rwanda after the victory of the Rwandan Patriotic Front in 1994.  Umutesi’s documentation of the flight and terror of these years provides the world a veritable account of a history that is still widely unknown. After translations from its original French into three other languages, this important book is available in English for the first time. It is more than a testimony to the lives and humanity lost; it is a call for those politicians, military personnel, and humanitarian organizations responsible for the atrocious crimes—and the devastating silence—to be held accountable.“Umutesi’s tale, told with honesty and eloquence, is a tribute to the human spirit, a searing indictment of the agents who perpetrated these horrors, and a reproach to those who turned away.”—Catharine Newbury, African Studies Review“Restores a human dimension that has been lacking in the history of the genocide and massacres in Rwanda.”—Danielle de Lame, African Studies Review“A vivid account of the grueling nightmare experienced by tens of thousands of Rwandan civilians whom the world had deliberately forsaken. . . . An outstanding call for justice.”—Aloys Habimama, African Studies Review “A towering work. . . . An epic for our times, a tale to ponder for the lessons it conveys, testimony so powerful and moving that it reaches an unintended literary greatness.”—Jan Vansina, African Studies Review“Of all the current books and films ten years after the Rwandan genocide, none is more effective than Surviving the Slaughter . . . . This book carries one along, often as if running with the refugees.”—Anne Serafin, Multicultural Review",
  "genres": [
    "Nonfiction",
    "Africa",
    "School"
  ],
  "author": "Marie Beatrice Umutesi",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/1127535.Surviving_the_Slaughter"
}