{
  "title": "In the Shadow of the Sabertooth: Global Warming, the Origins of the First Americans, and the Terrible Beasts of the Pleistocene",
  "description": "\"Doug Peacock, as ever, walks point for all of us. Not since Bill McKibben’s The End of Nature has a book of such import been presented to readers. Peacock’s intelligence defies measure. His is a beautiful, feral heart, always robust, relentless with its love and desire for the human race to survive, and be sculpted by the coming hard to learn a magnificent humility, even so late in the game. Doug Peacock’s mind is a marvel-there could be no more generous act than the writing of this book. It is a crowning achievement in a long career sent in service of beauty and the dignity of life.\"-Rick Bass, author of Why I Came West and The Lives of RocksOur climate is changing fast. The future is uncertain, probably fiery, and likely terrifying. Yet shifting weather patterns have threatened humans before, right here in North America, when people first colonized this continent. About 15,000 years ago, the weather began to warm, melting the huge glaciers of the Late Pleistocene. In this brand new landscape, humans managed to adapt to unfamiliar habitats and dangerous creatures in the midst of a wildly fluctuating climate. What was it like to live with huge pack-hunting lions, saber-toothed cats, dire wolves, and gigantic short-faced bears, to hunt now extinct horses, camels, and mammoth? Are there lessons for modern people lingering along this ancient trail?The shifting weather patterns of today-what we call \"global warming\"-will far exceed anything our ancestors previously faced. Doug Peacock's latest narrative explores the full circle of climate change, from the death of the megafauna to the depletion of the ozone, in a deeply personal story that takes readers from Peacock's participation in an archeological dig for early Clovis remains in Livingston, MT, near his home, to the death of the local whitebark pine trees in the same region, as a result of changes in the migration pattern of pine beetles with the warming seasons.Writer and adventurer Doug Peacock has spent the past fifty years wandering the earth's wildest places, studying grizzly bears and advocating for the preservation of wilderness. He is the author of Grizzly Years; Baja; and Walking It Off and co-author of The Essential Grizzly. Peacock was named a 2007 Guggenheim Fellow, and a 2011 Lannan Fellow.",
  "genres": [
    "Science",
    "Nonfiction",
    "Archaeology",
    "Nature",
    "History",
    "Environment",
    "Conservation"
  ],
  "author": "Doug Peacock",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/21955990-in-the-shadow-of-the-sabertooth"
}