{
  "title": "Broken Heart Syndrome",
  "description": "Shy, reclusive Frankie and her best friend Lou obsess over Thomas G. Longley, as they reverently refer to him, for their entire first two years of medical school. So when he publically humiliates her at the student bar she is devastated. Ten years later, Frankie has to work in the testosterone driven environment of Cardiology before she can start her palliative care training and, to her dismay, Tom is her boss. Thankfully the subject of her long-term crush doesn't seem to remember her and, given her ability to blend into the background, she’s not really surprised. What does surprise her is how cruel he is. Sure he squished her self esteem like a bug at Uni, but the Tom she spent many a pointless lunch break or library session covertly watching seemed easy going and quick to smile; not an uptight, overly critical bully. Between passing out whilst assisting in theatre, struggling to force the team to see their bed blockers, and being covered head to foot in the bloody vomit of ‘Scary Glenda’ (A&E’s most frequent, frequent flyer), she can’t wait to get through the six months. Although she’s too timid to tell Tom to jog on when she is his only target, when it’s her patients that he starts trampling she decides to grow a backbone, and Tom begins to see that she is not the cold, aloof woman he once thought. As the misunderstandings of the past come to light, Tom realizes that the ‘complete-bastard’ routine he has been clinging to out of hurt pride might not have been his most stellar idea. He has a fight on his hands to win Frankie over and, unfortunately, it's not just his past behaviour he's fighting against. You see, Frankie knows all about being pushed around. She’s dealt with enough verbal and even physical abuse before to last a lifetime and she’s not going to be fooled into thinking that this ruthless alpha male has turned over a new leaf. Even if he could convince her that he's not really the bully he projected before, her low self-esteem would never allow her to believe that a man like Tom could really be into a boring, bland, nondescript girl like her. Luckily for Frankie, Tom is used to getting what he wants. He’s determined to make her see herself clearly for the first time in her life and he's just arrogant enough to believe that he can break through her defenses. But Frankie's past is not ready to let her go quite yet. There's a reason that she spends next to no money but is always skint: a reason that she keeps her flat door open: a reason that she holds herself back from him. Maybe he won't manage to convince her and he'll allow her to push him away. Or maybe (as Lou rightly puts it) he should 'stop being a pussy and man up already.'",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Chick Lit",
    "Second Chance",
    "Enemies To Lovers",
    "Medical"
  ],
  "author": "Susie Tate",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/21955549-broken-heart-syndrome"
}