{
  "title": "Random Acts of Hope",
  "description": "She dressed professionally, wearing a plum-colored fuzzy v-neck sweater that contoured to the swell of a rack I remembered so well, legs encased in a slim pencil skirt that embellished those creamy hips I could imagine naked with a flicker of memory, lips painted fire-engine red and that maniac-inducing fifties pin-up girl look that I’d dismissed as silly when the girls in college wore it – but that made her smoking hot.  Down, boy.  God damn Charlotte, my ex-girlfriend, had to be here, of all places. At a bachelorette party where I was a stripper, dressed in a cop uniform with pants that suddenly got way too tight.  And she had to be so fine.  “Ooooh, honey, you’re one big officer,” said a sultry voice behind me as I watched Charlotte in the other room, chatting with the bride.  A hand stroked my hip and hesitated before sliding a bit lower, filling a palm with my ass. “Arrest me, Officer. I’ve been a bad, bad girl.”  With one look at the source of the voice, my night went from Oh, man to Oh, no.  That voice? That hand?  That was my mother.  Random Acts of Hope is the fourth book in the romantic comedy Random series, and features guitar player Liam McCarthy from the band, Random Acts of Crazy. Five years ago, Liam and his girlfriend, Charlotte Greyson, were deeply in love. When a betrayal eviscerates them both, each clings to their separate truths as an anchor to navigate the perfect storm.  But when the biggest ego in the band reconnects with the only woman who stole his heart, sparks fly in this sequel that asks whether you can believe in the impossible without sacrificing every ideal you hold – in order to find a love bigger than you ever imagined.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "New Adult",
    "Amazon",
    "Humor",
    "Second Chance"
  ],
  "author": "Julia Kent",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/21955042-random-acts-of-hope"
}