{
  "title": "Half of a Yellow Sun / Americanah / Purple Hibiscus",
  "description": "A collection of three extraordinary and exquisitely written novels from one of the most important and exciting young writers in the world.Chimamanda Ngozi Adichie has firmly established herself as one of the world’s most exciting and important young writers – a regular award-winner, ‘endowed with the gift of ancient storytellers’ (Chinua Achebe).A gripping, vividly written masterpiece, ‘Half of a Yellow Sun’ won the Orange Prize for Fiction. The lives of Ugwu, a young boy from a poor village, Olanna, a middle class woman, and Richard, a white man and a writer intersect in intimate and unexpected ways during the vicious Nigerian civil war. This is a story about Africa, about moral responsibility, the end of colonialism, ethnic allegiances, class and race – and about how love can move in to complicate all these things.Fearless, gripping, spanning three continents and numerous lives, ‘Americanah’ is a richly told story of love and expectation set in today’s globalized world. Ifemelu and Obinze fell in love as teenagers in Lagos. Thriteen years later, Obinze is a wealthy man in a newly democratic Nigeria; Ifemelu has achieved success as a writer in America. When Ifemelu returns to Nigeria, and the pair reignite their shared passions – for their homeland and for each other – they face the toughest decisions of their lives.‘Purple Hibiscus’ is a compelling tale of adolescence, set against the backdrop of Nigeria’s military coup. Fifteen-year-old Kambili’s life is regulated by the high walls of her family estate and the dictates of her repressive father. However when Nigeria begins to fall apart, Kambili and her brother are sent to live in their aunt’s laughter-filled house, where they discover life, love, and a terrible, bruising secret deep within her family.",
  "genres": [
    "Fiction",
    "Africa",
    "Historical Fiction",
    "Book Club",
    "African Literature",
    "Feminism",
    "Novels"
  ],
  "author": "Chimamanda Ngozi Adichie",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/21954964-half-of-a-yellow-sun-americanah-purple-hibiscus"
}