{
  "title": "Tragedies of Our Own Making: How Private Choices Have Created Public Bankruptcy",
  "description": "Several states are virtually bankrupt, including California and New York, with others fast approaching that status. In Tragedies of Our Own Making, West Virginia Supreme Court Justice Richard Neely distills the insights of a lifetime spent dealing with our nation's worst social problems. \"Twenty years as a judge,\" he writes, \"has convinced me that state government fiscal crises, deteriorating schools, declining living standards among the old blue-collar class, and our rising crime rate are all strangely interrelated.\"His overriding conclusion? Problems including colossal Medicaid costs, savagery in the streets, and the falling relative wage rate of half our workforce all relate to a disintegrating family structure. All public agencies - welfare, the courts, public health, education - \"are crumbling under the burden of acting as a surrogate family.\"In presenting a brilliant fiscal analysis of social insurance predicated on personal responsibility, Neely argues that \"we are going broke because we are allowing excessive losses to be triggered through carelessness. Millions of children are being born to school-age girls and to parents who will needlessly divorce, making those children uncared for and insecure. Illegitimacy and divorce are to social insurance what leaving a pot of oil on a burning stove is to fire insurance.\"Neely paints a vivid picture of the \"actuarial limits\" of our ability to rescue people from the consequences of their own actions. He offers a two-part solution to the core problems of divorce and illegitimacy. First, Neely calls for a massive, government-financed media campaign aimed at educating the public on the financial and psychological costs of divorce to adults and children. He also presents a comprehensive and politically acceptable approach to improved birth control.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Richard  Neely",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/2195249.Tragedies_of_Our_Own_Making"
}