{
  "title": "Thrown By Love",
  "description": "A kiss in a dark alcove triggers the greatest challenge of their lives... Ace pitcher Scotty Donovan has been traded from his longtime team—and hates it. But to his surprise, he now finds himself in the sweetest game of his winning the heart of smart, sexy physics professor Chloe McNalley. Chloe loves teaching, but she's never fit into academia. When she falls for Scotty, she discovers his arms and heart are where she belongs. They share a passion for the game, a fascination for the mysteries of the universe and an increasing love for one another. Then Chloe inherits Scotty's new team. As player and team owner, they shouldn't be dating. They try to hide their passion, until a blackmailer threatens them personally and professionally. Exposure could be the end of everything--Scotty's career, Chloe's team ownership, and their new love—unless they find a way to transcend the taboo standing between them. Quotes and Praise “Pamela Aares' writing is absolutely flawless, she sets the scene well and develops incredible characters. What I love most is how she writes strong female leads. I feel like I actually know both Chloe and Scotty because the description and character development was so fantastic so I got really invested in the story and I was rooting for the HAE but I was also rooting for Chloe's success. The scenery descriptions were absolutely on point... perfectly balanced scenery description is the trademark of a great author in my opinion and Pamela Aares nailed it. And similarly to Love Bats Last, there is an undercurrent of mystery and suspense interlaced with a wonderful romance story. I give Thrown By Love a solid 5 smarty stars with a bonus star for the author writing such a phenomenal book.”—Lady Literary “Pamela Aares deftly weaves together the desires and strategies of world-class sports with the equally charged realm of the heart to create fast-moving tales you’ll wish would never end.” —Mary Beath, award-winning author on the contemporary series, The Tavonesi Series. “A new star in the romance world!” —E. Alexander, New York Times best-selling author “Triple Crown Ms. Aares! This story has so many levels that all weave together beautifully. From the moment readers start tuning the pages, there will be no putting this story down until love bats last! —Julie Caicco, InD’tale Magazine \"I highly recommend this series to any readers who love Nora Roberts or Bella Andre.... I could feel the breeze on my face as I read. I love it when an author can paint such a clear picture that it is as if you are right there.\"—Jen's Reviews, Top Goodreads reviewer About the Author Pamela Aares is an award-winning author of contemporary and historical romance novels and also writes about fictional romance in sports with her new six-part baseball romance book series titled The Tavonesi Series. Her first book, Jane Austen and the Archangel (Angels Come to Earth, #1) was released in 2012. Midnight Becomes You, the second in the series will release in 2015 as will the celebrated historical romance novel, The Lady and the Patriot. Her popularity as a romance writer continues to grow with each new book release, so much so, that the Bay area author has drawn comparisons by some to Nora Roberts. Pamela Aares writes romance books that she loves reading, particularly those that entertain, transport and inspire dreams while captivating and tugging at the heart. She takes her readers on a journey with complex characters in both contemporary and historical settings who are thrown in situations that tempt love, adventure and self-discovery.",
  "genres": [
    "Romance",
    "Sports",
    "Contemporary",
    "Contemporary Romance",
    "Baseball",
    "Anthologies",
    "Sports Romance"
  ],
  "author": "Pamela Aares",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/21951300-thrown-by-love"
}