{
  "title": "Warrior's Song",
  "description": "\"Like so many college students, Shaw is torn between his father’s dream for his future and his own uncertainty. Shaw’s intellectual self-exploration provides the foundation of this novel. Hill sprinkles the novel’s dialog with references to the fundamentals of a liberal arts education, including American history, science, psychology, sociology, and philosophy. At first, these references seem unrelated; however, Mr. Hill winds them together in an increasingly pertinent existential rationale. Elemental to this exploration are concepts of the human soul, reincarnation and the integration of purpose, fulfilled as a result of Hill’s use of nuance and association.\"—Charles Weinblatt, author of Jacob's A Holocaust Love Story\"This book is so very inspirational. There are many young men in the United States who will study for and enter government activities at some time in their lives. They may have taken the same classes as Parker and Sam, but will they have the same drive, the need to reach out and know even more. If you have a teenage son, or daughter, looking toward college, I highly recommend this book be read by the entire family. Hill writes fluently from what he had studied, but more importantly merges his own personal philosophy that has undoubtedly evolved, and shares it with us as we each strive for success in today's world. This literary gem is undoubtedly the first in what will become a treasure of conceptual thinking and insight that will surely spark new enthusiasm in the lives of each and every reader. Don't miss the opportunity!\"—Glenda Bixler, Reviewers RoundupParker Shaw is a typical twenty-year-old college student at the University of Virginia—or so he thinks. He has a lucid dream that vexes him but, for the sake of his sanity, he decides to disregard it. In the coming months, however, it is clear that the dream has a special message for him. While on what appears to be a fact-finding mission that takes him and his buddy Sam to the awe-inspiring American Southwest, he encounters a Navajo man who provides some of the answers he’s been looking for.Warrior’s Song is the first in a four-part series that documents some of the most formative years in Parker’s life as he crosses the great threshold into adulthood. He comes to the realization that, in order to understand his place in society, he must recall to mind critical elements of his past. The new Parker who emerges from the ashes of the old charts his own course by applying philosophical and practical truths with scientific precision. In his quest for answers, he combines all of the disparate parts of himself together to create a whole individual, armed to do battle in the modern age.Warrior’s Song is the first novel by author Thomas M. Hill. An avid student of philosophy, history, politics, and social science, he blends all of these subjects together in a thought-provoking and at times satirical inquiry into the roots of modern American identity. reincarnation fiction, past life regression fiction, philosophy fiction, september 11 fiction, native american spirituality fiction, christianity and liberalism, university of virginia books, ayn rand atlas shrugged",
  "genres": [],
  "author": "Thomas M. Hill",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/11276036-warrior-s-song"
}