{
  "title": "Slewfoot: A Fábula das Bruxas",
  "description": "Uma fábula de magia e mistério, triunfo e terrorConnecticut, 1666. No Novo Mundo, o puritanismo cristão encontrou um terreno fértil para prosperar e crescer. Como quase tudo era considerado pecado, a vida em uma comunidade puritana podia ser bastante difícil, especialmente para as mulheres.Abitha, uma jovem inglesa recém-chegada na puritana Sutton, encontra preconceito na comunidade local. Com língua afiada e personalidade audaz, é vista como uma forasteira. Com seus amuletos e poções, remédios que sua mãe usava na Inglaterra, ela logo desperta a desconfiança dos moradores.Quando um espírito antigo desperta em um bosque sombrio, o povo nativo o chama de pai e protetor. Os colonos, porém, o chamam de Slewfoot, demônio. Para Abitha, recém-viúva, vulnerável e excluída do convívio social, ele é a única pessoa a quem ela pode pedir ajuda. Juntos, iniciam uma batalha entre pagãos e puritanos — uma peleja que ameaça destruir toda a aldeia.Ambientado na Nova Inglaterra colonial, Slewfoot: A Fábula das Bruxas é uma fábula de magia e mistério, de triunfo e terror, como só a imaginação sombria de Brom poderia criar. Autor de Krampus, fábula dark sobre a criatura ligada ao Natal, Brom se volta agora para Salem, fonte inesgotável para abordar a obsessão persecutória das acusações de bruxaria e o reacionarismo fanático que condenou tantas mulheres.No coração desta história aterrorizante, pulsa um dilema crucial: o que pode ser pior? O demônio da floresta ou o terror provocado pelos rumores, acusações e mentiras de uma aldeia puritana? Na encruzilhada entre vitimização e vingança, Abitha é obrigada a fazer suas escolhas e o que se segue vai transformar a vida de todos para sempre.Assim como em Krampus, Brom mais uma vez nos presenteia em Slewfoot com pinturas coloridas assombrosas, que conduzem os leitores para dentro deste mundo selvagem e implacável, uma arte perfeita para todos que se encantaram com A Bruxa e a graphic novel Salem (DarkSide® Books, 2023), de Thomas Gilbert. Transitando entre o medo e a celebração, Brom tece um terror histórico repleto de fantasia dark, bruxaria e vingança. Uma história que tem tudo para deixar os leitores visceralmente perturbados.Brom é um multiartista que emprestou sua visão distinta a todas as facetas das indústrias criativas, entre romances, games, quadrinhos e filmes. Ele é o autor de The Child Thief e dos premiados romances ilustrados, Krampus (DarkSide® Books, 2022), The Plucker, The Devil's Rose e Slewfoot. Brom atualmente é mantido em um porão úmido em algum lugar nos arredores de Seattle.",
  "genres": [
    "Horror",
    "Fantasy",
    "Historical Fiction",
    "Fiction",
    "Witches",
    "Historical",
    "Audiobook"
  ],
  "author": "Brom",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/219549269-slewfoot"
}