{
  "title": "Cross Fire",
  "description": "Alaine Landy is on a runaway train and the tracks are running out.  When she saw Alejandro Rojas in the gas station seventy-six days before her wedding, Ali Landy never thought that she'd fall back in his arms as if ten years of separation never happened. Then he pushed her away again and Ali finds her world shattered and herself struggling to pick up the pieces.   Alejandro Rojas wants to believe that he did the right thing.  Love and the unyielding Texan aristocracy drove them apart ten years ago. Ten years later, the same forces drives them apart once again. Alejandro tells himself that he had no choice, that it was the best thing for both of them to live in their respective worlds. Yet he can't shake the feeling that he did something wrong, something unforgivable, something that he could never live with.   Though things seem to have calmed down, both of them are familiar with the calm before the storm...  As both Ali and Alejandro do their best to get on with their own lives, they'll find that fate has a way of twisting them together. No matter how much Alejandro tries to keep Ali away from the dangerous world he and the rest of the Padre Knights MC lives in, forces beyond his control seem to do everything they can to drag her back in. When all out war breaks out between the Padre Knights and the rival clubs, it's only a matter of time before their love is caught in the cross-fire.  EXCERPT  She let the cloth fall away, and traced the planes of his body with just her hands. Everything had been so frantic, so urgent with him, she’d never taken the time to get reacquainted with his body. As a girl, she hadn’t really known better, and now, he’d hardened over the time they spent apart. The softness he’d still had in his late teens had melted away, replaced with firm lines, solid muscle, and a man’s confidence.  “You still like what you see?” he asked after a little while.  She looked up into his eyes, and saw so much contained within them. Love and lust, but darkness, heat, and a certain surety that he would do whatever was necessary to come out on top. To protect those he cared about. That was why he’d pushed her away before, and why he’d come back to her.  “Can you stay the night?” she asked.  He paused for a little while, something quiet settling over his features before he smiled. “If you want me to, baby.”  She leaned up into him, pressing her lips to his in answer.",
  "genres": [],
  "author": "Evelyn Glass",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/21964886-cross-fire"
}