{
  "title": "That Summer Night",
  "description": "From #1 NY Times Bestselling Author Barbara Freethy comes the sixth book in the Callaway family series featuring love, mystery, and adventure!Once Reid Becker was the best of the best, an elite soldier whose career ended abruptly in a mission gone awry. Derailed after a decade of intense focus, Reid is spending far too much time in his best friend's bar. Then Shayla Callaway walks into his life with a desperate plea for help. How can he resist a beautiful blonde? The last thing Shayla Callaway was looking for was trouble. After years of medical school, she is months away from finishing her residency when a stint with a research team lands her in the middle of a game of drugs and money, and the only person who can help her is a burned out ex-soldier with a hot body and a cocky attitude. Reid and Shayla have always put duty and career first. But as the danger heats up, so do the summer nights. Suddenly, it's not just about saving the world but about saving each other and a love they never expected … ALSO AVAILABLE IN THE CALLAWAY SERIESOn A Night Like This (#1)So This Is Love (#2)Falling For A Stranger (#3)Between Now And Forever (#4)Nobody But You (A Callaway Wedding Novella)All A Heart Needs (#5) PRAISE FOR THE CALLAWAYS: ON A NIGHT LIKE THIS (Callaways #1) \"I loved Aiden and Sara’s story! Barbara manages to write so effortlessly, blending their stories together, so we learn where they have come from to get where they are now. Barbara manages to give us a good glimpse of the rest of the family too, without taking away from Aiden and Sara’s story, leaving us with a little bit of mystery to be followed up on.\" Harlequin Junkies Blog SO THIS IS LOVE (Callaways #2) \"Barbara manages to weave a perfect romance filled with laughter, love, a lot of heat, and just the right amount of suspense.\" Harlequin Junkies Blog \"SO THIS IS LOVE is a multi-layered story rich with family secrets and possible suspects as the city arsonist and murderer. SO THIS IS LOVE is a blend of mystery and romance that makes for a satisfying read.\" Indie Reader FALLING FOR A STRANGER (Callaways #3) \"Barbara Freethy knows how to tell a fantastic story and this one is no exception. If you’re looking for a great feel good read with a bit of action and mystery, this book is for you!\" The Book Momster Blog BETWEEN NOW AND FOREVER (Callaways #4) \"A beautifully written story, fans of Barbara’s Angel’s Bay series will be happy to know the search leads them to Angel’s Bay where we get to check in with some old friends...fans of Barbara will not be disappointed with this story.\" The Book Momster Blog",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Romantic Suspense",
    "Contemporary",
    "Chick Lit",
    "Fiction",
    "Suspense"
  ],
  "author": "Barbara Freethy",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/21963992-that-summer-night"
}