{
  "title": "Mr. Yummy Chocolate",
  "description": "Title: Mr. Yummy Chocolate (Season One: Episodes 1-10)Genre: Friends With Benefits Romance SerialLocation: New YorkRunning Time: 4 Romance Novellas approx. 30K words each*Please note that this story is a romance serial that unfolds over the course of four novellas.Warning: this is an adult romance with sex and strong language intended for mature audiences 18+ If You Like Contemporary Romance With An Extra Splash Of Drama, Then You'll Love Mr. Yummy Chocolate!Starring:Veronica Strum, a sassy lingerie boutique owner slowly dipping her toe back into the dating poolTy Clayton, an irresistibly charming PR exec looking for his next sexual conquestThere’s always some article, blog post, video or TV show trying to “teach” women these how-to-land-a-good-man rules. Please. They are more like how-to-lower-your-standards-to-get-a-man-that-will-be-intimidated-by-your-success-and-eventually-leave-you-because-he’s-insecure rules. Well at least that’s Veronica’s story. But she doesn’t need any help with rules. She has her own rules: No expectations. No commitments. No drama. For two years now she’s managed to follow those rules with no issues because she doesn’t date. Or have sex. Then she meets Ty Clayton. A man that puts the T in trouble. Trouble wrapped in delicious well-sculpted chocolate. Just the sight of him ignites a lust inside of her that she hasn't felt in a very long time. Her Plan: A one night stand. Something to take the edge off and possibly hold her over for another two years or until she’s ready to date again. Whichever comes first.For years Ty has kept women at a distance not thinking too much about settling down. Especially with all the eye candy in New York to feast on. Relationships are messy. He prefers jump-offs. Friends with benefits. Whatever choice of words you want to use. He has simple rules to living his no strings attached lifestyle: Never fall in love with a jump-off No unprotected sex Never make them a priority when they are an option Never let them spend the night Never, ever give them a key to his apartment. Now he’s in search of a new side chick. Someone consistent but with no strings attached. And Veronica Strum may just be what he’s looking for. She’s a beautiful brown goddess with a slim waist and rounded hips that he can’t wait to get his hands on. If he could package up her beauty and sell it by the bottle he would be a wealthy man. His plan: Give her something she can’t resist then she’ll be putty in his hands. Another chick on his carousel.Join Veronica and Ty on this roller-coaster ride of emotions as they learn that sometimes plans have a tendency to change.",
  "genres": [],
  "author": "Yolanda Allen",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/21963795-mr-yummy-chocolate"
}