{
  "title": "L'épreuve d'admission",
  "description": "David a toujours rêvé de devenir un maître de la Communauté des planètes (C.P.), un soldat de la paix, qui ira porter assistance aux populations en détresse sur toutes les planètes de la Communauté et même sur des planètes en révoltes contre elle. Mais, pour cela, il doit être admis à Éden, collège terrien de la C.P. et réussir la redoutable épreuve d'admission.Le maître et guide que David choisit et qui supervisera son apprentissage à Éden, s'il réussit son épreuve d'admission, se nomme Greg Arsh. À demi Terrien à demi Darumien, maître Arsh est aussi télépathe. On dit de lui qu'il est l'un des maîtres les plus exigeants de tous ceux des différents collèges de la C.P. sur les planètes qui en font partie.Quand maître Arsh promet au groupe de postulants de David de tout faire pour leur faire échouer l'épreuve d'admission, David craint de ne pas pouvoir la réussir. Ce livre relate cette épreuve, telle que la vit David.-----------------------------------------------------------NOTE SUR LA COMMUNAUTÉ DES PLANÈTES : Elle est une puissante collectivité née de la fusion d’organismes humanitaires et d’organisations de sécurité interplanétaire, mais aussi de groupements sociaux, économiques et culturels de nombreuses planètes. Elle dispose sur ces planètes de vastes territoires où elle a acquis le statut d’autorité souveraine. Sa mission est de même nature que celle des organismes fondateurs. On la verra, par exemple, porter assistance aux populations lors de cataclysmes, famines, pandémies et guerres, lutter contre l’oppression, soutenir les gouvernements et souvent même des associations indépendantes dans la réalisation de divers projets d’importance (alphabétisation de vastes populations, exploration de nouvelles planètes, etc.) et, bien sûr, former dans des collèges comme Éden jeunes et moins jeunes pour la réalisation de toutes ces tâches.",
  "genres": [],
  "author": "Danielle Tremblay",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/21957050-l-preuve-d-admission"
}