{
  "title": "What Is My Legacy?: Realizing a New Dream of Connection, Love and Fulfillment",
  "description": "To heal a world in crisis, we must rethink “legacy”—and commit to something bigger than ourselves.From the time he was born, Martin Luther King III has carried the weight of his father’s legacy—and his dream of a Beloved Community built on justice, love and equal rights for all. Today, in a world burdened by histories of violence, oppression, racism, poverty, fear and disconnectedness, that dream seems more remote than ever.In answer to these challenges, Martin has teamed up with his wife and fellow activist, Arndrea Waters King, and legacy architects Marc Kielburger and Craig Kielburger to find a new way forward. Drawing on breakthroughs in neuroscience, psychology, epigenetics, and their own lived experiences, they have created a groundbreaking new framework called Living Legacy. It’s based on the simple but profound recognition that our small, day-to-day actions create legacies that have the power to transform, uplift, and unite us all. It’s time to reevaluate, recognize, and reclaim those legacies. Living Legacy invites us to live our best lives and lives larger than ourselves—and in doing so, discover the most sought-after yet elusive state of fulfillment.In conjunction with the Realize the Dream campaign, What Is My Legacy? kicks off an essential conversation on how to best refocus our individual stories to achieve collective change. Featuring never-been-told stories from the King family and contributions from celebrities and thought leaders—including His Holiness the Dalai Lama, Jay Shetty, Julia Roberts, Yara Shahidi, Rev. Al Sharpton and Sanjay Gupta—it’s an extraordinary road map for finding genuine connection, bringing us closer to Dr. King’s dream of a Beloved Community.",
  "genres": [
    "Social Justice",
    "Leadership"
  ],
  "author": "Martin Luther King III",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/219637133-what-is-my-legacy"
}