{
  "title": "The Genesis Project Prophecy of the Seven",
  "description": "THE GENESIS PROJECT PROPHECY OF THE SEVENSynopsis for The Genesis Project “A group of seven will champion those in need. They will be the new beginning, and the end to war, without them, all will be lost. To the one who is above all, none are more important than her. She who is born under the full moon and who has been kissed by fire, she who has no beginning and has no end, she who wields five will lead the Seven. She who is marked with the seven stars upon her skin. Without the one, the six will fail. The world would fail and all will have been for naught.” –Excerpt from The Genesis Project  What would you do if you had the power to save humanity from the face of dark and the seemingly sealed fate of ultimate death? Would you gather the courage to stand up and fight, or would you break down, buckling under the pressure of almost certain death? Reighlyn D’Crey lived a normal teenage existence until her eighteenth birthday – then everything she knew crumbled to ash around her. It was a time that should have been filled with joy, but quickly turned into the fight of her life, the fight for her life and the fight for all of mankind. Reighlyn is different than other teenage girls. Gifted. She possesses rare talents that most people couldn’t even dream of. She kept them a secret all her life, until the day of her eighteenth birthday. Reighlyn’s mother received a letter from Reighlyn’s father – a man long though to have been dead. The letter details a horrible truth: The world as they knew it would cease to exist if a group of powerful terrorists called The Militia, had their way. The Militia were planning a takeover extraordinaire. Their main focus was to capture all of the gifted from the earth. Reighlyn and her mother, Rowan, were left with little choice; they had to run. Escape was their only option and they fled to the one place where Reighlyn’s father said they would always be safe: The Sonora Caves. After an intense run-in with the Militia, sparks fly between Reighlyn and a dark and mysterious man with strange but alluring eyes. He does the unthinkable: Before letting Reighlyn, Rowan and her friend Blaine leave without reproach, the man promises to find Reighlyn again. Who is this strange but undeniably sexy man? Reighlyn’s entire existence is redefined once again in Sonora where she learns she is the leader of a prophesied group, who have waited patiently for her to find her way; to lead them all in more ways than one. The prophecy reads, “A group of seven will champion those in need. They will be the new beginning, and the end to war, without them, all will be lost. To the one who is above all, none are more important than her. She who is born under the full moon and who has been kissed by fire, she who has no beginning and has no end, she who wields five will lead the Seven. She who is marked with the seven stars upon her skin. Without the one, the six will fail. The world would fail and all will have been for naught.” Reighlyn must learn to come into her own as a woman as she learns to fight, lead and love with a fire emblazoned heart. Balancing love, the heavy weight of being a prophesized leader and learning to move forward in a strange new world can be quite a load for any girl to bear. As the war rages on, can the Seven defeat the evil Militia with Reighlyn at the helm? The Militia, who so efficiently and effectively destroyed modern civilization with their careless tactics, will not go down without a fight. Let’s hope the Seven area not too late. ~ Set for publication May of 2014 ~(C) 2014 C.L. De LeonAll Rights Reserved",
  "genres": [],
  "author": "C. Lynn De Leon",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/21964665-the-genesis-project-prophecy-of-the-seven"
}