{
  "title": "Integrating the Shattered Self: Psychotherapy With Adult Incest Survivors",
  "description": "Integrating the Shattered Self offers therapists who are treating adult incest survivors a detailed guide to treatment and the course of recovery. It provides treatment strategies, outline phases of the work, and describes characteristic client responses. This book offers the clinician an understanding of incest through the eyes of the child victim, the adult client, and the recovered survivor.Therapy for incest survivors differs from other psychotherapy because these clients bring a unique set of defenses, strengths and needs. Roth helps the therapist to understand these features and to respect the individual client's style of coping. The book details the levels of understanding and intervention the therapist needs to provide.Roth conceptualizes the therapy into four distinct phases and goals. She observes that clients first move through validation, then develop a new world view, go on to emotional flooding, and, finally, reach new hope and termination. With each phase, she describes in detail the client's experiences and appropriate therapeutic responses. The many examples illustrating effective insights and treatment strategies will spark the reader to be creative and expansive in his or her own work with these clients.Such difficult issues as current family relationships for the client, both with her family of origin and her adult partner, are covered. Specific examples illustrate how therapists can guide survivors toward healthy and powerful relationships with their fathers, stepfathers, mothers, siblings, and partners. Vital matters such as confrontation and forgiveness are discussed in detail.Incest treatment can easily overwhelm a clinician. The therapy is complicated and the emotionality is intense. Treatment relies heavily on the confidence, comfort, and good boundaries of the therapist. If the therapist approaches incest therapy with a personal agenda, there is an underlying bias that will influence the client's direction.This book offers a respectful and hopeful picture of these courageous survivors. With the proper therapeutic understanding, full recovery can be achieved. It is an intensive, long-term experience for the client and the therapist with bountiful rewards for both.",
  "genres": [
    "Psychology"
  ],
  "author": "Nicki Roth",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/2196166.Integrating_the_Shattered_Self"
}