{
  "title": "Perfect Collision",
  "description": "Brian 'Bear' Warren, the Vice President of the Marauder Riders MC, is a typical biker. He likes beer, women, and bikes. His only soft spot is his youngest daughter, Violet. She's a shy, careful, and insecure girl, who generally did her very best to be noticed as little as possible. Bear always did his best to protect her, especially from her own mom, but did an almost too good job at it. Because by the time she turns eighteen, she's still a shy, careful, insecure, and slightly naïve girl. No one could've guessed she'd grown up in a biker club. He knew Vi'd had a crush on Mac Baxter since her early teens, but around her eighteenth birthday, Mac starts to take notice of Vi as well. As far as Bear was concerned, Mac might be good guy, a fellow member of the Marauder Riders MC, his best friend's son, and someone Bear'd known since the day he was born—but he still didn't like the thought of his Vi with a six years older biker. Not at all. At the same time, he knew he had to accept that his daughter was growing up. In the choice between Vi with Mac, or Vi with some other guy, Mac might be the better option. There wasn't much Violet Warren considered easy in life.Even just talking to people was a challenge, because she tended to stutter and blush whenever she opened her mouth. On the other hand, she didn't like all that many people. Her dad was one of few people she loved, simply because he understood her. Or at least tried to understand her, as opposed to her mom. Then there was Mac... She couldn't really say she knew Mac, but he'd been around her entire life, since he was the son of the club’s President. She liked him. He was the one who suggested she could become a tattoo artist, an idea she loved, since drawing was one of few things she considered herself good at. Her dad helped her to get a spot as an apprentice at Wicked Ink. That's when things started to look up, and she owed it to Mac. She wasn't sure how to thank him properly until he asked her to do a tattoo on him. It sort of went downhill from there. Marcus 'Mac' Baxter couldn't really say he knew Vi.She was just the tiny, shy girl who'd always had a sketchbook in her lap. He knew she'd been crushing on him when she was a kid, but he'd never thought much about it. She was simply one of the younger club kids, and not one of those you took notice of. When he decided to become a Marauder, he left Greenville, Arizona, to join the Emporia, Kansas charter instead. He wanted to make a name for himself and not just be 'Brick's son.' A few years later he transferred back, and realized Vi had grown up while he was away. But you didn’t take advantage of a girl who’d been crushing on you for years, a girl who was the daughter of a fellow member. You just didn’t. And you definitely didn’t kiss her. That was insane...But that’s what he did. Please note: though Perfect Collision occurs in the same world as Arrow of Time, this story is a standalone. Warning: explicit sex, not for younger readers.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "New Adult",
    "Contemporary",
    "Friends To Lovers",
    "Motorcycle",
    "Erotic Romance"
  ],
  "author": "Lina Andersson",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/21964178-perfect-collision"
}