{
  "title": "Thirteen Days in September: Carter, Begin, and Sadat at Camp David",
  "description": "ONE OF THE NEW YORK TIMES BOOK REVIEW’ S 10 BEST BOOKS OF THE YEARA gripping day-by-day account of the 1978 Camp David conference, when President Jimmy Carter persuaded Israeli prime minister Menachem Begin and Egyptian president Anwar Sadat to sign the first peace treaty in the modern Middle East, one which endures to this day.With his hallmark insight into the forces at play in the Middle East and his acclaimed journalistic skill, Lawrence Wright takes us through each of the thirteen days of the Camp David conference, illuminating the issues that have made the problems of the region so intractable, as well as exploring the scriptural narratives that continue to frame the conflict. In addition to his in-depth accounts of the lives of the three leaders, Wright draws vivid portraits of other fiery personalities who were present at Camp David––including Moshe Dayan, Osama el-Baz, and Zbigniew Brzezinski––as they work furiously behind the scenes. Wright also explores the significant role played by Rosalynn Carter.What emerges is a riveting view of the making of this unexpected and so far unprecedented peace. Wright exhibits the full extent of Carter’s persistence in pushing an agreement forward, the extraordinary way in which the participants at the conference—many of them lifelong enemies—attained it, and the profound difficulties inherent in the process and its outcome, not the least of which has been the still unsettled struggle between the Israelis and the Palestinians.In Thirteen Days in September , Wright gives us a resonant work of history and reportage that provides both a timely revisiting of this important diplomatic triumph and an inside look at how peace is made.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Israel",
    "Egypt",
    "Biography",
    "Audiobook"
  ],
  "author": "Lawrence Wright",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/21965079-thirteen-days-in-september"
}