{
  "title": "The Shadow at the Bottom of the World",
  "description": "A longtime Lovecraft devotee, who has extended the weird tale to the next level via the likes of Borges and Burroughs, Thomas Ligotti is usually published as part of a general anthology of horror writers. But now Ligotti has pulled together a collection of his favorite fiction, both old and new, representing his best and most characteristic works. Thomas Ligotti's stories are perhaps best described as dark magical realism. Many of his stories center on the distorted perspective of a frequently doomed narrator. The title story, \"The Shadow at the Bottom of the World,\" reimagines a kind of Bradbury-like small town that encounters the appearance of a kind of existential darkness, written with a sharp imagery like that of William S. Burroughs. In story after story in this collection, Ligotti does not merely present his readers with isolated incidents of supernatural horror - he challenges them to confront nightmares that are entwined in the very fabric of life itself. \"The best new American writer of weird fiction to appear in years\" - The Washington Post \"Ligotti is wonderfully original; he has a new vision of a dark and special kind, a vision that no one had before him.\" - Interzone \"Aficianados of the macabre consider Ligotti one of the finest writers in the field\" - The Sunday Times \"Thomas Ligotti is an absolute master of supernatural horror and weird fiction, and a true original. He pursues his unique vision with admirable honesty and rigorousness and conveys it in prose as powerfully evocative as any writer in the field. I'd say he might just be a genius.\" - Ramsey Campbell (\"Britain's most respected living horror writer,\" according to the Oxford Companion to English Literature)",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Lovecraftian",
    "Weird Fiction",
    "Fantasy",
    "Collections"
  ],
  "author": "Thomas Ligotti",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/219596.The_Shadow_at_the_Bottom_of_the_World"
}