{
  "title": "The Drop Edge of Yonder",
  "description": "Time Out New York 's #1 Best Book of 2008. \"[A] funny, inquisitive novel [that] asks readers to re-examine their ideas of the Western frontier and personal freedom.\" —Jeffrey Trachtenberg, Wall Street Journal \"May be the most hallucinogenic western you'll ever catch in the movie house of your mind's eye.\" —Erik Davis, Bookforum \"A picaresque American Book of the Dead ... in the tradition of Thomas Pynchon, Joseph Heller, Kurt Vonnegut and Terry Southern.\" —David Ulin, Los Angeles Times Book Review \"Should be as well known as anything by Cormac McCarthy, Steve Erickson, or Jim Harrison.\" —Paul DiFilippo, Barnes & Noble Review “Rudolph Wurlitzer takes no prisoners. An uncompromising, wild, and woolly tale.”—Sam Shepard “Sam Beckett with a six-gun and a sack of rattlesnakes.”—Gary Indiana \"Where has Rudy Wurlitzer been for the last fifteen years? The mental traveler who gave us Nog and the Two-Lane Blacktop screenplay takes another vision quest, this time into the Old American West. His mapping of mythic and sacred landscapes and his ability to distinguish between different tribal world-views makes this a truly revealing conversation.\"—KCRW's Bookworm In his fifth novel, Rudolph Wurlitzer has written a classic tale of the Western frontier and created one of his most memorable characters in Zebulon, a mountain man whose view of life has been challenged by a curse from a mysterious Native American woman whose lover he inadvertently murdered. The Drop Edge of Yonder begins in the mountains of Colorado and ends in the far reaches of the Northwest, a journey that includes the beginnings of a Mexican revolution, a voyage across the Gulf of Mexico to Panama, and up the coast of California to San Francisco and the gold fields. Along the trail, Zebulon becomes involved in a series of tragic love triangles, witnesses the death of his mother and father, and confronts the age-old questions of life, love, and death. Rudolph Wurlitzer is the author of the novels Nog , Flats , Quake , and Slow Fade , and the nonfiction book, Hard Travel to Sacred Places . Among his twelve produced screenplays are Pat Garrett and Billy the Kid , Two Lane Blacktop , Voyager , Walker , and Little Buddha .",
  "genres": [
    "Fiction",
    "Westerns",
    "Literature",
    "Novels",
    "Historical Fiction",
    "The United States Of America",
    "American"
  ],
  "author": "Rudolph Wurlitzer",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/2196117.The_Drop_Edge_of_Yonder"
}