{
  "title": "Losing the Hate",
  "description": "A REVIEW FROM UNDERGROUND BOOKS Not until Simon Palmer is 41 years old does he decide to tell the world of the dark secrets that moulded his life. When he was 10, a trusted and respected teacher asked Simon's parents if he could photograph their son for pictures that would be displayed at a upcoming parent-teacher's night. The private photo shoot, however, turns dark when Simon obeys the male teacher and removes his clothing. Simon tells no one of his shameful secret that continues not only with the teacher, but leads to other inappropriate sexual encounters. The abuse is carried forward when Mr. Palmer physically and mentally abuses his wife and anyone else who tries to care about him. A life of self-loathing, fear to trust anyone, hatred for those who abused him, Simon Palmer's life continues to catapult until he finds himself inside the dark isolated world of hardcore drugs and alcohol. chose to review the gut-level, emotional trauma that made Simon Palmer's book haunt me. If only to read the poignant meaningful poetry that weaves in and out of Losing the Hate, the book is well worth the experience. Simon Palmer's words will `rock' every parent's world as they begin to question if their own children have secrets too dark, too shameful to share. There were times I questioned why Mr. Palmer's parents didn't realize something evil was happening to their son as they watched Simon's personality quickly change from compliant to hateful; content to angry. In all fairness, however, as parents we are told that our children will go through stages and they will eventually grow out of it. For Simon Palmer, however, it took 30 years to confront his demons. Through prose and memoir, Mr. Palmer relays that sometimes there are `secrets' so dark, so evil, they will only lead to despair and isolation. One of Simon's Many Silence raining down, Lost within my thoughts, Self destruction all around. Lost in a bed-sit, Demons flooding back, Enfolded by a darkness, Shadows cold and black. Crying in a bed-sit, Ashamed of what I've done, A hatred for myself, And all that I've become. Recommended for parents and teenagers or those who have experienced the trauma of abuse. Although raw and riveting, the sexual content is not graphic or explicit. I would, however, suggest a parent read the book before suggesting it to their teenagers. My personal thoughts are that anything that encourages our youth to share what is going on in their lives is significant.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Simon Palmer",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/11276634-losing-the-hate"
}