{
  "title": "Silver Bells Collection",
  "description": "Six Award-Winning Authors have contributed new stories to A Timeless Romance Silver Bells. Readers will love this collection of six historical romance novellas, all centered around the Christmas season.  In NY Times & USA Today’s bestselling author Lucinda Brant’s delightful novella, FAIRY CHRISTMAS, Kitty Aldershot is orphaned and forced to live on others’ charity. Offered a home under the generous roof of her relatives, the Earl of Salt Hendon and his countess, Kitty wants for nothing, not even the affections of Mr. Tom Allenby. But when Kitty stumbles across a letter written by Lady Caroline that reveals how Mr. Allenby would be ruined should he marry the likes of Kitty, she realizes she has been fooling herself all along. Kitty’s world crumbles around her as she recognizes she will forever be alone with no prospects at all.  Sarah M. Eden’s charming romance novella A CHRISTMAS PROMISE, Sean Kirkpatrick is trying to get to his new place of employment, Kilkenny Castle, in order to start as the new stable-hand. His only requirement is to drive a team of high-spirited nags from Dublin to Kilkenny in a certain amount of time. Unfortunately he winds up in a muddy field, stuck, lost, and running out of time. He’s about to lose the job before he can prove himself capable of finishing his first assignment. When Maeve Butler arrives on the scene, Sean isn’t sure if she’s intent on rescuing him or bent on torturing him with her fiery wit and lovely dark eyes.  In Heather B. Moore’s enchanting novella, TWELVE MONTHS, Lucien Baxter’s best and most incorrigible friend, Will, dies unexpectedly, leaving behind his new bride and unborn child the week before Christmas. Will’s last request is that Lucien watches over Cora, not just as a benefactor, but as a husband. When Lucien does his duty and proposes to Cora, he’s turned down flat. But over the course of the next few days, Lucien discovers that marrying Cora wouldn’t be any sort of duty after all, but a matter of following his heart.  In Lu Ann Staheli’s sweet romance novella, A FEZZIWIG CHRISTMAS, Dick Wilkins and his best friend Ebenezer Scrooge have been looking forward to the annual Fezziwig Christmas dance for weeks. Ebenezer is practically engaged to Annabelle Fezziwig, and Dick hopes to start courting her younger sister, Pricilla. Once the dance starts, and Pricilla arrives, as pretty and charming as ever, Dick discovers that he’s not the only man vying for her attention. His best friend advises Dick that he has to win Pricilla’s heart, as well as her mother’s favor. Losing his heart has suddenly become very complicated.  A TASTE OF HOME, a captivating romance by Annette Lyon, we meet Claire Jennings, who’s on her way to spend Christmas with her family. As she rides the train with William Rhodes, who grew up across the street, memories of Christmases past flood her mind. He may be twenty-one now, but she can’t forget his torturous teasing from their school years. At the rail station, Claire discovers that her home is under quarantine because her little brother has measles. She's stuck in town, away from her family, on her favorite holiday. William stays behind with her, and as Christmas Day approaches and her homesickness deepens, she discovers that perhaps he has changed in more ways than one.  Becca Wilhite’s entrancing novella, MY MODERN GIRL, follows Margie, who lands her dream job as a clerk at Macy’s department store in New York City. Margie might be new in town, but she’s determined to succeed and prove to Henry that moving to the city was the right decision.",
  "genres": [
    "Romance",
    "Christmas",
    "Historical Fiction",
    "Novella",
    "Historical",
    "Anthologies",
    "Clean Romance"
  ],
  "author": "Lucinda Brant",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/21973314-silver-bells-collection"
}