{
  "title": "Horror 101: The Way Forward",
  "description": "Horror 101: The Way Forward – a comprehensive overview of the Horror fiction genre and career opportunities available to established and aspiring authors.Have you ever wanted to be a horror writer? Perhaps you have already realized that dream and you’re looking to expand your repertoire. Writing comic books sounds nice, right? Or how about screenplays?That’s what Horror 101: The Way Forward is all about. It’s not your average On Writing guide that covers active vs. passive and other writing tips, Horror 101 focuses on the career of a horror writer. It covers not only insights into the horror genre, but the people who successfully make a living from it. Covering aspects such as movies, comics, short stories, ghost-writing, audiobooks, editing, publishing, self-publishing, blogging, writer’s block, YA horror, reviewing, dark poetry, networking, collaborations, eBooks, podcasts, conventions, series, formatting, web serials, artwork, social media, agents, and career advice from seasoned professionals and up-and-coming talents, Horror 101 is just what you need to kick your career into high gear.Horror 101: The Way Forward is not your average On Writing guide, as it is more focused on the career options available to authors. But don’t fret, this book is loaded with career tips and behind-the-scene stories on how your favourite authors broke into their respective fields.Horror 101: The Way Forward is perfect for people who:•\tare suffering from writer’s block•\tare starting their writing careers•\tare looking to expand their writing repertoire•\tare planning on infiltrating a different field in horror writing•\tare looking to pay more bills with their art•\tare trying to further their careers•\tare trying to establish a name brand•\tare looking to get published•\tare planning on self-publishing•\twant to learn more about the pros in the horror genre•\tare looking for motivation and/or inspiration•\tlove the horror genre•\tare not sure where to take their writing careersIncludes articles by Jack Ketchum, Graham Masterton, Edward Lee, Lucy A. Snyder, Emma Audsley, RJ Cavender, Scott Nicholson, Weston Ochse, Taylor Grant, Paul Kane, Lisa Morton, Shane McKenzie, Dean M. Drinkel, Simon Marshall-Jones, Robert W. Walker, Don D’Auria, Glenn Rolfe, Harry Shannon, Chet Williamson, Lawrence Santoro, Thomas Smith, Blaze McRob, Rocky Wood, Ellen Datlow, Iain Rob Wright, Kenneth W. Cain, Daniel I. Russell, Michael McCarty, Richard Thomas, Joan De La Haye, Michael Wilson, Francois Bloemhof, C.E.L. Welsh, Jasper Bark, Niall Parkinson, Armand Rosamilia, Tonia Brown, Ramsey Campbell, Tim Waggoner, Gary McMahon, V.H. Leslie, Eric S Brown, William Meikle, John Kenny, Gary Fry, Diane Parkin, Jim Mcleod, Siobhan McKinney, Rick Carufel, Ben Eads, Theresa Derwin, Rena Mason, Steve Rasnic Tem, Michael A. Arnzen, Joe Mynhardt, John Palisano, Mark West, Steven Savile, and a writer so famous he’s required to stay anonymous.",
  "genres": [
    "Horror",
    "Writing",
    "Nonfiction",
    "Essays",
    "Speculative Fiction",
    "Anthologies",
    "Reference"
  ],
  "author": "Joe Mynhardt",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/21972119-horror-101"
}