{
  "title": "Naked: Stripped by a Man and Hurricane Katrina",
  "description": "\"Everything moved to the wind's rhythm.\"  In one week, a house and marriage violently disintegrate. Alone raising an infant in the aftermath of Hurricane Katrina, Julie is surrounded by the rubble of her life - stripped bare by love and loss. Suddenly a single mother, Freed's prose captures the love and adoration for her daughter, the indomitable spirit of her New England family, and her father's unwavering devotion. Touching ties survive even the most powerful surge Mother Nature delivers. This debut memoir candidly reveals intimate details of one woman's shattered dreams as well as humanity's power, resilience, and goodness. Unflinchingly honest, Naked is a remarkable true story of hope, family, and love in a southern coastal Mississippi town.\"Accolades to memoirist Julie Freed - this stunningly poignant book candidly reveals intitmate details of her life with clarity but not a whiff of \"poor, pitiful me.\" In facing the end of her marriage and the end of life as she had known it on Mississippi's Gulf Coast, Freed exhibited the strength other Mississippians also showed in response to this country's worst natural disaster. She persevered - and she wrote a damn good book.\" ~ Nancy Kay Wessman author of Katrina, Mississippi: Voices from Ground Zero\"Occasionally, real-life setbacks smash into authors' lives with the degree of intensity usually found in fiction. Julie Freed's memoir recounts just such an extreme situation ... The strengths Julie Freed draws on in her life are generously passed along to her readers, reminding us that just past the darkness, there is dawn.\" ~ Jerry Waxler, author of Memoir Revolution \"A heart-wrenching true story told with dignity.\" ~ Victoria Twead, New York Times and Wall Street Journal bestselling author of the Old Fools Series.\"It is a rare talent that can make you feel the emotions portrayed in words and Freed accomplished this. Showing that true strength and power can derive from the lowest of places. NAKED is one memoir that I am glad I read. Favorite line: 'My lungs filled with fresh new air brought from deep in the Gulf. The salty wind spun and twisted my clothes about my body as I pleaded to Katrina. I hoped she was showing me the way. I was crushed, but free. I inhaled a cleansing breath. I would survive. I must survive.'\" ~ 125 Pages Book Review\"Her intention is to show how close we all are, at any moment in time, to unexpected, monumental and life altering change. An intelligent and engaging memoir.\" ~ Book Viral\"Masterful!\" ~ Cinda Brooks, author of bestselling Heartprints of Africa, A Family's Story of Faith, Love, Adventure, and Turmoil.\"An honest, courageous, eye-opening and brilliantly written testament to a harrowing and life-changing period of her life.\" ~ George Mahood, author of Free Country, Every Day is Holiday, and Life's a Beach",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography"
  ],
  "author": "Julie Freed",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/21966909-naked"
}