{
  "title": "Enter at Your Own Risk: The End Is the Beginning",
  "description": "Human beings—the undisputed top of the food chain, the long-standing masters of planet earth. Or are we? What may be crawling out of the sludge to take our place? What monsters have we created in our labs, factories, and our very own genetic code? In the fourth installment of Firbolg Publishing’s Enter at Your Own Risk series, which pairs Gothic masters such as Edgar Allan Poe, Mary Shelley, and H.P. Lovecraft with modern authors of the dark and macabre, the theme is environmental horror. As mankind’s tsunami wave of progress, industrialization, and technology reaches spectacular new heights, sinister things are churning beneath the surface. An unfamiliar stench on the wind. Waters a bit too murky. Soil a bit too red with blood. Progress at a price. A terrible, terrible price. Will we survive? What strange new worlds will emerge from the chaos? With an introduction from Holly Newstein, Enter at Your Own Risk: The End is the Beginning explores both the horror of the end and the hope of new beginnings for our planet and ourselves.  THE END IS THE BEGINNING may seem like a collection of horror and science fiction, but the frightening truth is, it might just be our generation's The Prophecies, predictions of what's to come if things don't change. Incurable diseases. Pollution. Out-of-control technologies. Climate change. Extinctions in the name of progress. The stories in this book range from chilling to terrifying, but all of them are thought-provoking in some way, opening our eyes to the dangers of disregarding our environment, of trying to play god. This is Frankenstein on a global scale, and we are the peasants suffering from the arrogance of those who would put greed and progress above common sense. I dare you to read this book before bed and not experience nightmares. Old masters of horror and new ones wait between these pages to open your eyes and infect your hearts with dread. Enjoy their tales, because afterwards you may never look at the world the same again. - JG Faherty, Bram Stoker Award®- and ITW Thriller Award-nominated author of more than 50 short stories and 10 novels/novellas, including CASTLE BY THE SEA, FATAL CONSEQUENCES, and CARNIVAL OF FEAR.  \"A brilliant blend of the old and new, providing a diverse perspective on a modern problem...\" Rob Smales, author of Dead of Winter",
  "genres": [],
  "author": "Alex Scully",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/21968868-enter-at-your-own-risk"
}