{
  "title": "A Year in the Life of Downton Abbey: Seasonal Celebrations, Traditions, and Recipes",
  "description": "A perfect gift for fans of the Emmy Award-winning television series and feature film, A Year in the Life of Downtown Abbey: Seasonal Celebrations, Traditions, and Recipes will inspire you to recreate all the grandeur of the Grantham estate in your own home.It's 1924 and there have been many changes at Downton Abbey since the family and their servants first welcomed us there twelve years ago. A generation of men has been tragically lost at the front; children are once again breathing new life into the great house; a chauffeur now sits at the Grantham dinner table; and skirt hems continue to rise.Still, in the midst of all this upheaval, many things at Downton remain largely unchanged. Nanny still holds sway in the nursery, and there are still summer fetes to be organized, menus to be planned, and farms to be run.This gorgeous book explores the seasonal events and celebrations of the great estate―including house parties, debutantes, the London Season, yearly trips to Scotland, the sporting season, and, of course, the cherished rituals of Christmas. Jessica Fellowes and the creative team behind Downton Abbey invite us to peer through the prism of the house as we learn more about the lives of our favorite characters, the actors who play them, and those who bring this exquisite world to real life.A Year in the Life of Downton Abbey is packed full of exclusive new photographs, with a delicious array of traditional British recipes adapted for modern kitchens: kedgeree, orange marmalade, asparagus tarts, cream of watercress soup, Irish stew, lemon barley water, meringues with red berries, parmesan straws, Christmas pudding with brandy butter and more. From the moment when the servants light the fires against the chill of January, through the last family game of charades and the servants' Christmas ball, this magnificent book invites us to take part in twelve months in the life of Downton Abbey.",
  "genres": [
    "Nonfiction",
    "History",
    "British Literature",
    "Cookbooks",
    "Food",
    "Tv",
    "Adult"
  ],
  "author": "Jessica Fellowes",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/21976704-a-year-in-the-life-of-downton-abbey"
}