{
  "title": "The Loneliness of the Black Republican: Pragmatic Politics and the Pursuit of Power",
  "description": "Covering more than four decades of American social and political history, The Loneliness of the Black Republican examines the ideas and actions of black Republican activists, officials, and politicians, from the era of the New Deal to Ronald Reagan's presidential ascent in 1980. Their unique stories reveal African Americans fighting for an alternative economic and civil rights movement--even as the Republican Party appeared increasingly hostile to that very idea. Black party members attempted to influence the direction of conservatism--not to destroy it, but rather to expand the ideology to include black needs and interests.As racial minorities in their political party and as political minorities within their community, black Republicans occupied an irreconcilable position--they were shunned by African American communities and subordinated by the GOP. In response, black Republicans vocally, and at times viciously, critiqued members of their race and party, in an effort to shape the attitudes and public images of black citizens and the GOP. And yet, there was also a measure of irony to black Republicans' \"loneliness\": at various points, factions of the Republican Party, such as the Nixon administration, instituted some of the policies and programs offered by black party members. What's more, black Republican initiatives, such as the fair housing legislation of senator Edward Brooke, sometimes garnered support from outside the Republican Party, especially among the black press, Democratic officials, and constituents of all races. Moving beyond traditional liberalism and conservatism, black Republicans sought to address African American racial experiences in a distinctly Republican way.The Loneliness of the Black Republican provides a new understanding of the interaction between African Americans and the Republican Party, and the seemingly incongruous intersection of civil rights and American conservatism.",
  "genres": [
    "Politics",
    "History",
    "Race",
    "Nonfiction",
    "American History",
    "Political Science",
    "American"
  ],
  "author": "Leah Wright Rigueur",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/21981641-the-loneliness-of-the-black-republican"
}