{
  "title": "Where He Belongs",
  "description": "Editorial \"The five stories were delightful, all of them bittersweet with an aftertaste of hope.... Each of the stories is short, but the concise yet exploratory writing used every inch of the page to draw out the dynamic of characters and the relationships and show glimpses into a world that the reader wants to see more of.\" -- Alex at Between the Covers\"[T]he author managed to pull me in to each story, which I was very impressed with given how short they are. Each one was wonderfully crafted, vivid in its description and full of emotion.... I really enjoyed this collection; it was wonderful to be able to revisit Daniel. I would highly recommend it to anyone who read and enjoyed Anchored, as well as anyone who hasn't yet read it and would like a glimpse into the Belongingverse and life of the main character.\" -- Amara at Amara's PlaceBook The hottest name in network news is Daniel Halstrom. He is a sensation, a rising star. He is also a slave, owned wholly and completely by NewWorld Media.But before he was a star, he was a frightened child from a bad place with a promising, if limited, future ahead of him. In \"The New Kid\", young Daniel begins his schooling. Then, for a slave, the simple pleasure of a \"Bathroom Break\" is sometimes the only pleasure to be had. Later, Daniel doesn't know it, but \"A Chance Encounter\" might be the most important of his life. Next, in \"Camera Obscura\", one of Daniel's colleagues reflects on the fact that as much as the camera may show, it can hide even more. Finally, when you're a slave, \"Independence Day\" is just another day.Exclusive Bonus Content!Excerpt from \"Anchored\" by Rachel Haimowitz, the debut novel in the Belonging seriesThe never-before-published prologue to \"Anchored\"A sneak peek at \"Counterpunch\", the upcoming Belonging novel by Aleksandr Voinov",
  "genres": [
    "M M Romance",
    "BDSM",
    "Short Stories",
    "Fantasy",
    "Dark",
    "Contemporary",
    "Abuse"
  ],
  "author": "Rachel Haimowitz",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/11277975-where-he-belongs"
}