{
  "title": "The Art of Stillness: Adventures in Going Nowhere",
  "description": "A follow up to Pico Iyer’s essay “The Joy of Quiet,” The Art of Stillness considers the unexpected adventure of staying put and reveals a counterintuitive The more ways we have to connect, the more we seem desperate to unplug.Why might a lifelong traveler like Pico Iyer, who has journeyed from Easter Island to Ethiopia, Cuba to Kathmandu, think that sitting quietly in a room might be the ultimate adventure? Because in our madly accelerating world, our lives are crowded, chaotic and noisy. There’s never been a greater need to slow down, tune out and give ourselves permission to be still.In The Art of Stillness —a TED Books release—Iyer investigate the lives of people who have made a life seeking from Matthieu Ricard, a Frenchman with a PhD in molecular biology who left a promising scientific career to become a Tibetan monk, to revered singer-songwriter Leonard Cohen, who traded the pleasures of the senses for several years of living the near-silent life of meditation as a Zen monk. Iyer also draws on his own experiences as a travel writer to explore why advances in technology are making us more likely to retreat. He reflects that this is perhaps the reason why many people—even those with no religious commitment—seem to be turning to yoga, or meditation, or seeking silent retreats. These aren't New Age fads so much as ways to rediscover the wisdom of an earlier age. Growing trends like observing an “Internet Sabbath”—turning off online connections from Friday night to Monday morning—highlight how increasingly desperate many of us are to unplug and bring stillness into our lives.The Art of Stillness paints a picture of why so many—from Marcel Proust to Mahatma Gandhi to Emily Dickinson—have found richness in stillness. Ultimately, Iyer shows that, in this age of constant movement and connectedness, perhaps staying in one place is a more exciting prospect, and a greater necessity than ever before.In 2013, Pico Iyer gave a blockbuster TED Talk. This lyrical and inspiring book expands on a new idea, offering a way forward for all those feeling affected by the frenetic pace of our modern world.",
  "genres": [
    "Nonfiction",
    "Philosophy",
    "Self Help",
    "Spirituality",
    "Travel",
    "Psychology",
    "Essays"
  ],
  "author": "Pico Iyer",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/21976060-the-art-of-stillness"
}