{
  "title": "From Here to the Great Unknown: A Memoir",
  "description": "Born to an American myth and raised in the wilds of Graceland, Lisa Marie Presley tells her whole story for the first time in this raw, riveting, one-of-a-kind memoir faithfully completed by her daughter, Riley Keough.In 2022, Lisa Marie Presley asked her daughter to help finally finish her long-gestating memoir.A month later, Lisa Marie was dead, and the world would never know her story in her own words, never know the passionate, joyful, caring, and complicated woman that Riley loved and grieved.Riley got the tapes that her mother had recorded for the book, laid in her bed, and listened as Lisa Marie told story after story about smashing golf carts together in the yards of Graceland, about the unconditional love she felt from her father, about being upstairs, just the two of them. About getting dragged screaming out of the bathroom as she ran towards his body on the floor. About living in Los Angeles with her mother, getting sent to school after school, always kicked out, always in trouble. About her singular, lifelong relationship with Danny Keough, about being married to Michael Jackson, what they shared in common. About motherhood. About deep addiction. About ever-present grief. Riley knew she had to fulfill her mother's wish to reveal these memories, incandescent and painful, to the world.To make her mother known.This extraordinary book is composed of both Lisa Marie's and Riley's voice, a mother and daughter communicating across the transom of death as they try to heal each other. Profoundly moving and deeply revealing, From Here to the Great Unknown is a book like no other-the last words of the only child of a true legend.",
  "genres": [
    "Audiobook",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Music",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Lisa Marie Presley",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/219779675-from-here-to-the-great-unknown"
}