{
  "title": "The Sunken Town: A Novel",
  "description": "If you admit on truth, what else will you have to acknowledge?Lindsay, a thirty-year-old California native, never gave much thought to being adopted. When she unexpectedly inherits her birth mother Claire's farmhouse in Maine, she is plunged into a journey across the country and across the years into a lake of secrets that will ultimately reveal just how far everyone was willing to go to protect her. Told from both Lindsay's and Claire's points of view, The Sunken Town explores adoption, identity, the nature of family dynamics, mother-daughter relationships, the impact of family secrets, the weight of motherhood and the lasting consequences of the choices people make.About the AuthorKaren Nelson is the author of the novel The Sunken Town and the co-founder of the nonprofit Writing By Writers. During her long career in nonprofits, she has protected open space, funded cancer research, trained people to complete endurance events, and helped writers bring their work into the world. When not organizing writing workshops, she can be found hiking with her dog, reading, traveling, experimenting in the kitchen, and hosting dinner parties. She writes for various publications and is currently at work on her next novel.Editorial Reviews“…Both a spell-binding thriller and a profound meditation on the role of nature and nurture in human destiny. Bravo!” —Richard Russo, author of \nEmpire Falls\n and the \nNorth Bath Trilogy\n“You will care about the outcomes of these intimately and complexly drawn characters in this intricately plotted, page-turner of a debut.” —Pam Houston, author of Without Reclaiming Abortion, Personhood, and Freedom“In the tradition of Tartt’s The Secret History and Makkai’s I Have Some Questions for You, The Sunken Town probes the life or death secrets of an elite east coast school and the trio of glamorous 'Royals' who seem to rule it. Gripping, illuminating, and creepy in all the best ways, Nelson’s mother/daughter narrators will hook you from page one.” —Gina Frangello, author of Blow Your House A Story of Family, Feminism, and Treason & A Life In Men",
  "genres": [
    "Fiction"
  ],
  "author": "Karen      Nelson",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/219789574-the-sunken-town"
}