{
  "title": "Lifehacks: 63 Ways to Save Money, Improve Time Management, Produce Great Work, and Increase Productivity",
  "description": "Do You Want to Save Money, Improve Time Management, Produce Great Work, and Increase Your Productivity?Then you've come to the right place. In this book you will to Save MoneyLearn money saving lifehacks like how to get VIP treatment at your favorite businesses, never pay ATM fees again, get Amazon Prime for 1/5 of the cost, save 100's of dollars a year on your favorite services and more! If you follow the tips in this section on How to Save Money you'll earn back the price of this book 10x over within the first month!Time Management LifehacksLearn how to crush common time wasters like unnecessary meetings, repeatedly answering the same questions, spending too much time on email, dealing with slow customer service, and weeding out \"time takers\" from you life.Ways to Improve Your WorkImprove the quality of your work with the proven techniques and the latest productivity tools on the web. In this lifehacks guide you'll get information on specific tools that improve your relationships, help you build your network, improve your focus, and spend more time on things that are important so that you can produce great work!How to Increase Your ProductivityIt's very easy to spend a lot of time on things that don't matter. This lifehacks guide will show you how to condense those activities (like email) and focus more on the tasks that actually matter so you can be more productive than ever.Travel Hacking StrategiesLearn how to find the best credit cards for travel points, avoid fees on things like hotel cancellations, and access all your flight information on the go. Using the tips from this book I've traveled for free around the world and managed to avoid some of the most common travel headaches.Hacking Email ManagementThe average person spends 27% of their work week on email management. This is crazy! You'll learn specific strategies on this book on how to massively reduce the time it takes to manage your email like batch processing, how to reduce email volume, and tactics to declutter your inbox. Multiple email hacking tools are mentioned in this section that will massively improve your email etiquette and processing time.Eating and Drinking LifehacksGet proven strategies on how to limit binge-eating, stop late night snacking, and cut back on the coffee overload! You'll even learn some lifehacks for my favorite fast casual restaurant...Chipotle!Lifehacking In Your Everyday TravelsOptimize life's daily headaches by learning how you can leave your wallet at home, never forget your coat check number, access your favorite reading material even when you don't have cell service, and much more!Miscellaneous LifehacksThis book contains a bunch of lifehacks that didn't necessarily fit into one bucket, but are too good not to include! You'll learn strategies to stay motivated, sleep better, hack Chipotle, get cash for crummy gift cards, and how to write things like a book...even if you're not a good writer!About The AuthorScott Britton is a lifehacker and lifestyle entrepreneur. He currently lives in Rio De Janeiro, Brazil where he operates multiple passive income businesses and is constantly looking for ways to get the most out of life. Before this he was a business development executive at SinglePlatform, a startup in New York City that sold for 100 million dollars.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Amazon",
    "Money",
    "Business"
  ],
  "author": "Scott Britton",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/21980672-lifehacks"
}