{
  "title": "The Bone Gatherer",
  "description": "Life has knocked Kat Ruegge around a bit. Finding work after college has been hard, and with no one to help her and a pile of bills to be paid, Kat is feeling the pressure. So, coming across a career opening in her field at the historic and infamous Bixby Estate seems too good to be true, but Kat has never looked a rare gift horse in the mouth… and there’s no way she’s passing up the opportunity to hostess there full-time. With room and board provided, Kat moves into the estate’s prestigious manor, rumors and urban legends aside, and she soon comes to know the formidable and attractive caretaker all too well. There is no way anyone could ever be truly prepared to meet Tobias Grimm.Tobias’ family has worked at the manor for generations, and he seems to know all the secrets… some of which he’s not keen on sharing. He knows what his father taught him, and what his grandmother taught his father before him. He knows the rhythm of the seasons and the forces of time and tide. He knows the way of signs and symbols, and he is aware that bones are representative of the eternal. He has learned how to make a way where there might appear to be none. And, Tobias is a man set on getting what he wants most out of life. Of course, his mysteries and charms are deeply alluring to Kat, and she soon finds herself swayed by them. Kat gets in deep with Sheriff Tanner, too, a real ladies’ man. But, Tobias has his own special ways, and Kat isn’t his only lover, either. For loose on the grounds, and even within the grand old manor house itself, is someone who died almost a decade ago. It is someone with distinct powers of her own. Her name is Victoria. And, Victoria is not, under any circumstances, to be denied.Get ready to enter a world where the magical and the macabre are interwoven, where life and death are bound one to another by wax seals, gathered bones, dried herbs, voodoo veves, and hidden rooms. Get ready to enter the Bixby Estate… and to meet The Bone Gatherer.",
  "genres": [
    "Horror",
    "Paranormal",
    "Fantasy",
    "Zombies"
  ],
  "author": "Jennifer Adele",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/22002121-the-bone-gatherer"
}