{
  "title": "Talon",
  "description": "War doesn't forge heroes, it reveals them.\n An Operator at the top of his game.Former Delta Force operative Talon McKinley knows the wilderness like the back of his hand—how to hunt, how to survive, how to kill. But when his solo re-qualification challenge turns into a real-world nightmare, he stumbles upon something far more dangerous than wild terrain. A group of ruthless men is playing the most twisted game of hunting humans. And their next target? A fierce, determined woman who refuses to be broken.She Was Never Supposed to Make It Out Alive.Petra Keller thought she was taking a temporary job. She never expected to be drugged, abducted, and thrown into the middle of a kill zone. Alone, unarmed, and relentlessly pursued, she refuses to go down without a fight. When a battle-hardened warrior crashes into her nightmare, Petra isn’t sure if she can trust him—but he might be the only thing standing between her and certain death.One Mission. No Surrender. Nowhere to Hide.Survival forces them together, but something far more dangerous ignites between them. Every brush of skin, every whispered breath in the dark pulls them closer—a need as fierce as the war raging around them. Talon has always been a man in control, but Petra pushes every limit. And walking away from her? That might be the one battle he can’t win.The Hunt Is Over. But the Fire Between Them Is Just Beginning.Explosive action, heart-pounding suspense, and scorching chemistry collide in this high-stakes, high-heat protector romance. Strap in—this one’s a bullet train of adrenaline and passion.Survival brought them together. But what happens when the hunt is over?A high-octane romantic suspense A fiercely determined heroine who refuses to breakA lethal special forces operator with nothing left to loseExplosive chemistry that defies all reasonEdge-of-your-seat action with no way outA connection forged in chaos, tested by fireProtective instincts that cross the line into obsessionA love that refuses to surrender\nContent This book contains themes of abduction, violence, PTSD, and steamy scenes. Recommended for mature readers who like their romance lethal, unfiltered, and impossible to walk away from.",
  "genres": [],
  "author": "Bella Stone",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/219879049-talon"
}