{
  "title": "The Unsayable: The Hidden Language of Trauma",
  "description": "In her twenty years as a clinical psychologist, Annie Rogers has learned to understand the silent language of girls who will not–who cannot–speak about devastating sexual trauma. Abuse too painful to put into words does have a language, though, a language of coded signs and symptoms that conventional therapy fails to understand. In this luminous, deeply moving book, Rogers reveals how she has helped many girls find expression and healing for the sexual trauma that has shattered their childhoods.Rogers opens with a harrowing account of her own emotional collapse in childhood and goes on to illustrate its significance to how she hears and understands trauma in her clinical work. Years after her breakdown, when she discovered the brilliant work of French psychoanalyst Jacques Lacan, Rogers at last had the key she needed to unlock the secrets of the unsayable. With Lacan’s theory of language and its layered associations as her guide, Rogers was able to make startling connections with seemingly unreachable girls who had lost years of childhood, who had endured the unspeakable in silence.At the heart of the book is the searing portrait of the girl Rogers calls Ellen, brutally abused for three years by her teenage male babysitter. Over the course of seven years of therapy, Rogers helped Ellen find words for the terrible things that had happened to her, face up to the unconscious patterns through which she replayed the trauma, and learn to live beyond the shadows of the past. Through Ellen’s story, Rogers illuminates the complex, intimate unraveling of trauma between therapist and child, as painful truths and their consequences come to light in unexpected ways.Like Judith Herman’s Trauma and Recovery and Kay Redfield Jamison’s An Unquiet Mind, The Unsayable is a book with the power to change the way we think about suffering and self-expression. For those who have experienced psychological trauma, and for those who yearn to help, this brave, compelling book will be a touchstone of lucid understanding and true healing.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Mental Health",
    "Psychoanalysis",
    "Social Work",
    "Memoir",
    "Social Justice"
  ],
  "author": "Annie G. Rogers",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/2199546.The_Unsayable"
}