{
  "title": "The Court-Martial of Paul Revere: A Son of Liberty and America's Forgotten Military Disaster",
  "description": "At the height of the American Revolution in 1779, Massachusetts launched the Penobscot Expedition, a massive military and naval undertaking designed to force the British from the strategically important coast of Maine. What should have been an easy victory for the larger American force quickly descended into a quagmire of arguing, disobedience, and failed strategy. In the end, not only did the British retain their stronghold, but the entire flotilla of American vessels was lost in what became the worst American naval disaster prior to Pearl Harbor.In the inevitable finger-pointing that followed the debacle, the already-famous Lieutenant Colonel Paul Revere, commissioned as the expedition's artillery commander, was shockingly charged by fellow officers with neglect of duty, disobeying orders, and cowardice. Though he was not formally condemned by the court of inquiry, rumors still swirled around Boston concerning his role in the disaster, and so the fiery Revere spent the next several years of his life actively pursuing a court-martial, in an effort to resuscitate the one thing he valued above all--his reputation.The single event defining Revere to this day is his ride from Charlestown to Lexington on the night of April 18, 1775, made famous by Longfellow's poem of 1860. Greenburg's is the first book to give a full account of Revere's conduct before, during, and after the disastrous Penobscot Expedition, and of his questionable reputation at the time, which only Longfellow's poem eighty years later could rehabilitate. Thanks to extensive research and a riveting narrative that brings the battles and courtroom drama to life, The Court-Martial of Paul Revere strips away the myths that surround the Sons of Liberty and reveals the humanity beneath. It is a must-read for anyone who yearns to understand the early days of our country.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "American Revolution",
    "American History",
    "Military Fiction",
    "American Revolutionary War"
  ],
  "author": "Michael M. Greenburg",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/21998393-the-court-martial-of-paul-revere"
}