{
  "title": "Light Bites",
  "description": "'The author writes so well, in such a 'real' way that I found myself immersed in each tale.''Her characters are easy to relate to and there is lots of humour that keeps you entertained.''I thoroughly enjoyed every story and would definitely recommend it.''There is certainly something for everyone here.''A very good read.''Utterly delicious''Dahl-esque delight - ridiculously funny, yet intelligent. Weird and wonderful characters - a chocolate box of surprises.''A delightful, refreshing, and well written edition of short stories''A wonderful read''Absolutely wonderful'Take a pinch of humour, a touch of light-heartedness and a drop of whimsy and you have the perfect recipe to be savoured any time, anywhere. Light Bites - a collection of satisfying and uplifting tales.Light Bites is one of three short story collections by Helen Laycock. The others, Peace and Disquiet and Minor Discord, lean towards the darker side of life and, as such, are a complete contrast.Helen Laycock has work published in the 'One Word Anthology' by Talkback Writers (Alfie Dog), The Aspiring Writers 2013 Winners Anthology (Blue Dragon Press), An Earthless Melting Pot, Vol 2 (Quinn), The Best of CafeLit (Chapeltown)as well as online. She is also a regular contributor to CafeLit.Some of Helen Laycock's short story success:•\tShortlisted for Annual Love Story Competition, Writing Magazine, May 2005.•\tShortlisted for Adult Fairy Story Competition, Writing Magazine, November 2011.•\tShortlisted for Fiction Competition, Writers’ Forum, Issue #134, 2012.•\tShortlisted in the Erewash Creepy Christmas Chiller Competition, December 2012.•\t3rd place in “The Aspiring Writers Short Story Competition\" yearly anthology, May 2013.•\t3rd place in “The Aspiring Writers Short Story Competition\" yearly anthology, June 2013.•\t1st place in “The Aspiring Writers Short Story Competition\" yearly anthology, July 2013.•\t1st place in “The Aspiring Writers Short Story Competition\" yearly anthology, August 2013.•\tShortlisted for Tea and Tale/Milton Rooms Short Story Competition as part of the Ryedale Book Festival.•\tOne of five runners up in the Words With Jam Bigger Short Story Competition, 2013.",
  "genres": [],
  "author": "Helen Laycock",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/22008325-light-bites"
}