{
  "title": "A Manual for Writers of Research Papers, Theses, and Dissertations: Chicago Style for Students and Researchers",
  "description": "Dewey. Bellow. Strauss. Friedman. The University of Chicago has been the home of some of the most important thinkers of the modern age. But perhaps no name has been spoken with more respect than Turabian. The dissertation secretary at Chicago for decades, Kate Turabian literally wrote the book on the successful completion and submission of the student paper. Her Manual for Writers of Research Papers, Theses, and Dissertations, created from her years of experience with research projects across all fields, has sold more than seven million copies since it was first published in 1937.Now, with this seventh edition, Turabian’s Manual has undergone its most extensive revision, ensuring that it will remain the most valuable handbook for writers at every level—from first-year undergraduates, to dissertation writers apprehensively submitting final manuscripts, to senior scholars who may be old hands at research and writing but less familiar with new media citation styles. Gregory G. Colomb, Joseph M. Williams, and the late Wayne C. Booth—the gifted team behind The Craft of Research—and the University of Chicago Press Editorial Staff combined their wide-ranging expertise to remake this classic resource. They preserve Turabian’s clear and practical advice while fully embracing the new modes of research, writing, and source citation brought about by the age of the Internet.Booth, Colomb, and Williams significantly expand the scope of previous editions by creating a guide, generous in length and tone, to the art of research and writing. Growing out of the authors’ best-selling Craft of Research, this new section provides students with an overview of every step of the research and writing process, from formulating the right questions to reading critically to building arguments and revising drafts. This leads naturally to the second part of the Manual for Writers, which offers an authoritative overview of citation practices in scholarly writing, as well as detailed information on the two main citation styles (“notes-bibliography” and “author-date”). This section has been fully revised to reflect the recommendations of the fifteenth edition of The Chicago Manual of Style and to present an expanded array of source types and updated examples, including guidance on citing electronic sources.The final section of the book treats issues of style—the details that go into making a strong paper. Here writers will find advice on a wide range of topics, including punctuation, table formatting, and use of quotations. The appendix draws together everything writers need to know about formatting research papers, theses, and dissertations and preparing them for submission. This material has been thoroughly vetted by dissertation officials at colleges and universities across the country.This seventh edition of Turabian’s Manual for Writers of Research Papers, Theses, and Dissertations is a classic reference revised for a new age. It is tailored to a new generation of writers using tools its original author could not have imagined—while retaining the clarity and authority that generations of scholars have come to associate with the name Turabian.",
  "genres": [
    "Reference",
    "Writing",
    "Nonfiction",
    "Education",
    "Research",
    "Textbooks",
    "School"
  ],
  "author": "Kate L. Turabian",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/22010521-a-manual-for-writers-of-research-papers-theses-and-dissertations"
}