{
  "title": "Morna's Legacy: Box Set",
  "description": "Discover the Bestselling Morna’s Legacy Series  \n   Includes the first 3 novels in Morna’s Legacy Series, as well as the Christmas novella:\nLove Beyond Time (Book 1): Nearly 400 years ago, the Conall clan and their people were murdered in a surprise attack, their castle burned to the ground. In centuries following, archaeologists searched the ruins looking for any evidence of who had caused the untimely demise of the powerful Scottish clan. Efforts were fruitless until a spell put in place by an ancient Conall ancestor finally began to work its magic... When Bri accompanies her archaeologist mother on a dig in Scotland, they discover a spell room below the castle ruins, and Bri is transported back in time and suddenly married to the castle's ill-fated Laird. She must work to change the fate of his people, all while trying to find a way to return to her century. With each new day, Bri finds herself falling in love with her new husband. If she finds a spell to bring her home, will she use it? If she stays, will it ultimately mean her own death as well?Love Beyond Reason (Book 2): It all started with a spell. Arran Conall lives with the consequences of his foolishness daily, his mistakes guiding him into darkness. He had no way to know that his beloved would fall prey to ancient magic. Now, the only woman to ever give pause to his philandering ways lives centuries ahead of him while still holding on to his heart. Now, he must try to live without her and marries another. His love for Blaire haunts him. With every breath, he prays that she will be able to feel his love across time... Born in the seventeenth century, Blaire MacChristy lives each day adjusting to the challenges of modern life. Magic brought her here, but heartbreak keeps her from using the magic to travel back to her home. When visitors from her past arrive asking her to return to the life she’d known before, Blaire takes a chance on love. Will fate find a way to mend their broken hearts by bringing them together once again? Even if it does, will they be able to stop the darkness that is coming for them both?A Conall Christmas: A Novella (Book 2.5):  Christmas is approaching, and Adelle is determined to make it the best one Conall Castle has ever seen, but loneliness haunts her. Love for her daughter sent her into the past, but she’d not expected the isolation she would feel. She finds that her current age seems much older in the seventeenth century than it did in the twenty-first and resigns herself to the fact that she will remain single for the rest of her days. At least until an unexpected visitor arrives. Hew Moray has spent the last twenty years all alone, only leaving his home once a year to pay homage to the wife he lost long ago. When a storm causes him to seek shelter at Conall Castle, he meets the first lass since his beloved Mae to make his heart flutter in his chest once again. Can he release himself from his past grief to allow another love to enter his life? If he does, will his love be returned?Love Beyond Hope (Book 3): Mitsy is in serious need of a distraction. With the ink still drying on her divorce papers, she flies to Scotland to forget about her own problems by helping her best friend re-enter reality. She knows Bri’s claims that she is able to travel back in time and is currently living in the year 1647 are a lie but, Mitsy falls prey to the same magic and is forced to believe the impossible. She finds few who understand her fiery personality in the seventeenth century, but she finds her match in Baodan, laird of McMillan Castle.",
  "genres": [
    "Time Travel",
    "Romance",
    "Fantasy",
    "Historical Romance",
    "Historical",
    "Historical Fiction",
    "Paranormal"
  ],
  "author": "Bethany Claire",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/22011054-morna-s-legacy"
}