{
  "title": "Bondage Seduction",
  "description": "Desired    DiscipliNation is a sanctuary for all things kink. Master Andre’ seeks to build an inclusive community where members can explore their passions. Do you have what it takes to join our ranks? Our Masters are a special breed, tight knit and eager to promote the lifestyle one sub at a time. Doms, are you willing to take a sub to heights of pleasure they’ve only dreamed about? If you measure up…we will teach you how. Only submissives willing to learn their full potential, explore their limits and experience submitting to a firm, unrelenting Dom need apply.  Discover sensuality too intense to know any bounds…DiscipliNation.    Bondage Seduction by Tori Carson    Book Four in the Desired Discipline series   Master Ted tries to keep it purely sexual. He says he doesn’t want a relationship, but Meri has other plans…   Even in a room full of friends, Ted often feels alone. As the black sheep of the family, he’s never measured up to the expectations of others so he’s stopped trying. Expecting to and okay with spending the rest of his life alone, he’s thrown himself into his business. He spends his days managing the sex toy division of DiscipliNation and his evenings in the kink club.  Meri is a home-grown girl and plans to stay that way. While she tries to please those around her, she refuses to be pressured into anything she doesn’t want to do. After an ego-devastating divorce, she discovers a passion for BDSM. She’s ready to start again.  Although fireworks erupt at their very first meeting, Ted knows better than to give his heart to an overachiever like Meri. He valiantly tries to keep his distance, but her allure goes deeper than a purely sexual attraction. Meri ignites his passion and yet, in her company he experiences a peace he’s never enjoyed before.  Ted sets Meri’s panties on fire until he orders her to stop wearing them. Meri falls hard and fast for the tall, dark Dom. He tells her up front that a relationship isn’t part of his plans, but Meri has her own agenda.  Tori Carson  About the   Tori lives in the beautiful Sonoran Desert with her loving husband of almost thirty years. She wakes up each morning to the howls of coyotes and the barking of her family dogs wanting to join the fray.  When Tori isn't writing, she's either spending time with her two, wonderful adult children, or creating stained glass art.  She likes her love stories scorching hot. She tries to infuse a fire and passion between her characters that rivals the blazing summer sun that Arizona is known for. Tori encourages you to bask in the heat between the covers of a Dominant/submissive, happily-ever-after, bondage romance.",
  "genres": [
    "BDSM"
  ],
  "author": "Tori Carson",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/22009843-bondage-seduction"
}