{
  "title": "On the Laps of Gods: The Red Summer of 1919 and the Struggle for Justice That Remade a Nation",
  "description": "They shot them down like rabbits . . .September 30, 1919. The United States teetered on the edge of a racial civil war. During the previous three months, racial fighting had erupted in twenty-five cities. And deep in the Arkansas Delta, black sharecroppers were meeting in a humble wooden church, forming a union and making plans to sue their white landowners, who for years had cheated them out of their fair share of the cotton crop. A car pulled up outside the church . . .What happened next has long been shrouded in controversy.In this heartbreaking but ultimately triumphant story of courage and will, journalist Robert Whitaker carefully documents—and exposes—one of the worst racial massacres in American history. Over the course of several days, posses and federal troops gunned down more than one hundred men, women, and children.But that is just the beginning of this astonishing story. White authorities also arrested more than three hundred black farmers, and in trials that lasted only a few hours, all-white juries sentenced twelve of the union leaders to die in the electric chair. One of the juries returned a death verdict after two minutes of deliberation.All hope seemed lost, and then an extraordinary lawyer from Little Rock stepped Scipio Africanus Jones. Jones, who’d been born a slave, joined forces with the NAACP to mount an appeal in which he argued that his clients’ constitutional rights to a fair trial had been violated. Never before had the U.S. Supreme Court set aside a criminal verdict in a state court because the proceedings had been unfair, so the state of Arkansas, confident of victory, had a carpenter build coffins for the men.We all know the names of the many legendary heroes that emerged from the civil rights Thurgood Marshall, Rosa Parks, and Martin Luther King Jr. among them. Whitaker’s important book commemorates a legal struggle, Moore v. Dempsey, that paved the way for that later remaking of our country, and tells too of a man, Scipio Africanus Jones, whose name surely deserves to be known by all Americans.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "American History",
    "True Crime",
    "Politics",
    "African American"
  ],
  "author": "Robert  Whitaker",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/2201260.On_the_Laps_of_Gods"
}