{
  "title": "Nadia: Inspirational espionage romance set in cold war Russia",
  "description": "RITA winner, and CBA and ECPA bestselling author Susan May Warren delights readers with this historical romantic Nadia.Nadia “Hope” Moore always feared that being married to her super spy husband, Mickey, would get her – or him, killed. After all, her job as a double agent in a dangerous cold-war era Moscow isn’t exactly an easy day at the office. Nor is it easy to be married to a man who can’t seem to quit when he’s down.Or, about to be executed. It’s her worst nightmare come true when she is sent stateside, only to leave Mickey behind to be captured and sent to gulag. More, she just can’t believe the rumors of his betrayal of his country – America – or of her. Sure, they both made compromises, but their marriage seemed to be one true thing that kept them sane.Except sneaking back into Russia with the goal of springing said so-called traitorous husband before his execution date, as well as securing the secrets he may still have hidden sounds completely insane, even to her.But she’s way too much like Mickey, and just doesn’t know when to quit. Will Nadia be able to resurrect a love she thought had died? God is her sole ally, and only He can give her the wisdom to save her husband, her father. . .and her country.The last thing Mickey wants is his beautiful wife – and now mother of his daughter – to spring him from gulag. Execution is the price of his stupidity, of not seeing his betrayers, and without the ability to get word to Nadia, she’ll walk right into the same trap. But when his worst nightmares seem to come true, he’ll have to choose between saving the woman he loves, and becoming the traitor his country has branded him.“This second in the series thrusts the reader along a fast track of adventure with all the elements of vintage romance.” Romantic Times Magazine“Nadia blended heart-stopping romantic suspense with authentic detail that plunked me into Russian life. The result was a dynamic read! I’ll be looking forward to the next book in the Heirs of Anton series!” —Colleen Coble, author of Without a Trace and Beyond a Doubt“Nadia is the perfect blend of spy thriller and genuine romance. Trapped in Cold War Russia, Nadia and her husband, both CIA agents, don’t know if they can trust anyone…even each other. Delicious Intrigue!” —Deanna Julie Dodson, author of In Honor Bound, in By Love Redeemed, and To Grace Surrendered.A Finalist in the ACFW Carol Awards, Nadia is a part of a series, but can be read as a stand alone book. Readers who enjoyed Sons of Thunder and Team Hope will fall in love with this compelling romantic suspense series.Other books in the EkaterinaNadiaMarinaOksanaThe Heirs of Anton is also available as a boxed set.",
  "genres": [
    "Christian Fiction",
    "Historical Fiction",
    "Romance",
    "Historical",
    "Fiction",
    "Russia",
    "Christian"
  ],
  "author": "Susan May Warren",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/22015388-nadia"
}