{
  "title": "O viaţă descifrată. Genomul meu: viaţa mea",
  "description": "Dintre toate realizările ştiinţifice extraordinare ale secolului trecut, probabil că niciuna nu poate egala descifrarea codului genetic uman, atât cât priveşte tehnica folosită, cât şi datorită implicaţiilor asupra viitorului nostru. Această incredibilă reuşită a conturat un peisaj din care vom înţelege cele mai complexe activităţi ale speciei noastre şi particularităţile codului genetic individual, dar a creat şi perspectiva de a se ajunge la abordări inedite în medicină şi farmacologie, ce vor marca o nouă etapă în dezvoltarea umană, una în care ereditatea biologică nu mai înseamnă neapărat destin.O viaţă descifrată este povestea unei aventuri ştiinţifice unice în istorie, spusă de omul care, printr-o combinaţie de viziune, tenacitate, ingeniozitate şi discernământ, a contestat cunoştinţele convenţionale în dezvăluirea codului genetic uman.Craig Venter nu a fost un elev remarcabil, a manifestat un interes redus pentru activităţile şcolare, ba chiar a fost prea puţin motivat să-şi termine studiile. Curiozitatea lui pentru ştiinţă şi medicină a apărut după ce a fost trimis, ca medic în Marina Statelor Unite, în Vietnam. A urmat un salt evolutiv în educaţia sa şi s-a transformat rapid într-un om de ştiinţă extrem de receptiv şi talentat. A inventat tehnici de descoperire rapidă a genelor, iar la propriul său institut de cercetare, în 1995, a secvenţiat primul genom al unei specii vii din istorie, bacteria Haemophilus influenzae.J. Craig Venter este unul dintre cei mai importanţi cercetători ai secolului XXI. Un deschizător de drumuri în lumea cercetării genomului, este recunoscut pentru contribuţia sa vizionară în acest domeniu. În februarie 2001, Venter a publicat structura completă a genomului uman. Este fondatorul şi preşedintele Institutului J. Craig Venter. A fost inclus în topul celor mai influenţi 100 de oameni din lume al revistei Time din 2007 şi 2008. Printre multe alte premii şi distincţii, a primit în 2008 Premiul Kistler, Premiul ENI şi Medalia Naţională pentru Ştiinţă. Locuieşte lângă Washington, D.C.",
  "genres": [
    "Science",
    "Biography",
    "Nonfiction",
    "Biology",
    "History",
    "Genetics",
    "Memoir"
  ],
  "author": "J. Craig Venter",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/22017708-o-via-descifrat-genomul-meu"
}