{
  "title": "Class Clown: The Memoirs of a Professional Wiseass—How I Went 77 Years Without Growing Up",
  "description": "America’s most beloved wiseass finally tells his life story with all the humor you’d expect from a man who made a career out of making fun of pretty much everything.How does the son of a Presbyterian minister wind up winning a Pulitzer Prize for writing a wildly inaccurate newspaper column read by millions of people?  In Class Clown, Dave Barry takes us on a hilarious ride, starting with a childhood largely spent throwing rocks for entertainment—there was no internet—and preparing for nuclear war by hiding under a classroom desk. After literally getting elected class clown in high school, he went to college, where, as an English major, he read snippets of great literature when he was not busy playing in a rock band (it was the sixties).  He began his journalism career at a small-town Pennsylvania newspaper where he learned the most important rule of local never confuse a goose with a duck. His journey then took a detour into the business world, where as a writing consultant he spent years trying, with limited success, to get corporate folks to, for God’s sake, get the point. Somehow from there he wound up as a humor columnist for The Miami Herald, where his boss was a wild man who encouraged him to write about anything that struck him as amusing and to never worry about alienating anyone.  His columns were not popular with He managed to alienate a vast army of Neil Diamond fans, and the entire state of Indiana. But he also developed a loyal following of readers who alerted him to the threat of exploding toilets, not to mention the fire hazards posed by strawberry pop-tarts and Rollerblade Barbie, which he demonstrated to the nation on the David Letterman show. He led his readers on a crusade against telemarketers that ultimately caused the national telemarketers association to stop answering its own phones because it was getting—irony alert—too many unwanted calls. He has also run for president multiple times, although so far without success.  He became a book author and joined a literary rock band, which was not good at playing music but did once perform with Bruce Springsteen, who sang backup to Dave. As for his literary merits, Dave “I’ll never have the critical acclaim of, say, Marcel Proust. But was Marcel Proust ever on Carson? Did he ever steal a hotel sign for Oprah?”  Class Clown isn’t just a memoir; it’s a vibrant celebration of a life rich with humor, absurdity, joy, and sadness. Dave says the most important wisdom imparted by his Midwestern parents was never to take anything too seriously. This laughter-filled book is proof that he learned that lesson well.",
  "genres": [
    "Humor",
    "Nonfiction",
    "Memoir",
    "Biography Memoir"
  ],
  "author": "Dave Barry",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/220160556-class-clown"
}