{
  "title": "Love Inspired Suspense July 2025 - Box Set 1 of 2",
  "description": "Love Inspired Suspense brings you three new titles! Enjoy these suspenseful romances of danger and faith.This box set COLD CASE PERIL (A Dakota K-9 Unit novel) by USA TODAY bestselling author Maggie K. BlackWhen someone tries to run dog trainer Micah Landon off the road, Officer Lucy Lopez and her K-9 partner, Piper, show up just in time to make a rescue. Someone wants Micah dead—but why? Is this connected to Lucy’s weapon-smuggling case, in which she’s investigating Micah’s younger half brother? Or was Micah attacked because he started looking into the cold case murder of his stepmother? As threats against Micah escalate and secrets are revealed, it’s clear someone will stop at nothing to keep an unsolved murder buried. Can they uncover the truth before it costs them their lives?FRAMED IN AMISH COUNTRYby USA TODAY bestselling author Mary Alford A frantic call from her best friend sends district attorney Paige Grayson running right into a trap—and now she’s being framed for her friend’s murder. With the police after her and evidence against her stacking up, she seeks refuge in Amish country—and the help of her first love, Elijah King, to clear her name. To expose the drug dealer setting Paige up, they must work together while evading a ruthless criminal and the police. With threats closing in and time running out, one wrong move could be their last.ALASKAN POLICE PROTECTORby Megan Short When a minivan slides off the road into an icy lake, Officer Samuel Miller narrowly rescues a woman and child from certain death. Only, Rachel Harding insists the crash is no accident—it’s eerily similar to how her sister and brother-in-law recently died. As the unexplained attacks escalate, Samuel is determined to protect Rachel and her orphaned niece at all costs. But when they make a shocking discovery, their investigation becomes even more dangerous, and survival may be impossible.For more stories filled with danger and romance, look for Love Inspired Suspense July 2025 Box Set – 2 of 2",
  "genres": [],
  "author": "Mary Alford",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/220140242-love-inspired-suspense-july-2025---box-set-1-of-2"
}