{
  "title": "Path of the Swan",
  "description": "A moment of intense silence followed and then the Rigden spoke up, his voice even: Lama Nyima Ozer, Prince Narasimha Miyi Senge, Prince A-Karo, the Golden One, Yeshe Nam Lha and last, but not least, young Tashi Thendup! You have all been called today before the sacred court and from now, in every breath, in every heartbeat, in the shadow of every moment, in the intensity of the thoughtless state, in life and in not-life, in physical or subtle form, we declare you our emissaries, our sacred envoys to the world of men. Shambhala has a task for you. For you will be Shambhalas hand in the age that is now upon men' Path of the Swan, first part of the surreally beautiful Tibetan-Buddhist fantasy series The Maitreya Chronicles, follows the travels of Lama Ozer and his novitiate Tashi as they leave the hidden monastery where they have lived all their lives, in answer to a call received by the lama while deep in trance, from the legendary kingdom of Shambala. Battling the freezing cold and snow of high, mist-laden mountain passes and the many dark forces that thwart their progress, they trek through Sikkim and Tibet to arrive at the legendary Silver Fortress in a remote part of western Tibet. Shedding their corporeal forms they meet a host of divine and dark celestial beings including the golden dakini, Yeshe Nam Lha, daughter of the Goddess Tara; Prince A-KarO, heir to the Lha Empire; and Prince Narasimha heir to the Rigdens and the Shambala legacy. Both the princes are Yeshis guardians and suitors and she must travel with them to Earth. Once here, it is decreed, she will choose one of them and her child Maitreya, the saviour, will be born. Tashis role is that of confidant and friend and Ozers mission is to be the liaison between Shambala and Earth. But, before that happens they must combat the Asur forces and the dark prince, Arden, who holds Yeshe captive, bewitched by his brooding menace, trapped in his thrall. Drawing richly from the vast pantheon of otherworldly beings that populate the myths of the Mahayan school of Buddhism, Part 1 of The Maitreya Chronicles is a surreal and mesmerizing account of the battle between the dark forces and the celestials and the descent of the celestials to Earth.",
  "genres": [],
  "author": "Charu Singh",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/22014340-path-of-the-swan"
}