{
  "title": "Trial of Bronze and Blood",
  "description": "Gladiator meets Heartless Hunter meets Bloodguard in this new adult fantasy romance.Four deadly trials will reunite them. One secret will tear them apart. Drusilla Valerius has been loyal to the Faithless in their fight against the tyrannical Imperium since they found her beneath the rubble of her village as a child. When a mission goes wrong and ends with her best friend dead, she's rescued by someone she never expected to see Marcus Scaevola. The only man she’s ever cared for—the man who spurned her feelings six years ago.And the only person who’s ever defected from the Faithless, despite his claims otherwise.Marcus should’ve known Dru wouldn’t be the same woman he left all those years ago, and he's he’s unprepared for her distrust of him – and her uncanny ability to kill. But he has a purpose for seeking her out. Bound by loyalty, he convinces her to train King Cato of Anziano, one of the last countries yet to fall to the tyrannical Imperium, in the Valorem Blood Trials.Unlike years’ past, the Imperium has a heavy hand in it, hiding beneath the guise of peace and unity between their two countries. When both Dru and Marcus find themselves joining the competition – Dru to take the place of an innocent and Marcus to protect the king – they’re forced to trust one another with their lives.Now inescapably entrenched in the gory, duplicitous world of the blood trials, feelings long-buried surface, blurring the lines between duty and honor, love and loyalty. But Marcus carries a devastating secret–one that could destroy the foundations of Dru’s world, her deepest beliefs, and both their hearts...Don’t miss this adult romantasy debut combining the second-chance romance of Heartless Hunter by Kristen Ciccarelli with the deadly trials of Gladiator.",
  "genres": [
    "Fantasy",
    "Romance",
    "Romantasy",
    "Fantasy Romance",
    "New Adult"
  ],
  "author": "M.K. Deoradhán",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/220226046-trial-of-bronze-and-blood"
}