{
  "title": "مرد رؤیاها",
  "description": "نوشتن درباره افرادی که امروز در میان ما زندگی نمی‌کنند و در عین حال به دلیل موقعیت اجتماعی خود بسیار در معرض دید جامعه پیرامون خود بوده‌اند، کار ساده‌ای نیست؛ چون به طور قطع کثرت منابع و آثار تولید شده درباره چنین افرادی، راه را بر خلق اثری جذاب و بکر می‌بندد و به احتمال زیاد هر آنچه در مورد او می‌بایست بیان می‌شده، تا پیش از این گفته شده است.شهید مصطفی چمران، از جمله چنین افرادی در زمانه ماست که به طور عمده در ایران به دلیل نوع حضورش در سال‌های دفاع مقدس در جبهه‌های غرب و نیز اطلاعاتی مختصر از حضورش در لبنان شناخته شده است؛ اما سید مهدی شجاعی در تازه‌ترین اثر خود که در قالب فیلم‌نامه یک سریال ۱۳ قسمتی و درباره او نوشته شده است، به سراغ نیمه پنهان زندگی چمران رفته است و به راحتی تمامی مصائب موجود پیرامون نوشتن از چنین افرادی را پشت سر گذاشته است.به عبارت ساده‌تر «مرد رؤیاها» که امروز پیش از تصویری شدن، خوانده شده است، داستانی است از زندگی شهید چمران در آمریکا و لبنان و مصر که تا پیش از این کمتر درباره آن صحبتی به میان آمده است.شجاعی در «مرد رؤیاها» با درک اقتضاء تحمل مخاطب، نه به سوی خلق یک اثر اکشن و پر کشش و زد و خورد رفته است و نه به سراغ خلق یک ملودرام عاشقانه از زندگی یک مجاهد و شهید ملی. او در «مرد رؤیاها» سعی کرده به دور از احساسات، پیش از هر چیز به خلق یک ساختار واقعی و رئال از شخصیت مردی رؤیایی دست پیدا کند. فردی که در عین عمل‌گرایی و فعالیت بر اساس اصول و شیوه‌های مبارزه سیاسی و نظامی چریکی، عاشق‌پیشه نیز هست و روابط عاطفی زندگی را نیز فراموش نمی‌کند.به عبارت دیگر چمران از نگاه شجاعی فردی به شدت معتدل است و این اعتدال یعنی رعایت همه جوانب و ظواهر زندگی فردی و اجتماعی توأم با هم، مبارزه و گسیختن از دنیا در عین وابستگی‌های عاطفی و زمینی.«مرد رؤیاها» با روایت پرکشش و کمتر شنیده شده از آشنایی شهید چمران با همسرش در آمریکا آغاز می‌شود و روایت جذاب و در عین حال عفیف از ابراز علاقه همسر چمران به وی را به تصویر می‌کشد. داستان اما در ادامه به ماجرای اعتراض شهید چمران و برخی از هم‌فکرانش در آمریکا به جنایات ساواک و زندان‌های رژیم پهلوی در سازمان ملل باز می‌گردد. تحصن چمران در معبد مجاور با سازمان ملل و نیز اعتراض وی و دوستانش در مقابل سفارت ایران در آمریکا و ماجرای ورود جسورانه آنها به سفارت و یا ماجرای ساماندهی راهپیمایی پنجاه مایلی جوانان ایرانی در آمریکا در اعتراض به شاه و واکنش آمریکایی‌ها به آن و نیز چگونگی تلاش چمران برای لغو اعطاء مدرک دکترای افتخاری به شاه در آمریکا نیز از بخش‌های جذاب تاریخی این متن است که تا پیش از این کمتر در مورد آن سخنی به میان آورده شده است.این روایت زمانی جذاب می شود که در لابلای آن شجاعی نقبی نیز به گذشته های چمران و دوران نوجوانی او می‌زند و خاطراتی جذاب از آن دوران را در قالب گفتگوی او با همسرش پروانه، پیش چشم مخاطبانش تصویر میکند.بخش دوم داستان نیز به ماجرای حضور چمران در مصر در دوران زمامداری جمال عبدالناصر و حضور در دفتر وی و دریافت کمک‌های نظامی از او برای آموزش نیروهای چریکی و نیز آشنایی با امام موسی صدر و مهیا شدن حضور چمران در لبنان اختصاص دارد.حساسیت شجاعی در بیان جزیئات و حضور بدون پرده بسیاری از چهره‌های تاریخی فعال در مبارزات ضد رژیم پهلوی در خارج از کشور – به دور از دسته‌بندی‌های سیاسی آنها در سال‌های پس از پیروزی انقلاب – و نیز استفاده از ادبیاتی صمیمی و عامیانه برای نوشتن دیالوگ‌های این اثر نیز، از مهم‌ترین مواردی است که بر جذابیت این متن افزوده است.",
  "genres": [],
  "author": "سیدمهدی شجاعی",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/22019590"
}