{
  "title": "The Mosquito Hours",
  "description": "\"Melissa Corliss DeLorenzo’s exquisite debut novel, The Mosquito Hours, tells the powerful story of three courageous women, struggling with the rippling effects of guarded secrets, misguided lies, and heartbreaking mistakes. Revelations add layers of meaning, deepening our understanding--and theirs, of themselves, each other, their relationships—as the novel builds toward its wise, hauntingly beautiful conclusion. Vivid language and brilliant insight drew me into the riveting world of The Mosquito Hours, but it was the strong, loving women—Vivian, Tania, and Guin—at the center of this luminous, profoundly moving novel that truly captivated me. The Mosquito Hours is a breathtaking work of art—and, at heart, an unforgettable love story.\"​--TERRI GIULIANO LONG, author of the novels, In Leah's Wake, and Until I Come Home (forthcoming, 2014)\"In prose as undulating as the ocean by which the story is set, The Mosquito Hours chronicles the Crawford family, a multi-generational family of widowed and unwed women, momentarily at the ebb tide of their lives. Melissa Corliss DeLorenzo takes us into the world of ordinary women living with pluck and dignity despite unplanned pregnancies, underemployment and the untimely deaths of loved ones. It is a quiet pleasure to watch the tide return.\"--DEBORAH LEE LUSKIN, author of the award-winning novel, Into the Wilderness\"The Mosquito Hours quickly draws the reader into a turning-point summer in a stone house built on sand, where three generations of women grapple with uncertainty and change, faith and secrets. Especially, secrets. Melissa Corliss DeLorenzo writes with a sharp eye for detail, a strong sense of place, and moments of quirky humor and unexpected grace.\"--ELLEN MEEROPOL, author of House Arrest​\"The Mosquito Hours is a windswept elegy that unearths the hidden complexity of everyday life, adumbrating the traces of the past that haunt a receding present. With crisp prose, wit, and keen insight, Corliss DeLorenzo has created a poignant exploration of family, love, and the changing landscape of feminine identity.\"--MCCORMICK TEMPLEMAN, author of The Little Woods, and The Glass Casket",
  "genres": [],
  "author": "Melissa Corliss DeLorenzo",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/22022726-the-mosquito-hours"
}