{
  "title": "Embattled Home",
  "description": "His Marine training taught him that failure is never an option regardless of circumstances. That certainly applies to Chad's need to stop Lost and Found's deranged client from using the information he gathered to stalk and abuse his ex. Falling in love with the broken woman and her sweet daughter in the middle of rescuing them is definitely not the best timing. But it's also inevitable. In Book 3 of this heart-warming military romance series, Chad will discover that protecting Lora is a much easier task than proving he’s the one man she can finally trust with her heart. Weeks of no incriminating evidence should have clued him in sooner about who was the real victim. Now Chad Lowell is wracked with guilt after the woman he’s assigned to investigate is attacked by her abusive ex-husband right under his nose. Lora and her little girl are in incredible danger, and he vows to protect them at all costs, whether the angry and hurt woman wants him to or not. His Marine training makes the protecting part easy, but nothing he does seems to make Lora want to take a chance on him or his love. Lora O’Neil left a life of abuse to make a new start for herself and her daughter. When her ex hires Lost and Found Investigative Service to track her down, she’s left reeling both physically and emotionally. The private detective that had been watching her for the past couple of months did finally come to her rescue, but does that mean she should now trust him to help her turn their lives around? The sexy former Marine makes her body feel things she thought she’d never feel for a man again, but she just can’t imagine what it would take for her to heal enough to ever say yes. Lost and Found Series Reading Order The Embattled Road- Prequel- 0.5 Embattled Hearts- Book 1 Embattled Minds- Book 2 Embattled Home- Book 3 Embattled SEAL- Book 4 Embattled Ever After- Book 5 Connected Novellas- SEAL’s Lost Dream- Book 2.5 Her Forever Hero- Book 3.5 Unbreakable SEAL- Book 3.6 Embattled Christmas- Book 3.7 Loving Lilly- Book 4.2 Her Secret Wish- Book 4.3 SEAL’s Christmas Dream- Book 4.7 Mistletoe Mischief- 5.1 Lost and Found Pieces 1- Book 5.2 Lost and Found Pieces 2 Connected Spinoffs- The Lowells of Honeywell, Texas Forget Me Not- Prequel Untying His Not- Book 1 Naughty by Nature- Book 2 Trying the Knot- Book 3 The Dogs of War- Genesis- Prequel Chaos- Book 1 Destruction- Book 2 Retribution- Book 3 Catalyst- Book 4",
  "genres": [
    "Military Fiction",
    "Romance",
    "Contemporary Romance",
    "Romantic Suspense",
    "Contemporary",
    "Military Romance",
    "Abuse"
  ],
  "author": "J.M. Madden",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/22018824-embattled-home"
}