{
  "title": "The Art of Domination",
  "description": "Alternate cover for ASIN B00AU43Q84Warning: Written for mature audiences and includes profanity, graphic sexual encounters, moderate BDSM themes and mild edgeplay.Romantic, erotic, suspenseful, emotional and humorous.Five months into their intensely physical and BDSM-laced relationship, Dylan is ready to make a lifelong commitment to Isabel. But Isabel has reservations and for good reason as Dylan has continued to remain secretive and closed off about his past. When someone from Dylan's past makes an unwelcome appearance, he is forced to confront his demons head on as he is threatened with exposure about his sexual proclivities. More concerning is the threat of exposure about how his parents' death rests on his shoulders. Forced into an awkward situation, Dylan must help the former lover and ex-submissive who threatens to expose him, all while trying to keep it a secret from Isa. Dylan and Isa embark on a new journey as they take vows to never let anything tear them apart, a journey that tests Isa's physical and mental limits as Dylan lets his true Dominant and sadistic nature out, giving Isa more artistic inspiration than she ever thought possible. But can Isa keep her own Dominant nature at bay long enough to allow Dylan to fulfill his sadistic fantasies?With Isa's upcoming debut gallery show and just when things are heating up, their relationship is threatened when Isa comes face-to-face with Dylan's past activities with his ex and a woman from his past who won't let him go.To make matters worse, Isa's father tries to force his way back into her life and she finds out just how truly cruel he really is as his secrets are revealed.With everything that comes to light, can Isa stay true to her vows of for better or worse?",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Erotic Romance",
    "Contemporary",
    "Adult",
    "Contemporary Romance"
  ],
  "author": "Ella Dominguez",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/22025952-the-art-of-domination"
}