{
  "title": "Takedown: The 3rd Infantry Division's Twenty-One Day Assault on Baghdad",
  "description": "Over time the impression has grown that the 2003 invasion of Iraq met with little resistance and that, with few exceptions, the Iraqi army simply melted away. As this book clearly shows, nothing could be further from the truth. In its drive to capture Baghdad, the U.S. Army's 3rd Infantry Division was in nearly constant combat for twenty-one days. While Americans were watching Saddam's statue being torn down on TV, a brigade of the 3rd ID was on the verge of being overrun by Iraqi Republican Guard units trying to escape north. Told to hold two bridges in his sector, a brigade commander had to blow up one of them because he did not have the combat power to hold it. The company commander holding the other bridge was so hard pressed that he called on the artillery to fire their final protective fires a command made only when a unit is in mortal danger and one that had not been given since Vietnam. Every one of the division's armored vehicles was hit by rockets some taking more than a dozen hits and the fighting was so fierce at times that entire battalions ran out of ammunition. Nevertheless, when the fighting was finally over, the 3rd ID had destroyed two Iraqi Regular Army divisions and three divisions of the much vaunted Republican Guard. Takedown tells the little-known story of what happened to the 3rd ID during its struggle to win Baghdad, a campaign that some call one of the most vicious in American military history. To offer this firsthand account, Jim Lacey, a former Time magazine reporter embedded with the 1st Brigade of the 101st Airborne Division, draws on extensive interviews that he conducted with the American soldiers involved as well as access to personal papers and war memoirs. This story is also enriched through his extensive use of interview transcripts of senior Iraqi army officers along with their personal written recollections. From the Kuwaiti border to the streets of Baghdad, these dramatic eyewitness descriptions of what went on give readers an accurate look at the brutal engagements in which the division fought for its life. In making use of such a wealth of primary source material, Lacey has succeeded in writing a fast paced narrative of the conflict, backed up by verifiable facts, that shows how modern wars are really fought.",
  "genres": [
    "Military Fiction",
    "Nonfiction"
  ],
  "author": "Jim Lacey",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/22024120-takedown"
}