{
  "title": "The Delicious Dump Cake Cookbook: 23 Easy Dump Cakes Recipes That Anyone Can Bake... Even If You've Never Baked Before",
  "description": "At first glance the title may throw you off, but let me assure you it does not refer to where the cakes are baked, rather the method of their mixing. These are cakes like our grandmothers made…lots of delicious ingredients, blended easily together and thrown in an oven. Paul Watson is quoted as saying; “These cakes may not have the most flattering of names, but they more than make up for it in their amazing taste.” No more tiptoeing across the kitchen floor for fear of having the cake fall or crossing your fingers for a scrumptious result…these recipes deliver in ease and flavor. What is a ‘Dump Cake’ Preparing, making and baking a dump cake is perhaps the easiest form of baking. Ingredients are placed in a single pan, layered, and popped in the oven. Does it sound overly simple? YES! That’s the point. The concept was likely conceived by a woman but intended for a man. Any number of tasty combinations are possible. Once you’ve mastered the 23 recipes contained in this easy-to-follow cookbook, you’ll astound your family and friends with your own concoctions. There is literally no way to go wrong with this type of cake. It can’t be that easy There truly are few things in life that are as easily done as first thought. That is not the case with baking a dump cake. Inside this unusually simple guide, you’ll learn how to make decadent chocolate gateaux, fruit cakes bursting with yummy goodness, vanilla infused delights, and much, much more… Learn what thousands have already there is an easy, fast way to impress your family with a quick, after-dinner dessert. Serve it right from the pan it was cooked in. They’re delicious on their own or truly astounding when covered with whipped cream or vanilla ice cream. A Baking Bonanza at your fingertips It's your kitchen, why mess it up at the end of a long day...simply slam a few ingredients into a pan and serve it, hot and ready. Adopt the idea of ‘I can do it’ and buy this cookbook today! You'll have absolutely no regrets, but will be thrilled with the comments these recipes will elicit from your loved ones. When you purchase today, you will also get access to a special free gift from The Essential Kitchen Series ($97 Value). cookbook, cooking, recipes, cook book, recipe book, recipe, healthy recipes, food, eating",
  "genres": [
    "Cookbooks"
  ],
  "author": "Sarah Sophia",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/22023656-the-delicious-dump-cake-cookbook"
}