{
  "title": "Doll Palace",
  "description": "In this brilliantly rendered debut collection, Sara Lippmann draws the reader into the intimate lives of characters seeking connection beyond their scripted worlds. She captures the beguiling transformation from child to adult with humor, heartache, and desperation. From grieving mothers to fathers adrift, old flames to restless teens, isolated characters in Doll Palace are united by conflicting desires and the private struggles of the heart.A girl ditches her innocence at a state fair. Strippers ponder love over a Brazilian wax. A father falls for a drug-addled babysitter. A mother ends a pregnancy. Doll Palace dwells in the harder-edged territories of human compassion, navigating the powerful, often unsettling ground rarely spoken of with awareness, care, and grace. Doll Palace is that rare collection that invites imitation but leaves a vast majority wondering how she did it.\"Smart and technically accomplished fiction.\" KIRKUS REVIEWS“Sara Lippmann’s prose is unflinching. Her female characters see motherhood, womanhood and self-hood through a raw and funny lens: I am about to cry, when I laugh. Terribly wonderful and exciting work!” —Rachel Sherman, author of Living Room and The First Hurt“Sara Lippmann is the sort of writer who can drop you with a line. Of a guy wearing a baby in a harness, she writes, ‘He yanks on the baby's stubby toes like he is milking it.’ I'd read a hell of lot of pages to find a sentence that practically nails an entire generation. Good news is this book has such lines on every page. Lippmann is a fearless writer, and these are concise and deadly stories.”—Peter Orner, author of Last Car Over the Sagamore Bridge“Sara Lippmann’s Doll Palace is a sexy, sad and fearless collection full of humor, pathos and compassion. Her scalpel-sharp stories are raw emotional gems, blinding in their precision. Lippmann understands the pumping highways and byways of the human heart like a seasoned traveler.” —Jonathan Papernick, author of The Book of Stone“Sara Lippmann’s stories are visceral and gripping, venturing into dark places with sharp wit and a gimlet eye. A lot of them gave me bad dreams, and I mean that in a good way. This is a memorable debut collection.” —Alix Ohlin, author of Inside",
  "genres": [
    "Short Stories",
    "Fiction",
    "Literature",
    "Literary Fiction"
  ],
  "author": "Sara Lippmann",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/22026705-doll-palace"
}