{
  "title": "Думки проти течії",
  "description": "Стаття і три есеї, зібрані в цій книжечці, написані в різнихстилях і з різних приводів, але пов’язані єдністю провідної думки і спільним прагненням окреслити характеристичні риси і головні потреби української духовости на сучасному етапі її розвитку. Праці ці були читані для вужчих і ширших авдиторій, але друкуються вони вперше. Деякі з них викликали пристрасну... читач думає: дискусію? — \"і, пристрасну лайку на адресу автора. Власне, виявило-ся при цьому дві реакції тих, хто відчув себе безпосередньо заторкненим. Одні намагалися всі неґативи звалити зі своєї партії на конкуренпійну - ніби тут ідеться про партії, а не про психологічний тип людини! Другі, щоб не допустити поширення висловлених тут „баламутних“ думок, вирішили зчинити якнайбільший галас, обвинувачуючи автора в усіх смертельних гріхах, від розкладу українського суспільства починаючи і запереченням ідеї самостійної України (!!!) кінчаючи.Автор не має сумніву, що і книжка в цілому викличе подібні реакції (і тим ще раз потвердить стару істину: Юпітере, ти сердишся, отже, ти не маєш рації); а надто аматори „уловлювати душі\" методою висмикування окремих фраз знайдуть собі рясну поживу. Не зважаючи на це, автор наважується випустити свої „думки проти течії“ в світ, бо значення порушених тут питань видається йому важливішим за свою і чужі амбіції.Автор не міг і не хотів давати готових розв’язань і викінчених формул, уважаючи це за передчасне. Не належачи до тих, хто взагалі виступає проти гасел, автор міркував, що ще не пора висувати якісь нові викінчені гасла, своїм основним завданням ставлячи — дати ґрунт для мислення, для дискусії. Надто часто в нас шукають книжки „до подушки“, щоб швидше заснути. В протилежність цьому автор хотів дати читачеві книжку, яка не давала б йому спати, яка хвилювала б і може навіть дратувала б його, яка змушувала б думати, ятрила б рани, спонукала активно шукати виходу з теперішньої ситуації, посувала б українську духовість, а тим самим і український державнобудівний рух уперед. Якщо книжка це завдання виконає, автор буде задоволений, які б налички на нього, не наліплювали ті, хто своїм основним завданням поставив виключити з українства здатність мислити.(Юрій Шерех, травень 1948) Зміст:Від автораДонцов ховає Донцова. Стаття.Над озером. Баварія. Триптих про добу, про мистецтво, пропровінційність, про призначення України, про голуби іінші речі.1. Над озером. Баварія.2. Наша сучасність — наше мистецтво3. При битій дорозі",
  "genres": [
    "Nonfiction"
  ],
  "author": "George Y. Shevelov",
  "average_rating": "4.86",
  "url": "https://www.goodreads.com/book/show/22031806"
}