{
  "title": "The Big Book Of Time Travel Romance",
  "description": "The Big Book Of Time Travel Romance presents for the time travel romance enthusiast the works of six bestselling artists in one stunning collection. A brilliantly conceived anthology unprecedented in its scope, this set of six full length time travel novels by artists EB Brown, Cassidy Cayman, Angeline Fortin, Ranay James, Monique Martin and Sarah Woodbury, will leave you breathless and asking for more.\nThrilling and told with wit this collected works will warm the heart, excite the senses, and spark the imagination. Overflowing with history, drama, love, loss, and victory, The Big Book Of Time Travel Romance will transport you in a whirlwind of adrenaline from the wild Scottish Highlands to Medieval Wales, from Tudor England to Colonial America, and into the roaring 1920's and beyond. This collection will carry you away without ever having to pack a bag.\n\n\n\n\nTitles Include:\n\n\nSarah Woodbury - Daughter Of Time (After Cilmeri #0.5)\n\nDaughter of Time tells the story of a young widow, Meg, healing from the pain of a brief, unhappy marriage, who falls through time into the Middle Ages-and into the arms of Llywelyn ap Gruffydd, the last Prince of Wales. He saves her, and she in turn saves him, thanks to her knowledge of future events.\nAlthough powerful forces seek to divide them, by working together, Meg and Llywelyn have a chance to navigate the dangerous and shifting alliances that constantly undermine his rule and threaten the very existence of Wales - and to create a future in which Llywelyn's death does not come too soon.\n\n\n\n\nCassidy Cayman - Lost Highlander (Lost Highlander #1)\n\nGrad student and cocktail waitress Evelyn Merkholtz has plenty to deal with. Too much to deal with. So, when her runaway best friend calls with a mysterious and urgent request to join her in Scotland, she is secretly more than happy to drop everything and oblige.\nShe's faced with an ancient curse, an adorably hunky villager, and a super hot (but possibly murderous), Highland warrior from the 18th century - and realizes that getting burned at the stake is a really bad way to get out of writing her thesis.\n\n\n\n\nRanay James - The Beginning (The McKinnon Legends #1)\n\n\n\"Nic, my friend, you think Fate's a bitch? Just wait until you meet her sister Destiny.\" - Connor Holden, Earl of Featherstone\n\nEvery story has a beginning often driven by Fate. With The McKinnon Legends that beginning starts with Nic McKinnon and his unconventional bride, Morgan Pembridge, Seventh Duchess of Seabridge.\nNot your typical Knight in Shining Armor - Damsel In Distress story, The Beginning starts the reader on a journey of deep love, treachery, and mystery of the way time and space collide with characters that are believable. Staged initially in the late fifteenth century this love affair sets the foundation for an amazingly strong and solid family legacy spanning centuries in an eight volume series.\n\n\n\n\nAngeline Fortin - A Laird For All Time\n\nAfter ten long years of education and residency, Dr. Emmy MacKenzie feels the time is long overdue for a vacation. A little “me” time. A little alone time. But when traveling the British Isles, a twist of fate at the gates of the ancient castle of Duart hurls Emmy more a hundred years into the past and into the arms of a magnificent highlander who thinks she is his long-lost wife, Heather MacLean!\nThe ten years since his new bride abandoned him on his wedding day had brought Connor MacLean, earl Strathclyde, nothing but misery and bitterness but that is nothing compared to the anger he feels when she shows up at his front gates on the 10th anniversary of that day. Determined to punish her for the humiliations she dealt him, he is shocked when his wife claims mistaken identity and insists that she is not his wife at all! Endeavoring to cling to his anger, Connor finds he cannot deny the new attraction he feels for his mysterious wife and soon he is wanting nothing more than to take her in his arms and make her his.\nWith no choice but to play the part of the long lost Heather MacLean, Emmy cannot help but wonder how any woman could ever leave Connor MacLean, a man unlike any she had ever known. A man who thrills and challenges her. A man to love forever. Questions of destiny plague Emmy making her question her very life as she wavers between the desire to return to her own time and the hope for a life with her earl. She begins to question what she really wants out of life. And who can give it to her.\nBut Emmy’s isn't the only secret lurking in Duart Castle. Painful secrets will be revealed. Not only hers but that of another. When the truth of Heather MacLean’s disappearance comes to light more than Connor’s life might be destroyed. Choices will have to be made. Forgiveness begged. Second chances taken not just for the people of Duart, but for Emmy herself.\n\n\nBut will she risk it all to have her laird for all time?\n\n\n\n\n\n\nMonique Martin - Out Of Time (Out Of Time #1)\n\nProfessor Simon Cross has spent his life searching for evidence of vampires and avoiding emotional entanglements. When a mysterious accident transports Simon and his new assistant, Elizabeth West, back in time, Simon finally finds both the proof that he's been looking for, and the romance that he hasn't.\nIn 1920s Manhattan, they find that are more than mobsters vying for power in the city's speakeasies. Will Simon and Elizabeth's developing relationship survive the vampires' teeth? Will they survive to make it back? Or will they be forever out of time?\n\n\n\n\nE.B. Brown - Legend of The Blood Stone (Time Walkers #1)\n\nIn 2012, a woman cuts her hand and picks up a strange colored stone - Suddenly she is staring into the eyes of an angry Powhatan warrior. And the only town nearby is Jamestown, circa 1622.\nMaggie McMillan wakes up one day as a college student, yet ends the day in 1622. Captured by Winn, a warrior who is torn between his duty to kill her and his desire to keep her, she is thrust into a life she had only read about in history books.\nHunted and feared by both the Powhatan and the English, she struggles to find a way home while Winn plots to keep her there. Maggie fights to survive as she finds herself entangled in the Indian Massacre of 1622, and Winn sees everything he ever believed in shattered by the knowledge she holds.\n\n\nAs they battle against each other and the message she brings from the future, she must decide whether to return to her own time, or to make a life in the past with the man who holds her heart captive.",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical",
    "Fantasy",
    "Time Travel Romance"
  ],
  "author": "Sarah Woodbury",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/22028924-the-big-book-of-time-travel-romance"
}