{
  "title": "Vision of You: Time Travel Romance",
  "description": "Ellen likes things to stay the sameNow she must stop a disaster that will change everythingHaving visions of people in trouble is a fact of life for Ellen Victoria, a shy biologist living in a biosphere in twenty-fourth century Central Australia. But when a gladiator appears amongst her tomato plants, calling for her to come to him, she knows this is something unprecedented. And even if she’s more Bambi than Lara Croft, she also knows she has no choice but to time-travel back to the Ancient Roman Empire and find him. Because the fate of the world rests in her soft, plump hands and if she’s to avert the apocalypse that never happened, but still might if a rogue time traveller has his way, she has to face her own fears and step up.But she doesn’t have to do it alone. Her gladiator will be at her side; even if he’s there as her kidnapper, not her champion. If she fails to win him over, all will be lost, history will be irrevocably changed, and her future utopian world will cease to exist.˃˃˃ Sensual Romantic AdventureFor women who like their love scenes steamy but wholly romantic˃˃˃ Award Winning SF Romance Writer Nhys Glover does it again!Jump into the series anywhere and find out why two hundred of Nhys' books are downloaded daily around the world.˃˃˃ What Reader's say about this Time Travel Romance a fantastic series! I've loved every single one of these books and impatiently wait for the next one to be available.' Tuesday 63'I am loving all of this series and I recommend it to anyone that loves romance novels. They are all worth reading at least once.' Amazon Customer'I read the whole series. Love the concept. Although each book revolves to the same concept, love , saving and my favorite soulmate, this writer found different ways to suck me in her stories. Love it!' Lillyhope'Awesome. I love the story line, characters and setting. The new world is believable and I would go in a hot minute.' Jacqueline M. Furlo' If you want something to lose yourself in and just plain out enjoy, get these! You won't be disappointed.' MKazebeeScroll up and join the adventure today.",
  "genres": [
    "Time Travel",
    "Romance"
  ],
  "author": "Nhys Glover",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/22030276-vision-of-you"
}