{
  "title": "Вибрані праці. Книга 1. Мовознавство",
  "description": "Перша книга \"Вибраних праць\" Юрія Шевельова, найвидатнішого українського гуманітарія XX сторіччя, представляє доробок ученого в різних галузях мовознавства. Сюди ввійшла його класична праця \"Українська мова в першій половині двадцятого століття (1900-1941): Стан і статус\", полемічна розвідка \"Так нас навчали правильних проізношеній\", в якій Шевельов спростовує деякі псевдонаукові концепції радянських лінгвістів, статті, що висвітлюють погляди вченого на актуальні правописні й лексикографічні проблеми. Кілька розвідок Шевельова, вміщених у збірнику, присвячено історичним питанням походження й розвитку української мови.Для студентів і аспірантів філологічних факультетів, викладачів вищої школи, вчителів, журналістів, а також усіх, хто цікавиться питаннями історії й сучасного стану української мови.\"Зміст:- Вступне слово Лариси Масенко. \"Те, що Грушевський зробив для української історії, я зробив для української мови\"1. Українська мова в першвій половині двадцятого століття (1900-1941): Стан і статус2. Так нас навчали правильних проізношеній3. У затінку совиних крил4. Двомовність і вульґаризми: Дисиміляція плинних в українській літературній мові5. Українське слово вантаж і проблема \"арґотичних суфіксів\"6. Чому общерусский язык, а не вібчоруська мова? З проблем східнослов’янської глотогонії7. Про так званий підпис королеви Франції Анни (1063)8. Назва \"Україна\"9. Історичні перипетії однієї синтаксичної конструкції у східнослов’янських мовах (безособові речення на -но, -то із знах. відмінком додатка)10. Up or out? З проблематики формування українського числівника як частини мови11. О.О.Потебня і стандарт української літературної мови12. Про критерії в питаннях українського офіційного правопису13. Пролеґомена до вивчення мови та стилю Г. Сковороди- Примітки- Іменний покажчик",
  "genres": [],
  "author": "George Y. Shevelov",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/22031832-1"
}