{
  "title": "My Five Stages of Grief: Poetry Anthology",
  "description": "My Five Stages of Grief: Poetry Anthology by Darren Heart is an emotional chronicle of the author's ten year journey of recovery and healing from the grief and the overwhelming sense of loss caused by the tragic deaths of his long term partner, and shortly afterwards, his step son.The original poetry contained within this anthology is taken from the more extensive book My Five Stages of Grief: A Father’s Journey to Recovery from Bereavement, written by the same author. The main body is represented by five chapters featuring poems dedicated to the five stages of grief, namely; Denial, Anger, Bargaining, Depression and Acceptance; Intended to reflect upon the various emotions and thoughts he experienced during that particular stage of the grieving process. Contains 45 original emotional, and thought provoking, short poems, capturing the author's raw thoughts and emotions associated with each stage. For those who have suffered the loss of a loved one, this poetry book explore a mourner's need to acknowledge death and embrace the pain of loss and bereavement, as a pathway to recovery. At one time or another, we will all find ourselves facing a dark journey through the grieving process. My Five Stages of Grief Poetry Anthology is written to provide support and comfort for a person who is in the wake of despair following the loss of a loved one. Example Poem from this AnthologyA CastawayDark clouds of despair rolling above,Obscures the peak of mount melancholy.Surrounded by a rough sea of sadness,Waves of woe crashing all over me.Where is this place i have landed?A castaway in a far off land.Beaches of gloom and misery,Great sorrow in each grain of sand.I really need to escape here,Build a raft from my dreams and hopes.Leave unhappiness there on the shoreline,And break free of these heavy heart ropes.Depression is no laughing matter,Dejection is not a great show.But no blast of darkness can block out the light,Just one match can make a room glow.",
  "genres": [],
  "author": "Darren Heart",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/22028225-my-five-stages-of-grief"
}