{
  "title": "No More Hurt",
  "description": "Memoir. LGBT Studies. Lesbian. Queer. Child sexual abuse. Mothers. Parenting.\"A true story about Ellen's discovery that her daughters were being sexually abused by their father. There are no arrests, no happy endings and no one gets \"healed\". Instead, it's a painful account of how the children are harmed and how communities respond to such accusations. At a time when so much focus is on convictions and criminals, I found this a moving reminder that the reality of these situations is much more complex.\" (Ros Coward Observer)\"Ellen Prescott writes with a literary flair that adds to the power of her story. She hits the reader in the gut on page 1: \"In 1982, when my daughters were four and one, I decided to kill them . . . I was so in love with them, there at the door of their bedroom, that all I could think of was murder.\" You'd have to be anesthetized to put the book down at this point.\" (Toronto Star)\"I recommend it to anyone, including most physicians who need a better understanding of human responses to suffering.\" (Willard Edwin Smith, BSc, MD, FRCP)\"Well paced and … excruciatingly well written.\" (Quill and Quire)\"This is a gripping story which I read from start to finish at one sitting.\" (Geist)\"I liked Mondays are Yellow, Sundays are Grey so much that I bought a couple of copies for my office and they are rotating amongst my clients. I’m sure that it will be of tremendous help to both survivors and mothers of survivors.\" --Caren Durante, M.Ed.\"I was very impressed with the writer’s account and with her accomplishment of dealing with her own and her daughters’ abuse experiences. I appreciate your bringing this book to my attention.\" Dr. J. Adler, Registered Psychologist\"I’m writing to tell you how much I admired and relished Mondays are Yellow, Sundays are Grey. I stayed in bed for 2 days and read it slowly. The story’s truth had my inner organs hiding behind each other, shifting all around. Having been abused as a kid myself, I was the victims; being a parent, I was the mother; being a man, I was the abuser. The critical me admired the smooth, unblinking text.\" –a reader\"Thank you for writing about your experience. It helped me understand a lot about myself and my relationships to read about all of you. I have never read a personal account that so closely mirrored mine. I wish I had had a mother like you to hold me and comfort me and reassure me that not all life was pain. You’re a heck of a writer.\" –a reader'You'd tell me if Daddy touched your private parts, wouldn't you, Carolina?''No,' said Carolina firmly.'Why not, honey?''Because it's a secret.'It is only when long-buried memories from her own childhood start to surface that Ellen realises the terrible truth about her two young daughters: Carolina and Amy are being sexually abused by their father.Ellen writes with unflinching honesty about the heartbreak of finding out her daughters were abused, her fears of losing custody and her fight to have her story believed by sceptical doctors and social workers.A harrowing true story of sexual abuse from a mother's point of view, No More Hurt is a deeply affecting chronicle of Ellen's hard-won battle to create a place of safety and love for herself and her daughters.",
  "genres": [
    "Nonfiction",
    "Memoir"
  ],
  "author": "Eaton  Hamilton",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/11283561-no-more-hurt"
}