{
  "title": "How To Draw Amazing Manga - Regular Edition (Kindle): Easy-to-Follow Step by Step Lessons for Drawing Your Own Manga & Anime Characters",
  "description": "*Approximately 132 Full Colour Pages* ***Regular Edition***  Take Note: ***This Edition is the the Regular Edition. This version may work on most readers but it is recommended to click on the \"Author's Name\" or \"Amazon Dropdown Menu\" to view other options available***  This book is Also Available in these Editions: - Black & White Saver Edition - High Definition (HD) Edition - Fixed Format (Comic Style Layout) Edition (HD) - Trade Paperback (Printed Full Colour: 132 pages) - Printed in a Bundle with \"How to Draw Anatomy for Comics\" (264 pages: Full Colour) __________________________________________________________________  \"How to Draw Amazing Manga\" by Stan Bendis Kutcher is a book that focuses on the popular drawing methods of manga. By some definitions \"Manga\" is known as \"Japanese comic art\", which is exactly what this book will be focusing on. In this \"Anime-influenced\" self-help book, the author explains in easy to follow, step-by-step methods to apply the following towards drawing manga:   * human anatomy vs. manga anatomy (the eyes, nose, mouth, ears, hands, expressions) * which materials to use * drawing basic shapes * using perspective * backgrounds and clothing principles * putting it all together * Much, MUCH more!  Chapter Overview:  Chapter 1 - Drawing Materials * Drawing Manga Eyes  Chapter 2 - Drawing The Nose * Drawing The Mouth * Drawing The Ears  Chapter 3 - Dynamic Manga Hair * Drawing The Complete Head * Facial Expressions  Chapter 4 - Drawing Hands * Body Proportion Basics * The Basics Of Clothing And Drapery  Chapter 5 - How Perspective Works * The Essence Of Backgrounds  Chapter 6 - Putting It All Together - Start To Finish   This introductory guide takes the reader from simplified first steps, right to the detailed construction of drawing manga. Practical and easy to follow, these pages will help you to multiply your ability of \"Drawing Amazing Manga\".",
  "genres": [],
  "author": "Stan Bendis Kutcher",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/22029251-how-to-draw-amazing-manga---regular-edition-kindle"
}