{
  "title": "Drinking from the Fire Hose: Making Smarter Decisions Without Drowning in Information",
  "description": "You're sitting in a windowless conference room. Twenty minutes into the meeting the presenter finally makes it to slide four of a thirty two- slide deck. At least you can read this one, unlike the others, which were crammed with numbers, graphs and charts. You look around, wondering if anyone else is following the presentation. Just about everyone these days suffers from information overload the 24/7 explosion from our computers, smartphones, media, colleagues, and customers. Information is essential to making intelligent decisions, but more often than not, it simply overwhelms us. It's like trying to drink from a fire hose. The question isn't how to stop all those e-mails, meetings, conference calls, and fat reports; that's impossible. The question is what to do with them. How do you find the truly essential nuggets of information and use them with confidence? The solution proposed by Christopher Frank and Paul Magnone sounds deceptively Learn how to ask the right questions at the right time. Whatever field you're in, asking smarter questions will expose you to new information, point you to connections between seemingly unrelated facts, and open new avenues of discussion with your colleagues. The authors explain the seven questions that can help you bring a big- picture perspective to problems that often leave others buried in irrelevant details. And they show through real-life case studies- including Trader Joe's, Starbucks, Kodak, Microsoft, iRobot, and IBM-how their method can have a dramatic impact. It really is possible to convert the fire hose of information into useful insights. Consider a nonbusiness the 2010 Icelandic volcano eruption that sent a giant ash cloud toward Europe. Tens of thousands of flights were canceled and five million passengers stranded, leading to billions in economic losses. Europe's best scientists generated oceans of data and carefully modeled the cloud's dispersion pattern. But no one could answer the essential Was the concentration of volcanic ash in the air enough to damage a jet engine? Without that key answer, all the carefully gathered facts were useless to the decision makers. Once you adopt the seven questions, you'll start having more productive brainstorming sessions. You'll answer critical questions faster and find unexpected solutions to important problems. And you'll get better at communicating to your colleagues with more clarity and focus, turning down the fire hose that other people have to cope with.",
  "genres": [
    "Business",
    "Nonfiction"
  ],
  "author": "Christopher J. Frank",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/11283834-drinking-from-the-fire-hose"
}