{
  "title": "Some Like It Hot",
  "description": "The heat is on...Five bestselling authors have come together to bring you five smoking hot, never before seen novellas that will test the limits of your internal thermostat.What could be hotter than sizzling firefighters, sultry cowboys, sexy bodyguards and scorching bad boys?Nothing, that's what. It doesn't get much hotter than this!From the New York Times and USA Today Bestselling Author, Olivia Cunning with \nOne Starry Night: Sinners on Tour Extras\nIn high school, Jake was the bad boy who made Michelle burn with desire, took what he wanted from her body, and broke her heart. In hindsight, Michelle never should have gotten tangled up with the aspiring guitarist in the first place. In high school, Devlin was a sweet, shy geek who’d had a crush on her, but when he’d found the courage to ask her to Prom, she’d turned him down flat. In hindsight, she should have worried more about the quality of the boy than her reputation with the popular crowd. But this isn’t high school anymore. At her ten year class reunion, Michelle finds her once popular crowd lacking, but finds both the man who broke her heart and the one she once rejected irresistibly sexy. She wants them. Both of them. And they want her any way—every way—they can have her. Can she resist either man? Does she even want to try?New York Times bestselling author Nicole Edwards is heating things up with \nBoots Optional (Dead Heat Ranch, #0.5)\n, a sexy new ménage novella which is the first book in a hot new series called Dead Heat Ranch. Grace Lambert is familiar with hard work, long days, and handsome cowboys. She’s been working for her family’s dude ranch since she was old enough to ride a horse and she’s not afraid to get her hands dirty. What she is afraid of is the heat that’s been generating between her and not one, but two sexy cowboys who’ve set their sights on her. And each other. Grant Kingsley and Lane Miller have both had their eyes on Gracie for years, but the feisty cowgirl has managed to keep them at bay. As far as they are concerned, cowboys don’t give up, and neither of them is ready to give up just yet. Not on her and not on the heat that transpires between the two of them. Find out what happens when the sultry Texas nights get as hot as the fierce Texas days.New York Times bestselling author Cherrie Lynn gets it hot in here with \nShameless\n. It's a vacation Meredith Taylor will never forget. A sunny beach, good friends and good times. But when she overhears a couple having a passionate interlude on the balcony above her one night, she can't get the man's sultry voice out of her mind. Especially when she figures out exactly who that man is...Cameron Moore always had an eye on his best friend's little sister but considered her strictly off limits, choosing to satisfy his lust elsewhere. Now Meri seems to want to annihilate every wall Cam's put up against her. The beach is hot, the drinks are cold, Meredith is irresistible, and something has to give. Will it only be the walls between them, or their hearts as well?New York Times Bestselling Author Kristen Proby brings you Playing With Fire, a manage novella. Bailey Whitworth is a charity event organizer and a woman exploring her sexuality. Kevin Welling and Gray McDermitt are firefighters and best friends who share everything. Bailey always knew her sexual appetites were \"different\", but she had no idea that she could fall in love with two men at once. What will she do when she has to choose between them? Or will she have to choose at all?From USA Today bestselling author, Lainey Reese comes \nGuarding Nadia\n.When Nadia Dixon walked into the offices of CJ Investigations, the last thing she expected to find were men who looked more like GQ models than bodyguards. It was desperation that brought her to their door however and she prayed that the two sex gods were more than just pretty faces.Caleb and Jonas had started their security firm together after leaving the Secret Service. They had the lethal skill and training to safeguard anyone, including the gorgeous erotic author. Considering her stunning beauty, alluring sensuality and decadent profession, the only wonder was that she had drawn out just one obsessed fan. After hearing Nadia’s story and seeing for themselves the threat that she was under, they knew they could keep her safe from any stalker.Their only worry…who was going to keep her safe from them?",
  "genres": [
    "Anthologies",
    "Erotica",
    "Romance",
    "BDSM",
    "Menage",
    "Erotic Romance",
    "Contemporary Romance"
  ],
  "author": "Olivia Cunning",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/22035969-some-like-it-hot"
}