{
  "title": "Non dico addio",
  "description": "Un vasto cimitero sul mare. Migliaia di tronchi d’albero, neri e spogli come lapidi, su cui si posa una neve rada. E intanto la marea che sale, minacciando di inghiottire le tombe e spazzare via le ossa. Da anni questo sogno perseguita la protagonista Gyeongha che, dopo una serie di dolorose separazioni, si è rinchiusa in un volontario isolamento.Sarà il messaggio inatteso di un’amica a strapparla alla sua vita solitaria e alle immagini di quell’incubo: quando Inseon, bloccata in un letto di ospedale, la prega di recarsi sull’isola di Jeju per dare da bere al suo pappagallino che rischia di morire, Gyeong-ha si affretta a prendere il primo aereo per andare a salvarlo. A Jeju, però, la accoglie una terribile tempesta di neve e poi un sentiero nell’oscurità dove si perde, cade e si ferisce. È l’inizio di una discesa agli inferi, nel baratro di uno dei più atroci massacri che la Corea abbia conosciuto: trentamila civili uccisi, e molti altri imprigionati e torturati, tra la fine del 1948 e l’inizio del 1949. Una ferita mai sanata che continua a tormentare le due amiche, proprio come aveva tormentato la madre di In-seon, vittima diretta di quel crimine. Tre donne, unite dal filo invisibile della memoria, che con determinazione si rifiutano di dimenticare, di dire addio e troncare il legame con chi non c’è più.Con la sua scrittura al contempo lirica e implacabilmente precisa, fatta di « istanti congelati in volo che brillano come cristalli », Han Kang riesce a raccontare questa pagina buia della storia, non solo coreana, consegnando al lettore un romanzo doloroso, lucido e poetico – dove la frontiera tra sogno e realtà, tra visibile e invisibile sfuma fin quasi a svanire. Un romanzo che lei stessa ha definito « una candela accesa negli abissi dell’anima umana ».",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Literary Fiction",
    "Asia",
    "Contemporary",
    "Asian Literature",
    "Historical"
  ],
  "author": "Han Kang",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/220328328-non-dico-addio"
}