{
  "title": "The Business Anarchist's Guide to Peak Productivity and Time Management: Getting More Done In Less Time Than You Ever Thought Possible",
  "description": "Are you struggling with being more productive at your job or in your business? Or, working too hard to earn too little? Do you feel overworked? Do you want to make more money with less effort and less time? Have you ever carefully considered just how successful entrepreneurs balance growing a business or multiple businesses and a personal life full of fun and excitement? There are time-tested secrets the most productive among us know…that may well help you achieve what you never thought possible, until now… Inside The Business Anarchist’s Guide to Peak Productivity and Time Management, you’ll discover how America’s Business Anarchist, Jerry Jones, manages to be one of the most prolific and productive people you’ll ever meet -- all while managing a number of businesses, raising two children, keeping his marriage happy and intact, and, taking as many vacations and personal days as he needs or wants every year. But, this manual is far more than giving you what some might consider radical tools to the freedom and lifestyle you desire. You’ll also learn how to make far more money than ever before, while not burning out, driving yourself crazy or upsetting your personal life from working too hard. You’ll discover, first-hand, how the author has used the peak productivity principles revealed in this book to start, buy, and sell a combination of over 13 different businesses, and to this day, run four of those without ever leaving his home, unless he wants to. End the struggle with time. Master it. And, become more productive than ever before. Join the Business Anarchist Revolution and create more freedom and a higher income using these principles to master time and generate more abundance for you and your family than ever before",
  "genres": [
    "Business"
  ],
  "author": "Jerry A. Jones",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/22035799-the-business-anarchist-s-guide-to-peak-productivity-and-time-management"
}