{
  "title": "Serial Kitsch",
  "description": "HWORDE/gnOme books presents Serial Kitsch:Like the best conceptual work, Serial Kitsch shows its innards, the way the work works. Like the best poetry, it guts itself for our aesthetic pleasure and contemplation. Like the best killers, it does all this using its words.– Vanessa PlaceIt is strangely and disconcertingly fitting that Serial Kitsch starts out with a quote from Andy Warhol because this is really a book about art. It is a disturbing book that enters into the tricky and troubling relationship between art and violence by taking on (and taking in) one of the most frightening, influential and ridiculous figures of the 20th century: the serial killer. The serial killer’s “kitsch” - his letters, his corpses, his appearance (“But he looked just like an average person!”) – does not so much “blur” the line between fiction and reality, violence and art, as show an intimate bond between these, a bond we might call “media.” Conceptual poetry has long bragged about “killing poetry”; here the actual poetry finally goes gothic. You may not want to read the results; it’s a disconcerting but lyrical book: “I spoke to him as if he were still alive/how beautiful he looked.”– Johannes GöranssonYuu Seki's brilliant and necessary poem, Serial Kitsch, follows in the grand tradition of Aron the Moor's final words in Titus Andronicus--\"...I have done a thousand dreadful things/As willingly as one would kill a fly, / And nothing grieves me heartily indeed / But that I cannot do ten thousand more\"--and plunges this sentiment into the era of YouTube, when the faces and words of Dahmer and Wuornos can be pulled up and organized like a playlist. Reading this book allows language to fulfill its ultimate purpose: to disperse the diseased miasma of the human soul, or what's left of it, to the ends of the earth.– David PeakThe figure of the serial killer has always captured the attention of the public and in recent television and film the figure has been domesticated (“Dexter”) and celebrated (“Hannibal”) in equally disturbing ways. Yuu Seki allows the words of serial killers to speak here in this epic poem. What we see is not easily put into a comforting or entertaining narrative, but is unflinching in forcing us to confront human evil that goes far beyond individual crimes.– Anthony Paul Smith",
  "genres": [],
  "author": "Yuu Seki",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22034145-serial-kitsch"
}