{
  "title": "Never: The Autobiography",
  "description": "'I hadn’t been very comfortable with fame, but I didn’t know what to do with myself after I was famous. On the surface, I was just hugely relieved to be shot of the whole thing. I felt like I’d been let off the hook . . . But underneath that, I was pretty miserable.'When 'Never Gonna Give You Up’ propelled Rick Astley into the pop stratosphere, it changed his life forever. Nothing could have prepared the young, unassuming boy from Lancashire for what was in store for him. This is Rick's story – in his own words.At just nineteen, Rick agreed to sign with legendary music producer Pete Waterman – under the wings of music powerhouse Stock Aitken Waterman. Unpredictable, outlandish adventures followed, giving him a peek into the mechanics of the music industry – all of which would eventually take Rick from the shadows of local bands to international stardom. From platinum-selling albums to worldwide tours, the world was at Rick’s feet. And then, suddenly, at what seemed like the height of fame, it wasn’t.At twenty-seven, Rick retired himself from the industry that had brought him much success and financial stability. Behind the hits and the glitz and glamour was a young man coming to terms with his new-found fame, the realities of life in the pop-music machine and the pressures of life on the road, not to mention reconciling with his childhood spent between his divorced parents in a volatile family dynamic. Time out of the industry offered Rick room for much-needed reflection and therapy – and unknowingly helped to set the stage for his triumphant return to music.Balancing nostalgia, fresh perspectives and introspection, with a good dose of northern humour, Never is an intimate look at the man behind the hits – and is a portrait of truth, artistic evolution and the astounding power of contentment.Born in Newton-le-Willows, Lancashire in 1966, musician Rick Astley started his career at the music production company Stock Aitken Waterman. His 1987 debut album, Whenever You Need Somebody, sold 15. 2m copies worldwide and made him a household name. Since then he has gone on to release eight studio albums, selling over 40 million records worldwide, and headline multiple world tours, including most recently a sell-out UK tour (2024). Never is his first and only official autobiography.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Audiobook",
    "Music",
    "Autobiography"
  ],
  "author": "Rick Astley",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/220362568-never"
}