{
  "title": "Mating for Life",
  "description": "From the bestselling author of Lucky—a Reese Witherspoon Book Club pick—comes a captivating novel that explores marriage, motherhood, identity, and what it takes to love someone—family members, friends, or spouses—for life.Former folk singer Helen Sear was a feminist wild child who proudly disdained monogamy, raising three daughters—each by a different father—largely on her own. Now in her sixties, Helen has fallen in love with a traditional man who desperately wants to marry her. And while she fears losing him, she’s equally afraid of abandoning everything she’s ever stood for if she goes through with it. Meanwhile, Helen’s youngest daughter, Liane, is in the heady early days of a relationship with her soul mate. But he has an ex-wife and two kids, and her new role as a “step-something” doesn’t come with an instruction manual. Ilsa, an artist, has put her bohemian past behind her and is fervently hoping her second marriage will stick. Yet her world feels like it is slowly shrinking, and her painting is suffering as a result—and she realizes she may need to break free again, even if it means disrupting the lives of her two young children. And then there’s Fiona, the eldest sister, who has worked tirelessly to make her world pristine, yet who still doesn’t feel at peace. When she discovers her husband has been harboring a huge secret, Fiona loses her tenuous grip on happiness and is forced to face some truths about herself that she’d rather keep buried. Interweaving the alternating perspectives of Helen, her daughters, and the women surrounding them, “each new chapter brings a wise and tender look at single life, dating rituals, and marital unease” (New York Times bestselling author Jennifer Close). In this “absolute feat of storytelling” (bestselling author Grace O'Connell), Marissa Stapley celebrates the many roles modern women play, and shows that even though happy endings aren’t one-size-fits-all, some loves really can last for life.",
  "genres": [
    "Fiction",
    "Romance",
    "Chick Lit",
    "Canada",
    "Womens Fiction",
    "Book Club",
    "Contemporary"
  ],
  "author": "Marissa Stapley",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/22032834-mating-for-life"
}