{
  "title": "A Thing in Disguise : The Visionary Life of Joseph Paxton",
  "description": "This is a biography of Joseph Paxton, horticulturist to the Duke and Duchess of Devonshire, architect of the Crystal Palace at the Great Exhibition of 1851 and a great unsung hero of the Victorian Age. In the 19th century, which witnessed a revolution in horticulture and urban planning and architecture, Joseph Paxton, a man with no formal education, strode like a colossus. Head gardener at Chatsworth by the age of 23 and encouraged by the sixth Duke of Devonshire, whose patronage soon flourished into the defining friendship of his life, Paxton set about transforming this Derbyshire estate into the greatest garden in England. Visitors there were astonished by the enormous glasshouses and ambitious waterworks he built, the collection of orchids, the largest in all England, the dwarf bananas and the gargantuan lily, the trees and plants brought back from all over the world. Queen Victoria came to marvel and, increasingly, with the development of the railway in which Paxton was also involved, daytrippers from all over the country. It was the Crystal Palace, home of the Great Exhibition in 1851, that secured Paxton's fame. His design, initially doodled on a piece of blotting paper, was the architectural triumph of its time. Two thousand men worked for eight months to complete it. It was six times the size of St Paul's Cathedral, enclosed a space of 18 acres, and entertained six million visitors. By the time of his death 14 years later, \"the busiest man in England\", according to Dickens, was friends with Brunel and Stevenson and in constant demand to design public parks and gardens. His last, seemingly most eccentric project was for a Great Boulevard under glass, a crystal arcade that would connect all the main railway termini in London. Drawing on access to Paxton's personal letters, Kate Colquhouns's biography is the story of a man who typifies the Victorian ideal of self-improvement and a portrait of one of that era's great heroes.",
  "genres": [
    "Biography",
    "Gardening",
    "Nonfiction",
    "History",
    "British Literature"
  ],
  "author": "Kate Colquhoun",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/2203853.A_Thing_in_Disguise_"
}