{
  "title": "Starlet's Web",
  "description": "Love. Lies. Acting. Discover the young adult coming of age Starlet Series and uncover the life of a talented actress caught in Hollywood's web of lies. Fans of Nicholas Sparks' A Walk to Remember will find a new hero to root for in the good-hearted Manuel and cheer for the struggling Hollywood starlet, Liana Marie.5 Stars review and summary by Faridah Nassozi for Readers' Starlet's Web, book one of The Starlet Series by Carla Hanna is a memoir of fictitious Hollywood teenage starlet Liana Marie. Seventeen-year-old Liana is on top of her game and has an Oscar to prove it. However, her success, like several in Hollywood, has a big price tag. It is not easy balancing the life of being a teenager and being a big star. She is trying to live her life the best way she can, hooking up with some cute boys along the way, and fighting off unwanted advances. Then she realizes that she is and always has been in love with her best friend, Manuel, a boy she has known since childhood. Fortunately, Liana has her mum, who has been in the same business for a long time, to guide her; that is, until her mother's best intentions have catastrophic results.Starlet's Web is a captivating story about the life of Hollywood teenage star and the price she has had to pay. Carla Hanna created a sweet main character who can do no wrong, a girl suffering the consequences of the need to keep up with the Hollywood standards and expectations. She is a kid who has messed up before but now knows better. Carla Hanna's style of writing is very eloquent and evokes vivid images. I could not help but fall in love with Liana as she struggled to stay grounded and fight the temptations that come with the Hollywood life. The book gave me a whole new take on Hollywood stars; their lives are not just about the glitz and glamour.~ STARLET'S WEB GOLD 2014 Readers' Favorite International Book Awards ~~ STARLET'S LIGHT SILVER 2014 Readers' Favorite International Book Awards ~~ STARLET'S WEB GOLD MEDAL 2013 AUTHORdb Book Cover Contest! ~~ STARLET'S WEB January 21, 2013 IBD AWARD! ~~ STARLET'S WEB 2014 Readers' Favorite International Book Awards in 3 Young coming of age; cultural; Christian romance ~\"YA fans will absolutely want to check out this series, where they'll find a new heroine to root for in the flawed but sympathetic Liana.\" - BlueInk Review",
  "genres": [
    "Young Adult",
    "Romance",
    "Contemporary",
    "New Adult",
    "Chick Lit"
  ],
  "author": "Carla J. Hanna",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/22039084-starlet-s-web"
}