{
  "title": "Unconditional",
  "description": "Fall in love with Beachwood Bay in Melody Grace’s USA Today and internationally bestselling series!\"I’ve spent my whole life chasing perfection: perfect looks, perfect man, perfect home. But in one brutal moment, I realized it was all just a beautiful lie…\"Carina MacKenzie is fleeing from her past. Picking up the wreckage of her shattered dreams, she seeks comfort in the only place she’s ever felt safe: Beachwood Bay.Garrett Sawyer isn’t looking to be anyone’s savior. Scarred by old betrayals, he’s sworn never to put his heart on the line again -- especially not for a damaged, high-maintenance girl like Carina. But passion knows no logic, and soon, their reckless chemistry is making him forget his bitter vows.Two damaged hearts. The hope of true love. As their passion blazes out of control, Carina and Garrett struggle to escape their legacies of hurt. But can you ever outrun the past? And when everything is on the line, can they trust enough to build a love that's unconditional?*This book contains adult situations and explicit content. 17+*THE BEACHWOOD BAY SERIES:BOOK 1: UNTOUCHED (Emerson & Juliet’s story begins - novella)BOOK 2: UNBROKEN (Emerson & Juliet’s story continues)BOOK 3: UNTAMED HEARTS (Brit & Hunter’s story begins - novella)BOOK 4: UNAFRAID (Brit & Hunter’s story continues)BOOK 5: UNWRAPPED (Lacey & Daniel’s holiday novella)BOOK 6: UNCONDITIONAL (Garret & Carina)BEACHWOOD BAY: THE CALLAHANSBOOK 7: UNREQUITED (Dex & Alicia begin – novella)BOOK 8: UNINHIBITED (Dex & Alicia)BOOK 9: UNSTOPPABLE (Ryland & Tegan)BOOK 10: UNEXPECTEDLY YOURS (holiday story) -- DECEMBER 2014BOOK 11: UNWRITTEN -- JAN 2014BOOK 12: UNFORGETTABLE -- MARCH 2014Author’s note: UNCONDITIONAL can be read as a stand-alone story, but you'll enjoy reading the other Beachwood Bay books, too.PRAISE FOR MELODY GRACE:\"Melody Grace created fascinating characters that are simply I-R-R-E-S-I-S-T-I-B-L-E ! Her stories leave you with a big smile on your face and a heart bursting with love.\" - A Bookish Escape Blog\"Sizzling hot and super emotional - the perfect combo!\" - NYT and USA Today bestselling Lauren Blakely\"A roller coaster ride of pure emotion... beautifully written.\" Blame it on the Rain Reviews\"Sexy, sweet, and swoon-worthy.\" - NYT Bestselling Emily Snow, author of the Devoured series.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "Adult",
    "Chick Lit"
  ],
  "author": "Melody Grace",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/22039390-unconditional"
}