{
  "title": "A Zany Slice of Italy",
  "description": "This light, lively book takes place in Italy, with hilarious anecdotes about the author and her husband’s trip to visit his family in Abruzzo and finally their escape to Tuscany. Her own expectations were shattered when she embarked on la dolce vita. She envisioned drinking unforgettable Brunello by candlelight and discussing art and history with elegant dinner guests. Instead, dinner discussions revolved around how to avoid a “bad wind,” whether the Mafia runs IKEA, and bizarre theories on why the Chinese in Italy never have funerals. Now she drinks Zio’s own “unforgettable,” almost undrinkable, wine, as he pays long-winded tributes to the vile liquid as if it were an elixir of the gods. Celebrate with our author—for mere mortals, or their livers, could not have lived to tell the tale. Although the author was initially drawn to Italy for its art, architecture, and Vogue, often described in other books, it is evident that still lifes and stilettos do not hold this author’s attention as much as living people do. The author’s open, sympathetic viewpoint captures the characters' quirky charm and the local color. Although you certainly wouldn’t call this a philosophical book, how the author observes and deals with individuals and situations in her life shows that she follows her own philosophy, one that is worth looking into. If we could regard the most sinister carabinieri and the most self-important consulate employee with sympathetic amusement and not anger, that would be an accomplishment worth imitating. The author can laugh at her own expense, a rare quality. Her attitude and wit can turn even adversity into an almost tolerable and redeeming experience. Although the author is not so naïve as to think that all Italians’ lives flow as smoothly as their olive oil, she has not met anyone in Italy who is bitterly disappointed with life. Follow her unlikely adventures as she’s reduced to tears by crazy-making Italian bureaucrats and tries to find work as a truffle telemarketer. You will encounter elderly aunts climbing trees, pyromaniac septuagenarians, and all sorts of “fowl” play. So pour yourself a glass of bad Italian wine, add a dose of accordion music, and spend some time in Ivanka Di Felice’s Italy.",
  "genres": [
    "Italy",
    "Travel",
    "Nonfiction",
    "Contemporary",
    "Memoir"
  ],
  "author": "Ivanka Di Felice",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/22041118-a-zany-slice-of-italy"
}