{
  "title": "Idiots are invincible: The fool-proof ‘Ro’ method to deal with stress, solve problems, and enjoy the process!",
  "description": "A ‘normal’ life is not always a ‘happy’ life.“… grant me the courage to change the things that I can change, the serenity to accept the things that I cannot change, and the wisdom to know the difference between the two”, is a popular motto by Alcoholics Anonymous. Most of us fail in the third part, as we hopelessly try to change things that either are not amenable to change or unworthy of our time and energy.Dealing effectively with either major life events or daily stressors requires the ability to maintain composure, take a time-out and ‘talk sense’ to oneself. Useful questions to ponder when under pressure include:-Is there something I can do right now to solve this problem?-Is it worth my time and energy?-Is my behaviour helping me deal with this and accomplish my ultimate goals?-What can happen to me, if I continue acting in a state of frenzy or remain depressed?-How long can my body endure in this state, without sustaining any undesirable health consequences?-How can I use this event?-What have I learned from it?-What good do I see in all of it?The book aims to inspire, as well as to educate. In the first part the author discusses stress, its sources and its effects, followed by the ‘Ro’ Method, a simple but complete problem solving process, and a number of examples and real life applications. Then, using a light, humorous and innovative style, the author describes the day of ‘Don Stressote,’ a modern Don Quichote de la Mancha and ‘Ro’ Method graduate, who attempts to apply the theory in everyday life situations. Armed with courage and stoicism, Don deals with the monsters and the dragons (the idiots) of the 21st century: his partner who entered the toilette first and is reading the newspaper insensible to the needs of others, the obese fellow in the elevator, the traffic jam, his stupid boss, the thick-skinned client, as well as the most difficult person among all – his own self and his irrational expectations…A number of applied psychological techniques, combined with examples and exercises assist the reader to make positive changes towards a) either solving problems or b) altering the way s/he sees the situations.",
  "genres": [],
  "author": "Angelo Rodafinos",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/22039583-idiots-are-invincible"
}