{
  "title": "Seven Year Rule",
  "description": "Beth and Josh befriend a young couple. Whitney and Mason's life was perfect. When Beth explained her Seven Year Theory. They scoffed at the idea of the seventh year of marriage being the make it or break it year for most couples. That theory didn't apply to them. They were the perfect couple. Their brand new house overlooked the lake. Their brand new cars were state of the art. Their careers were taking off at an accelerated rate. Their sex life was incredible. Their lives were exactly the way they intended. Perfect. When Whitney's widower brother-in-law dies, leaving them three small children, their perfect lives are torn apart. Raising children was never part of their plan. Raising children requires sacrifice. Sacrifice they never intended to make. Sacrifice that could bring an end to their perfect way of life. Sacrifice that could bring an end to their perfect marriage. Sacrifice, that if not done correctly could bring an end to a child's life.Mason considered himself incredibly lucky to have a wife like Whitney. She was beautiful, sexy, smart, had a professional attitude toward life and she wasn't interested in starting a family. When Whitney's widower brother-in-law was killed leaving his three small children in Whitney and Mason's charge, Mason is exposed to a new side of Whitney. A side he was not prepared for, a side he never thought he'd see.Suddenly Mason's world was filled with diapers and stains. His perfectly coiffed wife quickly transformed into an unkempt mother of three living in jeans and carrying a diaperbag as a purse.Mason's needs were no longer being filled. His house was a noisy mess. There was a 6 year old boy looking to him for fatherly attention. But fatherhood requires a man to live for his children and not himself. Mason was not prepared to do that, but how could he walk away from Whitney in her hour of need?",
  "genres": [
    "Audiobook"
  ],
  "author": "Alaina Stanford",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/22039157-seven-year-rule"
}