{
  "title": "Manannan Trilogy",
  "description": "Box Set of best-selling novels.Travel back in time to an age where knowledge was magic and people roamed the seas looking for a better life.This box set contains three novels set in the countries around the Irish Sea in the ninth century. They follow the fortunes of a family, Manannan, his daughter, Niamh, and his granddaughter, Emer. All three possess the ability to see into the future, which leads them into strange adventures.These books are: Manannan’s Magic, Niamh of the Golden Hair and Emer’s Quest.Manannan's Magic: Fantasy winner UK Authors Opening Pages Competition 2008“My enchantments are only the magic of the earth itself and the things that grow. I heal not harm. I repeat, \"you have no need to fear me.”“You won't turn me into a frog, will you?”“I prefer you the way you are,” he replied with a smile.Manannan McLir escapes his enemies and finds sanctuary, for a little while, on the Isle of Man. Both feared and urgently needed, he uses his skills and the strange knowledge from the East to cure wounds and sickness.Among his patients is Renny, a young Celtic girl who falls in love with him and is witness to a terrifying experience one night. As he tells her later,“My visions are the only true magic I possess, and this knowledge must be kept a deadly secret, otherwise my life, and perhaps yours, is in peril.”These visions predict the future, for other forces are stirring in this Year 800. When the Vikings invade, bringing with them Manannan’s bitterest enemy, a great battle takes place and Manannan must escape from the island. But he is surrounded and only cunning, not magic, can help him now.Niamh of the Golden Hair:“But who am I? What am I? Why does any mention of my father arouse such fear?”“Because you're a witch, like your father and his mother before him.”Terrified of her father's powers if she comes to harm, Niamh's uncle arranges a marriage for her far away from her family home but she never arrives. On the journey, her horse throws her into a swollen river which carries her away.When she is rescued, she can no longer remember her name or anything about her past life. No one comes to inquire after her, so her rescuers decide to send her to the High King for help.Near the High King's stronghold, Viking raiders come upon the party and Niamh finds herself on a ship bound for unknown lands, the property of the warrior, Olaf. He keeps her with him and, little by little, she finds herself falling in love with him.But the future holds danger for both of them. Olaf's former lover, Kolgrimma, tries to kill Niamh. Olaf is seriously wounded in battle. Seeking help to heal him of his wounds, Niamh and Olaf journey to meet the Red Lady, Renny, and Niamh's father Manannan.Will Olaf and Niamh be able to Manannan in the country that will one day be called Wales?Can the 'magician' heal him of his wounds? Will Niamh ever find happiness and peace?Emer's Quest:Sail to Staffa, Skye, Iona, the Isle of Man and even the Faeroe IslandsEmer has inherited her grandfather Manannan's ability to dream about future events. Foreseeing that her father, Olaf, will be shipwrecked on Staffa, Emer tries to stop him sailing but she is too late. Persuading her friends to go after him, they rescue one of his companions but Olaf has already been sold as a slave. A trader, Atli, discovers Emer's ability to dream and promises to rescue her father if she will marry one of his sons and use her gift for the good of his family. Olaf is found on the Faeroe Islands and returned home. Now Emer must keep her oath and marry Hari, who does not want her. She dreams that Hari will be burnt alive aboard the fireship carrying his dead father. Will her dream come true? Can she rescue her husband? Will they find anywhere to live in peace?",
  "genres": [
    "Historical Romance",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Historical Fiction"
  ],
  "author": "Michele McGrath",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/22041622-manannan-trilogy"
}