{
  "title": "Kid Docs",
  "description": "Fourteen-year-old Connor Hansen became a doctor two days ago--along with all of his friends. They are child prodigies who were selected at just three years old to undergo intensive medical training as part of an experiment called Kid Docs.KID DOCS tells the story of Connor's first days as an emergency room doctor. Connor experiences his first pangs of love (toward fifteen-year-old obstetrician, Cassie), deals with his explosive older brother (a sixteen-year-old heart surgeon), and tries to figure out why his friendship with fourteen-year-old fellow ER doctor Hannah has suddenly changed. At the same time, Connor learns to save lives and discovers that some lives cannot be saved.CYBILS AWARDS NOMINEE!What kids and adults are saying about KID DOCS:\"Five stars. Amazing! I am actually speechless because it was so good. I would read it over again. I recommend this book to anyone.\" - Shelby, Goodreads\"Loved every little bit of it! Couldn't stop reading!\" - Adam, Goodreads\"I'm ready for more! A five star book EASY!\" - Pepper, Goodreads\"Intriguing. Incredibly engaging. I highly recommend this book. It's definitely a read you won't forget.\" - Amy, Goodreads\"This was one of the only books I found that was age appropriate for my middle school children to cultivate their interests in the field of medicine. A great starting point for conversations about the work of a doctor and to engage children in discussions about the medical profession\" - Nick, Amazon\"The hospital setting was rich and accurate, with enough medical details to pique the curiosity of kids who might be so inclined, or to feed the fascination of adults who like to watch medical shows. I always appreciate dramatic suspense in a novel, and this one had it. Plenty of plot points kept me reading: finding out how the kid docs will react to the pressure, the fate of the patients who come into the hospital, and even the fate of one of their own.\" - Jennifer Donovan, 5 Minutes for BooksDon't miss this chance to slip behind the scenes into a world that few people ever experience first-hand, the life of a physician in training!",
  "genres": [
    "Young Adult",
    "Medical",
    "Fiction"
  ],
  "author": "J.W. Lynne",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/22042347-kid-docs"
}