{
  "title": "The Last Fish Tale: The Fate of the Atlantic & Survival in Gloucester, America's Oldest Fishing Port & Most Original Town",
  "description": "The bestselling author of Cod , Salt , and The Big Oyster has enthralled readers with his incisive blend of culinary, cultural, and social history. Now, in his most colorful, personal, and important book to date, Mark Kurlansky turns his attention to a disappearing way of fishing–how it has thrived in and defined one particular town for centuries, and what its imperiled future means for the rest of the world.The culture of fishing is vanishing, and consequently, coastal societies are changing in unprecedented ways. The once thriving fishing communities of Rockport, Nantucket, Newport, Mystic, and many other coastal towns from Newfoundland to Florida and along the West Coast have been forced to abandon their roots and become tourist destinations instead. Gloucester, Massachusetts, however, is a rare survivor. The livelihood of America’s oldest fishing port has always been rooted in the life and culture of commercial fishing.The Gloucester story began in 1004 with the arrival of the Vikings. Six hundred years later, Captain John Smith championed the bountiful waters off the coast of Gloucester, convincing new settlers to come to the area and start a new way of life. Gloucester became the most productive fishery in New England, its people prospering from the seemingly endless supply of cod and halibut. With the introduction of a faster fishing boat–the schooner–the industry flourished. In the twentieth century, the arrival of Portuguese, Jews, and Sicilians turned the bustling center into a melting pot. Artists and writers such as Edward Hopper, Winslow Homer, and T. S. Eliot came to the fishing town and found inspiration.But the vital life of Gloucester was being threatened. Ominous signs were seen with the development of engine-powered net-dragging vessels in the first decade of the twentieth century. As early as 1911, Gloucester fishermen warned of the dire consequences of this new technology. Since then, these vessels have become even larger and more efficient, and today the resulting overfishing, along with climate change and pollution, portends the extinction of the very species that fishermen depend on to survive, and of a way of life special not only to Gloucester but to coastal cities all over the world. And yet, according to Kurlansky, it doesn’t have to be this way. Scientists, government regulators, and fishermen are trying to work out complex formulas to keep fishing alive.Engagingly written and filled with rich history, delicious anecdotes, colorful characters, and local recipes, The Last Fish Tale is Kurlansky’s most urgent story, a heartfelt tribute to what he calls “socio-diversity” and a lament that “each culture, each way of life that vanishes, diminishes the richness of civilization.”",
  "genres": [
    "History",
    "Nonfiction",
    "Food",
    "Science",
    "American History",
    "Audiobook",
    "Animals"
  ],
  "author": "Mark Kurlansky",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/2204476.The_Last_Fish_Tale"
}