{
  "title": "SOUL CALL: When was the last time you listened to your SELF?",
  "description": "In our rush for success, life just seems to go on, in a meaningless manner. And one day, somewhere at the end of the summer or in the autumn of life, it appears that we were not there to live it. We just were not there, to savour the moments. We did not listen to what life had been whispering to us….what our soul had to tell us. We were too busy to be truly there in ‘that’ moment of life. We were too busy worrying about what could be, what we were missing and where we wanted to reach. We had been too busy fantasizing about the destination and missed the whole beautiful journey, little knowing that each moment of the journey was a destination, complete by itself, full of meaning and purpose, full of beauty and grandeur. And in those unending years of our sleep – life simply passes by.  Those beautiful moments, which could have easily been lived, just disappear in the haze of time. Those loving touches we never felt, remain only as part of our sub conscious. Those feelings which make life worth living, get lost in the folds of time. Those souls who have been there with us for so many lifetimes come and go away un-recognized – always a smile away, a touch away but we are too enmeshed in the role we are playing.  But then, sometimes if you are lucky enough, comes that mysterious phase in life when the past seems to fall in place, the present becomes meaningful and the future seems to acquire a purpose. And then you realize that perhaps this is the true beginning… that it is spring, really and truly, only when you awaken….it is morning only when you come out of your stupor.  It is then and only then that we truly start living … living with awareness … living with a purpose and most importantly start savouring life.  This book is about reliving those lost moments, discovering the meaning & significance of those ordinary yet profound moments of life.  I was indeed fortunate to recapture what my Soul had been calling out to me…..  Kuch aur bhi hain meri zindagi ki tasweerein main woh nahin jo yaron ne mujhe samjha hai - Unknown  [ There are many more dimensions to my life; I am much more than what my buddies have known about me]",
  "genres": [],
  "author": "Abhay",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/22043235-soul-call"
}