{
  "title": "The Feast of Bacchus",
  "description": "In the remote hamlet of Thorlund stands the manor house known as the Strath, an eerie place that exercises a mysterious hold over anyone who enters it. The site of tragedy in 1742 when its owner, Sir John Hooper, turned highwayman and met his death on the gallows, the Strath has remained vacant for over a century, a pair of hideous masks its only occupants. When the novel opens, the Strath’s new owner has just arrived from America to take possession of the house, but he is soon found horribly murdered. Now the next heir, young Charles Conway, has come to the Strath, and the house begins to work its baneful influence on him and on the local residents, causing them to behave in bizarre and violent ways. What is the connection between the sinister power of the Strath and the ghastly masks that adorn the wall? And once Conway and the others are drawn within the evil place, can any of them possibly survive?“One of England’s lost novelists, a writer of startling abilities” (Times Literary Supplement), Ernest G. Henham, who also published under the pseudonym “John Trevena,” was the author of bizarre Gothic fantasies such as Tenebrae (1898) and The Feast of Bacchus (1907), as well as a number of unusual and highly imaginative works set in Dartmoor. This first-ever republication of Henham’s novel includes a new introduction by Gerald Monsman.“[A] book of strange adventures, of ghostly, nightmare visions; you will want to read it at a sitting, but do not begin it at bedtime unless your nerves are in a thoroughly healthy condition” – The Reader“[Q]uite a remarkable book . . . Mr. Henham has the exceptional gift of lending an atmosphere of reality to the fantastic. … Some people will find the book enthralling: others may pronounce it quite mad, but everyone must recognise its undeniable cleverness.” – The Outlook“This strange story … has a tropical luxuriance of imagination quite unusual in works by English writers. . . . an atmosphere of eeriness and mystery strongly reminiscent of Poe. The plot is clever, the characters well-drawn; but it is in his power to create an atmosphere of vagueness and suggestion that Mr. Henham may be said to possess something very like genius.” – The Publisher",
  "genres": [
    "Horror",
    "Gothic",
    "Weird Fiction",
    "Fantasy",
    "Victorian",
    "Ghost Stories",
    "Mystery"
  ],
  "author": "Ernest George Henham",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/22045499-the-feast-of-bacchus"
}