{
  "title": "Clan, Honor, and Empire",
  "description": "Dramok Rajhir has never had to go without. He’s been blessed with the best schooling, a prestigious pedigree, a fine home, plus all the intimate companionship a young Kalquorian male could ask for. But with status comes responsibility. His father insists Rajhir assume his place in Kalquorian society as soon as possible. Rajhir is determined to have some fun however, and all the machinations in the world won’t convince him to build his clan until he’s ready for it. He doesn’t count on true love walking into his office with a story of political intrigue that could put all of the Kalquorian Empire in jeopardy. Imdiko Flencik is a brilliant young surgeon who stumbles upon a smuggling operation with far-reaching implications. Desperate to stop men willing to sell Kalquor’s future to an ancient enemy, he chances upon Rajhir, whose connections may mean the difference between life and death. It’s not just the Empire’s future that hangs in the balance, however. Flencik knows falling in love with this playboy Dramok could shatter his already bruised heart. Nobek Breft is a young man still in training camp. He has no prestige and no future, yet his fierce personality yearns for the perfect clanmates to protect. When he meets Rajhir and Flencik, all he can think of is to prove himself worthy of their love. He will do anything to keep them safe ... a tall order he may not possess the skills to fulfill. Political enemies who have already killed once have set their sights on the men Breft would call clanmates. Honor is the three men’s code, the thing they hold most dear. Yet when love and duty clash, they must decide if their loyalties lie first with the Kalquorian Empire or each other.  Mature subject matter, including elements of BDSM.",
  "genres": [
    "M M Romance",
    "Menage",
    "BDSM",
    "Science Fiction",
    "Romance",
    "Aliens",
    "M M M"
  ],
  "author": "Tracy St. John",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/22042106-clan-honor-and-empire"
}