{
  "title": "Silk",
  "description": "Eleven of your favorite authors - New York Times, USA Today, bestselling and more.  Eleven men who will be put to the test when it comes to love.  One epic anthology.  Meet the men:  • Ryland Dare (The Edge of Darkness): A privileged boy living a life of lies.  • Reid Connely (Let Love In): A gorgeous and darkly mysterious college senior who understands pain all too well.  • Deacon Chastain (A Blue Tale): A guitar player saved from a path of destruction by his rock idol and the music he creates.  • Connor Simpson (Next to Forever): A fiancé who seems to have it all until he’s faced with one of the toughest decisions of his life.  • Brett Walker (Trusting You): A one-night stand who wants more finds himself put to the test when his past threatens his future.  • Adam Hill (Remembering Joy): A brooding and strangely charming film student set on revenge finds love where he least expects it.  • Ryan Campbell (Falling): An abuse survivor living in a world of his own creation so he doesn’t have to feel.  • Harrison James (My Unexpected Forever): A single dad with few expectations other than raising his son and making some music along the way until the unexpected happens.  • Adam Burke (Better): An adventurer who works just enough to fund his next circle around the globe gets an opportunity he can't refuse. The only catch? He won't be traveling alone this time.  • Luke Matthews (Love In Between): A guitar player grieving the loss of his fiancée after a tragic car accident no longer believes in love.  • Jonathan Statham (Mid Life Love): A self-made billionaire and CEO of Statham Industries used to getting whatever he wants—whenever he wants.  Find out their stories in these eleven, previously released, full-length novels about regret, revenge, forgiveness, and ultimately, love:  \nThe Edge of Darkness\n by Melissa Andrea \nLet Love In\n by Melissa Collins \nA Blue Tale\n by Sarah Dosher \nNext to Forever\n by S. Moose \nTrusting You\n by L.P. Dover \nRemembering Joy\n by Jenni Moen \nFalling\n by E.K. Blair \nMy Unexpected Forever\n by Heidi McLaughlin \nBetter\n by Carey Heywood \nLove in Between\n by Sandi Lynn Mid Life Love by Whitney G.*Mature subject matter and not intended for those under the age of 17.",
  "genres": [
    "Anthologies",
    "Contemporary Romance",
    "Romance",
    "Contemporary"
  ],
  "author": "Melissa Andrea",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/22045240-silk"
}