{
  "title": "Show the Fire",
  "description": "Len Wahlberg, the Night Horde MC’s Sergeant at Arms, has had Isaac Lunden’s back for decades. A loner at heart, he has needed no closer bond than the brotherhood of his club. For years, he’s preferred to take his women in groups, because he has neither needed nor wanted the intimacy of a coupling.But after he’s seriously wounded in a firefight, feeling his age and mortality more acutely than ever before, he discovers that his own company isn’t enough any longer. He needs a stronger, more intimate bond, and he finds that connection in an old friend.Natasha Westby is a club daughter. Her father, the Horde’s first SAA, raised her alone, within the rough and rowdy walls of the clubhouse. After a torrid, youthful affair with Isaac ended in public humiliation and heartbreak, Tasha left Signal Bend and found a safe distance from which to make a life—close enough to stay connected to her family, but far enough to live her life outside the club. She built a complete, contented, unconventional life that has little to do with Signal Bend or her club family.As a doctor working at the nearest hospital, she finds herself involved more and more deeply with the club as its business becomes more and more dangerous. When her family ties finally upend her separate life, she is drawn back home and into Len’s arms.While Len and Tasha try to understand and define their connection to each other, and Tasha struggles with her reentry into the world of the club, the Horde’s unwilling entanglement with a dangerous drug cartel becomes deadly. Fighting for justice and freedom against a man who will commit any atrocity to assert his power, the Horde family experiences pain and loss the likes of which it has never known before.Love and hope are all they have left.Note: dark themes, explicit sex, and graphic violence.",
  "genres": [
    "Romance",
    "Dark",
    "Contemporary Romance",
    "Contemporary",
    "Abuse",
    "Erotica",
    "Suspense"
  ],
  "author": "Susan Fanetti",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/22046262-show-the-fire"
}