{
  "title": "Abbot’s Keep: A Ghost Story",
  "description": "“Brother, do not try to follow me once you have read this. No good can come of it . . .”When Clifford Fox QC receives a desperate letter from his estranged younger brother, Simon, he departs his comfortable Yorkshire home to locate him. The letter outlines the harrowing events that have led Simon to the very edge of sanity.Following a stint at the Brentwell Rehabilitation Unit, failed architect and recovering alcoholic, Simon, is invited by an old school-friend to Abbot’s Keep - a Tudor residence, nestled deep in remote Berkshire countryside. Soon after arriving he is left to explore the neighbouring monastery ruins and discover the house’s dark history. But the more he learns, the more certain he becomes that he is not alone at Abbot’s Keep, and that nothing is as it seems. But can he stop the house’s medieval past repeating itself one final time? And can his brother find him before it’s too late? Reviews ‘Abbot’s Keep is refreshing a hell. Finally, a ghost story that reminds you why the basement is so terrifying!’ Brett McNeill of Rue Morgue Magazine ‘Ashforth does Edgar Allen Poe and Bram Stoker proud delivering a solid contribution to the literary movement. It is time that the ghost story made a comeback. With writers like Benedict Ashforth writing Abbot’s Keep, a revival just might be at hand.’ Matthew J. Barbour of Horror Novel Reviews ‘A really entertaining read with a delightful frisson of fear.’ Simon Ball of Horror Hothouse‘Ashforth builds on the tension and the feeling of unease with each page to revel in a wonderfully tense and unnerving finale.’ Jim Mcleod of Ginger Nuts of Horror‘Reminiscent of Poe, Abbot's Keep by Benedict Ashforth is a haunting novella with unique form and beautiful prose.’ Michael Bailey (HWA Bram Stoker Award Nominee) ‘. . . an eerie, atmospheric ghost story . . . has a gentle eeriness that keeps the reader wanting to find out more.' Julie K Top 50 Reviewer ‘Perfect ghost story.’ Christine Waddington 'Ashforth successfully builds a dark and relentless dread that steadily creeps through the text. Extremely accomplished.’ L Sharif ‘A gripping read right from the beginning. Couldn't put it down.’ D Boydell ‘I just could not put this story down. I wanted to know what happened as soon as I picked up my kindle. Strongly recommend.’ Mr Tony Cordon ‘The actual writing is wonderful, beautifully descriptive.’ Fiona White ‘I could not stop reading! it was as though I was in a trance, the story is captivating and very original.’ Safa R ‘A fantastic read, lots of twists and turns. Would recommend this to all Mystery readers. A book that is hard to put down.' Ms P Frain ‘. . . great plot and a well developed storyline. It is elegantly told with well built atmosphere and tension . . . a well conceived idea and would make excellent viewing were it ever to be dramatized.’ Cate Hamilton Read over 170 more reviews on amazon.co.uk",
  "genres": [
    "Horror",
    "Fiction",
    "Audiobook",
    "Ghost Stories",
    "Gothic",
    "Novella",
    "Paranormal"
  ],
  "author": "Benedict Ashforth",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/22046750-abbot-s-keep"
}