{
  "title": "The Darlington Incident",
  "description": "The note read simply: Meet me at the Westerfield Estate gatehouse at midnight during their Ides of March ball. Bring the twenty-five thousand in notes to exchange for the plans.Though spymaster John Andrews does not know the identity of the plotters, he is determined to catch them at their treasonous game. Posing as Lord Darlington, he joins the Westerfield weekend fete. Resourceful and clever, he is ready for anything... except falling for his prime suspect, the lovely wallflower Miss Eliza Hunt.When he finds secret government documents hidden in Eliza's trunk, his temper gets the better of him and he takes her to task, applying a riding crop to her bare bottom. But new evidence leads him to believe Eliza may be innocent and John fears he can bid farewell to his career after getting fresh with the daughter of the wealthy and well-connected Hunt family.Eliza knows Lord Darlington is not the gentleman he purports to be, but he is the first man to see beyond the ugly birthmark on her face and treat her like a beautiful woman. As he draws her out of her shell and demands she let go of her self-doubt, his claim on her heart grows stronger, even when it becomes clear he stands ready to punish defiance with firm chastisement!John cannot wait to catch the traitors, clear Eliza of all suspicion, and then claim her as his own, but at the same time he fears his darker desires may mean he is not the sort of man worth having as a husband. Can her whole-hearted love free him from the demons of his past?Publisher's Note: The Darlington Incident is an erotic romance novel that includes spankings, anal play, sexual scenes, and more. If such material offends you, please don't buy this book.",
  "genres": [
    "Historical",
    "Historical Romance",
    "BDSM",
    "Erotica",
    "Regency",
    "Romance",
    "Novella"
  ],
  "author": "Renee Rose",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/22049179-the-darlington-incident"
}