{
  "title": "The Publicist: Book One and Two",
  "description": "Can one woman change an age-old institution like publishing? Probably not, but Kate Mitchell sure wants to try. As a publicist with a large, respected New York publishing house, Kate finds herself at the mercy of a broken publishing system, books that don’t sell, and author egos that are often, well, as big as the island of Manhattan.Enter the star editor, MacDermott Ellis: Tall, handsome, charismatic, married, and ready to save the day. Then there’s Allan Lavigne, once a revered author—now as forgotten as last year’s bestsellers and his nephew Nick: Tall, gorgeous, sweet, single, and ready to sweep Kate off her feet. Kate wants to do the right thing but her hormones seem to be driving her decisions.As Kate tries to navigate the landmine of publicity, over-the-top author expectations, and the careful dance of “I’m sorry, your book isn’t on the bestseller list this week,” she also finds authors who are painfully overlooked by a publisher wanting more romance and sex, more celebrities, and more scandal.Includes Book Two:Publishing: An industry of out-of-control of egos, unrealistic expectations, and books with the shelf life of milk. This is Kate’s world, but for how long?When one of Kate Mitchell’s star authors is carted away in handcuffs, she thinks it’s only the beginning of her troubles. As her world crumbles around her, Kate desperately looks for anyone to hold onto but finds that happy endings are truly works of fiction. When her career and love affair hit their expiration date, Kate sets off on a new adventure….Starting over in California is easy, but Kate soon learns that leaving her old life behind isn’t. Nicholas Lavigne is eager to help her forget, but two things still own her heart, the dream of discovering the next great American novel, and MacDermott Ellis. As Kate tries to rebuild her life she finds a surprising gift that reboots her career in a new and unexpected direction. Suddenly her name becomes synonymous with one of the biggest bestsellers publishing has seen in ages and she's welcomed back with open arms. At the height of her success the ghosts of her past come back to remind her of the world she'd been trying to forget and the man who never let go of her heart. Behind the book, there’s always more to the story.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Anthologies",
    "Fiction",
    "Amazon"
  ],
  "author": "Christina George",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/22049661-the-publicist"
}