{
  "title": "Project Elfhome",
  "description": "Stories exploring the fascinating realm of Elfhome, a world where modern day Pittsburgh has collided with the kingdom of the Elves. A special entry in the the best-selling Romantic Times Sapphire award winning Elfhome series. Contains some of Wen Spencer's best shorter works including gems \"Bare Snow Falling on Fairywood,\" \"Pittsburgh Backyard and Garden,\" \"Peace Offering,” and more tales set in the world of best-selling Elfhome series entries Tinker, Wolf Who Rules, Elfhome, and Wood Sprites!Pittsburgh: a sprawling modern Earth city stranded in the heart of a virgin forest on Elfhome. Sixty thousand humans, twenty thousand black-winged tengu, ten thousand elves, an unknown number of invading oni, four unborn siblings of an elf princess, three dragons, and a pair of nine-year olds geniuses.For every story written, there's a thousand others not told. Lives interweave. Fates intersect. People change one another, often without realizing the impact they've made on others. They come together like a mosaic, little pieces creating a greater picture.Project Elfhome tells the stories of those impacted by Tinker and Windwolf as they struggle to make Pittsburgh a safe haven. Some of the characters are familiar: Stormsong, Pony, Blue Sky, and Lain. Others are new to readers.Law forages for wild plants and fish to sell to elf enclaves. A social misfit, she drives a hundred year old Dodge, has a pet porcupine, and saves damsels in distress in her spare time. A mysterious phone call sets her on a collision course with danger as she races to save a young female elf.Jane Kryskill is the producer for the popular TV series Pittsburgh Backyard and Garden. She spends her days keeping her host, Hal Rogers, from getting himself killed as he takes on man eating plants. She's not happy when the network drops famed naturalist Nigel Reid and his cameraman in her lap to film Chased by Monsters.Olivia is sixteen, a runaway wife of a religious cultist, illegal immigrant, and soon to be mother. As Pittsburgh plunges into war, she makes a desperate bargain with the mad elf lord, Forest Moss.As the war between the elves and the oni builds to a head, these three women struggle with their own problems, supported by a circle of unique friends, yet entangled with each other.The Elfhome SeriesTinkerWolf Who RulesElfhomeWood Sprites",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Short Stories",
    "Science Fiction",
    "Fiction",
    "Magic",
    "Anthologies"
  ],
  "author": "Wen Spencer",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/22047570-project-elfhome"
}