{
  "title": "The Unchained Cuckold",
  "description": "The Unchained Cuckold is the most devastating and brutal book so far in The Uncertain Cuckold series. It is a novel which combines subtext, subtlety and subterfuge.The story resumes where Unforeseen left off, with Jill in a car park, dogging with Gary. A stranger wants to f*** her. Matt is watching as Gary orders Jill out of the car, to stand up and to let the stranger fuck her. Does Matt rebuke his conditioning before the sizzling sex escalates?All-out war seemingly breaks out between Matt and Jill. The engagement ring is wrestled from her finger, but by who? Matt continues to see Francesca, as both Valentine's Day and his own 30th birthday approach. Can he manage the burden of two beautiful women? What will happen when they both want to spend time with him on the same days? And what of Jill's teasing that Francesca is interested in a threesome with her and Gary? What of the evidence that mounts in support of her claims?Matt finds himself relegated to the spare room at the weekend, with Gary now staying over and assuming the role of the man of the house. His phone will light up with messages from Francesca. Can he maintain the secrecy of his affair from Jill? But what of Gary? What if he discovers Matt's deceit?David makes his presence known too, heating things up on his own proposed relationship with Jill. While the prospect of a honeymoon after the wedding is finally raised. Will it be just Matt and Jill journeying alone, or will they have company?And then there is Matt's confrontation of Jill's oldest, deepest secret. He defiantly points the finger of his suspicions about who her master was. We learn more than ever before, including why their relationship ended, how and why. Someone knows master's identity. Someone whom Matt knows very well.The Unchained Cuckold is the sequel to The Uncertain Cuckold, The Unwilling Cuckold, The Undefeated Cuckold and The Unforeseen Cuckold, also available on Amazon.Word count: 114,000+ words",
  "genres": [],
  "author": "V.T. Vaughn",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/22051725-the-unchained-cuckold"
}