{
  "title": "A Natural History of Rape: Biological Bases of Sexual Coercion",
  "description": "A biologist and an anthropologist use evolutionary biology to explain the causes and inform the prevention of rape. In this controversial book, Randy Thornhill and Craig Palmer use evolutionary biology to explain the causes of rape and to recommend new approaches to its prevention. According to Thornhill and Palmer, evolved adaptation of some sort gives rise to rape; the main evolutionary question is whether rape is an adaptation itself or a by-product of other adaptations. Regardless of the answer, Thornhill and Palmer note, rape circumvents a central feature of women's reproductive mate choice. This is a primary reason why rape is devastating to its victims, especially young women. Thornhill and Palmer address, and claim to demolish scientifically, many myths about rape bred by social science theory over the past twenty-five years. The popular contention that rapists are not motivated by sexual desire is, they argue, scientifically inaccurate. Although they argue that rape is biological, Thornhill and Palmer do not view it as inevitable. Their recommendations for rape prevention include teaching young males not to rape, punishing rape more severely, and studying the effectiveness of \"chemical castration.\" They also recommend that young women consider the biological causes of rape when making decisions about dress, appearance, and social activities. Rape could cease to exist, they argue, only in a society knowledgeable about its evolutionary causes. The book includes a useful summary of evolutionary theory and a comparison of evolutionary biology's and social science's explanations of human behavior. The authors argue for the greater explanatory power and practical usefulness of evolutionary biology. The book is sure to stir up discussion both on the specific topic of rape and on the larger issues of how we understand and influence human behavior.",
  "genres": [
    "Psychology",
    "Science",
    "Nonfiction",
    "Evolution",
    "Biology",
    "History",
    "Politics"
  ],
  "author": "Randy Thornhill",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/220535.A_Natural_History_of_Rape"
}