{
  "title": "When Kambia Elaine Flew in from Neptune",
  "description": "So I just made another note to add to my blue notebook later, when the house had cooled Tia's nature is boiling out of her like hot soup out of a pot, and Kambia Elaine just flew in from Neptune.Shayla Dubois lives in a Houston neighborhood known as the Bottom, where life is colorful but never easy. She wants only two things out of to become a writer and to have a nice, peaceful home. Instead, her life has been turned upside down. Shayla's mama kicked her sister, Tia, out of the house for messing around with an older guy, and months later Tia still hasn't come home. Shayla's father, Mr. Anderson Fox, has rolled back into town and has been spending a lot of time at the house with Mama. And Shayla still doesn't know what to make of her strange new neighbor, Kambia Elaine.Kambia tells Shayla the most fantastic that the Lizard People turn into purple chewing gum when the sun comes up; that Memory Beetles gather up and store people's good memories; that she is a piece of driftwood from the Mississippi River. All Shayla knows for sure is that Kambia's mother has a lot of male visitors and that Kambia doesn't look too healthy. When Kambia tells Shayla about the vicious Wallpaper Wolves that hide in her walls to catch bad little girls, Shayla knows something is wrong. But she doesn't know how she can help Kambia when she can't get past her stories, and when Tia still hasn't come home.Told lyrically and gracefully by debut author Lori Aurelia Williams, When Kambia Elaine Flew in from Neptune shows how complicated life can get when children are forced to grow up too quickly, while it also celebrates the bonds of a strong, loving family.",
  "genres": [
    "Young Adult",
    "Fiction",
    "Realistic Fiction",
    "Childrens",
    "Historical Fiction",
    "African American",
    "Juvenile"
  ],
  "author": "Lori Aurelia Williams",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/1128848.When_Kambia_Elaine_Flew_in_from_Neptune"
}