{
  "title": "Malafarina Maleficarum Volume One",
  "description": "In Germany, in 1487 Heinrich Kramer and Jacob Sprenger published what was to be considered one of the most famous medieval exposés on witches, called the Malleus Maleficarum. The purpose for the book was two fold. Firstly, it was meant to challenge all arguments against the existence of witchcraft and secondly to instruct magistrates on how to identify, interrogate and convict witches.  Sunbury press presents this collective volume of some of horror author, Thomas M. Malafarina's early works and in homage to the \"Malleus Maleficarum\" have entitled it \"Malafarina Maleficarum\". It contains Thomas's debut novel \"99 Souls\" as well as stories from his first horror short story collection \"13 Nasty Endings\".  \"99 Souls\" is a novel of demonic horror, which takes place in Schuylkill County, PA during three different periods, starting in 1965, then flashing back to 1895 and eventually ending in 1985. The story revolves around a legend of a soul-sucking demon that dwells in an abandoned coalmine. As a young man, the creature was trapped in a mine during a cave in and was tricked into selling his soul for a chance to survive. However, before he can gain his freedom, he must collect the souls of 99 humans as payment to his dark master. The novel is suspenseful, awash in local coal region color, is sometimes quite gory and descriptive; but never ceases to be a page-turner.  \"13 Nasty Endings\" is a collection of 13 short stories, each of which is truly nasty and eventually ends badly for someone. It was Thomas's first foray into short story writing and since its original publication these and many other of his short stories have appeared in numerous anthologies, online horror magazines and have been featured on audio podcasts as well. Each of the stories is unique, terrifying and often disturbing.  So sit back in your favorite reading chair, dim the lights and prepare to read a great collection of some of the earliest published works of Thomas M. Malafarina and become familiar with his special writing style. We are certain you will not only love what you read but will be left hungry for more.",
  "genres": [],
  "author": "Thomas M. Malafarina",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22051090-malafarina-maleficarum-volume-one"
}