{
  "title": "Geopolitics: A Very Short Introduction",
  "description": "In places such as Iraq or Lebanon, moving a few feet on either side of a territorial boundary can be a matter of life or death, dramatically highlighting the connections between geography and politics. This Very Short Introduction illuminates the concept of geopolitics, revealing how acountry's location and size as well as its sovereignty and resources all affect how its people understand and interact with the wider world. Using wide-ranging examples, from historical maps to James Bond films and the rhetoric of political leaders like Churchill and George W. Bush, Klaus Doddsdescribes how people and places are inter-connected with each other, and how our geopolitical outlook molds our understanding of the world. He shows why it is vital that we understand how and why we divide the world into zones and territories--and how these divisions depend on your perspective. Thebook explains how terrorism, globalization, environmental degradation, and new technologies such as the internet are all challenging the geographical basis of global politics, and it sheds light on the history of terms such as \"the iron curtain,\" \"the third world,\" and \"the axis of evil.\"About the Oxford's Very Short Introductions offers concise and original introductions to a wide range of subjects--from Islam to Sociology, Politics to Classics, and Literary Theory to History. Not simply a textbook of definitions, each volume provides trenchant and provocative--yet alwaysbalanced and complete--discussions of the central issues in a given topic. Every Very Short Introduction gives a readable evolution of the subject in question, demonstrating how it has developed and influenced society. Whatever the area of study, whatever the topic that fascinates the reader, theseries has a handy and affordable guide that will likely prove indispensable.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Geography",
    "International Relations",
    "Political Science",
    "Science"
  ],
  "author": "Klaus Dodds",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/2205382.Geopolitics"
}