{
  "title": "Cross Climax II",
  "description": "From the imagination of Tiana Laveen comes an eye-opening, page-turning, sensually enthralling compilation of diverse love stories presented in the “Cross Climax” series. “Lights! Cameras! Attraction!” – This is the tale of a single mother simply trying to make ends meet. In desperation and a twist of fate, Monica becomes the latest fresh-meat porn star to hit the industry. Her acting partner and mentor, an Italian gentleman named Antonio, shows her the ropes. Little do both of them know that falling in love could occur with bright lights, movie cameras, and your panties down. The stakes of money and fame are high. Which will win – love or dividends? “The Bride in Red” – Arashi Takahashi is a Japanese-American psychiatrist and workaholic. He is taken to an urban ballet in which the beautiful Angel Grace takes stage and blows his mind. The whirlwind romance that ensues is soon interrupted by an obstacle course that involves a disapproving family and jealous ex-girlfriend. Angel dances into Arashi’s heart. Now the only question is whether she can survive the monsoon that follows. “The ‘N’ Word” – Recently convicted Nazi, Aaron Pike, is in Maximum Security for a violent assault. Once a revered white supremacist, Aaron begins a transformation while incarcerated. He participates in an inmate pen pal program with Mia Armstrong, an elementary school teacher. Once they arrange to meet, Aaron is flabbergasted to see that the woman he has fallen madly in love with via letters and phone calls is African-American. Aaron has to make a go back to the world of treachery and hatred or keep his beloved and build a life with her, forsaking his cause and identity while abandoning the group of peers he once called family. *Also A Surprising Bonus Story!",
  "genres": [
    "Interracial Romance",
    "Erotica",
    "Erotic Romance",
    "Anthologies"
  ],
  "author": "Tiana Laveen",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/11289271-cross-climax-ii"
}