{
  "title": "The Spark Series: The Complete Box Set",
  "description": "Three full-length novels in the Spark SeriesSpark, #1Burn, #2Flame, #3 - Companion novelOver 212K words & 825 pages **Not intended for readers under the age of 18. Mature content including sexual abuse, strong language, and explicit sex scenes. Contains some sensitive issues regarding pregnancies.**SPARKWhen your past controls your future, how do you move forward?Velaney Wills knows about that all too well.Weak, powerless, and fearing the one person who has hurt her the most...can she overcome the barriers to move forward?Being saved by a muscled Godsend was never on her agenda, but when firefighter, Eric Reilley comes into her life unexpectedly, everything changes.Velaney has never felt loved or cared for, and her past prevents her from letting anyone in. Eric manages to break down her walls--despite the repercussions that come for them afterwards.They have an undeniable spark--something she has never felt before, but will it be enough? Can love overcome all obstacles? Can they save each other to protect their love or will her past shatter everything she never knew she needed...?*****BURNJust when Velaney thinks she is safe again...her worst nightmare comes back to haunt her.Eric is dealing with his own insecurities as he tries to accept Velaney's decision to help the enemy...can he get past it? Will they be there for each other in the end?Eric struggles to step aside and trust Velaney...but will his past keep him from doing so? Can he let go in order to move forward?Velaney and Eric had their fair share of ups and downs in SPARK...their love was undeniable and intense. Just when you think they could get their happily ever after...pasts collide and merge together...will they fight for what they want?Or will their love crash and burn?*******FLAME - Companion novel (can be read without reading the first two)Carissa Wright doesn't do relationships.Raised with a junkie mother and an alcoholic father, building relationships were far off her list. Rather, one night-stands were her usual. Carissa has one constant in her life--her best friend Velaney. Completely opposite of each other, yet they balance each other out.Although Carissa admits to only wanting sex and nothing more, will she allow the one guy who wants to break down her walls or will she run out of fear for finally letting her guard down? She is unfamiliar with these feelings and wants nothing more than to walk away without a shattered heart. Will she be able to find the courage in order to turn her flame into a long lasting relationship? With walls built up & emotions turned off, can she learn to put her heart on the line?Or will each guy just be another flame?Drew Finlay is a foreign exchange student from London. Studying abroad, he remains focused on school and football. It isn't until he meets Carissa that his consistent routine is interrupted. Knowing very well he'll be heading home in just a matter of months, Drew doesn't pressure Carissa into giving him more than she can give. However, once he falls for her...he isn't giving up.Control, passion, and desperate.He'll take her anyway he can have her...",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Erotica"
  ],
  "author": "Brooke Cumberland",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/22056097-the-spark-series"
}