{
  "title": "The Captive Series Bundle: Books 1-4",
  "description": "***Sale ends June 9th***The bundle edition of the first four books in the bestselling Captive Series will be on sale for a limited time only. Book 5 in the series, Redemption, is a spinoff standalone novel that will be released on June 10th, 2014.Book 1, Captured.Captured, taken from her beloved family and woods, Aria’s biggest fear is not the imminent death facing her, but that she will be chosen as a blood slave for a member of the ruling vampire race. Aria’s world is turned upside down when a vampire named Braith steps forward to claim her. He delays her execution, but Aria knows it’s only a matter of time before he drains her, and destroys her. Aria is determined to hate the prince, but his strange kindness, and surprising gentleness astonish her. Torn between her loyalties to the rebellion, and her growing love for her greatest enemy, Aria struggles to decide between everything she has ever known, and a love she never dreamed of finding.Book 2, Renegade.Though she is free of the palace, rescued from her position as a blood slave, Aria is haunted by the memories of Braith, the prince that betrayed her and shattered her heart. Every day is a struggle to get through, and the only solace she is able to find is with Max, her best friend, and fellow captive. Aria slowly begins to salvage the broken parts of her wounded spirit by throwing herself into the wonder of the woods she had so greatly missed. Her world is thrown into a tailspin again though when a marauding group of vampires destroy the caves she had found temporary shelter in. Scattered about the forest, seeking to stay hidden and find her family, Aria is stunned when Braith, the monster that savaged her heart, reappears.Book 3, Refugee.Whispers, rumors, and horror stories abound about The Barrens and the strange creatures that lurk within them. Determined to find the remaining vampires that stood against his father in the war, Braith knows that it’s dangerous to enter the inhospitable land, but that they must if they are to have a chance at gaining allies to help overthrow the king.Aria is fearful of entering into the land she’s heard nothing but cautionary tales about, but she’s determined to help Braith locate the vampires that may help them with their cause. She is fascinated and amazed by the world they uncover within. However, the more immersed they become in a world that she doesn’t entirely understand, the more she realizes that it won’t be the war, or even the king that will eventually tear her and Braith apart. It will be her.Book 4, Salvation.Imprisoned by Caleb and at the mercy of the king, Aria is determined not to let them break her. However, the more atrocities she witnesses, the more she realizes there are some horrors no one can withstand, and sometimes survival isn’t always the best option.Tormented by the loss of Aria, Braith is forced to choose between his need to rescue her, and the impending rebel war he’s been chosen to lead. Fighting against the darkness which threatens to drag him into its tempting depths, Braith struggles not to become like the one thing he hates the most, his father.Faced with their own separate challenges, Aria and Braith must come to terms with who they are, what they want, and the likelihood that they can never be together as the inevitable war looms on the horizon. A war that all of them will fight but not all of them will survive.Mature YA/New Adult. These books contain some language, violence, and sexual situations. Recommended for ages 16+.Edited by Leslie Mitchell.Cover art by ebook launch.",
  "genres": [
    "Paranormal",
    "Vampires",
    "Fantasy",
    "Amazon",
    "Paranormal Romance"
  ],
  "author": "Erica Stevens",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/22058615-the-captive-series-bundle"
}