{
  "title": "Syöpäläiset",
  "description": "Maestro Cronenbergin esikoisromaani on mielikuvituksella ilotteleva täysiverinen mysteeritarinaKanadalaiset rakastavaiset Nathan ja Naomi tapaavat hektisen työnsä takia lähinnä kansainvälisillä lentokentillä ja hotelleissa. Muina aikoina he uppoutuvat toisiinsa älypuhelinten ja tablettien välityksellä. Molemmat ovat arvostettuja valokuvajournalisteja ja valmiit lentämään hyvän jutun perässä maailman ääriin. Naomi lähtee Pariisiin tutkimaan kuuluisan filosofin murhaa, johon vaikuttaa liittyvän myös kannibalismia. Nathanilla puolestaan on Budapestissa kuvattavanaan rintasyöpäleikkaus, jossa potilaaseen istutetaan radioaktiivisia kuulia. He tempautuvat juttuihinsa mukaan liian intensiivisesti huomatakseen olevansa vain pelinappuloita jonkun toisen suunnittelemassa pelissä – pohjoiskorealaisessa vakoiluskandaalissa.David Cronenberg (s. 1943) on kanadalainen elokuvaohjaaja, käsikirjoittaja ja näyttelijä. Hänen tunnetumpiin ohjauksiinsa kuuluvat Eastern Promises (2007), A History of Violence (2005), Crash (1996) ja Kärpänen (1986). Häneltä on totuttu odottamaan hätkähdyttäviä elokuvia, ja erityisesti ihmiskehoon liittyvät pelot ja pakkomielteet ovat hänen ominta alaansa. Consumed on hänen esikoisromaaninsa, mukaansatempaava mysteeritarina mutta myös painava puheenvuoro alati kiihtyvästä kulutushysteriasta ja teknologian ehtymättömästä vuosta. Kirja on jo ennen ilmestymistään herättänyt ennennäkemätöntä kiinnostusta ympäri maailmaa, ja sen käännösoikeudet on myyty 16 maahan. Cronenberg haluaa erottaa kirjansa elokuvistaan täysin, ja se onkin paljon enemmän kuin elokuvan kirjallinen versio. Hän aikoo kuitenkin tehdä kirjaa varten oman mainoselokuvan. Like julkaisee käännöksen mahdollisimman samanaikaisesti alkuteoksen kanssa.",
  "genres": [
    "Horror",
    "Fiction",
    "Mystery",
    "Thriller",
    "Canada",
    "Science Fiction",
    "Novels"
  ],
  "author": "David Cronenberg",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/22058775-sy-p-l-iset"
}