{
  "title": "Britt",
  "description": "DEGENERATE FLOOSIES…DASTARDLY GERMAN SPIES…DIRTY OLD MEN…SOPWITH CAMELS…AND A VIRGINAL HERO AND HEROINE WHO ARE ENGLAND’S ONLY HOPE…. 1918. England faces defeat. Germany looks set to triumph. Only one man and one woman can save England. Wriggles is the Royal Flying Corps’ greatest ace. Can he prevent a dastardly German spy ring from getting top-secret information out of France? Is he completely out of his depth in a world of devilish scoundrels, and flouncing, unashamed, near-naked scarlet women? Britt, his childhood sweetheart, is working as a nurse at a hospital near Paris. Forever pining for the lost innocence of her childhood, she too has problems. Adrift in a world of dirty old men and dissolute hussies, she is fast approaching mental breakdown. She finds purpose in life as a slayer of German spies. Convinced as she is that German male spies have snakes growing out from between their legs, they are quite easy to identify. Another obsession of hers is to discover what Wriggles has between his legs... As well as twists and turns of plot, exciting aerial combats, and a host of characters, from the suave, bollocks-obsessed Major Mullen to sexy, black-haired, pouting Marianne casting amorous eyes over our virginal hero, there unfolds (in the story of Britt and Wriggles) one of the greatest love-stories ever told. Will it end happily, or will Wriggles end up with a bullet through his head, and Britt strait-jacketed in a mental institution? This is a novel of sexual and martial comedy, with no-holds-barred excitement and thrills, and more. It explores two flawed individuals who, heartbreakingly unable to come to terms with an adult world, begin to draw closer and closer together and discover feelings hitherto unknown to them. It is a sympathetic portrayal of two children trapped in adult bodies, and how one of them, Britt, tries to dig her way out of her schizophrenic nightmare with a courage and determination which deserves to succeed… Will Britt manage to save herself..? And will Britt and Wriggles save England..? Will they find true love? Or does death and madness await them in a world dominated by Germany and its depraved supporters?",
  "genres": [
    "Historical Fiction",
    "Humor",
    "Adventure"
  ],
  "author": "Alan  Hardy",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/22054651-britt"
}