{
  "title": "She Sings of Old, Unhappy, Far-off Things",
  "description": "Margaret Braithwaite was a rising Regency scholar and an acclaimed author. Thirty years later, she’s a one-book wonder, a fifty-something college professor with the dubious distinction of being an expert on Jane Austen, hidden in the shadow of her famous husband and his Civil War novels. “Too young to retire, and too old to start over,” Margaret feels as dried up and dead as the neglected gardens her husband took such pride in before he became ill. Wyck Fitzsimmons is the Asheville landscape architect Gavin Braithwaite hires to restore his precious gardens to their former glory. She learned a long time ago that plants and trees are safer and more reliable companions than other people. Under Wyck’s care, the gardens begin to come back to life, but the flowers aren’t the only thing blossoming. For the first time in decades, Margaret feels the stirrings of love, but those long-buried feelings frighten her more than the prospect of withering away alone in her ivory tower of academia. Gavin, more observant than most people give him credit for, sees the attraction developing between his wife and his gardener. Using every means at his disposal, he arranges things so that Margaret has no choice but to remain faithful to him, even after death. Margaret, confused and faced with losing everything that offers her any kind of security, flees to England – to Austen and Wordsworth country – where she tries to forget Wyck and all the feelings she has awakened. Back in North Carolina, Wyck must come to terms with her own past and somehow find a way to forgive before it’s too late to make amends. Love, it seems, can take root in even the most barren hearts, if only Margaret and Wyck can find the courage to let it grow.",
  "genres": [
    "Romance",
    "Lesbian",
    "LGBT",
    "Queer",
    "Contemporary",
    "Fiction",
    "Drama"
  ],
  "author": "Caren J. Werlinger",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/22054537-she-sings-of-old-unhappy-far-off-things"
}