{
  "title": "Barefoot in White",
  "description": "Love is in the air in Barefoot Bay and no one knows that like the destination wedding planners who work there making beachfront brides some of the happiest in the world. But is love the destination for these wedding planners? Willow Ambrose has fought a battle with the scale for much of her life, but she has finally won the war. She hasn’t just cut calories -- she’s cut all ties to her past, too, and successfully carved out a new body and a new life. But when she comes face to face with someone who left an indelible mark on her heart years before, all that threatens to crumble. Navy SEAL Nick Hershey is on medical leave, doing a friend a favor as a stand in “man of honor” at a Barefoot Bay wedding. He might not be that interested in the nuptials, but the wedding planner catches his eye the minute they meet. When he realizes Willow is a girl he knew in college -- and a girl he unintentionally hurt to the core -- he knows he has some making up to do. Willow has learned how to beat every temptation...but Nick’s sweet as candy kisses just might be the one thing she can’t resist. However, the closer they get, the more the past threatens to tear them apart. Nick and Willow learn the hard way that they can’t change history, but does that mean they won’t have a future? About the Barefoot Bay Series by New York Times Bestselling Author Roxanne St. Claire On these sun-washed shores of this tropical paradise, you’ll meet heroes who’ll steal your heart, heroines who’ll make you stand up and cheer, and characters who quickly become familiar and beloved. Some are spicy, some are sweet, but every book in the Barefoot Bay series stands alone, and tempts readers to come back again and again. So, kick off your shoes and fall in love with billionaires, brides, bodyguards, silver foxes, and more…all on one dreamy island. Every book in the series is a stand-alone romance! 1 – Secrets on the Sand 2 – Seduction on the Sand 3 – Scandal on the Sand 4 – Barefoot in White 5 – Barefoot in Lace 6 – Barefoot in Pearls 7 – Barefoot Bound 8 – Barefoot with a Bodyguard 9 – Barefoot with a Stranger 10 – Barefoot with a Bad Boy 11 – Barefoot Dreams 12 – Barefoot at Sunset 13 – Barefoot at Moonrise 14 – Barefoot at Midnight Critical Reviews of Roxanne St. Claire Novels “St. Claire, as always, brings a scorching tear-up-the-sheets romance combined with a great dealing with real issues starring memorable characters in vivid scenes.” — Romantic Times Magazine “Non-stop action, sweet and sexy romance, lively characters, and a celebration of family and forgiveness.” — Publishers Weekly “Plenty of heat, humor, and heart!” — USA Today’s Happy Ever After blog “The writing was perfectly on point as always and the pace of the story was flawless. But be forewarned that you will laugh, cry, and sigh with happiness. I sure did.” — www.harlequinjunkies.com “The Barefoot Bay series is an all-around knockout, soulsatisfying read. Roxanne St. Claire writes with warmth and heart and the community she’s built at Barefoot Bay is one I want to visit again and again.” — Mariah Stewart, New York Times bestselling author “This book stayed with me long after I put it down.” — All About Romance About the Author Published since 2003, Roxanne St.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Military Fiction",
    "Amazon",
    "Chick Lit",
    "Second Chance"
  ],
  "author": "Roxanne St. Claire",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/22061742-barefoot-in-white"
}