{
  "title": "The Duke's Holiday",
  "description": "Book One in The Regency Romp Trilogy The Duke of Montford, cold, precise, and more powerful than the Prince Regent himself, wants things the way he wants them: cross-referenced, indexed, and at his beck and call. And he always gets what he wants. Until he meets Astrid Honeywell. And a giant pig. And a crooked castle in the middle of Yorkshire. Astrid Honeywell, staunch bluestocking, has struggled for years to keep her family together by running the estate and family brewery after her father's death. She is not about to let the tyrannical Duke of Montford steal away all she has worked for because of some antiquated contract between their families. So when the priggish Duke comes to call, she does everything in her power—including setting the family pig on him—to drive him away. She didn't expect him to be so... well, infuriatingly attractive. Every time he scowls at her, she has the most improper desire to kiss him—and a whole lot more. Montford can't decide whether to strangle Astrid or seduce her. The one thing he knows for a fact is that he must resist his powerful attraction for her at all costs. He has a very proper, very demure fiancée waiting for him back in London, after all. But when Astrid is kidnapped by a disgruntled suitor and whisked off to Gretna Green, Montford will do anything to get her back. Will these two drive each other to Bedlam... or can they make it to the altar without killing each other? Includes an OCD Duke, a fiery heroine, mistaken identities, errant livestock, pompadours, drunken declarations, a touch of smex, and enough witty banter to sink a ship. NOTE: This is a sexy historical romance. Recommended for 18+ due to adult content.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Regency",
    "Historical Fiction",
    "Audiobook",
    "Humor"
  ],
  "author": "Maggie Fenton",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/22064852-the-duke-s-holiday"
}