{
  "title": "Sword of the Gods: Agents of Ki",
  "description": "***WINNER - Best High Fantasy Novel of 2015 - eFestival of Words Best of the Independent eBook Awards***At the dawn of time, two ancient adversaries battled for control of Earth. One man rose to stand at humanity's side. A soldier whose name we still remember today…Cut down by an act of betrayal, Mikhail lingers between life and death while his fragile alliance crumbles against the onslaught of a Sata'anic invasion. Fearful the intrepid Angelic might lose hope and die, his young protégé concocts a plan to fool him into thinking his wife is at his side. Meanwhile, held captive by the Evil One, Ninsianna must choose between loyalty to her fallen husband and manipulating the Evil One's minions to turn against him.As darkness tears the heavens asunder, a tiny Mesopotamian village finds itself the epicenter of an intergalactic war between good and evil. But all is not lost. An ancient goddess has recruited two 'Watchmen' to turn darkness back into the light; mortal creatures who do not realize they are pawns.The saga of the greatest superhero to ever walk the Earth continues in Agents of Ki…This book is *NOT* religious fiction!!!\"The characters are so well developed- flawed and emotionally relatable. The story line is complex but completely engrossing - I can't put the books down!\" —reader review\"[A] new take on an old story of good vs evil...\" —reader review\"This is not a religious novel it is a epic fantasy/sci-fi in the style of Starwars or Star trek. You will meet people and beings from all over the universe's and page back to the beginnings of humanity. I am happily looking forward to the next segment in this intelligent, and beautifully crafted series.\" —reader review\"A fantastic read. Could not put it down!\" —reader reviewThis is the order the books should be —The Chosen One—Prince of Tyre—Agents of Ki—The Dark Lord's Vessel—The Fairy General (coming soon)",
  "genres": [
    "Fantasy",
    "Space Opera",
    "Science Fiction"
  ],
  "author": "Anna Erishkigal",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/22060603-sword-of-the-gods"
}