{
  "title": "Yin-Yang",
  "description": "An urban fantasy novel about power and freedom and trustMages in North America seem to have it all – typically from well-off families, and able to manipulate their environment in ways most of the world would never believe. They don’t even have to bother with the mundane details of life like housework, thanks to their sensitives, who also make a useful source for extra magical energy. After all, sensitives have no use for it themselves, and if mages weren’t meant to make use of it, then the sensitives would obviously have some way to prevent that. That a mage can transform a sensitive physically, with no restrictions beyond overall mass and basic biological viability, whereas magic tends not to work directly on any other living thing, is only further proof. And look at the way they live on their own, barely a step above animals. It’s better for them to belong to a mage.Sensitives in North America live on the edge of society and survival – typically so paranoid they avoid hospitals and anything else that could lead to being tracked, many of them with little or no education and no legal identity or existence. Mages exist, and mages want sensitives for some reason, but no one ever comes back to explain what that reason is. Waiting every day for the hunters to notice them doesn’t lead to much motivation or hope for the future. And once they’re captured, they’re the property of someone with a terrifying amount of power over them. Anything is better than capture.Mages are born to be the masters, and sensitives are born victims. Or are they?Jax's life is turned upside-down when he's caught by the hunters and sold to a mage. Andreas is still mourning for his previous sensitive, though, unconsciously creating a difficult standard for Jax to live up to, all the more so while still struggling to come to terms with this new reality as Andreas' sensitive.A runaway sensitive isn't what Van expects at the mental health centre. Is this a hunter trap, set for him and the rest of the Donovan family by the hunters? The hunters would, after all, love to see them cross the line openly and finally do something they can be charged with. Either way, Miranda's genuinely in trouble, and he can't just abandon her to it.Snatching a sensitive out from under the hunters and hiding her is odd behaviour for a mage – but then, Catherine is an odd mage, living in disgrace in the old servants' quarters of her grandmother's house, responsible for cooking and housework. Lila owes Catherine her freedom; is there a way to help Catherine achieve her own, and at what price?Tension is building between traditionally-minded mages and those advocating change; the Donovans and their allies are increasingly active in trying to improve life for free sensitives and protect tame ones. Then hunters find a copy of Van's book about mages and sensitives... in the hands of a free sensitive. With charges of sedition and immorality against Van, for writing unbiased observations rather than accepted \"truth\" and for allowing it to reach free sensitives, the outcome of this hearing is going to have consequences far beyond his own fate.*** Yin-Yang includes a small amount of profanity and no graphic sex or violence. However, sex and gender roles and relationships within the mage/sensitive subculture are non-traditional in mainstream North American terms. The key criterion in a primary relationship is not relative sex or gender, but the pairing of mage and sensitive; given the transformation of sensitives by their mages, physical sex is non-absolute for a sensitive, and gender identity can vary as in anyone else. ***",
  "genres": [
    "Fantasy",
    "Urban Fantasy"
  ],
  "author": "Steph Shangraw",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/22059085-yin-yang"
}