{
  "title": "Broken Series",
  "description": "All four books of Dawn Pendleton's Broken Series are combined in this Broken Promises, Broken Dreams, Broken Pieces, and Broken Valentine.Broken After three years in Boston attending college, Mallory Wells has come home to Casper, Maine to care for her father, who is dying from cancer. She left Casper without looking back, leaving her small-town life and everyone in it, behind. Including her sexy high school sweetheart.Luke Bates was devastated when Mallory left him for the city life. He managed to pull himself together and move on, even if only just barely. When Mallory shows up in town, Luke vows to stay away from her at all costs. So why does he want to spend as much time with her as he can? He knows she's going back to Boston eventually, but he just can't resist the lure of Mallory. Even if it means he's heartbroken again when she leaves.Broken Rainey Daniels has been keeping a secret since she left her hometown, three years ago. The death of a friend’s father, though, has her questioning whether or not running away from her past is what’s best for her future. Add sexy Chris Baker in the mix and she’s even more unsure. After all, life is short.Baker is an all-around good guy with a great sense of humor struggling to keep his new bar afloat. And he always thought Rainey was hot, even when she carried a few extra pounds in high school. Hell, he thinks she’s too skinny now. He knows she’s hiding something, too, but when he pushes the issue, she pushes him away. He tries not to care; she only wants a summer fling, right? But when her life is threatened, he realizes he may just be in love with her… and then he learns her secret.Can they find love together before it’s too late?Broken It’s been a rough year for Gabby Peterman. Her best friend’s dad died six months ago, her other best friend has leukemia and isn’t doing well, and her marriage? After three years, it’s more of a joke than a relationship. Despite all the odds, she’s managed to stay strong for the people around her, supporting them through all their trials. But when death strikes again and one of her closest friends disappears, Gabby loses it.On the verge of a mental breakdown himself, Wolfe Landon will do anything to win Gabby over. But first, he’s going to prove to her just how much he cares and loves her, because losing her will rip out his heart and soul.Broken Mallory and Luke have been joyously living out their happily ever after. With a baby on the way, they think nothing could ruin their happiness. When the baby's life is in danger, though, they've got a tough decision to make.**This is a new adult series and is recommended for people 18+**",
  "genres": [
    "Romance"
  ],
  "author": "Dawn Pendleton",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/22060294-broken-series"
}