{
  "title": "Snake Oil Science: The Truth about Complementary and Alternative Medicine",
  "description": "Millions of people worldwide swear by such therapies as acupuncture, herbal cures, and homeopathic remedies. Indeed, complementary and alternative medicine is embraced by a broad spectrum of society, from ordinary people, to scientists and physicians, to celebrities such as Prince Charles and Oprah Winfrey.In the tradition of Michael Shermers Why People Believe Weird Things and Robert Parks's Voodoo Science , Barker Bausell provides an engaging look at the scientific evidence for complementary and alternative medicine (CAM) and at the logical, psychological, and physiological pitfalls that lead otherwise intelligent people--including researchers, physicians, and therapists--to endorse these cures. The books ultimate goal is to reveal not whether these therapies work--as Bausell explains, most do work, although weakly and temporarily--but whether they work for the reasons their proponents believe. Indeed, as Bausell reveals, it is the placebo effect that accounts for most of the positive results. He explores this remarkable phenomenon--the biological and chemical evidence for the placebo effect, how it works in the body, and why research on any therapy that does not factor in the placebo effect will inevitably produce false results. By contrast, as Bausell shows in an impressivesurvey of research from high-quality scientific journals and systematic reviews, studies employing credible placebo controls do not indicate positive effects for CAM therapies over and above those attributable to random chance.Here is not only an entertaining critique of the strangely zealous world of CAM belief and practice, but it also a first-rate introduction to how to correctly interpret scientific research of any sort. Readers will come away with a solid understanding of good vs. bad research practice and a healthy skepticism of claims about the latest miracle cure, be it St. John's Wort for depression or acupuncture for chronic pain.",
  "genres": [
    "Science",
    "Nonfiction",
    "Medicine",
    "Health",
    "Skepticism",
    "Psychology",
    "Popular Science"
  ],
  "author": "R. Barker Bausell",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/2206148.Snake_Oil_Science"
}