{
  "title": "Ange'el",
  "description": "“Sky stood up, followed him, and placed her sword on his neck. ‘Do it Sky! For mercy’s sake, end my torment.’ He challenged her in a husky voice, grabbing her hand and digging her sword farther into his neck.”Morgan arrives in New York, where she is speaking about her Hope Foundation at several high-profile events. When she finds out that her life is at risk, she is not sure whom to trust—disoriented by an intense attraction to a very charming and controlling Gabriel, she attempts to regain control of her life only to find herself in the middle of a war between different factions of an ancient civilisation. The people of Ahe’ey hold the key to the future of humankind within their genes. To unlock it, Morgan and Gabriel need to help them move beyond the medieval rules that are holding them back. The price of failure may be the end of the world.\"Packed with invigorating ideas and prose, Le Fay’s novel is a nuanced exploration of feminism and its potential—for good or ill. A finely grained achievement that challenges the status quo on all fronts. \" - Kirkus Reviews\"So if it's cross-genre reading you seek, with vivid protagonists and unexpected involvements, then Ange’el is the item of choice, recommended for its fast-paced action, super-charged fantasy, and memorable protagonists.\" - D. Donovan for Midwest Book Review“Ange’el” is a fantasy romance that sweeps the reader from our world to a world where fantastic beings live and work to bring light to humanity, as well as settle their own internal war once and for all.When Morgan arrives in New York City for a speaking engagement, she’s instantly taken by the man appointed as her guide for the city—his name is Gabriel, and he seems to anticipate and fulfill her every need. When she is targeted by an extremist men’s rights group, Gabriel even saves her life, and the two quickly and passionately fall in love. Gabriel is more than an ordinary man, however, and the obstacle to their future together is great—if they choose to give each other up, their hearts will break. If they choose to stay together, they will take away humanity’s chance to reach a place of true peace and enlightenment.The plot of “Ange’el” is unique and inventive; the author spends time detailing the world of the Ahe’ey and making it a real place. While that part of the book held my interest, what made me care about the plot was the characters. Morgan is strong, kind, and passionate about helping others; you come to like her immensely, and you feel the same about Gabriel, who shares many of Morgan’s characteristics. Their relationship happens quickly but as it blossoms you come to see they truly belong together, and I liked that the conflict that might drive them apart was external, rather than their own personal issues. I also really enjoyed the character of the proud warrior Sky, and Gabriel’s determined and manipulative mother, Viviane; this book doesn’t lack for strong female characters, and it’s refreshing.I would recommend “Ange’el” to readers who like romantic fantasy that has action, memorable characters, and a larger plot than whether or not the couple will get together.\" - E. Lucas 5 Star Review, Top 500 Amazon Reviewer",
  "genres": [
    "Fantasy",
    "Romance"
  ],
  "author": "Jamie Le Fay",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/22062838-ange-el"
}