{
  "title": "Male Medusa, Caught in Coils",
  "description": "Warning: Contains extremely explicit content not suitable for anyone below 18 years of age.He's an anomaly belonging to a forgotten world. A myth. Cast out and bound in enchantments by his own kind, he lingers adrift and forgotten in a hidden cavern, wiling away the eons. Crossing paths with humans over the years, he is both feared and desired, his bite bringing addiction and ecstasy or death. Knowing much of loneliness, little of kindness and nothing of women, the only male Gorgon in history has a surprise in store for him when his dark haired destiny, lands at his feet.When the roof of a concealed cave collapses underneath the feet of Amelia, an archeological researcher seeking the lost temple of a snake god, she doesn't expect to be rescued by a gorgon, a male medusa. Ancient and powerful, Serpen is nothing like she could ever have imagined. As she teaches him of kindness and respect, he teaches her of lust and how to love.This is not your average bed time story. For lovers of hot twisted male characters, myth, magic and folklore, this is an adult legend with a twist. The start to the Male Medusa series, this supernatural story is not for the faint-hearted. If you're a fan of paranormal erotic romance and have a thing for serpents than this one is for you!Excerpt:She rather thought she might be still be dreaming or hallucinating.The first thing to really capture her attention was his eyes. The irises were so deep and vivid a green that could only be considered emeralds.Those eyes were showcased by a face that was an epiphany. He looked a like a fallen angel. He had the bone structure of a male GQ model and the lips of a porn star. He was watching her curiously, head cocked.She blinked hard and looked closer. What she'd initially thought to be dreadlocks were actually snakes. They weren't toy snakes either. They were twisting against one another, looking at her just as curiously as he was. That couldn't be right. She closed her eyes, pressing the lids hard together. Then she opened them again.Nope, she'd been right the first time. They were definitely snakes. Maybe she was feverish and imagining things.She untangled her hand from the blanket and reached out, grasping the snake that swung the closest to her. It was warm and writhed gently in her hand. It was a bright green, lightening to a pale cream on its underbelly and rather than fight her grip, it coiled around her wrist, forked tongue flicking and tasting her skin gently. It sprang from his temple and would be long to enough to touch the back of his knee when he stood. It felt pretty damn real to her.She wasn't hallucinating.It was real.HE was real.A fresh novel/novella from the newest monster erotica style Author.",
  "genres": [
    "Mythology",
    "Fantasy",
    "Erotica",
    "Fiction",
    "Paranormal Romance"
  ],
  "author": "Stella Inox",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/22065673-male-medusa-caught-in-coils"
}