{
  "title": "Titanium Security Series Box Set: Volume II",
  "description": "Original Edition for ASIN B00JMKC5QGThe final two books of the Titanium Security Series in one set!  Extinguished: She’s wanted him forever… For years former Marine Jordyn Bridger has been in love with a man who refused to see her as anything but his best friend’s little sister. A mind-blowing kiss finally changed that, but then he disappeared from her life. Now he’s back, to recruit her for a job with his NSA-sanctioned Titanium Security team. They’re going after the terrorist responsible for the recent attacks on their team and Jordyn is eager to lend her skill set to the hunt. She’s determined to prove to Blake that she’s capable of holding her own—both in the bedroom and on the battlefield.  He’s never walking away again… Former Marine Scout/Sniper Blake Ellis hid his true feelings for Jordyn for years out of respect for her and her family, but once he learns those feelings aren’t one-sided, he can’t keep his distance any longer. When a team tragedy thrusts Jordyn into the front line with him on a battlefield, Blake will do whatever it takes to protect her. She’s everything he ever wanted in a woman but he was too stubborn to see it. Now it might be too late for them. As they race to capture the terrorist they’re hunting, Blake and Jordyn find themselves fighting for their lives. If they want to make it out alive they must work together to defeat an unseen, powerful network that will stop at nothing until their entire team is dead.  Rekindled: He left her when she needed him most… Four years ago, Dr. Grace Fallon lost everything that mattered in a terrorist attack she barely survived. Now she’s stronger than ever and in Pakistan with a UN-sanctioned team for the most important assignment of her career. She’s dedicated her life to eradicating the world of chemical weapons, and long ago accepted the inherent risks associated with her job. Until the man whose memory has haunted her for so long suddenly reappears and inadvertently makes her the target of one of the most dangerous terrorists on the planet. Forced to accept Alex’s protection, it’s impossible to deny the white-hot attraction still burning between them. And while she trusts him to guard her from this new threat, Grace must once again decide whether to risk her heart to the man who once shattered her entire world.  Now he’ll risk everything to win her back… Four years ago, NSA agent Alex Rycroft left Grace because had no choice. But never again. Malik Hassani has escaped custody, he’s on the run, and has locked onto Grace as a means to target Alex. This time Alex will do whatever it takes to protect her—and convince her to give them another chance. Walking away from her nearly destroyed him and now that she’s back in his life, he can’t let her go. When the unthinkable happens and Grace’s life hangs in the balance, he’ll sacrifice everything to save her—including himself.",
  "genres": [
    "Romantic Suspense",
    "Military Fiction"
  ],
  "author": "Kaylea Cross",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/22069424-titanium-security-series-box-set"
}