{
  "title": "Natural Order",
  "description": "“It’s beautiful,” I said, even though it wasn’t my style. It was cut glass and silver. Something a movie star might wear. Is this what my boy thought of me? I wondered as he fastened it around my neck. He called me Elizabeth Taylor and I laughed and laughed. I wore that necklace throughout the rest of the day. In spite of its garishness, I was surprised by how I felt: glamourous, special. I was out of my element amidst my kitchen cupboards and self-hemmed curtains. I almost believed in a version of myself that had long since faded away.--From Natural Order by Brian FrancisJoyce Sparks has lived the whole of her 86 years in the small community of Balsden, Ontario. “There isn’t anything on earth you can’t find in your own backyard,” her mother used to say, and Joyce has structured her life accordingly. Today, she occupies a bed in what she knows will be her final home, a shared room at Chestnut Park Nursing Home where she contemplates the bland streetscape through her window and tries not to be too gruff with the nurses. This is not at all how Joyce expected her life to turn out. As a girl, she’d allowed herself to imagine a future of adventure in the arms of her friend Freddy Pender, whose chin bore a Kirk Douglas cleft and who danced the cha-cha divinely. Though troubled by the whispered assertions of her sister and friends that he was “fruity,” Joyce adored Freddy for all that was un-Balsden in his flamboyant ways.  When Freddy led the homecoming parade down the main street , his expertly twirled baton and outrageous white suit gleaming in the sun, Joyce fell head over heels in unrequited love.Years later, after Freddy had left Balsden for an acting career in New York, Joyce married Charlie, a kind and reserved man who could hardly be less like Freddy. They married with little fanfare and she bore one son, John. Though she did love Charlie, Joyce often caught herself thinking about Freddy, buying Hollywood gossip magazines in hopes of catching a glimpse of his face. Meanwhile, she was growing increasingly alarmed about John’s preference for dolls and kitchen sets. She concealed the mounting signs that John was not a “normal” boy, even buying him a coveted doll if he promised to keep it a secret from Charlie.News of Freddy finally arrived, and it was horrifying: he had killed himself, throwing himself into the sea from a cruise ship. “A mother always knows when something isn’t right with her son,” was Mrs. Pender’s steely utterance when Joyce paid her respects, cryptically alleging that Freddy’s homosexuality had led to his destruction. That night, Joyce threatened to take away John’s doll if he did not join the softball team. Convinced she had to protect John from himself, she set her small family on a narrow path bounded by secrecy and shame, which ultimately led to unimaginable loss.Today, as her life ebbs away at Chestnut Park, Joyce ponders the terrible choices she made as a mother and wife and doubts that she can be forgiven, or that she deserves to be. Then a young nursing home volunteer named Timothy appears, so much like her long lost John. Might there be some grace ahead in Joyce’s life after all?Voiced by an unforgettable and heartbreakingly flawed narrator, Natural Order is a masterpiece of empathy, a wry and tender depiction of the end-of-life remembrances and reconciliations that one might undertake when there is nothing more to lose, and no time to waste.",
  "genres": [
    "Fiction",
    "Canada",
    "Book Club",
    "Literary Fiction",
    "LGBT",
    "Contemporary",
    "Queer"
  ],
  "author": "Brian  Francis",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/11290015-natural-order"
}