{
  "title": "Hunted by Herne",
  "description": "Warning: Explicit Content. Not suitable for anyone below 18 years of age. When Carin stumbles into Otherworld by accident, she finds herself in the firing line of one sexy horned god. Although she's in his world by chance, the antlered Forest Lord has no intention of letting such an opportunity pass him by. The game is on and the stakes are high.Carin must take flight, evading his attempts at capture. If she stays free of his clutches than she may demand a boon when the sun rises but if he apprehends her... all bets for her safety and sanity are off.This is not your average bed time story. For lovers of hot alpha male characters, myth, legend, magic and folklore with sidhe, fae or faerie, this is an adult fairy tale with a twist. The start to the Horned God series, this supernatural story is not for the faint-hearted. If you're a fan of paranormal erotic romance than this one is for you! Excerpt: She found a fragment of backbone and didn't let her eyes wander although her mouth watered to taste the newly visible flesh. Instead she turned her sight away to the stone carvings over his shoulder in a vain attempt to focus on something else, to crush unwanted craving. He gave a low delighted laugh, filled with satisfaction, his breath stirring her skin. Herne gathered handfuls of her hair, crushing it in his hands and used it to steer her eyes back to his. His smile was inhuman and filled with dark amusement. \"You think to deny me your desire?\" he asked tipping forward so that his exhale feathered over her face and his lips hovered above hers, just... touching. \"As if I can't smell it? As if it's very existence doesn't stain the air around us?\" A dull flush suffused Carin's face but she refused to be drawn on it keeping her expression smooth focusing of his horns above his hairline. Embarrassment did what pure will could not and forced the worst of her unwanted lust away. \"You do!\" he confirmed with delight. \"Ah Carin, will you make me work for your responses? Shall I make you beg me? Eventually plead for a release from my hands or body?\" Warning: Not suitable for anyone below 18 years of age. Contains sexual material. A fresh novel/novella from the newest monster erotica style Author.",
  "genres": [
    "Erotica",
    "Fantasy",
    "Mythology",
    "Fae",
    "Gods"
  ],
  "author": "Stella Inox",
  "average_rating": "2.79",
  "url": "https://www.goodreads.com/book/show/22066872-hunted-by-herne"
}