{
  "title": "Wallace Stegner and the American West",
  "description": "Wallace Stegner was the premier chronicler of the twentieth-century western American experience, and his novels, the Pulitzer Prize–winning Angle of Repose and the National Book Award–winning The Spectator Bird, brought the life and landscapes of the West to national and international attention. Now, in this illuminating biography, Philip L. Fradkin goes beyond Stegner’s iconic literary status to give us, as well, the influential teacher and visionary conservationist, the man for whom the preservation and integrity of place was as important as his ability to render its qualities and character in his brilliantly crafted fiction and nonfiction.From his birth in 1909 until his death in 1993, Stegner witnessed nearly a century of change in the land that he loved and fought so hard to preserve. We learn of his hardscrabble youth on the Canadian frontier and in Utah, and of his painful relationship with his father, a bootlegger and gambler. We follow his intellectual awakening as a young man and his years as a Depression-era graduate student at the University of Iowa, during its earliest days as a literary center.We watch as he finds his home, with his wife, Mary, in the foothills above Palo Alto, which provided him with a long-awaited sense of belonging and a refuge in which he would write his most treasured works. And here are his years as the legendary founder of the Stanford Creative Writing Program, where his students included Ken Kesey, Edward Abbey, Robert Stone, and Wendell Berry.But the changes wrought by developers and industrialists were too much for Stegner, and he tirelessly fought the transformation of his Garden of Eden into Silicon Valley. His writings on the importance of establishing national parks and wilderness areas—not only for the preservation of untouched landscape but also for the enrichment of the human spirit—played a key role in the passage of historic legislation and comprise some of the most beautiful words ever written about the natural world.Here, too, is the story—told in full for the first time—of the accusations of plagiarism that followed the publication of Angle of Repose, and of the shadow they have cast on his greatest work.Rich in personal and literary detail, and in the sensual description of the country that shaped his work and his life—this is the definitive account of one of the most acclaimed and admired writers, teachers, and conservationists of our time.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Westerns",
    "American History",
    "American",
    "Biography Memoir"
  ],
  "author": "Philip L. Fradkin",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/2206578.Wallace_Stegner_and_the_American_West"
}