{
  "title": "Aquarian Angels - River",
  "description": "With long black hair draping down to the small of his back, grey eyes, pectoral muscles with hard pink nipples, a flat stomach, and long toned legs, the Aquarian Angel known as Temptation takes mortal form because he enjoys the sensation of being a beautiful mortal man, and for a reason which only he senses, he knows that something is going to happen this summer in Kip River and he wants to be a part of it. When a young cowboy comes across a group of angels appearing in mortal form as nude men at the edge of the river, they do not run away. They lavish him with kisses and lead him to the angel known as Temptation. Temptation wraps his arms around him, looks into his eyes and smiles. He runs his hands over Shane's hair and down to his cheek, admiring the hills of his chest. He brings his lips sensually up to Shane's neck. The seduction of the mortal has begun.\"Go let Temptation know that we have company,\" he said.Shane began to shake in fear, as he believed they were monsters. \"Please don't hurt me.\"\"I won't hurt you, none of us will. Come sit with us,\" the angel said while stroking Shane's chin with the tip of his finger.The four of them sat against a tree trunk where the ray of sunlight shone down. Up close, Shane noticed how brightly their skin glowed, free of flaws. He had never seen men so beautiful. He had always fantasized about being with three men at the same time but never thought that it would actually happen.\"What is your name?\"\"Shane. What are you guys?\"\"We are Aquarian Angels, River Angels to be exact,\" Sin said unbuttoning a couple of buttons on Shane's shirt to get a closer look at his chest.Evil put his arm around Shane and began stroking the side of his face with his fingertips. \"We're not going to harm you.\"Sin began to kiss Shane's beautiful chest with his soft lips, continuing down to his stomach. Evil brought Shane's face to his and began to kiss him.Meanwhile in the river, Temptation took his long hair and began to braid it to squeeze the water out of it. He smiled.Shane was lost in ecstasy. The mustache above Evil's lip tickled and brushed against his upper lip, and Sin wanted nothing more than to open the zipper of the cowboy’s jeans, but the mortal wasn't for him. He was for Temptation who was waiting for him near the river. \"We need to get him to Temptation,\" Sin said.They stopped, leaving Shane wanting so much more.",
  "genres": [
    "M M Romance"
  ],
  "author": "Justin Kayser",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/22069010-aquarian-angels---river"
}