{
  "title": "Djinn and Tonic",
  "description": "Warning: Contains explicit material and a very kinky Djinn. Not suitable for anyone below 18 years.Three gin and tonics quickly become one Djinn too many.Who would have thought that a male with a form composed of mist would have a touch worth risking an eternity of slavery for? Nasaan proves that he's equal to the task of pleasing a demanding mistress and then shows her what happens when the servant becomes the master.Alicia, a narcissistic 20 something hot blond goddess, is minding her own business, trashing her ex-boyfriends worldly goods when she unexpectedly encounters an extremely sexy and devilish Djinn! What's any red blooded girl to do when handed 12 wishes? Especially one without a conscience or morals? Why she's going to get everything she deserves... For lovers of hot alpha male characters, myth, legend, magic and folklore, this is an adult fairy tale with a twist. A start of the Djinn series, this supernatural story is not for the faint-hearted. If you're a fan of paranormal erotic romance than this story is for you!Excerpt:His hands rose to stroke her face and she flinched back. His hands were graceful with long fingers that displayed blank tinted neatly cut nails on each digit. He simply waited, hands still extended until she relaxed and leaned forward into his touch.The Djinn was gentle as he ran his fingers over the planes of her visage and she could feel a sweep of power in his wake. Her skin tightened and she gasped at the wash of wellbeing that followed his caress.He dug his nails lightly into her scalp and drew the length of her hair through his hands, tugging her head backwards and then moved on, drawing strokes down and across her shoulders.His touch was so fine that she moaned deep in her throat as her eyes drifted shut. He traced out the length of her arms and then moved to her chest.A fresh novel/novella from the newest monster erotica style Author.Warning: Contains explicit material and adult themes. Not suitable for anyone below 18 years.",
  "genres": [
    "Paranormal Romance",
    "Erotica",
    "Fantasy"
  ],
  "author": "Stella Inox",
  "average_rating": "3.04",
  "url": "https://www.goodreads.com/book/show/22065658-djinn-and-tonic"
}