{
  "title": "Exodus 2022",
  "description": "Eco, sci-fi, thriller EXODUS 2022:\"Bennett, after a neat Dean Koontz–style curtain-raiser, keeps raising the stakes… Deft storytelling and a riptide of action propel this cataclysmic narrative.\" --KIRKUS REVIEWSIS HE LOSING HIS MIND-- OR HIS WORLD? Joe Stanton is in agony. Out of his mind over the death of his young daughter. Unable to contain his grief, Joe loses control in public, screaming his daughter’s name and causing a huge scene at a hotel on San Juan Island in Washington State. Thing is, Joe Stanton doesn’t have a daughter. Never did. And when the authorities arrive they blame the 28-year-old’s outburst on drugs. What they don’t yet know is that others up and down the Pacific coast—from the Bering Sea to the Puget Sound—are suffering identical, always fatal mental breakdowns. With the help of his girlfriend, Joe struggles to unravel the meaning of the hallucination destroying his mind. As the couple begins to perceive its significance—and Joe’s role in a looming global calamity—they must also outwit a billionaire weapons contractor bent on exploiting Joe’s newfound understanding of the cosmos, and outlast the time bomb ticking in Joe’s brain. \"Exodus 2022 opens full throttle and never lets up. A fresh, original sci-fi thriller full of unexpected twists and turns. Kept me guessing to the very last page.\" -- Bob Mayer, New York Times Bestselling Author of the AREA 51 Series.\"Truly, this book hits its stride in its \"Love of Earth, sea, and sky\"--a strong theme-- and is at its best where it defies convention and dives into eco-lit territory.\"--EcoLit Books\"I'm not usually a sci-fi thriller enthusiast. But Kenneth G. Bennett has set this on-the-edge-of-your-seat story in the Great Pacific Northwest where I make my home. After reading EXODUS 2022, this place will never look quite the same. His best yet.\"--Rebecca Wells, author of Divine Secrets of the Ya-Ya Sisterhood and other novels.\"This is a must-read for anyone who cares about the oceans, wildlife, and the environment, and likes to think that the animals will win in the end. It's my new happy place. Besides sharing an important message it's just a really great story with interesting characters. It's very well written and is one of those books you can't put down. Kudos to the author for creating a really imaginative way out of this environmental mess we've made of our planet. You will not regret purchasing this book.\"--Cynthia L. Hansen, Education Curator, The Whale Museum, Friday Harbor, Washington",
  "genres": [
    "Science Fiction",
    "Thriller",
    "Fiction",
    "Fantasy",
    "Suspense",
    "Mystery",
    "Contemporary"
  ],
  "author": "Kenneth G. Bennett",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/22070106-exodus-2022"
}