{
  "title": "De kronieken van Narnia",
  "description": "De kronieken van Narnia\n zou men eigenlijk drie keer in een leven moeten lezen: één keer als kind, één keer als volwassene, en één keer op late leeftijd. De boeken zijn onafhankelijk van elkaar te lezen, maar vormen samen de prachtige wereld van Narnia. Deze set bevat alle zeven delen van De kronieken van Narnia: \nHet neefje van de tovenaar\n: Als Digory samen met zijn buurmeisje Polly per ongeluk op de kamer van zijn oom Andrew komt, begint het grootste avontuur van hun leven. Oom Andrew is een tovenaar en wil zijn kunsten wel eens op Digory en Polly uitproberen. Ze komen terecht in vreemde werelden en uiteindelijk ook in Narnia. Ze maken mee hoe de eerste koning en koningin gekroond worden en hoe de leeuw Aslan de dieren leert praten. Maar ze hebben ook - tegen hun zin - de slechte koningin Jadis naar Narnia meegenomen, een kwaad dat niet zonder gevolgen zal blijven... \nHet betoverde land achter de kleerkast\n: Peter, Susan, Edmund en Lucy gaan uit logeren in het geheimzinnige, grote huis van een oude professor. Als ze op de eerste dag samen het huis gaan verkennen, zien ze een grote oude kleerkast in een lege kamer. Lucy verstopt zich in de kleerkast. Tot haar schrik zit er helemaal geen achterkant in de kast. Via de kleerkast komt zij, en later ook haar broers en zus, terecht in het wonderlijke land Narnia. Daar strijden we onder leiding van de machtige leeuw Aslan tegen de Witte Tovenares en haar dienaren. \nHet paard en de jongen\n: Shasta komt met Brie, het sprekende paard, in Narnia terecht. Daarbij worden ze achtervolgd en bedreigd. Shasta leert hoe hij zijn angst moet overwinnen.\nPrins Caspian\n: De vier kinderen uit Het paard en de jongen komen weer in Narnia terecht, dat er nu stil en verlaten bij ligt. Ze proberen prins Caspian te helpen de troon te veroveren, zodat er weer vrede kan komen.\nDe reis van het drakenschip\n: Edmund en Lucy vinden het maar niets dat ze in de zomervakantie bij hun akelige neef Eustaas moeten logeren, maar het kan niet anders. Op een dag zitten ze verveeld naar het schilderij van een drankenschip te kijken, als het schilderij plotseling tot leven komt. De boeg begint te bewegen, de golven gaan schuimen en de wind steekt op. In een flits verdwijnt de lijst van het schilderij en de drie kinderen liggen in de golven. Ze grijpen de touwen die hen worden toegeworpen, en klimmen aan boord. Daar ontmoeten ze hun oude vriend Caspian; ze zijn weer in Narnia! Lucy weet het zeker, dit wordt weer een groot avontuur. Ze krijgt gelijk, want ze moeten koning Caspian helpen om zeven vrienden van zijn vader te vinden. Vrienden die lang geleden en verre reis maakten naar de Verlaten Eilanden en van wie nooit meer iets gehoord.\nDe zilveren stoel\n: Eustaas probeert Jil, die zich eenzaam en ongelukkig voelt op kostschool, te troosten met verhalen over het geheimzinnige land waar hij de afgelopen zomer geweest is. Jill zou daar ook wel eens naar toe willen. Geheel onverwacht gaat deze wens in vervulling. In Narnia komen ze erachter dat Rilian, de zoon van koning Capian, verdwenen is. Aslan geeft Jill en Eustaas de taak hem te vinden. Ze krijgen van hem vier aanwijzingen die ze moeten onthouden. Dat lukt echter niet en het vinden van de prins lijkt onmogelijk te worden...\nHet laatste gevecht\n: Als Jill en Eustaas Narnia weer binnenkomen, blijkt er iets vreselijks aan de hand te zijn. De sluwe aap Draaier heeft zijn vriend, de domme ezel Puzzel, een leeuwenhuid aangetrokken en zegt tegen iedereen dat hij Aslan is. En veel dieren die Aslan nog nooit gezien hebben geloven hem, zelfs als de bevelen van de namaak-Aslan steeds slechter en wreder worden.Tirian, de koning van Narnia, moet snel handelen, voordat de vrede in het koninkrijk helemaal weg is. Peter, Edmund en Lucy vechten nog eenmaal mee met Jill en Eustaas in het grote, laatste gevecht, dat de toekomst van Narnia eens en voor altijd zal bepalen. Narnia kan niet blijven zoals het is, maar hoe zal het veranderen?",
  "genres": [
    "Fantasy",
    "Classics",
    "Fiction",
    "Young Adult",
    "Childrens",
    "Christian",
    "Middle Grade"
  ],
  "author": "C.S. Lewis",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/22066855-de-kronieken-van-narnia"
}