{
  "title": "Billionaire Undone ~ Travis",
  "description": "After four years of working for “the billionaire boss from hell” Ally Caldwell thinks she finally has her life on the right track. Her fiancé is out of dental school, ready to go to work at a thriving practice, and it would finally be her turn to go back and finish her college degree. Unfortunately, her carefully planned future crumbles when she finds out that her fiancé, the man she’d nearly killed herself to help get through school, has been cheating on her. With her wedding looming in the near future, Ally’s blindsided, realizing she’d never even knew the man she’d been planning to marry. Suddenly, her carefully organized life is turned upside down, and not one single thing is turning out the way it was supposed to happen. Even her boss, Travis the Tyrant, is beginning to act differently, throwing Ally into an even more confused and chaotic state of mind. Travis, the one man who she’d always counted on to be a jerk, was now the guy who actually steps up to try and help her straighten her life out again. Unfortunately, she doesn’t much care for his highhanded arrogance or his methods of “helping.” Ally wants to hate Travis. It makes her life so much simpler to fight with him than to admit to the combustible chemistry growing between the two of them. But as she begins to see more and more of the real Travis beneath his dark façade, she can’t seem to resist the dangerous lure of their unlikely attraction.  Billionaire Travis Harrison does everything he possibly can to repair the Harrison name after a scandal nearly destroyed his family years ago. He makes sure he keeps himself and his actions in check, his emotions buried under a thick layer of ice. Only his secretary and assistant, Alison Caldwell, makes him come close to losing his carefully constructed image. The obstinate female keeps shoving him closer and closer to the edge of sanity every single day. But when he finds out about her fiancé’s betrayal, his protective instincts roar to life inside him, making him want to ensure she’s never hurt again. The only problem is…Ally doesn’t want his help, and the infuriating woman does everything she can to push him away, even as the two of them are swept into an undeniable passion that neither of them can possibly ignore. Before long, Travis finds himself in ruthless pursuit of something much more important and elusive than just a business deal.  Can these two very different, very stubborn people actually be meant to be together? Find out if Travis and Ally can let down their defenses and surrender to a love so powerful it will rock them to the depths of their souls in Billionaire Undone, Book Six of The Billionaire’s Obsession series.  18+ only",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "Audiobook",
    "Adult",
    "Erotic Romance"
  ],
  "author": "J.S. Scott",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/22068591-billionaire-undone-travis"
}