{
  "title": "Even Legends Die",
  "description": "The final battle has begun. Gavin Stark, the former head of Alliance Intelligence and the bitter nemesis of the Marine Corps, has made his bid for power. The manufactured clone soldiers of his Shadow Legions have seized control of dozens of colony worlds, imposing his brutal rule over millions of colonists. His plan is no less than to subjugate all mankind under his iron fist. On Earth, Stark’s manipulations have brought the Superpowers to the brink of war, threatening the Treaty of Paris and its prohibition against terrestrial combat. For a century, man has restricted his conflicts to space, but now the Powers are sliding closer to the edge…the final battle that could kill billions, and turn Earth into a wasteland. On a few key colony worlds, Erik Cain, Elias Holm, and the remnants of the shattered Marine Corps struggle against Stark’s vast armies…the only hope of turning back the tide of destruction and despair that threatens to engulf all mankind. They are outnumbered and outgunned, but they will fight nevertheless, standing grimly in the breach, holding back Stark and his dark legions. The Marines will give their all, fight with the last of their strength and resolve. But this time the cost will be too high to bear, too personal. Even Marines need their heroes, their legends. But even legends die. Even Legends Die is book eight of Jay Allan’s bestselling Crimson Worlds series (over 1,200,000 sold). The Crimson Worlds Series (Reading Order) Book 1: Marines Book 2: The Cost of Victory Book 3: A Little Rebellion Book 4: The First Imperium Book 5: The Line Must Hold Book 6: To Hell's Heart Book 7: The Shadow Legions Book 8: Even Legends Die Book 9: The Fall Standalone, Can be Read at Any Red Team Alpha (A Crimson Worlds Adventure) Jay Allan’s Blood on the Stars Series Book 1: Duel in the Dark Book 2: Call to Arms Book 3: Ruins of Empire Book 4: Echoes of Glory Book 5: Cauldron of Fire Book 6: Dauntless Book 7: The White Fleet Book 8: Black Dawn Book 9: Invasion Book 10: Nightfall Book 11: The Grand Alliance Book 12: The Colossus Book 13: The Others Book 14: The Last Stand Book 15: Empire’s Ashes (coming) Book 16: Attack Plan Alpha (coming)",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Military Fiction",
    "Audiobook",
    "Military Science Fiction",
    "War"
  ],
  "author": "Jay Allan",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/22078125-even-legends-die"
}