{
  "title": "The Glass Sealing",
  "description": "Enterprising engineer Arthur Singleton is on the verge of achieving all his dreams when they are snatched away from him. His sympathies for the plight of mistreated workers lead him to speak up in their support, but for doing so he is made a scapegoat by the heads of industry, falsely accused of inciting a riot which they orchestrated to keep the people in their place. With his reputation ruined and his career in tatters, Singleton vanishes into the squalid streets of Southwatch, determined to make a difference where it really counts: in the lives of ordinary men and women, forgotten or ignored by those who live in comfort and luxury above the Dark Cloud.Years later Singleton emerges from obscurity again as a secret leader in the Workers' Movement, an underground protest organisation dedicated to challenging the status quo--but no change comes easy, especially when it threatens the profits of the wealthy. Looking down on their activities is Jocelyn Duville, heiress to a unique airborne transportation empire, who once considered Singleton more than a colleague and was an unwitting player in his wrongful disgrace. Now a darling of high society, Jocelyn is far from a conventional figure herself, refusing to simply marry and give up her independence. She has big plans for Southwatch, a proposal that will change the face of the city and write her name in the history books in the process. But her goals epitomise everything the Workers' Movement struggles against, and they will not stand by and watch without a fight.However, these are not the only forces at play. Street gangs, the city government, and the strange, inhuman beings that live in Southwatch's deep shadows all have vested interests in the outcome of the building conflict. Arthur Singleton and Jocelyn Duville will face off across a chasm of class, each wielding very different kinds of power--unaware that they are pitted against each other, and of the terrible consequences their actions will have on the city they both love.",
  "genres": [
    "Steampunk"
  ],
  "author": "Andrew Leon Hudson",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/22079818-the-glass-sealing"
}