{
  "title": "Phase Two: Evaluate",
  "description": "The nightmare is just beginning...  Eighteen-year-old Tabitha Alexander is struggling to adapt to the new world she's living in. The zombies are everywhere, and nothing living is safe from them. They exist for only one purpose. To consume those still left alive.  They find safety in Kellan's home, or so they believe. The secrets are mounting, though, and each day seems to reveal only more questions.  On a mission to seek answers, they find themselves trapped deep within the Louisiana forests. In a deserted shack next to the bayou, Tabitha discovers that the nightmare is just beginning. They haven't seen the worst of the zombies apocalypse. Not by a long shot.  They escape, back to the safety of the compound. But it's only an illusion. Tabitha quickly realizes that zombies aren't the only monsters in the world... And humans have just dropped even further on the food chain.  Release Date: 4/15/14 Genres: Zombies Fiction, YA Romance, Paranormal Urban Fantasy, Science Fiction Word Count: 41,000  Make sure to check out the first book in this series Phase One: Identify!  Excerpt:  I squinted down the barrel of the rifle as I held it tightly in my sweaty palms. It seemed extraordinarily long to me, the weight heavy in my stiff clasp. The afternoon sun beat down on my head and shoulders.  It was hell.  The stuffed scarecrow target erected several feet away wavered in the sunlight like a mirage in a desert. The combination of nerves and heat was wearing me down. I blinked rapidly, trying to clear my vision. It didn't help.  “Any day now,” Kellan muttered impatiently, standing a few feet away. He was staring at me intensely, but his eyes and expression revealed nothing. “Just line the sight up on the scarecrow and pull the trigger.”  Yeah, he made it sound so easy. Kellan was half the reason I was so nervous.... And so hot. Something about the way he looked at me made me extremely flustered. Being in his presence for three days hadn't helped that any.  “Okay,” I replied, feeling completely inept and embarrassed.  We were standing in a field next to his home, or compound, as I liked to call it. He'd brought all of us out the hour before to work on shooting and target practice. Everyone else, including my mom, seemed to take right to it. I was the only one having problems.  Kellan cleared his throat.  Inhaling deeply, I pointed the tip of the rifle in the direction of the scarecrow and squeezed the trigger. My body wasn't expecting the recoil. It shocked me badly, and in response, I swung around in surprise... And so did the rifle. Horrified moans and gasps filled the air, at least from everyone but Kellan. He muttered a harsh expletive as he shook his head exasperatedly. I had to give them all credit, though. Even my dad moved fast in the face of imminent disaster.  Kellan reached out and grabbed the rifle as I immediately blushed and rubbed at my shoulder. It didn't really hurt, but it gave me something to do. “Sorry, everyone,” I finally choked out, completely mortified as I looked down at the ground. Could anyone be a worse shot than me?  “It's okay, Tabs,” Dad replied, but his normally ruddy complexion had paled considerably. He exchanged a long look with my mom before looking back at me. “I'm sure with a little more practice you'll be shooting like a pro.” It didn't escape my notice that his reassurances sounded a tad puny.  I nodded weakly in response.",
  "genres": [
    "Zombies",
    "Young Adult",
    "Paranormal",
    "Dystopia"
  ],
  "author": "Rose Wynters",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/22083883-phase-two"
}