{
  "title": "Doing Magic: A Course in Manifesting an Exceptional Life",
  "description": "Doing Magic is book two of a complete course in becoming creator of your own exceptional life. In these two books, I outline the exact steps which enabled me to move my own life from one of poverty and drudgery, to manifesting one of previously unimaginable wealth, purpose and joy. ‘But Magic? I do hope you are joking!’ That’s what I would have said, five or ten years ago. I once despised all things ‘New-Age’, all these spiritual types and their airy-fairy views, their bad science and their irrational beliefs. I read The Secret and all the great Law of Attraction books - writers like Wallace Wattles, Anthony Robbins, Rhonda Byrne, Napoleon Hill, Esther Hicks and Wayne Dyer. But no matter how many books I read, or how closely I followed their instructions for manifesting love, money, happiness or abundance, I couldn’t make it work. It was only when I recognized, accepted and finally embraced that what I was doing was actually some kind of Magic that suddenly things began to fall into place. Once I realized that the power came from within me, it was as if the light had suddenly been switched on and my manifestations began to work. I learned how to manifest money and love, but I also learned how to be happy, truly happy. If you’re jaded by spirituality and the whole New Age Law of Attraction idea, or have become bored by its failure to deliver… this book is for you. It is my intention to lead you by the hand through a marvelous journey of wonder and adventure. Part one of this course, Becoming Magic, laid the groundwork for becoming a magical person, while this second book, Doing Magic, offers concrete techniques and instructions for attracting wonderful things into your life. The plan is to build your knowledge slowly, gradually, building on what has gone before, moving on to more complex manifestation techniques only once the basics are mastered. So many people fail with manifestation and the Law of Attraction because they rush headlong into using techniques, trying to create enormous manifestations, making very simple but crucial mistakes. When they are disappointed, they imagine they have been duped. The sceptics are right. This is all a load of scammy nonsense. And they give up, declaring it just doesn’t work. I am telling you that it does work. And you can make it work. And these books will show you how. My intention is that this book will allow you to become a true creator of your own exceptional life, reawakening and rekindling your belief and interest in Spirituality, The Law of Attraction, Reality Creation, Cosmic Ordering or whatever you wish to call it. I prefer simply to call it Magic.",
  "genres": [
    "Self Help",
    "Spirituality",
    "Nonfiction",
    "Audiobook"
  ],
  "author": "Genevieve  Davis",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/22083763-doing-magic"
}