{
  "title": "Big Damn Heroines",
  "description": "Big Damn Heroines is a celebration of the plus-sized woman. Specifically, the plus-sized woman kicking ass. The media perception of the strong female protagonist is almost invariably thin, but powerful women come in all shapes and sizes, and it's time that they had a chance to stand up and be recognized. The four stories in this anthology show that bigger women can be more than comic relief or the dumpy best friend. They can be a force to be reckoned with all on their own.\"Machine Gun\" Mercy is a member of the Valkyries, an all-female squad of Roughnecks patrolling the outer solar system. When a distress call comes in from the penal colony on Titan, Mercy and the Valkyries descend to confront the Terror on Saturn VI. Porter has followed the career of vigilante superhero Firebird with great interest, if only because Firebird is actually Blaise, once her dearest friend. Firebird seems to be self-destructing, though, and though Porter tries to ignore it, she finds herself drawn into the Folie à Deux, a shared madness that threatens to swallow them both. The widening Distance of Memory following the recent death of their fourth member has left surviving bondmates Zaezon, Margellian, and Corynteea lost and uncertain. But when they come across evidence of a band of Renders attacking villages, they must find their way together as three in order to complete their mission. Finally, Cat, a Finder gifted with the ability to locate objects and people with preternatural ease, is contacted by former lover Mirsagh to help track down a merchant's son. As they follow the man's trail, old feelings—good and bad—resurface, and Cat is faced with the choice to let Mirsagh be the Finder's Keeper again.",
  "genres": [
    "M M Romance",
    "Anthologies",
    "Fantasy",
    "Science Fiction",
    "Paranormal",
    "Erotica",
    "Aliens"
  ],
  "author": "Layla M. Wier",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/22081492-big-damn-heroines"
}