{
  "title": "Modern Job Search: Insider Knowledge and Strategies that Work",
  "description": "Have you ever wondered what you would do if you had to start looking for a new job?  For a lot of people, starting a job search means creating a resume, scouring the internet for job postings and then blindly sending resumes and cover letters out into space. Despite the fact that the likelihood of success is relatively poor, this is the only method that most people know.  As a corporate headhunter, I know there are better ways to find jobs and fill them. I've spent 15 years creating strategies to demonstrate value, identify hiring managers, break through corporate communication blocks and reach decision makers. I've written and edited more resumes than I can remember, coached countless candidates on how to make the most of limited interview time, and negotiated a lot of offers. I've also given a lot of advice.  “Modern Job Search” is compilation of the strategies that I use every day to place candidates with some of the best companies in the world. The guidance given, process followed, work done and even the people involved are all real. Starting with how to figure out your value proposition and continuing through identifying hiring manager contacts, creating resumes that work, making contact, getting interviews and negotiating offers, this book is designed to help job seekers market themselves like a professional would.  If you haven’t had to look for a job in a while or are just starting out, it pays to have a cohesive and well defined strategy. Even if you’re not looking, it’s always smart to be prepared. Reading and owning “Modern Job Search” will help you plan your next move as well as make sure you don’t get caught by surprise the next time there’s a layoff at your company.  Buy “Modern Job Search” today and take control of your career!  If you've already bought and read \"Modern Job Search\" I'd love to hear from you. Please leave a review and let me know if the book was helpful for you!",
  "genres": [],
  "author": "Kurt  Schmidt",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/22085276-modern-job-search"
}