{
  "title": "Engines of Empathy",
  "description": "Until this morning, Charlotte Pudding was almost happy with her life. Apart from her homicidal toaster, dead parents, and general ennui. Well, maybe not that happy. Either way, now that she’s on the run from a shadowy corporation, seeking the secrets of her own family history and tolerating the inanities of a retired god, things are looking a bit more interesting. -- “A hint of Adams, a dollop of Pratchett, all delivered with a mischievous smile for an intriguing tale that is great fun … A wonderfully humorous tale that keeps you smiling and intrigued to the very end.” - Te Radar “Ever wondered what life would be like if all our machines were powered not by electricity or petrol, but by emotions? Neither had I. But now, thanks to Paul Mannering, I can't stop wondering. \"Clever, satirical and more than a little weird, Engines of Empathy introduces one of the strangest worlds I've encountered in New Zealand fiction - a world that, much like our own, is haunted by the moral consequences of an energy-intensive industrial revolution. From sulking toasters, depressed computers and a passive aggressive fridge to quantum religions and corporate conspiracies, Engines of Empathy is a crazy ride.” - Dylan Horrocks “Engines of Empathy is charming, clever, funny, and a rollicking good read. Charlotte Pudding is a heroine sensible and capable enough to tackle an abundance of eccentric characters, shady conspiracies, neurotic machines, attack-sarcasm, and a religion based on quantum mechanics. If Douglas Adams had been forced to undergo relationship counselling with his toaster, this is the book that would have resulted.” - Debbie Cowens, author of Mansfield with Monsters",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Humor",
    "Mystery",
    "Urban Fantasy",
    "Speculative Fiction",
    "Comedy"
  ],
  "author": "Paul Mannering",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/22085047-engines-of-empathy"
}