{
  "title": "Midnight Remains",
  "description": "The authors of J. Ellington Ashton Press come together with twisted minds, and warped stories to bring you a terrifying collection of short stories. Midnight Remains brings together some of the most renowned small press authors currently in print.  Edward P. Cardillo is the awarding winning author of Automaton, and Odd Tales of an Old Man. His story telling has dubbed him the nick name “Campfire Grandpa” for his ease in relating meaningful yet frightening tales. (Vampires of Exeter / The Devil is in the Details)  R.J. Spears is the author of Sanctuary of the Dead and Lord of the Dead. His zombie tales are realistic and action packed. (Grilling With Zombies / Toofers)  Daniel J. Williams penned the “Mace” series. His novels are gritty and realistic post-apocalyptic drama. (Evil Calls)  Nick Hatfield reminds everyone, when you tell your kids they can be anything, sometimes they decide to be classic horror writers. Nick is a young author with unlimited potential. (Out of the Corner of Your Eye / Night Calls / Back Roads / Seeing Monsters)  catt dahman has a penchant for turning history into horror. Her ability turn even scary events into scarier fiction has her among the leading horror writers of our day. (Counterpoint / End Justifies)  Sharon L. Higa is a purveor of the supernatural. Her novel #6 relates tales from a post death experience. (Dreaper/ Here Kitty Kitty / Dare Ya / Funeral Parlor Blues)  Mark Woods is one of the most talented authors in JEA. He began his penmanship by blogging reviews for other authors, and then moved his extensive knowledge of good story telling into his own work. His novel “Time of Tides” is a block buster. (Plot Holes / Dairy of the Dead)  Michael Fisher is a multi-talented man. He not only contributes writing to this collection, but also the cover. (Return of the Devil Fly)  Tabitha Baumander masterfully tells tales of modern day fantasy and high stakes adventure. Her novel “The Pond” is a prime example of her artistry and skill. (Class Reunion / Hey, Come Here)",
  "genres": [],
  "author": "Stuart Drake",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/22083437-midnight-remains"
}