{
  "title": "A River in Flood and Other Florida Stories",
  "description": "About Nine Florida Stories by Marjory Stoneman Douglas:\"Written as entertainment for a mass market . . . crammed with colorful characters, vivid incidents and palpable atmosphere. . . . A reminder of a Florida gone by or fast disappearing.\"--Orlando Sentinel\"Reflects the same concerns found in her better-known non-fiction work--a fascination with the beauty of Florida and a warning against its imminent destruction.\"--Tallahassee Democrat In the pantheon of Florida writers, Marjory Stoneman Douglas (1890-1998) is cherished as the grande dame. Famous as the author of The Everglades: River of Grass, prolific as a writer, and passionate as an environmental crusader for almost a century, she became the nation's best link to a remarkable era in Florida history.  The timeless themes of her stories in this new collection resonate with interest for readers today. Whether the subject is hurricanes, cockfighting, real estate deals, struggling immigrants, or corruption in the Everglades, Douglas wrote about it with distinction--and usually first. Originally published in the Saturday Evening Post during the 1920s and 1930s, the golden age of the short story, these nine works have never before been collected or available in one place.  Kevin M. McCarthy, who edited the companion volume, Nine Florida Stories by Marjory Stoneman Douglas, offers an introduction to each story, explaining its significance, setting, unusual references, place in Douglas's works, and significance to the history of South Florida.The stories: \"At Home on the Marcel Waves\" \"Solid Mahogany\" \"Goodness Gracious, Agnes\" \"A River in Flood\" \"The Mayor of Flamingo\" \"Stepmother\" \"You Got to Go, But You Don't Have to Come Back\" \"High-Goal Man\" \"Wind Before Morning\"",
  "genres": [
    "Fiction"
  ],
  "author": "Marjory Stoneman Douglas",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/2208494.A_River_in_Flood_and_Other_Florida_Stories"
}