{
  "title": "Wife Maintenance Quarterly II",
  "description": "Hot tips for new and soon-to-be husbands on wedded bliss and how to achieve and maintain it.Volume two in telling you everything you ever wanted to know about the tricky and often thankless, but necessary, art of maintaining your wife. This gentleman’s periodical is a must-read for any new husbands, clueless husbands and men yet to be husbands. Not convinced? Just read our reviews!!!\"I’ll say it again, Wife Maintenance Quarterly is still the best example of the worst kind of thinking ever to come out of any supposedly progressive society. Bigoted, nasty and puerile.\"– ‘Mad Feminist Cow’, Feminist Shouter Magazine\"Brilliant! Five stars. Now, even weak-willed men can rule their marriages like England’s Henry VIII!\"- Mr Puck, historian\"I used to earn minimum wage, was mouthy and unpopular, and was seriously considering lesbianism, as I couldn’t attract a man. Once I decided to live by the example set in Wife Maintenance Quarterly, I found myself married with two kids! Now, I’ll never have to work again!\"- Mrs ‘Smith’\"Wife Maintenance Quarterly surpasses other gentleman’s periodicals in that they merely flirt with the horrid truth about women. WMQ just comes out with it, equipping even the most hopeless fellow with the tools to set her right and make her make him proud.\"- Mr R. Sole\"Wife Maintenance Quarterly answered all of my questions on women – and to think, I was going to treat her as an equal’! Thanks for setting me straight, WMQ!\"– Josh Joe KingWife Maintenance Quarterly is an adult book and is not suitable for children.Brief background: Wife Maintenance Quarterly is my series all about how to wreck a relationship – the wrecking of which is a damaging force in people’s lives and sours the way that we experience the world (when we’re hurtful and rotten to each other, mostly through lack of respect) but more than that, the WMQ series is about institutionalised misogyny. The books are written from a British perspective, where we have officially fairly good women’s rights (legal equality), although societal gender expectations limit people’s lives in other ways. There are countries in the world where women have no equal rights, and even their very bodies are subject to the laws of the land (informed for the most part by theocratic considerations) and WMQ seeks to challenge that and show misogyny for what it is.",
  "genres": [],
  "author": "Michael Pugh",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/22087751-wife-maintenance-quarterly-ii"
}