{
  "title": "Closed Case Series Box Set: British Murder Mysteries",
  "description": "Closed Case Box Set: British Murder Mysteries Detective Tammy Williams is the young English female detective created by James Jackson. The author introduces the reader to a variety of characters and plots that take many unexpected twists and turns resulting in dramatic and climatic conclusions leaving the reader wanting more.  Unusual Confession The story begins with seven teenage friends on a hot summer day, the events that followed cost many of them their lives. The mystery left behind leaves the town in a dark shadow, full of sadness and anger that the murders were not solved and the killer was not caught. Tammy Williams is a young detective who is looking for adventure and a challenge when an interesting man walks in and makes an unusual confession. After carefully listening to his tale, Tammy realizes there are things missing from his story and follows the 20-year-old trail of a killer to resolve the cases from that long ago summer. Over the Hills After solving \"Unusual Confession\" case, Detective Tammy Williams is quite well-known in Manchester, and she is the envy of the rest of her colleagues. So, it is no surprise when the boss asks her to investigate a cold case. Williams is still on a high from solving her previous case, when a body is unearthed on a deserted hillside in a field behind an abandoned house, in Manchester. There are no leads, and nothing to help Tammy with her enquiries. She thinks she is coming to a dead end, but a last-minute piece of evidence leads Tammy to discover the identity of this mysterious woman. Tammy works her way through extensive research involving a man that seems to fit the role of a serial killer, only to discover that things are not quite, what they seem. Working endless hours and interviewing many witnesses, racing against time and trying to piece the puzzle together to solve the string of murders so the families of the victims can find peace and justice proves to be more difficult than she imagined. Murder on the Eiffel Tower Lead Detective Tammy Williams takes a deserved holiday in Paris, France, with her family after the demoralizing and failed “Over the Hills” case. The let down from the previous case is still weighing heavily on her mind. She puts her stress and concerns behind her, and decides to enjoy the vacation with her family in one of the world’s most romantic locations. Surrounded by an interesting cast of characters, what was supposed to be a relaxing and non-stressful holiday takes a sinister turn when a murder takes place during the visit to the Eiffel Tower. In a dramatic turn of events, Tammy finds herself again investigating a murder and trying to solve the case to remove the possible dangers and salvage what she can of the remaining time in Paris with her family. Unfinished Business Life seemed to settle down to a normal pace for detective Tammy Williams after returning from a trip abroad with her family. One thing still haunts her, the serial killer that got away and continues to flaunt his ability to not get caught in his sinister game of cat and mouse. The victims family members are angry knowing Tammy was not able to resolve the case and bring the serial killer that murdered their loved ones to justice. Caught off guard in a bar filled with the victims’ families and fellow police officers off duty, Tammy winds up being thrust into a role she did not think she would ever play. In a surprising turn of events, Tammy has to rely on the help of an old friend to figure out the case that might change the course of her life.",
  "genres": [],
  "author": "James \"JJ\" Jackson",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/22092395-closed-case-series-box-set"
}