{
  "title": "A Fighter's Desire",
  "description": "A Fighter's Desire contains two prequel novellas to introduce the main characters in the series. IT IS ONLY TO INTRODUCE THEM. They're happily ever after's will come, but it doesn't happen in this book. (Fair warning) Each fighter will have his own book where their stories will continue and end to that HEA everyone wants.Two is always better than one.Knowing a fighter’s desires and needs are one thing, but actually experiencing them is another. A Fighter’s Desire gives you not one, but two stories full of hardcore passion, angst, and action that’ll leave you breathless and aching for more.Part One: Ryley and Camden Jameson, well-known MMA fighters and identical twins, were just as aggressive and passionate in the bed as they were in the ring. They loved a good fight, and that’s exactly what they got when they met Ashleigh Warren. The brothers had a habit of sharing things—including women—and she happened to be the only one they truly craved. However, the problem was getting her to agree to their proposition. It was one she couldn’t refuse, but she knew it wouldn’t be easy to win. Nonetheless, she sure as hell was going to enjoy it.Part Two: Fighting temptation isn’t easy when you’re constantly around the one person you’ve desired more than any other. Gabriella Reynolds was warned by her brother, MMA Heavyweight Champion Matt Reynolds, to stay away from his friends; they only wanted one thing, and in the end they’d break her heart. She heard it, but the desire to have the one man she couldn’t led her down the forbidden path to pursue him; he also happens to be one of her brother’s best friends. Tyler Rushing can’t deny his attraction to her, and he’s afraid she’ll want more than what he can give her. When he finds out that’s not the case … everything changes. They have no choice but to keep their time a secret, and it’s a secret that’ll stay with them forever.",
  "genres": [
    "Fighters",
    "Romance",
    "Sports",
    "Contemporary Romance",
    "Mixed Martial Arts",
    "New Adult",
    "Contemporary"
  ],
  "author": "L.P. Dover",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/22088018-a-fighter-s-desire"
}