{
  "title": "Beauty",
  "description": "The light was dim but she could see his profile. “You’re not wearing a mask.” She reached out without thinking, but he grabbed her hand, shaking his head, turning away. FROM NEW YORK TIMES BESTSELLING & AWARD WINNING AUTHOR SELENA KITT ♛ MODERN WICKED FAIRY TALES ♛ Do you love fairy tales? Then don't miss these happily ever afters!  In this modern retelling of a fairy tale classic, former beauty queen Jolee Mercier finds herself in big trouble, locked in the trunk of her husband’s BMW on her way to a remote location in the woods of northern Michigan where she’s going to be killed. Her crime? Knowing too much. An anonymous letter arrived addressed in her name with proof that her husband, Carlos, a state logging and mining mogul, had been the one responsible for her father’s death years earlier, killed for supporting the unions at a local logging camp. When a terrible accident ends her husband’s plan to kill her, Jolee wakes up alone in a cabin in the middle of the woods, rescued by a masked man they call “the beast,” with a husband who wants her dead, and miles of state forest between her and civilization. The COMPLETE Modern Wicked Fairy Tales Series!  amazon.com/dp/B006S9MDAC Jolee could never stay out of trouble for long and being locked in the trunk of Carlos’s black BMW was no exception to that particular rule of her life. She’d given up trying to kick the side of the car to make noise—luxury car makers practically sound-proofed their trunks. Who knew? She wondered if engineers considered scenarios like this one—after all, any rich husband might have to enlist his hit men tie up and toss his troublesome wife into the trunk for easy disposal, right? Besides, her feet were secured with zip ties, as were her hands, which stretched painfully behind her back. They didn’t use duct tape—too easy to wiggle out of—except for the pieces over her mouth. And even those weren’t just slapped on—they’d used the roll to wrap the silver stuff around and around her mouth and jaw in layers. Carlos’s guys knew exactly what they were doing. Of course they did. It was their job. There was just no way out of this bit of trouble. That realization finally hit her in the darkness, the car’s wheels crunching gravel a long time now, off the highway, she surmised, the suspension bouncing her violently up and down. This was going to be the last batch of trouble she ever got herself into in the whole expanse of a life that seemed suddenly very short. She’d been so focused on escaping or finding a way out since Carlos’s goons had grabbed her out back—zip-tied and duct taped before she could even raise the snow shovel she’d been using—that this final realization hit with such terrifying force Jolee actually wet herself, urine staining the crotch of her jeans with spreading navy blue darkness. She was going to die.",
  "genres": [
    "Erotica",
    "Romance",
    "Fantasy",
    "Beauty and The Beast",
    "Adult",
    "Fairy Tales",
    "Contemporary Romance"
  ],
  "author": "Selena Kitt",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/11291554-beauty"
}