{
  "title": "Traction: A Startup Guide to Getting Customers",
  "description": "Most startups end in failure.Almost every failed startup has a product. What failed startups don't have are enough customers.Founders and employees fail to spend time thinking about (and working on) traction in the same way they work on building a product. This shortsighted approach has startups trying random tactics - some ads, a blog post or two - in an unstructured way that's guaranteed to fail. This book changes that. Traction Book provides startup founders and employees with the framework successful companies have used to get traction. It allows you to think about which marketing channels make sense for you, given your industry and company stage. This framework has been used by founders like Jimmy Wales (Wikipedia), Alexis Ohanian (Reddit), Paul English (Kayak.com), and Alex Pachikov (Evernote) to build some of the biggest companies and organizations in the world. We interviewed each of the above founders - along with 35+ others - and pulled out the repeatable tactics and strategies they used to get traction. We then cover every possible marketing channel you can use to get traction, and show you which channels will be your key to growth. This book shows you how to grow at a time when getting traction is more important than ever. Below are the channels we cover in the book:Viral Marketing Public Relations (PR) Unconventional PR Search Engine Marketing (SEM) Social and Display Ads Offline Ads Search Engine Optimization (SEO) Content Marketing Email Marketing Engineering as Marketing Target Market Blogs Business Development (BD) Sales Affiliate Programs Existing Platforms Trade Shows Offline Events Speaking Engagements Community BuildingThis book draws on interviews with the following individuals: Jimmy Wales, Co-founder of Wikipedia Alexis Ohanian, Co-founder of reddit Eric Ries, Author of The Lean Startup Rand Fishkin, Founder of SEOmoz Noah Kagan, Founder of AppSumo Patrick McKenzie, CEO of Bingo Card Creator Sam Yagan, Co-founder of OkCupid Andrew Chen, Investor at 500 Startups Justin Kan, Founder of Justin.tv Mark Cramer, CEO of SurfCanyon Colin Nederkoorn, CEO of Customer.io Jason Cohen, Founder of WP Engine Chris Fralic, Partner at First Round Paul English, CEO of Kayak.com Rob Walling, Founder of MicroConf Brian Riley, Co-founder of SlidePad Steve Welch, Co-founder of DreamIt Jason Kincaid, Blogger at TechCrunch Nikhil Sethi, Founder of Adaptly Rick Perreault, CEO of Unbounce Alex Pachikov, Co-founder of Evernote David Skok, Partner at Matrix Ashish Kundra, CEO of myZamana David Hauser, Founder of Grasshopper Matt Monahan, CEO of Inflection Jeff Atwood, Co-founder of Discourse Dan Martell, CEO of Clarity.fm Chris McCann, Founder of StartupDigest Ryan Holiday, Exec at American Apparel Todd Vollmer, Enterprise Sales Veteran Sandi MacPherson, Founder of Quibb Andrew Warner, Founder of Mixergy Sean Murphy, Founder of SKMurphy Satish Dharmaraj, Partner at Redpoint Garry Tan, Partner at Y Combinator Steve Barsh, CEO of Packlate Michael Bodekaer, Co-founder of Smart Launch Zack Linford, Founder of Optimozo",
  "genres": [
    "Business",
    "Entrepreneurship",
    "Nonfiction",
    "Buisness",
    "Management",
    "Technology",
    "Self Help"
  ],
  "author": "Gabriel Weinberg",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/22091581-traction"
}