{
  "title": "Men Who Killed Gandhi",
  "description": "The men who killed Gandhi by Manohar Malgaonkar takes readers back into the pages of Indian history during the time of the Partition, featuring the murder plot and assassination of Mahatma Gandhi. The men who killed Gandhi is a spellbinding Non fictional recreation of the events which led to India’s Partition, the eventual assassination of Gandhi, and the prosecution of those who were involved in Gandhian murder. This historical reenactment is set against the tumultuous backdrop of the British Raj. Malgonkar’s book is a result of painstaking research and from also having privileged access to many important documents and photographs related to the assassination. There is no doubt that Mahatma Gandhi played a leading role in obtaining independence from the British. But the problems that ensued afterwards, such as the structural rebuilding of the country and the Partition, led to many riots, massive migrations, and deep racial and cultural divides. Not everyone agreed with Gandhi and his ideals. As a result, a plot to assassinate Gandhi was devised by six individuals named, Narayan apte, Gopal God se, Madanlal pahwa, Digambar badge, and Nathan God se. This was eventually carried out in New Delhi, on the 30th of January, 1948. Eventually, these six individuals were tried and convicted. Four of them received life sentences while two of them received the death penalty. The first publication of the men who killed Gandhi occurred in 1978, during the emergency years. As a result, malgonkar omitted many vital facts including Dr. Ambedkar role in minimizing Savarkar’s criminal conviction. This 11th edition of the text contains these omitted facts as well as rare documents, and photographs obtained from National archives. After the four individuals who were convicted for Gandhi’s murder completed their life sentences, they were interviewed by malgonkar. These individuals revealed many details to him which were never known before. The author also received access to the Kapur Commission from his friend Mr. Nayar, who was in the Indian police service. As a result, the men who killed Gandhi is considered the most historically accurate account of Gandhian assassination plot.",
  "genres": [
    "History",
    "India",
    "Nonfiction",
    "Politics",
    "Biography",
    "Indian Literature",
    "Historical"
  ],
  "author": "Manohar Malgonkar",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/2208934.Men_Who_Killed_Gandhi"
}