{
  "title": "Hiding Away",
  "description": "***Mature content. 18+ age recommended. This book deals with adult topics that may be hard to read. Proceed with caution.*** Author Skye Turner: There is drama, romance, HOT sex, heartbreak, humor, and love in many forms in Hiding Away. I actually loved this book and to me, it emotionally involved me even moreso than Letting Go. Please note, this book does involve a major cliffhanger and you may feel the need to throw your Kindle across the room (or message the author, cussing) when you are done reading, but that should NOT deter you from grabbing this novella. ***This is a companion novella. While you could read it as the first for Hiding Away (Cal & Jane's story), it is recommended that you read it after Vol. 1. All of the volumes will cross over into one another.*** Who do you trust, and who do you love, when the secrets of your past are so painful that you’re Hiding Away? Jane Whitford had everything she ever wanted, at her fingertips, when it was violently ripped away. The man who was supposed to love her turned into a monster. Broken and bruised, she fled his clutches back to her hometown. Love is the last thing she wants when she meets Cal. The only thing on her mind, is fun, and lots of it. Will she open her heart to him before it's too late? Calvin Charles is a cop on the streets, working hard to achieve his goal of joining SWAT. He strives to live with no regrets and has everything he needs; friends, family, and the occasional woman to warm his bed. Until he meets Jane, and she quickly becomes everything he wants. Will he be able to get her to open up when she’s convinced that exposing her secrets will cost her his love and respect? Will his love be strong enough to survive? Or will her secrets be the death of him?",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Amazon",
    "Novella"
  ],
  "author": "J.M. Witt",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/22088673-hiding-away"
}