{
  "title": "Meatball Sundae: Is Your Marketing out of Sync?",
  "description": "Gotta get me some of that New Marketing. Bring me blogs, e-mail, YouTube videos, MySpace pages, Google AdWords . . . I don't care, as long as it's shiny and new.Wait. According to bestselling author Seth Godin, all these tactics are like the toppings at an ice cream parlor. If you start with ice cream, adding cherries and hot fudge and whipped cream will make it taste great. But if you start with a bowl of meatballs . . . yuck!As traditional marketing fades away, the new tools seem irresistible. But they don't work as well for boring brands (meatballs) that might still be profitable but don't attract word of mouth, such as Cheerios, Ford trucks, Barbie dolls, or Budweiser. When Anheuser-Busch spends $40 million on an online network called BudTV, that's a meatball sundae. It leads to no new Bud drinkers, just a bad case of indigestion.Meatball Sundae is the definitive guide to the fourteen trends no marketer can afford to ignore. It explains what to do about the increasing power of stories, not facts; about shorter and shorter attention spans; and about the new math that says five thousand people who want to hear your message are more valuable than five million who don't. The winners aren't just annoying start-ups run by three teenagers who never had a real job. You'll also meet older companies that have adapted brilliantly, such as Blendtec, a thirty-year-old blender maker. It now produces Will it blend? videos that demolish golf balls, Coke cans, iPhones, and much more. For a few hundred dollars, Blendtec reached more than ten million eager viewers on YouTube.Godin doesn't pretend that it's easy to get your products, marketing messages, and internal systems in sync. But he'll convince you that it's worth the effort.",
  "genres": [
    "Business",
    "Nonfiction",
    "Buisness",
    "Management",
    "Audiobook",
    "Self Help",
    "Writing"
  ],
  "author": "Seth Godin",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/2210223.Meatball_Sundae"
}