{
  "title": "Ice Station Wolfenstein",
  "description": "Sam Cleave, reporter for a small newspaper, has seen better days. After his partner was killed during an undercover investigation, he lost his passion for work and living. But when a resident of a nearby assisted living home is tortured and murdered in a barbaric manner, he starts investigating. He is especially intrigued when a mysterious box is given to him that belonged to the dead man, but he needs help to interpret what it means.He teams up with Nina Gould, an expert in World War II history. Soon the two of them realize that they are about to discover one of the best-guarded secrets of the war, It dawns on them that this would be the discovery of a lifetime, a discovery of immeasurable value, and a discovery that men would kill for.They join an expedition, sponsored by an eccentric billionaire, hunting for gold and breathtaking art buried deep below the Antarctic surface. Instead of gold and stolen art, they find something terrifyingly disturbing beneath the eternal ice. A team of Nazi scientists has made an amazing discovery. But experiments have gone terribly wrong. The situation gets out of hand, and before long the expedition members find themselves peering into the deepest recesses of the human soul. Nina and Sam realize that their only hope for survival is to unlock the secrets of Ice Station Wolfenstein.Ice Station Wolfenstein leads the reader on a roller-coaster ride in search of a legend. Packed with breathtaking suspense and nerve-shredding action, Ice Station Wolfenstein is a thrilling read for all fans of action, suspense, and intrigue.A word from the author: Hello and thank you for your interest in my book. It has come to my attention that some people have been mistaking my books for those written by the famous author duo Douglas Preston and Lincoln Child. This is not the case. I wish to clarify that I am not, by any means, related to Douglas Preston or Lincoln Child, Lee Child or any other author called Preston Child. I hope this clears up the confusion.",
  "genres": [
    "Adventure",
    "Fiction",
    "Thriller",
    "Audiobook",
    "Action"
  ],
  "author": "Preston W. Child",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/22098813-ice-station-wolfenstein"
}