{
  "title": "Lone Wolf",
  "description": "Caught between human passion and animal magnetism...  William Le Feuvre is a wolf without a pack. He's chosen to live his life on the fringes of werewolf society, estranged from his father Roman, separated from his family, and at odds with his former pack mate, Errick--the only man who can bring the animal out in him. But when the local werewolf packs come under attack by a brutal and unstoppable force, William finds he has no choice but to align himself with his former pack if any of them wants to survive. But doing so means confronting the handsome, sexy and short-tempered Errick, now a powerful alpha in his own right--and the man William betrayed years earlier. Soon William finds himself walking a delicate line between the world of humans and monsters, dangerous passions and deadly secrets.  Excerpt:  As he pulled the Range Rover onto the white gravel of the drive, he saw the front door open and the seven remaining members of the pack emerge to greet him—Murphy, Millicent, the twins Michael and Gabriel, Dylan and Errick—all led by their queen, Saada. It was nice to see his family after so long, but William felt his stomach tighten at the sight of the tall, blond Norseman standing slightly apart from the others, sniffing the air and watching, always on the alert. It was, after all, Errick’s responsibility to keep the pack safe.  William wondered what provisions Ash had left behind in his final instructions, if he had named Errick his successor. If he had—that would make Errick his new alpha. The thought made the snakes in his stomach tighten even more.  As he got out of the vehicle, a light snow started falling once more over the mountains. The members of the pack gathered around him, touching and hugging. Murphy was a short, sturdy man and professional cowboy, sun-bronzed from working the cattle. He was a mated pair with Millicent, and together they took care of the estate both inside and out. Along with William, Errick and Saada, Murphy was also a Pedigree, the rest having been made werewolves by various members of the pack. He hugged Murphy, kissed sweet Millie on the cheek, and Dylan immediately sprang into his arms and gave him her usual daughterly hug. But when he came upon Michael and Gabriel—Errick’s lovers—he shook their hands noncommittally but otherwise kept his distance. Mike and Gabe were the youngest, made by Errick only five years ago, and thought model-handsome and seemingly eager to please, William didn’t really know them very well. Finally, he turned to Errick.  He was a head taller than William and he towered over everyone else in the pack, his muscular arms crossed in a defensive way over his thickly-muscled chest. His arms and legs were as thick as tree trunks, and long, thick, white-blond braids framed a square-jawed, severe face and ice-blue eyes. He was more striking than handsome, and for Errick it normally took no more than a glare to send a lesser werewolf running, though he knew how to fight, and fight well. His shoulders were broad and muscled, his body lean and strong. He wore a white, button-down shirt tucked into a pair of snug blue jeans, the sleeves rolled up to reveal his sinewy forearms and the multitude of primitive tribal tattoos that crawled down his forearms and over much of his body. The collar of the shirt was open just enough to show a spray of glistening blond hair. The antique torc he wore around his neck, set with a gleaming red tiger’s eye, sparked in the blinding, winter-white sunlight as he glared blankly down upon William.  Another you’ve disappointed, William thought bitterly.",
  "genres": [],
  "author": "Jay Ellison",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/22095405-lone-wolf"
}