{
  "title": "The Game Series Complete Collection",
  "description": "**$0.99 SALE LIMITED TIME. Normal price will be $4.99. If bought separately the series is worth $12.**\nThe Love Game\n: His challenge? Make her fall in love with him. Her challenge? Play the player. Until life changes the rules of the game.Maddie Stevens hated Braden Carter on sight. Arrogant, egotistical, and the playboy of the University of California, Berkeley, he's everything her brother Pearce has taught her to despise. So why, when the girls challenge her to play the player, doesn't she say no? She doesn't know either.\nPlaying for Keeps\n: She's in love with him. He's trying not to love her. One night changes everything.Aston Banks never meant to get close to Megan Harper - not even for that one night. Haunted by a childhood he refuses to face, he knew she could break through every wall he'd ever built and tear them down without even realizing she was doing it.Betraying Braden by starting a relationship with Aston wasn't on Megan's to-do list, but the second she sees a glimpse of someone other than the arrogant ass she's come to know, she can't walk away.\nThe Right Moves\n: Her past is wrought with demons. His past is full of heartbreak. Yet he's the one person that can remind her what it means to live.Abbi Jenkins never thought she would leave the walls of the mental institution that's housed her for the last year. Now she has, but that doesn't mean she's forgotten everything Pearce put her through.Blake Smith left London for one reason and one reason only. Running from the heartbreak of his past was never something he wanted to do, but with constant reminders everywhere he turned, it became his only option. When he arrives in New York City, he vows he'll keep the promise he made to his sister and get into Juilliard.Lines blur as their pasts are wrenched into the open, and they have to ask themselves whether they're too broken to ever to be fixed, or if they're the healing the other needs.\nWorth the Risk\n: She lost a part of her soul when he died. He lost his right hand man, his ultimate partner in crime. But it's that tragedy that might just push them together.If Kyle Daniels regrets anything, it's not being home the night his best friend died or going home for his funeral. Leaving Berkeley and heading back to Verity Point, Oregon, for the summer feels like returning to a hollow cave without Cameron there. The only thing that makes it bearable is the knowledge that Roxanne, Cam's younger sister, is still there.Roxy Hughes isn't the same girl he left behind six months ago. Destroyed by losing her older brother, her downward spiral has been uncontrollable. Alcohol and sex is her escape - complete oblivion being the only place she can forget the agony of that night. Because she's the only one that truly knows it.Kyle always promised Cam that if anything happened to him he'd protect Roxy, but one kiss takes his need to protect her to a whole new level. Now, she's more than just his best friend's sister. She's everything he wants, and he's everything she doesn't know she needs. But if he doesn't figure out a way to pull her from the deep, dark hole she's dug herself, she might just end up the same way as her brother.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "Sports",
    "Anthologies",
    "College",
    "Amazon"
  ],
  "author": "Emma Hart",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/22094493-the-game-series-complete-collection"
}