{
  "title": "The Broken Sword",
  "description": "For fans of swashbuckling adventures such as The Princess Bride and The Three When they tried to conquer the New World, the Espani lost soldiers, ships, wealth, and even their faith. But Don Lorenzo Quesada believes an ancient holy relic will restore his country to prosperity and honor, unless the military finds it first. Accompanied by his best fencing students, his Incan wife, and her sabre-toothed cat, Lorenzo races across his wintry homeland through a gauntlet of blood-thirsty assassins, undead demons, and giant beasts to recover the sacred skyfire stone.But when the stone is stolen and a massive Espani warship sets sail for Marrakesh, Lorenzo must stop a war that could destroy all the nations of the Middle Sea, even if it costs him both the holy stone and his life.Readers return to The Other Earth in this stunning vision of an alternate world where fantastical machines sail the seas and the skies, enormous prehistoric beasts still roam the earth, and the restless dead walk among the living. action/adventure | historical fantasy | swashbuckler | steampunk | Morocco | Spain 364 pages | 91,000 wordsA note about the textThis is a work of historical fantasy. Some of this world may be familiar to you.But in this world, Europe never emerged from the last Ice Age and only the southern areas are habitable. North Africa is cool, wet, and fertile. Ancient nations such as the Persian Empire have persisted, though others, such as the Romans, never rose to power. Some of the countries in this world reflect the cultures and attitudes of the Renaissance while others reflect the Industrial Age. Historical figures appear, though they too may be different from the ones you have known.Don't expect this world to conform to the history that you know. The people and places are different. The climate and wildlife are different.Even death is different here.",
  "genres": [
    "Steampunk",
    "Fantasy",
    "Fiction",
    "Alternate History"
  ],
  "author": "Joseph Robert Lewis",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/11292380-the-broken-sword"
}