{
  "title": "Among Animals: The Lives of Animals and Humans in Contemporary Short Fiction",
  "description": "\"Whether whimsical, sorrowful, or simply satisfying, the tales Yunker has brought together ask us to pay attention to not only our actions toward animals but also the emotions that motivate our behavior. Any animal lover or connoisseur of high-quality fiction will appreciate this collection and the artistry of its contributors.\" --Booklist  \"The sixteen talented writers who have produced Among Animals have produced more artistic possibilities than limitations in the tone and mood ... very fine literary fiction.\" — The Chattahoochee Review  Stories that affirm the indelible bond among humans and animals  The relationships among human and non-human animals goes back to the beginning of time—and the ways in which these relationships have evolved (and sometimes not) is the inspiration for this collection of contemporary short fiction, penned by writers from across the globe.  This diverse collection of stories explores the ways in which we live among—and often in conflict with—our non-human counterparts. These stories feature animals from the familiar (dogs and cats) to the exotic (elands and emus), and in these stories animals are both the rescuers and the rescued. Within these pages are glimpses of the world through the eyes of a zookeeper, a shelter worker, a penguin researcher, and a neighborhood stray, among many others—all highlighting the ways in which animals and humans understand and challenge one another.  Among Animals is a dynamic collection of stories from the world’s most gifted contemporary authors—those who pay close attention to the creatures with which we share our planet, and who inspire us to pay closer attention as well.  Stories & Contributors  Title - Author Alas, Falada! - Diane Lefer Greyhound - Jean Ryan Beyond the Strandline - Mary Akers Meat - C.S. Malerich Aren’t You Pretty? - Patrick Hicks The Ecstatic Cry - Midge Raymond Litter - Philip Armstrong The Boto’s Child - Rosalie Loewen Emu - Jessica Zbeida With Sheep - Carol Guess and Kelly Magee Pelicans - Julian Hoffman The Weight of Things Unsaid - Sara Dupree Blue Murder - Suzanne Kamata Bad Berry Season - Melodie Edwards Miriam’s Lantern - Ray Keifetz",
  "genres": [
    "Animals",
    "Fiction",
    "Short Stories"
  ],
  "author": "John Yunker",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22096210-among-animals"
}