{
  "title": "Stories and Scripts: an Anthology",
  "description": "Thought-provoking, dreamy, sad, and hilarious, this collection of works by Zack Love takes the reader on a diverse and unforgettable literary journey through a variety of topics, themes, and emotions. The anthology totals about 73,000 words and contains a novelette, four short stories, a theater play, and a screenplay.  These seven spellbinding stories spanning several styles and genres include a dramatic romance, a satire of the mega-rich, a somber and soulful reflection on the problem of evil, humorous dating adventures, and stories driven by philosophical musings.  1) THE DOORMAN – A NOVELETTE  Alex seems to have it a great penthouse apartment, a lovely girlfriend, and a prestigious Wall Street job. But below the surface he is sure of nothing but his angst-ridden doubts. And when he realizes that his doorman may be God, or sent by God, he will question things like never before.  This novelette is a story of New York doormen, tormented love, empty office life, and the theological questions that arise in response to the horrors of evil.  2) CENTRAL PARK SONG – A SCREENPLAY (ROMANCE)  Can love really conquer all? Rodney is a passionate black man with brilliant talents but a mental illness that leaves him homeless. Melinda is a white Manhattan law partner with an artistic soul, trapped by the pressures of corporate law, her wealthy father, and her three-year boyfriend. A charming, chance encounter leads to a magical courtship and life-changing choices that make an unlikely New York romance possible.  3) THE GRAND UNIFIED STORY – A SHORT STORY  What happens when a man and a woman meet in a way that magically involves the entire universe? When both are so keenly aware of their place in the cosmos that their connection seems to transcend their union and capture the very essence of life. This story shows how each person is a world to be discovered and how sometimes, when two worlds collide, the universe seems that much closer.  4) CITY SOLIPSISM – A SHORT STORY  Have you ever been on a train, bus, metro/subway – or any other shared space with strangers – and started to wonder what that person right next to you is thinking? This story takes you on a journey into the mind of a man in a suit and tie on a New York City subway car, as he thinks about the woman standing awkwardly close to him. They are total strangers but their proximity is almost intimate as their hands share the same metal subway pole.  5) WAITING FOR 2000 – AN ABSURDIST COMEDY OF BILLIONAIRE PROPORTIONS  Inspired by and reminiscent of Samuel Beckett’s absurdist stage play “Waiting for Godot,” this Y2K theater comedy satirizes the frivolous extravagance of the mega-rich.  Bob’s Billionaire Boat boasts the world’s 2,000 richest people on it, and will enable them to celebrate the arrival of the year 2000 twice in a row by crossing the International Dateline on New Year's Eve 1999. The co-captains of the boat — two regular guys — keep themselves amused with endlessly silly banter while occasionally debating whether the whole thing is just a fictional stage play.  Meanwhile, two Wall Street traders who are bitter about missing the wealth cutoff for the billionaire cruise are determined to blow up the boat and thereby become the two richest people on earth.  In this satire, the zaniest billionaires ever to gather on a single vessel prove that there's still plenty to complain about at the top.  6) MY BEST VALENTINE'S DAY. EVER. – A SHORT STORY  Sammy Laffowitz is legendary for his dating disasters and sex mishaps.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Comedy"
  ],
  "author": "Zack Love",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/22098463-stories-and-scripts"
}