{
  "title": "Tangoul Vechii Gărzi",
  "description": "Traducere din limba spaniola si note de Dan Munteanu Colan „Pagini de un erotism surprinzator si cu o doza serioasa de aventura.” (El País) Max Costa are saizeci si patru de ani si este soferul unui doctor elvetian instarit, ce traieste pe coasta Mediteranei, in Sorrento, in linistitii ani 1960. Intr-o zi, Max vede pe strada o doamna eleganta, mai in virsta, care i se pare cunoscuta.Din acest moment, trecutul navaleste peste batrinul sofer, care in perioada interbelica fusese un rafinat si viclean dansator monden in saloanele de lux ale inaltei societati. Femeia intilnita seamana cu o fosta iubita din tineretea sa, Mecha, cu care, demult, in anii 1920, fostul dansator colindase mahalalele din Buenos Aires in cautarea tangoului autentic, originar. Acum, dupa atita timp de la ultima lor intilnire, Max Costa decide sa revina pentru ultima oara la vechile sale indeletniciri, fara sa stie ca risca sa reinvie o poveste de iubire dramatica si ca se va trezi implicat, la fel ca in trecut, intr-o incilcita poveste de spionaj si interese politice, declansata de o banala partida de sah. „Tangoul Vechii Garzi e o demonstratie magistrala a faptului ca nu trebuie neaparat sa ne identificam cu eroii unui roman ca sa ne prindem in jocul lui. Descoperim in acest mare roman fenome-nala maiestrie a unuia dintre cei mai buni povestitori din literatura europeana, un as al intorsaturilor de situatie, al enigmelor politiste, al meandrelor derutante create de povestile sale de ura si iubire.” (La Croix) „Erotism, viata autentica, dorinte si aventuri, toate povestite de Arturo Perez-Reverte intr-o forma dintre cele mai atractive.” (La Vanguardia) „Un roman de maturitate, o carte rotunda, in care sint vizibile toate marile calitati ale autorului, cu o poveste ce curge fara momente de lincezeala, mereu sub tensiune, si un stil narativ de o concentrare maxima, plin de rigoare si eleganta.” (El Cultural)",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Spain",
    "Romance",
    "Spanish Literature",
    "Historical",
    "Contemporary"
  ],
  "author": "Arturo Pérez-Reverte",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/22098470-tangoul-vechii-g-rzi"
}