{
  "title": "Fate of the Five: Veil of Vasara",
  "description": "A new King needs a new Queen after his parents are found dead, but the Courting Season opens his Palace to candidates from all across the Five Kingdoms, including one who has been sent there with her brother...to win and kill him\n\n\nAthlion\nSorcery is banned yet vital for the world's survival. Both kinds of magic wielders, Accipereans and Dareans are either kept as captive \"Vessels\" to drain across the Five Kingdoms (Vasara, Jurasa, Kalnasa, Zeima and Audra), running for their lives, or cursed to do the bidding of humans. But there’s a problem, each Kingdom is beginning to run out of Vessels…\nYear 1118\nTwo Vessels, Nemina and Baz, escape from the Audra's draining centre. At the same time, Vasara's King and Queen are found dead. Their only surviving heir Eliel, has no choice but to hold the Courting Season, where candidates and an accompanying escort from each of Five Kingdoms are sent to vie for his hand in marriage. All the while, Eliel must hunt down the sorcerers wreaking havoc across Athlion.\nThe Bird of Death\nPrince Nathon Albarsan is only known to Athlion as “The Vulture”, a depraved assassin and spy for his father. But what Athlion, and even his own sister does not know, is that Nathon is not a willing employee. No more so than when he is tasked with escorting his sister Loria to the Courting Season as Audra's candidate, to help her fulfil their father's mission…kill the new King.Told from the first person perspective of eight individuals, Fate of the Five follows the lives of Nathon, Loria, Hestan, Eliel, Elias, Shadae, Nemina and Baz as they collide through schemes of politics and war, through tragedy and betrayal and in unlikely friendship and love.But the past holds devastating secrets and everyone has sinned to survive.What is everyone hiding?Where does the true evil lie?And what will remain…once it's unleashed?Trigger warnings include mention/involvement Violence, blood, sexual assault, domestic abuse, child abuse, suicide, substance use, mental health issues, panic attacks, derealization, captivity, infant harm, ableism (towards a disabled main character), torture",
  "genres": [
    "Fantasy",
    "Romantasy",
    "M M Romance",
    "Queer",
    "LGBT",
    "Fantasy Romance",
    "Dark"
  ],
  "author": "Niamh  Rose",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/221111902-fate-of-the-five"
}