{
  "title": "If I Fall, If I Die",
  "description": "Following his award-winning debut collection of stories, Michael Christie's heartfelt and wondrous first novel is The Curious Incident of the Dog in the Night-Time for our anxiety-prone age--and marks the emergence of a stunningly gifted young Canadian writer. For readers of Mark Haddon, Jonathan Lethem, Jonathan Safran Foer, Heather O'Neill, Anthony De Sa, and Junot Diaz.      Will has never been Outside, at least not that he can remember. For most of his young life he has lived happily Inside with his mother, Diane, a fiercely loving yet wildly eccentric agoraphobe who drowns in panic at the thought of opening the front door. Then one day, Will ventures Outside clad in a protective helmet and braces himself for danger. What he finds instead will set him on an unexpected journey of discovery.      Will embraces the Outside and his newfound freedom with enthusiasm, and he eventually befriends Jonah, a quiet Native boy who introduces him to the most reckless and exhilarating activity he's ever seen: skateboarding. Even as Diane's fears intensify, Will finds his own fears fading and his body hardening with each new bruise, scrape, and fall. But life Outside quickly grows complicated. When a local boy goes missing, Will and Jonah embark on an extraordinary adventure that draws Will far from the confines of his mother's closed-off world and into the throes of early adulthood and the criminal underbelly of small town life. All the while Diane must grapple with her greatest fear: will she be brave enough to save her son?      Full of dazzling prose and irresistible characters, If I Fall, If I Die is a beautifully tender and unforgettable story about mothers and sons, love and friendship, and learning when to protect the ones you love and when to let them fall.",
  "genres": [
    "Fiction",
    "Young Adult",
    "Mystery",
    "Canada",
    "Contemporary",
    "Coming Of Age",
    "Mental Health"
  ],
  "author": "Michael Christie",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/22106892-if-i-fall-if-i-die"
}