{
  "title": "Into the Fire",
  "description": "Suspense doesn't burn any brighter and desire doesn't run any deeper than when Suzanne Brockmann takes the helm, opens the throttle, and takes readers along for a breathless ride as she breaks the thrill barrier -- again and again. With Into the Fire, Brockmann lights the fuse on her most explosive story yet. Vinh Murphy -- ex-Marine and onetime operative for the elite security firm Troubleshooters Incorporated -- has been MIA ever since his wife, Angelina, was caught in a crossfire and killed during what should have been a routine bodyguard assignment. Overcome with grief, Murphy blames the neo-Nazi group known as the Freedom Network for her death. Now, years later, Freedom Network leader Tim Ebersole has been murdered -- and the FBI suspects Murphy may have pulled the trigger. To prevent further bloodshed, Murphy's friends at Troubleshooters scramble to find him and convince him to surrender peacefully. Murphy himself can't be sure what he did or didn't do during the years he spent mourning and lost in an alcohol-induced fog. He does know he occasionally sought solace from Hannah Whitfield, a former police officer and the very friend who'd introduced him to his beloved late wife.But Hannah, still grappling with the deafness that resulted from an injury sustained while on duty, was fighting her own battles. For years Hannah had feelings for Murphy, and one painful night their suffering brought them together in a way neither expected -- and both regretted.But finally, Murphy is ready to rejoin the living. As always, he finds himself knocking on Hannah's door, and as always, his longtime friend welcomes him back into her home. Yet even as Murphy slowly rebuilds his splintered life, he continues to fight his growing feelings for Hannah. Then he learned of Ebersole's murder and comes to believe that the Freedom Network has targeted him -- and Hannah -- to avenge their leader's death.Now Murphy must face the terrifying prospect of losing to violence another woman he loves.As the Troubleshooters desperately search for him, Murphy races toward a deadly confrontation with the Freedom Network and the ultimate choice: surrender his life in the hopes that Hannah will be spared, or risk everything to salvage whatever future they may have together.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Suspense",
    "Military Fiction",
    "Contemporary",
    "Contemporary Romance",
    "Fiction"
  ],
  "author": "Suzanne Brockmann",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/2210693.Into_the_Fire"
}