{
  "title": "Artists in Exile: How Refugees from Twentieth-Century War and Revolution Transformed the American Performing Arts",
  "description": "During the first half of the twentieth century—decades of war and revolution in Europe—an \"intellectual migration\" relocated thousands of artists and thinkers to the United States, including some of Europe's supreme performing artists, filmmakers, playwrights, and choreographers. For them, America proved to be both a strange and opportune destination. A \"foreign homeland\" (Thomas Mann), it would frustrate and confuse, yet afford a clarity of understanding unencumbered by native habit and bias. However inadvertently, the condition of cultural exile would promote acute inquiries into the American experience. What impact did these famous newcomers have on American culture, and how did America affect them?George Balanchine, in collaboration with Stravinsky, famously created an Americanized version of Russian classical ballet. Kurt Weill, schooled in Berlin jazz, composed a Broadway opera. Rouben Mamoulian's revolutionary Broadway productions of Porgy and Bess and Oklahoma! drew upon Russian \"total theater.\" An army of German filmmakers—among them F. W. Murnau, Fritz Lang, Ernst Lubitsch, and Billy Wilder—made Hollywood more edgy and cosmopolitan. Greta Garbo and Marlene Dietrich redefined film sexuality. Erich Korngold upholstered the sound of the movies. Rudolf Serkin inspirationally inculcated dour Germanic canons of musical interpretation. An obscure British organist reinvented himself as \"Leopold Stokowski.\" However, most of these gifted émigrés to the New World found that the freedoms they enjoyed in America diluted rather than amplified their high creative ambitions.A central theme of Joseph Horowitz's study is that Russians uprooted from St. Petersburg became \"Americans\"—they adapted. Representatives of Germanic culture, by comparison, preached a German cultural bible—they colonized. \"The polar extremes,\" he writes, \"were Balanchine, who shed Petipa to invent a New World template for ballet, and the conductor George Szell, who treated his American players as New World Calibans to be taught Mozart and Beethoven.\" A symbiotic relationship to African American culture is another ongoing motif emerging from Horowitz's survey: the immigrants \"bonded with blacks from a shared experience of marginality\"; they proved immune to \"the growing pains of a young high culture separating from parents and former slaves alike.\"",
  "genres": [
    "History",
    "Music",
    "Nonfiction",
    "Cultural",
    "Biography",
    "Art"
  ],
  "author": "Joseph Horowitz",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/2210372.Artists_in_Exile"
}