{
  "title": "Final Salute: A Story of Unfinished Lives",
  "description": "Based on his Pulitzer Prize-winning story, Jim Sheeler’s unprecedented look at the way our country honors its dead; Final Salute Is a stunning tribute to the brave troops who have lost their lives in Iraq and Afghanistan and to the families who continue to mourn them They are the troops that nobody wants to see, carrying a message that no military family ever wants to hear. It begins with a knock at the door. “The curtains pull away. They come to the door. And they know. They always know,” said Major Steve Beck. Since the start of the war in Iraq, Marines like Major Beck found themselves thrown into a different kind of mission: casualty notification. It is a job Major Beck never asked for and one for which he received no training. They are given no set rules, only impersonal guidelines. Marines are trained to kill, to break down doors, but casualty notification is a mission without weapons. For Beck, the mission meant learning each dead Marine’s name and nickname, touching the toys they grew up with and reading the letters they wrote home. He held grieving mothers in long embraces, absorbing their muffled cries into the dark blue shoulder of his uniform. He stitched himself into the fabric of their lives, in the simple hope that his compassion might help alleviate at least the smallest piece of their pain. Sometimes he returned home to his own family unable to keep from crying in the dark. In Final Salute, Pulitzer Prize–winning journalist Jim Sheeler weaves together the stories of the fallen and of the broken homes they have left behind. It is also the story of Major Steve Beck and his unflagging efforts to help heal the wounds of those left grieving. Above all, it is a moving tribute to our troops, putting faces to the mostly anonymous names of our courageous heroes, and to the brave families who have made the ultimate sacrifice for this country. Final Salute is the achingly beautiful, devastatingly honest story of the true toll of war. After the knock on the door, the story has only begun.",
  "genres": [
    "Nonfiction",
    "Military Fiction",
    "War",
    "History",
    "Memoir",
    "Biography",
    "Politics"
  ],
  "author": "Jim Sheeler",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/2210366.Final_Salute"
}