{
  "title": "Magical Elements of the Periodic Table Presented By The Alchemical Wizards Book 1",
  "description": "In this periodic table book, 20 Alchemical Wizards present Magical Elements of the Periodic Table. Each wizard wields a magical staff tipped with an element which gives them unique powers. Areg starts out Book 1 of the Alchemical Wizards by introducing the important element Argon on his element page. Thurwin rounds out the Book 1 elements by presenting facts and other fun information about the metal, Thulium on his element page. Another elemental favorite is Galoa, who represents Gadolinium. It gives her the power to control and manipulate electromagnetic waves, rendering her a formidable force in the world of technology and communication. Phova is truly magical, as Phosphorus gives her the ability to manipulate light and create illusions. She can control the intensity, color, and direction of light, allowing her to bend it to her will. The Alchemical Wizards, along with their techno-magical unicorn and dragon friends from the first 2 Magical Elements Books are the perfect group to introduce you to metals and other elements in the Periodic Table. Hopefully, the Magical Elements of this periodic table book will spark an interest in the magical and real world properties of all the metals and other elements known today. You may be surprised at how prominently they feature in our every day lives. Each element page in this book contains terms that might not be completely familiar to the reader. Refer to the definitions in the back of the book to get a clear understanding of each meaning. There is also a fun elemental themed Periodic Table at the back of the book. It features metal horn unicorns, dragons with element tipped tails, wizards and knights with elemental staffs and swords; and radiated goblins. Remember, \"No metal - No Magic. . .and No Technology\". It's Techo-Magical.",
  "genres": [
    "Contemporary",
    "Book Club"
  ],
  "author": "Sybrina Durant",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/221137207-magical-elements-of-the-periodic-table-presented-by-the-alchemical-wizar"
}