{
  "title": "Devil's Door",
  "description": "The road to freedom led her right to devil's door.Lainey was ready for her final test. Just one more hurdle to jump through before she could finally be accepted by the Devil's Due M.C. and ride behind the gorgeous Cade Turner. All she had to do was meet the man known only as Moloch. Sadistic and twisted, he is the feared President of the entire club and he has a plan for Lainey.The world of the club begins to reveal itself and her love for Cade is put to the test. Submit or fight? Struggle or succumb? These are the questions Lainey must face in this, the roughest, darkest, most twisted chapter in the saga of the Devil's Due. For Lainey has crossed the threshhold and entered the house of evil itself.The complete novel is now available! The Devil's The Novel is now on sale on Amazon! Get the whole saga for one low price!The Devil's Due Motorcycle Devil's DueDevil's DanceDevil's DoorDevil's DreamDevil's Day\"This is her,\" Cade exhaled, pulling me around from my hiding place.\"Your little arm decoration?\" The huge man rumbled, sneering at Cade mockingly.\"Just do what needs to be done,\" Cade gritted through his teeth.\"She can go upstairs. Second room on the right. Wait til it's time.\"Cade turned me swiftly and grabbed me by the shoulders. He shook me so hard that my teeth rattled in my skull. His blue eyes blazed fiercely. \"You fucking listen to me, you hear?\" His breath was ragged, gasping and his voice strained higher than I had ever heard. He sounded panicked. \"You get through this and you DON'T let him in, understand? Don't let him fuck with you.\"Cade pulled me to him, crushing me against his chest and nearly knocking the wind out of me. His lips slammed into mine, but the passion and fervor wasn't there. It seemed more like a farewell. \"You hold on and you get through it.\"He pulled away, and stalked out of the door. His shoulders were hunched and he was deliberately not looking behind him, not seeing me staring after him. The doorway framed him as he strode down the walkway and back to his bike. It looked like a picture frame that contained my entire world.",
  "genres": [],
  "author": "Vivian Lux",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/22108284-devil-s-door"
}