{
  "title": "Lucy Stone: An Unapologetic Life",
  "description": "In the rotunda of the nation's Capital a statue pays homage to three famous nineteenth-century American women Elizabeth Cady Stanton, Susan B. Anthony, and Lucretia Mott. \"Historically,\" the inscription beneath the marble statue notes, \"these three stand unique and peerless.\" In fact, the statue has a glaring Lucy Stone. A pivotal leader in the fight for both abolition and gender equality, her achievements marked the beginning of the women's rights movement and helped to lay the groundwork for the eventual winning of women's suffrage. Yet, today most Americans have never heard of Lucy Stone.Sally McMillen sets out to address this significant historical oversight in this engaging biography. Exploring her extraordinary life and the role she played in crafting a more just society, McMillen restores Lucy Stone to her rightful place at the center of the nineteenth-century women's rights movement. Raised in a middle-class Massachusetts farm family, Stone became convinced at an early age that education was key to women's independence and selfhood, and went on to attend the Oberlin Collegiate Institute. When she graduated in 1847 as one of the first women in the US to earn a college degree, she was drawn into the public sector as an activist and quickly became one of the most famous orators of her day. Lecturing on anti-slavery and women's rights, she was instrumental in organizing and speaking at several annual national woman's rights conventions throughout the 1850s. She played a critical role in the organization and leadership of the American Equal Rights Association duringthe Civil War, and, in 1869, cofounded the American Woman Suffrage Association, one of two national women's rights organizations that fought for women's right to vote. Encompassing Stone's marriage to Henry Blackwell and the birth of their daughter Alice, as well as her significant friendships with Frederick Douglass, Susan B. Anthony, and others, McMillen's biography paints a complete picture of Stone's influential and eminently important life and work.Self-effacing until the end of her life, Stone did not relish the limelight the way Elizabeth Cady Stanton did, nor did she gain the many followers whom Susan B. Anthony attracted through her extensive travels and years of dedicated work. Yet her contributions to the woman's rights movement were no less significant or revolutionary than those of her more widely lauded peers. In this accessible, readable, and historically-grounded work, Lucy Stone is finally given the standing she deserves.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Feminism",
    "Historical",
    "19th Century",
    "Womens"
  ],
  "author": "Sally G. McMillen",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/22104324-lucy-stone"
}