{
  "title": "Who Killed the American Family?",
  "description": "American families are the backbone of this nation. The American family is the fundamental institution that provided the Founding Fathers with the emotional support and driving courage to face the tyrannical government that threatened their very existence. The American family used to be the fundamental institution of our stable, liberty-loving, and very successful society. It is the essential building block of a free society with limited government. In the last hundred years, the American family has been attacked, debased, maligned, slandered, and vilified by every facet of society. No family is safe from the official busybodies. At issue is a rebellion against any sort of moral code. Who Killed the American Family reveals the concerted assault on the American nuclear family by many forces - feminists, judges, lawmakers, psychologists, school districts, college professors, politicians offering incentives and seeking votes, and more - opposed to the traditional American nuclear family, each with its own raison d'etre for wanting to abolish it. The wreckage of the American family leaves us with the inability to have limited government because government steps in to perform tasks formerly done by the nuclear family. Veteran conservative activist and thought leader who lead the charge to successfully defeat the Equal Rights Amendment in the 1970s Phyllis Schlafly explains how changes in the law, in court decisions, in the culture, in education, and in entertainment have eroded the once-precious institution. Any one of these factors would not have been enough to impact our families, but together they added up to a mighty force. Schlafly not only exposes the tactical charge the Left has implemented, but she offers hope and a plan for stopping anti-marriage incentives and how to restore in our culture the sacred nature of the family unit.",
  "genres": [
    "Politics",
    "Nonfiction"
  ],
  "author": "Phyllis Schlafly",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/22117044-who-killed-the-american-family"
}