{
  "title": "Armor of Glass",
  "description": "Take the movie \"An Officer and A Gentleman;\" add twenty years, twenty pounds, three kids, an absent wife, a bad civilian job-when a seductive old friend reappears.  In the spirit of Bukowski and Palahniuk, R.M.A. Spears paints a raw portrait of the American Everyman as he navigates the military, midlife and marriage in a changing world.  Ride along as the grizzled veteran battles commuters on a Dallas train as he reflects on a life of war and pain, of women and loss. With his head down, bulling through various assignments to make his version of the American dream a reality, a troubled Marine reaches the end of his rope, only to let go and tumble into a turbulent affair with a high-ranking woman on the fast track to general. What he doesn't know is that he will be the spark to ignite the powder keg of her past and in the end be left alone to rummage through the pieces.  2015 Winner- Next Generation Indie Book Awards for Debut Authors  2015 Bronze Medal Winner in Military Category- Readers' Favorite International Book Awards  \"A man relives the events that shaped his cynical view of life. It’s a skillfully crafted literary read.\"- Foreword Reviews 5/5 STARS  \"...one of the most realistic love stories I have ever read.\" -Readers' Favorite Eduardo Aduna- 5/5 STARS  \"If you are looking for a summer novel to read, you don’t have to look any further than Armor of Glass: A Novel - it is fantastic.\"- Readers' Favorite Kathryn Bennett- 5/5 STARS  \"If you like romance, a sprinkling of military talk and a lot of drama, you will enjoy Armor of Glass.\"- Readers' Favorite Patricia Reding- 5/5 STARS  \"It is a lasting story... those who look closely, such stories bring understanding and insight. Armor of Glass is such a story... a genuine tragedy, honestly told.\" -Readers' Favorite Patricia Reding 5/5 STARS  \"...a riveting love story laced with corruption and sexual misconduct that prevails in the Air Force.\" -Readers' Favorite Mamta Madhaven- 5/5 STARS  \"ARMOR OF GLASS follows a flawed man at war with his memories searching for peace.\" San Francisco Book Review -4/5 STARS  \"Spears’ long, illustrious military career gives him a clear knowledge of his source material.\" -Kirkus Reviews  \"Professionally written, the story...brings readers satisfyingly into the action with its realistic first-person narrative.\"-blueink  R.M.A. Spears is a retired Marine, having served twenty-seven years in the US Marine Corps and US Navy. He now resides in rural Missouri, where he pursues dual careers in writing and real estate development.",
  "genres": [
    "Romance",
    "Nonfiction",
    "Memoir"
  ],
  "author": "R.M.A. Spears",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/22113114-armor-of-glass"
}