{
  "title": "The Voices of Morebath: Reformation and Rebellion in an English Village",
  "description": "This delightful book offers a rare glimpse of life in a remote sixteenth-century English village during the dramatic changes of the Reformation. Through vividly detailed parish records kept from 1520 to 1574 by Sir Christopher Trychay, the garrulous priest of Morebath, we see how a tiny Catholic community rebelled, was punished, and reluctantly accepted Protestantism under the demands of the Elizabethan state.\"Significant and striking.\"-Peter Ackroyd, The Times (London); \"A vivid piece of microhistory . . . a rich and often witty portrait.\"-Alexandra Walsham, History; \"This book is a gem: small, colourful, many-faceted.\"-Lucy Wooding, Reviews in History; \"Stories like the one Duffy skillfully tells here, for historian and general reader alike . . . bear remembering.\" -Paul Lewis, New York Times Book Review Author Biography: Eamon Duffy is professor of the History of Christianity at the University of Cambridge and president of Magdalene College. His previous books include The Stripping of the Altars: Traditional Religion in England 1400-1580, and Saints and Sinners: A History of the Popes, both published by Yale University Press. Winner of the Hawthornden Prize for Literature.Synopsis taken from the inside-front jacket:In the fifty years between 1530 and 1580, England moved from being one of the most lavishly Catholic countries in Europe to being a Protestant nation, a land of whitewashed churches and anti-papal preaching. What was the impact of this religious change in the countryside? And how did country people feel about the revolutionary upheavals that transformed their mental and material worlds under Henry VIII and his three children.In this book a reformation historian takes us inside the mind and heart of Morebath, a remote and tiny sheep farming village where thirty-three families worked the difficult land on the southern edge of Exmoor. The bulk of Morebath’s conventional archives have long since vanished. But from 1520 to 1574, through nearly all the drama of the English Reformation, Morebath’s only priest, Sir Christopher Trychay, kept the parish accounts on behalf of the churchwardens. Opinionated, eccentric, and talkative, Sir Christopher filled these vivid scripts for parish meetings with the names and doings of his parishioners. Through his eyes we catch a rare glimpse of the life and pre-reformation piety of a sixteenth-century English village.The book offers a unique window into a rural word in crisis as the reformation progressed. Sir Christopher Trychay’s accounts provide direct evidence of the motives which drove hitherto law-abiding West-country communities to participate in the doomed Prayer Book Rebellion of 1549 – a siege that ended in bloody defeat and a wave of executions. Its church bells confiscated and silenced, Morebath shared in the punishment imposed on all the towns and villages of Devon and Cornwall. Sir Christopher documents the changes in the community reluctantly Protestant, no longer focussed on the religious life of the parish, and increasingly preoccupied with the secular demands of the Elizabethan state, the equipping of armies, and the payment of taxes. Morebath’s priest, garrulous to the end of his days, describes a rural world irrevocably altered, and enables us to hear the voices of his villagers after four hundred years of silence.”",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "British Literature",
    "School",
    "Church History",
    "Read For School"
  ],
  "author": "Eamon Duffy",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/22120.The_Voices_of_Morebath"
}