{
  "title": "Torn from the Inside Out",
  "description": "Domestic Violence Narrative Memoir During a cold, unseasonal, February thunderstorm in 1987 Sara Niles was forced to flee for her life from a violent and abusive husband, with five small children in tow. Thomas Niles was an obsessed, homicidal psychopath, intent of killing Sara, and his own children, rather than let them go. The story of Sara Niles is more than one woman's story, it is the untold story of thousands of victims of domestic violence who did not survive. From the author: \"In the process of my evolution, I became a victim of domestic war, an emotional casualty for a major portion of my life, entwined, entrapped and emotionally involved, until I learned how to become free. Freedom has never been easily gained and has often come at high cost throughout history, but one thing I will always know is freedom is worth every fight, and all pain\" \"In every life there is a timeless and unforgettable minute or day that will be forever etched into our mind's memory. I have unforgettable memories that are so vivid that I see them in Technicolor, and I hear them with surround sound. Long after I am dead, I believe, I will remember. Two of those memories were the days of my escape to freedom...twice\" Celebrate the power of the human spirit under fire: Torn From the Inside Out by Sara Niles Excerpt from chapter one: \"Thunder rattled the window- panes two stories high, and lightning split the sky, it was as if the whole world was in turmoil that night. My nerves were keyed up as tight as piano strings, and in a sudden moment of stillness and silence, it felt as though my heartbeat was amplified ten times over. He was over a hundred pounds greater than I, and nearly a foot taller than I, and I knew he could move his muscled body into unbelievable sprints. Rain started falling in torrents as the storm raged outside. I was not afraid of the storms of nature; it was the storm inside this night that I knew I might not survive\" February 13th, 1987, the night of Sara Niles' disappeared with her five small children. Table of Contents Part I Living on the 'Flower Bed of Eden' Chapter 1 The Garden of Eden Chapter 2 Golden Memories Chapter 3 The Age of Innocence Chapter 4 Upheaval Chapter 5 The Suitor Chapter 6 The Wedding Part II Descent Into the Abyss of Hell Chapter 7 Storm Brewing Chapter 8 Foreboding Chapter 9 Into the Lair Chapter 10 Bonding Chapter 11 Shattered Dreams Chapter 12 Meanderings of a Lost Mind Chapter 13 Into the Fire Chapter 14 Gain and Loss Chapter 15 Baby Thomas Chapter 16 Evolution Chapter 17 Touchstones Chapter 18 Para Normal Chapter 19 Paranoia Chapter 20 Yellow Roses Chapter 21 Enter Ariel Part III The Butterfly Borrows Eagle Wings Chapter 22 Building Resentment Chapter 23 The Fight Chapter 24 The Gambler Chapter 25 Full Fledged Chaos Chapter 26 Post Trauma Distress Chapter 27 The Breaking Point Chapter 28 The Milestone Chapter 29 The Power Struggle Chapter 30 The Awakening Chapter 31 The Cold War Chapter 32 Imminent Danger Chapter 33 Retrospection Chapter 34 The Crucible Chapter 35 The Flight Chapter 36 Reconnoiter Epilogue Sample chapter of The Journey by Sa",
  "genres": [
    "Nonfiction"
  ],
  "author": "Sara Niles",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/22127213-torn-from-the-inside-out"
}