{
  "title": "The Bin Ladens: An Arabian Family in the American Century",
  "description": "The rise and rise of the Bin Laden family is one of the great stories of the twentieth century; its repercussions have already deeply marked the twenty-first. Until now, however, it is a story that has never been fully told, as the Bin Ladens have successfully fended off attempts to understand the family circles from which Osama sprang. In this the family has been abetted by the kingdom it calls home, Saudi Arabia, one of the most closed societies on earth.Steve Coll’s The Bin Ladens: An Arabian Family in the American Century is the groundbreaking history of a family and its fortune. It chronicles a young illiterate Yemeni bricklayer, Mohamed Bin Laden, who went to the new, oil-rich country of Saudi Arabia and quickly became a vital figure in its development, building great mosques and highways and making himself and many of his children millionaires. It is also a story of the Saudi royal family, whom the Bin Ladens served loyally and without whose capricious favor they would have been nothing. And it is a story of tensions and contradictions in a country founded on extreme religious purity, which then became awash in oil money and dazzled by the temptations of the West. In only two generations the Bin Ladens moved from a famine-stricken desert canyon to luxury jets, yachts, and private compounds around the world, even going into business with Hollywood celebrities. These religious and cultural gyrations resulted in everything from enthusiasm for America—exemplified by Osama’s free-living pilot brother Salem—to an overwhelming determination to destroy it.The Bin Ladens is a meticulously researched, colorful, shocking, entertaining, and disturbing narrative of global integration and its limitations. It encapsulates the unsettling contradictions of globalization in the story of a single family who has used money, mobility, and technology to dramatically varied ends.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Politics",
    "Terrorism",
    "War",
    "Islam"
  ],
  "author": "Steve Coll",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/2211931.The_Bin_Ladens"
}