{
  "title": "Dun Djinn",
  "description": "Warning: Not suitable for anyone below 18 years of age. Contains adult themes and a very kinky Djinn.What's better than having 12 free wishes? Alicia's not sure but she does know that something out there has to be better than having the undivided lustful attention of a hot, demanding and extremely sexy Djinn. He requires her obedience and has no issues using his enchantment to ensure her submission...Alicia learned a valuable lesson in her previous encounter. It would seem that the touch that she risked an eternity of slavery for has indeed cost her a human future. After being tricked by the wily Djinn, she's dragged into his dimension where he intends to have her serve him forever.But Alicia is not a submissive sort of girl. What's any red blooded girl to do when dumped into a scenario she never volunteered for? Especially one without a conscience or morals? Whatever it takes to get what she needs... naturally.Why is it that Alicia so enjoys getting what she deserves? For lovers of hot alpha male characters, myth, legend, magic and folklore, this is an adult fairy tale with a twist. A continuation of the Djinn series, this supernatural story is not for the faint-hearted. If you're a fan of paranormal erotic romance than this story is for you!Excerpt:She'd slowly come around, blinking herself awake with yawn. She'd started to stretch but instead of feeling the Egyptian cotton of the sheets on her bed, she could feel the brawny strength of a pair smoothly skinned arms.Alicia froze.The Djinn, whose name was Nasaan held her casually as if her weight was of no concern, striding down a hallway.She'd awakened in the arms of a now fully-corporeal Djinn.She looked around frantically. They were in a massive corridor with beige stone lintels and hand painted walls. Balls of light burned in the alcoves without any source of fuel. Butterflies and birds, never seen before on earth fluttered or flapped and tweeted in abandon up by the rafters.To add insult to injury, they were also in another dimension.She was naked, in the arms of the Djinn who'd given her untold pleasure and now owned her body and soul and in another realm of reality. Oh hell no!She slowly turned her head back to him only to find his curious dark eyed gaze upon her.She gave a strangled squeak and flailed around abruptly to the point where he was forced to drop her. She landed awkwardly, stumbling and staggering until she landed with a plop, on her bottom.Her abused and ill-used bottom.She looked up at him... and kept looking up. Nasaan was tall.The exotic cast in his features hailed back to ancient times, hinting at palm trees and sand. His skin was more olive then tanned with an undertone of green that spoke more of the supernatural than eastern climes.His huge dark eyes had no pupils and lilted, turning up at the corners. They were focused on her now with a disapproving expression, his aristocratic features carefully bland. His long dark hair was pulled over his shoulder and poured down his front ending just below his knees. On her world, it had just kind of dribbled off into circling mist along with his legs.But there was no mist to be seen now.His massive shoulders were sleekly muscled and his biceps were pulled into to sharp relief by the irritated cross of his arms.His powerful lower body was clothed in a snowy white pleated shendyt that covered him down to his knees. The ornamental belt and buckle holding up the linen was exquisite and of the highest workmanship with tassels that dropped, swaying with his movements.She wasted a bit more time avoiding his eyes by looking at those tassels. Then she examined his sandals.\"Have you finished your hysterics?\" he asked politely.\"Uh... quite finished.\"\"Then follow me.\"\"I'm not walking without shoes!\"\"You're trying my patience again.\" He spoke without inflection. It was more terrifying than having someone scream at you.A fresh novel/novella from the newest monster erotica style Author.",
  "genres": [
    "BDSM",
    "Adult",
    "Erotica"
  ],
  "author": "Stella Inox",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/22125934-dun-djinn"
}