{
  "title": "Big Sky Romance Collection: A Cowboy's Touch, the Accidental Bride, the Trouble with Cowboys",
  "description": "A Cowboy's TouchAbigail is just in Moose Creek, Montana for the summer to temporarily care for her great aunt. But a tender-hearted cowboy beckons her to stay.Abigail Jones intends to spend just one summer in middle-of-nowhere Montana with her Aunt Lucy. Time away from her job is just what Abigail needs to reassess her life. The slow pace has her breathing deeply for the first time in years. And the majestic scenery encourages her to get reacquainted with herself . . . and God.What she didn't count on was the handsome widowed cowboy who owns the ranch where her aunt lives. When the rancher loses his daughter's nanny, Abigail decides to lend a hand for the summer.Wade Ryan can't help being attracted to Abigail. But he's given up everything to protect his daughter, and he's not about to risk it all on a pretty face.Under Abigail's care, Wade's home and daughter thrive. And with Wade's touch, Abigail's heart feels at home at last. But Abigail knows this elusive rancher is hiding something. Will her own secrets separate her from the cowboy who finally captured her heart?The Accidental BrideWhen a wedding reenactment turns real, Shay finds she’s an accidental bride.Shay Brandenberger is raising her daughter in Moose Creek, Montana, on her childhood ranch, nestled against the Yellowstone River. Despite the hard work, she can’t seem to keep her head above water—and now the bank is threatening to foreclose. She prays for a miracle, but the answer she receives is anything but expected.Having agreed to play the bride in the Founders’ Day wedding reenactment, Shay is mortified to be greeted at the end of the aisle by none other than Travis McCoy, her high-school sweetheart—the man who left her high and dry for fame and fortune on the Texas rodeo circuit.Then the unthinkable happens. Thanks to a well-meaning busybody and an absentminded preacher, the make-believe vows result in a legal marriage. But before Shay can say annulment, Travis comes up with a crazy proposal. If she refuses his offer, she may lose her home. If she accepts, she may lose her heart.Shay isn’t sure if the recent events are God’s will or just a preacher’s blunder. Will trusting her heart to the man who once shattered it be the worst mistake of her life? Or could their marriage be the best accident that ever happened?The Trouble with CowboysOnly one pair of boots—and the cowboy wearing them—can get Annie out of the mess she’s in.Annie Wilkerson is Moose Creek’s premiere horse trainer and equine columnist for Montana Living. Money is tight as she tries to put her kid-sister through college and provide for her young nephew. When Annie’s column is cancelled, she’s given first shot at a new lovelorn column—and she can’t afford to turn it down. Only problem is . . . Annie’s never been in love.Always resourceful, she reluctantly strikes a deal with the town’s smooth-talking ladies’ man Dylan Taylor: She’ll work with his ailing horse, Braveheart, if he’ll help her answer the reader letters.Working closely with Dylan is harder than Annie imagined, and she quickly realizes she may have misjudged him. But her unwavering conviction that cowboys are nothing but trouble has kept her heart safe for years. And she can’t risk getting hurt now.The more Annie tries to control things, the more they fall apart. Her feelings are spinning out of control, and her sister’s antics are making life increasingly more difficult. Annie knows she needs to turn the reins over to God, but surrender has never come easily.When Dylan reveals his feelings for her, Annie doesn’t know what to trust—her head or her heart. The trouble with this cowboy is that he might just be exactly what she needs.",
  "genres": [
    "Romance",
    "Christian Fiction",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Denise Hunter",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/22124101-big-sky-romance-collection"
}