{
  "title": "All Night Long",
  "description": "When Irene Stenson returns to the Northern California town of Dunsley, she finds that her friend, Pamela, has died suddenly, leaving behind a lot of unanswered questions. Staying at the local lodge, Irene is assisted by Luke Danner, a hazel-eyed ex-Marine, and together they will risk more than local gossip to find out what really happened. Unabridged. 1 MP3 CD.Shy, studious Irene Stenson and wild, privileged Pamela Webb had been the best of friends for one short high school summer. Their friendship ended the night Pamela dropped Irene off at home - and Irene walked in to discover her parents’ bodies on the kitchen floor. It was ruled a murder-suicide, and Irene fled Dunsley, determined to wipe out every memory attached to her northern California hometown. But now she has been summoned back.Pamela’s e-mail had been short and cryptic. More alarming, it included the code word they had used as teenagers, suggesting an urgency and secrecy that puzzled Irene. What could be important enough to make her former friend get in touch after all these years? She won’t find out - at least not from Pamela, who lies dead in the luxurious home of her father, a U.S. senator, pill and liquor bottles beside her. The shock has barely subsided before the rumors begin to swirl.Irene had planned to get out of this place as quickly as possible. But her reporter’s instinct - and her own hunger to know the truth - compel her to extend her stay at the local lodge. Even more compelling is the man who runs the place - a hazel-eyed ex-Marine who’s as used to giving orders as Irene is to ignoring them. Luke Danner can see the terrified young girl hidden beneath Irene Stenson’s black-clad, confident exterior - and he is intent on protecting her. But he is also driven by passions of his own, and together they will risk far more than local gossip to sort out what happened to Pamela Webb, and what really happened on that long-ago summer night.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Mystery",
    "Contemporary",
    "Suspense",
    "Contemporary Romance",
    "Fiction"
  ],
  "author": "Jayne Ann Krentz",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/2211877.All_Night_Long"
}