{
  "title": "To Insanity and Beyond, a Mom's Journey",
  "description": "Despite its spacey title, this book's take on parenting and family is down to earth and funny!Preview here what type of stories you'll read. This collection is about every mom, dad, and surviving each and every stage of growing up.Spoiler it's not just the kids who need growing up!Excerpt The Play Doh FactorI met my husband in college, about a thousand years ago. Well, maybe not quite that long. It’s just that after 2 kids, three dogs, a bird, 20 odd one way moves, separations, goodbyes to friends, and high and lows, when we celebrated the Millennium, I felt more as though we were commemorating my life time.As I said before, I met my husband in college, and if I must be exact in calendar years, I would estimate that it was about 22 years ago. My husband and I took some of the same classes, sat through impromptu discussion groups just for fun, and had the same interests. We were equals back then.We have been together all these years, living in the same house, sharing the same children, but we’re not equal any more.Don’t get me wrong, I feel a great sense of accomplishment (and exhaustion) every day. I am a stay at home mom (my kids are turning out pretty good), I keep a neat house (a couple of days of the week), I put in many volunteer hours in the schools and community (I know my efforts are valued), but I realize my college professors would be disappointed by the outcome.My husband has two Masters degrees, can hold intelligent conversations with words in excess of two syllables, and can apply oxymoron’s without stumbling and making a moron of himself.My college studies however were not totally I use negotiating skills I learned in Political Science to get my kids to behave, guilt I learned in my Psychology class to get my husband to do things for me, and the Chemistry I once took taught me how to mix a mean infant formula when my kids were little.Okay, okay, you're probably wondering what this has to do with Play Doh.It was on a hike that we ran into a classmate of my husband’s from school. My husband dutifully introduced his family, but not surprisingly, didn’t offer the man’s name.My kids were one and three years old back then.A few minutes later when my husband approached I said, “You don’t remember his name, do you?”“I think it’s Bill”, he responded, “At school we call him Plato” he added.That caught my attention. “Why do you call him Play Doh?”“I don’t know, I guess he’s some kind of expert on Plato” my husband responded.“Why would anyone want to be an expert on Play Doh?” I asked patronizingly.\"Who knows?\" He responded impatiently, \"He just happens to know a lot about Plato.\" Aware of my interest, yet confused by it, he patiently added with \"He's just interested in all the Great Philosopher's. That's all.\"That statement finally shut me up.Read more...",
  "genres": [],
  "author": "Bria Daly",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/22123905-to-insanity-and-beyond-a-mom-s-journey"
}