{
  "title": "The Spoon Tree ~ A Family Series: Book Two: Tom and Abby's Story",
  "description": "In Tom and Abby’s Story, their engagement is announced to Tom’s eight kids and Abby’s daughter and grandkids. This is the story of two people in love, coming together, and joining their families to become one. In this story, Abby’s not the only one who falls for a Riley man. Abby’s daughter Laura, and her granddaughter Jackie also think the Riley guys are kind of hot…Excerpt - Jackie and “Oh, good. Jackie and I may have to run some errands on Saturday morning, so I wanted to make sure we’d have time. We’re going shopping for prom dresses!” Abby said a little too excited.Jackie rolled her eyes.Tom was as bad an actor as Abby. He turned to Brian who’s face had turned a dark shade of red, and quickly looked away, but first he asked Jackie, “Great. I hadn’t heard you were going. So you already have a date?”Jackie looked down at her hands and said, “A senior asked me, but I said no. I wanted to ask someone else maybe.”Brian looked at his father, and then turned to Jackie and said, “I’ll take you.”Todd chuckled, Lizzie smiled, Tom smirked, Abby held her breath, and Jackie beamed. Andy did nothing; he was sleeping.The restaurant suddenly felt airier once everyone let out their breath.But Jackie hadn’t really said anything. So Brian added, “That is, if you want.”“Uh, sure. Cool. So,” she looked at her grandmother, “So are you taking me to your Senior Prom? Or am I taking you to my Junior Prom?”“Uh, whatever you want.”“Or we can go to both...”Todd laughed out loud and his father gave him a dirty look. So Todd, another bad actor, covered his faux pas by pretending to cough, which led to some gagging and choking. A definite case of bad karma…Abby felt sorry for him and pushed a glass of water over, Tom smirked.Fortunately, Jackie and Brian were so relieved, they didn’t notice a thing.“Okay, now that we all have plans and stuff to do, how about we get this little guy home and to bed before he suffocates in his mozzarella?”Only Tom heard Abby, and when she kicked Jackie under the table, Jackie gave her a distracted, ‘kay’ answer.Tom had already paid, so he tried to get ahead of Abby to pick up a sleeping Andy, but Todd got to Andy first. Andy fell into his arms without even noticing he was being picked up.It was a great dinner. And so far, things were looking really good.",
  "genres": [],
  "author": "Bria Daly",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/22123898-the-spoon-tree-a-family-series"
}