{
  "title": "The Spoon Tree ~ A Family Series: Book One, Abby's Story",
  "description": "Abby is 53 and has twin grown daughters. Her life turns upside down when Carrie dies and she must raise Carrie's three young children. Things begin to turn around when Abby is faced with another unexpected twist. After a loveless life, and at a most inconvenient time, Abby finds love for the very first time, with a widower and eight kids.Excerpt - when Carrie “Hello?”A child’s voice responded, “Gabby?”Abby heard the small voice, and immediately thought it was Andy.“Hi little prince. To what do I owe this great honor?”“It’s me, Gabby. Jackie,” there was a muffled sound in the back and then Jackie’s strained voice, “You need to come here now.”Abby’s body went cold. She heard the desperation in her granddaughter’s voice. There was no preamble, and Jackie was never melodramatic, not even as a teen.Abby froze. She was standing in the middle of the parking lot and heard somebody yell out some choice words for her to get out of the way.“Jackie. Slow down honey. What’s going on? Where’s mom?”There was silence on the other end.“Jackie, talk to me. Where’s your dad? Let me talk to your mom or dad. Jackie, I can’t help unless you tell me what’s wrong,” she whispered.“Gabby I… I don’t know what happened. But they’re not here,” she said softly and then started sobbing into the phone.Now it was Abby’s turn to be silent. She had walked to her car and suddenly found herself sliding down its side until she was on her knees on the dirty pavement.“Baby. Are you there? Listen, I’ll fly over there right now, but… you’re scaring me honey. What do you mean they’re not there? Where did they go? When did they leave?”Jackie pulled together what little strength she had, and between sobs and hiccups told Abby that some policemen had come to her door and started going through their things. Her mom and dad had gone for a quick afterthought run to the supermarket, and had asked her to stay at home with the little ones. Forty minutes later, their house had filled up with policemen.“Gabby, there are a whole bunch of policemen and they won’t talk to me. They just want us to come with them. I don’t know where they want to take us, but something bad happened.”“They want you to go where with them? Where are you now?”“They called a lady over and she told us to pack some things up to leave the house and go with her. They’re all downstairs now. I’m not going anywhere until you get here Gabby! Please come soon…” her voice was less than a whisper.“Baby, where are you now?”“I grabbed Liz and Andy and we’re in mom and dad’s room. There’s a lock in this room. They tried to open it anyway, but I moved the dresser and…”Abby heard her granddaughter sobbing. She felt her granddaughter’s pain and shook and cried with her, even though they were a thousand miles apart.Abby knew she had to talk to the policemen. She had to, but didn’t want to. When she finally spoke to them she’d know what was happening. And once they told her, it would be real. Even at that point she understood her logic was flawed, but she held onto it while she could.",
  "genres": [],
  "author": "Bria Daly",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/22123891-the-spoon-tree-a-family-series"
}