{
  "title": "The Black Rose",
  "description": "What do you want to be when you grow up, Meredith? A dead attorney had not been her answer, she was pretty darn sure. After years of experience in the courtroom, Assistant State Attorney Meredith O'Brien finds herself the target of street thugs and deep into uncovering the truth about a serial rapist and killer intent on taunting the police and her. What was the meaning of the black rose? After years of being alone she also finds herself being pursued by her ex-boyfriend detective and a mysterious Atlanta billionaire, not to mention a dog with the intelligence of a four year old. Both of the men are infuriating, persistent and intent on getting into her life, business and more personal places. Surrounded by a cast of unpredictable characters including co-workers, relatives, psychics and bounty hunters, she finds her entire life has gone crazily out of control. Strong willed, sharp-tongued and explosive, she discovers the media is quick to paint a target on her back. Dodging bullets and physically fighting bad guys was not what Meredith envisioned when she went to law school or took her job in the small, picturesque Florida city of Gainesville. Dying prematurely was also not what she had envisioned. This cozy romantic action thriller is packed with suspense, adventure, comedy and women sleuths fighting crime. This is a detective story with heart and a touch of the paranormal, as Meredith O'Brien applies her brand of the law, up close and very personally. A fine blend of romance and mystery, it follows the drama as police are confronted with crimes against the community and those that enforce the law. If Meredith survives the attacks on her, she still has to deal with her meddling friends and family pushing romance and impossible relationships on her. What's a girl to do? This first of the O'Brien's Law Mystery series is available as a paperback and Kindle eBook.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Amazon"
  ],
  "author": "Sam Berretti",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/22127581-the-black-rose"
}