{
  "title": "Ten Questions - The Insider's Guide to Saving Money on Auto Insurance: Hidden Discounts Revealed",
  "description": "\"The Best Consumer Guide to Saving Money on Car Insurance. Period.\"As a licensed insurance agent, I led my company as the #1 producer in the NATION for five consecutive quarters. I've sold thousands of car insurance policies in over 30 different states. Read my book before your next renewal. You have nothing to lose but your overpriced policy. Remember this:No matter how similar the title, there is only ONE consumer guide to saving money on car insurance that truly does what it promises--reveal the hidden discounts that you should be getting, but aren't. TEN .99 cent \"books\" on auto insurance will not provide you with the value and knowledge that you will find in my work. Ten Questions is available in paperback, eBook, and audiobook versions. The imitators aren't, because anyone can upload an eBook pamphlet based on someone else's work, but only a publishing professional who is also an insurance expert can give you information like:How is your car insurance rate determined? Knowledge is money in your pocket, because the more you know about how the rating process works, the less you will pay. You are looking for information that will help you save your hard-earned dollars, and you have found it.The ebook version of this guide contains over 40 working internal and external hyperlinks, and it is one of the best-formatted non-fiction books you will find anywhere--check out the sample.Ten Questions is not a book for \"dummies,\" but it is an easy to use, engaging, and informative guide, specifically designed to help save you money.It is absolutely guaranteed to do just that. If you do not find any benefit in Ten Questions, (no matter which version you buy) simply return it for a full refund, subject to retailer policy.Find out what the insurance companies don't want you to know, like the fact that you can switch carriers any time you want, as often as you want. You do not have to wait until your current policy expires or renews in order to do so.Ten Questions isn't about getting the cheapest policy at the cheapest price. It's about getting the best policy at the best price, and here's how:-It will help you find and qualify for discounts.-It will show you how to improve your rating tier, and lower your \"base rate.\"-It will help you allocate your premium dollars more effectively, so that you don't spend money on coverages you don't need or want.Learn the answers to the Ten Questions today, and get a better policy for less money, tomorrow.FAQS about Ten Questions:Q: How is Ten Questions different from other \"how-to\" and \"instructional\" guides that claim to have the same information?A: Most of those books were written by insurance agents who were not \"specialists\" in auto insurance. Auto insurance is all I know, and all I do. In three years, I sold more policies in more states than most agents will in a lifetime. Ten Questions is about saving you money on auto insurance, nothing else.Q: Isn't using this guide \"cheating?\"A: Owning a crowbar is not a crime. Using it to break into houses and businesses is a crime. Merely possessing a very powerful tool is not an indication that you intend to use it for unethical or immoral purposes. Ten Questions is a tool, a \"rule book\" if you will, about auto insurance. Knowing those rules allows you to play the game fairly. Nobody who plays any game \"fairly\" can rightfully be called a \"cheater.\" Think of it as \"test preparation,\" not \"cheating.\"",
  "genres": [],
  "author": "John  David",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/11293914-ten-questions---the-insider-s-guide-to-saving-money-on-auto-insurance"
}