{
  "title": "A Chance Beginning",
  "description": "Erik Eleodum is a simple man. He doesn’t want to be a hero. He doesn’t need fame or fortune. He is content farming his family’s homestead in northern Háthgolthane and raising a simple family, like his father, for the rest of his life. In fact, adventure is the last thing on his mind. Befel, Erik’s brother, and Bryon, his cousin, can’t think of anything worse than farming for the rest of their lives. They want to be heroes. They want fame and fortune. They want to leave their families and go east, to the country of Golgolithul, where they are sure to find easy wealth and great adventure. But when these three young men leave their farmstead, they quickly discover the world is not so simple, not so easy. Most fortune is laden with treachery, fame must be earned with blood, and adventures are rarely grand. Ideas of grandeur are crushed and the road east is hard. To get there, these men must ultimately sell their swords and become friends with thieves, dwarves, soldiers, and mercenaries well past their prime. They battle a band of ruthless slavers, slip past assassins, and experience the deadly consequences of black magic. Will Erik ever be able to return to the simple life? Will he unwittingly become famous, become rich, become a hero? Or, will he even survive? Often the deeds of those deemed smaller, either in stature or status, go uncounted by chroniclers of history. Yet, it is these deeds that repeatedly change the course of history. For every hero whose feats minstrels sing, there were fifty men following his stead, giving blood and sweat just as he did; and because they were not the first to return from a long voyage away, or perhaps they did not return at all, their glories are never sung. This is a story about those men who would only be known in the local legends, who would have been forgotten by time save for a small bit of chance. Chance, Fate, Destiny, Dumb Luck; all these and more, and then maybe none of these things, are the reasons a young man can go from a farmer’s son, a boy of lowly birth born with dirt on his face, to a great warrior, a kingly knight, a dragon slayer. Three young farmers, tired of plowing endless fields from sunrise to sunset, gave up all they knew to pursue fame, pursue riches. Their crying mothers at their backs and the unknown ahead of them, they worked in pigsties, slept in the alleys of outskirt cities, traveled with strangers and shed blood unwillingly. They trusted men they should not have trusted, and did not trust those they should have. These young men who left their way of life for fame and glory would soon learn, as most young men full of grand ideas and just ideals do, the world is not what they thought it to be.",
  "genres": [
    "Fantasy"
  ],
  "author": "Christopher  Patterson",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/22140879-a-chance-beginning"
}