{
  "title": "Ensel und Krete: Ein Märchen aus Zamonien",
  "description": "Achtung, Erlebnis! Hier wispert, raunt und runzt es, dass es eine Art hat. Hier gluckst der Bär, knarzt der Zwerg und haucht der Wolf, dass man sich tiefer in den Sessel schmiegt: Keine Chance, es nicht zu mögen, Dirk Bach zieht einen in den Bann seines Lesefurors. Hier nimmt sich ein Schauspieler das volle Recht. Keine Honorarabgreife, lieblos herunter gelesene Pflichtübungen: Bach macht sich das Vergnügen, einen vielstimmigen Text vielstimmig zu lesen: Meine Ohren lassen vielmals danken! Beim Buch selbst allerdings frage ich mich: Für wen schreibt Moers eigentlich? Für Kinder? Werden die denn seine amüsante Parodie auf Literaturbetrieb und Literatengehabe verstehen? Oder für Erwachsene? Aber werden die wirklich viele Stunden lang den Abenteuern zweier Zwergenkinder folgen wollen?  Zwergenkinder, Literaturbetrieb? Nun: zwei Kinder aus dem Fantasieland Zamonien verlaufen sich, als sie im zamonischen Ferienparadies (der erwachsene Hörer begreift: Klasse Parodie auf \"sanften Tourismus\"!) vom Weg abweichen. Es folgt ein dreitägiger Horrortrip durch einen Wald voll unbekannter Schrecken, mit mörderischen Fabelwesen und ebensolchen Pflanzen. Er endet erst, als die \"Hexe\" -- eine zu ständiger Verwandlung und gruseligsten Verstellungen fähige \"zanonische Lebensform\" -- in einem Gigantenkampf des gesamten Waldgetiers vernichtet ist. So weit das Märchen. Und warum nun \"Literaturbetrieb\"? Vorgeblich hat sich das alles ein zanonischer Dichter mit dem wunderbaren Namen Hildegunst von Mythenmetz ausgedacht. Dieser literarische Großfürst unterbricht immer wieder -- an den spannendsten Stellen -- den Erzählfluss, um weitschweifige, überaus eitle und auf amüsante Weise bescheuerte poetologische Erklärungen abzugeben. Bei Dirk Bach klingt er ein bisschen wie ein durchgeknallter Marcel Reich-Ranicki. Für Kinder? Für Erwachsene? Moers für alle! --Michael Winteroll",
  "genres": [
    "Fantasy",
    "Fiction",
    "German Literature",
    "Humor",
    "Audiobook",
    "Young Adult",
    "Roman"
  ],
  "author": "Walter Moers",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/2214599.Ensel_und_Krete"
}