{
  "title": "No One Had a Tongue to Speak: The Untold Story of One of History's Deadliest Floods",
  "description": "On August 11, 1979, after a week of extraordinary monsoon rains in the Indian state of Gujarat, the two mile-long Machhu Dam-II disintegrated. The waters released from the dam's massive reservoir rushed through the heavily populated downstream area, devastating the industrial city of Morbi and its surrounding agricultural villages. As the torrent's thirty-foot-tall leading edge cut its way through the Machhu River valley, massive bridges gave way, factories crumbled, and thousands of houses collapsed. While no firm figure has ever been set on the disaster's final death count, estimates in the flood's wake ran as high as 25,000.Despite the enormous scale of the devastation, few people today have ever heard of this terrible event. The Guinness Book of World Records and a few obscure articles contain the scant publicly available information about it.No One Had a Tongue to Speak tells, for the first time, the suspenseful and multifaceted story of the Machhu dam disaster. Based on over 130 interviews and extensive archival research, the authors recount the disaster and its aftermath in vivid firsthand detail. The book progresses sequentially, beginning with a centuries-old folktale that foretells Morbi's destruction and ending with an examination of the flood's present-day legacy in the lives of its survivors. Whenever possible, the story of the flood and its aftermath is told through the voices and viewed through the eyes of the people who survived the devastation. Moreover, the book presents important findings culled from formerly classified government documents that reveal the long-hidden failures that culminated in one of the deadliest floods in history.The authors follow characters whose lives were interrupted and forever altered by the flood, provide vivid first-hand descriptions of the disaster and its aftermath, and shed light on the never-completed judicial investigation into the dam's collapse. With its suspenseful plot, compelling characters, and moving nonfiction narrative, No One Had a Tongue to Speak reads more like a novel than a nonfiction account, revealing the profound human tragedy behind the dry statistics and painting a vivid portrait of an India torn between its feudal past and its industrial future.WHAT PEOPLE ARE SAYING:\"What is it about dams that inspire fatal dreams of grandeur? Utpal Sandesara and Tom Wooten have done a great service by vividly reconstructing one of the greatest and least known dam disasters in historyalthough it is anything but unknown, of course, to the largely voiceless people who were its major victims. This is an absorbing story not just about bureaucratic ambition and folly, but about power and powerlessness.\" Adam Hochschild, author of To End All Wars, King Leopold's Ghost, and other books.\"Written with a sympathy as deep as its research, this is the story of a deadly environmental disaster that sprang from hubris and miscalculation. Like any sudden disaster, the floods that destroyed Morbi burst upon the everyday lives of people unaware of what was about to befall them. Sandesara and Wooten skillfully capture both the commonplace and the extraordinary, and in doing so reveal what sometimes seems to be the near universal failures that lay behind so many environmental disasters and the quite specific particulars of Indian history and development.\"  Richard White, professor of American History at Stanford University\"The anatomy of a perfect storm: not just a South Asian monsoon-driven tragedy killing thousands, but an overall portrait of social, political, historical, and moral corruption and dysfunction. Inspections are missed, planning is chaotic, and disempowered find themselves squarely in the path of an epic disaster.\" Clark Blaise, co-author (with Bharati Mukherjee) of Days and Nights in Calcutta and The Sorrow and the Terror: The Haunting Legacy of Air-India 182\"This memorable account of an epic flood is all the more impressive because its authors, one of them the son of a survivor, are so young. Their reporting is painstaking, their stories heartbreaking.\" Anne Fadiman, author of The Spirit Catches You and You Fall Down",
  "genres": [
    "Nonfiction",
    "History",
    "India"
  ],
  "author": "Utpal Sandesara",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/11294135-no-one-had-a-tongue-to-speak"
}