{
  "title": "Shadowed Hawk",
  "description": "Aidan MacGrigor has always known his place in life. He was raised to understand his duty to his brother and laird, to king and country - and the welfare of the clan comes first. Aidan's world is that of shadows and intrigue, of whispered secrets so powerful they can bring death if overheard; of truths so profound they can raise kings; of lies so treacherous they can topple empires. He is the Hawk, and in the midst of Longshanks's war against the Bruce, intrigue is Aidan's currency - and he is a wealthy man. His birds softly sing their songs of information, and Aidan uses them to strengthen Clan MacGrigor. Though his life is one of solitude, he has come to savor the freedom it affords him, even if it means sacrificing the joy of having a wife and family of his own. He is resigned to his lot in life . . . until fate sends a bruised and battered sparrow his way and his instinct to love and protect takes over . . .Kenna MacLean has known nothing but hatred and brutality at the hands of men. A pawn in her father's bid for power and control, she yearns for a life of her own choosing, and she gets her chance when her wedding train is ambushed by brigands. Running for her life with her maid and a babe in tow, she stumbles into one of Aidan's nests and embraces the opportunity to reinvent herself and start life anew. Life as one of Aidan's birds is more rewarding than she could have imagined, even if the handsome Hawk she has come to love can never be hers.But as the shadows grow darker and both English and Scottish men scour the countryside in search of a rumored connection to the English crown that could change the entire balance of two nations at war, Aidan and Kenna will have to outwit, outrun, and outplay not one but two enemies to protect their loved ones and their beloved Scotland. Despite doubt and fear, neither can deny the strengthening force drawing them together, but Fate, it seems, has Her own plans. As their enemies close in, Aidan willingly sacrifices everything so his little sparrow might survive. But Kenna is no longer a wounded bird with broken wings. She answers the challenge, but can she act quickly enough to save the life of the man she loves, and the future she is determined they will share, before its too late?",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Medieval"
  ],
  "author": "Kathryn Loch",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/22169572-shadowed-hawk"
}