{
  "title": "Firefight: Inside the Battle to Save the Pentagon on 9/11",
  "description": "Amid all the stories of tragedy and heroism on September 11, there is one tale that has yet to be told–the gripping account of ordinary men and women braving the inferno at the Pentagon to rescue friends and co-workers, save the nation’s military headquarters, and defend their country.Pentagon firefighters Alan Wallace and Mark Skipper had just learned the shocking news that planes had struck the World Trade Center when they saw something equally a twin-engine jetliner flying straight at them. It was American Airlines Flight 77, rushing toward its target. In his Pentagon office, Army major David King was planning a precautionary evacuation when the room suddenly erupted in flames. Arlington firefighters Derek Spector, Brian Roache, and Ron Christman, among the first responders at the scene, were stunned by the sight that met a huge flaming hole gouged into the Pentagon’s side, a lawn strewn with smoking debris, and thousands of people, some badly injured, stumbling away from what would become one of the most daunting fires in American history.For more than twenty-four hours, Arlington firefighters and other crews faced some of the most dangerous and unusual circumstances imaginable. The size and structure of the Pentagon itself presented unique challenges, compelling firefighters to devise ingenious tactics and make bold decisions–until they finally extinguished the fire that threatened to cripple America’s military infrastructure just when it was needed most.Granted unprecedented access to the major players in the valiant response efforts, Patrick Creed and Rick Newman take us step-by-step through the harrowing minutes, hours, and days following the crash of American Airlines Flight 77 into the Pentagon’s western façade. Providing fascinating personal stories of the firefighters and rescuers, a broader view of how the U.S. national security command structure was held intact, and a sixteen-page insert of dramatic photographs, Firefight is a unique testament to the fortitude and resilience of America.",
  "genres": [
    "History",
    "Nonfiction",
    "Terrorism",
    "American History"
  ],
  "author": "Patrick Creed",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/2215413.Firefight"
}