{
  "title": "Monday's Warriors",
  "description": "‘Between one luckless general and the next,’ writes Maurice Shadbolt, ‘there is a fleck of fable in history's eye called Kimball Bent . . .’What a fleck and what a fable! Frontier tales don't come much wilder and taller than Monday’s Warriors. What makes it the most extraordinary is that most of it happens to be true. This is the rich and reverberant story of Kimball Bent of Sodom Docks (State of Maine, USA) who blundered into the British Army in the middle of the nineteenth century and was borne away to battle with godly rebel Maori in distant New Zealand. At the wrong end of one too many court martials, the flogged and confused Yankee deserts across battle lines on to the wrong side - the Maori side - to serve his new friends faithfully as spy, armourer and marksman in possibly the most ferocious colonial war ever fought. Adopted as a grandson by the most robust and resourceful of warrior chiefs, the womanizing, one-eyed and terrible Titokowaru, Kimball finds himself fighting and mostly winning the American Revolution all over again in the misty rain forest and mountains of New Zealand’s North Island.With one chance leap into legend, Kimball Bent was to become the most unlikely rebel ever to brace the firepower of the British Empire, but Titokowaru and his wild-riding, fierce and feuding lieutenants, the workaday warriors Big, Demon and Toa, were no mean rivals in insurgency. With seldom more than a few dozen fighting men this fervent land-loving Maori foursome was to humble colonist armies and leave the Empire reeling in retreat.Yet for all its fireworks Monday’s Warriors is more than another war story, more that a mere historical novel. One of the world’s great storytellers, Maurice Shadbolt here gives us a tale rich in humanity, a tale both strange and absurd, comic and horrific, and always with lit with narrative gusto. As Conor Cruise O’Brien said of Season of the Jew, ‘Shadbolt writes admirably with a tautness and an astringent humour rare in the genre.’",
  "genres": [
    "Fiction",
    "Historical Fiction"
  ],
  "author": "Maurice Shadbolt",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/2215603.Monday_s_Warriors"
}