{
  "title": "The Heart of Whiteness: Confronting Race, Racism, and White Privilege",
  "description": "An honest look at racism in the United States, and the liberal platitudes that attempt to conceal it. This book offers an honest and rigorous exploration of what Jensen refers to as the depraved nature of whiteness in the United States. Mixing personal experience with data and theory, Jensen faces down the difficult realities of race, racism, and white privilege. He argues that any system that denies non-white people their full humanity also keeps white people from fully accessing their own. The Heart of Whiteness is both a cautionary tale for those who believe that they have transcended racism, and also an expression of the hope for genuine transcendence. \"Very few white writers have been able to point out the pathological nature of white privilege and supremacy with the eloquence of Robert Jensen. In The Heart of Whiteness , Jensen demonstrates not only immense wisdom on the issue of race, but does so in the kind of direct and accessible fashion that separates him from virtually any other academic scholar, or journalist, writing on these subjects today.\"— Tim Wise , author of Dear White America \"With radical honesty, hard facts, and an abundance of insight and compassion, Robert Jensen lays out strategies for recognizing and dismantling white privilege– and helping others to do the same. This text is more than just important; it's useful. Jensen demonstrates again that he is a leading voice in the American quest for justice.\"— Adam Mansbach , author of Angry Black White Boy and Go the F***to Sleep \"Jensen's spotlight on the gaps separating the American promise of liberty and justice from the reality is accessible, powerful and moving. In short, it is a terrific piece of anti-racist writing.\"— Eleanor Bader , The Brooklyn Rail",
  "genres": [
    "Nonfiction",
    "Race",
    "Social Justice",
    "History",
    "Sociology",
    "Anti Racist",
    "Education"
  ],
  "author": "Robert Jensen",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/221686.The_Heart_of_Whiteness"
}