{
  "title": "Sorry About That: A Story from a Soldier's Heart",
  "description": "“Sorry About That is a cautionary tale that must be read. The author insists that if we are not vigilant — if we do not defend our national political inheritance — a leadership, lacking transparency and exploiting our confusion, will do it for us.” ~Dr. Stephen J. Weiss, author, Second Chance, from his Introduction What would you do if you realized that our political and military leaders were engaged in actions that you believed were wrong? In June 1967, Dick Denne returned home from Vietnam as a highly decorated, exemplary U.S. combat paratrooper. Within a year, he found himself in a military prison, where he was denied due process and subjected to the worst abuse imaginable — all at the hands at U.S. soldiers. Denne’s crime? Speaking out against the U.S. presence in Vietnam and questioning the motives of our leaders — all while wearing his military uniform and in the service of his country. The irony? Dick Denne was never supposed to be in the infantry. All he ever wanted to be was a comedian. Instead, through a series of snafus that would make Hawkeye Pierce blush, he found himself assigned to the legendary 101st Airborne, the “No Slack” Battalion, where he repeatedly faced death and the horrors of combat during a then-unprecedented 270 consecutive days in the field. A good soldier, Denne earned many medals, including the Combat Infantryman Badge (one of the highest honors the U.S. Army can bestow on its own). But during his tour of duty, he developed a “soldier’s heart” and became increasingly disillusioned with the U.S. mission in Vietnam. At a time when protests against the war were mounting across America, Denne was branded a troublemaker by the Army and nearly paid the ultimate price for exercising his freedom of speech. A heart-wrenching story about Vietnam that is still timely today, Sorry About That combines the drama of combat, the unique camaraderie that Denne experienced with his fellow soldiers, and the internal conflict that he felt every day as a young teenager, forced to grow up fast while trying to do the right thing — for himself, and for his country.",
  "genres": [],
  "author": "Dick Denne",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/22157709-sorry-about-that"
}