{
  "title": "الصوت روح",
  "description": "في مجال المسرح و الشعر ، و فى المجال الأدبي عموما معروف .. ان هناك ادب بيتم تطويع المواضيع و الافكار له ..، و ادب بيتم تطويعه و استخدامه لعرض الافكار و المواضيع من خلالهفي المسرح مثلا عندنا تجارب لتوفيق الحكيم و لدكتور مصطفى محمود من مسرحيات هي فنيا قد تكون غير صالحة باعتراف اصحابها ذاتهم .. لكنها على مستوى عرض الموضوع و الفكرة ناجحة طبعا ..،كذلك فى الشعر .. هناك اشعار بيتم تطويع المواضيع و الأفكار لها .. و هناك اشعار بيتم تطويعها و استخدامها لعرض الافكار و المواضيع و الأحداث .. الشئ اللى بيجعل الجانب الفني فيها مجور عليه و ديوان (دول العرب و عظماء الإسلام) لأمير الشعراء أحمد شوقي مثلا هو واحد من هذه الأدبيات التى جار صاحبها على الجانب الفنى فيها ، لصالح المواضيع و الافكار التى طرحها من خلال اشعاره ، و ليس ذاك لمشكلة ما او نقص في حس الشاعر او موهبته و انما ذاك لثقل و تعقيد وكثافة التجربة التي مر بها الشاعر و التي أبت عليه شعريا كفكرة مجملة .. و هو احوج مايكون الى التعبير عنها مجملا مما دفع به الى ذلك الأسلوب لا ابتذالا او تهاونا و لكن رغبة منه في ان يهتف بها جملة واحدة بشكل مباشر و صريح للتنفيس و لمشاركة الناس بها .. و كذلك اعترف بأننى قد جرت على الجانب الفني في الجزء الأول من الكتاب (الأصوات) لصالح الموضوع و الحدث .. و لكنه ليس جور لايغتفر .. فـ (الأصوات) هي اشعار غنائية على أي حال أي أن مباشرتها مغفورة ! هي ايضا أشعار .. تسمع .. لا تقرأ .. تسمع مغناة :) .. و هو مادفعنى لوسمها بـ (أصوات) منذ البداية ، وعموما فـ (الصوت روح) هو كارت تعارف مابيني و بين القراء ليس الا و لا أعده تجربة جدية في الكتابة على أية حال ... هدى عويس *****الكاتبة مطربة موسيقى عربية في الأساس ... ، قررت ان تستقل و تغنى اغانيها الخاصة و ان تخرج من عباءة الغناء النمطى و الكلمات النمطية للغناء العربى عن الهيام و الهجران و اللوعة و ما الى ذلك ، و بعدما ارهقها البحث عن الكلمات المناسبة التى تستطيع من خلالها خدمة رسالتها و افكارها و كل ما هي مؤمنة به .. قررت أن (توفر أجرة شاعر) ! و ان تقدم بصوتها (بروحها) لكل ذلك ... لم لا ؟ و هي تملك الموهبة اللازمة للقيام بذلك فقد كان لها العديد من المحاولات الادبية في سنوات نشأتها الأولى ، انقطعت بعدها لفترة طويلة (جدا) عن الكتابة لأسباب قهرية .. الا انها الآن تحاول نفض الغبار عن موهبتها تلك و تجديدها مادامت الحاجة تدعو الى ذلك ، و لقد وفقت في تأليف اشعار الكتاب كلها في حوالى اسبوعين من اواخر ابريل و اول مايو 2014 عدا (يحيا الارهاب) و (ضلع اعوج) ...، هي ايضا تؤمن بأن (الصوت روح) و هذا ماعبرت عنه و حاولت ايصاله الى القارئ من خلال صفحات الكتاب  *****بداية استعانت الكاتبة برمزية (مأذنة المسجد) في صورة الغلاف للتعبير عن رسالتها الروحية و الفكرية ..الكتاب بيعرض لثنائية ضدية مابين الحسى و الروحى (الصوت و الروح) و بيطرحها من منظور جديد بيجعل منها تكاملية بشكل ما و دا من خلال مقدمة مبسطة في بداية الكتاب ، بعدها بتستخدم الكاتبة بعض الأشعار العامية و اللى دورها في المقام الأول بيحدد كـ (موديل) ان صح التعبير لتوضيح نظريتها او للتدليل عليها .. و ان كانت الأشعار دي قيمتها و دورها لايتعدوا (كونها موديل) لطرح فكرة الكاتبه .. الا انه بيشفعلها في النهاية انها كتبتهم باخلاص حقيقي لهذه القضايا (و الأصوات) اللى عرضت لهم من خلالها بعدها بتقدم الكاتبه لـ (صوتها) كأي كاتب آخر ! (فأي كاتب من وجهة نظرها بيعرض لصوته و لوجهة نظره الذاتية من خلال كتاباته و دراساته و اشعاره .. الخ مهما ادعى الموضوعية) .. من خلال خواطر روحانية عن الوجود و الكون و الدين مشوبه ببعض الرؤى الفلسفية .. .. بتتحدى من خلالها النظرة المادية لتك القضايا و اللى استفحلت في مجتمعاتنا خلال الفترة الأخيرة و في الختام بعض المحاولات الشعرية اللى كتب اغلبها في ربيع 2014 و اللى بتستمر الكاتبه من خلالها في عرض (صوتها) رؤاها الروحانيه و الفلسفيه و الحياتية ايضا و لكن بنظم شعرىالكاتبه اشارت في البداية لـ (معجم)بالكلمات العامية المصرية في الكتاب .. و بالنسبه لها كانت فكرة موفقة على المستوى الشخصى على الأقل لأنها بتعتقد في قدرة اللغات السامية على الاستمرار و العربية هنا بالأخص لكونها لغة القرآن الكريم .. فعلى المحور المكانى في الوقت الحاضر و على المحور الزمانى مستقبلا لمواجهة تطويع اللغة لمقتضيات عصرها و ما يستتبع دا من اختلاف اللهجات على المستوى المكانى في نفس العصر او على المستوى الزمانى على نفس المكان وجدت اهمية من المنطلق دا لوضع معجم لترجمة اللغة العاميه المصرية على اساس محور ثابت ألا و هو (اللغة العربيه الأم) ، اذن فاستخدامها للعامية لم يكن دعوة ، او مشاركة منها في دعوة الى استخدام العامية عوضا عن العربية الفصحى ، و انما تعاملا مع واقع  الا انها ما وفقتش في المراجعه اللغوية و فشلت في تحقيق هدفها دا بسبب من استعجالها على تقديم نفسها للقراء ككاتبه و لقلقها من وصول خبر الكتاب للسلطات قبل تسجيله و توثيقه بدار الكتب ، ما جعلها تغفل عن هذه النقطة المهمه ، نقطة  (مراجعة كتابها لغويا).. و ان كانت تستغرب من انتقد عدم مراجعة (الأشعار العامية) بالكتاب (لغويا) ! ، فان كان من المفهوم ضرورة مراجعة العربية الفصحى لغويا ، فمن غير المفهوم او حتى المقبول ادعاء (نموذج) معين للعامية او القول بأن لها قواعد لغوية و اصول ! ، و عن تلك الجزئية خصوصا علقت الكاتبة ، بأن من عاب عليها بمثل هذا القول خصوصا ، هو اما مدعي سفيه او جاهل لا ريب ! و عن استخدامها للغة العاميه من اساسه فقد ارجعته لمحاولة منها لاجتذاب فئة معينه من الشباب يهمها ان تصل رسالتها اليهم لأنها الفئة الأكثر استهدافا من قبل المنظمات العلمانية و اصحاب المذاهب المادية ..و هي فئة يجتذبها هذا اللون من الأدب العامى على حد علمها سواء مقالة او اشعار .ايضا عن تأثرها بأسلوب الأستاذ و الدكتور (مصطفى محمود) رحمه الله فهي لم تنكره .. بل على العكس فقد اعتبرت هذا التأثر الواضح بالأسلوب المنهجى و الأدبى لـ (أستاذها)على حد وصفها مدعاة لفخرها  *****إفتتاحية الكتاب :مأذنة المسجد .. كانت أهم وسيلة اعلام في مجتمعنا الاسلامي على مر العصور .. لذا حينما قررت أن أخرج الى النور أول كتبي (الصوت روح) و الذي عبرت فيه عن جزء مهم من رسالتي .. تلك الكلمة التي خلقت من أجلها .. أو خلقت لأكونها .. لم أجد أفضل من مأذنة المسجد .. كوسيلة اعلام أدشن من عليها .. و أنادي بـ .. رسالتي تلك .. و كان لي الشرف أن اعتلي في سبيل ذلك مأذنة الأزهر الشريف .. و التي تعد من أهم منابرنا على الاطلاق ، و قد يسر الله لي الأمر بعد دعاء و تسليم .. و ها أنا ذا .. و ها هو كتابي اليوم بين يديكم فـ .. بسم الله",
  "genres": [
    "Poetry",
    "Inspirational",
    "Literature",
    "Islam",
    "Spirituality",
    "Philosophy",
    "Music"
  ],
  "author": "Huda Aweys",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/22174792"
}