{
  "title": "Dreamers and Deceivers: True Stories of the Heroes and Villains Who Made America",
  "description": "The new nonfiction from #1 bestselling author and popular radio and television host Glenn Beck.THEIR NAMES ARE FAMILIAR.THEIR STORIES ARE NOT.Everyone has heard of a \"Ponzi scheme,\" but do you know what Charles Ponzi actually did to make his name synonymous with fraud? Credit for inventing radio usually goes to Marconi or David Sarnoff and RCA--but if you've never heard of Edwin Armstrong or Lee de Forest, you know only half the story.You've probably been to a Disney theme park, but did you know that the park Walt believed would change the world was actually EPCOT? He died before his vision for it could ever be realized. History is about so much more than dates and dead guys; it's the greatest story ever told. Now, in this powerful follow-up to his national bestseller Miracles and Massacres , Glenn Beck brings ten more true and untold stories to life.The people who made America were not always what they seemed. There were entrepreneurs and visionaries whose selflessness propelled us forward, but there were also charlatans and fraudsters whose selfishness nearly derailed us. Dreamers and Deceivers brings both of these groups to life with stories written to put you right in the middle of the action. You know that Woodrow Wilson was a progressive who dramatically changed America, but did you know that he was also involved in one of the most shocking national deceptions of all time? You know I Love Lucy , but the true story of Desi Arnaz and Lucille Ball is much better than anything they produced for television. You've heard of Upton Sinclair, the socialist author who gained famed with The Jungle , but it was a book he wrote two decades later that proved the depths he was willing to go to maintain his reputation.From the spy Alger Hiss, to the visionary Steve Jobs, to the code-breaker Alan Turing--once you know the full stories behind the half-truths you've been force fed...once you meet the unsung heroes and obscured villains edited from our schoolbooks...once you begin to see these amazing people from our past as people rather than just names--your perspective on today's important issues may forever change. Find out why this series has become America's new go-to history book.",
  "genres": [
    "History",
    "Nonfiction",
    "Historical",
    "Biography",
    "Politics",
    "American History",
    "Audiobook"
  ],
  "author": "Glenn Beck",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/22176263-dreamers-and-deceivers"
}