{
  "title": "Delbert Judd",
  "description": "...the tale is lighthearted and funny thanks to the humor of oddball Delbert, but it also explores some substantial issues, which gives it poignancy and weight. A well-written novel that is an interesting exploration of mental illness from the perspective of a sufferer's partner. -- Kirkus Reviews A quirky, amusing debut novel about mental illness, religious corruption and the things people do to cope. At the center of Hammond's novel is Delbert Judd, a charming, if odd, sports enthusiast, who has isolated himself from most of humanity. The cause of his isolation—and center of his world—is Hannah, his beloved wife who suffers from borderline personality disorder. Delbert has become a hermit in his own neighborhood—a result of his attempts to avoid provoking a reaction from his wife and exacerbating her condition. As the novel begins, however, Hannah has left for a lengthy business trip in Florida, and Delbert finally has time and space to himself—save for the nightly 8 p.m. phone calls with his wife. With the freedom to do as he pleases, Delbert unwittingly becomes involved in his neighborhood association's fight over allowing a new Christian fraternity to move into the neighborhood. He begins to adjust to spending time around people again, slowly becoming passionate about the issue at hand and making friends with his neighbors along the way. Despite these new distractions, there is still one thing that always weighs on his mind—his nightly phone calls with Hannah.The narrative is an intriguing exploration of mental illness, particularly borderline personality disorder, and how it affects its sufferers and the people who surround them. The book also considers religious freedom and the abuse of religious freedom. Overall, the tale is lighthearted and funny thanks to the humor of oddball Delbert, but it also explores some substantial issues, which gives it poignancy and weight.A well-written novel that is an interesting exploration of mental illness from the perspective of a sufferer's partner. -- Kirkus Reviews",
  "genres": [],
  "author": "Dan Hammond Jr.",
  "average_rating": "4.89",
  "url": "https://www.goodreads.com/book/show/22171202-delbert-judd"
}