{
  "title": "Yarashell Abbily and Her Very Messy Room",
  "description": "The book is about a delightful little girl who wakes up joyfully each day. She sets about getting herself dressed and ready for the day. In the process, she pulls most everything out of her dresser drawers and closet, tossing them this way and that. They all land in unique configurations about the room, creating a fantastic wonderland in her imagination. Through it all, she discusses her creations with her best friend…her doll, who encourages her handi-work to be even better. As you might imagine, when Mommy appears upon the scene, all she sees is a mess! A battle of wills ensues. Finally, in frustration Daddy arrives with a brilliant idea. To end the confrontation, he suggests a game…Yarashell’s favorite. The thought of winning is exactly what is needed to turn her attention to the task at hand…cleaning up her room. Enjoy meeting Yarashell and experiencing her delightful imagination as she gets herself ready to begin her day. This book will give you a glimpse of how a child sees things very differently from adults. Yarashell is sure to remind you of all the messy little ones in your life. With its sing-song verse, this book is a great family read. The accompanying song can be heard for free at sybrina.com. -------------------------------------------Who doesn’t know a messy little three year old? Getting them to clean their rooms can be quite an ordeal at times. Yarashell Abbily is one of those little girls, whose room looks like quite a mess to her Mommy and Daddy. But to Yarashell it doesn’t look messy...in her imagination it is a wonderland. But rooms do have to be cleaned. Luckily Daddy, knows just how to get Yarashell in the mood for cleaning. Read this book with your child today. With it’s sing-song verse, it is a fun family read.Here’s a little back story for the book—Sybrina has seven grand children. Four of them are sweet little girls. This story was inspired when she asked one of them, who was three years old at the time, \"What is your very favorite thing in the world to do?\" She looked up smiling and said with great enthusiasm, \"I like to mess up my room!\". That immediately inspired a song (which is available with that name on Amazon and Itunes). A couple of years later, this book, \"Yarashell Abbily and Her Very Messy Room\" came along. Yarashell Abbily is a composite name for those 4 little girls - Yara, Michelle, Abbey and Emily. Enjoy!",
  "genres": [],
  "author": "Sybrina Durant",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/22174858-yarashell-abbily-and-her-very-messy-room"
}