{
  "title": "Sisters of the Revolution: A Feminist Speculative Fiction Anthology",
  "description": "Sisters of the Revolution gathers a highly curated selection of feminist speculative fiction (science fiction, fantasy, horror and more) chosen by one of the most respected editorial teams in speculative literature today, the award-winning Ann and Jeff VanderMeer. Including stories from the 1970s to the present day, the collection seeks to expand the conversation about feminism while engaging the reader in a wealth of imaginative ideas. Sisters of the Revolution seeks to expand the ideas of both contemporary fiction and feminism to new fronts.Contents:The forbidden words of Margaret A. / L. Timmel Duchamp --My flannel knickers / Leonora Carrington --The mothers of Shark Island / Kit Reed --The palm tree bandit / Nnedi Okorafor --The grammarian's five daughters / Eleanor Arnason --And Salome danced / Kelley Eskridge --The perfect married woman / Angélica Gorodischer --The glass bottle trick / Nalo Hopkinson --Their mother's tears : the fourth letter / Leena Krohn --The screwfly solution / James Tiptree, Jr. --Seven losses of na Re / Rose Lemberg --The evening and the morning and the night / Octavia E. Butler --The sleep of plants / Anne Richter --The men who live in trees / Kelly Barnhill --Tales from the breast / Hiromi Goto --The Fall River axe murders / Angela Carter --Love and sex among the invertebrates / Pat Murphy --When it changed / Joanna Russ --The woman who thought she was a planet / Vandana Singh --Gestella / Susan Palwick --Boys / Carol Emshwiller --Stable strategies for middle management / Eileen Gunn --Northern chess / Tanith Lee --Aunts / Karin Tidbeck --Sur / Ursula K. Le Guin --Fears / Pamela Sargent --Detours on the way to nothing / Rachel Swirsky --Thirteen ways of looking at space/time / Catherynne M. Valente --Home by the sea / Elisabeth Vonaburg.",
  "genres": [
    "Short Stories",
    "Science Fiction",
    "Fiction",
    "Feminism",
    "Fantasy",
    "Speculative Fiction",
    "Anthologies"
  ],
  "author": "Ann VanderMeer",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/22181319-sisters-of-the-revolution"
}