{
  "title": "The South Beach Diet Supercharged: Faster Weight Loss and Better Health for Life",
  "description": "Five years ago, with the publication of The South Beach Diet, renowned Miami cardiologist Dr. Arthur Agatston set out to change the way America eats. Now he has an even more ambitious to change the way America lives by helping Americans become fitter as well as thinner and healthier . . . for life. In the all-new The South Beach Diet Supercharged, Dr. Agatston shows you how to rev up your metabolism and lose weight faster while following the proven healthy eating principles of the original choose good carbs, good fats, lean protein, and low-fat dairy. Collaborating with Dr. Joseph Signorile, a professor of exercise physiology at the University of Miami, Dr. Agatston presents a cutting-edge, three-phase workout that perfectly complements the three phases of the diet itself. Based on the latest exercise science, this ease-into-it fitness program combines low- and high-intensity interval exercise (with a focus on walking) and functional core body-toning exercises. The You'll look fitter and you'll burn more fat and calories all day—even at rest. Also included is the latest nutritional research on how specific foods high in vitamins, minerals, fiber, and a host of phytonutrients help keep you healthy; new and expanded lists of Foods to Enjoy; taste-tempting Meal Plans for phases 1 and 2; and dozens of easy-to-prepare new recipes, including Eggs Frijoles, Chock-Full-of-Veggies Chili, Roasted Tomato Soup, Homestyle Turkey Meatloaf, and South Beach Diet Tiramisu. In every chapter you'll find inspiring success stories from real-life South Beach dieters and plenty of effective weight loss tips. And as an added bonus, Dr. Agatston answers the questions you've most often asked him about the diet since the original book was published.",
  "genres": [
    "Nonfiction",
    "Health",
    "Cookbooks",
    "Cooking",
    "Food",
    "Diets",
    "Fitness"
  ],
  "author": "Arthur Agatston",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/2218656.The_South_Beach_Diet_Supercharged"
}