{
  "title": "Body and Soul: The Black Panther Party and the Fight Against Medical Discrimination",
  "description": "Between its founding in 1966 and its formal end in 1980, the Black Panther Party blazed a distinctive trail in American political culture. The Black Panthers are most often remembered for their revolutionary rhetoric and militant action. Here Alondra Nelson deftly recovers an indispensable but lesser-known aspect of the organization’s broader struggle for social justice: health care. The Black Panther Party’s health activism—its network of free health clinics, its campaign to raise awareness about genetic disease, and its challenges to medical discrimination—was an expression of its founding political philosophy and also a recognition that poor blacks were both underserved by mainstream medicine and overexposed to its harms.Drawing on extensive historical research as well as interviews with former members of the Black Panther Party, Nelson argues that the Party’s focus on health care was both practical and ideological. Building on a long tradition of medical self-sufficiency among African Americans, the Panthers’ People’s Free Medical Clinics administered basic preventive care, tested for lead poisoning and hypertension, and helped with housing, employment, and social services. In 1971, the party launched a campaign to address sickle-cell anemia. In addition to establishing screening programs and educational outreach efforts, it exposed the racial biases of the medical system that had largely ignored sickle-cell anemia, a disease that predominantly affected people of African descent.The Black Panther Party’s understanding of health as a basic human right and its engagement with the social implications of genetics anticipated current debates about the politics of health and race. That legacy—and that struggle—continues today in the commitment of health activists and the fight for universal health care.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Medicine",
    "Health",
    "Politics",
    "Anti Racist"
  ],
  "author": "Alondra Nelson",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/11296327-body-and-soul"
}