{
  "title": "A Double-Edged Sword",
  "description": "Tales from The    The Edge is a training company with a difference. Its weekend clients come for classes in bondage and domination, not team building and problem solving.  The management, staff and customers of The Edge do not lead boring lives. In fact they have a habit of getting themselves into all kinds of trouble. Put Dominant, possessive alpha males together with bratty, loveable submissives and sparks are bound to fly. These Tales from The Edge are their stories.    A Double-Edged Sword by L.M. Somerton    Book Four in the Tales from The Edge series   How do you stay standing when the ground is torn from beneath your feet?   Becket and Christian are taking the first, tentative steps towards the committed D/s relationship they both crave when the world literally explodes around them. In a frightening reversal of roles, Becket has to deal with his own vulnerability and Christian must find the strength to take care of his Dom. With the help of their friends at The Edge, the two men come to realise that dominance and submission cannot be switched on and off.  Events that could have ended in tragedy provide the catalyst that affirms their trust in each other, but there are still questions to answer. Is the safe path always the right one to take? Is control simply a state of mind? One thing’s for certain, life’s too short for compromise.  L.M. Somerton  About the   Lucinda lives in a small village in the English countryside, surrounded by rolling hills, cows and sheep. She started writing to fill time between jobs and is now firmly and unashamedly addicted.  She loves the English weather, especially the rain, and adores a thunderstorm. She loves good food, warm company and a crackling fire. She's fascinated by the psychology of relationships, especially between men, and her stories contain some subtle (and not so subtle) leanings towards BDSM.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Romance",
    "Erotica",
    "Suspense",
    "Gay",
    "Contemporary"
  ],
  "author": "L.M. Somerton",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/22194844-a-double-edged-sword"
}