{
  "title": "For Her Honor",
  "description": "There are three things Gabriel ‘Taz’ Morrell loves: his club, his ma and women – and exactly in that order. Freedom to spend his days and nights doing what needs to be done for the Mountain Skulls MC plays a big part in why the thirty six year old biker remains single – much to the displeasure of his former rock groupie mother. Black hair, pierced face and inked body, he’s the go-to guy when extreme measures need to be taken to extract information – proclivities which more than earned his childhood nickname, The Tasmanian Devil. His bond with his brothers, the call of the club and the admiration for the woman who bore and raised him are pretty much all he needs.Enter Karen Hanson.A personal crisis cost her everything – from her Cincinnati high-rise, to her managerial position. Though innocent, her association with a man she trusted brought shame to the upper-crust life her family encircles. Counseled to ‘lay low and start over somewhere’ she packs up what’s left of her life and heads east on Interstate 70 – right into West Virginia and up to the small town of Tippitt. More her father’s strong, independent daughter than the puppet her sister is to their manipulative mother, Karen secures employment, a roof over her head and a steady assortment of interesting town acquaintances.Including one Taz Morrell.The devilish looking outlaw can’t resist a pretty face, and Karen’s sudden presence in his town raises his curiosity – and piques his interest. Though content being free to love whatever woman strikes his fancy, he finds himself gravitating towards the green eyed beauty – a move which breaks his personal rules for living. But the saying is true – that all it takes is the right woman to throw a man off his course and Karen sends Taz over the edge. Playful banter soon becomes physical desire which spin their respective worlds. Karen never came to town looking for a relationship and Taz has fought tooth and nail to avoid his mother’s quest to get him settled. Neither can seem to avoid the other, though his lifestyle is a stark contrast to hers while her appearance in Tippitt poses a dozen questions.And when answers are finally given, a common thread between what Karen’s trying to put behind her and a series of crimes assailing the town of Tippitt puts Taz in the middle. The man who loves the company of many women now finds himself championing one.\nContains explicit sex, violence and language.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Motorcycle",
    "Erotica",
    "Contemporary",
    "Suspense",
    "Menage"
  ],
  "author": "Elayne DiSano",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/22211556-for-her-honor"
}