{
  "title": "Song of the Heart: Walking the Path of Light",
  "description": "In a world of overwhelming chaos and uncertainty, it is not surprising that the global consciousness has been negatively impacted. Healer and visionary Francine Vale, author of SONG OF THE HEART: Walking the Path of Light, has the prescription for what ails our collective psyche in the form of a compelling memoir that illuminates the path to a higher level of consciousness & self-healing. SONG OF THE HEART illuminates what so many of us would otherwise remain blind to: the presence of Guardian Spirits just waiting to assist us, the Oneness of humanity, and the true structure of what Francine Vale calls “All That Is.” Vale reveals that the title, SONG OF THE HEART, came to her in a vision and the book was dictated to her by Starlight, her lifelong Guardian Spirit and muse from a dimension beyond Earth. The purpose of this celestial dictation was to allow Vale to “bring greater awareness of the absolute necessity for love and the power of love to shift the energy at every turn of our lives.” SONG OF THE HEART is a uniquely structured volume. The first part is an engrossing fictionalization of the author’s family history, where a tragic tale is told by a special being whose calling is to help us see that we each have a soul, what that soul is, and how all of our souls are connected. In the second part, fiction meets reality as the psychic scars inflicted in the first part manifest themselves in the lives of the actual Vale family. The family actions and interactions in this epic tale will move you deeply while affording you insights into your own relationships. The intention is to help each reader “tap into the Unity Consciousness and be able to create closeness with your guardian angel and spirit guides.” Best of all, Vale teaches us the primary aspects of healing, accessible to all humanity, and at the same time shows why she knows “there is no death, only transformation of energy.”",
  "genres": [],
  "author": "Francine Vale",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/22209585-song-of-the-heart"
}