{
  "title": "The Passion of Marie Romanov",
  "description": "\"July 17, 1918—from the writings of Marie Nicolaevna Romanovna, age 19. Midnight, in bed with her sister, Anastasia (Shvybz), in the Ipatiev Mansion in Ekaterinburg, during the last night of their lives.  So much of my story unfolds by moonlight. This is a tale of midnight wakings and forced marches before dawn. Since this nightmare began, I do not dare undress, even to go to bed. I wear my dressing gown, my hair is prepared, and my shoes are set beside me. I have no idea when we will be summoned to rise. We have moved, as in the worst of dreams, slowly toward this place. There is no logic other than the sleepwalker’s obedience—to follow instruction which we cannot resist: an actual lunacy.  Now, I have control only of this—my record of what happened to us, to me. I have committed a single sin, my one terrible transgression. I pray to be absolved.  In this recording of memory lies all meaning to my life. Let my will prevail in this, my ultimate wish, to salvage something of value from this tragedy. The rest, as my mother says, is in God’s hands.  When I look back, as I must in the short time allotted to me now, I can see the exact moment when our lives changed: at last light, on the thirteenth of March, 1917.\"  Here, in startling new historical detail, based on original diaries and letters, is the Romanov tragedy told from the point of view of the Tsar's third daughter, Marie, Anastasia's closest, older sister. Marie's story is unique-only Marie crossed the frozen Siberian river with her parents, and only Marie shared the full 78 days and nights in 'The House of Special Purpose.'   About the Author:  Laura Rose is a popular playwright in Russia and is of Russian descent. She has extensively researched the history and explored the Alexander Palace and the site of the Ipatiev mansion.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Russia",
    "Romanovs",
    "Fiction",
    "20th Century",
    "Audiobook"
  ],
  "author": "Laura  Rose",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/22208886-the-passion-of-marie-romanov"
}