{
  "title": "True Stories of Afterlife Communication. Messages from our loved ones; True Stories from Heaven. Proof of the Afterlife.",
  "description": "True Stories of Afterlife Communication. Messages from our loved ones; True Stories from Heaven. Proof of the Afterlife. 'A familiar sounding voice spoke. “Look love, I’m alright. It’s great over here. I’m with your grandmother and all the other nice people who passed....” “Honey, I'm talking to all our relatives I haven’t seen in years but they are all here in the room with us now. They're here to see me now...” \"Christopher had always told me that he would never leave me. He is keeping his promise! Here is my proof that there is life after death and that Heaven does exist...” “I sincerely believe that I have communicated with the spirits of my parents, sister, brother, and nearest friends...” From ordinary, everyday people, come true stories of their visits from those in Heaven... Backed up by the accounts of respected Scientists and Doctors, and even noted Public figures... “As fantastic as it sounds, the new physics called Quantum mechanics, posits that there exists, side by side with this world, another world...I and all those who live, have lived, and will ever have lived, are alive!” “Yes it’s true; there is life after death – and although my theoretical observations have caused some consternation among the scientific establishment, they prove beyond doubt that I can provide evidence of an after-life.”  Just as Near Death Experiences offer proof of life after death , so too can after life communication.. True Stories from Heaven. True Stories of Afterlife Communication. Messages from our loved ones; Proof of the Afterlife. (following on from Tessy Rawlins' other books - 'Near Death Experiences; True stories of Near Death Experiences told by real people. True stories of those who went to Heaven. (3) True Stories of Near Death Experiences and Afterlife Communication. Evidence of Life After Death, Proof of the Afterlife. (2) Heaven is Real, Heaven Exists; Proof of Life-after Death; Real stories of Near-death experiences. (1)",
  "genres": [],
  "author": "Tessy Rawlins",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/22210932-true-stories-of-afterlife-communication-messages-from-our-loved-ones-t"
}