{
  "title": "The Edge of Extinction: Travels with Enduring People in Vanishing Lands",
  "description": "In The Edge of Extinction , Jules Pretty explores life and change in a dozen environments and cultures across the world, taking us on a series of remarkable journeys through deserts, coasts, mountains, steppes, snowscapes, marshes, and farms to show that there are many different ways to live in cooperation with nature. From these accounts of people living close to the land and close to the edge emerge a larger story about sustainability and the future of the planet. Pretty addresses not only current threats to natural and cultural diversity but also the unsustainability of modern lifestyles typical of industrialized countries. In a very real sense, Pretty discovers, what we manage to preserve now may well save us later. Jules Pretty’s travels take him among the Māori people along the coasts of the Pacific, into the mountains of China, and across petroglyph-rich deserts of Australia. He treks with nomads over the continent-wide steppes of Tuva in southern Siberia, walks and boats in the wildlife-rich inland swamps of southern Africa, and experiences the Arctic with ice fishermen in Finland. He explores the coasts and inland marshes of eastern England and Northern Ireland and accompanies Innu people across the taiga’s snowy forests and the lakes of the Labrador interior. Pretty concludes his global journey immersed in the discrete cultures and landscapes embedded within the American landscape: the small farms of the Amish, the swamps of the Cajuns in the deep South, and the deserts of California. The diverse people Pretty meets in The Edge of Extinction display deep pride in their relationships with the land and are only willing to join with the modern world on their own terms. By the examples they set, they offer valuable lessons for anyone seeking to find harmony in a world cracking under the pressures of apparently insatiable consumption patterns of the affluent.",
  "genres": [
    "Nonfiction",
    "Travel",
    "Nature"
  ],
  "author": "Jules Pretty",
  "average_rating": "3.14",
  "url": "https://www.goodreads.com/book/show/22210638-the-edge-of-extinction"
}