{
  "title": "Resilience: Two Sisters and a Story of Mental Illness",
  "description": "At a young age, Jessie Close struggled with symptoms that would transform into severe bipolar disorder in her early twenties, but she was not properly diagnosed until the age of fifty. Jessie and her three siblings, including actress Glenn Close, spent many years in the Moral Re-Armament cult. Jessie passed her childhood in New York, Switzerland, Connecticut, Zaire (now the Democratic Republic of Congo), and finally Los Angeles, where her life quickly became unmanageable. She was just fifteen years old.Jessie's emerging mental illness led her into a life of addictions, five failed marriages, and to the brink of suicide. She fought to raise her children despite her ever worsening mental conditions and under the strain of damaged romantic relationships. Her sister Glenn and certain members of their family tried to be supportive throughout the ups and downs, and Glenn's vignettes in Resilience provide an alternate perspective on Jessie's life as it began to spiral out of control. Jessie was devastated to discover that mental illness was passed on to her son Calen, but getting him help at long last helped Jessie to heal as well. Eleven years later, Jessie is a productive member of society and a supportive daughter, mother, sister, and grandmother.In Resilience , Jessie dives into the dark and dangerous shadows of mental illness without shying away from its horror and turmoil. With New York Times bestselling author and Pulitzer Prize finalist Pete Earley, she tells of finally discovering the treatment she needs and, with the encouragement of her sister and others, the emotional fortitude to bring herself back from the edge.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Mental Health",
    "Mental Illness",
    "Biography",
    "Psychology",
    "Audiobook"
  ],
  "author": "Jessie Close",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/22217698-resilience"
}