{
  "title": "The Backslider",
  "description": "The setting is Belfast in the 1970s. In a city in which any storefront might unexpectedly explode, Marius Moonston, age 16, is out shopping. It's Saturday, and the streets are filled with danger and excitement--especially for Marius, whose pocket is burning with the money he has pilfered from his sister.Marius has a mission (he knows just he wants to spend that money on), and a conscience steeped in the dichotomies of the Evangelical church. Ricocheting through the story is the nature of deceit and truth, commerce, disobedience and sin. The consequences of a petty crime are enormous--cathartic and destructive and defining.McGrady uses language of a distinctly Irish elasticity, and the explosive hilarity of a teenage boy propels the novel to crystalline moments of observation, and shattering self-knowledge.\"Clever and honest, playful but disturbing--The Backslider is a demanding and hugely enjoyable novel.\" —Roddy Doyle\"Seàn McGrady has brought loquacious delight to the loss of innocence. Every sentence in The Backslider savors “the peculiar and sometimes painful world of decisions,” as that world orbits through the tumultuous spirit of the 16-year-old Marius. The boy has a stolen bill in his pocket and he’s on the verge of more serious trouble, perhaps even murder, and meanwhile the peregrinations of the kid’s meditations pop and maunder wondrously, often hilariously. Now he’s swept up in some anarchic urge, and now he’s carried away by the no-account types on a city corner. A troubled corner, that would be, in a dangerous city. Yes, now for McGrady’s greatest trick: he does it in early-‘70s Belfast, church-riven and bullet-riddled. It’s as if Flann O’Brien took his blarney to Stalingrad — and there held the armies spellbound.\" —John Domini, author of Earthquake I.D. and A Tomb on the Periphery\"With echoes of the distinctive humour and philosophical meditations inherited from a rich Irish literary legacy, The Backslider is an accomplished and deeply affecting novel, McGrady's observations on the nature of adolescence are powerful and provocative.\" —Ian Holding, author of Unfeeling: A Novel and Of Beasts and Beings\"I read The Backslider in one fell swoop, with increasing admiration and delight. An absolute stunning coming of age novel, set in The Troubles and you can literally smell the cordite and the litany of The Evangelical Church. Beautifully wrought with a skill that seems to be more in line with an assured half dozen books under your belt. Moving and drenched in the appalling consequences of an apparently petty act. Catcher in the Northern Province, with a compassion that echoes long after the book is read, and an assurance that here is a novel to return to over and wonderfully over.\" —Ken Bruen, author of The Guards and The White TrilogySean McGrady was raised in Belfast, immersed in the religious and political ideas that defined the Irish Troubles. A former university lecturer in philosophy, he lives in York, England.",
  "genres": [],
  "author": "Sean McGrady",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/11297234-the-backslider"
}