{
  "title": "Surrounded by Idiots: Fighting Liberal Lunacy in America",
  "description": "In Surrounded by Idiots, Mike Gallagher,one of the top radio talk show hosts in America, takes us to the front lines of the unprecedented cultural and political war confronting all decent AmericansThe 2004 election was a watershed moment in our nation's history, and while it was shocking to the left to see so many red states on the electoral map, to conservatives it was just an affirmation of what they'd known all along -- conservatives are the mainstream and liberals are the fringe.It is not the time to rest or take things for granted, Mike Gallagher argues. Not at all. \"Maintaining America's role as the greatest nation in the world means we must stay the course,\" he writes, adding, \"Liberal idiocy surrounds us all. It threatens to destroy the values and lifestyles that millions of us cherish.\"The left has targeted every value and standard, principle and idea, concept of God, family, honor, duty, country, and decency that we hold dear. As the nation battles for its very soul in this post-9/11 world, we have Mike Gallagher to help fight against the agenda-driven liberal lunatics.The liberal loons are everywhere and Gallagher takes them all on: disgraced President Bill Clinton, and -- perish the thought! -- possible future president and carpetbagger Hillary Clinton; the People for the Ethical Treatment of Animals (PETA), an organization that values the lives of bugs over humans; and the anti-Bush propagandist filmmaker, Michael Moore.Then there's Gallagher's confrontation with the unpredictable, angry, and bitter bestselling author, liberal pundit, and comedian Al Franken -- the story of his anti-Dixie Chicks concert in protest of their un-American comments -- and race-baiters like Al Sharpton and big-mouth out-of-touch Hollywood elitists like Tim Robbins, Susan Sarandon, and Whoopi Goldberg.Surrounded by Idiots is an important -- not to mention entertaining -- look at where America is today and the possibility that the future of America will only get brighter.",
  "genres": [],
  "author": "Mike Gallagher",
  "average_rating": "3.11",
  "url": "https://www.goodreads.com/book/show/1129680.Surrounded_by_Idiots"
}