{
  "title": "Quarry of the Horned God",
  "description": "Warning: Not suitable for anyone below 18 years of age.In Hunted by Herne, The Horned God won for himself and his wild hunt, access to mortal earth for one evening. The time when the will gates open is fast approaching and the guardians launch a desperate plan to hold him at bay. Ryannon, their champion, must pit herself against the powerful and hotly feral Horned God to keep humanity safe from his twisted desires. But to beat him at his own game, she must play by his rules, on his world without falling for his seductive wiles. She accepts the challenge but the woodland holds more dangers than just a hungry God of the Hunt. Herne is determined that the beautiful and clever water sprite half breed won't escape him. When he captures her, she'll understand why he won't accept defiance and the price any who defy him will pay. For lovers of alpha males, hot sidhe, fae or faerie mythology, legend and folklore. This is an adult fairy tale erotic romance with a twist. If you love supernatural erotica or paranormal romance, this is a story worth reading.Excerpt:\"Salve will not fix this I fear\" he continued. Ryannon was shaking convulsively, nearly catatonic.He bought her wound up and pressed it to his lips, coating them in crimson. Cernunnos savagely bit his own lip, letting blood well and then flow, mixing with hers until it stained his roughly stubbled chin. He reached a slow and careful hand around the back of her neck bringing her closer and looked in her face questioningly before his head dipped and his mouth brushed her own.When she didn't respond, he kissed her properly, tongue tracing the unresponding seam of her mouth until she gasped, parting her lips. As soon as she opened for him, he lunged in, hot tongue touching her own with strong and sure caresses.The moment his blood touched her lips, her body jack knifed in response to the piercing lance of power that swept through her. It was a vivid green and washed through her thoroughly. A surge of well-being followed the course of the pervading enchantment and she moaned in pleasure, reveling as the force of it stripped fear, shame and horror from her, leaving a sense of contentment in its wake.She came back to herself, in increments to find that she was wrapped in his arms, her fingers tangled in his golden hair as their mouth dueled and fought for dominance. Incredibly, her lust rose at his touch.She pressed her nude body nearer to his clothed form, forcing herself closer to his warmth, using his heat to drown out any lingering cold of the green man.His mouth worked over hers, strong jaw and chiseled face warm and open but his eyes watched her carefully even as he kissed her skillfully. His bearded stubble rasped on her face as he worked her mouth.She drew back in confusion.\"Enough?\" he asked enquiringly.A fresh novel/novella from the newest monster erotica style Author.",
  "genres": [
    "Fae"
  ],
  "author": "Stella Inox",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/22231699-quarry-of-the-horned-god"
}