{
  "title": "Tofino and Clayoquot Sound: A History",
  "description": "Clayoquot Sound, on the West Coast of Vancouver Island is not only a place of extraordinary raw beauty, but also a region with a rich heritage and fascinating past.\"Tofino and Clayoquot Sound\" delves into all facets of the region's history, bringing to life the chronicle that started with the dramatic upheavals of geological formation and continues to the present day. The book tours through the history of the Hesquiaht, Ahousaht and Tla-o-qui-aht as well as other nations that inhabited the area in earlier times. It documents the arrival of Spanish, British and American traders on the coast and their avid greed for sea otter pelts. It follows the development of the huge fur seal industry and its profound impact on the coast. It tracks the establishment of reserve lands and two residential schools. The coming of World War II is discussed, as is the installation of a large Air Force base near Tofino, which changed the town and area dramatically. From here the story spirals into the post-road period. With gravel and asphalt came tourism, newcomers, the counter-culture of the 1960s, the establishment of Pacific Rim National Park and, of course, surfing. The book also addresses logging--which became the main industry in the area--and its questionable practices, going into detail about the \"War in the Woods\"--the world-famous conflict and largest mass arrest in Canadian history.A place is shaped by its people, and Horsfield and Kennedy highlight notable figures of past and present: the merchants, the missionaries, the sealers and the settlers; the eternally optimistic prospectors; the Japanese fishermen and their families; the hippies; the storm- and whale-watchers; the First Nations elders and leaders.Offering an overall survey of the history of the area, \"Tofino and Clayoquot Sound\" is extensively researched and illustrated with historic photos and maps; it evokes the spirit and culture of the area and illuminates how the past has shaped the present.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Margaret Horsfield",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22222273-tofino-and-clayoquot-sound"
}