{
  "title": "Bush War Operator: Memoirs of the Rhodesian Light Infantry, Selous Scouts and beyond",
  "description": "From the searing heat of the Zambezi Valley to the freezing cold of the Chimanimani Mountains in Rhodesia, from the bars in Port St Johns in the Transkei to the Drakensberg Mountains in South Africa, this is the story of one man's fight against terror, and his conscience. Anyone living in Rhodesia during the 1960s and 1970s would have had a father, husband, brother or son called up in the defense of the war-torn, landlocked little country. A few of these brave men would have been members of the elite and secretive unit that struck terror into the hearts of the ZANLA and ZIPRA guerrillas infiltrating the country at that time - the Selous Scouts. These men were highly trained and disciplined, with skills to rival the SAS, Navy Seals and the US Marines, although their dress and appearance were wildly unconventional: civilian clothing with blackened, hairy faces to resemble the very people they were fighting against. Twice decorated - with the Member of the Legion of Merit (MLM) and the Military Forces' Commendation (MFC) - Andrew Balaam was a member of the Rhodesian Light Infantry and later the Selous Scouts, for a period spanning twelve years. This is his honest and insightful account of his time as a pseudo operator. His story is brutally truthful, frightening, sometimes humorous and often sad. In later years, after Rhodesia became Zimbabwe, he was involved with a number of other former Selous Scouts in the attempted coups in the Ciskei, a South African homeland, and Lesotho, an independent nation, whose only crimes were supporting the African National Congress. Training terrorists, or as they preferred to be called, 'liberation armies', to conduct a war of terror on innocent civilians, was the very thing he had spent the last ten years in Rhodesia fighting against. This is the true, untold story of these failed attempts at governmental overthrows.",
  "genres": [
    "History",
    "Africa",
    "Nonfiction",
    "Military Fiction",
    "Biography",
    "War",
    "Politics"
  ],
  "author": "A.J. Balaam",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/22228107-bush-war-operator"
}