{
  "title": "Those Measureless Fields: A First World War Story",
  "description": "From the author of The Photographer of the Lost (The Poppy Wife) and Good Taste, this is a bittersweet story of love, war, cake and canine smuggling...Captain Laurence Greene was gassed at Ypres. He takes ten years to die. With her fiancé, Joseph, lost in France, Effie Shaw spends a decade as Laurence’s cook. They share a roof, a sweet tooth and a taste for pastoral romances. But propriety dictates that their sharing must end there. It is a surprise to Effie, then, when Laurence’s will leaves her a railway ticket, the deeds to a tea shop and a declaration of his unspoken love.The terms of Laurence’s bequest require that Effie must travel to Ypres and visit her fiancé’s grave. As Laurence told it, Joseph met his end with a show of heroics. But, in carrying out Laurence’s last requests, and following his wartime diary, Effie is about to discover something shocking: Joseph wasn’t quite as heroic as she was told – and he also isn’t quite so dead.The stories of three soldiers connect through Laurence’s diary. As Effie travels on, from Passchendaele to Paris, these men become linked together once again. A decade on from the Armistice, is the war really over at all? Effie is about to realise just how many echoes - and untidy ends - 1918 has left behind.'Those Measureless Fields'is a sucré-salé story about love, war, cake and canine smuggling. It’s a novel about a woman setting out on a journey – and about three men who are trying to finish one.‘Humour and pathos, well-researched details and clearly imagined experiences abound throughout the novel. It is poignant with quite a few twists and turns along the way, even with the hindsight the modern reader brings to this era. Thoughtful and unusual in narrative structure, this is a compelling tale of love, loss, secrets and lies.’ Historical Novel Society‘Beautifully observed and packed with vividly drawn characters and fascinating history, Those Measureless Fields takes us from the back streets of a Lancashire town to the killing fields of Ypres, and from the mud of Passchendaele to Jazz Age Paris… With pitch perfect skill and narrative power, Scott counterbalances the horrors of a relentlessly cruel war with the optimism and cynicism of a country in the process of renewal… Written with insight, honesty and humanity, Those Measureless Fields is a haunting exploration of war and its aftermath, and a heartfelt tribute to those who gave their tomorrow for our today.’ Lancashire Evening Post",
  "genres": [
    "Historical Fiction",
    "World War I"
  ],
  "author": "Caroline  Scott",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/22226164-those-measureless-fields"
}