{
  "title": "AfterLife",
  "description": "Alternate cover for this ASIN can be found hereSeries Overview  The fine thread between reality and the fantastical has snapped. The mortal and supernatural must learn to co-exist in post-reality Minneapolis/St. Paul where video games leak monsters into the night, demons roam, thirsting for more than just blood, people are not who or what they seem and a diabolical evil plots and plans to devour the world.  AfterLife  In this world gone mad......Lily’s biggest challenge is to survive.  Lily Starbuck, kick-ass witch caterer, knows that a day that starts with blood on the horizon is a terrible omen. The day goes downhill from there when a grumpy werewolf refuses to pay his catering bill, her partner cleaned out their bank accounts, and Lily finds her murdered in their kitchen. To make matters worse, the Fairy Dust Administration (FDA) is sniffing around. Fae dust hounds hot on her partner’s trail for dealing in illegal dust now turn their attention to her. Their sexy Fae leader takes a particular interest in her and is hard to shake.  Heartbroken, flat broke and with her very livelihood in jeopardy, she discovers that the formidable Otherworlder Security (O.S.) is being tampered with. With no active investigation and a missing body, she has no choice but to discover who killed her partner. Her only backup is a cantankerous gnome who delights in going invisible on her. Clues lead her to an open case being investigated by a tough O.S. warden shapeshifter. It seems a rogue mage has created a video game that is unwarded and game monsters are being released to terrorize the human and supernatural citizens of Minneapolis/St. Paul. Trouble is Lily has reason to believe that this mage killed her partner. Looks like Lily will have to make a deal with a vamp devil and battle wits with the Twin Cities most powerful leader all in the name of justice.",
  "genres": [
    "Urban Fantasy",
    "Mystery",
    "Fantasy",
    "Paranormal"
  ],
  "author": "Zoe Dawson",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/22231872-afterlife"
}