{
  "title": "Miss Gifty's School",
  "description": "Today you might be rejected. But in the end, you win. Christopher-Georges is just eleven years old when he discovers a secret school for children who are different.In a society where the government seeks to control and eliminate those who dare to be different, rebellious, or extraordinary, Christopher-Georges and his classmates must navigate dangerous secrets, growing friendships, and the mounting pressure to fight back.The clock is ticking, the danger is real, and Christopher-Georges must stay safe in the shadows or risk everything to survive and thrive.For fans of dystopian tales, Miss Gifty’s School is a thrilling journey of courage, rebellion, friendship, and the power of those who refuse to be silenced.⭐⭐⭐⭐⭐ For fans of HPIf you're a potter fan then you'll love this story! Christopher-Georges has a big personality but struggles in life. Then he starts school at miss gifty's. Nothing will be the same again... such a fun story! - Jinger Tylee Ertel⭐⭐⭐⭐⭐ It's The CharactersThis story has delightful characters that complement the setting, situations, and story so dang well. Can't wait for more and highly recommend! - Lachlan Smith⭐⭐⭐⭐⭐Fun Harry Potter-esque story！Love following Christopher-Georges and Matthew in the mysterious school! Lovely writing and an engaging story. - Robin⭐⭐⭐⭐⭐ Three Characters in Search of a MysteryI like the three main characters of Miss Gifty's school, and I like that it is not so Harry-Potterish. CG is not the \"chosen one\" or at least, not yet. He is pursued by evil, as is required by all fantasy, and particularly middle grade protagonists. So far (chapter 9) the pace is good, the descriptions fun, and the adults, as usual, clueless. - Charlotte Henley Babb⭐⭐⭐⭐⭐ Plenty of suspense, twists, and turnsA uniquely suspenseful story with plenty of twists and turns. - Jasmine",
  "genres": [],
  "author": "Melanie  Lemesle",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/222326579-miss-gifty-s-school"
}