{
  "title": "The Microscopic Giants",
  "description": "Men Go Forty Thousand Feet Below the Surface to Find Copper—and Battle with the Scurrying, Lilliputian Denizens of a Strange Land of Atomic Compression!excerpt\"It happened toward the end of the Great War of 1941, which was an indirect cause. You’ll find mention of it in the official records filed at Washington. Curious reading, some of those records! Among them are accounts of incidents so bizarre—freak accidents and odd discoveries fringing war activities—that the filing clerks must have raised their eyebrows skeptically before they buried them in steel cabinets, to remain unread for the rest of time.But this particular one will never be buried in oblivion for me. Because I was on the spot when it happened, and I was the one who sent in the report.Copper!A war-torn world was famished for it. The thunder of guns, from the Arctic to the Antarctic and from the Pacific to the Atlantic and back again, drummed for it. Equipment behind the lines demanded it. Statesmen lied for it and national bankers ran up bills that would never be paid to get it.Copper, copper, copper!Every obscure mine in the world was worked to capacity. Men risked their lives to salvage fragments from battlefields a thousand miles long. And still not enough copper was available for the maws of the electric furnaces.Up in the Lake Superior region we had gone down thirty-one thousand feet for it. Then, in answer to the enormous prices being paid for copper, we sank a shaft to forty thousand five hundred feet, where we struck a vein of almost pure ore. And it was shortly after this that my assistant, a young mining engineer named Belmont, came into my office, his eyes afire with the light of discovery.“We've uncovered the greatest archeological find since the days of the Rosetta Stone!” she announced bluntly. “Down in the new low level. I want to phone the Smithsonian Institute at once. There may be a war on, but the professors will forget all about war when they see this!”",
  "genres": [
    "Short Stories",
    "Science Fiction"
  ],
  "author": "Paul Ernst",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/22224287-the-microscopic-giants"
}