{
  "title": "Frank: A Life in Politics from the Great Society to Same-Sex Marriage",
  "description": "The New York Times Bestseller How did a disheveled, intellectually combative gay Jew with a thick accent become one of the most effective (and funniest) politicians of our time? Growing up in Bayonne, New Jersey, the fourteen-year-old Barney Frank made two vital discoveries about he was attracted to government, and to men. He resolved to make a career out of the first attraction and to keep the second a secret. Now, sixty years later, his sexual orientation is widely accepted, while his belief in government is embattled. A Life in Politics from the Great Society to Same-Sex Marriage is one man's account of the country's transformation--and the tale of a truly momentous career. Many Americans recall Frank's lacerating wit, whether it was directed at the Clinton impeachment (\"What did the president touch, and when did he touch it?\") or the pro-life movement (some people believe \"life begins at conception and ends at birth\"). But the contours of his private and public lives are less well-known. For more than four decades, he was at the center of the struggle for personal freedom and economic fairness. From the battle over AIDS funding in the 1980s to the debates over \"big government\" during the Clinton years to the 2008 financial crisis, the congressman from Massachusetts played a key role. In 2010, he coauthored the most far-reaching and controversial Wall Street reform bill since the era of the Great Depression, and helped bring about the repeal of Don't Ask, Don't Tell.In this feisty and often moving memoir, Frank candidly discusses the satisfactions, fears, and grudges that come with elected office. He recalls the emotional toll of living in the closet and how his public crusade against homophobia conflicted with his private accommodation of it. He discusses his painful quarrels with allies; his friendships with public figures, from Tip O'Neill to Sonny Bono; and how he found love with his husband, Jim Ready, becoming the first sitting member of Congress to enter a same-sex marriage. He also demonstrates how he used his rhetorical skills to expose his opponents' hypocrisies and delusions. Through it all, he expertly analyzes the gifts a successful politician must bring to the job, and how even Congress can be made to work.Frank is the story of an extraordinary political life, an original argument for how to rebuild trust in government, and a guide to how political change really happens--composed by a master of the art.",
  "genres": [
    "Politics",
    "Biography",
    "Memoir",
    "History",
    "Nonfiction",
    "LGBT",
    "Audiobook"
  ],
  "author": "Barney Frank",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/22237165-frank"
}