{
  "title": "Outline",
  "description": "A luminous, powerful novel that establishes Rachel Cusk as one of the finest writers in the English languageA man and a woman are seated next to each other on a plane. They get to talking--about their destination, their careers, their families. Grievances are aired, family tragedies discussed, marriages and divorces analyzed. An intimacy is established as two strangers contrast their own fictions about their lives. Rachel Cusk's Outline is a novel in ten conversations. Spare and stark, it follows a novelist teaching a course in creative writing during one oppressively hot summer in Athens. She leads her students in storytelling exercises. She meets other visiting writers for dinner and discourse. She goes swimming in the Ionian Sea with her neighbor from the plane. The people she encounters speak volubly about themselves: their fantasies, anxieties, pet theories, regrets, and longings. And through these disclosures, a portrait of the narrator is drawn by contrast, a portrait of a woman learning to face a great loss.Outline takes a hard look at the things that are hardest to speak about. It brilliantly captures conversations, investigates people's motivations for storytelling, and questions their ability to ever do so honestly or unselfishly. In doing so it bares the deepest impulses behind the craft of fiction writing. This is Rachel Cusk's finest work yet, and one of the most startling, brilliant, original novels of recent years.Short-listed for the 2014 Goldsmiths Prize, finalist for the 2014 Folio PrizeNamed one of the best fiction books of 2014 by The New Yorker, The Guardian, The Independent and Glamour A Publishers Weekly Pick of the Week and Flavorwire Staff Pick",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Novels",
    "Book Club",
    "Greece",
    "Literature"
  ],
  "author": "Rachel Cusk",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/22237157-outline"
}