{
  "title": "The Blizzard",
  "description": "Vladimir Sorokin is one of Russia’s most popular novelists, and one of its most provocative as well. In Sorokin’s scabrous dystopian satire, Day of the Oprichnik, American readers were introduced to his distinctive style, which combines an edgy avant-garde sensibility with a fondness for the absurd and even grotesque—all in the service of bringing out stinging truths about life in modern-day Russia.In The Blizzard, we are immediately immersed in the atmosphere of a 19th century Russia familiar to us from the works of Turgenev, Tolstoy, and Dostoyevsky. District doctor Garin is desperately trying to reach the village of Dolgoye, where a mysterious epidemic called the “Chernukha” is raging and threatens to spread throughout the country, turning people into zombies. The doctor carries with him a vaccine that will prevent the spread of this terrible disease, but is stymied in his travels by an all-consuming snow storm, an impenetrable blizzard that turns a drive that should last only a few hours into a voyage of days, and finally, a journey into eternity.The Blizzard dramatizes a timeless metaphysical predicament. The characters in this nearly post-apocalyptic world are constantly in motion, and yet somehow trapped and frozen—spending day and night fighting their way through the storm on an expedition filled with extraordinary encounters, dangerous escapades, torturous imaginings, and amorous adventures. In the fantastical realm Sorokin has invented, the reader also loses her bearings, subject to the vicissitudes of time and change, to both the movement of life and its stagnancy. Hypnotic, fascinating, and richly descriptive, The Blizzard is a seminal work from one of the most inventive writers working today.",
  "genres": [
    "Fiction",
    "Russia",
    "Fantasy",
    "Russian Literature",
    "Science Fiction",
    "Horror",
    "Dystopia"
  ],
  "author": "Vladimir Sorokin",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/22237141-the-blizzard"
}