{
  "title": "Break Wide the Sea",
  "description": "A young woman cursed with a fatal heartbreak-induced sickness must race against time to find a cure and protect her family legacy from the ancient finfolk that would destroy it, the fiancé that would kill her for it, and the boy who would love her if she forsook it.The seafaring humans of Kirkrell have always been plagued by finfolk—bloodthirsty fae who haunt the seas, sinking ships and cursing bloodlines. Yet it’s only by hunting magical whales that Kirkrell can prosper. Nineteen-year-old Annie is heir to the Fairfax Whaling Company, but their family's success came at a cost: a curse by which heartbreak turns Fairfaxes slowly into monsters. And six years ago, the shipwreck that killed Annie’s parents left her with scales spreading up her arms, claws sprouting from her fingertips.The love of her fiancé, August, salved her heart for a while—but when she learns August is maneuvering to take over the company, the curse worsens. Fearing her time is running out, she strikes a bargain with a disreputable young captain, half-finfolk and half-human Silas Price: on a voyage to hunt whales in the far north, Silas will take Annie to the finfolk queen, who can lift the curse in return for a promise to end whaling forever.As Annie, August and Silas sail north, she is determined to uphold her family’s legacy, but the threat of the finfolk tests her resolve. Lies corrupt her relationship with August; meanwhile a dangerous connection with Silas blooms—but he’s keeping secrets too, and his might be the most dangerous of all.As heiress, it’s Annie’s responsibility to deliver whale magic to her city. But as heartbreak looms, she must choose between saving herself and her family’s legacy—and hope it doesn’t cost her everyone she loves.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Young Adult Fantasy",
    "Pirates"
  ],
  "author": "Sara  Holland",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/222376655-break-wide-the-sea"
}