{
  "title": "The Zorg: A Tale of Greed and Murder That Inspired the Abolition of Slavery",
  "description": "From Pulitzer finalist and New York Times bestselling author of Cobalt A notorious slave ship incident that led to the abolition of slavery in the UK and sparked the US abolitionist movementIn late October 1780, a slave ship set sail from the Netherlands, bound for Africa’s Windward and Gold Coasts, where it would take on its human cargo. The Zorg (a Dutch word meaning both “care” and “worry”) was one of thousands of such ships, but the harrowing events that ensued on its doomed journey were unique.After reaching Africa, The Zorg was captured by a privateer and came under British command. With a new captain and crew, the ship was crammed with 442 slaves, and departed in 1781 for Jamaica. But a series of unpredictable weather events and mistakes in navigation left the ship drastically off course and running out of food and water. So a proposition was put Save the crew and the most valuable of the slaves—by throwing 140 people, mostly women and children, overboard.What followed was a fascinating legal drama in England’s highest court that turned the brutal calculus of slavery into front page news. For the first time, concepts such as human rights and morality entered the discourse on slavery, in a notorious case that boiled down to a simple but profound Were the Africans on board the Zorg people or cargo?The case of the Zorg catapulted the nascent anti-slavery movement from a minor evangelical cause to one of the most consequential moral campaigns in history. In this book, Siddharth Kara utilizes primary source research, masterful storytelling, and painstaking investigation to uncover the Zorg’s journey, the lives and fates of the slaves on board, and the mystery of who finally revealed the truth of what happened on the ship.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Siddharth Kara",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/222376731-the-zorg"
}