{
  "title": "Bulletproof Barista",
  "description": "When a film crew's location shoot delivers an actual shooting, Clare Cosi finds herself at the scene of a true crime in this showstopping entry in the beloved Coffeehouse Mysteries from New York Times bestselling author Cleo Coyle.Only Murders in Gotham, the smash-hit streaming program, is famous for filming in authentic New York locations and using real New Yorkers as extras. For its second season, they've chosen to spotlight the century-old Village Blend and its quirky crew of baristas. Shop manager and master roaster Clare Cosi is beyond thrilled, especially when her superb bulletproof coffee lands her a craft services contract for the production. Madame, the eccentric octogenarian owner of the landmark shop, reveals an old kinship with the star of the show, comedian Jerry Sullivan. Now a Hollywood legend, Jerry frequented the Blend during his early years performing in Greenwich Village comedy clubs. But the past may hold more than nostalgia for Jerry. Suspicious accidents begin plaguing his shoot. Then a real bullet is fired from a stage gun, and Clare becomes convinced something sinister is afoot. While Jerry's production moves to exciting new locations, Clare keeps the coffee flowing—and her investigation going—even as a murderer lurks in the wings. But can she root out the rotten player in this Big Apple production before the lights go out on her? Includes a stellar menu of surefire recipes.Praise for the Coffeehouse Mysteries\"Terrific series\" —Criminal Element \"A wonderful series with plenty of local color, great characters, and a setting so real that readers will be scouring the streets of Greenwich Village looking for the real Village Blend.\" —The Mystery Reader",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Cozy",
    "Audiobook",
    "Food",
    "Adult Fiction"
  ],
  "author": "Cleo Coyle",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/112974857-bulletproof-barista"
}