{
  "title": "A Martian Odyssey",
  "description": "A Martian Odyssey is a science fiction short story by Stanley G. Weinbaum originally published in the July 1934 issue of Wonder Stories. It was Weinbaum's second published story (in 1933 he had sold a romantic novel, The Lady Dances, to King Features Syndicate under the pseudonym Marge Stanley), and remains his best known. It was followed four months later by a sequel, \"Valley of Dreams.\" These are the only stories by Weinbaum set on Mars. Early in the 21st century, nearly twenty years after the invention of atomic power and ten years after the first lunar landing, the four-man crew of the Ares has landed on Mars in the Mare Cimmerium. A week after the landing, Dick Jarvis, the ship's American chemist, sets out south in an auxiliary rocket to photograph the landscape. Eight hundred miles out, the engine on Jarvis' rocket gives out, and he crash-lands into one of the Thyle regions. Rather than sit and wait for rescue, Jarvis decides to walk back north to the Ares. Just after crossing into the Mare Chronium, Jarvis comes across a tentacled Martian creature attacking a large birdlike creature. He notices that the birdlike Martian is carrying a bag around its neck, and recognizing it as an intelligent being, saves it from the tentacled monstrosity. The rescued creature refers to itself as Tweel. Tweel accompanies Jarvis on his trip back to the Ares, in the course of which it manages to pick up some English, although Jarvis is unable to make any sense of Tweel's language. At first, Tweel travels in tremendous, city-block-long leaps that end with its long beak buried in the ground, but upon seeing Jarvis trudge along, walks beside him. Upon reaching Xanthus, a desert region outside the Mare Cimmerium, Jarvis and Tweel find a line of small pyramids tens of thousands of years old made of silica bricks, each open at the top. As they follow the line, the pyramids slowly become larger and newer. By the time the pyramids are ten feet high, the travelers reach the end of the line and find a pyramid that is not open at the top. As they watch, a creature with gray scales, one arm, a mouth and a pointed tail pushes its way out of the top of the pyramid, pulls itself several yards along the ground, then plants itself in the ground by the tail. It starts exhaling bricks from its mouth at ten-minute intervals and using them to build another pyramid around itself. Jarvis realizes that the creature is silicon-based rather than carbon-based; neither animal, vegetable nor mineral, but a little of each. The strange combination of a creature produces the solid substance silica and builds itself in with the by-product, then sleeps for an unknown length of time. As the two approach a canal cutting across Xanthus, Jarvis is feeling homesick for New York City, thinking about Fancy Long, a woman he knows from the cast of the Yerba Mate Hour show. When he sees Long standing by the canal, he begins to approach her, but is stopped by Tweel. Tweel takes out a gun that fires poisoned glass needles and shoots Long, who vanishes, replaced by one of the tentacled creatures that Jarvis rescued Tweel from at their first meeting. Jarvis realizes that the tentacled creature, which he names a dream-beast, lures its prey by projecting illusions into their minds.",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Classics",
    "Audiobook",
    "Fiction",
    "Fantasy",
    "Aliens"
  ],
  "author": "Stanley G. Weinbaum",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/22243537-a-martian-odyssey"
}