{
  "title": "For the Sins of My Father: A Mafia Killer, His Son, and the Legacy of a Mob Life",
  "description": "A suspenseful, emotionally charged real-life Sopranos: The son of New York's most notorious Mafia killer reveals the conflicted life he led being raised by a cold-blooded murderer, who was also a devoted family man, and the wrenching legacy of Mafia family life.Al DeMeo will never forget the day in 1992 when a coworker, a fellow trader at the New York Stock Exchange, taunted him with a copy of the hot new book Murder Machine, chronicling the horrific criminal life of DeMeo's father, Roy, the head of the most deadly gang in organized crime. The moment sent DeMeo into a psychological tailspin: How could he have spent his life looking up to, and loving, a vicious killer?For the Sins of My Father recounts the chilling rise and fall of the man who led the Gambino family's most fearsome killers and thieves, through the eyes of a son who had never known any other kind of life. Coming of age in an opulent Long Island house where money is abundant but its source is unclear, Al becomes Roy's confidant, sent to call in loans at age fourteen and gradually coming to understand his father's job description--loan shark, car thief, porn purveyor and, above all, murderer. But when Al is seventeen, Roy's body is found in the trunk of a car, a gangland slaying that places Al between federal prosecutors seeking his testimony and a mob crew determined to keep him quiet.Desperate to abide by the father-son bond, but equally determined to escape his father's dangerous and doomed life, Al Demeo embarks on a courageous quest for the truth, reconciliation, and honor. With the implacable narrative drive of a thriller and the power of a painfully honest memoir, For the Sins of My Father presents a startling and unprecedented perspective on the underworld of organized crime, exposing for the first time the cruel legacy of a Mafia life.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Biography",
    "Memoir",
    "Autobiography",
    "Family"
  ],
  "author": "Albert Demeo",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/22239.For_the_Sins_of_My_Father"
}