{
  "title": "Imogene's Message",
  "description": "Do you love Thrillers with a touch of the supernatural?Edited and recommended by noted editor Don McNair Contains Religious and New Age themes, and some violent scenes. When extreme religious fundamentalists known as the Phineas Priesthood led by Ezekiel Yates and his three cousins, target Xantara Pembroke because they believe she is a witch, they launch a major conflict between unworldly disciples of good and evil. This 60,000-word, action-packed thriller shows the twists and turns of both sides as they try to destroy or save the souls of earth.Imogene is the daughter of Xantara, a Guardian of Avebury Circle, an ancient monument near Stonehenge. For over three thousand years, wives of eight village families have performed ceremonies to heal local people, with power handed down from first daughter to first daughter. The Pembroke family encounter extreme prejudice from the Priesthood.Braedon the village doctor is drawn into a world he didn't know existed to protect his daughter. His wife Xantara keeps her secrets and causes conflict in the marriage.All that is forgotten when Imogene levitates in Avebury Circle. Will the world believe Imogene’s incredible message?This book has the potential to go viral!” Mike Smith of Creating Lifestyle!“I just finished editing a thriller by an Australian writer Chris Sherborne, titled “Imogene’s Message.” I was so impressed with it that I offered to recommend it. This is only the second time I’ve done this in my 50 year professional editing career, so you can see that I’m enthused with her work. She has a good story, tells it well, and knows how to use good hooks and writing to keep readers engaged.” Don McNair “Neither of us could put this book down, reading it in one sitting.” June & Peter Phillips “Imogene’s Message is packed with excitement. I can’t wait for the next one.” Julie Lilley, UK ˃˃˃ Interested in Spirituality, Paranormal, and a book that's action packed?This book will have you glued to your chair until you've finished it. Fast-paced, scary and outraged!Scroll up and grab a copy today.",
  "genres": [
    "Thriller",
    "Paranormal"
  ],
  "author": "Chris Sherborne",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22239939-imogene-s-message"
}