{
  "title": "Redefining Race: Asian American Panethnicity and Shifting Ethnic Boundaries",
  "description": "In 2012, the Pew Research Center issued a report that named Asian Americans as the \"highest-income, best-educated, and fastest-growing racial group in the United States.\" Despite this optimistic conclusion, over thirty Asian American advocacy groups challenged the findings, noting that the term \"Asian American\" is complicated. It includes a wide range of ethnicities, national origins, and languages, and encompasses groups that differ greatly in their economic and social status. In Redefining Race , sociologist Dina G. Okamoto traces the complex evolution of \"Asian American\" as a panethnic label and identity, emphasizing how it is a deliberate social achievement negotiated by group members, rather than an organic and inevitable process.Drawing on original research and a series of interviews, Okamoto investigates how different Asian ethnic groups created this collective identity in the wake of the Civil Rights movement in the 1960s. Okamoto documents the social forces that encouraged the development of this panethnic identity. The racial segregation of Asians in similar occupations and industries, for example, produced a shared experience of racial discrimination, which led Asians of different national origins to develop shared interests and identities. By constructing a panethnic label and identity, ethnic group members created their own collective histories, and in the process challenged and redefined current notions of race. The emergence of a panethnic racial identity also depended, somewhat paradoxically, on different groups organizing along distinct ethnic lines to gain recognition and rights from the larger society. According to Okamoto, ethnic organizations provided the foundation necessary to build solidarity within different Asian-origin communities. Leaders and community members who created inclusive narratives and advocated policies that benefited groups beyond their own moved their discrete ethnic organizations toward a panethnic model. For example, a number of ethnic-specific organizations in San Francisco expanded their services and programs to include other ethnic group members after their original constituencies dwindled in size or assimilated. A Laotian organization included refugees from different parts of Asia, a Japanese organization began to advocate for South Asian populations, and a Chinese organization opened its doors to Filipinos and Vietnamese. As Okamoto shows, the process of building ties between ethnic communities while also recognizing ethnic diversity is the hallmark of panethnicity.Redefining Race is a groundbreaking analysis of the processes through which group boundaries are drawn and contested. In mapping the genesis of a panethnic Asian American identity, Okamoto illustrates the ways in which concepts of race continue to shape how ethnic and immigrant groups view themselves and organize for representation in the public arena.",
  "genres": [],
  "author": "Dina G. Okamoto",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/22238709-redefining-race"
}