{
  "title": "Flight of the Cuckoo",
  "description": "There is an alternative cover edition for this bookA funny novel of twists and turns, life, death, love, and of course.....revenge.  This is the dark but humourous tale of Sarah Pemberton, who is not a happy woman. A down to earth, inventive soul who despises her stuck up pompous husband Neil, who believes he is much more intelligent and important than she is. When he refuses her a divorce and emotionally blackmails her into staying with him by threatening to take custody of their daughter, she's decides to make life a little more entertaining for herself, by subtly torturing him at every available opportunity. Creative and adaptable by nature, with a wicked sense of humour, she comes up with more and more ways to ridicule him, without him ever knowing she has a hand in it.   ....\"During 1993-1994 amongst other things, I cooked him a meat pie with pedigree chum; Stole his car more times than I can count; put chilli powder in his underpants, sent a stripagram to his work (a fat one), and subscribed him to a gay porn mag! (Our paperboy avoided him like the plague after that.)\".....  Finding accomplices in the form of her Aunt May, who lives in a crumbling old former hotel which was damaged during WWII, and May's two lodgers, a shy young hippy named Darren, along with his brother Matthew a former life model, they try to get rid of her husband by either 'Plan A', which consists of 'frame him for a crime so that he gets incarcerated', or 'Plan B' drive him to a nervous breakdown. Both plans are designed to discredit Neil in case of a custody battle for their daughter. There is only one little prerequisite for every little torturous idea though, and that is, IT HAS TO MAKE THEM LAUGH! Unbeknown to Sarah at first, she isn't the only one with a vendetta against her husband, his entire workforce hate his guts and exploit any opportunity to make him look bad. When plans A & B go disastrously wrong, Sarah and co set their sights on a new target, her in-laws.  Interwoven throughout the story is the tale of Aunt May, the lynch pin of her little make shift family, who harbours secrets of her own that go back to the night the bomb fell on the east wing of the hotel.  This is not a tale of a submissive woman suffering at the hands of abuse; this is the tale of a strong courageous woman having one last laugh at other people's expense.  Contains very occasional strong language, and scenes that should not be repeated at home.  Volume One of 'The Cuckoo' series",
  "genres": [],
  "author": "K.L. Smith",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/22241579-flight-of-the-cuckoo"
}