{
  "title": "We Met Like This: A Novel",
  "description": "Beloved author Kasie West's sparkling adult rom-com debut about a hopeless romantic falling for the one man she never expectedCan a swipe right turn into swept away?Margot Hart is a hopeless romantic. That’s why she wants to be a literary agent—to help bring romance books to the world. It’s also why she hates dating apps with all her romance loving soul. She wants her own love story to be just as much fun as the books she reads—a mixed up coffee order, a mistaken identity. She’s not going to tell the story that she swiped right on future husband’s shirtless pic for the rest of her life.The problem is that her most consistent relationship over the last several years is with Oliver, a guy she keeps rematching with on the apps. They’ve only been on one date and it was a disaster…well, until the make out session in the car before parting ways. But, she keeps reminding herself, a make out session does not a relationship make. And so there will not be a date two regardless of how witty their app banter is.When Margot gets fired from her job on the same day she meets Oliver again, her life becomes a veritable shit show. Her dream career is dying right before her eyes, and Oliver thinks she’s interested in only one a repeat of the hot make out session they had three years ago so she can get him out of her system. And maybe that is all she wants from him, because she and Oliver are definitely not compatible—he doesn’t hit the snooze button, he runs five miles every morning, he reads nonfiction, and worst of all, she didn’t meet him in cute way! But in her scramble to keep her dream career alive, by opening her own agency, Oliver is there with his golden retriever energy, more steady and helpful than any man she’s ever dated. Just when she thinks she’s overcome her app bias, she realizes that maybe it’s not her who’s holding back, but him. And his reasons are more than she bargained for.Kasie West's romantic adult debut is full of witty banter, meet cutes gone awry and, ultimately, true love.",
  "genres": [
    "Romance",
    "Contemporary",
    "Adult",
    "Contemporary Romance",
    "Second Chance",
    "Young Adult",
    "Chick Lit"
  ],
  "author": "Kasie West",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/222376740-we-met-like-this"
}