{
  "title": "The Kingdom, the Power, and the Glory: American Evangelicals in an Age of Extremism",
  "description": "Evangelical Christians are perhaps the most polarizing—and least understood—people living in America today. In his seminal new book, The Kingdom, the Power, and the Glory, journalist Tim Alberta, himself a practicing Christian and the son of an evangelical pastor, paints an expansive and profoundly troubling portrait of the American evangelical movement. Through the eyes of televangelists and small-town preachers, celebrity revivalists and everyday churchgoers, Alberta tells the story of a faith cheapened by ephemeral fear, a promise corrupted by partisan subterfuge, and a reputation stained by perpetual scandal.For millions of conservative Christians, America is their kingdom—a land set apart, a nation uniquely blessed, a people in special covenant with God. This love of country, however, has given way to right-wing nationalist fervor, a reckless blood-and-soil idolatry that trivializes the kingdom of Jesus Christ. Alberta retraces the arc of the modern evangelical movement, placing political and cultural inflection points in the context of church teachings and traditions, explaining how Donald Trump's presidency and the COVID-19 pandemic only accelerated historical trends that long pointed toward disaster. Reporting from half-empty sanctuaries and standing-room-only convention halls across the country, the author documents a growing fracture inside American Christianity and journeys with readers through this strange new environment in which loving your enemies is \"woke\" and owning the libs is the answer to WWJD.Accessing the highest echelons of the American evangelical movement, Alberta investigates the ways in which conservative Christians have pursued, exercised, and often abused power in the name of securing this earthly kingdom. He highlights the battles evangelicals are fighting—and the weapons of their warfare—to demonstrate the disconnect from Contra the dictates of the New Testament, today's believers are struggling mightily against flesh and blood, eyes fixed on the here and now, desperate for a power that is frivolous and fleeting. Lingering at the intersection of real cultural displacement and perceived religious persecution, Alberta portrays a rapidly secularizing America that has come to distrust the evangelical church, and weaves together present-day narratives of individual pastors and their churches as they confront the twin challenges of lost status and diminished standing.Sifting through the wreckage—pastors broken, congregations battered, believers losing their religion because of sex scandals and political schemes—Alberta If the American evangelical movement has ceased to glorify God, what is its purpose?",
  "genres": [
    "Nonfiction",
    "Politics",
    "Religion",
    "History",
    "Audiobook",
    "Christianity",
    "Christian"
  ],
  "author": "Tim Alberta",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/112975131-the-kingdom-the-power-and-the-glory"
}