{
  "title": "The Wilderness of Ruin: A Tale of Madness, Fire, and the Hunt for America's Youngest Serial Killer",
  "description": "In late nineteenth-century Boston, home to Herman Melville and Oliver Wendell Holmes, a serial killer preying on children is running loose in the city—a wilderness of ruin caused by the Great Fire of 1872—in this literary historical crime thriller reminiscent of The Devil in the White City.In the early 1870s, local children begin disappearing from the working-class neighborhoods of Boston. Several return home bloody and bruised after being tortured, while others never come back.With the city on edge, authorities believe the abductions are the handiwork of a psychopath, until they discover that their killer—fourteen-year-old Jesse Pomeroy—is barely older than his victims. The criminal investigation that follows sparks a debate among the world’s most revered medical minds, and will have a decades-long impact on the judicial system and medical consciousness.The Wilderness of Ruin is a riveting tale of gruesome murder and depravity. At its heart is a great American city divided by class—a chasm that widens in the aftermath of the Great Fire of 1872. Roseanne Montillo brings Gilded Age Boston to glorious life—from the genteel cobblestone streets of Beacon Hill to the squalid, overcrowded tenements of Southie. Here, too, is the writer Herman Melville. Enthralled by the child killer’s case, he enlists physician Oliver Wendell Holmes to help him understand how it might relate to his own mental instability.With verve and historical detail, Roseanne Montillo explores this case that reverberated through all of Boston society in order to help us understand our modern hunger for the prurient and sensational.The Wilderness of Ruin features more than a dozen black-and-white photographs.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Crime",
    "Historical",
    "19th Century",
    "American History"
  ],
  "author": "Roseanne Montillo",
  "average_rating": "2.89",
  "url": "https://www.goodreads.com/book/show/22249679-the-wilderness-of-ruin"
}