{
  "title": "The Opposite of Spoiled: Raising Kids Who Are Grounded, Generous, and Smart About Money",
  "description": "In the spirit of Wendy Mogel’s The Blessing of a Skinned Knee and Po Bronson and Ashley Merryman’s Nurture Shock, New York Times “Your Money” columnist Ron Lieber delivers a taboo-shattering manifesto that explains how talking openly to children about money can help parents raise modest, patient, grounded young adults who are financially wise beyond their years. For Ron Lieber, a personal finance columnist and father, good parenting means talking about money with our kids. Children are hyper-aware of money, and they have scores of questions about its nuances. But when parents shy away from the topic, they lose a tremendous opportunity—not just to model the basic financial behaviors that are increasingly important for young adults but also to imprint lessons about what the family truly values. Written in a warm, accessible voice, grounded in real-world experience and stories from families with a range of incomes, The Opposite of Spoiled is both a practical guidebook and a values-based philosophy. The foundation of the book is a detailed blueprint for the best ways to handle the the tooth fairy, allowance, chores, charity, saving, birthdays, holidays, cell phones, checking accounts, clothing, cars, part-time jobs, and college tuition. It identifies a set of traits and virtues that embody the opposite of spoiled, and shares how to embrace the topic of money to help parents raise kids who are more generous and less materialistic. But The Opposite of Spoiled is also a promise to our kids that we will make them better with money than we are. It is for all of the parents who know that honest conversations about money with their curious children can help them become more patient and prudent, but who don’t know how and when to start.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Finance",
    "Childrens",
    "Audiobook",
    "Family",
    "Personal Finance"
  ],
  "author": "Ron Lieber",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/22249664-the-opposite-of-spoiled"
}