{
  "title": "Leeta Simtar—A Life on Two Planets: The Unauthorized Biography",
  "description": "\"A rousing tale about a young woman coming to terms with an unresolved past.\" —Kirkus ReviewsFor fans of Alechia Dow and Pittacus Lore comes Leeta Simtar: A Life on Two Planets—the latest book from young adult author Annie Fox about an interspecies hybrid looking to find herself on a new planet.A coming-of-age story that explores the meaning of birth family and found family, Leeta Simtar shows readers how breaking out of the past can help us figure out where we’re going next.Leeta Simtar isn’t the only interspecies hybrid on the planet Fure, though she is, without a doubt, noticeably different from all the others. Not only is she impossibly tall and wildly unpredictable, she leads with her feelings, in contrast to everyone else’s steady calm and logical demeanor. When Leeta’s offended, she rages and attacks. When something touches her deeply, she gushes and weeps. No wonder she has always believed something’s wrong with her, because clearly, she doesn’t belong on Fure.When Leeta suddenly finds out that what she’s believed about herself is a lie, she is more than ready to discover the truth. Since no one on Fure is talking, her only hope is to go rogue and find her own answers. She travels forty light years in search of others like herself—assuming there are others.With just eight days to unearth her origin story, Leeta follows clues that lead her across time and space hoping to find where she truly belongs. Readers of young adult science fiction, speculative/what-if fiction, and coming-of-age stories will connect to Leeta’s intergalactic adventure. They’ll be rooting for her to get what she needs, whether that means returning to Fure armed with the truth, staying in a far away place with her new found family, or finding home within her own heart.",
  "genres": [],
  "author": "Annie      Fox",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/222482510-leeta-simtar-a-life-on-two-planets"
}