{
  "title": "Biker Chick",
  "description": "Our bodies fell together, comfortingly familiar. He put me on my back on the linoleum floor. His weight was crushing as he came down on top of me.   Thanks to her connections to the Skull Kings MC, Aspen snags a job working at the strip club owned by the club president--and looking forward to it. Who can blame her when the security guard is none other than her boyfriend, the sexy, badass biker Liam Olsen? But her illicit workplace fantasies are cut short when a dead body is discovered in the bathroom, throwing the club into chaos. Things get hot in all the wrong ways, especially with the arrival of a handsome sheriff's deputy who takes a special interest in Aspen...  Conflict, lust, and betrayal abound, and once again Aspen is caught in the middle of it all. It's finally her chance to earn her place as Liam Olsen's old lady...but is she tough enough to succeed?  Warning: This 10,000 word story contains mature language and explicit sexuality. Intended for readers 18 years and older.  Excerpt: “You did the right thing coming to me.”  “Thanks…Josh.” It felt strange to call him by his first name. I hoped it would get easier eventually.  I peeked through my eyelashes at Josh. He’d agreed to meet me within twenty minutes of the text I’d sent him after Liam called the church. A part of me had flinched when he responded, the same part that recognized the special disdain Liam harbored for Josh. But the rest of me felt vindicated when Josh took one look at the picture I’d snapped on my phone and confirmed my suspicions.  I trusted Liam, but he wasn’t exactly thinking clearly. There was just something about Josh that set him off.  What could it be? I wondered as I watched him from across the table, the same exact one I’d been sitting at when I caught the rendezvous. Josh was young and pleasant to look at, I had to admit, with his chiseled cheekbones and toothpaste ad smile. He had longish dirty blonde hair that he kept combed back off of his forehead. I blushed when he caught me staring at his face and cast my eyes down onto his hands...",
  "genres": [],
  "author": "Sage L. Morgan",
  "average_rating": "1.00",
  "url": "https://www.goodreads.com/book/show/22249073-biker-chick"
}