{
  "title": "The Magic Thief Complete Collection: Books 1-5",
  "description": "In a city that runs on a dwindling supply of magic, a young boy is drawn into a life of wizardry and adventure. Author Sarah Prineas works her own spells as she transports us to an extraordinary world where cities are run on living magic and even a thief can become a wizard's apprentice. Diana Wynne Jones, author of Howl's Moving Castle, praised this middle grade fantasy series filled with magic and wonder, saying of the first, \"I couldn't put it down. Wonderful, exciting stuff.\" This collection contains all four novels in the series, plus the digital original novella The Magic A Proper Wizard.The Magic Conn should have dropped dead the day he picked Nevery's pocket and touched the wizard's locus magicalicus, a stone used to focus magic and work spells. But for some reason he did not. Nevery finds that interesting, and he takes Conn as his apprentice on the provision that the boy find a locus stone of his own. But Conn has little time to search for his stone between wizard lessons and helping Nevery discover who—or what—is stealing the city of Wellmet's magic.The Magic Conn may only be a wizard's apprentice, but even he knows it's dangerous to play with fire . . . especially around magic. But Conn is drawn to the murmurs he hears every time he sets off an explosion—something is trying to talk to him, to warn him. When none of the wizards listen, Conn takes matters into his own hands. His quest to protect everything he loves brings him face-to-face with a powerful sorcerer-king and a treachery beyond even his vivid imagination.The Magic Sneaking out of prison isn't easy, unless you are a thief, or a wizard. Luckily, Conn is both! Trouble is, once he's out, where does he go? His home is a pile of rubble since he blew it up doing magic. His master, the wizard Nevery, is not happy with him. Worst of all, Conn's been exiled, and staying in the city will mean his death.The Magic A Proper When Verent, a young apprentice from neighboring Danivelle, comes to Wellmet to ask for Conn's help with his city's magical problems, he is less than impressed with Conn. Will Verent be able to overcome his misgivings about Conn in order to help his town? And with Conn's help, will Verent become a proper wizard?The Magic Duchess Rowan has promoted Conn to ducal magister, but the other wizards see him only as a thief. But something sinister is brewing, as magicians' locus stones are being stolen and magical spells are going awry. As Conn faces old enemies and powerful magical forces, is he strong enough to save the city he calls home?",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Childrens"
  ],
  "author": "Sarah Prineas",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/22249788-the-magic-thief-complete-collection"
}