{
  "title": "Music Through the Floor: Stories",
  "description": "With \"Music Through the Floor,\" Pushcart Prize winner and former Wallace Stegner Fellow Eric Puchner makes an extraordinary debut: a collection of nine unforgettable stories -- strikingly original, fiercely funny, and quietly heartbreaking -- portraying a group of cultural misfits attempting to navigate mainstream America. Lost, teetering on the edge of normalcy, Puchner's characters seek to define themselves in a frequently absurd and hostile world -- a world that threatens to make outcasts of us all. Caught up in loneliness or solitude, they can't quite hear the music of their own lives.In \"Children of God,\" a young loner becomes the caretaker and companion for two mentally retarded men, seeking solace in their outsider status. \"Essay #3: Leda and the Swan\" is told in the forlorn, be-nighted, and tragically funny voice of a high school girl who longs more than anything to be loved. In \"Mission,\" an idealistic ESL teacher is faced with the inscrutable wrath of one of his immigrant students. And in the unsettling \"Child's Play,\" Puchner explores the price of nonconformity by following a pack of boys wreaking havoc on Halloween.Writing from an impressive range of perspectives -- men and women, children and adults, immigrants and tourists -- Puchner deftly exposes the dark, ten-der undersides of his characters with arresting beauty and precision. Here are people fumbling for identity in a depersonalized world, captured in moments that are hilarious, shocking, and transcendent -- sometimes all at once. Unfailingly true, surprisingly moving, and impossible to forget, these nine stories mark the arrival of a brilliant young writer and one of our most promising literary voices.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Literary Fiction",
    "Literature"
  ],
  "author": "Eric Puchner",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/222506.Music_Through_the_Floor"
}