{
  "title": "Beale Street Dynasty: Sex, Song, and the Struggle for the Soul of Memphis",
  "description": "The vivid history of Beale Street―a lost world of swaggering musicians, glamorous madams, and ruthless politicians―and the battle for the soul of Memphis. Following the Civil War, Beale Street in Memphis, Tennessee, thrived as a cauldron of sex and song, violence and passion. But out of this turmoil emerged a center of black progress, optimism, and cultural ferment. Preston Lauterbach tells this vivid, fascinating story through the multigenerational saga of a family whose ambition, race pride, and moral complexity indelibly shaped the city that would loom so large in American life. Robert Church, who would become “the South’s first black millionaire,” was a mulatto slave owned by his white father. Having survived a deadly race riot in 1866, Church constructed an empire of vice in the booming river town. He made a fortune with saloons, gambling, and―shockingly―white prostitution. But he also nurtured the militant journalism of Ida B. Wells and helped revolutionize American music through the work of composer W.C. Handy, the man who claimed to have invented the blues. In the face of Jim Crow, the Church fortune helped fashion the most powerful black political organization of the early twentieth century. Robert and his son, Bob Jr., bought and sold property, founded a bank, and created a park and auditorium for their people finer than the places whites had forbidden them to attend. However, the Church family operated through a tense arrangement with the Democrat machine run by the notorious E. H. “Boss” Crump, who stole elections and controlled city hall. The battle between this black dynasty and the white political machine would define the future of Memphis. Brilliantly researched and swiftly plotted, Beale Street Dynasty offers a captivating account of one of America’s iconic cities―by one of our most talented narrative historians. 8 pages of illustrations",
  "genres": [
    "History",
    "Nonfiction",
    "Music",
    "Race",
    "American History",
    "Historical",
    "Biography"
  ],
  "author": "Preston Lauterbach",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/22253717-beale-street-dynasty"
}