{
  "title": "Dumb Luck",
  "description": "As he approaches his 18th birthday, Brandon DeWolf knows he is not the sharpest knife in the drawer. He failed a grade in an undistinguished school career, and is contemplating spending two more years in school when most of his friends will be graduating at the end of the academic year. He tends to be in the wrong place at the wrong time, has no real ambitions, and seems to be at a dead end. Among the few happy moments of his life are the ones he spends with his good friend Kayla, a girl he's known from childhood, another misfit. Two days before his birthday, however, everything changes for Brandon. First of all he falls out of a tree - and survives intact. On his birthday, savouring his lucky break, he picks up a lottery ticket, and discovers he's won three million dollars. Suddenly everyone's his good friend, and his parents - a discontented frequently squabbling pair - rejoice in anticipating all that this sudden bonanza will buy them. The school's hottest girl becomes Brandon's coach in this new unaccustomed life he has to adapt to. His old friend Kayla realizes their friendship is withering, and Brandon doesn't have the capacity to do much about that. Plunged into a world that is completely new to him - and without any real moral compass to follow - Brandon flounders and eventually is brought down in disgrace, spending a night in jail after being caught drinking and driving. There is no happy ending for Brandon, just a solemn understanding that he cannot recover his old life and needs to find the integrity to map out a new one. This is the latest in the series of provocative and thoughtful young adult novels by Lesley Choyce. Lesley enjoys portraying teenagers at those uncomfortable and challenging moments as they approach the cusp of adulthood with all its dangers and possibilities.",
  "genres": [
    "Young Adult"
  ],
  "author": "Lesley Choyce",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/11298330-dumb-luck"
}