{
  "title": "The World of Normal Boys",
  "description": "In his stunning debut novel, The World Of Normal Boys, K.M. Soehnlein captures the spirit of a generation and an era, embodied in the haunting, unstoppable voice of thirteen-year-old Robin MacKenzie, a modern-day Holden Caulfield, whose struggle for a place in the world is as ferocious as it is real. The time is the late 1970s--an age of gas shortages, head shops, and Saturday Night Fever. The place, suburban New Jersey. At a time when the teenagers around him are coming of age, Robin MacKenzie is coming undone. While \"normal boys\" are into cars, sports, and bullying their classmates, Robin enjoys day trips to New York City with his elegant mother, spinning fantastic tales for her amusement in an intimate ritual he has come to love. He dutifully plays the role of the good son for his meat-and-potatoes father, even as his own mind is a jumble of sexual confusion and painful self-doubt. But everything changes in one, horrifying instant when a tragic accident wakes his family from their middle-American dream and plunges them into a spiral of slow destruction. As his family falls apart day by day, Robin finds himself pulling away from the unquestioned, unexamined life that has been carefully laid out for him. Small acts of rebellion lead to larger questions of what it means to stand on his own. Falling into a fevered triangle with two other outcasts, Todd Spicer and Scott Schatz, Robin embarks on an explosive odyssey of sexual self-discovery that will take him beyond the spring-green lawns of suburbia, beyond the fraying fabric barely holding together his quickly unraveling family, and into a complex future, beyond the world of normal boys. In The World Of Normal Boys, K.M. Soehnlein has created a dazzling gem of a debut novel in the tradition of Ordinary People and A Boy's Own Story, one that sparkles with raw honesty, poetic beauty, wry insight, and a rare richness of emotion that reverberates long after the last page is read. It is a story about growing up and falling apart, of rebellion and acceptance, of unspoken lives and irreversible choices that are made.",
  "genres": [
    "LGBT",
    "Fiction",
    "Gay",
    "Queer",
    "Young Adult",
    "Gay Fiction",
    "M M Romance"
  ],
  "author": "K.M. Soehnlein",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/222520.The_World_of_Normal_Boys"
}