{
  "title": "The Honest Courtesan: Veronica Franco, Citizen and Writer in Sixteenth-Century Venice",
  "description": "The Venetian courtesan has long captured the imagination as a female symbol of sexual license, elegance, beauty, and unruliness. What then to make of the cortigiana onesta—the honest courtesan who recast virtue as intellectual integrity and offered wit and refinement in return for patronage and a place in public life? Veronica Franco (1546–1591) was such a woman, a writer and citizen of Venice, whose published poems and familiar letters offer rich testimony to the complexity of the honest courtesan's position.Margaret F. Rosenthal draws a compelling portrait of Veronica Franco in her cultural, social, and economic world. Rosenthal reveals in Franco's writing a passionate support of defenseless women, strong convictions about inequality, and, in the eroticized language of her epistolary verses, the seductive political nature of all poetic contests. It is Veronica Franco's insight into the power conflicts between men and women—and her awareness of the threat she posed to her male contemporaries—that makes her literary works and her dealings with Venetian intellectuals so pertinent today.Combining the resources of biography, history, literary theory, and cultural criticism, this sophisticated interdisciplinary work presents an eloquent and often moving account of one woman's life as an act of self-creation and as a complex response to social forces and cultural conditions.\"A book . . . pleasurably redolent of Venice in the 16th-century. Rosenthal gives a vivid sense of a world of salons and coteries, of intricate networks of family and patronage, and of literary exchanges both intellectual and erotic.\"—Helen Hackett, Times Higher Education SupplementThe Honest Courtesan is the basis for the film Dangerous Beauty (1998) directed by Marshall Herskovitz. (The film was re-titled The Honest Courtesan for release in the UK and Europe in 1999.)",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Italy",
    "Historical",
    "Womens",
    "Feminism"
  ],
  "author": "Margaret F. Rosenthal",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/22263.The_Honest_Courtesan"
}