{
  "title": "The True American: Murder and Mercy in Texas",
  "description": "The True American tells the story of Raisuddin Bhuiyan, a Bangladesh Air Force officer who dreams of immigrating to America and working in technology. But days after 9/11, an avowed \"American terrorist\" named Mark Stroman, seeking revenge, walks into the Dallas minimart where Bhuiyan has found temporary work and shoots him, maiming and nearly killing him. Two other victims, at other gas stations, aren’t so lucky, dying at once.The True American traces the making of these two men, Stroman and Bhuiyan, and of their fateful encounter. It follows them as they rebuild shattered lives—one striving on Death Row to become a better man, the other to heal and pull himself up from the lowest rung on the ladder of an unfamiliar country.Ten years after the shooting, an Islamic pilgrimage seeds in Bhuiyan a strange idea: if he is ever to be whole, he must reenter Stroman's life. He longs to confront Stroman and speak to him face to face about the attack that changed their lives. Bhuiyan publicly forgives Stroman, in the name of his religion and its notion of mercy. Then he wages a legal and public-relations campaign, against the State of Texas and Governor Rick Perry, to have his attacker spared from the death penalty.Ranging from Texas's juvenile justice system to the swirling crowd of pilgrims at the Hajj in Mecca; from a biker bar to an immigrant mosque in Dallas; from young military cadets in Bangladesh to elite paratroopers in Israel; from a wealthy household of chicken importers in Karachi, Pakistan, to the sober residences of Brownwood, Texas, The True American is a rich, colorful, profoundly moving exploration of the American dream in its many dimensions. Ultimately it tells a story about our love-hate relationship with immigrants, about the encounter of Islam and the West, about how—or whether—we choose what we become.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "History",
    "Politics",
    "Biography",
    "Crime",
    "Race"
  ],
  "author": "Anand Giridharadas",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/22253774-the-true-american"
}