{
  "title": "Scorpio Rising",
  "description": "Scorpio Rising is the last novel by a Texas writer whose work was too often neglected during his lifetime. R. G. Vliet died just days after completing the book, and the power and majesty of his writing reflect the heightened awareness of a man resigned to his own death. But he was able to produce a novel which, in its investigation of the vagaries of time, human desire, and deformity both physical and moral, approaches the level of classical tragedy.The novel begins as an account of displaced westerners living in a small Massachusetts city - and then mysteriously turns back to a darker time and place, a Texas ranch town at the turn of the century. Is what follows a dream, a hallucination, or the acting out of a guilt long buried? The story now centers on a headstrong young woman who yearns to escape a setting as confining as the land is open. She will involve those around her in a conspiracy whose murderous consequences reach beyond even her selfish reckoning.Scorpio Rising is a wonderfully crafted novel; the two time periods it comprises refer back to each other in subtle and haunting ways. Vliet wrote before his death: \"I'm so conscious lately of what must, apparently, be the strangeness of my novels to others (mainly strangeness of style, intensity and vision) that it has put me through a private crisis. But my vision seems to me so clear and true, the compulsive passion behind it so powerful, and my demands upon the language so necessary to me that I don't believe I can write any other way.\"R. G. Vliet is a reputation waiting to be discovered, and Scorpio Rising is his final and crowning achievement.\"The tragedy of R. G. Vliet's early death is deepened by another tragedy: among American fiction writers of the twentieth century he is as good as anyone, and better than most, yet his work has not been widely read. Vliet's rendering of the physical world - the earth and its creatures, the sky and seasons - is a brilliant achievement and reason enough to buy and read this book. But his real greatness is this: with sensuous prose and masterful compression, Vliet has written a novel that is an exciting psychological and philosophical adventure. It is a masterpiece.\"- Andre Dubus",
  "genres": [
    "Historical Fiction"
  ],
  "author": "R.G. Vliet",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/2226067.Scorpio_Rising"
}