{
  "title": "The Chivalrous Society",
  "description": "\"Georges Duby in productivity and originality stands at the forefront of active medievalists in France and in the world. The present collection contains 15 of his short articles, most but not all of which appear in English for the first time. . . Of capital interest are his several essays that explore the evolution of nobility, knighthood, the noble family, and the ideals of chivalry across the central Middle Ages. They are both a summary and the point of departure of current research into the medieval aristocracy .... Indispensable.\"--Choice \"[A] valuable collection. The title is exact. But it is no coffee-table account of courtly life eked out with colour photos of an author's subsidized holiday. It is an interlocking series of studies about the structure of families, the nature of knighthood and nobility, changes of attitudes towards kinship, and the influence of new clerical ideas . . . . Duby shows us noble families becoming specifically knightly, acquiring heritable toponymies, clustering round the patrimony, emphasizing the male line and the eldest born save when the female is an heiress, and in the course of time forming a homogeneous noble class whose members by St. Louis's age, whatever else they are, are gentilhommes. Passion is not spent, but canalized against the enemies of Christ. The discrete themes of undergraduate medieval history are in reality one complex whole: land, wives, dynasty war, celibacy, vows, pilgrimage, crusade, nobility.\"--Times Literary Supplement \"Duby's researches in medieval agrarian and social history have established him as one of the leading international authorities in those areas. This volume brings together 15 of his most significant articles. The book represents the best of 'the new history.\"'--Library Journal",
  "genres": [
    "History",
    "Medieval",
    "Nonfiction",
    "Medieval History"
  ],
  "author": "Georges Duby",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/2225855.The_Chivalrous_Society"
}