{
  "title": "Kitty Genovese: The Murder, the Bystanders, the Crime that Changed America",
  "description": "New York City, 1964. A young woman is stabbed to death on her front stoop—a murder the New York Times called “a frozen moment of dramatic, disturbing social change.” The victim, Catherine “Kitty” Genovese, became an urban martyr, butchered by a sociopathic killer in plain sight of thirty-eight neighbors who “didn’t want to get involved.” Her sensational case provoked an anxious outcry and launched a sociological theory known as the “Bystander Effect.”That’s the narrative told by the Times, movies, TV programs, and countless psychology textbooks. But as award-winning author Kevin Cook reveals, the Genovese story is just that, a story. The truth is far more compelling—and so is the victim.Now, on the fiftieth anniversary of her murder, Cook presents the real Kitty Genovese. She was a vibrant young woman—unbeknownst to most, a lesbian—a bartender working (and dancing) her way through the colorful, fast-changing New York of the ’60s, a cultural kaleidoscope marred by the Kennedy assassination, the Cold War, and race riots. Downtown, Greenwich Village teemed with beatniks, folkies, and so-called misfits like Kitty and her lover. Kitty Genovese evokes the Village’s gay and lesbian underground with deep feeling and colorful detail.Cook also reconstructs the crime itself, tracing the movements of Genovese’s killer, Winston Moseley, whose disturbing trial testimony made him a terrifying figure to police and citizens alike, especially after his escape from Attica State Prison.Drawing on a trove of long-lost documents, plus new interviews with her lover and other key figures, Cook explores the enduring legacy of the case. His heartbreaking account of what really happened on the night Genovese died is the most accurate and chilling to date.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Crime",
    "Psychology",
    "New York",
    "Historical"
  ],
  "author": "Kevin Cook",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/22253762-kitty-genovese"
}