{
  "title": "Lincoln's Greatest Case: The River, the Bridge, and the Making of America",
  "description": "The untold story of how one sensational trial propelled a self-taught lawyer and a future president into the national spotlight. In the early hours of May 6, 1856, the steamboat Effie Afton barreled into a pillar of the Rock Island Bridge―the first railroad bridge ever to span the Mississippi River. Soon after, the newly constructed vessel, crowded with passengers and livestock, erupted into flames and sank in the river below, taking much of the bridge with it. As lawyer and Lincoln scholar Brian McGinty dramatically reveals in Lincoln's Greatest Case , no one was killed, but the question of who was at fault cried out for an answer. Backed by powerful steamboat interests in St. Louis, the owners of the Effie Afton quickly pressed suit, hoping that a victory would not only prevent the construction of any future bridges from crossing the Mississippi but also thwart the burgeoning spread of railroads from Chicago. The fate of the long-dreamed-of transcontinental railroad lurked ominously in the background, for if rails could not cross the Mississippi by bridge, how could they span the continent all the way to the Pacific? The official title of the case was Hurd et al. v. The Railroad Bridge Company , but it could have been St. Louis v. Chicago , for the transportation future of the whole nation was at stake. Indeed, was it to be dominated by steamboats or by railroads? Conducted at almost the same time as the notorious Dred Scott case, this new trial riveted the nation’s attention. Meanwhile, Abraham Lincoln, already well known as one of the best trial lawyers in Illinois, was summoned to Chicago to join a handful of crack legal practitioners in the defense of the bridge. While there, he succesfully helped unite the disparate regions of the country with a truly transcontinental rail system and, in the process, added to the stellar reputation that vaulted him into the White House less than four years later. Re-creating the Effie Afton case from its unlikely inception to its controversial finale, McGinty brilliantly animates this legal cauldron of the late 1850s, which turned out to be the most consequential trial in Lincoln's nearly quarter century as a lawyer. Along the way, the tall prairie lawyer's consummate legal skills and instincts are also brought to vivid life, as is the history of steamboat traffic on the Mississippi, the progress of railroads west of the Appalachians, and the epochal clashes of railroads and steamboats at the river’s edge. Lincoln's Greatest Case is legal history on a grand scale and an essential first act to a pivotal Lincoln drama we did not know was there. 18 illustrations",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Law",
    "19th Century",
    "Biography",
    "Politics"
  ],
  "author": "Brian McGinty",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/22261055-lincoln-s-greatest-case"
}