{
  "title": "The Quantum and the Lotus: A Journey to the Frontiers Where Science and Buddhism Meet",
  "description": "Matthieu Ricard trained as a molecular biologist, working in the lab of a Nobel prize—winning scientist, but when he read some Buddhist philosophy, he became drawn to Buddhism. Eventually he left his life in science to study with Tibetan teachers, and he is now a Buddhist monk and translator for the Dalai Lama, living in the Shechen monastery near Kathmandu in Nepal. Trinh Thuan was born into a Buddhist family in Vietnam but became intrigued by the explosion of discoveries in astronomy during the 1960s. He made his way to the prestigious California Institute of Technology to study with some of the biggest names in the field and is now an acclaimed astrophysicist and specialist on how the galaxies formed.When Matthieu Ricard and Trinh Thuan met at an academic conference in the summer of 1997, they began discussing the many remarkable connections between the teachings of Buddhism and the findings of recent science. That conversation grew into an astonishing correspondence exploring a series of fascinating questions. Did the universe have a beginning? Or is our universe one in a series of infinite universes with no end and no beginning? Is the concept of a beginning of time fundamentally flawed? Might our perception of time in fact be an illusion, a phenomenon created in our brains that has no ultimate reality? Is the stunning fine-tuning of the universe, which has produced just the right conditions for life to evolve, a sign that a “principle of creation” is at work in our world? If such a principle of creation undergirds the workings of the universe, what does that tell us about whether or not there is a divine Creator? How does the radical interpretation of reality offered by quantum physics conform to and yet differ from the Buddhist conception of reality? What is consciousness and how did it evolve? Can consciousness exist apart from a brain generating it?The stimulating journey of discovery the authors traveled in their discussions is re-created beautifully in The Quantum and the Lotus , written in the style of a lively dialogue between friends. Both the fundamental teachings of Buddhism and the discoveries of contemporary science are introduced with great clarity, and the reader will be profoundly impressed by the many correspondences between the two streams of thought and revelation. Through the course of their dialogue, the authors reach a remarkable meeting of minds, ultimately offering a vital new understanding of the many ways in which science and Buddhism confirm and complement each other and of the ways in which, as Matthieu Ricard writes, “knowledge of our spirits and knowledge of the world are mutually enlightening and empowering.”“ The Quantum and the Lotus is a mind-expanding, eye-opening exploration of the exciting parallels between cutting-edge thinking in physics and Buddhism–a scintillating conversation any thinking person would delight in overhearing.” —Daniel Goleman, author of Emotional Intelligence“ The Quantum and the Lotus is the rich and inspiring result of a deeply interesting dialogue between Western science and Buddhist philosophy. This remarkable book will contribute greatly to a better understanding of the true nature of our world and the way we live our lives.” —His Holiness the Dalai Lama",
  "genres": [
    "Science",
    "Buddhism",
    "Philosophy",
    "Nonfiction",
    "Spirituality",
    "Religion",
    "Physics"
  ],
  "author": "Matthieu Ricard",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/222652.The_Quantum_and_the_Lotus"
}