{
  "title": "The Blaft Book of Anti-Caste SF",
  "description": "An anthology of weird, fantastic, supernatural, Dalit futurist, & magical realist fiction by writers from South Asia and the diaspora.This book features a mix of original English short stories and works in translation, as well as a few comics/graphic narratives. Some are by well-known superstars of Dalit and Bahujan literature, others by emerging or newly-emerged authors. The list of writers includes:Bama, Dalit feminist icon and author of the groundbreaking novel Karukku (1992). Her brand new story \"Kurali\" is about a group of villagers who put on a sound & light show for some ravenous ghosts. (Translated from the Tamil by Meena Kandasamy.)Mimi Mondal, whose fiction has twice been nominated for the Nebula Award, who co-edited a Hugo-nominated and Locus Award-winning anthology on the work of Octavia Butler, and who has written adventures for Dungeons & Dragons. (She also interned at Blaft, once upon a long, long time ago...!)Gautamiputra Kamble, Marathi-language author of Parivrajak, a fable about two wanderers on a journey to a forbidden mountain. (In translation by Sirus Libeiro.)Gogu Shyamala, Telugu-language author of Father May Be an Elephant and Mother Only a Small Basket, But.... (2012). Her new story is \"The Mysterious Ladder.\" (In Translation by Divya Kalavala.)P. A. Uthaman (1961-2008), Malayalam-language author of Chaoli, for which he posthumously won the Kerala Sahitya Academy Award for best novel in 2008. We'll be including his story \"The River Didn't Know, Either\", about a magical family heirloom. (In translation by Mridula Makkuni.)Neerav Patel (1950-2019), founder of the Gujarati Dalit literary magazine Kalo Suraj (\"Black Sun\"). His story deals with caste oppression among the robots. (In translation by Gopika Jadeja.)Tamilmagan, Tamil-language author of the science fiction novel Operation Nova and the collection Amila Devathaigal (\"Acid Angels\"). His story in this anthology is about a far-future Indian city where something very strange has happened to the agrarian class. (In translation by Nirmal Rajagopalan.)Sumit Kumar, founder of the independent comics publisher Bakarmax, and creator of the graphic novels Amar Bari Tomar Bari Naxalbari and Kashmir ki Kahani.Archita Mittra, whose work has been published or is forthcoming in Lightspeed, Locus Magazine, Reactor, and Strange Horizons, among other venues. She is an Ignyte Award finalist for Best Critic while her fiction and poetry have been nominated for the Pushcart and Best of the Net prizes.  Goutam Mandal, a Bengali science fiction novelist and thriller writer who has also translated Japanese yokai stories into Bengali. (In translation by Ipsa S. and Pratiti Ketoki.)V. Chandrashekar RaoSahej RahalRahee PunyashlokaKunal LokhandeSubash Thebe LimbuNabi Haider AliEsther Larisa DavidSnehashish DasHameedha KhanAswathy K. RajGouriGitanjali JoshuaPrachi SinghShivani KshirsagarYukti NarangSudarshan Devadoss & M.K. AbhilashYeswanth Mocharla",
  "genres": [
    "Anthologies",
    "Short Stories",
    "Indian Literature"
  ],
  "author": "R.T. Samuel",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/222806857-the-blaft-book-of-anti-caste-sf"
}