{
  "title": "A Reader's Manifesto: An Attack on the Growing Pretentiousness in American Literary Prose",
  "description": "Available for the first time, the full-length, unexpurgated version of the essay that incited one of the most passionate literary controversies ever in American letters . . .When the Atlantic Monthly first published an excerpted version of B.R. Myers' polemic—in which he attacked literary giants such as Don Delillo, Annie Proulx, and Cormac McCarthy, quoting their work extensively to accuse them of mindless pretension—it caused a world-wide sensation.\"A welcome contrarian takes on the state of contemporary American literary prose,\" said a Wall Street Journal review. \"Useful mischief,\" said Jonathan Yardley in The Washington Post. \"Brilliantly written,\" declared The Times of London.But Myers' expanded version of the essay does more than just attack sanctified literary heavyweights.It also:* Examines the literary hierarchy that perpetuates the status quo by looking at the reviews that the novelists in question received. It also considers the literary award system. \"Rick Moody received an O. Henry Award in 1997,\" Myers observes, \"whereupon he was made an O. Henry juror himself. And so it goes.\"* Showcases Myers' biting sense of wit, as in the new section, \"Ten Rules for 'Serious' Writers,\" and his discussion of the sex scenes in the bestselling books of David Guterson (\"If Jackie Collins had written that,\" Myers says after one example, \"reviewers would have had a field day.\")* Champions clear writing and storytelling in a wide range of writers, from \"pop\" novelists such as Stephen King to more \"serious\" literary heavyweights such as Somerset Maugham. Myers also considers the classics such as Balzac and Henry James, and recommends numerous other undeservedly obscure authors.* Includes an all-new section in which Myers not only considers the controversy that followed the Atlantic essay, but responds to several of his most prominent critics.Published on the one-year anniversary of original Atlantic Monthly essay, the new, expanded A READER'S MANIFESTO continues B.R. Myers' fight on behalf of the American reader, arguing against pretension in so-called \"literary\" fiction, naming names and brilliantly exposing the literary status quo.",
  "genres": [
    "Nonfiction",
    "Literary Criticism",
    "Essays",
    "Books About Books",
    "Writing",
    "Criticism",
    "Literature"
  ],
  "author": "B.R. Myers",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/101435.A_Reader_s_Manifesto"
}