{
  "title": "The Unwritten Rules of Social Relationships: Decoding Social Mysteries Through the Unique Perspectives of Autism",
  "description": "Silver Award Winner in the 2005 ForeWord Book of the Year Awards! Born with autism, both authors now famously live successful social lives. But their paths were very different. Temple's logical mind controlled her social behavior. She interacted with many adults and other children, experiencing varied social situations. Logic informed her decision to obey social rules and avoid unpleasant consequences. Sean's emotions controlled his social behavior. Baffled by social rules, isolated and friendless, he made up his own, and applied them to others. When they inevitably broke his rules, he felt worthless and unloved. Both Temple and Sean ultimately came to terms with the social world and found their places in it. Whether you are a person with autism, a caregiver in the autism community, or just someone interested in an outsider view of society, their powerful stories will enthrall and enlighten you. Helpful sections include: Two Perspectives on Social Thinking Two Minds: Two Paths The Ten Unwritten Rules of Social Relationships, which include: Rule #1: Rules are Not Absolute. They are Situation-based and People-based Rule #2: Not Everything is Equally Important in the Grand Scheme of Things Rule #3: Everyone in the World Makes Mistakes. It Doesn’t Have to Ruin Your Day. Rule #4: Honesty is Different than Diplomacy Rule #5: Being Polite is Appropriate in Any Situation Rule #6: Not Everyone Who is Nice to Me is My Friend Rule #7: People Act Differently in Public than They Do in Private Rule #8: Know When You’re Turning People Off Rule #9: Fitting in is Often Tied to Looking and Sounding Like You Fit In Rule # 10: People are Responsible for Their Own Behaviors",
  "genres": [
    "Autistic Spectrum Disorder",
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Aspergers",
    "Relationships",
    "Parenting"
  ],
  "author": "Temple Grandin",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/222891.The_Unwritten_Rules_of_Social_Relationships"
}