{
  "title": "life.love.beauty",
  "description": "Ingram and Publishers Weekly bestseller!\"This book takes you on a photographic voyage through my life so far.\" -Keegan AllenKeegan Allen is currently known to fans of the ABC Family hit television series, Pretty Little Liars. He has also appeared in numerous independent films and made his New York Stage debut in the acclaimed MCC production of Small Engine Repair.Keegan was given his first camera at age nine, and began a lifelong study and pursuit of photography. life.love.beauty is a selection of photographs taken since his childhood. It's a photo journey through the life of an intensely creative soul whose expression finds various in acting, in poems and stories, lyrics and music, but above all in photography. This book's content resonates in the commonality we all share on our own journeys while unveiling an inside look into a world that very few experience.Organized into three broad groups-life, love, and beauty-the book ranges over the public and private side of Keegan Allen and his world. A child of Hollywood, whose father was also an actor and his mother a painter, Keegan roams freely through that realm, photographing his fellow actors on set, behind the scenes; and recording the amazed, gleeful, sometimes weeping fans that flock to his television and career related events.Allen also has an eye for the anonymous and the the woman gazing dreamily from the balcony of a run-down hotel; the rifle-toting dog walker who seems to have emerged from the 19th century; the performers and denizens of Venice Beach and also the streets of New York, some of them chasing the dream of fame, others having long-since abandoned it; the little boy amid in the crowd in an enormous airport; portraits of lovers kissing on subways, in parks, and on the streets. Traveling from California to New York to Paris and back, as well as through the American west, he finds beauty in both urban and rural from large-scale landscapes to glimpses of light transforming what it touches.Keegan's poems, stories, captions and musings, song lyrics, and journal pages complement the photographs on this journey. He provides an account of growing up just off the Sunset Strip, coming into his own as an actor/artist, dealing with public recognition while maintaining a very private life, falling in and out of love, and acknowledging the influence of his family, friends, fans, and loved ones.life.love.beauty is an unusually intimate and revealing a delight for anyone who values photography, and a gift for the many fans who already follow Keegan's career.Keegan's real passion comes through in both his photographs and candid story telling in this unique photo-journal.",
  "genres": [
    "Nonfiction",
    "Photography",
    "Art",
    "Memoir",
    "Biography",
    "Poetry",
    "Love"
  ],
  "author": "Keegan Allen",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/22293533-life-love-beauty"
}