{
  "title": "The Tyranny of the Meritocracy: Democratizing Higher Education in America",
  "description": "A fresh and bold argument for revamping our standards of “merit” and a clear blueprint for creating collaborative education models that strengthen our democracy rather than privileging individual elitesStanding on the foundations of America’s promise of equal opportunity, our universities purport to serve as engines of social mobility and practitioners of democracy. But as acclaimed scholar and pioneering civil rights advocate Lani Guinier argues, the merit systems that dictate the admissions practices of these institutions are functioning to select and privilege elite individuals rather than create learning communities geared to advance democratic societies. Having studied and taught at schools such as Harvard University, Yale Law School, and the University of Pennsylvania Law School, Guinier has spent years examining the experiences of ethnic minorities and of women at the nation’s top institutions of higher education, and here she lays bare the practices that impede the stated missions of these schools.Goaded on by a contemporary culture that establishes value through ranking and sorting, universities assess applicants using the vocabulary of private, highly individualized merit. As a result of private merit standards and ever-increasing tuitions, our colleges and universities increasingly are failing in their mission to provide educational opportunity and to prepare students for productive and engaged citizenship.To reclaim higher education as a cornerstone of democracy, Guinier argues that institutions of higher learning must focus on admitting and educating a class of students who will be critical thinkers, active citizens, and publicly spirited leaders. Guinier presents a plan for considering “democratic merit,” a system that measures the success of higher education not by the personal qualities of the students who enter but by the work and service performed by the graduates who leave.Guinier goes on to offer vivid examples of communities that have developed effective learning strategies based not on an individual’s “merit” but on the collaborative strength of a group, learning and working together, supporting members, and evolving into powerful collectives. Examples are taken from across the country and include a wide range of approaches, each innovative and effective. Guinier argues for reformation, not only of the very premises of admissions practices but of the shape of higher education itself.",
  "genres": [
    "Education",
    "Nonfiction",
    "Politics",
    "Sociology",
    "Race",
    "Economics",
    "Teaching"
  ],
  "author": "Lani Guinier",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/22292760-the-tyranny-of-the-meritocracy"
}