{
  "title": "Romantic Outlaws: The Extraordinary Lives of Mary Wollstonecraft and Her Daughter Mary Shelley",
  "description": "Romantic Outlaws is the first book to tell the story of the passionate and pioneering lives of Mary Wollstonecraft – English feminist and author of the landmark book, The Vindication of the Rights of Women – and her novelist daughter Mary Shelley, author of Frankenstein.Although mother and daughter, these two brilliant women never knew one another – Wollstonecraft died of an infection in 1797 at the age of thirty-eight, a week after giving birth. Nevertheless their lives were so closely intertwined, their choices, dreams and tragedies so eerily similar, it seems impossible to consider one without the other.Both women became famous writers; fell in love with brilliant but impossible men; and were single mothers who had children out of wedlock; both lived in exile; fought for their position in society; and thought deeply about how we should live. And both women broke almost every rigid convention there was to break: Wollstonecraft chased pirates in Scandinavia. Shelley faced down bandits in Naples. Wollstonecraft sailed to Paris to witness the Revolution. Shelley eloped in a fishing boat with a married man. Wollstonecraft proclaimed that women’s liberty should matter to everyone.Not only did Wollstonecraft declare the rights of women, her work ignited Romanticism. She inspired Coleridge, Wordsworth and a whole new generation of writers, including her own daughter, who – with her young lover Percy Shelley – read Wollstonecraft’s work aloud by her graveside. At just nineteen years old and a new mother herself, Mary Shelley composed Frankenstein whilst travelling around Italy with Percy and roguish Lord Byron (who promptly fathered a child by Mary’s stepsister). It is a seminal novel, exploring the limitations of human nature and the power of invention at a time of great religious and scientific upheaval. Moreover, Mary Shelley would become the editor of her husband’s poetry after his early death – a feat of scholarship that did nothing less than establish his literary reputation.Romantic Outlaws brings together a pair of visionary women who should have shared a life, but who instead shared a powerful literary and feminist legacy. This is inventive, illuminating, involving biography at its best.",
  "genres": [
    "Nonfiction",
    "Biography",
    "History",
    "Feminism",
    "Biography Memoir",
    "Historical",
    "Womens"
  ],
  "author": "Charlotte Gordon",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/22294061-romantic-outlaws"
}