{
  "title": "Finding the Worm",
  "description": "The New York Post praised Twerp as “reminiscent of The Perks of Being a Wallflower .” Finding the Worm is a sequel that stands on its own--an unforgettable coming-of-age story about life, loss, and friendship. Perfect for fans of The Sandlot and readers who love books by Jennifer L. Holm, Andrew Clements, and Rebecca Stead. It’s not a test unless you can fail. . . . Trouble always seems to find thirteen-year-old Julian Twerski. First it was a bullying incident, and now he’s been accused of vandalizing a painting. The principal doesn’t want to suspend him again, so instead, he asks Julian to write a 200-word essay on good citizenship. Julian writes 200 no ’s instead, and so begins an epic struggle between Julian and his principal. Being falsely accused is bad enough, but outside of school, Julian’s dealing with even bigger issues. His friend Quentin has been really sick. How can life be fair when the nicest guy in your group has cancer? Julian’s faith and friendships are put to the test . . . and the stakes have never been higher.Praise for Twerp : A Bank Street Best Book of the Year A Junior Library Guild Selection A Summer Top Ten Kids’ Indie Next List Pick “Reminiscent of The Perks of Being a Wallflower . . . . You don’t have to be a twerp to read this book.” — New York Post “A vivid, absorbing story about one boy’s misadventure, heartache, and hope for himself.” — Rebecca Stead , Newbery Medal–winning author of When You Reach Me “[Fans of] Jeff Kinney’s Diary of a Wimpy Kid who have matured beyond the scope and gravity of that series will find a kindred spirit in Julian.” — School Library Journal “Reminiscent of movies like The Sandlot . . . . Well-written and funny.” — The Advocate “Alternately poignant and comical. . . . A thought-provoking exploration of bullying, personal integrity and self-acceptance.” — Kirkus Reviews “Funny, poignant, and an effective commentary on bullying and its consequences.” — The Horn Book Magazine",
  "genres": [
    "Middle Grade",
    "Realistic Fiction",
    "Coming Of Age",
    "Young Adult",
    "Fiction",
    "Childrens",
    "Historical"
  ],
  "author": "Mark Goldblatt",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/22291629-finding-the-worm"
}