{
  "title": "Facade",
  "description": "WARNING! This book is Dark erotica. This book contains situations that some may find offensive. If you are sensitive to graphic violence read with caution. This book also leads into a second book. You will get answers but the story will continue into a final instalment. You have been warned. Enjoy.\n  You meet someone. You date. You fall in love. You marry. The four simple rules of love…. Wrong! I’m getting married but I’d never met him before now, never dated him, never fell in love. I have no access to the memories of the most magical time of anyone’s life. My mind won’t allow me to evoke the past, I can’t remember those simple stages to lead me to the fourth .  I can’t comprehend why I would have ever wanted to marry someone like Dante. I should never have passed the first stage, although, I may have seen him through the eyes of the woman I once was, this me that lives, breathes here now, can’t understand how we made it to the next stage. I’m not sure, without memories, how I know that this voice inside me, telling me I would never have chosen him, speaks some truth, I just know. He’s controlling, arrogant, callous and violent, and utterly hell bent on humiliating and degrading me – Like watching me falter, watching me struggle to comply and be the woman he asked to marry, powers him- as though he wants to break me piece by piece. Fiber by fiber. Until all that’s here is the shell he created from a soul that I once owned.  Now my memories are slowly returning. And they show me a completely different side to meeting him. Our dates, falling in love. The Dante haunting me in the shadows of my mind is loving, gentle and utterly enamored with me, nothing like the man with me now. And this is what taunts me. My tender lover turned into a debauched, cruel sadist who is determined to consume my life, destroy my mind and murder my spirit.  I am, Star, and just like with some stars in the sky, the light you see is an echo, a façade, I am already gone I am a no one. Especially to him. To him I am the dark in his desires, the corrupt in his depravity. The sin in his immorality",
  "genres": [
    "Dark",
    "BDSM",
    "Erotica",
    "Abuse",
    "Romance",
    "Dark Romance",
    "Suspense"
  ],
  "author": "D.H. Sidebottom",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/22293515-facade"
}