{
  "title": "Keystone ~ An Unusual Love Story",
  "description": "This screenplay is a companion to Larry Mickelson's break-through book \"The Mystique of Love How To Take Control Of Your Love Life. Since the book contains many complex original concepts that are sometimes difficult to follow, this screenplay was written to apply the concepts in the book, to everyday life. But being a screenplay, it is designed to be more entertaining. Follow the characters as they meet, fall in love and ultimately, experience difficult times. Get involved in their conversations about the confusing aspects of love. What is love? Is sex love? Why does it seem like love and heartbreak always go hand-in-hand? Finally, follow the author as he reaches into the realm of science fiction for a solution to all the difficulties created by being human and being in love. Once you read this screenplay, your view of love will forever be changed. One's entire life is somehow connected to love. Whether \"in love\" with someone special or simply loving others, we all make life's major decisions based upon our beliefs about the concept. Love is, therefore, a very important thing to understand. But, who provides us with all of this knowledge and advice? Historically, the two main sources have been grandma and Hollywood. It's true. We get married because of pithy sayings from grandmas and touching scenes in chick flicks that make us cry. These pools of information are obviously a bit unreliable when one's entire future is at stake. Many readers will see themselves in almost every scene mostly because love is something we all feel, have felt or want to feel in the future. This analysis of love is unusual but the concepts therein have been described as potentially life changing. . They might even change your life. Take the challenge. Learn about the seven precise steps involved in falling in love, Learn about the five distinct times we are willing to gush \"I love you\". And sadly, learn about how when things go badly in our love lives, we end up heartbroken. Understanding what heartbreak is and why it is so totally depressing is one of the lessons that will be covered.",
  "genres": [],
  "author": "Larry Mickelson",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/22291343-keystone-an-unusual-love-story"
}