{
  "title": "The Secret Life of Captain X: My Life with a Psychopath Pilot",
  "description": "Her marriage to successful airline pilot Captain X seemed like a dream come true. In reality, it was a nightmare.  From the second they met, Captain X swept MrsXNomore off her feet, constantly showering her with gifts, flattery and attention. He never left her side unless he was working his scheduled flights. Expertly he gained her complete trust and love. Soon they married, often traveling the world on Major Airways.  Early on she underwent the physical and emotional stress of infertility and adoption with little help from her husband. Things were not adding up. She ignored the red flags, his controlling ways and anger, putting his abuse somewhere in the back of her mind. After all, everyone who met charming Captain X told her “How lucky you are to be married to him!”  Captain X doted on their child, as if in a parenting competition. His erratic work schedule, their few friends, distant family, and his evasiveness about finances left MrsXNomore in a constant state of confusion. Isolated from friends and family, and plagued with serious medical conditions, she was in no state to address these issues.  Enduring three surgeries in fourteen months, she received no empathy whatsoever from Captain X. Worn down, her life was filled with his constant mixed messages. Claiming she needed mental help, Captain X pushed her into therapy, resulting in more confusion.  Insisting on reviewing family finances, disbelief set in. Captain X had plunged them into serious debt, often using her name, ruining her credit. In what appeared to be a sincere apology, he begged for forgiveness, promising to make everything right. Instead, he filed for divorce.  Shocked, she constantly searched for answers and found them in Captain X’s computer. She discovered he was member of a secret brotherhood involving prostitution, locally and internationally during their entire marriage. When she confronted him, he immediately moved out of their family home, taking their child. She was a now a victim of parental alienation.  Tormented, thoughts of suicide crept into her head. Months became years spent trying to understand what had happened to her. What kind of man was he? Why didn’t she know the man she married? Thankfully she found answers. Captain X is a socialized psychopath. MrsXNomore always believed there was good in everyone, but now she understood that’s not so. The realization was frightening.  Recognizing that psychopaths (also known as sociopaths) often return to their past victims to inflict further pain, she fled the country to be far away from him, heal and write. Struggling to undo the parental alienation, to get her child back into her life, was just one more obstacle to overcome.  Like most people, MrsXNomore thought the label “psychopath” meant someone was a murderer. Ted Bundy came to mind. She had no idea psychopaths could be socialized and live among us, skillfully masking their psychopathy while manipulating and controlling people’s lives.  MrsXNomore learned that his devaluation and discarding of her, along with their high conflict divorce, parental alienation, and subsequent frivolous litigations were commonplace when dealing with a psychopath. As a result, she no longer has any contact with him.  Since experts estimate as many as 4% of people are psychopaths, a chapter titled Understanding & Avoiding Psychopaths helps readers recognize and avoid these untreatable social predators without conscience. A final chapter, Suggested Reading and Viewing, provides readers with resources to learn more about psychopathy.",
  "genres": [
    "Memoir"
  ],
  "author": "MrsXNomore",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/22296197-the-secret-life-of-captain-x"
}