{
  "title": "The Black Death",
  "description": "Philip Ziegler follows the course of the black plague as it swept from Asia into Italy and then into the rest of Europe. When first published in 1969, this study was described by the Guardian as …as exciting and readable an account as you could wish.\" This new edition of the major study on the subject is illustrated by over seventy contemporary black and white illustrations and eight pages of color.A series of natural disasters in the furthest reaches of the Orient during the third of the fourteenth century heralded what was, for the population of Europe, the most devastating period of death and destruction in its history. By the autumn of 1347 the Black Death had reached the shores of the eastern Mediterranean, and the years that followed were to witness a horrifying and apparently relentless epidemic.One third of England's population died between the years 1347 and 1350, and over one thousand villages were deserted, never to be repopulated. In towns and cities the cemeteries were unable to provide space for all the dead, and violence and crime spiraled. Travel became dangerous and interruption of food and other supplies across the country added hunger and deprivation to the problems of people already overwhelmed by the threat of the vilest of deaths. In the countryside the population was halved in places, and as land became plentiful, landowners' profits fell and the government tried in vain to fix labourers' wages and prices, peasant unrest accelerated and the manorial system disintegrated, culminating eventually in the Peasants' Revolt of 1381. Throughout Europe whole societies were disrupted; racial tensions built as a direct result of the plague, and persecution of Jews began in earnest throughout the continent. The social and economic consequences of the period were to reach far into the following century.",
  "genres": [
    "History",
    "Nonfiction",
    "Medieval",
    "Science",
    "Medieval History",
    "European History",
    "Medical"
  ],
  "author": "Philip Ziegler",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/1130098.The_Black_Death"
}