{
  "title": "Every Spiral of Fate",
  "description": "A New York Times bestselling series!The highly anticipated fourth novel in the Woven Kingdom romantasy series, brimming with fiery romance, spectacular magic, and breathtaking secrets, from Tahereh Mafi, the award-winning and bestselling author of the Shatter Me series. Perfect for fans of Sarah J. Maas, Leigh Bardugo, and Sabaa Tahir.At long last, the wedding day has arrived.The Jinn queen and the enigmatic ruler of Tulan are to be married in a magical, enchanted ceremony—but Cyrus, tethered by a blood oath to his bride-to-be, can find nothing to celebrate in this union. He’s falling ever more deeply in love with the one person oathbound to kill him.Sworn to an ancient, unbreakable magic, Alizeh can only fulfill the prophecy to free her people by ensuring Cyrus dies by her own hand. And Cyrus is forced to await his end all while Prince Kamran inches closer, ready to take his place by Alizeh’s side. The countdown to murder coils tensions ever tighter, but the historic wedding has already drawn deadly attention. To prepare for war and protect her people, Alizeh must finally discover her magic—and outrun the enemies trying to stop her.Alizeh and Cyrus, along with Kamran and their friends from Ardunia, must flee on dragon-back to begin the perilous journey into the legendary mountains of Arya, where a firestorm of revelations, magical discoveries, and fresh allies awaits them. Every allegiance will be tested, every darkness uncovered, and when the shattering secrets of the Tulanian king are finally revealed . . .Nothing, and no one, will be the same.Desperate confessions, impossible decisions, unfathomable magical power—and a love so devastating it rewrites destinies—Every Spiral of Fate is the shimmering, breathtaking fourth volume in a saga that continues to transcend expectations.",
  "genres": [
    "Fantasy",
    "Romantasy",
    "Young Adult",
    "Young Adult Fantasy",
    "Fantasy Romance",
    "Fiction",
    "Romance"
  ],
  "author": "Tahereh Mafi",
  "average_rating": "4.84",
  "url": "https://www.goodreads.com/book/show/223097553-every-spiral-of-fate"
}