{
  "title": "Dr. Mütter's Marvels: A True Tale of Intrigue and Innovation at the Dawn of Modern Medicine",
  "description": "A mesmerizing biography of the brilliant and eccentric medical innovator who revolutionized American surgery and founded the country’s most famous museum of medical oddities   Imagine undergoing an operation without anesthesia performed by a surgeon who refuses to sterilize his tools—or even wash his hands. This was the world of medicine when Thomas Dent Mütter began his trailblazing career as a plastic surgeon in Philadelphia during the middle of the nineteenth century.   Although he died at just forty-eight, Mütter was an audacious medical innovator who pioneered the use of ether as anesthesia, the sterilization of surgical tools, and a compassion-based vision for helping the severely deformed, which clashed spectacularly with the sentiments of his time.   Brilliant, outspoken, and brazenly handsome, Mütter was flamboyant in every aspect of his life. He wore pink silk suits to perform surgery, added an umlaut to his last name just because he could, and amassed an immense collection of medical oddities that would later form the basis of Philadelphia’s Mütter Museum.   Award-winning writer Cristin O’Keefe Aptowicz vividly chronicles how Mütter’s efforts helped establish Philadelphia as a global mecca for medical innovation—despite intense resistance from his numerous rivals. (Foremost among Charles D. Meigs, an influential obstetrician who loathed Mütter’s \"overly\" modern medical opinions.) In the narrative spirit of The Devil in the White City, Dr. Mütter’s Marvels interweaves an eye-opening portrait of nineteenth-century medicine with the riveting biography of a man once described as the \"P. T. Barnum of the surgery room.\"",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Biography",
    "Medicine",
    "Medical",
    "Audiobook"
  ],
  "author": "Cristin O'Keefe Aptowicz",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/22310690-dr-m-tter-s-marvels"
}