{
  "title": "Washington's Revolution: The Making of America's First Leader",
  "description": "A vivid, insightful, essential new account of the formative years that shaped a callow George Washington into an extraordinary leader, from the Bancroft Prize winner and Pulitzer Prize finalist Robert Middlekauff.George Washington was famously unknowable, a man of deep passions hidden behind a facade of rigid self-control. Yet before he was a great general and president, Washington was a young man prone to peevishness and a volcanic temper. His greatness as a leader evolved over time, the product of experience and maturity but also a willed effort to restrain his wilder impulses.Focusing on Washington’s early years, Robert Middlekauff penetrates his mystique, revealing his all-too-human fears, values, and passions. Rich in psychological detail regarding Washington’s temperament, idiosyncrasies, and experiences, this book shows a self-conscious Washington who grew in confidence and experience as a young soldier, businessman, and Virginia gentleman, and who was transformed into a patriot by the revolutionary ferment of the 1760s and ’70s. Taking command of an army in constant dire need—of adequate food, weapons, and, at times, even clothing and shoes—Washington displayed incredible persistence and resourcefulness, growing into a leader who both understood and defined the crucial role of the army in the formation of a new American society.Middlekauff makes clear that Washington was at the heart of not just the revolution’s course and outcome but also the success of the nation it produced. This is an indispensable book for truly understanding one of America’s great figures.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "American History",
    "American Revolution",
    "War",
    "American Revolutionary War"
  ],
  "author": "Robert Middlekauff",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/22318506-washington-s-revolution"
}