{
  "title": "Crown of Renewal",
  "description": "NAMED ONE OF THE BEST BOOKS OF THE YEAR BY  KIRKUS REVIEWSAcclaimed author Elizabeth Moon spins gripping, richly imagined epic fantasy novels that have earned comparisons to the work of such authors as Robin Hobb and Lois McMaster Bujold. In this volume, Moon’s brilliant masterwork reaches its triumphant conclusion. The mysterious reappearance of magery throughout the land has been met with suspicion, fear, and violence. In the kingdom of Lyonya, Kieri, the half-elven, half-human king, struggles to balance the competing demands of his heritage while fighting a deadly threat to his evil elves linked in some way to the rebirth of magic. Meanwhile, in the neighboring kingdom of Tsaia, a set of ancient artifacts recovered by the former mercenary Dorrin Verrakai may hold the answer to the riddle of magery’s return. Thus Dorrin embarks on a dangerous quest to return these relics of a bygone age to their all-but-mythical place of origin. What she encounters there will change her in unimaginable ways—and spell doom or salvation for the entire world.Praise for Crown of Renewal “Mesmerizing . . . [Elizabeth] Moon offers convincingly realized characters persuasively shaped by the extraordinary richness, depth and texture of the world they inhabit. . . . Such is the allure of an extremely talented writer at the the height of her powers.” — Kirkus Reviews (starred review) “Elves, demons, warped magicians, ancient artifacts, time travel, and an agrarian-based society make for an evocative story. . . . The depth of each character’s emotions . . . show the author’s writing power.” — Booklist Praise for Elizabeth Moon Limits of Power “Thoughtful and deeply character driven, full of personal crises as heartbreaking and hopeful as any dramatic invasion . . . Fantasy fans will be delighted by this impressive foray.” — Publishers Weekly (starred review) Echoes of Betrayal “This is an excellent series, and Echoes of Betrayal is particularly well done. [Moon is a] consistently entertaining writer, and this book lives up to her standards.” — San Jose Mercury News “Rousing action and intriguing plot twists.” —Kirkus Reviews Kings of the North “Moon’s characters navigate an intricate maze of alliances and rivalries. . . . Close attention to military detail gives the action convincing intensity.” —The Star-Ledger “Her storytelling is as electrifying as ever, and her readers should be delighted with this new vista of a well-known world.” —Booklist",
  "genres": [
    "Fantasy",
    "Epic Fantasy",
    "Fiction",
    "High Fantasy",
    "Science Fiction Fantasy",
    "Adventure",
    "Dragons"
  ],
  "author": "Elizabeth Moon",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/22318364-crown-of-renewal"
}