{
  "title": "Vera Brittain and the First World War: The Story of Testament of Youth",
  "description": "Vera Brittain and the First World War tells the remarkable story of the author behind Testament of Youth whilst charting the book's ascent to become one of the most loved memoirs of the First World War period. Such interest is set to expand even more in this centenary year of the war's outbreak.In the midst of her studies at Oxford when war broke out across Europe, Vera Brittain left university in 1915 to become a V.A.D (Voluntary Aid Detachment) nurse, treating soldiers in London, Malta and Etaples in France. The events of the First World War were to have an enormous impact on her life. Four of Brittain's closest friends including her fiancé Roland Leighton and her brother Edward Brittain MC were killed in action, sparking a lifelong commitment to pacifism. In 1933 she published Testament of Youth, the first of three books dealing with her experience of war. In equal measures courageous, tragic and deeply fascinating, Testament of Youth is one of the most compelling and important works of war literature ever to have been written by a British woman.Mark Bostridge's Vera Brittain and the First World War, published to coincide with the film of Testament of Youth, explores the effects of the First World War on Vera Brittain, both in terms of her personal life and in terms of its effect on her development as a writer and her eventual decision to become a pacifist. Taking advantage of the interest generated by the film, it will bring her story to a new generation and incorporate the most up-to-date research. It will also include a short essay 'From Book to Film', describing the process of turning Testament of Youth into a major feature film. This will include interviews with the production staff and actors, as well as with members of Vera Brittain's family, including Shirley Williams.The film, which has been scripted by Juliette Towhidi and is being produced by BBC Films and Heyday Films, the makers of Harry Potter, is currently in production. Alicia Vikander (Anna Karenina) stars as Brittain, with Kit Harington (Game of Thrones, Pompeii) playing her fiancé Roland Leighton.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "World War I",
    "Audiobook",
    "War",
    "Biography Memoir"
  ],
  "author": "Mark Bostridge",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/22313667-vera-brittain-and-the-first-world-war"
}