{
  "title": "The Life of Saul Bellow: To Fame and Fortune 1915-1964",
  "description": "For much of his adult life, Saul Bellow was the most acclaimed novelist in America, the winner of, among other awards, the Nobel Prize in Literature, three National Book Awards, and the Pulitzer Prize. The Life of Saul Bellow, by the literary scholar and biographer Zachary Leader, marks the centenary of Bellow's birth as well as the tenth anniversary of his death. It draws on unprecedented access to Bellow's papers, including much previously restricted material, as well as interviews with more than 150 of the novelist's relatives, close friends, colleagues, and lovers, a number of whom have never spoken to researchers before. Through detailed exploration of Bellow's writings, and the private history that informed them, Leader chronicles a singular life in letters, offering original and nuanced accounts not only of the novelist's development and rise to eminence, but of his many identities--as writer, polemicist, husband, father, Chicagoan, Jew, American.The biography will be published in two volumes. The first volume, To Fame and Fortune: 1915-1964, traces Bellow's Russian roots; his birth and early childhood in Quebec; his years in Chicago; his travels in Mexico, Europe, and Israel; the first three of his five marriages; and the novels from Dangling Man and The Adventures of Augie March to the best-selling Herzog. New light is shed on Bellow's fellow writers, including Ralph Ellison, John Berryman, Lionel Trilling, and Philip Roth, and on his turbulent and influential life away from the desk, which was as full of incident as his fiction. Bellow emerges as a compelling character, and Leader's powerful accounts of his writings, published and unpublished, forward the case for his being, as the critic James Wood puts it, \"the greatest of American prose stylists in the twentieth century.\"",
  "genres": [
    "Biography",
    "Nonfiction",
    "Literature",
    "History",
    "American",
    "American History"
  ],
  "author": "Zachary Leader",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/22318350-the-life-of-saul-bellow"
}