{
  "title": "A Word from Our Sponsor: Admen, Advertising, and the Golden Age of Radio",
  "description": "During the “golden age” of radio, from roughly the late 1920s until the late 1940s, advertising agencies were arguably the most important sources of radio entertainment. Most nationally broadcast programs on network radio were created, produced, written, and/or managed by advertising for example, J. Walter Thompson produced “Kraft Music Hall” for Kraft; Benton & Bowles oversaw “Show Boat” for Maxwell House Coffee; and Young & Rubicam managed “Town Hall Tonight” with comedian Fred Allen for Bristol-Myers. Yet this fact has disappeared from popular memory and receives little attention from media scholars and historians. By repositioning the advertising industry as a central agent in the development of broadcasting, author Cynthia B. Meyers challenges conventional views about the role of advertising in culture, the integration of media industries, and the role of commercialism in broadcasting history.Based largely on archival materials, A Word from Our Sponsor mines agency records from the J. Walter Thompson papers at Duke University, which include staff meeting transcriptions, memos, and account histories; agency records of BBDO, Benton & Bowles, Young & Rubicam, and N. W. Ayer; contemporaneous trade publications; and the voluminous correspondence between NBC and agency executives in the NBC Records at the Wisconsin Historical Society. Mediating between audiences’ desire for entertainment and advertisers’ desire for sales, admen combined “showmanship” with “salesmanship” to produce a uniquely American form of commercial culture. In recounting the history of this form, Meyers enriches and corrects our understanding not only of broadcasting history but also of advertising history, business history, and American cultural history from the 1920s to the 1940s.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Cynthia B. Meyers",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/22314290-a-word-from-our-sponsor"
}