{
  "title": "Bhagavad-gita As It Is: Complete Edition with original Sanskrit text, Roman transliteration, English equivalents, translation and elaborate purports",
  "description": "The Bhagavad-gita (“Song of God”), which forms eighteen chapters in the epic Mahabharata, presents the core of the Vedic philosophy in a relatively brief seven hundred verses. Celebrated and revered for its profound message, it is the one book turned to by philosophers, yogis, and transcendentalists of nearly all paths of Vedic spirituality. In the West it early inspired, among others, the American Transcendentalists Emerson and Thoreau and has been looked to ever since for its perennial wisdom. It is the essential Vedic text for spiritual realization.Just on the verge of the historic Battle of Kurukshetra, the warrior Arjuna loses his nerve. Totally distraught and ready to give up on life, he turns to his friend and charioteer, Krishna, for advice, \"What should I do?” The conversation that follows effectively deals with humanity's crucial questions: what is the purpose of life? What happens when we die? Is there a reality beyond this time-bound, physical plane? What is the ultimate cause of all causes? Krishna comprehensively answers all these (and more) and then reveals His own identity as none other than the Supreme Personality of Godhead, appearing on earth to usher in a new era of spiritual understanding.Throughout the Gita Krishna teaches that the essence of all human pursuit – and the ultimate goal of all pious work, meditation, and austerity – is to develop an attitude of loving service to the Supreme Person. His ultimate instruction, \"surrender to Me,\" challenges Arjuna – and any reader of the Bhagavad-gita – to transcend religion and belief and to enter the realm of bhakti – devotional service – which alone can fully satisfy the self.Bhagavad-gita As It Is is unique among Gita commentaries; the author, Srila Prabhupada, represents a line of teachers coming in disciplic succession from Krishna Himself. Prabhupada's clarity, wit, and faithfulness to the original Sanskrit text make the teachings of the Gita easily accessible to the Western reader.Since its publication in 1970, Bhagavad-gita As It Is has become the most widely read edition of the Gita in the world.",
  "genres": [
    "Religion",
    "Spirituality",
    "Philosophy",
    "Nonfiction",
    "Hinduism",
    "Classics",
    "Mythology"
  ],
  "author": "His Divine Grace A.C. Bhaktivedanta Swami Prabhupada",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/22316266-bhagavad-gita-as-it-is"
}