{
  "title": "Men of War: The American Soldier in Combat at Bunker Hill, Gettysburg, and Iwo Jima",
  "description": "In the grand tradition of John Keegan’s enduring classic The Face of Battle comes a searing, unforgettable chronicle of war through the eyes of the American soldiers who fought in three of our most iconic Bunker Hill, Gettysburg, and Iwo Jima.This is not a book about how great generals won their battles, nor is it a study in grand strategy. Men of War is instead a riveting, visceral, and astonishingly original look at ordinary soldiers under fire.Drawing on an immense range of firsthand sources from the battlefield, Alexander Rose begins by re-creating the lost and alien world of eighteenth-century warfare at Bunker Hill, the bloodiest clash of the War of Independence—and reveals why the American militiamen were so lethally effective against the oncoming waves of British troops. Then, focusing on Gettysburg, Rose describes a typical Civil War infantry action, vividly explaining what Union and Confederate soldiers experienced before, during, and after combat. Finally, he shows how in 1945 the Marine Corps hurled itself with the greatest possible violence at the island of Iwo Jima, where nearly a third of all Marines killed in World War II would die. As Rose demonstrates, the most important factor in any battle is the human At Bunker Hill, Gettysburg, and Iwo Jima, the American soldier, as much as any general, proved decisive.To an unprecedented degree, Men of War brings home the reality of combat and, just as important, its aftermath in the form of the psychological and medical effects on veterans. As such, the book makes a critical contribution to military history by narrowing the colossal gulf between the popular understanding of wars and the experiences of the soldiers who fight them.Praise for Men of War“A tour de force . . . strikingly vivid, well-observed, and compulsively readable.” — The Daily Beast“Military history at its best . . . This is indeed war up-close, as those who fought it lived it—and survived it if they could. Men of War is deeply researched, beautifully written.” — The Wall Street Journal“A brilliant, riveting, unique book . . . Men of War will be a classic.” —General David H. Petraeus, U.S. Army (Retired)“The fact is that Men of War moves and educates, with the reader finding something interesting and intriguing on virtually every page.” — National Review“This is a book that has broad value to a wide audience. Whether the reader aims to learn what actually happens in battle, draw on the military lessons within, or wrestle with what actually defines combat, Men of War is a valuable addition to our understanding of this all-too-human experience.” — The New Criterion“A highly recommended addition to the literature of military history . . . [Rose] writes vividly and memorably, with a good eye for the telling detail or anecdote.” — Kirkus Reviews (starred review)“Using the firsthand accounts of brave soldiers who fought for freedom, Rose sheds new light on viewpoints we haven’t heard as widely before. It’s a welcome perspective in an era where most people have no military experience to speak of.” — The Washington Times“Rose poignantly captures the terror and confusion of hand-to-hand combat during the battle.” — The Dallas Morning News“If you want to know the meaning of war at the sharp end, this is the book to read.” —James McPherson, Pulitzer Prize–winning author of The War That Forged a Nation",
  "genres": [
    "History",
    "Military Fiction",
    "Military History",
    "Nonfiction",
    "Civil War",
    "War",
    "American History"
  ],
  "author": "Alexander   Rose",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/22318447-men-of-war"
}