{
  "title": "Dirty Chick: Adventures of an Unlikely Farmer",
  "description": "“One month into our stay, we’d managed to dispatch most of our charges. We executed the chickens. One of the cats disappeared, clearly disgusted with our urban ways. And Lucky [the cow] was escaping almost daily. It seemed we didn’t have much of a talent for farming. And we still had eleven months to go.”Antonia Murphy, you might say, is an unlikely farmer. Born and bred in San Francisco, she spent much of her life as a liberal urban cliché, and her interactions with the animal kingdom rarely extended past dinner.But then she became a mother. And when her eldest son was born with a rare, mysterious genetic condition, she and her husband, Peter, decided it was time to slow down and find a supportive community. So the Murphys moved to Purua, New Zealand—a rural area where most residents maintained private farms, complete with chickens, goats, and (this being New Zealand)  sheep. The result was a comic disaster, and when one day their son had a medical crisis, it was also a little bit terrifying.Dirty Chick chronicles Antonia’s first year of life as an artisan farmer. Having bought into the myth that farming is a peaceful, fulfilling endeavor that allows one to commune with nature and live the way humans were meant to live, Antonia soon realized  that the reality is far dirtier and way more disgusting than she ever imagined.  Among the things she learned the hard Cows are prone to a number of serious bowel ailments, goat mating involves an astounding amount of urine, and roosters are complete and unredeemable assholes.But for all its traumas, Antonia quickly embraced farm life, getting drunk on homemade wine (it doesn’t cause hangovers!), making cheese (except for the cat hair, it’s a tremendously satisfying hobby), and raising a baby lamb (which was addictively cute until it grew into a sheep). Along the way, she met locals as colorful as the New Zealand countryside, including a seasoned farmer who took a dim view of Antonia’s novice attempts, a Maori man so handy he could survive a zombie apocalypse, and a woman proficient in sculpting alpaca heads made from their own wool.'Part family drama, part cultural study, and part cautionary tale, Dirty Chick will leave you laughing, cringing, and rooting for an unconventional heroine.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Humor",
    "Audiobook",
    "Animals",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Antonia Murphy",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/22323933-dirty-chick"
}