{
  "title": "Listful Thinking: Using Lists to Be More Productive, Successful and Less Stressed",
  "description": "Named one of Oprah.com's \"Self-Help Books That Actually Help\" \"Building and maintaining an 'external brain' for navigating our world is critical for a sustainable lifestyle. Paula Rizzo has written a fun and useful manifesto for off-loading the job of remembering and reminding, to free up your head's bandwidth to be focused on more meaningful stuff.\"--David Allen International Best-Selling Author,  Getting Things the Art of Stress-Free Productivity\"Those of us who love making lists have been waiting for a terrific book like Listful Thinking to feed our obsession. It's practical, funny, and thought-provoking, and will inspire readers to use list-making themselves--both to get more done and have more fun.\"--Gretchen Rubin, author of the #1 New York Times and international bestseller The Happiness Project\"There's something so gratifying about writing out a list and scratching tasks off. Listful Thinking incorporates list making at work, home and play so you can be less overwhelmed and enjoy your life.\"--Julie Morgenstern, Productivity Expert and NY Times Bestselling Author of Time Management From the Inside OutFor more tips and tricks go to listproducer.com/starterkit What do Madonna, Martha Stewart, John Lennon, Ellen DeGeneres, Ben Franklin, Ronald Reagan, Leonardo da Vinci, Thomas Edison, and Johnny Cash have in common? Each is (or was) a list maker. These successful people, along with CEOs and successful entrepreneurs, all use lists to keep track of their ideas, thoughts, and tasks. Finding enough hours in the day to get everything accomplished and allow for some downtime can be a struggle. It's no wonder so many of us are stressed, overextended, and exhausted. More than half of all American employees feel overwhelmed, according to a study by the nonprofit Family and Work Institute. For the 54 percent of us who feel like we're chasing our own tails, Listful Thinking is here to prove that it doesn't have to be that way. You can still find time to relax, read a good book, and do the things you love.Listful Thinking is the book that will give readers their lives back with indispensable tips on saving time, getting organized, improving productivity, saving money, and reducing stress.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Productivity",
    "Audiobook",
    "Business",
    "Personal Development",
    "Adult"
  ],
  "author": "Paula Rizzo",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/22324027-listful-thinking"
}