{
  "title": "War Dogs: Tales of Canine Heroism, History, and Love",
  "description": "*A New York Times Best Seller*Under the cover of night, deep in the desert of Afghanistan, a US Army handler led a Special Forces patrol with his military working dog. Without warning an insurgent popped up, his weapon raised. At the handler's command, the dog charged their attacker. There was the flash of steel, the blur of fur, and the sound of a single shot; the handler watched his dog take a bullet. During the weeks it would take the dog to heal, the handler never left its side. The dog had saved his life. Loyal and courageous, dogs are truly man's best friend on the battlefield. While the soldiers may not always feel comfortable calling the bond they form love, the emotions involved are strong and complicated.In War Dogs, Rebecca Frankel offers a riveting mix of on-the-ground reporting, her own hands-on experiences in the military working dog world, and a look at the science of dogs' special abilities-from their amazing noses and powerful jaws to their enormous sensitivity to the emotions of their human companions. The history of dogs in the US military is long and rich, from the spirit-lifting mascots of the Civil War to the dogs still leading patrols hunting for IEDs today. Frankel not only interviewed handlers who deployed with dogs in wars from Vietnam to Iraq, but top military commanders, K-9 program managers, combat-trained therapists who brought dogs into war zones as part of a preemptive measure to stave off PTSD, and veterinary technicians stationed in Bagram. She makes a passionate case for maintaining a robust war-dog force. In a post-9/11 world rife with terrorist threats, nothing is more effective than a bomb-sniffing dog and his handler. With a compelling cast of humans and animals, this moving book is a must read for all dog lovers-military and otherwise.",
  "genres": [
    "Nonfiction",
    "Animals",
    "History",
    "Dogs",
    "Military Fiction",
    "War",
    "Military History"
  ],
  "author": "Rebecca  Frankel",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/22319937-war-dogs"
}