{
  "title": "Black Machetes",
  "description": "2015 Eric Hoffer Award Finalist!Violence and impending hope collide in Ryan K. Howard’s edgy, controversial, and addictive debut: Black MachetesFor two evil psychopaths, horror is a delectable hobby...For a good-hearted kid, life is little more than abuse in motion...And for anyone fateful enough to intersect the three, even God won't be able to help.Black Machetes is a powerful, page-turning psychological thriller—at times both shocking and endearing—written with gritty cinematic tones that paint a painfully intimate portrait of a world framed by abuse, tragedy, and inhibited love.What reviewers are saying...\"This book in its entirety is a gritty and compelling tale of triumph in the face of adversity, and the horrors that some have to deal with and overcome to get there.\" —The Bookie Monster @ Amazon\"I could not put this book down. It was believable, heartbreaking, funny, tragic and heartwarming.\" —Donna @ Goodreads\"This book is a 'page turner' - I couldn't put it down - the style of writing was clear and sharp, and the story well-woven.\" —Lorna Kennedy @ GoodreadsBook Synopsis...Benjamin Wilder grew up with sparse shelter, infested provisions, and constant abuse dealt to him by his stepfather: Jessup—a.k.a. the Rabid Dog. Without a sober mother to defend him from the Rabid Dog’s wrath, Ben finds reprieve and adventure in a club of misfit boys called the Black Machetes. But the world as Ben knows it comes to an end when he witnesses an act so psychologically appalling that it forces him to run for his life. He travels as far away as he can until fate steps in and guides him to a small town where he finds the help he needs to assume a new identity and live a life he could only imagine before.Years after trying to bury the demons from his past, Ben seems to finally settle into a sense of normalcy. But his world continually gets turned upside-down by a series of discoveries, revealing that the evil from his childhood has never stopped cursing him—having over the years destroyed everyone he ever cared for. When the ticking time-bomb within Ben’s psyche finally detonates with a fumed vengeance, it pushes his wife and unborn child into the very clutches of the same malevolence that has forever haunted him. In the end, Ben must again face those demons from his past in order to save his true love, and ultimately his own sanity.",
  "genres": [
    "Audiobook",
    "Thriller"
  ],
  "author": "R.K. Howard",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/22324492-black-machetes"
}