{
  "title": "The Fate of Vultures",
  "description": "\"Whatever happens, it won't be the end...\" \nDelve into the brand new realm of Prenitia, with the first in the new Of Preludes & Epitaphs series...\n\n\n\"Full to the brim with magic and wonder…”\"This book is quite extraordinary, it is a breath of fresh air...\"“This story is pure magic, and I’m very pleased to learn there’s more still to come…”“No book has engrossed me so much since Frank Herbert’s ‘Dune’.\n\n\n___________________________________________________________________________________\n\n Delve into the brand new realm of Prenitia, with the first in the new Of Preludes & Epitaphs series... Telena knows she’s special. Her brother, Aznee, sees things differently. But as Telena engrosses herself with the ancient books from the library, Aznee discovers maybe there is more to his sister’s future than he can imagine.Within the pages Old Prenitia burns. In the hands of a usurper king and an evil necromancer, the vulnerable settlements are wiped out, and loyal minister, Keno, is running out of time to stop them.Shy outcast Leyna and cheery carpenter Murray find their blossoming love affair torn apart by desolation, leaving Leyna forced to travel alone with Murray’s contemptuous brother, Adri. While their fate is claimed by a mysterious sorceress, Murray, and warrior Cora, are both haunted by their pasts as deeper challenges and long-held secrets tarnish their journey.Can they maintain solidarity and search for a saviour in the presence of the unbelievable? Will any of them truly be able to pull Prenitia from this darkest of times?Take up your sword for the brand new epic fantasy series, and prepare for The Fate of Vultures - the battles of magic have just begun...When Telena delved into the dusty books she could never have guessed her own dark journey with these mythical names had but begun. Take up your sword for the brand new epic fantasy series, and prepare for The Fate of Vultures - the battles of magic have just begun...",
  "genres": [
    "Fantasy"
  ],
  "author": "Jessica O'Toole",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22328392-the-fate-of-vultures"
}