{
  "title": "Another Thing to Fall",
  "description": "The California dream weavers have invaded Charm City with their cameras, their stars, and their controversy. . . .  When private investigator Tess Monaghan literally runs into the crew of the fledgling TV series \"Mann of Steel\" while sculling, she expects sharp words and evil looks, \"not\" an assignment. But the company has been plagued by a series of disturbing incidents since its arrival on location in Baltimore: bad press, union threats, and small, costly on-set \"accidents\" that have wreaked havoc with its shooting schedule. As a result, \"Mann's\" creator, Flip Tumulty, the son of a Hollywood legend, is worried for the safety of his young female lead, Selene Waites, and asks Tess to serve as her bodyguard/babysitter. Tumulty's concern may be well founded. Not long ago a Baltimore man was discovered dead in his own home, surrounded by photos of the beautiful, difficult superstar-in-the-making.  In the past, Tess has had enough trouble guarding her \"own\" body. Keeping a spoiled movie princess under wraps may be more than she can handle--even with the help of Tess's icily unflappable friend Whitney--since Selene is not as naive as everyone seems to think, and far more devious than she initially appears to be. This is not Tess's world. And these are not her kind of people, with their vanities, their self-serving agendas and invented personas, and their remarkably skewed visions of reality--from the series' aging, shallow, former pretty-boy leading man to its resentful, always-on-the-make cowriter to the officious young assistant who may be too hungry for her own good.  But the fish-out-of-water P.I. is abruptly pulled back in by an occurrence she's all too familiar with--murder. Suddenly the wall of secrets around \"Mann of Steel\" is in danger of toppling, leaving shattered dreams, careers, and lives scattered among the ruins--a catastrophe that threatens the people Tess cares about . . . and the city she loves.",
  "genres": [
    "Mystery",
    "Fiction",
    "Audiobook",
    "Crime",
    "Mystery Thriller",
    "Detective",
    "Suspense"
  ],
  "author": "Laura Lippman",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/2233838.Another_Thing_to_Fall"
}