{
  "title": "Regan's Reach",
  "description": "Young Kiwi tech entrepreneur Regan Stein has just sold ten percent of her company for a massive price. The buyer, aerospace and defence giant USDynamics wants a share of Arteis, her new cyber defence system. Plus they've picked out Regan as a fresh creative genius and want in on whatever she has planned next.Washed out from negotiations and cash rich Regan decides to take a break for six months and freshen up her thinking. Tramping off track, at the top of New Zealand’s South Island, she accepts a Satphone appeal for help from an unknown caller. Doing the right thing finds her the rescuer of a comatose man, human but yet strangely alien. Within hours her life has changed.While in orbit at the mercy of a quirky artificial intelligence and acting as nursemaid to the injured alien she finds out traitorous moves have been made against her company by foreign business powers. Trapped on the ship she is unable to fight back and instead embarks on the journey of a lifetime, assisting the AI to return the man while leaving her trusted team to deal with the attack at home. The two month interstellar journey sees a growing relationship with the AI and a formidable partnership developing. They arrive at their destination in the midst of a political crisis. Meanwhile, at home on earth her team have their own problems. They find themselves collateral damage in a corporate war full of intrigue, murky politics, and betrayal.Will Regan survive the trip across the galaxy? How will her friends deal with the threats? Will her company survive the attack? And who would want to be in Regan Stein's sights if she returns at all?This is classic science fiction, the first part of a series that includes technology, androids, interstellar travel, action, politics and mystery. The series tracks sixteen years in the life of the remarkable Regan Stein and her friends. It will entertain you, challenge you and provoke your thinking on everything from the nature of the human heart to the nature of evil.Review By Heinz Zwack on June 10, 2014 Kindle Edition Verified PurchaseWith the Renaissance of space opera that indie publishing and e-books brought about this is refreshingly different. It is space fiction with lots of action and lots of exotic technology - but not the usual rehash of space battles and Galactic empires.In almost 60 years of reading science fiction - probably 2000 or 3000 books and at least as many stories in the Golden age of SF magazines - I haven't found a character like Ham very often. He certainly beats \"Hal\" of 2001 hands-down.5.0 out of 5 A sorely needed new heroineReview by M Travison August 19, 2014 Kindle Edition|Verified PurchaseI think this was a terrific beginning to a new series but more importantly a new heroine for the scifi genre. It's also refreshing to read an intelligent scifi novel without galactic space battles or alien earth invasions. Regan is by no means a genius but she's ambitious, focused, assertive and especially knows how to assemble a good team to make her dreams reality.",
  "genres": [
    "Science Fiction",
    "Amazon"
  ],
  "author": "Mark G. Brewer",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/22331515-regan-s-reach"
}