{
  "title": "Whispering Wind",
  "description": "Bound by destiny and a love that conquers all, with an oath sworn in blood…Born of a unique race called Gaias, sixteen-year-old Taryn Malone has been blessed with extraordinary abilities, including one that was believed to have been eradicated centuries ago. This gift must remain hidden, or her entire species will perceive her as a threat. Upon her move to Williams, Arizona the woods on the mountainside become a refuge, the place where she can let her power flow free. Skin Walker, Larkin Taylor has dreamt of the same girl since his twelfth birthday. While on a run in his wolf form, he catches the scent of something overwhelmingly powerful. When Larkin comes face-to-face with his dream girl, he is astounded to find that she is real. Desperate to be close to her, he joins her as the wolf where he witnesses first-hand the true depths of her gifts. Though he should destroy her for what she is, he finds himself struggling with a fierce need to protect her and the secrets she harbors. His own secrets are threatened when his former best friend bumps into Taryn at the local café. Keiryn Falcon is instantly smitten with the new girl in town when sparks, quite literally, fly between the two as she brushes past him. The moment she is out of sight he takes to the skies in hawk form to follow. When he spies Larkin jumping down from her bedroom window, Keiryn sees nothing but red, knowing what kind of a monster lurks within the black dog. Bearing the physical scars that Larkin inflicted on him five years ago, Keiryn pledges to keep Taryn from falling victim to the same fate.While her heart wages a constant war between the boy that is bound to protect her and the one she shares a deep, inexplicable connection with; who will she choose, and will that choice destroy them all?",
  "genres": [
    "Fantasy",
    "Magic",
    "Supernatural",
    "Romance",
    "Young Adult"
  ],
  "author": "Karin Reeve",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/22328309-whispering-wind"
}