{
  "title": "Lion's Honor",
  "description": "Sometimes the Queen of the Jungle needs to lean on her King. Okay, she’s really not the queen and he’s totally not the king, but damn it, they need each other.  Four years ago, werelioness Honor Mauer walked away from Ridgeville and hopped on a plane bound for London. She had college dreams and none of them included her pesky maybe-mate Grayson. (Even if he is the hottest thing to ever walk on two legs—and four.)  All is fantastically furry in London until she goes through her first heat. Then her world collapses, her bright, obnoxious eyes dim, and she runs home with her tail tucked between her legs. Too bad the London werelion who sent her scurrying home decides to show up just as she’s feeling a little less psychotic. Bastard.  Werelion Grayson got his curvy, luscious mate back on U.S. soil and he refuses to let her go. He knows there’s a lot of emotional work to do, but he didn’t become Ridgeville’s Second by turning belly up at the first sign of trouble. She’s his. The quicker she realizes that—and opens her heart to healing—the better. He’s got a plan for a life filled with love, laughter, and cubs and it sorta requires her cooperation.  Just when he thinks her recovery is around the corner, the male who’d hurt Honor shows up in Ridgeville. Which is a good thing, really, since it gives Grayson a chance to kill him. It’s like Christmas in July.  Warning: Once again the bad guys are bad (and bloody, ew) and the good guys are good… And somewhere along the way the good guy and the battered gal find love. (Awww…)  Part of the \"Ridgeville\" series: *FREE* He Ain't Lion - Available Individually (FREE) and in Ridgeville Series Volume One You're Lion - Available Individually and in Ridgeville Series Volume One Ball of Furry - Available Individually and in Ridgeville Series Volume One Head Over Tail - Available Individually and in Ridgeville Series Volume Two Fierce in Fur - Available Individually and in Ridgeville Series Volume Two Deuces Wild - Available Individually and in Ridgeville Series Volume Two Sealed with a Purr *FREE* Like a Fox Big Furry Deal Lion's Honor",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Shapeshifters",
    "Romance",
    "Erotica",
    "Fantasy",
    "Humor"
  ],
  "author": "Celia Kyle",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/22341711-lion-s-honor"
}