{
  "title": "Orthodox Christianity: The History and Canonical Structure of the Orthodox Church",
  "description": "Foreword by His Holiness Alexei II, Patriarch of Moscow and All RussiaTranslated from the Russian by Basil BushThis is the first volume of a detailed and systematic expositionof the history, canonical structure, doctrine, moral andsocial teaching, liturgical services, and spiritual life of theOrthodox Church. The purpose of this series is to presentOrthodox Christianity as an integrated theological and liturgicalsystem, in which all elements are interconnected. Theology isbased on liturgical experience, and church art including icons,singing, and architecture is shaped by theology and the liturgy.Theology and the services, in their turn, influence the asceticpractice and the personal piety of each Christian; they shape themoral and social teaching of the Church as well as its relationto other Christian confessions, non-Christian religions, and thesecular world.This volume begins with an account of the historical arc ofthe Orthodox Church during the first ten centuries afterChrist s nativity, when the Christians of the east and west shareda common history. In examining the second millennium, theauthor, a hierarch of the Russian Orthodox Church, delvesdeeply into the life of Christianity in Russia, providing a casestudy, as it were, of how Orthodoxy can infuse the literature, art,and philosophy of an entire culture. He then goes on to discussthe canonical structure of the Orthodox Church, describing theemergence and development of diocesan structures, metropolias,and patriarchates, as well as the contemporary structure ofworld Orthodoxy and the principle of canonical territory, which forms the basis of inter-Orthodox relations.",
  "genres": [
    "Religion",
    "Christianity",
    "Theology",
    "History",
    "Nonfiction"
  ],
  "author": "Hilarion Alfeyev",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/11304732-orthodox-christianity"
}