{
  "title": "Miss Armistead Makes Her Choice",
  "description": "Miss Elizabeth Armistead, India born and raised, is happily betrothed to British soldier, Duncan Cruikshank. When she arrives in London a month prior to the wedding she meets Mr. Lloyd-Jones and soon finds that he has invaded even her dreams. Besides Duncan, Mr. Lloyd-Jones is the only man who makes her feel as if he sees past her exceptional beauty to the person within. Her mother would prefer Elizabeth marry the rich and well-connected Mr. Lloyd-Jones while his sister is ecstatic that he is now free to woo Miss Armistead since he has broken off his engagement to the disgraceful Cecily Ponsonby. However, Elizabeth's commitment to the man she promised to marry is at odds with the likes of Mr. Lloyd-Jones who has cried off from one engagement already. How can she betray the man she believes to love her for her virtues so as to indulge her love for a man she fears she cannot trust? Jaded and betrayed, Mr. Colin Lloyd-Jones and Sir Anthony Crenshaw make a solemn vow to avoid the Marriage Mart for the duration of the London season. When Sir Anthony is called away on a journey in the company of his grandmother's ward, Miss Delacourt, Colin finds he cannot abide by their agreement, especially when his father expects him to squire his sister to society's endless balls and routs. When Colin encounters the breathtakingly beautiful Miss Elizabeth Armistead, he is intrigued by her lack of fascination for his great standing in society, family fortune, and captivating charm. When he learns that she is already betrothed, he feels himself safe from hurt in her company until he discovers the secret she has been guarding, one that threatens to batter his vulnerable heart all past mending.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Regency",
    "Historical",
    "Historical Fiction",
    "Clean Romance",
    "Fiction"
  ],
  "author": "Heidi Ashworth",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/22344914-miss-armistead-makes-her-choice"
}