{
  "title": "Benimle Kal",
  "description": "Kapı savrularak açıldı. Amelia gölgelerin değiştiğini, odanın içinde birinin varlığını hissetti. Korkuyla döndüğünde Cam Rohan’ın kapıda durduğunu gördü. Kalbi müthiş bir güçle atmaya başladı. Rohan bir rüyadan fırlamış gizemli bir hayalet gibiydi. Yavaşça kıza yaklaştı. O yaklaştıkça Amelia etrafındaki her şeyin yerinden söküldüğünü, uzaklaştığını, onu her tehlikeye açık ve savunmasız bıraktığını hissediyordu. Uzun bir sessizlikten sonra Cam nihayet konuştu. “Romanlar seni çağıran yoldan gitmeni, hiç arkana bakmamanı söyler. Çünkü seni ne gibi maceraların beklediğini bilemezsin.” Hiç beklenmeyen bir miras ailesini sosyetede bir üst seviyeye taşıdığında, Amelia Hathaway, genç kız kardeşlerine ve dik başlı erkek kardeşine göz kulak olmanın, bu mirasın getirdiği karmaşayla ilgilenmekten çok daha kolay olduğunun farkına varır. Bütün bunlarının yanı sıra onu uğraştıran başka bir sorun daha vardır: uzun boylu, esmer ve tehlikeli bir şekilde yakışıklı olan Cam Rohan’a karşı hissettiği çekim. Çoğu erkeğin ancak hayal etmekle sınırlı kalabileceği kadar varlıklı olan Cam, toplumun kısıtlamalarından sıkılmıştır ve “uygarlaşmamış” Çingene köklerine dönmeyi arzu etmektedir. Güzel Amelia ona yardım teklif ettiğinde, Cam öncelikle sadece arkadaş olmak niyetindedir fakat bu niyetlerin ikisini de kör eden tutku tarafından yıkılması uzun sürmez. Fakat gelenekleri katiyetle reddeden bir adam tüm zamanlatın en gelenekselleşmiş düzenine, evliliğe de hayır diyebilecek midir? New York Times gazetesinin en çok satan kitaplar listesinin gözde yazarlarından Lisa Kleypas, geleneklere kafa tutan iki âşığın büyüleyici ve baştan çıkarıcı hikâyesiyle ayaklarınızı yerden kesecek. “Gerçekten yetenekli bir öykücü.” – Publishers Weekly",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Adult",
    "Fiction"
  ],
  "author": "Lisa Kleypas",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/11304591-benimle-kal"
}