{
  "title": "Alexis in America: A Russian Grand Duke's Tour, 1871-1872",
  "description": "In the autumn of 1871, Alexis Romanov, the fourth son of Tsar Alexander II of Russia, set sail from his homeland for an extended journey through the United States and Canada. A major milestone in U.S.-Russia relations, the tour also served Duke Alexis's family by helping to extricate him from an unsuitable romantic entanglement with the daughter of a poet. Alexis in America recounts the duke's progress through the major American cities, detailing his meetings with celebrated figures such as Samuel Morse and Henry Wadsworth Longfellow and describing the national self-reflection that his presence spurred in the American people.The first Russian royal ever to visit the United States, Alexis received a tour through post-Civil War America that emphasized the nation's cultural unity. While the enthusiastic American media breathlessly reported every detail of his itinerary and entourage, Alexis visited Niagara Falls, participated in a bison hunt with Buffalo Bill Cody, and attended the Krewe of Rex's first Mardi Gras parade in New Orleans. As word of the royal visitor spread, the public flocked to train depots and events across the nation to catch a glimpse of the grand duke. Some speculated that Russia and America were considering a formal alliance, while others surmised that he had come to the United States to find a bride.The tour was not without many city officials balked at spending public funds on Alexis's reception, and there were rumors of an assassination plot by Polish nationals in New York City. More broadly, the visit highlighted problems on the national level, such as political corruption and persistent racism, as well as the emerging cultural and political power of ethnic minorities and the continuing sectionalism between the North and the South. Lee Farrow joins her examination of these cultural underpinnings to a lively narrative of the grand duke's tour, creating an engaging record of a unique moment in international relations.",
  "genres": [
    "Russia"
  ],
  "author": "Lee A. Farrow",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/22351333-alexis-in-america"
}