{
  "title": "Never Call Retreat: Lee and Grant: The Final Victory",
  "description": "New York Times bestselling authors Newt Gingrich and William R. Forstchen conclude their inventive trilogy with this remarkable answer to the great “what if” of the American Civil War: Could the South have indeed won?\nAfter his great victories at Gettysburg and Union Mills, General Robert E. Lee’s attempt to bring the war to a final conclusion by attacking Washington, D.C., fails. However, in securing Washington, the remnants of the valiant Union Army of the Potomac, under the command of the impetuous General Dan Sickles, is trapped and destroyed. For Lincoln there is only one hope left: that General Ulysses S. Grant can save the Union cause.It is now August 22, 1863. Lincoln and Grant are facing a collapse of political will to continue the fight to preserve the Union. Lee, desperately short of manpower, must conserve his remaining strength while maneuvering for the killing blow that will take Grant’s army out of the fight and, at last, bring a final and complete victory for the South.Pursuing the remnants of the defeated Army of the Potomac up to the banks of the Susquehanna, Lee is caught off balance when news arrives that General Ulysses S. Grant, in command of more than seventy thousand men, has crossed that same river, a hundred miles to the northwest at Harrisburg. As General Grant brings his Army of the Susquehanna into Maryland, Robert E. Lee’s Army of Northern Virginia maneuvers for position. Grant first sends General George Armstrong Custer on a mad dash to block Lee’s path toward Frederick and with it control of the crucial B&O railroad, which moves troops and supplies. The two armies finally collide in Central Maryland, and a bloody week-long battle ensues along the banks of Monocacy Creek. This must be the “final” battle for both sides.In Never Call Retreat, Newt Gingrich and William Forstchen bring all of their critically acclaimed talents to bear in what is destined to become an immediate classic.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Alternate History",
    "Civil War",
    "War",
    "Military Fiction",
    "American Civil War"
  ],
  "author": "Newt Gingrich",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/223585.Never_Call_Retreat"
}