{
  "title": "Amazons: The Forgotten Tribe",
  "description": "Amazons the Forgotten Tribe tells the secrets of sexual attractions and the truth about being gay. This nonfiction book is a HETEROSEXUAL'S JOURNEY into the gay and lesbian world to understand sexuality in all its complexity, and, surprisingly, simplicity. Includes twelve personal stories, the author's journal, a TIME LINE social and legal history of homosexuality and the prejudice against it. The biology and genetics of sexuality, the BIBLE and sexuality, and more. Eleven charming full-page ink drawings by Chris Briscoe illustrate the stories. Includes a GLOSSARY of the vocabulary of the gay community. Why are men fascinated with Amazons? Do they exist? What does a man want in a woman? Why are heterosexual men attracted to lesbians? Learn about the mysterious relationships between the sexes -- heterosexuals and homosexuals. What is it like to find out you're married to a gay man? How many sexes are there? Read about GENDERBLENDS. Lesbian women and gay men tell their how they discovered their sexuality and their private lives and feelings. Meet the tough CEO of her own company, the ex-Mother Superior, the grandmother, Sally who's painfully in the closet, and Ted who finds true love after a disastrous year. This book tells the real causes of homosexuality (not your relationship with your father) and the pain of being without a family. Understand your lesbian daughters and gay sons. A new look at the Bible and homosexuality. We all relate to each other sexually we need to understand the truth about sexuality. All your questions answered. Mattson asks the questions you want to ask. This positive and objective book has been enthusiastically received by both heterosexual and homosexual readers, clergy, and the full age-spectrum of readers from teenagers to people in their nineties.",
  "genres": [],
  "author": "Martha Mattson",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/2236118.Amazons"
}