{
  "title": "The Pustoy",
  "description": "Britain, in the mid 21st century.A new prime minister, Lev Solokov is elected. In spite of his Russian surname, he is the charismatic politician who, on the surface, appears to be just what Britain needs.But he’s not what Gavin needs. Gavin is a Pustoy, a human who, among countless others, Solokov’s researchers has declared a soulless, subhuman race. Solokov joins a dark lineage of genocidal tyrants that have gone before him. In synthesizing his own race to persecute others, perhaps he has succeeded in a horror more insidious than any of his forebears, especially as he appears to have done so with both overhwhelming public blessing and encouragement.Or at least he would have, if not for the increasing din of the Pustoy protesting outside his offices. Chosen at random owing to his position as a forefront campaigner for the rights of the Pustoy, Gavin is framed for a crime he didn’t commit and is forced to go on the run, and so Solokov in one fell swoop kills any budding sympathy the people may have had for the Pustoy, and would appear to have silenced one of his loudest protestors.Just who are the Pustoy of this world? The persecutors or the persecuted? Will Gavin remain a hunted scapegoat? Is Solokov acting for the greater good; are the Pustoy really devoid of a soul? More importantly, how far away is this future, really?Phillipe Blenkiron’s conceptual poetry collection demands these questions of the reader, whilst offering an unflinching examination of the human psyche, exploring the clouded moral hues between black and white, between right and wrong, that exist inside all of us.For fans of \"1984\", \"Brave New World\", and other greats of dystopian fiction, Philippe Blenkiron's debut poetry collection is shocking, unsettling, and closer to real-life than we dare admit...",
  "genres": [
    "Poetry"
  ],
  "author": "Philippe Blenkiron",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/22353105-the-pustoy"
}