{
  "title": "Pearl Harbor",
  "description": "President Franklin D. Roosevelt's speech on December 8, 1941, lasted a mere six and half minutes. But his words and tone--in a monologue that would later be named the Infamy Speech--sent ripples into a nation and a world that continue even today. The historical implications that emerged from the Japanese attack on Pearl Harbor were unprecedented, launching America not only into the depths of a dangerous war, but forever altering the safety and comfort of everyday living. December 8th became a day of speaking out publicly and declaring war; of action, battle, plotting, and victories. This date's significance is resonant and profound as an indelible moment in American history.Fresh from their series on the American Civil War, bestselling authors Newt Gingrich and William R. Forstchen now launch a new epic adventure by applying their imaginations and knowledge to the \"Date of Infamy\"--the attack on Pearl Harbor.Pearl Harbor covers the full spectrum of characters and events from that historic moment, from national leaders and admirals to the views of ordinary citizens caught in the chaos of war. From the chambers of the Emperor of Japan to the American White House, from the decks of aircraft carriers to the playing fields of the Japanese Naval Academy, this powerful story stretches from the nightmare slaughter of China in the 1930s to the lonely office of Commander James Watson, an American cryptographer, who suspects the impending catastrophic attack. It is a story of intrigue, double-dealing, the horrific brutality of war, and the desperate efforts of men of reason on both sides to prevent a titanic struggle that becomes inevitable.Gingrich and Forstchen's now critically acclaimed approach, which they term \"active history,\" examines how a change in but one decision might have profoundly altered American history. In Pearl Harbor, they pose the question of how the presence of but one more man within the Japanese attacking force could have transfigured the war. More than a retelling, the book also serves as a potent warning, valid still today as an example of what happens when communications and understanding breaks down, and a nation is ill-prepared for the onslaught that might ensue.A compelling, meticulously researched saga, Pearl Harbor  is also a novel of valor about those who took part in this cataclysmic moment in world history. It inaugurates a dramatic new Pacific War series that begins with the terrifying account of the day that started it all.Praise for Pearl Harbor:\"A politician and a novelist, each an accomplished historian in his own right, are emerging as  master authors of alternative history. In this 'what if' treatment of the attack on Pearl Harbor, Newt Gingrich and William Forstchen combine their talents to make the diplomacy as suspenseful as the combat, even for readers who know what happens next---or think they know. The authors' mastery of both the broad sweep of events and the details of naval war and military technology give their counterfactual scenarios an unusual degree of plausibility, concluding with a version of the Japanese attack that guarantees a fictional Pacific war even more terrible than the one that began on December 7, 1941.\"-- Dennis Showalter, former president of the Society of Military Historians\"The book is not only a great read, it is a fascinating historical story that applies today in Iraq as it did in the Western Pacific in the late '30s and '40s.\"---Captain Alex Fraser (Ret.) \"Gingrich and Forstchen have done it again. Building on their successful collaboration on their Civil War trilogy that so skillfully combined real history with fiction, they have with Pearl Harbor happily inaugurated another new series.  You will not want to put it down, but when you finish you will look, as I do, with great anticipation to the next book.\"---Chief of Police William J. Bratton, Los Angeles Police Department \"Masterful storytelling that not only captures the heroic highs and hellish lows of that horrific day which lives on in infamy---it resonates with today's conflicts and challenges.\"---William E. Butterworth IV, New York Times Best-selling Author of The Saboteurs",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Alternate History",
    "World War II",
    "Historical",
    "War",
    "Military Fiction"
  ],
  "author": "Newt Gingrich",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/223584.Pearl_Harbor"
}