{
  "title": "Die Liste",
  "description": "Das hatte Willie Traynor sich gänzlich anders vorgestellt. Dank einer Finanzspritze seiner reichen Großmutter war der Bettelstudent über Nacht zum Besitzer der Ford County Times aufgestiegen, einem harmlosen Bezirksblättchen in Clanton, Mississippi. Dessen Nachrichtenwert erschöpfte sich in aller Regel in blumigen Nachrufen auf lokale Verblichene. Als die Times 1970 vor dem Ruin stand, sah sich Willie bereits als neuen Citizen Kane. Und tatsächlich -- kaum 14 Tage nach seinem Amtsantritt wird eine hübsche junge Witwe vor den Augen ihrer Kinder vergewaltigt und brutal ermordet. Die Auflage boomt, denn Danny Padgitt, jüngstes und schwärzestes Schaf einer Schurkenfamilie, die den gesamten County kontrolliert, steht unter Tatverdacht. Jetzt sollte der neue Chefredakteur Sitten und Gebräuche der Südstaaten erst richtig kennen lernen!In epischer Breite und zuweilen etwas zähem Erzählfluss kehrt Grisham auf vertrautes Terrain zurück: den Gerichtssaal. Willie, dem journalistischen Greenhorn aus dem Norden erschließt sich ein Südstaatensumpf, in dem Rassismus und Selbstjustiz zum gelebten Alltag gehören. Die schwarze Bevölkerung haust \"auf der anderen Seite der Bahnlinie\", während die millionenschwere Padgitt-Familie seit Generationen von ihrer Inselfestung aus Schwarzbrennerei, Mord und Drogenschmuggel im großen Stil betreibt. Nichts leichter also, als den \"Ausrutscher\" ihres jüngsten Sprosses mittels Geld und Repressalien aus der Welt zu schaffen.Eine der Schlüsselfiguren des Romans ist die kluge und bibelfeste Miss Callie, Willie Traynors mütterliche Freundin. Trotz heftigen Widerstands wird sie im Padgitt-Prozess als erste Schwarze in den Geschworenenstand berufen. Ist es ihren moralischen Skrupeln anzulasten, das Danny Padgitt schließlich der Todesstrafe entging? Nach lediglich neun Jahren luxuriösester Haftumstände, beginnt der Horror nach Ford County zurückzukehren. Jedem der damals im Gerichtssaal Anwesenden klingt Danny Padgitts Fluch in den Ohren, bittere Rache zu nehmen. Bald gibt es die ersten Toten. Und die Liste der Geschworenen von einst ist lang!",
  "genres": [
    "Fiction",
    "Thriller",
    "Mystery",
    "Crime",
    "Legal Thriller",
    "Suspense",
    "Mystery Thriller"
  ],
  "author": "John Grisham",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/1130595.Die_Liste"
}