{
  "title": "Status: The Game",
  "description": "The Game Too Dangerous To Stop Playing!If you enjoy suspense, thrilling action and high stakes drama, then you will enjoy reading \"Status The Game!\" Author Vincent Robert Annunziato seamlessly guides readers through a landscape where virtual reality trumps real life and popularity is the only thing worth living for.\"A must read for every high schooler in America.\" *Click NOW and get in the Game!If you enjoy suspense, thrilling action and high stakes drama, then you will enjoy reading \"Status The Game!\" Author Vincent Robert Annunziato seamlessly guides readers through a landscape where virtual reality trumps real life and popularity is the only thing worth living for.Bob Brooks is down on his luck. He ekes out a living as a substitute teacher and grabs odd jobs to make ends meet. It's never enough though and desperation sets in. Partly his fault, Bob is an overgrown kid at heart, dreaming of the day he can dedicate his life to full time gaming. It's selfish, but games are a calling.... And teaching? Just a bridge to something else. Life goes from bad to worse until Bob reads about a new internet game called Status. The internet sensation promises money, prizes and popularity to players who succeed. Bob marvels at the prospects and perfects a plan. Teach students about the internet while playing Status and have students build up his points in the game. With a never-ending supply of incoming, naïve teenagers, it's perfect. Madison High is perfect too. Affluent, hi tech and filled with students who have money and time. Even better? The Principal thinks he's cute and loves his proposal on Status. Once Bob debuts at Madison, though, he finds out that great plans aren't always so great. Especially once he learns his students are already playing Status and they are better at it than him.Everyone is suspect in this thrilling adventure of social battles that pits brains versus brawn and haves versus have nots. Find out who wins! Oh and by the way, obtaining enough status might just make you the next big star of the internet. With fame and fortune just a rumor away, who wouldn't want to play... \"Status?\"Stay Strong! Stay Loyal!",
  "genres": [
    "Romance"
  ],
  "author": "Vincent Robert Annunziato",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/22366373-status"
}