{
  "title": "My Lord",
  "description": "Priceless paintings… Done in a master’s hand… Revealed two centuries after they were created…A collection of paintings are complicating Ivan Everley's life in ways he never could've imagined a few months ago.More accurately, it's the gorgeous art specialist from the University of London responsible for the \"it's complicated\" on his socials. But that's okay with him...Because before Gabrielle appeared at his doorstep one dark and stormy summer night? He. Never. Felt. This. Good.The fiery art historian has turned his world completely upside down, and she's done it all while capturing his wounded heart.But Gabrielle is sporting a wounded heart of her own, and she’s terrified of risking it again.Will he hurt her as others have done? Or is Ivan Everley a lot more than the aristocratic playboy he appears in the tabloids?Gabrielle will need to discover exactly who Ivan, the man, is for herself.But their future isn't set, and there is some serious trouble afoot...because Lord Rothvale's art collection presents more mysteries with every painting Gabrielle discovers tucked away inside his private sanctuary along the North Irish coast.As Gabrielle delves deeper into her work, Ivan is hoping the mystery behind his paintings takes her a very long time to solve so he can keep her tucked away inside his private sanctuary along the North Irish coast...with him, forever.Lord Rothvale has finally met his destiny.And her name is Gabrielle Hargreave.A love beyond any price… Lives intertwined over the ages… Destinies of the heart and of treasures hidden away…I’d like to have your gorgeous body tied to my bed while I f*ck you this time. Knowing you’re going nowhere until I release you.. -IVAN EVERLEY**This is Book 2 in a serial series. For the love of God, Read. PRICELESS. First. You have been warned.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "BDSM",
    "Historical Romance",
    "Contemporary",
    "Erotic Romance"
  ],
  "author": "Raine Miller",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/22366437-my-lord"
}