{
  "title": "America: Imagine a World Without Her",
  "description": "Is America a source of pride, as Americans have long held, or shame, as Progressives allege? Beneath an innocent exterior, are our lives complicit in a national project of theft, expropriation, oppression, and murder, or is America still the hope of the world?New York Times bestselling author Dinesh D'Souza says these questions are no mere academic exercise. It is the Progressive view that is taught in our schools, that is preached by Hollywood, and that shapes the policies of the Obama administration. If America is a force for inequality and injustice in the world, its power deserves to be diminished; if traditional America is based on oppression and theft, then traditional America must be reformed—and the federal government can do the reforming.In America: Imagine a World without Her D'Souza offers a passionate and sharply reasoned defense of America, knocking down every important accusation made by Progressives against our country. In this book, you'll learn:-Why it is a pernicious myth that English colonists \"stole\" America from the Indians or that American settlers and soldiers \"stole\" the southwest from Mexico-Why the descendants of slaves—and the successive waves of immigrants to the United States—are better off here than in their old countries-How America, more than any other country, is based on rewarding the enterprise and hard-work of the common man-How traditional American virtues sustain prosperity and freedom, and Progressive arguments about \"liberation\" and \"justice\" undercut them-How Progressive demagoguery about \"inequality\" expands the power of government and its grasp on the taxpayer's wallet-Why we should fear the Progressive agenda of \"reform\" which is in fact an agenda of totalitarian control of the state over the individual-Why national decline is a choice--a choice that it is still not too late to reverseProvocative in its analysis, stunning in its conclusions, Dinesh D'Souza's America will be the most talked about book of the year.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "American History",
    "Philosophy",
    "Historical",
    "American"
  ],
  "author": "Dinesh D'Souza",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/22367138-america"
}