{
  "title": "Quests of the Heart: Six Christian Novels",
  "description": "Bundle of six bestselling Christian novels by Summer Lee, ANGEL HEARTBetrayed by her mother, eighteen-year-old Kenana is sold into marriage to the elderly Prince Jubal of Mesopotamia. Dutiful Kenana determines to make the best of the situation, honoring her wedding vows and fulfilling her wifely responsibilities to the elderly prince. However, she cannot help but wish for what might have been—especially when her strikingly handsome Guardian Angel, Malluch, returns to her life in a very corporeal form, serving as no small distraction.KINDRED SPIRITSWith the passing of her elder husband, nineteen-year-old Kenana finds herself queen of Adah—and heavy with child—a child who may or may not be human. Born of daughters of man but sired by fallen angels, the Nephilim are powerful creatures—powerful and often evil. Raped by such a fallen angel prior to her husband’s death, Kenana is tormented by the thought of what may be growing inside her. And as she is about to give birth, Kenana receives some unsettling a massive army is gathering, an army determined to remove her from power, an army composed of mighty Nephilim warriors—and led by a traitor. Only one man can stop the coming destruction, the true king of Mesopotamia—a man who also happens to be her true guardian angel.THE STAFF OF MOSESWhen the adventure begins in 1963, Aviela, who works for the government, is assigned to rescue archaeologist Eldad Ben-Tzion from danger and take him to Jerusalem. When Aviela locates him at the famous archaeology expedition at Masada, an evil Canaanite poses a threat to Ben-Tzion, and to the archaeologist in charge of the dig. Aviela tries to remove the man from harm’s way just when remarkable artifacts are discovered at Masada. Soon, the race is on toward the Staff of Moses in this page-turning biblical treasure-hunt.BEACH ANGELWhat does surfing, basketball, girls, best friends and a gang of bullies all add up to? A whole lot of fun for Brett Buyer and his Beach Angel. Meet Brett Buyer. He's on not one, but two basketball teams, which he juggles while falling in love with a very cute surfer girl named Brenda—all while dealing with Chopper Cruz and his Porter Street Gang of punks. Brett Buyer is about to learn the meaning of true friendship, loyalty, and what it means to stand up for what you believe in. That is, if he can survive the eighth grade.THE BABYLONIAN QUEENMariah, the Maiden of Mesopotamia, has an opportunity to tutor the children of the Parthian queen at the palace in Babylon. En route, she gets word that the queen has suddenly died. Now Mariah must not only become the children's tutor, but their full-time guardian as well, by order of the king. Also along the way, Mariah falls in love with her carriage driver. Unfortunately, the widower king falls in love with her, too. Her heart, which was already torn by the son she gave up for adoption, years ago, is now further divided between love and duty. The King wants to make her into his mistress, but Mariah must keep him at arm's length and choose the best path.WARRIOR WOMANFour thousand years ago, as the Israelites drove the Canaanites from the Promised Land, they met more than human resistance. They encountered evil giants which had been born from the unholy unions of fallen angels and human women. When the adventure begins, Achsah is chosen as official lookout for all of Israel. Her job is to alert her father, a military chief, when she sees the enemy coming. Between hunting for giants, visions from God, and saving people, Achsah is romantically pursued by two soldiers. When the vile giant poses an imminent threat, not just to everyone she loves, but to the entire fate of the Israelites, Achsah knows she must be obedient to God and slay the giant. Achsah is an unsung, anointed heroine who is filled with God’s strength and goodness, which will help her fight for the most precious treasure of the claim to the Promised Land.",
  "genres": [],
  "author": "Summer Lee",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/22365576-quests-of-the-heart"
}