{
  "title": "Beyond Bin Laden: America and the Future of Terror",
  "description": "Osama bin Laden was the most wanted man in American history—an enemy who brought the United States what President George W. Bush called “a day of fire,” and ushered in a new era of terrorism. It took a decade of blood and sacrifice, of determination and frustration, but finally, in a nighttime raid at the end of a dirt road in Pakistan, the hunt for Bin Laden ended with a gunshot. It was a dramatic climax to a long and painful chapter.But now what? The terrorist threat that has defined American policy since the attacks of 9/11 did not die with Bin Laden in his walled compound near Islamabad. Radicals still wish us harm, and we must fight on.In this provocative collection of essays edited and introduced by Pulitzer Prize winner Jon Meacham, a group of penetrating analysts and leaders look ahead to the world after Bin Laden—to the future of Al Qaeda, of Afghanistan, of Pakistan. We explore the political, military, and cultural implications of the post–Bin Laden war on terror. From Richard N. Haass of the Council on Foreign Relations to former Secretary of State James A. Baker III, from historian and journalist Evan Thomas to former U.S. Army officer Andrew Exum, Beyond Bin Laden gives readers intelligent, deeply informed, and urgent glimpses of what comes next.Contributors include:• Jon Meacham, executive editor, Random House• James A. Baker III, former Secretary of State• Karen Hughes, former counselor to President George W. Bush and former Under Secretary of State for Public Diplomacy• Richard N. Haass, president, Council on Foreign Relations• Bing West, author, The Wrong War, and former Assistant Secretary of Defense for International Security Affairs• Andrew Exum, fellow, Center for a New American Security• Daniel Markey, senior fellow for India, Pakistan, and South Asia, Council on Foreign Relations• Evan Thomas, award-winning historian and former editor-at-large, Newsweek",
  "genres": [
    "History",
    "Politics",
    "Terrorism",
    "Nonfiction",
    "The United States Of America"
  ],
  "author": "Jon Meacham",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/11307037-beyond-bin-laden"
}