{
  "title": "The Perfect Hero",
  "description": "‘Have not been able to put this novel down! A lovely story brought to life with characters you want to meet. Loved every page.’ Reader review ⭐⭐⭐⭐⭐The sparkling follow-up to A Weekend with Mr Darcy from Victoria Connelly – set to become the Richard Curtis of the chick-lit world!Die-hard romantic, Kay Ashton, uses her inheritance to open a B&B in the seaside town of Lyme Regis and is dumbstruck when the cast and crew of a new production of Persuasion descend, needing a place to stay. Kay can't believe her luck – especially when she realises that heart throb actor Oli Wade Owen will be sleeping under her very own roof!Meanwhile, co-star Gemma Reilly is worried that her acting isn't up to scratch, despite landing a plum role. She finds a sympathetic ear in shy producer, Adam Craig, who is as baffled by the film world as she is. Kay thinks the two are meant for each other and can't resist a spot of matchmaking.Then, when Oli turns his trademark charm on Kay, it seems that she has found her real-life hero. But do heroes really exist?Featuring a cast of characters that could have stepped out of a Jane Austen novel, this is the perfect read for fans of Katie Fforde and Alexandra Potter.Readers are in love with The Perfect ‘Another fantastic read by Victoria. Curl up on the sofa and enjoy. Get lost in the scenery, the romance! Just read it.’ Reader review, 5 stars‘I loved this. Buy it. It's worth it and then some.’ Reader review ⭐⭐⭐⭐⭐‘Love… Easy read, but oh so engrossing.’ Reader review ⭐⭐⭐⭐⭐‘Excellent… I could just imagine the scene of each page I turned… I couldn't put the book down, I just had to find out what happened next ! Definitely a 5 star rating.’ Reader review ⭐⭐⭐⭐⭐‘Great storyline especially if you are a Jane Austen fan. The Austen connection is brill but it would still be a good read for non Austen fans. A lovely easy to read romance novel.’ Reader review ⭐⭐⭐⭐⭐",
  "genres": [
    "Chick Lit",
    "Romance",
    "Fiction",
    "Contemporary Romance",
    "Contemporary",
    "Adult Fiction",
    "British Literature"
  ],
  "author": "Victoria Connelly",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/11306628-the-perfect-hero"
}