{
  "title": "Wildwood Shadows: a novel of time travel in ancient North America",
  "description": "It all started with a severe thunderstorm on a summer night in Munroe Falls, Ohio. Then in an instant, the storm stopped and Charlie discovered that his house was suddenly surrounded by a dense forest. Everything he knew about the world had suddenly changed. All he had left in the world was his home… well, that and the sinking feeling brought on by the knowledge that his father who disappeared just as abruptly two years prior used to dabble in time travel.  When the Shawnee Indians show up at his house one day, it doesn’t take him long to realize that he had somehow managed to travel into the distant past – long before the Europeans colonized the United States. He also quickly learns that his father is living among the Shawnee.  When his father realized that he’d accidentally dragged his son along on a journey that wasn’t intended for him, he was faced with only one option – Charlie needed to be sent back. The good thing was, his son had brought all the time travel equipment with him inside the house. The bad thing was that it ran on electricity. Cannibalizing the house might provide the way to an electric generator if he could also manage the creation of a water wheel on the river.  But sending Charlie back would take some time, so that meant he’d have to learn to live among the Shawnee. He would also need to learn to survive without all the benefits he was accustomed to. And ultimately, he would need to decide if he really wanted to return home after all. Because falling in love with a woman who was already promised to another man could cause a lot of problems.  Brought to you by the international bestselling author of the Mystic Saga, Dominion, and Ghosts of Ophidian. With over 200,000 books downloaded worldwide, Scott McElhaney continues to prove that reasonable Kindle prices do not have to mean poor quality. Also check out Saving Brooksie, Beyond the Event Horizon, One Crazy Summer, and Erinyes by McElhaney.",
  "genres": [
    "Time Travel"
  ],
  "author": "Scott McElhaney",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/22372232-wildwood-shadows"
}