{
  "title": "Wicked: A Naughty & Nice Collection",
  "description": "Wicked: A Naughty & Nice Collection featuring 9 full length novels by Indie Authors.. Lust. Betrayal. Sex. Denial. Sacrifice. Love. Sin. Trust. Pain. Submission. Loss.100% of proceeds go the the Cancer Council Australia. http://www.cancer.org.au9 Books, 9 Authors, 9 Stories that will either break you or set your panties a light.Saving Ella by Kirsty Dallas:They say pain makes you stronger, fear makes you braver; Ella had more strength and bravery than most. A body mapped with scars and pain, Ella escaped her demons and ran, but how can you run from your past when it’s not only etched into your skin but burned into your heart?Born a warrior, Jaxon Carter could intimidate with no more than a glance, but this warrior was not born to destroy, he was born to protect. To Jax, Ella was much more than a tiny beaten girl, Ella was an angel. Ella was Jax’s angel, she was his to protect and cherish. Sometimes though, you have to fight for love and sometimes blood is destined to run a river. Sometimes, hate trumps love.“Your scars might remind you of where you've been angel, but they don’t have to dictate where you’re going.” ~ Jaxon CarterTainted Desire by Wendi Hulsey:Kylie Jenkins has lived the past few years fearing for her life. She knows she must do whatever it takes to escape her current situation. With each assault, the injuries she sustains are more severe. Without knowing if she will ever see her family or friends again, she takes off in hopes of a new beginning. Her entire world is turned upside down until she is reunited with her childhood love and things start to look up. Unfortunately, for Kylie, her dangerous past seems to be sneaking up on her. Strange things start happening to her, making her feel apprehensive and afraid. Her friends assure her that she is safe, but they start to think Kylie might be a bit paranoid. Will Kylie finally have her storybook romance? Or will her love and desire for Cameron be tainted from the start?Breaking My Heart By Aleya Michelle:Roxy is a fighter, she is strong and independent. She knows exactly what she wants and is not afraid to go after it, especially when it comes to men.Roxy thinks she has men figured out, that is until she meets Kade. He storms into her life like a knight on a white horse to save her. He makes her question everything she ever thought she knew about life, men and herself. With a past that keeps holding her back will Kade be able to break down her walls? Will he be able to prove to Roxy that everything she thinks she knows about men is wrong, or will he prove her right?Harper’s Little Spitfire By Angel Steel:For the last 15 years, Sage Mathews has had her eye on one of the Harper brothers. Each time she came even remotely close to catching his eye, he ruined it by taking advantage of the closest woman around. Despite her many attempts of capturing his attention, she repeatedly ended up suffering from the pain yet again. Having been hurt for the last time, Sage decides to pull herself away from the bad boys of Laker.Fate had a different plan for her… Certain surprises have drawn Sage back into the path of the Harper brothers once again, this time exposing her to their interesting...predilections. Possessing secrets of her own, she is thrown into a world she never thought possible.One woman holds the Harper brothers' hearts in the palm of her hands, but the true bad boy for her won't allow her into his heart. Will he ever drop his guard down and finally feel the true love from a woman? Will she allow one of the Harper brothers into her heart? Or will he demolish her entirely for anyone else?Trust Me? By KE Osborn:Jenifer Taylor is content with her life, dull and boring as it is. Being absent from the dating scene means she doesn't have to deal with the major trust issues she has with men that stem from a controlling and aggressive ex-boyfriend and an absentee father. When Jeni starts a typical day in Mornington Vale, California, it turns from bad to worse when she’s involved in a chain collision on her way to work.She collides with Aiden O’Connell. Aiden is an up-and-coming young businessman who's ready to take on the vice presidency of his father’s company. Life for Aiden involves working hard and not much else.Jeni finds love quickly with Aiden, but trusting him is another issue. When to trust is tested in many ways but comes to a head when Aiden is investigated for a serious crime. As her trust issues spark, she must decide once and for all whether she trusts the man she loves when she’s asked the ultimate question: “Do you trust me?”Derek By Dawn Martens:Rylie Sullivan hasn't had an easy life. She is broken, so broken she doesn't think she will ever be fixed. When she meets Derek, he barges into her life and tries to break down the walls she has so carefully construed to keep what’s left of her safe. When Rylie’s past mixes with her present, will Derek stand by her and help her survive? Or will he bail for the next pretty thing?Derek Tremaine has had it easy. Coming from a wealthy family and blessed with good looks, Derek has breezed through life. After years of one night stands, and a few half ass attempts at relationships, Derek has almost given up on ever finding the woman for him. When he sees Rylie however, he can’t help but be drawn to her. Rylie is different, more so than any other person Derek has met. Rylie’s beauty- her tattoos, piercings and beautiful blonde dreads drew him in, but it’s her sweet, kind nature that makes him want to stay around and protect her. Winning Rylie’s heart will be his greatest challenge yet, but Derek knows the reward will be more than worth it. Which is why Derek has no intentions of letting her go.Punished into Submission By Holly Carter:Kat was determined to get away and become something else after a tragic childhood. Kat became powerful, dangerous and pain inflicting. But what she didn't expect was meeting Hunter Ford, Master of Masters and Mistresses palace. Hunter is dark, dangerous and sexy as sin. He has the wicked way of getting what he wants, when he wants. Hunter is faced with Kat and things get vicious. They both have rules and every single on is about to be broken. Join Kat and Hunter on a journey of please and pain, lust and hate, sin and virtue.Ahead of the darkness by Simone Nicole:I thought it was time— a visit was due. Seeing as you wouldn't come to me, I thought it only right I come to you. Sadly, you weren't home, but your furry feline was more than accommodating . . . I’ll be seeing you soon, mon chérie. I’ll always find you . . .For six years, a letter has dictated Amelia’s future. She’s running from a past that refuses to stop, always trying to get one step ahead. Amelia is clever and resilient, and refuses to slip up.Relying only on herself, she’ll be anything and anyone she needs to survive. But everyone slips up . . . eventually. You can’t always stay ahead of the darkness.The Problem With Crazy By Lauren K. McKellarThe problem with crazy is that crazy, by itself, has no context. It can be good crazy, bad crazy ... or crazy crazy—like it was when my ex-boyfriend sung about me on the radio. Eighteen-year-old Kate couldn't be more excited about finishing high school and spending the summer on tour with her boyfriend’s band. Her dad showing up drunk at graduation, however, is not exactly kicking things off on the right foot—and that’s before she finds out about his mystery illness, certain to end in death. A mystery illness that she could inherit. Kate has to convince everyone around her that her father is sick, not crazy. But who will be harder to convince? Her friends? Or herself? The Problem With Crazy is a story about love and life; about overcoming obstacles, choosing to trust, and learning how to make the choices that will change your life forever.These books contain sex scenes that you will need a cold shower afterwards from reading and adult content 18+ only.",
  "genres": [],
  "author": "Kirsty Dallas",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/22373029-wicked"
}