{
  "title": "The Deputies: 3 Novella Box Set",
  "description": "Genre: Contemporary Western Erotic Romance Series: Cowboy Justice Association 3 Never-Before-Released Novellas approximately 25K to 30K each  Second chances. Unrequited crushes. Brand new love.  Deputy Hank Dixon: When Hank’s estranged wife shows up ready to mend their broken marriage, he has a hard time believing she’s sincere. She’s hurt him badly in the past and he’s not sure he’s ready to let her stomp on his heart all over again.  Alyssa has learned from her mistakes and is ready to do whatever it takes to get her husband back. She wants to spend the rest of her life showing Hank that he’ll always come first for her.  But this stubborn cowboy cop isn’t going to trust so easily. He wants more time but fate has other plans. When tragedy strikes, can Hank put the past behind him and embrace a future with the woman he loves?  Deputy Sam Taylor: Sam’s been alone a long time and that suits him just fine. On a night he plucks a scared woman from a car accident during a snowstorm, he finally realizes he’s been missing out. Tabby is everything he’s ever wanted in a woman. Too bad she’s just passing through town.  Tabby’s life is busy and complicated. The last thing she has time for is a sexier than hell cop that makes her weak at the knees just by smiling. She shouldn’t get involved with him but she can’t help herself. He’s just so damn perfect.  When it comes time for Tabby to leave, Sam knows she’s changed his life forever. And forever is a long time. Can this handsome deputy convince Tabby that he’s worth changing her life for?  Deputy Drake James: Tori Saunders has been in love with Drake forever. At least it feels that way. Now she’s back in her hometown and she’s determined to make the hotter than sin deputy her man. She’s got it all planned. All she needs is a little cooperation from Drake.  Drake takes one look at Tori and decides some steamy nights between the sheets sound like just what the doctor ordered. The sexy pastry chef seduces him with her sweet desserts and sweeter curves. Together they really cook in the kitchen.  But when Drake finds out that Tori’s planned out their entire lives together right down to the names of their kids, he ends the relationship then and there. It’s not like he’d fallen for Tori. Or thought she was wonderful, and smart, and sexy. Nope, this cop is just fine without Tori Saunders. Except he’s not. Looks like Drake has some work to do to win back the love of his life.  Publisher’s warning: This book contains sexy scenes including some hot lovin’ on the kitchen counter, up against a tree, and in front of a roaring fire.  Note – While these novellas are part of the Cowboy Justice Association series, the stories stand alone and may be read out of order.  For more information, please visit www.OliviaJaymes.com",
  "genres": [
    "Romance",
    "Westerns",
    "Contemporary",
    "Suspense",
    "Anthologies",
    "Novella",
    "Adult"
  ],
  "author": "Olivia Jaymes",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/22371681-the-deputies"
}