{
  "title": "The War Never Ended: Memories of Holocaust Survivors",
  "description": "The War never Ended – Memories of Holocaust Survivors is a fascinating, soberly written book that reads like a novel but consists of facts, some of which have never been widely published. When living in Los Angeles, the author received phone calls from 1200 people in reaction to a campaign raised to help American Jews and other individuals file claims for property they had lost during the Nazi regime in what would later be Eastern Germany. Many of these phone calls were unrelated to the issue of filing the claims. On many occasions someone simply needed to talk to a complete stranger who lent a listening ear and understood. The conversations were usually long monologues about experiences in concentration camps like Auschwitz, Bergen-Belsen, even Sobibor. The victims talked about their escapes from the hands of the Nazi's, and about their harsh return after the liberation.When the process of filing claims was finished, the author found himself in the possession of a wealth of information, not only about the experiences of Holocaust survivors but also about the post-war generation. The personal, moving and candid witness statements and memories were all transcribed and verified, and provided shocking insights into the psychological aftermath of the first and second generation Holocaust victims.It was felt important to make these stories and memories accessible to a larger audience, especially to young people. The author Simon Hammelburg is a holocaust educator, lecturing in Europe, the United States and Israel. We should never forget what happened during World War II, and how this impacted generations to come. For countless people the war never ended.In this book, the memories of Holocaust survivors and their children have been intelligently woven into characters that play a role in the main storyline; the main character, himself a child from Jewish parents who both survived the Second World War, is trying to come to terms with the loss of a beloved one, Daisy, by traveling back to the place where they first met and were happy together. The book ends with the Kaddish for Daisy, attended by a circle of dear childhood friends, all of them from emotionally damaged and traumatized families. In their youth, they used to escape their homes on Sundays to meet at their Clubhouse from Ichud Habonim, a worldwide Zionist organization. The clubhouse served as a safehaven where they could be children and have fun.Although the tone of the book is generally serious, the author managed to give the book a gentle touch with his dry humor. In The War never Ended - Memories of Holocaust Survivors, Simon Hammelburg shows the trauma’s of his parents’ and of his own generation without ever becoming sentimental. They have been given a voice in an intelligent and natural way. The book is of rare literary quality with some great dialogues; once you start reading, you cannot put it down until you have read the very last page.The War Never Ended – Memories of Holocaust Survivors has been dedicated to Dr Flo Kinsler (1929-2013), a Los Angeles social worker and psychologist specialized in Holocaust trauma’s.",
  "genres": [
    "Holocaust",
    "History",
    "World War II"
  ],
  "author": "Simon Hammelburg",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/22371561-the-war-never-ended"
}