{
  "title": "The Spirit of '76: From Politics to Technology, the Year America Went Rock & Roll",
  "description": "From the author of the acclaimed 1970 chronicle \"Fire and Rain,\" an eye-opening look at yet another pivotal moment in American history—1976, the year the spirit of rock & roll re-energized the country.By the mid ’70s, America was stuck in a post-Watergate malaise. Then came Jimmy Carter, \"Rocky,\" the Ramones, Apple computers, and a slew of awards for a new late-night series called \"Saturday Night Live.\" Each of those milestones arrived in 1976--and marked the moment the counterculture became the culture. Based on extensive research and interviews with some of the participants, Browne—a contributing editor at Rolling Stone and author of \"Fire and Rain\" and \"Dream Brother\"—vividly chronicles the year America went rock & roll in everything from politics to technology. Spirit of ’76 will make you think anew about an under-appreciated moment in the country--and will make you wonder if its optimistic, can-do spirit of reinvention and renewal will ever come again. About the David Browne is a contributing editor at Rolling Stone and Men's Journal. He is the author of \"Fire and The Beatles, Simon & Garfunkel, James Taylor, CSNY and the Lost Story of 1970,\" dubbed \"one of the most entertaining and informative books of the year\" by NPR. He is also the author of \"Dream Brother,\" a biography of the late musicians Jeff and Tim Buckley; \"Goodbye 20th Century,\" a biography of the pioneering alternative band Sonic Youth; and \"Amped,\" a history of extreme sports. His work has also appeared in The New York Times, New York, Wired, Entertainment Weekly, Huffington Post, and other outlets. In 1976, he attended Clifton High School in Clifton, New Jersey, and he currently lives in New York City.Cover design by Hannah Perrine Mode",
  "genres": [
    "History",
    "Research",
    "Music",
    "Nonfiction"
  ],
  "author": "David Browne",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/22379034-the-spirit-of-76"
}