{
  "title": "Finally You",
  "description": "FINALLY A TRIPLE TREAT ROMANCE BOX SET Three Bestselling Authors, Three Romance Novels, One Great Price  WORKING IT OUT by USA Today bestselling author Rachael Anderson Grace Warren's life is safe and predictable—exactly the way she likes it. But when she gets roped into going to an auction to help out a friend, everything changes. She meets Seth Tuttle—a guy who unexpectedly kisses her then disappears, leaving her flustered and upset. If she never sees him again, it will be too soon. But when Seth limps into Grace's rehab clinic post surgery, there's something about him that makes her second-guess her carefully placed boundaries. Maybe he’s exactly what Grace has needed all along—assuming she's willing to risk safe and predictable for a chance at love.  A PERFECT FIT by Amazon bestselling author Heather Tullis Cami DiCarlo doesn’t agree with her father that her life has been stuck in a rut, so she is not happy when he forces her hand into heading up guest services at his newest five-star hotel. The fact that he unveils the existence of four half-sisters at the same time, and insists that they live together while they launch the new resort, only makes things worse. When she meets Vince Talmadge, the sweet, sexy landscaper her father would never have approved of, Cami can’t say no. If only she could be sure she is on the right track—and that they will be able to stop the person who is trying to destroy everything she and her sisters are working to build.  LOVED LIKE THAT by Amazon bestselling author Julie Wright Does meeting someone when they’re a soul make you soul mates? After being set up on one of the worst blind dates ever, James Hartman decides dating is hopeless and he should just stick to doing what he knows best—being a bachelor cop. That decision lasts all of ten minutes as he comes across the scene of a car accident and finally meets the girl of his dreams. Granted, she’s dead when he meets her, and she doesn’t remember him at all once he resuscitates her. Does he try to help her remember that out of body experience or does he walk away from his one chance to be loved like that?",
  "genres": [
    "Romance"
  ],
  "author": "Rachael Anderson",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/22376930-finally-you"
}