{
  "title": "Find Virgil: A Novel of Revenge",
  "description": "GET INSIDE THE MIND OF A MASS MURDERER AS YOU NEVER HAVE BEFORE!Can you imagine yourself rooting for a madman who wants to kill hundreds of innocent people?Smoking and vaping killed Martin Muntor's wife. And it gave him lung cancer from second-hand smoke. That pushed him over the edge.The billion-dollar tobacco industry thinks it’s invincible. But is it?Muntor vows to destroy Big Tobacco - and anyone who gets in his way.Hapless ex-FBI agent Tommy Rhoads has to find Muntor, and fast. But that's not going to be so Muntor is smart, dying and has nothing to lose, and the FBI doesn't want Rhoads's help.Is Martin Muntor a madman or victim? Who’s right, and who’s wrong?Read Find Virgil now, and go along for the wild ride. You'll never forget it.From the AuthorThe Death and Life of Find VirgilFind Virgil began its strange odyssey early in 1996 when New York publisher Lyle Stuart read my manuscript, bought it, renamed it Gasp, and published it that fall. The novel spawned significant controversy and tons of hate mail. Oh, and there was an FBI investigation, possibly triggered by an unappreciative tobacco industry.One day in 1999, my doorbell rang. It was a Special Agent of the FBI and a detective with the Upper Merion Township police department. They flashed badges and asked to come in. \"What's up?\" I said. The agent \"We want the cyanide.”After about 45 minutes of questioning at my dining room table, and my explanation of the difference between a novel and non-fiction, the agent admitted he was embarrassed. The detective apologized for bothering me. \"We had no choice, we had to come,\" the agent said. \"You and your book were reported directly to the Attorney General of the United States. We were told the book encourages people to poison cigarettes.\" No, I told him, it's the tobacco companies that put poison in cigarettes.After leaving some colorful FBI-logo stickers for my toddler - and taking two hardback copies of the book (they requested I sign them) - the FBI agent and detective left. \"If you get any more of those threatening letters,\" the agent said, \"let me know.\" We all shook hands.Fifteen Years LaterYears later, I returned to the manuscript to revise and rewrite. Some of the negative critiques made good points, and in the rewrite, I addressed them. I kept the mid-1990s era the same, but deepened the characters, delving into why they were doing what they were doing, and writing a little less about how they were doing it. I cut quite a bit, making the story move at an even faster pace.We'll see what Big Tobacco thinks this time. And if they rat me out to the current Attorney General and a SWAT team shows up at my house, well ... I'll refer them to the last batch of investigators who came knocking. And I'll tell them how they shook my hand and left with their own, autographed copies of the book.",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Mystery Thriller",
    "Contemporary",
    "Suspense",
    "Drama"
  ],
  "author": "Frank Freudberg",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/22378928-find-virgil"
}