{
  "title": "The Shadow Soul",
  "description": "From bestselling author Kaitlyn Davis comes a fantasy adventure perfect for fans of Sarah J. Maas, Kristin Cashore, and Tamora Pierce! Told in alternating male and female perspectives, THE SHADOW SOUL has been hailed as \"an amazing start to a new series that is going to have people of all ages wanting so much more.\" (Happy Tails Tales Reviews)When Jinji's home is destroyed, she is left with nowhere to run and no one to run to--until she meets Rhen, a prince chasing rumors that foreign enemies have landed on his shores. Masquerading as a boy, Jinji joins Rhen with vengeance in her heart. But traveling together doesn't mean trusting one another, and both are keeping a deep secret--magic. Jinji can weave the elements to create master illusions and Rhen can pull burning flames into his flesh.But while they struggle to hide the truth, a shadow lurks in the night. An ancient evil has reawakened, and unbeknownst to them, these two unlikely companions hold the key to its defeat. Because their meeting was not coincidence--it was fate. And their story has played out before, in a long forgotten time, an age of myth that is about to be reborn...RAVE REVIEWS for THE SHADOW SOUL!\"The writing is flawless. The story and plot line, and plot twists, had me captivated and enamored for the first words. I couldn't put this book down for anything, and I absolutely cannot wait for book two...It's an amazing start to a new series that is going to have people of all ages wanting so much more.\" - Happy Tails and Tales\"One word to describe this intense! Everything from the battles, to the secrets, to the descriptions of the characters and scenery, are all incredibly intense. This book had me biting my nails, stomach tided in knots, and completely entranced til the last word.\" - Desert Rose Reviews\"Throughout the story, the stakes were always raised. There was no part that lagged while Davis was telling her story of far off lands, and the drama continued to the very end...To those readers who like fantasy and adventure, or to those who tried to read \"A Song of Ice and Fire\" but couldn't make it through the first chapter without falling asleep - this could be a series for you.\" - Pink Fluffy Hearts\"The Shadow Soul was positively transportive, left me feeling refreshed, and renewed my faith in symbolism, imagery, and the importance of world building and cultural preservation...If you want to set out on a journey, read this.\" - We Do Write\"I loved this book! I was drawn into the story with the fantastic and descriptive storytelling told alternatively between Rhen and Jinji!... The political pickings, magical murderers, and shadowy suspense are the real plot stars in this book and the wonderful characterization and world-building adds extra oomph to grab you and keep you in this world.\" - EBook Escapes teens and young adult, sword and sorcery, action and adventure, fantasy romance, coming of age, fantasy, teen fiction, dragons, magic, dual perspectives, free, freebie, free book",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Dragons",
    "Magic",
    "Romance",
    "Paranormal",
    "Adventure"
  ],
  "author": "Kaitlyn Davis",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/22376281-the-shadow-soul"
}