{
  "title": "Forever the Road",
  "description": "Travel. Destiny. Beer.The world's greatest traveler never thought he'd be staying put.Jay had planned to move on after marking Agamuskara, India, off his list of places to see. Then two strange men steal his passport, and the long-roaming loner stays in Agamuskara to find it. After years of globetrotting with no companion but his trusty big backpack, Jay befriends the stout-quaffing, ever-grinning Faddah Rucksack, the world’s only Himalayan-Irish sage. Now Jay finds himself being steered toward an unknown fate by a man who lost his own destiny long ago.No Jake or Jade is better than Jade Agamuskara Bluegold at slinging drinks, destinies, and decisions. Yet after spending ten years helping The Management keep the world turning, the solitary, mysterious bartender at the pub at Everest Base Camp has begun to doubt the life she chose over another path. When Jade's uneasy friendship with Rucksack leads her to help him unravel the mystery at the heart of the city, Jade finds her loyalties changing in ways she never could have imagined.When the bartender and the backpacker meet, forces are set in motion that won't just change the world forever—they might end it. Then Jay accidentally awakens an ancient evil, and only Jay, Rucksack, and Jade stand between it and its terrible purpose: destroying all life in a smiling fire.Part of The Rucksack UniverseThe Rucksack Universe is the exciting world of wit, adventure, and beer that fans call “buoyant with a unique humor, twist and focus on international travel,” and “perfect for fans of Terry Pratchett and Neil Gaiman.”Guru Deep Says:\"Agamuskara shares its name with the river that runs through India's holiest city, which is also its unholiest. While no records survive to tell us when Agamuskara was founded, local lore maintains the area was settled by the first people to come to the Indian subcontinent. History also does not explain why the city and the river should be named what, in the Hindi, translates as 'smiling fire.' This mystery, the delights of daily life and Indian culture, and the unrivaled drinks at the Everest Base Camp Pub and Hostel continue to attract travelers from all over the world.\"— Guru Deep, India Through the Third Eye",
  "genres": [],
  "author": "Anthony St. Clair",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/22379221-forever-the-road"
}