{
  "title": "Bad Games: Box Set",
  "description": "The bestselling Bad Games trilogy is now in one complete box set at a discounted price. Bad Games, Vengeful Games, and Bad Games: Hellbent have received a combined 680 FIVE-STAR reviews from readers. In March of 2014, Bad Games was the #1 Kindle bestseller in \"Psychological Thrillers\" and \"Suspense Horror.\" All three full-length novels, plus never-before-published bonus content, for over 1,000 pages of entertainment. ______________________________________The Bad Games Box Set includes:BAD GAMES - The terrifying bestseller that started it all. The Lambert Family is heading to Crescent Lake, a rural cabin community in western Pennsylvania, for an idyllic weekend getaway. Some fishing, some barbecue, some games...The Fannelli brothers are heading to Crescent Lake too. Some stalking, some kidnapping, some murder, definitely some games...though not necessarily the type of games the Lamberts had in mind. But it doesn't matter. The Lamberts are going to play whether they like it or not.VENGEFUL GAMES - The Lambert family played the Fannelli brothers' twisted game and survived. Showed the brothers they'd messed with the wrong family.However, the game is far from over. There are some new players in town. Players who have close ties to the Fannelli brothers. Players who are taking things very personally...and promising results that are very deadly.BAD GAMES: HELLBENT - A year has passed. Marine and security specialist Domino Taylor shadows the Lambert family, the guilt he feels for the tragic events that unfolded in western Pennsylvania haunting him without mercy. When someone from Domino's past contacts him, begging for his help, Domino reluctantly agrees, not knowing the sinister truth lying in wait...there is one final game yet to play.~~EXCLUSIVE CONTENT~~Never-before-published Bad Games prequel short stories...\"Get Off My Ass\" - Arty and Jim teach an obnoxious couple the pitfalls of tailgating.\"Job Interview\" - A young Monica Kemp must prove she is worthy of an elite position.Plus an in-depth Q & A with author Jeff Menapace about all three Bad Games books and beyond.",
  "genres": [
    "Horror",
    "Thriller",
    "M M Romance",
    "Mystery Thriller",
    "Mystery",
    "Crime",
    "Fiction"
  ],
  "author": "Jeff Menapace",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/22375664-bad-games"
}