{
  "title": "Les Vaporistes",
  "description": "Vampires, scientists, demons, dirigibles, thieves, slave girls, airship captains, bounty hunters, lost loved ones, prim and proper ladies, saloon girls, and aliens. Within this compendium you shall find all of these things and more, to fuel your fantasies. These twelve molten erotic shorts to rev up your steam engine, along with three works of art by Jackie McMahon, are sure to make you spring a cog. Take a deep breath and get lost in the worlds of Les Vaporistes.  Cast the Mold by Andrea L. Straum: Even the best have their skills put to the test. Clockwork City: Immortal Lovers by Natalie Hancock: Hunting Dark Immortals is dangerous. Falling in love with one is deadly. A Love Token by Zoe Adams: Let them make love. For the Love of Lexi by Eada Janes: When you love this much, there's nothing worth letting go. Demon in Steam by Lexi Ostrow: In the London Underground, the Alliance of Silver and Steam is all that protects humans from demons. Conjuring Pleasure by Hannah Nixin: Faced with many suitors, the best are often the ones we dream into being. The Hunted Heart by Aurelia Fray: When hunting Magpie, Xan will have to either give up the woman he loves or run with her. Blowing Off Steam by Molly Hammerman: It takes a professional to see that Captains blow off steam. Clockwork Heart (Prelude) by R.A. Sears: Seth McDougal hasn't been around for a few months, but when he strolls in to the Timeless Tavern for his regular meal and drinks, his entire demeanor draws Zylphia in like never before. Black Diamonds by Skye Knizley: There’s no such thing as circumstance to this thief. Enjoy the ride. Airship X by Josephine Ballowe: Can cold Esme Sinclair be warmed by the touch of Claire Aston, and will their lust be enough to fuel this flight? Paper Dolls by Rue Volley: When your only HOPE of survival is taking to the skies.",
  "genres": [],
  "author": "Josephine Ballowe",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/22380685-les-vaporistes"
}