{
  "title": "The Boneyard: Short fictions of the morbid and macabre: The Boneyard Series",
  "description": "Step into The Boneyard, where every bite-sized horror story is a grave-of-sorts and every grave tells a tale. This chilling collection of ten horror short stories delves into the shadowy recesses of the human psyche and the eerie unknown. Each tale unearths the morbid and the macabre, from doomed gravediggers to blood cults, malevolent spirits to the unrelenting terror of the human heart. The Boneyard beckons... Tale 1: Blind Spot In this tale of isolation, terror, Chloe abruptly loses her sight without reason or remedy, her world collapses into an unforgiving abyss. Doctors are baffled, friends grow distant, and hope seems as elusive as the light she once took for granted. But as her world plunges into darkness, Chloe discovers she's not alone. Tale 2: The GravediggerEmma Twomey takes pride in her work as one of the country’s few female gravediggers, a solitary but noble role that keeps her close to the quiet peace of the dead in the village of Vale...only peace is the last thing on Emma's mind when she witnesses a perversion of nature at the cemetery where the dead rest uneasy.Tale 3: 112In the dead of night, Rachel Downey, a seasoned worker at an emergency dispatch center, receives a strange, panicked call from an elderly woman pleading for help. But something isn't right with her voice. When the police arrive at the house, they uncover a chilling truth.Tale 4: Winging ItA man’s life begins to unravel with the arrival of a relentless, maddening itch beneath his skin. As the days pass, the itch turns into a festering wound, revealing something grotesque and unnatural sprouting from within. Terrified of the outside world and consumed by his grotesque metamorphosis, he barricades himself in his apartment. But he cannot stop the visitor who comes to his high-rise apartment window at night and tap-tap-taps for him to come and play.Tale 5: Rest in PeaceThe Browne family has built a respectable name for themselves as the proprietors of Browne’s Eternal Rest Funeral Home, a place where the dead are laid to rest with dignity and care. But behind the polished facade of sympathy and solemnity, the locals whisper of something far darker lurking within its walls: the Brownes might be offering more than funerals, and the Brownes will do anything to keep their macabre and morbid secrets in in the grave.Tale 6: A Dumb WaiterWhen the Duggan family moves into a creaking, old house on the outskirts of Fox Hollow, they hope for a fresh start. But their dreams of peace turn to despair when their young son, Patrick, vanishes without a trace. Desperate to believe he’s still alive, they begin to uncover the house’s dark history, where sinister secrets are entombed within its very walls.Tale 7: Brotherhood of BloodWhen Mike Turner inherits his grandfather’s sprawling, decrepit estate, he expects to find a few dusty antiques and a lifetime of memories. Instead, he uncovers a chilling legacy of darkness and fear. Hidden journals and cryptic symbols point to his grandfather’s desperate attempts to escape a shadowy cult known as the Brotherhood of Blood.Tale 8: The HospitalDylan works the graveyard shift as a cleaner at The Hillside psychiatric hospital, a shadowy, sprawling facility where whispers echo through empty corridors. Each night brings strange and unsettling occurrences. But as he navigates the hospital’s labyrinthine halls with his trusty bucket and mop, it becomes clear that the greatest mystery isn’t the hospital—it’s him.Tale 9: 2 Hydrangea StreetRob has always prided himself on delivering every package, no matter the address. But when he’s tasked with delivering a self-addressed parcel to the long-abandoned house at 2 Hydrangea Street, unease creeps in. The dilapidated house has a sinister reputation—boarded-up windows, a yard choked with weeds, and stories of a strange occupant who lives there. This delivery will mark the end of his route in more ways than one.Tale 10: Shackled in the ShackTeenagers Alex and Ben stumble upon an eerie shack deep in the pine forest. What they uncover within the old building will bind them to a horrifying secret and change their lives forever.This short story is to be published as a full length novel with the title, The Shed, slated for publication in 2026",
  "genres": [
    "Mystery",
    "Horror",
    "Suspense",
    "Thriller",
    "Paranormal",
    "Supernatural"
  ],
  "author": "Jonathan  Dunne",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/223770283-the-boneyard"
}