{
  "title": "Walk to Beautiful: The Power of Love and a Homeless Kid Who Found the Way",
  "description": "Imagine being thirteen, in a strange city, hundreds of miles away from home, and your mom abandons you at a bus station, driving off into the night with her lover.It's a miracle Jimmy Wayne survived his growing-up years. Hungry, homeless, and bouncing in and out of the foster care system, Jimmy spent more nights wandering and sleeping in the streets than he cares to remember. His father left before he was born. And his mama, when she wasn't in a mental hospital or behind bars for various small offenses, was simply too overwhelmed, trying to survive herself.Walk to Beautiful is the powerfully emotive account of Jimmy's childhood and the unconditional love and acceptance Russell and Bea Costner gave to Jimmy. This elderly couple provided a stable home and the chance for him to complete his education. Jimmy says of Bea, \"She changed every cell in my body.\" After his high school graduation, Jimmy went on to earn a degree in Criminal Justice because, as he says, \"I knew a lot about it.\" But in his heart Jimmy wanted to write songs and sing.A music company opened its doors to Jimmy, and he moved to Nashville to pursue his dreams. He had several memorable hits, such as I Love You This Much, Paper Angels, and Do You Believe Me Now?, which remained at #1 for three consecutive weeks on the Billboard Chart.But success was not satisfying. Jimmy remembered where he came from, and he wanted to give back. With his Meet Me Halfway campaign—a 1,700 mile walk from Nashville to Phoenix—Jimmy walked halfway across America, raising awareness for foster children. Along the way he not only found a lot of crazy things, such as coins, keys, a plastic Jesus, and a Lucille Ball ashtray; but he also found himself. And more important, he found a way to forgive the people who had hurt him. Jimmy learned how to walk to beautiful—and so can you.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Book Club",
    "Christian",
    "Autobiography",
    "Music"
  ],
  "author": "Jimmy Wayne",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/22380752-walk-to-beautiful"
}