{
  "title": "Shades of Chaos",
  "description": "Dare yourself to enter into post-apocalyptic future with this gritty collection of first-in-a-series books by six bestselling authors! Discover unique worlds packed with non-stop action, adventure, and suspense set against a gritty, futuristic backdrop.NOTE: Together, these books have over 320 5-star reviews on Amazon! Over 1400 pages of stories, with *exclusive* content from Alexia Purdy, Katie Salidas, and Chrystalla Thoma! Best for ages 16 and up~I AM Alive (Cameron Jace): I am not my heart rate. I am not my skills. I am not how I look like. My name is Decca Tenderstone. I live in a future America where teenagers are ranked on a scale from 1 to 10 on graduation day. There has never been a 10. Those below the rank of 5 are considered Monsters, a liability to society. The system says I am a Monster. I will not let them kill me. I will survive.Initiation (Katie Salidas): Being a Vampire is a crime punishable by eternal servitude in the arena as a Gladiator of the Iron Gate. Mira, a newly turned vampire, must prove she has what it takes to survive in the human's world. It's kill or be killed. Immortality is not guaranteed.Dissension (Katie Salidas): In the aftermath of the great cataclysm, vampires are enslaved by humans and used for blood sport as gladiators in the arena. Mira is undefeated, uncompromising, and unbreakable, but when an escape attempt leads her into the path of the city’s Regent, her destiny is changed forever.Finding Hope (Chrystalla Thoma): After the death of the one person he called mother, Elei leaves the Trashlands of Ost for the city – looking for other people and for answers. But he soon finds out that people are complicated and answers hard to come by...Rex Rising (Chrystalla Thoma): In a world where parasites create new human races, Elei leads a peaceful life as aircar driver — until a mysterious attack on his boss sends him fleeing with a bullet in his side and the fleet at his heels.Resonant (Alexia Purdy): As the first days of the end of humanity tumble across the City of Las Vegas, turning everyone into vampire-like creatures, April Tate will find out what it really means to survive.Reign of Blood (Alexia Purdy): April Tate is a seventeen-year-old ferocious vampire killer who lives in the remains of Las Vegas one year after a viral epidemic has left the world decimated. After her family is abducted, her world tilts when she discovers they're not truly alone.Released (Megan Duncan): After a demon apocalypse kills everyone they know, 17-year old Abby Phillips, her brother and her friend Max flee their home to travel through the wastelands of America, chasing a radio transmissions of a resistance offering shelter. But soon enough Abby and her companions discover what awaits them is much worse they could have ever imagined.Burning Bridges (Nadège K. Richards): In a world divided between Hunters and Warriors, where prisoners are forced to fight in the arena until death, young Princess Echo must fight to find out who she really is and to put a world that has been swallowed by lies back together again",
  "genres": [
    "Dystopia"
  ],
  "author": "Chrystalla Thoma",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/22376574-shades-of-chaos"
}