{
  "title": "Courtney Love: The Real Story",
  "description": "Courtney Love. The girl with the most cake. The girl with the loudest mouth and the fiercest guitar. The girl of many talents -- not least among them the power to shock. Not since Madonna declared that she was like a virgin has someone in the public spotlight so consistently challenged the notion of what it means to be female -- and what it means to be well behaved. In Courtney The Real Story, Poppy Z. Brite tells the whole truth about the lead singer of the band Hole and uncovers more about this pop culture heroine than any music magazine could ever hope to. Replete with revealing details and photographs, information from Love's inner circle, and excerpts from Love's diaries and letters, this book has the intimacy of secrets told to a friend and delivers revelation after revelation. With equal parts compassion and black humor, Brite chronicles the turbulent lives of Love and introduces us to Love Michelle Harrison, the troubled girl who would be queen of postpunk rock, and her childhood spent shuttled from reform school to former stepfathers to family friends. As a precocious, flamboyant teenager, she hung around backstage after concerts, soaking up the star power she knew she had to possess one day, and then traveled to Japan, Taiwan, and Hong Kong to work as a stripper. Brite also takes us to new-wave Liverpool and to that citadel of grunge, Seattle, to see Courtney come of age in the circus that became alternative music, dishing much along the way about some of the biggest stars of that show from past and present. Brite also sets the story straight about Love's life with Kurt Cobain; the allegations of her drug use that surrounded the birth of their daughter, Frances Bean; and the wreckage of Cobain's suicide. But what emerges out of all the drama is a woman determined not only to survive, but to succeed more than anyone ever expected. As seen from her stunning performance as the wife of the publisher of Hustler magazine in The People vs. Larry Flynt, and her transformation into a runway acolyte, she just may catapult herself out of the mosh pit and into the mainstream. Only Poppy Z. Brite, the acclaimed author of literary horror fiction, whom Publishers Weekly called \"a singularly talented chronicler of her generation,\" could have written this outrageous, comic, and ultimately moving tale of ferocious femininity and fishnet stockings. Courtney The Real Story is a no-holds-barred biography that is as raw as a three-chord punk song -- a work that is as uncompromising and as unforgettable as its subject.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Biography Memoir",
    "Memoir",
    "Rock N Roll",
    "Feminism"
  ],
  "author": "Poppy Z. Brite",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/223828.Courtney_Love"
}