{
  "title": "The Lottery",
  "description": "Shirley Jackson's unnerving, macabre tale of random cruelty, The Lottery is one of the most iconic stories ever written, and a touchstone for writers such as Neil Gaiman and Stephen King.'Shirley Jackson's stories are among the most terrifying ever written' Donna TarttEvery year the villagers gather.They can't remember when the Lottery started. Much of the original ceremony has been forgotten or discarded; the first black box lost.But the ritual always ends in the same way...Shirley Jackson's chilling tales of creeping unease and casual cruelty have the power to unsettle and terrify unlike any other. She was born in California in 1916. When her short story The Lottery was first published in The New Yorker in 1948, readers were so horrified they sent her hate mail; it has since become one of the most iconic American stories of all time. Her first novel, The Road Through the Wall, was published in the same year and was followed by five more: Hangsaman, The Bird's Nest, The Sundial, The Haunting of Hill House and We Have Always Lived in the Castle, widely seen as her masterpiece. Shirley Jackson died in her sleep at the age of 48.'An amazing writer' Neil Gaiman'Her stories are stunning, timeless - as relevant and terrifying now as when they were first published ... 'The Lottery' is so much an icon in the history of the American short story that one could argue it has moved from the canon of American twentieth-century fiction directly into the American psyche, our collective unconscious' A. M. HomesExtracts from letters to the New Yorker after the first appearance of 'The Lottery' in 1948:(New York) Do such tribunal rituals still exist and if so where?(Ohio) I think your story is based on fact. Am I right?(Los Angeles) I have read of some queer cults in my time, but this one bothers me.(New York) I expect a personal apology from the author.(Massachusetts) I will never buy The New Yorker again. I resent being tricked into reading perverted stories like \"The Lottery.\"(Connecticut) Who is Shirley Jackson? Cannot decide whether she is a genius or a female and more subtle version of Orson Welles.",
  "genres": [
    "Short Stories",
    "Classics",
    "Horror",
    "Fiction",
    "Dystopia",
    "School",
    "Read For School"
  ],
  "author": "Shirley Jackson",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/22387714-the-lottery"
}