{
  "title": "Come With Me",
  "description": "Lacy spends her time planning events at a country club. Her latest and greatest project is the big Fourth of July celebration. Fireworks lighting up the sky – Red Hot and Boom! She loves the excitement and the spectacular display of sparkles and heat gives her a thrill. The only problem is… Lacy has never had any fireworks of her own. Despite having to listen to her friends tell of their sexual escapades, she has never experienced the big ‘O’. According to the only man she’s ever given herself to, Lacy is frigid. Is something wrong with her or has she just not met the right man for the job?  Jake is the manager of the golf course at the country club. He’s designing and overseeing a building project and the sight of him shirtless and sweating and flexing…has given Lacy ideas. Jake has a certain reputation of being able to handle almost any task he’s given. Rumors of his sexual prowess are legendary. Now, every time Lacy sees him working with his hands, doing some heavy lifting, his body gleaming with the sheen of exertion – she begins to hope that Jake can give her what no one else ever has.  IF - she can just figure out how to ask him. But what Lacy doesn’t know is that Jake has ideas of his own. His outlook on love and life has been molded by the mistakes of his family. He doesn’t think true love exists, there’s just sex. Until he meets Lacy. This Fourth of July celebration proves to have more explosions in store than those in the sky, for Jake sets out to prove that he can give Lacy exactly what she needs. In fact, Jake intends to show Lacy that what she needs – is him.  Break out the fireworks and get ready to kick off your summer with this HOT new collection of Stories. Come With Me is part of the Red Hot and Boom! multi-author series. *Content Warning: Contains Explicit Scenes and Content. Intended for 18+ Audience",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Erotica"
  ],
  "author": "Sable Hunter",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/22384803-come-with-me"
}