{
  "title": "Broken Phoenix",
  "description": "Dear Author,I’m a phoenix (pic 1). Unfortunately, I’m a pretty terrible phoenix. I can’t seem to control my fire. I lose my feathers (I could give you my father’s lecture on that word for word, I’ve heard it so many times). And worst of all, my tears don’t heal. I’ve pretty much been a hermit since my clan kicked me out ten years ago.The other day this man came to my cave claiming he needed a phoenix to help him with his quest. I was so startled I lit half my clothes on fire and scared him away. I can see him climbing the trail towards my cave again. What in the world does he want?Pic 2 is the third undersecretary to the royal historian (or some similar underling position within the royal court) and discovered something he shouldn’t have. He can’t tell anyone or he will be killed so he has to fix it all on his own…except maybe for the help of one hermit phoenix.Photo Descriptions: Photo 1: A shirtless, slender man with hard-taut muscles gazes thoughtfully ahead. Around him, singed and burned feathers waft to the ground. His short red hair either burns with orange-dancing flames or perhaps catches the raw yellow sunlight, giving him a fire-roasted appearance. His raw sensuality simmers, as if the air around him is charged with electricity and yet refuses to ignite into passion.Photo 2: A tranquil, lavender-shirted man holds a book in his right hand and a lantern in his left. He’s young, mid-twenties, a thin man. His tight black pants and elegant dress shirt convey a sense of timeless style. Pages seem to leave the book and fly away, as if magically lifted by the wind. Despite the floating pages and the bruised blues and greens in the dangerous sky before him, the man with raven hair and a dark purple streak remains calm, absorbed. Around him, delicate flowers blossom with long, curled petals, as delicate and strong as this man himself.This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Magic",
    "Short Stories"
  ],
  "author": "Edmond Manning",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/22385891-broken-phoenix"
}