{
  "title": "Pathetic Symphony: A Novel About Tchaikovsky",
  "description": "Like Mephisto , Pathetic Symphony is a novel about important artists and their milieu. Drawing his material from documented sources, and without ever distorting historical truth or sacrificing biographical accuracy for the sake of the narrative, Klaus Mann here presents a moving and unforgettable story of a tortured genius of music -- Peter llych Tchaikovsky. When the book was first published in 1948, The New York Times praised its \"erotic passages and the recreation of the European musical society -- Brahms, Wagner, Grieg, Rubinstein, Mussorgsky walk through the pages.\" Inextricably bound up with Tchaikovsky's life are people who provide the rich orchestration of the his \"beloved friend\" and mysterious benefactress, Madame von Meek, whom he never met personally; Désirée Artôt, the Belgian singer, with whom the young, struggling composer believed himself madly in love; Antonia Miliukov, the pathetic partner in Tchaikovsky's short-lived and tragic marriage; and Tchaikovsky's nephew Vladimir Davydov, whose youth and charm captured the heart of the older man. Tchaikovsky's trials and triumphs, adventures and strange compulsions, maladjustments and neuroses inspired Klaus Mann's admiration and compassion. Both were cosmopolitans who spent more time abroad than in their own countries; both raised the suspicion and envy of their contemporaries at home. According to Mann, Tchaikovsky was the prototype of a man without a country. In Russia, Tchaikovsky's works were criticized as being too Western, the Germans accused him of Asiatic primitivity, and the Parisians found him overly Germanic. Mann wrote Tchaikovsky's story with the conviction of personal \"I could describe all of it; none of it was alien to me,\" he wrote in The Turning Point. Christopher Isherwood wrote of Mann, his friend, \"From his earliest days, he inhabited the circles of the brilliant and famous. He experienced pleasure and success at an age when one is best able to enjoy them. He traveled widely and continuously -- so much so that the huge upheaval of the Emigration [from Nazi Germany to Holland and then to the U.S.] seemed, as far as he was concerned, to be no more than an extension of his normal way of living. During the last sixteen years of his life, Klaus produced an impressive body of work -- novels, non-fiction books, and innumerable articles -- under circumstances that would have reduced most writers to impotent silence.\"",
  "genres": [
    "German Literature",
    "Music",
    "LGBT",
    "Biography",
    "Russia",
    "Historical",
    "Germany"
  ],
  "author": "Klaus Mann",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/223872.Pathetic_Symphony"
}