{
  "title": "Cherry Ames, Island Nurse",
  "description": "Cherry Ames is back, just as you remember her! The books are just as you remember them, retaining the same look, feel, and sense of adventure and patriotism as when they were first published. With fully illustrated color covers and a soft-finished hardcover format just like the originals, these books will transport you back to the days when you were reading about this spunky young nurse. Series editor and registered nurse Harriet Forman was inspired by, and remains a devoted fan of, Cherry Ames: \"...I was going to follow in her footsteps and become a nurse--nothing else would do.\" Little does Nurse Cherry realize when distinguished Sir Ian Barclay is rushed by his nephew Lloyd to Hilton Hospital that her newest case will carry her north to misty, sea-beaten Balfour Island, off the rugged coast of wind-swept Newfoundland. \"Sudden hemorrhage of a peptic ulcer,\" Dr. Joe Fortune had quickly diagnosed, and Cherry is assigned to care for the truculent but endearing old Scotsman. Cherry soon suspects that more than illness is worrying the peppery owner of the Balfour Iron Mines, and her suspicions only deepen upon their arrival at Barclay House on Balfour Island. True, there is trouble at the mines. But the mysterious actions of Sir Ian's erstwhile friend, Jock Cameron, force Cherry to conclude that trouble of even greater consequence is in the making. What hold does the industrialist Broderick have over Sir Ian? Who is \"Little Joe\" Tweed, and why does his trawler Heron ride at anchor off Balfour Island? The startling solution to this baffling mystery waits for Cherry in three different places: deep in the salt-stained recesses of Rogues' Cave, in the musty tower room of Barclay House, and in the hole on the hill. But first Cherry must face the effects of an island storm, as she and the island doctor struggle to save the crew of a shoal-wrecked boat.",
  "genres": [
    "Mystery",
    "Fiction",
    "Childrens",
    "Historical Fiction",
    "Young Adult",
    "Medical",
    "Classics"
  ],
  "author": "Helen Wells",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/2238632.Cherry_Ames_Island_Nurse"
}