{
  "title": "Wielding Crimson",
  "description": "\"Wielding Crimson\" is the first book in the Wielding Series.-Layla Russo is a famous singer, who has everything anyone could dream of -fame, fortune, and beauty. But appearances can be deceiving; behind closed doors she is bound to her domineering manager and can only dream of a world in which she can be a normal person. When she gets a chance to go on a relaxed vacation with her longtime friend Agnes and her brothers, Philip and Hector, in Greece she eagerly agrees, longing for a break from her hectic life. What she hadn't counted on was that she'd fall in love with Agnes' younger brother Philip, who has an agenda of his own, and find herself in the middle of a secret society of supernatural beings, the wielders, and the war waging among them on the sidelines of the human world. -Philip Doukas is a rare wielder of light, living his life torn between beautiful women, lavish parties and trying to bring down the corrupt Wielder government with his older brother, Hector. But, he has a secret; a warning given to him five years ago by a wielder who predicted that a mysterious human woman would one day be his destruction. When Philip unexpectedly finds himself face to face with her on his family vacation on Corfu Island in Greece, he makes the decision to take his destiny in his own hands; destroy her, before she destroys him. But it turns out it isn't as easy as he had thought; Layla seems to have a strange pull on him, and before he knows it Philip gets tangled in a web of his own lies, his feelings for Layla and his role in the dawn of a war amongst his kind.-Orestes Angelou is a flesh wielder working for the Sect -the covert operation system of the Wielding Community. He is dangerous, sadistic and highly efficient. His mission is to find and assassinate certain humans whose names are given to him by the mysterious Threaders. While searching for a particularly difficult-to-find human, Orestes gets involved in something bigger and more dangerous than he could possibly imagine, and one single mistake leads him down a dangerous spiral with terrible consequences.-Induna is a rare psyche wielder who has the power to connect with the universe and foresee possible futures. His solitary existence in a cave in Zimbabwe was interrupted years ago by a young Philip, who had intended to help him grasp his potential and give him a better life. Instead, Induna chose to stay in his home, but rewarded Philip with a warning about a young woman whom he saw in the young man's future. \"She will destroy you.\" Now, five years later, Induna can see the threads of the Universe moving fast, bringing Philip and the woman closer together and he makes the terrifying realization that he had been mistaken and his warning will lead Philip down the road of destruction he so wants to avoid. Knowing that only he can save his friend, Induna embarks on a desperate journey that will take him to places he had never imagined.Advisory to the reader: The book contains explicit language, scenes of graphic violence and mild sexual scenes.",
  "genres": [],
  "author": "D.M. Enslin",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/22386109-wielding-crimson"
}