{
  "title": "Lightspeed Magazine, Issue 49, June 2014: Women Destroy Science Fiction!",
  "description": "It could be said that women invented science fiction; after all, Mary Shelley's Frankenstein is considered by many to be the first science fiction novel. Yet some readers seem to have this funny idea that women don’t, or can’t, write science fiction. Some have even gone so far as to accuse women of destroying science fiction with their girl cooties. So to help prove how silly that notion is, LIGHTSPEED's June 2014 issue is a Women Destroy Science Fiction! special issue and has a guest editor at the helm.The issue features original fiction by Seanan McGuire, Charlie Jane Anders, N.K. Jemisin, Carrie Vaughn, Maria Dahvana Headley, Amal El-Mohtar, and many more. All together there's more than 180,000 words of material, including: 11 original short stories, 15 original flash fiction stories, 4 short story reprints and a novella reprint, 7 nonfiction articles, and 28 personal essays by women about their experiences reading and writing science fiction.Table of ContentsFROM THE EDITORSEditorial, June 2014: Women Destroy Science Fiction!ORIGINAL SHORT STORIES — edited by Christie YantEach to Each by Seanan McGuireA Word Shaped Like Bones by Kris MilleringCuts Both Ways by Heather ClitheroeWalking Awake by N.K. JemisinThe Case of the Passionless Bees by Rhonda EikampIn the Image of Man by Gabriella StalkerThe Unfathomable Sisterhood of Ick by Charlie Jane AndersDim Sun by Maria Dahvana HeadleyThe Lonely Sea in the Sky by Amal El-MohtarA Burglary, Addressed By a Young Lady by Elizabeth Porter BirdsallCanth by K.C. NortonREPRINTS — selected by Rachel SwirskyLike Daughter by Tananarive DueLove is the Plan the Plan is Death by James Tiptree, Jr. (Alice Sheldon)The Great Loneliness by Maria Romasco MooreKnapsack Poems by Eleanor ArnasonThe Cost to Be Wise by Maureen F. McHugh (novella)ORIGINAL FLASH FICTION — edited by Robyn LupoSalvage by Carrie VaughnA Guide to Grief by Emily FoxSee DANGEROUS EARTH-POSSIBLES! by Tina ConnollyA Debt Repaid by Marina J. LostetterThe Sewell Home for the Temporally Displaced by Sarah Pinsker#TrainFightTuesday by Vanessa TorlineThe Hymn of Ordeal, No. 23 by Rhiannon RasmussenEmoticon by Anaid PerezThe Mouths by Ellen DenhamM1A by Kim WinternheimerStandard Deviant by Holly SchofieldGetting on in Years by Cathy HumbleRo-Sham-Bot by Effie SeibergEverything That Has Already Been Said by Samantha MurrayThe Lies We Tell Our Children by Katherine CrightonNONFICTION — edited by Wendy N. WagnerArtists Spotlight by Galen DaraIllusion, Expectation, and World Domination Through Bake Sales by Pat MurphyWomen Remember by Mary Robinette KowalInterview: Kelly Sue DeConnick by Jennifer WillisHow to Engineer a Self-Rescuing Princess by Stina LeichtThe Status Quo Cannot Hold by Tracie WelserScreaming Together: Making Women’s Voices Heard by Nisi ShawlPERSONAL ESSAYS — edited by Wendy N. WagnerWe are the Fifty Percent by Rachel SwirskyScience Fiction: You’re Doin’ It Wrong by Maya Kaathryn BohnhoffJoin Us in the Future Marissa LingenAre We There Yet? by Sheila FinchNot a Spaceship, Robot, or Zombie in Sight by Anne CharnockWriting Among the Beginning of Women by Amy Sterling CasilToward a Better Future by Nancy Jane MooreWe Are the Army of Women Destroying SF by Sandra WickhamRead SF and You’ve Got a Posse by Gail MarsellaStomp All Over That by O. J. CadeFor the Trailblazers by Kristi CharishWomen are the Future of Science Fiction by Juliette WadeWe Have Always Fought by Kameron HurleyWriting Stories, Wrinkling Time by Kat HowardWhere Are My SF Books? by DeAnna KnipplingReading the Library Alphabetically by Liz ArgallStepping Through a Portal by Bonnie Jo StufflebeamThe Wendybird by Stina LeichtI Wanted to be the First Woman on the Moon by Sylvia Spruck WrigleyNever Think of Yourself as Less by Helena BellAn ABC of Kickass by Jude GriffinStocking Stuffers by Anaea LayBreaching the Gap by Brooke BolanderWomen Who Are More Than Strong by Georgina KamsikaA Science-Fictional Woman by Cheryl MorganYour Future is Out of Date, Pat MurphyStray Outside the Lines by E. Catherine ToblerMy Love Can Destroy by Seanan McGuireAUTHOR SPOTLIGHTS — edited by Jude GriffinSeanan McGuireKris MilleringHeather ClitheroeN.K. JemisinRhonda EikampTananarive DueGabriella StalkerCharlie Jane AndersMaria Dahvana HeadleyAmal El-MohtarElizabeth Porter BirdsallK.C. NortonEleanor ArnasonMaria Romasco MooreMaureen McHugh",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Fantasy",
    "Feminism",
    "Audiobook"
  ],
  "author": "Christie Yant",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/22386622-lightspeed-magazine-issue-49-june-2014"
}