{
  "title": "The Needing Moore Series Trilogy: Searching for Moore, Moore to Lose, & Moore than Forever",
  "description": "THE NEEDING MOORE SERIES~ SEARCHING FOR MOORE, MOORE TO LOSE & MOORE THAN FOREVER ~PLUS Bonus Chapters and a Sneak Peek at MOORE THAN A FEELING ~ Holly Moore’s much-anticipated story!‗‗‗‗‗All three Bestselling, Top-Rated Books from The Needing Moore Trilogy by USA Today Bestseller Julie A. Richman, PLUS never before seen BONUS CHAPTERS for each book.‗‗‗‗‗Sometimes the one you never got over is just a friend request away …There were no cell phones or internet or google when she left me and I never knew why she walked away from our relationship. I loved her, like head-over-heels crazy loved her. And when she walked out on me at the end of our freshman year, without even a goodbye, she broke my heart.So, I got a surprise gift the other night at my birthday party, an old college friend casually mentioned he saw her on Facebook. Best present I’ve received in over twenty years. Now, I’m finally going to get my answer. She owes me an explanation at to why she left … Damn, I loved her.‗‗‗‗‗‗‗‗‗‗I was having such a crappy morning at work and then his email arrived. It was a friend request and to say I was shocked would be an understatement. A lifetime had passed since we’d last been in contact. But just seeing his name on my computer screen, made me react in a way I thought I was no longer capable of, you see, I had never gotten over loving him, even though he betrayed me.And so begins the saga of Schooner Moore and Mia Silver, lovers separated after their first year of college and not reunited again for over twenty years. But two decades was not long enough for their flame to be extinguished and reuniting could cost them everything.",
  "genres": [
    "Romance",
    "Second Chance",
    "Contemporary",
    "Contemporary Romance",
    "Anthologies",
    "Adult",
    "College"
  ],
  "author": "Julie A. Richman",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/22382945-the-needing-moore-series-trilogy"
}