{
  "title": "Indecent",
  "description": "Book 1 of the multi-episode series The Cage Sessions My books are the raw, unfiltered vision of a slightly schizophrenic, sex-obsessed, vodka-swilling \"living contradiction\" with profanity issues. They are often unrealistic ( FUN) depictions of what life would be like if erotic romance fantasies came true, so sometimes... gasp! ... things will happen that aren't \"realistic\". (You know, kind of like how dull boring everyday life is realistic. Seriously, do you want to read about that?) If you are offended by the excessive use of dirty words, crass descriptions, or crude stream-of-consciousness writing laced with potty-mouthed expressions and graphic descriptions of non-traditional carnal delight, then you need to RUN from my writing right now! Don't say you weren't warned. (Oh, and you'd better be over 18! Don't even think about buying my books if you aren't.)Annika is a reporter for MiamiImproper.com , a struggling web magazine. Damien Cage is rock star frontman for the Platinum-selling band Eon Sphinx.When her boss sends Annika to interview Damien at his Biscayne Bay estate, she can't believe it. Now 22 and trying to find her path in life, Annika struggles to let go of her strict religious upbringing. She yearns to be sexually free, enjoying all that life has to offer.Just turned 30, Damien is surrounded by beautiful girls. He trains them in the \"Deviant Arts of Pleasure.\" But none of them are on his level. Disillusioned and jaded with the music industry, he has quit his band in search of something more meaningful out of life.When Annika and Damien meet, sparks fly. The steam between them is hotter than the Florida sunshine.Damien makes an offer to Annika. Neither realizes it yet, but it's an offer that will fill their lives with both deep meaning AND sizzling passion... starting at one of Damien's infamous Friday night parties full of decadence and debauchery.Approximate 15,000 words (a novelette)This is the first title in a series. There IS a cliffhanger ending. You have now been warned about that too. Erotic romance, coming of age, new adult, kink, BDSM, rock star, alpha male, tattoos, body piercings, body paint, controlling parent, sexual freedom, sex positive, gender fluidity.",
  "genres": [
    "Erotica",
    "Romance",
    "BDSM",
    "Contemporary Romance",
    "Short Stories",
    "Novella",
    "New Adult"
  ],
  "author": "Skylar Cross",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/22389373-indecent"
}