{
  "title": "All the Way",
  "description": "It seemed as though nothing could stop Jordin Tootoo on the ice. The captain of Canada’s Under-18, a fan favourite on the World Junior squad, and a WHL top prospect who could intimidate both goalies and enforcers, he was always a leader. And when Tootoo was drafted by Nashville in 2000 and made the Predators out of camp in 2003, he became a leader in another way: the first player of Inuk descent to suit up in the NHL.The stress of competition in the world’s top hockey league, the travel, the media, the homesickness—and the added pressure to hold one’s head high as a role model not only for the young people of his hometown of Rankin Inlet but for the culture that had given him the strength and the opportunities to succeed—would have been more than enough to challenge any rookie. But Tootoo faced something far more difficult: the loss of his brother in the year between his draft and his first shift for the Predators. Though he played through it, the tragedy took its inevitable toll. In 2010, Tootoo checked himself into rehab for alcohol addiction. It seemed a promising career had ended too soon.But that’s not the way Tootoo saw it and not the way it would end. As heir to a cultural legacy that included alcohol, despair, and suicide, Tootoo could also draw on a heritage that could help sustain him even thousands of miles away from Nunavut. And in a community haunted by the same hopelessness and substance abuse that so affected Tootoo’s life, it is not just his skill and fearlessness on the ice that have made him a hero, but the courage of his honesty to himself and to the world around him that he needed to rely on others to sustain him through his toughest challenge.All the Way tells the story of someone who has travelled far from home to realize a dream, someone who has known glory and cheering crowds, but also the demons of despair. It is the searing, honest tale of a young man who has risen to every challenge and nearly fallen short in the toughest game of all, while finding a way to draw strength from his community and heritage, and giving back to it as well.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Hockey",
    "Biography",
    "Memoir",
    "Indigenous",
    "Biography Memoir"
  ],
  "author": "Jordin Tootoo",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/22392857-all-the-way"
}