{
  "title": "First Blood",
  "description": "From New York Times bestselling author, David Morrell, comes a classic thriller that introduced the character of Rambo, one of the most iconic action heroes of the twentieth century. Called \"the father of the modern action novel,\" First Blood changed the genre. Although the book and the film adaptation have similarities, they are very different, especially its unexpected ending and its greater intensity. If you've only experienced the film, you're in for a surprise. Once they were soldiers. Rambo, the ragged kid whose presence in town is considered a threat. And Teasle, the Chief of Police of Madison, Kentucky. Both have been trained to kill: Rambo in Vietnam, Teasle in Korea. They learned different military tactics, different ways of death and survival in two different wars. Now, without warning, they are enemies in a civilian combat that becomes a chase through the woods and mountains and caves above the town. As we follow them, we understand that once a man has been trained as a killer, perhaps he is changed forever. Award-winning First Blood was published in 1972, was translated into 26 languages, and has never been out of print. It was one of the first novels to deal with post-traumatic stress disorder. David's novelizations for Rambo (First Blood Part II) and Rambo III are available as e-books. They're quite different from the films and include revealing introductions. See also David's Rambo and Me: The Story Behind the Story. Critical reactions: \"A fine novel. . . . When Johnny comes marching home this time, watch out.\" —The New York Times Sunday Book Review \"A first-rate thriller.\" —Newsweek \"One of the finest chase novels you will ever read.\" —Minneapolis Tribune \"A terrific thriller.\" —Saturday Review \"One hell of a hard, fast novel.\" —John D. MacDonald",
  "genres": [
    "Fiction",
    "Thriller",
    "Action",
    "War",
    "Adventure",
    "Military Fiction",
    "Classics"
  ],
  "author": "David Morrell",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/113110.First_Blood"
}