{
  "title": "One Song Away",
  "description": "She needs a fill-in boyfriend. He needs a favor. It’s the perfect, no-strings arrangement until they both realize it’s too real…Sophie-Claire Wright’s life is like a bad country song on repeat. She keeps running into her cheating ex, her songwriting career isn't taking off, and her roommate just kicked her out of their apartment. With nothing to lose, she decides to do the one thing she said she’d never do: she moves back home. She left her small Southern town with big dreams, but now she’s going home with empty pockets.Life moves at a slower pace in Sophie’s blink-and-you’ll-miss-it hometown, but her well-meaning, matchmaking mama doesn't have a slow gear. Sophie invents a boyfriend to hold off her mother’s efforts, but she’s out of luck when her mom wants to meet him. Sophie panics until she runs into Jake Cooper. Her high school crush (and former best friend) is back in town, too, and when he asks her for a favor, she agrees...on one condition. He says he’ll be her fill-in boyfriend, so it should be simple: re-introduce him to her family and then “break up” with him after a few weeks.Sophie is sure she’ll be able to resist Jake this time. Sure, she was in love with him years ago, but that was then. This is now, no matter how great he looks, or how she feels around him. But she didn't bargain for moments that feel all too genuine. Dates that don’t seem fake. Kisses that leave her shaken and wanting more. Sweet moments where she forgets they aren't really dating. And she didn't count on old feelings resurfacing and complicating their arrangement—which is starting to feel less like acting and more like the real deal.Soon, Sophie can’t tell which kisses are real or fake, but she knows she’s in deep...and she thinks Jake is, too. When she gets a chance to go back to Nashville and chase her dreams again, she has a choice to make: stay or go? Continue hoping that the life she wants is one song away, or finally write her own song?",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary",
    "Fiction"
  ],
  "author": "Molli Moran",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/22398221-one-song-away"
}