{
  "title": "The Bookmaker of Business: A Financial Tale",
  "description": "Must read for anyone with a bank account. Why do the rich get richer and the poor get poorer? From earliest recorded history, mankind has been comprised of the haves and the have-nots. But what separates the two? This simple parable reveals the cause and effect relationship of why some get richer while most stay poor. It tells the tale of a common laborer on a journey of self-enlightenment, who stumbles upon the secret as to how the rich have increased their wealth from ancient times. It simplifies and sheds light on the mysterious world of banking, how they make their profits, and how to protect oneself from bank failures. It also reveals how banks and other institutional investors maximize their returns and how individuals can do the same. But be warned. This story's simple and direct style may make you uncomfortable, especially if your actions are making you poorer. Are you ready? Bankers are the bookies of our economy. The bankers are playing a game where the odds are in their favor and they know it. Yet they are also prone to making mistakes that can have severe consequences for their depositors and society at large. Bank failures can ripple through the economy causing distress and chaos. But you can protect yourself from bank failures if you know what to look for. By virtue of a simple balance sheet examination, you can determine which banks are healthy and which are not. Like the bankers, the big money institutional investors are also playing a game where the odds are in their favor. They play the financial markets how a casino plays against a According to their rules. This gives them a decided edge. But the good news is that with the proper knowledge anyone can duplicate these methods, regardless of their bankroll size. The federal reserve and other central banking institutions support the financial markets to the benefit of the banks. Fortunately, we can also use this to our advantage. With the information presented here, you can emulate the actions of the big money players and use global liquidity operations to increase your wealth significantly. Through the universal power of compound interest, you can reap windfall profits in a money game that will skew decidedly in your favor. These are the same wealth secrets that Warren Buffett has used for years to trounce the stock market averages. This little volume lifts the veil off commercial banking unlike any other work of its kind. You may never look at your bank the same way again.",
  "genres": [],
  "author": "Murray H. Williams",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/22396204-the-bookmaker-of-business"
}