{
  "title": "Merciless Ride",
  "description": "Mercy is no friend of mine. Karma, she has yet to show kindness to me. The hits just keep on coming for Tessie Marie Harlow. She has never had an easy life. Her mom disabled, her dad long gone, and a single mom raising a rambunctious little boy, that’s Tessie’s world. Her childhood aspirations to be a nurse long since disappeared after a college spring fling both blessed and burdened her with a baby boy. Dropping out of school, she returns to her hometown and begins to settle in. Getting the only job she could as a bartender she spends her days caring for her son and nights serving the Hellions Motorcycle Club and their affiliates. Tired of waiting for Rex to grow up, she’s faced with the bane existence of her life until one night changes everything. In the darkest hour of her merciless ride through life, she’s saved by a quiet, laid back Hellion. Andy ‘Shooter’ Jenkins has always been around. Too wrapped in Rex she has never really noticed him before. He has never been loud or known to have the girls hanging all over him. He is a mystery. A chance encounter brings him to her rescue not once but twice. The Desert Ghosts Motorcycle Club are in town and bring their own brand of chaos right to Tessie’s door. Forced into her day to day life, Shooter is doing everything he can to shelter and protect her as lines are crossed and a war between two clubs begins. Secrets revealed putting two brothers in the Hellions Motorcycle Club at a serious crossroads in their lives. This is not a ride for pleasure. This is not a ride for safety. This is not a ride for love. This is a ride for endurance. Mercy has never once shined her grace down for these two, but in the midst of the danger and lies can they learn to rely on one another and ride it out together? *This book contains violence, rape, adult content and language and is not suitable for readers under the age of 18*",
  "genres": [
    "Romance",
    "Audiobook",
    "Contemporary Romance",
    "Contemporary",
    "Motorcycle",
    "Family",
    "Abuse"
  ],
  "author": "Chelsea Camaron",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/22404998-merciless-ride"
}