{
  "title": "Mr. Jaguar",
  "description": "--- One day you’ll be pumping my gas ---Mike Miller’s life has gone to shit. The formerly popular high school quarterback now works at a gas station in the middle of nowhere. The last thing he needs is meeting the guy he used to bully at school and seeing him all sorts of polished up. James is now the proud owner of an amazing silver Jaguar and a self-made millionaire. It seems that the day couldn’t get any worse for Mike, but James ‘Lovelace’ Austin might just turn out to be his golden ticket out of the job he hates.When James Austin meets Mike Miller, his high school crush and tormentor all in one, working at an old, dirty gas station, it feels as if the stars have finally aligned in his favor. He wants to finally get his revenge on the guy, but when Mike turns out to be gay, the whole afternoon takes a turn for the surreal. Instead of just humiliating Mike at his workplace, James decides to hire him for a weekend at a conference he’s attending. A hot guy by his side is the only accessory James needs to rub his success in the faces of his frenemies.Only problem is, a gay Mike Miller might be too much of a blast from the past than James ever expected. If James wants his nerdy heart safe from the hunky jock, he needs to keep Mike at arms length. The task would be a lot easier if Mike wasn’t unashamedly hitting on James. Or is it just James’s money Mike is after?Photo Description: Two men lie on a bed locked in a passionate embrace. Completely naked, oblivious to the world around them, they share something special, a bond they couldn’t possibly have with anyone else.This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Enemies To Lovers",
    "LGBT",
    "Short Stories",
    "Gay"
  ],
  "author": "K.A. Merikan",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/22401386-mr-jaguar"
}