{
  "title": "Shame On Her Boxed Set",
  "description": "For the first time, all three volumes of Shame On Her together in one collection! VOLUME 1 “Shaming the Au Pair” – A jealous housewife arranges for her pretty au pair to “accidentally” fall into a muddy pond in her back yard. The girl has to strip off her filthy clothes in front of the neighbors, then stand in the yard completely naked while she’s hosed off. “Shaming the Stepmother” – When an 18-year-old boy catches his 24-year-old stepmother having an affair while his father is out of town, he punishes her by making her cook, clean, and do other housework in the nude before she’s paraded semi-naked in front of the neighbors. “Shaming the Bartender” – A redheaded bartender gets caught over-billing and double-charging her drunken male customers. Two of the men’s wives strip and spank the girl in public, but the punishment doesn’t end there. VOLUME 2 “Shaming the Maid” – A Brazilian beauty gets caught stealing money and jewelry from one of her clients. As punishment, she cleans the house in the nude—along with other, more personal cleaning tasks. Afterward, she has to wash the windows and do yard work totally naked while trying her best to avoid the neighbors. “Shaming the Camp Counselors” – Two rookie female counselors learn that the hazing ritual at Camp Hillcrest is no picnic. First they’re ordered to do chores around the camp wearing only their underwear, then they’re marched to the exercise field totally nude where they have to do jumping jacks, push-ups, and run an obstacle course in front of all the other counselors. “Shaming the New Secretary” – Lisa passes out after sleeping with her boss during an office party, then wakes up the next morning and can’t find her dress. After a humiliating attempt to barter some clothes from a janitor, Lisa is ordered to work nude by the other secretaries. VOLUME 3 “Shaming the Anchorwoman” – When a hot 40-year-old anchorwoman returns home to Estonia after 20 years of working in the USA, the news director puts her on TV in skimpy outfits before he makes her conduct an interview totally nude. The final act of humiliation comes when the woman is persuaded to perform a very personal service for her old boss. “Shaming the Class President” – When she’s caught cheating on a test, the stuck-up class president is blackmailed into helping the school football team with their car wash fundraiser. First the cheerleaders trick her into washing cars in the nude, then they spank and tease the girl the entire time. To get her clothes back, the class president performs a “special favor” for the cheerleading squad’s only lesbian. “Shaming the Shoplifters” – After they’re caught shoplifting, two college girls are taken to the store manager’s office where they’re stripped, frisked, and photographed. One girl tries to seduce a security guard, but when that escape plan fails the girls end up running out an emergency exit stark naked. They think they’re in the clear when they finally reach their car, but the humiliation doesn’t end there.",
  "genres": [],
  "author": "K.C. Silkwood",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/22415620-shame-on-her-boxed-set"
}