{
  "title": "The Rickover Effect: How One Man Made a Difference",
  "description": "More than anyone else, Adm. Hyman G. Rickover made nuclear power a reality. Building on the scientific breakthroughs of the atomic bomb project, he created the nuclear Navy almost overnight, when nearly everyone else thought it was a pipe dream, and built the world’s first commercial atomic power station. He did most of this in a single decade.Rickover’s incredible ability to get things done won his program wide public acclaim and personal honors that included presidential citations, honorary doctoral degrees, and congressional gold medals. Despite all this, Rickover was the subject of bitter controversy and was twice passed over for promotions. In 1953 he was saved from involuntary retirement only through congressional intervention. Nearly forty years later, when he was fired as a four-star admiral, all three living American ex-presidents attended his post-retirement party.Now, for the first time, one of Rickover’s close associates tells what it was like to be with this remarkable man day and night as he accomplished his miracles, and why he was bitterly opposed by so many powerful people. Theodore Rockwell, the admiral’s long time technical director, takes the reader behind the “zirconium curtain” that protected the program to give an inside account of those turbulent times. Using on-the-spot anecdotes and little-known documents, he explores Rickover’s methods and relationships with others to help us understand his strengths and weaknesses.The author describes Rickover’s successes beginning right after World War II in Oak Ridge, Tennessee. His account includes the first submarine voyage from Pearl Harbor to England to the North Pole, the continuously submerged round-the-world journey of the USS  Triton , and the buildup of the U.S. nuclear fleet and the civilian nuclear power industry.This candid, insightful portrait could only have been written by a key player. The Rickover Effect makes and important contribution to the understanding to one of this century’s most elusive personalities.",
  "genres": [
    "Biography",
    "History",
    "Military Fiction",
    "Nonfiction",
    "Leadership",
    "Business",
    "True Story"
  ],
  "author": "Theodore Rockwell",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/2240876.The_Rickover_Effect"
}