{
  "title": "Betting on You",
  "description": "A Summerville NovelAlways a Bridesmaid Book 1He'd always bet on her, always...Lark March is over Mason Stewart, so over him she's practically forgotten the cruel way he ended things four years ago. At least that's what she's told her sisters... But when Mason shows up at her best friend's wedding, talking sweet and looking even sweeter, Lark can't deny the man still gets to her in a major way.Mason Stewart was a messed up kid, but he's a man now, a man who knows what he wants and won't stop until he's convinced the only woman he's ever loved that they are meant to be. He persuades Lark to give him seven days to remind her why they belong together. At the week's end, Lark may tell him to get out of her life for good, but Mason's betting on true love for the win.But when old secrets come to light, Lark and Mason will find their rediscovered love tested, and happily ever after harder to hold on to than either of them wagered.Fans of Bella Andre, Kristan Higgins, and Susan Mallery will love the Always a Bridesmaid romance series, stories featuring sassy Southern women and the alpha males who love them.Other books by Jessie Always a Bridesmaid SeriesBook 1: Betting on YouBook 2: Keeping YouBook 3: Wild For YouBook 4: Catching You (A Summerville Short Story)Book 5: Taking You (A Summerville Novella)Fire and Icing Book 1: Melt With YouBook 2: Hot for YouBook 3: Sweet to YouBook 4: Perfect for You (A Summerville Short Story)Book 5: Saving You (A Summerville Novella)Edgy, New Adult Wild Rush  One Wild NightBook 1: This Wicked RushBook 2: One Perfect LoveJessie Evans gave up a career as an international woman of mystery to write the sexy, contemporary romances she likes to read. A Southern girl, born and bred, Jessie loves writing romances with sizzle, and hopes you'll enjoy her stories set in the south.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Fiction",
    "Second Chance",
    "Amazon",
    "Contemporary",
    "Chick Lit"
  ],
  "author": "Jessie Evans",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/22415391-betting-on-you"
}