{
  "title": "Love Charms",
  "description": "10 scorching paranormal romances for ONLY 99 cents! LIMITED TIME ONLY! (REGULAR $9.99)Escape into the world of paranormal romance, a magical journey featuring delicious demons, wanton witches, zealous zombies and more that promise you a hauntingly good time! Featuring spell-binding novels from popular New York Times, USA Today, Amazon, and Barnes and Noble bestselling authors, including Ava Catori, Selena Kitt, Cerys du Lys, Deanna Roy and more, these enchanting books will be sure to charm, beguile and bewitch you! Blinded by Magic, A Witch Romance by Ava Catori: Raven's weakness is mortal men. She's fallen hard for Derek. There's just one problem, he doesn't know she's a witch. Can he accept her truth or will their relationship crumble? Blind Date by Selena Kitt: Selena Kitt's Blind Date ventures into the strange and surreal realm of magical realism in a hot Valentine's Day romance that takes on the classic Greek myth of Eros and Psyche. Breathless by Cerys du Lys: Sadie and Evan live in different worlds. Brought together by fate, and held there by hope, can they bridge the gap dividing humanity, or will long held fears and prejudice force them apart forever? The Passion Cure by Deanna Roy: Jet is a Nix, an outcast enchantress with zero power. To conjure a love spell to save her family, she seduces a handsome enchanter who is willing to break the rules, and possibly, her heart. Marked by Charisma M.  Jade Murray is a witch that can communicate with the dead. After a summoning goes awry, two murders rock the human and supernatural world. One thing connects the gruesome Jade. The Warlord's Concubine by J.E. & M. Keep: As a servant to the princess for much of her life, Mirella sees the conquest of the land as an opportunity to elevate herself. A Demon and His Witch by Eve Langlais: Remy's seen a lot during his tenure in Lucifer's guard, but nothing can prepare him for the witch with the acerbic tongue--and voluptuous figure. Can he convince her to love him and not kill him? Psychic Appeal by Michelle McCleod: Psychic Sofia Parker has fallen in love, a problem because her new relationship drives the lovesick ghost of her ex-boyfriend to come back from the dead...anyway he can. Memoir of a Reluctant Shaman by Ty Nolan: When his love spell goes wrong, our hero is exiled to be fully initiated as a Shaman in this spicy tale of New Orleans Voodoo and Native American magic. Vampire Lords of Blacknall: Trinity by Shirl Only a creature of the night can save her. Lady Beth Winslow never stays home at night. She fears her stepbrother. Then a monster stalks her in the dark woods and she cannot tell beast from savior.",
  "genres": [
    "Paranormal",
    "Anthologies",
    "Romance",
    "Fantasy",
    "Paranormal Romance"
  ],
  "author": "Michelle McCleod",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/22410147-love-charms"
}