{
  "title": "Saudade",
  "description": "The interwoven stories of Ann Parker’s past and the Azores’ past unfold in Saudade.Not discovered until the 15th century, the archipelago became a crossroad of cultures during the Age of Exploration. [Settlers] planted orange orchards and tea plantations, excelled at whaling and fishing, made cheeses and wines prized by European royalty, and they thrived until one by one their endeavors were dealt death blows by disease, politics, and cataclysmic volcanic eruptions. Immigrating and returning to the homeland became a pattern of life, and by the 1960s there were more Americans of Azorean descent than there were Azoreans.Ann Parker was one of those descendants, separated from her heritage by a mother who saw only the stigma of being an immigrant.\"I knew most of what my mother told me about my family history was either a refraction of reality, distorted by how it was presented, or a distillation that fashioned truth from something inconsequential, while letting the essential element escape. But I could never be certain which of the two a particular story was.\"Caught between a tragic past and a bleak future, Ann finds solace in exploring the lives of her ancestors and uses their persistence to inspire her own.\"At a time when even a trip to a nearby village or island was an adventure, leaving the boundaries of their world behind was a test of courage. Without the ability to reach back, they were cut off from the people, places, and culture that had defined them. They could not board a plane to return to a dying mother. They could not telephone to hear the voice of a loved one when they were overwhelmed … . They could not turn to the priest who had baptized them or the grandmother who had cradled them or the cousin they had shared secrets with. Most carried no pictures with them, and the faces of those they left behind would surely fade over time. It was absolute separation from everything.\"When Ann finds herself without family, disconnected from friends, and shunned by the career around which she built her life, she flees to the islands. She explores the geography and rich history of Pico in her walks around the island.\"Man, too, had left records. The mantle of dark volcanic soil, formed when cooled magma eroded and the land lay fallow over millennia, had brought farmers and ranchers, and the wheels of the oxcarts that carried their milk, meat, and produce to market left ruts in the rock. There were orchards that disease had forced to become vineyards, and vineyards that disease had forced into ruin. Pico was dotted with Dutch windmills, once used to grind wheat that no longer grew, and along the coast were low stone buildings, scattered with disarticulated skeletons, where whales were once processed. Houses abandoned in the diaspora were hidden in vegetation, some still holding the half-rotted belongings of emigrants who intended—or perhaps just futilely hoped—to return.\"Memorable people come to life in the village of Porto Velho. Their kindness and the beauty around her begin to heal Ann.\"The land became an entity with a dimension beyond what I could quantify as a scientist. Voluptuous hills lifted me up and set me down, tickling my ankles with silky petals and leaves; towering cliffs dared me; grass invited me to stretch out and offered oblivion; sand dunes embraced me with warmth; and the island played music for me in the tinkling melodies of brooks, the counterpoint of rushing water and breeze-driven leaves, and the rhythm of my own heartbeat.\"The resilience of the Azorean people inspires Ann to endure. When one by one her challenges come to light, the reader will root for her to remain hopeful, and as she explores her past and possible future, she will remind the reader of the value of the present.",
  "genres": [],
  "author": "Miriam Winthrop",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/22412440-saudade"
}