{
  "title": "Finding Us",
  "description": "From a USA Today Bestseller comes a story of heartbreak, lies and the outcome of it all left hanging in the balance... Searching deep within themselves can they find each other... Jasmine Jennings is running from her past, something she never wants to deal with again. Starting out fresh in a new city, life is finally looking up. She's finally finding her own way. That is, until she meets him -- Knox Mitchell. She tries to elude him, but he's everywhere. There is a push and pull with them that she can't explain, that she doesn't want to understand. Jasmine finally gives in but then Knox begins to avoid her. One tragic night, Knox's picture-perfect future was ripped away, all that's left is the thriving family business. His body and soul craves revenge from the one who took everything away from him. But then Jasmine crashes into Knox's life and he suddenly feels torn. She's not supposed to take up residence in his head, quite the opposite. What is he supposed to do about falling for the girl who was going to be an integral part of his plan for retaliation? Walk away? Or run towards something he knows he shouldn't want? When all secrets are revealed can they move forward without the past destroying any hopes of having a future together?  This book is a standalone novel, with a complete ending. Each Novel in the Finding Series is about a new couple, though some characters make cameo appearances in the other novels. Beautifully written with a story line and characters that kept me up way past my bedtime. #1 New York Times Bestselling Author of The Bet Rachel Van Dyken  Finding Us is sweet and romantic with a twist of suspense all wrapped into a summer romance.  Heidi McLaughlin, New York Times Bestselling Author of The Beaumont Series",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Suspense",
    "Mystery",
    "New Adult Romance"
  ],
  "author": "Megan   Smith",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/22421843-finding-us"
}