{
  "title": "The Nature of Suffering and the Goals of Medicine, 2nd Edition",
  "description": "This is a revised and expanded edtion of a classic in palliative medicine, originally published in 1991. With three added chapters and a new preface summarizing our progress in the area of pain management, this is a must-hve for those in palliative medicine and hospice care.The obligation of physicians to relieve human suffering stretches back into antiquity. But what exactly, is suffering? One patient with metastic cancer of the stomach, from which he knew he would shortly die, said he was not suffering. Another, someone who had been operated on for a mior problem--in little pain and not seemingly distressed--said that even coming into the hospital had been a source of pain and not suffering. With such varied responses to the problem of suffering, inevitable questions arise. Is it the doctor's responsibility to treat the disease or the patient? And what is the relationship between suffering and the goals of medicine?According to Dr. Eric Cassell, these are crucial questions, but unfortunately, have remained only queries void of adequate solutions. It is time for the sick person, Cassell believes, to be not merely an important concern for physicians but the central focus of medicine. With this in mind, Cassell argues for an understanding of what changes should be made in order to successfully treat the sick while alleviating suffering, and how to actually go about making these changes with the methods and training techniques firmly rooted in the doctor's relationship with the patient.Dr. Cassell offers an incisive critique of the approach of modern medicine. Drawing on a number of evocative patient narratives, he writes that the goal of medicine must be to treat an individual's suffering, and not just the disease. In addition, Cassell's thoughtful and incisive argument will appeal to psychologists and psychiatrists interested in the nature of pain and suffering.",
  "genres": [
    "Medicine",
    "Nonfiction",
    "Philosophy",
    "Medical",
    "Health Care",
    "Health",
    "Science"
  ],
  "author": "Eric J. Cassell",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/2241678.The_Nature_of_Suffering_and_the_Goals_of_Medicine_2nd_Edition"
}