{
  "title": "Seductive Nights Trilogy Bundle",
  "description": "Be seduced by Julia and Clay in the New York Times and USA Today Bestselling series...This ebook contains the following First Night, Night After Night, and After This Night...* First NightWhen a sinfully handsome man walks into her bar in San Francisco, Julia Bell simply wants a break from the troubles that keep chasing her. That escape comes in the form of sexy, confident and commanding Clay Nichols, who captivates her mind AND turns her inside out with pleasure. They share one scorchingly hot night together, but discover a connection that runs deeper than mere chemistry....* Night After NightTheir world was sex, love, and lies.He intoxicated her. Commanded. Consumed.With a dirty mind and a mouth to match, Clay Nichols is everything Julia never knew she wanted and exactly what she cannot have. He walked into her life one night and unlocked pleasure in her that she never knew was possible. Possessing her body, captivating her every thought. Which makes him way too dangerous for Julia to risk her heart, given that she has a price tag on her head. She ran after one mind-blowing week with him, but now he's back, and determined to make her his own.No matter the cost.She was a sexy drug to him. Fiery, unforgettable, and never enough, Julia is an enigma, and Clay isn't willing to let her go without a fight. But she's got dark secrets of her own that threaten to destroy any chance of happiness. She's a wanted woman - the stakes are high, her every move is watched, and yet the lure between them can't be denied. Can two people burned by love trust again when desire and passion are met by danger at every turn?* After This NightTheir world was passion, pleasure and secrets.Far too many secrets. But Clay Nichols can't get Julia Bell out of his mind. He's so drawn to her, and to the nights they shared, that he can't focus on work or business. Only her. And she's pissing him off with her hot and cold act. She has her reasons though-she's trying to stay one step ahead of the trouble that's been chasing her for months now, thanks to the criminal world her ex dragged her into. If only she can get out of this mess, then maybe she can invite the man who ignites her back in her life, so she can have him-heart, mind and body.He won't take less than all of her, and the full truth too. When he runs into her again at her sister's wedding, they have a second chance but she'll have to let him all the way in. And they'll learn just how much more there is to the intense sexual chemistry they share, and whether love can carry them well past the danger of her past and into a new future, after this night...*THE SEDUCTIVE NIGHTS SERIES is a spin-off of The New York Times & USA Today Bestselling CAUGHT UP IN LOVE series, and can be read and enjoyed as a standalone series.*The SEDUCTIVE NIGHTS SERIES BOOK 1: FIRST NIGHT (Julia and Clay's story begins - novella)BOOK 2: NIGHT AFTER NIGHT (Julia and Clay's story continues)BOOK 3: AFTER THIS NIGHT (Julia and Clay's story concludes)SEDUCTIVE NIGHTS TRILOGY BUNDLE (Box set of books 1-3)BOOK 4: ONE MORE NIGHT (More Julia and Clay in Las Vegas!)BOOK 5: NIGHTS WITH HIM (Michelle and Jack's romance) - November 11 releaseTHE CAUGHT UP IN LOVE BOOK 1: CAUGHT UP IN HER (Bryan & Kat's story begins)BOOK 2: CAUGHT UP IN US (Bryan & Kat’s story continues)BOOK 3: PRETENDING HE'S MINE (Reeve & Sutton's story)BOOK 4: TROPHY HUSBAND (Chris & McKenna's story)BOOK 5: PLAYING WITH HER HEART (Davis & Jill's story)",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "BDSM",
    "Erotica"
  ],
  "author": "Lauren Blakely",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/22427344-seductive-nights-trilogy-bundle"
}