{
  "title": "Living Treasures",
  "description": "Nautilus Book Awards WinnerNext Generation Indie Book Awards Gold MedalLiving Now Book Awards MedalistA woman can have a career and family, but which comes first?A starving panda eats a hen in order to nurse her cub in the dead of winter—there begins the perilous adventure of Gu Bao, a girl who grows up under the Chinese government’s one-child policy. Bao falls in love with a handsome soldier during the tumultuous Tiananmen Square protests in 1989. The demonstrations transfix her fellow students and kill one of her friends. Bao finds herself pregnant and faces the end of her academic career. Her grieving parents arrange for a secret abortion and ship her off to her grandparents’ house in the remote countryside where she was raised. Bao searches for her inner strength while exploring the evocative Sichuan mountain landscape. She befriends a panda mother caught in a poacher's snare, and an expectant young mother hiding from villainous one-child policy enforcers bent on giving compulsory abortions. All struggle against society to preserve the treasure of their little ones. Can Bao save a rural family from destruction, and help a giant panda along the way? She devises a daring plan that changes the lives of everyone around her.A deeply moving story of family, passion, and courage, Living Treasures is both a gripping page-turner and an incisive social critique, portraying a young woman’s quest for romance and justice in a rigid society. Bao, a law student, aspires to have both a career and family, but which comes first? A baby rarely arrives at a convenient time. The decision about the woman’s body is not an easy choice but rather a compromise that comes with a dear price. Bao’s struggle encapsulates many women’s journeys through life, as they experience the triumphs, suffer the heartbreaks, and learn to live with the consequences.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "China",
    "Historical",
    "Asia",
    "Animals"
  ],
  "author": "Yang Huang",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/22428744-living-treasures"
}