{
  "title": "Night School: Fracture",
  "description": "‘I love the Night School series so much. It really is my favourite recent series and I really loved Fracture, the third book in the Night School series… I love the fast pace of both this novel and the entire series. Everything felt like it was on full-throttle and there's never a dull moment at Cimmeria Academy!’ FlutteringButterflies.com  Cimmeria Academy’s solid walls have protected the children of the British elite for centuries. But now those walls are beginning to crumble. And if they fall, Allie Sheridan knows nothing can save her.  A powerful and dangerous secret society – one that controls not just the school but the government, the media and corporations – is turning on itself. Allie’s grandmother still clings to power but everyone knows her time at the top is ending. Next in line is Nathaniel, who killed Allie’s friends. If he takes over, all is lost.  Panicked and angry, she pushes everyone away. She wants revenge. She wants justice. But some battles can’t be won alone. Allie must learn who to trust. Or lose everything.  Fracture is the thrilling third book in the international bestselling Night School series.   What people are saying about Night School: Fracture  ‘If you’ve been waiting for answers about Night School and the organization, rest assured, answers you shall get. There were clues before and I had my suspicions, but in Fracture, the purpose of Night School becomes abundantly clear – and scarier than ever.’ The Nocturnal Library  ‘With action from start to finish you never know what may be over the next page. You feel for the main character, Allie, throughout as she tries to grasp a greater understanding of whom she can trust around her and who has betrayed her. Easier said than done when almost all of her fellow Night School members could be to blame. Warning: Very addictive and you will put reading this book over everything else.’ TheSprout.co.uk  ‘Fracture was a wonderful blend of mystery, action, romance and friendship. I'm dying to return to these characters and story, the fabulously creepy boarding school and to see where this series will go next!’ FlutteringButterflies.com  ‘I quickly found myself immersed in the story and was swept along with the drama. I thought the story was an interesting one, with lots of action as well as a bit of a love conflict between Allie and two of her friends, Carter and Sylvain.’ Novelicious.com  ‘This thrilling story of intrigue is like St Trinian's tinged with a murderous streak.’ Closer  ‘As ever, Daugherty's storytelling brims with gusto. Another enjoyable, thrill-packed term’. FT",
  "genres": [
    "Young Adult",
    "Mystery",
    "Romance",
    "Fantasy",
    "Fiction",
    "Thriller",
    "Boarding School"
  ],
  "author": "C.J. Daugherty",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/22428647-night-school"
}