{
  "title": "An Encounter at Hyde Park",
  "description": "In Karen Hawkins' Charlotte's Bed - Uninterested in domestic bliss, Lady Charlotte treasures her freedom as a wealthy, unmarried lady living with her best friend, the spritely Duchess of Roxburghe, and assisting in that lady's energetic matchmaking endeavors. But now - shockingly - the duchess has turned her sharp ambitions on none other than Lady Charlotte herself. Charlotte's having none of it. She likes her life and her freedom, but when ​an old love from her past reappears, ​the mysterious and dark Angus Reeves, ​Lord MacThune, ​ and attempts to woo her with an exciting, thrilling kiss, Charlotte begins to wonder if perhaps - just perhaps - 'domestic bliss' might mean something other than what she originally thought . . .In Ava Stone's Promises Made, Lady Elspeth MacLaren loves everything about London - the ballrooms, the entertainments, the handsome single lords in want of a wife. Unfortunately, she already has a betrothed...She just doesn't know it yet. * A decade ago, Captain Griffin Reid made a deal with the devil. In exchange for leaving Scotland and joining the Dragoon Guards, his family's land and legacy will be returned to him after he marries one-time neighbor Ellie MacLaren. Unfortunately, the lady in question has her heart set on marrying some English lord and living out her days somewhere south of the border. And before Griff knows what's happened, he finds himself trying to win the heart of the lady who always should have been his.In Claudia' Dain's Chasing Miss Montford, Miss Elaine Montford is a debutante on the hunt for a titled husband. Then again, who isn't? In the London Season of 1804, every young woman with a mama who has spent the money to buy an appropriate wardrobe and find a house in Town to showcase her virginal, blushing daughter expects said daughter to do her duty to her family name by marrying a man with a title, and social connections, and a well-established estate. Elaine Montford, who is virginal and can blush nearly upon command, is not averse to this plan. It's only that she has yet to meet the man who meets her mama's qualifications. * Roger Ellery of the 10th Regiment of Light Dragoons is not that man. However, Roger Ellery is the man she meets. In Hyde Park. It is quite clear that he believes he is rescuing her, even if she is not in need of rescuing. Then again, perhaps she is....And it all started out so innocently, too.In Deb Marlowe's A Waltz in the Park, James Vickers once believed honor and family duty to be his life's work. Now he knows better--and he's appointed himself as silent witness to his father's sins. His greatest goal is to act as the continuously pricking thorn in his lordship's side--and scandal is his greatest weapon. He has no use for an innocent young miss. * Propriety is Miss Adelaide Stockton's most important asset. She must be all that is prim and proper if she's to live down her parent's misdeeds and have any hope of catching a husband. She must avoid scoundrels like Vickers at all costs. Yet fate has thrown them together--and given each a key to the other's ambition. A bargain is struck...but together they find that gaining what one desires most is far more difficult than a waltz in the park.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Anthologies",
    "Historical",
    "Short Stories"
  ],
  "author": "Claudia Dain",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/22425769-an-encounter-at-hyde-park"
}