{
  "title": "We Might As Well Win: On the Road to Success with the Mastermind Behind a Record-Setting Eight Tour de France Victories",
  "description": "On the tour and inside the mind of Johan Bruyneel, the winningest team leader in cycling history and the mastermind behind the success of the world’s most celebrated champion, Lance ArmstrongJohan Bruyneel knows what it takes to win. In 1998, this calculating Belgian and former professional cyclist looked a struggling rider and cancer survivor in the eye and said, “Look, if we’re going to ride the Tour, we might as well win.” In that powerful phrase a dynasty was born. With Bruyneel as his team director, Lance Armstrong seized a record seven straight Tour de France victories. In the meantime, Bruyneel innovated the sport of cycling and went on to prove he could win without his superstar -- in 2007 he took the Tour de France title with a young new team and a lot of nerve, sealing his place in sports history forever. We Might as Well Win takes readers behind the scenes of this amazing nine-year journey through the Alps and the Pyrenees, revealing a radical recipe for winning that readers can adapt from the bike to the boardroom to life. We witness Bruyneel’s near-death crash and comeback as a rider. We are privy to the many ways he and Armstrong outsmarted their opponents. We listen in on the team’s race radios to hear the secret strategies that inspire greatness from a disparate team. We learn how to make sure \"not winning\" isn’t the same as \"losing\" as Bruyneel struggles to prove himself -- post-Armstrong -- with new riders, new strategies, and skeptics around every corner. Whether mounting a difficult climb, or managing a team of thirty riders and forty support staff from a miniature car hurtling along narrow European roads, or looking a future legend in the eye and willing him to believe, Bruyneel is, and has always been, the consummate winner. Readers will relish this inside tour.",
  "genres": [
    "Cycling",
    "Sports",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Johan Bruyneel",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/2242500.We_Might_As_Well_Win"
}