{
  "title": "Forever Under a Rainbow",
  "description": "“I’m not straight” is how Bridger Jenkins came out. That’s all he’s comfortable claiming at first, even if he’s more than willing to experiment sexually with men to find out what being not straight means in practice. Several horrid dates leave him feeling frustrated, so he retreats to a familiar online gay forum for support. There, he runs across Stone Moore, whose profile says he’s only interested in friendship. After hours of easy conversation, Stone agrees to go on a date. During their amazing evening together, Bridger shares that he’s new to dating men. This seems to throw Stone off, yet the date ends with a steamy kiss. When Stone later tells Bridger the time isn’t right for them, Bridger is hurt and confused. He realizes he must’ve come off as bi-curious, naïve, and insecure. Bridger knows he needs to feel comfortable in this new skin of his and that he won’t find love until he’s more at ease. Bridger isn’t thrilled to remain in Stone’s friend zone but contents himself with their late night chats and goes out with other men, which both strengthens and disheartens him. His dissatisfying dates reinforce what he already knows: he won’t find anyone else as amazing as Stone. Eventually, he’s bold enough to ask Stone out on another date. Will they date again? Have they found their soul mates, or will they each discover something about the other that causes them to go their separate ways?This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. Photo Description: Two men walk hand in hand along a trail. It’s obvious one man knows the way through the field of native grasses, and the man who is a half step behind trusts his partner but might be apprehensive about the situation or where he’s being led. They appear to be talking in intimate tones. They touch from fingers to forearms as they head toward the horizon.This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Friends To Lovers",
    "Short Stories",
    "LGBT",
    "Erotica"
  ],
  "author": "Posy Roberts",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/22432745-forever-under-a-rainbow"
}