{
  "title": "Leo Tolstoy's Family Recipe Book",
  "description": "“Cookery Book, second edition, revised and corrected in 1874. Imprimatur. Publisher Stepan Andreevich Bers dedicates this book to his sister, countess Sophia Andreevna Tolstaya”- these words on the first page preface the Tolstoys’ cookery book that serves as the foundation of this work. Initially meant to be a joky gift of a loving brother to the great writer’s spouse, Sophia, this collection of recipes helps us get a glimpse of the family life of the author of Anna Karenina, War and Peace and other masterpieces. This is not a critical essay, not another biography. This book is an invitation to the writer’s home, where hospitality was a staple law, no matter where the family lived: the huge Yasnaya Polyana mansion or the writer’s small family residence in Moscow.The closest circle knew that that would always get a warm welcome by the diligent hostess – the wife of Leo Tolstoy, Sophia Andreevna Tolstaya (maiden name Bers). Every day, a lavish feast composed of Russian and French dishes was served for the Tolstoys family and their guests.Such a peculiar combination of cuisines can be attributed to the fact that the Tsar’s Russia, unlike the rest of Europe at that time, preserved substantial food-wise class and social segregation that lasted till the end of the XIX century, which was imprinted in the differences in the menus of various social categories: aristocrats, merchants, peasants. The aristocratic menu used by the Tolstoys could be characterized as a mix of Russian and French dishes, which was later reflected in Sophia Tolstaya’s recipes. Sophia Andreevna collected interesting recipes from relatives, family friends and guests. She used these recipes and the help of the family’s home cook to create daily breakfast, lunch and tea-drinking menus. These recipes and cooking tips eventually laid the foundation for the Cookery Book published in a single copy by her younger brother, Stepan Andreevich Bers, in 1874 as a gift to his sister. The book contained 162 recipes. Over 50 of these recipes are presented in this work as close to the original as possible. This gives you a great degree of freedom for experiments and creative interpretation. Perhaps, you will want to simplify a 1.5-hour long process of whisking cream for a cake by using a mixer, or decide to stick to the original recipe. All recipes use the units of weight and volume used in the second half of the 19th century in the Russian Empire. The “Translation of weights and measures, and terminology” section of the book will make you familiar with a few specific ingredients and help you calculate the right amount of ingredients for each recipe.The family rules and cooking traditions of the Tolstoys family were largely reflected in such books as “Anna Karenina”, “War and Peace” and “Family Happiness”. This book contains not only recipes, but also excerpts from diaries and letters of Sophia Tolstaya and countless relatives and guests of the mansion. They help the reader get a better understanding of the atmosphere that reigned in the writer’s home.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference"
  ],
  "author": "Sergei Beltyukov",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/22432094-leo-tolstoy-s-family-recipe-book"
}