{
  "title": "Jane: A Murder",
  "description": "Part elegy, part true crime story, this memoir-in-verse from the author of the award-winning The Argonauts expands the notion of how we tell stories and what form those stories take through the story of a murdered woman and the mystery surrounding her last hours. Jane tells the spectral story of the life and death of Maggie Nelson’s aunt Jane, who was murdered in 1969 while a first-year law student at the University of Michigan. Though officially unsolved, Jane’s murder was apparently the third in a series of seven brutal rape-murders in the area between 1967 and 1969. Nelson was born a few years after Jane’s death, and the narrative is suffused with the long shadow her murder cast over both the family and her psyche. Exploring the nature of this haunting incident via a collage of poetry, prose, dream-accounts, and documentary sources, including local and national newspapers, related “true crime” books such as The Michigan Murders and Killer Among Us , and fragments from Jane’s own diaries written when she was 13 and 21, its eight sections cover Jane’s childhood and early adulthood, her murder and its investigation, the direct and diffuse effect of her death on Nelson’s girlhood and sisterhood, and a trip to Michigan Nelson took with her mother (Jane’s sister) to retrace the path of Jane’s final hours. Each piece in Jane has its own form, and the movement from each piece to the next―along with the white space that surrounds each fragment―serve as important fissures, disrupting the tabloid, “page-turner” quality of the story, and eventually returning the reader to deeper questions about girlhood, empathy, identification, and the essentially unknowable aspects of another’s life and death. Equal parts a elegy, memoir, detective story, meditation on violence (and serial, sexual violence in particular), and conversation between the living and the dead, Jane ’s powerful and disturbing subject matter, combined with its innovations in genre, shows its readers what poetry is capable of―what kind of stories it can tell, and how it can tell them.",
  "genres": [
    "Poetry",
    "Nonfiction",
    "Memoir",
    "True Crime",
    "Crime",
    "Mystery",
    "Essays"
  ],
  "author": "Maggie Nelson",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/101453.Jane"
}