{
  "title": "Transgression",
  "description": "What if you were studying for your Ph.D. in archaeology and decided to take a break from your crummy life for the summer by working on an archaeological dig in Israel?What if you met a great guy in Jerusalem who happened to be a world-famous theoretical physicist working on a crazy idea to build a wormhole that might make time-travel possible … someday?What if he had a nutball colleague who turned the theory into reality — and then decided to use YOU as a guinea pig to make sure it was safe?What if the nutball had a gun and went on a crazy, impossible mission to hunt down and kill the apostle Paul?It’s A.D. 57 when Rivka Meyers walks out of the wormhole into a world she’s only studied in books. Ancient Jerusalem is awesome! Rivka can’t believe her friend Ari Kazan’s theory actually worked. But when she runs into Ari’s wacko colleague, Damien West, in the Temple, Rivka starts to smell a rat. When Ari discovers that Damien and Rivka have gone through a wormhole that’s on the edge of collapse, he has to make a horrible choice: Follow them and risk never coming back — or lose the woman of his dreams forever.About The Book:Transgression is a time-travel suspense novel that mixes science, history, religion, romance, and suspense. It’s about learning to stand up for yourself, when you just want to be let alone. It’s about making hard decisions. It’s about asking whether life has meaning and whether God exists — and becoming a badass fighter for justice, even if you don’t have the answers. Transgression won the 2001 Christy award for best futuristic novel in Christian fiction. Transgression will take you on a wretched, miserable, dangerous vacation through the filthy, bandit-ridden streets of first-century Jerusalem. Transgression is the first novel in the City of God series:Book 1: Transgression (A.D. 57)Book 2: Premonition (A.D. 57-62)Book 3: Retribution (A.D. 62-66)Excerpt:Rivka turned and ran. “Ari!” she screamed. “Help!”She raced outside into the sunlight, sprinted madly through a dark grove of trees with gnarled branches. Her heart pounded in her chest. Her ragged breath rasped in her ears. Was he following? Faster! Tears fogged her eyes. Her leather sandals tore at her feet. Trying to look back over her shoulder, she tripped and fell. Dust flew up all around her.Coughing, she clambered to her feet and dared to look back. The man was nowhere in sight.Rivka panted until she caught her breath. Her left wrist throbbed from the fall. She massaged it while she squinted into the trees, afraid that the man might be lurking in the shadows. Nothing happened.Finally, she turned around to get her bearings.She blinked twice and then stared. Across a small valley massive stone walls rose. Herodian masonry. Jerusalem limestone. Towering white walls. It looked like…But that was impossible. She closed her eyes, breathed deeply three times, and opened them again. Absurd. Had she gone loony or something?Rivka had visited the Temple Mount twice and studied hundreds of pictures during three years of graduate school. But she had never seen it looking like this. So pure. So spotless.So new.",
  "genres": [
    "Time Travel",
    "Fiction",
    "Science Fiction",
    "Christian Fiction",
    "Christian",
    "Historical Fiction",
    "Historical"
  ],
  "author": "Randall Ingermanson",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/22431104-transgression"
}