{
  "title": "DOING TIME on Earth: Unmasking the Hidden Mind Directing our Lives",
  "description": "[35 Chapters] #Psychic #Reincarnation This is a spiritual odyssey, a drama, and a love story. It is a look at the other side, and Beyond, a first-hand, detailed account of Past Life, Reincarnation, and the Light Heavens told by one who remembers being there.This tale, a roman-a-clef, is a Doorway into the hidden reality behind our three dimensional life in the fourth dimension of Time. Most of us walk through this life asleep, not remembering where we came from. We are unaware of our past, and that we are continuing patterns begun a lifetime ago. The people we meet are destined to come into our lives; we don't remember agreeing to Do Time with them before we are even born.Doing Time is about the relationships arranged in the Light World before we enter the realm of Time and Cause and Effect. The Light World is a place where souls rest between lives. Our main character, Marie, shares her memories spanning across lifetimes, and from the Light World as she and some of those she knew before, or will come to know, prepare to reincarnate.Marie is blessed and cursed with a gift, a second sight. She is subject to premonitions, which warn her of imminent danger, but she struggles with whether to trust Reason or her fleeting psychic abilities. Her psychic powers ebb and flow, then she remembers her past life and the time between lives in the Light World. She realizes she has been predestined to meet three men in the course of this life, and ultimately finds there is no way to escape her destiny as unseen forces manipulate events beyond her control. Our story skips back and forth through time and between lives, as Marie pieces her life together, and realizes the root of her karma. Marie learns that a higher level of Mind is responsible for all the decisions Marie has thought were her own, and they are eventually unmasked. They call The Collective.As Fate and the Collective manipulate Marie's life, she learns valuable spiritual lessons, which parallel major religious and spiritual teachings. Join Marie as she embarks on this odyssey.",
  "genres": [],
  "author": "Catherine Berger",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/22441397-doing-time-on-earth"
}