{
  "title": "Still Waters",
  "description": "Sometimes, it's the thing you fear the most that saves you...  Janet's a good girl from the right side of town with promising career as a ballerina, until it all comes crashing down with an injury. Now she's running wild, flunking out of school and dancing on table tops. When she gets back into town her best friend Kaylie brings her to the local MC Club House. There's one guy there that unnerves Janet with his solemn dark eyes. In fact, she's got the feeling that he sees right through her.  Jack is a dangerous man with a dark past. He's been on his own since he was 14 years old and he has the scars to prove it. Nicknamed The Viking, he's bigger and meaner than almost anyone in the Club. He gives Devlin and the Spawn's his absolute loyalty but nothing else. He doesn't need anyone or anything and that's the way he likes it. Until he meets Janet. The feisty little red head gets under his skin, no matter how hard he tries to push her away. When Janet winds up in the clutches of an underground prostitution ring, Jack has to decide how far he's willing to go to save her. If he succeeds, he knows she could be the one who will save him from his demons.   ***.99 cents for a limited time only!***  This is the second book in the Devil's Riders series. Each novella can be read as a standalone book! There are NO cliffhangers, just three different love stories, each focusing on a different member of the club. Enjoy!  Excerpt:   Jack watched as Dev led Kaylie and her friend out of the bar. He could relax once they were out of the room. But he didn't feel like relaxing. He felt like breaking something.  He never resented anything Dev asked him to do. For some reason he'd felt jealous that he had to keep watch tonight. He would have rather been by the bar. With her.  Janet. Such an ordinary name for such a fiery little creature. The girl was stunning. Red hair, pale blue green eyes and a body that- well, it had his attention. That much was obvious.  Hot girls came and went in the club on a daily basis. But Janet wasn't just hot. She was fucking beautiful. There was something regal in her bearing too. She'd looked like a queen, perched with her long legs dangling off the bar stool. A queen who was up to no good. Slumming maybe.  He frowned. He didn't mess around with women too often. Once every couple of months he'd screw one of the hanger ons to keep his head straight. But never the same one twice. That was dangerous. He didn't want them to get attached to him. He didn't want to answer questions. He didn't want to talk or hold hands. He wanted to get laid and that was it.  Most of the girls around here understood that and were more than happy to oblige him, or any of the other Spawns. He had a feeling that a rich girl like Janet would expect more from him. And since she was friends with Dev's old lady, he'd certainly have to give more than he was used to.  He shook it off and left the bar room, climbing the stairs to his favorite perch on the roof. He could see at least two miles from up there, the distance making the industrial district where he lived look almost pretty. Nobody ever bothered him up here either. That was the best part.  He pulled a cigarette out and lit it. He rarely indulged anymore but he was feeling strange tonight. He was restless. That was all. It didn't have anything to do with that girl. And even if it did, she was way out of his reach.",
  "genres": [
    "Romance",
    "Contemporary",
    "Abuse",
    "Audiobook",
    "Erotica",
    "Motorcycle",
    "Contemporary Romance"
  ],
  "author": "Joanna Blake",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/22440160-still-waters"
}