{
  "title": "Are We Normal? Funny True Stories from an Everyday Family",
  "description": "Do all moms really have X-ray vision and eyes in the back of their heads? Author Christina Scalise’s kids think so. And the New York author isn’t above using her maternal superpowers to deal with the challenges of childrearing. How else could she accomplish such seemingly impossible feats as getting three kids to try brussels sprouts for the first time? Scalise may not actually be more powerful than a locomotive, but she’s able to get her family to hang the toilet paper in the “over” position—most of the time, anyway. And she may not be able to leap tall buildings in a single bound, but if her kids accidentally leave their dirty clothes on the floor, they know their wayward apparel could likely end up dangling from the nearby treetops, faster than a speeding bullet. “Life is way too short,” says Scalise, “so try to enjoy every minute of it with a sense of humor! With that kind of outlook on life’s crazy moments, Scalise and her family have often been left asking themselves one recurring question, which became the title of her new book: “Are We Normal?” Scalise shares some key parenting lessons learned the hard way, such as what happens when a when a preschooler finds himself alone with a VCR, a broomstick, and a peanut-butter-and-jelly sandwich. “I originally started writing this book as a journal of stories for my kids to read when they were older and had children of their own—a few funny stories they could tell our future grandchildren about,” she says. “Then it grew from there, with one story after another. After a while I figured, ‘Why not share our stories with the rest of the world? I’m sure most people can relate to at least one or more of these stories. And if not—well, I hope readers at least get a good laugh out of them.’”",
  "genres": [
    "Parenting"
  ],
  "author": "Christina Scalise",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/22440552-are-we-normal-funny-true-stories-from-an-everyday-family"
}