{
  "title": "Human Choices",
  "description": "Khy is a prisoner and a slave. His life consists of days of drudgery and nights of agony. He has no memory of anything else, yet he knows there must be more beyond the fog that shrouds his mind. When his Master is called away on urgent business and Khy is left alone, a moment of unexpected clarity has him running for freedom.Jaedin is done running, both from war in the north and from his lover’s tragic death. He’s settled in the tiny village of Rosefire, and has finally achieved an uneasy truce with his grief. Jaedin’s hard-won peace is shattered when he places himself between Khy and the band of brigands hunting him. During the scuffle, Khy panics and works the leythe to set loose a spell. When the dust settles, Khy has fled and Jaedin finds himself haunted by something far darker than his own past. In order to regain his peace—and his sanity—Jaedin sets off in search of the young man who has cursed him. What he finds threatens not only his own personal equilibrium, but the balance of the leythe itself. To protect the leythe, Khy must face his tormentor and fight to free himself from the man who considers him both pawn and prize. To protect the man he loves, he must do it alone…Author's Note: Human Choices is a stand-alone novel that takes place in the same world as Human Frailties, Human StrengthsThis story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. Photo Description: A young man with striking blue eyes, long hair, and a beard stares at the camera. He wears a breastplate over a simple tunic.This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Romance",
    "Magic",
    "Abuse",
    "Paranormal",
    "LGBT"
  ],
  "author": "Jaye McKenna",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/22437852-human-choices"
}