{
  "title": "Another Life",
  "description": "Dark family secrets come to light when a girl on the run seeks refuge with her estranged brothers, one of them a cop.Cameron Baker has always felt like the punch line to a bad joke. She’s an orphan, borderline alcoholic party-girl and chronic screw-up, but the summer she turns eighteen, her life hits a new low. She wakes up after a drunken night to find out she’s married to her very manipulative frenemy, Julian. In a panicked frenzy, she packs her belongings and flees. On the run from the police as well, she seeks refuge with her two older brothers, whom she hasn’t seen in years. Returning to her childhood home in a small town in Georgia, Cameron makes up an excuse about bonding with her brothers for the summer, and secretly tries to figure out how to get herself out of this mess. Though Cameron is seemingly safe, she can’t shake the urges to drink her pain away, and her brothers notice this quickly. As awkward and protective instincts fly in the wounded family, Cameron feels like the black sheep among them. She harbors more resentment about their estranged years than she initially thought. Shane, a reformed bad-boy and long time friend of the family quickly takes her under his wing. His belief in hope and second chances is just the ticket she needs to straighten out her life, and a reluctant romance blooms between them. Just as she’s about to settle in and allow herself some happiness, Julian tracks her down. His threat: leave with him, or he’ll tell everyone all of her dirty little secrets—and she has much more to hide than her marriage. As the family struggles to accept each other, flaws and all, the past just won’t stay buried. With so many secrets to hide, it’s only a matter of time before it all blows up in her face. Her only way out is to admit the terrible truths she’s been running from, and finally face her demons, but will she be strong enough?",
  "genres": [
    "Contemporary Romance",
    "New Adult"
  ],
  "author": "Jasmine Denton",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/22443443-another-life"
}