{
  "title": "Blade on the Hunt",
  "description": "\"When you awaken, you will have to find her yourself. Or she will find you.\"These were the words given to Rowan Summerwaite by the Goddess as Rowan lay clinging to life. Broken—but not defeated—by the ancient Vampire Enyo.After weeks of mandatory down time, a recharged and vengeance-fueled Rowan heads out from her father's Keep, leading a team of some of the most terrifying beings on earth with one goal in mind—track and eliminate the Vampire who attacked her.But as the team moves across Europe and is hit with wave after wave of attacks, the tensions between Clive Stewart—the haughty, stylish Scion of North America whom Rowan grew even closer to during her recovery—and a rival Vampire ramp up. Befuddled, confused, flattered and annoyed, Rowan's the woman in the middle. She's not used to being claimed in a way that's not about how strong her sword arm is or who raised her. Clive Stewart is everything she shouldn't want in a man—he's bossy, he's a Vampire, and he considers her his—but she's past denying how it makes her feel that he fights for her the way he does. She's past denying she's in love.In contrast to the uneven footing falling in love has given her, Rowan is utterly certain she will locate her quarry. She's stronger and more powerful than she's ever been after the tests and bloody lessons of the last years. Her connection with the Goddess is seamless and the light of her mission burns from within. And she'll need all the help she can get because it's not very long before Rowan and her team realize the threat is far greater than one crazy old Vampire. There's a war brewing and Rowan will fight it to the death. It's what she was born to do.",
  "genres": [
    "Paranormal",
    "Urban Fantasy",
    "Vampires",
    "Romance",
    "Fantasy",
    "Magic",
    "Paranormal Romance"
  ],
  "author": "Lauren Dane",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/22446786-blade-on-the-hunt"
}