{
  "title": "What to Read After FSOG: The Gemstone Collection",
  "description": "What to Read After Fifty Shades of Grey\n (#WTRAFSOG) began as a Facebook page created by Summer Daniels dedicated to helping book lovers discover great reads after FSoG. Over time, the page grew in popularity and now has over 85,000 followers!Make sure to check out our previous WTRAFSOG Box Set here: http://amzn.to/1kHBjDV  This collection features eleven incredible fan favorites from WTRAFSOG. Each book is unique and has a theme of its own, from sweet to dominant, and everywhere in between. \n\nBelong to You\n\n by Vi Keeland -- New York Times and USA TODAY Bestselling author. My honeymoon was almost everything I dreamed it would be...a tropical paradise, turquoise water, romantic walks on the beach, and loads and loads of mind shattering sex. The only thing missing was the groom. \n\nSurrender\n\n by Adriana Hunter -- New York Times and USA TODAY Bestselling author. When Jake agrees to take Abby as his submissive she must give him all that he demands of her until she has surrendered completely. But when he pushes her to her limits she wonders if she'll ever be the same again. \n\nFade into You\n\n by Kate Dawes -- New York Times and USA TODAY Bestselling author. Olivia Rowland moves to Los Angeles to work for a Hollywood talent agent. Life in L.A. is a culture shock, but nothing compared to the jolt she gets when Max Dalton enters her life. \n\nHis Need, Her Desire\n\n by Malia Mallory -- New York Times and USA TODAY Bestselling author. Tabitha didn't come to Hawaii to be spanked, but that's the cost of being saved from drowning by Marcus and the start of an affair so intense they must decide - is this a holiday fling or the real thing? \n\nA Touch of Lilly\n\n by Nina Pierce -- USA TODAY Bestselling author. Detective Lilly D’angelo has given up finding a soul mate and thrown herself into her career. That is, until she captures the wrong alien and is shipped into deep space. Now she’s working as a bounty hunter and hell-bent on revenge. \n\nBrie Learns the Art of Submission\n\n by Red Phoenix. This #1 Bestselling erotic novel follows the sensual journey of Brie Bennett as she attends the Submissive Training Center - an institution famous for its elite instruction. Brie will discover her deepest desires, darkest fears, and the intense love of several of the Center’s talented Doms. \n\nHot Ink\n\n by Ranae Rose. Mina never meant to fall for her sexy tattoo artist, Eric, or to become a model. But when she's asked to pose with him in a photo shoot for the Hot Ink tattoo studio, she can't say no. In a few breathtaking moments, an on-camera kiss turns the passion they're asked to fake into something very real, leaving them both wanting more. \n\nBroken\n\n by Christa Cervone. After four years of no contact and lots of self-destruction, Garrett's back in her life. Can they put back together the pieces of their shattered hearts? Or are they destined to remain Broken? \n\nSeduced\n\n by Michelle Hughes. Four gorgeous billionaires and one woman who believes that pleasure is the biggest lie men use to get women into bed. Welcome to Fantasy's Bar & Grill. What we're serving up behind closed doors is hotter than anything on the menu.\nMaster of the Inn\n by Ella Jade. Pleasure Inn… Where all of your fantasies become reality. Elyse gets more than she bargains for when she meets Logan a sexy, reclusive innkeeper. Logan’s dominance in the bedroom makes all of her fantasies a reality. \nSummer's Journey: VOLUMES 1-4\n by Summer Daniels-- Join Summer on her journey of sexual self-discovery. The beginning of her sensual, sultry love affair with life, and all the joys of being a woman.",
  "genres": [
    "Anthologies",
    "BDSM",
    "Erotica",
    "Contemporary Romance"
  ],
  "author": "Vi Keeland",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/22446956-what-to-read-after-fsog"
}