{
  "title": "Darknest",
  "description": "Darknest Fantasy Erotica presents a collection from seven erotic authors sure to push you to the limits of your psyche.In the darkest corners of your fantasies, these stories lurk. Waiting to tease and please, these shorts are darkly erotic, and will make you lust for orcs, shifters, demons and more!Hunted by the Beast by Cerys du Lys: When the beast-cursed man of legends comes for her, desiring her as his mate, can Danya tame his savage ways and show him love, or will she unwittingly become some plaything for a monster, existing solely for his pleasure?A Heaven of Hell by A. Vivian Vane: Can a holy angel of Heaven tempt one of Lucifer's fallen back to righteousness? Even if it were possible, hot and heavy pegging probably wouldn't be the way to go about it...but that won't stop one angelic beauty from trying in this sinful short!Too Perfect by J.M. Keep: In the future, women are a commodity to be traded and programmed for a single purpose. Andrea has been scientifically modified to be the perfect woman, but when she's gifted to a young man by his father, he recognizes her: His old, unrequited crush.The Master by Kaye Skellington: When one visits the Orc General's court, all eyes are on the delicate elven face of his wife. They search her expression keenly, but do they know her? Does anyone?Adrift in the Emperor's Halls by P.B. Tae: Lost in a dark, alien maze the thieving elf Aenaena struggles to find her way. She doesn’t know how she came to be in such a place or why the vile and almost organic walls seem to ooze with their own hideous life. Yet one thing is for certain: in the pulsating halls she is not alone. Something else stalks the corridors, hungry and powerful.The Dressmaker's Doll by Leona D. Reish: Fresh out of college, the opportunity to work under the reclusive bachelor – mysterious and renowned tailor Julian Landon – in his secluded villa felt like a fairy tale for young Amy. As the days pass, Amy is reminded that those fairy tales were once much darker things, as circumstance see her fall helplessly into a world of darker passion and submission to the man training her in far more powerful and sensual ways than she could have ever imagined.A Different Prince Charming by Maria N. Lang: A story of enslavement and the spoils of war. It is the collision between a victorious elven general and a human princess whose father has just lost a battle – and with it, her innocence.\n**These stories are dark erotica and contain graphic violence, strong sexual content and explicit language and are meant for adults.**",
  "genres": [],
  "author": "Cerys du Lys",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/22447137-darknest"
}