{
  "title": "Breathing Black",
  "description": "GRITTY. INTENSE. EMOTIONALLY HONEST.A stunning debut novel that will leave you breathless.\nA desolate childhood; a scarred, jaded, damaged girl. Larkin Grant knew she couldn’t end up like her mother … so she ran. All her belongings packed in the back of a rusted, brown Cadillac, her best friend June in the passenger seat as the co-pilot, she fled Aspen and never looked back.A new life in a new city, Larkin was finally starting to breathe again, an unfamiliar sense of happiness seeping into her lungs. Landon Black, the boy she loved from afar, came back into her life despite leaving him and her awful memories buried hundreds of miles away. A weakened pulse brought back to life.He said she was beautiful. She was starting to believe him. He pursued her and changed the course of everyone’s plans. Life had dealt Larkin a cruel hand, but maybe this was it. Maybe the boy that never knew she existed finally saw her and came to free her from the darkness of her past.But we are never truly free. There are secrets that bind us and lies that unravel from the most beautiful of lips. Blackness that suffocates and makes us question everything we thought we knew. Larkin and Landon are intertwined in ways they never imagined, their future unclear as ghosts come back to haunt them.\nFriendship. Revenge. Love. Drugs. Murder. Deceit.\n The first in a two-book series, Breathing Black is a mix of suspense and breathless romance. It’s a provocative tale that challenges what one is willing to do to protect the ones they love. An emotional journey where trust isn't an option and falling in love never hurt so bad.Content Warning: This is a dark romantic thriller and contains language, adult content, and subject matter that may be sensitive for some readers. Reader discretion is advised.",
  "genres": [
    "Romance",
    "New Adult",
    "Suspense",
    "Contemporary Romance",
    "Contemporary",
    "Mystery"
  ],
  "author": "Poe Avondet",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/22450255-breathing-black"
}