{
  "title": "Three Southern Beaches: A Summer Beach Read Box Set",
  "description": "Three of the funniest bestselling romance authors have joined together to provide three novellas set on Hung Island, a fictional resort along the coast of Georgia.All Hung UpA Romantic Suspense by Kathleen BrooksWhen Trey Everett meets Hollywood star Taylor Jefferies for the first time in the small town of Keeneston, the normally outgoing college football star can barely put two words together. But after one crazy day together, Trey knows he's found something special with Taylor.Six years have passed and they are both out of college and living out their dream jobs on a small island along the coast of Georgia. Trey's ready to ask Taylor one little question to secure their happiness. The only problem stopping his fairy tale ending is that someone is determined to kill the mood... and the love of his life.Divorced, Desperate and DangerousA Contemporary Romance by Christie CraigDetective Turner Calder belongs to the No Ball and Chain Gang. Meaning, no way, no how will he ever let another woman into his heart. He hasn't even been tempted after what his ex put him through. Yet while working undercover on the trail of one of Texas' largest drug dealers, Reece Morris gets closer to him than any woman has in two years. Not that's there's a snowball chance in Hades it will lead anywhere once she discovers the truth. But two months later, when Turner realizes his now imprisoned suspect has hired someone to knock off witnesses and Reece is one of them, he's dead set on saving her. If that means taking on her seventy-year-old grandma who has a black belt in Karate, a hired assassin--who scares him less than Granny--and the whole bat-shit crazy town of Hung, Georgia, he's up for the challenge. Turner is about to turn over a brand new leaf, and get hung up on love.Ready to WereA Paranormal Romance by Robyn PetermanI never planned on going back to Hung Island, Georgia. Ever. I was a top notch Were agent for the secret Paranormal Council and happily living in Chicago where I had everything I needed - a gym membership, season tickets to the Cubs and Dwayne - my gay, Vampyre best friend. Going back now would mean facing the reason I'd left and I'd rather chew my own paw off than deal with Hank.Hank the Tank Wilson was the six foot three, obnoxious, egotistical, perfect-assed, best-sex-of-my-life, Werewolf who cheated on me and broke my heart. At the time, I did what any rational woman would do. I left in the middle of the night with a suitcase, big plans and enough money for a one-way bus ticket to freedom. I vowed to never return.But here I am, trying to wrap my head around what has happened to some missing Weres without wrapping my body around Hank. I hope I don't have to eat my words and my paw.",
  "genres": [
    "Romance",
    "Anthologies",
    "Contemporary",
    "Chick Lit",
    "Humor",
    "Romantic Suspense",
    "Paranormal Romance"
  ],
  "author": "Kathleen Brooks",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/22447426-three-southern-beaches"
}