{
  "title": "The Able Life of Cody Jane - Still Celebrating",
  "description": "Marly Cornell tells the story of her daughter Cody, a person of joyful spirit and infectious humor who travels, falls in love more than once, commits to a life partner, advocates for others, and achieves a life of independence--in spite of plentiful and confining physical disabilities. Whether dealing with school, relationships, sex, work, Internet romance, multiple surgeries, bias, barriers, or fear, Cody's charming combination of innocence, wisdom, and sense of fun have a profound effect on everyone she encounters. Through this story of love, laughter, faith, and miracles, Marly illuminates the deeper truth, allowing us a glimpse at something Cody knew all about, the complete inability of circumstance to deflect greatness of spirit, a reminder that each day of life is best engaged with a sense of achievement and celebration.''The most moving chronicle of life in our special world that I have read to date. An uplifting must-read.''--Paul Olson, CEO, Freedom in Wheelchairs ''Marly Cornell tells Cody's story in an engaging way that will not only touch you but will introduce you to a person who has much to teach us about the values we claim to embrace but often ignore.''--Gary L. Francione, Author of Animals as Persons , Rain Without Thunder ; Professor, Rutgers University School of Law ''Reading this book while going through life-threatening health challenges, I learned more about going forward, knowing I'm living a productive life--and that I deserve to ask and expect more from healthcare.''--Julia Washenberger, Disability Linkage Line Options Counselor, Metropolitan Center for Independent Living '' The Able Life of Cody Jane serves as a reminder that life is simply too short to be defined by others' misperceptions of our abilities.''--Cindy Brownstein, CEO, Spina Bifida Association, Washington, DC",
  "genres": [],
  "author": "Marly Cornell",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/11316962-the-able-life-of-cody-jane---still-celebrating"
}