{
  "title": "Horned God Rising",
  "description": "The final installment in the Horned God Series by Stella Inox. Ryannon returns to Otherworld to keep her promise to Cernunnos, the newly returned Lord of the Forest and the Fae King who saved her.But the Horned God is playing a deeper game than Ryannon can fathom. The wily half breed sprite must gamble her life one more time to save an entire land and the lives of those she loves.She must place her heart and her trust in the hands of one whose betrayal will destroy her. In this finale, all questions will finally be answered.This is not your average bed time story. For lovers of hot alpha male characters, myth, legend, magic and folklore with sidhe, fae or faerie, this is an adult fairy tale with a twist. The start to the Horned God series, this supernatural story is not for the faint-hearted. If you're a fan of paranormal erotic romance than this one is for you! Excerpt:Ryannon was fleeing from him. He couldn’t sense her but he was far more of a Hunter than Herne had ever been. Cernunnos had ruled this landscape long before the usurper had risen to assume his place. She was hidden from his many seeking eyes and ears but he could still feel her passage across the landscape as if she was running those delicate fingertips of hers across his chest. The fox was fleeing so it was only mete that he gave chase. She might be disappointed otherwise.He plunged his hand into a new rift and pulled the ivory horn through. Had anyone been watching, it would have seemed as if he’d just created it from thin air. He might be powerful, but not that powerful.It felt good to have polished bone back in his hands again. Losing it to Herne had been like watching someone mistreat an old friend. He raised the gold tipped mouthpiece to his lips and blew a sustained brassy note that echoed across the valley.The war like whoops of the Wild Hunt sounded back as they gave assent. They would be summoning mounts and readying themselves for sport but this hunt would different. The hunt would run but just like in long forgotten times, they would run as a pack.Cernunnos laughed joyfully.Throwing the antlers back he gave in to the call of the Hunt, letting the wild magics seize him, twisting his form in a flurry of feral power. He fell to his knees, antlers shrinking and his bones crunched and cracked, flowing into an old mold. Branches swayed and thrashed in the sudden wind and autumn leaves whirled around him, even as his laughter stretched and strained, becoming higher pitched morphing into the high threatening howl of a dire wolf.The excited yells of the wild hunt changed tone. They too became more untamed and savage as all of the two legged predators forms gave way to Cernunnos’s will, becoming four footed furred pursuers.He rose to his feet. He knew what he looked like but it had been eons ago that he had last been able to assume this form. His wolf shape was huge, a full four feet high at the chest. When he finally cornered Ryannon, he could look her directly in the eyes. The falling breeze ruffled his iron grey and silver fur. Cernunnos gave a sharp lupine smile, tongue lolling. He had no intention of leaving so important a hunt to the inferior noses of the Fae hounds. His green eyes, so unusual in a dire wolf were intent.He drew himself up, shaking out the tremors and gave call with a long bell like howl, summoning his hunt pack to his side. It was time to run.",
  "genres": [],
  "author": "Stella Inox",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/22446715-horned-god-rising"
}