{
  "title": "Everything You Know About God is Wrong: The Disinformation Guide to Religion",
  "description": "In the new megaanthology from bestselling editor Russ Kick, more than fifty writers, reporters, and researchers invade the inner sanctum for an unrestrained look at the wild and wooly world of organized belief. Richard Dawkins shows us the strange, scary properties of religion/ Neil Gaiman turns a biblical atrocity story into a comic (that almost sent a publisher to prison)/ Erik Davis looks at what happens when religion and California collide/ Mike Dash eyes stigmatics/ Douglas Rushkoff exposes the trouble with Judaism/ Paul Krassner reveals his \"Confessions of an Atheist\"/ and bestselling lexicographer Jonathon Green interprets the language of religious prejudice. Among the dozens of other articles and essays, you'll a sweeping look at classical composers and Great American Songbook writers who were unbelievers, such as Irving Berlin, creator of \"God Bless America\"/ the definitive explanation of why America is not a Christian nation/ the bizarre, Catholicfundamentalist books by Mel Gibson's father/ eyepopping photos of bizarre religious objects and ceremonies, including snakehandlers and potsmoking children/ the thinly veiled antiSemitism in the Left Behind novels/ an extract from the rare, suppressed book The Sex Life of Brigham Young/ and rarely seen antireligious writings from Mark Twain and H.G. Wells. Further topics include exorcisms, religious curses, Wicca, the Church of John Coltrane, crimes by clergy, death without God, Christian sex manuals, the \"exgay\" movement, failed prophecies, bizarre theology, religious bowling, atheist rock and roll, \"how to be a good Christian,\" an entertaining look at the best (and worst) books on religion, and much more.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Atheism",
    "Philosophy",
    "Science",
    "Reference",
    "History"
  ],
  "author": "Russ Kick",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/22449.Everything_You_Know_About_God_is_Wrong"
}