{
  "title": "جمهورية القرد الأحمر",
  "description": "تدور أحداث الرواية في اطار سياسي حول جبهة قام بتشكيلها مجموعة من الشباب عقب الثورة. تتوالى الأحداث لتعبر عن حكايات جيل يتنقل ما بين طموحاته وواقعه المشحون بالصراع.تنقلب الأحداث في النهاية نحو ظهور القرد الأحمر في المستقبل كلعبة إفتراضية تنتقل إلى أرض الواقع وتغير كل شئ للأبد. *****أنا القرد الأحمرأنسَ كل ما مضىأنسَ كل ما كنت تعرفهنحن الدولة الجديدةاجمعوا كل شئ تعرفونه وتعلمتوه واضربوه في ألف.. نحن هذا الرقماضرب خوفك في ألف.. أنا هذا الفزعاضرب ضياعك في ألف.. أنا هذا الزمناضرب عقدتك في ألف.. أنا هذا الألمأنا القرد الأحمرأعلن تأسيس الجمهورية الجديدة******كلُّ الكتاب يكذبون.. لا تصدقهم.. هم يرون لك دوما قصصا مختلفة عن الحقيقة.. لا تصدق الكتاب.. إنهم أخفوا الحقيقة عنك.. القاتل ليس فلاناً!.. فلانٌ ليس سوى رمز.. فلانٌ الذي قتل.. فلانٌ الذي قُتل.. وفلانٌ الذي قتل نفسه.. كلُّ هذا كذب!لا تصدق الأدباء.. كلهم كاذبون.. أو ربما صادقون حد الكذب.. لا يكشفون الحقيقة كاملة.. يلخصونها في جريمة واحدة.. قاتل واحد.. جثة مفقودة الهوية.. يخدعونك برموز متوارية.. لا تصدقهم!.. القتلة كثيرون ولكنهم لخصوها في واحد.. الجريمة ليست غامضة والجثة معروفة وملقاة هنا على قارعة الطريق تمر عليها ليل نهار.. تطأها أنت أيضا كالآخرين .. خبأ الأدباءُ الحقيقةَ في دهاليز الحكاية.. خبأوا الأسى الطويل في المجاز.. تركوا النهايات مفتوحة.. تركوك وحدك تعيش في الجريمة ورحلوا.. الجريمة مستمرة.. كل الكتاب كاذبون!.. فلا تصدق ما قالوه وما سيقولوه.. الكذب أقوى من المال.. الكذب أقوى من الدم.. أخطر من فوهة البندقية وحد السنجة.أما الساسة.. فهؤلاء يقتلون بجرة قلم.. بإشارة واحدة يشعلون الحروب.. بشعار واحد يقتلون المئات على العتبات.. السياسة أقوى من نيران الثورات.. لا تصدق الساسة.. لا تصدق الكتاب.. لا تصدق المحللين لأفعال كلا الطرفين.. لا تصدق شاشات البث.. لا تصدق النخبة.. بل صدق الجريمة.. انظر إلى موضع قدميك حيث ترقد الجثة.. ابكي هنا دمعاً صادقاً فوق رأس الشعب الفقيد إلى الله.. ارفع فوق الجثة العلمَ واربض كأسد قصر النيل.. لا تبارح.. لا تثبت بدل عينيك الجواهر.. لن ترى!.. كل الساسة يكذبون.. كل الشعوب تصدق.. ردد خلفي ثانية.. كل الساسة يكذبون.. كل الشعوب تصدق.. لا تصدق سوى الجثة.. والجثة بلد.. والقاتل ليس واحد.. القتلة على كل ناصية أينما ألتفت",
  "genres": [
    "Novels",
    "Fiction"
  ],
  "author": "ياسر أحمد",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/22452436"
}