{
  "title": "The Strangest Story Ever Told",
  "description": "WHAT was the secret of Alaska's Thomas Bay? It held fabulous wealth in gold, but, for most men, even gold wasn't enough to lure them there. Yet, brave men dared to visit its bleak shores. Some returned horror-stricken, refusing to talk about what they had seen. Some returned insane, with terror written in their eyes. Some never returned! One of the first men to come back from what was to become known as the Devil's Country was shaken and afraid. He begged his partners to stake him to a ticket to Seattle and left Alaska forever. He paid for his ticket with a piece of rich, gold-bearing quartz and a story of horror. “Swarming up the ridge toward me from the lake were the most hideous creatures . . . their bodies covered with long, coarse hair, except where the scabs and running sores had replaced it. Each one seemed to be reaching out for me and striving to be the first to get me. The air was full of their cries, and the stench from their sores and bodies made me faint.” What were these nightmarish figures? Were they supernatural beings? Or visitors from another world? Or survivors from some prehistoric era? Whatever they were, they were vicious, soul-tormenting, body-destroying, and evil. And they were terrifying enough to come between gold- seekers and a tremendously rich strike. Harry D. Colp was one of the original partners who heard the story of Thomas Bay. As a prospector in southeastern Alaska at the turn of the century, he collected whatever information he could about the “things” of the lake. The stories have been told over and over around Sourdoughs' campfires and have become part of the legend of the gold-country. So it was with great excitement that Mr. Colp's wife discovered the original manuscript of The Strangest Story Ever Told a few years after the author's death in 1950. The devotee of the bizarre, the supernatural, and the horrible will find this book fascinating fare. It has the creeping terror, the other-worldliness, and the strange timelessness of the works of the great masters of weird tales.",
  "genres": [
    "Adventure",
    "Historical",
    "Horror",
    "Fiction"
  ],
  "author": "Harry D. Colp",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/22452510-the-strangest-story-ever-told"
}