{
  "title": "The Soul's Mark Series Boxed Set",
  "description": "All five books of The Soul's Mark series are included in this eBook collection.\nThe Soul's Mark: FOUND:\n Amelia Caldwell is shocked to learn that she is marked by vampire Mitchell Lang's soul. After searching for his soulmate for nearly a century, and now that Amelia's here, Mitchell's not letting her go. As their newly formed soul's bond wreaks havoc with their emotions, Amelia unlocks her painful past, uncovering a powerful secret. Caught in the middle of a deadly game of revenge, she quickly learns YOU CANNOT RUN FROM DESTINY.\nWaking Dreams:\n Eric had a history, a life before Amelia Caldwell arrived on the scene. Yet there was something familiar about her, an attraction that was destined not to be fulfilled because she was marked for his father. One day he was a simple rancher, the next in a world beyond his wildest imagination--dreaming of a girl he knew he couldn't live without.\nThe Soul's Mark: HUNTED:\n After a shaky start, Amelia and Mitchell are finally getting along. But the tranquillity is short-lived when an unexpected reunion with Mitchell's ex-girlfriend and Eric's mysterious dreams adds tension to their new life and threatens their blissful home. Danger becomes inevitable when vampires and humans turn up dead, and the killer is heading straight for their front door!\nThe Soul's Mark: BROKEN:\n Willowberg doesn't take kindly to unexpected guests; the vampire hunters are no exception. When turmoil breaks out between the vampires and humans, Amelia must fight not only for her and her family's freedom, but also for the town's humans. Forced to face a fate decided by a power much closer to her than she ever imagined, will she find the strength to mend what has been broken?\nThe Soul's Mark: CHANGED:\n Amelia and Mitchell have a predicament on their hands--Amelia is now a vampire, and Mitchell is a human with a very bad cold. All hell breaks loose when they encounter an unexpected resistance and an unexplained deadline from the spirits. Amelia soon realizes this is a fight she can't win alone and in order to save Mitchell, he needs to change--again--but will he survive?",
  "genres": [
    "Paranormal"
  ],
  "author": "Ashley Stoyanoff",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/22451333-the-soul-s-mark-series-boxed-set"
}