{
  "title": "Lucifer",
  "description": "This series is a continuation of my Watcher series of books. You need to have read the following series (in this order) to understand what is happening in this The Watchers Trilogy, The Watcher Chronicles, and Caylin's Story. Please be advised that this series will contain sexual situations of a mature nature. If I were to rate this series like a movie, I would rate it 'R'.  Anna’s quest for answers about her future propels her to follow Lucifer down the veritable rabbit hole. During her foolhardy expedition, she discovers the truth about Lucifer’s domain and the truth about Lucifer himself. She learns more about her parents’ forbidden romance from Lucifer’s perspective, and comes to understand that the tie that bonds two souls together can’t even be broken by death itself. All her life, Anna has lived with the knowledge that her mother chose to die in order to give her a chance to live. Being the recipient of such unselfish love and sacrifice, lays a heavy burden on Anna’s heart to make her mother proud. Anna and the other Watchers soon uncover Lucifer’s master plan to prevent her from obtaining anymore of the seals. She also discovers what the seals will ultimately do to not only her body but also her soul. Armed with this knowledge, Anna can only discern two possible motives for Lucifer’s actions. Either he is simply protecting her the only way he knows how, or he wants to retain his power on Earth and ensure his daughter never stakes claim to her birthright. In the end, neither reason is good enough to prevent Anna from completing her God given mission to obtain the seven seals and return them to Heaven. Even though Anna can feel the seals begin to change her, her commitment to retrieve them remains unwavering. Only time can reveal if Anna is strong enough to master the power of the seals or if they will ultimately master her.   Reading Order of Watcher Books by  The Watchers Trilogy (Ages 13+)  The Watcher Chronicles (Ages 17+ due to mature content in books 3 and 4)  Caylin’s Story (Ages 13+ – Can be read by younger readers without having to read the Watcher Chronicles)  The Redemption Series (Ages 17+ due to mature content in books 3 and 4)    Bonus Books (Books which will be written but are not part of the main storyline):  Aiden’s Story (Coming 2015)  Alternate Earth Series (Coming 2015)",
  "genres": [
    "Angels",
    "Fantasy",
    "Paranormal",
    "Supernatural",
    "Audiobook",
    "Romance",
    "Paranormal Romance"
  ],
  "author": "S.J. West",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/22454728-lucifer"
}