{
  "title": "Master of Passion",
  "description": "What happens when you put a battered and terrified woman on the run with a troubled and determined Master? A love story of a lifetime is born. My name is Riley, well really it's Layla, but you'll find out about that soon enough. My life the last four years has been a f-ing nightmare turned real life. I am married to a man who sells women for a living. You might ask me how I got myself into this situation. Well it wasn't intentional. I fell in love with Kevin over our four year courtship. He was the most loving and gentle man I had ever known. All of that died the night of our wedding. In him a monster was born. The worst kind. He gets off on my pain, not like erotic pain, no the real heavy shit. But that is all about to change. I've been given a second chance. My name is Josh I am a firefighter. It's my love, but my passion is the Club. Club Threshold is my baby. Tom, Mike and I started it years ago. It's become my safe haven. My rock through all the tough shit in my life. I roll through submissive's like fucking toilet paper. I am searching for her. She haunts me in my dreams. I need to save her. I didn't know who she was until that night. She's the one I've been dreaming of, the one I've been longing for, the woman I need. My submissive. My name is Kevin, I'm a one of a kind man, except that I'm not kind. Every decision I make is for a specific reason, and this last one its because of her. I can’t believe I found her. Ever since the fire I have been looking tirelessly for the girl that we used to play with next door. She’s here, in Sacramento. Right within my fingertips. Too bad for her because I won’t let her get away. I am a messed up son of a bitch who is in need of some psychotherapy. But I need her more. I will have her. I don’t care if I have to f-ing steal her; I do it for a living. I’m not proud of it but when I left home I came with nothing. Faked my death to get away from those people. Made a new life for myself with a new family. She will be my wife, she just doesn’t know it yet, but she will be. I love her in the way I can, she is my everything. 18+ Adult Dark Erotic Romance, not suitable for people under 18+ You will not enjoy this book if you are sensitive to grief, slavery, and difficult to read subjects.",
  "genres": [],
  "author": "Nikki Faye",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/22451084-master-of-passion"
}