{
  "title": "My Rebel Highlander",
  "description": "Known for his wicked wit, fierce loyalty, and skills in battle, Robert \"Rebbie\" MacInnis, the Earl of Rebbinglen, loves freedom and has no plans of marrying anytime soon. But when his father, a powerful Scottish marquess, signs a contract betrothing Rebbie to an earl's young daughter, he is furious. If he has to marry, he's determined to choose his own bride, though he has no inkling who he would wish to wed until fate intervenes to remind him of one fair-haired, nameless beauty and the passionate night they spent together years ago. A night forever etched in his memory. Lady Calla Ferguson, a penniless widow with a young son, is forced to seek employment as her cousin's companion in order to pay her late husband's massive gambling debt. Having been ignored or mistreated most of her life, Calla has become a resourceful survivor who will stop at nothing to get what she wants—safety and security for her son and herself. Wealthy merchant, Claybourne cares little for the money the Earl of Stanbury owed him; he simply wants the earl's beautiful, voluptuous widow and he'll do whatever it takes to get his hands on her, even kidnapping and blackmail. When Rebbie happens upon Claybourne abducting Calla, he rescues her and hides her in a secluded castle deep in the wild Scottish Highlands. Calla conceals her passionate spirit beneath reserve and duty, along with closely-guarded secrets which, if exposed, could ruin both her life and her son's. Years ago, she lost her heart to a dark-eyed stranger she never thought to see again, but now he's her protector. Rebbie craves another pleasurable night like the one they shared in the past, and she cannot resist the fiery passion that echoes deep in her heart and soul. Soft but strong, Calla sparks within Rebbie a desperate hunger and a need to protect her. But will her secrets tear them apart?",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Adult"
  ],
  "author": "Vonda Sinclair",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/22460375-my-rebel-highlander"
}