{
  "title": "Encyclopedia of Gods: Over 2,500 Deities of the World",
  "description": "Since the beginning of time, the same mysteries have puzzled people on every continent; the same fears have beset them. They have attempted to explain the mysteries and allay the fears in the same way - through the worship of gods. Deities have been identified with the human psyche for at least 60,000 years. Encyclopedia of Gods offers concise information on more than 2,500 of these deities, from the most ancient gods of polytheistic societies - Hittite, Sumerian, Mesopotamian - to the most contemporary gods of the major monotheistic religions - Allah, God, Yahweh. Among the cultures included are African peoples, Albanian, Pre-Islamic Arabian, Aztec, Babylonian, Buddhist, Canaanite, Celtic, Egyptian, Native American, Etruscan, Germanic, Greek, Roman, Hindu, Persian, Polynesian, and Shinto. The Encyclopedia includes not only the most significant gods of each culture but minor deities as well. Here you will find information not only on Zeus, Thor and Astarte but also on Tozi, the Aztec goddess of healing, Annamurti, the Hindu patron deity of the kitchen, and Nyakaya, the Shilluk crocodile goddess. Each entry provides details on what culture worshiped the god, the role of the god, and the characteristics and symbols used in identification. In the case of the more important personalities, references in art and literature and known dates of worship are also provided. Indexes by civilization and role of the god enable the researcher to compare gods across cultures or to find information on specific topics of interest. Encyclopedia of Gods will be indispensable to students and researchers in religions, anthropology, history and archaeology. It will also provide endless information for thereader interested in mythology and legend.",
  "genres": [
    "Reference",
    "Mythology",
    "Religion",
    "Nonfiction",
    "History",
    "Magic",
    "Paganism"
  ],
  "author": "Michael    Jordan",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/1131779.Encyclopedia_of_Gods"
}