{
  "title": "The Liveship Traders Trilogy",
  "description": "This is a three books collection. Titles in this collection are : Ship of Magic, The Mad Ship, Ship of Destiny Robin Hobb was born in California in 1952 and majored in Communications at Denver University, Colorado. Assassin's Apprentice was her first novel, and was followed by the equally successful Royal Assassin and Assassin's Quest. She lives outside Seattle, Washington. The magic and mayhem continue in this thrilling second instalment of Hobb's new series. Althea Vestrit has found a new home aboard the liveship Ophelia, but she lives only to reclaim the Vivacia as her rightful inheritance. However, the Vivacia has been captured by the pirate, 'King' Kennit, and is acquiring a keen bloodlust. Meanwhile in Bingtown, the fading fortunes of the Vestrit family lead Malta deeper into the magical secrets of the mysterious Rain Wilds Traders. And just outside Bingtown, Amber dreams of relaunching the Paragon, The Mad Ship! The second volume in this superb trilogy from the author of THE FARSEER TRILOGY continues the dramatic tale of piracy, serpents, love and magic. Hobb is one of the great modern fantasy writers! what makes her novels as addictive as morphine is not just their imaginative brilliance but the way her characters are compromised and manipulated by politics.' The Times Assassin's 'A gleaming debut' PUBLISHERS WEEKLY Assassin's 'Assassin's Quest achieves a bittersweet, powerful complexity rare in fantasy' LOCUS 'Robin Hobb writes achingly well' SFX Praise for The Liveship Traders 'Even better than the Assassin books. I didn't think that was possible' George R R Martin 'Hobb is a remarkable storyteller.' Guardian.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "Dragons",
    "Adventure",
    "Audiobook",
    "Science Fiction Fantasy"
  ],
  "author": "Robin Hobb",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/22463498-the-liveship-traders-trilogy"
}