{
  "title": "The Complete Obsessed Series",
  "description": "THE COMPLETE OBSESSED SERIESFinally, all four parts of The Obsessed Series in one bundle.Obsessed - Part OneIndependent jewelry designer, Ivy Marlow, had it all - the man, the security and the ring. Now, all she has to her name are a broken engagement, the crushing worry of a flailing business and the haunting feeling of complete betrayal.The last thing Ivy expected to find attending a posh New York art show, was him. Jax Walker is everything she doesn't need but can't resist. He's gorgeous, brazen, unapologetic and powerful. He becomes the escape Ivy has been craving and longing for. He knows what she needs, anticipates her desires and offers it all to her, but at what price?What once seemed to be a chance encounter designed by fate becomes more enigmatic than the man himself. Jax is full of secrets and Ivy is about to learn that his obsession for her runs deeper and darker than she ever imagined.Obsessed - Part TwoWhen Ivy first met Jax, she knew he was everything she wanted, but she didn't need. She couldn't have been more right. She thought she was done with the lies, the secrets and the betrayals, but her past is inescapable, no matter how hard she tries. That pain that she once thought was buried forever is slowly starting to resurface and it may just be too much for her already fragile heart to take.If there's one thing that Ivy loves most about Jax, it's his relentless need for control. He does everything he can to win her back and to prove that there's more to him than his past demons. He swears he's a changed man, but can a man like Jax ever really change?As Ivy begins to believe in Jax again, an unexpected secret tears her world apart. Past lovers return, schemes are exposed and Ivy is left standing in the center of it all.Obsessed - Part ThreeIvy wanted Jax to be the man of her dreams. After all the lies, the mysteries and the manipulations she was ready to start on the path towards a new beginning. That all came to a crashing halt that blindsided them both. The images that flashed across his computer screen are burned forever in her memory. They're inescapable and the only way out of the darkness leads straight back to him.She knows what she saw. He knows what he believes. Will his unending drive to possess her push her away forever?As Ivy puts the pieces of her shattered life back together, she's confronted with a reality she never saw coming. Is she strong enough to find her way to the truth? And who will be waiting for her when she gets there?Still Obsessed - Part FourThe end is here...Life couldn't have been more idealistic for Ivy Marlow. She owned the business of her dreams, worked alongside the man she loved, and her future was bright and filled with unending promise. Looks can be deceiving though and as much as she loved her life, she knew that she and Jax Walker were destined for a collision course if something didn't change.Destiny stepped in and one fateful night on a dark street, everyone's life transformed in a profound way. Ivy is tossed back into the past she thought was behind her and Jax is determined to reclaim what was rightfully his.What neither of them could have predicted is that life doesn't let you plan your own course. Sometimes you have to let fate take you by the hand so you can find your true destiny. Is Ivy's future with Jax or will the ghosts of her past destroy them forever?",
  "genres": [
    "Romance",
    "Contemporary",
    "Erotica",
    "New Adult",
    "Contemporary Romance",
    "Erotic Romance",
    "Fiction"
  ],
  "author": "Deborah Bladon",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/22463022-the-complete-obsessed-series"
}