{
  "title": "Earth 2788",
  "description": "EARTH 2788 - The Earth Girl Short StoriesA collection of eight prequel stories, set in the distant future of the Earth Girl trilogy (Earth Girl, Earth Star, and Earth Flight)In the year 2788, people use interstellar portals to travel between over a thousand colony worlds scattered across six sectors of space, each with their own contrasting cultures. On the rich worlds of Alpha sector, you aren’t considered fully adult until 25, while the frontier worlds of Epsilon sector expect a girl to marry at 17. Clan centred Beta sector is notoriously permissive, while Deltan worlds consider it shocking behaviour to kiss in public. In Kappa sector, the military battle to make new worlds safe for colonization, while Earth is a semi-abandoned ruin.Each story features one of the characters from the Earth Girl trilogy. Eight people, with eight very distinctive backgrounds and problems, all destined to get caught up in one girl’s fight for acceptance. A fight that will change Earth forever.Cover art by Alex Storer/ http://www.thelightdream.net/ EARTH 2788 – Short story. Jarra trespasses on forbidden ground.ALPHA SECTOR 2788 – Short story. Dalmora’s sheltered life is about to change.BETA SECTOR 2788 – A novelette. Lolia’s marriage is falling apart.GAMMA SECTOR 2788 -Short story. Krath’s life is literally on the scrap heap.DELTA SECTOR 2788 – Short story. Fian’s father is planning his future for him, but Fian has his own ideas.EPSILON SECTOR 2788 – Short story. On a frontier planet, Amalie is considering possible husbands.KAPPA SECTOR 2788 – A novelette. As he hands over a new world to its first colonists, Colonel Riak Torrek plans to retire.ZETA SECTOR 2788 – A novelette. The heroic Major Drago Tell Dramis has finally found something that scares him.This set of stories is no longer on the author's website but is now available worldwide in a range of ebook formats as well as paperback.",
  "genres": [
    "Science Fiction",
    "Young Adult",
    "Short Stories",
    "School",
    "Science Fiction Fantasy",
    "British Literature",
    "Fantasy"
  ],
  "author": "Janet  Edwards",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/22465083-earth-2788"
}