{
  "title": "The West Series #1-3",
  "description": "Loving Lauren:Lauren had been raised to not be afraid of anything, and she lived by that code, that is until her dad died and left everything in her hands. Now she’s not only in charge of her two younger sisters, but she’s running a full-blown Texas ranch. Caring for a thousand‑acre ranch has its ups and downs, physically, mentally, and financially. All she is looking for is a little break. What she doesn't have time for is someone who will only complicate her life further.Chase is back in his hometown. Helping his dad with his veterinary practice is high on his list. So is being with the lovely Lauren West. Years ago, he found a unique way to bind them together. Now all he has to do is prove to her that he’s the right man to spend the rest of her life with.Taming Alex:Alexis has always been the wild child. She’s the girl everyone always gossips about behind her back. Now that she's engaged to the town’s bad boy, Travis, she finally thinks she's heading in the right direction. Then life throws a tall, dark, and good man her way and causes her whole world to shake.Grant's back in town. Helping his father with his legal practice had never been in his plan. But after trying to live in the city and deciding it wasn’t for him, he wants nothing more than to settle back down in his hometown. He even buys a small farm to prove to himself that he's back to stay. After stepping in and helping the town's bad girl out one night, he starts to see beneath Alexis' act. Now all he needs to do is convince her that choosing a good guy is not always a bad thing.Holding Haley:Haley has waited her whole life for Wes. They were secret sweethearts all throughout school until he shocks her by joining the military right after graduation. Heartbroken, Haley must wait until the day he comes home. But it’s been five long years, and she has finally decided to move on with her life. That is, until he walks back into town, sexier than ever.Wes has had one thing on his mind since leaving town—getting back to Haley. His experiences overseas have made him realize what he almost let slip through his fingers. All he wants now is to prove to her that waiting for him was the right choice.",
  "genres": [
    "Romance",
    "Anthologies",
    "Contemporary"
  ],
  "author": "Jill Sanders",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/22464319-the-west-series-1-3"
}