{
  "title": "Razor's Traitorous Heart",
  "description": "Kali Parks is a shadow in the war between two factions that are fighting to gain control of Chicago. Born and raised on the streets, she stands as a silent sentinel at her brother’s side as he battles to gain control. She will do whatever it takes to bring peace to those she has pledged her life to protect, including fighting against the creatures that came to their world almost six years before.  Razor, a High Chancellor for the Alliance, has been sent to oversee the remaining Trivator troops on Earth and make sure the transition for the induction of Earth into the Alliance goes smoothly. He is the one the Alliance calls when they have a situation that needs to be resolved once and for all. His reputation for dealing with difficult rebels is renowned. He asks no questions and takes no prisoners. His job is to eliminate all threats to the Alliance.  He finds himself torn between duty and something he is unfamiliar with, his heart. When a shadow warrior saves his life and disappears, he discovers his world is no longer as cut and dry as he thought. The more he learns, the more he discovers he is not immune to the warrior’s passionate desire to fight to protect her people.  Forced by duty to settle the conflict, he must decide between the Alliance and his own desire to claim the unwilling warrior. When the conflict escalates, he does the only thing he can; he makes a pact with one of the factions in exchange for a prize that will surely cause a battle of a different kind – the one for his traitorous heart.  Will he be able to claim her before she escapes from him again? Or worse, will she sacrifice her life to protect those she loves before he can?",
  "genres": [
    "Aliens",
    "Science Fiction",
    "Romance",
    "Science Fiction Romance",
    "Fantasy",
    "Paranormal",
    "Audiobook"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/22461258-razor-s-traitorous-heart"
}