{
  "title": "Alles, was wir geben mussten",
  "description": "Ein Speisesaal, ein Sportplatz und getrennte Schlafsäle für Jungen und Mädchen – auf den ersten Blick scheint Hailsham ein ganz gewöhnliches Internat zu sein. Aber die Lehrer, so freundlich und engagiert sie auch sind, heißen hier »Wächter« und lassen die Kinder früh spüren, dass ihnen ein besonderes Schicksal auferlegt worden ist. Diese Gewissheit verbindet Kathy, Ruth und Tommy durch alle Stürme der Pubertät und Verwirrungen der Liebe – bis für zwei von ihnen das Ende naht.Ein anrührendes und ungewöhnlich spannendes Meisterwerk über Menschen, deren Leben auf beklemmende Weise vorherbestimmt ist.Kathy ist einunddreißig Jahre alt und arbeitet als Betreuerin. Wann immer sie durch England fährt und hinter Pappeln ein halb verborgenes Herrenhaus sieht, muss sie an Hailsham denken, das Internat, in dem sie ihre Kindheit und Jugend verbrachte. Unwillkürlich steigen dann in ihr Erinnerungen an Tommy auf, der sich mit trotzigen Wutanfällen gegen die Ausgrenzung durch die Mitschüler wehrte, denen er nicht kreativ genug war. Seine geheimsten Ängste und Wünsche vertraute Tommy immer ihr, Kathy, an, aber eine Liebesbeziehung ging er zunächst mit ihrer besten Freundin ein, mit Ruth.Sie alle waren damals in Hailsham gut behütet, aber auch vollständig von der Außenwelt abgeschnitten. Die Lehrer erzählten den Kindern, dass sie später »spenden« oder »betreuen« würden, aber was sich hinter diesen Begriffen verbarg, verriet ihnen niemand. Im Unterricht fertigten die Schüler Bilder und Gedichte an, und zweimal im Jahr kam eine Respekt erheischende Dame und sammelte die besten davon für eine Galerie ein, die aber keiner der Schüler je zu Gesicht bekam.Tommy hatte den Verdacht, dass die Aufseher anhand dieser Artefakte entscheiden wollten, ob zwei Menschen wirklich zueinander passten. Denn nur wirkliche Liebespaare, so hieß es in Hailsham, konnten noch einen Aufschub erhalten, bevor sie »Spender« wurden.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Dystopia",
    "Book Club",
    "Contemporary",
    "Literary Fiction",
    "Romance"
  ],
  "author": "Kazuo Ishiguro",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/10145851-alles-was-wir-geben-mussten"
}