{
  "title": "Buried Innocence",
  "description": "Placing the bags on the counter, Donna slipped off her jacket and hung it on the back of a kitchen chair, and then she pulled an apron over her work clothes. She started unpacking the groceries, first putting the refrigerated foods away and then she started working on the canned goods. She smiled as she heard Ryan singing. It wasn’t a tune she was familiar with, so he must have learned it in daycare.“Where did you learn that song?” she asked him, leaning over the open counter to listen more closely to the words.“Liza taught it to me,” he said.She smiled. Ryan’s invisible friend was certainly creative. “Well, say thank you to Liza for me,” she replied. “It’s a pretty song.”He continued singing it, “Who will wipe away my tears? Who will chase away my fears? Who will sing me to sleep at night? Who will tuck me in real tight? Now that Momma’s dead and gone, now that Momma’s dead and gone.”Slightly alarmed at the lyrics, Donna walked around the counter and entered the living room. “How would you like to watch your favorite cartoon?” she asked, picking up a DVD on a shelf next to the television set and sliding it into the DVD player.“But Liza still wants to sing,” Ryan said.“Well, Liza can sing and you can watch television,” she said. “How’s that for a compromise.”He nodded. “I guess that will be fine.”She turned on the television and waited until Ryan’s show started before returning to the kitchen to put away the rest of the groceries. She opened up a cupboard and was reaching up to the top shelf to put an extra jar of peanut butter away when she heard the soft voice behind her. It was high-pitched, like a little girl’s voice, but it held an ethereal quality to it as it filled the kitchen.“Who will wipe away my tears? Who will chase away my fears? Who will sing me to sleep at night? Who will tuck me in real tight? Now that Momma’s dead and gone, now that Momma’s dead and gone.”Mary O’Reilly receives a call from a friend in Galena urging her to drive there and speak with a woman who is sure her house is haunted by a little girl. Once she meets the child, she is astonished to discover the child was re-homed, an underground adoption practice still practiced in the United States. Unfortunately, her re-homing did not end well and Mary, Bradley and Mike search for a couple who “adopt” unwanted children and then murder them.",
  "genres": [
    "Mystery",
    "Paranormal",
    "Romance",
    "Ghosts",
    "Fiction",
    "Paranormal Mystery",
    "Fantasy"
  ],
  "author": "Terri Reid",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/22468174-buried-innocence"
}