{
  "title": "Ravensdale",
  "description": "Recent winner of the coveted B.R.A.G medallion for outstanding self-published fiction, this work also features on the INCA website for original fiction of literary merit.For those who love a satire on the tropes of historical romance which draws the reader into the story nevertheless. When the group of highwaymen headed by the disgraced Earl of Ravensdale holds up the hoydenish Isabella Murray’s coach, she knocks one of them down and lectures them all on following Robin Hood’s example.  The rascally Reynaud Ravensdale – otherwise known as the dashing highwayman Mr Fox – is fascinated at her spirit.  He escaped abroad three years back following his supposedly shooting a friend dead after a quarrel. Rumour has it that his far more respectable cousin was involved. Now, having come back during his father’s last illness, the young Earl is seeking to clear his name of murder, despite the slightly awkward fact that he is living as an outlaw meanwhile.  Isabella’s ambitious parents are eager to marry her off to Reynaud Ravensdale’s cousin, the next in line to his title. The totally unromantic Isabella is even ready to elope with her outlaw admirer to escape this fate – on condition that he teaches her how to be a highwaywoman herself.  This hilarious spoof uses vivid characters and lively comedy to bring new life to a theme traditionally favoured by historical novelists – that of the wild young Earl, who, falsely accused of murder by the machinations of a conniving cousin and prejudged by his reputation, lives as an outlaw whilst seeking to clear his name.  ‘Ravensdale’ is a fast paced, funny and historically authentic read from the writer of ‘That Scoundrel Émile Dubois’, following the adventures of that character's equally roguish cousin. It is set in 1792, just prior to the outbreak of the French Revolutionary Wars, and two years before the story of 'That Scoundrel Émile Dubois' (perma free on Amazon and elsewhere). 'Ravensdale' can be read as a stand alone novel. The author is currently writing a sequel to both this and 'That Scoundrel Émile Dubois, which she hopes to bring out by the winter of 2017.",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Historical",
    "Regency",
    "Georgian"
  ],
  "author": "Lucinda Elliot",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/22466530-ravensdale"
}