{
  "title": "Tangled Sheets: Hayden's Hellion & Tying the Knot",
  "description": "Mating Stone Sarah has found the perfect man and best of all, he loves her deeply. Before introducing her to his family he proposes and presents her with an amethyst pendant, a stone she doesn't realize is more than symbolic. When his brother reveals Mark's secret, Sarah must decide if she loves him enough to accept him even if he's not exactly human. And Mark must decide how far he'll go, how much he'll give up to claim Sarah as his mate. Is he willing to abandon his birthright? Is he willing to kill his own brother to keep it and Sarah? Lovers' Stone Luke Ursine is drawn to the most sacred place in his clan's lore. There he finds a woman who touches him like no other, and his own mating stone. Not a common mating stone, but a lovers' stone that declares he has only one true mate, one great love who will claim him body and soul. Anna is the most inappropriate of all mates. She's a hunter and they are sworn to destroy the Weres. Even if they can set aside generations of hate and murder, will their families let them live long enough to enjoy the promised destiny? Reader Advisory: Includes an M/M/F scene with very mild M/M action. Soul Stone He is physical perfection. He is sex personified. He is an incubus. All his life Tarris has followed the rules that would keep him from transforming into the dark soulless predator who feeds on the sexual energies of women, draining them to madness or to death. But now that he can no longer feed in a safe and controlled way, he faces a choice-hunt or starve. Callista is quiet and reserved. Her restrained exterior hides an astonishing passion and vivid imagination that have captured him. Who knew that a creature who had no soul could love a woman so deeply? Tarris must now find a way to control the change he feels coming and defeat the hunter who pursues him, obsessed with possessing Callista and destroying the incubus.",
  "genres": [
    "BDSM",
    "Contemporary Romance",
    "Erotica",
    "Erotic Romance",
    "Western Romance",
    "Contemporary"
  ],
  "author": "Maggie Casper",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/2247061.Tangled_Sheets"
}