{
  "title": "Alphas Unleashed",
  "description": "5 hot heroes. 4 authors. 4 worlds.Discover five sexy alpha heroes in four hot adventures. They were each taken, tortured and tormented. These powerful males were held against their will, prisoners of fate. What happens when they escape their captors...and fall in love? Vengeance. Desire. Destiny. Nothing can stop...Alphas Unleashed.A Warrior’s Heart (Marastin Dow Warriors, #1.1): S.E. SmithBen and Aaron Cooper think their luck has ended when the freighter they are on is captured by the Marastin Dow, a terrifying alien species known for their savagery. Instead they discover love with two warriors who capture their hearts. Now, they are in a race to keep the fragile gift they find before it is ripped away from them forever.**The Marastin Dow have appeared in the Dragon Lords of Valdier series.Sealed With A Kiss (A Djinn World Novella): Mina KhanRayez, a smoking hot chef and fire djinn in exile, lands himself in deep trouble (at the bottom of a beer bottle) when he tries to help a mysterious beautiful woman.Selene is pursued and desperate. She’ll do anything to keep her brother safe—including capture a djinn.While deception brings them together, dangerous enemies make them unlikely allies. Can one wrong lead to two rights and true love?Dead Drop: Carolyn JewelWallace Jackson has so little magic she expects to be kicked out of her group of street witches being trained to use their gifts and work with demons. No one is more shocked than she is when a powerful demon proves her wrong. And then asks a favor of her.The demon Palla is a warlord’s enforcer, a stone cold killer. Wallace Jackson is a pacifist witch with a dangerous power. He wants nothing to do with humans until he needs Wallace to help him free his former lover from a living death and release her spirit from unimaginable suffering.** Dead Drop is set in Carolyn’s My Immortals series world where demons and magic-using humans called the magekind are not quite getting along. Most people have no idea they’re living in what amounts to a magical war-zone.Chimera Born (The Beginning): by Michele CallahanAron of Itara, Forbidden Son, has been a prisoner of fate since before he was born. Captured as a child by the evil Triscani, it’s been centuries since he’s felt the sun on his face or the tenderness of a woman’s touch. Determined to help humanity break the illusive but powerful Itaran Triads’ hold on Earth, Aron escapes with one goal, to find the one man who can help him save humans from an eternal prison. After that, he’ll fight to the death, but he’ll never go back in the cage.Zoey Williams watched her sister die at the hands of monsters, and no one believed her. She’s spent the last five years using her journalism skills to track aliens, investigate paranormal activity, and hunt for answers. But she got too close to the truth, and now it’s not just monsters hunting her, but her own people. Zoey doesn’t believe she needs a guardian, but once Aron finds her he can’t leave her to the vicious hunters that would turn her to ash or to the power-hungry humans who seek to silence her. In fact, he discovers that he doesn’t want to leave her at all…",
  "genres": [
    "Anthologies",
    "Paranormal",
    "Science Fiction",
    "Shapeshifters",
    "Romance",
    "Paranormal Romance",
    "Science Fiction Romance"
  ],
  "author": "S.E. Smith",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/22468330-alphas-unleashed"
}