{
  "title": "The Eleventh Ring",
  "description": "Librarian Note: This is an Alternate Cover Edition for ASIN B00KYC5TF0.\"An epic that hits all the perfect notes of science, magic, and sweetness.\" –Kirkus Review\"...the metaphysical adventures of Bartholomew Rabbit...\"\"...A fine work of Visionary Fiction...\"\"...The Alchemist meets The Hobbit, but with rabbits...\"The Bartholomew the Adventurer Trilogy is a romping tale of adventure set in the far distant future after humans have vanished from the planet. The protagonist is a self centered rabbit named Bartholomew who sets out in search of a missing object which he is unable to describe or name. Along the way he meets his adventuring companion, Oliver T. Rabbit, a brilliant scientist who also undergoes a deep transformation in the trilogy, coming to understand that there is no magic, only science, whether it’s time travel, parallel dimensions, manifesting physical objects with thoughts, or reincarnation. Their adventures take them to lost cities, parallel universes and other planets, along the way meeting a host of memorable characters including ancient robotic rabbits, the Tree of Eyes, the Singing Monks of Nirriim, the Blue Spectre, and Edmund the Explorer.The Eleventh RingSent to the Cavern of Silence by his servant Parfello, Bartholomew Rabbit begins a quest to find the mysterious Great Gem. He is aided along the way by the Tree of Eyes, the nefarious Skeezle Brothers, and his new best friend Oliver T. Rabbit, a renowned scientist working for the Excelsior Electro-Vacuumator Corporation. As Bartholomew’s self-awareness and magical shaping skills grow, his quest transforms to a search for his dearest childhood friend, Clara Rabbit. To save Clara from certain death, he must defeat the evil and powerful Zoran the Emerald Shaper, wearer of the dreaded Tenth Ring.From The Eleventh Ring:“Blindly reaching out for his bottle of Madame Beffy’s Headache Tonic, he knocked over a vase filled with glass marbles. They fell to the floor with a great clatter. As he watched them bouncing and skittering across the stone tiles, he had an unexpected thought. The wild, chaotic path of the marbles was not really chaotic at all. Each marble was precisely following the known laws of physical motion. He was not witnessing chaos, but order and perfection. Each marble was exactly where it should be at every moment in time.”",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Science Fiction"
  ],
  "author": "Tom   Hoffman",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/22469531-the-eleventh-ring"
}