{
  "title": "The English Wife",
  "description": "12 hours, 19 minutes A completely gripping and inspirational World War 2 historical novel1940, Clementine Churchill is standing alone on a rooftop in London as bombs rain down on the city when a nearby explosion almost knocks her off her feet. Shaking, she rushes homewards to 10 Downing Street and breathes a sigh of relief when she sees the famous building is still there. It means the Prime Minister–her husband–is still alive.Stepping into Winston’s reassuring arms, she hears his steady heartbeat. She knew from the day they married thirty years ago that he wanted to lead the country. Since then, they’ve been a partnership in love and in politics. Tragedy once almost tore them apart… but now, Winston is Prime Minister, just as he always dreamed. Except, with the war against Hitler, it’s a much bigger responsibility than either of them ever The world needs Winston, and Winston needs her.While Winston co-ordinates battles across Europe, Clementine finds herself in the spotlight for the first time. Her husband’s name may be on the lips of every soldier and politician but she knows as she visits hospitals and campaigns for better conditions in air raid shelters, that the ordinary people speak her name just as much. She realises she has the potential to make a difference–not as Winston’s shadow in the background but as Clementine Churchill.One evening, as she looks into Winston’s dear face, Clementine can tell his bravery comes at a cost. But can she overcome the heartbreaking loss in her past to help the man she loves succeed? And, together, can they finish the fight for freedom?This is a fictional novel inspired by the remarkable life of Clementine Churchill. It is a story of the power of love and courage. It is the story of how a husband and wife saved the world. It is a story like no other…",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II"
  ],
  "author": "Anna Stuart",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/224808409-the-english-wife"
}