{
  "title": "Final Flight From Sanaa",
  "description": "When Tariq Hakim introduced himself to Colin Lawler one night in a quiet pub in Ottawa, Canada, he had no idea that this simple gesture would eventually lead him to imprisonment in his homeland of Yemen. Lawler, a lawyer, has a Libyan client who owns an inspection firm in Ottawa, which has been contracted to inspect much needed medical equipment destined for Sanaa, the capital of Yemen, and purchased from Poland. The Libyan's sister is married to a cabinet minister in Yemen, the two having met while studying at Cairo University.Hakim, a western trained doctor, who had immigrated to Canada, speaks the language and knows the culture in Yemen, and therefore seems a perfect match to facilitate the transaction. Reluctantly, he accepts the challenge, rationalizing that he would only be away for a couple of weeks.However, as he is about to return to Canada, he is asked by an old classmate for a favor. He has to examine the classmate's daughter, who developed frequent convulsions which defied diagnosis by many local physicians. His investigations leads him to the conclusion that she was raped by an officer in the security apparatus, who happens to be the nephew of the minister responsible for national security.Hakim finds himself faced with the dilemma of reconciling his responsibilities to his female patient, while respecting the culture and traditions of his own people, as well as the wrath of the national security apparatus, and its minister, a full general and close confidant of the president, General Yamani.He refuses to change his medical testimony, and so endures severe torture at the hands of one of his old medical students, who became the chief jailor and torturer after failing his medical exams.Hakim has no living family members in Yemen any more. However, on the way to Yemen, he has to first inspect x-ray equipment in Gdansk, Poland, where he has one night of passion with a visiting Danish woman, the head of Amnesty International in Denmark, visiting Gdansk with her husband who is busy at a meeting of professional engineers.Through her contacts with Amnesty in England, she hears about Hakim's plight. Beautiful Gita flies to Sanaa to attempt a rescue, in the midst of huge conflict, as the Minister of National Security stages a coup d'etat against President Yamani. (387)",
  "genres": [],
  "author": "Qais Ghanem",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22473860-final-flight-from-sanaa"
}