{
  "title": "The Dreams You Made in the Dirt",
  "description": "Dear Author,MC1 (maybe eighteen to twenty years?) grew up hard in a dysfunctional family in a small remote community. His mother is gone and no one will say what happened to her. His father has always been abusive physically and emotionally. No one has ever stood up for him. He is smaller than average, making him a target for torment, but has had to learn how to fight for himself. He has the soul of a healer— naturally gentle and empathetic— but has learned not to trust as any time he has given himself emotionally he has been smacked down. Despite the way he is treated, he has never been allowed to leave and has nowhere to go as he has no education, money or friends/family to fall back on. When his father finds out MC1 is gay (not that he has had a chance to act on it), MC1 is bashed and left for dead miles from home.MC2 (maybe twenty-eight to thirty-two years?) is a loner who has his own demons in his past (maybe ex-military/ex-con?). He is a natural alpha— protective and dominant. He finds MC1 and cares for him as he heals. Contrary to his promise to himself to stay detached, he feels a pull to MC1 and hates the sadness and despair in the eyes of his charge. He fights himself and MC1 as he finds he badly wants to earn MC1’s trust. Who knows what can happen after that?They are both capable of so much if they can find the right balance. I see the opportunity to have some emotional, hot scenes as they each give in to their natural instincts.I’d love a HEA for these two battered souls.Photo Description: Two men embrace against a dark background. They stand, heavily shadowed, one in front of the other, chest to back, with arms entwined. They are tender, but at the same time appear desperate and vulnerable.This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Abuse",
    "Romance",
    "Military Fiction",
    "Short Stories",
    "LGBT"
  ],
  "author": "Lisa Henry",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/22475764-the-dreams-you-made-in-the-dirt"
}