{
  "title": "The Curious Case of Lady Latimer's Shoes",
  "description": "#1 New York Times bestselling author Stephanie Laurens brings you a tale of mysterious death, feuding families, star-crossed lovers—and shoes to die for.  With her husband, amateur-sleuth the Honorable Barnaby Adair, decidedly eccentric fashionable matron Penelope Adair is attending the premier event opening the haut ton’s Season when a body is discovered in the gardens. A lady has been struck down with a finial from the terrace balustrade. Her family is present, as are the cream of the haut ton—the shocked hosts turn to Barnaby and Penelope for help.  Barnaby calls in Inspector Basil Stokes and they begin their investigation. Penelope assists by learning all she can about the victim’s family, and uncovers a feud between them and the Latimers over the fabulous shoes known as Lady Latimer’s shoes, currently exclusive to the Latimers.  The deeper Penelope delves, the more convinced she becomes that the murder is somehow connected to the shoes. She conscripts Griselda, Stokes’s wife, and Violet Montague, now Penelope’s secretary, and the trio set out to learn all they can about the people involved, and most importantly the shoes, a direction vindicated when unexpected witnesses report seeing a lady fleeing the scene—wearing Lady Latimer’s shoes.  But nothing is as it seems, and the more Penelope and her friends learn about the shoes, conundrums abound, compounded by a Romeo-and-Juliet romance and escalating social pressure…until at last the pieces fall into place, and finally understanding what has occurred, the six intrepid investigators race to prevent an even worse tragedy.  A pre-Victorian mystery with strong elements of romance. A novel of 76,000 words. An entry in The Casebook of Barnaby Adair series, the events in this novel occur between the events described in the Casebook novels, THE MASTERFUL MR. MONTAGUE and the upcoming LOVING ROSE: THE REDEMPTION OF MALCOLM SINCLAIR.  Praise for the works of Stephanie Laurens “Laurens’s writing shines.” Publishers Weekly “Stephanie Laurens never fails to entertain and charm her readers with vibrant plots, snappy dialogue, and unforgettable characters.” Historical Romance Reviews.  Praise for Where the Heart Leads: Volume 1 in the Casebook of Barnaby Adair \"A satisfying blend of mystery and romance.\" Publishers Weekly \"In an Amanda Quick-style suspense/romance, Laurens never loses touch with her characters' deep emotions or the haunting mystery.\" Romantic Times",
  "genres": [
    "Historical Romance",
    "Romance",
    "Mystery",
    "Historical",
    "Historical Mystery",
    "Historical Fiction",
    "Regency Romance"
  ],
  "author": "Stephanie Laurens",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/22478500-the-curious-case-of-lady-latimer-s-shoes"
}