{
  "title": "Me Without You",
  "description": "‘An unforgettable tale that I couldn't recommend more.’ 5/5  GirlsLovetoRead.com If you enjoyed Me Before You by JoJo Moyes, One Day by David Nicholls, or The Notebook by Nicholas Sparks – then make time for Kelly Rimmer’s stunning, heartbreaking new novel Me Without You. A story of how love can break our hearts – and heal them. A year ago I met the love of my life. For two people who didn’t believe in love at first sight, we came pretty close. Lilah MacDonald – beautiful, opinionated, stubborn and all kinds of wonderful in ways that words could never quite capture. The woman who taught me to live again. My Lilah, who gave me so much, and yet kept from me a secret that she knew would break my heart. My name is Callum Roberts, and this is our story. Me Without You is a book to make you smile, bring you to tears and remind you to hold on tightly to those you love. What people are saying about Me Without You… ‘I was hooked right from the start, and it was just the most beautiful portrayal of falling in love I've ever read. It's the type of love you dream of and want for yourself… Kelly Rimmer has done an outstanding job with Me Without You, it's engaging, it warmed my heart to the very core, and then tore it out and stomped all over it. (Quite meanly, may I add?) I knew it was coming, I knew the ending was inevitable before the first page, but the depth of Rimmer's writing and Callum's narrative slated me, and I ended up in tears. It was both sad and beautiful at the same time, and I admire Lilah for living her entire life on her own terms. I will miss Callum and Lilah. They stole into my heart, their story is one I will long remember and Me Without You is an unforgettable tale that I couldn't recommend more.' 5/5 GirlsLovetoRead.com ‘I fell in love with this amazing book after the first sentence and would read it all over again. A wonderful mixture of emotions, real love, secrets, laughter and sadness.’ Sky’s Book Corner ‘Me Without You is the beautiful, moving story of Callum and Lilah and they turned me into a complete emotional wreck. I loved the banter and the chemistry between them both right from the first, brilliant chapter and then as the book went on, it warmed and broke my heart all at the same time… It’s an incredible novel. Reviewed the Book ‘It’s been a while since I’ve read a book that made me ‘ugly cry.’ You know what I mean… big, fat tears rolling down your cheeks leaving you with eyes so puffy you look like you’ve had an allergic reaction. Think Claire Danes in… well… pretty much any role she’s ever been in. Kelly Rimmer’s Me Without You certainly broke that dry spell… Told in alternating points of view from Lilah and Callum, Me Without You is a heartbreaker of a book that has great characters and a gut-wrenching ending that left me feeling a weird mix of bereft and yet hopeful.’ 4/5 JudgingCovers.co.uk ‘There's not much I can say without giving the story away, other than how much I adore Callum and Lilah.",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary",
    "Chick Lit",
    "Contemporary Romance",
    "Adult",
    "Book Club"
  ],
  "author": "Kelly Rimmer",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/22474747-me-without-you"
}