{
  "title": "Red Hot Obsessions",
  "description": "***10 TALES OF ROMANCE FROM 10 BEST SELLING AUTHORS***Over 3000 pages! ON SALE FOR A LIMITED TIMEen top selling authors come together to bring you ten titillating full-length novels of love, passion, discovery, and anticipation designed to tease the senses. Your next obsession starts here.Hot men. Lusty women. Dirty, raw, and arousing. Enough angst to twist your insides. From first kisses, to dangerous encounters and college seductions, we've collected all your favorite stories and combined them into one scintillating read filled with the confident, sexy and mysterious bad boys that will make even the nicest girl's heart throb with desire. His Wicked Games (Ember Casey): Lily would do anything to save her father's failing business - even take on the infamous billionaire Calder Cunningham. But she's not prepared for the wicked terms he has in mind... Fierce (Clarissa Wild): Hot, brooding college bad-boy Hunter turns out to have more secrets up his sleeve than geeky book-worm Autumn can handle. Too bad for her he doesn't give up the fight easily. That First Kiss (J.C. Valentine): Playboy and rising author Tate Larson is focused on his work with no plans of settling down anytime soon... that is, until a chance encounter with Southern beauty Piper Donovan derails all his plans. Slow Burn (V.J. Chambers): A college junior, in hiding from a corrupt shadow wing of an arms corporation, finds herself saddled with a restrained, no-nonsense bodyguard—who also happens to be jaw-droppingly gorgeous. Layers Deep (Lacey Silks): He needs her to save a friend. She needs him to plan her revenge. Their pasts scar them Layers Deep. Their passion distracts them... and distractions can be fatal. French Cooking 101 & Advanced French Kissing (Olivia Rigal): Ariane wanted to spice up the life of her cooking school but one of her American students may be hotter than she expected. Can't Shake You (Molly McLain): Carissa's gotten herself into a mess with an impromptu renovation project, and the only contractor available to help her out happens to be the one man she's never been able to forget. Josh is also her ex-boyfriend's best friend, therefore completely off-limits...unless they don't get caught. His Indecent Lessons (Sky Corgan): When Cheyenne started her first year of college, she didn't expect to fall head over heels for one of her professors. His interest is totally academic though, and he's going to give her private lessons she'll never forget. Sorority Pledge Collection (Daizie Draper): Inexperienced college students, Addison and Logan, recognize the need for power play in one another when they first meet. But as they dive into a BDSM lifestyle while trying to balance college life, they discover their sizzle doesn't come without consequence. Billionaires in Disguise: Rae (Blair Babylon): Rae will do anything to stay in college and for her dream of a clinic for autistic kids, but when the sexy and mysterious owner of The Devilhouse offers her job, she realizes that her small-town definition of \"anything\" was far too limited.",
  "genres": [
    "Anthologies",
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Clarissa Wild",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/22474118-red-hot-obsessions"
}