{
  "title": "Mastered:  10 Tales of Sensual Surrender",
  "description": "Three Secrets\n by New York Times and USA Today bestseller Opal CarewSharing secrets has never been so exhilarating...Nicole and Abel met in Paris and fell in love, but Nicole believes her secret lifestyle will drive Abel away. After the vacation ends, she decides to take a chance and share her secret, but little does she know he has a secret of his own.\nHis Secret\n by International and UK Sunday Times bestseller Portia Da CostaQuiet storm…Ben Chambers is the perfect handsome boyfriend. Sarah adores him, yet despite their delicious lovemaking and the fun they share, she senses he has a secret. But then, during a luxury weekend away, one casual pat to her bottom transforms everything, revealing Ben’s thrilling hidden dominance, and a world of decadent pleasure and deeper love.\nRemastered\n by Multi-Award-Winner Madelynne EllisA bad experience with a former girlfriend caused Spook Mortensen to repress his sexual urges, but when sound engineer Allegra Hutton is called upon to remaster Black Halo's first album, there's only so much attitude and stubborn refusal to listen to the bands' wishes he can take before he's forced to break his self-imposed vow and take her in hand.\nWorking Out\n by USA Today bestseller Marie HarteWhen lust turns to love, who’s really on top? An ex-Marine with a kink for dominance, Mac is Maggie’s boss. But Maggie doesn’t seem to realize he’s in charge…until he shows her that Sir is more than a title. It’s a lifestyle that could suit them both. That’s if Maggie sticks around long enough to wear his collar.The Scientific Method by bestseller Joey W. Hill Mastering her body was easy. Mastering her heart and soul will be an erotic science… In the vampire-servant relationship, the vampire holds all the power. Being Lord Brian’s research assistant as well as his servant, Debra accepts that, but she craves her Master’s heart. When Brian notices his servant’s unhappiness, he uses methods they both understand to prove just what belonging to him fully means. \nJuicy\n by bestseller T.J. MichaelsTwilight Teahouse ~ Choose something decadent from our menu… Solie Shaw is a brilliant self-made woman. After managing a corporation by day, at night, all she wants is to not be in charge. The last man she’d gifted her heart to had smashed it to smithereens and then did the mambo on top of the pieces. Now, along comes the chance to get exactly what she needs. All Solie has to do…is choose.No Limits by USA Today bestseller Kate Pearce All bets are off when there are no limits… Dr. Julia Reed deals with life or death situations at a California ER. When British businessman Alex Logan offers her a sexual bargain, she gets to share her darkest fantasies; he gets the power to carry them out. But who is the real winner in this high stakes game, and is Alex even playing fair?\nInk Reunited\n by USA Today bestseller Carrie Ann RyanOnly two men can give Sassy the happily ever after she craves.Rafe, Ian and Sassy loved each other…until it all blew apart. Now both men are back for the woman they love. It will take more than apologies for these three to overcome their history. But once they take that step, the streets of New Orleans will never be the same.Unfettered:An Overwatch Story by Sasha WhiteYou never forget your first loveMechanic Ronnie Lang is tired of being \"one of the guys\". Chasing the fantasy of finding a dominant male to help her explore her sexuality she applies to Overwatch, a private BDSM club where her eyes are opened to a world that’s more than she ever imagined.Bondage on 34th Street by Emily Ryan-Davis & Jennifer LeelandIn knots over loveAfter years of searching, Tasha Sears finally finds the Master of her heart ...on his knees in front of intimidatingly sexy bondage enthusiast Noah Dreyfuss. As sparks flare between the three, Noah's ropes will either bind them together or pull them apart.",
  "genres": [
    "BDSM",
    "Anthologies",
    "Romance",
    "Erotica",
    "Contemporary",
    "Contemporary Romance",
    "Paranormal"
  ],
  "author": "Opal Carew",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/22473452-mastered"
}