{
  "title": "Charity and Sylvia: A Same-Sex Marriage in Early America",
  "description": "Conventional wisdom holds that same-sex marriage is a purely modern innovation, a concept born of an overtly modern lifestyle that was unheard of in nineteenth century America. But as Rachel Hope Cleves demonstrates in this eye-opening book, same-sex marriage is hardly new. Born in 1777, Charity Bryant was raised in Massachusetts. A brilliant and strong-willed woman with a clear attraction for her own sex, Charity found herself banished from her family home at age twenty. She spent the next decade of her life traveling throughout Massachusetts, working as a teacher, making intimate female friends, and becoming the subject of gossip wherever she lived. At age twenty-nine, still defiantly single, Charity visited friends in Weybridge, Vermont. There she met a pious and studious young woman named Sylvia Drake. The two soon became so inseparable that Charity decided to rent rooms in Weybridge. In 1809, they moved into their own home together, and over the years, came to be recognized, essentially, as a married couple. Revered by their community, Charity and Sylvia operated a tailor shop employing many local women, served as guiding lights within their church, and participated in raising their many nieces and nephews.Charity and Sylvia is the intimate history of their extraordinary forty-four year union. Drawing on an array of original documents including diaries, letters, and poetry, Cleves traces their lives in sharp detail. Providing an illuminating glimpse into a relationship that turns conventional notions of same-sex marriage on their head, and reveals early America to be a place both more diverse and more accommodating than modern society might imagine, Charity and Sylvia is a significant contribution to our limited knowledge of LGBT history in early America.",
  "genres": [
    "History",
    "Nonfiction",
    "LGBT",
    "Queer",
    "Biography",
    "Lesbian",
    "Historical"
  ],
  "author": "Rachel Hope Cleves",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/22472936-charity-and-sylvia"
}