{
  "title": "Transmedia Marketing: From Film and TV to Games and Digital Media",
  "description": "Transmedia Marketing: From Film and TV to Games and Digital Marketing skillfully guides media makers and media marketers through the rapidly changing world of entertainment and media marketing. Its ground-breaking transmedia approach integrates storytelling and marketing content creation across multiple media platforms – harnessing the power of audience to shape and promote your story.Through colorful success stories and insight from top entertainment professionals, Transmedia Marketing covers the fundamentals of a sound 21st century marketing and content plan. You’ll master the strategy behind research, target audiences, goals, and branding and, learn first-hand how to execute your plan’s publicity, events, advertising, trailers, digital and interactive content, and social media.Anne Zeiser enlivens these core concepts with:-Vibrant examples across media platforms – Hunger Games, Prometheus, Despicable Me 2, Food, Inc., Breaking Bad, House of Cards, Downton Abbey, Game of Thrones, Pokémon, Minecraft, Halo 4-Real-world advice from 45 leading entertainment and media makers, marketers, and executives-Powerful in-depth case studies – A.I. Artificial Intelligence, Here Comes Honey Boo Boo, Mad Men, Lizzie Bennet Diaries, and Martin Scorsese Presents the Blues-Expanded Web content, case studies, interviews, and sample materials at www.transmediamarketing.comWith Transmedia Marketing you’ll be well-versed in the art of marketing film, TV, games, and digital media and primed to write and achieve the winning plan for your media project.Some of the world's most accomplished media makers and marketers weigh in on Transmedia Marketing:\"Transmedia Marketing pioneers the powerful idea that successful entertainment projects must blend storytelling and marketing across multiple platforms. Creatives, business execs, and marketers alike will devour this book’s clear guidance and real-world examples of how to shape a project so audiences will love it, participate in it, and share it.\" -- Linda Reisman, film producer, Jeepers Creepers, Affliction, The Danish Girl\"Transmedia Marketing is an in-depth, authoritative, and extremely timely survey of multi-platform marketing in the age of pervasive communications. Anne Zeiser has a unique understanding of the vital role that narrative plays in connecting a mass audience with your content or brand, and her advice for how to close that circuit is some of the best I've seen. There is more than a little bit of secret sauce contained in this book.\" -- Jeff Gomez, CEO, Starlight Runner Entertainment\"Anne Zeiser has earned the industry’s respect by taking a strategic approach to everything she does, and this book is no exception. It takes full advantage of Anne's deep experience and expertise in 21st century transmedia marketing.\" -- Lesli Rotenberg, Senior Vice President, PBS Marketing & Communications",
  "genres": [],
  "author": "Anne Zeiser",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/22478028-transmedia-marketing"
}