{
  "title": "This Idea Must Die: Scientific Theories That Are Blocking Progress",
  "description": "Reporting from the cutting edge of scientific discovery, today's visionary thinkers target the greatest roadblocks to innovation.Few truly new ideas are developed without first abandoning old ones. In the past, discoveries often had to wait for the rise of the next generation to see questions in a new light and let go of old truisms. Today, in a world that is defined by a rapid rate of change, staying on the cutting edge has as much to do with shedding outdated notions as adopting new ones. In this spirit, John Brockman, publisher of the online salon Edge.org (\"the world's smartest website\"—The Guardian), asked 175 of the world's most influential scientists, economists, artists, and philosophers: What scientific idea is ready for retirement?Jared Diamond explores the diverse ways that new ideas emerge * Nassim Nicholas Taleb takes down the standard deviation * Richard Thaler and novelist Ian McEwan reveal the usefulness of \"bad\" ideas * Steven Pinker dismantles the working theory of human behavior * Richard Dawkins renounces essentialism * Sherry Turkle reevaluates our expectations of artificial intelligence * Physicist Andrei Linde suggests that our universe and its laws may not be as unique as we think * Martin Rees explains why scientific understanding is a limitless goal * Alan Guth rethinks the origins of the universe * Sam Harris argues that our definition of science is too narrow * Nobel Prize winner Frank Wilczek disputes the division between mind and matter * Lawrence Krauss challenges the notion that the laws of physics were preordained * plus contributions from Daniel Goleman, Mihaly Csikszentmihalyi, Nicholas Carr, Rebecca Newberger Goldstein, Matt Ridley, Stewart Brand, Sean Carroll, Daniel C. Dennett, Helen Fisher, Douglas Rushkoff, Lee Smolin, Kevin Kelly, Freeman Dyson, and others.",
  "genres": [
    "Science",
    "Nonfiction",
    "Philosophy",
    "Psychology",
    "Essays",
    "Audiobook",
    "Physics"
  ],
  "author": "John Brockman",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/22477307-this-idea-must-die"
}