{
  "title": "Peaceful Mind: Using Mindfulness and Cognitive Behavioral Psychology to Overcome Depression",
  "description": "Recent reports indicate that depression is the most common psychological disorder in the US, affecting as many as 17 million Americans. This book integrates the spiritual practice of mindfulness with psychological techniques for changing negative thoughts and behaviors into a powerful and proven-effective program for coping with this serious and distressing condition.Current statistics suggest that as many as 17 million Americans suffer from depression; further research states that less than 25 percent of these receive adequate treatment for the disorder. In clinical trials, treatment approaches that incorporate spirituality with psychology have proven to be dramatically effective at countering depression. This book is co-written by a leading specialist in the treatment of depression and a clinical nurse who, as a Zen practitioner trained with Charlotte Joko Beck and Jon Kabat-Zinn.A concept grounded in the practice of certain forms of Buddhism, mindfulness is the conscious, uninvolved awareness of the present moment. Western psychologists have recently learned that this state of mind is particularly conducive to the accomplishment of cognitive behavioral therapy, or CBT: an active mode of psychological treatment that attempts to recognize and counter negative thoughts and behaviors before they lead to debilitating symptoms like depression. As statistics confirm again and again that depression is the single most common psychological problem affecting Americans, the refinement of psychotherapy through the integration of spirituality-based techniques has generated considerable interest among psychology professionals. This approachable and easy-to-use book makes these powerful techniques available to the general public.The book is built around a compelling series of specific, step-by-step interventions that provide readers with an understanding of the thoughts that lead to depression. They learn how to find the motivation to confront depressive feelings. By sitting with painful emotions and allowing them to pass, you will find that you can reduce the frequency of depressive episodes. Using meditation practices for observation and awareness, develop the ability to recognize cognitive, physiological, and environmental triggers that can lead to aggravated periods of the disorder. When you change how you approach your day-to-day life, your daily activities, the choices you make, and the way you cope with life's ups and downs you strengthen the skills you need to move beyond depression and develop lasting peace of mind.",
  "genres": [
    "Psychology",
    "Self Help",
    "Nonfiction"
  ],
  "author": "John R. McQuaid",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/224800.Peaceful_Mind"
}