{
  "title": "Chasing the Rising Sun: The Journey of an American Song",
  "description": "Chasing the Rising Sun is the story of an American musical journey told by a prize-winning writer who traced one song in its many incarnations as it was carried across the world by some of the most famous singers of the twentieth century.Most people know the song \"House of the Rising Sun\" as 1960s rock by the British Invasion group the Animals, a ballad about a place in New Orleans -- a whorehouse or a prison or gambling joint that's been the ruin of many poor girls or boys. Bob Dylan did a version and Frijid Pink cut a hard-rocking rendition. But that barely scratches the surface; few songs have traveled a journey as intricate as \"House of the Rising Sun.\"The rise of the song in this country and the launch of its world travels can be traced to Georgia Turner, a poor, sixteen-year-old daughter of a miner living in Middlesboro, Kentucky, in 1937 when the young folk-music collector Alan Lomax, on a trip collecting field recordings, captured her voice singing \"The Rising Sun Blues.\" Lomax deposited the song in the Library of Congress and included it in the 1941 book Our Singing Country. In short order, Woody Guthrie, Pete Seeger, Lead Belly, and Josh White learned the song and each recorded it. From there it began to move to the planet's farthest corners. Today, hundreds of artists have recorded \"House of the Rising Sun,\" and it can be heard in the most diverse of places -- Chinese karaoke bars, Gatorade ads, and as a ring tone on cell phones.Anthony began his search in New Orleans, where he met Eric Burdon of the Animals. He traveled to the Appalachians -- to eastern Kentucky, eastern Tennessee, and western North Carolina -- to scour the mountains for the song's beginnings. He found Homer Callahan, who learned it in the mountains during a corn shucking; he discovered connections to Clarence \"Tom\" Ashley, who traveled as a performer in a 1920s medicine show. He went to Daisy, Kentucky, to visit the family of the late high-lonesome singer Roscoe Holcomb, and finally back to Bourbon Street to see if there really was a House of the Rising Sun. He interviewed scores of singers who performed the song. Through his own journey he discovered how American traditions survived and prospered -- and how a piece of culture moves through the modern world, propelled by technology and globalization and recorded sound.",
  "genres": [
    "Music",
    "History",
    "Nonfiction"
  ],
  "author": "Ted Anthony",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/224858.Chasing_the_Rising_Sun"
}