{
  "title": "Devil's Dream",
  "description": "Lainey dared to dream. A cabin in the mountains. Her man at her side. A sweet little life with the two of them together. Heck, maybe she might even learn to bake.It was a simple dream, one she let herself hope for after Cade Turner and the Devil's Due M.C. rescued her from Flint Springs and her abusive stepfather.But now her dream has become a nightmare.There is courage sleeping inside of Lainey. And now is the time for it to awaken. It's time for her to be a hero. For the shell-shocked captive for whom Lainey is the only hope. For the war between the rival clubs that only she can stop. And for the man she loves who has lost his way...and now may lose his very life.Note to The gripping fourth installment of the Devil's Due Motorcycle Club Saga contains intense scenes of gritty violence and themes of coercion.The complete novel is now available! The Devil's The Novel is now on sale on Amazon! Get the whole saga for one low price!The Devil's Due Motorcycle Devil's DueDevil's DanceDevil's DoorDevil's DreamDevil's DayThe echoing voices were coming from my right. I could hear something that sounded like chanting and the wild, barbaric sound of it shook me to my core. Hunched over in fear, I made my way slowly towards the clubhouse garage, stopping every few feet to check over my shoulder.As I crouched past an open door, I recognized the office with the huge desk where Cade and I had made love. Was that yesterday morning? The day before? Everything had gone so haywire since that moment. I had honestly believed in a happily ever after when he held me in his arms. I remembered feeling like the old me had been burned away. I had felt like I was no longer the scared Lainey who was passively waiting to be rescued.And then with a jolt, I realized that this was exactly what had happened. I wasn't waiting to be rescued anymore. I was the rescuer. I was making my way towards an unknown danger in an attempt to save a helpless victim. If I didn't succeed with my plan, Pauline would never make it. Everything depended on me. I was still terrified, but I was doing it anyway.",
  "genres": [],
  "author": "Vivian Lux",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/22493831-devil-s-dream"
}