{
  "title": "Haggopian and Other Stories",
  "description": "Prior to the first American publication of Brian Lumley's ground-breaking, dead-waking, best-selling Necroscope in 1988 -- the first novel in a long-lived, much-loved series -- this British author had for twenty years been earning himself something of a reputation writing short stories, novellas, and a series of novels set against H. P. Lovecraft's cosmic Cthulhu Mythos backdrop. A soldier in 1967, serving in Berlin with the Royal Military Police, Lumley jump-started his literary career by writing to August Derleth, the then dean of macabre publishers at his home in Sauk City, Wisconsin, telling of his fascination with the Mythos, and purchasing books by the \"Old Gentleman of Providence, RI.\" In addition, he sent a page or two of written work allegedly culled from the various forbidden or \"black books\" of the Mythos. Suitably impressed, the master of Arkham House invited Lumley to write something solid in the Mythos as a possible contribution to a new volume he was currently contemplating, , to be titled—what else but?—Tales of the Cthulhu Mythos. And as might well be imagined, that set everything in motion.Forty years have passed since then and a good many words of Mythos fiction written, including critically acclaimed and award-nominated work, stories that have appeared in prestigious magazines such as Fantasy & Science Fiction, and hardcover volumes from publishers all over the world from the USA to China and the United Kingdom to Russia. But while Lumley's novels are all currently available, many of them in hardcover format, his Mythos short stories and novellas have until now remained uncollected.Subterranean Press is proud to correct that omission in volumes that are guaranteed to be the pride of any collector's library of Mythos fiction other than tales written by H. P. Lovecraft himself. Here in this book are found the shorter stories. Thus the best of Brian Lumley's works in this sub-genre are collected and presented for the first time in this much more worthy and durable format…",
  "genres": [
    "Horror",
    "Short Stories",
    "Cthulhu Mythos",
    "Fiction",
    "Lovecraftian",
    "Audiobook",
    "Fantasy"
  ],
  "author": "Brian Lumley",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/2248359.Haggopian_and_Other_Stories"
}