{
  "title": "The Heroes of Olympus Books 1-4 CD Audiobook Bundle",
  "description": "The Lost HeroThe Heroes of the Olympus: The Lost After saving Olympus from the evil Titan lord, Kronos, Percy and friends have rebuilt Camp Half-Blood. It is here that the next generation of demigods must now prepare for a chilling prophecy of their own:Seven half-bloods shall answer the call,To storm or fire the world must fall.An oath to keep with a final breath,And foes bear arms to the Doors of Death.It's a prophecy that will put them in great danger. To survive, they'll need the help of some familiar demigods.The Son Of NeptuneWill Jason, Piper and Leo be able to discover the identities of the demigods destined to help them complete their quest? Find out the answer to this question and many more. Action, adventure and ancient history abound from the very first page, starting with a harrowing-and hilarious-battle involving Medusa's hideous snake-haired sisters as well as the introduction of a new cast of ancestral spirits and superhuman mortals. Things get even wilder as a new camper who appears to be the son of Neptune show up at Camp Jupiter, Camp Half-Blood's Roman counterpart trained at Camp Jupiter.The Mark Of AthenaAs Annabeth's flying warship, the Argo II, descends through the clouds, the Roman demigods at Camp Jupiter are gearing up for war. After all, the Argo II looks anything but friendly. But Annabeth and her crewmates, Greek demigods Leo, Piper and Jason, come in peace. Their mission? The House of Hades\\The other five demigods have to put aside their grief and follow Percy's instructions to find the mortal side of the Doors of Death. If they can fight their way through the Gaea's forces, and Percy and Annabeth can survive the House of Hades, then the Seven will be able to seal the Doors both sides and prevent the giants from raising Gaea. But, Leo wonders, if the Doors are sealed, how will Percy and Annabeth be able to escape?",
  "genres": [
    "Fantasy",
    "Mythology",
    "Fiction"
  ],
  "author": "Rick Riordan",
  "average_rating": "4.79",
  "url": "https://www.goodreads.com/book/show/22491282-the-heroes-of-olympus-books-1-4-cd-audiobook-bundle"
}