{
  "title": "Voice of a Voyage, Rediscovering the World During a Ten-year Circumnavigation",
  "description": "In 2001, sixty-year old author Doann Houghton-Alico and her husband embarked on a ten-year sailing circumnavigation visiting forty-one countries and sailing over 43,000 nautical miles. As an award-winning author of both technical books and poetry, she brings her love of research into the tangents of the stories she encountered and her lyrical voice to create a picture of the world few of us know. The author, an adept observer and an enthusiastic participant in what life has to offer, writes of her love of the sea at night far away from land, but she also describes such exotic places as remote islands of the South Pacific where black magic and wives bought for three boar tusks are the norm. She evokes the spirit of people and places by revisiting their cultural and natural history and exploring beneath the surface. Her portrayals are riveting, drawing the reader quickly into an intimate chronicle of tragedy and beauty. Doann's poetry and photographs add additional dimensions to her evocative writing. Doann relishes places like the sandy, forbidding, uninterrupted views of the Sudanese desert from the marsas inlets of the Red Sea, where flamingoes and camels abound--but also addresses the more serious issues she witnessed such as survival in areas of exploding populations, decreasing food supplies, climate change, and the impact of war. She describes both in a visceral, yet insightful way. Her inquisitiveness, the allure of exploration, and a strong curiosity about the world inspire her writing. Whether floating in the sea eye-to-eye with a humpback whale, escaping pirates, or drinking tea in a bombed-out Eritrean alley with refugees, Doann takes you there.",
  "genres": [],
  "author": "Doann Houghton-Alico",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/22494156-voice-of-a-voyage-rediscovering-the-world-during-a-ten-year-circumnavig"
}