{
  "title": "The Dunning Man",
  "description": "Named by Buzzfeed Books as one of the \"22 Most Exciting Literary Debuts of 2014,\"  The Dunning Man  features anti-heroes who reject society's rules. Characters from all walks of life--a rogue hip-hop star, a blackjack dealing mom, a middle-aged drunk plowing through his inheritance, and an empty-nester housewife trying to make peace with the past. These are powerful tales of truth seekers imbued with larger-than-life personalities and the all-consuming need to find something worth seeking. \"The stories in The Dunning Man are funny, explosive, and disarmingly moving... [they] pulse with life, and the men and women who figure in them are real people, working people. People like you and me. It's good to read about them again.\"  -ESQUIRE\"This short collection seems like a sampler platter from a writer who may well have a fictional feast in him.\" - Kirkus Reviews\"The mostly Irish American characters in Kevin Fortuna's  The Dunning Man  (Lavender Ink) should know better by now. That they don't (repeating their trespasses again and again) is what makes them so compelling and all too real. These characters may be the architects of their own disasters, but you also get the sense Fortuna is giving them one last roll of the dice.\" - Parade\"It's gritty, vice-filled, and sometimes violent, but also incredibly honest and redemptive.\" -BuzzFeed Books, named as one of the \"22 Most Exciting Literary Debuts of 2014\"Praise for  The Dunning Man :Kevin Fortuna's complex and compelling  characters can't be separated from the equally rich family drama and surprising twists of his narratives, always the sign of a real writer. I'm in awe of this man's imagination and this story collection. A wonderful debut. -- Joseph Boyden , Giller Prize winning author of  The Orenda and  Through Black SpruceThis muscular collection... will linger in your imagination long after the people you meet here have stumbled out into the night. -- Miles Harvey , author of  The Island of Lost MapsThese stories are by turns wry and funny, harrowing and heartbreaking. Kevin Fortuna writes with startling clarity and insight about success, hope and longing and about people struggling to do the right thing, and sometimes failing. He writes with his heart and his head and with a sheer ballsy velocity you don't come across very often.  -- Kevin Moffett , author of  Further Interpretations of Real-Life Events  and  The Silent HistoryThe Dunning Man  is a collection of relentless and often unsettling stories told with intensity and uncommon skill. With clear, exacting prose Kevin Fortuna presents damaged yet indelible characters grappling with shame, pain, and darkness as they teeter on the brink. One gets the sense that these men and women are only hanging on by a thread, and Fortuna triumphs by refusing to let us look away.-- Skip Horack , Stegner fellow and award-winning author of  The Southern Cross  and  The Eden HunterKevin Fortuna's people defy life by living, and suck every last breath out of a deflated balloon. They are exhilarating people with fully lived lives, expertly drawn. Fortuna's people are people you'd want to know, whose lives you may well admire. They may even be you.-- Mark Warren , executive editor of  Esquire",
  "genres": [
    "Short Stories",
    "Fiction"
  ],
  "author": "Kevin Fortuna",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/22499671-the-dunning-man"
}