{
  "title": "Pharaoh",
  "description": "Shortlisted CBC Book of the Year (Older Readers), ACT Book of the Year, and YABBA.The people call Prince Narmer 'the Golden One' Handsome and talented, he is destined to be King of Thinis, the greatest town in Egypt and, for Narmer, the centre of the world.Then a devastating accident forces him to give up his right to the throne and sends him journeying across the ancient Middle East with the mysterious trader, the crippled Nitho and a tamed wildcat called Bast. And as he travels he learns that Thinis is actually a very small place indeed.But can he ever truly forget his homeland? During on last visit to Thinis, he will discover what it really means to be a leader, and will find his destiny being fulfilled beyond his wildest expectations ...Set in a time before the pyramids and based on real historical events, Pharaoh will sweep readers along on a fascinating journey through a part of the world we hear so much about today.PRAISE'French is a master of historical fiction, deftly weaving her knowledge into a story full of fascinating details... Colours, smells, sights and sounds - all combine with real characters to make a wonderful book.' -- Magpies'French leaves readers with the feeling that there are always fascinating little corners left for students of history to explore.' -- Viewpoint'...will have kids turning away from the TV and tuning into the amazing world of the past.' -- The Gold Coast Mail'Jackie French's latest offering is a riveting read on many levels; historically informative, rich in drama and suspense, with well drawn characters. -- The Sunday Age'Jackie's passion for history is palpable throughout this mesmerising story.' -- The Toowoomba Chronicle",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Young Adult",
    "Fiction",
    "Childrens",
    "School",
    "Egypt"
  ],
  "author": "Jackie French",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/11323263-pharaoh"
}