{
  "title": "Khan: A Maine Coon",
  "description": "Abandoned and left at a local shelter, a Maine Coon kitten awaits an uncertain fate. During his stay, Khan befriends a wise old tomcat, who speaks about his experiences of life on the streets, bringing comfort to the frightened kitten. Four days later, to Khan's horror, the shelter workers take his friend away to the Big Sleep, as the tomcat called it, leaving Khan scared and alone. Just before Khan's time is up, a man enters the shelter and adopts Khan, bringing him to a new home. Though he feels loved, he is also alone, and misses his mother, his litter mates, and his tomcat friend. He senses great sadness from his new human momma, understands nothing of it, and thinks it is his fault.Weeks later, when another young kitten joins the household, Khan befriends him, and they form a tight bond. With the steadfast support of his younger playmate, Khan deals with life's challenges and surprises, always finding strength in feline friendships, old and new, and in love from his humans -- until a monster from within suddenly strikes him down in the prime of life.Down, but not out, Khan struggles against his internal foe, wanting only to stay beside the humans and cats he adores. He endures endless visits to the animal doctor, illness, and pain -- winning some battles -- but Khan knows his enemy is winning the war. His inner strength and desire to never leave the ones he loves gives him the courage to fight, astonishing friend and foe alike.In his darkest hour, he manages to stay with his loved ones, in a way he never expects. Even then, his fight is not over, for he has defied the laws of nature. As life-forces struggle to balance what he has upset, he briefly loses contact with his loved ones, but returns, triumphant, and attacks life with gusto, young and strong again, yet not the same cat everyone knew and loved. Learn in these pages why everyone who knew Khan loved him so very much!",
  "genres": [],
  "author": "Marie J.S. Phillips",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/11324545-khan"
}