{
  "title": "De 13 Satanische Bloedlijnen",
  "description": "2 BOEKEN IN EEN BAND: De oorzaak van veel ellende en kwaad op aarde De verborgen macht achter de aanslagen van 11 septemebr 2001   De wereld kende nog nooit zoveel oorlogen, revoluties, vluchtelingen en ontheemden. Daarnaast worden we geteisterd door klimaatveranderingen en toename van natuurrampen waardoor grote voedseltekorten zullen ontstaan. Door de wereldwijde crisis waarin wij ons sinds 2008 bevinden is de werkeloosheid wereldwijd gestegen en in veel landen leiden de mensen steeds vaker honger. Overheden praten over bezuinigingen en onze pensioenen lopen gevaar. De wetteloosheid neemt overal toe en de liefde onder de mensen verkoeld steeds meer. Angst en depressies zijn aan de orde van de dag en veel mensen voelen zich door sociale, geestelijke, lichamelijke en emotionele problemen ontmoedigd en terneergeslagen. Velen vragen zich af: 'Waar gaat deze wereld naar toe? Waarheen leidt onze weg? Hoe zijn we in deze chaos beland? Wat staat ons nog te wachten?\" We worden opgevoed in een traditie om onze regeringen te vertrouwen, en zijn ervan overtuigd dat deze zich om ons lot bekommeren. Dit is echter een grote misvatting. Onder het oppervlak van de officiële politiek speelt zich een ingewikkeld maatschappelijk en intellectueel proces af. De gehele politieke structuur van deze wereld wordt ondermijnd. De wereld wordt door heel andere personen geregeerd, dan degenen die zichtbaar op het wereldtoneel staan. De zichtbare wereldleiders zijn niet meer dan marionetten die vanuit een achtergrond gedirigeerd worden. We worden geregeerd, ons brein wordt gekneed, onze smaak gevormd, onze ideeën gesuggereerd, grotendeels door mensen waarvan we nog nooit hebben gehoord. In praktisch elke handeling in het dagelijkse leven, of dit nou is binnen de politiek of zakensfeer, in onze sociale omgang of ons ethisch denken, worden we gedomineerd door een relatief kleine groep mensen. We leven niet langer in een wereld van naties en ideologieën. Er zijn geen naties. Er zijn geen volkeren. Er zijn geen Russen. Er zijn geen Arabieren. Er is geen derde wereld. Er is geen westen. Er zijn geen Verenigde Staten. Er is geen democratie. Er is uitsluitend DuPont, mM, fIT, AT&:T, Dow, Shell en Exxon. Dat zijn de wereldnaties van tegenwoordig. De macht van deze concerns overschrijdt alle grenzen. De belangrijkste politieke, economische en militaire beslissingen worden ondergraven door globale organisaties die door geen enkele regering of publieke organisatie gecontroleerd of ter verantwoording geroepen worden. Wij hebben te maken met de opkomst van een nieuwe geopolitieke supernationale kracht op het wereldtoneel. Deze geopolitieke kracht bestaat uit de rijkste families op deze planeet. Samen met de machtigste multinationale bedrijven oefenen zij de controle uit over alle landen en alle coalities van landen. Het werkelijke doel van deze elite is complete zeggenschap over Planeet Aarde. Dit boek dient ertoe bij te dragen dat zoveel mogelijk mensen zullen gaan beseffen wat hen in de komende jaren boven het hoofd hangt en waarom. De auteur laat in dit boek niets of niemand onberoerd en toont - aan de hand van talloze feiten - de ontluisterende gang van zaken achter de schermen van de wereldpolitiek.",
  "genres": [
    "History",
    "Conspiracy Theories",
    "Nonfiction",
    "Politics"
  ],
  "author": "Robin de Ruiter",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/11324286-de-13-satanische-bloedlijnen"
}