{
  "title": "Me, Myself, and Us: The Science of Personality and the Art of Well-Being",
  "description": "In the past few decades, personality psychology has made considerable progress in raising new questions about human nature—and providing some provocative answers. New scientific research has transformed old ideas about personality based on the theories of Freud, Jung, and the humanistic psychologies of the nineteen sixties, which gave rise to the simplistic categorizations of the Meyer-Briggs Inventory and the \"enneagream.\" But the general public still knows little about the new science and what it reveals about who we are.In Me, Myself, and Us, Brian Little, Ph.D., one of the psychologists who helped re-shape the field, provides the first in-depth exploration of the new personality science and its provocative findings for general readers. The book explores questions that are rooted in the origins of human consciousness but are as commonplace as yesterday's breakfast conversation. Are our first impressions of other people's personalities usually fallacious? Are creative individuals essentially maladjusted? Are our personality traits, as William James put it, \"set like plaster\" by the age of thirty? Is a belief that we are in control of our lives an unmitigated good? Do our singular personalities comprise one unified self or a confederacy of selves, and if the latter, which of our mini-mes do we offer up in marriage or mergers? Are some individuals genetically hard-wired for happiness? Which is the more viable path toward human flourishing, the pursuit of happiness or the happiness of pursuit?Little provides a resource for answering such questions, and a framework through which readers can explore the personal implications of the new science of personality. Questionnaires and interactive assessments throughout the book facilitate self-exploration, and clarify some of the stranger aspects of our own conduct and that of others. Brian Little helps us see ourselves, and other selves, as somewhat less perplexing and definitely more intriguing.This is not a self-help book, but students at Harvard who took the lecture course on which it is based claim that it changed their lives.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Science",
    "Personal Development",
    "Business",
    "Philosophy"
  ],
  "author": "Brian Little",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/22512853-me-myself-and-us"
}