{
  "title": "Sophia: Princess, Suffragette, Revolutionary",
  "description": "In 1876 Sophia Duleep Singh was born into Indian royalty. Her father, Maharajah Duleep Singh, was heir to the Kingdom of the Sikhs, one of the greatest empires of the Indian subcontinent, a realm that stretched from the lush Kashmir Valley to the craggy foothills of the Khyber Pass and included the mighty cities of Lahore and Peshawar. It was a territory irresistible to the British, who plundered everything, including the fabled Koh-I-Noor diamond. Exiled to England, the dispossessed Maharajah transformed his estate at Elveden in Suffolk into a Moghul palace, its grounds stocked with leopards, monkeys and exotic birds. Sophia, god-daughter of Queen Victoria, was raised a genteel aristocratic Englishwoman: presented at court, afforded grace and favor lodgings at Hampton Court Palace and photographed wearing the latest fashions for the society pages. But when, in secret defiance of the British government, she travelled to India, she returned a revolutionary.  Sophia transcended her heritage to devote herself to battling injustice and inequality, a far cry from the life to which she was born. Her causes were the struggle for Indian Independence, the fate of the lascars, the welfare of Indian soldiers in the First World War – and, above all, the fight for female suffrage. She was bold and fearless, attacking politicians, putting herself in the front line and swapping her silks for a nurse's uniform to tend wounded soldiers evacuated from the battlefields. Meticulously researched and passionately written, this enthralling story of the rise of women and the fall of empire introduces an extraordinary individual and her part in the defining moments of recent British and Indian history.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Feminism",
    "India",
    "Historical",
    "Biography Memoir"
  ],
  "author": "Anita   Anand",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/22514852-sophia"
}