{
  "title": "Hostage: Kidnapped on the High Seas",
  "description": "\"The true story of my captivity in Iran.\"From Hostage:I know it’s all going horribly wrong when I see two gunboats approaching at full speed. They are bristling with men wielding Kalashnikovs.  Before they've even slowed to a stop in a giant wash of salty waters, armed men leap onto our boat. They are shouting and screaming and gesticulating with their weapons. Anything could happen. By design or accident. They are young, they are frightened and they are excited. They are out of control. I can smell their sweat.  Multiple thoughts race through my head: This cannot be happening… they haven't put out fenders and the hulls of our boats are grinding together… they are stomping all over my lovely deck in their heavy boots… I really, really hope they have got their safeties on. There is an air of malevolent unpredictability. This could go wrong very fast.  I glance at Rupert, my husband, and at Brad, our Captain. Rupert looks stunned. Brad looks scared. By mutual accord we all go still and quiet. I try to veil my fear. This is an animalistic situation. Showing terror or panic or provoking them in any way could push one of these volatile young men over the edge. I covered up as soon as I saw the boats approaching but I'm still only wearing a bikini covered with a sarong. These men are in control of our boat. We are at their mercy. We have been boarded, an act of piratical aggression from time immemorial. It rarely ends well. We are two men and one woman far from home. No witnesses save the seagulls diving and wheeling above us, their afternoon slumber disturbed by the roar of the gunboats.  I know what language these men are screaming at me in. It is Farsi. They are from the Islamic Republic of Iran. The Evil Empire, according to popular demonology. We are British. We are their sworn enemies. We are their hostages.",
  "genres": [
    "Memoir"
  ],
  "author": "Linda   Davies",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22517658-hostage"
}