{
  "title": "Tracing the Contours",
  "description": "Megan's patience is exhausted, she's will not tolerate any further abuse. She makes a major decision, it's time to leave her Yorkshire home to establish a new life. It must be on her own terms despite the consequences. As the train journey draws closer to her destination, Megan's mind is swamped by a rapid series of violent images. She has neither recognition of the vague faces, nor any recollection such an incident.Megan's arrival in this small town of Rodley disconcerts some of the local community, for she closely resembles Saskia, who left town 30 years ago. Buried in the depths of Megan’s subconscious are the answers. Her life is enveloped by frustration and fear, too shocking to remember . . . too shocking to forget . . . fatal to ignore. Amidst the perilous encounters there is an unwanted revelation, a struggle for justice.An opportunity for the investigative abilities of Luke Adams and his assistant Imogen Morrison whose working relationship and mutual admiration plays an essential part in the engine that drives this series. Luke and Imogen make considerable efforts to help their clients, often this raises other issues in their personal lives, leading to lively outbursts, and bouts of humour of one kind or another.The focus on the client is an ongoing feature of this series, it accentuates the nature and flexibility of this small team of private investigators. Luke and Imogen are establishing a noteworthy reputation which will endear them to all of their followers, read and enjoy.Part of my Luke Adams private investigator/detective crime series. A British psychological suspense mystery with a taste of romance, packaged with the intensity of a thriller. I'm grateful for the influences of Jodi Picoult, Dean Koontz, Rachel Abbott, C L Taylor and Sophie Hannah, whose styles of writing have given me days of enjoyment",
  "genres": [
    "Thriller",
    "Suspense",
    "Romance",
    "Mystery",
    "Mystery Thriller",
    "Romantic Suspense"
  ],
  "author": "Honor A. Dawson",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/22522007-tracing-the-contours"
}