{
  "title": "Nowhere Man",
  "description": "A provocative new thriller about the limits -- and the extremes -- of patriotism.Tom Fargo thought he had it beat. The anxiety, the guilt, the uncertainty that had gripped him since 9/11, when his estranged father died in the attack on the Pentagon - they'd all vanished. A former antiwar protester, Tom has become the \"new face of American patriotism\" and has risen to the top job in the office of U.S. Senator and likely presidential nominee Penn Mallory. Then a Saudi plane falls out of the sky, killing the administration's all-but-announced choice for Secretary of Defense. Tom is assigned to investigate. And everything changes. In a search for answers that will take him from the halls of power in Congress to terrorist strongholds in Europe and South America to the wealthy Gulf Coast of Florida, Tom will struggle to unravel a mystery whose clues don't add  A blogger who is murdered in a Washington coffee shop. The CEO of a Blackwater-type security firm who is in the final stages of confirmation to head the CIA. A Mossad agent turned mercenary for hire. A fashion-plate senator from California with an agenda of her own. A bungled assassination attempt that mutates into an instrument of revenge against the government's most ambitious players. A sinister dreadlocked man who turns Tom into a pawn in a treacherous global game. As he peels back layer after layer of deceit, Tom will threaten to expose the conspiracy behind a new form of international terror, one in which the thirst for power trumps the needs of the nation. And as the revelations stack up, and Tom Fargo goes from patriot to prey, he is forced to confront the dilemma that has gripped America since the Twin Towers  In a world where true security is an illusion, how far should one man go to protect the interests of his country?",
  "genres": [],
  "author": "Doug  Williams",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/22523126-nowhere-man"
}