{
  "title": "Old Venus: A Collection of Stories",
  "description": "Sixteen all-new stories by science fiction’s top talents, collected by bestselling author George R. R. Martin and multiple-award-winning editor Gardner Dozois From pulp adventures such as Edgar Rice Burroughs’s Carson of Venus to classic short stories such as Ray Bradbury’s “The Long Rain” to visionary novels such as C. S. Lewis’s Perelandra, the planet Venus has loomed almost as large in the imaginations of science fiction writers as Earth’s next-nearest neighbor, Mars. But while the Red Planet conjured up in Golden Age science fiction stories was a place of vast deserts and ruined cities, bright blue Venus was its polar a steamy, swampy jungle world with strange creatures lurking amidst the dripping vegetation. Alas, just as the last century’s space probes exploded our dreams of Mars, so, too, did they shatter our romantic visions of Venus, revealing, instead of a lush paradise, a hellish world inimical to all life. But don’t despair! This new anthology of sixteen original stories by some of science fiction’s best writers—edited by #1 New York Times bestselling author George R. R. Martin and award-winning editor Gardner Dozois—turns back the clock to that more innocent time, before the hard-won knowledge of science vanquished the infinite possibilities of the imagination. Join our cast of award-winning contributors—including Elizabeth Bear, David Brin, Joe Haldeman, Gwyneth Jones, Mike Resnick, Eleanor Arnason, Allen M. Steele, and more—as we travel back in time to a planet that never was but should have a young, rain-drenched world of fabulous monsters and seductive mysteries. FEATURING ALL-NEW STORIES BY Eleanor Arnason • Elizabeth Bear • David Brin • Tobias S. Buckell • Michael Cassutt • Joe Haldeman • Matthew Hughes • Gwyneth Jones • Joe R. Lansdale • Stephen Leigh • Paul McAuley • Ian McDonald • Garth Nix • Mike Resnick • Allen M. Steele • Lavie Tidhar And an Introduction by Gardner Dozois",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Audiobook",
    "Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "George R.R. Martin",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/22522799-old-venus"
}