{
  "title": "Team of Teams: New Rules of Engagement for a Complex World",
  "description": "The retired four-star general and and bestselling author of My Share of the Task shares a powerful new leadership model As commander of Joint Special Operations Command (JSOC), General Stanley McChrystal played a crucial role in the War on Terror. But when he took the helm in 2004, America was losing that war badly: despite vastly inferior resources and technology, Al Qaeda was outmaneuvering America’s most elite warriors. McChrystal came to realize that today’s faster, more interdependent world had overwhelmed the conventional, top-down hierarchy of the US military. Al Qaeda had seen the future: a decentralized network that could move quickly and strike ruthlessly. To defeat such an enemy, JSOC would have to discard a century of management wisdom, and pivot from a pursuit of mechanical efficiency to organic adaptability. Under McChrystal’s leadership, JSOC remade itself, in the midst of a grueling war, into something entirely new: a network that combined robust centralized communication with decentralized managerial authority. As a result, they beat back Al Qaeda. In this book, McChrystal shows not only how the military made that transition, but also how similar shifts are possible in all organizations, from large companies to startups to charities to governments. In a turbulent world, the best organizations think and act like a team of teams, embracing small groups that combine the freedom to experiment with a relentless drive to share what they’ve learned. Drawing on a wealth of evidence from his military career, the private sector, and sources as diverse as hospital emergency rooms and NASA’s space program, McChrystal frames the existential challenge facing today’s organizations, and presents a compelling, effective solution.",
  "genres": [
    "Business",
    "Leadership",
    "Nonfiction",
    "Management",
    "Military Fiction",
    "Audiobook",
    "Self Help"
  ],
  "author": "Stanley McChrystal",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/22529127-team-of-teams"
}