{
  "title": "The Portland Vase: The Extraordinary Odyssey of a Mysterious Roman Treasure",
  "description": "Created for an emperor, exhumed from a burial ground, coveted, traded, smashed, restored, and stuffed full of incident and intrigue, the Portland Vase -- the most famous of all Roman antiquities -- has captivated everyone who has come into contact with it. Robin Brooks's The Portland Vase is a great romp through history with this fragile, enigmatic vessel, which has touched the lives of an array of compelling characters. Following the vase's journey across Europe over the centuries, we meet the notorious tomb-robber-cum-budding-archaeologist Fabrizio Lazzaro, who \"discovered\" the vase; Pope Urban VIII, who hoped to enhance his image by acquiring it; the Princess of Palestrina, who supported her nasty gambling habit by auctioning it off; the Duchess of Portland, who kept her ownership of the vase a secret; the ceramics genius Josiah Wedgwood, who devoted nearly a lifetime to trying to create a satisfactory reproduction; the Irishman who shattered it and the restorers who have since repaired it; and a host of other politicians, dilettantes, and scam artists. Their stories -- how they came by the vase, how they disposed of it, and how it affected them -- result in a narrative rich with passion, inspiration, and jealousy that spans more than two thousand years. Made before the birth of Christ, when glassblowing was still a new art, the Portland Vase remains unparalleled in its craftsmanship. Surprisingly, despite the extraordinary technological advances of the past two thousand years, how, exactly, the vase was made remainsa mystery. But this is only one of the riddles that still surrounds the vase. Today art historians still can't agreeon the identity of the figures depicted on it, or what story these figures are meant to tell. Furthermore, who made the vase? What was it used for? The Portland Vase remains one of the art world's greatest enigmas. A continuing inspiration for artists, poets, historians, and art collectors, the vase now sits quietly in a little glass case in the British Museum -- seemingly inviolate, perfect, eternal.",
  "genres": [
    "Nonfiction",
    "History",
    "Art",
    "Art History",
    "Historical"
  ],
  "author": "Robin Brooks",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/2252640.The_Portland_Vase"
}