{
  "title": "On Herring Cove Road: Mr. Jew and the Goy Boy",
  "description": "\"...an easy read with characters I fell in love with. It's a wonderful story, at times laugh-out-loud funny and others sad.\" -Julie S., NYAn introverted old Jew, his doting but ill wife, and his unlikely friendship with the lonely child of his racist neighbor.Once an amusing extrovert with a reputation as a prankster, Mr. Rosen is entering his senior years as a stoic, thirty-year converted introvert who hates change, has little to no interest in people and is more than content to have his wife sit in the navigator's seat of his life. Since becoming a practicing introvert, there have been almost no changes in his life, and for the few that there were, his wife had walked him through them, including the recent move to a much smaller home in a lower/middle-class neighborhood where he lives directly next door to a racist whose pint-sized son addresses him as Mr. Jew.Mr. Rosen had seen the move coming, and he is very much aware of the enormous change to come sometime in the, hopefully, far-off future; though, he refuses to give it any attention. That change will come on slowly and painfully and will eventually force him to chart his own life's route.Experience an emotional roller coaster as Mr. Rosen's world implodes while on a collision course with that of a young mother, her lonely and naive son, and her vengeful husband.ABOUT THE SERIESTaking place in Halifax, Nova Scotia, the series follows the sometimes amusing and sometimes heartbreaking events following an extremely introverted old Jewish man's retirement as he reluctantly befriends a young and struggling single mother, her naive and lonely son, and then, lastly, a boy streetwise beyond his years.​\"I don't usually enjoy books in a series but this was an exception. It was uplifting, and interesting with some twists I didn't see coming...It wasn't all sweet and goody two shoes either. It had some dark and realistic moments and characters. Very well written.\" (Amazon Customer) Volume 1) On Herring Cove Road: Mr. Rosen and His 43Lb AnxietyVolume 2) Still on Herring Cove Road: Hickory, Dickory, DeathVolume 3) Off Herring Cove Road: The Problem Being BlueVolume 4) Before Herring Cove Road: Ruth Goldman and the Nincompoop",
  "genres": [
    "Fiction",
    "Book Club",
    "Jewish",
    "Canada",
    "Modern"
  ],
  "author": "Michael Kroft",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/22526671-on-herring-cove-road"
}