{
  "title": "Summoned",
  "description": "The Air Force finds themselves under assault in Metrocity as they unearth the crashed remains of the Dyar'thon, the Kurcet starship brought down in a starship battle a week before. Robots, aliens, and supervillains all descend on the area as they try to acquire or steal weapons and resources of value.  Borgz finds himself among the attackers. Ever opportunistic, the bodiless being acquires new and powerful weapons, gains allies, and then must contend with other supervillains as they attempt to wrest control of his ill-gotten gains from him.  All the while, an unknown force of powerful armed and armored figures assault the military, prison, and villains alike to take ... or recover ... aliens remaining in the city.  The heroes must find out who this force is and stop them before they abscond with one of their own, while also dealing with two sets of villains set on accomplishing their own goals.  H.E.R.O. - Summoned is the 18th book in the most extensive superhero novel series of the last decade. It is an action-packed, full-length written novel of over 102,000 words.  Here is the full lineup of novels in the H.E.R.O. saga: H.E.R.O. – Metamorphosis (1) This full book is FREE on most major e-retailers! Search by the author's name, or by the full name of the book. H.E.R.O. - New Markets (2) H.E.R.O. - Rise and Fall (3) H.E.R.O. - Dark Research (4) H.E.R.O. - Horde (5) H.E.R.O. - Paragon (6) H.E.R.O. - Illustrated Guide H.E.R.O. Shorts – Gatecrasher (7) H.E.R.O. Shorts – Silverlash (8) H.E.R.O. - Gene Front (9) H.E.R.O. - Incursion (10) H.E.R.O. - Dolldrum (11) H.E.R.O. - Malice (12) H.E.R.O. - Dark Breach (13) H.E.R.O. - Nightmonger (14) H.E.R.O. - Battlefronts (15) H.E.R.O. – Riftguard (16) H.E.R.O. – Augments (17) H.E.R.O. - Summoned (18) H.E.R.O. - Bio-Organism (19) - coming soon!",
  "genres": [
    "Superheroes"
  ],
  "author": "Kevin Rau",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/22532378-summoned"
}