{
  "title": "A Higher Form of Killing: Six Weeks in World War I That Forever Changed the Nature of Warfare",
  "description": "Between April 22 and May 30, 1915, Western civilization was shocked. World War I was already appalling in its brutality, but it had until then been fought on the battlefield and by rules long agreed by convention. Suddenly those rules were abandoned when Germany forever altered the way war would be fought. On April 22, at Ypres, German canisters spewed poison gas at French and Canadian soldiers in their trenches; on May 7, the German submarine, U-20, without warning, torpedoed the passenger liner Lusitania , killing 1,198 civilians; and on May 31, a German zeppelin began the first aerial bombardment of London and its inhabitants. Each of these actions violated rules of war carefully agreed to at the Hague Conventions of 1898 and 1907 and were deliberately breached by Germany in an attempt to spread terror and force the Allies to surrender. While that failed, the psychological damage caused by these attacks far outweighed the casualties. The era of weapons of mass destruction had dawned.While each of these momentous events has been chronicled in histories of the war, celebrated historian Diana Preston links them for the first time, revealing the dramatic stories and the personalities behind them through the eyes of those who were there--whether making the decisions to use the weapons or experiencing their horrifying effect in the trenches, on board the Lusitania or on the streets of London. Placing the attacks in the context of the centuries-old debate over what constitutes \"just war,\" Preston shows how, in their aftermath, the other combatants felt the necessity to develop extreme weapons of their own. In our current time of terror, when weapons of mass destruction are once again implemented and threatened and wartime atrocities abound in a very different kind of conflict, the vivid story of their birth is of great relevance.",
  "genres": [
    "History",
    "World War I",
    "Nonfiction",
    "War",
    "Military Fiction",
    "Military History",
    "Science"
  ],
  "author": "Diana Preston",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/22529379-a-higher-form-of-killing"
}