{
  "title": "The Fierce Urgency of Now: Lyndon Johnson, Congress, and the Battle for the Great Society",
  "description": "A majestic big-picture account of the Great Society and the forces that shaped it, from Lyndon Johnson and members of Congress to the civil rights movement and the mediaBetween November 1963, when he became president, and November 1966, when his party was routed in the midterm elections, Lyndon Johnson spearheaded the most transformative agenda in American political history since the New Deal, one whose ambition and achievement have had no parallel since. In just three years, Johnson drove the passage of the Civil Rights and Voting Rights Acts; the War on Poverty program; Medicare and Medicaid; the National Endowments for the Arts and the Humanities; Public Broadcasting; immigration liberalization; a raft of consumer and environmental protection acts; and major federal investments in public transportation. Collectively, this group of achievements was labeled by Johnson and his team the “Great Society.”In The Fierce Urgency of Now , Julian E. Zelizer takes the full measure of the entire story in all its epic sweep. Before Johnson, Kennedy tried and failed to achieve many of these advances. Our practiced understanding is that this was an unprecedented “liberal hour” in America, a moment, after Kennedy’s death, when the seas parted and Johnson could simply stroll through to victory. As Zelizer shows, this view is In many respects America was even more conservative than it seems now, and Johnson’s legislative program faced bitter resistance. The Fierce Urgency of Now  animates the full spectrum of forces at play during these turbulent years, including religious groups, the media, conservative and liberal political action groups, unions, and civil rights activists.Above all, the great character in the book whose role rivals Johnson’s is Congress—indeed, Zelizer argues that our understanding of the Great Society program is too Johnson-centric. He discusses why Congress was so receptive to passing these ideas in a remarkably short span of time and how the election of 1964 and burgeoning civil rights movement transformed conditions on Capitol Hill. Zelizer brings a deep, intimate knowledge of the institution to bear on his The book is a master class in American political grand strategy.Finally, Zelizer reckons with the legacy of the Great Society. Though our politics have changed, the heart of the Great Society legislation remains intact fifty years later. In fact, he argues, the Great Society shifted the American political center of gravity—and our social landscape—decisively to the left in many crucial respects. In a very real sense, we are living today in the country that Johnson and his Congress made.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "American History",
    "Biography",
    "Us Presidents",
    "Presidents"
  ],
  "author": "Julian E. Zelizer",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/22529143-the-fierce-urgency-of-now"
}