{
  "title": "Shifter Mountain",
  "description": "34,000 words. Curvy, young hillswoman Kay Mandrell finally has gotten up the courage to run off her abusive, sadistic husband with a sawed-off shotgun. But her no-good man is more dangerous than most. Her husband comes from a long line of skinwalkers who can shapeshift into any form they wish, and most humans are powerless against them. Now Kay finds herself living in fear day by day, waiting for her husband to reappear and seek revenge. The last of her kin living on Scopes Mountain in Tennessee, she is vulnerable and alone.Jordan Lawless is a Country and Western superstar recording artist whose own family hails from Scopes Mountain, but his mother took him away from there when he was just a child. When his mother dies, Jordan records a cover of her favorite Bluegrass song “High on a Mountain.” In honor of his mother’s memory, Jordan decides to shoot the music video on Scopes Mountain, curious about where he was born.His manager and producer, however, try to discourage him from taking a film crew into this part of Appalachia. So does his mother’s best friend, who manages the Nashville club where Jordan first got his start as a singer and musician. Scopes Mountain also is nicknamed “Shifter Mountain” because of the legends and rumors of skinwalkers inhabiting the area. These legends have ensured that even the most adventurous hikers and campers never set foot there.When Jordan tracks down the perfect setting for the music video, however, it happens to be on property that Kay Mandrell’s family has owned for generations. When Jordan and the film crew arrive on Shifter Mountain, he immediately falls in love with Kay, but he can tell he must proceed cautiously. Kay believes she is undesirable, and she has learned the hard way that for her the touch of a man usually brings pain and destruction.With Jordan, Kay starts to feel that it is safe to experience passion with a man who adores her instead of abuses her.Standing between the woman he loves and a rival evil in the form of her Ex, Jordan learns of his own family’s skinwalking legacy. He finds himself caught between his supernatural generational past and the hard road he must go down in the future in order to win Kay’s love and trust, as well as to save both their lives.",
  "genres": [],
  "author": "Annora Soule",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/22533372-shifter-mountain"
}