{
  "title": "The Thirteen American Arguments: Enduring Debates That Define and Inspire Our Country",
  "description": "\" The Thirteen American Arguments is a thought-provoking, engaging study of the great American debate, and a highly worthwhile read. \"–RealClearPolitics.com“Insightful and enjoyable . . . . In The Thirteen American Arguments , Howard Fineman lifts readers above the fog of modern politics . . . and offers a unique vantage point from which to see that the debates that shape American politics are timeless and profound.” -- The WashingtonianHoward Fineman is one of our best-known and most trusted political journalists. Mixing vivid scenes and figures from the campaign trail with forays into four hundred years of American history, Fineman shows that every debate, from our nation’s founding to the present day, is rooted in one of thirteen arguments that–thankfully–defy resolution. It is the very process of never-ending argument, Fineman explains, that defines us, inspires us, and keeps us free. At a time when most public disagreement seems shrill and meaningless, Fineman makes a cogent case for nurturing the real American dialogue.Shouting is not arguing, Fineman notes, but often hot-button topics, media “cross-fires,” and blogs reflect the deepest currents in American life. In an enlightening book that cuts through the din and makes sense of the headlines, Fineman captures the essential issues that have always compelled healthy and heated debate–and must continue to do so in order for us to prosper in the twenty-first century. The Thirteen American Arguments run the gamut, from issues of individual identity to our country’s role in the world, • Who is a Person? The Declaration of Independence says “everyone,” but it took a Civil War and the Civil Rights and other movements to make that a reality. Presently, what about human embryos and “unlawful enemy combatants?”• Who is an American? Only a nation of immigrants could argue so much about who should become one. There is currently added urgency when terrorists are at large in the world and twelve million “undocumented” aliens are in the country.• The Role of Faith. No country is more legally secular yet more avowedly prayerful. From Thomas Jefferson to Terri Schiavo, we can never quite decide where God fits in government.• Presidential Power. In a democracy, leadership is all the more difficult — and, paradoxically, all the more essential. From George Washington to George W. Bush, we have always How much power should a president have?• America in the World. Uniquely, we perpetually ask ourselves whether we have a moral obligation to change the world — or, alternatively, whether we must try to change it to survive in it.Whether it’s the environment, international trade, interpreting law, Congress vs. the president, or reformers vs. elites, these are the issues that galvanized the Founding Fathers and should still inspire our leaders, thinkers, and citizens. If we cease to argue about these things, we cease to be. “Argument is strength, not weakness,” says Fineman. “As long as we argue, there is hope, and as long as there is hope, we will argue.”Praise for The Thirteen American Arguments“A spectacular feat, a profound book about America that moves with ease from history to recent events. A talented storyteller, Howard Fineman provides a human face to each of the core political arguments that have alternately separated, strengthened, and sustained us from our founding to the present day.”–Doris Kearns Goodwin, author of Team of Rivals“With a marvelous command of the past and a keen grasp of the present, Howard Fineman expertly details one of the great truths about our that we are a nation built on arguments, and our capacity to summon what Lincoln called ‘the better angels of our nature’ lies in undertaking those debates with civility and mutual respect. Few people understand politics as well as Fineman does, and this work is an indispensable guide not only to the battles of the moment, but to the wars that will go on long after this news cycle is long forgotten.”–Jon Meacham, author of Franklin and Winston“In an impressively thought-provoking original approach, Fineman revisits the great defining arguments that will deepen your understanding of America.”–Newt Gingrich, author of Real From the World That Fails to the World That Works“Howard Fineman proves that few things are as compelling as a well-argued debate. This book offers a thought-provoking way to look at America, its history, and our evolving public discourse.”–Arianna Huffington, author of Right Is Wrong“A perfect antidote to the old horse-race political journalism–a timely (and timeless) reminder of what’s really at stake in the race for the presidency.”–Jeffrey Toobin, author of The Inside the Secret World of the Supreme Court“Howard Fineman guides the reader through the controversies that have haunted this nation since its inception. In the process he creates a fresh context for making sense of the 2008 campaign. Both scholars and students of politics can learn much from this book.”–Kathleen Hall Jamieson, co-author of Finding Facts in a World of Disinformation“A stimulating book that should be read by anyone who cares about the idea and arguments that made this country great, and which are critical to our future direction.”–David Boies, author of Courting Justice\"America is “The Arguing Country, born in, and born to, debate,” claims veteran journalist Fineman in thisbrisk look at 13 debates that have driven (and riven) the nation from its inception, and continue to do sotoday. Arising from fundamental questions like “Who is a person?” or “What can we know and say?” or“What does it mean to pursue a more perfect union?” these 13 debates are perennial, undergirding each ofthe nation’s political controversies, and they are constitutive, defining nothing less than America’s national identity. If American political discourse frequently runs hot, it is because Americans are as passionateabout these fundamental questions as they are different in their answers. Knowing that Fineman is anoccasional guest on MSNBC’s Hardball, it is perhaps tempting to read this book as a particularly eloquentand historically informed apologia for the fiery point-counterpoint duels often seen on cable newschannels. Yet Fineman openly acknowledges that the media sometimes hinders open debate, and it wouldbe more accurate to describe Fineman’s work as itself an argument, urging perspective and optimism amid today’s overheated debates.\"– Booklist",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "American History",
    "School",
    "Read For School",
    "American"
  ],
  "author": "Howard Fineman",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/2253280.The_Thirteen_American_Arguments"
}