{
  "title": "Going into the City: Portrait of a Critic as a Young Man",
  "description": "One of our great essayists and journalists—the Dean of American Rock Critics, Robert Christgau—takes us on a heady tour through his life and times in this vividly atmospheric and visceral memoir that is both a love letter to a New York long past and a tribute to the transformative power of art. Lifelong New Yorker Robert Christgau has been writing about pop culture since he was twelve and getting paid for it since he was twenty-two, covering rock for Esquire in its heyday and personifying the music beat at the Village Voice for over three decades. Christgau listened to Alan Freed howl about rock ‘n’ roll before Elvis, settled east of Manhattan’s Avenue B forty years before it was cool, witnessed Monterey and Woodstock and Chicago ’68, and the first abortion speak-out. He’s caught Coltrane in the East Village, Muddy Waters in Chicago, Otis Redding at the Apollo, the Dead in the Haight, Janis Joplin at the Fillmore, the Rolling Stones at the Garden, the Clash in Leeds, Grandmaster Flash in Times Square, and every punk band you can think of at CBGB. Christgau chronicled many of the key cultural shifts of the last half century and revolutionized the cultural status of the music critic in the process. Going Into the City is a look back at the upbringing that grounded him, the history that transformed him, and the music, books, and films that showed him the way. Like Alfred Kazin’s A Walker in the City, E. B. White’s Here Is New York , Joseph Mitchell’s Up in the Old Hotel , and Patti Smith’s Just Kids , it is a loving portrait of a lost New York. It’s an homage to the city of Christgau’s youth from Queens to the Lower East Side—a city that exists mostly in memory today. And it’s a love story about the Greenwich Village girl who roamed this realm of possibility with him.",
  "genres": [
    "Music",
    "Memoir",
    "Nonfiction",
    "Criticism",
    "New York",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Robert Christgau",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/22535453-going-into-the-city"
}