{
  "title": "The Freshman",
  "description": "Ready to shed her naivete, freshman Giselle Hagen connects with irresistible Evan Sims who introduces her to a world of secrets, sex, and pleasure. Elle is just starting her time in the Ivy League. As a freshman at The College, she finds herself immersed in a surreal world where wealth works to create beauty, magic, and unforgettable experiences. Her life before the Gothic architecture and ivy-covered halls hiding historic secrets, was one of intense focus-no time for the opposite sex-but it's finally her time to live life. Luckily there is no shortage of alluring adventures, romantic encounters, and gorgeous men to show her the way... Follow Elle as her body catches fire, her erotic romance with delicious Evan evolves, and she learns to let go and be free. ABOUT JULIET GAUVIN Juliet is originally from California. She is a true, hopeless, all-in romantic. Her first kiss was with a Frenchman in Paris, her first love was an Eagle Scout, her first crash and burn was with someone from Harvard (Jules studied history at Yale). When she isn't writing she can be found photographing landscapes or binge watching entire series on Netflix. Juliet lives for the real magic in the world-it exists-in the form of an ancient building, a kind smile from a stranger, the inexplicable experiences that come from being in love, an erotic encounter with a gorgeous international stranger... Jules threw her law degree out the window to write. Her stories are full of sex, romance, coming of age transformations, and intrigue. She wrote The Ivy League Secret Sex Society Series while struggling through a different novel. The story of Giselle just came out and may or may not be based on actual people, events, and organizations that she encountered in college. Obligatory Disclaimer: This series is a work of fiction. All characters appearing in this work are fictitious. Any resemblance to actual persons, living or dead, or actual events is entirely coincidental. Names, characters, businesses, organizations, places, events, and incidents are the product of the author's imagination or are used fictitiously.",
  "genres": [],
  "author": "Juliet Gauvin",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/22526390-the-freshman"
}