{
  "title": "Iron Cross",
  "description": "Too many penalties may leave the goal vulnerable without the IRON CROSS.After overcoming a potentially career-ending concussion, Tyler Vanek, Dartmouth Cobras first line forward, couldn't be happier with his life. Until his boyhood hero-worship for Raif Zovko, a newly acquired player, develops into more. His mistress, 'Chicklet' encourages him to explore his feelings, and with her enjoyment of toying with the powerful Dom, Tyler figures it might be fun.Laura Tallent, a dedicated officer with the Halifax PD, and Chicklet's first sub, is tired of Tyler's fun disrupting the structure of her world. Devotion to her mistress kept her silent for two years, but a horrible case and more proof that Tyler is the worst sub in existence has her wondering how much better life would be if he was someone else's problem. Someone like Raif.Raif won't deny the lust he feels for Tyler, but he refuses to play games with a young man who's questioning his sexuality--he won't be an experimental phase for an unruly submissive. But when Laura draws him into a plan to remove Tyler from her poly relationship with Chicklet, his protective instincts take over. He partners with Chicklet to protect Tyler and dig deeper into the reasons behind Laura's scheming. Chicklet clearly loves her boy, she won't let him go. And before long, Raif realizes neither can he.Blindsided by the discord in her household, Chicklet struggles to fulfill her subs' needs as their careers throw challenges at them all. Control is slipping from her hands, but with Raif by her side, she prays her relationships can be saved. Salvaging the future means rebuilding with a new foundation. But the only way to make the base solid is for them all to work together. And with all the secrecy and lies, she has no idea where to start.This is the 6th book in the Dartmouth Cobras Series and they are best read in order.",
  "genres": [
    "BDSM",
    "Menage",
    "Romance",
    "Erotica",
    "Sports",
    "Hockey",
    "M M F"
  ],
  "author": "Bianca Sommerland",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/22535212-iron-cross"
}