{
  "title": "Barracuda Bay: A Detective Emilia Cruz Novel",
  "description": "Political corruption turns Acapulco’s first female police detective into a fugitive on the run . . . in Washington DC.\n\"A thrilling series\" -- National Public Radio\nIn a derelict building for sale, Acapulco police detective Emilia Cruz stumbles on the body of a woman brutally shot to death. Incredibly, the victim was the sister of Acapulco’s ambitious mayor, who is running for re-election against an opponent with deep pockets.Emilia’s investigation is immediately under pressure for a fast result. The victim’s ex-boyfriend has a suspiciously weak alibi but is the crime scene the key to finding the murderer? The building was once used for a secret Mexican government operation targeting a ruthless drug lord.Meanwhile, there’s a conspiracy within the police department to force Emilia out.Before Emilia can save her job or arrest her prime suspect, she’s sent on an errand of mercy to Washington, DC.There she becomes a fugitive hunted by killers masquerading as cops. Alone, desperate and on the run, Emilia turns for help to a man she once vowed to murder.He's her only chance to survive a deadly game of political intrigue on the wrong side of the border.From Acapulco’s beaches to the streets of Washington, DC, the stakes couldn’t be higher in this electrifying, page-turning thriller.\n2019 and 2020 Poison Cup award, Outstanding Series - CrimeMasters of America\n\n\"Emilia is a character who is close to my heart\" - MysterySequels\n\n\"Amato brings her characters to life with her vivid writing style and sets them on the streets of a Mexico steeped in Catholicism and corruption\" - OnlineBookClub.org\nWith unflinching authenticity from the author's own espionage and counterdrug experience in Mexico and Central America, this is a female detective mystery series like no other.The Emilia Cruz series is for fans of international mystery and crime by Ian Rankin, Jo Nesbo, Ann Cleeves, Donna Leon and Liza Marklund, plus the Department Q series by Jussi Adler-Olsen. Fans of Don Winslow's cartel and border thrillers set in Mexico love the plots torn from the headlines of the Detective Emilia Cruz police series set in Acapulco.",
  "genres": [
    "Mystery"
  ],
  "author": "Carmen Amato",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/225402965-barracuda-bay"
}