{
  "title": "Velvet Glove Volume 1",
  "description": "The Velvet Glove. An interplanetary exclusive club with every luxury available to its members, The Glove is also a place to explore the deepest levels of sex and love, a place where every member has a chance to find the one thing they really desire, leaving behind the mundane world and entering a fantastical land where rules are meant to be broken. Featuring four stories from Sean Michael's decadent and lush universe, this volume of Velvet Glove has something for everyone. In Connor's Journey, Connor attends a friend's pre-commitment send-off at the Velvet Glove, and he knows he's out of place, but is determined to enjoy his one night among the rich. Then he meets Desmond, a regular member, who wants to show him everything about being a sub if he'll take a five year contract. It beats his old job, but can he do the things Desmond wants him to? Peace Within The Quiet features Gloucester, a sub who's not getting any younger, and he's never found anyone to call his own. Then he meets Katashi, a quiet, serious Top, who's drawn to Gloucester, inviting him to a session. The two of them find they have more in common than they thought, and begin a journey of a thousand miles with a single step. In Love and the Farmer, Love is the best, and brattiest, sub at the club. Punishments are fun for Love, as long as he's the center of attention. Then Freddie comes along. Freddie agrees to take Love on, and Love's furious at being taken in hand by this country bumpkin, but he learns soon enough that Freddie is far from a bumbling farmer. Finally, in Soaring with Hawk, factory worker Jester lets supervisor Hawk convince him to visit the Velvet Glove. Hawk treats Jester with kindness, and soon enough, Hawkwants Jester to move in. Jester's family are less than thrilled, but when he thinks he has nowhere else to go, he finds out that he'll always have a place with Hawk. Hot, lush, and full of love and adventure, the Velvet Glove will take you places you've never dreamed of, and you'll want to visit again and again",
  "genres": [
    "BDSM",
    "M M Romance",
    "Romance",
    "Erotica",
    "Science Fiction",
    "Fantasy",
    "Futuristic"
  ],
  "author": "Sean Michael",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/2254256.Velvet_Glove_Volume_1"
}