{
  "title": "The Dhammapada for Awakening: A Commentary on Buddha's Practical Wisdom",
  "description": "Bringing a refreshing and timely perspective to ancient wisdom and showing seekers of inner peace how they can effectively lead a spiritual life in the modern world, The Dhammapada for Awakening: A Commentary on the Buddha's Practical Wisdom by Abbot George Burke (Swami Nirmalananda Giri) is the first of a series of new books from Light of the Spirit Monastery in Cedar Crest, New Mexico.The Dhammapada for Awakening explores the Buddha's answers to the urgent questions, such as \"How can I find find lasting peace, happiness and fulfillment that seems so elusive?\" and \"What can I do to avoid many of the miseries big and small that afflict all of us?\". Drawing on the proven wisdom of different ancient traditions, and the contemporary masters of spiritual life, as well as his own studies and first-hand knowledge of the mystical traditions of East and West, to Abbot George illumines the practical wisdom of Buddha in the Dhammapada - and more importantly, and make thatmakes that teaching relevant to present day spiritual seekers. The Dhammapada is the first collection of Gautama Buddha's practical teachings for those seeking Nirvana, compiled only three months after his passing away by his enlightened disciples, who named it Dhammapada: The Way of Dharma. It is a distillation of forty-five years of the Buddha's teaching. Abbot George says of the Dhammapada, \"Over and over in the teachings of Buddha we find that he is giving us only that which can be applied in our daily lives in order to fit ourselves for freedom from all that binds us.\"In The Dhammapada for Awakening the reader will learn:•\tAn esoteric understanding of the mind and how to deal with it.•\tHow we create our destinies by our thoughts and actions, and how we can use that knowledge to shape a better present and future for ourselves.•\tWhat are the obstacles to reaching our full potential, and how we can avoid them.Whether a person is Buddhist, Christian, Hindu, simply spiritual, or merely discontent with the status quo of their lives, the universal spiritual principles in The Dhammapada for Awakening will prove helpful in empowering seekers to tread the path to Freedom, that they may become finders.",
  "genres": [],
  "author": "George Burke",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/22541038-the-dhammapada-for-awakening"
}