{
  "title": "Southtown",
  "description": "From the #1 New York Times bestselling author of the Percy Jackson and the Olympians series For Tres Navarre, English professor turned private investigator, business has lately taken a drastic turn south. But if chasing down bail jumpers, adulterous spouses, and workmen’s comp cases seemed like the dregs of the PI game, it was at least a living. Not as much could be said for tracking down a man like Will “the Ghost” Stirman.The stone-cold killer has just staged a bloody escape from the Floresville State Penitentiary with a gang of violent cons as spooked by Stirman as those on the outside who helped put him behind bars. And no one seems more worried than Navarre’s boss and mentor, Erainya Manos. It was her husband along with rival PI Sam Barrera who built the case that sent Stirman away. But Erainya’s husband is dead and she’s certain Stirman won’t let that stand in the way of his taking revenge against her and her adopted son.All of Navarre’s instincts are screaming that there’s more to this case than meets the eye. But Erainya won’t tell him—and Sam Barrera seems to be escaping into a strange twilight from a truth too terrible to remember. That leaves Tres to dig into a twisted mystery of greed, vigilantism, and murder, where lives are bought and sold and the line between guilt and innocence is razor-thin. Meanwhile, Stirman and his gang are coming, leaving behind them a trail of brutal, unforgiving violence that will end in an area of San Antonio known as Southtown—but that may soon just as well be called hell on earth.Don’t miss any of these hotter-than-Texas-chili Tres Navarre BIG RED TEQUILA • THE WIDOWER’S TWO-STEP • THE LAST KING OF TEXAS • THE DEVIL WENT DOWN TO AUSTIN • SOUTHTOWN • MISSION ROAD • REBEL ISLAND",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Fantasy",
    "Audiobook",
    "American",
    "Detective"
  ],
  "author": "Rick Riordan",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/113260.Southtown"
}