{
  "title": "The Fog Machine",
  "description": "This exploration of prejudice and what enables and disables change is set against the backdrop of the Civil Rights Movement from 1954 to 1964 and told from three very different perspectives. To Joan Barnes, 12 years old in the summer of 1964, freedom is her birthright. As for Mississippi's Negroes, freedom was settled by the Civil War, wasn't it? Negroes are no longer slaves. As the child of upper middle-class Yankee Catholics living in predominantly Baptist Mississippi, where family roots are as deep as those of the towering loblolly pines, Joan simply wants to belong. This need repeatedly puts her at odds with what she knows to be right. And it will take her years to understand that freedom means making choices. To C. J. Evans, born to a life of cleaning white folks’ houses, freedom is the size of a human heart, never bigger or smaller. It comes from within and can’t be given or taken away. And, as her waiting-on-heaven Baptist preacher and white-controlled schools have taught her, freedom takes a back seat to staying safe—whether she’s working as a maid to Joan's family in Jim Crow Mississippi or as a live-in domestic in Chicago, where the rules are far more subtle. To Zach Bernstein, Jewish University of Chicago law student, freedom is an ever-expanding circle, like a balloon that can be blown up bigger and bigger without bursting. It’s in the songs the summer volunteers sing to ward off the fear that they, too, will end up like James Chaney, Mickey Schwerner, and Andrew Goodman, missing since June 21 and presumed dead. It’s in Zach’s faith and commitment to tzedakah—justice and righteousness. It’s why he has come to Mississippi in the summer of 1964 to teach at the Meridian Freedom School. As their lives collide, they each question what freedom means and the price they’ll pay to have it.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Susan Follett",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/22542602-the-fog-machine"
}