{
  "title": "Just Toss the Ashes",
  "description": "Sylvia Meyer, a successful lawyer, has committed suicide. This drives her son Lucas to trace back the paths that may provide him with clues to find answers beyond her factual decision to die. He suddenly realizes that he did not actually know neither who his mother was or how she had lived. A counterpoint of past and present voices whispering into his ears outline a tormented image in which the blending of background and figure enables us to recognize masks that we all perhaps wear but dare not name. ++++ Marta Merajver Kurlat's exquisitely written tale of a young man's journey towards understanding his mother's painful life and suicide is a hard novel to put down. The book's narrative is vivid, and thought-provoking psychological dimensions contribute to a literary piece that will engage serious readers. -Virginia Shiller, Ph.D., Clinical Psychologist, New Haven, Connecticut \"What's the point of living if you're nothing?... This novel does not attempt to provide specific answers to this question. This novel, in fact, acts as a trigger. On second thoughts, this is an understatement. The novel is a machine gun targeting the purpose of not merely the sense of the protagonist's life, but that of the reader's. Haven't we all pondered about this question at least once during our own lives?\" - Santiago Vergara, Writer \"In the course of Sylvia's bitter fight against life, the birth of a son bears witness to the love of a man for the body that this woman rejects. When she jumps into an abyss from where no return is possible, her absence urges this only son to seek the truth in the world of demons that have tormented his mother's existence.\" - Elena Jabif, Licensed Psychoanalyst ++++++ MARTA MERAJVER KURLAT was born in Buenos Aires, Argentina. An early attraction to the ways in which mankind tells its own history encouraged her to undertake studies in myths, language, psychology, and psychoanalysis. After spending several years in Europe, with brief sojourns in the U.S., she returned to her homeland, where she works as a translator and teaches English and American language and literature.",
  "genres": [],
  "author": "vbixcv",
  "average_rating": "4.89",
  "url": "https://www.goodreads.com/book/show/2253847.Just_Toss_the_Ashes"
}