{
  "title": "Wilderness Rising",
  "description": "From A. L. Shields pseudonym for New York Times best-selling author Stephen L. Carter comes the thrilling sequel to The Church Builder.An age-old struggle between the enemies of God and the champions of faith.A rumored relic that could prove Christ performed miracles or declare him a fraud.A woman on the run from international authorities.Bethany Barclay is fighting to outwit the Wilderness, an ancient and powerful cabal bent on destroying Christianity. Its members murdered her best friend, framed her for acts of terrorism, and captured the brilliant teen hacker she vowed to protect. To ransom the girl, Bethany must find the Pilate Stone a mysterious first-century artifact that might not even exist.But she s not the only one looking for the stone. In an international landscape of double agents, Bethany finds it impossible to tell friend from foe. The Garden, a secret group of powerful intellectuals sworn to save the Church and help Bethany, is collapsing under the rising power of the Wilderness. And an ocean separates her from her only proven ally the lone wolf Ray Fuentes, who has battles of his own to fight.A sparse trail of breadcrumbs takes Bethany across Europe into a labyrinth of academics, art historians, and followers of a reclusive monastic order. As her quest transforms into an ever more complex and dangerous game, unlikely actors in the drama emerge. Some are ruthlessly devoted to preserving a world where faith is possible. Others aim to brutally, and finally, undermine belief.Including her own.The Church Builder is a roller-coaster ride of plot twists and surprises, written with awe-inspiring skill. Terri Blackstock, New York Times best-selling author of Intervention and Truth Stained LiesOutstanding. Riveting and disturbing in equal measure. The Church Builder illuminates the battle between church and those that wish to crush it with gripping force. Highly recommended. Davis Bunn, best-selling author of The Book of HoursDon't miss this provocative tale by a craftsman at the top of his game. Besides being riveted and entertained, you will be challenged by The Church Builder to think in new ways. Jerry B. Jenkins, novelist and biographer. Owner, Christian Writers Guild\"",
  "genres": [
    "Suspense",
    "Christian Fiction"
  ],
  "author": "A.L. Shields",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22536122-wilderness-rising"
}