{
  "title": "The Longest Distance",
  "description": "Part love story, part adventure mystery, part travel guide for the soul, The Longest Distance is a meditation in traveling from our heads to our hearts, and an awakening to what lies within.Shaken by tragedy in the wilds of Africa, Jeremy Braddock sets off in search of the answers to our questions about life, truth, and the all-too-trying-yet-wonderful emotion of love. From continent to continent, the protagonist takes us on a rollercoaster ride and riveting journey that reveals to us the masters, the maniacal beauty of this planet, and the greatest mystery of all--the 'one thing' we came here to know. As with life itself, he is not alone in this adventure, with the many supporting characters providing him with mirrored reflections of love in its varied forms, and a windowed view into his soul. Armed with his wit, his will, and an ample dose of healthy humility, our vigilant warrior attempts to summon within himself the courage we must all find to see the face of Truth, and walk the path of a higher Love.The Longest Distance evokes deeper contemplation à la Eat, Pray, Love with a level of discourse and discovery that will resonate with those who have been touched by the writings of Paulo Coehlo and Neale Donald Walsch. Interwoven within the tapestry of the novel and in between each storied tale is an uplifting dialogue with Jeremy's higher self -- the Friend that points the way. What adds to TLD's universal appeal is the inspirational guest appearances of a myriad of Masters - from poets to statesmen to those of the cloth - along with each chapter's unveiling of a key 'quality' that, when pieced together, helps to reveal the greater picture at hand -- the Love within the love that beckons us home.The Longest Distance is a sleuth of spirit and treasure hunt of the heart that awakens our soul and provides yet another clue for the curious, a jewel for the romanticist in us all.",
  "genres": [],
  "author": "David      Scott",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/22537263-the-longest-distance"
}