{
  "title": "The Devil Is Here in These Hills: West Virginia's Coal Miners and Their Battle for Freedom",
  "description": "From before the dawn of the 20th century until the arrival of the New Deal, one of the most protracted and deadly labor struggles in American history was waged in West Virginia. On one side were powerful corporations whose millions bought armed guards and political influence. On the other side were 50,000 mine workers, the nation’s largest labor union, and the legendary “miners’ angel,” Mother Jones. The fight for unionization and civil rights sparked a political crisis verging on civil war that stretched from the creeks and hollows to the courts and the US Senate. In The Devil is Here in These Hills , celebrated labor historian James Green tells the story of West Virginia and coal like never before.The value of West Virginia’s coalfields had been known for decades, and after rail arrived in the 1870s, industrialists pushed fast into the wilderness, digging mines and building company towns where they wielded nearly complete control over everyday life. The state’s high-quality coal drove American expansion and industrialization, but for tens of thousands of laborers, including boys as young as ten, mining life showed the bitter irony of the state motto, “Mountaineers are Always Free.” Attempts to unionize were met with stiff resistance. Fundamental rights were bent, then broken, and the violence evolved from bloody skirmishes to open armed conflict, as an army of miners marched to an explosive showdown. Extensively researched and told in vibrant detail, The Devil is Here in These Hills is the definitive book on an essential chapter in the history of American freedom.",
  "genres": [
    "History",
    "Nonfiction",
    "Labor",
    "American History",
    "Politics",
    "The United States Of America",
    "Historical"
  ],
  "author": "James R. Green",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/22536840-the-devil-is-here-in-these-hills"
}