{
  "title": "Mr. Manners: Proper Etiquette For The Modern Degenerate",
  "description": "Mr. Proper Etiquette for the Modern Degenerate is a politically incorrect, satirical manual to living right while doing all the wrong things. If you ever wanted to live on the edge but are afraid of the repercussions of societal judgment, just follow Mr. Manners’ advice and learn how to cross the line while still being viewed as a gentleman. You will be an upwardly mobile sinner in minutes! Embrace your manhood and learn how to pursue all of the higher arts via etiquette. Mr. Manners makes a martyr out of himself so that you may learn from his wisdom. Think that as a white man it’s wrong to use the N-word in public? Wrong! Mr. Manners shows you the etiquette for overcoming this common misconception. Got a girl pregnant and fear that you are going to lose your freedom? Let Mr. Manners show you how to finagle your way out of this inconvenient bind whilst still maintaining your gentleman-like demeanor. Want to have a threesome with a buddy and a lower-level hussy but don’t know how to deal with two bananas and one clam? Let Mr. Manners show you how to remain straight in a gay situation. Think you may have an STD? Don’t let traditional medicine dictate your decision making process. Mr. Manners will lead you to homeopathic well being. Ever thought of dating a prostitute but fear occupational hazards? It’s not as bad as you think and Mr. Manners shows you that it may be financially rewarding as well! Mr. Manners will teach you how to survive a night in jail, how to have rough sex without accidentally murdering your online date, how to drink and drive without getting caught and a plethora of other actions that could be macabre, but are merely by-products of being a gentleman. So curl up with this book and a drink and realize you’re not a piece of white trash like the media would have you believe… You are a gentleman!",
  "genres": [],
  "author": "Aaron Berg",
  "average_rating": "3.06",
  "url": "https://www.goodreads.com/book/show/22536756-mr-manners"
}