{
  "title": "Marked by Light",
  "description": "MARKED BY LIGHT is the first book in the Ambasadora science fiction adventure series. This space thriller contains elements of space opera, science fiction romance, cyberpunk, military science fiction, a galactic empire, anthropological science fiction, and dystopian society. If everyone told you love wasn't real, would you still be willing to die for it?Sara Mendoza and Sean Cryer are.In their multi-partner, caste-ruled society, love and jealousy are considered emotional fallacies, nothing more than fleeting moods and sentiments biased by hormones. Relationships and conceptions in this world obsessed with celebrity, beauty, and power are based on DNA and lineages...or should be. But not everyone believes in the ruling traditions of the all-powerful Embassy. A quiet rebellion prowls the dark underground of this shiny world where techno-militants calling themselves fraggers grow in numbers and bravado. The Embassy intends to silence the fragger movement before the heresy of equality spreads throughout the system. Sara Mendoza is part of the Embassy's plan. Captured, tortured, and falsely accused of treason, she is given a chance to win back her freedom. She only needs to charm information from one of the fragger leaders, then kill him. But by the time she figures out the Embassy's intel is flawed and that Sean Cryer is her true mark, she's already in love with him. Sean knows why Sara is on his ship from the start, but as a lonely, anti-social doser, he doesn't value his life, only his ideology within the fragger organization. Against his better judgment, he becomes her protector, each day caring more about a future he was always afraid to hope for.Also read GREENSHIFT (From the World of Ambasadora), the first book in a new Science Fiction Romance series set in the same universe.Coming 2014: STARRIE (From the World of Ambasadora)Coming 2015: Ambasadora BOOK 2: SCARRED BY LIGHT",
  "genres": [
    "Science Fiction",
    "Romance",
    "Dystopia",
    "Space Opera",
    "Fantasy",
    "Science Fiction Romance",
    "Science Fiction Fantasy"
  ],
  "author": "Heidi Ruby Miller",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/11326772-marked-by-light"
}