{
  "title": "It's Up to Charlie Hardin",
  "description": "A rough and ready young teenage boy faces perils and adventures as he comes of age in WWII-era Austin, Texas. Cover by award-winning artist Dan Dos Santos.An adventure-filled coming of age story set in World War II era Austin, Texas.It is the summer of 1942, and young teen Charlie Hardin has been set loose on the streets of Austin, Texas with only one command from his stay out of trouble. Charlie means to do just that. He never wants to disobey, but sometimes in a boy's life situations come up that he cannot ignore and still be true-blue to his own restless soul. And when that time comes . . .It's up to Charlie Hardin.It's up to Charlie Hardin when a secret path over a wall topped with glass shards needs cutting through an ancient oak, even if that means venturing out on the brittle ends of tree limbs where any fall could break an arm, a leg—or a neck.It's up to Charlie Hardin when a dog-shooting neighbor must be taught to keep his hands off Charlie's loyal best friend, even if that means inventing the world's most effective long-range pumpkin slingshot.And it's up to Charlie Hardin to explore a boy-sized storm culvert that leads into darkness simply because that's what a red-blooded boy has to do, even if it leads to the heart of a perilous criminal plot built on Nazi schemes and greed.Charlie understands that, no matter the cost, when danger arrives at his doorstep, to be brave, resolute, clever—and sometimes just a tiny bit nuts—is the only thing that counts, when all is said and done. For the one surefire ingredient every glorious summer adventure always requires is a willing and resolute adventurer. And in Austin, Texas, in the summer of 1942, that adventurer comes in the form of one unstoppable young teenager named Charlie Hardin!About It's Up to Charlie Hardin :\"Theres a bucolic feel to these youthful misadventures, an innocence and naivety . . . Ing infuses Charlie's tale with humor and dry wit. . . . [A] fascinating glimpse of youthful life as it once was.\"— Publishers Weekly\"Ing borrows heavily from his own Austin childhood to create a delightful tale accurately capturing life before society attempted to domesticate boys. . . . [A] captivating book all ages will enjoy.\"— The Daily News of Galveston CountyAbout Dean \"An always entertaining author.\"— Publishers Weekly\"Above all, he is a master storyteller.\"— SF & Fantasy Review\"Nobody makes high-tech adventures come to life better than Dean Ing.\"—David Brin",
  "genres": [
    "Middle Grade",
    "Young Adult",
    "Adventure"
  ],
  "author": "Dean Ing",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/22546490-it-s-up-to-charlie-hardin"
}