{
  "title": "Black Horse",
  "description": "There is no sensation, no experience more delicious and tempting to the sense that the taste of forbidden love. The longing, the desire… the unquenched thirst for his touch. He was the man I was never supposed to love. I was supposed to hate him. I supposed part of me did and that is what made the desire so much more intense. He set a fire under my skin that burned white hot with every smoldering glance. He sets my soul ablaze, the slow burn of passion aching in every inch of my body. Black Horse. The name haunted my dreams… But regardless of family vendettas, old hurts and contemptuous blood shed, the heart wants what it wants… The kingdom of my heart has only known one king, and his name is Colton McClain. His family is known by his father’s nickname: Black Horse. Like one of the four horses flying out of the gates of hell, Tom “Black Horse” McClain ripped my world apart twenty years ago. I was only five when I found my mother and father dead in their beds, with Tom McClain standing over them with a blood stained butcher knife. He would have come for me, too, had my brother not saved me. I was the only one of my family to walk out of that house alive that night. My brothers once considered Colton their best friend. Not anymore. Randy and Tim largely blame Colt for his father’s actions and take it to heart that I love the son of our parent’s killer. Colton is not to blame for their deaths, though… He was a victim, too. Now twenty years after murders, Black Horse is getting out of jail. He’s coming. He has a vendetta against me, because it was my testimony that put me away. Colt wants to hide me until he can take down his old man, but to hell with that. I have no intentions upon running. We cannot hide from this anymore.  Our past does not own us, and we owe it to our hearts to show the world that love can arise from the darkest of places. We just have to survive Black Horse to tell the tale.",
  "genres": [
    "Romance",
    "Suspense",
    "Dark",
    "New Adult",
    "Romantic Suspense",
    "Contemporary Romance",
    "Amazon"
  ],
  "author": "A.C. Williams",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/22544076-black-horse"
}