{
  "title": "Act of God",
  "description": "Jill Ciment’s books have been hailed as “stunning,” “powerful,” and “provocative.” Alice Sebold has called her works “beautifully written.” Now the author of Heroic Measures (Smart and funny and completely surprising . . . I loved every page.”—Ann Patchett; “Brave, generous, nearly perfect.”—Los Angeles Times) has given us a contemporary noir-novel that starts out a comedy-of-errors and turns darker at every hairpin turn.It’s the summer of 2015, Brooklyn. The city is sweltering from another record-breaking heat wave, this one accompanied by biblical rains. Edith, a recently retired legal librarian, and her identical twin sister, Kat, a feckless romantic who’s mistaken her own eccentricity for originality, discover something ominous in their hall closet: it seems to be phosphorescent; it’s a mushroom…and it’s sprouting from their wall.Upstairs, their landlady, Vida Cebu, a Shakespearian actress far more famous for her TV commercials for Ziberax (the first female sexual enhancement pill) than for her stage work, discovers that a petite Russian girl, a runaway au pair, has been secretly living in her guest room closet. When the police arrest the intruder, they find a second mushroom, also glowing, under the intruder’s bedding. Soon the HAZMAT squad arrives and the four women are forced to evacuate the contaminated row house with only the clothes on their backs.As the mold infestation spreads from row house to high-rise, and frightened, bewildered New Yorkers wait out this plague (is it an act of God?) on their city and property, the four women become caught up in a centrifugal nightmare.Part horror story, part screwball comedy, Jill Ciment’s brilliant suspense novel looks at what happens when our lives—so seemingly set and ordered, yet so precariously balanced—break down in the wake of calamity. It is, as well, a novel about love (familial and profound) and how it can appear from the most unlikely circumstances.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Audiobook",
    "Fantasy",
    "Novels",
    "New York",
    "Adult Fiction"
  ],
  "author": "Jill Ciment",
  "average_rating": "3.12",
  "url": "https://www.goodreads.com/book/show/22543706-act-of-god"
}