{
  "title": "Fire and Ice: Soot, Solidarity, and Survival on the Roof of the World: Soot, Solidarity, and Survival on the Roof of the World",
  "description": "High in the Himalayan valley of Zanskar in northwest India sits a village as isolated as the legendary Shangri-La. Long fed by runoff from glaciers and lofty snowfields, Kumik―a settlement of thirty nine mud brick homes―has survived and thrived in one of the world's most challenging settings for a thousand years. But now its people confront an existential chronic, crippling drought, which leaves the village canal dry and threatens to end their ancient culture of farming and animal husbandry.Fire and Ice weaves together the story of Kumik's inspiring response to this calamity with the story of black carbon. Black carbon from inefficient fires - the particulate residue that makes soot dark - is the second largest contributor to global warming after carbon dioxide. It's also a key ingredient of the air pollution that public health experts regard as humanity's greatest environmental health risk soot-laden smoke from household hearth fires and outdoor sources combine to kill over seven million people around the world every year.Jonathan Mingle describes the joys and struggles of daily life in the Zanskar Valley, where villagers are buffeted by powerful environmental and economic forces, while also tracing black carbon's dark fingerprints outward from Kumik and around the world. Mingle investigates its impacts on snow, ice, and water from Mt. Everest to California, and the silent health epidemic it fuels from New York to New Delhi. Combining cultural history, detailed reportage, climate and energy science and dramatic storytelling, Fire and Ice is a profound examination of the global challenges of averting climate chaos and lifting billions out of energy poverty and water scarcity.Can Kumik's people come together to reinvent fire, harness what remains of their life-sustaining ice, and reinvigorate their traditions of solidarity, in time to save themselves? Can the rest of us rise to the same challenge? Fire and Ice connects these questions with the work of enterprising scientists, engineers, entrepreneurs and activists around the world, in a narrative that combines mythology, reason, humor, persistence, and hope in a race against a global clock.",
  "genres": [
    "Environment",
    "Nonfiction",
    "Science",
    "India"
  ],
  "author": "Jonathan Mingle",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22545432-fire-and-ice"
}