{
  "title": "The Donner Party: The Tragic Story of the Wild West's Most Notorious Journey",
  "description": "*Includes pictures*Includes accounts and diary entries made by participants about the journey*Includes a bibliography for further reading*Includes a table of contents\"Like fated trains of other epochs whose privations, sufferings, and self-sacrifices have added renown to colonization movements and served as danger signals to later wayfarers, that party began its journey with song of hope, and within the first milestone of the promised land ended it with a prayer for help. ‘Help for the helpless in the storms of the Sierra Nevada Mountains!’\" – Eliza P. Donner Houghton, The Expedition of the Donner Party and Its Tragic FateThe westward movement of Americans in the 19th century was one of the largest and most consequential migrations in history, and for countless people back east, the West represented opportunities for adventure, independence, and fortune. Even in the 21st century, Americans look back on the era fondly, even romantically, and millions are familiar with the popular game that reignited interest in the Oregon TrailOf course, it’s easy for people with modern transportation to comfortably reminisce about the West, because many pioneers discovered that the traveling was fraught with various kinds of obstacles and danger, including bitter weather, potentially deadly illnesses, and hostile Native Americans, not to mention an unforgiving landscape that famous American explorer Stephen Long deemed “unfit for human habitation.” 19th century Americans were all too happy and eager for the transcontinental railroad to help speed their passage west and render overland paths obsolete.One of the main reasons people yearned for new forms of transportation is because of the most notorious and tragic disasters in the history of westward travel. While people still romanticize the Wild West, many Americans are still all too familiar with the fate of the Donner Party, a group of 87-90 people that met with disaster in the Sierra Nevada mountain range during the winter of 1846-1847. The party knew the journey would take months, but early snowfalls in the mountains left dozens of people trapped in snow drifts that measured several feet, stranding them in a manner that made it virtually impossible for them to go any further for several weeks. Inevitably, as the Donner Party’s supplies began to run low, there was little hope of acquiring new provisions high up in the mountains, and even worse, their location and the technology of the time also made it virtually impossible for relief expeditions to reach them. Due to exposure and lack of food, the health of many in the party began to deteriorate quickly in the tough winter conditions, and the animals brought along with the group died at alarming rates. Most of the men who set out to try to get help died en route, while the families back in camp tried to cope with dozens of deaths suffered by young and old alike. As a few able-bodied people went for help, the people who remained back in their wagons resorted to the most desperate of measures in attempts to either stay alive or keep their children alive. Some members of the Donner Party fought with each other, occasionally fatally, and the journey is perhaps best known today for accounts of cannibalism. One member of the group noted in his diary in February 1847, \"Mrs Murphy said here yesterday that thought she would Commence on Milt. & eat him. I dont that she has done so yet, it is distressing.” All the while, the plight of the Donner Party made news across the nation, even before the surviving members were rescued and brought to safety, and by the time the doomed expedition was over, less than 50 of them made it to California.",
  "genres": [
    "History",
    "Nonfiction",
    "Tragedy"
  ],
  "author": "Charles River Editors",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/22552397-the-donner-party"
}