{
  "title": "Chapel Springs Revival",
  "description": "With a friend like Claire, you'll need a gurney, a mop, and a guardian angel.Everybody in the small town of Chapel Springs, Georgia, knows best friends Claire Bennett and Patsy Kowalski. It's impossible not to, what with Claire's zany antics and Patsy's self-appointed mission to keep her friend out of trouble. And trouble abounds. During an early morning discussion at Dees 'n' Doughs bakery with their ladies group, all Chapel Springs entrepreneurs, attention is drawn to the slackened tourist trade. With their livelihoods threatened, they join forces to address the town's revitalization in hopes of drawing back the tourists. No one could have guessed the real issue needing restoration is their marriages. Claire, a pottery artist, stumbles through life with her foot in her mouth. When she became a Christian, she thought life and her marriage would be included in the new creation part. But her thighs are just as big and her husband, Joel, is as ornery as ever. She's become nothing more than a sheet-changer, a towel-folder, a pancake-flipper. Her life is humdrum and she's tired of being taken for granted. Patsy has plans for her empty nest, plans that include a cruise ship. However, her husband, Nathan, continues to work long hours, and he's not talking about slowing down. In fact, he's not talking much at all. She's asleep long before he comes home each night. At first she thought it was just because of tax season, but now she's not so sure. Something other than work seems to keep him late at the office every night. With the lines of communication closed, she'll have to find another way to reach him. With their marriages as much in need of restoration as the town, Claire and Patsy embark on a mission of mishaps and miscommunication, determined to restore warmth to Chapel Springs —and their lives. That is if they can convince their husbands and the town council, led by two curmudgeons who would prefer to see Chapel Springs left in the fifties and closed to traffic.",
  "genres": [
    "Christian Fiction",
    "Fiction",
    "Contemporary",
    "Christian",
    "Womens Fiction",
    "Chick Lit"
  ],
  "author": "Ane Mulligan",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22552017-chapel-springs-revival"
}