{
  "title": "The Geography of Madness: Penis Thieves, Voodoo Death, and the Search for the Meaning of the World's Strangest Syndromes",
  "description": "Jon Ronson meets David Grann in this fascinating, wildly entertaining adventure and travel story about how culture can make us go totally insaneThe Geography of Madness is an investigation of \"culture-bound\" syndromes, which are far stranger than they sound. Why is it, for example, that some men believe, against all reason, that vandals stole their penises, even though they're in good physical shape? In The Geography of Madness, acclaimed magazine writer Frank Bures travels around the world to trace culture-bound syndromes to their sources—and in the process, tells a remarkable story about the strange things all of us believe.Book Club Discussion Questions: For the paperback edition, a list of book club discussion questions is also being issued. If you’d like to add the The Geography of Madness to your group’s reading list, here are several conversation starters:1) One main themes of The Geography of Madness is that stories (about the world, about our lives, about our bodies) are contagious. Can you think of a story, or an experience, that changed what you believed was possible?2) Do you believe the brain and the mind are the same thing? If not, what is the difference? 3) The stories in The Geography of Madness raise the question of free will: How much do you choose the life you live? How much do you learn (or catch) you life choices from those around you? 4) Have you ever found yourself immersed in a situation where you did not know the rules? What was that like?5) In The Geography of Madness, the author argues that our mindset and our expectations have biological consequences. Does that resemble your experience? If so, how?6) Try to imagine living in a world where it was possible to have your genitals stolen, either by magic or by ghosts. How would you protect yourself?7) In The Geography of Madness, the author argues that a strong sense of self—of your story— can help to activate your endogenous (internal) healing systems and vice versa. Do you remember a time when a stressful or difficult period seemed to be followed by a health problem or sickness? 8) In The Geography of Madness, did anyone’s genital actually disappear? If not, what happened? Does it matter?9) Is there a belief that everyone around you holds, but that you don’t share? How did you come to doubt this?10) The Handbook of Depression points to a genetic marker associated with greater vulnerability to depression. Yet this link only holds true in Western cultures. Why would that be?11) Have you ever had a health problem you were afraid to talk about, or that others didn’t believe in?12) In The Geography of Madness, the author argues that cultural syndromes are “real” syndromes, but that their causes might not lie where we think they do. Do you think they are “real” or “imaginary”? 13) Over the last few years, gluten intolerance has been rising. This rise occurs at a time of increasing anxiety about the relationship between food, health and identity. What’s changed: our bodies or our culture?14) After reading The Geography of Madness, how would you describe what culture is?15) How much does a your culture create you? How much do you create your culture?16) Have you ever had a cultural syndrome?",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Travel",
    "Science",
    "History",
    "Geography",
    "Medicine"
  ],
  "author": "Frank Bures",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/22548097-the-geography-of-madness"
}