{
  "title": "What the Owl Saw, Second in the Buenaventura Series",
  "description": "\"What the Owl Saw,\" the second volume in the Buenaventura Series and the sequel to \"The Brujo's Way,\" opens in December 1705 with a terrifying nightmare that fills Don Carlos Buenaventura, a powerful brujo in his sixth life, with dread. Feeling the need to strengthen his brujo powers, always weakened by town life, he rides out into the wild mountain landscapes around Santa Fe in order to practice his sorcerer's technique of transforming himself into hawks and owls. Transformations are exhilarating, but they do not dispel his sense of an impending menace. In addition, as he tells his friend Inez de Recalde, whom he has rescued from a difficult past and to whom he has declared his love, he is impatient to move forward in his quest for wisdom on what he calls the Unknown Way. Into this picture comes a trio of itinerant entertainers, a magician and two women dancers, who offer an ambiguous promise. Can they lead him to deeper realms of consciousness, or are they agents of his enemy, the evil sorcerer Don Malvolio? The magician and his alluring companions introduce Carlos to dances that transport him into ecstatic mind states, but he remains uncertain about what master they serve. Despite the risk of exposing his secret brujo identity and of being disloyal to Inez, Carlos allows himself to be drawn ever farther into their web of dark and dangerous enchantments. Includes Readers Guide. A native Californian, Gerald W. McFarland received his B.A. from the University of California, Berkeley (1960) and his doctorate in U.S. history from Columbia University (1965). He taught at the University of Massachusetts Amherst for forty-four years. During that time he published four books in his field. He received many honors, including a John Simon Guggenheim Fellowship. The Colonial Dames of America cited his book, \"A Scattered People: An American Family Moves West,\" as one of the three best books in American history published in 1985. He and his wife live in rural Western Massachusetts.",
  "genres": [],
  "author": "Gerald W. McFarland",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22548447-what-the-owl-saw-second-in-the-buenaventura-series"
}