{
  "title": "Only You",
  "description": "Dear Author,This is me and my friend Hunt. For years I have loved him, my best friend since age four. For years I have waited around, putting my life on hold hoping that one day he would realize that he loved me too. For years he has sent me mixed signals making believe that he may feel the same way. Too many times I felt that we were so close to something happening between us but for whatever reason he always pulls away. He’s so affectionate and loving with me feeding me enough crumbs that I don’t want to give up, I hold on to hope. Well I can’t do it anymore. The pain of being so close to him but never truly having him? It’s too much. It makes me want to give up. Say something Hunt, because I’m giving up on you.Photo Description: This is a lovely photo that immediately makes you scream “Cute!” There are two gorgeous boys doing a back hug. The blond is wearing what looks like a denim jacket, he has a small earring in his right ear and short hair, combed stylishly to one side. He has a sweet, nostalgic kind of smile (maybe a bit shy too). The brunet looks like the athlete type. He has his arms around the blond’s chest and his head leaned towards him. This one has a mischievous kind of smile, like he’s trying to act innocent even though he knows he’s been caught red-handedThis story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Friends To Lovers",
    "Romance",
    "Contemporary",
    "Short Stories",
    "Gay For You",
    "Music"
  ],
  "author": "Shayla Mist",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/22553793-only-you"
}