{
  "title": "Decorum",
  "description": "For fans of HBO’s The Gilded Age, explore the dazzling world of America’s 19th century elite in this lush, page-turning saga…Kaaren Christopherson's brilliantly observed novel captures the glamour and grit of one of the world's most dazzling cities during one of its most tumultuous eras--as seen through the eyes of a singularly captivating heroine...In 1890s New York, beautiful, wealthy Francesca Lund is an intriguing prospect for worthy suitors and fortune hunters alike. Recently orphaned, she copes by working with the poor in the city's settlement movement. But a young woman of means can't shun society for long, and Francesca's long-standing acquaintance with dashing Edmund Tracey eventually leads to engagement. Yet her sheltered upbringing doesn't blind her to the indiscretions of the well-to-do...Among the fashionable circle that gathers around her there are mistresses, scandals, and gentlemen of ruthless ambition. And there is Connor O'Casey--an entirely new kind of New Yorker. A self-made millionaire of Irish stock, Connor wants more than riches. He wants to create a legacy in the form of a luxury Madison Avenue hotel--and he wants Francesca by his side as he does it. In a quest that will take her from impeccable Manhattan salons to the wild Canadian Rockies, Francesca must choose not only between two vastly different men, but between convention and her own emerging self-reliance.Rules Of DecorumA gentleman should not be presented to a lady without her permission being previously asked and granted. This formality is not necessary between men alone; but, still, you should not present any one, even at his own request, to another, unless you are quite well assured that the acquaintance will be agreeable to the latter. If you wish to avoid the company of any one that has been properly introduced, satisfy your own mind that your reasons are correct; and then let no inducement cause you to shrink from treating him with respect, at the same time shunning his company. No gentleman will thus be able either to blame or mistake you. The mode in which the avowal of love should be made, must of course, depend upon circumstances. It would be impossible to indicate the style in which the matter should be told... Let it, however, be taken as a rule that an interview is best; but let it be remembered that all rules have exceptions...",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Historical",
    "Historical Romance",
    "Novels",
    "The United States Of America"
  ],
  "author": "Kaaren Christopherson",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/22557308-decorum"
}