{
  "title": "Un/Common Ground",
  "description": "Dear Author,Jamal is a university student in the USA from my country: Kazakhstan, which (much to my regret) is an extremely homophobic country, where most gay people get married to someone of the opposite gender and never admit to being gay, not even to themselves. Out gay people practically do not exist there.His dad, who is paying for his education, (and also every other male he knows) says that all gays should just be shot dead.All of his numerous relatives, except his older sister, who is closest to him and supports him, are in his face about finding a girl to marry. (Extended families in Kazakhstan are very close and do not believe there is such a thing as ‘personal boundaries’).How does he get his HEA in these circumstances, when it is impossible in his country and as for where he studies, his student visa does not allow him to work and getting a job as a non-citizen without a working visa as well as a working visa without a job is, to say the least, very difficult?Where and how would he find his true love?Photo Description: A young Asian man is facing the camera, his arm over his head as he pulls his T-shirt off. His chest is bare, showing a fit body, and his expression is neutral. The photo itself is done with various vintage filters, giving the entire scene a dream-like quality.This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Short Stories",
    "LGBT",
    "College",
    "Contemporary Romance"
  ],
  "author": "Arielle Pierce",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/22553796-un-common-ground"
}