{
  "title": "Wasteland of Flint",
  "description": "Acclaimed as one of SF's most exciting new talents, Thomas Harlan took readers by storm with his remarkable Oath of Empire series, a thrilling blend of alternate history, high fantasy, and military adventure. The books in the series, including The Shadow of Ararat, The Gate of Fire, The Storm of Heaven, and The Dark Lord , not only earned Harlan rave reviews but gained him two nominations for Best New Writer of the Year.Now Thomas Harlan draws upon his extensive knowledge of history, politics, strategy and tactics to create a brilliant new science fiction epic set in an alternate future in which the Aztec Empire rules the earth and an interstellar empire.Led by the ambitions of the powerful, world-girdling Empire of the Méxica, the human race has spread out among the stars, only to discover a perilous universe once ruled by vast interstellar civilizations that suddenly vanished, leaving behind their mysterious artifacts.Dr. Gretchen Andersson, a xeno-archeologist and second-class citizen of the empire, has made a career of searching for those First Sun artifacts. She has suddenly been recalled by her employer and sent to discover the fate of a missing survey team. To her consternation, she discovers that her team is to travel on an imperial warship, under a Japanese commander, instead of using a Company vessel. Worse, an Aztec aristocrat, Green Hummingbird--an imperial judge who is also a brujo, or sorcerer—is in command of the rescue mission. Clearly, there is more to this assignment than rescuing a team of company scientists from a dead world. In the company of Green Hummingbird, Gretchen will discover that there is far more to Ephesus III than meets the eye.For the vast, rocky wasteland of the seemingly dead planet hides a secret life, and may hold treasures far too deadly for the empire to ever allow her to discover.At the publisher's request, this title is being sold without Digital Rights Management software (DRM) applied.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Alternate History",
    "Space Opera",
    "Science Fiction Fantasy",
    "Fantasy",
    "Speculative Fiction"
  ],
  "author": "Thomas Harlan",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/22557.Wasteland_of_Flint"
}