{
  "title": "Yesterday, Today, Tomorrow: My Life",
  "description": "In her first memoir, the Academy Award–winning actress Sophia Loren tells her incredible life story from the struggles of her childhood in war-torn Naples to her life as a screen legend, icon of elegance, and devoted mother.In her acting career spanning more than six decades, Sophia Loren became known for her striking beauty and dramatic roles with famed costars Cary Grant, Frank Sinatra, Marlon Brando, Gregory Peck, Jack Lemmon, and Paul Newman. The luminous Italian movie star was the first artist to win an Oscar for a foreign language performance, after which she continued a vibrant and varied career that took her from Hollywood to Paris to Italy—and back to Hollywood. In Yesterday, Today, and Tomorrow , Loren shares vivid memories of work, love, and family with winning candor.Born in 1934 and growing up in World War II Italy, Loren’s life of glamour and success was preceded by years of poverty and hardship, when she lived in her grandparents’ house with her single mother and sister, and endured near starvation. She shares how she blossomed from a toothpick-thin girl into a beautiful woman seemingly overnight, getting her start by winning a beauty pageant; and how her first Hollywood film, The Pride and the Passion , ignited a high-profile romance with Cary Grant, who would vie with her mentor, friend, frequent producer, and lover Carlo Ponti to become her husband. Loren also reveals her long-held desire to become a mother, the disappointments she suffered, the ultimate joy of having two sons, and her happiness as a mother and grandmother.From trying times to triumphant ones, this scintillating autobiography paints a multi-dimensional portrait of the woman behind the celebrity, beginning each chapter with a letter, photograph, or object that prompts her memories. In Loren’s own words, this is a collection of “unpublished memories, curious anecdotes, tiny secrets told, all of which spring from a box found by chance, a precious treasure trove filled with emotions, experiences, adventures.” Her wise and candid voice speaks from the pages with riveting detail and sharp humor. Yesterday, Today, and Tomorrow is as elegant, entrancing, and memorable as Sophia Loren herself.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Italy",
    "Film",
    "Biography Memoir"
  ],
  "author": "Sophia Loren",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/22557473-yesterday-today-tomorrow"
}