{
  "title": "The Short and Tragic Life of Robert Peace: A Brilliant Young Man Who Left Newark for the Ivy League",
  "description": "An instant New York Times bestseller, named a Best Book of the Year by The New York Times Book Review, Entertainment Weekly, and others, this celebrated account of a young African-American man who escaped Newark, NJ, to attend Yale, but still faced the dangers of the streets when he returned is, “nuanced and shattering” (People) and “mesmeric” (The New York Times Book Review).When author Jeff Hobbs arrived at Yale University, he became fast friends with the man who would be his college roommate for four years, Robert Peace. Robert’s life was rough from the beginning in the crime-ridden streets of Newark in the 1980s, with his father in jail and his mother earning less than $15,000 a year. But Robert was a brilliant student, and it was supposed to get easier when he was accepted to Yale, where he studied molecular biochemistry and biophysics. But it didn’t get easier. Robert carried with him the difficult dual nature of his existence, trying to fit in at Yale, and at home on breaks.  A compelling and honest portrait of Robert’s relationships—with his struggling mother, with his incarcerated father, with his teachers and friends—The Short and Tragic Life of Robert Peace encompasses the most enduring conflicts in America: race, class, drugs, community, imprisonment, education, family, friendship, and love. It’s about the collision of two fiercely insular worlds—the ivy-covered campus of Yale University and the slums of Newark, New Jersey, and the difficulty of going from one to the other and then back again. It’s about trying to live a decent life in America. But most all this “fresh, compelling” (The Washington Post) story is about the tragic life of one singular brilliant young man. His end, a violent one, is heartbreaking and powerful and “a haunting American tragedy for our times” (Entertainment Weekly).",
  "genres": [
    "Nonfiction",
    "Biography",
    "Book Club",
    "Memoir",
    "Race",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Jeff Hobbs",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/22557458-the-short-and-tragic-life-of-robert-peace"
}