{
  "title": "Kaal",
  "description": "Kaal Sreshta is born in Kud, Kashmir. Following threats by Islamic fundamentalists his family moves to Jammu. Since his distraught parents can offer little to shape his future he runs away from the refugee camp to arrive in Delhi, India’s capital city, where he struggles with odd jobs before becoming a private detective. The agency dispatches him to Mumbai for some enriching experiences. While returning from an assignment in Kolkata he meets Swami Hrikesh who, as Guru, guides him on the ‘Right Path.’ Following his divination he joins politics and wins a parliamentary bi-election. He can’t believe it at first but this is what he always wanted. The colour of Indian politics begins to change as the National Rebuilding Forum gains popularity across the country. Discarding parliamentary democracy the nation votes for a presidential government and he is elected the executive head in the country’s first direct elections. Soon after taking office he speeds up reforms but since he’s acquired too much power disgruntled parliamentarians band together to impeach him and send him packing. Left without options he seeks asylum in Britain. He lives there as a recluse for a couple of years but his friends in the Labour Party don’t approve of him sitting idle. He’s made to return to politics, this time in a foreign land. Through diplomats in Geneva he voices his opinion on Kashmir’s special status, and motivates UN delegates to vote for India on the long pending issue. Being a soft target for fundamentalists he’s assassinated at a resort in South England. He leaves behind a 5 years old son and a pregnant wife. Kaal Jr, born after his father’s death, grows up with vengeance against the world. Keshav, who’s seen his father die, is a quiet supporter of the 3rd world and an active member of X4L, an Indo-German mission with offices in Munich, London, Delhi, and Banaras. Kaushalya who plays the female protagonist is born in a Delhi slum. Her tumultuous life leads her to the Red Light in Amsterdam. Patricia Schmidt is Keshav’s lover and a fellow X4L member. Tsering Ngodup, who’s had his early education in North India, is a translator of Buddhist scriptures in Munich. Bhim is a businessman and Hindu activist in North India. Santam, Kaushalya’s brother, a dockworker, leaves Indian shores to arrive in Sydney aboard a merchant ship. He is baptized, becomes a missionary, and marries Sister Rose. Time leads the characters to each other and in their endeavor to discover themselves they weave a story that revolves around their past, present, and future. This world is mythical and rarely do people get to see what lies behind the curtain called death.",
  "genres": [],
  "author": "Sunil Kapoor",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/22556958-kaal"
}