{
  "title": "Up in the Garden and Down in the Dirt",
  "description": "In this exuberant and lyrical addition to the award-winning Over and Under series, emerging readers will delight in discovering the wonders that lie hidden between stalks, under the shade of leaves, and down in the dirt.From the author-illustrator team behind Over and Under the Snow and Over and Under the Pond .Explore the secret realm beneath the dirt that brings the world of nature to  Follow a young girl and her grandmother on a journey through the year planning, planting, and harvesting their garden—and learn about what's happening in the dirt to help make it all happen. Up in the garden, the world is full of green—leaves and sprouts, growing vegetables, ripening fruit. But down in the dirt exists a busy world—earthworms dig, snakes hunt, skunks burrow—populated by all the creatures that make a garden their home. These secrets and many others are waiting to be discovered up in the garden and down in the dirt in this sweet children’s book from Kate Messner and Christopher Silas Neal, the latest in their beloved series that offers kids a peek into hidden ecosystems.ENTERTAINING AND Beautiful illustrations paired with an easy-to-follow storyline make this a great read for any early elementary school student, while a glossary of animals that live in, around, and under the garden enriches the reading experience.INSPIRES A LOVE A Offering a look inside a hidden and bustling underground ecosystem, this gorgeously illustrated book encourages children to explore the world around them and appreciate the natural wonders they discover. A FIVE-STAR FAVORITE OF READERS & \"The harmonious relationships above and below ground, and those between the two, emphasize the complexities of the garden ecosystem, as well as the joys of sustained engagement with the land.\"— The Horn Book Magazine ; \"Offers excellent coming attractions for what youngsters can expect when they try to grow something.\" — Reading TodayPerfect",
  "genres": [
    "Picture Books",
    "Nature",
    "Childrens",
    "Science",
    "Gardening",
    "Nonfiction",
    "Animals"
  ],
  "author": "Kate Messner",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/22553675-up-in-the-garden-and-down-in-the-dirt"
}