{
  "title": "Dagger's Hope",
  "description": "Dagger is a Trivator warrior. He is known for his dark and dangerous edge, making him the perfect warrior for impossible missions. He fears nothing, until he meets a young, delicate human female who wakens his heart. Her gentle touch, soft voice, and her shy sense of humor touch him in a way he never thought could happen. The thought of anything harming something so beautiful and fragile fills him with terror.Jordan Sampson is slowly adjusting to her new life on a strange planet far away from war-torn Earth. She had been seventeen when she was brought to the Trivator’s home world of Rathon along with her older sister, Jesse, and younger sister, Taylor. Fear, confusion, and uncertainty of what the future holds threaten to drown her as she tries to fit in. There is only one hope that keeps her going. It is the handsome alien male that stirs something deep inside her and makes her feel whole.When Dagger is captured during a mission and sold to the illegal Fight Rings, it is only the memory of Jordan that keeps him going. Time blurs as he slowly sinks deeper and deeper into a world of violence and pain until he becomes more animal than Trivator.Jordan knows Dagger is out there, somewhere. She can feel him in her heart. The heart she gave to him the first time he held her protectively in his arms. When she discovers where he is being held, she refuses to let anything stop her from rescuing him. What Jordan doesn’t realize is that she has been Dagger’s hope during his captivity. The one thing that holds the thin thread to his sanity.The fight to save Dagger takes Jordan on a journey that she hopes they both survive. The star system is a dangerous place for a young human female and a damaged Trivator warrior. Can Jordan reach Dagger in time, and if she does, can she heal his shattered soul?",
  "genres": [
    "Science Fiction",
    "Aliens",
    "Romance",
    "Science Fiction Romance",
    "Fantasy",
    "Paranormal Romance",
    "Paranormal"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/22557743-dagger-s-hope"
}