{
  "title": "Long Way Down",
  "description": "They’ll fight each other along the way, but she is the only chance he has to save both his name and his club.  Mason Butler is good with numbers. Tasked as treasurer for the Fallen Angels MC, he’s always been able to make the numbers add up, but when he discovers that a large chunk of money has gone missing, he decides to call in help to figure out where it could have gone. When Munch, one of Mase’s MC brothers, suggests his cousin Caroline for the job Mase looks into the girl, and as soon as he lays eyes on the gorgeous blond, he decides to enlist her for the job.  Caroline Lewis is a computer whiz and a math genius, but she’s not great with people, especially incredibly sexy bikers who show up at her house unannounced. After making a complete fool of herself, Caroline grudgingly agrees to take the job and begins looking for the missing money. Working together is difficult, mostly due to Caroline’s lack of a verbal filter and her open disdain of the work that Mase and Munch do for the club. But underneath the hostility that Mase finds amusing, there is a huge amount of sexual tension that threatens to explode, consuming them both  As they fight the urges that keep bringing them closer, Caroline begins to find evidence that someone has been stealing from the club for a while and the evidence suggests Mase is the culprit. Mase denies involvement, and she believes him, but as they get closer to the truth, they begin to rip open a web of deceit and corruption that threatens both their lives, and the relationship that they have started to build.  To find the thieves and save the club, they’ll have to work together, but when Mace is forced to make a choice, the consequences will put everything to the test.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary",
    "BDSM",
    "Contemporary Romance",
    "Dark",
    "Fiction"
  ],
  "author": "Laura   Day",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/22561365-long-way-down"
}