{
  "title": "Falling For You",
  "description": "Dear Author,Due to a very embarrassing accident I am stuck at home. Broken leg. My profession requires a lot of exercise, so not being able to move around freely drives me crazy. One morning while sipping my coffee and browsing the internet on my tablet, I spotted the most gorgeous guy just outside my balcony. He was so engrossed in talking to the dog he’d been walking that day, that he hadn’t noticed me watching. In hope of seeing him again and maybe for a chance to get to talking I had every breakfast, lunch, afternoon snack and dinner on my balcony. Every day. I knew it was crazy but I just had to see him again. I did. For days I had been watching him and his dog play at the park across the street. One day, when he actually noticed me, it was everything I could have hoped for and more.The only problem: his dog is his entire world. Unfortunately I’ve been suffering from Cynophobia (terrible dog phobia) ever since I can remember. How can we find our HEA? He would never choose me over his dog…Photo Description: One man is leaning over a balcony, having his knuckles of his hand kissed by another man who is rising up to meet the challenge.This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Short Stories",
    "LGBT",
    "Sports",
    "Gay"
  ],
  "author": "Matthias Williamson",
  "average_rating": "3.16",
  "url": "https://www.goodreads.com/book/show/22561583-falling-for-you"
}