{
  "title": "The Ledge Between the Streams",
  "description": "In the summer of 1943, an Indian public-health official (Daddyji) and his wife (Mamaji) were traveling with their six children to the Vale of Kashmir for a holiday.During a break in the journey, their blind nine-year-old son, Ved, the author of this exquisitely composed memoir, heard water flowing and asked about it. He was told there were two streams, one clear, the other muddy. He said he wanted to see them for himself, and the family climbed down into a gorge where a narrow ledge separated the icy torrents of the Jhelum, a powerful river fed by the snows of the Himalayas, from a tepid, sluggish local stream. Ved squatted down on the ledge and put a hand in each stream. A cloudburst suddenly caused the Jhelum River to rise, and the Mehtas barely scrambled out of the gorge with their lives.The echoes of the author's experience in that gorge forty years before, one small incident in this book, haunt the story much as the mysterious Malabar Caves haunt E.M. Forster's A Passage to India. Like Forster, Mehta presents us with a highly original, intimate, and revealing portrait of 20th-century India. Mehta writes about the decade 1940-1949, a crucial time in his life and the life of India. He recounts the day-to-day joys and sorrows of a large, affectionate, well-to-do Hindu family in the Punjab, setting them against the distant thunder of the Second World War and the waning light of the British raj. He describes the growing strife between Hindus and Muslims, and the wave of violence that engulfed India during Partition. Mehta tells how he came to terms with his adolescence; learning English, Braille, horseback riding, bicycling, touch typing, roller skating; how he came to live a normal life. He shows how he became increasingly aware of the disparate currents flowing through his life, much like the two rivers: a young man without sight determined to enjoy the advantages of the sighted; a dutiful son confronted daily by the contrasting personalities of his parents.",
  "genres": [
    "Biography",
    "India",
    "Nonfiction"
  ],
  "author": "Ved Mehta",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/225584.The_Ledge_Between_the_Streams"
}