{
  "title": "Van Gogh and Love",
  "description": "Van Gogh and Love is a captivating book telling the story of Vincent van Gogh’s longing for love and a family. While the reader may be familiar with the artist’s paintings and descent into mental illness, this work explores the lesser-known area of the artist’s romantic life.As soon becomes clear, matters of love were always on Vincent’s mind, and were inextricably linked with other aspects of his life. Van Gogh and Love focuses on Vincent’s relationships with four striking women: his widowed cousin Kee Vos, the prostitute Sien Hoornik, the unstable neighbor Margot Begemann and the flamboyant Parisian café-owner Agostina Segatori. As can perhaps be expected from an artist like Van Gogh, his choice of women was unconventional. He favored more mature companions, and pursued relationships with women that were considered unsuitable. Vincent’s love affairs were frowned upon by his family, and further complicated by his lack of money. Van Gogh’s yearning for love and a family life was intimately connected with his artistic practice. There is no doubt that art was the most important thing in his life. A woman could not only assist him practically, by serving as his model, but would also give him the opportunity to fully understand emotions like love, tenderness and compassion. A painter had to be immersed in his subject matter to properly express feelings in his work. Vincent was convinced that love would make him a better artist. When faced with the disapproval of his parents, financial hardship and failure to sell his sketches and paintings, Vincent turned to his only ally – his brother Theo. In frequent, long letters he described his romantic hopes and aspirations. The author quotes extensively from these letters, allowing the reader to discover Vincent’s feelings about love and relationships at first hand. Van Gogh and Love successfully combines this basis in archival material with an entertaining and easy-to-read format, staying clear of jargon. Starting at the Van Gogh home in Etten with Kee, the love of Vincent’s life, his “She and no other”, and the unhappy and obsessive period that followed, Van Gogh and Love takes the reader to the streets of The Hague, where Vincent got a taste of family life with Sien and her children. From there one is transported to the artistic circles of bohemian Paris and Agostina’s café, where Van Gogh’s paintings hung on the wall, via an ill-fated encounter with Margot in Nuenen, which ended with a desperate suicide attempt on her part. The book follows Vincent’s quest for love up until his tragic end, detailing his life-long, and ultimately unfulfilled, desire for a woman and a family. It is a moving and sensitive portrayal, shedding light on the man behind the iconic paintings.",
  "genres": [],
  "author": "Nienke Bos",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/22559007-van-gogh-and-love"
}