{
  "title": "Satan Came to Eden: A Survivor's Account of the \"Galapagos Affair\"",
  "description": "In 1929, Dr. Frederick Ritter and Dore Strauch fled the social and economic turmoil of post-World War I Germany, choosing to abandon the chaos of modern civilization, as well as their respective spouses. They began a quest to reclaim the purity of nature for themselves. They chose as their Eden the dry, uninhabited volcanic island of Floreana in the Galapagos chain. Their experiences in their new paradise—and the ensuing scandals—would captivate the Western world.Floreana's unforgiving environment hardly proved to be a idyllic choice, and were it not for the assistance of American yachters, Ritter and Strauch, naive and unprepared as they were, might easily have perished during their first year as colonists.Yacht crews returned with news of the eccentric couple's adventures, and they became darlings of the Western press. This unwelcome publicity lead to the arrival of a second family on the island, soon followed by a pistol-wielding Austrian \"baroness\" and her two young lovers. While not without her charm, this mysterious \"aristocrat\" could also be sinister and controlling. Tensions grew rapidly, jealousies and resentments raged, and soon this island with a population of 9 was at war with itself.The baroness was to disappear into thin air, in what western papers headlined as “The Galapagos Affair.” Other premature deaths followed close at hand, and Floreana developed an air of danger, suspicion and scandal that still entices today. Who was the \"Satan\" who came to Eden? Was it a singular person, or was it the darkness that can arise in every human heart? It is a question for each reader to answer in their own way, picking up clues not only from what is said, but from what is omitted.Originally published in 1936, Satan Came to Eden meticulously recounts Ritter and Strauch's often bizarre, true-life struggle from a survivor's point of view—an account lost to the public for nearly 80 years. Editor Joseph Troise supplements Strauch's original memoir with previously unpublished photographs and an informative preface, introducing a new generation of readers to one of the strangest stories of the twentieth century.",
  "genres": [
    "True Crime",
    "Biography",
    "Nonfiction",
    "Travel",
    "Survival",
    "Mystery",
    "Memoir"
  ],
  "author": "Dore Strauch",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/22559961-satan-came-to-eden"
}