{
  "title": "The Deadline",
  "description": "Yes, upon fan request The Friessens are back in a brand new series!\"This book will steal your heart & have you waiting for the next one. It will also teach you to speak your mind when necessary. I do hope this situation never happens in real life! Don't miss a very good emotional read.\" - Whodunnit, Reviewer\"I love these Friessen men and their families. Was so excited the stories are going to keep on how going. Andy and Laura had a plate full with a sick child and moving to a new state along with twins. Andy has a strong personality and I appreciate him more after this book. What a man won't do for his family. Please read!\" - Janet Murphy, Reviewer\"I'm like your other fans, absolutely in love with this family. I so wanted Gabriel to get well and can't wait until Andy's mother finally gets what's coming to her. I've never read of such a vicious, manipulative, heartless character like her before. I love how this family comes together for each other, and the hubbies, momma mia, so masterful, hunks personified. I personally could see this as a series on TV.\" - Arkansan, Reviewer\"I loved this book! Thank You Lorhainne Eckhart for bringing the Friessens back. You make the Friessen men so alive and the kind of men us women wish we could meet. The Deadline is a touching story of unconditional love and strength.\" - Amazon Customer, ReviewerIn THE DEADLINE, Andy Friessen has packed up everything and moved his family two states away, to Montana, to protect his wife, Laura, his newborn babies, and his stepson, Gabriel, from the threats of his mother. What Andy doesn't know is that they'll soon face a new threat, one he never saw coming.Gabriel is sick, and a trip to the doctor confirms Laura and Andy's worst nightmare: Without a lifesaving transplant, their son won't survive.What Andy doesn't count on, as he tracks down the young man who fathered Gabriel, as well as Laura's estranged parents, is that a whole host of problems are about to be unleashed.THE FRIESSENS: A NEW BEGINNING in order:The Deadline (Andy & Laura)The Price to Love (Neil & Candy)A Different Kind of Love (Brad & Emily)A Vow of Love, A Friessen Family ChristmasOr grab The Friessens: A New Beginning, The Collection which includes all the books in this romantic family saga.Can't get enough of the Friessens? Don't worry a brand new series begins with THE REUNION, April 2015.If you enjoy THE FRIESSENS: A NEW BEGINNING, you may also enjoy, THE WILDE BROTHERS.THE WILDE BROTHERS: Come and meet the Wilde Brothers of Idaho. Joe, Logan, Ben, Samuel, and Jake. You'll love the western flair and hot men and strong women in this romantic family saga.Other Series you may enjoy:THE OUTSIDER SERIES: An Emotionally charged romance series beginning with the Amazon Bestseller, The Forgotten Child.THE FRIESSENS: A NEW BEGINNING: The return of The Friessen men and the women they love in this emotionally charged Family Saga which follows THE OUTSIDER SERIES.THE SAVED SERIES is a hot military suspense with a love story set in a military setting. \"This was a hard book to put down! A tough captain of a war ship finds a pregnant young girl in a dinghy alone in the ocean!\" - Audrey\"The story that unfolds after Abby is rescued is a story of love and how it can change even the toughest man.\" From Crazy fast readerWALK THE RIGHT ROAD SERIES: \"The Choice will leave you questioning your own morals and motivations and leave you asking others what they would do in that same situation. This is a genre-bending novel that will surprise you\" from JRA.\"Rarely have I spent time reading a series that had me feeling every thought and emotion.\" From Mary Ellen",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Westerns",
    "Amazon",
    "Fiction"
  ],
  "author": "Lorhainne Eckhart",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/22563317-the-deadline"
}