{
  "title": "Iris & Lily: The Complete Series",
  "description": "Growing up in the '60s and '70s as the youngest daughters in a family of fourteen, the sisters Iris and Lily struggle to survive in the chaotic Capotosti household. The rage of their hot-blooded Italian-American father, the demands and dictates of the Catholic church, the abuse and intimidation meted out by half a dozen domineering brothers, and the oppression of poverty pave their lives, forcing them to tackle physical and emotional feats beyond their comprehension and power. During childhood, Iris and Lily lock arms to care for and protect one another, but as they grow, outside forces begin to drive a wedge between them. The blatant favoritism of an aunt, the shame of sexual abuse, socioeconomic shifts, and the eruption of the women’s movement become the catalysts that transform their childhood camaraderie into conflict and their affection into alienation. Desperate for love, validation, physical care, and freedom they each run headlong into marriage when they are barely out of their teens. When Iris’ marriage transplants her to Italy, the physical and the emotional distance between the young women seems irreconcilable. Each time the sisters are reunited to celebrate a holiday or grieve the death of a family member, the unresolved conflicts resurface to confront them, challenging their perceptions of the past and the devotion they once knew.Through their alternating voices and points of view, the two sisters Iris and Lily draw readers into their personal sagas within the Capotosti family relationships, making them relive the romance and expectations of young love, the disappointing realities of adulthood, and the complex dynamics at play between siblings with indomitable spirits who, despite their differences, share a deep sisterly love. But is the love between two sisters strong enough to survive the truth they have avoided for so long? Can the deeply ingrained dynamic that governs their relationship – and their destinies – be altered? Praised as \"beyond excellent\", \"raw, real and slightly unnerving\", \"delightful, touching, deep and wise\", this three-book series about two sisters is a compelling work of contemporary classic literature, a coming of age novel \"you won't want to end\". The ebook edition contains all three books in the series. A paperback edition is available for each separate book of the \"Iris & Lily\" series, as Book One, Book Two and Book Three.",
  "genres": [
    "Fiction",
    "Book Club"
  ],
  "author": "Angela Scipioni",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/22559108-iris-lily"
}