{
  "title": "Power Play: The Complete Series",
  "description": "Get all of Selena Kitt's Power Play Series - the Complete Collection - in one big book!  Selena Kitt’s *Power Play*—where those uber-hot alpha authority figures take full advantage of their status to strike up all sorts of sexy naughtiness with their subordinates!  Warning: This title contains hot, steamy nobody-writes-it-like-Selena-Kitt sex between alpha authority figures and their subordinates!  Included in this series: Kelsey and the Executive Katie and the Dom Emily and the Priest Ivy and the Cop Bailey and the Professor Jodie and the Billionaire Donnie and the Maid--------------Kelsey and the Executive Kelsey never dreamed her first job out of college would be as a secretary. Oliver Pierce turns out to be a harsh taskmaster, and while her friends wonder how Kelsey got the job with such a thin resume, Kelsey doesn’t have to wonder. It becomes quite clear that her lack of experience is exactly what Oliver Pierce was looking for, and she finds herself utterly seduced, ready to be shaped and molded.Katie and the Dom Katie has a secret wish—she wants to be a submissive. Then single, sedate, librarian Katie sees an ad on Craiglist. Her friend, Lori, tells her it’s too dangerous, and she’s right. Her first Dom, Patrick, is woefully inexperienced, but thankfully, Liam interrupts his little brother’s attempts. Liam is a true Dom, and he wants Katie, perhaps even more than she wants him.Emily and the Priest Her first year away from home at Catholic college has been a disaster for shy, awkward Emily, falling in with the wrong crowd, just trying to fit in with the other girls. When Father Mark, the campus psychologist, takes her under his wing, she’s more than grateful, and under his tutelage, Emily blossoms into ripe, luscious fruit, just ready to be plucked.Ivy and the Cop Ivy’s car has broken down in the middle of the night in the middle of nowhere on the way back from a summer babysitting job, her cell phone neglectfully uncharged, and she’s never been so grateful to see flashing lights in her rearview mirror.Bailey and the Professor Bailey’s graduate science classes are much harder than she expected them to be, and strict, young Professor Jacobs, in particular, seems out to get her, finding minute mistakes in her work, making her re-do assignments she’s already meticulously completed. When he forces her to start staying late in the lab, Bailey complains to her roommate that she’s about ready to quit school altogether, but what she doesn’t know is that her stern professor has a carnal lesson he’s waiting to teach her. Bailey is about to discover that she and Professor Jacobs share a great deal of “chemistry” together!Jodie and the Billionaire A trip to Vegas for her best friend’s bachelorette party is the perfect break from her high stress job, and it serves to be lucky for Jodie, when handsome millionaire Dorian Cole asks her to roll dice for him at the craps table. Always lucky with dice, Jodie wins him two-hundred-thousand dollars. Grateful, Dorian offers to tip her, but Jodie refuses, ready to go off with her friends to a night on the town. And that’s when Jodie gets a real life indecent proposal—an invitation to be the billionaire’s “date” for the weekend. Looking into the man’s darkly seductive eyes—how could she possibly say no?Donnie and the MaidDivorced Donnie hasn’t had it easy since his wife abandoned him for a six-figure income with the richest man in the county, taking their daughter with her. He knows he’s a bit of a daydreamer—a writer, a poet—who just can’t be bothered with real world things like preparing meals or cleaning toilets. When his twelve-year-old daughter complains that Dad’s house is “grody” and tells him, “Mom keeps threatening to call social services,” Donnie breaks down and hires a housekeeper. Sexy little Elena is a godsend, in more ways than one, descending on his house with a feather duster and a skirt so short it takes his breath away. And while Donnie struggles to keep his lust—and his growing feelings—in check, Elena finally makes it clear that he’s more than welcome to service the new maid!",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Audiobook",
    "Erotic Romance",
    "Fiction",
    "Contemporary Romance"
  ],
  "author": "Selena Kitt",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/22559047-power-play"
}