{
  "title": "The Declaration of Independence -  Complete Series I",
  "description": "Would you have signed?Thomas Jefferson, Samuel Adams, Francis Lewis, and John Hancock’s stories are all here in the Complete Series I by best-selling authors Murray Pura, Amber Schamel, John V. Amodeo, and Joseph Max Lewis! What was going on the morning of the signing in Philadelphia? These four amazing authors have brought that to life. The Declaration of Independence series asks all of us that one soul searching question. If you were rich, if signing meant defying the world’s superpower, if failure meant your family would be left destitute and you would be hung by the neck with your hands tied behind your back until you strangled to death, would you have signed The Declaration of Independence? Would you have risked your privileged life so that others might live in freedom? That was the question facing John Hancock and in the face of overwhelming odds he answered, “Yes.”“We must all hang together,” Hancock said, before almost choking on his disastrous choice of words. Men’s faces clouded. They realized they stood on the brink, but could still step back. As had so often been the case, it was Benjamin Franklin who saved him, who saved us all.\t“Yes, we must indeed all hang together,” Franklin replied in an equally loud voice. He took a moment to push his spectacles up his nose. “. . . or most assuredly we shall hang separately.”\tThe hall burst into surprised laughter. Men now smiled, grimly perhaps, but they lined up and took their turn, signing the most important document in the history of the world. Only Franklin, Hancock thought to himself. \tJoin Hancock, Franklin, Jefferson and the other Founders on one of the most momentous days in human history, July 4, 1776.Fast Fact- There is something written on the back of the Declaration of Independence.There is a simple message, written upside-down across the bottom of the signed document: “Original Declaration of Independence dated 4th July 1776.” No one knows who exactly wrote this or when, but during the Revolutionary War years the parchment was frequently rolled up for transport. It’s thought that the text was added as a label.",
  "genres": [],
  "author": "Murray Pura",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/22558646-the-declaration-of-independence---complete-series-i"
}