{
  "title": "Vitalis",
  "description": "“Peace, woman. I swear, you have no sense of humor whatsoever. I’ll accept your deal on one condition.”I wait for him to continue but he doesn’t say anything else. It's like pulling teeth. “What's the condition?”“You have to go on a date with me.”“You realize that you’re blackmailing me into a date, don’t you? That’s desperate, even for you,” I say in disgust. “Don’t you have any shame?”“Yes, I realize that. And no, I do not. The Greeks wouldn’t have won the Trojan war if they had felt too ashamed to hide in a wooden horse,” he quotes cheerfully.“So you’re comparing going on a date with me to winning a war?”“Hm…Yeah, I guess I am,” he answers, completely unfazed. “Take it or leave it, it’s up to you.”I take a deep breath and try to think about this rationally.One date in return for a chance at winning the Championship.xxxxxxBlue Smith has leukemia. Having already undergone several cycles of chemotherapy, she isn’t sure how much time she has left. All she knows is that she’ll do anything to live.Just when she’s lost all hope she is transported to Vitalis, a mysterious planet that may hold the cure. But to obtain that cure, she and her team have to win the Salvage Championship by completing a set of perilous Tasks. Tasks that test their strength and acumen.When Blue finds herself allied with an innocent ten-year-old, a gorgeous but abrasive blonde, an annoyingly arrogant cynic, and a handsome jock who is way too laid-back, she wonders if her team can even pass the qualifying round.As she struggles to keep her team from being eliminated, she starts to notice some strange things on Vitalis. It’s sunny all the time and the people are a bit…off.Although she is more than happy to ignore the weirdness of the planet, Jack (her teammate) won't let her. He insists the Vitalians are hiding something from them. Having no other choice, Blue reluctantly joins Jack in his quest to uncover Vitalis' secrets. And while fighting for her life, she starts to fall for the one person she thought she'd never trust.",
  "genres": [],
  "author": "S.P. Vega",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/22562837-vitalis"
}