{
  "title": "Passage to Pontefract",
  "description": "The Black Prince, hero of England, had died before his father Edward the Third, who had become a senile old man dependent on his rapacious mistress Alice Perrers; the heir to the throne was a young boy, Richard of Bordeaux, surrounded by ambitious uncles who believed it would be better for the country if they could take the crown.The eldest of the uncles was John of Gaunt, who when he married Blanche of Lancaster became the Duke of Lancaster and next to the King the richest and most powerful man in the country. Lancaster became deeply enamored of his children's governess, Catherine Swynford, but even this emotion could not stop his craving for the crown.When Wat Tyler's daughter was insulted by a tax collector, Wat led the Peasants' Revolt. Richard showed himself capable of reckless bravery when he faced the rebels at Mile End and Smithfield and saved the country from revolution. Then it seemed that he would be a worthy ruler. He enjoyed a happy marriage with Anne of Bohemia but his extravagance and tendency to surround himself with his favorites brought him into conflict with his people. His uncles, John of Gaunt and Thomas of Woodstock, were caught up in the intrigue, and there came the day when the Five Lords Appellant faced Richard and threatened to depose him.Here is a vivid picture of Richard's court, of his extravagance and folly, of his devotion to his favorite, Robert de Vere, of his love for two queens, clever Anne and the little Isabella, and of his headlong journey toward disaster. He could never forget an injury and was determined to take his revenge on the five lords who had humiliated him. He succeeded with four of them but the fifth—Henry of Bolingbroke, son of John of Gaunt—was clever, subtle, and determined to triumph where his father had failed. Richard was no match for him and it was Bolingbroke who drove him along the last stretch of his passage to Pontefract.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "British Literature",
    "Plantagenet",
    "Fiction",
    "Medieval",
    "14th Century"
  ],
  "author": "Jean Plaidy",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/1133002.Passage_to_Pontefract"
}