{
  "title": "Rising Sun, Half Moon, Rock Stars: D-Strings Set",
  "description": "They are friends in public, lovers in private. In an age of sex, drugs, rock and roll, they want it all. But \"all\" is differently defined to everyone. What happens when sexy drummer Matt Loren wants bandmate Jules Breaux as more than a bedroom plaything? Is her love more than a four letter word?Rising Sun, Half Moon, and Rock Stars is a monster sized rock romance trilogy--over 1000 pages--exposing the harsh realities of fame, the rivalry between siblings and associates, and the reliability as well as surreal expectations of true love.Book ONEIn RISING SUN, rebellious Jules Breaux doesn't know what to feel when the band she began as a hobby begins rising up in fame and ruining friendships. Is this what she wanted after all? A life of sex, drugs, rock and roll? Which comes first, her priorities? Or those of Matt? The sexy drummer with whom she has a very complicated relationship.Book TWOHALF MOON continues where Rising Sun left off. Is the band the glue that holds personal relationships together? Will love, family, and friendship survive if the band begins to fall apart?Book THREEROCK STARS: Once friends, once lovers, and once famous--they are soul mates, and time hasn't changed that. For Jules, rekindling that old sweet fire means trading her quiet life for the rock and roll world from which she once ran. To Matt, his private desire to win back his true love becomes a public affair.Their love for each other is limitless, a passion proven to survive all. But after withstanding the test of time, will that old feeling endure a very public existence and the stresses of life in the fast lane?Live a vinyl journey during a time of political unrest and memorable events. Watch as surfing and skateboarding become a culture. Listen as music changes, and rock and roll is reshaped. Walk the Boulevard of Broken Dreams in Rising Sun, Half Moon, Rock Stars.Six Silver Strings Series:D-String Set: \n   Rising Sun \n   Half Moon \n   Rock Stars \n G-String Set \n   Jack Who? \n   Weathering Jack Storm \n   Snow Storms",
  "genres": [],
  "author": "Lisa Gillis",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/22568509-rising-sun-half-moon-rock-stars"
}