{
  "title": "Love Goes To Buildings On Fire: Five Years In New York That Changed Music Forever",
  "description": "Punk rock and hip-hop. Disco and salsa. The loft jazz scene and the downtown composers known as Minimalists. In the mid-1970s, New York City was a laboratory where all the major styles of modern music were reinvented--all at once, from one block to the next, by musicians who knew, admired, and borrowed from one another. Crime was everywhere, the government was broke, and the city's infrastructure was collapsing. But rent was cheap, and the possibilities for musical exploration were limitless.Love Goes to Buildings on Fire is the first book to tell the full story of the era's music scenes and the phenomenal and surprising ways they intersected. From New Year's Day 1973 to New Year's Eve 1977, the book moves panoramically from post-Dylan Greenwich Village, to the arson-scarred South Bronx barrios where salsa and hip-hop were created, to the Lower Manhattan lofts where jazz and classical music were reimagined, to ramshackle clubs like CBGBs and The Gallery, where rock and dance music were hot-wired for a new generation. As they remade the music, the musicians at the center of the book invented themselves: Willie Colón and the Fania All-Stars renting Yankee Stadium to take salsa to the masses, New Jersey locals Bruce Springsteen and Patti Smith claiming the jungleland of Manhattan as their own, Grandmaster Flash transforming the turntable into a musical instrument, David Byrne and Talking Heads proving that rock music \"ain't no foolin' around.\" Will Hermes was there--venturing from his native Queens to the small dark rooms where the revolution was taking place--and in Love Goes to Buildings on Fire he captures the creativity, drive, and full-out lust for life of the great New York musicians of those years, who knew that the music they were making would change the world.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "New York",
    "Pop Culture",
    "Art",
    "Biography"
  ],
  "author": "Will Hermes",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/11331168-love-goes-to-buildings-on-fire"
}