{
  "title": "I Spy Pecan Pie",
  "description": "Dear Author,See him? That’s Justin. He hasn’t been working here long and I’ve been too shy to approach him so far. Since I do all the cooking here on the ranch I only see him at mealtimes and I’ve been trying to find out what he likes so that I can make it especially for him. I have some great friends here who are surprisingly encouraging and open minded. They’ve been trying to help me out (without being too obvious of course, which of course means they are being ridiculously obvious). They mean well, but I might be better off with less “help”.Justin is very sweet and always polite, he was definitely raised well but I have a feeling he’s been on his own for a long time, too long. I don’t know his story, but his eyes just look so sad sometimes and it breaks my heart. I think he might be interested, but I know sometimes I can seem intimidating. I’ve always been taller and bigger than most of the other guys here and being that I’m also the cook, most people don’t know really know what to make of me. It kind of keeps me from approaching guys I’m attracted to and I don’t want to make the same mistake with Justin. It’s not like a get a lot of chances to meet many available men and Justin is someone special, I just really don’t want to screw this up.We’ve been dancing around the attraction for a while now (at least in my own mind) and I’ve been working up my courage to see if Justin wants to spend some time with me away from the ranch. I finally have a whole “date speech” planned and I head out the back door, around the barn and what do I see? Justin in all his wet and soapy glory. Needless to say, I forgot my speech.Can you help me with what happens next? I need your words to help me work up my courage through some clumsily romantic moments that may not always work out, but where I have the best of intentions? One of my biggest weaknesses is Justin’s voice, his husky southern drawl does me in every time he opens his mouth.Photo Description: A lean and muscular man with dark hair and tattoos on his chest and shoulders stands in a large bucket. He is naked and soaping himself all over, paying particular attention to his crotch.This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Westerns",
    "Romance",
    "Short Stories",
    "LGBT",
    "Contemporary Romance"
  ],
  "author": "Anna Birmingham",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/22568594-i-spy-pecan-pie"
}