{
  "title": "Myself in Blue",
  "description": "Romance, redemption, and psychedelic rock in 1989.Sunday Morning is nineteen and recently diagnosed with osteosarcoma. She finds it fair: a deathly cancer to pay for her sins.The fourth of five daughters, Sunday could never overcome the jealousy she felt for her sisters, especially the youngest and her Rett Syndrome with all the attention she required. She knows her resentment and rebellion as a wayward teen brought tragedy to her family, but never learned exactly the extent. Self-exiled in Brazil living a hard life of penitence for five years, she finally feels it's possible to come back and try to mend things.Scott Goodwin writes bestseller biographies and always dreamed of writing about his idol, Grandma's Eye's vocalist, Iris Morning. The singer and her husband, Douglas Oshiro, have been reclusive since 1984, when their famous psychedelic rock band announced a surprising halt. Scott is thrilled when Iris finally agrees to let him write the book and even more so when she explains why. She hopes the bio will help finding her daughter Sunday and rebuild her shattered family.It is Sunday, however, who finds Scott. Still too mortified to face her family, she offers her story to Scott in exchange for inside information about them. Scott has no idea how intensely the deal will change their lives when he agrees.Through her own family's history, from the first Oshiros and Mornings, WWII impact on her ancestors and the struggle to form the band despite Iris’ abusive stepfather—the chain of events that led to the band’s success, the birth of a new generation, and the night that changed everything—Scott will try to show Sunday that nobody is perfect, and perhaps everything happens for a reason.Sunday and Scott may not have much time, with her diagnosis and the fact that she doesn't feel worthy of redemption, but he will not give up easily. Scott has become Sunday’s only link to the past, and perhaps her only chance to have a future.",
  "genres": [],
  "author": "Renny Barcelos",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/22563913-myself-in-blue"
}