{
  "title": "The Amphora Project",
  "description": "An enemy has come out of its deep dimensional cave. Infinitely older than humanity, it has crossed the barriers of our universe, and moves invisibly among us. It cares for nothing we might offer. It is beyond our science and religion. It has never enjoyed a sunrise, never tasted love. Because it isn't born of matter as we know it, it's a predator beyond our grasp.Our hope? Jockey Oldcastle, a fat, corrupt old star fighter with a chest full of medals purchased at an interplanetary pawnshop. But his navigator is Lizardo, from a race of highly intelligent reptiles, so hope is not entirely lost. Also in their ship is a shy, peace-loving entomologist who converses with butterflies and builds mechanical bees. This unlikely trio will grapple with the cosmic predator, assisted by a beautiful alien girl with vestigial wings and a birdlike voice that causes hallucinations. She's adored by a little robot named Upquark, who doubles as a suitcase and longs to experience romance.Along the way, they will explore the wonders of the Junk Moon, where old robots go to die, but not quietly. A gigantic rolling wheel of defective robots careens around the Junk Moon, crushing everything in its path. But the Junk Moon holds a secret at its core, and the old star fighter and his crew are there to crack it. Pursuing them is the Intelligence Agency, who are convinced they're guilty of crimes against society. Heading the Agency is a Vapor - a woman without a past, operating clandestinely, ruthlessly, and determined to brain-clean the old star fighter, turning him into a mindless shuffling cretin.Escape is required, to Alien City, marketplace of the planetary systems. Here traders from everywhere arrive, a writhing inhuman sea of creatures astonishing in their makeup and bizarre in their outlook. From their midst comes the Gamester, master of every known game in the universe and a formidable addition to the old star fighter's party. But whole cities are crystallizing, their inhabitants frozen in the streets, in their offices, and in restaurants. For this is how the extradimensional enemy kills, turning the human race into silent, staring statues highly polished and very dead.The Amphora Project is a ride through the future of the universe, featuring a fantastical cast of alien beings, quasi-human robots, intergalactic mercenaries, and two-thousand-year-old philosophers who have discovered the secret of eternal life. The Amphora Project combines elements of science fiction and fantasy and transcends the boundaries of both.",
  "genres": [
    "Science Fiction",
    "Fiction"
  ],
  "author": "William Kotzwinkle",
  "average_rating": "3.03",
  "url": "https://www.goodreads.com/book/show/225702.The_Amphora_Project"
}