{
  "title": "The Widow's War",
  "description": "In a small Cape Cod village in 1761, one woman is about to engage in the struggle of her life, defying her family, friends, and neighbors in a fight for her freedom that resonates even today. . . .When was it that the sense of trouble grew to fear, the fear to certainty? When she sat down to another solitary supper of bread and beer and pickled cucumber? When she heard the second sounding of the geese? Or had she known that morning when she stepped outside and felt the wind? Might as well say she knew it when Edward took his first whaling trip to the Canada River. . . .Lyddie has long been the wife of Edward Berry, a well-liked and successful whaler in Satucket Village, Massachusetts. Married for twenty years, Lyddie is used to the trials of being a whaling wife -- her husband's sudden departures, when whales are sighted in the bay; his long absences at sea, when she must run the house herself; the constant fear that one day Edward will simply not come home. But when the unthinkable does happen and Edward is lost at sea, Lyddie finds that she must bear not only the grief of losing her husband but also the insult of losing her autonomy. As a widow, she finds herself cast into society's cellar, her property and rights now at the whim of her nearest male relative, who happens to be her daughter's husband.With her son-in-law -- who was never Lyddie's first choice for her daughter -- implacable and hostile, Lyddie realizes she cannot live under his roof and under his decrees. Refusing to bow to both her “guardian” and the societal and legal pressures brought to bear upon her, Lyddie finds that defying one rule emboldens her to defy another . . . and another. As she moves back into the house she shared with Edward -- the house she is entitled to use only one-third of now -- and begins to figure out how she'll make a living on her own, she finds that her defiance earns her nothing but the abuse of friends and neighbors and puts her home and her family at risk. Ultimately, Lyddie must decide how much she values her personal freedom and how willing she is to become estranged from those she loves.While conjuring the hearths and salt air of eighteenth-century colonial America, The Widow's War captures a timeless human longing. With rich, realistic characters, Sally Gunning weaves a tale of a woman's journey to understand herself and her world, and her place in that world. Honest and moving, The Widow's War is a stunning work of literary magic, a spellbinding tale from an assured and gifted writer.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Historical",
    "18th Century",
    "American History",
    "Romance"
  ],
  "author": "Sally Cabot Gunning",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/2256627.The_Widow_s_War"
}