{
  "title": "The Weapon of My Delusion",
  "description": "**** 5 out of 5 Star Rating from The San Francisco Book \"The greatest genre hopping, adventure seeking, story branching, sub-plot twisting ride of your life! \"******** From \"Handled with casual brilliance. ... Such descriptions and alliterations in this story are always well-crafted and it is clear the author put a lot of care into crafting these moments.\"This book broke a lot of molds and was very clever... anyone who enjoys stories that tell a dramatic series of events but with a lot of humor and crazy moments mixed in will really love this book.\" ****----------------------------------------------------Paying homage to his favorite authors, Ambrose V. Bruno takes a page from “Hitchhiker’s Guide to the Galaxy,” “Catch-22,” and Kurt Vonnegut to create something absolutely “The Weapon of My Delusion.” The epic novel takes its place beside some of the greatest of the “genre-less” books, leaping into a visionary take of the simple tune, “Hey Joe.” Leaving a complex plot in the background and focusing on the character study, the characters of this crime story become the plot as a violent gunman seeks redemption.The man in the trench coat, simply known as Joe, had made a life for himself as the most lethal and profitable bounty hunter in the KBH gang. Things were going well for this hunter-of-men… that is, until it was reported that he had killed his true love. What the underworld next was asking was why?“Perhaps it was best just to run now and ask questions later…. Joe would be wandering at 90 MPH into the dark, unaware that those who had been his comrades would now begin lassoing their ropes about his neck, effortlessly, relentlessly, one by one.”And so it was that his organization put a bounty on Joe’s head, and of course, the police had some questions for him, too, for his organization was only rumored to exist. And to find him, would mean some classy book deals for all involved.But Joe’s story isn’t just another shoot-‘em-up; it’s a tale that asks the question “What makes right right, and wrong wrong?” And more “If you give peace a chance, will it be so kind as to return to the favor?”At the center of this epic, outrageous chase across an America of the late twentieth century, are the three relationships that drive Joe - his “woman of the Euphrates” whose death remains mystery, his relationship with the gang kingpin, Boss Samuels, who “ran the organization like a coach a master whose control is derived by blinding servants to the chaos within,” and a new woman, Nadine, who tries to convince him that the only life worth living is the one without the gun.This chase will change everything. First the motley assortment of bounty hunters, each with the merry ticks and musings over life-and-death. Do they follow the Code that has kept them strong, or follow their boss who seems to make his own rules (and to be honest, is probably insane)? On the other side is a police woman with a fire burning within, and a “scorpion” inside her brain — the gang of rappers who need to get more “gangsta” and find potential in the oncoming storm — the hippie who must decide how far he’ll go to be Peace’s bitch — and the bounty hunter himself who only wants to fade away like a ghost, but realizes that there is a weapon of delusion that is forcing him to face his past.“The Weapon of My Delusion” is a rip-roaring, dark comedy crisscrossing the country; from California to Georgia, slums to mansions, Mexico to the Afterlife. And in the end, the triumphant may simply be the one who finds out that, though the pen is mightier than the sword, delusions are stronger than them all.",
  "genres": [],
  "author": "Ambrose Vendetto Bruno",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/22565302-the-weapon-of-my-delusion"
}