{
  "title": "The Spoon Tree, A Family Series",
  "description": "Never has spooning been more fun, sweet, or sexy! With winner characters like Abby, Laura and Meg, 3 strong, smart, funny, and sometimes sassy women. And Tom, Todd and Greg, the kind of guys we all want to take home home. The men are honest, smart and caring, their only vulnerability is the love they have for Abby, Laura, and Meg and the strong ties to family.It's a story of two families, two trees, and how their tales intertwine. It's about love and second chances. Of family and loyalty. And, it’s a story about choosing happiness as your guiding light.The characters in this story love life, family, and really enjoy having fun. They don’t play stupid games. They’re mature and sensitive, and they recognize a gift when it presents itself and they cherish it.Laugh, cry, and enjoy! Bring these two families home and make them your very own :)Written in five parts, this version includes all five parts.* Book 1: Abby's Story ~ A young grandmother whose life is turned upside down when her daughter (a twin) dies and she is left to raise three grandchildren.* Book 2: Tom and Abby's Story ~ About finding love when you're not looking for it, but knowing it would be stupid not to embrace life's attempt to make things better.* Book 3: A Spoon for Laura ~ The story of Laura, Abby's other daughter, and her quest to become a whole, when she was always a half in the twin equation.* Book 4: Another Spoon for Meg ~ Tom's daughter Meg is 31 and at a turning point in her life. She's not a twin, but she needs to make changes to make her life whole.* Book 5: Laura and Todd's Story ~ Laura is back to let us know how her story ends, and how life's bad twists can make some things really good.The story of the spoons...There’s a place where hundreds of spoons hang from two large trees.Each spoon is tied to a branch by a colorful ribbon. Some of the spoons touch and create their own music and dance. Other spoons do a solo as they dangle and shine and add shadows and lights, to remind us why they are there.Each spoon on The Spoon Tree was put there for a reason. And each one has its very own story.",
  "genres": [],
  "author": "Bria Daly",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/22564603-the-spoon-tree-a-family-series"
}