{
  "title": "The Pharaoh's Daughter",
  "description": "“Fear is the most fertile ground for faith.”   “You will be called Anippe, daughter of the Nile. Do you like it?” Without waiting for a reply, she pulls me into her squishy, round tummy for a hug. I’m trying not to cry. Pharaoh’s daughters don’t cry.When we make our way down the tiled hall, I try to stop at ummi Kiya’s chamber. I know her spirit has flown yet I long for one more moment. Amenia pushes me past so I keep walking and don’t look back.  Like the waters of the Nile, I will flow.   Anippe has grown up in the shadows of Egypt’s good god Pharaoh, aware that Anubis, god of the afterlife, may take her or her siblings at any moment. She watched him snatch her mother and infant brother during childbirth, a moment which awakens in her a terrible dread of ever bearing a child. Now she is to be become the bride of Sebak, a kind but quick-tempered Captain of Pharaoh Tut’s army. In order to provide Sebak the heir he deserves and yet protect herself from the underworld gods, Anippe must launch a series of deceptions, even involving the Hebrew midwives—women ordered by Tut to drown the sons of their own people in the Nile.       When she finds a baby floating in a basket on the great river, Anippe believes Egypt’s gods have answered her pleas, entrenching her more deeply in deception and placing her and her son Mehy, whom handmaiden Miriam calls Moses, in mortal danger.   As bloodshed and savage politics shift the balance of power in Egypt, the gods reveal their fickle natures and Anippe wonders if her son, a boy of Hebrew blood, could one day become king. Or does the god of her Hebrew servants, the one they call El Shaddai, have a different plan—for them all?",
  "genres": [
    "Historical Fiction",
    "Biblical Fiction",
    "Christian Fiction",
    "Christian",
    "Fiction",
    "Historical",
    "Egypt"
  ],
  "author": "Mesu Andrews",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/22570814-the-pharaoh-s-daughter"
}