{
  "title": "I Am Radar",
  "description": "The moment just before Radar Radmanovic is born, all of the hospital's electricity mysteriously fails. The delivery takes place in total darkness. Lights back on, the staff sees a healthy baby boy — with pitch-black skin — born to the stunned white parents. No one understands the uncanny electrical event or the unexpected skin color. \"A childbirth is an explosion,\" the ancient physician says by way of explanation. \"Some shrapnel is inevitable, isn't it?\" I Am Radar begins with Radar's perplexing birth but rapidly explodes outward, carrying readers across the globe and throughout history, as well as to unknown regions where radio waves and subatomic particles dance to their own design, where a century of conflict and art unite in a mesmerizing narrative whole.Deep in arctic Norway, a cadre of Norwegian schoolteachers is imprisoned during the Second World War. Founding a radical secret society that will hover on the margins of recorded history for decades to come, these schoolteachers steal radioactive material from a hidden Nazi nuclear reactor and use it to stage a surreal art performance on a frozen coastline. This strange society appears again in the aftermath of Cambodia's murderous Khmer Rouge regime, when another secret performance takes place but goes horrifically wrong. Echoes of this disaster can be heard during the Yugoslavian wars, when an avant-garde puppeteer finds himself trapped inside Belgrade while his brother serves in the genocidal militia that attacks Srebrenica. Decades later, in the war-torn Congo, a disfigured literature professor assembles the largest library in the world even as the country around him collapses. All of these stories are linked by Radar — now a gifted radio operator living in the New Jersey Meadowlands — who struggles with love, a set of hapless parents,and a terrible medical affliction that he has only just begun to comprehend.",
  "genres": [
    "Fiction",
    "Fantasy",
    "Science Fiction",
    "Contemporary",
    "Literary Fiction",
    "Unfinished",
    "Novels"
  ],
  "author": "Reif Larsen",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/22571542-i-am-radar"
}