{
  "title": "Galileo's Middle Finger: Heretics, Activists, and the Search for Justice in Science",
  "description": "Galileo’s Middle Finger is one American’s eye-opening story of life in the trenches of scientific controversy. For two decades, historian Alice Dreger has led a life of extraordinary engagement, combining activist service to victims of unethical medical research with defense of scientists whose work has outraged identity politics activists. With spirit and wit, Dreger offers in Galileo’s Middle Finger an unforgettable vision of the importance of rigorous truth seeking in today’s America, where both the free press and free scholarly inquiry struggle under dire economic and political threats.This illuminating chronicle begins with Dreger’s own research into the treatment of people born intersex (once called hermaphrodites). Realization of the shocking surgical and ethical abuses conducted in the name of “normalizing” intersex children’s gender identities moved Dreger to become an internationally recognized patient rights’ activist. But even as the intersex rights movement succeeded, Dreger began to realize how some fellow progressive activists were employing lies and personal attacks to silence scientists whose data revealed uncomfortable truths about humans. In researching one such case, Dreger suddenly became the target of just these kinds of attacks.Troubled, she decided to try to understand more—to travel the country to ferret out the truth behind various controversies, to obtain a global view of the nature and costs of these battles. Galileo’s Middle Finger describes Dreger’s long and harrowing journeys between the two camps for which she felt equal empathy: social justice activists determined to win and researchers determined to put hard truths before comfort. Ultimately what emerges is a lesson about the intertwining of justice and of truth—and a lesson of the importance of responsible scholars and journalists to our fragile democracy.",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Politics",
    "Philosophy",
    "Biography",
    "Audiobook"
  ],
  "author": "Alice Domurat Dreger",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/22571733-galileo-s-middle-finger"
}