{
  "title": "Shadows of Marrakech",
  "description": "Running a bed and breakfast in Riad Waqi, an old courtyard house in exotic Marrakech, is not the escape it seems for Ramzi, a disillusioned Scottish scientist. He cannot decide who are more exasperating, staff or guests, especially when one of the visitors, Paul Gallisot, a young Frenchman, is murdered in the city. Up for a challenge, Ramzi turns detective and makes his own investigations into the killing, at a time when Morocco prepares for the festival of Eid and the ritual slaughter of sheep in the nation’s homes. Paul Gallisot’s childhood links to North Africa, his enigmatic wife Nicole, and their relationship with Tahar, who is suspected of being involved in the Casablanca terrorist attacks, lead Ramzi down a path as challenging as the labyrinth of the historic medina of Marrakech. As Ramzi makes headway, he meets the unorthodox Dr Rashida, is bewildered by Inspector Haddad, endures the prejudice of Paul’s sister, is confided a mystery by an American, Bob Spasoff, and in his role as hotelier, plays havoc with Riad Waqi’s guests. The search for motive and murderer progresses from a traditional exorcism to a journey across the Atlas to the disturbing Blue Rocks near the ancient oasis of Tafrouate. There comedy turns to tragedy as he tests out his suspicions. As Ramzi uncovers the truth behind Paul Gallisot’s death, he realizes people are unknowable—and that life defies scientific logic.Philip Brebner was born in London, educated in Washington DC and also in England. After studying at the University of Dundee he was awarded a PhD from Glasgow University for his thesis on the ideologies of urban planning in Algeria between 1830 and 1980. Later he lectured at architecture schools in Jeddah and Oporto, before living in Oxford for three years. There, in 'the city of dreaming spires' he wrote his first novel, A Country of Vanished Dreams, which was published by Picador to critical acclaim, and translated. As well as fiction, he has published in academic journals and in the Independent. To keep the wolves from the door, he taught creative writing for the British Council and dealt in rare rugs and textiles in Istanbul. In 2004 he and a colleague were invited to design the master plan for a major tourism project in Morocco - an idea that, sad to say, the government put on ice.Philip Brebner divides his time between Oporto, Portugal, and Morocco's Red City - the inspiration for Shadows of Marrakech. The next novel in the Ramzi series will be Shadows of Essaouira.‘A dauntingly assured new voice.’ - The Sunday Times.",
  "genres": [
    "Fiction"
  ],
  "author": "Philip Brebner",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/22571140-shadows-of-marrakech"
}