{
  "title": "Screw It! : What If You Can Turn It Around And Live The Life You Want On Your Own Terms?",
  "description": "Are you living the life that you want and the way you want it?Are you happy with your life?And…Have you ever looked at your life and you know something is really missing?Do you wake up every morning and you feel that your life can be more interesting and better than what you have now?Have you been failing in the past and you are trying to figure out what you can do to succeed?Has life been unfair to you and you have always thought of what you can do about that?I’ve been there before and I know how it’s like.. Despair, lot of sleepless nights, pains and frustration with the way my life was.Worry no more. You can put an end to all of these. You can start living and living happily and fulfilled again. And it’s not as hard as you think…For a long time, life has been very hard, unfair and hectic for me. I was born with a huge and devastating disadvantage and from my first year on earth, I’ve struggled to live. Adult life too has been an episode of despairs failures and struggles for a living.But I never give up! I won’t accept and manage the “life” life itself is throwing at me. Determination, will power and hope finally pay off for me.Screw It! Covers my entire journey: from a weak, frail and helpless kid to a struggling, unhappy and frustrated young adult to a careless, happy, fulfilled, fun seeking and loving man. It took me lot of years but I’m finally free of living the life that life and it cohort throws at me and living the life I want and on my own terms.I wrote this book and it individual chapters at one point or the other in my adult life when I realized that you and I sometimes never understand the fact and hidden truth that we don’t have to accept the life we have today when we can dictate and decide on the life we want to live on own terms.This book will show you how to re-invent your life, lived more fulfilled and happy, leverage on your failures in life to ride into success, have freedom from all that has been stopping you from living the life you want. In short – this book shows you the way to Screw life and it cohort and live that life you have always wanted.IN THIS BOOK, YOU’LL LEARN HOW:-\tHow To Turn Your Failures In Life To Success-\tWhy You Should Never Be Afraid Of Failing Again-\tImportant Life Lessons That Will Help You Live A Better Life Starting From Today-\tSuccess Lessons To Help You Win More In Life-\tWhat Lessons 3 Idiots Taught Me About Life, Passion and Success and What You Can Learn From That-\tHow I Hack Life, Damn The Norms And Fast Track My Career And Love Life And How You Can Do So-\tWhat 36 Successful Top Online Entrepreneurs And Bloggers Revealed To Me To Be Their Greatest Success Secrets- How I Went From Been A Broke Dude To Making My First $1000 Online When After I Sacked My Boss To Follow My Passion And How You Can Also Make Money To Pay Your Bills Before You Passion Start To Pay Off-\tUseful Blogging And Entrepreneurial Lessons To Help You Succeed With Your Passions-\tRelationship And Love Lessons That Helped Me Overcame My Insanity As A Single Guy-\tHow To Deal With The Pains And Alienation You Might Face Living The Life You Want When People Around You Won’t Understand That What You Are Up ToWhat People Are Saying About The Book“What Mayowa has written is a cross-section of experiences and feelings that may have occurred to him, but what has happened, what is happening right now or what will happen to someone else - whether he/she lives in Nigeria, in India, in France or in Finland..Your task is to go through this book, read about these golden nuggets that he shares and then put the lessons in action, by adapting them to your situation.”Timo Kiander - Founder of ProductiveSuperdad.com and Author of Online Business Productivity“One of my favorite parts was 20 ways to suck in life. His tips for what not to do really struck a chord with meThis book grabs you by the hand and takes you on a journey through his mind so you can learn how to grab life by the horns like Mayowa does.”Lisha Yost – BlogAndRetire.com“I am a firm believer of living my life on my own terms. The older I get the more I live this way... For it is as simple as this - There are no rules: only those that you place upon yourself. .Moreover, how will you do this? You will shout from the mountaintops. ‘SCREW IT!’ Do not wait to be asked. I give you permission. Get on and do what needs to be done.”Peter G. James Sinclair – Author, Blogger, and Entrepreneur and Founder of MotivationalMemo.comIf you are tired of living the life you don’t want right now and you want to live the life you want and live it on your own terms, buy the book now . There is no reason you can start living that life you have always wanted. Learn from this book and get your life on the path of freedom, fun and fulfillment.",
  "genres": [],
  "author": "Mayowa  Ajisafe",
  "average_rating": "3.13",
  "url": "https://www.goodreads.com/book/show/22570633-screw-it"
}