{
  "title": "The Great Leader and the Fighter Pilot: The True Story of the Tyrant Who Created North Korea and The Young Lieutenant Who Stole His Way to Freedom",
  "description": "From the New York Times bestselling author of Escape From Camp 14 , Blaine Harden tells the riveting story of Kim Il Sung's rise to power, and the brave North Korean fighter pilot who escaped the prison state and delivered the first MiG-15 into American handsIn The Great Leader and the Fighter Pilot , New York Times bestselling author Blaine Harden tells the riveting story of how Kim Il Sung grabbed power and plunged his country into war against the United States while the youngest fighter pilot in his air force was playing a high-risk game of deception—and escape.As Kim ascended from Soviet puppet to godlike ruler, No Kum Sok noisily pretended to love his Great Leader. That is, until he swiped a Soviet MiG-15 and delivered it to the Americans, not knowing they were offering a $100,000 bounty for the warplane (the equivalent of nearly one million dollars today). The theft—just weeks after the Korean War ended in July 1953—electrified the world and incited Kim’s bloody vengeance.During the Korean War the United States brutally carpet bombed the North, killing hundreds of thousands of civilians and giving the Kim dynasty, as Harden reveals, the fact-based narrative it would use to this day to sell paranoia and hatred of Americans.Drawing on documents from Chinese and Russian archives about the role of Mao and Stalin in Kim’s shadowy rise, as well as from never-before-released U.S. intelligence and interrogation files, Harden gives us a heart-pounding escape adventure and an entirely new way to understand the world’s longest-lasting totalitarian state.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Military Fiction",
    "Politics",
    "Asia",
    "War"
  ],
  "author": "Blaine Harden",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/22571791-the-great-leader-and-the-fighter-pilot"
}