{
  "title": "In Montmartre: Picasso, Matisse and the Birth of Modernist Art",
  "description": "A lively and deeply researched group biography of the figures who transformed the world of art in bohemian Paris in the first decade of the twentieth centuryIn Montmartre is a colorful history of the birth of Modernist art as it arose from one of the most astonishing collections of artistic talent ever assembled. It begins in October 1900, as a teenage Pablo Picasso, eager for fame and fortune, first makes his way up the hillside of Paris’s famous windmill-topped district. Over the next decade, among the studios, salons, cafés, dance halls, and galleries of Montmartre, the young Spaniard joins the likes of Henri Matisse, André Derain, Maurice de Vlaminck, Georges Braque, Amedeo Modigliani, Constantin Brancusi, Gertrude Stein, and many more, in revolutionizing artistic expression.Sue Roe has blended exceptional scholarship with graceful prose to write this remarkable group portrait of the men and women who profoundly changed the arts of painting, sculpture, dance, music, literature, and fashion. She describes the origins of movements like Fauvism, Cubism, andFuturism, and reconstructs the stories behind immortal paintings by Picasso and Matisse. Relating the colorful lives and complicated relationships of this dramatic bohemian scene, Roe illuminates the excitement of the moment when these bold experiments in artistic representation and performance began to take shape.A thrilling account, In Montmartre captures an extraordinary group on the cusp of fame and immortality. Through their stories, Roe brings to life one of the key moments in the history of art.\nPraise for In Montmartre\n\"Lively and engaging….[Readers] will find a fresh sense of how all these people—the geniuses and the hangers-on, the wealthy collectors and the unworldly painters—related to each other…..In [Roe’s] entertaining, ingeniously structured account Roe brings Montmatre’s hedyday back to life.\" —Sunday Times (London) \"With evocative imagery Roe sketches out the intensely visual spectacle on which Montmatre’s artistic community was able to draw…. Roe is particularly good at communicating the extraordinary devotion of Matisse and Picasso to their work.\" —Financial Times",
  "genres": [
    "Art",
    "History",
    "Nonfiction",
    "Biography",
    "Art History",
    "France",
    "Audiobook"
  ],
  "author": "Sue Roe",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/22571501-in-montmartre"
}