{
  "title": "Phenomenal: A Hesitant Adventurer's Search for Wonder in the Natural World",
  "description": "One woman reclaims her sense of wonder by seeking out the globe’s most incredible natural phenomena Heartfelt and awe inspiring, Leigh Ann Henion’s Phenomenal is a moving tale of physical grandeur and emotional transformation, a journey around the world that ultimately explores the depths of the human heart. A journalist and young mother, Henion combines her own conflicted but joyful experiences as a parent with a panoramic tour of the world’s most extraordinary natural wonders.Phenomenal begins in hardship: with Henion deeply shaken by the birth of her beloved son, shocked at the adversity a young mother faces with a newborn. The lack of sleep, the shrinking social circle, the health difficulties, all collide and force Henion to ask hard questions about our accepted wisdom on parenting and the lives of women.Convinced that the greatest key to happiness—both her own and that of her family—lies in periodically allowing herself to venture into the wider world beyond home, Henion sets out on a global trek to rekindle her sense of wonder. Henion’s quest takes her far afield, but it swiftly teaches her that freedom is its own form of parenting, one that ultimately allows her to meet her son on his own terms: with a visceral understanding of the wonder he experiences every day at the fresh new world. Whether standing on the still-burning volcanoes of Hawai’i or in the fearsome lightning storms of Venezuela, in the vast animal movements of Tanzania or the elegant butterfly migrations of Mexico, Henion reveals in Phenomenal a world of sublimity and revelation. Henion’s spiritual wanderlust puts her in the path of modern-day shamans, reindeer herders, and astrophysicists. She meets laypeople from all over the world, from all walks of life, each going to great lengths to chase migrations, auroras, eclipses, and other phenomena. These seekers trust their instincts, follow their passions, shape their days into the lives they most want to lead. And somewhere along the way, Leigh Ann Henion becomes one of them. A breathtaking memoir, Phenomenal reveals unforgettable truths about motherhood, spirituality, and the beauty of nature.",
  "genres": [
    "Memoir",
    "Travel",
    "Nonfiction",
    "Nature",
    "Adventure",
    "Biography Memoir",
    "Outdoors"
  ],
  "author": "Leigh Ann Henion",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/22571538-phenomenal"
}