{
  "title": "The Happiness Equation: Want Nothing + Do Anything = Have Everything",
  "description": "The #1 international bestseller from the author of  The Book of Awesome  that “reveals how all of us can live happier lives” (Gretchen Rubin). What is the formula for a happy life? Neil Pasricha is a Harvard MBA, a  New York Times –bestselling author, a Walmart executive, a father, a husband. After selling more than a million copies of the  Book of Awesome  series, wherein he observed the everyday things he thought were awesome, he now shifts his focus to the practicalities of living an awesome life.In his new book  The Happiness Equation , Pasricha illustrates how to want nothing and do anything in order to have everything. If that sounds like a contradiction in terms, you simply have yet to unlock the 9 Secrets to Happiness. Each secret takes a piece out of the core of common sense, turns it on its head to present it in a completely new light, and then provides practical and specific guidelines for how to apply this new outlook to lead a fulfilling life.Once you've unlocked Pasricha’s 9 Secrets, you will understand counter intuitive concepts such as: Success Does Not Lead to Happiness, Never Take Advice, and Retirement Is a Broken Theory. You will learn and then master three brand-new fundamental life tests: the Saturday Morning Test, The Bench Test, and the Five People Test. You will know the difference between external goals and internal goals and how to make more money than a Harvard MBA (hint: it has nothing to do with your annual salary). You will discover that true wealth has nothing to do with money, multitasking is a myth, and the elimination of options leads to more choice.The Happiness Equation  is a book that will change how you think about pretty much everything—your time, your career, your relationships, your family, and, ultimately, of course, your happiness.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Psychology",
    "Personal Development",
    "Productivity",
    "Audiobook",
    "Philosophy"
  ],
  "author": "Neil Pasricha",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/22571656-the-happiness-equation"
}