{
  "title": "Live Right and Find Happiness (Although Beer is Much Faster): Life Lessons and Other Ravings from Dave Barry",
  "description": "During the course of living (mumble, mumble) years, Dave Barry has learned much of wisdom,* (*actual wisdom not guaranteed) and he is eager to pass it on—to the next generation, the generation after that, and to those idiots who make driving to the grocery store in Florida a death-defying experience.In brilliant, brand-new, never-before-published pieces, Dave passes on home truths to his new grandson and to his daughter Sophie, who will be getting her learner’s permit in 2015 (“So you’re about to start driving! How exciting! I’m going to kill myself”). He explores the hometown of his youth, where the grown-ups were supposed to be uptight fifties conformists, but seemed to have a lot of un- Mad Men- like fun, unlike Dave’s own Baby Boomer generation, which was supposed to be wild and crazy, but somehow turned into neurotic hover-parents. He dives into everything from the inanity of cable news and the benefits of Google Glass (“You will look like a douchebag”) to the loneliness of high school nerds (“You will never hear a high school girl say about a boy, in a dreamy voice, ‘He’s so sarcastic!’”), from the perils of home repair to firsthand accounts of the soccer craziness of Brazil and the just plain crazy craziness of Vladimir Putin’s Russia (“He stares at the camera with the expression of a man who relaxes by strangling small furry animals”), and a lot more besides.    By the end, if you do not feel wiser, richer in knowledge, more attuned to the universe . . . we wouldn’t be at all surprised. But you’ll have had a lot to laugh about!",
  "genres": [
    "Humor",
    "Nonfiction",
    "Essays",
    "Audiobook",
    "Comedy",
    "Memoir",
    "Biography Memoir"
  ],
  "author": "Dave Barry",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/22571790-live-right-and-find-happiness-although-beer-is-much-faster"
}