{
  "title": "Our Man in Charleston: Britain's Secret Agent in the Civil War South",
  "description": "Between the Confederacy and recognition by Great Britain stood one unlikely Englishman who hated the slave trade. His actions helped determine the fate of a nation.As the United States threatened to break into civil war, the Southern states found themselves in an impossible position: Their economic survival would require reopening the slave trade, banned in America since 1807, but the future of the Confederacy could not be secured without official recognition from Great Britain, which would never countenance such a move. How, then, could the first be achieved without dooming the possibility of the second? Believing their cotton monopoly would provide sufficient leverage, the Southerners publically declared the slave trade dead, even as rapacious traders quickly landed more and more ships on the American coast.The unlikely man at the roiling center of this intrigue was Robert Bunch, the ambitious young British consul in Charleston, S.C. As he soured on the self-righteousness of his slave-loving neighbors, Bunch used his unique perch to thwart their plans, sending reams of damning dispatches to the Foreign Office in London and eventually becoming the Crown's best secret source on the Confederacy—even as he convinced those neighbors that he was one of them.In this masterfully told story, Christopher Dickey introduces Consul Bunch as a key figure in the pitched battle between those who wished to reopen the floodgates of bondage and misery, and those who wished to dam the tide forever. Featuring a remarkable cast of diplomats, journalists, senators, and spies, Our Man in Charleston captures the intricate, intense relationship between great powers as one stood on the brink of warFrom the Hardcover edition.",
  "genres": [
    "History",
    "Nonfiction",
    "Civil War",
    "Biography",
    "American History",
    "War",
    "Espionage"
  ],
  "author": "Christopher Dickey",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/22570708-our-man-in-charleston"
}