{
  "title": "Believer: My Forty Years in Politics",
  "description": "New York Times Book Review“A stout defense--indeed, the best I have read--of the Obama years.\"A New York Times  BestsellerDavid Axelrod has always been a believer. Whether as a young journalist investigating city corruption, a campaign consultant guiding underdog candidates against entrenched orthodoxy, or as senior adviser to the president during one of the worst crises in American history, Axelrod held fast to his faith in the power of stories to unite diverse communities and ignite transformative political change. Now this legendary strategist, the mastermind behind Barack Obama’s historic election campaigns, shares a wealth of stories from his forty-year journey through the inner workings of American democracy. Believer is the tale of a political life well lived, of a man who never gave up on the deepest promises our country has to offer.Believer reveals the roots of Axelrod’s devotion to politics and his faith in democratic change. As a child of the ’60s in New York City, Axelrod worked his first campaigns during a tumultuous decade that began with soaring optimism and ended in violence and chaos. As a young newspaperman in Chicago during the 1970s and ’80s, Axelrod witnessed another world transformed when he reported on the dissolution of the last of the big city political machines—Richard Daley, Dan Rostenkowski, and Harold Washington—along with the emergence of a dynamic black independent movement that ultimately made Obama’s ascent possible.After cutting his teeth in the rollicking world of Chicago journalism, Axelrod switched careers to become a political strategist. His unorthodox tactics during his first campaign helped him get Paul Simon unexpectedly elected to the Senate, and soon Axelrod’s counsel was sought by the greatest lights of the Democratic Party. Working for path breakers like Hillary Clinton, Deval Patrick, and Rahm Emanuel—and morally conflicted characters like Rod Blagojevich and John Edwards—Axelrod, for better and worse, redefined the techniques by which modern political campaigns are run.The heart of Believer is Axelrod’s twenty-year friendship with Barack Obama, a warm partnership that inspired both men even as it propelled each to great heights. Taking a chance on an unlikely candidate for the U.S. Senate, Axelrod ultimately collaborated closely with Obama on his political campaigns, and served as the invaluable strategist who contributed to the tremendous victories of 2008 and 2012. Switching careers again, Axelrod served as senior adviser to the president during one of the most challenging periods in national working at Obama’s side as he battled an economic disaster; navigated America through two wars; and fought to reform health care, the financial sector, and our gridlocked political institutions. In Believer , Axelrod offers a deeper and richer profile of this extraordinary figure—who in just four years vaulted from the Illinois State Senate to the Oval Office—from the perspective of one who was at his side every step of the way.Spanning forty years that include corruption and transformation, turmoil and progress, Believer takes readers behind the closed doors of politics even as it offers a thrilling call to democratic action. Axelrod’s Believer is a powerful and inspiring memoir enlivened by the charm and candor of one of the greatest political strategists in recent American history. DORIS KEARNS GOODWIN, author of  The Bully Pulpit  and  Team of Rivals“Beautifully written with warmth, humor, and remarkable self-awareness,  Believer  is one of the finest political memoirs I have ever read.”",
  "genres": [
    "Politics",
    "Nonfiction",
    "Memoir",
    "Biography",
    "History",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "David Axelrod",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/22571634-believer"
}