{
  "title": "The Collected Stories of Philip K. Dick 2: We Can Remember it for You Wholesale",
  "description": "Many thousands of readers consider Philip K. Dick the greatest science fiction mind on any planet. Since his untimely death in 1982, interest in Dick's works has continued to mount and his reputation has been further enhanced by a growing body of critical attention. The Philip K. Dick Award is now given annually to a distinguished work of science fiction, and the Philip K. Dick Society is devoted to the study and promulgation of his works. This collection includes all of the writer's earliest short and medium-length fiction (including some previously unpublished stories) covering the years 1953-1955\"A useful acquisition for any serious SF library or collection.\" -- Kirkus Reviews\"The collected stories of Philip K. Dick is awe inspiring.\" -- The Washington Post\"More than anyone else in the field, Mr. Dick really puts you inside people's minds.\" -- Wall Street Journal\nVolume 2/5. Contents:\n\n- The Cookie Lady- Beyond the Door- Prominent Author- We Can Remember it for You Wholesale- Jon's World- The Cosmic Poachers- Progeny- Some Kinds of Life- Martians Come in Clouds- The Commuter- The World She Wanted- A Surface Raid- Project: Earth- The Trouble with Bubbles- Breakfast at Twilight- A Present for Pat- The Hood Maker- Of Withered Apples- Human Is- Adjustment Team- The Impossible Planet- Imposter- James P. Crow- Planet for Transients- Small Town- Souvenir- Survey Team.\nOther editions of this volume are titled:- We Can Remember it for You Wholesale and Other Classic Stories [by Citadel],- Second Variety,- Adjustment TeamEditions published by Citadel include \"We can remember...\" instead of \"Second Variety\" into Volume 2.",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fiction",
    "Fantasy",
    "Science Fiction Fantasy",
    "American",
    "Short Story Collection"
  ],
  "author": "Philip K. Dick",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/22581.The_Collected_Stories_of_Philip_K_Dick_2"
}