{
  "title": "On My Own Two Feet: The Journey from Losing My Legs to Learning the Dance of Life",
  "description": "Amy Purdy, who inspired a nation on Dancing with the Stars and has been called a hero by Oprah Winfrey, reveals the intimate details of her triumphant comeback from the brink of death to making history as a Paralympic snowboarder.In this poignant and uplifting memoir, Dancing With the Stars sensation Amy Purdy reveals the story of how losing her legs led her to find a spiritual path. When the Las Vegas native was just nineteen, she contracted bacterial meningitis and was given less than a two percent chance of survival. In a near-death experience, she saw three figures who told her: “You can come with us, or you can stay. No matter what happens in your life, it’s all going to make sense in the end.” In that moment, Amy chose to live.Her glimpse of the afterlife—coupled with a mysterious premonition she’d had a month before —became the defining experiences that put Amy’s life on a new trajectory after her legs had to be amputated. She wouldn’t just beat meningitis and walk again; she would go on to create a life filled with bold adventures, big dreams, and boundless vitality—and share that spirit with the world. In 2014, Amy—the only competitor, male or female, with two prosthetic legs—claimed a bronze medal for the U.S. Paralympic team in adaptive snowboarding. She then became a contestant on season eighteen of Dancing With the Stars, and viewers were captivated as the girl with bionic legs managed to out-dance her competitors all the way to the finale.Amy’s journey is a testament to the resilience of the human spirit and the capacity we all have to dream bigger, defy expectations, and rewrite our stories. Amy was given a second chance for a reason—to use her life to inspire others. Her powerful memoir urges us to live life to the fullest, because we are all a lot more capable than we could ever imagine.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Inspirational",
    "Sports",
    "Autobiography",
    "Disability"
  ],
  "author": "Amy Purdy",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/22573888-on-my-own-two-feet"
}