{
  "title": "American Ghost: A Family's Haunted Past in the Desert Southwest",
  "description": "The award-winning journalist and author of The Beekeeper's Lament attempts to discover the truth about her great-great-grandmother, Julia--whose ghost is said to haunt an elegant hotel in Santa Fe--in this spellbinding exploration of myth, family history, and the American West.The dark-eyed woman in the long black gown was first seen in the 1970s, standing near a fireplace. She was sad and translucent, present and absent at once. Strange things began to happen in the Santa Fe hotel where she was seen. Gas fireplaces turned off and on without anyone touching a switch. Vases of flowers appeared in new locations. Glasses flew off shelves. And in one second-floor suite with a canopy bed and arched windows looking out to the mountains, guests reported alarming events: blankets ripped off while they slept, the room temperature plummeting, disembodied breathing, dancing balls of light.La Posada--\"place of rest\"--had been a grand Santa Fe home before it was converted to a hotel. The room with the canopy bed had belonged to Julia Schuster Staab, the wife of the home's original owner. She died in 1896, nearly a century before the hauntings were first reported. In American Ghost, Hannah Nordhaus traces the life, death, and unsettled afterlife of her great-great-grandmother Julia, from her childhood in Germany to her years in the American West with her Jewish merchant husband.American Ghost is a story of pioneer women and immigrants, ghost hunters and psychics, frontier fortitude and mental illness, imagination and lore. As she traces the strands of Julia's life, Nordhaus uncovers a larger tale of how a true-life story becomes a ghost story--and how difficult it is to separate history and myth.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Memoir",
    "Paranormal",
    "Ghosts",
    "Historical"
  ],
  "author": "Hannah Nordhaus",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/22573854-american-ghost"
}