{
  "title": "Road of No Return: Hounds of Valhalla MC",
  "description": "When a closeted biker collides with a seductive tattoo artist, their desires spark a dangerous game of forbidden love, secrecy, and absolute mayhem. Zak. Tattoo artist. Independent. Doesn’t do relationships. Stitch. Outlaw biker. Deep in the closet. Doesn’t share his property. On the day of Stitch’s divorce, lust personified enters the biker bar he’s celebrating at. Tattooed all over, confident, and hot as hellfire, Zak is the bone Stitch has waited for life to throw him. All Stitch wants is a sniff, a taste, a lick. Instead, he gorges himself on the handsome stranger, and nothing will ever be the same. Forced to hide his new love affair from the world, Stitch juggles family, club life, and crime, but it’s only a matter of time until it becomes impossible.Zak moves to Lake Valley in search of peace and quiet, but when he puts his hand into the jaws of a Hound of Valhalla, life gets all but simple. In order to be with Stitch, Zak’s biker wet dream, he has to crawl right back into the closet. As heated as their relationship is, the secrets, the hiding, the violence, jealousy, and conservative attitudes in the town rub Zak in all the wrong ways. When gang violence gets so close Zak can no longer pretend his man is innocent, he needs to decide whether life with an outlaw biker is really what he wants.*Brace yourself for a wild ride of passion, secrecy, and a clash of two worlds in this gritty tale of forbidden romance set in the world of Outlaw Motorcycle Clubs.POSSIBLE SPOILERS:Themes: Outlaw Motorcycle Club, organized crime, homophobia, family issues, coming out, first gay relationship, tattoo, piercing, fish out of waterGenre: M/M dark romanceLength: ~ 100,000 words (Standalone novel, no cliffhanger.)WARNING Sensitive content: a gritty storyline, explicit language, violence and torture",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Dark",
    "Erotica",
    "Abuse",
    "Gay"
  ],
  "author": "K.A. Merikan",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/22573348-road-of-no-return"
}