{
  "title": "The Oxford History of Poland-Lithuania Volume I: The Making of the Polish-Lithuanian Union, 1385-1569",
  "description": "The history of eastern European is dominated by the story of the rise of the Russian empire, yet Russia only emerged as a major power after 1700. For 300 years the greatest power in Eastern Europe was the union between the kingdom of Poland and the grand duchy of Lithuania, one of the longest-lasting political unions in European history. Yet because it ended in the late-eighteenth century in what are misleadingly termed the Partitions of Poland, it barely features in standard accounts of European history.The Making of the Polish-Lithuanian Union 1385-1569 tells the story of the formation of a consensual, decentralised, multinational, and religiously plural state built from below as much as above, that was founded by peaceful negotiation, not war and conquest. From its inception in 1385-6, a vision of political union was developed that proved attractive to Poles, Lithuanians, Ruthenians, and Germans, a union which was extended to include Prussia in the 1450s and Livonia in the 1560s. Despite the often bitter disagreements over the nature of the union, these were nevertheless overcome by a republican vision of a union of peoples in one political community of citizens under an elected monarch. Robert Frost challenges interpretations of the union informed by the idea that the emergence of the sovereign nation state represents the essence of political modernity, and presents the Polish-Lithuanian union as a case study of a composite state.The modern history of Poland, Lithuania, Ukraine, and Belarus cannot be understood without an understanding of the legacy of the Polish-Lithuanian union. This volume is the first detailed study of the making of that union ever published in English.",
  "genres": [
    "History",
    "Poland",
    "Nonfiction",
    "European History",
    "Polish Literature"
  ],
  "author": "Robert I. Frost",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/22574249-the-oxford-history-of-poland-lithuania-volume-i"
}