{
  "title": "The Early Asimov: Volume 1",
  "description": "In the late 1930s a new young talent began to make his mark on the science fiction scene with a succession of outstanding stories in the various SF magazines of the time. His name: Isaac Asimov. He was later to become world-renowned as the author of such classics of modern science fiction as the epic FOUNDATION trilogy and the robot stories in which he formulated the now famous Three Laws of Robotics.THE EARLY ASIMOV (published in three volumes in Panther Science Fiction) is an unsurpassed showcase of the story-telling brilliance of the young Asimov. Each story is prefaced by Dr. Asimov with fascinating biographical detail of how and when he came to write it as well as his own critical evaluation of it. The result is a doubly rich science fiction treat: a collection of tales that makes engrossing entertainment in its own right and, in addition, gives the reader a first-hand look at the development of the twentieth century's undisputed Grand Master of science fiction.Contents 9 • Introduction (The Early Asimov Volume 1) • (1973) • essay by Isaac Asimov 18 • The Callistan Menace • (1940) • short story by Isaac Asimov 36 • Ring Around the Sun • (1940) • short story by Isaac Asimov 51 • The Magnificent Possession • (1940) • short story by Isaac Asimov 68 • Trends • (1939) • short story by Isaac Asimov 89 • The Weapon Too Dreadful to Use • (1939) • short story by Isaac Asimov 107 • Black Friar of the Flame • (1942) • novelette by Isaac Asimov 152 • Half-Breed • [Half-Breed • 1] • (1940) • novelette by Isaac Asimov 175 • The Secret Sense • (1941) • short story by Isaac Asimov 187 • Appendix -- The Sixty Stories of the Campbell Years • (1973) • essay by uncredited",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fiction",
    "Collections",
    "Anthologies",
    "Science Fiction Fantasy",
    "Speculative Fiction"
  ],
  "author": "Isaac Asimov",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/1133207.The_Early_Asimov"
}