{
  "title": "Prayers for the Assassin",
  "description": "SEATTLE, 2040. The Space Needle lies crumpled. Veiled women hurry through the busy streets. Alcohol is outlawed, replaced by Jihad Cola, and mosques dot the skyline. New York and Washington, D.C., are nuclear wastelands. Phoenix is abandoned, Chicago the site of a civil war battle. At the edges of the empire, Islamic and Christian forces fight for control of a very different United States.Enormous in scope and brilliantly imagined, Prayers for the Assassin promises to be the powerhouse read of the year. Burning with cinematic violence, fiendish betrayal, and global intrigue, Robert Ferrigno's sensational thriller asks: What would happen to America if the terrorists won?After simultaneous suitcase-nuke attacks destroy New York, Washington, D.C., and Mecca—attacks blamed on Israel—a civil war breaks out. An uneasy truce leaves the nation divided between an Islamic republic with its capital in Seattle, and the Christian Bible Belt in the old South. In this frightening future there are still Super Bowls and Academy Awards, but calls to Muslim prayer echo in the streets and terror is everywhere. Freedom is controlled by the state, paranoia rules, and rebels plot to regain free will...One of the most courageous is the beautiful young historian Sarah Dougan, who uncovers shocking evidence that the nuclear attacks might not have been planned by Israel, evidence that, if true, will destabilize the nation. When Sarah suddenly goes missing, the security chief of the Islamic republic calls upon Rakkim Epps, her secret lover and a former elite warrior, to find her—no matter what the risk.But as Rakkim searches for Sarah, he is tracked by Darwin, a brilliant psychopathic killer trained in the same secretive unit as Rakkim. To survive, Rakkim must become Darwin's assassin—a most forbidding challenge. A bloody, nerve-racking chase takes them through the looking-glass world of the Islamic States of America, and culminates dramatically as Rakkim and Sarah battle to expose the truth to the entire world.Can the couple outrun Darwin? Who is really behind the nuke attacks? Will Sarah and Rakkim stay alive long enough to deliver the truth? Does a nation divided have a prayer?Robert Ferrigno's Prayers for the Assassin shows the novelist at the height of his powers, and delivers a masterful, unforgettable read.",
  "genres": [
    "Fiction",
    "Thriller",
    "Science Fiction",
    "Alternate History",
    "Dystopia",
    "Action",
    "Mystery"
  ],
  "author": "Robert Ferrigno",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/22576.Prayers_for_the_Assassin"
}