{
  "title": "Seducing Allie",
  "description": "He's going to show this wedding crasher just how dirty the outdoors can be.Seattle Steam, Book 3Allison Siegel is out to stop a wedding. With one of her best childhood friends about to marry a gold-digger, who wouldn't at least try to stage an intervention? Apparently, her other childhood bestie, Clint.The minute Allie grew out of her sneakers and into her curves, Clint's hormones went ballistic. But she had eyes only for Ken, so Clint made himself scarce, even after the relationship fizzled. Now she's back, looking better than ever--and hell-bent on sabotaging Ken's wedding. So Clint knows he needs to do whatever it takes to head her off at the pass.Kidnapped! Allison can't believe it. Now she's stuck in the Montana backwoods fending off nature's friends, and fighting a losing battle to resist Clint--the sexiest forest ranger on the planet.Clint has big plans for Allie. Not only will he convince a city girl that she needs to embrace her inner nature freak, but he's going to prove there's sparks flying in more places than just the campfire. This book contains a city girl out of her element, a forest ranger determined to keep her there, and a campfire seduction hot enough to melt more than just marshmallows.Excerpt. © Reprinted by permission. All rights reserved.\"This is ridiculous!\" She stared out at the blur of trees as they sped down a deserted road. \"Where are we going?\"\"Away,\" he answered ambiguously.\"Away,\" she mimicked him. \"We're going away? What the hell kind of answer is that?\"\"The only answer you're getting right now. And watch your mouth. I know your mom taught you better.\"\"Didn't your mom teach you that kidnapping is a felony?\" she shot back and slapped the window again.\"If you break my window it's going to seriously piss me off, Allie.\"\"Well, guess what? I'm already pissed.\" Slap. Her hand connected with the glass again and again. \"Maybe you should have taken that into account when you abducted me, Clint.\"She nearly fell out of her seat as he swerved the car to the side of the road.Was he going to let her go? Leave her stuck on some random back road? Hell, she didn't care, she'd hike her way back to her car if she had to.He climbed out of the vehicle and came around her side, wrenching open the door.\"Get out.\"Relief flooded through her. He was letting her go. Finally. She scooted out the door, making the jump down to the ground and smoothing her dress back down her thighs.\"Well, it's about time you came to your senses--oh!\"He jerked her hard against him, both of her wrists in one of his massive hands.\"Maybe I didn't make myself clear,\" he murmured, his gaze full of determination and something else...something hot. Something that sent a jolt of heat straight from her stomach to between her legs.Her pulse quickened and she dragged in a shuddering breath, tugging at her hands.\"Have you gone completely insane?\" she whispered.\"Maybe.\" His lips twisted, his gaze roving over her face. \"Or maybe I'm just willing to go to any lengths to make sure you don't break up Kenneth's wedding.\"\"I'm not...\" She ran her tongue over her suddenly dry lips.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Erotica",
    "Friends To Lovers",
    "M F Romance",
    "Adult"
  ],
  "author": "Shelli Stevens",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/11331914-seducing-allie"
}