{
  "title": "Iodine",
  "description": "Haven Kimmel, the #1 New York Times bestselling author, has long attracted legions of fans for her insightful, humane portraits of outsiders struggling to find their place in the world. In Iodine, her fourth novel, Kimmel once again draws on her exceptional powers of observation and empathy, but this time she makes an exhilarating foray into psychological gothic territory with the electrifying story of a young woman emerging from layers of delusion, fantasy, and lies. With her astounding intelligence, fierce independence, and otherworldly lavender eyes, college senior Trace Pennington makes an indelible impression even as questions about her past and her true identity hover over every page. From her earliest years, Trace turned away from her abusive mother toward her loving father. Within the twisty logic of abuse, her desperate love for him took on a romantic cast that persists to this day, though she's had no contact with her family since she ran away from home years ago. Alone but for her beloved dog, she's eked out an impoverished but functional existence, living in an abandoned house, putting herself through college, and astonishing her teachers with her genius and erudition. What they don't know is that she leads a double life: thanks to forged documents, at school she is Ianthe Covington, a young woman with no past.Trace's singular life is upended when she and her literature professor fall in love. She tells him nothing about her life, and as it becomes apparent that he has his own dark secrets, she's forced to face herself and her past. After recovering a horrific, long-suppressed memory, Trace finally copes with the fallout from her brutal, bizarre childhood. Kimmel parcels out Trace's strange, dark story in mesmerizing bits that obscure as much as they reveal, and keep the reader guessing until the end.With Kimmel's radiant imagination, lyrical prose, and vision of a bleak and fertile Midwest on full display, Iodine is a frightening and marvelous tale of life at the outer extremes of human experience. This unique portrait of the psychological effects of trauma is tantalizing, shocking, and ultimately hopeful.",
  "genres": [
    "Fiction",
    "Mental Illness",
    "Adult Fiction",
    "Contemporary",
    "Academia",
    "Book Club",
    "Mental Health"
  ],
  "author": "Haven Kimmel",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/2258390.Iodine"
}