{
  "title": "The Exposed Saga",
  "description": "The Exposed Saga  Part One  Harvard student, Sadie Lockwood, was given a second chance and she's determined to make it count. She planned her life out with precision and she refuses to be deterred from her course. She knows what she wants and that is to honor the person who lost their life to save hers.  When Hunter Reynolds steps into Sadie's world, she is knocked off of her axis. He's bold, charismatic and intense. She's committed to not let him lead her off her prearranged path but he's persuasive and a little fun never hurt anyone, right?  As Sadie sets out on a journey to pull back the layers of Hunter's emotional façade, she begins to question the very heart that beats within her. Will shedding her own inhibitions help Sadie to accept the man she craves or will everything change once all is exposed?  Part Two  Hunter was everything Sadie always wanted. He was powerful, dominant, gorgeous and, most of all, he wanted her exactly as she was. When she threw caution to the wind and jumped into his bed, she believed that her life was finally beginning. She was ready to start living and he was the one person she knew she could trust with her heart.  That was until she found out that Hunter had owned her heart all along. When his past comes back to overturn Sadie's present in a way she never could have predicted, what will be left of the two of them?  As Sadie struggles with embracing the truth, she's struck with a reality that makes her breathless. First loves, new loves and an unthinkable future leave Sadie reeling. Is her heart strong enough to accept the unavoidable truth?  Part Three  Hunter changed Sadie's entire life. After discovering his connection to her past, she was ready to let go and embrace her new life. That one fateful night in Manhattan changed it all. After seeing Hunter for who he really is, Sadie must face painful truths about his past and their present.  Her heart is pushing her in one direction. Her mind is pulling her towards a different path. Will Hunter's eventual confession change everything?  As Sadie tries to accept who Hunter really is, she's forced to confront realities she never knew existed. She believes she's ready for it all, but is her heart strong enough?  More Exposed - Part Four  Sadie Lockwood thought she had the perfect life. She loved Hunter Reynolds, she was studying to be a doctor, and her entire future was planned out. Everything was going her way.  It all shattered when Hunter's past collided with their future. The one secret he kept from her barreled back into their lives, crushing everything in its path. It shattered all they held dear and it threatened them both in ways they never imagined it would.  Hunter was everything she ever wanted. He told her he couldn't breathe without her. What happens when her very breath is stolen because of that love?",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "New Adult",
    "Anthologies",
    "Fiction",
    "Erotica",
    "Contemporary"
  ],
  "author": "Deborah Bladon",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/22585116-the-exposed-saga"
}