{
  "title": "For the Love of Her Dragon",
  "description": "Book 4 in the Dragon Guard series. The books can be read as stand-alone stories, but it is advisable to read them in order to get the most enjoyment from the series.  Kyra St. Croix is a strong, feisty, independent woman who is not afraid to speak her mind. An incredibly powerful white witch born of the High Priestess and a human father, she hasn’t let a little thing like lack of height stop her from having the life she knows she deserves. Early on she learned to use all she was given to achieve her goals and twenty-five years ago, turned her back on her birthright hoping that one day Destiny would bring her the love she was promised. Her belief that she will doing anything for that love is stretched to the breaking point when the One she waited for will not accept who she is and can only see what she is. Now,the Hope she has always clung to may be Kyra’s worst enemy.  There Are No Coincidences…  Royce O'Reilly is the oldest and most respected member of the MacLendon Force. Since joining the Golden Fire Clan, he has been proud to watch all whom he calls brethren become fierce warriors, ever faithful to eradicating those that would destroy all they hold dear. His life has been dedicated to the training and guidance of the younger Guardsmen, one of his proudest accomplishments. One hundred and fifty-six years of life have given him immeasurable joy and now that three of his brethren have found and mated the One the Universe made for them, hope has been restored not only to the honorable Guardsman but also to dragon kin. Unfortunately, Royce is learning that Hope can be fickle and the Universe has a sick sense of humor, especially when they have made his Destiny in the form of a five-foot two-inch bundle of powerful Earth witch named Kyra St. Croix.  The Universe Does Not Make Mistakes…  Two souls…destined for a Great Love decreed by Fate. But Fate has Her hands full with this couple and if that wasn’t enough, the traitor has an army ready to destroy all they both hold dear. Can Royce forget the past and believe in the future? Can Kyra forgive a betrayal that cuts deep and believe Love will always find a way? Can they defeat an evil with no conscience, only the desire for vengeance? The Universe, the Goddess and Fate have their work cut out for them if Kyra is to know the love of her dragon.  Fate Will Not Be Denied…",
  "genres": [
    "Paranormal",
    "Dragons",
    "Paranormal Romance",
    "Romance",
    "Fantasy",
    "Shapeshifters",
    "Witches"
  ],
  "author": "Julia Mills",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/22585248-for-the-love-of-her-dragon"
}