{
  "title": "Needing Moore Series Boxed Set",
  "description": "THE NEEDING MOORE SERIES – SEARCHING FOR MOORE, MOORE TO LOSE & MOORE THAN FOREVER + Bonus Chapters!  All three Bestselling, Top-Rated Books from The Needing Moore Series by USA Today Bestseller Julie A. Richman, PLUS never before seen BONUS CHAPTERS for each book. “I have read well over 125 books since I received my kindle last February (2013). That being said, this first book in this series is the BEST book I have read. I am so sorry to say but it has to be said that E L James, Sylvia Day, etc. have nothing on Julie Richman.” “I loved this story. I could not put it down. Every girl wants a man like Schooner.” “Did I mention how insanely HOT these two are together? Scorching, fanning myself, hot!!” “I think this is one of the best series out there, Hookers! It is an amazing story, it is full of emotion, and it is real. The relationships are complex and the characters are unpredictable. Julie will wring you out emotionally and leave you craving Moore!” “I just finished this book and my heart is pounding! I too am a Facebook friend request away from a past love. This book has you hooked from the first pages! I cried, I laughed and I cheered! Such real characters and a love story that every girl dreams of having.” “OMG need \"moore\" Schooner now!!!!!! … I cannot get enough of this story. Every once in a while a book or series comes out that has me salivating at every word and this fits that bill to the tee!” “This is just writing at its best. It's so witty and the characters are so well written. I could not put this book down!” “This series is awesome. It just sucks you in and doesn't let you go.”  SEARCHING FOR MOORE – Book 1 I lost the love of my life when she disappeared without even a goodbye. It was the 80’s – there was no internet, no Google, no cell phones. If you wanted to disappear, you could. And she did. She crushed my soul. A friend just told me he saw her on Facebook. And now I’m a keystroke away from asking her the question that’s haunted me for two decades. “Why did you leave me?”  Two decades after she broke his heart, sexy entrepreneur Schooner Moore uncovers the truth and betrayal his life has been built on when he Facebook friend requests college love, Mia Silver. Determined to win Mia’s love once again, Schooner embarks on a life-altering journey that could cost him everything.  MOORE TO LOSE – Book 2 Continuing the fight for their happily ever after that began in Searching for Moore, Schooner Moore and Mia Silver struggle to overcome the ghosts and baggage they accumulated during their time apart. Exploring the missing 24 years when they were separated, Moore to Lose follows Mia's journey from heartbroken teen to kickass businesswoman to her emotional reunion with Schooner and the exploration of the love that was ripped from them. But is their love really strong enough to overcome the damage of those missing 24 years or will they continue to be ripped apart by pasts that can't be changed?  MOORE THAN FOREVER – Book 3 Is the love they always dreamed of enough?  Continuing the emotional journey of love and betrayal that began on a college campus in Searching for Moore and turned their worlds upside down in Moore to Lose, handsome, California entrepreneur Schooner Moore and sharp and sassy, New York advertising agency owner Mia Silver continue to be confronted with the harsh reality of the remnants from the lives they lived apart for 24 years.",
  "genres": [
    "Romance",
    "Second Chance",
    "Contemporary",
    "Contemporary Romance",
    "Anthologies",
    "Adult",
    "College"
  ],
  "author": "Julie A. Richman",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/22585300-needing-moore-series-boxed-set"
}