{
  "title": "Teresa of Avila: The Progress of a Soul",
  "description": "A refreshingly modern reconsideration of Saint Teresa (1515-1582), one of the greatest mystics and reformers to emerge within the sixteenth-century Catholic Church, whose writings are a keystone of modern mystical thought.From the very beginning of her life in a convent, following the death of her mother and the marriage of her older sister, it was clear that Teresa's expansive nature, intensity, and energy would not be easily confined. Cathleen Medwick shows us a powerful daughter of the Church and her times who was a very human mass of a practical and no-nonsense manager, and yet a flamboyant and intrepid presence who bent the rules of monastic life to accomplish her work--while managing to stay one step ahead of the Inquisition. And she exhibited a very personal brand of spirituality, often experiencing raptures of an unorthodox, arguably erotic, nature that left her frozen in one position for hours, unable to speak. Out of a concern for her soul and her reputation, her superiors insisted that she account for every voice and vision, as well as the sins that might have engendered them, thus giving us the account of her life that is now considered a literary masterpiece.Medwick makes it clear that Teresa considered her major work the reform of the Carmelites, an enterprise requiring all her considerable persuasiveness and her talent for administration. We see her moving about Spain with the assurance (if not the authority) of a man, in spite of debilitating illness, to establish communities of nuns who lived scrupulously devout lives, without luxuries. In an era when women were seldom taken seriously, she even sought and received permission to found two religious houses for men.        In this fascinating account Cathleen Medwick reveals Teresa as both more complex and more comprehensible than she has seemed in the past. She illuminates for us the devout and worldly woman behind the centuries-old iconography of the saint.",
  "genres": [
    "Biography",
    "Religion",
    "Nonfiction",
    "History",
    "Catholic",
    "Spirituality",
    "Christianity"
  ],
  "author": "Cathleen Medwick",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/225861.Teresa_of_Avila"
}