{
  "title": "A Constant Longing - Memoirs of a Palestinian Woman",
  "description": "A Constant Longing - Memoirs of a Palestinian Woman / with a Foreword by Prof. Rita Süssmuth (Bundestagspräsidentin a.D.) Thomas BeVier, Foresight - Memoir, Foreword Review Fall/Winter issue: \"If a movie were made of Halima Alaiyan’s dramatic life of dislocation, disappointment, and transformation, it would challenge credulity. In 1948, when she was barely a year old, her village, Ibdis in Palestine, was destroyed by Israeli soldiers. With that, she began a life in exile. First she was shuttled to Egypt, then to Saudi Arabia, and finally to Germany, where, after escaping her abusive husband and their arranged marriage, she became an orthopaedic specialist. Overcoming the harsher aspects for women of Muslim custom, the barriers of language, and family strife would be story enough, but even more remarkable has been Alaiyan’s ability to understand and set aside her prejudice of Jews and to gain international recognition for encouraging dialogue between young people in Europe, Israel, and Palestine. She does this through the Talat Alaiyan Foundation, named after a son who died. After visiting a German concentration camp, she understands “why the Jews were so obsessed with having their own secure homeland. … But,” she asks, “did they or the international community have the right to expel the people who were already living there—and, to this day, deny them their homeland?” While, by her standards today, the society she grew up in was regressive for girls and women, it was also loving and supportive. Her mother taught her to always “help your siblings and love your family.” She speaks fondly of family reunions in Iraq and Gaza. Perhaps, after all else, it’s from that she draws her strength.\" \"My dream draws on the future, and reaches across borders and generations... I look to the next generations who will grow up together; generations who can carry this beautiful dream of justice to fruition. What kind of people would we be if we did not believe in a dream of justice and peace for all?\", Halima Alaiyan Dr Halima Alaiyan now lives in Berlin and runs her own practice as an orthopaedic specialist. In 2003, she founded the Talat Alaiyan Foundation, which fosters dialogue and under¬standing between young people in Europe, Israel and Palestine. She was awarded an Order of Merit of the Federal Republic of Germany in 2009.",
  "genres": [],
  "author": "Halima Alaiyan",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/22582935-a-constant-longing---memoirs-of-a-palestinian-woman"
}