{
  "title": "Love, Honor, & Hope - A Benefit for The United States War Veteran's PTSD Foundation",
  "description": "For 30 days eight authors bring you 8 novels in Love, Honor, & Hope. All proceeds benefit The United States War Veteran’s PTSD Foundation.\nOut of the Box Awakening\n - Jennifer Theriot: Olivia has the picture perfect life. She’s got it all and doesn’t want things to change. Swept from her life in Houston, Olivia finds herself in Chicago, alone, betrayed, and far from home. Everything she thought she knew is about to come crashing down. Ash is the man who has everything—everything except healing from the losses of a lifetime. His peace lies in the flow of music pouring from his guitar. What happens when the married woman and the handsome sexy widower are thrown together by fate? \nEarly One Morning\n - Aubree Lane: He was the dark haired deity with a salacious smile. 2600 miles away Terence Javier’s senior portrait was being drooled over by a teenaged all-girl choir. Years later Marrisa runs into the choir’s heartthrob, Annie, catches the red eye and foils her plan. This envious act uncovers a scandalous affair, and their lives will never be the same. \nLost and Found\n - Jennifer Yarbrough: Olivia's life drastically changes in the blink of an eye when she and her family are in a tragic accident that leaves her the only survivor. Flash forward to a year and a half later when her best friend Claudia forces her out of the house where she meets multi-millionaire Cash Kingston. Cash has his own inner demons, but all of that changes when he meets Olivia. Will Olivia take him up on his offer to work for him or will she run back and hide from the world where she felt safer? \nScary Modsters ...and Creepy Freaks\n - Diane Rinella: Rosalyn lives out of her time—bringing ridicule for her eclectic wardrobe and far-out music collection. Niles’ offbeat character is the perfect complement—but he possesses a critical flaw. Rosalyn accidentally summons Rock deity Peter Lane back from the dead. He’s the precarious puzzle piece that brings sense into her world. Since Niles can defeat his challenge by helping Peter avenge his death, how far will he go to secure Rosalyn’s heart? \nTropical Dreams\n - Kelly Cozzone: Betrayal and death permeated Tiana Alexander’s past and threatens to rip apart her future. Bringing Tropical Dreams to life is the culmination of facing all life has dealt. David Murphy walked into her club and made her want to trust and love again. Can David keep her alive long enough to find out who is after her? Can he put aside his own demons for her? Can they overcome deceit, betrayal and more death? Or will life finally take its toll! \nSisters of the Night\n - Linda Lee Williams: Meet Emaline, Juliana, and Gretchen...not your usual \"sisters.\" Emaline...beautiful and beguiling. Will a regular man break this vulnerable vampire's heart? Juliana...glamorous and alluring. Will this arrogant vampire end up losing the love of her life? Gretchen...lovely and enchanting. Will this powerful vampire be able to hang on to her charming but fickle vampire lover? Three \"sisters,\" three love stories...Will they have a happily ever after? \nHeart of The Hunter\n - Cherime MacFarlane: Jay Leighton, back from Afghanistan, lives in the Copper Basin. Alone, the hunter is trying to heal. The last thing he needs is to be brought face to face with the pretty new teacher. His head is not ready his heart is lost. Leda, just out of school, has no time for love. There is something in Jay she needs. Leda worries about her reputation. She should stay away from Jay. Who is the hunter here? \nPiece of Heaven\n - Sammie J: Aaron Calnan has seen enough of the horrors of war. He wants to put it behind him, take his life in a new direction. But when he takes a strange military posting for an organization called RUM, he has no way of knowing the challenges he will face. His decision takes him into unknown territory with unexpected twists and turns. Then, one encounter changes everything and Aaron finds his life turned upside down. Will he finally find his own piece of heaven?",
  "genres": [],
  "author": "Jennifer Theriot",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/22586712-love-honor-hope---a-benefit-for-the-united-states-war-veteran-s-ptsd"
}