{
  "title": "Where Song Began: Australia's Birds and How They Changed the World",
  "description": "Tim Low, award-winning author of Feral Future, in an eye-opening book on the unique nature of Australian birds and their role in ecology and global evolution.Renowned for its unusual mammals, Australia is a land of birds that are just as unusual, just as striking, a result of the continent's tens of millions of years of isolation. Compared with birds elsewhere, ours are more likely to be intelligent, aggressive and loud, to live in complex societies, and are long-lived. They're also ecologically more powerful, exerting more influences on forests than other birds.But unlike the mammals, the birds did not keep to Australia; they spread around the globe. Australia provided the world with its songbirds and parrots, the most intelligent of all bird groups. It was thought in Darwin's time that species generated in the Southern Hemisphere could not succeed in the Northern, an idea that was proven wrong in respect of birds in the 1980s but not properly accepted by the world's scientists until 2004 – because, says Tim Low, most ornithologists live in the Northern Hemisphere. As a result, few Australians are aware of the ramifications, something which prompted the writing of this book.Tim Low has a rare gift for illuminating complex ideas in highly readable prose, and making of the whole a dynamic story. Here he brilliantly explains how our birds came to be so extraordinary, including the large role played by the foods they consume (birds, too, are what they eat), and by our climate, soil, fire, and Australia's legacy as a part of Gondwana. The story of its birds, it turns out, is inseparable from the story of Australia itself, and one that continues to unfold, so much having changed in the last decade about what we know of our ancient past. Where Song Began also shines a light on New Guinea as a biological region of Australia, as much a part of the continent as Tasmania. This is a work that goes far beyond the birds themselves to explore the relationships between Australia's birds and its people, and the ways in which scientific prejudice have hindered our understanding.",
  "genres": [
    "Nonfiction",
    "Birds",
    "Science",
    "Australia",
    "Nature",
    "Animals",
    "Natural History"
  ],
  "author": "Tim Low",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/22586113-where-song-began"
}