{
  "title": "Aroused and Awakened",
  "description": "In 1972 John Edward Hudson, graduated high-school in the Midwest, avoided the draft by telling the men at the processing center he was gay, and left for Hollywood, California, the same day as his high school sweetheart, Vic Cassavelli, drove off in the opposite direction, to go to college at Yale.At eighteen, both men had different ideas and goals, and knew having a committed relationship at that age, with the entire country between them, was never going to work.With only a few dollars in his pocket, John hitched-hiked and rode the bus to LA and landed in the middle of West Hollywood. A wonderland of insanity, right after the 60’s revolution of sex, drugs, rock and roll, race riots and hippies. Gorgeous, and slightly naïve, John was thrown into the chaos of LA’s gay culture and taken in by an older man, who was kind enough to house him and receive an occasional sexual act in return, and supply John with as much recreational dope as he could handle.Heaven or hell, John was introduced to every kind of pleasure imaginable, including a budding transsexual named Kitten, whom he adored, as well as a revolving door of handsome older men who used John in drug-enhanced sexual orgies. He loved every moment of it.But John’s goal was not only to savor the hedonistic lifestyle of gay LA-- it was to become a star!His benefactor knew a friend of a friend, of a friend, who knew a Hollywood talent agent named, Jack Turner. Infamous for his couch practices, Mr Turner also had some luck turning young men into mega stars.As John lives and learns the hard lessons of ‘life in the fast lane’, coming from what may as well have been a foreign land, the American Midwest, John is not only aroused by the pleasures life has to offer, he is woken up to reality. Some good, some bad.And that reality may be what he left behind.The 70s…Vietnam, protests, lava lamps, day-glow posters, and decadence that knew no bounds.Take a trip back in time with John, and see where life takes him. He could end up being a friend of Dorothy's, and clicking the heels of his well worn boots repeating, \"There’s no place like home\", or he could be the 70s next superstar.Word Count: 75,141",
  "genres": [
    "M M Romance"
  ],
  "author": "G.A. Hauser",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/22591279-aroused-and-awakened"
}