{
  "title": "InkHeart Authors Presents Sexy and Sweet Summer Reads",
  "description": "InkHeart Authors presents two boxed sets for your summer reading pleasure! Make sure to download both the Sexy and Sweet AND Steamy and Sizzling Sets- 21 books for $5.98!Sexy and Sweet Summer ReadsFalling Into Forever by Elena AitkenSecrets cause Kari to run, Rhys is determined to catch her, can she find the courage to trust again?A Daughter’s Place by CJ CarmichaelFor the sake of her child, a single mother must face the father who disowned her, the ex-boyfriend who hurt her and the neighbor she's always loved in...Tempt Me Cowboy by Megan CraneChelsea Collier is a good girl schoolteacher who’s never done a bad thing in her life, but bad boy newcomer Jasper Flint is definitely a bad thing worth doing…His for the Weekend by Janelle DenisonAfter nine years apart, one forbidden kiss between past lovers leads to one hot weekend, but when their time together is over, will Rachel walk away from Luke again, or can he convince her to stay and be his forever?Unspoken by Lauren HawkeyeOnce, Ellie Kendrick was the only thing that Dominic Gabriel wanted... now she’s back and her version of what happened between them so long ago makes him question everything he knows about himself as a man...Weekend with the Tycoon by Kaira RoudaWhen wealthy tycoon Blake Putnam invites employee Samantha Jones to a family wedding on Indigo island with no strings attached he knows it’s risky business, but neither of them expects what happens next.Sweet Reunion by Melanie ShawnSometimes first love deserves a second chance.The Start of Something Good by Renee Vincent writing as Gracie Lee RoseWho knew Mr. Right lived right next door?Where Their Hearts Collide by Zoe YorkWhen the girl next door meets the man of her dreams...at exactly the wrong time.",
  "genres": [],
  "author": "Elena Aitken",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/22588265-inkheart-authors-presents-sexy-and-sweet-summer-reads"
}