{
  "title": "Hot Alpha SEALs",
  "description": "12 New York Times, USA Today or Award-winning bestselling Hot Alpha Authors brings you this Military Romance Megaset for your reading pleasure: \nTHE KISS OF A SEAL\n by Award-winning Author Anne Elizabeth — Jessa Grainger’s world is rocked by the kiss of a SEAL, SO-1 Link Tyler. It wouldn’t be a problem for an ordinary person, but being a Navy Consultant working on the Amphibious Base as well as being engaged to a SWCC man make the situation very sticky. \nNight with a SEAL\n by New York Times & USA Today bestselling author Cat Johnson — When navigating military red tape begins to present more challenges than the enemy, it makes SEAL Jon Rudnick question his future. So does Alison Cressly, the one woman he can’t get out of his head. HOT BAYOU SEAL by Award-winning author Cindy Dees — SEAL Ford Alambeaux is a busted up SEAL on his way out of the teams. Trina Zarkos is being tossed out of SEAL training like every other female candidate…until they’re thrown together on a way off-book mission to see if she can play with the big boys or not. \nRetribution\n by USA Today bestselling author Cristin Harber — Fallen Navy SEAL and Titan Group’s Delta recruit Trace Reeves wants nothing more than a one-night stand to forget that his twin brother was killed-in-action. But when his one-time fling becomes his high value target, the lines blur between her rescue mission and saving himself. \nWatch Over Me: A Military Romance\n (An Uncharted SEAL story) by New York Times and USA Today bestselling author Delilah Devlin — Deke Warrick’s unsanctioned detail is to keep tabs on a congressman’s niece while she vacations in the Caribbean. He’s determined to keep his distance, from the beautiful Nicky Martir—until she’s snatched from their hotel room. \nSEAL's Obsession\n (A Take No Prisoners story) by New York Times and USA Today bestselling author Elle James — Mission: Halt pirate activities off the coast of Honduras. SEAL TEAM 10's Jack Fischer goes undercover as a deck hand on a medical boat where he finds himself falling for the dedicated Dr. Natalie Rhoades. \nThe SEAL, Part 1\n (a Sex, Lies & Spies novella) by USA Today bestselling author Gennita Low — Mari Lords is tasked by her father to steal the seal that is an important clue in a round-the-world treasure hunt called The Game. When her opportunity comes during a party, she finds another kind of SEAL, Angel Marcello. \nUnbreakable SEAL\n by USA Today bestselling author J.M. Madden — Maxwell Tate fights against a psychotic dream world, until he no longer knows what’s real. Lacey Adams knows she can’t save all of her cases, but can she salvage the unbreakable SEAL? \nMister Black: A Billionaire SEAL Story, Part 1\n by Award-winning author P.T. Michelle — He is Black: a deadly enforcer and masterful seducer. I am Red: a justice bleeder and willing participant. When our secrets converge in a passionate encounter, stepping out of the shadows just might be worth the risk. \nStone Hard SEALs\n by Award-winning author Sabrina York — When Ryder “Stone” Maddox’s meets Lily Wilson—a senator’s daughter who is definitely off-limits—he’s determined to keep his distance, despite her irresistible allure. But Lily has plans of her own…to put his heart of stone to the test. \nSEAL's Promise: Bad Boys of Team 3\n by New York Times and USA Today bestselling author Sharon Hamilton — Navy SEAL T.J. Talbot, SEAL Team 3's bad boy, makes a deathbed promise to protect and care for his fallen buddy's wife and child. The only problem is, she hates him. \nBreaking Ties\n (a SEAL Team Heartbreakers story) by bestselling author Teresa Reasor — Navy SEAL Oliver Shaker is blindsided when he learns that not only does his wife, Selena, have a life-threatening illness, but she’s also pregnant, stretching their marriage to the breaking point.",
  "genres": [],
  "author": "Anne Elizabeth",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/22591884-hot-alpha-seals"
}