{
  "title": "Freed",
  "description": "(This is the conclusion to Bound by Love - Freed is a continuum of that story and will not make sense read as a stand alone.)Annie finally found the strength to break free from the destructive bonds that tied her to Gray. He will forever hold a piece of her heart, but she let him go when he was poised to marry for the second time to another woman. Brett Ryann has shown her love, devotion, and the security she desperately desires. It may not be the soul shattering passion she shared with Gray, but it's comforting, rocking chair love that will carry her through life. With the help of Brett, she has picked up the pieces of her shattered life and has found the security and unconditional love she’s always wanted. But unforeseen circumstances arise, and Annie is once again forced to choose between the security of the life she’s created or reclaiming the missing piece of her soul.Living with the pain of losing everything she never knew she had.Gray has never been able to give Annie the commitment and stability she wants. Foolishly believing she would always be waiting, he’s made choices that make it very difficult to come back into her life. Gray knows his weaknesses and knows he hurt Annie time and again, but in his mind she will always be his. Have his wandering eyes, lack of commitment, and continuous need for freedom finally released her from the force that bound them together? Just when he realizes exactly what he’s lost and what he’s willing to do to get it back, he discovers it may be too late to prove to her that he can be the man she needs him to be.Freed is the conclusion of Bound by Love. It is a steamy, heart-wrenching, beautiful love story. What happens to relationships and past lovers when marriages, infidelity, children, and maturity collide with the present?*Warning – This book contains sexual content & language that is not appropriate for audiences under eighteen years of age.",
  "genres": [],
  "author": "Stephie Walls",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/22591473-freed"
}