{
  "title": "The Middle Ages: From the Fall of Rome to the Rise of the Renaissance",
  "description": "This second book in the four-volume narrative history series for elementary students will transform your study of history. The Story of the World has won awards from numerous homeschooling magazines and readers' polls―over 150,000 copies of the series in print! Now more than ever, other cultures are affecting our everyday lives―and our children need to learn about the other countries of the world and their history. Susan Wise Bauer has provided a captivating guide to the history of other lands. Written in an engaging, straightforward manner, this revised edition of The Story of the World: History for the Classical Child, Volume 2: The Middle Ages weaves world history into a story book format. Who discovered chocolate? What happened to the giant Fovor of the Mighty Blows? Why did the Ottoman Turks drag their war ships across dry land?The Story of the World covers the sweep of human history from ancient times until the present. Africa, China, Europe, the Americas―find out what happened all around the world in long-ago times. Designed as a read-aloud project for parents and children to share together, The Story of the World includes each continent and major people group. Volume 2: The Middle Ages , is the second of a four-volume series and covers the major historical events in the years 400 to 1600 CE, as well as including maps, illustrations, and tales from each culture.Each Story of the World volume provides a full year of history study when combined with the Activity Book, Audiobook, and Tests―each available separately to accompany each volume of The Story of the World Text Book. Volume 2 Grade Recommendation: Grades 1-6. Illustrated throughout with black-and-white drawings and maps",
  "genres": [
    "History",
    "Nonfiction",
    "Education",
    "School",
    "Historical",
    "Childrens",
    "Medieval"
  ],
  "author": "Susan Wise Bauer",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/225948.The_Middle_Ages"
}