{
  "title": "As Pupilas do Senhor Reitor",
  "description": "Romance de Júlio Dinis publicado, em 1866, sob o formato de folhetins no Jornal do Porto, e em volume no ano seguinte. Segundo o próprio autor, numa referência das «Notas», a obra teria principiado a ser escrita em 1863, durante a permanência de Júlio Dinis em Ovar. O título refere-se às personagens femininas do romance, duas meias-irmãs órfãs, Margarida e Clara, de personalidades opostas, adotadas pelo Reitor. A intriga centra-se, contudo, em Daniel, segundo filho do lavrador José das Dornas. Depois de, em rapazinho, ter renunciado à carreira eclesiástica por amor a Margarida, Daniel regressa à aldeia, já médico e completamente esquecido do seu idílio de infância. Para além do Reitor, a obra apresenta uma interessante galeria de tipos rústicos, onde se destacam as figuras de José das Dornas, João Semana, o bondoso médico rural, João da Esquina, o dono da loja, e a sua esposa interesseira, a ti'Zefa, a beata linguaruda, entre outras. Em suma, As Pupilas do Senhor Reitor traduz a vida rural portuguesa da época.As Pupilas do Senhor Reitor. In Infopédia [Em linha]. Porto: Porto Editora, 2003-2012. [Consult. 2012-01-03]. Disponível na www: As Pupilas do Senhor Reitor, de Júlio Dinis, primeiro romance português do século, publicado inicialmente em 1866 em forma de folhetim, [...] só no ano seguinte apareceria em livro. [O s]eu caráter moralizador e a religiosidade que perpassa por todo o romance, a bondade capaz de chegar a extremos quase incríveis de sacrifício pessoal, são alguns dos ingredientes que transformaram em muito pouco tempo o autor desconhecido em sucesso nacional. A calma da cidade do interior (Ovar - Portugal) e a observação da vida simples das pessoas da aldeia propiciaram o aparecimento desse romance que, algum tempo depois, se tornaria um dos mais famosos em Portugal.Os capítulos são tipicamente folhetinescos: unidades narrativas com peripécias e final em suspensão. É um romance [que] está cheio de ironias bem humoradas, tornando-o, apesar do moralismo intencional, de leitura mais agradável.Como costuma acontecer com escritores românticos, Júlio Dinis também vê o mundo com as lentes do maniqueísmo. Assim, assenta sua obra em um jogo contínuo de oposições. Entre as principais, destacam-se: A cidade - O campo / A modernidade - A tradição / O desejo - O amor.http://www.passeiweb.com/na_ponta_lin...As Pupilas contam-nos a história de duas irmãs, filhas de casamentos diferentes do mesmo pai, que, estimando-se profundamente, são dotadas de maneiras de ser inteiramente opostas. Clara e Margarida, ambas generosas e de bom espírito, encaram a vida por forma diferente: a primeira, expansiva e alegre, por vezes estouvada, feliz de si própria e dos outros; a segunda, fechada numa reserva natural, dominando as reminiscências dum idílio infantil com Daniel na discrição e na saudade das horas idas - sentimento bem português de que neste livro se faz, por vezes, uma síntese expressiva.http://virtualbooks.terra.com.br/free...",
  "genres": [
    "Classics",
    "Romance",
    "Portuguese Literature",
    "Portugal",
    "Fiction",
    "19th Century",
    "Historical Fiction"
  ],
  "author": "Júlio Dinis",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/2259479.As_Pupilas_do_Senhor_Reitor"
}