{
  "title": "Where Did the Towers Go? Evidence of Directed Free-energy Technology on 9/11",
  "description": "This book is a forensic analysis of what effectively is a crime scene. Ground Zero and the surrounding areas were photographed countless thousands of times, yet no one really assessed all of the phenomena found in these photographs. What is presented in this book is not a theory and it is not speculation. It is evidence. It is the body of empirical evidence that must be explained in order to determine what happened at Ground Zero.Anyone declaring who did what or how they did it before they have determined what was done is merely promoting either speculation or propaganda. The popular chant, \"9/11 was an inside job,\" is, scientifically speaking, no different from the chant that \"19 bad guys with box cutters did it.\" Neither one is the result of a scientific investigation supported by evidence that would be admissible in court. Neither identifies what crime was committed or how it was committed.The order of crime solving is to determine1) WHAT happened, then2) HOW it happened (e.g., what weapon), then3) WHO did it. And only then can we address4) WHY they did it (i.e. motive).Let us remember what is required to (legally) convict someone of a crime. You cannot convict someone of a crime based on belief. You cannot convict someone of a crime if you don't even know what crime to charge them with. If you accuse someone of murder using a gun, you'd better be sure the body has a bullet hole in it. Yet, before noon on 9/11/01, we were told who did it, how they did it, and why they did it (they hate us for our freedoms); before any investigation had been conducted to determine what had even been done.Many people have speculated as to who committed the crimes of 9/11 and/or how they did so. But without addressing what happened, speculation of this kind is nothing more than conspiracy theory. My research is not speculation. It is a forensic investigation of what happened to the WTC complex on 9/11.",
  "genres": [
    "Conspiracy Theories",
    "History",
    "Nonfiction",
    "Science",
    "Politics",
    "Physics",
    "The United States Of America"
  ],
  "author": "Judy D. Wood",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/11334129-where-did-the-towers-go-evidence-of-directed-free-energy-technology-on"
}