{
  "title": "What Kind of Dog is That?",
  "description": "Ergo wiped his greasy lips and chin with the back of his hand. A haunch of venison was burning on the spit, but Ergo's stomach was practically bursting from eating too much. At the mouth of the cave, a young wolf pup was whimpering. The smell was so enticing. He hadn't eaten in three days. He crawled on his empty belly closer to the smell. The whimpering attracted Ergo's attention. Feeling too full to move, he took the chunk of meat he couldn't finish and hurled it at the pup to scare it away. The meat landed a few feet in front of the gray pup. Too hungry to be frightened, the pup grabbed the meat, turned and fled. The pup return the next night hoping to repeat the experience. That was 10,000 years ago, the wolf has evolved into a dog and a centuries-long relationship was established.  Now, the dog has evolved into hundreds of distinct breeds. Some dogs were and are bred for a specific purpose such as hunting, tracking, protection and, sadly, fighting. Others fill roles as companions, assistance dogs, or for just plain fun. In fact, there are 300+ breeds in the world.  Ergo wiped his greasy lips and chin with the back of his hand. A haunch of venison was burning on the spit, but Ergo's stomach was practically bursting from eating too much. At the mouth of the cave, a young wolf pup was whimpering. The smell was so enticing. He hadn't eaten in three days. He crawled on his empty belly closer to the smell. The whimpering attracted Ergo's attention. Feeling too full to move, he took the chunk of meat he couldn't finish and hurled it at the pup to scare it away. The meat landed a few feet in front of the gray pup. Too hungry to be frightened, the pup grabbed the meat, turned and fled. The pup return the next night hoping to repeat the experience. That was 10,000 years ago, the wolf has evolved into a dog and a centuries-long relationship was established.  Now, the dog has evolved into hundreds of distinct breeds. Some dogs were and are bred for a specific purpose such as hunting, tracking, protection and, sadly, fighting. Others fill roles as companions, assistance dogs, or for just plain fun. In fact, there are 300+ breeds in the world. Ergo wiped his greasy lips and chin with the back of his hand. A haunch of venison was burning on the spit, but Ergo's stomach was practically bursting from eating too much. At the mouth of the cave, a young wolf pup was whimpering. The smell was so enticing. He hadn't eaten in three days. He crawled on his empty belly closer to the smell. The whimpering attracted Ergo's attention. Feeling too full to move, he took the chunk of meat he couldn't finish and hurled it at the pup to scare it away. The meat landed a few feet in front of the gray pup. Too hungry to be frightened, the pup grabbed the meat, turned, and fled. The pup returned the next night, hoping to repeat the experience. That was 10,000 years ago;, the wolf has evolved into a dog, and a centuries-long relationship was has been established.  Now, the dog has evolved into hundreds of distinct breeds. Some dogs were and are bred for a specific purpose such as hunting, tracking, protection, and, sadly, fighting. Others fill roles as companions, assistance dogs, or for just plain fun. In fact, there are 300+ breeds of dogs in the world.",
  "genres": [],
  "author": "Dave Fox",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/22602119-what-kind-of-dog-is-that"
}