{
  "title": "Pink Lace and Stolen Hearts",
  "description": "Dear Author,This is my roommate and best friend, Greg. He’s been depressed, and maybe even suicidal, ever since his boyfriend found out that he likes to wear feminine underwear, especially the sheer styles like the one in the picture above. He was so in love with that loser. He even told me that he was holding off from having sex until they got to know one another, because he wanted it to be perfect. He’s old-fashioned that way—a history major who’s enthralled with the history of dating and romantic relationships throughout the centuries. He believed he could find his own Prince Charming and have a Happily Ever After romance. Because he’s a bit embarrassed and unsure of himself about his underwear fetish, he’d always wear \"tighty whities\" when he was with Simon, or Simple Simon as I like to call him in my mind. Why Simon never questioned that a flamboyant gay man like Greg would wear simple white briefs, I’ll never know.When Greg started to feel comfortable in their relationship, and was ready to go all the way, he finally got up the nerve to wear his favorite pair of undies—a silky smooth, sheer lace, pink bikini with tiny embroidered roses. He was hoping to please Simon, but when he saw them, Simon became enraged, smacking Greg in the face, calling him sick, and storming out the door.Now, there’s Greg standing at the railing, looking at nothing in particular, lost, forlorn, sad, all the things that I don’t want him to be. I love him—as a friend, and maybe even more, though I’ve never told him. I’m straight, at least I think I am, but when I first saw him in a pair of pretty powder blue panties, I swear my heart skipped a beat, and I think I even drooled a little. My reaction made me question my own sexuality, but I haven’t explored anything further with him. I’m happy that he trusted me enough to reveal his secret to me, but now my heart is broken for him due to Simon’s rejection.Greg is so special, so wonderful, please dear author, give him a love story, even if it can’t be with me. He deserves to find happiness with someone who loves him unconditionally and appreciates all the facets of his personality.Photo Description: A man leans heavily on the railing of his balcony with his back to me. His hands grip the metal railing tight. He has a long, lean back and slim hips. He is wearing a pair of sheer boy shorts, which show off his nice round butt. He has black hair, longer on the top and shorter on the sides. His head is bowed, and his shoulders slumped, showing the tension in his body.This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Friends To Lovers",
    "Contemporary",
    "Romance",
    "Gay For You",
    "Short Stories",
    "Cross Dressing"
  ],
  "author": "Jake C. Wallace",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/22601102-pink-lace-and-stolen-hearts"
}