{
  "title": "Ever After",
  "description": "NEW YORK TIMES BESTSELLERJude Deveraux’s eagerly awaited third novel in her blockbuster Nantucket Brides trilogy continues the spellbinding saga of the Montgomery-Taggerts, set on an island steeped in beauty and unforgettable romance. Life is anything but perfect for Hallie Hartley, a young physical therapist who has given up nearly everything—even her love life—for her beautiful blonde stepsister, Shelly. Though Shelly’s acting career has never taken off, she has certainly perfected the crocodile tears to get what she wants—which all too often means Hallie’s boyfriends. When Hallie arrives home early from work one fateful day, she makes two startling discoveries that will turn her life upside down: Not only has a mysterious relative left Hallie a house on Nantucket, but Shelly has been trying to steal it. Desperate to put her troubles behind her, Hallie impulsively flies to Nantucket. New trouble, however, has already settled into Hallie’s guest room in the form of her newest client. Hallie is told that wealthy, young James Taggert has injured his leg in a skiing accident. Assuming that the devastatingly handsome man has led a charmed life, Hallie is surprised by Jamie at every turn throughout his recovery. His attentions draw her out of her shell—but he has a dark secret, and is tormented by nightmares that only her presence can keep at bay. She suspects there’s more to his injury than he’s letting on. On this gorgeous island rich in history, magic is everywhere, even in Hallie’s own backyard. As Jamie’s relatives arrive for a wedding gala, something wonderfully unusual is in the air. There’s an aura of romance—enhanced by a pair of matchmaking ghosts and a colorful island legend. In their own little corner of the world, Jamie and Hallie unravel the timeless secrets of their own hearts, and a very special story of True Love destined to last forever after.",
  "genres": [
    "Romance",
    "Contemporary",
    "Paranormal",
    "Audiobook",
    "Fiction",
    "Contemporary Romance",
    "Chick Lit"
  ],
  "author": "Jude Deveraux",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/22603405-ever-after"
}