{
  "title": "Saving Angel",
  "description": "Angel Perez had a second chance at a new beginning. After the death of her Aunt Rosie, Angel followed the instructions of her aunt and packed up only a few of her belongings and headed to Florida. After moving into her Aunt Rosie’s small cottage on Siesta Key Beach, she was quickly adjusting to her new life.After finding a job at an insurance company, Angel became friends with the two owners, Sara Roberts and Brea Kinsley. Sara and Brea made it their mission to fix Angel up on a blind date with their very handsome and single friend Mason Myles.Afraid that her past would catch up with her, Angel lived a very private life. When she met the tall, dark, and handsome Dr. Mason Myles, she knew she wouldn’t be able to resist him. He swept her off her feet with his sexy, dimpled smile and charm.Living on the run from a very abusive boyfriend, Jim Davis, Angel lived in fear that Jim would somehow find her. After she revealed her abusive past and fears to Mason, Mason vowed to protect her.When Angel heard that Jim had been fired from his job as an L.A. Police Detective, she feared he would come and find her.Angel started noticing noises outside her bedroom window and lights in her house would mysteriously turn on and off. She started getting hang-up calls at work and would often see a dark SUV parked along her cul-de-sac road and around her workplace. Angel realized her worst fears had come true when she heard that Jim hadn’t been seen in two months. She knew he had found her and it was only a matter of time before he made his presence known.While driving to the store to get items to cook Mason a home-cooked meal, Angel was the victim of a hit-and-run accident on Midnight Pass Road and sustained life-threatening injuries.Mason’s father, Bruce, and Angel’s Uncle Raùl hired their own detectives to try to find Jim before he had a chance to strike again.",
  "genres": [
    "Romance"
  ],
  "author": "Brenda Kennedy",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/22607181-saving-angel"
}