{
  "title": "Leben",
  "description": "Karl Ove Knausgård über die Entdeckung des Lebens.Es ist eine Zeit des Umbruchs und der Veränderungen. Das Abitur hat er in der Tasche, die Eltern haben sich getrennt, die Begegnungen mit dem Vater sind spannungsgeladen, die ersten Schritte hinein in ein selbstbestimmtes Leben begleitet von Alkoholräuschen, die der junge Karl Ove in seiner Not immer öfter sucht, weil er diese mit einem Gefühl von Freiheit verbindet – verheißen sie ihm doch Befreiung von all den Komplexen, Unsicherheiten und Nöten, die ihn plagen und noch lange Jahre plagen werden. Lebenslust sieht anders aus.Unschlüssig, was er mit seinem Leben beginnen soll, beschließt Knausgård ein Jahr als Aushilfslehrer an eine Dorfschule nach Nord-Norwegen zu gehen. Dabei wird er nicht nur mit Schülern konfrontiert, die ihn verständlicherweise als Autoritätsperson nicht ernstnehmen, sondern auch mit einer überwältigenden, für ihn ebenso neuen wie faszinierenden Natur. Bald bildet sich ein Lebensmuster heraus. Den Job erledigt er mit möglichst wenig Aufwand, danach versucht er sich mittels Schreibversuchen an der Etablierung einer Autorenidentität. An den Wochenende wird hemmungslos getrunken, wobei die älteren Kollegen keinerlei Versuche machen, ihren jugendlichen Aushilfslehrer zu mäßigen. Statt dessen trinken sie mit. Am Ende des Jahres steht die Rückkehr in südlichere Regionen an – und die Aufnahme an der neu gegründeten Akademie für Schreibkunst in Bergen ...Was war das für ein Jahr? Und inwiefern ist es exemplarisch für andere Anfänge? Für unseren Start ins Erwachsenenleben? Wer Knausgård liest, wird schnell gefangengenommen von eigenen Erinnerungen, die Fragen aufwerfen, die weit über eine gewöhnliche Lektüre hinausgehen.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Scandinavian Literature",
    "Literature",
    "Novels",
    "Audiobook",
    "Literary Fiction"
  ],
  "author": "Karl Ove Knausgård",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/22606644-leben"
}