{
  "title": "Big Delicious Life: Stacey Ballis's Most Awesome Recipes: A Cookbook",
  "description": "150 simple and scrumptious recipes from Stacy Ballis’s hit novels Out to Lunch, Off the Menu, Good Enough to Eat, and Recipe for Disaster, as well as 40 new, never-before-seen recipes!   Stacey Ballis is not a professional chef. She is, however, a foodie novelist, meal innovator, family cook, memory maker, and Brussels sprout advocate who believes that delicious meals can be simple, fun, and creative. Her love of all things culinary has made her “foodie fiction” irresistible. Now, all of the best recipes featured in her novels are available in one mouthwatering cookbook, including 40 “lost” recipes that were not included in the original printings.With dishes for every occasion, designed to appeal to both experienced cooks and kitchen newbies, this easily-transportable digital collection will make every meal a happy moment and a special memory.Includes a preview of Stacey’s delectable novel, Recipe for DisasterPraise for Stacy Ballis“Deeply satisfying.”—Jen Lancaster, New York Times bestselling author of The Tao of Martha“Dangerously good descriptions of food.”—Sarah Pekkanen, author of Catching Air“One delicious bite.”—Amy Hatvany, author of Safe with MeStacey Ballis was born in Chicago with a full head of hair and a naturally charming disposition. She majored in English Literature and American Studies with a minor in Creative Writing at Brandeis, spent time in a mud hut in Kenya, and got a Masters in Teaching from DePaul University, before spending fifteen years as an educator in Chicago. She then settled back into writing full time, focusing on stories about big girls who are comfortable in their own skin, have great lives, and aren’t dieting or morose about their bodies. She has since authored eight foodie novels, including Good Enough to Eat, Off the Menu, and Out to Lunch.",
  "genres": [
    "Cookbooks"
  ],
  "author": "Stacey Ballis",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/22604978-big-delicious-life"
}