{
  "title": "Is Everyone Really Equal?: An Introduction to Key Concepts in Social Justice Education",
  "description": "This practical handbook will introduce readers to social justice education, providing tools for developing “critical social justice literacy” and for taking action towards a more just society. Accessible to students from high school through graduate school, this book offers a collection of detailed and engaging explanations of key concepts in social justice education, including critical thinking, socialization, group identity, prejudice, discrimination, oppression, power, privilege, and White supremacy. Based on extensive experience in a range of settings in the United States and Canada, the authors address the most common stumbling blocks to understanding social justice. They provide recognizable examples, scenarios, and vignettes illustrating these concepts.This unique resource has many user-friendly features, including “definition boxes” for key terms, “stop boxes” to remind readers of previously explained ideas, “perspective check boxes” to draw attention to alternative standpoints, a glossary, and a chapter responding to the most common rebuttals encountered when leading discussions on concepts in critical social justice. There are discussion questions and extension activities at the end of each chapter, and an appendix designed to lend pedagogical support to those newer to teaching social justice education.“Sensoy and DiAngelo's book sings with insight, clarity, and humanity. This is a brilliant primer to help us consider what it means to think critically and to act for justice.” —Bill Bigelow, Curriculum editor, Rethinking Schools magazine“I commend the direction of this book that addresses concepts such as social and institutional power, socialization, and oppression rather than framing social and political inequality as the consequences of behavioral problems and cultural misunderstandings. The approach the authors have taken supports teachers and their students in rethinking the ways in which the problems of inequality have been normalized as everyday practices. The book will help teachers to rethink inequality in systemic terms and to find opportunities for taking action at any moment.”—Carol Schick, Associate Professor, Faculty of Education, University of Regina“The most accessible book on social justice I have ever read! The authors speak truth to power and in language we can all understand. I can't wait to use this text. The authors demonstrate that important concepts about social justice and political change can be both understandable and engaging. This is a huge contribution to the field.”—Mara Sapon-Shevin, Professor, School of Education, Syracuse University“This timely book offers a reader-friendly, unflinching approach to answering those questions on social justice that people are often afraid to ask. The authors provide clear definitions, recognizable examples, robust counterpoints, and thought-provoking activities. All critical educators need to get this text in the hands of their students.”—Darren E. Lund, Professor, Faculty of Education, University of CalgaryÖzlem Sensoy is an assistant professor of education at Simon Fraser University, Burnaby BC, Canada. Robin DiAngelo is an assistant professor of education at Westfield State University, Westfield, Massachusetts.",
  "genres": [
    "Education",
    "Nonfiction",
    "Social Justice",
    "Race",
    "Teaching",
    "School",
    "Anti Racist"
  ],
  "author": "Özlem Sensoy",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/22607000-is-everyone-really-equal"
}