{
  "title": "Secrets of the Nanny Whisperer: A Practical Guide for Finding and Achieving the Gold Standard of Care for Your Child",
  "description": "The New Childcare Bible-- A Must-Have Whether You Have Occasional Sitters or a Full-Time NannyFinding the right caregiver can be one of the most life-changing decisions a parent makes. Whether it's a kindly neighbor for the weekday latchkey hours, a teenage babysitter one night a week, or a full-time professional nanny, the right caregiver can enrich a child's world and literally grow her brain. Hire the wrong one, and this person could cause developmental delays and stress for the entire family. In her groundbreaking new book,  Secrets of the Nanny A Practical Guide for Finding and Achieving the Gold Standard of Care for Your Child   (Perigee), nationally recognized parenting expert Tammy Gold draws from her extensive background in child developmental psychology, social work, and family therapy to offer the first childcare bible for parents.   Knowing the impact caregivers have on children coupled with the unregulated often unknown world of in-home childcare workers, Gold has devoted her professional career, and now this book, to helping parents navigate through this important--and woefully overlooked--process. She arms parents with invaluable tools, tips, and insider secrets to finding the perfect caregiver-family match. Gold's Family Needs Assessment helps parents identify the traits and conditions that are \"must-haves,\" added \"pluses,\" or nonnegotiable \"deal breakers.\" Parents can then use this list of qualities to quickly weed out unqualified candidates. She also details what to ask over the phone and in a face-to-face interview, how to structure a trial run (which she deems essential), and what to spell out in a Nanny-Family Work Agreement--another essential tool included in the book. Readers learn her \"Nanny Speak 1-2-3\" technique to help clarify and resolve issues with the caregiver in a productive, positive way. In addition to saving hours and energy, Parents will also discover as much about parenting as they will about finding a nanny. The book is chock-full of parenting gems about children's developmental stages, ways to nurture and stimulate the child, and essential strategies for maintaining harmonious and high-functioning parent-child-caregiver relationships. This book is a must read for parents who want to create a happier, healthier and safer childcare experience for their child. \"Secrets of the Nanny Whisperer   is a godsend for parents looking for a caregiver who not only tends to their child's basic needs, but nurtures the whole child--mind, body, and spirit.\"  Seattle Post-Intelligencer  \"Parents setting out on the nanny quest will surely benefit from this practical handbook.\"  Publisher's Weekly \"Seeking a nanny who will be in sync with your family and lifestyle?...Your children--and their developing brains and bodies--will thank you for heeding this book's excellent advice.\"  Carol S. Kranowitz MA, author of The Out-of-Sync Child",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Psychology"
  ],
  "author": "Tammy Gold",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/22609022-secrets-of-the-nanny-whisperer"
}