{
  "title": "Christopher's Diary: Echoes of Dollanganger",
  "description": "Picking up where Christophers Diary: Secrets of Foxworth leaves off, Kristin Masterwood and her boyfriend up the ante by going into her attic to re-enact scenes described in Christopher Dollangangers journal. Jealousy, tragedy, survival, and revenge& the discovery of Christopher's diary in the ruins of Foxworth Hall brings new secrets of the Dollanganger family to light and obsesses a new generation. With Flowers in the Attic and Petals on the Wind both now major Lifetime TV events, the first new Dollanganger stories in nearly thirty years is a timely look at the events in the attic from teenage Christophers point of view. Christopher Dollanganger was fourteen when he and his younger siblings Cathy and the twins, Cory and Carrie were locked away in the attic of Foxworth Hall, prisoners of their mother's greedy inheritance scheme. For three long years he kept hope alive for the sake of the others. But the shocking truth about how their ordeal affected him was always kept hidden until now.Seventeen-year-old Kristin Masterwood is thrilled when her father's construction company is hired to inspect the Foxworth property for a prospective buyer. The once grand Southern mansion still sparks legends and half-truths about the four innocent Dollanganger children, even all these decades later. Foxworth holds a special fascination for Kristin, who was too young when her mother died to learn much about her distant blood tie to the notorious family. Accompanying her dad to the forbidden territory, they find a leather-bound book, its yellowed pages filled with the neat script of Christopher Dollanganger himself. Her father grows increasingly uneasy about her reading it, but as she devours the teen's story page by page, his shattering account of temptation, heartache, courage, and betrayal overtakes Kristin's every thought. And soon her obsession with the doomed boy crosses a dangerous line.",
  "genres": [
    "Fiction",
    "Young Adult",
    "Horror",
    "Romance",
    "Drama",
    "Gothic",
    "Contemporary"
  ],
  "author": "V.C. Andrews",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/22609297-christopher-s-diary"
}