{
  "title": "Hell and Good Company: The Spanish Civil War and the World it Made",
  "description": "From the Pulitzer Prize winning and bestselling author of The Making of the Atomic Bomb the remarkable story of the Spanish Civil War through the eyes of the reporters, writers, artists, doctors, and nurses who witnessed it. The Spanish Civil War inspired and haunted an extraordinary number of exceptional artists and writers, including Pablo Picasso, Joan Miro, Martha Gellhorn, Ernest Hemingway, George Orwell, and John Dos Passos. The idealism of the cause&#8212;defending democracy from fascism at a time when Europe was darkening toward another world war&#8212;and the brutality of the conflict drew from them some of their best work: Guernica, For Whom the Bell Tolls, Homage to Catalonia, The Spanish Earth.The war spurred breakthroughs in military and medical technology as well. New aircraft, new weapons, new tactics and strategy all emerged in the intense Spanish conflict. Indiscriminate destruction raining from the sky became a dreaded reality for the first time. Progress also arose from the horror: the doctors and nurses who volunteered to serve with the Spanish defenders devised major advances in battlefield surgery and front-line blood transfusion. In those ways, and in many others, the Spanish Civil War served as a test bed for World War II, and for the entire twentieth century. From the life of John James Audubon to the invention of the atomic bomb, readers have long relied on Richard Rhodes to explain, distill, and dramatize crucial moments in history. Now, he takes us into battlefields and bomb shelters, into the studios of artists, into the crowded wards of war hospitals, and into the hearts and minds of a rich cast of characters to show how the ideological, aesthetic, and technological developments that emerged in Spain changed the world forever.",
  "genres": [
    "History",
    "Nonfiction",
    "Spain",
    "Spanish Civil War",
    "War",
    "Politics",
    "Military History"
  ],
  "author": "Richard Rhodes",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/22609404-hell-and-good-company"
}