{
  "title": "What Stands in a Storm: Three Days in the Worst Superstorm to Hit the South's Tornado Alley",
  "description": "Immersive reporting and dramatic storytelling set you right in the middle of the horrific superstorm of April 2011, a weather event that killed 348 people.April 27, 2011, marked the climax of a superstorm that saw a record 358 tornadoes rip through twenty-one states in three days, seven hours, and eighteen minutes. It was the deadliest day of the biggest tornado outbreak in recorded history, which saw 348 people killed, entire neighborhoods erased, and $11 billion in damage. The biggest of the tornadoes left scars across the land so wide they could be seen from space. But from the terrible destruction emerged everyday heroes, neighbors and strangers who rescued each other from hell on earth.With powerful emotion and gripping detail, Cross weaves together the heart-wrenching stories of several characters--including three college students, a celebrity weatherman, and a team of hard-hit rescuers--to create a nail-biting chronicle in the Tornado Alley of America. No, it's not Oklahoma or Kansas; it's Alabama, where there are more tornado fatalities than anywhere in the US, where the trees and hills obscure the storms until they're bearing down upon you. For some, it's a story of survival, and for others it's the story of their last hours.Cross's immersive reporting and dramatic storytelling sets you right in the middle of the very worst hit areas of Alabama, where thousands of ordinary people witnessed the sky falling around them. Yet from the disaster comes a redemptive message that's just as real: In times of trouble, the things that tear our world apart also reveal what holds us together.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Nature",
    "Audiobook",
    "Biography",
    "Environment"
  ],
  "author": "Kim Cross",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/22609348-what-stands-in-a-storm"
}