{
  "title": "Trail of Evil",
  "description": "BOOK #4 IN THE BEST-SELLING TAU CETI AGENDA SERIES. Humanity takes to interstellar space to face conflict and an extermination threat from both an evil artificial intelligence and a possible menace from beyond.A century and a half after the Martian Separatist Wars and the final defeat of insane terrorist leader El Ahmi, Alexander Moore returns to the stars with the Sienna Madira, a United States Navy supercarrier spacecraft outfitted with advanced FTL and endlessly strange, extremely effective, quantum-based weapons and remote sensing technology. And, of course, he's brought Marines, and lots of them. These are troops superbly trained for space battle, and equipped with advanced, powered armor and artificial intelligence backup.Moore's hunt down remnant weaponry platforms left by the brilliant, mad artificial intelligence known as Copernicus, the being ultimately responsible for the Solar System wide civil war. Yet Moore is about to uncover something far more before his destruction, Copernicus had established multiple mecha-warrior defended bases with the intent of resuming the destruction of humanity. Worse, an AI presence even more dangerous, evil, and clever than Copernicus may have formed an alliance with something else out there with a similar wipe humanity from the galaxy forever.But those enemies will have to face a fully armed and equipped military task force led by a resolute general and his soldiers who know they are all that stand between human life, freedom, and progress—and the total annihilation of mankind.About Travis S. Taylor“[E]xplodes with inventive action.— Publishers Weekly on Travis S. Taylor’s The Quantum Connection .“[ Warp Speed ] reads like Doc Smith writing Robert Ludlum. . .You won’t want to put it down”—John Ringo",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Military Science Fiction"
  ],
  "author": "Travis S. Taylor",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/22609265-trail-of-evil"
}