{
  "title": "The Last Word",
  "description": "Mamoon Azam es un monstruo sagrado, una vieja gloria literaria que ya ha escrito sus grandes obras y es un autor consagrado, pero cuyas ventas decrecen. Y sin esas ventas se le hace difícil poder mantener la casa en la campiña inglesa que comparte con su actual esposa, Liana, una italiana con carácter y bastantes menos años que él, a la que conoció y enamoró en una librería. Liana, de acuerdo con el joven y desenfrenado editor de Mamoon y el renuente beneplácito de éste, urde un plan para mejorar las finanzas familiares: encargar una biografía que servirá para revitalizar su figura en el mercado literario. Pero la vida de este consagrado escritor indio que llegó de joven a la metrópoli para estudiar y decidió convertirse en un perfecto gentleman británico no está exenta de aspectos escabrosos. Antes de Liana ha habido en su vida otras dos mujeres importantes, a las que en ambos casos destruyó: Peggy, su primera esposa, que murió amargada y enferma, y Marion, su amante americana, a la que sometió a prácticas sexuales, como poco, heterodoxas cuando no directamente humillantes. Todo ello lo indaga su biógrafo, el joven Harry Johnson, a través de cartas, diarios y entrevistas con el propio Mamoon y con personas que lo conocieron, entre ellas Marion. Pero los fantasmas y las tensiones no sólo emergen del pasado, porque la novia de Harry, Alice, pasa unos días con él en casa de Mamoon y el viejo escritor entabla una peculiar relación con ella. Y mientras tanto Liana sufre ataques de celos, Harry se lía con una criada de la casa y el biografiado le sonsaca al biógrafo informaciones sobre su voracidad sexual, su madre loca y otros aspectos turbios de su vida. Y así, entre el viejo escritor y el joven aprendiz se establece un peligroso juego de manipulación y seducción en esta novela que habla del deseo, la culpa, la lujuria, los demonios interiores, las relaciones de pareja, las fantasías sexuales y sentimentales, y el poder –en ocasiones temible– de las palabras.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Novels",
    "India",
    "British Literature",
    "Literary Fiction",
    "21st Century"
  ],
  "author": "Hanif Kureishi",
  "average_rating": "2.98",
  "url": "https://www.goodreads.com/book/show/22609330-the-last-word"
}