{
  "title": "From Jailer to Jailed: My Journey from Correction and Police Commissioner to Inmate #84888-054",
  "description": "The controversial New York City police commissioner and bestselling author of The Lost Son shares the story of his fall from grace and the effects of his incarceration on his views of the American justice system.Bernard Kerik was New York City’s police commissioner during the 9/11 attacks, who became an American hero as he led the NYPD through rescue and recovery efforts of the World Trade Center. His résumé as a public servant is long and storied, and includes honors from President Ronald Reagan, Queen Elizabeth II, and the NYPD’s Medal for Valor for saving his partner in a gun battle. In 2004, Kerik was nominated by President George W. Bush to head the US Department of Homeland Security.Now, he is a former Federal Prison Inmate known as #84888-054.Convicted of tax fraud and false statements in 2007, Kerik was sentenced to four years in federal prison. Now for the first time, in this hard-hitting, raw and oftentimes politically incorrect memoir, he talks candidly about his time on the the torture of solitary confinement, the abuse of power, the mental and physical torment of being locked up in a cage, the powerlessness. With his newfound perspective, Kerik makes a plea for change and illuminates why our punishment system doesn’t always fit the crime.In this extraordinary memoir, Kerik offers a riveting, one-of-a-kind perspective on the American penal system as he details life on the inside with the experience of an acclaimed Correction Commissioner from the outside. With astonishing candor, bravery, and insider’s intelligence, Bernard Kerik shares his fall from grace to incarceration, and turns it into an impassioned and singularly insightful rallying cry for criminal justice reform in a nation that he devoted his life to serving and protecting.",
  "genres": [
    "Crime",
    "Nonfiction",
    "Biography",
    "Memoir",
    "True Crime",
    "Biography Memoir"
  ],
  "author": "Bernard B. Kerik",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/22609329-from-jailer-to-jailed"
}