{
  "title": "The Family Tree: A Lynching in Georgia, a Legacy of Secrets, and My Search for the Truth",
  "description": "In the tradition of Slaves in the Family, the provocative true account of the hanging of four black people by a white lynch mob in 1912—written by the great-granddaughter of the sheriff charged with protecting them.Harris County, Georgia, 1912. A white man, the beloved nephew of the county sheriff, is shot dead on the porch of a black woman. Days later, the sheriff sanctions the lynching of a black woman and three black men, all of them innocent. For Karen Branan, the great-granddaughter of that sheriff, this isn’t just history, this is family history. Branan spent nearly twenty years combing through diaries and letters, hunting for clues in libraries and archives throughout the United States, and interviewing community elders to piece together the events and motives that led a group of people to murder four of their fellow citizens in such a brutal public display. Her research revealed surprising new insights into the day-to-day reality of race relations in the Jim Crow–era South, but what she ultimately discovered was far more personal.A gripping story of privilege and power, anger, and atonement, The Family Tree transports readers to a small Southern town steeped in racial tension and bound by powerful family ties. Branan takes us back in time to the Civil War, demonstrating how plantation politics and the Lost Cause movement set the stage for the fiery racial dynamics of the twentieth century, delving into the prevalence of mob rule, the rise of the Ku Klux Klan and the role of miscegenation in an unceasing cycle of bigotry. Through all of this, what emerges is a searing examination of the violence that occurred on that awful day in 1912—the echoes of which still resound today—and the knowledge that it is only through facing our ugliest truths that we can move forward to a place of understanding.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "American History",
    "Historical",
    "Biography",
    "Crime"
  ],
  "author": "Karen Branan",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/22609394-the-family-tree"
}