{
  "title": "Madison's Gift: Five Partnerships That Built America",
  "description": "Historian David O. Stewart restores James Madison to his proper place as the most significant Founding Father and framer of the new “A fascinating look at how one unlikely figure managed to help guide…a precarious confederation of reluctant states to a self-governing republic that has prospered for more than two centuries” (Richmond Times-Dispatch).Short, plain, balding, neither soldier nor orator, low on charisma and high on intelligence, James Madison cared more about achieving results than taking the credit. Forming key partnerships with Washington, Jefferson, Monroe, and his wife Dolley, Madison achieved his lifelong goal of a self-governing constitutional republic. It was Madison who led the drive for the Constitutional Convention and pressed for an effective new government as his patron George Washington lent the effort legitimacy; Madison who wrote the Federalist Papers with Alexander Hamilton to secure the Constitution’s ratification; Madison who joined Thomas Jefferson to found the nation’s first political party and move the nation toward broad democratic principles; Madison, with James Monroe, who guided the new nation through its first war in 1812, and who handed the reins of government to the last of the Founders.But it was his final partnership that allowed Madison to escape his natural shyness and reach the greatest heights. Dolley was the woman he married in middle age and who presided over both him and an enlivened White House. This partnership was a love story, a unique one that sustained Madison through his political rise, his presidency, and a fruitful retirement. In Madison’s Gift, David O. Stewart’s “insights are illuminating….He weaves vivid, sometimes poignant details throughout the grand sweep of historical events. He brings early history alive in a way that offers today’s readers perspective” --(Christian Science Monitor).",
  "genres": [
    "History",
    "Biography",
    "Presidents",
    "American History",
    "Nonfiction",
    "American Revolution",
    "Politics"
  ],
  "author": "David O. Stewart",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/22609420-madison-s-gift"
}