{
  "title": "Soil",
  "description": "A darkly comic debut novel by an independent bookseller about an idealistic young farmer who moves his family to a Mississippi flood basin, suffers financial ruin and becomes increasingly paranoid he's being framed for murder.It all began with a simple dream. An ambitious young environmental scientist hoped to establish a sustainable farm on a small patch of river-bottom land nestled among the Mississippi hills. Jay Mize convinced his wife Sandy to move their six-year-old son away from town and to a rich and lush parcel where Jacob could run free and Jay could pursue the dream of a new and progressive agriculture for the twenty-first century. He did not know that within a year he'd be ruined, that flood and pestilence would invade his fledgling farm or that his wife and son would leave him to pick up the pieces by himself.When Jay Mize discovers a corpse on his property, he is sure his bad luck has come to a head and he is being framed. Were Jay in his right mind, he might have reported the body to the police at the very same moment they were searching for a missing tourist from Ohio. He might have not dragged the body back to his farm under the cover of night and spent hours disposing of it. But Jay Mize is not in his right mind. His mounting paranoia is accelerated by a hot-rod local deputy, nosing around with questions about the missing tourist and making dark comments about Jay's estranged wife Sandy. It's enough to make an honest man a maniac. Drawing on elements of classic Southern noir, dark comedy, and modern dysfunction, Jamie Kornegay's novel is about the gravitational pull of one man's apocalypse and the hope that maybe, just maybe, he can be reeled in from the brink. Readers will applaud the arrival of an exquisitely deranged new voice to American (Jonathan Miles, award-winning author of Want Not and Dear American Airlines).",
  "genres": [
    "Fiction",
    "Southern Gothic",
    "Mystery",
    "Southern",
    "Thriller",
    "Book Club",
    "Literary Fiction"
  ],
  "author": "Jamie Kornegay",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/22609362-soil"
}