{
  "title": "The Hunger of the Wolf",
  "description": "A breakout book from Stephen Marche, The Hunger of the Wolf is a novel about the way we live now: a sweeping, genre-busting tale of money, morality, and the American Dream and the men and monsters who profit in its pursuit set in New York, London, and the Canadian wilderness.Hunters found his body naked in the snow. So begins this breakout book from Stephen Marche, the provocative Esquire columnist and regular contributor to The Atlantic, whose last work of fiction was described by the New York Times Book Review as “maybe the most exciting mash-up of literary genres since David Mitchell's Cloud Atlas. The body in the snow is that of Ben Wylie, the heir to America's second-wealthiest business dynasty, and it is found in a remote patch of northern Canada. Far away, in post-crash New York, Jamie Cabot, the son of the Wylie family's housekeepers, must figure out how and why Ben died. He knows the answer lies in the tortured history of the Wylie family, who over three generations built up their massive holdings into several billion dollars worth of real estate, oil, and information systems despite a terrible family secret they must keep from the world. The threads of the Wylie men's destinies, both financial and supernatural, lead twistingly but inevitably to the naked body in the snow and a final, chilling revelation.The Hunger of the Wolf is a novel about what it means to be a man in the world of money. It is a story of fathers and sons, about secrets that are kept within families, and about the cost of the tension between the public face and the private soul. Spanning from the mills of Depression-era Pittsburgh to the Swinging London of the 1960s, from desolate Alberta to the factories of present-day China, it is a bold and breathtakingly ambitious work of fiction that uses the story of a single family to capture the way we live now.",
  "genres": [
    "Fiction",
    "Book Club",
    "Werewolves",
    "Paranormal",
    "Literary Fiction",
    "Contemporary",
    "Fantasy"
  ],
  "author": "Stephen Marche",
  "average_rating": "3.16",
  "url": "https://www.goodreads.com/book/show/22609421-the-hunger-of-the-wolf"
}