{
  "title": "What I Told My Daughter: Lessons from Leaders on Raising the Next Generation of Empowered Women",
  "description": "In What I Told My Daughter, entertainment executive Nina Tassler has brought together a powerful, diverse group of women—from Madeleine Albright to Ruth Bader Ginsburg, from Dr. Susan Love to Whoopi Goldberg—to reflect on the best advice and counsel they have given their daughters either by example, throughout their lives, or in character-building, teachable moments between parent and child.A college president teaches her daughter, by example, the importance of being a leader who connects with everyone—from the ground up, literally—in an organization. A popular entertainer and former child star urges her daughter to walk in her own truth, to not break glass ceilings if she yearns to nurture a family as a stay-at-home mother or to abandon a career if that’s her calling. One of the country’s only female police chiefs teaches her daughter the meaning of courage, how to respond to danger but more importantly how not to let fear stop her from experiencing all that life has to offer. A bestselling writer who has deliberated for years on empowering girls, wonders if we’re unintentionally leading them to believe they can never make mistakes, when “resiliency is more important than perfection.”Contributors include : Geena Davis, Cecile Richards, Dolores Huerta, Rabbi Sharon Brous, Peggy Orenstein, Debora Black, Ayelet Waldman, Pat Benatar, Whoopi Goldberg, Dr. Susan Love, Nancy Pelosi, Alexandra Pelosi, Marie Osmond, Dr. Juliet Garcia, Jehan Sadat, Ph.D, Joanna Kerns, Madeleine Albright, Gloria Estefan, Nannerl O. Keohane, Jennifer Dulski, Dr. Marcia McNutt, Pamela Fryman, Ruth Bader Ginsburg, Brooke Shields, Laura Bush, Mona Sinha, Gloria Allred, Joy Marcus, Judy Vredenburgh, Sharon Osbourne, Beverly Johnson, Michelle King, Dr. Karen Antman, MD, Dr. Amy Antman Gelfand, MD, Mary Steenburgen, Kimberley Hatchett, Cheryl Saban, C. Noel Bairey Merz, Alex Guarneschelli, Dana Walden, Mia Hamm, Margaret Abe-Koga, Roma Downey, Chirlane McCray, Blythe Danner, Sheila Bair, Ruth W. Messinger, Norah O’Donnell, Donna de Varona, Nancy Josephson, Sukhinder Singh Cassidy, Jeanne Newman, and Christine Baranski.In a time when childhood seems at once more fraught and more precious than ever, What I Told My Daughter is a book no one concerned with connecting with a young girl can afford to miss.",
  "genres": [
    "Nonfiction",
    "Parenting",
    "Feminism",
    "Essays",
    "Audiobook",
    "Leadership",
    "Womens Studies"
  ],
  "author": "Nina Tassler",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/22609382-what-i-told-my-daughter"
}