{
  "title": "The Fifth Gospel",
  "description": "🎧Listening Length = 15 hours and 37 minutesIn Ian Caldwell’s masterful follow-up to his international sensation The Rule of Four, a lost gospel, a contentious relic, and a dying pope’s final wish converge to send two brothers—both Vatican priests—on an intellectual quest to untangle Christianity’s greatest historical mystery.Ten years ago, Ian Caldwell and Dustin Thomason’s The Rule of Four became a literary phenomenon that earned comparisons to Umberto Eco’s The Name of the Rose and Donna Tartt’s The Secret History. Hailed as \"ingenious...profoundly erudite\" (The New York Times), \"compulsively readable\" (People), and \"an exceptional piece of scholarship\" (San Francisco Chronicle), it spent forty-nine weeks on the New York Times bestseller list, sold nearly two million copies in North America, and was translated into thirty-five languages around the world. Now, after a decade of painstaking primary research, Ian Caldwell returns with a new intellectual thriller that confirms his place among the most ambitious popular storytellers working today.In 2004, as Pope John Paul II’s reign enters its twilight, a mysterious exhibit is under construction at the Vatican Museums. A week before it is scheduled to open, its curator is murdered at a clandestine meeting on the outskirts of Rome. The same night, a violent break-in rocks the home of the curator’s research partner, Father Alex Andreou, a Greek Catholic priest who lives inside the Vatican with his five-year-old son. When the papal police fail to identify a suspect in either crime, Father Alex, desperate to keep his family safe, undertakes his own investigation. To find the killer he must reconstruct the dead curator’s secret: what the four Christian gospels—and a little-known, true-to-life fifth gospel known as the Diatessaron—reveal about the Church’s most controversial holy relic. But just as he begins to understand the truth about his friend’s death and its consequences for the future of the world’s two largest Christian Churches, Father Alex finds himself hunted down by someone with vested stakes in the exhibit—someone he must outwit to survive.At once a riveting literary thriller, a feast of biblical history and scholarship, and a moving family drama, The Fifth Gospel is a novel about the depths of sacrifice and the power of forgiveness. Rich, authentic, erudite, and emotionally searing, it satisfies on every level.",
  "genres": [
    "Fiction",
    "Mystery",
    "Historical Fiction",
    "Thriller",
    "Mystery Thriller",
    "Audiobook",
    "Religion"
  ],
  "author": "Ian Caldwell",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/22609406-the-fifth-gospel"
}