{
  "title": "Rust: The Longest War",
  "description": "A thrilling drama of man versus nature—detailing the fierce, ongoing fight against the mightiest and unlikeliest enemy: rust. It has been called “the great destroyer” and “the evil.” The Pentagon refers to it as “the pervasive menace.” It destroys cars, fells bridges, sinks ships, sparks house fires, and nearly brought down the Statue of Liberty. Rust costs America more than $400 billion per year—more than all other natural disasters combined.In Rust, journalist Jonathan Waldman travels from Key West, Florida, to Prudhoe Bay, Alaska, to meet the colorful and often reclusive people concerned with corrosion. He sneaks into an abandoned steelworks with a brave artist and nearly gets kicked out of Can School. Across the Arctic, he follows a massive high-tech robot, hunting for rust in the Alaska pipeline. On a Florida film set he meets the Defense Department’s rust ambassador, who reveals that the navy’s number one foe isn’t a foreign country but oxidation itself. At Home Depot’s mothership in Atlanta, he hunts unsuccessfully for rust products with the store’s rust products buyer—and then tracks down some snake-oil salesmen whose potions are not for sale at The Rust Store. Along the way, Waldman encounters flying pigs, Trekkies, decapitations, exploding Coke cans, rust boogers, and nerdy superheroes.The result is a fresh and often funny account of an overlooked engineering endeavor that is as compelling as it is grand, illuminating a hidden phenomenon that shapes the modern world. Rust affects everything from the design of our currency to the composition of our tap water, and it will determine the legacy we leave on this planet. This exploration of corrosion, and the incredible lengths we go to fight it, is narrative nonfiction at its very best—a fascinating and important subject, delivered with energy and wit.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Engineering",
    "Audiobook",
    "Microhistory",
    "Technology"
  ],
  "author": "Jonathan Waldman",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/22609454-rust"
}