{
  "title": "The Discovery of Jeanne Baret: A Story of Science, the High Seas, and the First Woman to Circumnavigate the Globe",
  "description": "The year was 1765. Eminent botanist Philibert Commerson had just been appointed to a grand new the first French circumnavigation of the world. As the ships’ official naturalist, Commerson would seek out resources—medicines, spices, timber, food—that could give the French an edge in the ever-accelerating race for empire. Jeanne Baret, Commerson’s young mistress and collaborator, was desperate not to be left behind. She disguised herself as a teenage boy and signed on as his assistant. The journey made the twenty-six-year-old, known to her shipmates as “Jean” rather than “Jeanne,” the first woman to ever sail around the globe. Yet so little is known about this extraordinary woman, whose accomplishments were considered to be subversive, even impossible for someone of her sex and class.           When the ships made landfall and the secret lovers disembarked to explore, Baret carried heavy wooden field presses and bulky optical instruments over beaches and hills, impressing observers on the ships’ decks with her obvious strength and stamina. Less obvious were the strips of linen wound tight around her upper body and the months she had spent perfecting her masculine disguise in the streets and marketplaces of Paris.           Expedition commander Louis-Antoine de Bougainville recorded in his journal that curious Tahitian natives exposed Baret as a woman, eighteen months into the voyage. But the true story, it turns out, is more complicated. In The Discovery of Jeanne Baret, Glynis Ridley unravels the conflicting accounts recorded by Baret’s crewmates to piece together the real how Baret’s identity was in fact widely suspected within just a couple of weeks of embarking, and the painful consequences of those suspicions; the newly discovered notebook, written in Baret’s own hand, that proves her scientific acumen; and the thousands of specimens she collected, most famously the showy vine bougainvillea. Ridley also richly explores Baret’s awkward, sometimes dangerous interactions with the men on the ship, including Baret’s lover, the obsessive and sometimes prickly naturalist; a fashion-plate prince who, with his elaborate wigs and velvet garments, was often mistaken for a woman himself; the sour ship’s surgeon, who despised Baret and Commerson; even a Tahitian islander who joined the expedition and asked Baret to show him how to behave like a Frenchman. But the central character of this true story is Jeanne Baret herself, a working-class woman whose scientific contributions were quietly dismissed and written out of history—until now. Anchored in impeccable original research and bursting with unforgettable characters and exotic settings, The Discovery of Jeanne Baret offers this forgotten heroine a chance to bloom at long last.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Science",
    "Adventure",
    "Feminism",
    "History Of Science"
  ],
  "author": "Glynis Ridley",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/11337090-the-discovery-of-jeanne-baret"
}