{
  "title": "The Reason for Flowers: Their History, Culture, Biology, and How They Change Our Lives",
  "description": "Cultural history at its best—the engaging, lively, and definitive story of the beauty, sexuality, ecology, myths, lore, and economics of the world’s flowers, written by a passionately devoted author and scientist, and illustrated with his stunning photographs.Flowers, and the fruits that follow, feed, clothe, sustain, and inspire all humanity. They have done so since before recorded history. Flowers are used to celebrate all-important occasions, to express love, and are also the basis of global industries. Americans buy ten million flowers a day and perfumes are a worldwide industry worth $30 billion dollars annually. Yet, we know little about flowers, their origins, bizarre sex lives, or how humans relate and depend upon them.Stephen Buchmann takes us along on an exploratory journey of the roles flowers play in the production of our foods, spices, medicines, perfumes, while simultaneously bringing joy and health. Flowering plants continue to serve as inspiration in our myths and legends, in the fine and decorative arts, and in literary works of prose and poetry. Flowers seduce us—and animals, too—through their myriad shapes, colors, textures, and scents. And because of our extraordinary appetite for more unusual and beautiful “super flowers,” plant breeders have created such unnatural blooms as blue roses and black petunias to cater to the human world of haute couture fashion. In so doing, the nectar and pollen vital to the bees, butterflies, and bats of the world, are being reduced. Buchmann explains the unfortunate consequences, and explores how to counter them by growing the right flowers. Here, he integrates fascinating stories about the many colorful personalities who populate the world of flowers, and the flowers and pollinators themselves, with a research-based narrative that illuminates just why there is, indeed, a Reason for Flowers.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Nature",
    "Plants",
    "Gardening",
    "Natural History"
  ],
  "author": "Stephen Buchmann",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/22609521-the-reason-for-flowers"
}