{
  "title": "Five Days in May",
  "description": "\"DON'T NEVER UNDERESTIMATE THE POWER OF DOIN' THE RIGHT THING.\"A twister's coming. A big one, a monster F5--a mile wide and eight miles tall. The writhing finger of death hurls across the prairie toward Graham, Oklahoma, one Friday afternoon in May, 1963, on a collision course with the lives of 4 people—each of whom has already planned a personal rendezvous with death in some other form that day. In Jonas Cunningham’s mind, what he’s planning isn’t murder. The handful of little white pills that will free his precious Maggie from the fog of Alzheimer's is a gift, a final act of unconditional love. Jonas’s 16-year-old granddaughter, Joy, isn’t planning “murder” either. She's pregnant and sees only one way to keep from shaming her family. Secrets like that are hard to keep though, in a small town. Joy's father, Rev. Mac MacIntosh has lost his wife and his faith and on Friday, he plans to commit professional suicide—not just leave his church, but abandon his call to ministry. Princess has an appointment with the Reaper on Friday, too, one she’s been staring down for 14 years. At 5 o’clock, the state of Oklahoma will strap her into an electric chair called Sizzlin’ Suzie and turn on the juice. But as the strange, psychic death row inmate meets daily with the minister during the final 5 days of her life, everything in both their lives begins to change. Princess knows—about Mac’s life and family. And sees—the Big Ugly coming to eat up the world. She sees other terrible things, too, and is determined to carry to her grave an incredible secret about the little sister she confessed to beheading a decade ago. When the savage tornado roars with a sound like gravel in a blender into their small prairie town on that May Friday, all 4 of the people who'd penciled in \"death\" on their calendars actually do confront eternity. But none of them comes to the crossroads of life and death by the path they'd planned or leaves with the result they expected. In the end, the Big Ugly decides who lives and who dies that day.",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Paranormal",
    "Christian Fiction",
    "Fantasy",
    "Mystery Thriller"
  ],
  "author": "Ninie Hammon",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/22613169-five-days-in-may"
}