{
  "title": "War of the Encyclopaedists",
  "description": "In a superb, rare literary collaboration, two major new talents join their voices to tell the story of a generation at a crossroads, and a friendship that stretches over continents and crises--from the liberal arena of Boston academia to the military occupation of Iraq--in this ambitious and electrifying debut novel.On a summer night, in the arty enclave of Capitol Hill, Seattle, best friends Mickey Montauk and Halifax Corderoy throw one last blowout party before their lives part ways. At twenty-three, they had planned to move together to Boston for graduate school, but global events have intervened: Montauk has just learned that his National Guard unit will deploy to Baghdad at the end of the summer. In the confusion of this altered future, Corderoy is faced with a moral dilemma: his girlfriend Mani has just been evicted and he must decide whether or not to abandon her when she needs him most. He turns to Montauk for help. His decision that night, and its harrowing outcome, sets in motion a year that will transform all three of them.Months later, Corderoy and Montauk grapple with their new identities as each deals with his own muted disappointment. In Boston, Corderoy finds himself unable to play the game of intellectual one-upmanship with the ease and grace of his new roommate Tricia, a Harvard graduate student and budding human rights activist. Half a world away, in Baghdad, Montauk struggles to lead his platoon safely through an increasingly violent and irrational war. As their lives move further away from their shared dream, Corderoy and Montauk keep in touch with one another by editing a Wikipedia article about themselves: smart and funny updates that morph and deepen throughout the year, culminating in a document that is both devastatingly tragic and profoundly poetic.Fast-moving and compulsively readable, War of the Encyclopaedists beats with the energetic pulse of idealistic youth on the threshold of adult reality. \"A wise and wise-assed first novel...with sweep and heart and humor\" (Mary Karr, author of Liar's Club and Lit) it is the vital, urgent, and utterly absorbing lament of a new generation searching for meaning and hope in a fractured world.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "War",
    "Contemporary",
    "Novels",
    "Unfinished",
    "Military Fiction"
  ],
  "author": "Christopher  Robinson",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/22609602-war-of-the-encyclopaedists"
}