{
  "title": "Picturing Lysander",
  "description": "What's His Passion?   Explore our contemporary collection of men and their passions.  We all have our passions—whether they’re simple pleasures like fine wine and good music, or more ambitious like climbing mountains or jumping out of airplanes. It might even be revelling in the edgier side of sex!  Dive in and discover the many passions of the amorous men explored in our new imprint—What’s His Passion?     Picturing Lysander by L.M. Somerton    Photography, like love, should have no limits.   Lysander Brock is a talented photographer and capturing the perfect picture is his passion. His work takes him all over the world and he is famous for his willingness to take risks for the perfect image.  Kyle Dawson is tasked by his mysterious employer to obtain Brock’s services for a dangerous job and he’s prepared to use any method to ensure that the young photographer does as he’s told. Breaking and entering and blackmail are just tools of his trade.  Despite the circumstances, the spark of attraction between Brock and Kyle is strong. Brock’s addiction to adrenaline-fuelled adventure holds him captive, just as much as Kyle’s brooding dominant appeal. As a fragile trust builds between them, Kyle takes a gamble and tells Brock the truth about his mission. Can Brock accept the challenges ahead—as a photographer and as a man?  L.M. Somerton   About the   Lucinda lives in a small village in the English countryside, surrounded by rolling hills, cows and sheep. She started writing to fill time between jobs and is now firmly and unashamedly addicted.  She loves the English weather, especially the rain, and adores a thunderstorm. She loves good food, warm company and a crackling fire. She's fascinated by the psychology of relationships, especially between men, and her stories contain some subtle (and some not so subtle) leanings towards BDSM.",
  "genres": [
    "M M Romance",
    "BDSM"
  ],
  "author": "L.M. Somerton",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/22612624-picturing-lysander"
}