{
  "title": "Slate",
  "description": "All his life, Andy Jones has been looking after folks. Family and friends, he’ll break himself in half trying to make sure they get what they need. Finally taking something for himself, he hits the road astride a motorcycle, loving the freedom it provides. His travels bring him to Chicago, and Davis Mason, where he finds a sense of brotherhood he’ll do anything to keep. Anything.Full description:Andrew Jones grew up in a small town in Wyoming, and as a teen watched his family implode following his father’s death. Driven by a need to provide for his little brother and remaining family, he begins looking for work, restlessly traveling from job to job on his Indian motorcycle, looking for something he cannot define. Meeting Davis Mason, President of the Rebel Wayfarers MC in Chicago, is a central point in his life. Andy earns the name Slate, and over the following years gradually assumes the persona as first a prospect into Mason’s MC, then full patch member. He has finally found the brotherhood he longed for, the sense of connection and belonging…a family and a home. The only thing missing from Slate’s life is a woman who can love him…all of him. He finds his match in a daughter of the MC, and his dreams become filled with her silent smiles, unruly red hair, and soft curves. She’s wary and afraid, having been hurt in the past, but Slate works to gain her trust, slowly building something between them.Just as their relationship begins to grow, ghosts from their previous lives threaten to ruin everything. His brother comes to town, bringing his band and his own brand of troubles. Slate watches helplessly as events conspire to put the woman he loves in grave danger.Can he save his woman from the dangers brought to her doorstep by the past, or will she and their love be a casualty of conflict within the club.18+ due to explicit content. *Please note this book is part of the Rebel Wayfarers MC book series, featuring characters from additional books in the series. If the books are read out of order, you’ll twig to spoilers for the other books, so going back to read the skipped titles won’t have the same angsty reveals. I strongly recommend you read them in order. Available now: Mica (book #1), Slate (book #2), Bear (book #3), Jase (book #4), Gunny (book #5), Mason (book #6), Hoss (book #7), Duck (book #8), Watcher (book #9), Bones (book #10), Fury (book #11), and Cassie (#12).",
  "genres": [
    "Romance",
    "Contemporary",
    "Erotica",
    "Suspense"
  ],
  "author": "MariaLisa deMora",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/22610747-slate"
}