{
  "title": "Dwellers of Ahwahnee",
  "description": "The Dwellers of Ahwahnee (The Beyond Collection) is finally here! 3 Great paranormal books that follow the generation of shifters from the Ahwahneechee. These books are found on Goodreads lists and are #1 in many categories.Come to the Beyond for a supernatural unique read!BOOK 1: BEYOND BRIDALVEIL FALLOria is celebrating her eighteenth birthday in Yosemite National Park when she goes into the pool at the bottom of Bridalveil Fall, only to come out beyond it.In another world she learns she is The Golden Queen of the Ahwahneechee tribe, and that she is a shape shifter. Here the Dwellers of Ahwahnee fight the Evil that tries to get into the world of man. Will she find her soul mate in Grey Wolf or is he more than he appears to be? One thing is for sure, with all the magic and shape shifting happening, only the all knowing grandfather and her grandmother's wisdom can guide her through the Evil Beyond Bridalveil Fall.BOOK 2: BEYOND ORIA FALLSOria is the Golden Queen of the Ahwahneechees and a Dweller of Ahwahnee. Together with her friends she travels back to find out why the Village of Lost Souls cannot find their way home to the West. The Ale is back in this second book full of action packed magic and shapeshifting. Will Oria finally find love and happiness with Grey Wolf or will a new evil threaten her magical world Beyond Oria Falls? Join the Dwellers as they try to keep evil out of the world of man.BOOK 3: BEYOND THE WORLD OF MANThis is the third installment in the Dwellers of Ahwahnee series and with the destruction of the world of man, the Dwellers traveled to other worlds and survived for twenty years.With Oria's magic the 'Beyond' has grown and they can now come home.There is a different kind of evil in the world now. Who will survive in the 'Beyond'? This generationof shapeshifters are different and will lead the Dwellers into a new age.Spirit Walker is rebellious and has often been called a Wildcat. She has been sheltered in The Village of Lost Souls for her entire life. Now she is to become the Golden Queen of the Ahwahneechees.Her choices for the future involve adult decisions and with only her mother's journal to guide her, she must rely on the magic within the pages.",
  "genres": [
    "Mythology",
    "Young Adult",
    "Shapeshifters",
    "Paranormal Romance",
    "Inspirational",
    "Supernatural",
    "Paranormal"
  ],
  "author": "Sheryl Seal",
  "average_rating": "4.85",
  "url": "https://www.goodreads.com/book/show/22610866-dwellers-of-ahwahnee"
}