{
  "title": "Tita",
  "description": "Tita is seven, and she wonders what wrong with her. She has perfect parents. She puts on plays with her friends, spies on adults, challenges her teacher, and even manages to read forbidden books. She should be happy. But she dreams of a world without meals, and keeps worrying about her mother’s whereabouts, spoiling her own life for no reason at all. Tita wants to be good - but how?As her small town vibrates to age-old Latin rituals on the verge of slipping away, Tita finds refuge - and a liberation- in books.ADVANCE PRAISE FOR TITALike opening the door to a secret garden, TITA transports the reader straight into life in a small town in the south of France during the 1950s, as seen through the eyes of a precocious seven-year-old heroine not soon to be forgotten. Houzelle's prose is unfailingly deft and refreshing. This book is a delight! - Anne Korkeakivi, author of An Unexpected GuestMarie Houzelle is a master of the first-person narrative. In Tita she has created a strange, utterly original child whose deadpan certainties are a beguiling invitation to readers of all ages. Like Louise Fitzhugh's classic Harriet the Spy, the story is powered by a precocious and independent loner whose observations and reports are both charming and moving. Tita is a remarkable debut.- Katharine Weber, author of Triangle and True ConfectionsThe best book I read this year. Witty, wry, and clever, Tita s young voice captivated me from the first page. Tita poignantly portrays small-town life as well as the end of the Catholic church s grip on France, revealing cracks in society that a decade later become the riots of 1968. A rare novel written in English that gives a real taste of French culture. I cannot recommend it enough! - Janet Skeslien Charles, author of Moonlight in Odessa This book has a charm so unique and powerful, it pulls you in simply, effortlessly, like following a tree lined path on a summery day. The language is utterly original and quietly moving and very very funny and it makes you want to follow Tita onward past the last pages and into the years beyond. I loved it.-Nicola Keegan, author of Swimming",
  "genres": [
    "France",
    "Fiction"
  ],
  "author": "Marie Houzelle",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/22609502-tita"
}