{
  "title": "Angelwood. Kings & Queens",
  "description": "Glaubt Ihr wirklich, dass es keine Wunder mehr gibt? Dass alle Zuversicht verloren ist, nur weil die Welt immer trostloser, gemeiner und egoistischer wird? Denkt Ihr, all das fröhliche Lachen ist verstummt, weil unsere geheimen Wünsche von mürrischen Bösewichtern auf dem Friedhof der Träume vergraben wurden? Schließt Eure Augen, holt ganz tief Luft und glaubt fest daran, dann seht Ihr selbst, wie majestätische Drachen mit heißem Atem und gewaltigen Schwingen machtvoll über Eure Köpfe brausen und sehnsuchtsvoll Euren Träumen königliche Flügel verleihen. Verwegene Helden, deren tapferes Herz am rechten Fleck schlägt, deren glorreiches Schwert für die eine - oder manchmal auch andere - segensreiche Sache einen aufrechten Kampf gewinnt. Bezaubernde Prinzessinnen, die voller Sehnsucht und unsterblicher Liebe auf diesen einen Helden und Krieger warten, der sie aus den Fängen heimtückischer Halunken befreit. Treue Gefährten, die ohne Furcht vereint bis ans Ende der Welt gehen, auf deren Freundschaft man in jeder Schlacht, in jedem noch so scheinbar verlorenen Scharmützel zählen kann. Die Liebe einer Königin, der Stolz eines Königs, die vereint das Wohl der Menschen und ihrer Kinder behüten. Heller, leuchtender, strahlender als Ihr es je in Euren kühnsten Fantasien erahnt. Begebt Euch auf ein gefährliches Abenteuer und folgt mutig der wunderschönen Serenity, Prinzessin von ANGELWOOD, die gemeinsam mit ihren Freunden auf einer riskanten Reise, in der tugendhafte Werte wie Liebe, Glaube, Kraft, Respekt, Mut, Stolz, Ehre, Treue und tiefe Freundschaft mehr denn je im Kampf gegen das Böse gebraucht werden. Rettet gemeinsam mit den kühnen Gefährten den göttlichen Kompass vor dem Untergang der Menschheit. ANGELWOOD erzählt von Glück, aber auch von Schmerz. ANGELWOOD schmiedet neue Bündnisse zwischen Gut und Böse, erringt Siege und erlebt Niederlagen. ANGELWOOD überwindet den tiefen Graben verfeindeter Seelen und verbündet ehemalige Rivalen zu loyalen, aufrichtigen Freunden, die gemeinsam aufregende Abenteuer bestehen. ANGELWOOD weist menschliche Vorurteile hinter dessen Schranken und steht für das lodernde Feuer der Gleichheit und Integrität. ANGELWOOD ist dieser eine Augenblick, dieser magische Moment, der für jeden von uns alles bedeutet. Für den einen ist es die große Liebe oder der Traum vom ewigen Leben, für den anderen der Glanz eines gehobenen Schatzes oder das tiefe Vertrauen einer innigen Freundschaft. In Zeiten, in denen Menschen und unsere Gesellschaft wahre Werte und die Aussicht auf Glück, Glaube und Hoffnung verloren sehen, schuf Hendrik Birke gemeinsam mit seinem besten Freund, dem mehrfach ausgezeichneten chinesischen Illustrator Su Haitao, eine heiter-melancholische Geschichte voller Mut, Hoffnung, Freundschaft, Zuversicht und Liebe. Atemberaubender Zauber, düstere Magie und der stete Kampf zwischen Gut und Böse – all das ist ANGELWOOD.",
  "genres": [
    "Fantasy"
  ],
  "author": "Hendrik Birke",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/22616552-angelwood-kings-queens"
}