{
  "title": "Too Pretty",
  "description": "This is the story of how Barbarossa (Barbie to his friends) meets Steven. How Steven is an idiot. How drinking can ruin a friendship. And how a meddling cousin keeps everyone in line.This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. Dear Author,I hate it. I hated when this happened with strangers, but when it was someone I thought knew me it was even worse. I liked to wear my hair long, so what? Okay, my features are a little feminine and that green of my eyes is a bit intense, but I am way taller than most guys. I am 1.96m (that’s six feet, five inches) for God’s sake, how anyone can think I am a girl? I never thought of myself as a girl, I don’t wear female clothes, do I? How could have B thought me a girl? And we have been friends for weeks… I thought that I had finally found him, the perfect guy for me. How could I have been so wrong? Oh, I know how— these perfect, stormy grey eyes of him enchanted me, that perfect black hair made me forget my mind, and that body… oh, don’t he have the perfect body— so tall and muscular. Who could have thought that I will ever meet a guy taller than me? I have been used to being the tallest guy in class, always. ’Til I came here and met B. How could I have fallen for him so hard and so fast? It was not supposed to happen, because at the end of the day I have only one purpose— to kill.Photo Description: A young man stands with his eyes closed. He looks calm but confident. His long red hair is tousled by the breeze. His chest is thin and hairless over his jeans, where his thumbs are hooked in his pockets.This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.Please Note: This is just the first part of a much larger story.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Romance",
    "Friends To Lovers",
    "Contemporary",
    "Fantasy",
    "Gay For You"
  ],
  "author": "Ren Stjerne",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/22619155-too-pretty"
}