{
  "title": "Anterograde",
  "description": "Can love subsist without memories of itself? When Calden wakes up – every time he wakes up – the last thing he can recall is a debilitating headache that even his extensive medical background failed to identify as anything more serious than a regular headache. He also remembers his decision to tell his best friend Eli about his long-standing feelings for him… despite the fact that Eli is married. He remembers June second. But it is not June second anymore. The tattoos on his arm and chest prove it. They also tell him why he doesn’t remember anything past June second. But they’re only the beginning of an explanation. Knowing he has a rare type of amnesia and can’t form new memories is something he can understand; on the other hand, wrapping his mind around the fact that Eli shares his bed never fails to leave him in awe. When Calden wakes up – every time he wakes up – he gets to discover Eli is in love with him for the first time all over again. But how long can this relationship last when Eli is the only one who remembers every step of it? _____________ Please note - while both protagonists of this novel are human, the broader world in which they exist includes paranormal elements such as vampires and demons, which are alluded to during the story. _____________ The Demons Age  - Fangs & Lullabies (Lullabies series) - Demons & Lullabies (Lullabies series) - One Last Lullaby (Lullabies series) - No Crayons On The Front Line - Anterograde - His Sire's New Pet (His Dominant Sire series) - His Sire's New Game (His Dominant Sire series) - His Sire's New Rules (His Dominant Sire series) - Aria & Will - Blurred Nights (Blurred Trilogy series) - Blurred Bloodlines (Blurred Trilogy series) - Blurred Memories (Blurred Trilogy series)",
  "genres": [
    "M M Romance",
    "Disability",
    "Romance",
    "Science Fiction",
    "Friends To Lovers",
    "LGBT",
    "Fantasy"
  ],
  "author": "Kallysten",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/22616617-anterograde"
}