{
  "title": "Walk the Line",
  "description": "Sick of everyone around her assuming she's a meek little goody-two shoes, Abby Warner endeavors to do the most daring thing she can think of: get a tattoo    Brett McTavish thought he was in for another day of tattooing flash onto underage teenagers and drunken tourists at his biker family's parlor. But when the wide-eyed beauty comes slipping into his shop, his day starts to look infinitely more interesting.  Despite their vastly different backgrounds, Abby and Brett can't seem to keep away from each other. And before they know it, the tattooed bad boy and the shy photographer are falling for each other. Hard.  But when Abby is forced to confront the dangerous and illicit nature of the family business, will she stick around or watch Brett ride off into the dust?  EXCERPT  She felt privileged. She looked at them and tried to put as much appreciation and gratitude as she could into her earnest expression as she exclaimed over each piece.   “I try to find something beautiful in everything, even sadness and darkness,” he explained. “But I don’t think many people understand that.”   “I do,” Abby said, and he smiled warmly, reaching over and brushing her hair out of her face.  “Yeah, I think you do,” he said, leaning in close, his eyes flickering from her eyes to her mouth as if trying to gauge her reaction. Abby’s heart was hammering and she hoped that she was looking appropriately eager, so she leaned in boldly to accept the kiss.  His lips were surprisingly soft, the barest hint of stubble around his mouth and along his jaw only serving to entice and make her shiver at the mere thought of such a muscular and rugged man kissing her.   He was gentle at first, but soon enough his tongue was pressing against her lips and pushing inside insistently. Abby found herself leaning in closer and closer until Brett’s hands were on her hips and he was pulling into his lap.  She should have been mortified at how wanton and needy she seemed, straddling a man she had only just met after one kiss. But she gave no signs of wanting to stop, letting Brett’s hands run smoothly up and down her sides and clutch at her waist as he licked into her mouth.",
  "genres": [],
  "author": "Amy Love",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/22619056-walk-the-line"
}