{
  "title": "What to Read After FSOG: The Gemstone Collection",
  "description": "WTRAFSOG Gemstone Collection Part 3What to Read After Fifty Shades of Grey (#WTRAFSOG) began as a Facebook page created by Summer Daniels dedicated to helping book lovers discover great reads after Fifty Shades of Grey. This collection features seven incredible books from the top of the WTRAFSOG chart. Each book is unique and has a theme of its own, from sweet to sinister, and everywhere in between.Love Me For MeLauren HawkeyeSHORT BLURB:It's been three years since Serena King learned to say no--no to the boys that were a desperate cry for help, no to the extra weight she put on in self defense, and most of all no to the abuse that has haunted her since she was fifteen. Now a sophomore in college, all she wants is to be normal. The last thing she expects is a guy who can make her want, well, everything. Alex Blackthorn is a bundle of contradictions, a sexy dark haired badass who goes slow... deliciously slow. And despite the iron will that has gotten her through the last few years, Serena finds herself unable to ignore the heat that sizzles between them whenever they're together.House RulesLiz Crowe SHORT BLURB:Jack Gordon, real estate broker, licensed builder, Juris Doctorate, has had his fair share of strife. His ability to cope, to fall down and pick himself back up has lead him to a place where he believes he has it all. Friends, money, cars, more women than he can count, and a club in Detroit where he can exorcise his inner demons, fill his days and his nights.When he walks up to a penthouse door on a hot Ann Arbor summer afternoon, frustrated, exasperated and ready to call it quits after hours of condo shopping with a wealthy couple, the last thing on his mind is meeting his destiny.House Rules: The Jack Gordon Story. A prequel novella of the Stewart Realty Series.No More Wasted TimeBeverly PrestonSHORT BLURBAfter losing her husband to a sudden heart attack, Tess Mathews escapes to Bora Bora to lay her husband and sorrow to rest. What she doesn’t expect is a new beginning. Tom Clemmins is an A-list actor whose life revolves around work and an onslaught of women. He travels to Bora Bora for a much-needed break. Tom has a few ideas of how he’ll enjoy his vacation, but love isn’t one of them. Until he sees Tess. Tess is torn between tremendous guilt and zealous lust when their boat ride turns into a week full of romance and desire neither thought imaginable. Can she set aside her remorse in order to find a second chance at love?Moving ForwardErika AshbySHORT BLURB:Jesika Reynolds’ heart was left broken one year ago when her husband died, leaving her and her son alone in this world. Slowly, she started putting the pieces back together of her life. Knowing that she may never open herself up to love again. That was until the day Derek came into the picture.tDerek Jordan's charm drew her in with an instant connection, and familiarity that helps her feel at ease. Her heart is falling at his feet, but as their relationship grows, so does a secret from both of their pasts that neither saw coming. One by one, the threads slowly start to unravel.The Devil’s TattooNicole TaylorSHORT BLURB:Zoe Granger picked up her first guitar the day her heart was smashed into a billion pieces. He best friend, Dee, tricks her into fronting his band, The Devil’s Tattoo, and they’re soon thrust into the spotlight and right into the path of indie rockers, The Stabs.Will Strickland is one-fourth indie rock band, The Stabs, hot as hell and he's only got eyes for Zoe.The Devil's Tattoo and The Stabs go on the road and it's either going to be a highway to hell or a stairway to heaven. Only time will tell who will come out on top and Zoe's determined to do it without getting her heart broken… again.Sons of MayhemNikki PinkSHORT BLURB:Good girl college junior Nicole is bored. Bored of her boyfriend, bored of frat parties, bored of college life and bored of studying.When a chance to party with biker gang, the Sons of Mayhem, comes up she jumps at it. Feel the thrill of the ride with Nicole, Jase and the Sons of Mayhem in this romantic suspense biker romance novel.How He Really FeelsLisa SuzanneSHORT BLURBJulianne and her boss embark on a sexy affair that’s everything Julianne ever dreamed of... except she can’t tell anyone about it due to the company’s strict “No Dating” clause. What will happen if anyone finds out about their secret relationship? And how will Travis, her lifelong best friend, react when Julianne begins a relationship with someone who isn’t him?   Inoperative: Cyborg OneCharity ParkersonSHORT BLURB:Alexia is one of the few humans left who'd rather not have an android hanging over her shoulder all day. Unfortunately, when her job lands her on a list of people targeted by terrorists, she's assigned a Machine Industry Leading Edge Sentinel, or \"Miles,\" for protection. Per Miles programming, he shouldn't be able to override Alexia's commands. However, he defies her at every turn. The lines between reality and fantasy blur as Alexia's attraction for the mysterious android grows. Unfortunately, when she goes on a mission to seek the truth, what she learns might get her killed.Finding HomeLacey WolfeSHORT BLURB:Julie Miller returns to her hometown pregnant, seeking guidance from her mom. Only, she doesn’t find her mom, she finds a stranger at her mother’s house. Mark Thomas moved to Brookfield to escape a tortured past. Julie brings back feelings he long ago crushed deep inside him. Skyler TowerKhelsey JacksonSHORT BLURB:Evangeline Skyler has acquired everything she wanted in her life, she is a successful C.E.O. of Sky Tech. The only thing she doesn't have is a love life. When she meets a gorgeous dark haired man in a grey suit he starts to unravel her. Angelo Giovanni is there to interview the beautiful but secreted Ms. Skyler. When he sees her he is stunned, her pictures don’t do her justice. He will do anything to be the one she turns to. Someone is stalking her… But when someone starts stalking her and sending her creepy messages she turns to her long time driver and friend Axel Roberts. Who will be the one to steal her heart, and the one to break her trust?Summer’s Journey Volumes 1-4Summer DanielsSHORT BLURB:Join Summer on her journey of sexual self-discovery; a well written, intelligent and sexy series about the beginning of her sensual, sultry love affair with life, and all the joys of being a woman.",
  "genres": [
    "Anthologies",
    "BDSM",
    "Erotica",
    "Amazon",
    "Contemporary Romance"
  ],
  "author": "Lauren Hawkeye",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/22617621-what-to-read-after-fsog"
}