{
  "title": "Day of the Vikings",
  "description": "They were once the most bloodthirsty warriors alive. They will be again.\nShe has been called many things: murderer, madwoman, monster. She will become only one thing: a god.The Crone. A woman of legend, a creature of blood. A Valkyrie. She has tortured, murdered, maimed — performing all the rituals needed to call forth the power of Odin himself and summon Ragnarok. She just needs one more thing: the staff of Skara Brae, and her plans will be fulfilled.But the staff is already in the hands of Morgan Sierra. An agent of ARKANE, the British agency tasked with protecting the world from supernatural crises, Morgan knows that giving up the staff could spell the end of all things.Now the Crone has taken dozens of staff members, visitors — even children — hostage at the British Museum, demanding that Morgan turn over the staff. Willing to kill, possessor of powers beyond anything ARKANE has yet encountered, the Crone seems unstoppable. Morgan’s only advantages are her wit, her skill… and Blake Daniel (of the best-selling Brooke and Daniel crime thriller series). Cursed with clairvoyance, Blake’s powers may be just enough to help Morgan turn back the Crone and stop the end of the world.But the Crone has her own secrets. Able to weave illusions, to wield fear, even to call forth the dead Vikings of old. She is the most powerful adversary Morgan has ever faced. But will she be the last?The Crone beckons. Ragnarok looms. And it is up to Morgan and Blake to deny them both.Day of the Vikings is the fifth thrilling story in the bestselling ARKANE series by New York Times and USA Today bestselling author J.F. Penn, with an epic crossover to the Brooke and Daniel stories.",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery Thriller",
    "Novella",
    "Fantasy",
    "Suspense",
    "Adventure"
  ],
  "author": "J.F. Penn",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/22624338-day-of-the-vikings"
}