{
  "title": "Around the World in Eighty Documentaries: An Armchair Traveller's Guide to Eco Friendly Travel",
  "description": "This is a completely new kind of travel book. Not only does it recoil from profligate bucket lists and compilations of sites that must be seen before you die, it suggests that in the internet age, the very best way to see the world is actually from the comfort of your own armchair.Everybody knows that travel guidebooks are having tough times at the moment. Not only is the financial crisis biting into people's travel budgets but more and more travellers are sidestepping the guidebooks completely and doing all their research on line. Perhaps what you did not know is that there is a small group of super savvy travelers that have unlocked an even greater resource than blogs, review sites and online discounters; the travel documentary.It was not so long ago that travelers could only buy a handful of guidebooks. Stalwarts like Fodors' and Michelin catered mainly to high end business travelers. With the rise of budget travel came an explosion of travel guides until Lonely Planet, Rough Guides and Let's Go were covering enough countries to last most of us a lifetime. But things are about to change - big time. Once restricted to broadcasters and libraries, travel documentaries are suddenly now available to the masses. This genre is growing incredibly fast and there are now films featuring more destinations than any of us could possibly visit in a single lifetime. Are we about to see anther revolution in the travel industry?“Around the World in Eighty Travel Documentaries” features not only in-depth reviews of many great travel shows, it includes additional sections on how the newly informed reader can leverage this valuable new resource in many different areas, from education to environmental conversation.",
  "genres": [],
  "author": "Christopher D. Winnan",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/22631149-around-the-world-in-eighty-documentaries"
}