{
  "title": "Abigail's Melody",
  "description": "VOLUME 2, The Victorian Christian Heritage Series  PREGNANT ~ OUT OF WEDLOCK ~ BETRAYED ABANDONED... Can God's grace reach her now?  In 1906, ruin and scandal await Miss Abigail Careen Parker after she is abandoned by the man who pledged his love to her. Will one mistake destroy the rest of her life?  The seventh of ten children, born to a Kentucky clergyman at the turn-of-the-century-- present Abigail with daunting challenges. Not only must she deal with her broken heart, she desperately needs a father for her unborn child. Her family could be destroyed by the outcome of her indiscretions. If she remains in Kentucky, gossip will wreak havoc on not only her own life --and that of her baby, but the life her father built as a dedicated man of the cloth.  On top of everything else, she feels like she let God down and may never be good enough to be a faithful Christian. When she decides to flee to her sister Hannah in England, things get even more complicated.  Should she marry the English Viscount she's only known a few weeks-- or a Kentucky farmer she's known her whole life who promises to love her so much that she'll know what true love really is? She's not entirely sure of what to do, but she knows she has to leave everything she has ever known and make decisions from England to protect her father from gossip that will surely follow her poor choices. How could Jack have left her in this condition and can she ever forgive him?  When she steps off the steamship after crossing the Atlantic, the English countryside seems more dangerous than the gossip of the rural community she left behind her. Suddenly, there's Lady Winifred to deal with, who says SHE has a claim on the Viscount.  Things don't seem like they can get any worse until --she is abducted and held prisoner by a ruthless man who won't tell her where he's taking her... or what he wants. Who is behind the kidnapping and will the Viscount be able to rescue Abigail --and her broken heart?",
  "genres": [],
  "author": "Lisa M. Prysock",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/22630861-abigail-s-melody"
}