{
  "title": "Pact of Seduction",
  "description": "Four best friends embrace their fantasies and make a pact of seduction to live out their deepest and darkest desires. They place their lives in the hands of fate, and one short straw determines whose turn it will be to awaken her secret wishes.Bind MeReed, a Dom at sex club Castle Dolce Vita, has lived the BDSM lifestyle for awhile, but has yet to find a submissive that suits him. That is until he meets Marley, a woman seeking to indulge her fantasies.As Reed guides her through a night of pleasure, Marley brings more to him than a perfect submissive--she stirs emotions in him long ago lost. By binding Marley, he runs up against his own limits, and now he has to choose between his self-protective barriers or surrendering to the wildfire Marley has reignited in his heart.Beg for ItThe Pact of Seduction has one rule: fulfill your ultimate fantasy. Bella can't fulfill her vow but her failure spins her out into the unknown. Kole, a Dom at the sex club Castle Dolce Vita, wasn't part of her fantasy, but he intends to show her he should have been.Kole is more than willing to introduce Bella to BDSM, but the feisty woman isn't easily tamed. While she might be determined to keep him at a distance, Kole has other ideas. He won't allow her to shut him out. Through pleasure and punishment, Kole teaches Bella that she is now his submissive, and her place is under his command.Bet on EcstasyBusiness partners Smith and Brock share their fortune, success, and their women. A healthy competitive streak built MDR Software into a multi-million-dollar enterprise, and their ongoing bets continuously raise the stakes. The current proposition: an arranged menage encounter through the sex club, Castle Dolce Vita. The prize: a sexy kitten, Kyra.While the two wealthy, powerful men pique Kyra's interests to fulfill the Pact of Seduction and live out her ultimate fantasy, the bet forged between the men comes with an intriguing promise. Her pleasure is now part of their wager. The aftermath leaves her fighting against her desires and struggling to navigate the complications of a menage relationship.But the partners don't let go gracefully. They're determined to show Kyra that in this game of seduction no one loses.",
  "genres": [
    "Erotica"
  ],
  "author": "Stacey Kennedy",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/22632306-pact-of-seduction"
}