{
  "title": "Curse of the Black Avenger (Caribbean Chronicles)",
  "description": "If you drowned and the sea spit you out, thrusting you back into the golden age of piracy, buried treasure and beauty beyond belief... would you stay?Ricky Bradshaw is just another gangly freshman hoping to fit in -- or at least not get picked on -- and maybe catch the attention of Becky Nance, a girl in his biology class. Except sometimes Ricky \"zones out\" in class because he has absence seizures. If you've never heard of absence seizures, that's okay. A lot of people haven't. Ricky's teachers are a lot of those people. And that's what happens to Ricky on Christmas Eve: he has an episode. With his mom out of town and it snowing and popcorn popping in a faulty microwave, Ricky's apartment building catches on fire. Rushing out of the building, Ricky spies the pizza delivery guy with his dinner. Minutes later, cold, alone, and pretty sure he and the stupid microwave are the reason for the fire, he sits on the dock at the marina with cold pizza in his lap. It is then he feels an \"episode\" coming on. Before he can stop it, Ricky \"zones out\" and falls forward, tumbling into the creek.When he snaps out of it, Ricky is shirtless, wet, and on a raft in the middle of the Caribbean Sea being chased by pirates -- one of whom looks like Mr. Clawson, Ricky's English teacher. He concocts a plan to get back home, but in pirate land Ricky learns some things are worse than being unpopular in high school. MUCH worse. Like you can get cursed to sail with pirates forever and ever and ever.Written for the General Market (G): Contains no sexual dialogue or strong language. May also contain some content of an inspirational/religious nature.Moonbeam Book Award Winner & Selah Award Winner* Best Seller in Teen & Young Adult Pirate Adventure eBooks* Best Seller in Teen & Young Adult Christian Values & Virtues Fiction* Best Seller in Teen & Young Adult Fiction about Disabilities & Special NeedsInterview with the AuthorQ: Why should a boy or girl begin reading the Caribbean Chronicles Series?Novels in the Caribbean Chronicles Series are fast, fun, clean teen and tween books that take readers back to the Golden Age of Piracy. Boys and girls will fall in love with the quirky characters Ricky Bradshaw meets, their pirate sayings, not-so-bright antics, and the way Ricky helps capture ships and find treasure by using the skills and knowledge a 21st century boy would when thrust back into the age of pirates.Q: Why should parents buy the Caribbean Chronicles Series for their boys and girls?Parents will appreciate the positive moral values and the absence of profanity and sexual situations. As an awkward, self-conscious teen, Ricky struggles with absence seizures. But his episodes also provide a way for him to travel back in time and alter current and future events -- provided he can escape pirate land without getting killed.Q: What age is appropriate for these books?The Caribbean Chronicles Series is appropriate for mature sixth grade readers. Other parents may choose seventh or eighth grade, due to the fact that Ricky \nIS\n fighting with pirates. The blood and gore isn't too much, but pirates were not nice people. It's also a great, nostalgic read for adults who enjoy reading about pirates and sailing adventure stories. Beginning with the third book in the series, \nThe End of Calico Jack\n, each book focuses on the adventures of a real pirate.",
  "genres": [
    "Pirates",
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Childrens",
    "Middle Grade",
    "Adventure"
  ],
  "author": "Eddie       Jones",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/22633413-curse-of-the-black-avenger-caribbean-chronicles"
}