{
  "title": "Darwin on Trial",
  "description": "In 2006, Christianity Today voted this title to be one of the top 50 books that have shaped evangelicals! A Christianity Today 1992 Book of the Year Runner-up!Recipient of a Christianity Today 1992 Readers' Choice Award! Here's the book that has rocked the scientific--and Christian--establishment.Phillip Johnson's critique of Darwinian evolution touched off explosions among scientists and theologians almost from the day of its publication in 1992. The volatile debate was at first carried on in academic journals and in magazines like Nature and Scientific American. It even engaged the attention of leading evolutionists like Nobel Laureate physicist Steven Weinberg and prominent naturalist Stephen Jay Gould. Johnson was invited to debate several of his opponents at universities across the country. And he was himself the subject of debate: Michael Ruse, author of Darwinism Defended, spoke at an annual meeting of the American Association for the Advancement of Science on the topic \"Nonliteralist Anti-Evolutionism: The Case of Phillip Johnson.\"Darwin on Trial also shook up theistic evolutionists. William Hasker (Huntington College, Indiana) in the Christian Scholar's Review, Howard Van Till (Calvin College, Michigan) in First Things and Owen Gingerich (Harvard Center for Astrophysics) in Perspectives on Science & the Christian Faith all published their critiques of Darwin on Trial.Clearly, Johnson's arguments have been taken seriously by Darwinists of every sort. And though at first the mainstream press seemed to be out of earshot (except for reviews in Publisher's Weekly and The National Review), news of Darwin on Trial eventually reached wider audiences. Last summer, Johnson appeared with William F. Buckley on Firing Line. And in May 1995 he was interviewed on the PBS telecast In the Beginning: The Creationist Controversy with Randall Balmer. These and other indications of expanding interest in his critique is good news for all who wish to bring the debate over Darwinism into the bright light of day.",
  "genres": [
    "Science",
    "Nonfiction",
    "Christian",
    "Evolution",
    "Philosophy",
    "Religion",
    "Christianity"
  ],
  "author": "Phillip E. Johnson",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/22635.Darwin_on_Trial"
}