{
  "title": "Becoming Myself: Reflections on Growing Up Female",
  "description": "\"The women in this collection were asked, simply, to recall a significant memory of growing up female. They responded generously, with intimate stories of their lives. Instead of the superficial prepackaged blurbs of TV sound bites and press releases, they told stories from their hearts; they told secrets never spoken before. They revealed themselves through stories of personal confusion and discovery, pain and overcoming, rejection and celebration.\"•From Willa Shalit's IntroductionThe stories shared by these sixty-seven remarkable women—writers, actors, musicians, journalists, activists—include:•Kate Winslet on the media's eagerness to distort women's images.•Zane on her belief in a woman's right to satisfaction.•Lillian Vernon on being a trailblazing entrepreneur.•J.K. Rowling on the transformation wrought by giving birth.Filled with sparkling insights and powerful reflections, Becoming Myself is a gift for every woman.Contributors:Taina Bien AimeMaya AngelouLisa BernhardSylvia BoorsteinCarol Moseley BraunCarol ChanningGloria FeldtJyl Lynn FelmanSally FisherAnne GlauberCarole L. GlickfeldLynn GoldsmithLisa Gay HamiltonKitty Carlisle HartEsther HautzigEva HoffmanHelen HuntJanis IanRegina KingPatti LaBelleSuzanne MalveauxMargaret Hilary MarshallMarlee MatlinRue McClanahanMartha McPheeEnrique MercadoKate MichelmanLesléa NewmanJoyce Carol OatesTawni O'DellTatum O'NealSuze OrmanJ.K. RowlingRuth Knafo SettonBrooke ShieldsJamie Lynn SiglerBeverly SillsEsta SolerSuzanne SomersKate SpadeSusan StambergJulia StilesLuisah TeishLily TomlinNina TotenbergLillian VernonCora WeissVanessa WilliamsKate WinsletJudy WoodruffJudy Martin Zane",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Anthologies",
    "Short Stories",
    "Memoir",
    "Essays",
    "Autobiography"
  ],
  "author": "Willa Shalit",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/226320.Becoming_Myself"
}