{
  "title": "Celestra: Books 1-2",
  "description": "Skyla’s bloodlines may just be connected to the most powerful angelic beings that roam the earth, and the more she knows, the more danger she seems to be in.Young Adult Paranormal RomanceFrom the NEW YORK TIMES and USA TODAY bestselling author, Addison MooreThis Boxed set includes the first 2 books in the Celestra Series.The Celestra Series has been optioned for film by 20th CENTURY FOXPraise for Ethereal…Most addictive book for me since Sookie! – Amazon ReviewBest Kindle read of the year – MissTEthereal is a must read – Amelia SweetThe book is written beautifully and the plot unfolds delicately. It's a great story and I found the characters to be well thought through and impassioned. – Amazon ReviewIt’s one of the best stories I’ve read recently and I would place it on the bestseller shelf with out hesitation. – Amy Jones Young Adult Fantasy Fiction BlogWow oh wow is this book amazing ! It has been a while since I read a book I absolutely couldn't put it down. – Book EscapesI LOVED this book ... I cannot wait to see what happens with the characters. I recommend this book to anyone who is tired of the same old paranormal romance book. This book has it all.–Love Thy Teen Author BlogDefinite must read, and another new series I cant wait to read more of.– YA Lit LoversSixteen year-old, Skyla Messenger is a dead girl walking.When her newly remarried mother moves the family to Paragon Island, to a house that is rumored to be haunted, Skyla finds refuge in Logan Oliver, a boy who shares her unique ability to read minds.Skyla discovers Logan holds the answers to the questions she’s been looking for, but Logan’s reluctance to give her the knowledge she desires leaves her believing Logan has a few secrets of his own.Skyla’s bloodlines may just be connected to the most powerful angelic beings that roam the earth, and the more she knows, the more danger she seems to be in.Suddenly an entire faction of earthbound angels wants her dead, at least she still has Logan, or does she?TREMBLE (Celestra Series Book 2)Sixteen year-old, Skyla Messenger is determined to bring back the dead.For Skyla, being an angel from the coveted Celestra faction hasn’t been easy.An entire band of wicked angels is after her blood, a Sector is after something far more sinister, and her newfound powers lead her on a quest to save her dead father.Skyla and her boyfriend Logan try to piece together a plan to take down the Countenance in order to maintain their relationship, but will Skyla’s burgeoning feelings for Gage get in the way?And when Skyla decides to use her powerful blood to change the fate of another deceased soul, just who is going to stop her?",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Young Adult",
    "Romance",
    "Paranormal Romance",
    "Amazon",
    "Fiction"
  ],
  "author": "Addison Moore",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/22647063-celestra"
}