{
  "title": "Ghost Spin",
  "description": "Sometimes a ghost of a chance is all you get.Award-winning author Chris Moriarty returns to a dazzling cyber-noir far future in this gritty, high-stakes thriller where the only rule is “Evolve . . . or die.” The Age of Man is ending. The UN’s sprawling interstellar empire is failing as its quantum teleportation network collapses, turning once-viable colonies into doomed island outposts. Humanity’s only hope of survival is the a mysterious region of space where faster-than-light travel—or something far stranger—seems possible. As mercenaries and pirates flock to the Drift, the cold war between the human-led UN and the clone-dominated Syndicates heats up. Whoever controls the Drift will chart the future course of human evolution—and no one wants to be left behind in a universe where the price of failure is extinction.When the AI called Cohen ventures into the Drift, he dies—allegedly by his own hand—and his consciousness is scattered across the cosmos. Some of his ghosts are still self-aware. Some are insane. And one of them hides a secret worth killing for. Enter Major Catherine Li, Cohen’s human (well, partly human) lover, who embarks on a desperate search to solve the mystery of Cohen’s death—and put him back together. But Li isn’t the only one interested in Cohen’s ghosts. Astrid Avery, a by-the-book UN navy captain, is on the hunt. So is William Llewellyn, a pirate who has one of the ghosts in his head, which is slowly eating him alive. Even the ghosts have their own agendas. And lurking behind them all is a pitiless enemy who will stop at nothing to make sure the dead don’t walk again.Praise for Ghost Spin “Complexity is the watchword here, of thought, idea, narrative, character and plot. . . . Highly rewarding.” — Kirkus Reviews “Rewarding . . . The adaptations humans make to survive in the hostile environments of other worlds, a galaxy teetering on the edge of singularity . . . are genuinely visionary.” — Publishers Weekly “This stand-along ‘spin-off’ offers a compelling tale of adventure/suspense blended with cybernoir and high-tech sf.” — Library Journal “An excellent gripping, fast-paced, provocative and handsome.” — Tordotcom “A brilliant mix of space opera, cyberpunk, and just plain great writing, Moriarty’s work is some of the most impressive in science fiction today.” —SFRevu",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Cyberpunk",
    "Science Fiction Fantasy",
    "Space Opera",
    "Pirates"
  ],
  "author": "Chris Moriarty",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/11339114-ghost-spin"
}