{
  "title": "Looking for Peyton Place",
  "description": "For Annie Barnes, going home to Middle River means dealing with truths long hidden, some of which she buried there herself. But it is a journey she knows she must take if she is to put to rest, once and for all, her misgivings about her mother's recent death.  To an outsider, Middle River is a picture-perfect New Hampshire town. But Annie grew up there, and she knows all its secrets -- as did her idol Grace Metalious, author of the infamous novel Peyton Place, which laid a small town's sexual secrets bare for all the world to see. Though Grace actually lived in a nearby town, the residents of Middle River have always believed she used them as the model for her revolutionary novel, and some even insist Annie's grandmother was the model for one of Grace's most scandalous characters. With these rumors and whispers about Peyton Place haunting her childhood, Annie came to identify so closely with the author that it was Grace and her bold rebellion against 1950s conformity that inspired Annie to get out of Middle River and make a life for herself in Washington, D.C.  It's been a good life, too. Annie Barnes is now a bestselling author, reaching that level with only her third novel. Success has given her a confidence she never had as a young girl in Middle River -- and it has given the residents of that town something new to worry about. When they hear Annie is returning for a lengthy visit, everyone, including Annie's two sisters, believes she's coming home to write about them.  Though amused by the discomfort she causes in Middle River, Annie has no intention of writing a novel about the town or its people. It is her mother's death -- under circumstances that don't quite add up -- that has brought her back, and soon her probing questions start to make people nervous. When she discovers evidence of dangerous pollutants emanating from the local paper mill -- poisons that she comes to believe contributed to her mother's fatal illness -- Annie finds herself at odds with most of the town's inhabitants, including her sisters, both of whom are seemingly unfazed by the incriminating evidence she uncovers. Because the mill is the town's main employer, everyone is afraid of what might happen if Annie digs deeper, and their fears soon start to turn ugly.  For Annie, though, there is no turning back, as passion and rage propel her forward in a determined quest. Coming face-to-face with decades of secrets and lies, she knows she must find the strength to move beyond the legacy of Grace Metalious, defying her past to heal the wounds of the town and her own family.",
  "genres": [
    "Fiction",
    "Romance",
    "Mystery",
    "Chick Lit",
    "Contemporary",
    "Womens Fiction",
    "Adult Fiction"
  ],
  "author": "Barbara Delinsky",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/226447.Looking_for_Peyton_Place"
}