{
  "title": "Her Angel, His Devil",
  "description": "When you're about to lose the man you love do you let him go, or fight to keep him?  The city has changed and Abby Warner is sad to see her lover's family of bikers preparing to leave for new horizons. But when his family asks him to come with them, Brett decides he has to think about it. Abby doesn't want to push him into making a decision, even though the thought of losing her protective, bear of a man hurts more than she can stomach.  And when the appearance of an ex-lover, a sultry, leather clad vixen is an added temptation for him, Abby almost feels like giving up.  But she has been through too much to lose him now. She might not be a motorcycle riding badass, but she has done things that would frighten the leathers off of any man or woman and she's not about to give up her man without a fight.  EXCERPT  “It goes without saying that if you don’t want to go then we won’t go.”  Abby looked up at him, frowning. “You would really stay here for me just because I wanted to stay?”  She knew that she sounded really insecure and even a touch disbelieving, and she felt terrible about it, but Brett seemed to take it all in stride.  “Of course I would,” he said. “You’re the one who pushed me to make a break on my own in the first place, remember? And besides,” he said with a smirk, leaning down to cup a firm hand around her ass. “Where else would I find a body this fine?”  Abby gave him a playful shove and he went with it, stumbling backwards towards the front of the shop where he quickly flipped the closed sign on the door.  “Is that a good idea?” Abby asked. “We don’t want to turn away customers, after all.”  Brett scooped her up and swept her over a shoulder, fireman style, effortlessly carrying her upstairs to the apartment above. “It’s a better idea than letting anyone see what I’m about to do to you.”",
  "genres": [],
  "author": "Amy Love",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22635818-her-angel-his-devil"
}