{
  "title": "Wake Me Up",
  "description": "They’ll have to find their way back together to have a chance at saving the club he can’t afford to lose.  Caroline Lewis really hates bikers. After helping Mase Butler discover a ring of dirty MC members, and falling for the dangerously handsome biker in the process, she’s on the run, determined to get away from Mase, who broke her heart, and his so-called “brothers,” who want her dead for discovering their secret.  When Mase chose to turn away from Caroline, he thought it’d keep her safe from Declan McDermott, the dirty president of the Fallen Angels. But when she disappears, he’s terrified that she’s been taken by McDermott and he sets out to find her. When he discovers her hiding in a motel a few hours from home, he brings her to his place, against her will, to keep an eye on her.  Caroline is enraged when Mase drags her home to his house and keeps her there on lockdown, but Mase is determined to keep her safe, and is refusing to let her out of his sight. Caroline can’t control the way her body reacts to Mase, and soon, they’re picking up where they left off, but Caroline won’t let her guard down this time. Mase knows she’s holding back, but he’s determined to win her over, and keep her for good this time.  But as they get closer to each other, McDermott gets closer to them. Mase has to find a way to bring him down, for good, or he’ll risk his girl, his life, and the club he’s trying to save.  Excerpt  And then he was gone, and she waited on the bed, wondering what in hell she was doing to herself. The man had gone into a full on panic attack at the barest conversation about what might come next in a relationship. There was no way that this relationship was going to work long term. But the way he touched her, the way he made her body come alive—maybe they could work something out. She knew she wanted to try. For now, that would have to be enough.  He came back after a few minutes, and she’d never been so happy to see a little foil square in a guy’s hand. “I am the happiest man alive.”  “Not yet,” she said, reaching for his hand and pulling her down onto the bed next to her. “But you will be.”   “I like the sound of that.”",
  "genres": [],
  "author": "Laura   Day",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/22635816-wake-me-up"
}