{
  "title": "The Collected Stories of Philip K. Dick, Volume 4: Minority Report",
  "description": "A fitting tribute to a great philosophical writer who found science fiction the ideal form for the expression of his ideas - The IndependentThe fourth volume of the definitive five-book set of the complete collected stories of the twentieth century's greatest sf author covers a wide span, from late 1954 through to 1963. Those were the years during which Dick began writing novels prolifically and his short story output lessened. The title story of this collection is being made into a Steven Spielberg movie of the same name, while \"The Days of Perky Pat\" inspired one of Dick's greatest works, the novel The Three Stigmata of Palmer Eldridge; The Penultimate Truth grew from \"The Mold of Yancy\". Philip K. Dick is shown at his incomparable prime in this stunning collection.An elusive and incomparable artist - Ursula K. Le Guin He stamped himself not only on our memories but in our imaginations - Brian AldissCover Illustration: Chris Moore.Volume 4/5 contains:- Autofac (1955)- Service Call (1955)- Captive Market (1955)- The Mold of Yancy (1955)- The Minority Report (1956)- Recall Mechanism (1959)- The Unreconstructed M (1957)- Explorers We (1959)- War Game (1959)- If There Were No Benny Cemoli (1963)- Novelty Act (1964)- Waterspider (1964)- What the Dead Men Say (1964)- Orpheus with Clay Feet (1987)- The Days of Perky Pat (1963)- Stand-By (1963)- What'll We Do with Ragland Park? (1963)- Oh, to Be a Blobel! (1964)Other editions of this volume have the same stories, and were published under these titles:- The Days of Perky Pat,- The Minority Report,- The Minority Report and Other Classic Stories.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Short Stories",
    "Audiobook",
    "Science Fiction Fantasy",
    "Classics",
    "Crime"
  ],
  "author": "Philip K. Dick",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/226470.The_Collected_Stories_of_Philip_K_Dick_Volume_4"
}