{
  "title": "They Who Fell",
  "description": "From Book 1:  With tens of thousands of downloads, readers are calling They Who Fell \"absolutely epic\" with a \"phenomenal plot\" and an ending \"where your jaw will drop.\"  “Excellent writing, great characterization and a phenomenal plot landed They Who Fell at a solid 5 star rating.” - Kindle Reviewer ★★★★★ They say that long ago, there was a rebellion in Heaven. That an army of angels sought to seize the throne, and were cast down into the pits of Hell in punishment. Those are the affairs of angels, and everything would have been fine if they’d kept them to themselves. But there’s been another uprising, and another Fall. Cast down to Earth, the rebel angels ravaged the globe in an orgy of sin and violence as they indulged in their newfound freedoms. Their new home is the Perch, a black, towering monstrosity that blights what’s left of the New York City skyline. Life inside the Perch means you watch your tongue, if you’re a servant. Jana has lived there since she was a child, and now she’s found herself thrust into the middle of angelic politics. Some of them want to torture her, just for the fun of it. Others say they want to protect her. And Rhamiel, a charismatic and powerful angel with one of the few faces that wasn’t burnt and scarred by the Fall, is relentlessly pursuing her affections.Life outside can be just as dangerous. Strange things fell with the angels and wander the countrysides. The roads are filled with Vichies, cringing humans who’ve thrown their lot in with their oppressors and won’t hesitate to take advantage of the weak. But some are still fighting, including William Holt. He leads a small cell of fighters, searching for a way to strike back against the angels without getting themselves killed in the process. And all around, the fallen angels inflict their savageries on the dwindling remains of humanity, enjoying every vice they’d been forbidden during their long centuries of service.Why did the angels fall? How will humanity survive when its guardians have turned against them? And can love between an angel and a human redeem them?Scroll up and click the buy button to find out, or read for free on Kindle Unlimited. Amazon readers love this book! Praise for They Who Fell: “The ending was absolutely epic and left you really wanting more.” - Kindle Reviewer“I thoroughly loved this story.” - Goodreads Reviewer“I devoured this book in one sitting!” - Kindle Reviewer“Excellent writing, great characterization and a phenomenal plot landed They Who Fell at a solid 5 star rating.” - Kindle Reviewer“Holy awesome surprise!” - Kindle Reviewer“It's the very end where your jaw will drop.” - Kindle Reviewer“The angels are among some of the best villains I read in a long time.” - Kindle Reviewer“An inventive, clever and all together unique take on the end of the world as we know it.” - Kindle Reviewer“The book was so good I skipped breakfast, lunch and dinner to finish it.” - Kindle Reviewer“I CANNOT WAIT FOR THE NEXT BOOK!!!!!” - Kindle Reviewer",
  "genres": [
    "Fantasy",
    "Fiction",
    "Paranormal",
    "Angels",
    "Young Adult",
    "Dystopia",
    "Paranormal Romance"
  ],
  "author": "Kevin Kneupper",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/22637998-they-who-fell"
}