{
  "title": "The Zebra Affaire",
  "description": "The critically acclaimed novel set in 1976 apartheid South Africa. It tells of the courage of love across the color divide – especially in the face of an unyielding racist police state, and the extreme lengths a man and a woman must go to remain together. When Stanwell Marunda, a proud descendant of the Zulu, meets the beautiful Elsa, the daughter of a white farmer, he is certain his bad luck has just begun. She has just rescued him, bloodied and hurt, from a car wreck. However, as the two of them recklessly begin an intense affair, Stanwell hopes his fears are not realized. First, he must recover from his injuries. This forces him to depend on her. Then he gets a surprise visit from the state’s security branch, the obsessive and brutal Malan Zander. Secrets and suspicion begin to follow him. As intimidation and adversity strike his friends and loved one, Stanwell is forced to confront the frightening truth… Is Elsa really the girl of his dreams – or could their affair be fatal? When affairs of the State battle affairs of the heart, ordinary people become heroes! The Zebra Affaire is a cautionary tale, a gripping story of a forbidden romance that shocked a nation and the corrupt and cruel powers used by an intolerant regime determined to stop it. The Zebra Affaire is a thrilling fusion of romance and suspense—laced with rich South African history. The tension is palpable as the persecuted couple race against time and bigotry. Reviewers rave about this intimate, yet dangerous love story; that’s set against a canvas that is both vividly authentic and powerfully provocative. \"A book to savor slowly...appreciating each moment...such was the quality of the writing. One of the best books I've read this year.\" - Jean Gill, author of 'Song at Dawn' \"The story of Stanwell and Elsa really touched me. Racial discrimination was so dehumanizing. It was a real privilege to read the history, a period of pain and hope, as seen through Mark Fine's eyes.\" - Thandi Lujabe-Rankoe, Former Freedom Fighter & Senior South African Diplomat \" The Zebra Affaire grips your soul and won't let go. Never mind zebras, think lions, raw and roar.\" - Geoff Nelder, author of ' Left Luggage' \"INTENSELY DAZZLING...NOT A BLACK AND WHITE STORY, A RAINBOW STORY WITH THE RICH COLORS OF LIVES IN TURMOIL.\" - Elizabeth Newton, author of 'View from the Sixth Floor'",
  "genres": [
    "Fiction",
    "Historical",
    "Romance",
    "Historical Fiction"
  ],
  "author": "Mark Fine",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/22646297-the-zebra-affaire"
}