{
  "title": "Vaclav and Lena",
  "description": "NAMED BY THE NATIONAL BOOK FOUNDATION AS A 5 UNDER 35 AUTHOR   Vaclav and Lena seem destined for each other. They meet as children in an ESL class in Brighton Beach, Brooklyn. Vaclav is precocious and verbal. Lena, struggling with English, takes comfort in the safety of his adoration, his noisy, loving home, and the care of Rasia, his big-hearted mother. Vaclav imagines their story unfolding like a fairy tale, or the perfect illusion from his treasured Magician’s Almanac. But one day, Lena does not show up for school. She has disappeared from Vaclav and his family’s lives as if by a cruel sleight of hand. For the next seven years, Vaclav says goodnight to Lena without fail, wondering if she is doing the same somewhere. On the eve of Lena’s seventeenth birthday he finds out. In Vaclav & Lena, Haley Tanner has created two unforgettable young protagonists who evoke the joy, the confusion, and the passion of having a profound, everlasting connection.   Look for special features inside. Join the Random House Reader’s Circle for author chats and more.   Praise for Vaclav & Lena   “Wonderful and wrenching . . . Vibrant characters, believable romance and dark undertones make for a moving tale.”—The New York Times   “From the moment they meet, Vaclav and Lena make magic together. . . . Through all the twists and turns of the book, the most enduring theme of the novel is love.”—NPR   “Haley Tanner’s assured narrative voice finds new ways to describe emotion and character, stunning the reader again and again with small shocks of awareness. This book is sad, funny, true, and shot through with grace.”—Judy Blundell, National Book Award–winning author of What I Saw and How I Lied   “Highly recommended . . . Tanner’s captivating debut novel is a love story of unusual innocence and intensity [and] a suspenseful, literary work that is hard to put down.”—Library Journal   “A debut to savor . . . Tanner’s charming story unfolds as gracefully as a flower.”—People   “The magic Tanner makes is as dazzling as it is profound.”—Booklist",
  "genres": [
    "Fiction",
    "Young Adult",
    "Romance",
    "Book Club",
    "Contemporary",
    "Coming Of Age",
    "Russia"
  ],
  "author": "Haley Tanner",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/11339182-vaclav-and-lena"
}