{
  "title": "Tarnhelm: The Best Supernatural Stories of Hugh Walpole",
  "description": "Sewn hardback printed and bound by Bath Press in blue wibalin cloth stamped in silver, with head and tailbands. 350 copies. (500 copies, according to the copyright page)Contents: -An Introduction by George Gorniak-The Clocks/ The Twisted Inn/ The Silver Mask/ The Staircase/ A Carnation For An Old Man/ Tarnhelm Or, The Death of My Uncle Robert/ Seashore Macabre/ The Little Ghost/ Mrs Lunt/ The Snow/ Miss Morganhurst/ Mrs Porter and Miss Allen/ Lizzie Rand/ The Tarn/ Major Wilbraham/ The Tiger/ Hugh Seymour (A Prologue)/ Angelina/ ’Enery/ The Fear of Death/ Field With Five Trees/ The Conjurer/ The White Cat/ The Perfect Close/ Mr Huffam, A Christmas Story. 'If subtlety, originality and ambiguity are hallmarks of the best supernatural tales, then Walpole’s stand with the very best.’—So writes George Gorniak in his Introduction to this definitive collection of the most admired of Hugh Walpole’s supernatural and macabre shorter works, along with two previously uncollected early masterpieces, ‘The Clocks’ and ‘The Twisted Inn’. Perhaps best known for The Herries Chronicle (1930-34), four historical Lakeland novels which remain in print to this day, Walpole was widely recognised in his own lifetime as a consummate literary craftsman with a fine narrative style and an admirable ability to portray character, humour and dialogue. In classic tales such as ‘The Silver Mask’, ‘Tarnhelm’ and ‘The Snow’, he also demonstrates beyond question that he understood the experience of sheer, stark terror. Walpole had a deep and abiding interest in the supernatural and consistently incorporated macabre, mystical and supernatural elements in his work. He also exhibits a markedly modern understanding of the psychological, and it is this combination which allows his more traditional ghost stories, such as ‘The Little Ghost’ and ‘Mrs Lunt’, to retain their power today. This collection of twenty-five stories should help renew the recognition enjoyed by Walpole in his own lifetime. As he said himself ‘. . . the creator who relies more upon the inference behind the fact than upon the fact itself, more upon the dream than the actual business, more upon the intangible world of poetry than upon the actual world of concrete evidence, this kind of creator will come into his kingdom again.’",
  "genres": [
    "Short Stories",
    "Fantasy"
  ],
  "author": "Hugh Walpole",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/2263694.Tarnhelm"
}