{
  "title": "Hot Ink",
  "description": "Sometimes the bad guys aren't the most dangerous.  Abby Warner is happy, working on her photography and spending time with her lover, Brett, at his tattoo parlor. She is used to the parade of leather clad bikers parading in and out of the studio, Brett's unconventional family and friends welcoming her with open arms. She's even learnt to love the feel of a thrumming engine between her legs, almost as much as the nights spent with her rough and tough bad boy between the sheets.  The local council isn’t so forgiving, and when a planned cleanup of the tourist strip is announced, Brett's beloved tattoo parlor is the first to be named. They're not just going to stand by and let their home be taken away from them. But when they decide to fight back, things start to get dangerous.  Who do you turn to when the supposed good guys are the ones you should fear the most?  EXCERPT  Unfortunately, the next words out of her mouth were, “Your apartment isn’t exactly habitable right now.”  Brett laughed, not offended in the least. “Yeah, but when they let us back in and I get it fixed up, would you?”  Abby wanted to say that she’d think about it, but really she knew she didn’t have to. Every time she came home to her apartment it felt too far away from Brett and from the people that she had started to find a real camaraderie with. And even the last week or so, where she had been almost constantly by his side, it had felt completely natural and not at all like the massive and potentially ruinous step that it was supposed to be. So, in response she just smiled and tightened her arms around him.  “Yes, I’d love to,” she said. “But if you ever push me out a window again I swear you’ll be getting more than a twisted ankle next time.”  “Really?” Brett leered, rolling them to the side and pinning her wrists above her head as he leaned over her, grinning. Abby tried to pull her hands free but of course she couldn’t, so she just lay there struggling and panting until he pressed a surprisingly gentle kiss against her lips. “I am so glad you’re all right, baby. I was fucking terrified.”  “I know,” Abby said. “So was I. But we’re here now and we're okay.”  “I think I should still check you over for injuries,” Brett said, pulling her bath robe open and looking up and down her naked body.  “Are we playing Doctor?” Abby giggled and he shrugged.  “Why? Would you rather we play fireman? Want to hold my hose?” He was naked, already half-hard and growing as he winked at her.",
  "genres": [],
  "author": "Amy Love",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/22635817-hot-ink"
}