{
  "title": "Red Rook",
  "description": "Alice Gailsone is back, and bigger than ever in the second novel in the Gailsone series!Alice was promised a vacation after her ordeal in Japan, and her employers at the Collective Good have held up their end of the bargain. She and her mother have been booked on the Aquatica Goliath, the crown jewel ship of the Tanner fleet. With her grouchy assistant, Aika Fukijima (also known as the International assassin, the Lotus) in tow, she plans on kicking back and enjoying herself. Unfortunately, her mother plans on spending some quality time with billionaire Alan Tanner, who has agreed (at the request of Alice’s mother) to accompany them on their vacation. With a blatant agenda of trying to set her daughter up and getting some grandchildren before her cancer can claim her, Dorothy is keeping her daughter on her toes. It’s all Alice can do to stay sane and professional as things heat up, in every sense of the word. Alice’s plans for relaxation get derailed, however, when Aika accidentally stumbles across a bloody conspiracy that puts everyone on board at risk. With the death toll rising and questions abound, can Alice keep her family and friends safe from what looks to be a major operation? Will Aika survive at the hands of the superhuman soldiers onboard?Meanwhile, Allison Gailsone, Alice’s niece and closest confidant, finds herself thrown into the middle of a bloody and botched kidnapping attempt on a seemingly-innocent little girl. When Allison steps in to help, she finds herself dragged into a tangled and dangerous web of deception, lies and violence that gives her a run for her money. Even with the help of Victoria Green and of a mysterious, bubbly waitress, Allison is going to have to use every trick she knows to keep her new charge safe, even if it kills her. And with sections of New York going up in flames and a mad dash for survival before her, it very well might.With villains becoming bolder and plans becoming clear, it’s only a matter of time before things come to a head. The Purge is making their move, and the Gailsone clan is caught right in the middle. With heroes and villains alike dropping like flies and the deadly Totallus stepping out of the shadows at last, things are about to get serious. Join Alice, Allison and the rest of the gang in this action-packed follow-up to Big In Japan. The puzzle pieces are coming together as to whom Anna and Totallus are and what they are after, and as more players take the stage, the Red Rook Scenario promises to change the playing field between good and evil, forever.Red Rook is the second in a series of Action/Adventure Urban Fantasy novels about the Gailsone family. Join Alice and Allison as they deal with insubordinate golems, super villain gangs, secret psychics, armed soldiers and insane, killer androids. Follow along as secret plots and sinister forces worm their way out of the shadows to test not only Alice, but the other 'heroes' of the Gailsone universe. A larger plan is unfolding with terrifying implications for the world, and Alice, whether she likes it or not, is still stuck smack dab in the middle.Red Rook is the second book in the Gailsone series, and follows Big In Japan and the novella collection, Black Days.",
  "genres": [
    "Superheroes"
  ],
  "author": "Casey Glanders",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/22665590-red-rook"
}