{
  "title": "The Wright Brothers",
  "description": "The #1 New York Times bestseller from David McCullough, two-time winner of the Pulitzer Prize—the dramatic story-behind-the-story about the courageous brothers who taught the world how to fly—Wilbur and Orville Wright.On a winter day in 1903, in the Outer Banks of North Carolina, two brothers—bicycle mechanics from Dayton, Ohio—changed history. But it would take the world some time to believe that the age of flight had begun, with the first powered machine carrying a pilot. Orville and Wilbur Wright were men of exceptional courage and determination, and of far-ranging intellectual interests and ceaseless curiosity. When they worked together, no problem seemed to be insurmountable. Wilbur was unquestionably a genius. Orville had such mechanical ingenuity as few had ever seen. That they had no more than a public high school education and little money never stopped them in their mission to take to the air. Nothing did, not even the self-evident reality that every time they took off, they risked being killed. In this “enjoyable, fast-paced tale” (The Economist), master historian David McCullough “shows as never before how two Ohio boys from a remarkable family taught the world to fly” (The Washington Post) and “captures the marvel of what the Wrights accomplished” (The Wall Street Journal). He draws on the extensive Wright family papers to profile not only the brothers but their sister, Katharine, without whom things might well have gone differently for them. Essential reading, this is “a story of timeless importance, told with uncommon empathy and fluency…about what might be the most astonishing feat mankind has ever accomplished…The Wright Brothers soars” (The New York Times Book Review).",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Audiobook",
    "Book Club",
    "American History",
    "Aviation"
  ],
  "author": "David McCullough",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/22669004-the-wright-brothers"
}