{
  "title": "All That Is Native and Fine: The Politics of Culture in an American Region",
  "description": "In the American imagination, the word Appalachia designates more than a geographical region. It evokes fiddle tunes, patchwork quilts, split-rail fences, and all the other artifacts that decorate a cherished romantic region of the American mind. David Whisnant challenges this view of Appalachia (and consequently this broader imaginitive tendency) by exploring connections between a comforting cultural myth and the troublesome complexities of cultural history. Looking at the work of some ballad hunters and collectors, handicraft revivalists, folk festival promoters, and other cultural missionaries, Whisnant discovers a process of intentional and systematic cultural intervention that had (and still has) far-reaching consequences. Why, Whisnant asks, did so many Bluegrass ladies and upper-class graduates of Seven Sisters colleges rush to erect cultural breakwaters around mountaineers? Why would a sophisticated New England woman build a Danish folk school in western North Carolina? Why did a classical musician from Richmond who hated blacks love southern mountain music? How did the notions and actions of all these cultural missionaries affect the lives of the mountaineers? And what do these episodes of intervention teach us about culture and cultural change--in Appalachia and elsewhere? Whisnant pursues these and other questions in closely documented case studies of the Hindman Settlement School in eastern Kentucky, the cultural work of Olive Dame Campbell throughout the mountains, and the White Top Folk Festival on the Virginia-North Carolina border. Moreover, he relates them to broader social and economic developments of the late nineteenth and early twentieth centuries: the comingof the railroads and the opening of the mines, the Depression, the advent of TVA, and more diffuse processes such as urbanization, the decline of agriculture, the movement of radio and the commercial recording industry into the mountains, and the implicit restrictions Victorian America placed on the political perspectives and activities of socially conscious upper-class women. We must begin to understand the politics of culture, Whisnant writes, especially the role of formal institutions and foreceful individuals in defining and shaping perspectives, values, tastes and agendas for cultural change. All That Is Native and Fine opens the way not only to a reexamination of the history of a single region but also to a more sophisticated understanding of the dynamics of cultural continuity and change in other regions and in the nation as a whole.",
  "genres": [
    "Folklore",
    "History",
    "Nonfiction"
  ],
  "author": "David E. Whisnant",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/1134094.All_That_Is_Native_and_Fine"
}