{
  "title": "A Glory Days Reunion",
  "description": "Book 3  Understand Me  Getting away from the abuse of a lover was how I ended up working for the hottest rock band to hit the airwaves in a decade. Glory Days was my way out, and the one place I thought I could hide from him. Kane Maddox, the sexy as hell drummer for the band, talked a good talk, but I wasn’t ready to get involved with anyone again, let alone another rockstar. Kane could see the scars underneath my tattoos and showed me a life I’d always dreamed of. Until one night, when my past finally catches up with me, and I suffer again at the hands of a monster.  Beg Me  Being away from Delilah…yeah, that didn’t work out so well for me. It’d been THREE months since she went to Glory’s Place, the women’s shelter for abused women. I wasn’t allowed to see her, or even visit. My anxiety was at full force, my concentration was nonexistent. Centering myself was hard. Nothing I did helped my control, and I was quickly losing my mind. The one thing I needed, to get my head on straight, was not something I’d ever ask of her. How do you ask your lover, who’d been in an abusive relationship for the past four years, to strike you with a leather strap? How could you tell her that feeling the leather kiss your skin was the best sort of therapy you’d ever received.  Break Me  When your world suddenly crashes around you, how do you keep from losing all control? My father, showing up in Los Angeles, was not expected. When I find out he’s dying, I do what a neglected daughter does. I run to his side, hoping for answers. The ones I find are not what I wanted to hear from the man who created me. Kane surprised me, by being the one light in my life that was quickly falling dark. When the demons of my past suddenly appear, Kane is the one who holds it together when I need him the most. Trying to plan a future is hard, even on the road. When the worst possible person shows back up in my life, Kane is the one to protect me. Kane is the one who will heal me. Kane is the one strong enough to fight my demons for me.",
  "genres": [],
  "author": "Theresa Hissong",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/22667487-a-glory-days-reunion"
}