{
  "title": "The Del Rey Book of Science Fiction and Fantasy: Sixteen Original Works by Speculative Fiction's Finest Voices",
  "description": "With original stories by Jeffrey Ford, Pat Cadigan, Elizabeth Bear, Margo Lanagan, and othersFrom Del Rey Books and award-winning editor Ellen Datlow, two of the most respected names in science fiction and fantasy, comes a collection of fifteen all-new short stories, plus a science fiction novella, that could count as a virtual “best of the year” anthology. Here you will find slyly twisted alternate histories, fractured fairy tales, topical science fiction, and edgy urban fantasy. In “Daltharee,” World Fantasy Award-winning author Jeffrey Ford spins a chilling tale of a city in a bottle–and the demented genius who put it there. In “Sonny Liston Takes the Fall,” John W. Campbell Award-winning author Elizabeth Bear pens a poignant and eerie requiem for the heavyweight forever associated with his controversial loss to Cassius Clay. From hot new writer Margo Lanagan comes “The Goosle,” a dark, astonishing take on Hansel and Gretel. In the novella “Prisoners of the Action,” Paul MccAuley and Kim Newman take a trip down a rabbit hole that leads to a Guantanamo-like prison whose inmates are not just illegal but extraterrestrial. Many of the writers you’ll recognize. Others you may not. But one thing is certain: These stars of today and tomorrow demonstrate that the field of speculative fiction is not only alive and well–it’s better than ever.The Elephant Ironclads • shortfiction by Jason StoddardArdent clouds • shortfiction by Lucy SussexGather • shortfiction by Christopher RoweSonny Liston Takes the Fall • shortfiction by Elizabeth BearNorth American Lake Monsters • shortfiction by Nathan BallingrudAll Washed Up While Looking for a Better World • shortfiction by Carol EmshwillerSpecial Economics • novelette by Maureen F. McHughAka St. Mark's Place • shortfiction by Richard BowesThe Goosle • shortfiction by Margo LanaganShira • shortfiction by Lavie TidharThe Passion of Azazel • shortfiction by Barry N. MalzbergThe Lagerstätte • shortfiction by Laird BarronGladiolu Exposed • shortfiction by Anna TambourDaltharee • shortfiction by Jeffrey FordJimmy • shortfiction by Pat CadiganPrisoners of the Action • shortfiction by Paul J. McAuley and Kim Newman [as by Paul McAuley and Kim Newman ]",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Science Fiction",
    "Fiction",
    "Anthologies",
    "Speculative Fiction",
    "Collections"
  ],
  "author": "Ellen Datlow",
  "average_rating": "3.14",
  "url": "https://www.goodreads.com/book/show/2267010.The_Del_Rey_Book_of_Science_Fiction_and_Fantasy"
}