{
  "title": "One Ride",
  "description": "Librarian's Note: This is an alternate cover for ASIN B00HG15RHMDelilah “Doll” Reklinger never imagined her life with anyone that wasn’t a Hellion. She never imagined there would be a Hellion that could prove himself worthy enough to her father, Roundman, Hellions Club President. Content in living in the bubble of safety the motorcycle club family has always provided, Doll never thought that danger surrounded her. Roundman has kept the Hellions contained for the last thirty years by controlling the chaos surrounding their lifestyle. When the dangerous side to their business comes knocking on his door, he realizes his precious Doll isn’t safe. The Hellions code may be that women and children are off limits in any altercation or dispute, but that doesn’t mean their enemies follow that same moral compass. His only child, now in danger from the association to him and his club, Roundman makes a decision. He sends her away with a charter club member that he trusts, in hopes that the trouble won’t follow. One ride across the country. One simple ride. Talon “Tripp” Crews has been ordered to take Doll on one ride away and to keep her safe. She’s off limits. His head knows this, but his body can’t deny the attraction. She’s feisty, fierce, and fearless. Constantly in close confines together, can they deny the chemistry? Will they give into the desire? Can one ride turn lust into love? *This book contains explicit sexual material, adult language, and situations not suitable for readers under the age of 18* This book contains strong language and strong sexual situations. Please do not buy if any of this if any of this offends you. This is not meant to be a true or exact depiction of a motorcycle club rather a work of fiction meant to entertain.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "Audiobook",
    "New Adult",
    "Adult"
  ],
  "author": "Chelsea Camaron",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/22668299-one-ride"
}