{
  "title": "Shoot The Moon",
  "description": "Book #6 in the Scorpio Stinger MC SeriesRazor & Lexi's STORYIt’s rawer, it’s grittier and downright dirtier than any of the other Scorpio Stinger MC books. If what’s happened before has shocked and delighted you, get ready to be rocked on a whole new level. Meet the anti-hero and the spitfire in SHOOT THE MOON. Shoot the Moon 1. To attempt the near-impossible. 2. To take a risk for great rewards. 3. To set one’s sights high and try for something that one wants badly, but for which realistically the probability of success is not good. anti-hero 1. Morally ambiguous and flawed hero who is hard and jaded and not entirely pure but has hidden noble intentions. 2. A bad boy with heroic qualities. spit·fire [spĭt′fīr′] 1. A person, especially a girl or woman, who is of fiery temper and easily provoked to outbursts. 2. Wild & free. Someone whose angry words sting like fire. Considered strong emotionally & spiritually. 3. Someone who you don't want to be on the bad side of. SHOOT THE MOON Razor has some heavy boots to fill. He’s always lived in the shadow of his brothers and he’s sick of it. Lexi is wild and out of control. She won’t be told what to do and she has a filthy mouth that’s gotten her into more trouble than she can admit. He wants her from the first moment he lays eyes on her. She only has eyes for another man she can’t have. He’s determined to claim her and make her his. She fights him tooth and nail. Is Razor the one man who can tame her and make her his? NB: No cheating involved. Standalone novella. You don’t need to read the other books in the series to enjoy Shoot The Moon, but it would help you understand the characters better as you will have met them throughout the rest of the Scorpio Stinger MC series.  READING ORDER #0.5 Ryder Prequel #1 Two Worlds Colliding #2 Unchain My Heart #2.5 A Biker Christmas #3 Gods & Monsters #4 Tormented #5 Road To Destiny #6 Shoot The Moon Warning: Piercings, tattoos, overload of sex and foul language. Read at your own risk.",
  "genres": [
    "Romance",
    "Drama",
    "Suspense",
    "Adult"
  ],
  "author": "Jani Kay",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/22668979-shoot-the-moon"
}