{
  "title": "A Highlander’s Destiny",
  "description": "This digital boxed edition contains 4 complete novels. Strength, Love and Courage Highland Healer by Willa Blair He needs her for his clan. He wants her for himself. Can he have both? Toran Lathan never expected to become Laird, and never expected to meet a woman like Aileanna Shaw. Her healing ability is just what his people need, but Toran cannot resist her beauty. Yet will loving him destroy her ability to heal? Aileanna Shaw has a healing touch--­and a special talent she must keep secret. Stolen from her home by a marauding army, she's kidnapped again by the Highland Laird she heals. Is she a prize of war, or the prize of his heart? While Toran battles the invading lowland army, he also battles his desire for Aileanna. And Aileanna must decide if she can trust her secrets to this fierce warrior who needs her talent, but wants her love. Beyond a Highland Whisper by Maeve Greyson The last time Latharn MacKay walked among his kinsman was in Scotland of 1410. Sensuous and charismatic, all the women wanted him, but none could capture his heart. Latharn's charm became his curse when a dark sorceress didn't take rejection well. She snared his soul into a crystal globe until the one woman destined to be his love whispered his release. Now all Latharn has to do is find her and guide her to him without speaking a word. One of the youngest archeologists in St. Louis of 2010, Nessa credits one thing for this achievement: the recurring dream of a heart-­stopping Highlander since the summer she turned eighteen years old. Little does she know, he's not some fantasy cooked up by her subconscious. He's a trapped soul determined for Nessa to end his six centuries in hell. Can love prevail over the dark magic of a woman scorned? Into The Scottish Mist by Beth Anne Miller Abby Sanders returns to her beloved Scotland after a long absence, seeking peace after a terrible tragedy. A chance detour reunites her with Ian Mackenzie, the love she left behind four years ago. Their attempt to rekindle their romance along the shore of Loch Ness is cut short when Abby vanishes. After a desperate search for the woman he's spent four years trying to forget, Ian is forced to believe the unbelievable: he must travel through the mists of time to find Abby. But finding her is just the beginning. Trapped four hundred years in the past, Abby and Ian must find a way to end a bitter clan feud or sacrifice their return to the present and their future together. Immortal Justice by Faith V. Smith Over a millennium ago, Highlander Darach MacRath was murdered. Resurrected by the Archangel Michael to fight demons as an Immortal Executioner, Darach now opposes all evil in the mortal world. His life is solitary—but when he rescues a young woman who not only sees demons but battles them herself, he is captivated by her courage and beauty. Abigail Dupree is not looking for love. But when a tall, dark demon fighter with a sexy brogue intervenes in her hunt, she’s fascinated. She should run away—but then his gentle yet sizzling touch ensnares her heart. When a demon from Darach’s past sets his sights on Abby, Darach will do anything to protect her—but for Abby, losing him would be worse than death. Together they must fight the demons of past and present, and the possibility that evil could destroy them both, before they find the gift of love.",
  "genres": [],
  "author": "Willa Blair",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/22669833-a-highlander-s-destiny"
}