{
  "title": "Romance Super Bundle II: Second Chances",
  "description": "Eleven romances from New York Times, USA Today and bestselling, award-winning authors.The blockbuster box set with more than 100,000 copies sold is back for more! We've got a lonesome cowboy, a spurned bride-to-be, a heartbroken widower and an unexpected pregnancy, along with a tasty smattering of intrigue, murder and suspense. Almost half a million words and two thousand pages of strong heroes and daring heroines who'll do anything for a second chance at love.Second Chances—Dale MayerGo ahead. Take Charge of your life. Move forward...if you can...Changing her future means letting go of her past. Karina heads to a weekend seminar and comes face to face with the man she can’t forget. But she soon realizes bigger issues are facing her... And one of them is deadly...The Perfect Blend—Donna Marie RogersCarrie is on the verge of bankruptcy when Matt walks in and offers her unwanted business advice. The rich playboy fled L.A. for the anonymity of small town life and quickly falls for the local coffee shop owner—who’s as infuriating as she is beautiful.The Heart of the Matter—Stacey Joy NetzelHeartbroken she can’t have kids, Allie keeps her distance when Rick moves home with an adorable four year-old son who’s as hard to resist as his father. Does she dare take a chance on an impossible dream, or will his desire for more kids devastate their future?Meghan's Wish—Amy GametMeghan O'Connor returns to the family she ran away from as a teenager, afraid they won't forgive her for leaving town with Liam Wheaton, the boy they tried so hard to keep her away from and the father of her baby. She never expected to find Liam living there, looking sexier than ever and mad as all hell.Mo's Heart—Edie RamerMo Vincent did the right thing in New Jersey, and it cost him his son, his wife, his restaurant. Now he’s found a home in Miracle, Wisconsin. He should be content...but his heart wants what he can’t have...Hooking Mr. Right—Lois WinstonA failure at relationships, Thea Chandler is secretly a bestselling romance advice guru. Luke Bennett, New York’s most eligible bachelor, thinks he’s finally found an honest woman, but Thea’s got more secrets than the CIA. Can a butt-ugly cat named Cupid play matchmaker? The Lost Finder—Pamela FryerThe first halfway decent guy to come along in eons...and he’s from another planet. Private Investigator Brooke Weaver hopes she can slip into her Oregon hometown, find her client’s missing teenage daughter, and be on her way again before anyone notices. Not likely.Cape of Secrets—Georgina LeeMarika Host lands a dream summer job helping renowned archeologist Sir William write his memoirs, exposing years of secrets. His son Derrick adds romance to her summer, but when Sir William is murdered, Marika realizes some secrets are best kept buried.Shattered—Kate KellyFailing to save his sister’s life, Jay Rawlings insists he be left alone to live the lonesome cowboy life. But when the woman he once loved returns to his ranch with a killer and the police in hot pursuit, Jay has to face the demons from his past.In His Embrace—Wendy ElyWhen life’s glow threatens to die, love guides the way. Tori expected an ordinary Friday. It wasn’t. Ben’s hand rested on her hip a little longer during their goodbye. Then her tests came back abnormal. Scared and alone, she wishes for Ben’s hand to hold.How To Woo... A Reluctant Bride—Lyndi Lamont A marriage of convenience, nothing more...until darkly handsome Evan Channing and demure Lydia Blatchford meet. The rules are simple for such an arrangement. No expectations, no illusions of anything more. But the rules are about to change...",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Collections",
    "Amazon",
    "Anthologies",
    "Chick Lit"
  ],
  "author": "Dale Mayer",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/22674121-romance-super-bundle-ii"
}