{
  "title": "The Fatal Diners' Club",
  "description": "alternate cover edition for ASIN B00CJB4T82They Don’t Question Your Right to Life, They Deny It!The Diners' Club is illegal, the nation on the verge of self-destruction, the president resolute that she will not fail. Her most crucial mandate: Destroy the clandestine club and its founder before he destroys her.She recruits Secret Service Agent Lorie Wilson and Navy SEAL Dwayne Michaels whose mission is not to question the right to life, but to deny that right!Edward Riley is ruthless, the third generation of the nation’s wealthiest family and master puppeteer whose mother believes was born without a soul, those around him expendable in a throwaway world. Yet, above all, he fears death.Synopsis:Lorie Wilson loathes Dwayne Michaels, despite which the president recruits them to find and kill Hilary Basil together.Edward Riley fears death. He’s the third generation of the nation’s wealthiest family whom his mother believes was born without a soul.He sees the good in evil, the quantifiable value in deceit and subterfuge. He is a master manipulator of weaker minds, of those who believe in him.Priscilla Vendôme is a young, beautiful newswoman. She’s the nation’s sweetheart, lured into Riley Corp. to share Riley’s dream. She becomes his confidante and lover, shocked to discover she will become the first female president of the United States and mother of the Corporation’s future chairman.President Vendôme wastes no time startling her nation, assailing what the country falsely believes are their human rights. They’re wrong; she’s right. They have no choice. She is resolute.Re-elected, with six months remaining before she must disband her covert agency and return to private life as co-chairman of Riley Corp., her single failure is Hilary Basil and The Diners’ Club.She wants desperately to speak with the girlfriend she must now instead disavow. She misses Lorie, unaware that Agents Wilson and Michaels are with Hilary Basil at his home.",
  "genres": [],
  "author": "Doug  Booth",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/22672610-the-fatal-diners-club"
}