{
  "title": "The Evolution Trilogy & Prequel: Hybrid, Complications, Return, & Emily",
  "description": "Caitlin Chance and Steven Thorn are about to discover that life does not always go in the direction you envisage. When they first meet, they are overwhelmed by an irrational attraction. First love strikes when you least expect. Unfortunately, Steven has a secret past that is destined to reveal itself. Soon he will become a stranger to everyone and his new life in Brazil will begin. People like him are not meant to live amongst normal humans. The wheels are set in motion for his radical upheaval. But, love is a powerful thing and the connection forged between Caitlin and Steven is not easily broken. Steven will have to disregard what he is and where his loyalty should lie. Everything is possible at an unforeseeable cost. Decisions have to be made and rules will be broken.From the University of Southampton to the depths of the Amazon jungle in Brazil, Steven and Caitlin will discover that in the game of love, destiny is always the winner.***** PRAISE FOR THE EVOLUTION TRILOGY“The Evolution trilogy was so much fun to read! All the components of a good series are there and I found myself thinking about the characters constantly. For me that is the sign of a good book - I can’t get the characters out of my head, they come to work and the gym with me and I try to figure out what will happen next. I fell in love with Caitlin and Steven, the main characters in Hybrid, joined in on their adventures in Complications, and was rewarded with a finale that tied up all of the details and loose ends in Return book 3… A very satisfying ending! I highly recommend this trilogy.” Susan“A great set of books. A must read for all. Imaginative story somehow believable. I would like to visit the community myself.” Lovely Lane“Really enjoyed all 3 books, find them so readable and hard to put down. As soon as you start reading you feel involved in the story.” Julie“I loved the entire trilogy and would recommend it to anyone who enjoys a paranormal story with a twist and some romance. I am impressed that the scenes that could have quickly turned these books into erotic were kept “clean” and “classy” while still bringing all of the emotion of the action between characters.” My Book Fairy“... while I’ll be sad to see it go, how thrilled I am to have any sort of melancholy feeling about saying goodbye to characters I’ve worried over and rooted for so long? The truth is that I’ve been rather disappointed in the final book in trilogy series of late, so it means something to me that Ms. Wester has taken great care not to make a cookie cutter everyone-gets-everything-they-want-in-the-end final book; nor does she envision the alternate gloomy world which has also plagued trilogies of late (Allegiant or Mockingjay, anyone?) As a matter of fact, Ms. Wester derives a way to both answer our must-know questions while also leaving a decent bit to our imaginations, an approach I appreciated...and one that will no doubt lead me towards reviewing more of this talented author’s work in the future.” Lydia Aswolf via GoodreadsVisit www.theevolutiontrilogy.blogspot.com to find out more.",
  "genres": [
    "Romance"
  ],
  "author": "Vanessa Wester",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/22674016-the-evolution-trilogy-prequel"
}