{
  "title": "Patriot Eats!",
  "description": "“Patriot Eats!” is a vivid and colorful new presentation of a truly important piece of American culinary history. It’s a cookbook - the very first published in the new United States of America - that contains the food wisdom and recipes that truly fueled a revolution. Originally composed by Amelia Simmons, and published shortly after the end of the Revolutionary War, the book covers everything from how to buy the best produce to elegantly simple desserts that everyday colonists loved. This is the real food that fed the new nation. It is the priceless traditional know-how, stored in “Patriot Eats!”, that makes it important. With today’s ever-growing emphasis on eating healthy, “real” food, prepared simply and nutritiously, here is a collection of recipes and practices that embody just that. Written by a cook who, by our standards, had only crude kitchen accommodations to work with, she could create multiple meals, every day, for a large, hard-working family, using local produce and meat, without refrigeration, running water, or microwave ovens. It’s pretty amazing, and amazingly, pretty simple. If the food motto of our times is, as Micheal Pollan put it, “Don’t eat anything your grandmother wouldn’t recognize.” then “Patriot Eats,” should be the basis for everyone’s diets - simple, natural, tasty food that your grandmother’s great-great-grandmother would recognize! What we did to create “Patriot Eats!” was craft a completely new book out of the old one. We wanted something that was thoroughly up-to-date in appearance, and that would make the old \"receipts\" easier to use. So, we originally opted to create only a special digital edition. We created a fun and simple layout that would take advantage of the interactive tools offered up by the iPad, while not getting in the way. Now, due to the many requests we've gotten for a print edition, we went back to work and and created a paper version of Patriot Eats!, for those folks who just want to work from a physical book. We worked hard to find a way to maintain the look and feel of the interactive version, which wasn't easy. But, we are thriled with the results. So, now you have a digital or paper. Either way, this is information, and food that belongs in every well-prepared kitchen bookshelf. Give yourself a little license for experimentation and fun, and you will create your own dishes \"historic\" dishes. Have fun!",
  "genres": [],
  "author": "Perry Vayo",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/22674671-patriot-eats"
}