{
  "title": "The Usual Rules",
  "description": "It's a Tuesday morning in Brooklyn--a perfect September day. Wendy is heading to school, eager to make plans with her best friend, worried about how she looks, mad at her mother for not letting her visit her father in California, impatient with her little brother and with the almost too-loving concern of her jazz musician stepfather. She's out the door to catch the bus. An hour later comes the news: A plane has crashed into the World Trade Center--her mother's office building.Through the eyes of thirteen-year-old Wendy, we gain entrance to the world rarely shown by those who documented the events of that one terrible day: a family's slow and terrible realization that Wendy's mother has died, and their struggle to go on with their lives in the face of such a crushing loss.Absent for years, Wendy's real father shows up without warning. He takes her back with him to California, where she re-invents her life: Wendy now lives more or less on her own in a one-room apartment with a TV set and not much else. Wendy's new circle now includes her father's cactus-grower girlfriend, newly reconnected with the son she gave up for adoption twenty years before; a sad and tender bookstore owner who introduces her to the voice of Anne Frank and to his autistic son; and a homeless skateboarder, on a mission to find his long-lost brother.Over the winter and spring that follow, Wendy moves between the alternately painful and reassuring memories of her mother and the revelations that come with growing to know her real father for the first time. Pulled between her old life in Brooklyn and a new one 3,000 miles away, our heroine is faced with a world where the usual rules no longer apply but eventually discovers a strength and capacity for compassion and survival that she never knew she possessed.At the core of the story is Wendy's deep connection with her little brother, back in New York, who is grieving the loss of their mother without her. This is a story about the ties of siblings, about children who lose their parents, parents who lose their children, and the unexpected ways they sometimes find one another again. Set against the backdrop of global and personal tragedy, and written in a style alternately wry and heartbreaking, The Usual Rules is an unexpectedly hopeful story of healing and forgiveness that will offer readers, young and old alike, a picture of how, out of the rubble, a family rebuilds its life.",
  "genres": [
    "Fiction",
    "Young Adult",
    "Historical Fiction",
    "Coming Of Age",
    "Contemporary",
    "Realistic Fiction",
    "New York"
  ],
  "author": "Joyce Maynard",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/226796.The_Usual_Rules"
}