{
  "title": "Disney Lands",
  "description": "Graduation from high school has left five kids who worked for Disney on separate tracks. Nicknamed the Kingdom Keepers for having battled the Disney villains and won, Finn, Philby, Charlene, Maybeck, and Willa will soon be off to college.But not so fast. At a Disney convention, something goes horribly wrong. Deadly wrong. The Kingdom Keepers are reminded that evil can be beaten, but rarely defeated.The group's leader, Finn Whitman, is convinced that an unexplainable, mysterious message is for real. His friends couldn't disagree more. Despite the strain it puts on their friendships, and Finn's own accountability, he is determined to follow the message to its logical end.Soon, Finn is sneaking around Disneyland at night, entering places he shouldn't, and unwinding a puzzling riddle—all without the help of his friends.In California, two sisters, Jessica and Amanda, partners of the Keepers, have been accepted into Disney's School of Imagineering, an elite educational institution whose mission is to develop the next great creative thinkers within Disney. The school dorm is inside an old hotel that looks an awful lot like Tower of Terror! It holds carefully guarded secrets that no student is allowed to see. But the sisters will do anything to help the Keepers. When they are asked to explore the forbidden areas of the old hotel, they do so at their peril.These worlds collide in The Return, a term of special importance to the Kingdom Keepers. Nothing is simple. With each layer of the puzzle Finn peels back, several more are revealed. Only Jess and Amanda can help make sense of things, but the lurking evil is not content to allow any of this to happen. As attractions in Disneyland come alive with dangerous characters who shouldn't even exist, and the dark reaches of the hotel reveal secrets no one ever wanted exposed, the Kingdom Keepers and the Fairlie sisters face a world they never knew existed, yet a world without which they would not exist themselves.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Middle Grade",
    "Fiction",
    "Adventure",
    "Mystery",
    "Science Fiction"
  ],
  "author": "Ridley Pearson",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/22675928-disney-lands"
}