{
  "title": "Angels & Alphas",
  "description": "Becoming AlphaTessa doesn’t realize that kissing the wrong guy in her new Texas town could land her in far more trouble than she ever imagined. Like being forced to attend St. Ailbe’s Academy, a secret boarding school for werewolves. Even if the wrong guy did accidentally turn her into one of “them,” Tessa can’t help her growing attraction to the mysterious Dastien Laurent. But when vampires attack St. Alibe’s and her visions pinpoint an enemy in their midst, Tessa realizes that boy drama and her newfound canine tendencies might just be the least of her problems. AngelboundEighteen-year-old Myla Lewis is a girl who loves two kicking ass and kicking ass. She’s not your every day quasi-demon, half-demon and half-human, girl. For the past five years, Myla has lived for the days she gets to fight full-blooded demons in Purgatory’s Arena. But when the demons start to act weird, even for demons, and the King of Hell, Armageddon, shows up at Myla’s school, Myla knows trouble is coming with a capital T. Things heat up when Myla meets Lincoln, a super-sexy half-human and half-angel demon hunter. But what’s a quasi girl to do when she falls for a demon hunter? With a love worth fighting for, Myla may just shake up Purgatory.Bonus CipherIn the not-too-distant future, the color of your helix tattoo shows your DNA’s quality…and Cipher’s red helix is a death sentence that’s kept her on the run for twelve years. Now, Cipher wants her life back. Hacking into the Citadel mainframe is a huge risk, and the only person in the Arizona Voids that can help her is her oldest friend, Knight. She hasn’t seen him in person since she started running, and Knight 2.0 is fully upgraded with a six-pack and knee-melting smile. For a girl like Cipher, trust doesn’t come easily, but Knight makes her yearn for a life she knows she can’t have, especially when every secret she reveals endangers them both.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Angels",
    "Young Adult"
  ],
  "author": "Christina Bauer",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/22675290-angels-alphas"
}