{
  "title": "A Question of Honor: The Kosciuszko Squadron: Forgotten Heroes of World War II",
  "description": "A Question of Honor is the gripping, little-known, and brilliantly told story of the scores of Polish fighter pilots who helped save England during the Battle of Britain and of their stunning betrayal by the United States and England at the end of World War II.Centering on five pilots of the renowned Kosciuszko Squadron, the authors show how the fliers, driven by their passionate desire to liberate their homeland, came to be counted among the most heroic and successful fighter pilots of World War II. Drawing on the Kosciuszko Squadron’s unofficial diary–filled with the fliers’ personal experiences in combat–and on letters, interviews, memoirs, histories, and photographs, the authors bring the men and battles of the squadron vividly to life. We follow the principal characters from their training before the war, through their hair-raising escape from Poland to France and then, after the fall of France, to Britain. We see how, first treated with disdain by the RAF, the Polish pilots played a crucial role during the Battle of Britain, where their daredevil skill in engaging German Messerschmitts in close and deadly combat while protecting the planes in their own groups soon made them legendary. And we learn what happened to them after the war, when their country was abandoned and handed over to the Soviet Union.A Question of Honor also gives us a revelatory history of Poland during World War II and of the many thousands in the Polish armed forces who fought with the Allies. It tells of the country’s unending struggle against both Hitler and Stalin, its long battle for independence, and the tragic collapse of that dream in the “peace” that followed. Powerful, moving, deeply involving, A Question of Honor is an important addition to the literature of World War II.",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "World War II",
    "Poland",
    "Aviation",
    "Military Fiction"
  ],
  "author": "Lynne Olson",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/2267634.A_Question_of_Honor"
}