{
  "title": "The Bigger They Are",
  "description": "This story contains sexually explicit content in the form of really, really hot man-sex and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. It was originally published as a free read as part of the M/M Romance Group’s “Love's Landscapes” event on Goodreads.comWe met them in Mission: X— the adorable, bouncing bottom-boy and his big, bad Daddy. A romance that produces such a delicious couple is bound to be a scorcher. This is their story.For years, Charlie kept a protective, but professional, watch over Wren. The sweet, surprisingly unspoiled, rich-kid just seemed to stumble unwittingly into trouble. But one day, called to retrieve a very drunk Wren from a college party, Charlie got far more than he bargained for when Wren— a suddenly very grown up Wren— revealed his surprising crush and his far too tempting body.Wren lost his best friend, the only person he truly trusted, in one stupid, drunken moment of weakness. He was determined, though. He knew he hadn't imagined Charlie's physical response when he'd been pressed against him. It was just a matter of figuring out how to convince the older, bigger, stronger man— who tripped every single one of Wren's triggers— that he could be everything Charlie needed.But a year later, Wren is losing faith, and he's beginning to spin out of control. Charlie is rapidly losing sight of the logical list of reasons he should stay away. Wren is exhibiting the needy kind of behavior that demands consequences. The Dominant in Charlie is becoming louder and more demanding by the day. A collision is inevitable. A hot, fiery explosion that will shatter everything on impact. But with a little help and a lot of luck, maybe— just maybe— they'll walk away more whole than they've ever been.Note: This is a stand-alone prequel to Mission: X and, as such, Mission: X does not need to be read first.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Contemporary",
    "Romance",
    "Erotica",
    "Short Stories",
    "LGBT"
  ],
  "author": "Kim Alan",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/22676680-the-bigger-they-are"
}