{
  "title": "Cherokee Women in Crisis: Trail of Tears, Civil War, and Allotment, 1838-1907",
  "description": "Explains how traditional Cherokee women's roles were destabilized, modified, recovered, and in some ways strengthened during three periods of great turmoil. American Indian women have traditionally played vital roles in social hierarchies at the family, clan, and tribal levels. In the Cherokee Nation, specifically, women and men are considered equal contributors to the culture. With this study, however, we learn that three key historical events in the 19th and early 20th centuries—removal, the Civil War, and allotment of their lands—forced a radical renegotiation of gender roles and relations in Cherokee society. Carolyn Johnston (who is related to John Ross, principal chief of the Nation) looks at how Cherokee women navigated these crises in ways that allowed them to retain their traditional assumptions, ceremonies, and beliefs and to thereby preserve their culture. In the process, they both lost and retained power. The author sees a poignant irony in the fact that Europeans who encountered Native societies in which women had significant power attempted to transform them into patriarchal ones and that American women struggled for hundreds of years to achieve the kind of equality that Cherokee women had enjoyed for more than a millennium. Johnston examines the different aspects of Cherokee women's power: authority in the family unit and the community, economic independence, personal autonomy, political clout, and spirituality. Weaving a great-grandmother theme throughout the narrative, she begins with the protest of Cherokee women against removal and concludes with the recovery of the mother town of Kituwah and the elections of Wilma Mankiller and Joyce Dugan as principal chiefs of the Cherokee Nation and the Eastern Band of Cherokees.",
  "genres": [
    "Native American",
    "Indigenous",
    "Feminism"
  ],
  "author": "Carolyn Ross Johnston",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/2268409.Cherokee_Women_in_Crisis"
}