{
  "title": "Save the Males: Why Men Matter Why Women Should Care",
  "description": "Tell a woman we need to save the males and she’ll give you the name of her shrink. But cultural provocateur Kathleen Parker, who was raised by her father and who mothered a pack of boys, makes a humorous case for rescuing the allegedly stronger sex from trends that portend man’s cultural demise.Save the Males is a shrewd, amusing, and sure-to-be-controversial look at how men, maleness, and fatherhood have been under siege in American culture for decades. Kathleen Parker argues that the feminist movement veered off course from its original aim of helping women achieve equality and ended up making enemies of men. With piercing wit, this nationally syndicated columnist shows us how the pendulum has swung from the reasonable middle to a place where men have been ridiculed in the public square and the importance of fatherhood has been diminished–all to the detriment of women, who ultimately suffer most.The real losers, should we continue on our present course, are not just grown men and women but our children. Young people involuntarily drafted into the squabbles of their parents’ generation and raised in a climate of sexual hostility–also known as the “hookup culture”–may be fluent in porn, but their vocabulary is painfully limited when it comes to relationships.While Parker gleefully skewers the silly side of the human experiment–like men in dresses and sperm shopping–she offers sobering statistics on the impact of the anti-male culture on the institution of the family and on relationships.Exploring our burgeoning “slut culture” and the vividly narcissistic prevalence of vagina worship, Save the Males softens no edges. Parker tackles some of the more taboo subjects in today’s sexual politics and culture wars with perceptive analysis and a stinging sense of humor that will have America talking–and chuckling–about saving the males.",
  "genres": [
    "Nonfiction",
    "Sociology",
    "Politics",
    "Gender",
    "Sexuality"
  ],
  "author": "Kathleen Parker",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/2267903.Save_the_Males"
}