{
  "title": "Cyberevolution Boxed Set",
  "description": "This boxed set which is available for a ****LIMITED TIME ONLY**** includes three ebooks:  Cyberevolution I: The Awakening--They were the latest weaponry—cyborg soldiers—a melding of robotics and biological materials conceived to integrate them with their human counterparts--except they were scary-big and so powerful they were capable of destruction no human was. And they attained awareness and went rogue.  Cyberevolution II: Total Recall--Chloe wasn’t worried when she got the recall notice on the cyborgs. There was nothing wrong with Kane and Jared. They were hers, and the company was going to play hell finding them and reclaiming them on her deep space salvager. Damon was another matter altogether! She just couldn’t understand why Jared and Kane were so against the rescue mission she hatched! It was going to be a piece of cake!  Cyberevolution III: Abiogenesis--Reuel CO469 is tall, dark, and infinitely dangerous. His is the face that launched a million flyers. He is the first of his kind, the first cyborg to go rogue, the leader of all who’d come after him, and the only rogue nobody has ever come close to catching. From the moment Dalia first sets eyes on him, she knows she is lost. She can no more resist his dark allure than she can cease to breathe.  Author Kaitlyn O’Connor was first published by Harlequin Enterprises in 1994 under the pen name of Madris Dupree after nearly a decade of ‘apprenticeship’ --struggling to learn the business, the marketing, and the writing skills necessary for a career in commercial fiction. That ‘first’ published book, a historical, (which was actually her fourth attempt at a marketable piece of fiction) was successful, however, selling nearly 80,000 copies in the U.S., Switzerland, France, and the U.K. She writes various genres (or sub-genres since she always writes romance!) under different pen names. She has written science fiction/futuristic/fantasy under several—Kaitlyn O’Connor, in honor of her Scottish grandmother, Lyssa Hart, and Angelique Anjou (for the French ancestry), all combined here now under the single pen name Kaitlyn O’Connor.   Other titles by this author: Alien Breeders II: Deep Penetration The Assassin's Blade Atalantium I: Bride of Atlantis Atalantium II: Neptune's Daughter (Coming Soon) Atalantium III: Maiden of Atlantis (Coming Soon) Babylon: The Rebel's Woman The Barbarian Prince (Coming Soon) Beastmen of Ator: Alien Abduction Below Breeder Breeder Project Chaos Forged Children of Andromeda: Lords of the Sea Conquest Earth: Prince Galen Cyberevolution I: The Awakening Cyberevolution II:Total Recall Cyberevolution III: Abiogenesis Cyberevolution IV: Cyborg Cyberevolution V: Illumination Cyberevolution VI: Cyborg Nation Cyberevolution VII: Rules of Engagement Dark Solstice Discovery: The Forgotten Dragonlord Enslaved I: Genesis Enslaved II: The Spawning Enslaved III: The Gladiators Exiled Forest Whispers The Gate Genus-Unknown: Adaptation Ja-Rael's Lioness Lawgivers: Gabriel The Lion's Woman Lords of Mayhem Night Raven The Ninth Orb The Portal Return to Eden",
  "genres": [],
  "author": "Kaitlyn O'Connor",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/22694038-cyberevolution-boxed-set"
}