{
  "title": "Earth",
  "description": "Earth (The Invasion Trilogy #1)  Earth is being invaded. There was no warning and no time to stage any kind of defence. Instead countries started to go silent. They were no longer reachable and no one knew what was happening. So when Canada went dark; everyone knew America would be next.  My name is Matilda, but everyone calls me Mattie. I was at college in Oregon when the attack began. By the time Canada went quiet, we’d had enough. So two of my friends and I decided to join the fight in Vancouver and find out what was really happening. That is when everything changed. What we found was death, destruction and machines that were slaughtering humans. There would be no escape for us; no place to go where the machines couldn't reach us. I had no future, but then I met him.  My name is Marduke and I’m part of the reason Earth is being invaded. I’m from a different planet and even though I look human, I’m not. But when Earth was invaded, I began running from my family and running for my life. Then she saved me. She made me feel something I’d never felt before. She saved my life and opened my heart to the possibility of love, she changed me forever.  What are the chances of finding your true love right when the world is ending? What kind of cruel fate places them together under those circumstances? What is she supposed to do when he tells her he is not from Earth? When she finds out that he is one of the invaders? What does she do when she finds out everything she thought she knew was wrong? What does he do when he has to make a choice between protecting her and saving himself? How can they overcome everything standing in their way?  Professionally edited by C&D Editing NA Science –Fiction Romance Approx 86,000 words Recommended for readers 17+ due to adult situations, violence and occasional swearing. Australian English used throughout story.",
  "genres": [
    "Science Fiction",
    "Romance",
    "New Adult",
    "Aliens",
    "Fantasy",
    "Paranormal Romance",
    "Dystopia"
  ],
  "author": "Jessica Frances",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/22694322-earth"
}