{
  "title": "Forget Me Not",
  "description": "Meet the unforgettable Sky Crawford from FORGET ME NOT…Suffering from Peter Pan Syndrome and survivor guilt, Navy helicopter pilot and renowned playboy Brian “Skylark” Crawford, swears he’ll never marry. He refuses to admit—even to himself—that he doesn’t believe he deserves happiness.After her Marine pilot husband is killed in Afghanistan, war widow and veterinarian Daisy Schneider vows to give her wounded heart only to animals. But work fails to ease her loneliness or the agonizing guilt she feels as she wonders if she could have saved the man she loved.Between one matchmaking rescue cat and a fiery battle with drug runners at sea, the fur flies as Sky and Daisy fight to resist their attraction and the dangerous idea that they might be worthy of a second chance at life…and love.Book 2 in the “Love in the Fleet” Series, which includes FORGIVE AND FORGET, FORGET ME NOT, NEVER FORGET and UNFORGETTABLE“Sexy, funny, poignant, and romantic!”—Kieran Kramer, USA Today Bestselling Author“Loss, healing, love, humor, suspense, high seas adventure, and tender romance combine to give readers an unforgettable story.”—Romance Junkies.com“Takes us on a tender journey of passion, romance, and hope. I found myself believing, if only for a while, in second chances at love.”—Military Writers Society of America“A perfect combination of military detail, heart-hammering action, and searing romance.”—Merline Lovelace, USA Today Bestselling Author and former commander at Eglin Air Force Base“Forget Me Not takes flight with a dose of humor and suspense and reminds us of the healing power of love.”—Cindy Dees, Rita-Winning Author of Military Suspense“Heart-pounding, realistic action and deeply drawn characters make Forget Me Not an unforgettable read!”—Rachel Grant, Author of Body of Evidence“Pull your five-point harness tight and brace for impact as sexy Sky Crawford pilots a Navy Seahawk helicopter and closes in on his targets. When it comes to terrorists, drug runners, and hot women, Sky never misses.”—S.L. Menear, Author of Deadstick Dawn",
  "genres": [
    "Romance",
    "Military Fiction"
  ],
  "author": "Heather Ashby",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/22694758-forget-me-not"
}