{
  "title": "The Dumbest Generation: How the Digital Age Stupefies Young Americans and Jeopardizes Our Future",
  "description": "This shocking, lively exposure of the intellectual vacuity of today?s under thirty set reveals the disturbing and, ultimately, incontrovertible cyberculture is turning us into a nation of know-nothings.Can a nation continue to enjoy political and economic predominance if its citizens refuse to grow up?For decades, concern has been brewing about the dumbed-down popular culture available to young people and the impact it has on their futures. At the dawn of the digital age, many believed they saw a hopeful The Internet, e-mail, blogs, and interactive and hyper-realistic video games promised to yield a generation of sharper, more aware, and intellectually sophisticated children. The terms ?information superhighway? and ?knowledge economy? entered the lexicon, and we assumed that teens would use their knowledge and understanding of technology to set themselves apart as the vanguards of this new digital era.That was the promise. But the enlightenment didn?t happen. The technology that was supposed to make young adults more astute, diversify their tastes, and improve their verbal skills has had the opposite effect. According to recent reports, most young people in the United States do not read literature, visit museums, or vote. They cannot explain basic scientific methods, recount basic American history, name their local political representatives, or locate Iraq or Israel on a map. The Dumbest Generation is a startling examination of the intellectual life of young adults and a timely warning of its consequences for American culture and democracy.Drawing upon exhaustive research, personal anecdotes, and historical and social analysis, Mark Bauerline presents an uncompromisingly realistic portrait of the young American mind at this critical juncture, and lays out a compelling vision of how we might address its deficiencies.",
  "genres": [
    "Nonfiction",
    "Education",
    "Sociology",
    "Technology",
    "Cultural",
    "Psychology",
    "Politics"
  ],
  "author": "Mark Bauerlein",
  "average_rating": "3.12",
  "url": "https://www.goodreads.com/book/show/2269399.The_Dumbest_Generation"
}