{
  "title": "Luminarium",
  "description": "Winner of the Los Angeles Times Book Prize for Fiction.“Heady and engrossing ... Shakar is such an engaging writer, bringing rich complications to the narrative.... At times,  Luminarium  reads like a Christopher Nolan or Wachowski brothers movie as scripted by Don DeLillo.” — The New York Times Book Review  Fred Brounian and his twin brother, George, were once co-CEOs of a burgeoning New York City software company devoted to the creation of utopian virtual worlds. Now, in the summer of 2006, as two wars rage and the fifth anniversary of 9/11 approaches, George has fallen into a coma, control of the company has been wrenched away by a military contracting conglomerate, and Fred has moved back in with his parents. Broke and alone, he’s led by an attractive woman, Mira, into a neurological study promising to give him \"peak\" experiences and a newfound spiritual outlook on life. As the study progresses, lines between the subject and the experimenter blur, and reality becomes increasingly porous. Meanwhile, Fred finds himself caught up in what seems at first a cruel a series of bizarre emails and texts that purport to be from his comatose brother.Moving between the research hospitals of Manhattan, the streets of a meticulously planned Florida city, the neighborhoods of Brooklyn and the uncanny, immersive worlds of urban disaster simulation;  threading through military listserv geek-speak, Hindu cosmology, the maxims of outmoded self-help books and the latest neuroscientific breakthroughs, Luminarium is a brilliant examination of the way we live now, a novel that’s as much about the role technology and spirituality play in shaping our reality as it is about the undying bond between brothers, and the redemptive possibilities of love.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Contemporary",
    "Philosophy",
    "Novels",
    "Literary Fiction",
    "Audiobook"
  ],
  "author": "Alex Shakar",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/10148470-luminarium"
}