{
  "title": "The Conjure Woman and Other Conjure Tales",
  "description": "The stories in The Conjure Woman were Charles W. Chesnutt's first great literary success, and since their initial publication in 1899 they have come to be seen as some of the most remarkable works of African American literature from the Emancipation through the Harlem Renaissance. Lesser known, though, is that the The Conjure Woman, as first published by Houghton Mifflin, was not wholly Chesnutt's creation but a work shaped and selected by his editors. This edition reassembles for the first time all of Chesnutt's work in the conjure tale genre, the entire imaginative feat of which the published Conjure Woman forms a part. It allows the reader to see how the original volume was created, how an African American author negotiated with the tastes of the dominant literary culture of the late nineteenth century, and how that culture both promoted and delimited his work.In the tradition of Uncle Remus, the conjure tale listens in on a poor black southerner, speaking strong dialect, as he recounts a local incident to a transplanted northerner for the northerner's enlightenment and edification. But in Chesnutt's hands the tradition is transformed. No longer a reactionary flight of nostalgia for the antebellum South, the stories in this book celebrate and at the same time question the folk culture they so pungently portray, and ultimately convey the pleasures and anxieties of a world in transition. Written in the late nineteenth century, a time of enormous growth and change for a country only recently reunited in peace, these stories act as the uneasy meeting ground for the culture of northern capitalism, professionalism, and Christianity and the underdeveloped southern economy, a kind of colonial Third World whose power is manifest in life charms, magic spells, and ha'nts, all embodied by the ruling figure of the conjure woman.Humorous, heart-breaking, lyrical, and wise, these stories make clear why the fiction of Charles W. Chesnutt has continued to captivate audiences for a century.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Classics",
    "Fantasy",
    "African American Literature",
    "School",
    "African American"
  ],
  "author": "Charles W. Chesnutt",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/22692.The_Conjure_Woman_and_Other_Conjure_Tales"
}