{
  "title": "Tatiana's Chance",
  "description": "Tatiana is a cougar, a late 40s divorcee, school teacher who takes every opportunity to visit friends during school vacations. She's also a very avid participant in secret adult online networking groups. These Facebook groups range in membership size and in the content of socializing taking place. Some groups are straight up porn sites, meaning personal photos of anything short of kids, animals or Satanism are allowed. Tati's groups of choice are those with small to medium membership and absolutely no photos of kids (no matter how innocent) and the conversations are sexy, explicit, and grown. Her favorite groups include discussions regarding politics, religion, sports, art, education and all other facets of life. Most of the folks in these secret groups carry on life and never meet their online friends. Tatiana's closest friends in the groups are also people she speaks to regularly outside of Facebook. She has many online acquaintances and a handful of very close, personal friends in whom she confides, shares lifes ups and downs, and with whom she yells, cries and encourages. She considers a few of them her very best friends, although she has never met any of these people. A few of the men actually claimed to have fallen in love with her without ever having met her and she even had her share of men she thought she'd become a little too friendly with as well. During her travels Tatiana, coincidentally, runs into many of her online friends in \"chance\" meetings. Most of the meetings are with men she's happened to dally with virtually. She develops confusing feelings for some of them and this lends to her mixed feelings about the direction her recently divorced life is taking. Tired of her life lacking direction and purpose, Tati soon finds that she is capable of repurposing her life and fulfilling her dreams. She comes to a crossroads where she must decide what it is she really wants to do with her life; follow her dream or continue in her relatively rewarding career as a school teacher. A nagging incomplete memory tugs Tatiana. If only she could identify this memory; maybe she'd have the answers she seeks. The closer she gets to making her decision, the more confusing the memory becomes. She is driven to unlocking the mystery.",
  "genres": [],
  "author": "Elaine  Wood",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/22694768-tatiana-s-chance"
}