{
  "title": "Zero",
  "description": "Kaleb Hugo is every­thing an offi­cer of the Ser­vice should be: loyal, expertly trained, unques­tion­ing. He has done every­thing ever ordered of him and has done so with a pride that comes from know­ing you are fight­ing for the good of humankind… until the day that he made a decision to go against orders to obtain victory and save lives.The bat­tle was won, but Hugo was con­demned and dis­hon­ourably dis­charged by Ser­vice com­man­ders for defying regulations. There is no place in the Service for heroes. Their soldiers serve and obey.Officially, anyway.Unof­fi­cially, Hugo is re-​​assigned to cap­tain the crew of the Zero, an eight-​​man craft clas­si­fied as, at best, a pri­va­teer ship and at worst a smug­gling and crim­i­nal enter­prise vessel. But what very few know is that the Zero, and her crew, are con­tracted by the Ser­vice. Their role is to inves­ti­gate and infil­trate the less savoury lev­els of soci­ety. They sell on, buy in, bar­gain, threaten and report back on every­thing the polit­i­cal lev­els the Ser­vice don’t offi­cially want to know about.The Zero’s rag-​​tag crew look to their com­man­der, Ezekiel Webb, as their leader and mid­dle­man between the reg­i­mented expec­ta­tions of the Ser­vice and the harsh and unpre­dictable demands of the under­world of colo­nial space. He has lived in both worlds his whole life and has trouble adjusting to Hugo, as he has every captain before him.Hugo has to find a way to manage this unruly ship and unruly crew as they are pulled deeper into an orbit-​​wide game of pol­i­tics, deceit and cor­rup­tion which will threaten to tear them apart as well as throw human­ity back into a cycle of war and destruc­tion. Hugo, Webb and the crew will have to over­come per­sonal tragedy, insur­mount­able odds and every depraved twist of fate that the Orbit can throw at them in order to survive and prevent events that could threaten the lives of millions.For Kaleb Hugo, nothing will ever be certain again.",
  "genres": [
    "Science Fiction"
  ],
  "author": "J.S.  Collyer",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/22698602-zero"
}