{
  "title": "Zombie Zone Zero 2: All the Tides of the World",
  "description": "Zombie Zone Zero 2 is a powerful story of first love and erotic passion: a wild thrill ride that starts on a peaceful island refuge and ends in a serial killer's gruesome lair built in the secret tunnels under West Edmonton Mall.  It has been nearly ten years since the start of the zombie apocalypse when thirteen survivors found safe haven on Princess Royal Island just off the coast of British Columbia, Canada. Chris Daniels and Artie Johnson are no longer ruthless zombie killers, and for the past decade have worked hard to insure the survival of their tiny community built amidst the ruins of the ghost town of Butedale. Except for brief scavenging forays into Prince Rupert or Kitimat, no one has returned to the mainland in years. Despite the passing of a decade, there has been no apparent decrease in the coastal zombie population. In fact, the predatory dead seem to have evolved and are now more wary and far more dangerous than ever.   But Artie's daughter, nineteen year old Melissa Johnson, yearns for passion and adventure and feels compelled by her nightly dreams to seek the soulmate she has yet to meet, and she soon convinces her friends Bryan, Bobby and Anne to accompany her to the mainland to look for other survivors.  Her dreams seem to come true upon meeting Will Dalton. She revels in their passionate and playful whirlwind romance and finds a home in the sanctuary he and his fellow survivors have created around an old Walmart in what used to be Edson, Alberta. Despite the misgivings of her lifelong friend, Bryan, who despises Will and questions his secrecy regarding his mysterious past in the time that everyone only alludes to as Before, she feels protected by her new love and his circle of friends: the eccentric Medical Examiner, Lyle Dodd, Will's crass but capable best friend Devon, compassionate Eddie, their mentor Joey, cowboy Lucas, the twin boys Jack and Jake, and Elaine the lovely young prostitute with a dark and unspeakable past.  But now a woman has gone missing, leaving behind two terrified and nearly catatonic children and Melissa's prophetic seeming dreams have grown dark and terrifying. She suspects a menacing presence is stalking her, no mere zombie, but a powerful living enemy who is capable of unimaginable evil. Although she has the heart of a warrior and the blood of her fearless father, she can't fathom from what direction this betrayal is coming from, nor can she unravel the tangled clues from her mysterious and horrifying nightmares. All she knows is that she will soon have to face some demonic creature who has worn the mask of friendship, but who is now intent on destroying her and all that she loves.",
  "genres": [],
  "author": "Robert   Knight",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22703522-zombie-zone-zero-2"
}