{
  "title": "Demonic Visions 50 Horror Tales #4",
  "description": "Welcome to the fourth installment of the Demonic Visions series. This new collection of macabre tales includes short fiction by all members of the Demonic Visions team. Every new book that we publish will take you deeper into the minds of these talented writers, and acquaint you with their various styles of prose. So enjoy, and I hope that you will join us for the entire Demonic Visions saga which is intended to last many, many years and span many, many volumes… ~Chris Robertson, author of Death Dreams Deluxe Cover art by Grant Cross, artwork on Facebook: Grant Cross Artwork Table of Contents: 1. TWELVE VOLT EXISTENCE by Adam Millard 2. TRIGGER WARNING by Patrick Freivald 3. HERO by Joe McKinney 4. LET THE CHILDREN COME TO ME by Justin Hunter 5. THE ZOMBIFICATION OF LESTER NELSON by S.C. Hayden 6. LAST STAND by Matt Drabble 7. THE PRIMA DONNAS by Vince Liberato 8. DEVIL’S BREW by James Pratt 9. FALLING LIKE FLIES by Maggie Carroll 10. FINDERS KEEPERS by Rob Smales 11. THE VIGIL by J. T. Seate 12. SILHOUETTE by Marc Sorondo 13. THE BUS DRIVER by Jody Neil Ruth 14. THE CASTAVAL TRAVELLING CIRCUS by Julianne Snow 15. A CALMING BREEZE OF DEATH by K. Trap Jones 16. MR. PARKER GOES TO SANGRIA by Mark Slade 17. EMPTY HOLLOW by Megan N. Watson 18. THE RAVEN 2 by Christopher Conlon 19. THE EMPTY ONES by James Pratt 20. DRINKS AND A SHOW by Ken MacGregor 21. THAT SOUND OF A HOOK TO THE CAR by Johannes Pinter 22. THE PERSISTENCE OF MEMORY by Chris Leek 23. ICEFREAK by C. L. Hesser 24. HOLE CARD by Devlin Giroux 25. ONE WITH NATURE by Marc Shapiro 26. COMMUNICATION BREAKDOWN by Winifred Burniston 27. MUSE by Peter Adam Salomon 28. THE LEGACY by Julianne Snow 29. THE LONGRIDER by Michael Schomaker 30. TOGETHER FOREVER by Michele Tallarita 31. THE HIGHWAY by Jeff McFarland 32. THE DITCH by Naching T. Kassa 33. THE DECEPTIVE SECURITY OF EVERYDAY NORMALITY by Rick McQuiston 34. CONDEMNED EXISTENCE by Robert Friedrich 35. LUST FOR LIFE by Sydney Leigh 36. THE LEGACY OF CLAN MAG AOIDH by April Bullard 37. APOLOGY ADDICTS by Shaun Avery 38. BOXES by Charles David Bennett 39. RETURN OF THE GREEN GUY by John Alfred Taylor 40. THE MIND OF AN ARTISTE by Raymond Gates 41. TO HELL AND GONE by Mark Slade 42. SOMETHING’S WRONG WITH ETHAN by Doug Robbins 43. PALADIN by Aaron J. French 44. LUNCH TIME by Kerry G.S. Lipp 45. SNAKE SEASON by Rebecca Fung 46. WALK A MILE by Shenoa Carroll-Bradd 47. GYRMKIN by Nicholas Paschall 48. THEODORE by William Holden 49. THE PROTÉGÉ by Arran McDermott 50. THE CHANGE by R.L. Ugolini 51. *Bonus Tale* SECOND SIGHT by Ramsey Campbell",
  "genres": [
    "Anthologies"
  ],
  "author": "Chris Robertson",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/22712320-demonic-visions-50-horror-tales-4"
}