{
  "title": "Beautiful Darkness",
  "description": "Beautiful Darkness is the second bewitching instalment in the bestselling love story Beautiful Creatures - a romance that is bound to capture the hearts of Twilight fans everywhere.Some loves are meant to be. Others are cursed . . . One night in the rain, Ethan Wate opened his eyes and fell in love with Lena Duchannes. His life would never be the same.Lena is a Caster and her family is locked in a supernatural civil full of darkness and demons. On her sixteenth birthday Lena made a terrifying choice, which now haunts her day and night.And as her seventeenth birthday approaches Lena and Ethan face even greater danger. A Caster and a Mortal can never truly be together.Every kiss is a curse.Ethan's next heartbeat could be his last.It is their curse now . . .*Don't miss the Warner Brothers and Alcon Entertainment blockbuster movie of Beautiful Creatures directed by Richard LaGravenese (P.S. I Love You) and featuring an all star cast including Emma Thompson, Jeremy Irons, Viola Davies and hot young Hollywood talent Alice Englert, Alden Ehrenreich and Emmy Rossum.Praise for Beautiful 'Watch out Twilight and Hunger Games' - The Guardian'Move over Twilight, there's a new supernatural saga in town.' - E!'This novel has been generating Twilight-level buzz.' - Teen Vogue About the @kamigarcia is a superstitious American southerner who can make biscuits by hand and pies from scratch! She attended George Washington University and is a teacher and reading specialist. She lives in Los Angeles, California with her family.@mstohl has written and designed many successful video games, which is why her two beagles are named Zelda and Kirby. She has degrees from Yale and Stanford Universities in the US and has also studied in the prestigious creative writing department at UEA, Norwich. She lives in Santa Monica, California with her family.Also available in the Beautiful Creatures, Beautiful Chaos, Beautiful Redemption and exclusive ebook short story Dream Dark.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Paranormal",
    "Romance",
    "Magic",
    "Fiction",
    "Supernatural"
  ],
  "author": "Kami Garcia",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/11346127-beautiful-darkness"
}