{
  "title": "Sci Spanks Anthology 2014",
  "description": "Sci Spanks, an out of this world anthology featuring fifteen fantastic authors!Within this collection you’ll find M/F, F/F, and M/M short stories ranging from sweet to erotic. Humorous and heartfelt, bold and passionate to downright naughty, featuring a unique twist on discipline by spanking. Each has been lovingly written and contributed by popular authors for your reading pleasure.Bred For Tika is Chosen by Eve LanglaisTika has been bred to be the perfect mate, but has no intention on behaving. She doesn’t count on her new owner enjoying the challenge.Taliasman by Anastasia Vitsky“If I had been born a boy I would have followed in my father’s footsteps…I was a girl, he sold me instead.” So begins Talia’s tale, but when she’s purchased by Queen Vina, Talia discovers unexpected love.Oh, What the Hell by Maren SmithMay has suffered a long time attraction to Vek—a praying mantis-like Klik’vok. Surely, once a woman gets past the whole “bug exterior” thing, any other obstacles must be easy, right?Replicated Consequences by Jessica E. SubjectAfter Darryl Malloy’s wife is killed, he doesn’t expect to find her clone standing on his door step—with a paddle.What’s a Moon Colony Without a Spanking Franchise? by Kate RichardsThe Trainer’s new trainee, Harlan, isn’t sure how well his tools will work in low gravity. And his eager new client isn’t exactly the girl next door….No More Lizards by Sue LyndonAnya thinks it might be fun to prank her stern alien husband…until he decides to turn her over his knee.Red Moon Rising by Erzabet BishopCan Devi reconcile the demons that haunt her and face the red moon rising?Skin by Leigh EllwoodWhen her captain elects to administer the penalty for breaking the rules, Andromeda finds being a bad girl feels quite good.Taming the Wolf by Anne OdomWhat’s an inventor to do when his project is failing, his lover is wicked, and his patience is stretched?Research Purposes Only by Eva LefoyJoin me as I visit the Utai and get a first-hand taste of how sweet their punishment can be….Jen & Maddy by Cathy PegauWhen Maddy’s deepest longings are laid bare by her girlfriend’s mind-reading equipment, will it scare her away or take their relationship to the next level?Flame On a Fire by Carole CummingsExposition and development masquerading as PWP, or vice versa—either way, bondage!A Lifetime by Olivia StarkeWhen Mel and Kylla find themselves fugitives, will a lifetime of love bring them together, or tear them apart?",
  "genres": [
    "Anthologies",
    "BDSM",
    "Erotica",
    "Lesbian",
    "Romance",
    "Science Fiction"
  ],
  "author": "Anastasia Vitsky",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/22712432-sci-spanks-anthology-2014"
}