{
  "title": "Shiver Quartet: Shiver, Linger, Forever, Sinner",
  "description": "Lose yourself in Maggie Stiefvater’s NEW YORK TIMES bestselling Shiver series\nshiver\nSam's not just a normal boy – he has a secret. During the summer he walks and talks as a human, but when the cold comes, he runs with his pack as a wolf. Grace has spent years watching the wolves in the woods behind her house – but never dreamed that she would fall in love with one of them. Now that they've found each other, the clock ticks down on what could be Grace and Sam's only summer together.\nlinger\nCan Grace and Sam last? Each will have to fight to stay together – whether it means a reckoning with his werewolf past for Sam, or for Grace, facing a future that is less and less certain. Cole, a new wolf is wrestling with his own demons, embracing the life of a wolf while denying the ties of being human.For Grace, Sam, and Cole, life is harrowing and euphoric, enticing and alarming. As their world falls apart, love is what lingers. But can it be enough? \nforever\nFor Grace, Sam, and Cole, the story continues – only now, the stakes are even higher than before. Wolves are being hunted. Lives are being threatened. It's becoming harder and harder to hold on to one another. The past, the present, and the future are about to collide in one pure moment – a moment of death or life, farewell or forever.\nsinner\nEverybody thinks they know Cole’s story. Stardom. Addiction. Downfall. Disappearance. But only a few people know Cole’s darkest secret – his ability to shift into a wolf. One of these people is Isabel. At one point, they may have even loved each other. But that feels like a lifetime ago. Now Cole is back. Back in the spotlight. Back in the danger zone. Back in Isabel’s life. Can this sinner be saved?",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Paranormal",
    "Fiction",
    "Teen",
    "Science Fiction Fantasy"
  ],
  "author": "Maggie Stiefvater",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/22710605-shiver-quartet"
}