{
  "title": "Laser Visions",
  "description": "Biology professor Roman Janz was walking across campus and planning his next plant-collecting trip to Brazil, when something stung him on the neck. And now… now he’s wandering in the dark, in the blue, floating, disembodied, and confused. There has to be a good explanation, if he can just find someone, anyone, he can actually talk to about it.Xavier Faulkner is intelligent, creative, and made millions when he sold his tech-security company. But all his wealth and skills couldn’t keep his sister Tam from being poisoned by food contamination. She lived, but her health was damaged, and her job as a cop is gone. In the antebellum house he moved them to, Xavier hopes to find both a distraction and maybe a purpose for their lives. But the old house seems to come with strange noises, and odd blue lights, and maybe― if Xavier isn’t just going crazy― a naked guy, walking away into the blue…This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. Dear Author,I just moved into this old antebellum home I bought with the intentions of restoring. I often find myself awoken in the night by strange noises I cannot identify or hear during the day. At first, I think it’s just a dream… this seemingly phantom always walking away. Who is he and how can I get him to finally turn around and see me?Photo Description: Light streams into a narrow, old-fashioned hallway from the open door at the end. Framed in the brightness, back-lit to blurred outlines and shadows, is the silhouette of a man, walking away. He’s tall, lean but well-built, with faint tan lines across his lower back and thighs. He’s also completely naked. His curved ass and broad shoulders are the most solid things about him. He strides off into the blue, head slightly tilted, not looking back.This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Science Fiction",
    "Romance",
    "Fantasy",
    "Mystery",
    "Futuristic"
  ],
  "author": "Kaje Harper",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/22711681-laser-visions"
}