{
  "title": "Shifted Perceptions",
  "description": "If there's one thing Terry (aka Foxy) hates most, it's a traitor.After Paul betrayed his team, he was given a second chance, though not everyone forgave the sexy jaguar shifter. In Foxy's mind, once a traitor, always a traitor, and she refuses to work him. Even if he is too desirable for his own good.When Foxy and Paul are thrown together on a mission, butting heads is an understatement. The struggle for dominance brings tension to every encounter between these two. Paul seems determined to keep Foxy safe and she's determined to keep her distance. But with every burning glance he shoots her way, and every husky word he utters, she wonders if he's more determined to drive her crazy with lust than anything else. Her only resolution is to keep her cool, though that's easier said than done, even with her firm determination to never sleep with a traitor.Going undercover isn't Foxy's specialty, but when Teij says jump, she doesn't even question how high. Infiltrating this group of drug smugglers and finding out who's really running the show is only part of the job. Her first priority is finding her captured teammate, and when she meets Stone, leader of this small organization, things begin to heat up unexpectedly. Foxy knows how to use the attraction to her advantage. Using her feminine wiles in these situations is expected. It's what the Alpha Division does - Get close, get what you came for, and get out. Only, things aren't going as planned.The secrets are piling up and time is running short, but Foxy's real problem is keeping her focus. Between Paul and Stone, she's having a hard time keeping her head - and her clothes - on straight.*Warning: This book contains strong sexual content, violence and adult language. Not suitable for readers under the age of 18.",
  "genres": [
    "Paranormal Romance",
    "Paranormal"
  ],
  "author": "C.E.    Black",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/22709174-shifted-perceptions"
}