{
  "title": "An Irish Country Village",
  "description": "Patrick Taylor first charmed readers with An Irish Country Doctor, a warm and enchanting novel in the tradition of James Herriot and Jan Karon. Now Taylor returns to the colorful Northern Ireland community of Ballybucklebo, where there's always something brewing beneath the village's deceptively sleepy surface.Young Doctor Barry Laverty has only just begun his assistantship under his eccentric mentor, Dr. Fingal Flahertie O'Reilly, but he already feels right at home in Ballybucklebo. When the sudden death of a patient casts a cloud over Barry's reputation, his chances of establishing himself in the village are endangered, especially since the grieving widow is threatening a lawsuit.While he anxiously waits for the postmortem results that he prays will exonerate him, Barry must regain the trust of the gossipy Ulster village, one patient at a time. From a put-upon shop girl with a mysterious rash to the troubled pregnancy of a winsome young lass who's not quite married yet, Ballybucklebo provides plenty of cases to keep the two country G.P.s busy.Not all their challenges are medical in nature. When a greedy developer sets his sights on the very heart of the community, the village pub, it's up to the doctors to save the Black Swan (affectionately known to the locals as the \"Mucky Duck\") from being turned into an overpriced tourist trap. After all, the good citizens of Ballybucklebo need some place to drink to each other's health. . . .Whether you've visited in the past, or are discovering Ballybucklebo for the first time, An Irish Country Village is an ideal location for anyone looking for wit, warmth, and just a touch of blarney.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Ireland",
    "Audiobook",
    "Irish Literature",
    "Humor",
    "Historical"
  ],
  "author": "Patrick Taylor",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/2270950.An_Irish_Country_Village"
}