{
  "title": "The Blood Knight",
  "description": "Brimming with passion and adventure, Greg Keyes’s epic saga of a royal family’s fall from power through treachery and dark magic, set amid the return of ancient evils whose malevolence threatens to annihilate humanity, bids fair to become a classic of its kind. Now, in the eagerly awaited third installment, Keyes draws the threads of his tapestry ever tighter, illuminating old mysteries and introducing new ones as events build toward a shattering climax.The legendary Briar King has awakened, spreading madness and destruction. Half-remembered, poorly understood prophecies seem to point to the young princess Anne Dare, rightful heir to the throne of Crotheny, as the world’s only hope. Yet Anne is hunted by the minions of the usurper Robert, whose return from the grave has opened a doorway through which sinister sorceries have poured into the world. Though Anne herself is the conduit of fearsome powers beyond her understanding and control, it is time for girl to become woman, princess to become queen. Anne must stop running and instead march at the head of an army to take back her kingdom . . . or die trying.But a mysterious assassin stalks her, so skilled in the deadly fencing style of dessrata that even Anne’s friend and protector Cazio, a master of the form, cannot stand against him, nor can her sworn defender, the young knight Neil MeqVren.As for Anne’s other companions–Aspar White, the royal holter who bears an enchanted arrow capable of felling the Briar King; and Stephen Darige, the monk who blew the horn that woke the Briar King from his slumber–they cannot help her, as their separate paths carry them ever deeper into a deadly maze of myth and magic from which return may be impossible.Meanwhile, Queen Muriele is a prisoner of the false king. With no allies but a crippled musician, who is himself a prisoner, and a servingwoman who is both more and less than she seems, Muriele will find herself a pawn in Robert’s schemes for conquest–and a weapon to be used against her own daughter.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "Science Fiction Fantasy",
    "High Fantasy",
    "Magic",
    "Adventure"
  ],
  "author": "Greg Keyes",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/22712.The_Blood_Knight"
}