{
  "title": "The Glass Heart Girl",
  "description": "\"No matter how demons try to separate us or come between our love, if we believe in a higher power, nothing can truly break us.\"A powerful romance story that crosses important barriers and will change your perspective on love and relationships forever... Alena Pavlis is a beautiful young woman trying to move on from a traumatic past from five years ago. A past which almost destroyed her... A past which almost claimed her life... On the surface she is a happy, bubbly and vivacious 20 year old, relishing life at university with bestie, Becca, her quirky Californian housemate and the gorgeous Phillip Gregson, her amazing boyfriend, who captured her heart during Freshers' Week and whom she falls deeper in love with every single day. But in truth, Alena does not have the perfect life she craves for - she is a wounded woman, a young woman whose heart is as fragile as glass and liable to break, since the ghosts of the years before still haunt her and she can't let go. She can't be free and move forward with life. And she's psychologically trapped by the dark memories of a dangerous man who vowed to control, manipulate and mistreat her as a child. A man and an old life, she so desperately wants to forget... Becca and Phillip, especially, support Alena as best they can and she finds a sanctuary in the botanical garden at the university to help heal old hurts, as she wrestles with inner conflicts and deep-rooted issues. But ultimately Alena knows, that she is the only one who can truly free herself from the shackles of that terrible past. Through the ups and downs of university life - laughter, joy, tears, meeting coursework deadlines, having petty arguments between friends, relationship troubles etc, Alena never loses sight of those special and significant relationships that shape a woman's life in early adulthood. And she knows, that banishing the demons from years ago, is the only way she can have the deeply fulfilling relationship she desires with Phillip and the future she rightly deserves. One day, on the train home, a menacing face from half a decade ago resurfaces, and soon, Alena finds herself at a dangerous crossroads, stuck between a world of pain and anguish and a life of love, hope and freedom. As her relationship with Phillip reaches breaking point, she must make the difficult choice, a decision that could change the course of her life. She must either embrace a wonderful future with Phillip and love him wholeheartedly, or let the spirits of yesterday devour her. This is a riveting tale of one young woman's courage, bravery and determination to overcome a distressing childhood and welcome in a new life with the man she truly loves. A New Adult Romance Novel suitable for mature readers 17 and over.For each book sold, a donation will be made to the Women and Girls Network.The University of Leicester's Official Press Release for The Glass Heart Girl: http://www2.le.ac.uk/news/blog/2014-a....",
  "genres": [],
  "author": "Michelle Diana Lowe",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/22712430-the-glass-heart-girl"
}