{
  "title": "The Cowboy's Kink",
  "description": "Book 2 of the brand new Billionaire Bachelors Series from New York Times and USA Today Bestselling Author RG AlexanderTracy Reyes is a man who enjoys having control. Over his family's billion dollar land and cattle empire, over the women he tops at the club, and over his life. When teacher Alicia Bell drops into his lap with a problem that needs solving and a body that begs to be bound, he can't resist the opportunity to give her the education in kink she needs. But can he walk away from his passionate pupil when it's time to meet his future bride?The BachelorsWe know every debutante's mama wants a piece of their action, but if you could choose without repercussions, which of the Billionaire Bachelors would be your fantasy? The true hardcore cowboy who has enough land and employees to start his own country, but no dancing partner for his special kind of two-step? The musician with a royal pedigree, a wild streak and a vast fortune at his disposal, who's never been seen with the same woman twice? His best jet-setting buddy who can claim no less than five estates, four degrees and three charges of lewd public behavior on his record? Or the sweet-talking, picture-perfect tycoon-cum-philanthropist who used to be the baddest of the bunch but put those days behind him when he took over as CEO of his family's company? (Or did he?)Pick your fantasy lover--rocker, rancher, rebel or reformed rogue. Glass slipper shopping is a dangerous sport to be sure, especially with prey as slippery as these particular animals, but I'll still wish all my readers happy hunting.From Ms. AnonymousThe Billionaire Bachelors series#1 THE CEO'S FANTASY#2 THE COWBOY'S KINK#3 THE PLAYBOY'S MENAGE(RG Alexander, cowboy, billionaire, contemporary romance, hot romance, summer read, beach read, rope)",
  "genres": [
    "BDSM",
    "Romance",
    "Westerns",
    "Erotica",
    "Contemporary Romance",
    "Contemporary",
    "Erotic Romance"
  ],
  "author": "R.G. Alexander",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/22711517-the-cowboy-s-kink"
}