{
  "title": "The Alpha and the Omega: An absurd philosophical tale about God, the end of the world, and what's on the other planets",
  "description": "Monday, March 28, 2016 begins like any other day for Zack, a devout atheist with a profitable appointment as an equity fund manager at a top Wall Street firm. He squeezes into the last seat on the subway car and does not say anything to the man sitting next to him selfishly hogging all the space. He grabs a coffee at his favorite newsstand and heads to his office. And later, his eyes wander to the photo of his dead parents on the corner of his desk. However, a few minutes after the closing bell, a most unusual thing happens. The true and living God of Heaven and Earth walks into Zack’s office and declares that he is real, that he is ending the world and turning Earth into the new Heaven, and that Zack may stay, despite his atheism, because he was a good person. Once Zack gets his bearings in the stunning dreamscape that is God’s new kingdom on Earth, God introduces him to Lilly, a headstrong former-lawyer for the poor who also once worshipped at the church of the faithless. Together, they explore paradise’s many wonders large and small, such as telepathy, the cloud cities, and never needing to use a bathroom. In this, they find a measure of happiness. However, not everything is as it seems, as it may turn out that God has a reason for not revealing what he keeps on the other planets … and there just might be more than one deity in the universe. The Alpha and the Omega is a satiric, post-apocalyptic love story. It’s an absurdist philosophical novel. It’s a sci-fi/action, Hollywood-blockbuster waiting to be made. And it will answer all of your deepest questions about the meaning of life and will reveal all of the universe’s wildest, most incredible secrets. I promise. WARNING: THIS PRODUCT CONTAINS PROFANITY; POLITICAL OPINION; LONG, PHILOSOPHICAL-ISH DIALOGUE; AND OTHER OFFENSIVE MATERIAL NOT SUITABLE FOR MOST READERS. ALL CHARACTERS AND EVENTS ARE PURELY FICTIONAL, AND ANY RESEMBLANCES TO YOUR GOD OR OTHER GODS YOU MAY BE FAMILIAR WITH ARE PURELY COINCIDENTAL. ALSO, PRODUCT MAY NOT ACTUALLY REVEAL THE MEANING OF LIFE OR THE UNIVERSE’S WILDEST, MOST INCREDIBLE SECRETS. INDIVIDUAL RESULTS WILL VARY.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Philosophy",
    "Novels"
  ],
  "author": "H.M. Charley Ada",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/22712011-the-alpha-and-the-omega"
}