{
  "title": "The Power of Being Yourself: A Game Plan for Success--by Putting Passion into Your Life and Work",
  "description": "Everyone imagines top CEOs as larger–than–life figures who do things no one else could. But deep down, a good business leader is an everyman who combines vision and high energy with the ability to connect with and learn from all types of people. In The Power of Being Yourself , renowned business leader Joe Plumeri offers simple yet profound guidance on how to stay positive, motivate yourself and others, and achieve success in your life and work.Plumeri's Game Plan for Success features eight key principles, from Everyone Has the Same Plumbing , in which his fish-out-of-water experience as CEO and chairman of a London-based company reveals how cultural differences can be overcome as people everywhere respond to authenticity, to You Gotta Have Purpose! , which explores the transformative ingredient that leads to tangible progress. And because this book is meant to be revisited and consulted whenever you need fresh inspiration or practical advice, The Power of Being Yourself also features a final section— Applying the Principles —imparting further guidance and checklists.By sharing his own experiences—and candidly exploring high-stakes business decisions along with many personal triumphs and tragedies—Plumeri explains that the secret to success is found not in boardroom strategy or corporate philosophy, but rather in allowing passion, purpose, and true emotions to inform your approach and guide your relationships. His book is a timely wake-up call in a world where heartless electronic communication too often takes precedence over genuine connection. Plumeri reveals that if we can live in the moment and be honest and true in our emotions, the effect carries over into how we live all facets of our lives.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Business",
    "Leadership",
    "Personal Development"
  ],
  "author": "Joe Plumeri",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/22715957-the-power-of-being-yourself"
}