{
  "title": "We Believe the Children: The Story of a Moral Panic",
  "description": "During the 1980s in California, New Jersey, and New York, Michigan, Massachusetts, and Florida, Tennessee, Texas, Ohio, and elsewhere, daycare workers were arrested, charged, tried, and convicted of committing horrible sexual crimes against the children they cared for. These crimes, social workers and prosecutors said, had gone undetected for years, and they consisted of a brutality and sadism that defied all imagining. Children across the country painted a nightmarish picture of their abuse, some claiming they had been taken to graveyards, sometimes to kill animals, and sometimes to dig up bodies, which were removed from their coffins and stabbed. In some cases, investigators said that the abusers were filming the crimes on behalf of international child pornography rings. The dangers of babysitting services and day care centers became a national news media fixation, and legislatures took action to fend off the new threats facing the country's children. Of the many hundreds of people who were investigated in connection with day care and ritual abuse cases around the country, some 190 were formally charged with crimes, leading to more than 80 convictions.But, none of it happened. It was a decade-long outbreak of collective hysteria—on a par with the Salem witch trials.Using extensive archival research conducted in Los Angeles, Miami, New York, Minneapolis, and elsewhere, and drawing on dozens of interviews conducted with the hysteria's major figures, n+1 editor Richard Beck shows how a group of legislators, doctors, lawyers, and parents, most working with the best of intentions, set the stage for a cultural disaster. Psychiatrists and talk therapists turned dubious theories of trauma and recovered memory into a destructive new kind of psychotherapy. Social workers and detectives employed coercive interviewing techniques that led children to tell them what they wanted to hear. Local and national journalists fanned the flames by promoting the story's salacious aspects, while aggressive prosecutors sought to make their careers by unearthing an unspeakable evil where parents feared it most. Beck tracks the panic all the way to its decline at the end of the decade, as parents and prosecutors were finally forced to reckon with the total lack of physical evidence underpinning the story. Yet at the heart of We Believe the Children is the idea that the conditions that made this frenzy of accusations possible were very specific to their moment in American history. The climate of fear that surrounded these cases influenced a whole series of arguments about women, children, and sex that had been intensifying for some twenty years. At the root of these accusations were competing visions of society and what it was that threatened it most.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Psychology",
    "Sociology",
    "Crime",
    "Politics"
  ],
  "author": "Richard   Beck",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/22715970-we-believe-the-children"
}