{
  "title": "Crime Seen: From Patrol Cop to Profiler, My Stories from Behind the Yellow Tape",
  "description": "A criminal profiler, trained at Quantico, former Chief Superintendent of the Ontario Provincial Police (OPP) Kate Lines recounts her remarkable story using pivotal cases she worked on in the course of her career.     How does a farm girl from Ennismore enter a male-dominated field and become a top criminal profiler and groundbreaking leader? For Kate Lines, it started humbly, patrolling highways. She learned quickly that the best way to thrive was to keep calm, carry on and never lose her sense of humour. In what would be the first of many dramatic turns in her career, Kate traded in her uniform for a tight miniskirt and a leather jacket, becoming one of the OPP's first female undercover officers.     In 1990 came the opportunity of a to be chosen as the 2nd-ever Canadian in an elite program at Quantico, Virginia in what was then the emerging field of criminal profiling. After 10 months of an intensive education in the intricacies of violent crime, Kate's new skills made her much in demand back home. Over the years she was involved in a number of high-profile cases, such as the abduction and murder of Kristen French and of Tori Stafford and the disappearance of Michael Dunahee.     Kate was an early proponent of ViCLAS--the Violent Crime Linkage Analysis System, and when she took charge of the new and massive Behavioural Sciences division in Orillia, she took over ViCLAS and turned the department into a hub of innovation. Kate was awarded a Governor General's medal for being in the top 1/10th of 1% of the members of police forces that year. The following year the Canadian Police Leadership Foundation named her Police Leader of the Year.     Always taking care not to aggrandize in any way the criminals whose names we may know all too well, Kate feels it's much more important to focus on the courage of victims and their families. Kate is an unsung, groundbreaking Canadian woman, one of a kind in this country, with a unique, inspiring and fascinating story to share.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Memoir",
    "Crime",
    "Autobiography",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Kate Lines",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/22716372-crime-seen"
}