{
  "title": "Food52 Genius Recipes: 100 Recipes That Will Change the Way You Cook",
  "description": "There are good recipes and there are great ones—and then, there are genius recipes. Genius recipes surprise us and make us rethink the way we cook. They might involve an unexpectedly simple technique, debunk a kitchen myth, or apply a familiar ingredient in a new way. They’re handed down by luminaries of the food world and become their legacies. And, once we’ve folded them into our repertoires, they make us feel pretty genius too. In this collection are 100 of the smartest and most remarkable ones. There isn’t yet a single cookbook where you can find Marcella Hazan’s Tomato Sauce with Onion and Butter, Jim Lahey’s No-Knead Bread, and Nigella Lawson’s Dense Chocolate Loaf Cake—plus dozens more of the most talked about, just-crazy-enough-to-work recipes of our time. Until now. These are what Food52 Executive Editor Kristen Miglore calls genius recipes. Passed down from the cookbook authors, chefs, and bloggers who made them legendary, these foolproof recipes rethink cooking tropes, solve problems, get us talking, and make cooking more fun. Every week, Kristen features one such recipe and explains just what’s so brilliant about it in the James Beard Award-nominated Genius Recipes column on Food52. Here, in this book, she compiles 100 of the most essential ones—nearly half of which have never been featured in the column—with tips, riffs, mini-recipes, and stunning photographs from James Ransom, to create a cooking canon that will stand the test of time. Once you try Michael Ruhlman’s fried chicken or Yotam Ottolenghi and Sami Tamimi’s hummus, you’ll never want to go back to other versions. But there’s also a surprising ginger juice you didn’t realize you were missing and will want to put on everything—and a way to cook white chocolate that (finally) exposes its hidden glory. Some of these recipes you’ll follow to a T, but others will be jumping-off points for you to experiment with and make your own. Either way, with Kristen at the helm, revealing and explaining the genius of each recipe, Genius Recipes is destined to become every home cook’s go-to resource for smart, memorable cooking—because no one cook could have taught us so much.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Foodie",
    "Culinary"
  ],
  "author": "Kristen Miglore",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/22716562-food52-genius-recipes"
}