{
  "title": "The Class of '65: A Student, a Divided Town, and the Long Road to Forgiveness",
  "description": "Being a student at Americus High School in 1964 was the worst experience of Greg Wittkamper’s life. A member of a nearby Christian commune, Koinonia, Greg was publicly and devoutly in favor of racial integration and harmony. Koinonia’s farm goods were boycotted by businesses for miles around, and they were targeted and attacked with bombs and gunfire by the Ku Klux Klan.But Greg did not waver in his beliefs. When Americus High School was integrated, he refused to participate in the insults and violence aimed at its black students. He was harassed and bullied and beaten but stood his ground. In the summer after his senior year, as racial strife in Americus reached its peak, Greg left town.Forty-two years later, in the spring of 2006, a dozen former classmates wrote letters to Greg, asking his forgiveness and inviting him to return for a class reunion. Their words opened a vein of painful memory and unresolved emotion. The long-deferred attempt at reconciliation started him on a journey that would prove healing and saddening.The Class of '65  transcends the ugly things that happened decades ago in the Deep South. This book is also the story of four people—David Morgan, Joseph Logan, Deanie Dudley, and Celia Harvey—who reached out to their former classmate. Why did they change their minds? Why did it still matter to them, decades later? Their tale illustrates our capacity for change and the ways in which America has – and has not – matured in its attitudes about race.At heart, this is a tale about a pariah and the people who eventually realized that they had been a party to injustice. It is a tandem story of a country and its people—angry, fearful, and proud—to make real change.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Race",
    "Social Justice",
    "Book Club",
    "Historical"
  ],
  "author": "Jim Auchmutey",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/22715949-the-class-of-65"
}