{
  "title": "The New Wild: Why Invasive Species Will Be Nature's Salvation",
  "description": "Named one of the best books of 2015 by The EconomistA provocative exploration of the “new ecology” and why most of what we think we know about alien species is wrong For a long time, veteran environmental journalist Fred Pearce thought in stark terms about invasive they were the evil interlopers spoiling pristine “natural” ecosystems. Most conservationists and environmentalists share this view. But what if the traditional view of ecology is wrong—what if true environmentalists should be applauding the invaders?In The New Wild , Pearce goes on a journey across six continents to rediscover what conservation in the twenty-first century should be about. Pearce explores ecosystems from remote Pacific islands to the United Kingdom, from San Francisco Bay to the Great Lakes, as he digs into questionable estimates of the cost of invader species and reveals the outdated intellectual sources of our ideas about the balance of nature. Pearce acknowledges that there are horror stories about alien species disrupting ecosystems, but most of the time, the tens of thousands of introduced species usually swiftly die out or settle down and become model eco-citizens. The case for keeping out alien species, he finds, looks increasingly flawed.As Pearce argues, mainstream environmentalists are right that we need a rewilding of the earth, but they are wrong if they imagine that we can achieve that by reengineering ecosystems. Humans have changed the planet too much, and nature never goes backward. But a growing group of scientists is taking a fresh look at how species interact in the wild. According to these new ecologists, we should applaud the dynamism of alien species and the novel ecosystems they create.In an era of climate change and widespread ecological damage, it is absolutely crucial that we find ways to help nature regenerate. Embracing the new ecology, Pearce shows us, is our best chance. To be an environmentalist in the twenty-first century means celebrating nature’s wildness and capacity for change.",
  "genres": [
    "Science",
    "Nonfiction",
    "Nature",
    "Ecology",
    "Biology",
    "Environment",
    "Natural History"
  ],
  "author": "Fred Pearce",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/22716462-the-new-wild"
}