{
  "title": "California Sorcery",
  "description": "Here's a book of magic, all right -- all right, dark magic -- and its contributors are, as the title implies, sorcerers of their craft. California Sorcery provides a virtual roll call of some of the most important names in the history of 20th-century horror, sci fi, and dark fantasy: Robert Bloch, Ray Bradbury, Richard Matheson, Charles Beaumont -- just to name a few. And this is no reprint sham like we've seen too many times before; nine of the 12 stories were never-before-published! (The Bloch piece hasn't seen print in 50 years, and Harlan Ellison's piece is newly revised.)We're talking the greats of the field, folks, guys who were writing high-octane tales of terror when Stephen King was still playing with toy soldiers. (King, in fact, has acknowledged a number of these authors as major influences.) In their day (though many are still actively writing) the contributors here were known in Hollywood as \"The California School\" or simply, \"The Group\"; they became a notorious creative coterie due to their sheer, indefatigable talent and, combined, helped brand the entertainment industry with some of the finest scripts, novels, and stories ever produced. Coeditor William Nolan says it best in his foreword: \"The Group lives again in this book, brought together at last and for always...\" Matricidal decapitations, a camping trip with some haunting and rite-passaging implications, sci fi in the Old West, graveyard ghosts and philosophy, a spaceship with an appetite, a man who loses his memory and someone else finds it -- these are just a few of the brilliant goings-on in this wonderful and important (and gorgeous!) limited edition. Plus, Christopher Conlon's introduction not only elucidates the importance of these men and their work but also provides a fascinating, in-depth biography. If you revel in the best fiction being written today, this book will show you where a whole lot of its spirit and inspiration came from. California Sorcery, in fact, is more than just an anthology; it's a celebration of dark art conjured up by the masters of the form. Let the conjuring begin.—Edward Lee",
  "genres": [
    "Short Stories",
    "Fantasy",
    "Anthologies",
    "Science Fiction",
    "Horror"
  ],
  "author": "William F. Nolan",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/2272518.California_Sorcery"
}