{
  "title": "Romancing My Love",
  "description": "Voted BEST BOOK SERIES of 2013 by Supportive Business Moms, UK . \"...love, loss, lies, grief, finding happiness in the face of adversity, romance, humor, bravery, hot hot hot sex scenes, marriages, births and totally awesome characters.\" --Supportive Business Moms, UK . \"Like Nora Roberts, Melissa Foster has captivated me with her fantastic, sexy, romantic stories.\" Kimberly Winning, avid reader . **BONUS** Includes the first chapter (sneak peek) of FLIRTING WITH LOVE, The Bradens, Book Ten, AND, Seaside Dreams, Seaside Summers, Book Two. . \"Sensual, sexy, and satisfying. A captivating blend of the dance between lust, love, and life.\" -- Bestselling author, Keri Nola  IN ROMANCING MY LOVE... After months of caring for her terminally ill mother, Rebecca Rivera is left all alone in a world she doesn’t trust—but she’s determined not to let her mother’s death define her. Losing her job, having to pummel some jerk for being too handsy, and living in her car are just temporary setbacks to an otherwise solid plan in finding her footing. Full of pride and used to being in control of her life, she’s certain she can make it on her own. The last thing Rebecca needs is a man to fix her troubles—even if that man is strikingly handsome, wealthy, and charismatic Pierce Braden.  Pierce is a powerful real estate investor on the verge of a major acquisition. As the eldest of six siblings raised by a single mother, he’s spent his life protecting those he loves. He’s used to being in charge and making things right, and although he’d give his life for his family, he treats the women he dates as expendable—until he meets sexy and stubborn Rebecca Rivera, a woman who is as strong as she is vulnerable.  Passion ignites between them, and the two share their most intimate thoughts and desires. It doesn’t take long for Pierce to realize that Rebecca is as determined not to be saved as he is to find a way into her heart. As their love grows, Rebecca must face fears she didn’t even realize she had—and Pierce must learn the hard truth that sometimes less really is more. Is the power of true love enough for Rebecca and Pierce to learn to give up control and allow their hearts to take over?  *** ROMANCING MY LOVE is the newest addition to the BRADEN series by New York Times & USA Today bestselling and award-winning author Melissa Foster. This contemporary romance series features alpha male heroes and sexy, empowered women. They’re flawed, funny, passionate, and very relatable to readers who enjoy new adult romance, contemporary romance, and women’s fiction. . READ THE FULL LOVE IN BLOOM SERIES: . Watch for the full LOVE IN BLOOM series: . SNOW SISTERS BOOK 1: Sisters in Love BOOK 2: Sisters in Bloom BOOK 3: Sisters in White . THE BRADENS BOOK 4: Lovers at Heart (Treat & Max) BOOK 5: Destined for Love (Rex & Jade) BOOK 6: Friendship on Fire (Josh & Riley) BOOK 7: Sea of Love (Dane & Lacy) BOOK 8: Bursting with Love (Savannah & Jack) BOOK 9: Hearts at Play (Hugh & Bree) . THE REMINGTONS BOOK 10: Game of Love (Dex) BOOK 11: Stroke of Love (Sage) BOOK 12: Flames of Love (Siena) BOOK 13: Slope of Love (Rush) BOOK 14: Read, Write, Love (Kurt) . THE BRADENS BOOK 15: Taken by Love (Luke) - BOOK 16: Fated for Love (Wes) - BOOK 17: Romancing My Love (Pierce) BOOK 18: Flirting with Love (Emily) - Coming soon BOOK 19: Dreaming of Love (Ross) -",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Family",
    "Fiction",
    "Anthologies"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/22725631-romancing-my-love"
}