{
  "title": "Birdbrain",
  "description": "Set at the dawn of America's environmental consciousness, late 1970's, early '80's, pretty Ellowyn Kelsey is a redneck girl living the pretty redneck life in rural Michigan, waiting for her husband to come around...Her self-imposed lobotomy ends when she shows up at the wrong time for a church picnic, meeting a bunch of birders instead. Watching a mating pair of bluebirds tending to one another causes something in her to break. Everyone recognizes what she's going through except her--the depth of her pain and emotion holds her captive. How can she be the last to know? She is indignant, hurt, has no idea how to process the emotional sideswipe. Her pain is expressed through the crazy narcissistic melodrama of youth, her reluctant unabashed accomplice is her best friend, Patty. Part II finds her experiencing yet another major loss. She finds refuge in nature making true her mother's prediction, a chasm may form between her new and old life, between she and Patty. As the narcissism of her youth wears off, she starts to care about something bigger than herself (God forbid!), her own planet. The \"rednecks and assorted white trash\" of her town waste no time labeling her as their own \"token environmental wacko\". A new guy shows up, heart in one hand, binoculars in the other...She meets Kate, one of the first female biologists to be hired by the Michigan Fish and Game Department. A trailblazer in a male-dominated profession, Kate has spent her life fighting to \"protect the environment\". It hasn't worked out too well. Kate's very angry. Who wants to end up like her? Accompanied by her faithful mutt, Ellie leaves Michigan to travel \"out west\" where her sister lives, resulting in some unexpected experiences: spirits in the desert, an accidental crusade against a development, geographically diverse sexual encounters. Then there are those amazing sandhill cranes (who is this guy in my tent?). Is this her way of dealing with her transformation, maybe loving someone again?Major influences: Ed Abbey, Tom Robbins, John Irving, Rachel Carson, T.C. Boyle, J.D. Salinger, Pam Houston, Kurt Vonnegut, many others.",
  "genres": [
    "Contemporary",
    "Birds"
  ],
  "author": "Virginia Arthur",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/22727611-birdbrain"
}