{
  "title": "Slay Me",
  "description": "Sometimes the ride of your life can get a little bumpy… When Sabrina Newton is given the job opportunity of a lifetime, she jumps at it. It will be challenging, but the uptight and ambitious A&R girl knows she can handle anything.  Even Nick Falcon. Nick’s been the biggest rock star on both sides of the pond for a decade. The spoiled British singer is beyond jaded and used to getting what he wants, whenever and wherever he wants it. But when Sabrina takes him on as a client, he finally meets his match. She arouses his senses beyond belief while butting heads with him on every detail. He can’t tell if he wants to kiss her or kill her, or both. Nick finds the perfect revenge by forcing her to come along on his world tour. The label wouldn’t want to lose their golden boy as a client after all. Sabrina is whisked away into the glittering but gritty world of concert halls and five star hotels. Can she hold onto her heart when Nick shows her the real him?Excerpt: Nick winked at the flight attendants who were riding out the turbulence in the bar section. He grabbed a bottle of tequila and two glasses. One of the girls scooped ice and a lime into each.\"Do me a favor love and tell the captain to take the bumps down a few notches.\"She nodded and walked gracefully toward the cockpit despite the turbulence. He shook his head. They really were remarkable women. They hadn’t revealed a thing about the past to Sabrina. He decided to give them all a raise.Funny thing that, giving gorgeous women money for not sleeping with him.He turned and walked back to the lounge area. Marley must be in the back taking a nap. He didn’t mind. He knew he wouldn’t be getting Sabrina into bed just yet.Soon, though.Very soon.He smiled at her, even though she couldn’t see him with her eyes so tightly closed. Time to start laying the groundwork.\"Here we are. Liquid courage.\"Her eyes opened a crack. She stared at him sitting beside her then snapped her eyes shut again.\"I don’t drink.\"\"There’s a first time for everything.\"He poured himself some tequila and sipped it, smacking his lips together.\"God that’s good. I can already feel myself relaxing.\"She opened her eyes again. The poor thing looked terrified. He really was a heel. He squashed down the voice of his conscience and smiled reassuringly.\"You know love, I’m a bit afraid of flying myself. Not to mention this is a new pilot.\"\"It is?\"\"Yeah first time flying with him. I’ve never experienced this sort of turbulence before. It’s a bit frightening. Even poor Marley had to take something and lie down.\"\"He did? Oh god. This is not good.\"He smiled grimly and handed her the second glass, splashing a liberal dose of tequila into it. This time she took it, staring at it uncertainly.Good girl.\"There you go. Bottoms up.\"She lifted the glass to her lips and drank. He watched her as her face crinkled.\"It’s strong.\"\"It’s good medicine love. Here, have another splash.\"He tipped the bottle into her glass, squeezing his lime into it. It cut the taste a bit. She stared at the glass in her hands and then lifted her eyes to his. He inhaled sharply at the trusting look in her eyes. He was going to hell, that much was certain.But by God he’d enjoy the ride.",
  "genres": [
    "Romance",
    "Contemporary",
    "Musicians",
    "Contemporary Romance",
    "Music"
  ],
  "author": "Joanna Blake",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/22728593-slay-me"
}