{
  "title": "Penny Palabras Season One: It's Later Than You Think",
  "description": "Penny Palabras, 17, has experienced the paranormal for years. She knows that things aren't always what they seem. She's tormented by a malevolent entity called the Straw Man. As she searches for ways to banish him from her life, she's haunted by more than ghosts. Her nightmares won't let her sleep, her friends and family can't understand, and the Straw Man is getting more powerful every day.This Season One volume collects episodes 1-6 of Penny Palabras as well as the kickstarter funded addition of the \"Lucas\" segue and additional developmental artwork. The episodes are (minor plot spoilers follow):01 - The Spectacular Revolver. Penny begins her narrative, introducing us to her world. We learn about the Straw Man, meet the Pawn Broker and the Librarian, and Penny acquires the Spectacular Revolver.02 - The Devil's Weight. Penny is visited by a surprise guest when she least expects it. She learns more about ghosts and getting rid of straw men.03 - The Detachment Bell. Penny's friend Stevan brings her an artifact that she'll later find useful.04 - Disappearing Acts - Penny gets expelled from school and we see what it's like to be tormented by the Straw Man. Penny realizes that there is only one way to protect her family and friends from him - by leaving.05 - A Gun In Act One - Penny makes some discoveries that lead her to her father and has another run-in with the Straw Man. She finds out more about the librarian and herself as a result of his attack.Segue - Lucas. Backed by a Kickstarter supporter of the project, this segue chronicles Penny's quest to find the summoning spell that she uses in the beginning of the next episode.06 - Love Letters - The season one story arc concludes as Penny resorts to extremes, allowing the Tiger Devil and his associate to help her bind the Straw Man and send her home.",
  "genres": [
    "Graphic Novels",
    "Urban Fantasy",
    "Horror"
  ],
  "author": "James B. Willard",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/22730787-penny-palabras-season-one"
}