{
  "title": "Unbeloved",
  "description": "Dorothy Kelley is a born romantic, searching for her prince. Instead she finds herself pregnant at fifteen, and in a loveless marriage by the tender age of eighteen. Then hope comes riding into her life on a motorcycle and within weeks, Jason “Jase” Brady, a member of the Hell’s Horsemen Motorcycle Club, sweeps Dorothy off her feet.But nothing is ever simple for Dorothy. Jase is married with children. And as Dorothy patiently waits for Jase to give her the happily-ever-after she’s been dreaming about, James “Hawk” Young, a member of the Hell’s Horsemen with secrets of his own, sees an opening into Dorothy’s life and takes it.Carrying on two secret affairs is no easy feat. As Dorothy tries to dig herself out of the mess she’s created, covering one mistake with another, tragedy strikes, nearly costing Dorothy her life and that of her unborn son.What follows is a long and painful journey of self-discovery and forgiveness, as Dorothy comes to realize that home was exactly where she’d left it, and the love she’d forever craved had always been within her reach.This is the story of Dorothy, Jase, and Hawk.We are all born pure; it is our journey that burdens us and leads us astray. Our mistakes that beat us down and cover us in guilt and shame, burying us a little more with each passing hardship. It is up to us to dig ourselves out, to come to terms with our faults, to embrace not only our imperfections but those of the ones we love, and to once again find the path we strayed from. Warning: This is not a conventional or predictable love story. It involves one woman and two men bound by a love so destructive it spans two decades, pitting brother against brother, and shattering the lives of those touched by it.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Dark",
    "Erotica",
    "Contemporary",
    "Adult",
    "Dark Romance"
  ],
  "author": "Madeline Sheehan",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/22730419-unbeloved"
}