{
  "title": "Not Quite Dead",
  "description": "\"Rowe is a pararnomal star!\" ~J.R. Ward  * this is a full length novel approximately 350 pages in length.  An ancient vampire has hunted Jordyn Leahy since she was a child, haunting her sleep, demanding her soul and her flesh. After decades of silence, he has returned to ruthlessly claim the woman who once denied him.  Bold and arrogant, loner Eric Hunter allows himself to care about nothing, except his missing brother. He will not stop until he finds him, even if it means teaming up with the bold, sensual woman who awakens in him the dark cravings he has denied for so long.  As the deep of night closes in, Jordyn and Eric must fight the battle of their lives, in a quest for survival in a world where hunger rules, desire destroys, and eternity means no second chances.  \"Stephanie Rowe writes with a wit reminiscent of bestselling author J.R. Ward, and an imagination that authors envy.\" ~Romance Fiction on Suite101.com  \"[Rowe] has penned a winner with NOT QUITE DEAD, the first novel in her new NightHunter vampire series...an action-packed, sensual, paranormal romance that will captivate readers from the outset...Brimming with vampires, danger, resurrection, Louisiana bayou, humor, surprising plot twists, fantasy, romance and love, this story is a must-read!\" ~Romance Junkies  ABOUT THE Four-time RITA® Award nominee and Golden Heart® Award winner Stephanie Rowe is the nationally bestselling author of more than forty published novels. Stephanie has received starred reviews from Booklist and high praise from Publisher's Weekly. Stephanie is the author of the bestselling Order of the Blade paranormal romance series, and she will be launching her new NightHunter vampire series in Oct 2014. She also writes the intensely passionate Ever After series, and the gripping Alaska Heat romantic suspense series. She also published in teen fiction, middle grade fiction, and motivational nonfiction.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Vampires"
  ],
  "author": "Stephanie Rowe",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/22730547-not-quite-dead"
}