{
  "title": "Changeling",
  "description": "Demon or Angel? Human or Chosen? Mortal or Immortal?Delve into the origins of the Angel of Death. Abandoned at birth and left to die, alone in the forest, the Angel is found by the local healer. In loving secrecy he is raised unnamed and unknown lest his strange appearance bring down the wrath of the local villagers. He grows up, cared for by Auntie until her fearful predictions come true. Discovered in his secret grove, his life is transformed, evoking demons that demand more than he can give. Unable to save the lives of those he loves he flees to live alone, away from those who would do him harm. It is alone, exiled by humanity that he comes across the one who would change his life forever, to become – The Angel of Death In Praise of Changeling “...an amazing read...full of surprises...kept me on the edge of my seat.” - Sizzling Hot Books (4 out of 5) In Praise of The Chosen Chronicles “A dark and gripping tale by a true mistress of supernatural fiction. Karen Dales brings fresh blood to the vampire genre.” —Michelle Rowen, National Bestselling Author “For readers who adore textured layers in their literary tapestries, rich in colorful emotions, Karen Dales is one writer of vampire fiction they’ll want to read.” — Nancy Kilpatrick, Author and Editor “...is a must-read for any fans of Twillight or other books in the popular Vampire genre.” - Oakville Today. “...one of the best stories by a new and upcoming writer that I have read.... Very few stories are the equal to this tale.” - Siren Book Reviews (5 out of 5) \"...a poignant and epic tale... a brilliant example of good overcoming and prevailing against evil and prejudice... an emotional ride of literary genius, both heart-warming and heartbreaking at the same time...\" - Bitten By Books (5 out of 5) “I was hooked...a good book to read on a cold and stormy day.”- Night Owl Reviews (4 out of 5)",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Vampires"
  ],
  "author": "Karen Dales",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/11347792-changeling"
}