{
  "title": "The Decimation of Mae",
  "description": "The Devil visited me three times in my life; albeit, my short life. Not in the physical sense, you must understand, but very much literally.  He was persistent, resolute and tenacious. His ruthless greed to annihilate me was utterly disturbing. I am sure if he had hierarchy, the man at the top would have dragged his arse into Hell’s prison for his unscrupulous methods.  I was just fifteen when I first became aware of what he was capable of. This initial taste of him set the playing field for how my life was to be lived – for want of a better word. He mocked me, showed me mercilessly how he played the game and how he liked to cheat at said game. He ridiculed and taunted me until, six months later, he won and took something of so much importance from me that I would never be the same again.  His second visit was, in my eyes, so much more cruel and heartless. I know we’re talking about the Devil here, and yes, you have a right to say he had no heart but even then, even when I was so utterly broken, I begged to differ and hoped – no, prayed – that somewhere deep in the caverns of his black, tortured soul there was something that beat and confused his emotions once in a while.  The third visit was somewhat different than the other two. He tried, and at first succeeded to bring me to my knees once and for all, but then something happened. God finally intervened and altered Satan’s intention; he sent hope and morphed the Devil’s minion into an Angel, hoping to break and shatter the anguish and suffering. He gave the ability for me to feel pleasure in pain, order in the chaos and light in the darkness. But in giving me a reprieve, he also gave me something that would finally and ultimately obliterate me. He gave me the capability to love, therefore giving me the ability to be destroyed. And Satan made sure that I was destroyed. Cruelly, viciously and sadistically.  I am Mae Swift, and this is the story of my decimation. ***WARNING*** This story doesn’t contain hearts and flowers, it doesn’t even contain the word ‘love’. It isn’t for the fainthearted, nor those who want romance and happy ever afters. It’s dark, in fact it goes beyond the dark realms of misery and despair. It contains disturbing scenes of sexual violence, cruelty and torture. It also includes self-harm, pain addiction and brutalisation. Please bear this in mind before purchasing this book. Thank you.",
  "genres": [
    "Dark",
    "Abuse",
    "BDSM",
    "Romance",
    "Erotica",
    "Dark Romance",
    "Adult"
  ],
  "author": "D.H. Sidebottom",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/22728031-the-decimation-of-mae"
}