{
  "title": "Dark Desires Box Set",
  "description": "From some of today's most captivating New York Times, USA Today, and Amazon and B&N bestselling authors. You want hearts... flowers... romance? You think you do, but your heart has darker desires. I know what you want. What you need. Yeah, you'll fight me. But you don't have a choice. You're mine now. I'm going to make your darkest dreams come true. You can't tiptoe around the brink of darkness without expecting to be pushed over the edge. Maybe you think I'm broken. Maybe all I need is your healing touch to cure me of a lifetime of pain? Not even close. You'll never understand the real me. Think I'm lying? Still want to give it a shot? That's exactly what I want you to do.  You think you can soothe me, heal me, tame me? Not a chance. You can't save me from the darkness; I'm dragging you into it. YOU. ARE. MINE. These must-read dark romance novels come to you from some of today's most captivating New York Times, USA Today, and Amazon and B&N bestselling authors. Give in to your Dark Desires. It's too late to turn back now... Taming A Dark Heart by Terry Towers: Colin Almond is exactly the kind of man Gabriella tries to avoid, but he also has an air of danger and excitement about him that's impossible for her to resist. Gabriella quickly discovers that the man she's falling for isn't exactly who he says he is. He has deep, dark secrets and that darkness is threatening to destroy them both. Black Widow by PJ Adams: Two years ago Eleanor Dryton lost everything and ended up in jail. All that remained was a burning desire for revenge. Now, she's learned she can be bad, but when her search for revenge leads her to a man who takes bad to a completely different level, just how far is she willing to go? Uncover Me by Linda Barlow: On a dream Aegean vacation, photographer Ellie Heath stumbles into trouble. Captured by the sun-bronzed pirate who heads up an antiquities smuggling ring, Ellie is forced to submit or die. As she struggles to obey the harsh demands of the elusive man who holds her, she begins to realize that there's more at stake than her own freedom. Master Over You by Cerys du Lys & Ethan Winters: My name is Noah. I'm not a nice person. This isn't cupcakes and candyland, love. I'll take you, break you, and offer you to the highest bidder without a second thought. It's business, nothing personal. You wouldn't understand, and I'm not going to explain it. Just know that there's a monster in every closet, and I'm in yours. Ruthless by Vanessa Waltz: An ex-pool hustler must fight her attraction to a sinful, sexy biker when she's kidnapped by the Dragons MC and sold to the club's Vice-President. No Limits by Adriana Hunter: Anna Pierce is about to discover a world where pleasure and pain meet and her darkest desires come to life in a series of tortuously erotic lessons handed down to her by a mysterious Dom. Surrender of Persephone by Selena Kitt: Persephone must face not only her past, but her present and her future as well, and the choices she will be forced to make will change the world forever. At The Mercy Of Their Games by Gia Vanna: Anna is wrenched from the polite society of Regency London and plunged into a world of crime. Two brothers run the cartel and Anna falls for the dark power of Tristan. But the brothers are at war with each other; has she chosen the right man to save her? My Love Forgive by Anna Antonia: I wasn't supposed to be this reckless. Or this stupid. The beautiful captor that held me, the one I fell deeply, obsessively in love with, was determined to break me, to make me accept the new circumstances of our life. People like me were supposed to be safe, sane, and all the rest, yes? No. Not even close.",
  "genres": [
    "Romance",
    "Anthologies",
    "BDSM",
    "Dark Romance",
    "Erotica",
    "Erotic Romance",
    "Dark"
  ],
  "author": "Terry Towers",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/22732553-dark-desires-box-set"
}