{
  "title": "The Good Psychopath's Guide to Success",
  "description": "How to use your inner psychopath to get the most out of life:Being a psychopath is bad, right? Actually no.A surprising number of us are good psychopaths – people who can control qualities such as fear, indecision and conscience to shine in a variety of situations. Are you one of them?In this compelling guide, packed with insightful, interactive quizzes, SAS legend Andy McNab and Oxford University psychologist Dr Kevin Dutton will help you find out if you are a good psychopath – and if you’re not, how you can behave like one.Drawing on the heroic military career of McNab (a confirmed good psychopath) and Dutton’s lifetime of research, The Good Psychopath’s Guide to Success will help you improve qualities such as charm, coolness, courage and confidence to help you get the very best out of life.What is a good psychopath? And how can thinking like one help you to be the best that you can be?Professor Kevin Dutton has spent a lifetime studying psychopaths. He first met SAS hero Andy McNab during a research project. What he found surprised him. McNab is a diagnosed psychopath but he is a GOOD PSYCHOPATH. Unlike a BAD PSYCHOPATH, he is able to dial up or down qualities such as ruthlessness, fearlessness, conscience and empathy to get the very best out of himself - and others - in a wide range of situations.Drawing on the combination of Andy McNab's wild and various experiences and Professor Kevin Dutton's expertise in analysing them, together they have explored the ways in which a good psychopath thinks differently and what that could mean for you. What do you really want from life, and how can you develop and use qualities such as charm, coolness under pressure, self-confidence and courage to get it? The Good Psychopath Manifesto gives you a unique and entertaining roadmap to self-fulfillment both in your personal life and your career.Find out more about this US edition, and take quizzes yourself: http://apostrophebooks.com/good-psych...",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Business",
    "Audiobook",
    "Personal Development",
    "Science"
  ],
  "author": "Andy McNab",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/22732396-the-good-psychopath-s-guide-to-success"
}