{
  "title": "A trip to Jamaica with a true character of the people and island / by the author of Sot's paradise.",
  "description": "EARLY HISTORY OF TRAVEL & GEOGRAPHY. Imagine holding history in your hands. Now you can. Digitally preserved and previously accessible only through libraries as Early English Books Online, this rare material is now available in single print editions. Thousands of books written between 1475 and 1700 can be delivered to your doorstep in individual volumes of high quality historical reproductions. Offering a fascinating view into the perception of the world during the sixteenth and seventeenth centuries, this collection includes accounts of Columbus's discovery of the Americas and encompasses most of the Age of Discovery, during which Europeans and their descendants intensively explored and mapped the world. This series is a wealth of information from some the most groundbreaking explorers.++++The below data was compiled from various identification fields in the bibliographic record of this title. This data is provided as an additional tool in helping to insure edition ++++A trip to Jamaica with a true character of the people and island / by the author of Sot's paradise.Ward, Edward, 1667-1731.Attributed to Edward, Ward. cf. BM.16 p.London : [s.n.], 1698.Wing / W761EnglishReproduction of the original in the Henry E. Huntington Library and Art Gallery++++This book represents an authentic reproduction of the text as printed by the original publisher. While we have attempted to accurately maintain the integrity of the original work, there are sometimes problems with the original work or the micro-film from which the books were digitized. This can result in errors in reproduction. Possible imperfections include missing and blurred pages, poor pictures, markings and other reproduction issues beyond our control. Because this work is culturally important, we have made it available as part of our commitment to protecting, preserving and promoting the world's literature.",
  "genres": [],
  "author": "Edward Ward",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/11347669-a-trip-to-jamaica-with-a-true-character-of-the-people-and-island-by-th"
}