{
  "title": "Hände weg vom Quarterback",
  "description": "Mitch Cahill war ein grandioser Quarterback und gefeierter Footballgott, der alles besaß, was er sich nur hätte wünschen können. Doch einige Auswärtsspiele, Groupies und eine Knieverletzung später ist er geschieden und muss sich vom Profifootball sowie von den New York Titans verabschieden. Letzteres macht ihm nichts aus, aber die Trennung von seiner Exfrau hat er auch nach vier Jahren kaum verwunden und tut sich schwer damit, wieder eine Beziehung einzugehen. Dank eines Postens als Geschäftsführer in seinem alten Verein ist er jedoch so abgelenkt, dass sein Liebesleben kaum von Belang für ihn ist. Vor allem als er bei der Arbeit mit Avery Lancaster aneinandergerät, schweifen seine Gedanken immer wieder zu der herrischen und unbeschreiblich hübschen Frau ab, die ihn bei ihrer ersten Begegnung einen abgehalfterten Ex-Footballspieler genannt hat. Es widerstrebt ihm aus tiefstem Herzen, mit dieser Furie zusammenzuarbeiten, doch es bleibt ihm nichts anderes übrig. Sobald Mitch erkennt, wie sie wirklich ist, und er ihre weiche Seite entdeckt, ist er hin und weg. Aber schafft er es auch, Averys Vertrauen zu gewinnen?   \"Hände weg vom Quarterback\" ist der mittlerweile neunte Band der \"New York Titans\"-Reihe. Die Bücher sind in sich abgeschlossen und können einzeln gelesen werden.  Von Poppy J. Anderson sind bereits folgende Romane erschienen:  \"Verliebt in der Nachspielzeit\" (Band 1) \"Touchdown fürs Glück\" (Band 2) \"Make Love und spiel Football\" (Band 3) \"Verbotene Küsse in der Halbzeit\" (Band 4) \"Knallharte Schale - zuckersüßer Kerl\" (Band 5) \"Kein Mann für die Ersatzbank\" (Band 6) \"Unverhofft verliebt\" (Band 7) „Auszeit für die Liebe“ (Band 8)  Sowie:  \"Beim zweiten Mal küsst es sich besser\" (Kurzroman) \"Nachträglich ins Glück\" (Kurzroman) \"Die New York Titans Weihnachtsbäckerei\" (Eine weihnachtliche Novelle) \"Küsschen vom Osterhasen\" (Kurzgeschichte und Rezepte)  Der nächste Band der \"New York Titans\"-Reihe mit dem Titel \"Küss mich, du Vollidiot\" (Band 10) erscheint im Oktober 2014.  Mitte August erscheint zudem „Brandheiße Küsse“ – der Start einer neuen Reihe von Poppy J. Anderson.",
  "genres": [
    "Romance",
    "Romantic Comedy"
  ],
  "author": "Poppy J. Anderson",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/22737814-h-nde-weg-vom-quarterback"
}