{
  "title": "Chasing the Dream",
  "description": "Phoebe Fairchild didn’t have a great first year of college. In fact, it stunk! She realized she’d chosen a major, physics, that didn’t suit her. And worse than that, a boyfriend who was a first-class jerk.When she visited her mother in New York for Spring Break, Phoebe decided that a transfer to a new university, a thousand miles from her current one, and a new major were definitely in order. With a little assistance from her mother’s friend, Jack Stevens, Phoebe worked a transfer to NYU and better still, an internship at a major TV network.Phoebe moved into her mother’s old apartment, made a new friend, and figured out the Big Apple. But one of her biggest challenge was to be her internship assignment. Working in Public Relations, she had just gotten comfortable with the daily routine when she’s suddenly assigned to be the Personal Assistant to mega star, Chase Smythe. Since she was nine years old, Phoebe had been starry-eyed for the blond haired, blue eyed actor. Her room had been practically wallpapered in Chase Smythe pullouts from the teen magazines.But Chase Smythe wasn’t the charming, sexy actor on TV and in the movies he starred in. He was still as good looking as ever, but seemed that over the years, stardom had jaded him. In real life, Chase was full of himself, lazy and left a path of destruction in his wake that had been well concealed by his former ‘handlers.’ Now it was Phoebe’s job to rein him in.Nonetheless, there is a spark. Phoebe was warned to not cave into his charms, as fake as they are, but there’s more than just his charm. There’s chemistry. Is it real? Or is it an act? Will Chase let Phoebe in to see the real person, not the just TV personality? Did she even stand a chance with him? Especially as she faced new challenges herself? Or was being with Chase just a dream?WARNING: This book contains subject material of an adult nature intended for readers over the age of 18.",
  "genres": [
    "Romance",
    "Contemporary",
    "Erotica",
    "BDSM"
  ],
  "author": "Isabelle Peterson",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/22737818-chasing-the-dream"
}