{
  "title": "The Winemaker's Son",
  "description": "SIN AND VENGEANCE...the book was spellbinding. The plotting is brilliant, and Randy is an exquisite character, an evil genius for the modern age.--Debra HamelC.J. West delivers, from the highly erotic opening scene to the chilling conclusion. Sin & Vengeance is a provocative page-turner brimming with intrigue and heart-pounding suspense.--AlynnTHE END OF MARKING TIME... West has brilliantly portrayed a world gone crazy where the rule is there are no rules, or are they.  Crime fiction meets science fiction in this awesome thriller.\"--Book BitchPowerful, thought provoking and massively entertaining... I loved this book and the way it made me root for someone who I knew I shouldn't like.--CrimeSquad.comADDICTED TO LOVEThis book had me so hooked. I loved the plot ... unique and creative [with]  just the right about of romance, sexuality, thrills, mystery, and just plain crazy ...--Tiffany Harkleroad, Tiffany's BookshelfCJ's latest offering is a blend of the thrillers we come to expect from him and a new touch of romance, actually a little steamier than just any old romance, so I like to call it a \"steamy thriller.\"--RoxanneWhen his knee shatters on the playing field, Charlie Marston is plunged into turmoil. The fallen college superstar joins the family winemaking business, but working alongside his parents is not the future he had planned. He escapes work whenever he can and soon finds a new friend named Randy Black. Randy is part stunt-pilot, part Casanova, and part drunken Pied Piper. Randy introduces Charlie to Deirdre Deudon, the provocative wife of a French farmer. They come together in an ill-conceived stunt that explodes into consequences that chase Charlie and Randy back home to Massachusetts and change Deirdre's life forever. The after-effects of this tragic mistake bind the three of them together and threaten everything they hold dear.",
  "genres": [
    "Thriller",
    "Suspense",
    "Mystery",
    "Fiction",
    "Amazon",
    "Mystery Thriller"
  ],
  "author": "C.J. West",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/2273669.The_Winemaker_s_Son"
}