{
  "title": "Liebe geht durch alle Zeiten",
  "description": "The Ruby Red Trilogy: Ruby Red, Sapphire Blue, and Emerald GreenThis internationally bestselling series follows Gwyneth Shepherd, a girl with a time-traveling secret. Traipsing through past centuries, juggling a potential romance, and unlocking her destiny, Gwen has her work cut out for her.Ruby Red: Gwen has always known that her family is different—the women, in particular. As time travelers, they are no strangers to the possibility of the impossible. But even they are't expecting it when Gwen shows signs of being a time traveler rather than her cousin Charlotte. Thrust into a world she should have been excluded from, Gwen is introduced to Gideon, a fellow traveler. Although the two don't get along, something other than annoyance might be brewing under the surface. As Gwen masters her new ability, she learns more abou therself than she ever could have imagined.Sapphire Blue: Gwen has joined the ranks of the Circle of Twelve, a secret society of chosen time travelers. As the Ruby, Gwen is tasked with finding travelers in the past, all while delving into prophecies and trying to read the mixed signals that Gideon, the Diamond of the Circle, has been sending. With the help of her best friend, a ghost, and a gargoyle demon, Gwen seeks to unearth the truth behind the Circle—a truth that has been actively hidden from her.Emerald Green: Crushed to learn that Gideon may have been deceiving her all along, Gwen has to move forward nonetheless. She has more than enough on her plate: her distrust of Count Saint-Germain, founder of the Circle of Twelve, who wants Gwen to finish collecting blood from the other chosen travelers; the chronograph, a device which will close the Circle if she succeeds; and the resistance she meets at every turn as she seeks more knowledge. With much more to be revealed, Gwen must race against the clock to fulfill her destiny—before it's too late.Includes bonus chapters from Kerstin Gier Dream a Little Dream!",
  "genres": [
    "Fantasy",
    "Romance",
    "Young Adult",
    "Time Travel",
    "Fiction",
    "Audiobook",
    "Romantasy"
  ],
  "author": "Kerstin Gier",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/22738208-liebe-geht-durch-alle-zeiten"
}