{
  "title": "Smoldered",
  "description": "Asher Peterson is a self-made man, owner of the Electric Tunnel, Sin City’s hottest adult entertainment spot. Brazen and formidable in designer T-shirts and motorcycle boots, he seems unflappable whether he’s making his rounds through the decadent decor of the Tunnel, or whipping through the desert heat on his bike. But inside he is a shattered man, desperate to understand what unconditional love from a woman feels like. Hiding the effects of his emotionally stunted youth behind a gritty persona, and keeping his fractured soul buried deep while seeking out his baser instincts, Asher is convinced he is man enough to leave the past in the past. The only clue to his broken soul is his deep-seated need to provide safety and a good life for emotionally damaged women within the glamorous walls of his strip club. Fooling himself that he deserves little in life, Asher keeps his big heart tightly guarded with everyone but Sienna Flower, his friend, business partner, and headliner. Until, that is, the night he runs into his childhood friend, Natalie Parker. While trolling a rival strip club, perusing their offerings for his own personal pleasure, he collides with his past. Coming face-to-face with a woman he only knew as a girl, he’s shaken when he finds the dark-haired beauty in a precarious position. Now all grown up, she’s a hardened soul who reminds him of where he came from, and stirs within him the need to protect yet another woman. Known as Nat to most everyone, Natalie is a single mom to Quinn. But when she’s under the bright spotlights in a thong, she’s known as Natasha or Nataleigh Dallas. A girl who once had everything going for her, she’s now a jaded stripper with only room for her son in her life, and has erected impenetrable barriers around her heart. The strength of those walls is challenged the night a man she has known since childhood steamrolls his way back into her life, flashing those smoky-gray eyes that have always melted her. A man she has loved from afar since she was a young girl, one who lights fire to her walls, burning deeper, setting everything ablaze––smoldering her. Asher and Natalie, two people who are equally tormented by their own demons, set out to rescue each other as part-time lovers in a torrid, desperate workplace affair. Thinking they can remain friends while keeping their hearts at a safe distance, they find themselves at odds when their situation morphs into a messy, tangled mess. Ripping free of each other proves impossible as they learn that the very web that connects them goes much deeper than they ever expected.",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "Amazon",
    "Friends To Lovers",
    "Erotica"
  ],
  "author": "Rachel Blaufeld",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/22734407-smoldered"
}