{
  "title": "Seaside Hearts",
  "description": "Jenna Ward is vivacious, spontaneous, and confident—except when she’s around the man who stole her heart years earlier, strikingly handsome, quiet, and reliable Pete Lacroux. After years of trying to get his attention and overwhelmed from dealing with her mother’s new cougar lifestyle, Jenna’s giving up on Peter—and is ready to explore other men.  As the eldest of five siblings, with an alcoholic father to care for, boat craftsman Pete Lacroux always does the right thing and has no time for a real relationship. He’s looking forward to seeing his friend Jenna, a welcome distraction who’s so damn sexy and so painfully shy that she equally entertains and confuses him.  When Jenna picks up a hard-bodied construction worker, jealousy ignites Pete’s true feelings, and he’s powerless to ignore the desires for Jenna he never realized he had. But Pete’s not the quiet guy he appears to be, and his life is anything but conducive to a relationship. Can Jenna handle the real Pete Lacroux—the sexiest, most passionate alpha male she’s ever seen—or will she crack under pressure? And can Pete reclaim the life he once had without tearing apart his family? . **CONTENT WARNING: Due to mature content, recommended for readers aged 18+** . Read the full LOVE IN BLOOM series: . SNOW SISTERS BOOK 1: Sisters in Love BOOK 2: Sisters in Bloom BOOK 3: Sisters in White . THE BRADENS BOOK 4: Lovers at Heart (Treat & Max) BOOK 5: Destined for Love (Rex & Jade) BOOK 6: Friendship on Fire (Josh & Riley) BOOK 7: Sea of Love (Dane & Lacy) BOOK 8: Bursting with Love (Savannah & Jack) BOOK 9: Hearts at Play (Hugh & Bree) . THE REMINGTONS BOOK 10: Game of Love (Dex) BOOK 11: Stroke of Love (Sage) BOOK 12: Flames of Love (Siena) BOOK 13: Slope of Love (Rush) BOOK 14: Read, Write, Love (Kurt)  THE BRADENS BOOK 15: Taken by Love (Luke) BOOK 16: Fated for Love (Wes) BOOK 17: Romancing My Love (Pierce) BOOK 18: Flirting with Love (Emily) BOOK 19: Dreaming of Love (Ross) BOOK 20: Crashing into Love (Jake) -",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Amazon",
    "Friends To Lovers",
    "Chick Lit",
    "Anthologies"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/22735288-seaside-hearts"
}