{
  "title": "The Tug Of War: Raising Teens in our Seductive Society",
  "description": "This easy to read, straightforward, refreshingly honest look at the opportunities and challenges that face parents in raising children today! FOREWORDToday’s kids are thrust into the too much, too fast world of digital hustle. The constant drone from innovative but disruptive communication devices, stealthy involvement of corporate marketing, undesirable role models, and other cultural influences has led us to unhealthy (behavior and discipline) habits. Many of today’s new parenting strategies that aim to combat this influx of discordance are just not working …Society has changed. The family has changed. Kid’s behavior patterns have changed. A generation ago, children respected people in authority, listened to their parents, and had heroes. A massive transformation of family life has profoundly changed the parent-child dynamics. Many of the contemporary issues that have created this upheaval include both parents providing a dual function of breadwinner and ‘nurturer’.The work commitments now have taken up much of the frequency, time, and energy once dedicated to spending quality time with their children. To complicate this, 50% of parents have separated and kids are living in split households. No wonder kids from this new generation of ‘occasional parenting’ have a difficult time finding their own sense of self!This Essential Guide Explores Issues Like: • Feelings and Emotions • Self-esteem • Handling Stress and Fear • Excesses in Stimuli • Parental “Outsourcing” • Corporate Exploitation • Changing Bad Habits • Behavior & Discipline • Family Structure • Lifelong Friendships … And Many More!Written by author and consultant Mark Guido provides an honest discussion of today’s contemporary issues affecting the family in a frank, clear, easy to read manner that parents will appreciate. By changing our own habits to become more effective nurturers and teachers, we parents can overcome the unnecessary power struggle that prevents the parent and child from developing the strength of a life-long bond. Fostering both a secure and strong emotional, yet rational and creative, attachment between parent and child will prevent dissolving disconnects and barriers before they develop. Kindle format: http://www.amazon.com/dp/B00LU9H3L4Other digital formats: pdf, epub & WORDMark Guidomarkguidoauthor@gmail.com",
  "genres": [
    "Parenting"
  ],
  "author": "Mark Guido",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22741757-the-tug-of-war"
}