{
  "title": "The Parasol Protectorate: Soulless, Blameless, and Changeless",
  "description": "Book 1: SOULLESSAlexia Tarabotti is laboring under a great many social tribulations. First, she has no soul. Second, she's a spinster whose father is both Italian and dead. Third, she was rudely attacked by a vampire, breaking all standards of social etiquette. Where to go from there? From bad to worse apparently, for Alexia accidentally kills the vampire -- and then the appalling Lord Maccon (loud, messy, gorgeous, and werewolf) is sent by Queen Victoria to investigate. With unexpected vampires appearing and expected vampires disappearing, everyone seems to believe Alexia responsible. Can she figure out what is actually happening to London's high society? Will her soulless ability to negate supernatural powers prove useful or just plain embarrassing? Finally, who is the real enemy, and do they have treacle tart?SOULLESS is a comedy of manners set in Victorian full of werewolves, vampires, dirigibles, and tea-drinking.Book 2: CHANGELESSAlexia Tarabotti, the Lady Woolsey, awakens in the wee hours of the mid-afternoon to find her husband, who should be decently asleep like any normal werewolf, yelling at the top of his lungs. Then he disappears - leaving her to deal with a regiment of supernatural soldiers encamped on her doorstep, a plethora of exorcised ghosts, and an angry Queen Victoria.But Alexia is armed with her trusty parasol, the latest fashions, and an arsenal of biting civility. Even when her investigations take her to Scotland, the backwater of ugly waistcoats, she is upending werewolf pack dynamics as only the soulless can.She might even find time to track down her wayward husband, if she feels like it.Book 3: BLAMELESSQuitting her husband's house and moving back in with her horrible family, Lady Maccon becomes the scandal of the London season.Queen Victoria dismisses her from the Shadow Council, and the only person who can explain anything, Lord Akeldama, unexpectedly leaves town. To top it all off, Alexia is attacked by homicidal mechanical ladybugs, indicating, as only ladybugs can, the fact that all of London's vampires are now very much interested in seeing Alexia quite thoroughly dead.While Lord Maccon elects to get progressively more inebriated and Professor Lyall desperately tries to hold the Woolsey werewolf pack together, Alexia flees England for Italy in search of the mysterious Templars. Only they know enough about the preternatural to explain her increasingly inconvenient condition, but they may be worse than the vampires -- and they're armed with pesto.",
  "genres": [
    "Steampunk",
    "Fantasy",
    "Paranormal",
    "Fiction",
    "Romance",
    "Historical Fiction",
    "Urban Fantasy"
  ],
  "author": "Gail Carriger",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/11348897-the-parasol-protectorate"
}