{
  "title": "Day of Rain: Rise of the False Prophet",
  "description": "ACE for Asin B00LT2G21ENot a religious book...In the near future, Helel (Lucifer) and his demonic hosts are cast out of Heaven and thrown to the Earth, where he will lead his wicked army into the portals of time to destroy humanity, and more determinately, the Messiah. If he is victorious, all creation, including the Throne of Heaven will be cast into the Lake of Fire for eternity. Even the integrity of God hangs in the balance if the Messiah is destroyed before His time.Heaven's angels have been sent into the world as well, to prepare for the Great War against Helel. However, the angels are not aware of their own immortality, for they are \"asleep\" in human form, walking the earth in dormancy until they are awakened by the 7th angel.Dr. Malecki Sadeq, a Biblical Archeologist and professor at St. James University has an interesting past. In fact, he often lectures his students on the existence of angels and demons using his own experiences. And just beneath the centuries old cathedral on the university campus, he guards a horrifying secret; an evil bound for over 500 years, is held prisoner until his judgement - the demon, Raphan.Malecki must confront the demon in order to determine Helel's plot, which will eventually lead him the False Prophet and hopefully save all creation, even Heaven itself from eternal damnation.His adopted son, Christopher is the 7th messenger born of a virgin; sent to awaken the \"sleeping angels\" at the appointed time. Malecki finds him shortly after he was half-born in an alley of a small Colorado town on a cold, rainy October night. His mother, a young Hopi girl died trying to birth him just before the demons arrived to kill him for his special blood. Malecki saved the infant from the demons and raised him as his own son, knowing very well his hidden purpose.In time, the false prophet builds the third holy temple and unites the world. But this one is not the Ambassador of Peace the world is deceived into believing. The false prophet has intentions to ravage, to kill, and to destroy.",
  "genres": [
    "Fantasy",
    "Christian Fiction"
  ],
  "author": "C.A. Hartway",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/22743311-day-of-rain"
}