{
  "title": "Priya in Heels",
  "description": "A new adult title from Entangled’s Embrace imprint…Love doesn’t conquer all…does it?Priyanka Patel is the epitome of an obedient daughter. She’s finishing up her medical residency at one of Houston’s busiest emergency departments, and has agreed—albeit reluctantly—to marry the man her family has chosen for her. The only thing that can derail the “perfect” life laid out before her is the sexy musician down the hall who wants into her life…and into her bed.Tyler O’Connor has been infatuated with Priya since she treated his sprained ankle in the ER, and after saving her from a brutal attack, he can't get her out of his head. When Priya puts her family's wishes before their relationship, agreeing to an arranged marriage with another man, Tyler is devastated. But love is fierce and unreasonable and clashes with the carefully sculpted life her parents want for her. Is going after her heart such a big deal, or will it truly unravel Priya’s world?\"Priya in Heels is an exquisite mix of culture, romance, and humor all brought together by two characters you can't help but love from the get-go. It's a must read!\" ~NYT Bestselling Author Anna Banks\"Sweet and sexy with a dash of spice.\" USA Today Bestselling Author Nicola Marsh\"Chemistry jumps off the pages in this sexy-fun tale of family, “firsts,\" and doing anything for true love. I swooned over Ty right along with Pree!\" USA Today Bestselling Author Ophelia London\"A moving story about a girl at a crossroads between her Indian culture and what's expected of her, and the American boy who's stolen her heart.\" USA Today Bestselling Author Cindi Madsen\"A thoroughly entertaining romance that deftly captures the enduring conflict between conservative Indian traditions and contemporary American culture.\" Shobhan Bantwal, Award-Winning Author of the Dowry Bride",
  "genres": [
    "Romance",
    "Contemporary",
    "New Adult",
    "Contemporary Romance"
  ],
  "author": "Ayesha Patel",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/22739062-priya-in-heels"
}