{
  "title": "Love AND Revenge",
  "description": "MADDIE MONROE has had better days. And made better choices. When she wakes up kidnapped--used for bait--and in more danger than she could have ever imagined, it's all she can do to hope that she'll live to regret telling Seamus no.Ex-Navy SEAL SEAMUS KINCAIDE knows that the only easy day was yesterday. And in his line of work, enemies happen. He just never thought anyone would use Maddie to get to him. And now her life is on the lineMaddie's dimples bring hard men to their knees, and her smoothies make them beg for more. She's smart, funny, and just one of the guys. She wields a computer like Seamus wields a knife. And she's a spunky ray of sunshine in skinny jeans and a bop-tail who gives his serious, get-it-done attitude the adjustment it needs. She's happiness in his life, until he scares the hell out of her on a mission gone bad, and she can't deal. Letting her go won't be easy, but losing her forever is unacceptableLOVE and REVENGE is a story about facing your fears, fighting for what's important, and learning that you can't control life--you can only decide which life you want to live.Fight for love - die for revenge!Love AND Revenge is Book 3 in the three-book Love AND . . . series. This book can stand alone. If you desire a deeper understanding of some of the secondary characters, Love AND Bullets will introduce you to Devon Monroe (Maddie Monroe's brother), Giffin Reese, and Secure Technologies Incorporated (STI) (Where Devon Monroe and Seamus Kincaide work, along with other secondary characters). Love AND Leaving will introduce you to Detective Jack Haley, Emma June Carter, the \"Boise Police Department\" (BPD), and other secondary characters. These books can be read in any order for their individual stories, but being a series, there is also a continuous flow in time.  Each book is written in its own style, matching the characters and their individual stories. If you are new to the series, there are two suggested reading orders: Love AND Leaving (Book 2) to Love AND Revenge (Book 3) and then back to Love AND Bullets (Book 1).  This first suggested order is nice for readers who are new to Mary Kate's writing and would like to sample the storyline before committing. Or Book 1 to Book 2 to Book 3. You can see book trailers for each of the books on Mary Kate Kopec's Amazon's Author Page or on youtube: (Love AND Bullets youtu.be/MTrON4X1yl0)(Love AND Leaving youtu.be/QpzL4FJwSWY)(Love AND Revenge youtu.be/dZ-vxUx3qlU) Additionally, you can view the trailers on Mary Kate's website marykatekopec.com.",
  "genres": [
    "Romantic Suspense"
  ],
  "author": "Mary Kate Kopec",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/22742345-love-and-revenge"
}