{
  "title": "Sweet Seduction Sabotage",
  "description": "\"I crave to be near you, Kelly. And I have since I first laid eyes on you in Sweet Seduction's store. I can't explain it any other way. I was drawn to you, like the gravity of the sun. I didn't want to fight it, I wanted to, even if only briefly, say it was mine.\"Kelly Quayle has always been a good time girl, finding her thrills wherever and whenever she could. But the reality of her lifestyle hits her hard one morning, when she wakes up in a stranger's bed. With no recollection of how she got there or what happened when she did, she decides a shake up of her life is in order. But cutting ties with the five guys she regularly sees is harder than she thought.Especially one.Lately Drew Kline has been turning up in all the most unexpected places. Namely, on each of Kelly's dates. Somehow he manages to waylay her; grab her attention and steal her away for himself. Or maybe, she just lets him. In any event, he's sabotaging her style. But with a posse of men to be rid of, and the mess that has become her life, Kelly must first hit rock bottom, before she can even attempt to see the light in Drew's eyes. Ex-lovers who would rather use their fists instead of words, thrills and excitement, illicit hook-ups, heartbroken friends and a man who can't help but try to reach inside and save those parts of her he sees shine. It all makes for a turbulent time. And just when Kelly thinks she's made it out the other side, another saboteur enters her life. Will Kelly let Drew save her? Or will she revert to her old ways? Or will they even get a chance to find out? Love at first sight has never been so dangerous and so very delicious at the same time.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Contemporary",
    "Contemporary Romance",
    "Suspense",
    "Erotic Romance",
    "Adult"
  ],
  "author": "Nicola Claire",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/22738949-sweet-seduction-sabotage"
}