{
  "title": "Islands of Rage & Hope",
  "description": "BOOK 3 IN THE BLACK TIDE RISING SERIES FROM THE NEW YORK TIMES BEST-SELLING AUTHOR. Sequel to To Sail a Darkling Sea and Under a Graveyard Sky.With the world consumed by a devastating plague that drives humans violently insane, what was once a band of desperate survivors bobbing on a dark Atlantic ocean has now become Wolf Squadron, the only hope for the salvation of the human race. Banding together with what remains of the U.S. Navy, Wolf Squadron, and its leader Steve Smith, not only plans to survive—he plans to retake the mainland from the infected, starting with North America.The next step: produce a vaccine. But for do that, Wolf Squadron forces led by Smith’s terrifyingly precocious daughters Sophia and Faith must venture into a sea of the infected to obtain and secure the needed materials. And if some of the rescued survivors turn out to be more than they seem, Smith just might be able to pull off his plan.Once more, exhausted and redlining Wolf Squadron forces must throw themselves into battle, scouring the islands of the Atlantic for civilization's last hope.At the publisher's request, this title is sold without DRM (Digital Rights Management).About the Black Tide Rising Series:\"Not only has Ringo found a mostly unexplored corner of the zombie landscape, hes using the zombie frame to tackle a broader theme: the collapse and rebirth of civilization. The zombie scenes are exciting, sure, but its the human story that keeps us involved. A fine series.\"—BooklistAbout Under a Graveyard Sky:“Ringo combines humor and horror in this strong series debut, the thinking reader’s zombie novel.”—Publishers WeeklyAbout John Ringo:“[Ringo’s work is] peopled with three-dimensional characters and spiced with personal drama as well as tactical finesse.” —Library Journal“. . . Explosive. . . . fans. . .will appreciate Ringo’s lively narrative and flavorful characters.” —Publishers Weekly“. . .practically impossible not to read in one sitting . . . exceedingly impressive . . . executed with skill, verve, and wit.” —Booklist“Crackerjack storytelling.” —StarlogBLACK TIDE RISING SERIES:Under a Graveyard SkyTo Sail a Darkling SeaIslands of Hope and RageStrands of Sorrow (upcoming)John Ringo brings fighting to life. He is the creator of the Posleen Wars series, which has become a New York Times best-selling series with over one million copies in print. The series contains A Hymn Before Battle, Gust Front, When the Devil Dances, Hell’s Faire and Eye of the Storm. In addition, Ringo has penned the Council War series: There Will be Dragons, Emerald Sea, Against the Tide, and East of the Sun, West of the Moon. Adding another dimension to his skills, Ringo created nationally best-selling techno-thriller novels about Mike Harmon (Ghost, Kildar, Choosers of the Slain, Unto the Breach, A Deeper Blue, and,",
  "genres": [
    "Science Fiction",
    "Zombies",
    "Horror",
    "Military Fiction",
    "Post Apocalyptic",
    "Fiction",
    "Fantasy"
  ],
  "author": "John Ringo",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/22739576-islands-of-rage-hope"
}