{
  "title": "Lead Me",
  "description": "This short story collection contains stories of love and romance found by four couples in New York, all discovering that love and passion can exist cohesively with their busy careers. Can these eight career-driven men let love into their lives and explore the possibilities that flourish beyond their steely exteriors?Lead Me Into Temptation - Clancy O'Brien, Texas-bred PR guru, is a fixer to the stars. His reputation for squashing rumors and spinning stories ushers a young boy-band star, Krystian Gael, into his life seeking help following a career-breaking photo leak. Clancy uses his expertise to free Krystian from his image and they soon discover that he needs to come to terms with much more than he was willing to let the world know.A Thing of Beauty - Ten years ago, Finn Callahan fled following a violent attack on he and his then lover, Rob. Now, Finn is a successful author in New York City and comes face-to-face with the man he left behind. Can the wounds of their sordid past be healed and can they rekindle their love with one another after many years of absence?Love in New York - Acclaimed architect, Jason, is every woman's dream. That is, until Gavin, a law school student at the local coffee house, garners his attention and a steamy romance brews. This relationship smolders as the two discover each other and pursue more than a friendly exchange. Gavin may have found what he's longed for in the handsome architect.No Regrets - Graphic artist, Vince, has a lot on his mind. His long-time lover has just packed up his belongings and left to find himself in Tibet, but he can't let the loss interrupt his work. He's hard at work creating a book cover for a new cookbook written by the gorgeous Italian chef and restaurant owner, Roderick Vincelli. The handsome chef unashamedly flirts with Vince, sending shock waves through his system and rendering him defenseless against the Italian charmer.",
  "genres": [
    "M M Romance"
  ],
  "author": "Riley Simpson",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/22739111-lead-me"
}