{
  "title": "The Abyss Beyond Dreams",
  "description": "The wait is over. Bestselling science fiction master Peter F. Hamilton is back with the first of a new two-book saga set in his popular Commonwealth universe. Distinguished by deft plotting, a teeming cast of characters, dazzling scientific speculation, and imagination that brings the truly alien to life, The Abyss Beyond Dreams reveals Hamilton as a storyteller of astonishing ingenuity and power.   The year is 3326. Nigel Sheldon, one of the founders of the Commonwealth, receives a visit from the Raiel—self-appointed guardians of the Void, the enigmatic construct at the core of the galaxy that threatens the existence of all that lives. The Raiel convince Nigel to participate in a desperate scheme to infiltrate the Void.   Once inside, Nigel discovers that humans are not the only life-forms to have been sucked into the Void, where the laws of physics are subtly different and mental powers indistinguishable from magic are commonplace. The humans trapped there are afflicted by an alien species of biological mimics—the Fallers—that are intelligent but merciless killers.   Yet these same aliens may hold the key to destroying the threat of the Void forever—if Nigel can uncover their secrets. As the Fallers’ relentless attacks continue, and the fragile human society splinters into civil war, Nigel must uncover the secrets of the Fallers—before he is killed by the very people he has come to save.Praise for The Abyss Beyond Dreams\n \n“The work of an author at the top of his game.”—Science Fiction and Fantasy World    “Incredibly robust and exciting and rousing, sharing flavors of Jack Vance, John Wright, China Miéville, Orson Scott Card, and A. E. van Vogt . . . Hamilton’s deployment of lots of grand super-science is utterly deft and convincing.”—Locus   “Solidy engrossing fare . . . The characters, always Hamilton’s strength, remain as distinctive as ever.”\n—Kirkus Reviews\n  “Everything one wants in sf—great characters, mind bending stuff, adventure, politics, romance, revolution . . . just superb.”—Fantasy Book Critic“Hamilton does a particular kind of planetary politics and space opera very well, and this is a perfect example of it. . . . [The Abyss Beyond Dreams is] a satisfying and well-oiled story, with potential for more epic adventure to come.”—Booklist\n \n “Hugely enjoyable . . . Hamilton is so good at handling big plots, at maintaining forward momentum even as he throws in an unexpected twist—and there’s at least one doozy of a didn’t-see-that-coming moment here.”—SFXFrom the Hardcover edition.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Space Opera",
    "Audiobook",
    "Fantasy",
    "Aliens",
    "Space"
  ],
  "author": "Peter F. Hamilton",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/22747209-the-abyss-beyond-dreams"
}