{
  "title": "A Cursed Bloodline",
  "description": "The Weird Girls return in another edge-of-your-seat novel from Cecy Robson! Just when Celia thinks the supernatural world can’t turn deadlier, a new rival emerges, proving just how dangerous a power-hungry were can be.   Since being cursed with unique abilities, Celia Wird and her three sisters have fought the most bloodthirsty preternaturals in the Lake Tahoe region. But Celia’s greatest threat is someone she would have never Anara, a werewolf Elder who has allowed his hatred for Celia to spiral out of control. In a play for dominance, Anara tortures Celia and gives her an sever her mate bond with pureblood were Aric—or Anara will kill everyone she loves.   From the instant they met, Celia and Aric have shared an attraction that cannot be tamed. So keeping Aric away is impossible, and Aric would sooner die than allow anyone to hurt the woman he loves. Misha, master vampire and Celia’s sworn protector, also finds his way into the chaos, seeking blood from those who have harmed her.   Now Celia and her sisters are caught in the middle of a war driven by lust, fueled by hatred, and destined to end in tragedy. For Anara is a force to be reckoned with, and he will not succumb without robbing Celia of those who hold her heart.   Praise for the Weird Girls series   “One of my favorite books series . . . so much action, so much violence and, oh, the lust radiating off of our heroes . . . I definitely recommend this series for lovers of all things paranormal and awesome.”—USA Today \n \n “[With Robson’s] edgy, witty and modern style of storytelling, the reader will be drawn deep into this quirky paranormal world. . . . Strong pacing, constant action and distinctive, appealing characters—including a gutsy heroine—will no doubt keep you invested.”—RT Book Reviews   “A healthy dose of humor, a heaping dash of the supernatural, and a pinch of mystery all laced with a heavy dollop of action . . . Robson knows how to combine all the best ingredients to keep her readers hooked and begging for another hit.”—Fresh Fiction   Includes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "Paranormal",
    "Urban Fantasy",
    "Romance",
    "Vampires",
    "Fantasy",
    "Magic",
    "Shapeshifters"
  ],
  "author": "Cecy Robson",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/22747267-a-cursed-bloodline"
}