{
  "title": "Winter's Frost",
  "description": "Broken bonds, an impending darkness, and a sacrifice forged out of love…After returning from Hypatia and a tragic encounter with the Elder Council, Taryn Malone finds herself stuck in the middle of a renewed feud between the love of her life, Larkin Taylor, and Keiryn Falcon, the boy she can’t seem to get out of her head, or her heart. Trying to fulfill her new duties as a big sister and official pack leader, Taryn struggles to keep the peace. When a brawl between the two boys threatens to expose her darkest secret, she must make a decision that will change the scope of both relationships.But when a vision of death shows Taryn a new threat lurking on the horizon, she chooses to make the ultimate sacrifice to ensure the survival of her loved ones. At the stroke of midnight, on the start of the New Year, all eyes are fixated upon her as she says her final good-byes before leaving with the heinous monsters that have come to claim her. Taken to Mors, home of the Mortari, Taryn comes face-to-face with the original brothers, and is stunned when she learns of their true intentions. Knowing that a single misstep could expose the depths of her gifts, thus giving them further leverage over her, she locks down her emotions more securely than ever before. While in the presence of the Mortari, the frequency of Taryn’s visions only increase, as do her encounters with Death. In his riddle-like way, Farren shows her things that make her question if her whole life has been one big lie. Angry and confused, her rage becomes almost impossible to contain, pushing her over a jagged edge that could keep her from ever seeing those she loves again. Will she be able to persuade her captors that setting her free is truly in their best interest? Or will her all-consuming rage make her succumb to their ways for eternity?",
  "genres": [
    "Fantasy",
    "Supernatural"
  ],
  "author": "Karin Reeve",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/22746176-winter-s-frost"
}