{
  "title": "Blind Seduction",
  "description": "FREE eBook on all major EBook retailers.Can a blind woman who shares a very special bond with her dog, gain her independence and choose between the love of TWO sailors?  In Blind Seduction an accident leaves Teresa March scarred and completely blind. Encouraged by the support of her friends, Teresa sets about adapting to life in the dark, reclaiming her independence. Best friends make the toughest adversaries. Sebastian Declan and David Preston retire after twenty years of service to their country. Teresa’s scars discourage neither man in their newest mission: winning her heart. Bastian’s battle is uphill, overcoming Teresa’s negative teenage impression. David is a virtual stranger who fell in love with Teresa through Bas’ pictures and childhood stories. These sexy sailors will stop at nothing, including deploying military tactics, to secure Teresa for themselves. Smart, opinionated, and handsome commonly describe German Shepherds. Teresa’s service dog, Red, is all this, and then some. Red and Teresa are surprised to discover they share a bond which allows Red to speak into Teresa’s mind. Red’s adept tracking skills, and ability to deduce information, open new opportunities for the pair. More importantly, his quirky humor brightens Teresa’s dark world. Welcome to Team Red!You will laugh out loud (the author apologizes in advance for the strange looks you will get when you start to giggle uncontrollably), in this Humorous, Spicy, Paranormal Romance. WARNING: This book is INTENDED FOR MATURE ADULTS OVER 18. Contains swearing, which is unfortunate, as the dog repeats everything. When you have two hot, single-minded, sailors pursuing the same woman, graphic language and sexual situations are inevitable.",
  "genres": [
    "Romance",
    "Paranormal",
    "Contemporary",
    "Contemporary Romance",
    "Paranormal Romance",
    "Disability",
    "Fantasy"
  ],
  "author": "T. Hammond",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/22746683-blind-seduction"
}