{
  "title": "Into the Blackness",
  "description": "Cease being everything you’re trained to be in order to find who you’re meant to be…with.\nNick Cooper is many things in life. He’s a vicious enforcer for a crime family. He’s a monster that tortures with a smirk tattooed on his lips. He’s an olive-skinned god, mysterious and captivating. He’s the best undercover field agent in the Domestic Crime Agency. He’s my partner for the next year. I have to play his wife which will test my abilities as an agent. Nick isn’t the type of man I’m used to dealing with. He’ll push me, tempt me, hurt me and eventually end up on the business end of a weapon I’m wielding. This mission will change everything I’ve ever known about people and myself. I can only hope I’ll survive it.Katherine Russell is many things in life. She’s a chameleon, able to change and adapt to any situation. She’s lethal…as lethal as me. She’s a golden-haired ray of sunshine. She’s the best field agent the Domestic Crime Agency has ever had. She’s my partner for the next year. No, she’s my wife. There are worse things in life than sharing a fake marital bed with a gorgeous woman for a year. Trust me. Kat’s more than a beautiful woman though, and I have the feeling she’s going to challenge me, battle me, infuriate me and test all the walls I’ve spent a lifetime building around myself. Our mission is to find and eliminate a human trafficking kingpin. It’ll be child’s play compared to the journey my new partner is going to take me on. If I can manage to shed the monster of my past I’ll no longer be pulled into the blackness. I’ll be able to bask in the light that glows from every pore of Katherine Russell. If only it were that simple.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Dark",
    "Romantic Suspense",
    "Contemporary",
    "Enemies To Lovers",
    "Family"
  ],
  "author": "Norma Jeanne Karlsson",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/22745972-into-the-blackness"
}