{
  "title": "The Billionaire's Desire: The Complete Series",
  "description": "*THE BILLIONAIRE’S ASSISTANT:Abby Waters is a bright, charming assistant working her way up the corporate ladder in the most unforgiving city in the world. She came to the Kerrigan Corporation to learn from the best. Her only problem? She desperately lusts after her unattainable boss. A plain Jane girl-next-door from the midwest, she never turned a head in her life.Until she turned his.Cole Kerrigan, New York’s richest, most eligible bachelor, is used to his picture being splashed across the city’s tabloids with a model by his side. Accustomed to the advantages that being good-looking and rich have to offer, Cole’s never found himself wanting a woman that he couldn’t—or shouldn’t—have.Until he met Abby.They dance around their attraction to one another until one late night at the office turns business into pleasure… *THE BILLIONAIRE’S SEDUCTION:Cole and Abby wrestle with their growing lust for one another after their night of incredible passion. Even though Cole complicated matters by incorporating an unknowing Abby into a plot to take down the man responsible for leaking the plans for his company’s top secret project, he’s determined not to let her find out. A trip to Chicago tests Cole’s will to keep things professional, and when his desire for Abby begins to interfere with his work, she’s all too happy to be a distraction…*THE BILLIONAIRE’S SECRET:Abby and Cole begin to realize that their attraction to each other is more than just physical. During their Chicago trip, Cole takes an afternoon for himself and goes off the grid. When Abby tracks him down to warn him of a business deal that’s falling through, she discovers a secret that he’s been hiding; a secret that may bring them even closer together…*THE BILLIONAIRE’S BETRAYAL:Abby tells Cole about her coworker’s plans to sell Kerrigan Corporation secrets to one of Cole’s competitors. He offers his thanks by showing her a night she’ll never forget. In the early morning light, when it seems happiness is finally on the horizon for the two of them, Abby finds out the real reason why Cole invited her to Chicago. What happens when the man who has everything loses the one thing he truly cares about?*THE BILLIONAIRE’S HEART:Abby deals with the aftermath of Cole’s betrayal and tries to forget him, even though her heart is refusing to cooperate. Not one to let the woman he loves slip away, Cole offers up a grand gesture to let Abby know how he really feels about her. Despite everything they’ve been through, can they finally have their happily ever after?*THE BILLIONAIRE’S WEDDING:Cole and Abby leave the city behind for a quick visit to the Kerrigan family's beach house in Connecticut, where their friends and family have gathered for a very small, very private, very secret wedding!",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Erotica",
    "Anthologies",
    "Erotic Romance",
    "Billionaire Romance"
  ],
  "author": "Cassie Cross",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/22745686-the-billionaire-s-desire"
}