{
  "title": "With Love...Indie Writers United",
  "description": "A short while ago, when the news and images of the Japanese earthquake found its way into our homes through that same internet and on our TV screens, we watched bodies being recovered. We watched homes being swept away. Some of us shed tears, some were stunned, but we all wanted to do *something*, anything, something.... We wanted to reach out, to help.But we're not wealthy, we're not trained in search, rescue or other emergency services. We have families and jobs that we can't just leave...But we can write. We can edit and we can publish.We are a group of talented writers and some of us have donated our words, someone donated a cover, some have donated time, some have donated editing skills, Ethics Trading has donated the publishing portal, and we have pulled together this ebook of a selection of our work. While working on this project we realised that although Japan was the trigger and the inspiration, we wanted to establish an ongoing project to aid disaster relief and aid across the globe - so proceeds from sales of this project will be offered to Medecins Sans Frontieres, (Doctors without borders) to support the work they do.Thank you for your support. It really does mean a lot. Sarah BarnardFreelance Author and Publisher.Stories and Contributing Authors:1. Hands and Knees by Matt Posner2. The Day the Earth Shook by Junying Kirk3. Armageddon by J.E. Taylor4. A Tooth Fairy Tale for a Tooth Changing Age by Mira Kolar-Brown5. The Occupier by Tim Ellis6. Kismet by Sibel Hodge7. Hurting the One He Loved by Sydney S Strong8. Creole and Carnations by Kristy Wilcox9. Afternoon Traffic Jam by W.T. Hughes10. A Mother's Tale of Fear by Julie Titus11. Extinct by Kate Bowyer12. The Game by Alex Knight13. Homeless by Lia Fairchild14. Alexis' Story by Jeremy Aldana15. A Chemical Mystery by Pad. A 16. Who's There? By Kristina Jackson17. Guitar God Numero Uno by Susan Helene GottfriedWith Love is a real mix of genres, a chocolate box of fiction talent.",
  "genres": [],
  "author": "Sarah Barnard",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/11349896-with-love-indie-writers-united"
}