{
  "title": "Дорога до Бога",
  "description": "«Дорога до Бога» - це третя аудіокнига Глави УГКЦ Блаженнішого Любомира Гузара трилогії «Три дороги». Дисидент Євген Сверстюк у передмові до книги зазначає, що Блаженнішому Любомиру поставлено «такі, сказати б, світські запитання, і він їх приймає так спокійно, наче сам собі ставить. Але що особливо важливо – це те, що ті відповіді не заздалегідь приготовані. Ми вслухаємося у них і стаємо співучасниками розв’язування задачі, що стоїть перед усіма нами». Як і попередні видання цієї серії, «Дорога до Бога» складається з двох дисків і укладена у формі інтерв’ю. Цього разу розмову з Першоієрархом греко-католиків веде відома українська журналістка, редактор відділу «Церква» тижневика «Дзеркало тижня. Україна» Катерина Щоткіна. Нова аудіокнига завершує першу звукову трилогію Предстоятеля УГКЦ.Зміст:CD11. Вступне слово Євгена Сверстюка2. Чому людина у сучасному світі все ж таки обирає Христа?3. Чи не заважає традиційне християнство побачити у Христі Бога живого?4. Чи може Церква допомогти людині зустрітися з Богом?5. Чи зустріч з Богом може відбутися тільки в Церкві, чи й поза нею?6. Чи спасуться нехристияни,які живуть згідно з християнськими чеснотами?7. Як бути, коли члени Церкви не виконують того, що проповідують?8. Про осучаснення Церкви9. Чи не дивно, коли монахи навчають про життя у шлюбі?10. Чи не варто жінкам дати більше можливості навчати у Церкві?11. Яка роль у Церкві духовного наставника?12. Чи легко бути християнином?13. Чи можливо залишатися добрим християнином, живучі у світі?CD21. Чудо було б найкращим доказом існування Бога. Чому чудес стається так мало?2. Як поєднується любов і свобода?3. Що таке пекло?Як зробити, щоб добрі наміри не були дорогою до пекла?4. Про фаталізм5. Про покликання6. Якою має бути молитва: затверджена Церквою, промовлена власними словами чи без слів?7. Роль посту у духовному житті8. Чи є завданням державної цензури стежити за дотриманням моральних норм?9. Чи може християнин бути толерантним навіть тоді, коли йдеться про істину?",
  "genres": [],
  "author": "Любомир Гузар",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/22744691"
}