{
  "title": "A Penny for the Hangman: A Thriller",
  "description": "USA TODAY BESTSELLER • In Tom Savage’s chilling novel of suspense, an ambitious reporter is beckoned to an island paradise for the story of a lifetime. But this scoop might just be the death of her.   Fifty years ago, on the Caribbean island of St. Thomas, two teenagers born to privilege were convicted of slaughtering their parents in cold blood. Today the men are free and a Hollywood movie has been made about the murders. For Karen Tyler, an eager New York journalist, the case is irresistible. She has been invited to the Virgin Islands for an interview that’s too good to pass up . . . and sounds too good to be true.   Karen packs her bikini and her digital recorder and follows an ingeniously designed trail that leads her to a wealthy, mysterious figure. The man claims to be one of the notorious boys, but Karen soon learns that all is not as it seems. On this isolated utopia of sun and surf, a young reporter far from home fights for the truth—and for her life. Because the shocking secret behind the infamous atrocities has remained hidden all these years. And the killing isn’t over yet.Praise for A Penny for the Hangman   “Tom Savage spins a web of suspense into this tale of far-off climes, interweaving letters, newspaper accounts, and diary fragments for a pulled-from-the-headlines feel. In Cold Blood meets ‘The Most Dangerous Game,’ A Penny for the Hangman is a predator-and-prey chase that takes the reader to a tropical paradise, and reveals the steaming underbelly it hides.”—Jenny Milchman, award-winning author of Cover of SnowPraise for Tom Savage   “Savage knows the mystery novel inside and out, and it shows on every page.”—James Patterson   “Tom Savage is becoming a master of the high-speed thriller.”—Michael Connelly   “Tom Savage is a very gifted writer who creates living, breathing characters, wonderful dialogue, and mesmerizing tension.”—Nelson DeMille   “Savage writes with fierce energy, piercing holes in the shredding fabric of our society, where no one is safe, no one is free from harm.”—Lorenzo Carcaterra",
  "genres": [
    "Mystery",
    "Thriller",
    "Suspense",
    "Fiction",
    "Mystery Thriller",
    "Psychological Thriller",
    "Crime"
  ],
  "author": "Tom   Savage",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/22747312-a-penny-for-the-hangman"
}