{
  "title": "You'll Never Nanny in This Town Again: The True Adventures of a Hollywood Nanny",
  "description": "New and completely updated editionHilarious and addictive, this chronicle of a small-town girl’s stint as a celebrity nanny reveals what really happens in the diaper trenches of Hollywood.When Oregon native Suzanne Hansen becomes a live-in nanny to the children of Hollywood über-agent Michael Ovitz, she thinks she’s found the job of her dreams. But Hansen’s behind-the-scenes access soon gets her much more than she bargained working twenty-four hours a day, juggling the shifting demands of the Hollywood elite, and struggling to comprehend wealth unimaginable to most Americans, not to mention dealing with the expected tantrums and the unexpected tense–and intense–atmosphere in the house where she lives with her employers.When the thankless drudgery takes its toll and Hansen finally quits, her boss threatens to blackball her from ever nannying in Hollywood again. Discouraged but determined, Hansen manages to land gigs with Debra Winger and then Danny DeVito and Rhea Perlman. Attentive, welcoming parents with a relaxed attitude toward celebrity–looks like Hansen’s fallen into a real-life happy ending. But the round-the-clock workdays continue, rubbing some of the glitter off L.A. living, and Hansen’s not sure how much longer she can pretend to be Mary Poppins. Even bosses who treat her like family can’t help as she struggles to find meaning in her work while living in a town that seems to lack respect for nannies and everyone else who comes in the employee’s entrance–but without whom many showbiz households would grind to a halt.Peppering her own journey with true stories and high drama experienced by other nannies to the stars, Hansen offers an intriguing, entertaining mix of tales from the cribs of the rich and famous. You’ll Never Nanny in This Town Again is a treat for everyone who is fascinated by the skewed priorities of Tinseltown, for anyone who has wondered how high-wattage supermoms do it all, and for readers who love peeking behind the curtains of celebrity, all of whom will devour this unparalleled–and unabashedly true–account of one girl’s tour of duty as Hollywood’s hired help.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Chick Lit",
    "Biography",
    "Humor",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Suzanne Hansen",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/227467.You_ll_Never_Nanny_in_This_Town_Again"
}