{
  "title": "Little Girl Blue: The Life of Karen Carpenter",
  "description": "Little Girl Blue is an intimate profile of Karen Carpenter, a girl from a modest Connecticut upbringing who became a Southern California superstar.            Karen was the instantly recognizable lead singer of the Carpenters. The top-selling American musical act of the 1970s, they delivered the love songs that defined a generation. Karen's velvety voice on a string of 16 consecutive Top 20 hits from 1970 to 1976—including “Close to You,” “We've Only Just Begun,” “Rainy Days and Mondays,” “Superstar,” and “Hurting Each Other”—propelled the duo to worldwide stardom and record sales of more than 100 million. During their short musical career, the Carpenters released ten studio albums, toured more than 200 days a year, taped five television specials, and won three Grammys and an American Music Award.            But that's only a part of Karen's story. Little Girl Blue reveals Karen's heartbreaking struggles with her mother, brother, and husband; the intimate disclosures she made to her closest friends; her love for playing drums and her frustrated quest for solo stardom; and the ups and downs of her treatment for anorexia nervosa. After her shocking death at 32 years of age in 1983, she became the proverbial poster child for that disorder; but the other causes of her decline are laid bare for the first time in this moving account.            Little Girl Blue is Karen Carpenter's definitive biography, based on exclusive interviews with her innermost circle of girlfriends and nearly 100 others, including professional associates, childhood friends, and lovers. It tells a story as touching, warm, and involving as any of Karen's greatest songs.",
  "genres": [
    "Biography",
    "Music",
    "Nonfiction",
    "Biography Memoir",
    "Memoir",
    "Research",
    "Family"
  ],
  "author": "Randy L. Schmidt",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/11349870-little-girl-blue"
}