{
  "title": "Odd Billy Todd",
  "description": "11-30-14This book has been completely re-formatted and edited for a third time. I believe I have managed to correct the errors, and the new version will be uploaded in a new format that should (fingers crossed) eliminate the structure errors.*****Billy Todd has always been different. Most people called him odd, and those were the nice people. Born with a learning disability, Billy's parents never allowed him to consider himself disabled. Raised to be self-sufficient, Billy might not be as smart as some, but he's a lot smarter than people realized. So, when the entire world is devastated by a plague that kills over ninety-five percent of the population, Billy is not helpless. Believing he may be the only survivor in his town, he manages to place himself in a good position to survive alone in a new world.But Billy isn't alone, as he soon finds out. There are others. Some are people he knows, and even likes. Some aren't so friendly. As survivors gather around him, Billy increasingly finds himself called on to help others survive in a new world that many are simply not capable of dealing with. Though struggling with his own issues, Billy manages to help his friends, new and old, make their way in a harsh new environment, using the 'old ways' his parents have taught him. He's prepared for almost anything thanks to his parents' foresight, but almost leaves out a few things. Like how to deal with women, how to care for teenagers now in his care, and how to interact with strangers who find themselves dependent on Billy and his friends for survival.Billy's 'odd' ways are about to get a work out the likes of which even his parents never imagined.Odd Billy Todd is a novel of approximately 250,000 words at last count.",
  "genres": [
    "Post Apocalyptic",
    "Audiobook",
    "Fiction",
    "Dystopia",
    "Apocalyptic",
    "Survival",
    "Science Fiction"
  ],
  "author": "N.C. Reed",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/22746285-odd-billy-todd"
}