{
  "title": "Remapping Your Mind: The Neuroscience of Self-Transformation through Story",
  "description": "A guide to retelling your personal, family, and cultural stories to transform your life, your relationships, and the world• Applies the latest neuroscience research on memory, brain mapping, and brain plasticity to the field of narrative therapy• Details mind-mapping and narrative therapy techniques that use story to change behavior patterns in ourselves, our relationships, and our communities• Explores how narrative therapy can help replace dysfunctional cultural stories with ones that build healthier relationships with each other and the planetWe are born into a world of stories that quickly shapes our behavior and development without our conscious awareness. By retelling our personal, family, and cultural narratives we can transform the patterns of our own lives as well as the patterns that shape our communities and the larger social worlds in which we interact.Applying the latest neuroscience research on memory, brain mapping, and brain plasticity to the field of narrative therapy, Lewis Mehl-Madrona and Barbara Mainguy explain how the brain is specialized in the art of story-making and story-telling. They detail mind-mapping and narrative therapy techniques that use story to change behavior patterns in ourselves, our relationships, and our communities. They explore studies that reveal how memory works through story, how the brain recalls things in narrative rather than lists, and how our stories modify our physiology and facilitate health or disease. Drawing on their decades of experience in narrative therapy, the authors examine the art of helping people to change their story, providing brain-mapping practices to discover your inner storyteller and test if the stories you are living are functional or dysfunctional, healing or destructive. They explain how to create new characters and new stories, ones that excite you, help you connect with yourself, and deepen your intimate connections with others.Detailing how shared stories and language form culture, the authors also explore how narrative therapy can help replace dysfunctional cultural stories with those that offer templates for healthier relationships with each other and the planet.",
  "genres": [
    "Psychology",
    "Science"
  ],
  "author": "Lewis Mehl-Madrona",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/22748254-remapping-your-mind"
}