{
  "title": "Word and Soul: A Psychological, Literary, and Cultural Reading of the Fourth Gospel",
  "description": "he Gospel of John is filled with poetry, imagery, symbolism, irony, rhythm . . . and soul. The gospel contains not concepts that speak to the mind, but poetry that speaks to the soul, the emotions, the imagination. In Word and Soul Michael Willett Newheart describes a way to read biblical literature \"soulfully\" and applies it to the Fourth Gospel. Newheart approaches the Gospel of John as poetry and reads it poetically. He engages Johannine images and rhythms; and explores likenesses to those images and rhythms in the world of the reader. This \"soul reading\" of the gospel is influenced by three elements; analytical/archetypal psychology, which reorients psychology to \"the study of the soul\"; African-American cultural experience, which is often characterized as \"soul\"; and reader-response criticism, which emphasizes that the reading of a text is shaped by the reader's psychological and social location. After a brief discussion, selected portions of the Fourth Gospel are read from the perspective of \"soul.\" The biblical passages that are read include the conversations with Nicodemus and the Samaritan, disputes with the Judeans, the healing of the man born blind, and the raising of Lazarus, the first farewell discourse, Jesus' prayer to the Father, the trial before Pilate, and the resurrection appearances to Mary and to the disciples. With each passage, Newheart first translates a section from the gospel, then poetically engages the key images and rhythms of that section. He then considers the likenesses in twentieth-century African-American poetry, and finally, summarizes the likenesses of the Johannine images and rhythms in his own soul. Chapters are \" The Johannine Prologue (John 1:1-18),\" \"Word for Jesus' Conversations (John 2-4),\" \"My Word Against Your Jesus' Disputes with the Judeans (John 5-8),\" \"(More of) My Word Against Your Further Disputes with the Judeans (John 9-12),\" \" Jesus' Farewell Discourses (John 14-17),\" and \" Jesus' Return to the Father (John 18-21).\"",
  "genres": [],
  "author": "Michael Willett Newheart",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/2274932.Word_and_Soul"
}