{
  "title": "The Hippibilly, Redneck Encounter",
  "description": "The Hippibilly, Redneck Encounter By Abby Shaye New author Abby Shaye is about to introduce you to a new way of life, in this side splitting story based on true life events. Soon you will become familiar with phrases like Hippibilly and condo-bus as you the reader follow her through this hilarious adventure. Excerpt: This tale begins late on a sunny October afternoon. As I sat at my kitchen dinette, pondering the meaning of life over a cup of coffee. I was jolted out of my seat by a loud rumbling sound, followed by three window rattling bangs that caused my dishes in my cupboards to rattle and my dogs to start barking. My first thought was someone nearby was firing a gun, but I knew that no one living close to me would be stupid enough to fire a gun in an RV park. The commotion caused me to dash to my back kitchen window and look outside, in search of the source of the nerve grating noise that had just scared five years off my life. For several long moments, I just stood there staring out the window in stunned silence, as my brain tried to process what I was actually witnessing. At first, I thought I had spent too many hours typing away in front of my computer, maybe my eyes had somehow lost their connection with my brain., but soon I realized that it wasn’t a figment of my imagination, but I was indeed seeing something I wouldn’t soon forget even if I lived to be a hundred years old. No, unfortunately, what I was seeing was all too terrifyingly real. My body was frozen in place, as I watched the events before me unfold. I knew I should have went back to my seat for a few moments and give my still shocked brain time enough to digest what I had seen but it was like passing an accident on the road, you know you don’t want to look, but you just can’t stop yourself from doing it. So I stood there in a stupor and told myself that yes, I was actually watching an old 60’s school bus spray painted a bright purple color, sporting mismatched psychedelic curtains in every window, back into the RV space right behind my 5th wheel space. Judging by the large cloud of bluish, black smoke billowing out of the rattling tailpipe, it wasn’t hard to figure out what had caused all the noise I had heard just moments before. It was painfully obvious to everyone in a two block radius, this vehicle’s motor was on its last leg. Now, you would think that the bus in its self would be enough to give me pause, but as my mind registered the mouth dropping site, my attention was drawn to the top of the bus. I must admit, the sight I was seeing was definitely the focal point of the behemoth bus. The icing on the cake, so to speak. Yes, it’s true that without the old VW van welded to the top of the bus, the experience wouldn’t have held the same shock factor. To add…just a dash of luxury, the van was painted in what I assume was an attempt at tie-dye in dark blue and fluorescent. I’m just guessing here, but I sincerely believe that this was their version of a split level condominium on wheels. My first thought was, Oh My God, it’s the Beverly Hillbillies! The Clampett family has just moved in, right behind me. All that was missing was a rocking chair sitting on top of the bus for granny…Oh wait…hell, there it is, sitting next to the van welded on top of the bus. Soon, the occupants of the vehicle, and I use the term vehicle only for the fact that it had tires and barely ran on a combustion engine, exited their split level condominium, followed closely by five small yapping dogs. Oh yeah, my life is just getting better and better by the second. Maybe I’ll luck out and they will only be here a few days.",
  "genres": [],
  "author": "Abby Shaye",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/22748676-the-hippibilly-redneck-encounter"
}