{
  "title": "Dead Boys",
  "description": "“If China Miéville, Neil Gaiman and Hunter S. Thompson had a ménage à trois, Dead Boys would be the lovechild. A cracking book.”—Jay Kristoff, author of StormdancerA decade dead, Jacob Campbell is a preservationist, providing a kind of taxidermy to keep his clients looking lifelike for as long as the forces of entropy will allow. But in the Land of the Dead, where the currency is time itself and there is little for corpses to do but drink, thieve, and gamble eternity away, Jacob abandons his home and his fortune for an opportunity to meet the man who cheated the rules of life and death entirely.According to legend, the Living Man is the only adventurer to ever cross into the underworld without dying first. It’s rumored he met his end somewhere in the labyrinth of pubs beneath Dead City’s streets, disappearing without a trace. Now Jacob’s vow to find the Living Man and follow him back to the land of the living sends him on a perilous journey through an underworld where the only certainty is decay.Accompanying him are the boy Remington, an innocent with mysterious powers over the bones of the dead, and the hanged man Leopold l’Eclair, a flamboyant rogue whose criminal ambitions spark the undesired attention of the shadowy ruler known as the Magnate.An ambitious debut that mingles the fantastic with the philosophical, Dead Boys twists the well-worn epic quest into a compelling, one-of-a-kind work of weird fiction that transcends genre, recalling the novels of China Miéville and Neil Gaiman.Skyhorse Publishing, under our Night Shade and Talos imprints, is proud to publish a broad range of titles for readers interested in science fiction (space opera, time travel, hard SF, alien invasion, near-future dystopia), fantasy (grimdark, sword and sorcery, contemporary urban fantasy, steampunk, alternative history), and horror (zombies, vampires, and the occult and supernatural), and much more. While not every title we publish becomes a New York Times bestseller, a national bestseller, or a Hugo or Nebula award-winner, we are committed to publishing quality books from a diverse group of authors.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Horror",
    "Urban Fantasy",
    "Paranormal",
    "Audiobook",
    "Mystery"
  ],
  "author": "Gabrielle Squailia",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/22750066-dead-boys"
}