{
  "title": "The Lost Marble Notebook of Forgotten Girl & Random Boy",
  "description": "If I let you read mine, will you let me read yours?Forgotten Girl, a fifteen-year-old poet, is going through the most difficult time of her life—the breakup of her parents, and her mom’s resulting depression—when she meets Random Boy, a hot guy who, like her, feels like an outcast and secretly writes poetry to deal with everything going on in his life.In The Lost Marble Notebook of Forgotten Girl & Random Boy, the couple’s poems come together to tell their unique love story. The two nameless teenagers come from opposite sides of the tracks, yet they find understanding in each other when they lay bare their life stories through the poetry they write and share with each other.Through verse, they document the power of first kisses, the joy of finally having someone on their side, the devastation of jealousy, and the heartbreaking sadness of what each of them is simultaneously dealing with at home and hiding from the world. Finally they have someone to tell and somewhere to tell it in their marble notebook.This is the powerful story of two imperfect teens in first love who find solace in poetry.Sky Pony Press, with our Good Books, Racehorse and Arcade imprints, is proud to publish a broad range of books for young readers—picture books for small children, chapter books, books for middle grade readers, and novels for young adults. Our list includes bestsellers for children who love to play Minecraft; stories told with LEGO bricks; books that teach lessons about tolerance, patience, and the environment, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [
    "Young Adult",
    "Poetry",
    "Romance",
    "Fiction",
    "Contemporary",
    "Teen",
    "Realistic Fiction"
  ],
  "author": "Marie Jaskulka",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/22750162-the-lost-marble-notebook-of-forgotten-girl-random-boy"
}