{
  "title": "Atlantis and the Coming Ice Age: The Lost Civilization--A Mirror of Our World",
  "description": "Reveals the parallels between the rise and fall of Atlantis, cultures in ancient Mesoamerica, and our modern civilization• Links the demise of Atlantis with the birth of the Olmec civilization in Mexico, the beginning of the first Egyptian dynasty, and the start of the Mayan Calendar• Reveals the Atlantean and Mayan prophecy of an eternal cycle of global creation, destruction, and renewal and how we are headed into a destructive phase• Shows how ancient prophecies correlate precisely with the latest climatology studies, the rising incidence of solar flares, and papers from Pentagon and NASA analystsWith the passing of the Mayan Calendar’s end date we can now focus on the true significance of what the Maya and their predecessors were trying to convey to future civilizations. Frank Joseph reveals how the Mayan prophecy, symbolized by their calendar, was created through the combined genius of Atlantis and Lemuria and predicts an eternal cycle of global creation, destruction, and renewal. He shows how this cycle correlates precisely with scientific studies on glacial ice cores and predictions from the Hopi, the Incas, and the Scandinavian Norse as well as the visions of Edgar Cayce. He links the demise of Atlantis with the birth of the Olmec civilization in Mexico (the progenitors of the Maya), the beginning of the first Egyptian dynasty, and the start of the Mayan Calendar.Drawing on the latest climatology studies and papers from Pentagon and NASA analysts, he reveals that we are on the brink of a destructive phase in the global cycle of change as predicted by the Atlanteans and the Maya. The world’s current political, economic, and cultural deterioration is paralleled by unprecedented storms and record temperatures, massive solar flares, tectonic disturbances, and fissuring sea floors that could release dangerous reservoirs of methane gas into the environment--all of which signals we are headed into another ice age.Despite the Atlanteans’ greater understanding of the cyclical nature of catastrophes and of the human role in them, Joseph reveals the mistakes they made that played a crucial role in their civilization’s destruction. By recognizing the self-destructive patterns of Atlantis in our own civilization, we can learn from their mistakes to reestablish civilization’s cosmic balance before time runs out.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Frank Joseph",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/22748247-atlantis-and-the-coming-ice-age"
}