{
  "title": "The Loudness",
  "description": "\"The Loudness is perfect for Hunger Games and Divergent fans.\" - VOYA \"I ​absolutely ​loved this book!” - Alyson Noël, #1 New York Times bestselling author of The ImmortalsHenry Long doesn’t have a heart. He doesn’t go to school. He doesn’t have a girlfriend. He doesn’t have a clue. Two of those things are about to change.Since the Tragedies, Henry Long doesn't have much: just an annoying low-watt buzz from his makeshift heart transplant, skinny arms, and a dusty library attic from which he charts the reconstruction of the Green Zone, the last habitable neighborhood of his ruined coastal city. While his parents work on making the Green Zone independent from a federal government that appears to have abandoned them, Henry's feels similarly abandoned—that is, until he discovers a refugee artists' colony called the Other Side. When the federales don't take kindly to the Green Zone's attempts at secession and kidnap Henry's parents, Henry and his new renegade friends—including one very courageous girl with whom he’s shared one truly shocking kiss—are forced from the colorful streets and underground rock clubs of the Other Side to an overcrowded capital city on the verge of collapse.As Henry uncovers more about the conflicting forces that run his world, he realizes that not everyone is who they seem to be—including himself. In The Loudness readers will be propelled into an electrifying world where superheroes emerge from the unlikeliest people. “The Loudness has all the necessary ingredients for a great read—fast pace, compelling characters, intriguing plot, and an inspiring message that you don’t need super powers to be a super hero. I ​absolutely ​loved this book!”- Alyson Noël, #1 New York Times bestselling author of The Immortals \"I was recently persuaded by one who knows, that blurbs or cover quotes do no good, and I should not write them. So I will not be saying that The Loudness is a meticulously crafted and admirable book. Others may say it - I wouldn't be surprised - but I say buy a copy, take it home and read it, and make up your own mind. What am I, a guru?\" - Daniel Pinkwater \"I loved The Loudness. The voice, the story, the characterization, the writing... just, wow.\" - Carol Lynch Williams, author of The Chosen One and Signed, Skye Harper",
  "genres": [
    "Dystopia",
    "Young Adult",
    "Audiobook",
    "Science Fiction",
    "Fiction",
    "Fantasy"
  ],
  "author": "Nick Courage",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/22750167-the-loudness"
}