{
  "title": "Desire and Blood: The COMPLETE Baobhan Sith Trilogy Boxed Set",
  "description": "This is the COMPLETE \"Desire and Blood\" boxed set, containing all three books comprising the \"Baobhan SIth\" trilogy, an adult paranormal erotic BOOK Born of Desire and thirst for vengeance. Her desire for his touch. Their chase through eternity.Sexy curvy “Kenzi” Katherine MacKenzie is being hunted byhandsome and muscular Duncan Munroe. For four hundred years he has searched for her, their immortal baobhan sith bodies immune to age, her crime against him driving his thirst for vengeance. His need to be free of the sith curse.But what he discovers when he captures her—what they both discover in each other—upends their centuries-long chase into something far greater. Something frightening.Something eternal.~ BOOK Betrayed by Desire and the heights of passionate ecstasy, to the depths of wrenching despair, her trust in him is shattered.Kenzi has fallen deeply in love with handsome, heroic, and dominant Duncan Munroe. But their immortal baobhan sith passion is shattered in an instant by an event that neither saw coming.Now Kenzi is on the run, as far from the man she loves as she can get. Hiding not just from Duncan, but from their enemy as well.But how long can she hide before Duncan comes for her... or before their enemy finds her?~ BOOK Legacy of Desire and from each other’s embrace by their enemy, yet nothing will extinguish their love.The epic romance of Duncan Munroe and “Kenzi” Katherine MacKenzie continues and concludes in “Legacy of Desire and Book Three of the Baobhan Sith Trilogy”.Duncan and Kenzi have found each other after centuries, through tragedy, and against all odds. Through the adventures of the first two books in the trilogy, their love, passion, and sensuality for each other triumphed over all obstacles and adversity.But has their time together run out? Have events conspired to snuff out their eternal spark? Have their enemies come together to create an unstoppable wave of death?Will Kenzi be lost to Duncan forevermore?Come along on the rousing—and arousing—conclusion to “Desire and The Baobhan Sith Trilogy”.(All three books 18/21+ adult readers only. High heat, explicit scenes of an intense romantic sexual nature, D/s themes, and BDSM activities.)",
  "genres": [],
  "author": "Corey Harper",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/22751527-desire-and-blood"
}