{
  "title": "Gator Bait",
  "description": "34,000 words. This is the sequel to BIG GATOR also by Annora Soule.  The Gulf Coast Gator Shifters are back!  Alligator shifter Nash Powell, the eldest son of the politically formidable Powell family of Alabama, is on a fated course to cross paths with his childhood crush, curvy BBW shifter Dr. Saralyn Renoux.  Nash hasn't seen Saralyn since they were 10 years old, when he surprised her with a kiss under the old magnolia tree on the Powell family plantation. Now a senior partner of the law firm Powell, Joyce & McKinney, Nash is about to loosen his tie and get-his-gator-on. When he takes off with best friend, private eye and bounty hunter Beau Cliburn, to go after alligator poachers in the Mobile-Tensaw Delta, he doesn't realize that Saralyn has been carjacked by poaching thugs and is headed in the same direction.  Saralyn is a successful dermatologist and has inherited her father's plastic surgery clinic, which she is now running with her fiance, plastic surgeon John Quackenbush. But things aren't going so well with that relationship. On top of that, she finds out that the marketing firm for her new skincare product line has hired Rachel LaBelle as spokesmodel. Rachel is the great-great-great granddaughter of Madame Eve LaBelle – the legendary Hoodoo queen of Baton Rouge – who put the juju on the Powells, the Renouxs, and five other Southern families during the 1880s, turning them all into gator shifters. Rachel herself has proven to be increasingly adept as well, having recently turned her ex-boyfriend into a gator shifter.  When Saralyn tries to fire Rachel, she finds herself in a contractual dispute, then carjacked by two thugs who drag both women down to the Delta. In the midst of the chaos, Rachel decides to do Saralyn a “favor”.  A true Southern Belle, Saralyn has been raised to be nice. She has charm, manners, class, and her own money. But the one thing Saralyn never does is truly speak her mind to anyone, and she would never dare use vulgar language for any reason, despite what she might really be thinking to herself. That is, until Rachel baits Saralyn and casts a spell that disallows her from censoring her thoughts.  Under the influence of Rachel's conjure, Saralyn now is compelled to speak her true mind to anyone and everyone, just as Nash Powell finds his first love stranded in the dark swamp of the Delta...",
  "genres": [],
  "author": "Annora Soule",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/22750836-gator-bait"
}