{
  "title": "Drawn & Quarterly: Twenty-five Years of Contemporary Cartooning, Comics, and Graphic Novels",
  "description": "North America's pioneering comics publisher celebrates its quarter-century with new and rare archival comics; essays from Jonathan Lethem, Margaret Atwood, and more.Drawn & Quarterly: Twenty-Five Years of Contemporary Cartooning, Comics, and Graphic Novels is an eight hundred-page thank-you letter to the cartoonists whose steadfast belief in a Canadian micro-publisher never wavered. In 1989, a prescient Chris Oliveros created D+Q with a simple mandate to publish the worlds best cartoonists. Thanks to his taste-making visual acumen and the support of over fifty cartoonists from the past two decades, D+Q has grown from an annual stapled anthology into one of the world's leading graphic novel publishers. With hundreds of pages of comics by Drawn & Quarterly cartoonists, D+Q: 25 features new work by Kate Beaton, Chester Brown, Michael DeForge, Tom Gauld, Miriam Katin, Rutu Modan, James Sturm, Jillian Tamaki, Yoshihiro Tatsumi alongside rare and never-before-seen work from Guy Delisle, Debbie Drechsler, Julie Doucet, John Porcellino, Art Spiegelman, and Adrian Tomine, and a cover by Tom Gauld. Editor Tom Devlin digs into the company archives for rare photographs, correspondence, and comics; assembles biographies, personal reminiscences, and interviews with key D+Q staff; and curates essays by Margaret Atwood, Sheila Heti, Jonathan Lethem, Deb Olin Unferth, Heather O'Neill, Lemony Snicket, Chris Ware, and noted comics scholars.D+Q: 25 is the rare chance to witness a literary movement in progress; how a group of dedicated artists and their publisher changed the future of a century-old medium.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Nonfiction",
    "Graphic Novels Comics",
    "Anthologies",
    "Comic Book",
    "Comix"
  ],
  "author": "Tom Devlin",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/22752444-drawn-quarterly"
}