{
  "title": "Fallen: Out of the Sex Industry and Into the Arms of the Savior",
  "description": "Read the harrowing account of a high class call girl in the clutches of the sex trafficking industry.Annie Lobert was not so different from most girls, growing up in a small town and experiencing common struggles with friends, school, and boys. But her home was filled with turmoil, and at nine years old she was sexually abused by an older girl and as a teenager was assaulted numerous times by boys who said they loved her just to get what they wanted. Feeling unloved, used, and abused, she struggled to find self-worth.Lured by the almighty dollar, and with a skewed fairytale view of love, she was drawn toward the seductive whispers and open arms of the sex industry. Greed consumed her, the money an easy remedy to numb her brokenness, so she began a new life with a new name--Fallen. Settling under the lights of glamorous Las Vegas, she became one of the most sought-after high-class escorts, fielding calls from celebrities, musicians, politicians, and other men with endless supplies of cash.But the lights weren't that bright. All that glitters isn't gold. And it wasn't long before the dream of getting all she ever wanted became the nightmare that plunged her into the darkest time of her life.In Fallen, Lobert writes about her sixteen-year journey being owned by a violent pimp who took every dollar and beat her multiple times within inches of her life. After more than a decade and a half of countless arrests, rapes, life-threatening calls, and utter loneliness, the freedom she had once sought became her prison. Then after being diagnosed with and treated for cancer, Annie eventually found herself at death's door from a drug overdose. That's when she finally surrendered to the love of a beckoning Savior.Through Lobert's harrowing account in the clutches of the sex trafficking industry and the miraculous deliverance she experienced in the arms of Jesus, readers will be encouraged knowing this: No matter how far you have fallen, God loves you and wants to save you from the depths of any pain, trauma, addiction, or abuse. And He longs to give you a new life. Today, Annie is redeemed. Healed. Free. And rescuing other victims through her organization Hookers for Jesus.",
  "genres": [
    "Nonfiction",
    "Christian",
    "Biography",
    "Memoir",
    "Christianity",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Annie Lobert",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/22750529-fallen"
}