{
  "title": "Rallenti",
  "description": "\"One word. You must learn it, before we begin,\" he traced his finger now across the outline of her lip. \"Say it with me. Rallenti.\" - Renaldo CracchioloThe year is 1993. Life as an enforcer for one of the most notorious crime bosses in Italy isn’t easy. Renaldo Cracchiolo is a Sicilian who takes pride in the oaths of omerta to honor and obey the wishes of his Don. It’s the reason why he was chosen to cross the Atlantic to New York City. However, the woman he meets and the time they share changes his heart and destiny. Kyra Okeeno has big dreams. Born a second generation Nigerian American she’s decided to create her career outside of the expectations of her family. Working for Mirabella’s Fashion House in Manhattan is a once in a lifetime opportunity. Although there are whispers that the black designer who disappeared to Italy and married into a ruthless crime family plans to close her American offices, Kyra believes her new job will secure her future as a designer. But when she meets the family enforcer who was sent there to protect the women who own the company Kyra finds her self irresistibly drawn to his dark brooding. The passion they share is surprising, the friendship lasting. And on the night her world falls apart he is the only man capable of her rescue. And his actions bring about deadly consequences jeopardizing their budding romance before it truly gets a start. Could their friendship develop into something meaningful, or are the differences they share to vast? Donna Mirabella Battaglia is the only one who can decide. Rallenti, is a short novella lifted from the Battaglia Mafia Series. If you are a fan of the series you will love reading about the family and their passions. If you are new to the series be warned—there can be scandal, danger, and intrigue in loving the men from the Battaglia Mafia Clan.",
  "genres": [
    "Romance",
    "Crime",
    "Erotica",
    "Interracial Romance",
    "Amazon",
    "Contemporary",
    "Dark"
  ],
  "author": "Sienna Mynx",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/22753325-rallenti"
}