{
  "title": "Miss Cayley's Adventures",
  "description": "When her stepfather dies, Miss Lois Cayley finds herself alone in the world with only twopence in her pocket. Undaunted, the intelligent, attractive, and infinitely resourceful young woman decides to set off in search of adventure. Her travels take her from London to Germany, Italy, Egypt, and India, as she faces various challenges and meets an assortment of eccentric characters. But when her true love, Harold Tillington, finds himself accused of forging a will and faces prison, Miss Cayley will need all her ingenuity to investigate the case, solve the mystery, and save Harold from the diabolical plot!One of the first novels to feature a female detective, Grant Allen's Miss Cayley's Adventures (1899) remains as witty, enjoyable, and engaging today as when first published. This edition includes a new introduction by Elizabeth Foxwell.\"Scholars might be loath to hear this, but, popular culture being the continuum that it is, Miss Cayley's Adventures can be seen as a superior example of the chick lit of its era. Its heroine remains to this day as appealing and amusing as any Bridget Jones, and her exploits are filled with moments of wit, action, and sheer fun.\"- Michele Slung, editor, Crime on her Mind: Fifteen Stories of Female Sleuths from the Victorian Era to the Forties\"Grant Allen's entertaining Miss Cayley is as lively now as when she first appeared in the Strand in 1898. The reprinting of Miss Cayley's Adventures is sure to please readers who admire active and clever women protagonists. Sheer fun.\" - Carolyn Hart, author of Death Walked In\"Mystery readers will be swept away by the adventures of Grant Allen's almost forgotten female sleuth, Miss Cayley. With her unique, independent, and most 'unladylike' behavior, the intelligent Miss Cayley plays an important role in the long line of distaff detectives. A must for mystery readers and academics.\" - Janet Rudolph, editor, Mystery Readers Journal",
  "genres": [
    "Fiction",
    "Classics",
    "Mystery",
    "Historical Fiction",
    "Humor",
    "Historical",
    "Adventure"
  ],
  "author": "Grant Allen",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/10148872-miss-cayley-s-adventures"
}