{
  "title": "Unconditional Surrender",
  "description": "Strong. Sexy. Sizzling.  There's nothing like a man in uniform, and sixteen of today's hottest gay romance authors are celebrating military heroes and the men brave enough to love them.  These brand-new novellas feature all branches of the service and offer something for every reader. Almost 300,000 never before published words!Kerry Adrienne – Cruise ControlOne Maserati brings Parker and Blake together, but will Blake slow down and discover the important things aren’t in the fast lane?Annabeth Albert – Resilient HeartWhen a wounded soldier is forced to accept help from his former best friend, both men discover the true strength of their entwined hearts.Keira Andrews – Arctic FireCan an army captain who can’t forget Afghanistan make new memories with a ranger in the Arctic?Brit Blaise – Storm OutAn Army Ranger suffering from PTSD finds coming out the biggest storm he's ever faced.Cassandra Carr – Civilian MasterClay's home for some R&R after a Special Ops mission goes terribly wrong. Can Flynn help him find his true self?Lia Davis – His Guarded HeartBeing Senator Beckett’s bodyguard while staying out of his bed becomes Judd’s biggest challenge as passion ignites between the men.Sasha Devlin – Hometown HeroSparks fly when injured Marine Colin returns home ...and ends up in the arms of the man he left behind.Rhi Etzweiler – Blood & Peyote“I almost did it, Api. I had the Glock in my mouth and my finger on the trigger.”Lucy Felthouse – Desert HeatTheir love is forbidden by rules, religion and risk. Yet they still can’t resist.Amelia C. Gormley – The InitiationBeing Fowler Vale’s houseboy may open more doors than Bryce ever dreamed possible.Cat Grant – The Only One Who CaresCommitted couple David and Josh have overcome years of struggle to arrive at their happily-ever-after. But what happens when fate has one last killer right hook in store?EM Lynley – Irresistible ForcesDADT kept them apart, but old flames reignite as Logan and Brody succumb to irresistible forces.L.A. Witt – Flight RiskSex with a co-worker is all fun and games until your friendship crashes and burns…",
  "genres": [
    "M M Romance",
    "Anthologies",
    "Military Fiction",
    "Romance",
    "Contemporary",
    "BDSM",
    "War"
  ],
  "author": "Cat Grant",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/22763272-unconditional-surrender"
}