{
  "title": "Stranded by Lies",
  "description": "Dear Author,I’d been running from him for so many months, it had begun to feel like a reflex, no different than the instinct to fight for breath when you’re underwater or rip back your hand from a red-hot forge. By the time I got to the market town, I could feel my time running out. I don’t know why— an instinct maybe? Or maybe I was just so tired of running. I thought I could outlast him, I thought he would give up. I’d not counted on how much the predator in him would love the chase. There were times, while I huddled in my nightly hiding place, when I could almost feel his glee at the challenge, his satisfaction as he went about closing off every avenue of escape— seducing my family to his side, convincing my friends that I was mad, that he just wanted to protect me. There were times, usually on the coldest nights, when I wondered if he’s right— maybe I am mad. Maybe I do belong to him. Maybe I should surrender. Maybe I should stop running. At least then I could just rest.Photo Description: A young man lies on the floor, his only clothing a shirt, unbuttoned to reveal his lean frame. His dark hair lays in wisps upon his shoulders. His wrists are loosely bound by a silken red ribbon, but he’s peaceful, his pose suggesting he has bound himself. Perhaps he has offered his submission to the man towering above him, straddling his waist? The scene is set for a dark seduction, but who is seducing whom?This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Science Fiction",
    "BDSM",
    "Romance",
    "Aliens",
    "Contemporary",
    "Paranormal"
  ],
  "author": "Finn Marlowe",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/22779253-stranded-by-lies"
}