{
  "title": "Blood For Blood",
  "description": "Blood For Blood is a B.R.A.G.Medallion HonoreeTime is running out…When a mysterious figure from the past accuses Johanna Davenport of witchcraft and murder, Royalist Captain, Daniel Davenport, must choose between his loyalty to the King and the life of his sister. Imprisoned in Fisherton Anger Gaol since the Battle of Worcester, Daniel must fight not only the terrible vengeance of one man, but the full force of Cromwell’s Protectorate Government.With all that he holds dear disintegrating around him will Daniel Davenport save his sister from murderous revenge? And will he save himself from that most insidious of enemies: the enemy within?For when you lose yourself, you lose everything.*** Note From The AuthorThe Historicity of Blood For Blood.The foundation for Blood For Blood came from two main ideas. The first of which was to include a witchcraft trial in the novel. Secondly, I wanted the plot to be driven within the backdrop of historical events. In other words, to weave the plot through historical events, which acted as a catalyst in the lives of the fictional main characters. Some (There are others, but I won’t include them because of potential plot spoilers) of these historical events include:1.The Battle of Worcester, 1651— The Battle of Worcester in 1651 ended in victory for Cromwell and ended the Civil War. Charles barely escaped Worcester and only after weeks on the run, managed to find sanctuary on the continent. Thereafter, Charles worked through his loyal agents as they plotted the downfall of Cromwell.2.Witch trials –The last witchcraft trial in England that resulted in hangings was in Bideford in 1682. I wanted to highlight the terrible and unbelievable injustices perpetrated against women—and sometimes men—during these sad times.3.Penruddock’s Uprising.4.Cromwell’s new government of the Major-Generals—introduced to protect the protectorate against rebellion, and to introduce ‘Godly reform’ after the failure of the Western Design in the Caribbean.5.The Earl of Rochester’s participation in Penruddock’s Uprising as the king’s representative.Sometimes history is stranger than fiction!",
  "genres": [
    "Historical",
    "Historical Fiction"
  ],
  "author": "D.S. Allen",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/22783940-blood-for-blood"
}