{
  "title": "Misfit Toymakers: Misfits Made",
  "description": "Misfit Toymakers is a Historical Fiction set in the future, back dropped by the secession of Texas from the Union and the states that follow with it, the politics of the fifty years between now and then. It is the story of an intrigue of Life, Liberty and the Pursuit of his Loves, as Joshua Danz discovers, then navigates the waters of international commerce to make a place in the world, looking for a life where terrorists, politicians, millionaires, and thugs aren't trying to kill him. Through it all there is the story of love, leadership, personal responsibility and redemption. Joshua Danz, a man conflicted by who he was, is, and is not. He discovers that his is a life of wealth and power that must be learned, not earned. He is the master of a massive, global Enterprise, and yet somehow he is its subject. Also, he is a man of strong desires and dedications; his love, though quiet and covert, is powerful as it drives him to find all truth about himself. As a man with no memories, he discovers that he has been told the story of his life, but then his memories begin to reappear, like a favorite movie, with an additional lifetime attached. All is a jumble as he learns, for certain, who he is and what has happened. He discovers his past, the parts played by others and their intentions. He begins to plot a way out, but not without those he holds dear. He is among the most wealthy, nearly unknown men in the world, torn between women, kingdoms, and lives. Ethyl, the woman he first comes to love, after his recovery is a real piece of work. She is smart, capable, beautiful, sexy, deadly, and wise. She works for him, as his administrative assistant and much more. She makes certain that his every command is carried out, and she protects him with her life - a life that is not nearly as long as it looks. Joshua will avenge somehow, if he can only overcome the truth he discovers about her. Doctor Ilyssa Marquez - Doc - was born in Mexico and is a genuine genius and medical doctor who had her Bachelors at sixteen, Masters at eighteen and before she was thirty had perfected the hardware and surgeries that would rebuild Joshua, almost from scratch. Ilyssa is beautiful, brilliant, and engaging in every way! She is burdened with intrigues as the sponsors of her work on Danz, simply take away her promising future, and she wants it back.",
  "genres": [],
  "author": "Keith T. Jenkins",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/22782902-misfit-toymakers"
}