{
  "title": "Diary of a Zombie",
  "description": "“The day I died was the day when I nearly lost the little humanity that was left inside me. The eternal promise of leaving as a peaceful spirit was never fulfilled; instead, I became a wandering soul, rooted to the entrails of this wasteland. You might think that smiling in the face of death should be something glorious, but there’s nothing glorious about this. There’s only a deep and sinister emptiness inside. Destiny made me walk among demons I didn’t need to be scared of. It allowed me to stare at the sun without looking away from dawn to dusk. It placed the burden of this world on my back and also forced me to remember the meaning of love…and of giving human beings a second chance. Was there ever a reason for so many broken laws? Who knows…Let me tell you about a fascinating journey and faraway lands, about unswerving loyalty and unimaginable creatures. My name is Erico Lombardo and I am doomed to be aware of myself. Maybe, after my death, I still had one last thing to do…”“Diary of a Zombie” transports us to a desolate world, a planet wiped out by a massive pandemic where human beings have almost become extinct. But what makes this story different from the rest is the fact that it is told from a very unusual point of view: that of a zombie who, for unknown reasons, keeps his human consciousness and free will after being transformed. This is a unique case.After a few chapters in which the character is introduced, we will witness a story of redemption, full of human values, that is centered around a peculiar friendship. Erico’s cold, cynical and unsociable behavior will gradually change as he meets a lonely and mysterious 8-year-old girl on whom humankind’s scarce chances of survival depend. During the whole of his epic adventure, Erico will be linked to his most human side again, as he recovers memories and feelings he had not experienced since the times when warm blood still coursed through his veins.“Diary of a Zombie”, mostly set in a post-apocalyptic Barcelona, presents a pleasant story which will bring the reader both tears and laughter. It is a breath of fresh air that reinvents a genre which apparently had nothing new to offer.",
  "genres": [
    "Zombies",
    "Horror",
    "Thriller"
  ],
  "author": "Sergi Llauger",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/22781010-diary-of-a-zombie"
}