{
  "title": "How the Water Falls",
  "description": "On the fringes of a civil war arise a kaleidoscope of stories of abuse, power, betrayal, sex, love, and absolution, all united by the failings of a dying government. Set in the backdrop during the last years of South Africa's apartheid, How the Water Falls is a psychological thriller that unfolds the truth and deception of the system’s victims, perpetrators, and unlikely heroes. The two main characters, one white, Joanne– a reporter, the other black, Lena– a banned activist, have their lives continuously overlap through the people they know during a thirteen-year period and eventually become friends as a result of their interviews together. Joanne personifies the need to question and investigate apartheid’s corruption from a white person’s perspective. Although her intentions begin with idealism, no matter how naïve, as the years pass while the system is failing, she crosses the threshold of what it means to be caught up inside the belly of the beast, especially after crossing paths with the Borghost brothers. Lena, who is inspired by her predecessors, such as Steve Biko and Nelson Mandela, is among the minority of black women to peacefully battle for equality, even if her struggle is indicative of sacrificing her health and safety. Hans Borghost is Johannesburg’s commissioner of police who, like all those before, had a military background before pursuing a law enforcement career. Violent, manipulative, and controlling, he incarnates the image of South Africa’s perpetrators. Jared Borghost is the younger brother of Hans and, like his brother, has a military background, but unlike Hans, he internally combats between his sense of duty and morality. His inconsistency indicates a conscience that leaves one to ponder whether Jared is either a perpetrator, victim, or both. As his surname suggests, Bor-GHOST represents the “ghosts” that haunt the family’s past. Many other characters play the roles of spies, freedom fighters, lovers, adversaries, and supporters. This novel is as complex as apartheid was itself, unlacing fabrics of each character’s life to merge into a catalyst downfall. The question of who will survive this downfall will suffice in the courts of truth and reconciliation and whether love is strong enough to preserve peace.",
  "genres": [],
  "author": "K.P. Kollenborn",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/22766530-how-the-water-falls"
}