{
  "title": "Celine's Landing",
  "description": "Celine's youth is blissfully happy, growing up in the magnificent alpine wonderland surrounding her picturesque village of Treaire, France. She, and five devoted friends, Remi, Amaury, Felicien, Alexis, and Daniel-all born within twelve days of each other, form a uniquely close bond of unity they label the friends.Respected as the group's surrogate sister, Celine is not only able to keep up but often sets a physical pace challenging to the boys. As the friends' grow mature, Celine and Remi develop a deep love and marry in the spring of 1940.Within weeks of their marriage France surrenders to Hitler's Nazis and the German army begins its infiltration of the countryside surrounding Treaire. Remi and Celine, disgusted with the abusive treatment by the Nazi oppressors recruit the friends into a paramilitary Resistance Cell they name the Tristan.Celine is smuggled out of France to be trained in para- military techniques at a facility run by the British and American commandos in England. Her natural physical ability allows her to excel in the training. She is one of the best students ever to pass through the training program, but the 11 month in training changes her. Her youthful innocence is gone when she returns to Remi. Their relationship must find new unity as she trains Remi and the rest of the friends into one of the most devastating Resistance cells in all of Nazi occupied Europe.With the assistance of the reclusive and brilliant scientist Gasper Chabot, the Tristan attack the Nazis in southern France with devastating success. Despite their cleverness and good fortune, the power of the Nazi presence is relentless. After months of struggle, the friends' only hope for survival is if General Alexander Patch's 7th US Army can battle their way to their aid as they, and a small band of Jews, defend the strategic Falauge rail depot and its critical train trestle over the Saint Laurnee Passage.",
  "genres": [],
  "author": "Steven A. Segal",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/22772127-celine-s-landing"
}