{
  "title": "Buddhism for Beginners: A Complete Course on the Heart of the Buddha's Teachings",
  "description": "At the heart of all Buddhist wisdom lies one astonishing a way out of suffering and into a more deeply fulfilling life is not a myth, but a reality available to you the moment you open your eyes through the power of skillful inquiry.For generations, this fact has been proven again and again by those who have learned and tested for themselves what the Buddha taught. Now, with Buddhism for Beginners , celebrated teacher and author Jack Kornfield invites you to experience for yourself the gifts of this vast spiritual tradition.Created specifically to address the questions and needs of first-time students, this full-length retreat on audio offers an ideal way to learn Buddhism's essential principles and insights. Join this gifted speaker, as he guides you Buddhism's cornerstone teachings, including the Four Noble Truths, the Eightfold Path to inner freedom, the meaning and varieties of karma , the Ten Perfections for opening the heart, the inner tools of samadhi and prajna (concentration and insight), the Four Great Immeasurables, the Buddha's last great teaching, and many other topics• The principles of meditation practice, covering such fundamentals as clarifying awareness and focusing your mind; overcoming distractions and other inner obstacles; using heart-centered practices to sprout the seeds of compassion and loving-kindness, and more• Wisdom stories, poetry, teaching parables, and inspiring true accounts distilled from Buddhism's many historical branches, plus invaluable advice gleaned from Kornfield's own years of experience as a student and a teacherThe ancient Buddhist scripture The Path to Purification poses this The world is entangled in a knot. Who can untangle the tangle? According to the Buddha, the answer you can, by learning to see things clearly and simply, as they actually are.Now, with Jack Kornfield's Buddhism for Beginners, you will find the tools and teachings you need to begin this great inner adventure of self-discovery and freedom.",
  "genres": [
    "Buddhism",
    "Spirituality",
    "Audiobook",
    "Nonfiction",
    "Religion",
    "Philosophy",
    "Self Help"
  ],
  "author": "Jack Kornfield",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/227734.Buddhism_for_Beginners"
}