{
  "title": "Roman",
  "description": "ROMAN: Book #2 The Hunter Brothers series ‘Roman was an enigma, a puzzle; wrapped in a hot hard body, tormented eyes and a soft full mouth that screamed pure sin. Even here, where the love for him was so palpable you could feel it; he was distant. Unfortunately, he was also captivating, compelling and impossible to ignore. I was here for Charlie. Roman had other ideas. This was going to be one hell of a weekend.’ When the mysterious Roman returns to the family estate in the aftermath of his father’s funeral, his revelations threaten the very foundations of the Hunter family, shaking it to its core. Secrets are revealed and histories unravelled, turning fact into fiction and changing the course of the future. He isn’t there to grieve the man that despised him, and his stay will be short lived, but lured back to face his past by the beautiful Chastity, Roman is determined to take her into his bed. The attraction is instant, the chemistry electric and he knows if he can get her alone there will be only one outcome. Chastity Evangelista usually lives up to her name, with a list in place for the ultimate prize she’s determined to secure, but she doesn’t count on her dangerous and immediate response to the prodigal brother, riddled with complexities and sizzling with sex appeal. He’s an unknown quantity and she doesn’t do those. He’s a weekend hook-up and she doesn’t do those. He is also the brother of the man with whom she hopes her future lies. But when an unforeseen twist changes Charlie’s outlook irrevocably, Chastity is left with a choice to make. Roman is Book two in The Hunter Brothers series; a collection of full length erotic romance novels designed to be read in order. ‘Lucas’ is the first title in the series of this hot new release.Due to strong language and sexual content, this novel is recommended for readers over 18.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "BDSM"
  ],
  "author": "L.J. Dee",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/22781002-roman"
}