{
  "title": "Innocence Lost: A Childhood Stolen",
  "description": "I met Miriam Kabliski Cohen quite by accident, and for me it was a life-changing event. My ninety-four-year-old widowed mother had recently moved into an assisted living facility in Venice, Florida, after my step-father died in 2009, and Miriam was her next-door neighbor. One day when I was visiting my mother, Miriam or Mira - as her friends and family called her - stopped by to visit. My first impression of her was of a small, white-haired lady, who walked with a slight stoop and had a foreign accent that I couldn't quite place. She appeared to be in her late seventies, and what surprised me the most as we started talking, was that she was quite computer literate. She had her own active Facebook page, Twitter account and kept in touch with her large family through e-mails. After Mira had left the apartment, I asked my mother to tell me more about her. She told me that Mira was Polish and had been sent to Auschwitz during WWII, but that's all she knew. Since I was quite interested in WWII history, especially The Holocaust, I asked my mother to call me the next time Mira stopped by, and I would like to hear more about her life. A couple of weeks later, my mother arranged a meeting in her apartment. I didn't know what to expect as I wasn't sure if Mira wanted to talk about her childhood experiences. Our meeting started out pleasantly, but soon it became apparent that whatever had happened many years ago was something that she didn't want to talk about. I changed the subject because I certainly didn't want to make her uncomfortable by asking her questions about her past. She asked me where I worked, and I told her I was an author and that I had written several books, including one about WWII. The more we talked, the more she opened up, until she told me that she wanted to go back to her apartment and get something to share with me. Within minutes, she returned with a well-worn leather satchel. Opening it, she started pulling out scraps of paper until there was quite a large pile on my mother's coffee table. When I asked her what were on the scraps of paper, she replied, \"My story.\" As I picked them up and examined them, I noticed they were obviously written in a young person's handwriting, and were in a foreign language; Polish I correctly assumed. As I was going through the scraps, she reached into the satchel, pulled out a well-worn rag doll, and handed it to me. \"Meet Alinka,\" she said. Alinka's clothes were tattered and dirty, her bisque head was crackled and chipped, and one of her arms was badly repaired. But, when Mira reached over, took her back, and hugged her tightly to her chest, I got a brief glimpse of an eight-year-old Polish girl sitting across from me. _____ Holocaust, Jewish, WWII, Polish, Auschwitz",
  "genres": [
    "Historical Fiction",
    "Holocaust"
  ],
  "author": "Philip Sherman Mygatt",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/22789585-innocence-lost"
}