{
  "title": "Tyler",
  "description": "From the USA Today and New York Times best-selling author Jo Raven comes the second installment in the Inked Brotherhood series which began with ASHER.  TYLER (Inked Brotherhood #2) Four years have passed since I left home, my parents, and my brother Asher behind – since I shut out my past. And Erin. Four years since I last saw her, since I heard her voice and held her in my arms. I’ve spent my time forging a path from woman to woman, from bed to bed, trying to find an answer. But I think I’ve lost my way. There’s no light at the end of the dark. No big surprise. I carry the dark inside me. I’m a bastard – branded as such from the start. I never give my phone number and address. I take my pleasure, and don’t come back for seconds. No commitments, no promises and no happy endings. Yeah, I’m a bastard down to the bone and I don’t give a damn. But now I’m back in my birth town, the town I fled at eighteen – back to make amends to the brother I abandoned and watch from afar the only girl I’ve ever wanted. Hope isn’t a currency I can afford. I learned that lesson long ago. Yet when she looks at me and says my name, I can’t help but hope.  Standalone novel. No cliffhanger. *Warning: this book contains graphic language, sex, and violence. Mature readers only. Not intended for young readers.*  Inked Brotherhood Series:  Five boys brought together by fate. Five young men trying to overcome their troubled pasts. Five tattoos marking them as a brotherhood built on tragedy. Will they find understanding and rise above the pain? Five girls tied by friendship. Five young women fighting their own demons. Five lives laced with sorrow. Will they be strong enough to save the men they love and make them happy?  The series comprises five interconnected, stand-alone novels: Asher, Tyler, Zane, Dylan and Rafe.",
  "genres": [
    "Romance",
    "New Adult",
    "Audiobook",
    "Contemporary",
    "Contemporary Romance",
    "Abuse",
    "College"
  ],
  "author": "Jo Raven",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/22792366-tyler"
}