{
  "title": "Herd: How to Change Mass Behaviour by Harnessing Our True Nature",
  "description": "Can you explain the explosion of social activities like text messaging with little or no promotion of the behaviour? How a Mexican wave happens? The emergence of online communities? Or – more sensitively – the steady rise of floral roadside tributes to traffic accident victims from complete strangers? Unless you have a good explanation of mass behaviour, you’ll have little chance of altering it. Herd reveals that most of us in the West have completely misunderstood the mechanics of mass behaviour because we have misplaced notions of what it means to be a human being. With a host of examples from Peter Kay and urinal etiquette to Apple and Desmond Tutu, Mark Earls offers the most new radical, controversial and significant new theory of consumer behaviour in a generation. \"At one level a profoundly simple and important idea, that just happens to overturn everything we thought we knew about marketing to the individual.\"―Adam Morgan, Founder, Eatbigfish \"Mark Earls helps us see clearly that we need to re-write the rules and provides us with a playbook for doing so. Are you ready for the ‘we’ revolution?\"―Ed Keller, CEO, The Keller Fay Group \"Herd is a dazzling, nutrient-rich read that urged me to see afresh the big underlying forces driving media behaviour and why they especially matter now.\"―David Abraham, EVP, The Learning Channel \"As important to read as Malcolm Gladwell and Adam Morgan were. I cannot recommend it highly enough unless you are a luddite or an ostrich.\"―Mark Sherrington, Global Brands Director, SABMiller \"Read this book. Think about it. If you’re going to be any good at your job in the next 20 years then you need to questions your assumptions about how stuff works.\"―Russell Davies, Founder, Open Intelligence Agency",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Business",
    "Sociology",
    "Society",
    "Self Help",
    "Audiobook"
  ],
  "author": "Mark Earls",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/227856.Herd"
}