{
  "title": "Knitting, Praying, Forgiving: A Pattern of Love and Forgiveness",
  "description": "In Knitting, Praying, Forgiving: A Pattern of Love and Forgiveness, Cheryl shares her story of faith and her journey to forgiving the young man who murdered her mother. She provides a user-friendly pattern to experience love and forgiveness with the craft of knitting and an ancient monastic prayer practice: Lectio Divina. You may find encouragement in Cheryl's story, and her pattern will help guide you to forgiveness one stitch at a time. \"A grace-filled book for knitters and contemplatives, Knitting, Praying, Forgiving is a practical and inspirational guide to the transforming power of knitting God's love into shawls of forgiveness\" - Susan S. Izard, co-author of Knitting into the Mystery \"Cheryl Wunsch has an amazing story to tell, and she does so with great courage and compassion. Knitting, Praying, Forgiving lays out the path to a new life for anyone who has suffered at the hands of evil. I love this little book\" -Paula Huston, author of A Season of Mystery and Simplifying the Soul. \"Thoughtful and touching, Wunsch weaves together deep appreciation of a centuries-old prayer tradition with the needs of today. Her approach reminds me of the weaving of baskets prayerfully performed by the desert monks of long ago. Both spiritual and practical, this approach is another way to pray always\" -Brother Bede Healey, OSB Cam. \"Cheryl Wunsch weaves in her tender book Knitting, Praying, Forgiving a simple pattern of prayer, reflection, and craft (knitting) that abides as the heart of a loving and forgiving life. In the manner in which she knits her story, her prayer, and her practice together, Cheryl creates a radiant shawl of quiet that speaks powerfully as the fruit of faith and forgiveness\" -Glenn Mitchell, spiritual director and director of training and programs for Oasis Ministries",
  "genres": [],
  "author": "Cheryl Wunsch",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/22799226-knitting-praying-forgiving"
}