{
  "title": "Letting Go of the Words: Writing Web Content that Works",
  "description": "\"Redish has done her homework and created a thorough overview of the issues in writing for the Web. Ironically, I must recommend that you read her every word so that you can find out why your customers won't read very many words on your website -- and what to do about it.\"-- Jakob Nielsen, Principal, Nielsen Norman Group“There are at least twelve billion web pages out there. Twelve billion voices talking, but saying mostly nothing. If just 1% of those pages followed Ginny’s practical, clear advice, the world would be a better place. Fortunately, you can follow her advice for 100% of your own site’s pages, so pick up a copy of Letting Go of the Words and start communicating effectively today.”--Lou Rosenfeld, co-author, Information Architecture for the World Wide WebOn the web, whether on the job or at home, we usually want to grab information and use it quickly. We go to the web to get answers to questions or to complete tasks – to gather information, reading only what we need. We are all too busy to read much on the web.This book helps you write successfully for web users. It offers strategy, process, and tactics for creating or revising content for the web. It helps you plan, organize, write, design, and test web content that will make web users come back again and again to your site. Learn how to create usable and useful content for the web from the master - Ginny Redish. Ginny has taught and mentored hundreds of writers, information designers, and content owners in the principles and secrets of creating web information that is easy to scan, easy to read, and easy to use. This practical, informative book will help anyone creating web content do it better. Features * Clearly-explained guidelines with full color illustrations and examples from actual web sites throughout the book. * Written in easy-to-read style with many \"befores\" and \"afters.\"* Specific guidelines for web-based press releases, legal notices, and other documents.* Tips on making web content accessible for people with special needs. Janice (Ginny) Redish has been helping clients and colleagues communicate clearly for more than 20 years. For the past ten years, her focus has been helping people create usable and useful web sites. She is co-author of two classic books on A Practical Guide to Usability Testing (with Joseph Dumas), and User and Task Analysis for Interface Design (with JoAnn Hackos), and is the recipient of many awards.* Clearly-explained guidelines with full color illustrations and examples from actual web sites throughout the book.* Written in easy-to-read style with many \"befores\" and \"afters.\"* Specific guidelines for web-based press releases, legal notices, and other documents. * Tips on making web content accessible for people with special needs.",
  "genres": [
    "Design",
    "Writing",
    "Nonfiction",
    "Website Design",
    "Business",
    "Reference",
    "Usability"
  ],
  "author": "Janice G. Redish",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/1135441.Letting_Go_of_the_Words"
}