{
  "title": "God Save the Mark",
  "description": "* mark n. An easy victim; a ready subject for the practices of a confidence man, thief, beggar, etc.; a sucker.-Dictionary of American Slang, Thomas Y. Crowell Co., 1960That's the long definition of a mark. But there's a shorter one. It goes:* mark n. Fred FitchWhat, you ask, is a Fred Fitch? Well, for one thing, Fred Fitch is the man with the most extensive collection of fake receipts, phony bills of sale, and counterfeit sweepstakes tickets in the Western Hemisphere, and possibly in the entire world. For another thing, Fred Fitch may be the only New York City resident in the twentieth century to buy a money machine. When Barnum said, \"There's one born every minute, and two to take him,\" he didn't know about Fred Fitch; when Fred Fitch was born, there were two million to take him.\tEvery itinerant grifter, hypester, bunk artist, short-conner, amuser, shearer, short-changer, green-goods worker, pennyweighter, ring dropper, and yentzer to hit New York City considers his trip incomplete until he's also hit Fred Fitch. He's sort of the con-man's version of Go: Pass Fred Fitch, collect two hundred dollars, and move on.\tWhat happens to Fred Fitch when his long-lost Uncle Matt dies and leaves Fred three hundred thousand dollars shouldn't happen to the ball in a pinball machine. Fred Fitch with three hundred thousand dollars is like a mouse with a sack of catnip: He's likely to attract the wrong kind of attention.\tAdd to this the fact that Uncle Matt was murdered, by person or persons unknown, and that someone now seems determined to murder Fred as well, mix in two daffily charming beauties of totally different types, and you have a perfect setup for the busiest fictional hero since the well-known one-armed paperhanger. As Fred Fitch careers across the New York City landscape-and sometimes skyline-in his meetings with cops, con men, beautiful girls, and (maybe) murderers, he takes on some of the loonier aspects of a Dante without a Virgil. Take one part comedy and one part suspense and shake well-mostly with laughter.",
  "genres": [
    "Mystery",
    "Fiction",
    "Humor",
    "Crime",
    "Thriller",
    "Mystery Thriller",
    "Comedy"
  ],
  "author": "Donald E. Westlake",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/228004.God_Save_the_Mark"
}