{
  "title": "The Girl Who Remained Elusive",
  "description": "I’m Lana Thurgood. I’m 17, and I live in a cave. It’s been my home for five years, and I share it with a few others who fled the city the day the big green government trucks rolled into town.  Back then, the world was in shambles. Rumors of a fast spreading, incurable and fatal virus had taken the world by storm. People were desperate for a cure, but there was none. However, a pharmaceutical company backed by the government created a preventative vaccine. It wouldn’t cure anyone who contracted the virus, but it would make anyone who didn’t have the virus immune to it. The President wrote it into federal law that the preventative drug was mandatory for all citizens in the nation, and that in every city and every town, the military would ensure obedience to that law was enforced. Uri and I watched through the slats of our boarded up windows as the long convoy rolled into town. And less than twenty-four hours later, we sat in the backseat of our red ‘84 volvo and watched as the only place we’d ever called home disappeared from view. Now, five years later, Father is dead, and the food storage is close to gone-rapidly depleting. For the last several months or so, I’ve been trekking into the city to forage for non-perishables to supplement our food supply. I know the risk I take every time I leave the hidden away, safe confines of the caves. In the past, I’ve had no trouble, but rumor at the caves is guards are actively roaming the streets, The way I see it, I’ve got two choices: slowly starving during the winter that’s just around the corner or taking a chance and making another trip to get enough food to hold us over for another four weeks or so. On one hand, I could get caught by a patrolling guard and be taken against my will to live in Isis like mostly everyone else I used to know. On the other hand, there is a possibility that I could successfully forage around the city, find some canned goods and make it back home to the caves. And I’m hungry, so the choice is easy. I mean, it’s not like I’ve never taken this trip before, and so what if guards are out patrolling for citizens to kidnap? I’m not who they think I am. I’m not one of the doped up, compliant, non-resistant citizens-made-victims that they prey on. I can still think for myself, and I’m fast on my feet. And, I’m very handy with a knife. All because I’m med-free. And I intend to stay that way. And I definitely will, if everything goes as planned. And it should. Right?",
  "genres": [],
  "author": "Whitney Pagano",
  "average_rating": "3.24",
  "url": "https://www.goodreads.com/book/show/22798415-the-girl-who-remained-elusive"
}