{
  "title": "The Reputation Playbook: A winning formula to help CEOs protect corporate reputation in the digital economy",
  "description": "Why do some companies have a seemingly flawless reputation while others constantly fight a losing battle?Maybe you've always kept social media at arm's length, but the thought of a crisis unfolding online keeps you awake at night. Or you are aware you should be giving clearer direction to your team in the area of reputation building, but aren't sure what to demand or what questions to ask. If so, then The Reputation Playbook is for you.The fundamental principles of reputation-building haven't changed for decades, but the advent of social media means transparency around how a business acts has. News, good or bad, now travels at internet speed, so to protect and enhance its reputation a business needs to be prepared to respond in real time, whether to customer interaction, news stories or operational errors. And as the leader of your business, the reputation buck stops with you. Your team expects, and needs, you to take the lead.You don't need to know the how when it comes to using social media, but you do need to know why it is critical that it's on your radar. So you won't find instructions on how to use the various social media platforms in The Reputation Playbook. You will find a lively and insightful examination of how social media affects corporate reputation-building, filled with practical advice and punctuated with real-life examples from the companies that are doing it right - and those that have got it wrong.Jennifer Janson has gathered data and thoughts from the world's leading thinkers on corporate reputation and also provides a framework for evaluating and mitigating your business' reputational risks. Most important, the Playbook tells you what questions to ask of those around you to ensure your business is building a strong reputation, and minimising the risk of reputational damage, long before a crisis arises.It is time to think about how your business reputation is affected by social media. All you need to get you started is The Reputation Playbook.",
  "genres": [
    "Business"
  ],
  "author": "Jennifer Janson",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/22798285-the-reputation-playbook"
}