{
  "title": "The Curious Incident of the Dog in the Night-Time",
  "description": "Christopher John Francis Boone knows all the countries of the world and their capitals and every prime number up to 7,057. He relates well to animals but has no understanding of human emotions. He cannot stand to be touched. Although gifted with a superbly logical brain, Christopher is autistic. Everyday interactions and admonishments have little meaning for him. Routine, order and predictability shelter him from the messy, wider world. Then, at fifteen, Christopher’s carefully constructed world falls apart when he finds his neighbor’s dog, Wellington, impaled on a garden fork, and he is initially blamed for the killing. Christopher decides that he will track down the real killer and turns to his favorite fictional character, the impeccably logical Sherlock Holmes, for inspiration. But the investigation leads him down some unexpected paths and ultimately brings him face to face with the dissolution of his parents’ marriage. As he tries to deal with the crisis within his own family, we are drawn into the workings of Christopher’s mind.And herein lies the key to the brilliance of Mark Haddon’s choice of narrator: The most wrenching of emotional moments are chronicled by a boy who cannot fathom emotion. The effect is dazzling, making for a novel that is deeply funny, poignant, and fascinating in its portrayal of a person whose curse and blessing is a mind that perceives the world literally.The Curious Incident of the Dog in the Night-Time is one of the freshest debuts in years: a comedy, a heartbreaker, a mystery story, a novel of exceptional literary merit that is great fun to read.--front flap",
  "genres": [
    "Fiction",
    "Mystery",
    "Young Adult",
    "Book Club",
    "Classics",
    "Autistic Spectrum Disorder",
    "Novels"
  ],
  "author": "Mark Haddon",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/228044.The_Curious_Incident_of_the_Dog_in_the_Night_Time"
}