{
  "title": "Gorgeous Grumps: A Nine Book Billionaire Romance Boxset",
  "description": "Sassy heroines meet arrogant, irresistible heroes in this spicy 9-book boxset by bestselling author Leslie North. Hours of fiery romance await!Perfect (Mis)matchWhen Vincent Forde rear-ends her car, Piper Doyle expects an apology. Instead, she finds herself face to face with the world’s biggest bosshole! Then the sculpted devil has the nerve to offer her a deal she can’t refuse. He only needs two things in access to a rare perfume ingredient and a fake girlfriend. Piper wants absolutely nothing to do with him. But before long she starts wondering if she’s the only one wishing their fake relationship was real.On the RocksCora Newport only agreed to compete in a mixology contest for one reason. To raise money so she can open her own speakeasy. Then he walks in. Her oh-so-hot, mega-successful ex, Aiden Callihan. When he offers her a dream job creating a new, non-alcoholic drink, she reluctantly agrees. Even knowing she might be spiraling toward a romantic relapse.Designed for DisasterWorking at a coffee shop? Not exactly Natasha Dryer’s dream gig. She’s a talented furniture designer who can’t catch a break. So when Trent Saunders, aka Satan, gets her fired, she’s ready to blow. Until the gorgeous grump offers her a job designing high-end furniture for his grandmother. And when Grandma mistakes Natasha for his girlfriend? He asks her to play along. She isn’t about to fall for Trent’s whole “beneath the grump there’s a good guy” routine. Until she does…Mr. GrumpAfter a wild night of passion, Kaitlyn is shocked to discover her one-night-stand is also her new boss! And to make matter worse, he’s grumpy, gruff, and rude. Too bad he also happens to be smoking hot, and a caring dad to his adorable daughter. But there’s no way she’ll ever admit that she can’t stop thinking about their night together. Or is there…Mr. JerkMaddy isn’t exactly thrilled when billionaire sports agent, Noah Parker, mistakes her for an escort. Noah may have volcanic levels of hotness, but Maddy’s only interested in doing her job as his new assistant. People say Noah always gets what he wants, but Maddy is sure he’s not getting her.Mr. CockyPhotographer Maxine isn’t sure how she ended up as billionaire Theo Barnes’s pretend girlfriend. Theo may be the sexiest man she’s ever seen, but he’s way too cocky for her taste. Cocky enough to break their no PDA rule. Cocky enough to think amazing sex has no consequences…The Bossy OneOlivia St. James’ new boss, Irish billionaire Declan Byrne, is a total grump. He clearly doesn’t like her. But guess what? The feeling is mutual. That is, until Olivia sees a different side of Declan—a softer, sexier side. Olivia has always stuck to the cardinal rule for Do not get involved with the family. But come on, aren’t rules made to be broken?The Grumpy OneCleaning floors at Branson Couture wasn’t part of Natalie Greenwood’s career plan. Neither was almost decapitating the CEO—Snarlmaster General James Branson— with a mop. He’s insanely rich, annoyingly charming and, as it turns out, he’s also her new boss. After finding her design sketchbook, James offers Natalie the job of her dreams. All she has to do is show up, work hard and try not to think about her boss naked.",
  "genres": [],
  "author": "Leslie North",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/228095339-gorgeous-grumps"
}