{
  "title": "LOL Romantic Comedy Anthology, Volume 1",
  "description": "Here's the very first issue of LOL, a NEW romantic comedy series!Enjoy 13 brand-new stories from your favorite NYT Bestseller and USA Today Bestseller romantic comedy and romance authors, The Return of Ursula, A Peaches Monroe Short Story by Mimi StrongPeaches Monroe returns to Los Angeles a married woman. But there's trouble in paradise. Her new husband won't invite her to the film set of his vampire-drama TV series. Peaches doesn't take no for an answer.The Real Deal by Elle CaseyWhen Melissa takes one last farewell tour of an internet dating site, and she sees a listing she can't ignore. She sends a quick note to the guy, congratulating him on his creativity. When he writes back, he makes her an that's ridiculous and impulsive, but what the heck … you only live once, right?Handcuffed to the Stockbroker by Victoria WessexCurvy Wall Street protester Alice handcuffs herself to Mason, a “suit” who represents everything she hates. Forced to spend the day together, the friction between hot-headed Alice and cool, gorgeous Mason soon explodes. The Sex Tape by Cassia LeoMax Milan was destined for a decadent future. Then he made one tiny—epic—sex tape and it all came crashing down. Now he’s trying to get back on his feet, trying to secure a deal that will put him back in the spotlight. Then she turns up.Can’t Stop Wanting You by Gretchen GalwayJody Lapinski is a plus-sized chemist with a problem. The despicable Simon Brogan has moved into the upstairs unit of her house. In high school, Simon was an arrogant, heartless jerk. She's not going to forgive him now just because he's gorgeous and successful. Not after what he did.Legal-i-Tease, A Lawyers in Love Short Story by N.M. SilberAdam and Lily Roth are on their way to a romantic honeymoon in Rio de Janeiro. When they arrive, the last thing they expect is to be treated like celebrities. Can the newlyweds survive their fifteen minutes of fame and finally consummate their marriage?Kiss Me Again by Juliet SpenserHigh school English teacher Rachel Chapman spends her free time writing naughty love stories just for fun. When her notebook falls into the hands of sexy, fun-loving Tyler Kalinger, Rachel will do anything to get her secret stories back.An Extravagant Proposal (Billionaires in Charley) by Blair BabylonCharley Parkhurst has been in love with moneyed, gorgeous Ford Dalio for five long years. When Ford whisks her away for a weekend in Paris to crash a royal wedding, Charley thinks he might finally pop the question, but Ford has other plans.On The Road, A Ransom Short Story by Rachel SchurigDaisy and Daltrey finally have a shot at happiness. They just have to handle a national tour, the pressure of fame, Daltrey's bickering family, a few crazed fans, and the lingering demons of Daisy's past. Easy, right?Christmas Shopping for a Billionaire by Julia KentWhen Shannon is called to the mall to work as a sexy elf, her billionaire boyfriend, Declan, gets roped into playing Santa. The mall mommies start tweeting pictures, and soon everyone is crashing the mall to have a seat on Santa's lap.Love in Tune by Caitie QuinnMelissa Foehner is a rock star babysitter whose star has just disappeared. Now nothing will stop her from getting the show back on the road… Not even a broad set of shoulders and a smart mouth.Take Two by Daisy PrescottMaggie Marrion and Gil Morrow got a second chance at love. They discover the second time around is better than the first, especially when it comes to sex. Or at least it can be, with the help of magical blue pills.Surprised By You by Kelly HarperIt’s a big day for tattooed rock star Haden Cooper. His girlfriend, Maggie, wants to bake him a cake.",
  "genres": [
    "Anthologies",
    "Romance",
    "Contemporary",
    "Amazon",
    "Humor",
    "Adult",
    "Contemporary Romance"
  ],
  "author": "Elle Casey",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/22813872-lol-romantic-comedy-anthology-volume-1"
}