{
  "title": "Therapy Horse Selection: A My Horse, My Partner Book",
  "description": "What makes a good therapy horse? Or any horse for that matter? Is it size, temperament, training, build, soundness, even age? It is all that and more. Therapy Horse Selection walks you through the process of choosing the best therapy horses for your program, and sets you and the horses up for a high ratio of success. It is also a trusted guide for anyone who is looking for a horse of their own. From the first look, to assessing needs, to understanding the many red flags, to a series of useful forms along with forty-five illustrative photos, Therapy Horse Selection is a must have for every PATH, EAGALA, hippotherapy, or other riding instructor or program. Lisa's common sense and experience give insightful revelations. I love how concise she is while clearly defining each step of the process! Lisa's books are definitely in my library of go to info when I need help training and selecting my therapy horses. ––Patty D’Andrea, PATH International Advanced Instructor, Founder/Executive Director, Healing with Horses Ranch, Manor, TX Therapy Horse Selection is something the therapeutic riding industry has needed for a long time. As a TR professional for many years, I realize there is no perfect horse, and that the many variables of each horse should all be a part of the puzzle. This very informative read helps us see the many pieces, and explains why and how they fit together. Lisa Wysocky has a great way of describing with words and uses a lot of real-life visuals that are truly useful. Examples and situations that people will encounter out in the field are hard to capture, but she does it with ease. She also doesn't assume readers already have common knowledge, yet moves through topics without boring more advanced readers. This book does a great job educating center staff who are looking for the right horse, as well as the rest of the horse community about what is important and why. Many people think their horse is “retiring” when entering the therapy world, because they think the physical work is less than in the competitive world. I've often heard, “Why would I donate my horse? He isn't lame or old enough to give away.” This book is the answer to that question. This is certainly a book that our center will have in our library and refer to often! I highly recommend Therapy Horse Selection to people interested in the therapy center staff­, prospective donors, trainers, instructors, board members, and volunteers who want to understand more about the process of horse selection. ––Mary Mitten, executive director, We Can Ride, Minnetonka, Minnesota, PATH International Advanced Instructor",
  "genres": [],
  "author": "Lisa Wysocky",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/22808950-therapy-horse-selection"
}