{
  "title": "The Perfect Husband/The Other Daughter",
  "description": "The Perfect HusbandWhat would you do if the man of your dreams hides the soul of a killer?Jim Beckett was everything she'd ever dreamed of...But two years after Tess married the decorated cop and bore his child, she helped put him behind bars for savagely murdering ten women. Even locked up in a maximum security prison, he vowed he would come after her and make her pay. Now the cunning killer has escaped—and the most dangerous game of all begins....After a lifetime of fear, Tess will do something she's never done before. She's going to learn to protect her daughter and fight back, with the help of a burned-out ex-marine. As the largest manhunt four states have ever seen mobilizes to catch Beckett, the clock winds down to the terrifying reunion between husband and wife. And Tess knows that this time, her only choices are to kill—or be killed.The Other DaughterWhat you don't know can kill you.In Texas a serial killer is executed, taking to his grave the identity of his only child.In Boston a nine-year-old girl is abandoned in a hospital, then adopted by a wealthy young couple.Twenty years later, Melanie Stokes still considers herself lucky. Until...Until the terrifying visions begin.Until a has-been reporter starts investigating her past.Until the first note arrives saying YOU GET WHAT YOU DESERVE.Melanie had lost all memory of her life before the adoption, and now someone wants to give it back. Even if it includes the darkest nightmare the Stokes family ever faced: the murder of their first daughter in Texas. As Melanie pursues every lead, chases every shadow in the search for her real identity, two seemingly unrelated events from twenty years ago will come together in a dangerous explosion of truth. And with her very life at stake, Melanie will fear that the family she loves the most may be the people she should trust the least.",
  "genres": [
    "Thriller",
    "Fiction",
    "Crime",
    "Mystery Thriller",
    "Mystery",
    "Suspense"
  ],
  "author": "Lisa Gardner",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/2281322.The_Perfect_Husband_The_Other_Daughter"
}