{
  "title": "ديجافو",
  "description": "الرواية فانتازيا دينية، تطرح تصورا لوجود حياة مسبقة لحياتنا هذه ،على كوكب الزهرة “فينوس” السابق للأرضالأبطال عاشوا حيواتهم هناك بكل طهر بعضهم،أو فساده، أو عجز آخرين، أو محاولة بعضهم للرجوع عن طريق الخطأ ، وكفاحه ليكون كما يجب .كما تتضمن نظرية أن الإنسان بالكامل محاسب على اختياره الحر، يجيب عن الأسئلة الحائرة (لماذا؟) ، لماذا فلان ولد معاقا؟ لماذا لم أولد غنيا؟ لماذا يموت أناس أبرياء في الحرب والمجاعات دون ذنب فعلوه؟ لماذا فلان ناجح ولم يطلب النجاح ولا يملك مقوماته؟التفسير لذلك، أن ما يجري في أحيان كثيرة هو عقد تم الاتفاق عليه يوم الحساب بين الرب وعبد، بناء على ما جرى معه في حياة سابقة.الفصل الثالث بعنوان “حك أسطورة تجد حقيقية” يتحدث عن نظرية الأكوان المتوازية، بان كل شخص من هؤلاء يعيش ثلاث حيوات في الوقت نفسه ، في ثلاثة عوالم “أراضين” مختلفة، ويبين أن ردة فعل الإنسان ومدى التزامه بالخطة أو غضبه منها ، أو أي قرار يتخذه عن طريق الدعاء بالتغيير ، سيغير مجرى حياته.-------------مقطع من العمل: كان ياما كان، وكلُّ ما كان امتدادٌ لما يحدث الآن...كان بديعًا أنْ يُصنع عملٌ كاملٌ، والأكثرَ إبداعًا صناعةُ مثله، أو خيرٍ منه.في ثلاثة أكوانٍ متوازيةٍ، بدأ الخَلْقُ، وكانت الحياة، بل الحَيَوات. في كلٍّ منها إمكانياتٌ هائلةٌ، وقدراتٌ فائقةٌ، وفروقٌ شاسعةٌ، وقوانينُ خاصّةٌ. تختلف القوانين فتختلف النفوس وتتفاوت موازين العدل. لعلّ التفاحةَ؛ طبيبَك اليوميَّ هنا، تكونُ حَجَرَ بِناءٍ هناك، ولعلّ حِبْر الكتابة هنا هو نفسُه ماءُ الشرب الذي يُلوِّن بَشَرَتَهم أزرقَ أو أسودَ هناك، ولعلّ استعلاء الذكر على الأنثى هنا، يقابله أن يكون للأنثى مثلُ حظِّ الذّكريْن هناك.وفي كلِّ كونٍ، انتظم الخلق في تفاعلٍ بهيجٍ ليظهر أثرُ الفراشة فيه، كما تقتضيه الحركة المتناغمة أو النشاز في سمفونية الوجود.في كونٍ، تمضي الحياة، تشرق شمسها وتَغْرُب، وتَهطُل الأمطار من السُّحب، وتتجلّى الحياة في تعاقب الفصول.في كونٍ موازٍ آخرَ، تمضي الحياة، ولا يظهر للشروق والغروب أثرٌ، لكنْ يمضي الزمن بتعاقب الكواكب وإشراقات النور المتبدِّد بانتظامٍ في الكون من أَثَرِ فُسيفساء التجويفات الكونية، ثقوبٌ سوداءُ في كونٍ، قد تعني فجواتٍ بيضاءَ هناك.في كونٍ موازٍ ثالثٍ، تكون الأجساد سائلةً تمشي على الماء وتبني قصورًا في الهواء، وتغرق في شبرٍ من ترابٍ.فاستعنْ بخيالك لتفهم الفَرْقَ، ولِتُدْرك أثرَ الفراشة في كلِّ كونٍ منها.للقراءة أونلاينhttps://drive.google.com/file/d/0B-DX...",
  "genres": [
    "Novels"
  ],
  "author": "سلام عيدة",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/22814196"
}