{
  "title": "The Secrets of Being Happy, The Technology of Hope, Health and Harmony",
  "description": "Imagine for a moment that someone takes you into a huge room, packed with the most complex technology you’d ever seen and offers to show you how to operate the system so that you can instantly bounce your attitude from one of negativity and doubt to an attitude of optimism, cheerfulness and hope. How radically would your life change if you could switch, at will, from living life down to living life up? What would you be capable of achieving if you had a system guaranteed to upgrade your health and well-being, outlook and expectations? Is this something you’d be interested in? If so, read on …Being Happy is written for the average person who wants to change his or her life and achieve his or her full potential. It is full of exercises and life-changing tactics utilizing the principles of NLP with amazing results. Written by Richard Bandler, co-creator and developer of Neuro-Linguistic Programming, and Garner Thomson, NLP Master Practitioner and Trainer,Richard Bandler is arguably the world’s most influential contributor to the field of self-development and applied psychology. His books have sold more than half a million copies, and tens of thousands of people have studied his unique blend of hypnosis, linguistics, and precise thinking throughout the world.A widely acclaimed keynote speaker and workshop leader, he is the author of many books, including Get the Life You Want, Richard Bandler’s Guide to Trance-formation, Using Your Brain—for a Change, Time for a Change and Magic in Action. He co-authored Conversations, Frogs into Princes, Persuasion Engineering, The Structure of Magic I, The Structure of Magic II, Patterns of the Hypnotic Techniques of Milton H. Erickson Volumes I and II, and Neuro-Linguistic Programming Volume I.Dr Bandler’s background as a musician and his interest in the relationship between sound and neural functioning has led him to develop Neuro-SonicsTM, and a range of programs for the BrainFit™ light-sound machine, both of which utilize music and sound to create specific internal experiences and behavioral outcomes. He is also the founder of the mental technologies of Design Human Engineering (DHE) and Neuro-Hypnotic Repatterning (NHR).",
  "genres": [
    "Self Help"
  ],
  "author": "Garner Thomson",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/11356975-the-secrets-of-being-happy-the-technology-of-hope-health-and-harmony"
}