{
  "title": "Jagged Rock",
  "description": "Dear Author,Meet Will and Connor.[Photo Description 1]Will: So, a couple things. I’m a werewolf. I met my mate back in middle school, at the time I didn’t quite understand why I was so drawn to Connor, why I was so protective of him and couldn’t stand being apart. Now that we’re older I get it. I feel like a guardian angel sometimes, making sure he’s never hurt and always happy. The thing is, he has no idea that werewolves exist, let alone his best friend is one. Man, I’m not looking forward to that conversation or the fact that eventually (soon) I’m gonna have to bite him and claim him (that part I’ll admit I’m excited for :)).[Photo Description 2]Connor: Hi, I’m Connor, I’m known to be kinda shy. Let’s see, I’m in a band, I drum. I’m a freshman and share a dorm with my best friend Will. We’ve basically been inseparable since middle school. Will sings for our band and is amazing. He’s always been there for me, from the second I moved to our hometown all those years ago, he took me under his wing. The problem? I’m so totally in love with him. I’m so not looking forward to that conversation, but I feel like the time’s coming to tell him, before someone else grabs him up.Photo Description: Photo 1: A young man with tattoos and short hair looks away from the camera, dressed in black pants low enough to show underwear, and a black leather hooded jacket open to show his well-defined chest.Photo 2: A tattooed and well-defined young man with diamond stud earrings looks at the camera, posed shirtless on a chair.This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Friends To Lovers",
    "Shapeshifters",
    "Romance",
    "Fantasy",
    "College"
  ],
  "author": "Willow Scarlett",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/22819048-jagged-rock"
}