{
  "title": "Westward Dance",
  "description": "A historical western cowboy romance novella about a mail order bride. ** A clean romance novella ** Madelyn O'Connor is beautiful, popular, and comfortable with her opulent life. That is until she is brutally attacked by the son of one of the wealthiest families in Pittsburgh. Her parents are ready to fight the case out in the courts, but Madelyn doesn't want any publicity about it. She wants to forget that it ever happened, but can't. Her family grows increasingly worried about the depressive state she falls into and they try to come up with ways to help her, but nothing seems to work. Tessa feels that it would be best for Madelyn to get far away from the city and wants her to come to Montana, but Madelyn is resistant to the idea. Seth Samuels, Tessa's brother-in-law, becomes injured when he and his men are attacked by wild dogs on a cattle drive. He's morose and anxious over the prospect of not being able to participate in drives any longer. Tessa sees two people she loves hurting and thinks that maybe they can help each other when no one else can. She appeals to Seth to help convince Madelyn to come west. Seth refuses at first, but then figures that since he can't do much else he might as well try to help. Madelyn and Seth begin a volley of letters in which Seth entices Madelyn to come meet him. She finds him charming and eventually cannot resist his entreaties. She and Tessa convince her parents to let her make the trip. Geoffrey agrees to accompany his second eldest daughter to Montana. When Seth and Madelyn meet they are instantly attracted to each other, but when Seth's condition becomes even more serious, Seth is prepared to face the worst. Madelyn isn't about to give up on him, however, and becomes determined to help the man with whom she's smitten to heal. Together they embark on a journey of recovery as Seth agrees to go back East to get more modern treatment. As their relationship deepens there are seemingly insurmountable obstacles that threaten to tear them apart. Can each of them compromise in order to have a future together or will their pride keep them from realizing their dreams?",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Westerns",
    "Fiction",
    "Western Romance",
    "Mail Order Brides"
  ],
  "author": "Linda Bridey",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/22818204-westward-dance"
}