{
  "title": "Acquiesce",
  "description": "****18+ due to adult language and explicit sexual content*****Caspian Vance~former child prodigy, now an accomplished professor of human sexuality at twenty-six has it all—an IQ that's off the charts, a stellar career at which he excels, and the drop-dead looks and body that make women spontaneously combust with lust.He's been studying sex and women's behavior since he was sixteen. When it comes to the science of human lust and the rewards of sexual pursuits, he has all the answers.There's one thing he knows for sure: \"love\" has nothing to do with it. Sex is a basic, primal human need—love is an unstable, emotional complication. Both are present in a person, but completely unrelated. His own world of logic and fact accepts this truth and now. . .He's going to prove it.When Cass takes a sabbatical to research his theory in order to write his third book, he enlists the help of a former lover and now owner of the world's most exotic and secretive male brothel catering strictly to wealthy older women. On this remote Caribbean island, he uses his keen sense of observation and research to prove \"love\" is merely a series of chemical reactions in the human brain—nothing more.Nicola Barrington~ had the perfect life, married to her soul mate.Ten years into her one and only relationship, her idyllic world is shattered by the death of her beloved husband. The loss of her \"one true love\" sends her into seclusion where she spends the next eleven years pining for the man she still loves.The beautiful heiress, stays hidden away, her only connection to the outside world being being the hired help and her two close friends. Her friends know Nic has much to live for and are eager to see her find love again. . . and if not love, they would settle for her rediscovering the throes of lust.As her 40th birthday approaches, her two friends succeed in coaxing her out of her emotionally safe haven to celebrate with a trip to an exclusive resort known for \"restoring an older woman's brilliant, inner glow.\"Caspian’s superiority and logic combined with Nic's innocence and melancholy are on an imminent collision course. Sometimes even a genius has a hard time figuring out a woman.",
  "genres": [
    "Erotica",
    "Romance",
    "Contemporary Romance",
    "BDSM",
    "Adult",
    "Erotic Romance"
  ],
  "author": "Cory Cyr",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/22818671-acquiesce"
}