{
  "title": "The Heart in Exile",
  "description": "\"So effective is the author's treatment . . . that he manages to bring home in a remarkable manner the suffering of the homosexual. . . . It took real courage to write this story, plus a profound insight into human feelings and sensitivities.\" - Frank G. Slaughter, New York Times \"A sad, serious first novel called The Heart in Exile cannot fairly be ignored. . . . Its detached picture of barren tragic love and desire in a furtive fantastic 'underground' sector of London can arouse no disgust but only a deep pity coupled with a new understanding.\" - Marghanita Laski, The Observer \"An extremely important book.\" - Truth \"A completely honest story of homosexual life in London. . . . It makes no attempt to defend or condemn. A well-written work.\" - John Betjeman, Daily Telegraph \"Written with great competence.\" - Walter Allen, New Statesman Julian Leclerc, a handsome and talented young barrister, has been found dead of an apparent overdose of sleeping pills. The verdict is accidental death, but his fiancée, Ann Hewitt, suspects there's something more to the story. As the grieving woman recounts the details of Julian's tragic end to psychiatrist Dr. Tony Page, he listens with acute interest - but not for the reason she thinks. Years earlier, he and Julian had been lovers, and now, disturbed by the circumstances of his friend's demise, Tony sets out to uncover the truth. His quest will take him from the parties and pubs of the gay underworld of 1950s London to Scotland Yard and the House of Commons as he uses his shrewd and penetrating insight to find who or what was responsible for Julian's death. But he may discover more than he bargained for - about Julian, and himself. . . . First published in 1953, Rodney Garland's noir thriller The Heart in Exile is both a groundbreaking classic of gay fiction and the first gay detective story. Long unavailable, Garland's famous novel returns to print at last in this edition, which features a new introduction by Neil Bartlett.",
  "genres": [
    "LGBT",
    "Mystery",
    "Gay",
    "Fiction",
    "Queer",
    "Gay Fiction",
    "Queer Lit"
  ],
  "author": "Rodney Garland",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/2281876.The_Heart_in_Exile"
}