{
  "title": "My African Prince",
  "description": "Prince to a pride of black lion shifters, Zee secretly desires to submit to the big, gorgeous, pale-skinned man with the mysterious scent. He hungers to be taken, filled… and loved.His pride will probably kill him if they ever discovered his most secret cravings— no sign of weakness is ever tolerated. Yet, with Luka, the risk may be completely worth even one moment in his arms.This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. Dear Author,I am supposed to be content as a lion. A prince and heir of our pride. We are a fierce, strong, and unique pride of black lions. Humans think it is because of melanism but what they don’t know is that we are shifters. All of us.But Author, that is not my dilemma, HE is my dilemma. That gorgeous, delicious, man over there. I have never seen someone with his skin tone before. And while he doesn’t smell like a lion, he also doesn’t smell completely… right as a human either. And even more than that he makes me want to give in to my secret, darkest desire, to submit, to be mounted by someone else, to be filled.I am a prince! The heir of my pride! I am supposed to submit to no man or woman! And yet, with this man? All I want to do is beg him to take me and even more than that… to love me. Even though it may get me killed by my pride.Photo Description: A handsome African tribesman stares straight at the camera with light-coloured eyes, fierce, smouldering, and intense. Long, thin, braids hang down his back, and his ears and neck are adorned with tribal jewellery. Lush lips form a slight pout and dark stubble shadows his jaw. The second man is tall, broad-shouldered and muscled— he sure looks capable of fulfilling the dark needs in the first man’s eyes.This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Short Stories",
    "Contemporary",
    "Fantasy"
  ],
  "author": "Vona Logan",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/22815369-my-african-prince"
}