{
  "title": "Five Dates",
  "description": "Devin is 35 en al tien jaar vrijgezel. Zijn zusje Lucy heeft besloten dat het hoog tijd is dat Devin weer eens gaat daten, dus als hij een weddenschap van haar verliest, eist ze als tegenprestatie dat hij op vijf dates gaat. Dat is al erg genoeg, maar als blijkt dat ze al een profiel voor hem heeft aangemaakt op een datingapp – met een dertien jaar oude foto – en een date heeft geregeld met een twintiger die eruit ziet als een jonge god, kan hij wel door de grond zakken.Jay valt op oudere mannen. Maar zijn laatste vriend bleek een epic eikel te zijn, en hij is vast van plan voortaan mannen van zijn eigen leeftijd te daten. Dus als hij ontdekt dat hij erin is geluisd en dat Devin precies het soort man lijkt dat hij afgezworen heeft, is de avond wat hem betreft voorbij. Als Devin aanbiedt om hem in elk geval te trakteren op een luxe diner als niet-date om het goed te maken, besluit hij dat dat een acceptabel compromis is.De niet-date is de beste avond die Devin in tijden gehad heeft, en hoe meer tijd hij doorbrengt met Jay, hoe meer tijd hij wíl doorbrengen met Jay. In een vlaag van inspiratie daagt hij Jay uit om hem een make-over te geven voor zijn échte dates. Maar als Jay hem door zijn vijf dates helpt, kan hij hem daarna wel laten gaan?‘Vijf dates’ is een novelle (ca. 27000 woorden/80 blz.) bedoeld voor een volwassen publiek met expliciete scènes. Een verhaal over leeftijdsverschillen, tweede kansen, koude voeten, hete mannen, make-overs en vijf dates – of niet-dates, zo je wil.Voor meer romantische, erotische boeken over gay stellen, lees de andere delen in de reeks 'Man&Liefde'. Van Amy Jo Cousins zijn dat ‘Versierd' en 'Voor altijd Evan', van Layla Reyne is dat 'De perfecte cocktail' en van Austin Chant is dat 'Een extra shot'.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Short Stories",
    "LGBT",
    "Novella",
    "Contemporary Romance"
  ],
  "author": "Amy Jo Cousins",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/22815364-five-dates"
}