{
  "title": "Короткий запис спогадів. Історія Норильського повстання",
  "description": "Пропонуємо увазі читача «Короткий запис спогадів» Євгена Грицяка з двома додатками — зверненням до Миколи Підгорного, Голови Президії Верховної Ради СРСР в 1976 р. і листом до Комітету Сприяння Виконанню Гельсінкських Угод в 1977 році, які були поширені в самвидаві.Євген Грицяк — колишній член української молодечої націоналістичної організації у Снятині, червоноармієць, політв'язень, організатор норильського повстання, дослідник гіндуської філософії, український йогіст, а згодом постійна жертва сваволі КДБ. Ось в одному реченні — життя цієї небуденної людини, яку видало багате на таланти українське Покуття. Під постійним тиском репресійних органів в Україні, Євген Грицяк бажає виїхати з дружиною та дочкою в Індію, чи взагалі будь-куди. На численні заяви покинути СРСР йому постійно відповідають: «Знищимо, зітремо з лиця землі, але нікуди не відпустимо!»Ім'я Євгена Грицяка записане в історію українського спротиву нацистським і російсько-червоним окупантам поруч з багатьма учасниками українського визвольного руху.Народився Євген Грицяк в 1926 р. в селі Стецева біля Снятина (тепер Івано-Франківська область). Перед вибухом Другої світової війни був учнем гімназії у Снятині, а під час німецької окупації — студентом середньої торговельної школи. Саме тоді він співпрацював з молодечою націоналістичною організацією, яка готувала молодь до боротьби з нацистськими окупантами. Не почуваючи себе ні в чому винним, він не тікав перед надходячою в 1944 р. Червоною армією, що вже незабаром зайняла цілу Україну. Зразу він був мобілізований, і в рядах Червоної армії перебував аж до 1949 р. Був вояком 4-го Українського Фронту, і під час боїв був поранений і нагороджений.В 1949 році радянська контррозвідка викрила його «минуле» (співпраця з молодечою українською націоналістичною організацією). Він був заарештований, засуджений на кару смерти, яку замінено на 25 років ув'язнення. В тюрмах і концтаборах перебував разом з Михайлом Сорокою, Данилом Шумуком, Юрком Шухевичем, д-ром Володимиром Горбовим і багатьма іншими незламними українськими політв'язнями.Данило Шумук у своїх спогадах «За східнім обрієм» (в-во «Смолоскип», 1974 р.), хоч і критично висловлюється про методи, які застосовував Є.Грицяк в зорганізуванні норильського повстання, все ж віддає йому належне: «це був безкорисний, чесний, розумний і спостережливий чоловік» (стор. 292 ). Д.Шумук пише, що Є.Грицяк захопився йогою, мав хист до малювання, до чужих мов; вивчив голкотерапію, яку практикував у часі ув'язнення. «У побуті,— пише Д. Шумук,— Євген Грицяк був дуже чесною людиною, йому можна довірити найбільші скарби, і він, навіть умираючи з голоду, не взяв би жодного грама» (стор. 425). «Те, що для інших,— пише він в іншому місці,— було неможливим, то для Євгена було можливим. Він міг піднятися з попелу і знову стати сповненою гідности людиною» (стор. 426).Дуже тепло згадує про Євгена Грицяка єврейський активіст, колишній в'язень радянських тюрем і концтаборів Авраам Шифрін у книжці спогадів «Четвертий вимір» (в-во «Сучасність», 1973 р.), з яким він подружив і навіть разом перекладав з англійської мови книжку відомого індійського письменника Ананді.У 1977 р. Євген Грицяк пішов на одчайдушний крок: він поїхав до Москви, зустрінувся з кореспондентом американської газети «Чікаґо Трібюн» і дав йому інтерв'ю, розказавши про норильське повстання і безперервне переслідування, що його він зазнає з боку КДБ.У розповіді «Короткий запис спогадів» читач пізнає скромного і чесного українського патріота. Обставини ув'язнення Є. Грицяка і трагічна доля його товаришів не залишили його байдужим. Він очолив норильське повстання, кинувшись у вир боротьби з безправ'ям і свавіллям радянського режиму.Історія самооборони українських політв'язнів в радянських концтаборах, людська гідність, нездоланність і мужність — світлими літерами вписали ім'я Євгена Грицяка на своїх сторінках.Друкуючи спогади Є. Грицяка, ми повністю зберігаємо його стиль і фразеологію, за винятком тільки незначних правописних змін.",
  "genres": [
    "History"
  ],
  "author": "Євген Грицяк",
  "average_rating": "4.66",
  "url": "https://www.goodreads.com/book/show/22820734"
}