{
  "title": "The Real Thing: Lessons on Love and Life from a Wedding Reporter's Notebook",
  "description": "From a Washington Post weddings reporter who’s covered more than two hundred walks down the aisle comes a warm, witty, and wise book about relationships—the mystery, the science, and the secrets of how we find love and make it last. Ellen McCarthy has explored the complete journey of our timeless quest for “The One,” the Soul Mate, the Real Thing. This indispensable collection of insights—on dating, commitment, breakups, weddings, and marriage—gives us a window into enduring  • Go Online Already— “It’s a major time suck and a black hole of rejection and ambiguity and lies. But you know what? It also works.”• Keep It Confidential— “If you have to get something off your chest, pick someone whose wisdom you really trust, and who isn’t likely to spread the gossip to all your mutual acquaintances.”• Be Nice— “Brewing the morning coffee, touching the small of your partner’s back, filling their car with gas. These things add up to more relationship satisfaction than a fancy dinner on Valentine’s Day ever could.” The Real Thing features many more nuggets of wisdom, valuable information from the latest studies on commitment, candid testimonials from a variety of couples, and the personal story of McCarthy’s own search for “the keeper”—which begins, ironically, with a breakup the very same day she started as the Post ’s full-time weddings reporter. Whether you’re looking for love or looking to strengthen your relationship, this book is a wonderful and clear-eyed map to the human heart.Praise for The Real Thing “A wise and compassionate look at how we love, along with some gentle suggestions for how we could get a little better at it . . . McCarthy has done something She has written an optimistic book about love that is clear-eyed and unsentimental.” — The Washington Post“What a charming and captivating book this is! We never stop learning about love, and so many great lessons are within these pages.” —Elizabeth Gilbert, author of Eat, Pray, Love “My readers often say to me, ‘If we lived next door to each other, we'd be best friends.’ That is precisely what I wanted to say to smart, funny, self-effacing Ellen McCarthy after I finished reading The Real Thing . I loved every lesson laid out in a book that wouldn’t dare to call itself a field guide to marriage but amounts to as much on every page. This is a deeply useful little book.” —Kelly Corrigan, author of Glitter and Glue “Upbeat and sweet . . . This rich collection of stories charms and edifies, is filled with quotes from couples as well as experts in the field, and serves as not just stories to sigh over but lessons to apply.” — Booklist (starred review) “A fun read full of wonderful stories . . . McCarthy delivers a welcome combination of cynicism and poignancy in this account, which reads with the ease and accessibility of a self-help book.” — Library Journal “A comforting, realistic, and endearing portrait of modern relationships . . . This book will not only charm those in decades-old marriages, but also inspire those afraid love will never arrive for them.” — Publishers Weekly “Straight-talking . . . dating advice for adults of all ages.” — Kirkus Reviews",
  "genres": [
    "Nonfiction",
    "Romance",
    "Memoir",
    "Essays",
    "Relationships",
    "Marriage",
    "Self Help"
  ],
  "author": "Ellen McCarthy",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/22822844-the-real-thing"
}