{
  "title": "Rogue Stallion",
  "description": "No Honor Among Thieves  When Cole Porter drags his brotherhood into a war with a local pimp, Gabriel Morelli, he finds that Gabriel has big connections in the local mob and will stop at nothing to hang on to the woman he considers his prized possession. With the Chrome Horsemen's reputation on the line, Cole must prove his own loyalty when the woman he's trying to save is found in a compromising situation with her so-called captors.   Hell Hath No Fury  When Nicole Bowers sees the mess that is building up around her escape from Gabriel who is apparently willing to kill a lot of good men trying to reach her. She calls her ex-pimp, and asks what will it take to end this. She’s not coming back, but she’s willing to pay. Gabriel names his price, and Nichole is shocked by his absurdity, but she has the amount, and agrees.   Revenge Is Best Served Cold  Gabriel lost his meal ticket when Cole made off with his best girl, but if Gabriel can't have her, no one will, and he will do whatever it takes to lure Nicole back into his camp. He knows her biggest fears, her worst nightmares, and he's not above using them to break her.  EXCERPT  \"Cole, are you trying to seduce me? Because it's working wonderfully if you are, but it would be an unforgivable tease if you aren't,\" she sighed with breathless moans as he caressed her.  He didn't answer, though she thought she felt a chuckle of pleasure thrum in his chest. She was painfully aroused by the time he began to kiss his way down her stomach, going lower with each kiss.  The heat and smoothness of his tongue had her arching the ceiling. She expelled a hot gasp of pleasure from her lungs. \"Oh, sweet mercy, yes, oh yes please,\" she moaned and curled her fingers into the sheets, gripping them, as he showered her with lavish attention.  He wasn't bad. In fact, the sweet sensations radiating through her were telling her that he was very good, so very, very good.",
  "genres": [],
  "author": "Carmen Faye",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/22821043-rogue-stallion"
}