{
  "title": "Encontrada: À espera do felizes para sempre",
  "description": "Encontrada: à espera do felizes para sempre é a continuação de Perdida, grande sucesso de Carina Rissi, com mais de 100 mil exemplares vendidos, hit entre leitoras de todas as idades, best-seller até na Alemanha.Neste segundo volume da série Perdida, Sofia está de volta ao século dezenove e mais que animada para começar a viver o seu final feliz ao lado de Ian Clarke. Ela conta com a ajuda de sua cunhada, Elisa, para aprontar os preparativos de seu casamento, para que tudo saia dentro dos costumes da época, ou pelo menos quase tudo. Afinal a tradição local é que a cerimônia seja celebrada em Latim, lingua que Sofia não está nem perto de dominar.Esse é só um dos desafios que Sofia precisará enfrentar, tudo indica que se tornar a sra. Clarke não vai ser tão simples quanto ela imaginava. As confusões encontram a garota antes mesmo de ela chegar ao altar - e uma tia intrometida que quer atrapalhar o relacionamento é apenas mais uma delas.Com a sua viagem de lua de mel cancelada, Sofia percebe que coisas estranhas estão acontecendo na vila e Ian parece estar enfrentando alguns problemas que prefere não dividir com a noiva.Decidida, Sofia fará o que estiver ao seu alcance para ajudar o homem que ama. Ela não está disposta a permitir que nada nem ninguém atrapalhe seu futuro. Porém suas ações podem pôr tudo a perder, e Sofia descobre que a única pessoa que pode de destruir seu felizes para sempre é ela própria.Capaz de encantar os fãs de Jane Austen, Encontrada: à espera do felizes para sempre é um romance adorável. Carina Rissi traz de volta o mundo apaixonante de Ian e Sofia, nos permitindo mergulhar mais uma vez nessa maluca e envolvente história de amor.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Time Travel",
    "New Adult",
    "Fantasy",
    "Chick Lit",
    "Historical"
  ],
  "author": "Carina Rissi",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/22823805-encontrada"
}