{
  "title": "Pixelated",
  "description": "Senior Year. Middle of nowhere. What's the new girl to do? For Piper Marks, the answer is simple. She's determined to have her photography rock the cover of National Geographic someday, and moving to Clarkton, Iowa for her last year of high school is not going to stop her. Even if her usual subjects have changed from bright lights and skyscrapers to fields, cows…and more fields. But when photographer at the local paper quits in a huff, she steps into his spot. Her new job keeps Piper busy capturing tackles, and zooming in on first downs and end zone dances, not to mention putting her directly in the path of varsity football star Les Williams IV. Her new friends warn her off, but she can't resist the pull she feels toward this mysterious country boy. But this small town is keeping a secret, and it's one that could destroy any chance they have to be together. It's up to Piper to decide what to do with the distorted truth. Can she risk exposing her heart? It might be worth it, 'cause Les is about to change her world from black and white to fully saturated color. Praise for \"In Pixelated, L.S. Murphy weaves a complex web of secrets and lies with a 'will they or won't they' romance that kept me turning pages and holding my breath!\" ~ Julie Reece, author of The Artisans and Crux \"Beautifully written, with a full spectrum of emotion and complex characters, Pixelated will tug at all your heartstrings. I easily lost myself in the world L.S. Murphy created and couldn't stop reading because I needed to see how the story ended.\" ~ Kelly Oram, author of Cinder & Ella \"L.S. Murphy brings something for every reader with romance, secrets, mystery, and a main character torn between two choices. Murphy's writing is sharp and steeped in emotions, deftly hooking her readers from the first sentence to the last.\" ~ Sarah Bromley, author of A Murder Of Magpies",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Romance",
    "Teen",
    "Realistic Fiction"
  ],
  "author": "L.S. Murphy",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/22820534-pixelated"
}