{
  "title": "Great Caesar's Ghost",
  "description": "Maximillian DuPont, son of an American archaeologist and an art historian on the curatorial staff of the Metropolitan Museum in New York, heads to Paris, London and Rome. Recently jilted by his fiancé at Cal Berkeley, he strikes off on an antiquities buying tour. Tired of the night life, dating scene, and loneliness of his world in New York, Max finds focus in a recent find…an outstanding collection of the personal possessions of Gaius Julius Caesar, only recently discovered. Examining the priceless objects, Max sets off a chain of events which unlocks an ability to connect with any of Caesar’s blood ties throughout time, leading him back to Caesar himself.  Experimenting with his new found ability to time travel, Max amasses a fortune through stock purchases, becoming an overnight multi-millionaire. Complications arise when he meets Sally, a woman who shares his interests and passions; the unhappily married thoroughbred wife of a New York entertainment lawyer in 1955. More than ten years his elder, a bright, beautiful socialite, she clings to Max, who can’t help but empathize with a soul mate who lives her life as a society ornament.  In 1937, Sarah Goldsmith, beautiful and brilliant daughter of a German Jewish antiquarian, fights the prejudice of her times in pre-World War Two America, guarding her chastity, and concentrating her spirit and energy on her studies and her equestrian abilities. Lost in a world of nineteenth century romance novels, harassed by her neighbors, she fights the horrors of her times to complete her education and get away to New York City, a place where being Jewish has little stigma and where she might finally meet a companion who sees her for who she is.  This is a story of time travel, of places past and present, of historical figures and events, visited and observed by an art historian whose life pans between New York and Rome. The second book in a series, but a stand-alone novel, this book will take the reader to Paris, London, Rome, Berkeley, New York, and the North Atlantic as it wends its way through the fabric of time. Join the hero and heroine through their challenges and personal growth as they experience the turbulent times of the last century and Max sets his sights on his ultimate goal…meeting Caesar.",
  "genres": [
    "Romance"
  ],
  "author": "Rebecca Branch",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/22822113-great-caesar-s-ghost"
}