{
  "title": "Waking Up to the Dark: Ancient Wisdom for a Sleepless Age",
  "description": "In the tradition of Thomas Merton’s spiritual classic The Seven Storey Mountain or Thomas Moore’s Care of the Soul, Waking Up to the Dark is a deeply resonant and personal project—a modern gospel that is an investigation of the relationship between darkness and the soul. The darkness Clark Strand is talking about here is the darkness of the nighttime, of a world before electricity, when there was a rhythm to life that followed the sun’s rising and setting. Strand here offers penetrating insight into the spiritual enrichment that can be found when we pull the plug on our billion-watt culture. He argues that the insomnia so many of us experience as “the Hour of the Wolf” is really “the Hour of God”—a wellspring of rest and renewal, and an ancient reservoir of ancestral wisdom and inspiration. And in a powerful yet surprising turn, he shares with us an urgent message for the world, received through a mysterious young woman, about the changes we all know are coming. Waking Up to the Dark is a book for those of us who awaken in the night and don’t know why we can’t get back to sleep, and a book for those of us who have grown uncomfortable in real darkness—which we so rarely experience these days, since our first impulse is always to turn on the light. Most of all, it is a book for those of us who wonder about our When the lights are always on, when there is always noise around us, do our souls have the nourishment they need in which to grow? Praise for Waking Up to the Dark “A celebration of the life-enriching—indeed, indispensable—properties of the night . . . Strand delivers a significant amount of experiential melding to existential thoughtfulness in this book about the sublime and elemental powers of the dark. . . . An exigent, affecting summons to rediscover the night.” — Kirkus Reviews“This book is small in size and mighty in spirit. It is at once a clarion call and a meditation. Sonorous, deep, soul-stirring, and profoundly comforting, Waking Up to the Dark is a rare book that will be pressed from one hand to the next with the urgent, whispered You must read this .” —Dani Shapiro, author of Devotion “In a modern world flooded with artificial light, Clark Strand reminds us what we have left behind in the dark. This beautiful, haunting meditation is filled with surprises and lost knowledge. Read it by candlelight—you will never forget it.” —Mitch Horowitz, author of Occult America and One Simple Idea “In this exhilaratingly original work, Clark Strand shows us that the key to enlightenment lies where we don’t want to look. It is hidden in plain sight, but we have to turn the lights off to find it.” —Mark Epstein, M.D., author of Going to Pieces Without Falling Apart  and The Trauma of Everyday Life “Breathtaking and revolutionary, a small masterpiece for a world that has grown uncomfortable with the darkness and a poignant plea to take back the dark as the Hour of God, as the great friend of faith, awakening, and soul nourishment.” —Gail Straub, co-founder of Empowerment Institute and author of Returning to My Mother’s House “Wonder, solitude, quiet, intimacy, the holy—darkness holds these treasures and more. If we want to connect with God, argues Strand in this wise and compassionate book, we will ‘awaken to the dark.’ ” —Paul Bogard, author of The End of Night",
  "genres": [
    "Nonfiction",
    "Spirituality",
    "Philosophy",
    "Religion",
    "Nature",
    "Health",
    "History"
  ],
  "author": "Clark Strand",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/22822888-waking-up-to-the-dark"
}