{
  "title": "Engaging Buddhism: Why It Matters to Philosophy",
  "description": "This is a book for scholars of Western philosophy who wish to engage with Buddhist philosophy, or who simply want to extend their philosophical horizons. It is also a book for scholars of Buddhist studies who want to see how Buddhist theory articulates with contemporary philosophy. Engaging Buddhism: Why it Matters to Philosophy articulates the basic metaphysical framework common to Buddhist traditions. It then explores questions in metaphysics, the philosophy of mind, phenomenology, epistemology, the philosophy of language and ethics as they are raised and addressed in a variety of Asian Buddhist traditions. In each case the focus is on philosophical problems; in each case the connections between Buddhist and contemporary Western debates are addressed, as are the distinctive contributions that the Buddhist tradition can make to Western discussions. Engaging Buddhism is not an introduction to Buddhist philosophy, but an engagement with it, and an argument for the importance ofthat engagement. It does not pretend to comprehensiveness, but it does address a wide range of Buddhist traditions, emphasizing the heterogeneity and the richness of those traditions. The book concludes with methodological reflections on how to prosecute dialogue between Buddhist and Western traditions.\"Garfield has a unique talent for rendering abstruse philosophical concepts in ways that make them easy to grasp. This is an important book, one that can profitably be read by scholars of Western and non-Western philosophy, including specialists in Buddhist philosophy. This is in my estimation the most important work on Buddhist philosophy in recent memory. It covers a wide range of topics and provides perhaps the clearest analysis of some core Buddhist ideas to date. This is landmark work. I think it's the best cross-cultural analysis of the relevance of Buddhist thought for contemporary philosophy in the present literature.\"-C. John Powers, Professor, School of Culture, History & Language, Australian National University",
  "genres": [
    "Philosophy",
    "Buddhism",
    "Nonfiction",
    "Religion",
    "Spirituality",
    "Asia",
    "Eastern Philosophy"
  ],
  "author": "Jay L. Garfield",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/22826414-engaging-buddhism"
}