{
  "title": "The Burying Ground: A Thaddeus Lewis Mystery",
  "description": "Someone is digging up the graves at the Strangers’ Burying Ground in Toronto — the final resting place of criminals, vagrants, indigents, and alcoholics — and the only person who seems to care is the sexton, Morgan Spicer. The authorities are unconcerned; after all, for years the growing village of Yorkville has been clamouring to have the bodies moved and the Burying Ground closed.0202Thaddeus reunites with an old friend in less-than-cheerful circumstances to catch a grave robber who is preying on a vagrants' cemetery and stealing more than bodies. The two soon find themselves entangled in a mystery that stretches back to the typhus epidemic of 1847, and the legacy of a scandal many would prefer left buried.1302Janet Kellough is a performance storyteller who has written and appeared in numerous stage productions featuring a fusion of spoken word and music. Her previous books in the Thaddeus Lewis series are  On the Head of a Pin, Sowing Poison, and 47 Sorrows. She lives in Prince Edward County, Ontario.0802This is an engaging historical mystery. The author gets the period detail just right, but she never lets her research overshadow the story, never yanking the reader out of the action with an unwieldy chunk of historical exposition. Fans of Chesterton's Father Brown or of Anne Perry and others who set their mysteries in Victorian England will find this Canadian variation much to their liking. Booklist0802Kellough weaves a tale that is almost as much a history lesson as it is a thrill ride.Publisher Weekly0802Love the Murdoch Mysteries? Then you need to discover Janet Kellough's terrific Toronto series set in 1851 and featuring preacher.detective Thaddeus Lewis.Globe and Mail99CA0403069781459724709.jpg2014112102http://www.dundurn.com/books/burying_... Distribution02Y20400111.99CAD017.99GBP0111.99USDIngram Publisher Services02Y20400111.99CAD017.99GBP0111.99USDIngram Publisher Services05US04010020150804",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Canada",
    "Fiction",
    "Historical",
    "Historical Mystery"
  ],
  "author": "Janet Kellough",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/22833175-the-burying-ground"
}