{
  "title": "Kissing Frogs",
  "description": "Popular party girl and high school senior Jessica Scott has a secret: she used to be a nerd — a big one; a goody two-shoes, grade-skipping, all-state spelling bee champ. But she lost the braces, put on some contacts, and applied all her academic genius to studying and imitating the social elite. Now she rules the school from the upper echelon of the high school realm. With her cool new friends and hottest-guy-in-school boyfriend, life’s a beach — and that’s where she’s headed for Spring Break. That is, until her teacher breaks the bad news that she’s failing Biology — and her only chance to make up the grade is to throw away the culminating trip of her hard-earned popularity and join the Conservation Club in Panama to save the Golden Frog.Unable to let go of her faded college dreams, Jess finds herself in a foreign country with a new social crew, and one handsome face that stands out as a blast from the past, threatening to ruin her queen bee reputation. Travis Henley may have grown up, but he still likes to play childish games and as payment for retrieving Jess’ lost ring from the bottom of a jungle pool, he wants three dates. While Jess does battle with spiders, snakes, wildfires and smart mean girls, she desperately tries to hang on to the last vestiges of her popular existence like the Golden Frog from its webbed toe. But as she starts to care about something more than tanning and texting – a species on the verge of disappearing forever – she may realize the worth of her inner nerd, and the one frog in particular that could be her prince in disguise.Set in the lush and tropical El Valle de Anton, this modern fairytale re-imagining of “The Frog Prince” is toe-curling contemporary romance with an environmentalist heartbeat, in the tradition of Stephanie Perkins.",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Romance",
    "Retellings",
    "Fairy Tales"
  ],
  "author": "Alisha Sevigny",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/22836302-kissing-frogs"
}