{
  "title": "Joy: Poet, Seeker, and the Woman Who Captivated C. S. Lewis",
  "description": "“A lush Narnia tale for grownups”: The first comprehensive biography of the rebel thinker who married C. S. Lewis (Megan Marshall, Pulitzer Prize winner).   If Joy Davidman is known at all, it’s as the wife of C. S. Lewis, author of The Chronicles of Narnia. On her own, she was a poet and radical, a contributor to the communist journal New Masses, and an active member of New York literary circles of the 1930s and ’40s. Growing up in a family of Jewish immigrants in the Bronx, she became an atheist, then a practitioner of Dianetics, and finally a Christian convert after experiencing a moment of transcendent grace. She was also a mother, a novelist, a screenwriter, and an intelligent, difficult, and determined woman. In 1952 she set off for England to pursue C. S. Lewis, the man she considered her spiritual guide and her intellectual mentor. Out of a deep friendship grounded in faith, poetry, and a passion for writing grew a timeless love story, and an unforgettable marriage of equals—one that would be immortalized in the film Shadowlands and Lewis’s memoir, A Grief Observed. “Plumbing the depths of unpublished documents, Santamaria reveals the vision and writing of a young woman whose coming of age in the turbulent thirties is both distinctive and emblematic of her time” (Susan Hertog, author of Anne Morrow Her Life). Finally, Joy Davidman is brought out of her husband’s shadow to secure a place in literary history that is both a long-time coming and well-deserved.   “This book gives Davidman her life back. . . . Ms. Santamaria succeeds in de-mythologizing Davidman’s story.” —The Wall Street Journal   “Compelling . . . clear, unsentimental.” — The New York Times Book Review",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Christian",
    "Religion",
    "Christianity",
    "Biography Memoir"
  ],
  "author": "Abigail Santamaria",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/22827639-joy"
}