{
  "title": "Writing a Novel with Scrivener",
  "description": "The writing and story development program Scrivener is taking the world by storm. Here the bestselling author David Hewson, creator of the successful Nic Costa series, offers a personal, highly-focussed guide to using this powerful application to create a novel, now newly-updated to cover the brand new release version for Windows.Hewson, a Scrivener user for years who's written five of his popular novels in the app, takes users through the basic processes of structuring a full-length novel, writing and developing the story, then delivering it either as a manuscript for an agent or publisher or as an ebook direct to Kindle or iBook.Alongside the practical advice, he offers a working novelist's insight into the process of writing popular fiction. And this book is, of course, created entirely within Scrivener itself, from development through to publication on Kindle, a process followed in detail in the book. Please read the reviews to see what users think of this unique book, produced entirely from within Scrivener itself.PRAISE FOR DAVID HEWSON'S NOVELSThe Fallen Angel, book nine in the Costa seriesThe Washington Post says, ‘…perhaps his finest novel. It’s hard to see how the author could have made his dark tale more fascinating, entertaining and yet entirely serious than he has.’The New York Times, ‘Mr. Hewson’s crime novel, the ninth in a series, is like a satisfying “Law & Order” episode set in modern-day Rome… the ending is the rich tiramisu we’ve waited for.’Bookreporter, ‘I cannot imagine anyone picking up a book authored by David Hewson and not falling in love with the subject matter within the first 50 pages or so. The Fallen Angel, his latest and arguably best work, continues the practice while upping his own ante by a notch or three.’Jeffery Deaver...Hewson is a daunting talent — a writer who is a master stylist.Steve Berry...David Hewson is one of the finest thriller writers working today. A born stylist.Lee Child...(Dante's Numbers)...is easily the best yet in a really terrific series.Peter James...Hewson is one of our finest crime writers. Absorbing, intelligent, and with a staggeringly vivid sense of place.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference",
    "How To",
    "Self Help"
  ],
  "author": "David Hewson",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/11359184-writing-a-novel-with-scrivener"
}