{
  "title": "Jaran",
  "description": "A woman seeks her destiny among a clan of nomadic warriors trapped in interstellar intrigue.In the past, humans were the dominant star-traveling species in the universe—until the Chapalil came, conquered, and absorbed the Earth into their intergalactic empire. One of the only humans ever granted nobility by the Chapalil, Charles Soerenson once led a failed rebellion against the alien overlords. Now his sister, Terese, has abandoned her homeworld, impelled by a broken heart to seek a new life among the worlds her brother rules. On Rhui, a planet off-limits to interstellar voyagers, Tess inadvertently stumbles upon a dangerous Chapalil conspiracy—and only the timely arrival of the Jaran saves her from near-certain death in the wilderness. A tribe of nomadic humans roaming the plains of Rhui, the Jaran have long forgotten their ancient Earth history and heritage. Intrigued by their world and their ways, Tess shares an immediate emotional connection with Ilya, the Jaran’s brilliant, charismatic leader, a man of extraordinary passion and vision. But despite her growing loyalties to this proud chieftain and his people, Tess must take care. For Ilya’s ambitions threaten to trigger violent planetary upheaval. And the Jaran have been chosen to play an unwitting role in a plot that could have powerful repercussions far beyond the nomads’ volatile world. The first book in Kate Elliott’s acclaimed Novels of the Jaran, this masterful science fiction classic combines rich characterization and world-building with adventure, intrigue, and romance. It is both a magnificent introduction to a compelling universe and a stellar standalone reading experience.Jaran is the first volume of the Novels of the Jaran, which continues with An Earthly Crown, His Conquering Sword, and The Law of Becoming",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Romance",
    "Fiction",
    "Science Fiction Fantasy",
    "Space Opera",
    "Aliens"
  ],
  "author": "Kate Elliott",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/228337.Jaran"
}