{
  "title": "Haunted: Tales of the Grotesque",
  "description": "Novelist, poet, dramatist and author of many of the best American short stories of our time, Joyce Carol Oates shows yet another aspect of her unbounded creativity in these tales of the grotesque. Haunted, a collection of sixteen tales that range from classic ghost stories to portrayals of chilling psychological terror, raises the genre to the level of fine literature - complex, multi-layered, and gripping fiction that is very scary indeed. In the title story, \"Haunted, \" the pubescent Melissa and her best friend, the sexually precocious Mary Lou, ignore \"no trespassing\" signs to explore forbidden houses. But the deserted Minton farm is one place where they should not have gone, and years later Melissa is tormented by her memories of its malevolence...and the murder of Mary Lou. In the novella, \"The Model, \" a sexual threat seems to underlie the interaction between young Sybil Blake and \"Mr. Starr, \" who asks her to be his model, but the truth about her own identity, and his, shows that the danger is lurking in a different part of the heart. The \"Accursed Inhabitants of the House of Bly, \" a macabre reworking of Henry James's \"The Turn of the Screw, \" resurrects the evil of Miss Jessel and Quint, who are up to their old tricks with the children, Miles and Flora, but with new, perverse, and brilliant revelations. The tales in this collection plunge the reader into nightmare worlds where violence slips in unexpectedly, where reality turns into a funhouse mirror, and where American culture goes awry in shocking, provocative ways. Joyce Carol Oates is a master storyteller of the dark side. She writes with skillfully controlled prose, tightly woven plots, and deep psychological insight that m her fictional horror worthy to set alongside the stories of Edgar Allan Poe - and far above all the rest.Haunted --The doll --The bingo master --The white cat --The model --Extenuating circumstances --Don't you trust me --The guilty party --The premonition --Phase change --Poor Bibi --Thanksgiving --Blind --The radio astronomer --Accursed inhabitants of the House of Bly --Martyrdom",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Gothic",
    "Anthologies",
    "Short Story Collection",
    "20th Century"
  ],
  "author": "Joyce Carol Oates",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/228336.Haunted"
}