{
  "title": "Consorting With Dragons",
  "description": "Lord Jasen of Grumhul has a gambling problem. Or rather, his father has the problem, but since he's gambled away everything that was rightfully Jasen's, it's become his problem, too. With no money and no skills to earn a living, his best bet for getting away from his father is to present himself for marriage at Court in the Draelands, the kingdom at the center of the Allied Realms. Jasen's courtly manners aren't the most refined (to say the least), but he hopes he's still capable of attracting at least a minor lord.He isn't looking to cause a scandal, but that's exactly what happens when he immediately attracts the attention of both a powerful dragon and King Rilvor himself. The King serves as the mystical link between the magic of the dragons and humankind; since the death of his wife two years before, magic in the Allied Realms has suffered. He must take a spouse this year, and the fight for his favor has gotten downright vicious.No one, including Jasen himself, thinks he's a proper match for the king. But the growing affection between them can't be denied. Jasen loves Rilvor, but he's petrified about becoming lord consort to a king. Unfortunately, the two can't be separated, and Jasen must decide if true love is worth all the trouble. Consorting With Dragons has been nominated for three awards at the M/M Romance Group's 2014 Member's Choice Awards:Best DebutBest FantasyBest Love's Landscapes StoryThis story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Dragons",
    "Romance",
    "Magic",
    "LGBT",
    "Audiobook"
  ],
  "author": "Sera Trevor",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/22826002-consorting-with-dragons"
}