{
  "title": "Organized for Homicide",
  "description": "Organization expert Kate McKenzie is looking forward to her newest organize the cross-country move for a divorced father and his two children. But when a dead body turns up, Kate's carefully organized plans are thrown into chaos. Was it an accident? Or murder? Kate aims to find out and ends up falling more emotionally involved than she'd expected when the victim's teenaged daughter becomes the police's lead suspect. As a mother herself, she just can't let the girl not only lose a mother but possibly lose her freedom and future as well. While the police follow the chain of evidence, Kate follows her gut, leading her on a dangerous investigation that could result in more than one death if she doesn't watch her step... Organized Organized for Murder (book#1) Organized for Homicide (book #2)  What critics are  \"Organized for Murder is a very enjoyable first in a new series. Ritter Ames really hit it out the park with this debut, and with her organizational tips included (throughout the book and at the end), I know this is one book I will be hanging onto. If you haven’t discovered this series yet, I highly recommend picking it up.\" ~ Cozy Mystery Book Reviews  \"Ritter Ames keeps ratcheting the suspense until I started skipping sentences just to find out who murdered Amelia and another woman. It was thoroughly enjoyable with well-developed, 3-dimensional characters.\" ~ BookTalk with Eileen  \"The characters are well written and stay true to who they are from the beginning to end of the book, and they feel real as if you could meet the in real life.\" ~ Hiding from My Kids  \"Organized for Murder by Ritter Ames is the first in a new cozy mystery series, Organized Mysteries. This is a quality cozy mystery. The story is well-written and the mystery kept me guessing. This is a great start to a new series, and one I am looking forward to revisiting. Great characters, fantastic writing, and a clever mystery all combine to make a really wonderful book.\" ~ Brooke Blogs  \"I am a huge lover of cozy mysteries, and this by far is one of my favorites. I loved the premise of the main character Kate being an organizer and I loved all the organizational tips that I picked up throughout the story.\" ~ Doctor’s Notes  \"The plot was well paced and I enjoyed the way Kate followed the clues in a very organized fashion. The author added some great twists, I was surprised by the actual murderer. I enjoyed all the organizational tips that started each chapter. Several will be introduced into my own household.\" ~ Escape with Dollycas into a Good Book \"If you enjoy cozy type mysteries, I think you'll enjoy this light fast read.\" ~ Murder Most Cozy",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Cozy"
  ],
  "author": "Ritter Ames",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/22835757-organized-for-homicide"
}