{
  "title": "A Brief Moment In Time",
  "description": "The first in a three book series of short story collections that focuses on that moment when everything changes. A truth to tall tales, the vision of a child, the inescapable dark room of the mind, death's journey, religious loss, truth of oneself, a blind journey to know oneself. The over arching theme of this collection of stories is something that is hard to bring oneself to do, it can be a very scary prospect: self discovery. It's something we all must face now, in the future, or beyond. A Brief Moment In Time contains nine short stories of one life shattering decision, a moment when everything changes: Brother Eagle/Sister Wolf, Into The Woods, Approaching Rebirth, From His Efforts Come, An Angel's Kiss, The Goode Student, Good Teachings, Arahant, and A Brief Moment In Time. A set of stories designed to make the reader contemplate what and when that defining moment might be. But don't worry an angel's kissing you. The Stories: Brother Eagle/Sister Wolf: Melvin has a story to tell. Everyone who had stayed to listen to Melvin’s stories has never been seen again. Dexter doesn't believe in the stories he hears. But Dexter is about to discover the truth behind tall tales. Into the Woods: When Valoosh was a child he had a vision. In his vision he saw the sky caves descend upon the world and release their virus. Now that he is older and the leader of his people it is up to him to save the Great Mother. Approaching Rebirth: Vidor is locked in a dark inescapable room. From His Efforts Come: Twins separated at birth, one a God King, the other of no importance. Who is worth saving? An Angel’s Kiss: “Don’t worry lady an angel’s kissing you,” So starts Kellie’s death journey to self discovery. In order for Kellie to move-on she must first face the circumstances that brought her to death’s door. The Goode Student: Michelle, a devote student of the Bible, a teacher who cares deeply for her students, a woman who sees the dangers of the world and doesn't hesitate to face them. The White Pacer Man has struck fear in the hearts of the city. Michelle wants to keep her students safe and free from harm. But when one is found dead and another disappears, Michelle, blinded by her pious views of the world and how she feels things should be, loses her religion and takes matters into her hands. Good Teachings: Nicolas learns about his true nature the hard way. In the end, he realizes he enjoys it very much. Arahant: Blind since was child, Soon-kim deals with the pain of the past through a visible future. A Brief Moment In Time: Sutepmi knows who he is. He is a Timewalker, warriors who maintain the time stream. But when he goes home, he finds he is not who he thought.",
  "genres": [],
  "author": "T.W.   Spencer",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/22835867-a-brief-moment-in-time"
}