{
  "title": "The Bastiat Collection",
  "description": "In two volumes, here is The Bastiat Collection, the main corpus of his writings in English in a restored and elegant translation that includes some of the most powerful defenses of free markets ever written. This restoration project has yielded a collection to treasure. After years of hard work and preparation, we can only report that it is an emotionally thrilling moment to finally offer to the general public. Claude Frédéric Bastiat was an economist and publicist of breathtaking intellectual energy and massive historical influence. He was born in Bayonne, France on June 29th, 1801. After the middle-class Revolution of 1830, Bastiat became politically active and was elected Justice of the Peace in 1831 and to the Council General (county-level assembly) in 1832. He was elected to the national legislative assembly after the French Revolution of 1848. Bastiat was inspired by and routinely corresponded with Richard Cobden and the English Anti-Corn Law League and worked with free-trade associations in France. Bastiat wrote sporadically starting in the 1830s, but in 1844 he launched his amazing publishing career when an article on the effects of protectionism on the French and English people was published in the Journal des Economistes which was held to critical acclaim. The bulk of his remarkable writing career that so inspired the early generation of English translators and so many more is contained in this collection. If we were to take the greatest economists from all ages and judge them on the basis of their theoretical rigor, their influence on economic education, and their impact in support of the free-market economy, then Frédéric Bastiat would be at the top of the list. These volumes bring together his greatest works and represents the early generation of English translations. These translators were like Bastiat himself, people from the private sector who had a love of knowledge and truth and who altered their careers to vigorously pursue intellectual ventures, scholarly publishing, and advocacy of free trade. The collection consists of three sections, the first of which contains his best-known essays. In That Which is Seen, and That Which is Not Seen, Bastiat equips the reader to become an economist in the first paragraph and then presents the story of the broken window where a hoodlum is thought to create jobs and prosperity by breaking windows. Bastiat solves the quandary of prosperity via destruction by noting that while the apparent prosperity is seen, what is unseen is that which would have been produced had the windows not been broken. The second section is Bastiat s Economic Sophisms, a collection of 35 articles on the errors of protectionism broadly conceived. Here Bastiat shows his mastery of the methods of argumentation using basic logic and taking arguments to their logical extreme to demonstrate and ridicule them as obvious fallacies. In his Negative Railroad Bastiat argues that if an artificial break in a railroad causes prosperity by creating jobs for boatmen, porters, and hotel owners, then there should be not one break, but many, and indeed the railroad should be just a series of breaks a negative railroad. The third section is Bastiat s Economic Harmonies which was hastily written before his death in 1850 and is considered incomplete. Here he demonstrates that the interests of everyone in society are in harmony to the extent that property rights are respected. Because there are no inherent conflicts in the market, government intervention is unnecessary. Here we find a powerful but sadly neglected defense of the main thesis of old-style that society and economy are capable of self-managing. Unless this insight is understood and absorbed, a person can never really come to grips with the main meaning of liberty.",
  "genres": [
    "Economics",
    "Philosophy",
    "Politics",
    "Nonfiction",
    "History",
    "Classics",
    "Political Science"
  ],
  "author": "Frédéric Bastiat",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/2283440.The_Bastiat_Collection"
}