{
  "title": "The Elysian",
  "description": "Faith has no idea why she seems immortal, never aging, never dying. All other aspects of her existence are human enough, even the numerous heartbreaks she’s endured during her millennia spent on Earth. Her first mate, her immortal counterpart, Gabriel, vanished, leaving her alone and stranded. We join Faith in the year, twenty twelve, immediately following the death of her fourteenth husband. Her epic journey through time continues as she finds new lovers and new loves and is momentarily trapped in a dimensional time warp near a Fae Sithen in Iceland. Some of her repressed memories begin to surface and she remembers bits and pieces from her first existence on the planet, Elysia. She has few supernatural abilities apart from recognizing other sentient or alien souls and her magical hair that has a mind of its own. She struggles with depression and abandonment as she continues on, forcing herself to dwell in the now. Her need for activity and companionship sends her on a mission to buy a horse, and it is then that she meets Iain. Will Iain prove her undoing? Will the alien mercenary, trapped after his vessel crashed, become her protector and lover, or will he hand her over to the ones that seek to acquire and own; A child of the sunlit hair? Faith’s life is full of steamy, erotic, passionate, sometimes rough sex. Faith of Elysia is a passionate alien female, genetically modified to appear and test as entirely human. She is now on a new mission; one of her making. She seeks to find herself, and to fulfill her ache to belong to a worthy male; A dominate male of immense power that requires a softer, submissive female to round off his sharp edges. Faith is this female. Who will be the male she eventually surrenders too? There are explicit words and language. Graphic sex scenes portrayed, adult audience only. This work is approximately a nine to ten hour read. (90,000 words)",
  "genres": [
    "Paranormal"
  ],
  "author": "Payne Hawthorne",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/22839748-the-elysian"
}