{
  "title": "Demons: True stories of demonic possessions & demonic attacks",
  "description": "DEMONS: True Stories of Demonic Possessions & Demonic Attacks. Demons & Deadly Encounters. A Journey into the ultimate Heart of Darkness.  Excerpts; ‘It’s the middle of the night and he thinks he’s been asleep for a while but he’s wide awake now. Something is pushing down on his chest, hard. He’s fighting to breathe and he tries to move, to get it off him, but his body won’t move. He’s paralysed and filled with panic. He tries to scream but nothing comes out...’ ‘They told her they were going to kill her and she didn't have a chance; they were too many...’ ‘Stood in the hall was a dark figure. The presence was finally showing itself to me...’ ‘The children’s eyes were rolling in their heads, blood pouring from their ears and mouths, talking in strange languages, and being thrown involuntarily across rooms...’ ‘Marks appeared on the neck of our three year old son. They were purple. They looked like strangulation marks.’  ‘Her eyes, which had moments before looked lacklustre and vacant, suddenly blazed with inhuman light.'  ‘As the Doctor looked down at the blood in the bowl, he saw it swirling around in a most unnatural way, before rearing up in a solid column and leaping out of the bowl on to the floor. At this point the bowl shattered into a hundred pieces. The doctor fled in terror.’ ‘There are practitioners who have attempted to summon demons, and have been found with every bone in their body broken the next day.’ “I wake to see a tall, dark, hooded figure, standing still, right by my bed; his face covered by his hood, but watching me. I know he was real; I could hear his breathing...” “Her eyes rolled in the back of her head, her face contorted and she would tell him ‘they’ were going to kill her, that she belonged to Satan. It was a deep man’s voice that came out of her. The voice said, “We can kill her at any time we want...” “I’d lie in bed and feel someone’s arms around me. It wasn’t a safe feeling but a menacing one, as if someone was showing me that I belonged to them.” ‘According to the police report, one of the women had killed herself after she’d told friends she’d been hearing a voice that kept telling her to kill herself.’ “A creature appeared in the room, its eyes were glowing red. This creature was physical; at least after it had entered into our reality. It was naked, no hair, extremely muscular. I estimate his height about six foot five but his bone structure was bigger than in a human. His mouth was huge. There was no way to describe it other than as a demon.” \"It was just supposed to be fun; we were asking it questions, and then it asked if it could visit us, so I said yes, thinking it was one of the children doing it; but it wasn’t one of the kids. And that’s when the horror started...”  ‘Suddenly it was like a stake pierced my chest and gradually, I felt the sensation of it pulling open my ribs. I thought I would die...’ “I saw a boy sat at a table. He called me over to him and started talking to me. He spoke as if he knew all my thoughts. He finished my sentences for me. He promised me everything I always wanted. But there was one condition; I give my soul over to Satan.” “As I lay there I would see demons appearing in different forms; the most hideous faces, covered with blood, with sharp teeth and claws.\" “When I opened my eyes there was a black shadowed figure. It loomed over me, then took hold of me. I tried to get out of its grip but its strength was overpowering.",
  "genres": [
    "Horror",
    "Nonfiction",
    "Paranormal"
  ],
  "author": "Stephen Young",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/22838489-demons"
}