{
  "title": "The Harrad Experiment",
  "description": "A new-age \"experiment\" takes place in the 1960s at Harrad College, a privately endowed and liberally run school that admits carefully selected students. This social experiment encourages premarital living arrangements and is totally committed - not mere lip-service or public-relations hype - to getting young men and women to think and act for themselves.What do they think about? Everything that interests the author, Bob Rimmer: human relations, sex, history, philosophy, anatomy, existentialism, art, music, Zen, politics - and, once more, sex.Four Harrad students record their thoughts regularly for four years. Their diaries include large chunks of college \"action,\" conversation, and portraits of fellow students, so the reader is swept into the lives of these young adults trying to sort out the jumbled mores of America's Sixties.Stanley Kolasukas, a bright, good-looking youth from a poor Polish family finds himself a roommate of Sheila Grove, the introspective daughter of an oil millionaire. Harry Schacht, a brilliant but ungainly medical student from an Orthodox Jewish background, lives with Beth Hillyer, a girl with enough drive to be a better doctor and enough sensuality to need many men in her life. Jack Dawes, imaginative and enthusiastic, lives with Valerie Latrobe, a dominant girl who believes she can better any man at anything.The original Harrad Experiment sold more than three million copies. This 25th anniversary edition includes a new epilogue describing the startling \"Harrad/Premar Solution,\" a fully up-to-date and annotated bibliography of books that support the daring, joyfully subversive premises outlined in Harrad, and Robert Rimmer's candid, controversial autobiography. When you have read this book, you will find yourself entertaining the question of whether a real-life Harrad Experiment could - or should - be going on somewhere today, turning out a very special group of young men and women with the potential to utterly change America's ways of living, thinking, and loving in the 21st century.",
  "genres": [
    "Fiction",
    "Psychology",
    "Polyamory",
    "Contemporary",
    "Erotica",
    "Sexuality",
    "Novels"
  ],
  "author": "Robert H. Rimmer",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/228376.The_Harrad_Experiment"
}