{
  "title": "Gone Crazy in Alabama",
  "description": "The Coretta Scott King Award–winning  Gone Crazy in Alabama  by Newbery Honor and  New York Times  bestselling author Rita Williams-Garcia tells the story of the Gaither sisters as they travel from the streets of Brooklyn to the rural South for the summer of a lifetime.Delphine, Vonetta, and Fern are off to Alabama to visit their grandmother Big Ma and her mother, Ma Charles. Across the way lives Ma Charles’s half sister, Miss Trotter. The two half sisters haven’t spoken in years. As Delphine hears about her family history, she uncovers the surprising truth that’s been keeping the sisters apart. But when tragedy strikes, Delphine discovers that the bonds of family run deeper than she ever knew possible.Powerful and humorous, this companion to the award-winning  One Crazy Summer  and  P.S. Be Eleven  will be enjoyed by fans of the first two books, as well as by readers meeting these memorable sisters for the first time.Readers who enjoy Christopher Paul Curtis's  The Watsons Go to Birmingham  and Jacqueline Woodson’s  Brown Girl Dreaming  will find much to love in   this book. Rita Williams-Garcia's books about   Delphine, Vonetta, and Fern can also be read alongside nonfiction explorations of American history such as Jason Reynolds's and Ibram X. Kendi's books.Each humorous, unforgettable story in this trilogy follows the sisters as they grow up during one of the most tumultuous eras in recent American history, the 1960s. Read the adventures of eleven-year-old Delphine and her younger sisters, Vonetta and Fern, as they visit their kin all over the rapidly changing nation—and as they discover that the bonds of family, and their own strength, run deeper than they ever knew possible.“The Gaither sisters are an irresistible trio. Williams-Garcia excels at conveying defining moments of American society from their point of view .” — Publishers Weekly  (starred review)Coretta Scott King Award winner * ALA Notable Book *  School Library Journal  Best Book of the Year *  Kirkus   Reviews  Best Book of the Year * ALA  Booklist  Editors’ Choice *  Shelf Awareness  Best Book of the Year *  Washington Post  Best Books of the Year *  The   Bulletin of the Center for Children’s   Books  Blue Ribbon Book * Three starred reviews * CCBC Choice * New York Public Library 100 Titles for Reading and Sharing * Amazon Best Book of the Year",
  "genres": [
    "Historical Fiction",
    "Middle Grade",
    "Fiction",
    "Family",
    "Historical",
    "African American",
    "Audiobook"
  ],
  "author": "Rita Williams-Garcia",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/22836574-gone-crazy-in-alabama"
}