{
  "title": "Wolf's Message",
  "description": "\"Wolf's Message is a masterpiece of intrigue. If you have ever wanted to read a book that validates immortality and communication with loved ones who have passed on, then read this book. It is an authentic portal to the other side.\" Caroline Myss, author of Anatomy of the SpiritWhen Mike and Beth Pasakarnis received the news that every parent dreads, their world seemed to crumble around them. Spiritual teacher and evidential medium Suzanne Giesemann knew exactly how they felt. Like Mike and Beth’s son, Wolf, her step-daughter Susan had been struck and killed by a bolt of lightning out of the blue. Until meeting Mike and Beth, Suzanne—a former “by-the-book” Navy commander—had cautiously refrained from using the word “proof” when speaking of the eternal existence of the soul. But no longer. The evidence Mike and Beth shared from their son provided all the proof she needed. Little did Mike, Beth, or Suzanne know that their lives would soon become even more entangled by unexpected visits from Wolf’s spirit. Had Wolf’s presence offered a one-time glimpse across the veil, they might still be pondering the significance of the mystifying clues he left behind. Instead, as Wolf repeatedly made his presence known, Suzanne was able to piece together Wolf’s puzzle and reveal a startling message that has profound spiritual implications for us all. Travel along on Suzanne’s incredible journey as she unravels the web of clues Wolf wove to ensure that his uplifting message of hope and joy is understood by all mankind. \"Part spiritual detective story, part definitive proof of after-death communications from a most extraordinary young man, Wolf’s Message is above all a must-read for those seeking a more balanced, heart-centered way of living.\" Kenneth Ring, Ph.D., author of Lessons from the Light“Wolf’s efforts to communicate with us through Suzanne deserve to be taken seriously and received with gratitude, awe, and celebration.” Gary E. Schwartz, Ph.D., author of The Sacred Promise “Somehow, reading Wolf's Message creates a field into which the reader is incorporated experientially. Reading, learning, and Being are rolled into a synergy that exemplifies the truths of nature and existence as they are revealed. Such authentic interactivity is rarely achieved in this context; a really good book is one in which the author draws the reader in by chronicling notions and events in such a way as to invite and affirm our ability to relate. A really great story dispenses with the dichotomy of author and reader altogether, and the precious anomaly of Wolf's Message is that it behaves more like an Oracle than a Book.” Dr. Barbara E. Fields, Executive Director, Association for Global New Thought",
  "genres": [
    "Spirituality",
    "Metaphysics",
    "Nonfiction",
    "New Age"
  ],
  "author": "Suzanne Giesemann",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/22837802-wolf-s-message"
}