{
  "title": "Mean Girls at Work: How to Stay Professional When Things Get Personal",
  "description": "Do you work with a mean girl?A woman’s field guide to the new frontier of professional development—working with other women Women-to-women relationships in the workplace are…complicated. When they’re good, they’re great. But when they’re bad, they can ruin your day, your week—even your year.Packed with proven advice from two of today’s leading experts in workplace relationships, this one-of-a-kind guide gives women the tools they need to navigate difficult situations unique to women-to-women relationships—whether with a boss, a colleague, a client, or an employee.Have you dealt with a woman in the workplace who:• “Accidentally” excludes you from important meetings?• Seems intent on taking you down professionally?• Gossips about you with other coworkers?• Makes you look bad by missing deadlines?• Forms a “pack” of mean girls to make your life miserable?Mean Girls at Work isn’t just about surviving difficult situations. It’s about transforming a toxic relationship into one that benefits and supports both of you.This audiobook is also for women who engage in mean behavior…but don’t know it. After all, who hasn’t gossiped about a female coworker? Who hasn’t rolled her eyes in the presence of a woman she doesn’t like? Who hasn’t scanned another woman head to toe—which is just a nonverbal way of saying, “You’ve just been judged?” The authors provide invaluable advice to the more subtle ways of being mean—even if they’re not intended.With a workforce composed of a higher percentage of women than ever, workplace dynamics have changed. Crowley and Elster cover every conceivable scenario, providing critical advice on how to rise above the fray and move forward professionally.Mean Girls at Work is your map to dodging the mines and moving forward in today’s transformed workplace.",
  "genres": [
    "Nonfiction",
    "Business",
    "Self Help",
    "Audiobook",
    "Womens"
  ],
  "author": "Katherine Crowley",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/22839141-mean-girls-at-work"
}