{
  "title": "A Far Strange Country: Banquet of Choices",
  "description": "What do; A mother A Father A Viet Nam veteran, partially paralyzed by a drug overdose, His impetuous 18 year old girlfriend and her promiscuous friend, A pair of stoner college professors, A former bombshell starlet, and her cowboy husband, A notorious epileptic Italian actor/director and his young wife bought from a Serbian Gypsy, An enigmatic cult leader who is rumored to be a murderer, A Native American Pentecostal preacher, The Chinese Underground, A goat doctor and a human-flesh eating dog have in common?They all come together, in a Far Strange Country!A Far Strange Country: Banquet of Choices is set against the backdrop of social unrest, the rise of the drug culture, psychedelia, and assassinations. Like postcards from the past, cinematic narratives, and crisp dialog bring elements of 1968 California to life in this tightly-written novel. Five couples of different lifestyles and ages interweave their personal choices together in a world of changing attitudes and ideals.The two-book series takes place in San Francisco, Berkeley, Napa, Los Angeles, Big Sur and the Sierra Nevada foothills of California. Hippies, ranchers, and film stars illustrate the central theme: choices can have consequences, and you reap what you sow.The Author Says:\"It’s much like the movies, On Golden Pond meets Psych-Out. But I was adamant that the novel not be filled with hippie clichés and cheap shots about a time and place of monumental significance that changed our nation forever. I did however want to include California lore and nostalgic bits and pieces that were once familiar but now almost forgotten.”Our Characters:Thrown into the mix are Buck and Pauline Harper a staid couple who are trying to ride out 1968 on their ranch in the Sierra Nevada foothills. A telegram arrives, telling them that their son Steven Harper is in a San Francisco hospital following a heroin drug overdose. They find him in the hospital half paralyzed and barely conscious, and discover that they are grandparents to a three year-old boy whose mother is Steven’s 18 year old girlfriend Shara. Steven and Shara are both struggling to find a place in the sun with or without each other and pulling their little boy Donovan to the edge of despair.At the same time in Los Angeles, Donatello Dragghi an epileptic is lying low to stay out of the line of fire from an organized crime family after messing with the wrong man’s mistress. He is forced to leave Italy where he was a big movie star and director to hide out in America. At the same time, he's slowly going broke and looking for an infusion of cash. The one who takes the brunt of his neglect and abuse is his young wife Slovika who was bought from a Serbian Gypsy in a forced marriage.We have Parker, the pop-culture guru, author who is suspected of murdering a follower to acquire a property in Big Sur, and wears the diamond ring of a man presumed dead. His personal assistant named Gregg, tries to balance his own mundane life with Parker’s cosmic brilliance.And then there's Deborah Donaldson, a 30 year old buxom blond and former beach movie starlet who is now a daytime TV host and her estranged cowboy husband - Bob Morant, a drummer in a popular 60s band. Deborah's spiritual advisor is Parker, and Bob finds Parker's mystic ways and means dubious at best, and does whatever he can to undermine him.Each of our characters has a dream to fight for, and each of them has their debts to pay. They all have individual stories and as they come together they create a story that's new and most unexpected.",
  "genres": [],
  "author": "Arielle Hunter",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/22836531-a-far-strange-country"
}