{
  "title": "Women and Other Monsters",
  "description": "Vampires and the people who want to kill them, African Death Gods that fall in love with slave-owners, Alien scientists who intervene in the humanoid race they're studying, and a woman so bent on revenge that readers will cross their legs and cringe. These are just some of the stories included in Bernard Schaffer's first collection, Women and Other Monsters. ***Vampires are assholes. They're not sparkly, reticent killers yearning for true love. They aren't gothic romantics who read poetry. They aren't even mysterious Romanians who turn into bats and terrorize the countryside. Really, they're just douche bags. - Room ServiceThus begins \"Room Service,\" a dark comedy about a loser named Robbie who lives with his mom and dates a stripper. One night his girlfriend does a \"private\" with a suspiciously pasty customer and is never heard from again. As soon as Robbie figures out his girl was served up as a vampire Slurpee, he's out to exact revenge. Not that he has any clue how do it. But when you have nothing to lose and a bloodsucking freak to get even with, you don't mind improvising. ***Women and Other Monsters is the first collection of short stories by best-selling author Bernard Schaffer. Readers will have plenty more to feast on (nearly as much as Blake the vampire did in the story mentioned above), whether it's a Civil War Era woman too beloved by Death to die, or Ancient Astronauts who are only supposed to observe Earth, but instead tamper with humanity and trigger a history-altering event. Prepare to be seduced, surprised and sometimes horrified at the twists and turns that await as you venture into the darkness with Bernard Schaffer.***Women and Other Monsters is a short story collection recommended for fans of scary short stories, sexy short stories, superhero stories, secret agent short stories, horror stories and more.",
  "genres": [
    "Short Stories",
    "Horror",
    "Thriller",
    "Anthologies"
  ],
  "author": "Bernard Schaffer",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/11359936-women-and-other-monsters"
}