{
  "title": "The Angel of Vengeance - The Most Gruesome Series on the Market",
  "description": "Summary:In a dim lighted cell, a man has awakened to find himself surrounded by the most unimaginable and barbaric things that not even his worst nightmare could conjure up. His captor, Seth Coker, takes the man on a journey into his twisted world of vengeance. A world that runs parallel with the horrors that could only be found in the deepest and darkest parts of hell. A world that bestows a wrath of chaos upon the wicked of our society that have fallen through the cracks of the judicial system. Seth wasn’t born a vigilante, nor did he seek out the role-- it sought him out.  A portion of our society feels that rapists, molesters, murderers and abusers should have rights, and anything beyond the normal punishment of confinement would be cruel and inhumane. Seth knows that the innocent are left without justice, while the wicked are roaming our streets without any remorse about the cruel and inhumane punishment that they bestow upon others. Offering up heart-pumping tales of revenge, suspense and horror in all its guises, this book is filled with dark humor, political incorrectness, gruesome and sadistic acts from beginning to end. Be warned-- this one will compel the meek to crawl into the fetal position and suck their thumb.- Originality –From the sheer ingenuity of the story to the appropriateness of the punishments makes this one of the most original story lines on the market.- Politically Incorrect –If you’re a P.C. type person, do not read this book. This also pertains to rapists, molesters and weirdoes--you'll just get your feelings hurt and leave a low rating with a BS review.- Gruesome and Horrifying –This book is not for the meek. Seth will take you on a journey through his twisted world of vengeance that is filled with the most gruesome and horrifying things imaginable and unimaginable.- Cruel and Unusual –If you like filthy sick, over the top sadistic inhumane acts of revenge that stagger the mind, this book will not disappoint.- Dark Humor –If you like gore and dark humor, this book will make you laugh and gag at the same time.- Suspense –From front to back, The Angel of Vengeance is filled with one intense moment after another that is interwoven in a story line filled with humor. From the horrifying punishments of the mind and flesh to Seth’s unpredictable persona, it will keep you turning the page. - Disturbing –So disturbing that it was difficult for my editor to stomach the content.- Fascinating -The punishments that Seth bestows on deserving criminals are not only very sadistic and gruesome, but cleverly inventive, unusual and shocking as well.- Mind Rape -The sick and twisted images in this book will be implanted into your mind, causing your brain to feel it has been assaulted. A brief comment from the author:One of my readers stated that The Angel of Vengeance was too gruesome, even though numerous warnings are plastered everywhere. They said, “There is gruesome and then there is filthy sick, over the top sadistic inhumane acts that stagger the mind.” My response, “Thanks. I like that description and will be using it.” Their comment was actually a complement even though it wasn’t meant to be. I enjoy writing about sick and twisted shit, especially when it comes to vengeance. And no, I’ve never been raped or molested, and I am just as normal as the next nut job. I think many people have the same kinds of thoughts—maybe not as in depth or sadistic—when it comes to punishing criminals who commit heinous crimes against the innocent. My friends occasionally make the following comment, “If someone harmed my family, I would make them pay by killing them.” That statement always makes me laugh. If you kill someone, they usually don’t know it, so how is that getting them back?I began writing for my own personal enjoyment and never intended to publish a book. Eight years later, The Angel of Vengeance, 172K words, was completed. My second book, The Angel of Death, 195K words, only took six months to complete. My writing style and ideas are not influenced by anyone because I only read nonfiction (Technical stuff mostly). Now that probably sets me apart from other extreme horror writers, and it’s either a good or a bad trait, depending on who you ask. I can at least say that I march to the beat of my own drum.The main ingredients that I strived for when writing The Angel of Vengeance were; pack the book from front to back with the most gruesome and sadistic shit imaginable, be as accurate as possible (things that I could actually do, or at least things I think I can do), only punish assholes that deserve it, don’t be repetitive, and pump it full of dark humor.My book is not politically correct and will definitely cause some resentment, especially from rapists and molesters, or any criminal for that matter. In turn, that’s going to cost me an occasional low rating with a BS review.I welcome anyone that wants to proofread my book(s). Unfortunately, most of us indie authors don't have the means to hire an expensive editing agency like the main stream authors/ publishers use, and some of us rely on friends, family, fans and individuals that charge a reasonable fee. I can read a sentence ten times with a mistake, and my brain plugs in the correct word, even if it’s missing, so I’m useless as a proofreader. I’ve tried to create the best quality read possible, but there are still some errors here and there, and I am continuously correcting them as they are found. This was my first book and learned that it's going to take numerous people to proofread, especially a book of this size. If you’re anal about grammar mistakes, please skip this one until I can get them all corrected. This will save you some frustration and me a bad review.If you like this book, please leave a review. The more positive reviews, the higher it is on Amazon’s search list, resulting in more people finding it. I truly appreciate all of the positive reviews, comments and support that I have been receiving, and that is the reason that I wrote the second book in this series, The Angel of Death, and will continue writing as long as there are people that appreciate my work.If you have any questions, comments or advice, please feel free to contact me at wade.garrett.777@gmail.com.Best wishes,Wade H. Garrett** Sold Exclusively on Amazon **-",
  "genres": [
    "Horror",
    "Splatterpunk",
    "Dark",
    "Adult",
    "Thriller"
  ],
  "author": "Wade H. Garrett",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/22837363-the-angel-of-vengeance---the-most-gruesome-series-on-the-market"
}