{
  "title": "HiT Series Box Set",
  "description": "****CONTAINS VARIOUS VIOLENT AND EXPLICIT SCENES - ONLY RECOMMENDED FOR 18+***For the first time ever in one collection…the entire Anna Brookes saga.Revised July 2014Follow Anna as she evolves from a fifteen-year-old with a special talent to the world’s deadliest assassin, 15. The brand-new finale to the series, HiT to Live, is included in this specially-priced boxed set.HiT 149Anna Brookes is not your typical teenager. Her walls are not adorned with posters of boy bands or movie stars. Instead posters from Glock, Ruger, and Smith & Wesson grace her bedroom. Anna’s mother abandoned her at birth, and her father, St. Cloud Police Chief Henry Brookes, taught her how to shoot and coached her to excellence. On Anna’s fifteenth birthday, unwelcome guests join the celebration, and Anna’s world is never the same. You’ll meet the world’s top assassin, 15, and follow her as she discovers the one hit she’s not sure she can complete – Ben Pearson, the current St. Cloud Police Chief and a man with whom Anna has explosive sexual chemistry. Enter a world of intrigue, power, and treachery as Anna takes on old and new enemies, while falling in love with the one man with whom she can’t have a relationship.Anna Brookes in TrainingFind out what happened to transform the fifteen-year-old Anna Brookes, the Girl with the Golden Aim, into the deadly assassin 15. After her father is killed and her home destroyed, orphan Anna Brookes finds herself homeless in Gulf Breeze, Florida. After she saves Lukas from a deadly attack, he takes her in and begins to train her in the assassin’s craft. Learn how Lukas’s unconventional training hones Anna’s innate skills until she is as deadly as her mentor.HiT for FreedomAnna has decided to break off her steamy affair with Ben Pearson and leave St. Cloud, when she suspects a new threat to him. Katsu Vang is rich, powerful, and very interested in Anna. He’s also evil to his core. Join Anna as she plays a dangerous game, getting closer to Katsu to discover his real purpose, while trying to keep Ben safe. Secrets are exposed and the future Anna hoped for is snatched from her grasp. Forcefully addicted to heroin and sold as a sex slave, Anna is sent far away. Will Ben be able to save her? HiT to LiveIn the conclusion to the Anna Brookes saga, Ben and his sister Emily rescue Anna from a brothel in Sydney, Australia. For Anna and Ben, it’s time to settle scores…and a time for the truth between them. From Sydney to the Philippines and back to the States, they take care of business. But a helpful stranger enters Anna’s life, revealing more secrets…and a plan that Anna wants no part of. Can Anna and Ben shed their old lives and start a new one together, or will Anna’s new-found family ruin their chances at a happily-ever-after?",
  "genres": [
    "Mystery Thriller"
  ],
  "author": "Margaret McHeyzer",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/22839991-hit-series-box-set"
}