{
  "title": "Stones",
  "description": "Stones by Ruby Standing DeerEvolved Publishing brings you another rare glimpse into ancient American Indian culture, with the third book in the Shining Light's Saga series by award-winning author Ruby Standing Deer. [DRM-Free][Historical Fiction, American Indian, Cultural Heritage]In Book 3 of the saga of Shining Light’s people, the reader is swept into the changing world of ancient Native America. The peace that Shining Light and his family have enjoyed in the Land of the Tall Trees is shattered by his young daughter. Dove’s dream of mustangs, and of a young American Indian boy named Singing Stone, and his family known as the Mustang People, will not let her rest.The coming of the wild mustangs blessed Singing Stone’s people with a better way of life, and now these beautiful creatures are being slaughtered. Spurred on by the discovery of the yellow stone, the Hairy-Faces join with the Likes to Fight People to drive out other bands. What better way to weaken the Mustang People than to capture or kill the mustangs? Singing Stone and his family fight to protect them, but what can three do against many?Far away in the Land of Tall Trees, Dove still dreams of the mustang boy. Certain that her destiny is to be with him, young Dove begs her father to take her to him, back out onto the dangerous grasslands. Will they arrive in time to save Singing Stone and his people?When an attack by the Likes to Fight People leaves all of their possessions destroyed, Singing Stone and his family join the Blue Sky People, and together they become the Blue Sky Mustang People. With winter and danger looming ever closer, the mustangs and their protectors must keep moving, even though it is the season to stay in one place. Can they stop the Likes to Fight People and the Hairy-Faces from killing the mustangs?~Be sure to check out the first two books in this remarkable series, Circles and Spirals.",
  "genres": [
    "Historical"
  ],
  "author": "Ruby Standing Deer",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/22837746-stones"
}