{
  "title": "Warsaw Boy: A Memoir of a Wartime Childhood",
  "description": "Warsaw Boy is the remarkable true story of a sixteen-year old boy soldier in war-torn Poland. Poland suffered terribly under the Nazis. By the end of the war six million had been killed: some were innocent civilians - half of them were Jews - but the rest died as a result of a ferocious guerrilla war the Poles had waged. On 1 August 1944 Andrew Borowiec, a fifteen-year-old volunteer in the Resistance, lobbed a grenade through the shattered window of a Warsaw apartment block onto some German soldiers running below. 'I felt I had come of age. I was a soldier and I'd just tried to kill some of our enemies'. The Warsaw Uprising lasted for 63 days: Himmler described it as 'the worst street fighting since Stalingrad'. Yet for the most part the insurgents were poorly equipped local men and teenagers - some of them were even younger than Andrew. Over that summer Andrew faced danger at every moment, both above and below ground as the Poles took to the city's sewers to creep beneath the German lines during lulls in the fierce counterattacks. Wounded in a fire fight the day after his sixteenth birthday and unable to face another visit to the sewers, he was captured as he lay in a makeshift cellar hospital wondering whether he was about to be shot or saved. Here he learned a lesson: there were decent Germans as well as bad. From one of the most harrowing episodes of the Second World War, this is an extraordinary tale of survival and defiance recounted by one of the few remaining veterans of Poland's bravest summer. Andrew Borowiec dedicates this book to all the Warsaw boys, 'especially those who never grew up'. Andrew Borowiec was born at Lodz in Poland in 1928. At fifteen he joined the Home Army, the main Polish resistance during the Second World War, and fought in the ill-fated Warsaw Uprising. After the war he left Poland and attended Columbia University's Graduate School of Journalism. He lives in Cyprus with his English wife Juliet.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "World War II",
    "Holocaust",
    "Historical",
    "Audiobook"
  ],
  "author": "Andrew Borowiec",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/22843465-warsaw-boy"
}