{
  "title": "Vaporized",
  "description": "An Inexplicable Celestial Event...Earth's Water Vaporized...Civilization In Ruins...For Amber Lee, a lawyer working in London, the thought of the approaching long Bank Holiday weekend fills her with joy. A chance to catch up with friends, and generally relax. But as the weekend gets underway, news starts filtering through of unidentified objects entering Earth's atmosphere. As Saturday morning unfolds, Amber will soon wish that the long weekend never arrived...An Inexplicable Celestial Event...When two unidentified objects are tracked heading towards Earth's polar regions, NORAD, launches interceptor ballistic missiles to neutralize the threat. The incoming objects appear to take evasive action however, and ground-based seismographs later confirm that the objects have made a soft impact at the poles.Earth's Water Vaporized...Amber Lee, originally from Wales, but now working as a lawyer in London, awakes in the middle of the night following a disturbing dream. The next morning, she, along with the rest of the world, hears about the strange, and unique, celestial event that occurred during the early hours of the morning.Civilization In Ruins...24 hours after the event, things take a sinister turn. As Amber prepares for the Bank Holiday weekend, she notices weird phenomena occurring in the luxury apartment building she is renting from her absent uncle. Water seems to be defying gravity, and the building appears to be abandoned. Amber quickly realizes that a cataclysm of immeasurable proportion has struck London, and she sets off on a quest to reach home, and to find out what has happened. She soon discovers however, that the world may have changed forever, and her journey home soon turns into a fight for her very survival...Vaporized, is for anyone who enjoys a mix of science fiction, adventure, thrills and horror. Suspend your disbelief for a while, jump into Amber's shoes and enjoy the ride...!",
  "genres": [],
  "author": "Simon Rosser",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/22840393-vaporized"
}