{
  "title": "Pulse - The Complete Series",
  "description": "PULSE - Part One  Jessica Roth dumped her boyfriend, moved to New York and wanted desperately to start her new life off with a bang - a literal mind-blowing, soul-shaking night of pure, raw, memory making sex.  She thought her one time chance encounter with attorney, Nathan Moore, in a hotel room would become a jumping point for her exciting, single and adventurous life in the city.  One night turned into two, into four, and into more – always at the same place, always at the same time – no last names, no personal details, and absolutely no complications.  What Jessica doesn't count on is that in Nathan's world boundaries are made to be pushed.  He wanted her in ways he promised he never would. She wanted him in ways she couldn't admit.  When their lives ultimately collide outside the walls of the hotel room, Jessica is forced to face the truth about the only man who has ever made her pulse race and her body ache with unadulterated pleasure.  PULSE - Part Two  Nathan promised Jessica just one thing during those nights in his hotel room – sex unlike anything she had experienced before. She thought it would be simple, but with a man like Nathan, that’s not possible. He was complex, determined and too tempting to resist.  When her life intersects with his in the most unexpected way, she realizes that fate and chance don’t exist in his world. When Nathan wants something, or someone, he’ll have it, regardless of the cost.  As Jessica confronts the past she ran away from, the present that consumes her and what it all means for her future, one brief moment changes absolutely everything.  There is no one who can shield her from what happens next.  PULSE - Part Three  The story continues...  Jessica wanted to believe Nathan was a changed man. The lust filled promises he made in bed are no match for the reality that she's now holding in the palm of her hand. Sex drives men like Nathan Moore. She suspected it, then experienced it and now there's absolutely no denying it.  She knows what the right thing to do is. He knows that he's never met anyone like her.  Jessica struggles to forget him as Nathan's desire for her consumes him. His compulsive need to possess her pushes him in ways that will change them both forever.  Just how far is Nathan Moore willing to go to have the one woman he claims he can't live without?  PULSE - Part Four NEW YORK TIMES BESTSELLER  The conclusion to The Pulse Series...  Jessica Roth thought she'd found the one man who could fulfill her in every way. He was gorgeous, controlling, amazing in bed and said everything that she desperately wanted to hear. That was, until she heard him say the one thing she never suspected was true.  Nathan Moore says he has his reasons for doing the things that break her heart. She knows that she can't continue to live in a world where nothing makes sense.  As Jessica weaves her way through a maze of lies, half-truths and coincidences, she begins to see everyone in her world for who they really are. Old friends become the enemy, new friends become allies and the one man she can't be close to, becomes the only person who can give her what she really needs.  They promised each other there would be no complications. It's a promise neither of them can keep.   Please note: PULSE, the entire series, is included in this bundle.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Erotic Romance",
    "Contemporary",
    "Audiobook",
    "Adult",
    "New Adult"
  ],
  "author": "Deborah Bladon",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/22841896-pulse---the-complete-series"
}