{
  "title": "Bittersweet Revenge",
  "description": "This book is for mature audiences only 17+ due to adult themes, language, and alcohol use. WARNING: There is a cliffhanger, the conclusion to this story will be releasing in September.  Bittersweet Revenge, a book that leaves you breathless, and begging for more. You will cry, you will cheer, and most of all you will feel. You will know what its like to be bullied, loved, and betrayed. Are you ready?  I’m a slut. Or at least that’s what everyone calls me. I guess that’s what you get when everyone think’s you've slept with the whole football team and then some. My junior year of high school I gave my heart to Corey Winchester. He was handsome, cocky, and a pure gentlemen.  Then everything changed in an instant. When I found out he was spreading malicious rumors about me, after I refused to sleep with him I was utterly surprised. To add to it, he broke up with me in front of the whole school. I essentially became the laughing stock of the town. People that I once called my friends became my enemies. They were finding a way to ruin my life one day at a time. Now the shitty part is I should have known a pretty boy like him was too good to be true. After ruining my reputation and life I did everything I could to stay under the radar, but it just wasn't enough. I slowly learned that all the torment and hate was all for one thing. Revenge. That’s what Corey wanted, and why I didn't know.   Then Rex Winchester came along. Corey’s cousin and someone I knew I shouldn't be getting close with. A whole six feet of hotness, a smile that melted the panties off of every girl in a fifty mile radius, and a heart of gold. He could have anyone he wanted, so why he chose me Corey’s ex, the bullied, slutty girl was beyond me. All I knew was that I wanted him. I wanted him more than anything. The problem was, I couldn't tell if Rex was just like Corey or if his intentions were as innocent as he was making them out to be.  My name is Jenna Haines and this is the story of how the one thing I wanted turns out to be the one thing that would hurt me the most.  What happens when the one thing you least expect to happen does?  What happens when all the lies and all the secrets come out?  Well, you're about find out.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Young Adult",
    "High School",
    "New Adult",
    "Love",
    "Novella"
  ],
  "author": "J.L. Beck",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/22841106-bittersweet-revenge"
}