{
  "title": "Servicing the Debt and other Femdom Stories",
  "description": "Servicing the Debt and other Femdom Stories is a hot compilation of ten sizzling tales; chocked full of CFNM, Foot Fetish scenes and tons of tease and denial thrown in for good measure.Servicing the Debt - Losing his job, girlfriend and car is just the beginning of the problems for Bob as he finds he has a very deep debt to pay to his gorgeous landlord.Plea Bargain – Sam thought his luck had finally turned when he plea bargained into an experimental new program in lieu of prison. He would soon find out that there is no free lunch.Canadian Doubles – A Loudmouth tennis star is taught a very humiliating lesson on the courts by two beauties.The Art Exhibit – Dating a wild and beautiful Jamaican artist has some interesting consequences for Jake when he becomes part of her new art project.The Scapegoat - Paying for the crimes of his frat, Joe gets a large dose of private justice painfully applied by some very pissed off sorority girls.Command Performance – Super sexy Bridget and her equally hot friends have the whole summer ahead of them. When her equally hot new step-brother Thomas catches her eye and falls into her well laid trap, both she and he are in for the summer of their lives.Slave to Gina- Nicky Panagoplous is a small time thief with incredibly bad luck. When he picks the ultimate wrong house to rob, it ends with his complete enslavement to the beautiful Gina.Milking Superman – When the spunk of the man of steel is discovered to have some amazing healing properties, the superhero finds himself in a most humiliating predicament as he is perpetually harvestedThe Albanian's Revenge – A young handsome Serbian soldier learns a valuable lesson in humility and the power of women when he is captured by a village of beautiful and angry Albanians.The Countess – Bored Countess Katerina has it all; beauty, wealth, intelligence and absolute power over her subjects. When she discovers that she now owns a new handsome slave on one of her innumerable estates she sets out to finally create the perfect lover to satisfy her insatiable desires on her own terms.",
  "genres": [],
  "author": "M.V. Gaius",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/22844797-servicing-the-debt-and-other-femdom-stories"
}