{
  "title": "Count Your Blessings",
  "description": "After the sudden death of his sister-in-law, Isaac finds himself taking care of a four-year old girl and a boyfriend suffering from deep depression. With support from his Jewish family, and taking one small step at a time, they find their way to a new life. Isaac and George are grateful for a love that never fails. No matter what.This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. Dear Author,These two men have been partners for a while and have been through a lot together, having stood by each other through thick and thin. While they are strong, they are not afraid to show emotion or affection to each other. They are only just realizing what the other truly means to him. This story could be angst-filled, or filled with minor humorous trials and tribulations (or a combination of both), as long as they get a happily-ever-after.Photo Description: The photo pictures two men holding each other. One looks into the camera with confidence while wrapping his arms around the other man in a protective manner. The other man supports himself on his boyfriend, looking away from us. Both are bare-chested, and a beach and the sea are clearly visible in the background.This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Family",
    "Contemporary Romance",
    "Childrens",
    "Novella"
  ],
  "author": "Amelia Mann",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/22841728-count-your-blessings"
}