{
  "title": "The Unenviable: Stories of Psychological Trauma and Hardship among Immigrants and their Families.",
  "description": "What would you do if you had to leave your country or else be killed? What if you came to America to be with the one you love, only to find out that the person you thought was your significant other turned out to be your worst nightmare? These are, sadly, a few of the many terrible circumstances that immigrants in America deal with every single day. In fact, up until now, most stories about the hardship and difficulties that immigrants face when coming to America in less than ideal situations have never been told.Until now.Dr. David G. Mirich, author of “Losing My Mind: Dark Secrets of a Wounded Healer,” returns with his second book, “THE UNENVIABLE: Stories of Psychological Trauma and Hardship among Immigrants and their Families.” Dr. Mirich has been in a unique position of being referred by the government immigrants to hear their stories and determine if they are able to remain in the United States or not. Dr. Mirich has heard everything from tales of severe abuse of mail order brides to political conflicts taking the lives of whole families … and more.THE UNENVIABLE is divided up into four riveting sections: Political Asylum cases, American Citizen Cruelty Toward Immigrants, Mail Order Brides, and Hardship if Undocumented Family Members are Deported. Each section contains stories from people all over the world, including Russia, Asia, and South America. Each story is intimate, raw, and most of all, paints a picture of the world we live in today. A world that holds many stories about immigrants like the ones Dr. Mirich has interviewed. This is an absolutely important and compelling work of non-fiction that anyone interested in immigration reform and foreign policy should take the time to read. It will change how you see the world and perhaps even help you understand a little more about the people who live in it.",
  "genres": [],
  "author": "David G. Mirich",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/22841752-the-unenviable"
}