{
  "title": "The Letter Killers Club",
  "description": "A New York Review Books Original.Writers are professional killers of conceptions. The logic of the Letter Killers Club, a secret society of “conceivers” who commit nothing to paper on principle, is strict and uncompromising. Every Saturday they meet in a fire-lit room hung with blank black bookshelves to present their “pure and unsubstantiated” conceptions: a rehearsal of Hamlet hijacked by an actor who vanishes with the role; the double life of a medieval merry cleric derailed by a costume change; a machine-run world that imprisons men’s minds while conscripting their bodies; a dead Roman scribe stranded this side of the River Acheron. The overarching scene of this short novel is set in Soviet Moscow, in the ominous 1920s. Known only by pseudonym, like Chesterton’s anarchists in fin-de-siècle London, the Letter Killers are as mistrustful of one another as they are mesmerized by their despotic president. Sigizmund Krzhizhanovsky is at his philosophical and fantastical best in this extended meditation on madness and silence, the word and the soul unbound.Sigizmund Krzhizhanovsky (1887–1950) studied law and classical philology at Kiev University. His philosophical and satirical stories with fantastical plots ignored official injunctions to portray the new Soviet state in a positive light, and three separate efforts to print different collections were quashed by the censors, a fourth by World War II. Not until 1989 could these surreal fictions begin to be published. His collection of stories, Memories of the Future, is available from NYRB Classics.   Caryl Emerson is A. Watson Armour III Professor of Slavic Languages and Literatures at Princeton University.   Joanne Turnbull has translated a number of books from Russian, including Sigizmund Krzhizhanovsky’s Memories of the Future, which was shortlisted for the Best Translated Book Award (available as a NYRB Classic). Editorial Reviews - The Letter Killers Club From the Publisher A New York Review Books",
  "genres": [
    "Fiction",
    "Russia",
    "Short Stories",
    "Russian Literature",
    "Classics",
    "Literature",
    "20th Century"
  ],
  "author": "Sigizmund Krzhizhanovsky",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/11361168-the-letter-killers-club"
}