{
  "title": "Dare Me",
  "description": "Sometimes a dare can go too far... As a veterinarian an exclusive Beverly Hills animal hospital, Jessica isn't easily impressed. She deals with famous faces every day. But she can't resist the chance of seeing her favorite band live at the Hollywood Bowl. When her friends from work dare her to go to the stage door before the show, she takes the dare, despite her misgivings. Kendall Jackson is jaded. A super star since his boy band phase, he's now one of the premier rock stars in the world. He's seen it all. But when the tiny, young beauty nearly gets trampled outside his concert, his natural sense of chivalry takes over. He decides to give his young fan the night of her life by letting her back stage. Little does he know, she's not as young and innocent as he thinks she is. When she takes him up on his offer, he's in for the night of his life. Excerpt: Kendall was staring at Jessica's body again. Her waist was so small he could span it with his hands. But above that and below it, nice juicy handfuls. She was saying something… he forced himself to pay attention. \"Hmmm?\" \"I'm not so sure about this.\" \"What's wrong?\" They were standing on the tarmac, getting ready to board the private plane the hotel had sent for them. Jessica looked ready to bolt. \"This is really crazy. I can't just go to Vegas. I have to work tomorrow.\" He frowned, trying to figure out how to convince her to come with him. She had to come now. He was counting on it. He had no idea how it had happened but he desperately didn't want the night to end. Not that he expected anything to happen necessarily... Well, nothing that his hormones were hoping for anyway. He was definitely going to get a kiss out of her. More than that. A lot more hopefully. He had to get his hands on that tight little body. But he could tell she wasn't the kind of girl who was going to just take her clothes off. He told himself he liked that about her. Even if it interfered with his baser desires. It had been four months since he broke up with Becca. He'd gone out with a few girls since then but nothing serious. Models mostly. He had other things on his mind other than sex. Usually that was the case. But not tonight. Right now he was trying to force himself to cool his jets. He didn't want to scare her off, did he? \"Call in sick. You did get knocked in the head after all.\" He grinned at her, trying to put her at ease. To hide the fact that she was making him feel like a horny teenager for some wild reason. All he knew for sure was that he wanted to get this girl on the plane with him. Maybe that's what was throwing her off. \"Look, we don't have to do anything. Let's just have fun.\" She smiled at him shyly. Jesus, the girl was sweet! He felt an overwhelming urge to protect her wash over him. She chewed her lip thoughtfully. He wanted to do that for her. God, her mouth was luscious… How had he thought she was a kid before? \"Seriously. I mean, you are very cute but I'm not a raving sex maniac or anything, I promise.\" She laughed. Good. That was a good sign. \"Okay.\" He grinned and grabbed his backpack. \"I'll even let you borrow my toothbrush.\" She rolled her eyes at him. He kind of loved that she wasn't all that impressed by his status. She was definitely not putting him on a pedestal. On the other hand, he wouldn't mind putting her on one… much easier to get access to those insane curves she had. Down boy. He watched as she got checked in by the flight crew. Then she smiled at him. \"Let's do this.\"",
  "genres": [
    "Romance",
    "New Adult",
    "Musicians",
    "Music",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Joanna Blake",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/22842844-dare-me"
}