{
  "title": "Atlantis Rising: Conlan",
  "description": "First in a critically acclaimed series by New York Times and USA Today bestselling author Alyssa Day...   Eleven thousand years ago, before the seas swallowed the Atlanteans, Poseidon assigned a few chosen warriors to act as sentinels for humans in the new world. There was only one rule—desiring them was forbidden. But rules were made to be broken…  When she calls… Riley Dawson is more than a dedicated Virginia Beach social worker. She’s blessed with a mind link that only Atlanteans have been able to access for thousands of years. Being an “empath” may explain her wistful connection to the roiling waves of the ocean, the sanctuary it provides, and the sexual urges that seem to emanate from fathoms below…  He will come. Conlan, the High Prince of Atlantis, has surfaced on a mission to retrieve Poseidon’s stolen Trident. Yet something else has possessed Conlan: the intimate emotions—and desires—of a human. Irresistibly drawn to the uncanny beauty, Conlan soon shares more than his mind. But in the midst of a battle to reclaim Poseidon’s power, how long can a forbidden love last between two different souls from two different worlds?  \"Alyssa Day creates an amazing and astonishing world in ATLANTIS RISING you'll want to visit again and again. ATLANTIS RISING is romantic, sexy and utterly compelling. I loved it!\" – New York Times bestselling author Christine Feehan  \"An amazing new world you don't want to miss, and you won't want to leave! Alyssa Day delivers chills, thrills, and your fill of sexy Poseidon Warriors!\" -- USA Today bestselling author Kerrelyn Sparks  THE WARRIORS OF POSEIDON SERIES: Atlantis Rising Wild Hearts in Atlantis (a novella; originally in the WILD THING anthology) Atlantis Awakening Shifter’s Lady (a novella; originally in the SHIFTER anthology) Atlantis Unleashed Atlantis Unmasked Atlantis Redeemed Atlantis Betrayed Vampire in Atlantis Heart of Atlantis Alejandro’s Sorceress (a related novella)",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Vampires",
    "Mythology",
    "Urban Fantasy"
  ],
  "author": "Alyssa Day",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/22845728-atlantis-rising"
}