{
  "title": "To Seduce A Siren",
  "description": "Being a Siren sucked! Charisse Bright could attest to that. Admittedly, the supernatural package came with a face/body to die for and the ability to manipulate others with her stunning voice, but there’s a major downside to being a songstress of the high seas and she wasn’t just talking about the never-ending compliments, the incessant flattery or the drooling… ick, the drooling! No, she had a deep, dark secret. Being a Siren meant bonding with a possessive, bitchy and hungry… oh, so very hungry, rock. Charisse has enough on her plate dealing with the demanding bitch-rock on top of her extensive, magical, high-maintenance family. The last thing she needs in her life is a man. One who keeps scowling at her rather than flirting, kissing her one moment, insulting her the next. And worst of all, he appears to be completely an utterly immune to her Siren powers. No, the last thing she needs in her life is an uncontrollable, annoying man.Women! Women of all shapes and sizes love Maat warrior and world-class superflirt, Nate, but after a hundred years of flirting - with the best of intentions - Nate is kind of weary of the whole meaningless dating scene. He wants a relationship, with a nice, easy-going, uncomplicated woman. Problem is, the two women currently in his life, couldn’t be more different, or problematic. One’s a bat-crap-crazy, assassin vampire Queen, stalking him, determined to make him her eternal chew toy. And the other… well, the other is a gorgeous woman with way too many secrets. Common-sense tells him he should steer well clear of Charisse Bright, but there’s just something about the woman that he finds impossible to resist.Nate’s determined to rise to the challenge. Protect Charisse. Kill the vampire Queen. And along the way seduce a Siren into giving up all her secrets… he won’t settle for less than her body and soul.",
  "genres": [
    "Paranormal Romance",
    "Romance",
    "Humor",
    "Paranormal",
    "Love",
    "Urban Fantasy",
    "Paranormal Urban Fantasy"
  ],
  "author": "Jane Cousins",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/22845031-to-seduce-a-siren"
}