{
  "title": "The Wanderers Beginning",
  "description": "3 books in 1 The Wanderers What do you do when you learn your family is the one who's holding all the secrets. Secrets that could get you killed... Ella is looking forward to starting college in the fall with her best friend Josie. She’s looking for a place where she can get away from her overbearing parents and two older annoying brothers. Unfortunately Ella realizes that sometimes the past comes back to haunt you. Ella soon learns that the man who terrorizes her dreams is in fact real and coming after her. When one of her classmates is murdered, Ella slowly recognizes this is not some strange coincidence. Ella fears that the boy she’s falling in love with is the one who stalks her dreams and no longer knows who she can trust. When she finally learns the truth of her families deepest secret, Ella has to face her demons by taking out one of the people she thought she could trust…before they kill her. Reborn Ella finally knows what she is, but now she’s not so sure she knows who she is. With Jack still on the loose her parents have her confined to the house leaving Ella to feel like she’s stuck in a prison. Coping with the loss of her best friend and the love of her life, Ella feels trapped in an endless cycle of torment. She feels she’s doomed to lose everyone she loves. In attempt to keep her safe and help her understand her new life her parents decide that what’s best for her is to go back to school, but not just any school. Ella’s not alone though. The school is filled with students who are just like her, including her brother Dean. Her mission is to keep herself blended in the background and out of trouble, but unfortunately Ella isn’t that lucky. With the roommate from hell, her brother constantly breathing down her neck, and being pinned right away as the outcast, Ella wants nothing more than to just crawl under a rock for the rest of her life. Even the school’s sweetheart has it in for her. Can she overcome her fear of the unknown? Will she ever learn to accept who she is? The most important thing Ella is concerned about is just surviving the semester at Hamilton Hill. Unforgiven All it took was three magical words… Tristan…is…alive. Ella knew leaving was wrong. She knew there would be consequences but what was at stake was far more important than anything she could have done if she stayed. She just had to see for herself. Ella also knows Josie’s time is limited. With the help of her friends, Ella takes off and introduces herself to a foreign land. She hoped to keep her whereabouts a secret but it isn’t long before her father discovers where she is and threatens to take her back kicking and screaming. Things quickly go awry and Ella finds more than what she was looking for in her search for Tristan. Ella knows eventually she must return home and face the aftermath of her sudden departure. But her head and heart aren’t sure they can handle it. Will Roman forgive her? Will Gabe and the rest of her friends hate her for abandoning them in their time of need? Found out what happens next in the all new installment of The Wanderers series with Unforgiven. And special sneak peak at my new adult contemporary romance 500 Days",
  "genres": [
    "Paranormal Romance"
  ],
  "author": "Jessica  Miller",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/22845575-the-wanderers-beginning"
}