{
  "title": "The Thanksgiving Gang",
  "description": "The Thanksgiving Gang A Novel of Time Travel - The Sequel to The Gray Ship It happened again. I didn’t see it coming. I never do. My name is Jack Thurber, and I’m a time traveler, not a title I thought I’d aspire to, but having done it three times before, I guess it’s who I am. I slipped through wormholes before, once travelling back to the 1920s, once to Pearl Harbor in 1941 while it was being attacked, and once to the Civil War. This is getting old. But this time it’s different. I’ve tripped into the future, two years to be exact. Moments ago it was 9 AM on July 1, 2015. Now, according to a news ticker on a building, it’s July 1, 2017. I had been walking through an abandoned lot on the East Side of Manhattan doing research for a magazine article for the Washington Times on underutilized real estate, when I stepped on a storm grate. I felt dizzy, a little nauseated as I always do. The scenery didn’t change much. The lot was still abandoned but it had sprouted two more years-worth of weeds. It was pouring rain. In 2015, a few moments before, it had been a bright day without a cloud in the sky. It’s a strange feeling to step on a grate and go from sunshine to rain in an instant. The gloomy weather wasn’t helping my mood. I’ve got the drill down by now. The grate was a wormhole, also known as a time portal. Step on it and you’re in for a weird trip. Your world changes fast, very fast. Here’s what I’ve When you step through a wormhole, the way to go back is to find the wormhole and just step on it again. So right now I can simply step on the grate and go backwards two years. But I’m an investigative journalist. How can I pass up a story, even one that I may never tell? Could you resist the urge to know what happened in the past two years? Thank God I resisted the urge to go back. I took out my phone to call my wife Ashley, but I stopped. There’s no one in the world I like to talk to more than Ashley, but I didn’t want to upset her. A Navy captain, she had just taken command of the aircraft carrier USS Abraham Lincoln, and they’re putting to sea today (today?) for a two-week training cruise. Then I how can I make a phone call two-years into the past? Time travel plays strange tricks with your head. I’ll call Bennie, of course! Dr. Benjamin Weinberg is a detective and psychiatrist with the New York City Police Department and my best friend. He collaborated with me on a book I wrote about, what else, time travel. My phone service had been stopped, so I walked into a store and paid cash for a cell phone with pre-purchased minutes. “Bennie, it’s Jack, Jack Thurber,” I said when he picked up the phone. *** Jack’s meeting with Bennie was the worst experience of his life. Bennie told him that he was killed on Thanksgiving Day, 2015, along with his wife Ashley and a few thousand other people. Jack was Ashley’s guest on the Lincoln, along with a few other civilians, when a terrorist-planted nuclear bomb exploded, killing everyone aboard. Within five minutes, four other American carriers were nuked by terrorist bombs. Dare he try to go back and change history? Dare he not? Jack's got to go back to the past, the past when he and Ashley were still alive. But he knows he needs evidence to convince the government of the past that a tragedy is on its way. To do that he forms a group of people to help him. They call themselves The Thanksgiving Gang. “Rip roaring, gut wrenching suspense wrapped in a story of friendship and courage.",
  "genres": [],
  "author": "Russell F. Moran",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/22848345-the-thanksgiving-gang"
}