{
  "title": "French Children of the Holocaust: A Memorial",
  "description": "Learn more about Serge Klarsfeld at klarsfeldfoundation.org.During World War II, 11,000 Jewish children were deported from France to Auschwitz and other Nazi death camps in convoys that continued rolling until August 18, 1944—the very day of the Paris uprising that ended with the city's liberation. The children were among more than 75,000 French Jews deported to the camps under the Nazi plan for the final solution of the Jewish question. Nearly all of the young victims—some less than two years old—were arrested by the French police on orders of the Vichy government and turned over to the Germans for deportation. Only a handful of the children survived.In French Children of the Holocaust , Nazi-hunter Serge Klarsfeld—the man who brought Klaus Barbie to justice in 1983—has created a volume of stunning documentary importance. Drawing together archival evidence pried with difficulty from the French government, family testimony and photographs solicited by advertisements in Jewish publications in Europe, Israel, and the United States, and the Nazi's own lists of deportees--which were discovered, fading and crumbling, by Klarsfeld in a French Jewish archive--this book represents the culmination of many volunteers' painstaking efforts to give testimony to the short lives of these Jewish children.Photographs of over 1,500 of the children, gathered from their surviving relatives and family friends all over the world, bring life to their brief biographies. Included with each photograph is the name, age, place and date of birth, home address, and the date and brief history of the deportation convoys that transported them to the death camps.This book is an invaluable reference for scholars of the Holocaust, signifying the last attempt to rescue these young victims of the Nazis from oblivion and to help them leave a permanent mark on history as individuals and as a group.Table of ForewordAuthor's PrefaceEditors' NotesAcknowledgmentsContent and Style GuideJewish Children and the Holocaust in FranceHistory and ChronologyMapsThe Rescue of Children by OSEDeportation ConvoysResearch and Reconstructing the convoy listsNames and Addresses of the 11,000 Children Deported, by ConvoyConvoy HistoriesThe Photographs of Jewish ChildrenOfficials responsible for anti-Jewish actions in FranceTerms and abbreviationsIndex of all childrenIndex of children in photographs",
  "genres": [
    "Holocaust",
    "Nonfiction",
    "History"
  ],
  "author": "Serge Klarsfeld",
  "average_rating": "4.81",
  "url": "https://www.goodreads.com/book/show/228468.French_Children_of_the_Holocaust"
}