{
  "title": "Where The Dog Star Never Glows",
  "description": "When is a river or an ocean or a cabin in the woods more than just what it appears to be on the outside? When these locales are channeled through the storytelling talents of award-winning author Tara L. Masih.Whether it's the dusty prairie tying together two centuries in \"Ghost Dance,\" the fears that accompany pregnancy that are further inflamed by the heat of a Mexico border town in \"The Dark Sun\" or a future as dark as the coal mine the narrator seeks to distance himself from in \"Where the Dog Star Never Glows,\" Masih deftly creates living, breathing characters from the places she describes.This anthology of 17 short stories showcases Masih's superb talents at creating lush, lyrical and detailed worlds for her narrators to inhabit. Included here are nine award-nominated stories, two of which were nominated for literature's high honor of the Pushcart Prize for short fiction. In 2010, WHERE THE DOG STAR NEVER GLOWS achieved a further accolade for the sum of its parts by becoming a Best Books Award finalist from USA Book News.Of Masih's writing, Publisher's Weekly \". . . Masih's stories are minimally but skillfully detailed-no last names, vague settings-giving extra weight to simple, recurring phenomena like water and color (\"the evening's August melon light\"). Striking and resonant, this collection should prove memorable for any fan of New Yorker-style literary short fiction.\"San Francisco Book Review \"It can be quite hard for one to find a collection of refreshingly diverse short stories by a single author. Readers will find Tara Masih's collection of short stories to be wonderfully engaging. Her stories break the mold. . . .\"And carp(e) libris reviews \"That beautiful spirit that permeates Masih's short stories is nothing short of extraordinary. Truly written from the heart of a poet, her ability to turn a phrase is more than appealing to this particular reviewer. . . . Throughout the book there permeates an unexpected sense of peace, even as characters battle against tough life decisions. Settings and people alike are brought to life with well-chosen words handled like paint on a canvas, leaving the reader with lucid imagery and a sense of deep reflection. . . .\"Delve into a world of imagery and high literary prose. A place where mystery and emotion both run high in exotic lands. Into a world...WHERE THE DOG STAR NEVER GLOWS.",
  "genres": [
    "Short Stories",
    "Fiction"
  ],
  "author": "Tara Lynn Masih",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/11362971-where-the-dog-star-never-glows"
}