{
  "title": "Syster och bror",
  "description": "In this historical narrative, Swedish novelist Agneta Pleijel follows the lives of two ancestors, a sister and brother, each of whom played a role in the cultural life of Stockholm in the 19th century. Using old letters, records, and stories passed down through her family, Pleijel imagines the lives of her great-grandfather, Albert Berg (1832–1916), and his younger sister, Helena Berg Petre (1834–1880), who were born into a prominent musical family. Albert was born deaf, dashing his father’s hopes of a musical career for him. He was sent to Stockholm’s Manilla School for the Deaf, where he learned sign language. He later studied art and became a painter of seascapes. His interest in improving the lives of deaf people led him to become an advocate for the Deaf community and to cofound the Stockholm Deaf Association.       Helena showed early musical talent and, trained by her father, was a gifted singer. She lived in Paris for a time and enjoyed popular success. She fell in love with a musician but was plunged into despair when he died from cholera. Her father persuaded her to give up singing and marry a cold industrialist, who was one of the wealthiest men in Sweden, in order to provide financial support for the family. Helena struggled in the loveless marriage and battled depression throughout her life.       Despite their disparate lives, Albert and Helena faced similar struggles with communication, autonomy, and self-determination. Albert’s story traces the development of his own sense of identity as well as the development of Swedish Deaf culture, while Helena’s life reflects the silencing and oppression endured by women. In Sister and Brother, Pleijel’s literary treatment of their lives sheds light on the cultural and social norms that shaped the experiences of deaf people and women in the 19th century.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Family"
  ],
  "author": "Agneta Pleijel",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/22852770-syster-och-bror"
}