{
  "title": "Flirting With Love",
  "description": "Voted BEST BOOK SERIES of 2013 by Supportive Business Moms, UK\"...love, loss, lies, grief, finding happiness in the face of adversity, romance, humor, bravery, hot hot hot sex scenes, marriages, births and totally awesome characters.\" --Supportive Business Moms, UK\"Like Nora Roberts, Melissa Foster has captivated me with her fantastic, sexy, romantic stories.\" Kimberly Winning, avid reader**BONUS** Includes the first chapter (sneak peek) of upcoming Love in Bloom books, DREAMING OF LOVE, The Bradens, Book Eleven, and SEASIDE SUNSETS, Seaside Summers, Book Four..\"Sensual, sexy, and satisfying. A captivating blend of the dance between lust, love, and life.\" -- Bestselling author, Keri Nola.IN FLIRTING WITH LOVE...Elisabeth Nash has spent years dreaming of returning to the small town of Trusty, Colorado, where she spent summers with her favorite aunt. When she inherits her aunt's farmette, she closes her Los Angeles pet bakery and pampering business, sure that life in Trusty will be as peaceful and as welcoming as she remembers. But being an outsider in the close-knit town proves to be very different from the happy summers she remembers from her childhood--and falling for Trusty's hot, wealthy, and sinfully irresistible veterinarian, Ross Braden, sends the rumor mill into a frenzy..Ross Braden learned long ago that gossip spreads faster than weeds in his small hometown, and Ross loves nothing more than his privacy. For that reason, he doesn't date women who live in Trusty. But that was before blond, beautiful, and refreshingly honest Elisabeth Nash flew into his vet clinic seeking help for her panicked piglet and turned his comfortable life--and his heart--inside out..Despite rumors about Elisabeth's motives toward her aunt's property, passion brews between Elisabeth and Ross. Every steamy kiss and every sensual touch brings the pair closer together, and when Ross helps Elisabeth try to fit into the town he adores, it makes their bond even stronger. But even Elisabeth's efforts toward reaching the community, and the love she and Ross so desperately believe in, might not be enough for the protective small town to offer them a future..Read the full LOVE IN BLOOM series:.SNOW SISTERSBOOK 1: Sisters in LoveBOOK 2: Sisters in BloomBOOK 3: Sisters in White.THE BRADENSBOOK 4: Lovers at Heart (Treat & Max)BOOK 5: Destined for Love (Rex & Jade)BOOK 6: Friendship on Fire (Josh & Riley)BOOK 7: Sea of Love (Dane & Lacy)BOOK 8: Bursting with Love (Savannah & Jack)BOOK 9: Hearts at Play (Hugh & Bree).THE REMINGTONSBOOK 10: Game of Love (Dex)BOOK 11: Stroke of Love (Sage)BOOK 12: Flames of Love (Siena)BOOK 13: Slope of Love (Rush)BOOK 14: Read, Write, Love (Kurt).THE BRADENSBOOK 15: Taken by Love (Luke)BOOK 16: Fated for Love (Wes)BOOK 17: Romancing My Love (Pierce)BOOK 18: Flirting with Love (Ross) BOOK 19: Dreaming of Love (Emily) - Coming soonBOOK 20: Crashing into Love (Jake) - Coming soon.SEASIDE SUMMERSBOOK 21: Seaside Dreams (Bella)BOOK 22: Seaside Hearts (Jenna) - Coming soonBOOK 23: Seaside Sunsets (Jamie) - Coming soonBOOK 24: Seaside Secrets (Amy) - Coming soon",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Family"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/22853250-flirting-with-love"
}