{
  "title": "You Only Love Twice",
  "description": "Librarian's note: See alternate cover edition of ASIN B00M8LWHVO here.A woman on a mission  Phoebe Graham is a specialist in deep cover espionage, infiltrating the enemy, observing their practices, and when necessary eliminating the threat. Her latest assignment is McKay-Taggart Security Services, staffed with former military and intelligence operatives. They routinely perform clandestine operations all over the world but it isn’t until Jesse Murdoch joins the team that her radar starts spinning. Unfortunately so does her head. He’s gorgeous and sweet and her instincts tell her to trust him but she’s been burned before, so he’ll stay where he belongs—squarely in her sights.  A man on the run  Since the moment his Army unit was captured by jihadists, Jesse’s life has been a nightmare. Forced to watch as those monsters tortured and killed his friends and the woman he loved, something inside him snapped. When he’s finally rescued, everyone has the same question—why did he alone survive? Clouded in accusations and haunted by the faces of those he failed, Jesse struggles in civilian life until McKay-Taggart takes him in. Spending time with Phoebe, the shy and beautiful accountant, makes him feel human for the first time in forever. If someone so innocent and sweet could accept him, maybe he could truly be redeemed.  A love they never expected  When Phoebe receives the order to eliminate Jesse, she must choose between the job she’s dedicated her life to and the man who’s stolen her heart. Choosing Jesse would mean abandoning everything she believes in, and it might mean sharing his fate because a shadowy killer is dedicated to finishing the job started in Iraq.   A Masters and Mercenaries Novel by Lexi Blake",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Romantic Suspense",
    "Suspense",
    "Erotic Romance",
    "Military Fiction"
  ],
  "author": "Lexi Blake",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/22851306-you-only-love-twice"
}