{
  "title": "Where They Both Belong",
  "description": "Have you visited Corbin's Bend?If not, then pack your bags for a journey to a community tailor-made for you.In Corbin's Bend, no wife ever need fear having her neighbors know she's subject to domestic discipline, because here spanking is the norm. In this popular series, you will get to know the couples who call this unique community home, and learn how they build their lives with the help of old-fashioned disciplinary values.And the best part? Your entry into Corbin's Bend is free this August with our giveaway of \"Where They Both Belong\" by Thianna D.So sit back and enjoy this story. We know once you read it, you'll be back for more!Life-long residents of Mesa, Arizona, both of Matt & Julie Renton's conservative families turned on them when their discipline lifestyle became public knowledge. Months after being fired from his job, Matt was just getting by doing day labor. Worried over Julie's stress level, he set his hopes on getting into a new housing development in Colorado called Corbin's Bend where they could be themselves and his lovely wife could finally relax.Combined with Matt's natural ability to find the most unique forms of discipline he could imagine, Julie found herself at home in their new community filled with wonderful residents who were nice, friendly, and the kind of people she could open up to.Tried, true, and tested before they even reached Colorado, Matt and Julie worked hard to keep their relationship strong even as they started a new life. With a new job for Matt and complete acceptance from the community for Julie, they began to feel that this just might be where they belonged. Especially when the community's welcome basket arrived with a little surprise.This volume also includes the bonus short story Eau de Brittany broke a little rule. If she didn't find a way to ease her boyfriend Trevor into hearing about it, she might not sit down for weeks. Prepared to soften him up with every one of his favorite dishes, it never occurred to her that in Corbin's Bend, this kind of thing had a way of coming out, even if you didn't want it to. Now the only thing left was a discipline spanking and it just might turn her world upside down.About Corbin's Welcome to Corbin's Bend, the first equity-cooperative housing development just for spankofiles. Thirty thousand acres in the mountains above Denver sits your dream come true. With 1000 home sites, several restaurants, a club house, theater, pool, and many other amenities, you will find yourself at home.Corbin's Bend is the setting for a group of spanking romance novellas set in, where else? Corbin's Bend, Colorado. A fictitious housing cooperative, Corbin's Bend is unique in that everyone living there is into spanking, whether that be erotically or through domestic discipline. Just imagine, a place where nobody has to hide their particular spanking lifestyle.While reading any series in order is nice, Corbin's Bend books can be read as stand-alones as well.",
  "genres": [
    "BDSM"
  ],
  "author": "Thianna D.",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/22852879-where-they-both-belong"
}