{
  "title": "Chase, the Bad Baby",
  "description": "Chase, the Bad Baby is the story of a baby that suffered a catastrophic brain injury at birth. His OB doctor was negligent and is named as a defendant in a lawsuit filed by attorney Thaddeus Murfee and defended by attorney Morgana Bridgman.  The lawsuit is a deserving case with huge jury appeal, but there is one major problem. The hospital and doctor have re-written nurses notes and medical records to make it appear there was no negligence.  The doctor's lawyer, Morgana Bridgman, finds out about the forged records and is put in a quandary: does she tell the truth and lose her job or hide the truth and keep her job? Her lover is a woman who wants to have a baby with her when Morgana is stricken with a deadly disease. Their story is compelling and fascinating reading.  Thaddeus Murfee is on the hunt in this novel. On the hunt for the truth about the birth of Chase Staples and on the hunt for the man who kidnapped his daughter. It becomes a one-on-one game of cat and mouse that finally reaches its explosive climax and someone must die.  Watch the bad baby jury trial from your front row seat in the jury box. You will be amazed at the twists and turns the story takes as you cheer for the baby and pray his needs get met.  \"Chase, the Bad Baby is the most emotionally difficult yet compelling novel I've ever written,\" says author John Ellsworth. \"Join with me in supporting Chase in his desperate fight for justice. You'll be glad you were there!\"  This is the fourth book in the Thaddeus Murfee legal thriller series of books. While the books are numbered 1-4, they may be read in any order. There is no need to read 1-3 before reading 4, so please enjoy them in any order you choose. The books in the series are:  The Defendants Beyond a Reasonable Death Attorney at Large Chase, the Bad Baby",
  "genres": [
    "Mystery",
    "Legal Thriller",
    "Crime"
  ],
  "author": "John Ellsworth",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/22850398-chase-the-bad-baby"
}