{
  "title": "On the Run: Fugitive Life in an American City",
  "description": "Forty years in, the tough on crime turn in American politics has spurred a prison boom of historic proportions that disproportionately affects Black communities. It has also torn at the lives of those on the outside. As arrest quotas and high tech surveillance criminalize entire blocks, a climate of fear and suspicion pervades daily life, not only for young men entangled in the legal system, but for their family members and working neighbors. Alice Goffman spent six years in one Philadelphia neighborhood, documenting the routine stops, searches, raids, and beatings that young men navigate as they come of age. In the course of her research, she became roommates with Mike and Chuck, two friends trying to make ends meet between low wage jobs and the drug trade. Like many in the neighborhood, Mike and Chuck were caught up in a cycle of court cases, probation sentences, and low level warrants, with no clear way out. We observe their girlfriends and mothers enduring raids and interrogations, \"clean\" residents struggling to go to school and work every day as the cops chase down neighbors in the streets, and others eking out a living by providing clean urine, fake documents, and off the books medical care. This fugitive world is the hidden counterpoint to mass incarceration, the grim underside of our nation's social experiment in punishing Black men and their families. While recognizing the drug trade's damage, On The Run reveals a justice system gone awry: it is an exemplary work of scholarship highlighting the failures of the War on Crime, and a compassionate chronicle of the families caught in the midst of it.\"A remarkable feat of reporting . . . The level of detail in this book and Goffman's ability to understand her subjects' motivations are astonishing—and riveting.\"—\nThe New York Times Book Review",
  "genres": [
    "Nonfiction",
    "Sociology",
    "Anthropology",
    "Politics",
    "Race",
    "Ethnography",
    "Crime"
  ],
  "author": "Alice Goffman",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/22857251-on-the-run"
}