{
  "title": "Ace's Redemption",
  "description": "CherryMemories alone can ruin you. Fear has a paralyzing effect, and love isn’t always enough to keep you safe.Ace was the gateway to a freedom I hadn’t known since I was fifteen. He offered his protection from the demons that haunted me; both living and dead.Although I knew I wasn’t enough to keep him, this didn’t deter my hope that one day he’d love me for who I was, not the broken girl he tried so desperately to save. In the end, the ghosts of my past found me. Their malevolence knew no bounds, and I was forced to succumb to their will of darkness. Each threat named against those I loved made any escape impossible; choosing my life for theirs became my desolate absolution.Inevitably, it was my own weakness and self-doubt that became my undoing.AceEmotional ties are sometimes severed. Friendships don’t always endure their hardships, and love offered isn’t always returned. I was in love once. For me, leaving her back in Ohio was the hardest thing I’ve ever had to do. For her, moving on with her life that included her son and the man she loved was no less than she deserved -- unconditional happiness.My reasons to bring Cherry home to California were obvious. I needed help with my family, and she needed help staying clean and convincing her parents she was ready to give her son the life he deserved.It was a perfect plan. However, the best laid plans often get lost amidst their best intentions.Cherry fell in love with me, and in return my love for her acted as the catalyst to her destruction.Authors Note: This novel contains material that is not suitable for individuals under the age of 18. Content includes: drug use, explicit language, violence, rape, and other scenarios with content that readers may find offensive. Please use caution when deciding on this book, as every reader has the right to understand the product before purchase. Ace’s Redemption is the first standalone novel in the Devil’s Despair series. Although the main character of Ace was introduced during the Lights of Peril trilogy, you do not need to read that series in order to follow this one.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Dark",
    "Abuse",
    "Erotica",
    "New Adult"
  ],
  "author": "A.C. Bextor",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/22854806-ace-s-redemption"
}