{
  "title": "The Pope and Mussolini: The Secret History of Pius XI and the Rise of Fascism in Europe",
  "description": "PULITZER PRIZE WINNER   •  NAMED ONE OF THE BEST BOOKS OF THE YEAR BY  SAN FRANCISCO CHRONICLEFrom National Book Award finalist David I. Kertzer comes the gripping story of Pope Pius XI’s secret relations with Italian dictator Benito Mussolini. This groundbreaking work, based on seven years of research in the Vatican and Fascist archives, including reports from Mussolini’s spies inside the highest levels of the Church, will forever change our understanding of the Vatican’s role in the rise of Fascism in Europe. The Pope and Mussolini tells the story of two men who came to power in 1922, and together changed the course of twentieth-century history. In most respects, they could not have been more different. One was scholarly and devout, the other thuggish and profane. Yet Pius XI and “Il Duce” had many things in common. They shared a distrust of democracy and a visceral hatred of Communism. Both were prone to sudden fits of temper and were fiercely protective of the prerogatives of their office. (“We have many interests to protect,” the Pope declared, soon after Mussolini seized control of the government in 1922.) Each relied on the other to consolidate his power and achieve his political goals. In a challenge to the conventional history of this period, in which a heroic Church does battle with the Fascist regime, Kertzer shows how Pius XI played a crucial role in making Mussolini’s dictatorship possible and keeping him in power. In exchange for Vatican support, Mussolini restored many of the privileges the Church had lost and gave in to the pope’s demands that the police enforce Catholic morality. Yet in the last years of his life—as the Italian dictator grew ever closer to Hitler—the pontiff’s faith in this treacherous bargain started to waver. With his health failing, he began to lash out at the Duce and threatened to denounce Mussolini’s anti-Semitic racial laws before it was too late. Horrified by the threat to the Church-Fascist alliance, the Vatican’s inner circle, including the future Pope Pius XII, struggled to restrain the headstrong pope from destroying a partnership that had served both the Church and the dictator for many years. The Pope and Mussolini brims with memorable portraits of the men who helped enable the reign of Fascism in Italy: Father Pietro Tacchi Venturi, Pius’s personal emissary to the dictator, a wily anti-Semite known as Mussolini’s Rasputin; Victor Emmanuel III, the king of Italy, an object of widespread derision who lacked the stature—literally and figuratively—to stand up to the domineering Duce; and Cardinal Secretary of State Eugenio Pacelli, whose political skills and ambition made him Mussolini’s most powerful ally inside the Vatican, and positioned him to succeed the pontiff as the controversial Pius XII, whose actions during World War II would be subject for debate for decades to come. With the recent opening of the Vatican archives covering Pius XI’s papacy, the full story of the Pope’s complex relationship with his Fascist partner can finally be told. Vivid, dramatic, with surprises at every turn, The Pope and Mussolini is history writ large and with the lightning hand of truth.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "Politics",
    "Biography",
    "Italy",
    "World War II"
  ],
  "author": "David I. Kertzer",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/22856197-the-pope-and-mussolini"
}