{
  "title": "What She Lost And Found",
  "description": "***This has relaunched on February 4th, 2019! It's freshly edited and revised for your reading pleasure. There is a bonus chapter in Nathan's POV. And there's a brand new book cover!***When you are faced with challenges, what matters most ishow you choose to deal with them. That determines your fate…Her life seemed perfect. Her childhood best friend Christina was like a sister to her. Wherever she was, Christina was usually nearby. It should have been a wonderful beginning to adulthood during her freshman year of college. Unfortunately, two horrible nights shake her world to the core. Innocence is stolen, lives are shattered, and a young life is lost. Nothing will ever be the same again for Daniela.Daniela Franco finds it difficult to trust others after a horrible ordeal she experienced in her hometown. With a past that relentlessly controls her life, she decides to protect herself by never allowing anyone to get close enough to destroy her again. Daniela stays focused on work and school while staying away from the college party scene. She keeps a tiny circle of friends which keeps her safe, but life has a way of changing things.Her secrets from the past begin to slowly resurface and threaten to rock her world again in the dark and destructive way it did years earlier. Can Daniela face the demons from her past that are determined to finish what was started? Will the people she has grown to trust survive her secrets as well as their own?Changes are certain with new friendships, chances to build trust again, the possibility of finding love, and experiencing intimacy the way it is meant to be.Daniela must try to live with what she lost and with what will soon be found…Word Count: 91K +**Mature Content Warning** Contains some profanity, mature situations, and strong sexual content that may not be suitable for all readers. Recommended for readers ages 18+**",
  "genres": [
    "New Adult",
    "Romance"
  ],
  "author": "M.L. Garcia",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/22857114-what-she-lost-and-found"
}