{
  "title": "Getting Dirty",
  "description": "Travis Bennett is exactly the kind of guy Lauren Davis has been avoiding for the past nine years. Religiously. Stubbornly. Successfully. She knows too well how easy it is to let lust ruin perfectly laid plans. And a small town farmer with no ambitions beyond the borders of his own cornfield is not going to change her mind. She's got important stuff to do. Her company is literally working to stop world hunger. Her plans are much bigger than Sapphire Falls. No matter how hot those farmers might be.The problem is--Lauren is falling in love. With Sapphire Falls. To kick her sudden desire to buy a welcome mat and start baking pies, she asks Travis to help her get over her crush. She wants him to show her what life in the small town is really like behind all the sweetness and sunshine and remind her that there's no place for French manicures and Gucci heels on the farm.Travis has everything he wants or needs--a quiet, simple life in his hometown, a successful farm and his friends and family all around. A hoity-toity city chick who looks down on everything from the local coffee to his favorite music is the last girl he wants sticking around. So he agrees to her crazy plan. He can definitely show her the less-than-glitzy, rough-around-the-edges side of Sapphire Falls. In fact, things just might get downright dirty.You should know that this book contains a hot country boy who talks like a country boy (yep, all the bad words), a sassy city girl who also talks like a country boy sometimes, sexy scenes that don't leave much to the imagination, references to bisexuality, references to many facets of small town living, and a lot of dirt... of all kinds.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Audiobook",
    "Chick Lit",
    "Amazon",
    "Small Town Romance"
  ],
  "author": "Erin Nicholas",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/22858983-getting-dirty"
}