{
  "title": "Legend: The Incredible Story of Green Beret Sergeant Roy Benavidez's Heroic Mission to Rescue a Special Forces Team Caught Behind Enemy Lines",
  "description": "The unforgettable account and courageous actions of the U.S. Army’s 240th Assault Helicopter Company and Green Beret staff sergeant Roy Benavidez, who risked everything to rescue a Special Forces team trapped behind enemy linesIn Legend, acclaimed bestselling author Eric Blehm takes as his canvas the Vietnam War, as seen through a single mission that occurred on May 2, 1968. A twelve-man Special Forces team had been covertly inserted into a small clearing in the jungles of neutral Cambodia—where U.S. forces were forbidden to operate. Their objective, just miles over the Vietnam border, was to collect evidence that proved the North Vietnamese Army was using the Cambodian sanctuary as a major conduit for supplying troops and materiel to the south via the Ho Chi Minh Trail. What the team didn’t know was that they had infiltrated a section of jungle that concealed a major enemy base. Soon they found them¬selves surrounded by hundreds of NVA troops, under attack, low on ammunition, and stacking the bodies of the dead as cover in a desperate attempt to survive the onslaught.When Special Forces staff sergeant Roy Benavidez heard the distress call, he jumped aboard the next helicopter bound for the combat zone without hesitation. Orphaned at the age of seven, Benavidez had picked cotton alongside his family as a child and dropped out of school as a teen before joining the Army. Although he was grievously wounded during his first tour of duty in Vietnam and told he would never walk again, Benavidez fought his way back—ultimately earning his green beret.What followed would become legend in the Special Operations community. Flown into the foray of battle by the courageous pilots and crew of the 240th Assault Helicopter Company, Benavidez jumped from the hovering aircraft and ran nearly 100 yards through withering enemy fire. Despite being immediately and severely wounded, Benavidez reached the perimeter of the decimated team, provided medical care, and proceed¬ed to organize an extraordinary defense and rescue. During the hours-long battle, he was bayoneted, shot, and hit by grenade shrapnel more than thirty times, yet he refused to abandon his efforts until every survivor was out of harm’s way.",
  "genres": [
    "History",
    "Military Fiction",
    "Nonfiction",
    "War",
    "Biography",
    "Military History",
    "Audiobook"
  ],
  "author": "Eric Blehm",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/22856189-legend"
}