{
  "title": "Books of the Century: A Hundred Years of Authors, Ideas, and Literature",
  "description": "Books of the Century, modestly subtitled A Hundred Years of Authors, Ideas, and Literature, is a fine and firm rebuff to anyone who has ever thought the New York Times Book Review the stodgiest of institutions. Sifting through the archives, the editors have come up with a wealth of killer critiques, beginning with an ambivalent notice of The Spoils of Poynton and ending with Martin Amis's ecstasy over Underworld. Many of the reviews feature matches made in editorial heaven: Randall Jarrell on e.e. cummings, Welty on E.B. White's classic Charlotte's Web, and Joan Didion on John Cheever's Falconer. But the essays and interviews are just as enticing. Henry Bech interrogates his creator, John Updike; Isaac Bashevis Singer catechizes Laurie Colwin (\"Are you trying to convince me that I'm a big shot?\"); and Philip Roth asks Milan Kundera the burning question, \"What does sex mean to you as a novelist?\"  But Books of the Century is not just a greatest hits. It's also a priceless compendium of misses and major mortifications. Applause to whoever decided to include numerous admissions of error under the hilarious heading \"Oops!\" No one should feel guilty for seeking these out first. In the TBR's early years, for instance, Bloomsbury was twice a whipping boy: E.M. Forster gets slammed for Howards End in 1911 and nine years later Virginia Woolf's The Voyage Out has little \"to make it stand out from the ruck of mediocre novels.\" And judging from the weak parody it's afforded, The Catcher in the Rye was not initially a critical darling: Salinger \"should've cut out a lot about these jerks and all that crumby school.\" But what are we to make of the fact that as the decades draw on, there seem fewer and fewer Oopses? Apparently the Times Book Review is not just getting older, it's getting better. In any case, by making us aware of the exhilarations of reading and thought, Books of the Century more than lives up to its subtitle. --Kerry Fried",
  "genres": [
    "Reference",
    "Nonfiction",
    "Books About Books",
    "Criticism",
    "Writing",
    "Literary Criticism",
    "Literature"
  ],
  "author": "Philip F. Turner",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/2285641.Books_of_the_Century"
}