{
  "title": "Getting Serious About Getting Married: Rethinking the Gift of Singleness",
  "description": "\"Singleness is… the kind of gift that makes us cringe and smile politely while we desperately search for a gift receipt.\" Singleness is a \"gift;\" at least that's what we've been taught. But if singleness is a gift, then why does it make us feel so miserable so often? Does God really want his children to embrace a gift they resent so much? Debbie Maken proposes that marriage is the fundamental design and structure for life that God chose for his people. She argues that the church needs to reemphasize the importance of the gift of marriage. This book issues a challenge to churches in their teaching and attitudes toward singleness and to believers in their understanding of God's intentions regarding marriage. \"One of the most urgent questions facing today's generation of young Christians is this-does God really intend for us to make marriage a priority? Confusion reigns in this area of the Christian life. Far too many young Christians sideline marriage, delay marriage, and avoid marriage in an extension of adolescence that is truly unique in human history. Now comes Debbie Maken with sound advice, serious thinking, and an honest approach to this question that will help all Christians think about our responsibility to get serious about getting married. This book should be a must-read for all Christian young adults-and for all who love them.\"- R. Albert Mohler, Jr. , President, The Southern Baptist Theological Seminary \"This book will be life-changing for the singles who read this, as Debbie so aptly pokes holes in all those evangelical church myths about why singles should be 'content.'\"- Julia Duin , assistant national editor, The Washington Times",
  "genres": [
    "Relationships",
    "Marriage",
    "Christian Living",
    "Nonfiction",
    "Christianity",
    "Theology"
  ],
  "author": "Debbie Maken",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/1136418.Getting_Serious_About_Getting_Married"
}