{
  "title": "Find the Good: Unexpected Life Lessons from a Small-Town Obituary Writer",
  "description": "As the obituary writer in a spectacularly beautiful but often dangerous spit of land in Alaska, Heather Lende knows something about last words and lives well lived. Now she’s distilled what she’s learned about how to live a more exhilarating and meaningful life into three find the good. It’s that simple--and that hard.Quirky and profound, individual and universal, Find the Good offers up short chapters that help us unlearn the habit--and it is a habit--of seeing only the negatives. Lende reminds us that we can choose to see any event--starting a new job or being laid off from an old one, getting married or getting divorced--as an opportunity to find the good. As she says, “We are all writing our own obituary every day by how we live. The best news is that there’s still time for additions and revisions before it goes to press.”Ever since Algonquin published her first book, the New York Times bestseller If You Lived Here, I’d Know Your Name, Heather Lende has been praised for her storytelling talent and her plainspoken wisdom. The Los Angeles Times called her “part Annie Dillard, part Anne Lamott,” and that comparison has never been more apt as she gives us a fresh, positive perspective from which to view our relationships, our obligations, our priorities, our community, and our world.An antidote to the cynicism and self-centeredness that we are bombarded with every day in the news, in our politics, and even at times in ourselves, Find the Good helps us rediscover what’s right with the world.“Heather Lende’s small town is populated with big hearts--she finds them  on the beach, walking her granddaughters, in the stories of ordinary peoples’ lives, and knits them into unforgettable tales. Find the Good is a treasure.” —Jo-Ann Mapson, author of Owen’s Daughter“ Find the Good is excellent company in unsteady times . . . Heather Lende is the kind of person you want to sit across the kitchen table from on a rainy afternoon with a bottomless cup of tea. When things go wrong, when things go right, her quiet, commonsense wisdom, self-examining frankness, and good-natured humor offer a chance to reset, renew, rebalance.”  —Pam Houston, author of Contents May Have Shifted“With gentle humor and empathy [Lende] introduces a number of people who provide examples of how to live well . . . [ Find the Good ] is simple yet profound.”  — Booklist“In this cynical world, Find the Good is a tonic, a literary wellspring, which will continue to run, and nurture, even in times of drought. What a brave and beautiful thing Heather Lende has made with this book.” —John Straley, Shamus Award winner and former writer laureate of Alaska“Heather Lende is a terrific writer and terrific intimate, authentic, and as quirky as any of her subjects.” —Marilyn Johnson, author of The Dead Beat",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Self Help",
    "Audiobook",
    "Essays",
    "Book Club",
    "Biography"
  ],
  "author": "Heather Lende",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/22859550-find-the-good"
}