{
  "title": "Phoenix",
  "description": "No author can shock readers quite like bestselling author Chuck Palahniuk (\"Fight Club,\" \"Choke,\" \"Damned\"), whose meditations on the darkest depths of the American ego have been known to induce fainting fits in his audiences. Palahniuk channels both Stephen King and John Cheever in this singularly sinister and hilarious short story, straight from the passive-aggressive front lines of modern marriage, where a wife's frustration, along with the family cat, become weapons of mass destruction.Rachel married Ted because he was uncomplicated and loyal. But he was also devoted to his wretched house (done up in black granite, black appliances, even black dishware) and his first love, an old, flatulent cat named Belinda Carlisle. Once Rachel becomes pregnant, Ted reluctantly agrees to move and give up the cat. But the house doesn't sell, and Belinda Carlisle still haunts their every day the creature becomes fatter and more malodorous. When the house burns to the ground in a freak conflagration and the couple's daughter, April, is born blind soon thereafter, the marriage is never the same again. Only on a business trip three years later does Rachel begin to reckon with the damage.In an Orlando motel room far from Ted and April, Rachel Is her simple-minded husband more vindictive and manipulative than even Rachel could have imagined? How far will she go to keep the upper hand—a bit of emotional and physical torture, perhaps? Will she win the battle, only to lose so much else?If all is fair in love and war, there are few contemporary writers better equipped than Palahniuk to travel the extremes, right to the chilling intersection of \"I do\" and \"I'm damned.\"ABOUT THE AUTHORChuck Palahniuk is the author of \"Fight Club\" and \"Choke,\" as well as ten other novels—most recently \"Damned\"—and two books of nonfiction. Shooting will begin this summer on the film version of his novel of linked stories, \"Haunted.\" His forthcoming novel \"Doomed\" will be released later this year, as will the award-winning short film \"Romance,\" an adaptation of his work by the director Andy Mingo.PRAISE FOR CHUCK PALAHNIUK\"Chuck Palahniuk's rightful place is among literary giants. He combines the masculinity of Ernest Hemingway, the satirical bent of Juvenal and the attitude of Lenny Bruce.\" —Greensboro News & Record\"[Palahnuik] has a singular knack for coming up with inventive new ways to shock and degrade.\" —The New York Post\"Palahniuk [follows] a long tradition of high morbidity that links recent nihilists like Will Self and Bret Easton Ellis back to Ballard and William S. Burroughs, and beyond them, to the original literary Skeletor, de Sade—in whose writing a roiling disenchantment with the world is underpinned by a vivid, pimple-squeezing self-disgust.\" —The New York Times\"Funny, always on the edge of reality and bloodied by the profound horror of narcissism.\" —Playboy",
  "genres": [
    "Fiction",
    "Short Stories",
    "Horror",
    "Humor",
    "Contemporary",
    "Dark",
    "Literature"
  ],
  "author": "Chuck Palahniuk",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/22859357-phoenix"
}