{
  "title": "Broken Road",
  "description": "It is often said that time heals all wounds. The words are spoken like a promise... A vow. These words are said to people who have been beaten down to their lowest state. To the poor souls who have nothing left to lose. Whispered into the ear of a grieving daughter, told with a shrug to a man who has nothing left to live for.  These are dangerous people.  The down-trodden. The grieving. The ones who love more people dead than alive.  The words should never be uttered. Not to the ones who have no solid ground on which to stand upon, no rail in which to clasp. The white-knuckled moments of life have come to be expected rather than feared.  \"Time heals all wounds.\"  The words are an insult. A slap in the face... and around here, they'll get you hurt. For Averi McClain and her husband Colt, there were few deeper insults.  In the wake of Black Horse's death, a war has erupted. The Seventy Devils are scattered and on alert, gnawing at the bit for the go-ahead to strike. They would not hesitate to spill the blood of anyone who stood in their way of recompense. They knew they would need to act fast if they wanted to come out on top. Colt was not the kind of guy that you slept on. He'd stop at nothing to protect his family and he was lethal whether he was heavily armed or going toe to toe, bare knuckled beat-down style. Colt did have Black Horse's blood coursing through his veins, after all. But then, so did Jimmy, and he is ready to show everyone that the apple didn't fall far from the tree... in fact, they appear to have formed on the same poisoned branch.  As leader of the Devils, Jimmy had seventy miscreants to do his bidding - and three goals in which he needed to achieve:  1. Avenge Black Horse 2. Kill Colt McClain and Randy Ford 3. Take Averi for his own  Jimmy has another thing coming if he thinks victory is easily won. Will Colt and Averi's broken road end in tragedy? Or will they be the ones to banish the devils straight to hell? When the demons of the past rise up, can Colt and Randy face them fearless and determined? Whatever happens, don't expect Colt and Randy to stand alone. Buckle up. The broken road makes for one hell of a ride.",
  "genres": [
    "Dark",
    "Suspense",
    "Romance",
    "Romantic Suspense",
    "Contemporary Romance",
    "Amazon",
    "Contemporary"
  ],
  "author": "Addison Kline",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/22859383-broken-road"
}