{
  "title": "Empire of Deception: The Incredible Story of a Master Swindler Who Seduced a City and Captivated the Nation",
  "description": "It was a time of unregulated madness. And nowhere was it madder than in Chicago at the dawn of the Roaring Twenties. As Model Ts rumbled down Michigan Avenue, gang war shootings announced Al Capone’s rise to underworld domination. Bedecked partygoers thronged to the Drake Hotel’s opulent banquet rooms, corrupt politicians held court in thriving speakeasies, and the frenzy of stock market gambling was rampant.Enter a slick, smooth-talking, charismatic lawyer named Leo Koretz, who enticed hundreds of people (who should have known better) to invest as much as $30 million--upwards of $400 million today--in phantom timberland and nonexistent oil wells in Panama. It was an ingenious deceit, one that out-ponzied Charles Ponzi himself, who only a few years earlier had been arrested for a pyramid scheme. Leo had a good run--his was perhaps the longest fraud in history--and when his enterprise finally collapsed in 1923, he vanished. The Cook County state’s attorney, a man whose lust for power equaled Leo’s own lust for money, began an international manhunt that lasted almost a year. When finally apprehended, Leo was living a life of luxury in Nova Scotia under the assumed identity of a book dealer and literary critic. A salacious court hearing followed, and his mysterious death in a Chicago prison rivaled the rest of his almost-too-bizarre-to-believe life.A rip-roaring tale of greed, financial corruption, dirty politics, over-the-top and under-the-radar deceit, illicit sex, and a brilliant and wildly charming con man on the town and then on the lam, Empire of Deception has it all. It’s not only a rich and detailed account of a man and an era; it’s a fascinating look at the methods of swindlers throughout history. Leo Koretz was the Bernie Madoff of his day, and Dean Jobb shows us that the American dream of easy wealth is timeless.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Biography",
    "Crime",
    "American History",
    "Audiobook"
  ],
  "author": "Dean Jobb",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/22859560-empire-of-deception"
}