{
  "title": "Wolf of Stone",
  "description": "Dalton Black, a Canis lupis full of guilt and anger, never expected to find his true mate. Perhaps already slipping into madness, he had resigned himself to the fact that he would walk the earth without the other half of his soul. He was convinced that his sins were enough to keep the Great Luna from giving him such a blessing. He knew it was probably better that way. His past was as dark as his name and after three centuries of running from it, the memories were finally catching up to him. But all of those resignations evaporated when he saw her broken and bloodied body lying on that later. Though the man didn’t recognize her, the wolf did. Through battle and bloodshed, he was able to save her from the evil that held her captive, but now he would need her to save him from himself.Jewel Stone was wholly unaware of the ancient bloodlines of Gypsy Healers, mates to Canis lupis and protectors of the packs – much less that she carried that blood herself. But when a beautiful but deadly woman showed up in her home and ripped her from her realm, she knew her life would never be the same. Her mother, Gem, a fortune teller, had warned her that something was coming, that her life was about to change dramatically, but like everyone else, Jewel had dismissed her as a crazy person.Jewel was the laughing stock of her school simply because Gem was her mother. And up until now, her life was one big disappointment after another. Instead of heeding her mother’s warning, she hid in her books, burying herself behind knowledge, both fact, and fiction. She escaped into worlds created by others and filled her mind with facts of every kind in an effort to push away the hurtful words that others bombarded her with. Despite all of her knowledge and all of her fantastical stories, she never dreamed her own future would be full of adventure, danger, passion, and the possibility of unconditional love. As she lay unconscious after her first bloody encounter in the fae realm, her only chance of survival lay in the hands of a man scarred by his past, disfigured both emotionally and physically, and beyond the reach of any who had tried to help him.Can two broken people, who carry the other half of each other’s souls, span the chasm between them and restore the innocence ripped from both their lives? Will, they let the promise of healing love overcome the difference in age and experience and the separation of species and realms? Or will they give in to the fear and doubt that would keep them from one another for eternity?",
  "genres": [
    "Paranormal",
    "Young Adult",
    "Fantasy",
    "Werewolves",
    "Romance",
    "Paranormal Romance",
    "Supernatural"
  ],
  "author": "Quinn Loftis",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/22864523-wolf-of-stone"
}