{
  "title": "The Arroyo",
  "description": "Isaac is tired to the bones. He keeps his head down and looks after his family, but every two years the sick fear comes around again as the Feds arrive for a new harvest of kids.It’s Trace’s last sweep; he’s about to serve out his term of slavery. One last run and then… what? A life alone, with his books and music? He’s seen far too much of the dark side of human nature to think that’s a possibility.Trace and Isaac both know happy ever after doesn’t grow in the parched desert. Maybe together they can change that.This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. Dear Author,I always knew it was a possibility. Have known since childhood that they could take me someday. The slave traders have been sweeping the area for weeks now but I didn’t think they’d want me. They usually take girls and if they take boys they’re younger, blonder… prettier. There’s not usually a demand for someone who looks like me and has reached the ripe, old age of twenty-four. But I was wrong. Someone did want me. I’m so fucked.One last sweep of this dirt water town and I can get back to my life. My books, my music, my art and my life that doesn’t revolve around grabbing kids to sell to the highest bidder. I hate this shit. One last run. My debt will be paid and I’ll be free from that son of a bitch who grabbed ME as a kid. Maybe then I can finally stop thinking and dreaming. Turn off those dark desires that swirl in my head and wake me up at night in a cold sweat. I’m not HIM. I will never be HIM. My last fucking run and it all goes to shit when some guy, trying to be the hero, gets in my face. He’s too old, too dark, too inked… but God help me I want him.I don’t know what I was thinking when I stood up to him. I just wanted the kid to have half a chance at getting away. He’s so angry. I screwed up his quota and now I’m going to pay for that. He told me to get clean. EVERYWHERE. Then he gave me a thick chain with a padlock on it and told me to chain myself to the table when I was done. Something about “inspecting the merchandise”. I’m so fucked.Photo Description: A dark-haired, young man crouches naked in the corner of a bathtub, beneath a spray of water. White tiles and chrome fittings surround him. A heavy chain with a sturdy padlock is draped over his right shoulder, above a large tribal tattoo on his bicep. The man protects his head and chest with his arms, cowering, as he apprehensively meets the gaze of the viewer staring down at him.This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Dark",
    "BDSM",
    "Dystopia",
    "Romance",
    "Science Fiction",
    "Abuse"
  ],
  "author": "M. Caspian",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/22859913-the-arroyo"
}