{
  "title": "Canyon of Deceit",
  "description": "A rescue team searches for a missing young girl and suspects all is not as it seems in this high-stakes romantic suspense novel from the author of Lethal Standoff and Facing the Enemy.When wilderness survival expert Therese Palmer receives a frantic phone call from former colleague Professor Rurik Ivanov, she is shocked by the news that his young daughter, Alina, is missing—and that Rurik wants Therese’s help finding her. She’s sure Rurik hasn’t given her the whole story . . . especially since he refuses to report the kidnapping to the police. Yet with a child’s life hanging in the balance, Therese can’t turn down this mission. She knows the clock is ticking and she can’t do this alone.Therese reaches out to Texas Ranger Blane Gardner, whom she met seven months ago during one of her training courses in wilderness survival skills. Blane’s specialized training and background with the Crisis Negotiation Unit make him uniquely prepared for this search-and-rescue mission. He agrees to help Therese and to accept Rurik’s terms to keep Alina’s disappearance quiet, and as the two begin working together, Therese is determined the spark growing between them won’t distract from their mission to save Alina.Traversing deep into the desert of Guadalupe Mountains National Park, Alina’s last known location, Therese and Blane struggle to separate truth from lies within the mix of intel they’re receiving. As they close in on answers that suggest the involvement of Russian organized crime and a high-profile international assassination attempt, they must fight to rescue Alina before she becomes an innocent casualty of a much bigger plot—no matter the risk to their own lives.-A thrilling Christian contemporary novel with themes of courage and resilience from award–winning author DiAnn Mills-Perfect for fans of clean, action-packed romantic suspense-Includes discussion questions for book clubs",
  "genres": [
    "Christian Fiction"
  ],
  "author": "DiAnn Mills",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/228601396-canyon-of-deceit"
}