{
  "title": "The Wisdom of Perversity",
  "description": "I should have told. Julie’s I would have saved dozens of others. Jeff, Julie, Sam, the academy kids, the Huck Finn boys, everyone else was ignorant or greedy or scared or confused or overwhelmed by bullies, but I was strong enough—I could’ve pushed him away. I did push him away. I saved myself and let everyone else suffer. Me and the god of creation—we’re the villains of this story.Brian and Jeff were best friends, growing up together in New York City in the late 1960s. Then something happened that drove a wedge between them, ending both their friendship and their childhood, something that neither ever spoke about . . . at least until their shared secret resurfaced some forty years later, forcing them to reunite and, along with Jeff’s cousin Julie, to face the consequences of their years of silence.In The Wisdom of Perversity, Rafael Yglesias, the critically acclaimed, bestselling novelist and screenwriter and the author of A Happy Marriage, winner of the Los Angeles Times Fiction Prize, and Fearless, the basis for the cult film by the same name, has crafted a novel that tells the stories of three childhood friends who join together as adults to acknowledge the ways in which their lives were altered by the actions of a predator, a predator who now, many years later, has been exposed by more recent victims yet is on the verge of escaping punishment--thanks to his wealth and influence.Damaged in different ways by the events of the past but all sharing the same feelings of guilt and anger for allowing this man to go unpunished, leaving him free to abuse others, Julie, Jeff, and Brian band together to force a public outcry that will assure that he will finally face justice. With a tone that cleverly mixes humor with stark reality, The Wisdom of Perversity is a groundbreaking novel that by giving a voice to the youthful victims of sexual abuse will inspire both praise and debate.“Many contemporary works of fiction are bold,but few are this courageous . . . Rafael Yglesias has written a frightening, evocative, and intensely compassionate novel that manages somehow to do the impossible,shedding light on one of the darkest corners of this human theater.” —Helen Schulman, author of This Beautiful Life“The sly courage, the deft intelligence, and the fierceness of vision that we, his fans, have come to expect from a Raphael Yglesias novel all blaze brightly forth—and cast very dark shadows—in The Wisdom of Perversity. ” —Michael Chabon, Pulitzer Prize–winning novelist",
  "genres": [
    "Fiction",
    "Abuse"
  ],
  "author": "Rafael Yglesias",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/22859562-the-wisdom-of-perversity"
}