{
  "title": "Shame: How America’s Past Sins Have Polarized Our Country",
  "description": "The United States today is hopelessly polarized; the political Right and Left have hardened into rigid and deeply antagonistic camps, preventing any sort of progress. Amid the bickering and inertia, the promise of the 1960s -- when we came together as a nation to fight for equality and universal justice -- remains unfulfilled.As Shelby Steele reveals in Shame , the roots of this impasse can be traced back to that decade of protest, when in the act of uncovering and dismantling our national hypocrisies -- racism, sexism, militarism -- liberals internalized the idea that there was something inauthentic, if not evil, in the America character. Since then, liberalism has been wholly concerned with redeeming modern American from the sins of the past, and has derived its political legitimacy from the premise of a morally bankrupt America. The result has been a half-century of well-intentioned but ineffective social programs, such as Affirmative Action. Steele reveals that not only have these programs failed, but they have in almost every case actively harmed America's minorities and poor. Ultimately, Steele argues, post-60s liberalism has utterly failed to achieve its stated true equality. Liberals, intending to atone for our past sins, have ironically perpetuated the exploitation of this country's least fortunate citizens.It therefore falls to the Right to defend the American dream. Only by reviving our founding principles of individual freedom and merit-based competition can the fraught legacy of American history be redeemed, and only through freedom can we ever hope to reach equality.Approaching political polarization from a wholly new perspective, Steele offers a rigorous critique of the failures of liberalism and a cogent argument for the relevance and power of conservatism.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Race",
    "American History",
    "Sociology",
    "Philosophy"
  ],
  "author": "Shelby Steele",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/22859445-shame"
}