{
  "title": "Chasing Pavements",
  "description": "The Wolfsbane Sieges have begun.Wolfsbane, a plant known to annihilate an entire Werewolf race is also the cure for a deadly disease that has spread in the Elven realm. After centuries of living peacefully away from war and desolation, the Elves are forced to come back to the mortal world in order to cure their people. There’s only one problem: the Werewolves guard the Wolfsbane and will not give it up without a fight.Elirana Carpathiamin is a beautiful, intelligent Elf maiden who discovered the healing properties of Wolfsbane. She lives without emotion, as all Elves are supposed to do, but when she stumbles upon the one Werewolf who turns her perfect life upside down, things get really complicated. Not only does she question the intentions of her own people, but her loyalty is also tested the more she encounters the playful, flirtatious, attractive Werewolf, Chase Hawthorne.Chase lives by his own rules. Being the son of the Beta wolf, he is dominant, bored, and unhappy with his mediocre life. When he figures out the Elves have returned and are trying to steal Wolfsbane, he is determined to discover why. He never expected to come in contact with an Elf who has the power to bring out powerful feelings in him he’s never felt before.When lack of communication, prejudice, and misunderstandings occur between the Werewolves and Elves, bitter enemies are made and the fight for Wolfsbane turns into bloody battles. Despite the laws and numerous differences between the two races, Chase and Elirana fight to prevent the war raging around them. Can Elirana and Chase’s forbidden love be enough to stop the sieges or will they be forever separated by opposition and merciless hatred?Note: Chasing Pavements is the first book in a spin-off of the Healer Series. Chase and Elirana also appear as background characters in that trilogy. Chasing Pavements can be read as a stand-alone novel. It is not necessary to read the Healer Series.",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Fae",
    "Shapeshifters"
  ],
  "author": "Kayla Jo",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/22873525-chasing-pavements"
}