{
  "title": "Picnic in Provence: A Memoir with Recipes",
  "description": "The bestselling author of Lunch in Paris takes us on another delicious journey, this time to the heart of Provence. Ten years ago, New Yorker Elizabeth Bard followed a handsome Frenchman up a spiral staircase to a love nest in the heart of Paris. Now, with a baby on the way and the world's flakiest croissant around the corner, Elizabeth is sure she's found her \"forever place.\" But life has other plans. On a last romantic jaunt before the baby arrives, the couple take a trip to the tiny Provencal village of Céreste. A chance encounter leads them to the wartime home of a famous poet, a tale of a buried manuscript and a garden full of heirloom roses. Under the spell of the house and its unique history, in less time than it takes to flip a crepe, Elizabeth and Gwendal decide to move-lock, stock and Le Creuset-to the French countryside.When the couple and their newborn son arrive in Provence, they discover a land of blue skies, lavender fields and peaches that taste like sunshine. Seduced by the local ingredients, they begin a new adventure as culinary entrepreneurs, starting their own artisanal ice cream shop and experimenting with flavors like saffron, sheep's milk yogurt and fruity olive oil. Filled with enticing recipes for stuffed zucchini flowers, fig tart and honey & thyme ice cream, Picnic in Provence is the story of everything that happens after the happily ever after: an American learning the tricks of French motherhood, a family finding a new professional passion, and a cook's initiation into classic Provencal cuisine. With wit, humor and scoop of wild strawberry sorbet, Bard reminds us that life-in and out of the kitchen-is a rendez-vous with the unexpected.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Travel",
    "Food",
    "France",
    "Cooking",
    "Biography"
  ],
  "author": "Elizabeth Bard",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/22875075-picnic-in-provence"
}