{
  "title": "Immoral",
  "description": "Book 4 of the multi-episode series The Cage Sessions  Summer T-storms are rolling through Miami...  Annika is enjoying a level of sexual freedom she never imagined, reaching new heights of deviant ecstasy with Jasmine and Isabella.  Despite all this steamy fun, Annika's heart is with Damien, who is still torn to pieces over a dark secret in his past... a secret that prevents him from truly being with her.  Then Annika receives a mysterious phone call implicating Damien in a crime. She investigates, uncovering clues that suggest he is not the man he claims to be.  But when Damien allows Annika to peek inside his world and shares the traumatic events of four years ago, she is swept away. On a trip to his place in South America, the truth is revealed... about not only what happened but who Damien really is inside his soul.  WARNING: My books are the raw, unfiltered vision of a slightly schizophrenic, sex-obsessed, vodka-swilling \"living contradiction\" with profanity issues. They are often unrealistic (translation: FUN) depictions of what life would be like if erotic romance fantasies came true, so sometimes... gasp!... things happen that aren't \"realistic\". (You know, kind of like how dull boring everyday life is realistic. Seriously, do you want to read about that?) If you are offended by the excessive use of dirty words, crass descriptions, or crude stream-of-consciousness writing laced with potty-mouthed expressions and graphic descriptions of non-traditional carnal delight, then you need to RUN from my writing right now! Don't say you weren't warned. (Oh, and you'd better be over 18! Don't even think about buying my books if you aren't.)  Approximate length: 20,000 words (a novella)  This is the fourth title in a series. There IS a cliffhanger ending. You have now been warned about that too.  There is also a heavy emphasis on pansexuality, including a T/F scene and a M/F scene. Do not read if this offends you.  Themes: Erotic romance, new adult, rock star, alpha male, tattoos, body piercings, transsexual, pansexual, controlling parent, sex positive, sexual freedom.",
  "genres": [],
  "author": "Skylar Cross",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/22874177-immoral"
}