{
  "title": "The Rebel Trap",
  "description": "Federal union hunts boys … boy begs for Annabelle’s help … Annabelle has audio implants, contact cameras, and no privacy … helping could destroy her family.“This book is a great stand-alone … plenty of plot twists to keep your attention.” – Bri MastersHelping a boy escape may not have been Annabelle Scott’s smartest move. Her military commander assigns her an undercover mission to spy on local police and gives her audio implants and contact cameras to hear and watch everything she does.Perfect for fans of the Hunger Games, Divergent, and Maze Runner. The Rebel Trap is the second book in a science fiction thriller series in which a young woman is drafted into the elite military to enforce laws she believes are wrong.A second American Civil War ended in a shaky stalemate with the country divided into the “civilized” Federal Union and the warlord-controlled Outland. Annabelle lost her biological parents to the conflict when she was little and was adopted by a member of the Union’s political opposition. The loss of her parents and her adoptive mom’s opposition leads Annabelle to be rebellious in a society where conformity is everything and disobedience is punished.Drafted into the elite military to capture escaped boys, she stayed true to her conscience by helping Morgan to escape, but there are consequences. He hacks her implants to plead for her help to rescue his brother from a heavily guarded geek institute. Suspected of helping Morgan and with her mom in the opposition, Annabelle risks getting the boy and his brother killed, her mom framed for treason, and her and her sister imprisoned, killed, or sent to the Outland as slaves.Unable to get either her commander or Morgan out of her head, Annabelle can’t confide in anyone, which tears at her bond to her sister and mom. As a pawn in a bigger game, who and what can Annabelle trust, including whether her mission is the commander’s vendetta? Can she find a way to help Morgan and discover the link between an attempted assassination of her mom, the geek institute, and her corrupt police captain without leading Morgan into a trap or destroying herself and her family?",
  "genres": [
    "Dystopia"
  ],
  "author": "Lance Erlick",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/22873354-the-rebel-trap"
}