{
  "title": "From the Horse’s Mouth",
  "description": "Have you met him? Maxwell D. Kalist is his name. Medium height, medium build. Walks slowly with a tricky gait using an off-white cane made from three gorilla femur bones fused end-to-end. The lower bone is dirty because of contact with the ground; the upper is rounded and slicked regularly by the motion of his molesting, oily palm. Kalist walks this way and employs the cane because he suffers from a slight difference in leg length. Greyish teeth protrude over his thin, lower lip, but they’re not unclean. His upper lip has a delicate cleft to it, as does his palate. He only wears socks occasionally, but he always wears mauve – a dark mauve with a sense of kidney to it.Gottfried Baumauer, Ridley Obelmäker and Dimitri Pissec are stuck in a dead-end job they secretly loathe – and suspicious deviant Maxwell D. Kalist is their boss. When sexy new recruit, Caitlyn Brichacek, arrives their working world is tipped slowly upside-down. Bravery, lies and decency are the first threads that begin to unravel. After that, it’s anyone’s game.“Witty, wild and relentlessly noir.”“Elegant but brutal.”“Almost every character is sickeningly hateful, cowardly and ultra-manipulative.”From the Horse’s Mouth #1 is the first in a series of loosely related short stories with interconnecting themes and secrets. All the wrong people are in power, there is widespread corruption and deceit and the least expected outcomes happen, often at the hands of the least expected people. Author Krueger clearly hates certain office environments and what they can do to people. She takes our deepest, darkest fears and translates them into an unbearable, darkly comic pseudo-reality. Not for the faint-hearted; it’s punishingly nasty – verging on the grotesque at times – but it’ll make you split your sides laughing.",
  "genres": [
    "Thriller",
    "Contemporary",
    "Short Stories",
    "Humor"
  ],
  "author": "Carla H. Krueger",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22878766-from-the-horse-s-mouth"
}