{
  "title": "Ангелы на льду не выживают: Том 1",
  "description": "Прыжок. Еще прыжок. Холодная сталь коньков молнией рассекает голубой лед… Фигурное катание - красивый и изящный спорт. Миллионы людей с замиранием сердца внимают выступлениям наших фигуристов. И вот, в этот сказочный мир мрачной тенью врывается жестокое убийство. Застрелен Михаил Валентинович Болтенков - тренер высшей категории, человек-легенда, мастер, взрастивший не одного чемпиона. Тело обнаружено у дома его коллеги Валерия Ламзина. Свидетели подтверждают: тренеры встречались перед убийством, они ругались и угрожали друг другу… Дело, как говорится, \"в шляпе\". Но у Насти Каменской и ее друзей с Петровки - Антона Сташиса и Романа Дзюбы - свое мнение на этот счет. Им открывается правда о бесчеловечностях и цинизме, пропитавших голубой лед. Лед, на котором ангелы не выживают…Новый захватывающий роман Александры Марининой - это одновременно остросюжетная психологическая драма и серьезный разговор о коррумпированности большого спорта. С трибун мы видим красивое зрелище. А под трибунами - в раздевалках, в кабинетах спортивных сановников, в тесных тренерских комнатах - происходят события жуткие и циничные. Иногда спортивные дрязги заканчиваются убийством… Талантливый тренер детской спортивной школы подозревается в убийстве другого тренера - своего давнего врага. Следователь уверен в виновности задержанного на 100%. Но юные спортсмены, их родители, директор школы считают, что арест любимого тренера - страшная ошибка. Однако эта коллизия - лишь вступление к многослойной напряженной драме. Найти выход из преступного лабиринта под силу лишь АНАСТАСИИ КАМЕНСКОЙ. АЛЕКСАНДРА МАРИНИНА ЗНАЕТ, О ЧЕМ ПИШЕТ. Прежде чем взяться за криминальный роман о мире фигурного катания, она буквально с головой погрузилась в этот водоворот спортивного азарта и отчаяния.",
  "genres": [
    "Russia",
    "Mystery",
    "Crime"
  ],
  "author": "Alexandra Marinina",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/22879037"
}