{
  "title": "Sudan",
  "description": "Slavery. Brutality. A father’s love. By the spring of 2001, two million Sudanese tribal people had been systematically annihilated by their radical Muslim government for refusing to renounce their Christian faith. But that’s not why American human rights photojournalist Ron Wolfson is risking his life there. He’s investigating whispered reports of women and children in chains, more than 300,000 of them, auctioned off to the highest bidder. One of those children is Akin, the eleven-year-old daughter of Idris Apot. Snatched by the Murahaleen raiders who butchered her village, the little Dinka girl is jammed into a boxcar with other kidnapped children and transported 500 miles north to the slave market. Idris goes after her—on foot!—and forms an unlikely alliance with the American journalist. Together, Ron and Idris face the savage retaliation of a ruthless Arab slave trader who has even worse plans for them than a brutal beating. Hours before their execution, their only hope lies in placing their lives and Akin’s fate into the hands of an injured orphan boy and a blood-thirsty mercenary. Award-winning journalist and bestselling suspense novelist Ninie Hammon has captured what really happened in Sudan during the radical Muslim regime--in all its violence and brutality—in a powerful novel based on Christianity Today’s true story about a father’s quest to rescue his daughter. If you’re willing to look modern-day slavery in the eye—Hammon will take you there. She’ll introduce you to a world of fast-paced action and heart-stopping suspense. Sudan will make you question what you thought you knew about the depravity of man and the fierceness of a father’s love. And it will challenge what you believe about the power of hope itself.Sudan is part of Ninie Hammon's Based on True Stories Collection-- three stand-alone suspense novels that are all based on events that really happened--the story of slave-trading in Sudan, dope growing in Kentucky and a West Virginia dam collapse. While they are not exact biographical accounts, they are as real as what actually did happen. Sometimes the best way... the only way to tell the truth is with fiction.GOODREADS AND AMAZON.COM READERS' PRAISEI encourage you to read this life-changing Kindle eBook. Get angry! Get upset! Be grossed out! Somewhere a Sudanese mother is waiting for someone to reach out a helping hand, for her children's sake. Mel “@MamaBuzz” The worst thing about this book is that it isn't completely fiction. It grabs you by the throat and won't let you put it down until you've read the last page. You will hug your children closer after reading. K-Mor This book is not for the faint of heart - it deals with the atrocities committed in Sudan. Ninie weaves a spell-binding tale. One of the things I love about Ninie's books is that she does not feel the need to spruce everything up and make it pretty. E.L. Jenkins “Love to Read” \"Sudan\" captured my attention from the first page, and I read through the entire story in two days. This is gripping, emotional storytelling. Bestselling author Eric Wilson, Top 100 Amazon Reviewer",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "War",
    "Historical",
    "Sudan",
    "Africa",
    "Crime"
  ],
  "author": "Ninie Hammon",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/22882548-sudan"
}