{
  "title": "The Body Tourist: a Memoir",
  "description": "In 1983, Shavin graduated from college with a BA in psychology. It had been a difficult venture that included an expulsion, a multitude of transfers, and a four-month institutionalization for depression and anorexia. By the time it was over, she was convinced she was cured, and that it was time to start curing others. I’m ready, she told her parents, her therapist, her friends—all of whom shook their heads in horror at her 95-pound frame. But she was undaunted. She had landed a job as a counselor in a halfway house for drug and alcohol addicts. She knew better than anyone what it took to become a happy, functioning adult.Or so she thought. As you might suspect, the burden of self-contempt, faulty logic, and interpersonal turmoil that are the character traits of depressive disorders and addictions do not miraculously disappear once medication and therapy have taken effect. Where, then, do these dangerous obsessions go once a person sets foot on the road to recovery?For Shavin, they lived on beneath the radar of her supposed newfound health, disguising themselves in the falling-down houses she happily moved into and dangerous neighborhoods she somehow didn’t fear. They announced themselves in the deeply flawed men she professed to adore, the ordinary sex she could not have, the food rituals she thought were normal, and most profoundly, in her inability to acknowledge her father’s illness and encroaching death.While many writers have written candidly and eloquently about their struggles with depression, addictions, and eating disorders, those stories usually conclude once there is progress toward recovery. Beyond recovery there is another story, one that is about how we re-join the world, and, in the living years that follow the darkness, pursue a life that is creative, engaged, and deeply felt in our bones. This is the territory of The Body Tourist.",
  "genres": [
    "Nonfiction",
    "Mental Health",
    "Memoir",
    "Psychology"
  ],
  "author": "Dana Lise Shavin",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/22882818-the-body-tourist"
}