{
  "title": "Іван Мазепа: Художньо-документальна книжка",
  "description": "Художньо-біографічна книга про гетьмана Лівобережної України крім життєпису, містить цікаві документи: вірші, думи Івана Мазепи, любовні послання Мазепи до юної Мотрі Кочубей, дипломатичне листування, універсали та інше.Зміст:Шевчук Валерій. Від упорядника.Костомаров Микола. Іван Мазепа. (Переклав Микола Ілляш)Борщак Ілько. Людина й історичний діяч.Лист Жана Балюза про Мазепу«Gazette de France» про Мазепу (1687-1708)Французький дипломат барон Адольф д’Авріль на могилі Мазепи (1876)Брайчевський Михайло. Правда і вигадки.Марочкін Василь. Бунтівний гетьман.Луців Василь. Життя і смерть гетьмана Мазепи на чужині.Пилипчук Ростислав. Микола Садовський над могилою Івана Мазепи.Вірші на герб Івана Мазепи. (Переклав Валерій Шевчук)Туптало Данило. Про гербовий Місяць, Зорю та про руно орошене.Яворський Стефан. «Куди, Місяцю, роги ти сунеш, скажений!..»«Глянь, як в Русії міцно святу віру знають…»Стаховський Антоній. «Милість ясновельможна, пане Іоанне…»«Від Якова яскра Зоря в гербі сяє…»Молитва за гетьмана МазепуДо зображення БогородиціХрестВірші Івана Мазепи. «Ей, Іване, поповичу-гетьмане…» (Переклав Валерій Шевчук)Дума пана гетьмана МазепиЛисти Івана Мазепи до Мотрони Кочубеївни. (Модернізація мови Валерія Шевчука)Універсали, листи, донесення цареві від Івана Мазепи про всілякі події на Україні та за її межами. (Переклав Валерій Шевчук)Універсал проти ПетрикаДонесення гетьмана Івана Мазепи цареві про Семена ПаліяДипломатичні оборудки гетьмана Івана МазепиДонесення І. Мазепи царю про становище в порубіжних з Україною державахДонесення І. Мазепи царю про стосунки з МолдавієюТурботи гетьмана про військо й народЛист Івана Мазепи до Запорозького Низового військаЛист до ніжинської старшиниУніверсал гетьмана І. Мазепи у Миргородський полкЛист до боярина ШеїнаПричини повстання гетьмана Івана Мазепи, викладені ним самимЛист до стародубського полковника Івана Скоропадського",
  "genres": [
    "History"
  ],
  "author": "Ivan Mazepa",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/22882646"
}