{
  "title": "Lend Me Your Ears: Great Speeches in History",
  "description": "The third edition of an internationally best-selling collection of classic and modern oratory, Lend Me Your Ears offers numerous examples of the greatest speeches ever delivered—from the ancient world to the modern. Speeches in this edition span a broad stretch of history, from General George Patton inspiring Allied troops on the eve of D-Day to Pericles’ impassioned eulogy for fallen Greek soldiers during the Peloponnesian War; and from Jesus of Nazareth’s greatest sermons to Ruth Bader Ginsburg’s fiery speech in response to the Bush vs. Gore decision that changed the landscape of American politics in our time.  Editor William Safire has collected a diverse range of speeches from both ancient and modern times, from people of many different backgrounds and political affiliations, and from people on both sides of history’s greatest battles and events. This book provides a wealth of valuable examples of great oratory for writers, speakers, and history aficionados.   ABOUT THE AUTHOR  Author, journalist, and Presidential speechwriter William Safire (1929-2009) is believed by many to be America’s most influential political writer and columnist. The author of a well-known syndicated political column for the New York Times, he was also known as a speechwriter for President Nixon. He was a frequent guest on NBC’s “Meet the Press;” and won the Pulitzer Prize for his commentary regarding corruption charges leveled against Bert Lance, Director of the Office of Management and the Budget, during the Carter Administration in 1978. He was a member of the Pulitzer Board starting in 1995, and Chief Executive and Chairman of the Dana Foundation. In 2006, President George W. Bush awarded Safire the Presidential Medial of Freedom.",
  "genres": [
    "History",
    "Nonfiction",
    "Reference",
    "Politics",
    "Writing",
    "Classics",
    "Communication"
  ],
  "author": "William Safire",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/22881756-lend-me-your-ears"
}