{
  "title": "Baby",
  "description": "Alternate cover for this ASIN can be found hereDeep in the hills of Drag Creek Kentucky, there is a group of outlaws, whose love of moonshine and motorcycles runs in their blood. They are known as the Black Rebel Riders' MC. My name is Baby, you came along for the ride during my father's journey, and this is my story, better put on your brain bucket, it is going to be a bumpy ride... It is a long hard road to find your way home; hearts will be broken and mended along the way, this is no ordinary love story.For as long as Baby can remember, there has only ever been one way of life— the Black Rebel way. When the leadership of the club changes hands, Baby finds herself caught between the only man she desires and her oath to her father. As the struggle for power within the club begins, Baby finds herself unable to choose between love and loyalty.\"How do you stay when the person who owns your heart, body and soul belongs to another? Where do broken hearts go, when home is all you know, but home is where he is...?\"Rumor is clear about one thing in her life, she doesn't want to be any mans property. She fights with everything in her being to deny the attraction she feels to a man, who belongs in the world she is desperate to escape. Rebel Black is at a crossroad in his life, faced with choices he isn't prepared to make. The life he was born to lead is within his grasp, all he has to do is take it, but everything comes with a price. Will Rebel make the ultimate sacrifice and deny what's in his blood for a chance at love, or will he pay with his heart and become the man that he fears...Rumor is clear about one thing in her life, she doesn't want to be any mans property. She fights with everything in her being to deny the attraction she feels to a man, who belongs in the world she is desperate to escape. Rebel Black is at a crossroad in his life, faced with choices he isn't prepared to make. The life he was born to lead is within his grasp, all he has to do is take it, but everything comes with a price. Will Rebel make the ultimate sacrifice and deny what's in his blood for a chance at love, or will he pay with his heart and become the man that he fears...",
  "genres": [
    "Romance",
    "Dark",
    "Adult",
    "Erotica",
    "Contemporary",
    "Abuse"
  ],
  "author": "Glenna Maynard",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/22882754-baby"
}