{
  "title": "Last Call",
  "description": "My name is Mariah Huxley, and I’m a reformed slut. The only year I attended college, I spent on my back, living on a constant high from sex and booze. That was, until my wayward ways left me with the greatest responsibility one could have. Fast forward seven years, and I am Mariah Huxley, a twenty-six-year-old, single mother, living in the unforgiving world as an adult. I work hard to take care of us, and I am happy. I’m happy until I close my eyes at night and realize that’s not the case at all. Something is missing. My soul, my body, and my heart—they've all been drained of anything exciting. That’s until the night I finally allow myself to live, and I meet him. When he touches me, I awaken and slowly become resurrected. However, will the relationship we've started be one I’m prepared to handle? I am strong enough to endure many things, but am I strong enough to sustain this connection with him.My name is Jason Cain, and I am who I am. Some may call me determined, but the majority of society views me as a prick. To them, I’m an arrogant jerk who defies the standard rules of life to get what I want. I couldn't agree more. I was born on the streets, loved by no one. The only person I had was me. Once adopted by the state, I vowed to myself to become a man of means. I vowed to become a man who would be respected from the moment I walked in a room.Fast forward several years, and I am Jason Cain, a thirty-two-year-old, successful entrepreneur, and self-made millionaire. My life is all about time, which includes making gut reaction business deals, growing my empire, and being in the company of beautiful women. I have time for only one thing, my satisfaction. That’s until the night she strolls into my nightclub.When she touches me, I feel every wall I’ve built up slowly crumble around me. I disintegrate. However, will the relationship we've started be one I can leave behind? Or will I lose the part of me that’s kept me going my entire life? Am I strong enough to survive her? Or will this be our last call?",
  "genres": [
    "Romance",
    "Amazon",
    "New Adult"
  ],
  "author": "M.S. Brannon",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/22881487-last-call"
}