{
  "title": "The Record of the Saints Caliber: Book 1: Stoking Fires",
  "description": "A young boy named Rook is thrust into a chilling world of corruption and depravity after his parents die, leaving him alone with his baby sister. In a kingdom of famine where people starve to death while nobility live in luxury and abundance, the one thing Rook has to hold on to are the stories and legends of the heroic Saints Caliber, warrior-saints of the Goddess, Aeoria. Girded in armor made of the very stars, the Saints Caliber are supposed to be the ones who protect the people of the world. However, terrible truths start to emerge and the heroes Rook once looked up to turn out to be the villains of nightmares. For young Rook, hope comes in the form of a demon named Bulifer. Too young to defend himself against the enemies that surround him, and too young to take care of his baby sister, Rook has little choice but to sell his future to the beast. Rook is determined to keep his humanity, but will the demon force him to commit sins from which his soul can never escape? There is one Saint who has a chance to turn the order of the world upside down. Haunted by the memories of the terrible acts she is forced to perpetrate, Saint Nuriel tries to numb herself to the world around her. Will she expose the evils that saturate the Order of the Saints Caliber, or will her slow fall into corruption twist her into the same cruel servant of abominable kings as all her peers? For Nuriel, hope might lay within a strange woman named Celacia who wears armor made from the very scales of the ancient Dragon God of Death. Wherever Celacia walks, only death follows in her wake. Earth withers beneath her feet, stone crumbles in her presence, flesh rots to dust. But from this woman whose very touch is death might Nuriel find a new beginning? The Record of the Saints Caliber is an epic, page-turning adventure that forces the characters to reveal dark truths about themselves and the world they live in, in order to find salvation.",
  "genres": [
    "Fantasy"
  ],
  "author": "M. David White",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/22881192-the-record-of-the-saints-caliber"
}