{
  "title": "Manan",
  "description": "'He closes his eyes and finds today’s date floating towards him. Shimmering in the darkness, swivelling – like the text on the Windows 95 screensaver. It seeps in through his forehead and gets absorbed. 23-04-98 is now a part of him. Today’s date, a Saturday, when the first sign of what he so eagerly awaited has appeared . . .' It is the summer of 1998 in a sleepy Indian town that is jut awakening to the age of information, and young Manan has acquired his first official sign of puberty. The world around him, though, refuses to understand the magnitude of the moment. Instead, it teases him by offering all sorts of temptations, posing all sorts of quandaries. And it doesn't help that his friends are taller and larger than him, that his parents fight all the time, that his sister no longer has time for him, that the love of his life barely knows that he exists. With an earnest voice that is colourfully candid about middle-class India and the tyranny of family relationships, authority figures and peer pressure, Manan is a tragicomedy of growing pains and the triumphs of a stoic heart.'Parikh demonstrates a deft hand at painting a picture of life in middle-class India in the late ’90s and lends his protagonist a voice that rings true, page after page. Manan is an original look at a young boy’s world, much like the first Adrian Mole books. A keen observer, a compulsive problem-solver and a dreamer with his feet firmly on the ground, Manan Mehta is the boy we all know, the person we all can be.’ – The Indian Express‘An earnest voice runs through this 194-page book, making it a breeze. Read it not for rediscovering childhood, but if you remember that a lot of what you did as a teen revolved around love and sex.’ - Hindustan Times‘Mohit Parikh’s debut novel is an eloquent, sensitive and restrained look at the onset of puberty. Its earnest protagonist stays with you long after the last page is turned.’ – The Sunday Guardian‘Parikh exercises restraint throughout. The language, while descriptive, is never excessive or showy. Fragments such as “Incisors, molars, swallow” pithily describe Manan eating a snack. Students play “answer sheets aeroplane” after class. Not only do you get what Parikh means, better still you see it in the mind’s eye.’ – Mint Lounge",
  "genres": [
    "India",
    "Young Adult",
    "Contemporary"
  ],
  "author": "Mohit Parikh",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/22885411-manan"
}