{
  "title": "رمال العرب",
  "description": "خلال السنوات التي عشتها في الجزيرة العربية، لم أفكر مرة في تأليف كتاب عن رحلاتي، ولو فكرت لكان عليّ أن أحفظ آئنذٍ ملحوظات دقيقة كانت ستساعدني وتعرقلني في آن واحد؛ وبعد سبع سنوات من تركي جزيرة العربن عرضتُ بعض الصور على جراهام واطسون الذي ألحّ عليَّ بشدة أن أؤلف كتاباً عن الصحراء.لذلك وضعت هذا الكتاب الذي أعاد إلى ذهني بوضوح البدو الذين سافرت وإياهم، والبلاد الشاسعة الخالية التي قطعت فيها ما يقب من عشرة آلاف ميل على ظهور الجمال.لقد ذهبت إلى جنوبي الجزيرة في الوقت المناسب تماماً، وسيذهب غيري إلى هناك ليدرسوا علم طبقات الأرض وعلم الآثار والأطيار والنباتات والحيوانات، وليدرسوا إلى جانب ذلك أولئك العرب أنفسهم، إلا أنهم سينتقلون في سيارات، وسيتصلون بالعالم الخارجي عن طريق الهاتف، وسيأتون بنتائج أهمّ بكثير مما أتيت أنا بها، ولكنهم لن يعرفوا روح البلاد وعظمة العرب، ولو ذهب أحدهم الآن إلى هناك، بحثاً عن الحياة التي عشتها فلن يجدها، لأن الفنيين قد ذهبوا قبله منقبين عن البترول؛ والصحراء التي سافرت فيها تركت عجلات الشاحنات فيها آثاراً بغيضة، واتسخت ببقايا البضائع المستوردة من أوروبا وأميركا.إن البدو لم يكن لديهم أية فكرة عن عالم غير عالمهم، ولم يكونوا متوحشين جهلاء، بل على العكس، كانوا الورثة المتعصبين لحضارة قديمة جداً، ولقد وجدوا ضمن إطار مجتمعتهم هذا الحرية الشخصية والتهذيب النفسي الذي تاقوا إليه… أما اليوم فإنهم يدفعون خارج الصحراء إلى المدن، حيث لم تعد تكفيهم المزايا التي منحتهم الجلد والسيطرة في الماضي على قوى لا تُقْهر، كالجدب الذي طالما قتلهم في الماضي، وحطّم نظام حياتهم.ومنذ تركت جزيرة العرب، سافرتُ عبر شعاب كراكورام وهندوكوش في جبال كردستان وأهوار العراق، مدفوعاً دائماً إلى الأمكنة البعيدة، حيث لا تستطيع السيارات الوصول، وحيث لا يزال يعيش شيء من العادات القديمة، ولقد رأيتُ قسماً من أروع المناظر في العالم، وعشت بين قبائل عجيبة وغير معروفة، ولكن واحداً من هذه الأمكنة لم يهزني، كما فعلت صحراء الجزيرة العربية.ومنذ خمسين سنة لم تكن كلمة \"عربي\" تعني سوى قاطن في الجزيرة العربية، وقد اعتبرت مرادفة لكلمة بدوي، ورجال القائل الذين هاجروا من الجزيرة إلى مصر وغيرها وظلوا عائشين كالبدو فيها قد اعتبروا عرباً، بينما غيرهم من الذين أصبحوا مزارعين أو من سكان المدن لم يعتبروا كذلك، وإني لأستعمل كلمة عربي في هذا المعنى القديم، وليس بالمعنى الذي تحمله كلمة - حديثاً، أصبح كل من اتخذ العربية لغة له يشار إليه كعربي دون إهتمام بأصله.وعلى هذا، فإن البدو هم القبائل الرحل التي تربي الجمال في الصحراء العربية، والكلمة تعني \"الذين ليس لهم مستقر\"، وكلمة \"البدويون\" في صيغة الجمع قلما يستعملها أصحابها، وإني أفضل كلمة (بدو)، وقد استعملتها في تضاعيف الكتاب.وعندما يتكلم هؤلاء البدو عن أنفسهم يستعملون عامة كلمة العرب، وعند الإشارة إليهم استعملت كلمتي بدو وعرب دون تمييز، وكلمة البدو في اللغة العربية هي في صيغة الجمع والبدوي هو المفرد، ومن اجل البساطة، استعملت كلمة بدو للجمع والمفرد، وكي لا أشوش أفكار القارئ، أتبعت الطريقة نفسها في أسماء القبائل: راشد ومفردها راشدي، عوامر ومفردها عامري.",
  "genres": [
    "Travel",
    "Nonfiction",
    "History",
    "Adventure",
    "Biography",
    "Memoir",
    "Classics"
  ],
  "author": "Wilfred Thesiger",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/11369422"
}