{
  "title": "Westward Bound",
  "description": "A historical western cowboy romance novel about a mail order bride.** A clean romance novel **Claire O’Connor is the youngest of the three O’Connor sisters. Unlike her older siblings, Claire doesn’t have great skills in social niceties. Even though she tries to fit in, Claire will never be popular in the elite world in which she was born. Claire would much rather be in school or learning business strategy from her father than do anything else. When she travels to Montana for her sister Maddie’s wedding to Seth Samuels, she meets the youngest Samuels brother, Marcus.She’s attracted to his dark good looks and flashing gray eyes but knows he thinks of her as annoying kid who happens to be extremely intelligent. During the time she spends in Montana, she and Marcus develop an antagonistic relationship, which Claire purposely fosters to hide her crush on him. She dreams of snaring Marcus’ heart one day, and begins her secret mission as soon as she arrives back in Pittsburgh.Marcus Samuels’ wicked sense of humor, keen intelligence, and reckless streak endear him to most people-except Tessa and Maddie’s youngest sister Claire. When the O’Connor family comes west for Maddie and Seth’s wedding, it becomes apparent that she harbors ill will towards him. Marcus is relieved when Claire goes home to Pittsburgh, but there’s only a short reprieve until she starts sending letters to him that start debates about all things scholarly. He can’t resist the challenge and he responds.Three years later, their long distant debates continue. Claire has graduated from college and now turns her focus on making a life of her own. Marcus is part of that plan, but he doesn’t know that. When Maddie and Seth return to Montana after attending her graduation, Claire goes with them to put her plan into action.Marcus’ life is turned upside down by an unforeseen event that threatens to tear his family apart forever. Despite their antagonism, Marcus turns to Claire for help, unwittingly falling into her trap. Together they will face an uncertain future. Can they find the fortitude to withstand the tests that come their way or will they both end up with broken hearts?",
  "genres": [
    "Romance",
    "Westerns",
    "Historical Romance",
    "Historical",
    "Western Romance",
    "Fiction",
    "Historical Fiction"
  ],
  "author": "Linda Bridey",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/22886477-westward-bound"
}