{
  "title": "الطيبيون",
  "description": "رواية الطيبيون هي الرواية الأولى في العالم التي تسرف تفاصيل الحرب التي خاضها ملوك أسرة الأناتفة لأكثر من مئتي سنة لاسترداد المُلك لطيبة رغم كثرة الروايات العربية والأجنبية إلا أن أحدا لم يلتفت من قبل لهذه الأسرة المؤثرة بقوة في تاريخ مصر القديم والتي صنعت أسطورة \"طيبة\" التي يتحاكى عنها الأولون والآخرون ***\"أدهم العبودي\" مستقبل الرواية في مصر والوطن العربي، يكتب بلغة عالمية. لا ينافسه أحد، ولا يقاربه أحد في موهبته، له عالمه بخصوصيّته الفريدة، ولا أجد أنّ كاتبًا يمتلك مثلما يمتلك \"أدهم\" من تميّز.  (بهاء طاهر)أنا من اللذين تأسرهم التفاصيل، وأرى هنا عينًا لاقطة بمهارة وتفاصيل ممتعة وسرد مشحون. شكرًا للمتعة. (أمير تاج السّر)\"الطيبيون\" لغة مكتوبة كالأقانيم، إذ تجدها تنحت كلماتها وبها روح \"الكرنك\"؛ المعبد القديم. يمنحك \"أدهم العبودي\" معمارًا متفرّدًا، كما يمنحك رائحة وطعم الزمن وتقلّباته. رواية فارقة، ولغتها وصفية بامتياز. (محسن يونس)***من أجواء الرواية ....في سهاد المساء الرخيم، تخلد \"الكرنك\" إلى النوم، ربما مبكّرًا، ربما من شدّة السأم، إنّما تخلد إلاّ من أساطيرها التي لن تغفو متى ظلّ الزمن؛ تلك المحفورة في أذهان الأجيال وفوق جدران المعابد، ومن بعض الرجال الذين يخرجون لقضاء الأمسية في بار \"التِرس\" يحتسون البيرة وعرق البلح والزبيب ويدخّنون الحشيش. الأجواء هادئة تمامًا، والريح الخفيفة لم تزل تعبث بقمم النخيل الباسقة في كلّ المساحات، فيبدو وشيشها ملائمًا للسكون. كانت \"الكرنك\" غافية.. شاغرة.. إلاّ من هؤلاء، ومن \"ممدوح\" المحنّي فوق مياه \"الملاّحة\" يتشطّف من أشياء وأشياء، قديمها وجديدها، طالما تذكّرها فغاج فؤاده ونبض متقرّحًا. فمه يهمهم بالدعوات والأوراد، كدأبه في كلّ مساء. انتبه على لهاث \"عبيد\" المُقبل من بعيد، فاعتدل وبدا مغشيّ البصر، كأنّما دمعًا لم يزل مقترنًا بالدعوات شحيحة الأمل، مضى يستوضح ببصره، مطّ رأسه فبان له الطريق، ولمح جسد \"عبيد\" الآتي هرولة، كان وجهه مليئًا بالعرق وبالرعب، فاستقام ناهضًا، نفض عن يديه بقايا قطرات ماء الملاّحة، ومسح بكمّ جلبابه وجهه، بدا أنّ \"عبيد\" وجد أخيرًا من ينتزعه من فزعه، صاح بصوت عال من قبل حتّى أن يستشرف عن هوية \"ممدوح\": - الحقني، الحقني ربنا يبارك فيك. في برود تلقائي، وعلى مضض، وفي نبرة غير حافلة، قال \"ممدوح\":- خير...؟!وهمّ يزجره، لكن دنا \"عبيد\" منه، بسرعة رمى بجسده عليه كمن عثر على ضالّة مفقودة، كان يلهث مثل جرو، وكانت له رائحة قبو مغلق، أسمال جلبابه المتهرئ مليئة باتّساخات قديمة تبعث على التقزّز والقشعريرة، فغر \"ممدوح\" فاه، أدرك أنّ في الأمر خطبًا ليس هينًا.. \"وهل هذا وقته!\".. تطلّع للحظة نحو \"عبيد\" ولبث يأوي لتركيز واهن، إضاءة عامود النور في الأعلى الساقطة عليهما تكشف عن كلّ ملامح \"عبيد\" فيبدأ يستعيد بها كذلك تركيزه، خدّاه مرتّعان بشروخ محفورة واضح أنّها منذ زمن ليس بقريب، تركت فوق وجهه أمارات القبح وسمات اللصوصية، في الواقع هذه هي المرّة الأولى التي يتفحّصه فيها عن قرب، كان يراه قبلًا ككلّ أهل المدينة، واحدًا من أولئك اللصوص المدشّنين بالاحتقار، الذين يسطون على أحواش البهائم في العشيّة وتحت جنح الظلام، من دون أن يتمكّن من القبض عليه أحد، رغم أنّهم يعلمون بما لا يدع مجالًا لريب أنّ من يختلس بهائهم هو \"عبيد\" وعصابته، ذلك إن كانت له عصابة، كان يراه من بعيد ولا يحفل في التدقيق في ملامحه، يبتسم له ابتسامة فاترة على مضض، أو يرفع له يده نصف رفعة كأنّه يقول: (غور)، ثم يمضي عنه ببصره في امتعاض، إنّما ماله يشعر الآن أنّ عليه أن يشاطره الرعب الذي أفضى به إلى طريقه؟ ربما الفضول، وربما الشفقة، وربما القليل من التسرية. راح يتفحّصه بإمعان، لم يكن طويلًا ذلك الطول ولا نحيفًا كما بدا ذي قبل، ولا قبيحًا للدرجة، بل كان مرتجفًا خائفًا ممّا ينفي عنه هيبة أنّه لصّ ونطّاط بيوت، ضحك في نفسه ضحكة مفتقدة وقال: أنت حرامي بهائم، أدعى بالفعل أن تكون أكثر خزيًا وانكسارًا ورعبًا عند مقابلة الخلق، ولابد أنّ واحدًا ممّن سطوت على بهيمته الليلة يلاحقك بالسلاح. أخذ في التطلّع له وهو يرتجف مثل عريان في ليلة شتاء قارص، بشكل أكثر تدقيقًا، انتابه للحظة إحساس بالقرف، من وجهة نظر \"ممدوح\" سرقة البهائم أدنى مستويات الإجرام وأقلّها شرفًا. كان فم \"عبيد\" يدلق اللعاب من غير وعي أو اتّزان، وعيناه مغيّمتان لا تستقران في نظرة محدّدة، أكمل في تهدّج وفي لوعة:- أستاذ \"ممدوح\".. حمدًا لله. - مالك...؟! اهدأ...- \"عيط الله\"...ابتسم \"ممدوح\"، ربما أدرك في قرارة نفسه أيضًا منذ أن رآه بمثل تلك السحنة الشاحبة أنّ احتمال الخرافة وراء الحكاية ليس بناءٍ، الليل في \"الكرنك\" يحمل في ثنايا هدوئه ورونقه الكثير من شاكلة \"عبيد\"، هؤلاء الذين يقسمون أنّهم رأوا \"عيط الله\" فروّعهم، لم تكن المرّة الأولى التي يقابل فيها الفارّين منه، أو من غيره من شخوص الأساطير التي يختزلها المكان، إنّما لا يصدّق في الغالب إلاّ ما يستقر له وجدانه أو ما يرى بعينيه، أكمل \"عبيد\" كأنّه يهذي:- رأيته بعيني.. والله رأيته.. شكله أستغفر الله.. وشرّ الدنيا ينطّ من عينيه.. وأخذ يتلفّت حوله بنفس الفزع، ثم أضاف:- أظنني أضعته.. هه.. لن يخرج خلفي من المعبد.. ملعون ابن الكلب.. صح يا أستاذ \"ممدوح\"؟!",
  "genres": [
    "Fiction"
  ],
  "author": "أدهم العبودي",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/22887101"
}