{
  "title": "All Fired Up",
  "description": "Officer Shawn Everly patrols the Strip and one night, fireman Trent Marshall saves him when danger strikes. But it’s still uncertain whether Trent can save himself from getting his heart broken by Shawn.The party never ends on the Las Vegas strip but neither does the danger. Officer Everly is new to the beat, having recently relocated to Vegas from Los Angeles. Foot patrol on the Strip is a demanding assignment because he’s up close and personal with the public. But what he’d really like to do is get up close and personal with Station 32’s hunky fireman, Trent Marshall.Trent has been a fireman for over ten years and is dedicated to his job. He’s built tough and is a no-nonsense man of few words. At a local blood drive, Trent meets the handsome new officer on foot patrol but won’t let himself get too close. He’s lost love before when his policeman lover was killed in the line of fire.During an emergency, Trent’s over-protective instincts kick in when he believes Shawn is in harm’s way. He ends up embarrassing and angering Shawn in front of their fellow officers, which seems as though it will end any hope of Trent having a chance with the young man he can’t push from his mind. Shawn can’t decide whether he wants to punch or kiss Trent. Kissing wins. Once they spend some time together away from the stresses of their jobs, they find that they’re not just compatible—they’re combustible.But Trent can’t seem to accept that there are hazards that come with working in law enforcement. Right as they’re discovering how much they mean to one another, the danger escalates on the Strip. The underground vigilante group, The Citizens Against Immorality, have raised the stakes. Will Shawn and Trent be their next targets?Reader This book contains scenes of violence and the use of sex toys.Publisher's This book is best read in sequence as part of a series but can be read as a standalone.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Firefighters",
    "LGBT",
    "Mystery",
    "Erotica"
  ],
  "author": "Morticia Knight",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/22886530-all-fired-up"
}