{
  "title": "Stargazer",
  "description": "Set in modern day Hollywood. Celine has been crushing on her idol, Hollywood megastar Dare Montgomery (the most famous actor in the world) since grade school. She decides to make her dream come true and embarks on a mission: Become Mrs. Montgomery. Now, the road isn't exactly clear of tough competition as it is filled with starlets, supermodels, A-list actresses, socialites, name the breed, Dare has 'em all tucked nicely in his high-traffic bed. BUT, she has a secret weapon none of these women posses. Dare will be HERS. Carve that in stone!Burned out, bored and badass, Dare Montgomery meets his self-proclaimed No. 1 fan in the world. One look at this maddening smartass with a face and body that could launch a thousand dicks and he wants to play with her so badly. She's also dying to but preferably with a ring on her finger. A jaded player. An idealistic virgin heiress. A clash of the Titans waiting to happen.Dare and Celine meet in MEGASTAR (Stars Trilogy Book 1) and sparks immediately fly. She becomes his temporary secretary. Now Celine has an ulterior motive in working for this MEGASTAR: Marry him!. But it's easier said than done because Dare is a textbook case of narcissistic chauvinism. They are on opposing sides of the fence in lifestyle and perspectives but the sizzling attraction between them cannot be denied. Pretty soon, it's a blazing wildfire and they both give in to the demands of their passion.In STARGAZER (Stars Trilogy Book 2), the fire of their passion rages on. They indulge themselves and feed on their hunger for each other. Problem arises when idealistic Celine starts talking about soulmates and happy endings. Dare freaks out. He is a master of the mating game but the soul business? No thanks! But Dare has become addicted to Celine's presence in his life and he has to choose: keep his free-wheeling lifestyle or let her go because she is cramping his style with her fairy tale notions of happily ever after.",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "Eve Montelibano",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/22887787-stargazer"
}