{
  "title": "Hell On The Heart",
  "description": "Two men. One has goodness, the other only the appearance of it. Like flip sides of a coin, one represents every girl’s dream, handsome and rich. While the other lives an isolated existence, scarred and damaged from a life lived in the trenches. Both are hunters. Both are hunted. And both want the same woman.Czigany “Cezi” Romney is perfectly happy. Yes, she’d have liked to have graduated high school, perhaps even attended college and become a CSI rather than working for her father and Uncle as an asthmatic sidekick. But leaving Armadillo Creek would be impossible. A gypsy without family would be like a ship without a rudder - directionless, unable to function. Her family loves her, but struggle to contain their disapproval of her unorthodox behavior and worst of all, she’s still single, childless and her chances of marriage are waning quickly. Eighteen is practically over the hill. At twenty-six many doubt anyone would want her.At thirty-four, Stillwater is a seasoned federal agent who has come up through the military and special ops. His scarred face reflects the life of man dedicated to protecting his country. Currently FBPA Agent John Stillwater and his team suspect they are dealing with a nationwide white slavery ring, but lack evidence to prove it. A murder in a nowhere town in Texas leads John to investigate with his team, who are as close as any family, but still he’s careful not pry into their lives outside of work. John is not a monk. He likes women, but chooses those who understand his don’t bother settling in, you’ll be gone by the morning. But the missing women in his current case wear on his soul. His ability to initiate even a casual relationship is inhibited by how aware he has become of the dangers woman face with every guy they meet.Cain McIntosh’s career is making him rich. In his chauffeur-driven limo, his tailored suits, his ten thousand dollar watch and his private jet, Cain visits different towns each week and finds the girl of his dreams. Or so he says as he convinces her to come home with him and meet his family. Unfortunately, the girl who agrees to go, knowing she will be the envy of her friends, is never heard from again. His perfect operation grinds to a halt by a short gypsy woman who deflates his ego and a large Fed agent’s relentless pursuit.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Suspense",
    "Contemporary Romance",
    "Contemporary",
    "Thriller"
  ],
  "author": "Nancy Brophy",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/11369935-hell-on-the-heart"
}