{
  "title": "Absolutely, Positively",
  "description": "Unconventional Molly Abberwick, trustee of her late father's scientific foundation and owner of Seattle's Abberwick Tea & Spice Company, was mad enough to fire her new consultant, Dr. Harry Stratton Trevelyan. She'd hired him when the foundation had needed the advice of the best expert in America on new inventions. Brilliant, tall, and unexpectedly handsome Harry was the best--at getting under her skin. She had bubbled over about a device for lunar power. He shot it down. She went wild for a bright-eyed young inventor. Harry called him a con. They were getting nowhere fast when he suddenly invited her to his condominium for tea. There she was thinking of giving him his pink slip. There he was serving her Darjeeling, a sexy smile, a smoldering gaze, and an outrageous proposal--that thy have an affair!Harry had been burned before by love. He wanted no pulls on his heart, no intrusions on his time, no dizzying of his logical mind. But he couldn't get Molly Abberwick out from under his skin. His brilliant deduction: have a simple fling, \"just one of those bedroom things.\" It was a fail-safe formula for a no-commitment/no-demands affair. After all, the chemistry was right. What could go wrong?Everything, of course. Molly was ready to go to battle with Harry, not to bed with him. Worse, she believed only an absolutely, positively impossible man would think that a relationship could be planned, predicted, and run like a science project. But just when Molly was ready to let him have a piece of her mind--not her heart--she discovered that the eminent Dr. Trevelyan was not what he seemed.Harry turned out to be fascinating. First, there was his family, the Trevelyans, a long line of carnival owners, illusionists, and daredevils who ran the Smoke & Mirrors Amusement Company. Then there were the paranormal premonitions Harry denied having--on scientific grounds--but which brought him to Molly's side when a sinister prank exploded at her family mansion. And when the pranks escalated into violence and a mysterious the stalker threatened her life, Molly needed Harry's sixth sense, and his extraordinary family, to help. Sh needed Harry, not for just a week, not for just an hour, but forever in love.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Romantic Suspense",
    "Paranormal",
    "Suspense",
    "Fiction"
  ],
  "author": "Jayne Ann Krentz",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/113700.Absolutely_Positively"
}