{
  "title": "The Spectral Wilderness",
  "description": "It's a joy. . .to come nearer to a realm of experience little explored in American poetry, the lives of those who are engaged in the complex project of transforming their own gender... Oliver Bendorf writes from a paradoxical, new-world position: the adult voice of a man who has just appeared in the world. A man emergent, a man in love, alive in the fluid instability of any category. --Mark Doty, from the ForewordBest Poetry Book of 2014— Entropy Magazine30 Must-Read Poetry Debuts from 2015 — LithubSpectacular Books of 2015 — Split This Rock“Bendorf’s poems give us all we have ever wanted, to wake up and feel that the body we are in is ours, that the hands on the ends of our wrists—our body’s gates of tenderness—are large enough to hold in them all the things we have desired.” —Natalie Diaz, author of When My Brother Was An Aztec“Astonishing.” —The Literary Review“Oliver Bendorf’s poems draw unflinching attention to the process of making… Bendorf strips a poem to its scaffold with an honesty that is at once funny and unbearably sad.” —Blackbird“Bendorf’s collection indeed opens the door to a spectral wilderness, an otherworldly pastoral, a queer ecology endlessly transformed by possibility, grief, and the unruly wanting of our names and bodies. Stunningly lyrical and beautifully theoretical, The Spectral Wilderness is an invitation one cannot turn down; the book calls us to travel with Bendorf, to study the topography of becoming because ‘what we used to be matters’ in the way that language matters— however fleeting, however mistaken, however contradictory it might be.” —Stacey Waite, author of Butch Geography“What gorgeous and ravenous rackets Oliver Bendorf’s poems are made of; what a yearning and beautiful heart. ‘Lift a geode from the ground and crack me open,’ he writes, which is more or less what these poems do for me: break me open to what might sparkle and blaze, what might glisten and burn inside. The Spectral Wilderness is a wonderful book.” —Ross Gay, author of Against Which and Bringing the Shovel Down“The Spectral Wilderness is full of beautiful little bodies, written into being (into becoming) by a maker from whom we’ll continue to be amazed and enchanted.” —Lambda Literary",
  "genres": [
    "Poetry",
    "Queer",
    "Transgender",
    "LGBT",
    "Gender"
  ],
  "author": "Oliver Baez Bendorf",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/22891212-the-spectral-wilderness"
}