{
  "title": "Recombination",
  "description": "Seven Ecks thinks he is just like everyone else. He has no idea that as a young boy he was part of a group of children exposed to an illicit genetic experiment by the Skywatch Corporation, the aim of which was to create a genetically superior human. A few months before his 17th birthday, Skywatch comes to claim Seven as corporate property and he barely manages to escape -- at the cost of his parents’ lives. Desperate and confused, Seven disappears into the melting pot of migrant workers that travel the United States, harvesting switchgrass – the country’s largest remaining renewable resource -- at mega-plantations, in exchange for food and shelter. His goal is to reach Boston, a city where Skywatch has been banned from operating. He quickly realizes the corporation that claims him as its property wants him back, badly. They have even gone as far as to hire the world's best bounty hunter to bag him. With his freedom and possibly his very life at stake, Seven stays on the move until he befriends Zenny, an aged mercenary and the two settle down at a plantation to wait out the winter. The unlikely pair is forced to take on roles they never wanted. Zenny becomes the personal bodyguard of Lucas (the Plantations manager) and Seven is tasked with keeping a data-chip safe for Lucas – by having it implanted in his arm. After a severe beating from a masked thief leaves Seven on the brink of death, his latent genetic abilities begin to manifest. He finds himself faster, stronger and fearful of what cost these abilities may have on him physically and mentally. There is much more going on at the plantation than Seven and Zenny know, and when they get in over their heads they are forced to make a choice: flee or die. 'Recombination' is the first book in the 'Chronicles of Withmore City' series. Set in the dystopian future of 2085, mega-corporations control almost everything and destitute governments are fighting a losing battle for relevancy. Human cloning and brain mapping has been perfected, making death a mere inconvenience for the lucky minority wealthy enough to afford a clone. A new religion has sprouted up around human cloning, backed by the corporations that hold patents on it. Life teeters towards those with wealth and power, while those without reluctantly work as near-slaves for the corporations, in exchange for the scraps they are expected to survive on.",
  "genres": [],
  "author": "Brendan Butts",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/22890877-recombination"
}