{
  "title": "Priceless",
  "description": "“If you love the early Anita Blake novels by Laurel K. Hamilton, you will fall head over heels for The Rylee Adamson Series. Rylee is a complex character with a tough, kick-ass exterior, a sassy temperament and morals which she never deviates from. She’s the ultimate heroine. Mayer’s books rank right up there with Kim Harrison’s, Patricia Brigg’s, and Ilona Andrew’s. Get ready for a whole new take on Urban Fantasy and Paranormal Romance and be ready to be glued to the pages!”-Just My Opinion Book BlogFrom HiJinks Ink Publishing and Shannon Mayer comes The USA Today Bestselling RYLEE ADAMSON NOVELS beginning with PRICELESS (Book 1). With over 1 million books sold, Shannon Mayer proves once again she can dominate her genre right out of the gate.**Over 3600 5-star reviews!**“My name is Rylee and I am a Tracker.”When children go missing, and the Humans have no leads, I’m the one they call. I am their last hope in bringing home the lost ones. I salvage what they cannot.I’m on the FBI’s wanted list.I have a werewolf for a pet, a Witch of a best friend, and have no need for anyone else in my life.But when a salvage starts to spin out of control, help comes from a most unexpected direction. One that is dangerously dark, brooding, and doesn’t know a thing about the supernatural.One whose kisses set me on fire.Also available!Priceless (Rylee Adamson Book 1)Immune (Rylee Adamson Book 2)Raising Innocence (Rylee Adamson Book 3)Shadowed Threads (Rylee Adamson Book 4)Blind Salvage (Rylee Adamson Book 5)Tracker (Rylee Adamson Book 6)Veiled Threat (Rylee Adamson Book 7)Wounded (Rylee Adamson Book 8)Rising Darkness (Rylee Adamson Book 9)Blood of the Lost (Rylee Adamson Book 10)Alex (A Rylee Adamson Short Story)Tracking Magic (A Rylee Adamson Novella, 0.25)Elementally Priceless (A Rylee Adamson Novella 0.5)Guardian (A Rylee Adamson Novella 6.5)Stitched (A Rylee Adamson Novella 8.5)The Rylee Adamson EpiloguesRYLEE (Book 1)LIAM (Book 2)PAMELA (Book 3)",
  "genres": [
    "Urban Fantasy",
    "Paranormal",
    "Fantasy",
    "Vampires",
    "Magic",
    "Witches",
    "Supernatural"
  ],
  "author": "Shannon Mayer",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/22896193-priceless"
}