{
  "title": "Shadow of Death",
  "description": "\"A dark, compelling thriller that will keep readers turning the pages well past bedtime.\" - Kelley Armstrong, New York Best Time Selling Author. “A dark and gripping tale by a true mistress of supernatural fiction. Karen Dales brings fresh blood to the vampire genre.” —Michelle Rowen, National Bestselling Author Released from more than one hundred years of revenge, the Angel of Death is no longer a tool for the Grand Council of the Chosen. He is finally free to return to a semblance of a life with Father Paul Notus. Haunted by nightmares of his past misdeeds and failings the Angel wants nothing more than to be left alone. It is across the Atlantic, in a foreign country, that he joins Notus, taking up the mantle once more as a protector in a land where those who would see him dead have flourished. Corbie Vale has not forgotten what the Angel has done. His own burning need to see the Angel humiliated and Destroyed sets into motion a carefully seeded plan despite warnings of greater retribution. Now in Corbie’s territory, the Angel’s sword becomes the lure to a trap, one that changes the Angel by giving him what he never dreamed of – mortality. \"Dales doesn’t disappoint with 'Shadow of Death'...left me gasping in surprise... by far the best in the series so far and I will certainly be devouring any future additions.\" - Open Book Society \"Shadow of Death...takes you on a nail biting ride across the pond to her home town ... That never slows down and is as exciting on the first page as it is on the last... Ms. Dales I can only say one thing about Shadow of Death Book Two of the Chosen Chronicles and that is WOW! You have left me in suspense and teetering on the edge of a nervous breakdown!\" (5 Stars) - Sizzling Hot Books “The next installment in Karen Dales’ must read The Chosen Chronicles, is as impressive as the first...This is a fabulous story, well conceived and illustrated in such a way that the reader will not put it down until they’ve completed it...You cannot miss with Karen’s book. You will love it. If you haven’t read the first one yet, start there and then you too will be waiting impatiently for book number three. This is the kind of story that leaves you both begging for more...” (Siren Books Best Stone Review) - Siren Book Reviews “Oh wow, that is the only expression that can describe a great book. I can't wait for the next book in the Chosen Chronicles. I hope that there is a next book. I loved every minute of it...It leaves the reader anxious for more. I hope that other readers enjoy this beautiful, sometimes painful, and heartrending journey of the Angel that leads to peace as much as I did.” (5 Stars Top Pick) - Night Owl Reviews \"A distinctive and addictive voice in the paranormal genre, Karen Dales has once again delivered a must-read piece of excellence with Shadow of Death...This emotional and stirring chronicle of our hero’s life as he is forced into facing both his past and his future will no doubt make you a fan of this series and Karen’s ability to weave a tale full of rich history and vibrant prose. If you have not deduced by now, I love this series and cannot wait for Ms. Dales to get in front of her computer and deliver more tales of The Chosen.\" (5 Stars) - Bitten By Books \"A fresh and intriguing new look at the vampire mythos\" - Violette Malan, Author of the Novels of Dhulyn and Parno “For readers who adore textured layers in their literary tapestries, rich in colorful emotions, Kar",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Vampires"
  ],
  "author": "Karen Dales",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/11370708-shadow-of-death"
}