{
  "title": "The Universe in Your Hand: A Journey Through Space, Time, and Beyond",
  "description": "\"If Ms. Frizzle were a physics student of Stephen Hawking, she might have written THE UNIVERSE IN YOUR HAND, a wild tour through the reaches of time and space, from the interior of a proton to the Big Bang to the rough suburbs of a black hole. It's friendly, excitable, erudite, and cosmic.\"—Jordan Ellenberg, New York Times besteselling author of How Not To Be WrongQuantum physics, black holes, string theory, the Big Bang, dark matter, dark energy, parallel even if we are interested in these fundamental concepts of our world, their language is the language of math. Which means that despite our best intentions of finally grasping, say, Einstein's Theory of General Relativity, most of us are quickly brought up short by a snarl of nasty equations or an incomprehensible graph. Christophe Galfard's mission in life is to spread modern scientific ideas to the general public in entertaining ways. Using his considerable skills as a brilliant theoretical physicist and successful young adult author, The Universe in Your Hand employs the immediacy of simple, direct language to show us, not explain to us, the theories that underpin everything we know about our universe. To understand what happens to a dying star, we are asked to picture ourselves floating in space in front of it. To get acquainted with the quantum world, we are shrunk to the size of an atom and then taken on a journey. Employing everyday similes and metaphors, addressing the reader directly, and writing stories rather than equations renders these astoundingly complex ideas in an immediate and visceral way. Utterly captivating and entirely unique, The Universe in Your Hand will find its place among other classics in the field.",
  "genres": [
    "Science",
    "Nonfiction",
    "Physics",
    "Astronomy",
    "Space",
    "Popular Science",
    "Audiobook"
  ],
  "author": "Christophe Galfard",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/22892322-the-universe-in-your-hand"
}