{
  "title": "The Last Letter",
  "description": "\"Gripping historical fiction—A tale of two women finding meaning behind all that went wrong in their lives. A timeless tale of redemption with the best plot-twist at the end I've seen in a long, long time. Can't wait for book two!\" New York Times and USA Today bestselling author, Melissa Foster Katherine wouldn't have believed it if she hadn't found the letter... In the summer of 1905 Katherine Arthur's mother arrives on her doorstep, dying, forcing her to relive a past she wanted to forget. When Katherine was young, the Arthur family had been affluent city dwellers until shame sent them running for the prairie, into the unknown. Taking her family, including young Katherine, to live off the land was the last thing Jeanie Arthur had wanted, but she would do her best to make a go of it. For Jeanie's husband Frank it had been a world of opportunity. Dreaming, lazy Frank. But, it was a society of uncertainty--a domain of natural disasters, temptation, hatred, even death.    Ten-year-old Katherine had loved her mother fiercely, put her trust in her completely, but when there was no other choice, and Jeanie resorted to extreme measures on the prairie to save her family, she tore Katherine's world apart. Now, seventeen years later, and far from the homestead, Katherine has found the truth – she has discovered the last letter. After years of anger, can Katherine find it in her heart to understand why her mother made the decisions that changed them all? Can she forgive and finally begin to heal before it's too late? **Independent Publisher Awards** 2011 Gold Medal, Best Regional Fiction-Midwest **National Indie Excellence Book Awards** 2011 Finalist Award-Historical Fiction 2011 Finalist Award-Regional Fiction **USA Best Books 2011 Awards** Winner, Fiction--Western Finalist, Fiction--Historical Finalist, Best New Fiction **International Book Awards** 2011 Finalist Award-Historical Fiction 2011 Finalist Award-Best New Fiction",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Amazon",
    "Book Club",
    "Chick Lit",
    "Historical Romance"
  ],
  "author": "Kathleen Shoop",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/11370147-the-last-letter"
}