{
  "title": "Predator",
  "description": "\"Predator is a fast-paced, creepy page-turner! Bashman had me at the opening sentence and she's still got me. I want more!\" Nancy Holder, New York Times Bestselling Author, The Rules.The hunt is on! Sixteen-year-old Bree Sunderland must inject herself with an untested version of her father’s gene therapy to become a werewolf in order to stop a corrupt group of mercenaries from creating a team of unstoppable lycanthrope soldiers. When Bree went with her scientist father to Ireland, she thought it would be a vacation to study bog bodies. She never expected to fall in love with a mysterious young Irishman and certainly never expected to become the kind of monster her father said only existed in nightmares. Dr. Sunderland discovers that lycanthropy was not a supernatural curse but rather a genetic mutation. When they return home, her dad continues his research, but the military wants to turn that research into a bio weapons program and rogue soldiers want to steal the research to turn themselves into unstoppable killing machines. Bree’s boyfriend Liam surprises her with a visit to the United States, but there are darker surprises in store for both of them. As evil forces hunt those she loves, Bree must become an even more dangerous hunter to save them all. Bree will become the thing she hates, to protect those she loves!'Predator' gives the werewolf legend a couple of new spins by introducing the Benandanti (an actual folkloric belief that certain families of Italy and Livonia were werewolves who fought against evil), as well as a modern scientific approach to mutation and the science of transgenics. \"Every twist and fascinating revelation fell into place smoothly, with an ending that will leave readers wanting more. With this kind of originality on the page, it is exciting to speculate at the surprises Bashman will unveil next.\"  —Suspense Magazine",
  "genres": [
    "Young Adult",
    "Paranormal",
    "Horror",
    "Young Adult Paranormal",
    "Supernatural",
    "Werewolves",
    "Fantasy"
  ],
  "author": "Janice Gable Bashman",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/22891926-predator"
}