{
  "title": "Angel of Death",
  "description": "Winner of the Siren Books Award for Best Horror 2010 and the Siren Books Award for Best Overall 2010. The Vampires of London are being murdered and only the Angel of Death can save them. The Angel of Death has traversed the earth for over a thousand years, reaping souls, both foe and friend. His only traveling partner through the ages is his beloved mentor, Father Paul Notus. When Father Notus is captured and threatened with a gruesome death by the Mistress of London and her Vampires, the Angel is forced into a dark world of murder and deception to discover who is killing the Vampires of Britain. Coerced into a partnership with the Noble Fernando de Sagres, a Vampire of sadistic tastes, and joined by the beautiful and mortal Jeanie Stuart, the Angel seeks to uncover who is behind the genocide. Plagued by demons from his past and his increasing affections for Jeanie, the Angel walks a fine line between his heart and his fears. He discovers the culprits but at a high cost – the irrevocable discovery of what he truly is and the Destruction of one he loves. In Praise of The Chosen Chronicles “A dark and gripping tale by a true mistress of supernatural fiction. Karen Dales brings fresh blood to the vampire genre.” —Michelle Rowen, National Bestselling Author “For readers who adore textured layers in their literary tapestries, rich in colorful emotions, Karen Dales is one writer of vampire fiction they’ll want to read.” — Nancy Kilpatrick, The Power of the Blood, Vampire Stories of the New Undead “A fresh and intriguing new look at the vampire mythos.” - Violet Malan, author of The Novels of Dhulyn and Parno “...is a must-read for any fans of Twilight or other books in the popular Vampire genre.” - Oakville Today. “...one of the best stories by a new and upcoming writer that I have read...This tale was wonderfully written. Very few stories are the equal to this tale.” - Siren Book Reviews (5 out of 5) \"...a poignant and epic tale... a brilliant example of good overcoming and prevailing against evil and prejudice... an emotional ride of literary genius, both heart-warming and heartbreaking at the same time...\" - Bitten By Books (5 out of 5) \"a grand tale of eternal life and its many challenges...I greatly enjoyed Angel of Death by Karen Dales and ... recommend it...\" - Two Lips Reviews (5 out of 5) \"I would definitely recommend this book to vampire fans.. a good solid read for both Changeling and Angel of Death... I’m definitely looking forward to where Dales goes with this in the future.\" - Once Upon A Bookshelf “I was hooked...a good book to read on a cold and stormy day.”- Night Owl Reviews (4 out of 5)",
  "genres": [
    "Vampires",
    "Paranormal",
    "Urban Fantasy",
    "Horror",
    "Fantasy",
    "Angels",
    "Supernatural"
  ],
  "author": "Karen Dales",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/11370707-angel-of-death"
}