{
  "title": "Abiding in Mindfulness, Volume 2: On Feeling, the Mind & Dhamma",
  "description": "In the words of the Buddha, the four foundations of mindfulness (the four satipat­t­hana ) are \"the direct path for the purification of beings, for the surmounting of sorrow and lamentation, for the disappearance of dukkha (suffering) and discontent, for acquiring the true method, for the realization of Nibbana.\" Within the quintessential discourse called the Satipat­t­hana Sutta, we find the Buddha's seminal teachings about the practice of meditation.On Abiding in Mindfulness, Volume 2: On Feeling, the Mind & Dhamma, esteemed teacher and author Joseph Goldstein presents a nine-CD audio curriculum to reveal the deeper insights of this vital sutta―and how it serves to inform and guide your own daily practice.The Second Foundation of Mindfulness of FeelingsThe Buddha begins this pivotal section of the sutta with a rhetorical how does one abide contemplating feelings? Before you can answer this question, explains Goldstein, you must understand what the Buddha means by \"feeling.\" Returning to the Pali word vedana, he points out the qualities of \"pleasantness, unpleasantness, or neutrality\" that arise in every moment of experience. For it is close attention to each of these qualities that unlocks our deepest patterns of conditioning―and removes our greatest obstacles to liberation.From the crucial distinction between \"worldly\" and \"unworldly\" feelings to practical methods for \"de-conditioning\" habitual responses, Goldstein elucidates the Buddha's instructions for achieving a deeper happiness and ease of being through moment-by-moment mindfulness of feelings.The Third and Fourth Foundations of Mindfulness of Mind, Mindfulness of DhammasAs you continue your exploration of the Satipat­t­hana Sutta, Goldstein brings you to the third and fourth foundations of Mindfulness of Mind and Mindfulness of Dhammas (or \"categories of phenomena\"). Here, you will learn what it means to \"take responsibility for your own heart and mind\"―the central art of the third foundation―through the pragmatic discernment of skillful and wholesome mind states and their counterparts, and direct investigation of the higher states of mind, including \"concentrated\" and \"liberated\" mind, and more. Next, you progress through the beginning sections of the fourth foundation, with Goldstein's step-by-step guidance about working with the hindrances and the aggregates. Includes 35-page study guide. Abiding in Mindfulness, Volume 3, will contain remaining talks about the fourth foundation.The author's proceeds from this program will benefit the Insight Meditation Society's Forest Refuge retreat center.Course Discuss the second foundation of mindfulness of the feelings, including worldly and unworldly feelings• Discuss the third foundation of mindfulness of the mind, including a discussion of self-judgment, as well as the contracted and distracted mind• Explore the refrain of the including the mindfulness of reactivity, the mindfulness of arising and passing away, as well as the mindfulness of internal and external experience• Discuss the fourth foundation of mindfulness of the Dhammas, including mindfulness of the five hindrances (desire, aversion, sloth and torpor, restlessness, and doubt)• Explore the five aggregates, including material elements, feeling, perception and formations, formations and consciousness, as well as non-self",
  "genres": [
    "Buddhism",
    "Nonfiction",
    "Philosophy",
    "Spirituality",
    "Audiobook",
    "Self Help",
    "Religion"
  ],
  "author": "Joseph Goldstein",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/2289514.Abiding_in_Mindfulness_Volume_2"
}