{
  "title": "Westward Destiny",
  "description": "A historical western cowboy romance novel about a mail order bride. ** A clean romance novel ** Jamie Collins doesn't have much to live for in Walhalla, North Dakota. Her husband passed away two years ago and she has been working as a housekeeper on a ranch. Jamie's employers are difficult people to work for and she dreams of getting away from them and Cypress. She has a history with men and is ostracized by many of the townspeople. Jamie wants a better life but has no way to make that happen. Jamie comes across an ad in The Walhalla Press for mail-order-brides. She jumps at the chance to find a good man and secure a happy future. Ever the realist, she knows that the chances of making a love-match are slim, but she'll settle for a good man who is a good provider. She finds an advertisement from a younger Montana ranch hand that catches her eye and she sets her sights on him. It should be easy to wrap him around her little finger. Luke Samuels has had a rough couple of years. He's been jilted by the girl of his dreams and laid off from his employment with a local Dawson County, Montana ranch. His cousin Dean Samuels hires Luke on as a ranch hand. Luke sees how happy Dean and Tessa are together and wants that kind of happiness for himself. Even though he's painfully gun shy about the opposite sex, he's willing to take a chance to find a bride who's a sure thing. Leaving nothing to chance, he enlists the help of his cousin Marcus Samuels to help him write the perfect ad that will entice a willing female to come to Montana. When they meet, Luke is bowled over by the beauty with the emerald green eyes and auburn hair, but is instantly tongue-tied. Jamie is not sure how they're going to develop a relationship when he can barely talk to her, but she sets out to seduce the handsome man with the soulful brown eyes and sweet smile. A game of cat and mouse ensues and Jamie finds out that marrying Luke is easy, but capturing his heart is going to be harder than she anticipates.",
  "genres": [
    "Romance",
    "Historical",
    "Historical Romance",
    "Westerns",
    "Mail Order Brides",
    "Western Romance",
    "Fiction"
  ],
  "author": "Linda Bridey",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/22906752-westward-destiny"
}