{
  "title": "Out of the Light",
  "description": "Multi-award winning author. \"Doug Smith is, quite simply, the finest short-story writer Canada has ever produced in the science fiction and fantasy genres, and he's also the most prolific. His stories are a treasure trove of riches that will touch your heart while making you think.\" —Robert J. Sawyer, Hugo Award-winning author of Hominids and FlashForward \"A great storyteller with a gifted and individual voice.\" —Charles de Lint \"One of Canada's most original writers of speculative fiction.\" —Library Journal Jan Mirocek was a hunter. A very special hunter. Once, he had hunted the things that haunt the forests of the night in every culture of the world. The kallikantzari of Greece. The loup-garou of France. The kitsune of Japan. Were-beasts. Shape-shifters. Until one night, he made a mistake, and the woman he loved died. Now he shuns the dark and his own past, hiding in a big city. For the were-beasts never come here. Or do they? People are dying in Toronto, and all signs point to a shifter. But can Jan conquer his own fears to track down the killer? And what kind of shape shifter would be at home in a modern city? \"A creature-hunter tale that kept me guessing until the very last paragraphs. I was on edge throughout the whole story!\" —Global Pop Culture reviews ABOUT THE Doug is an award-winning author of speculative fiction, with over a million words of fiction sold and over a hundred short story sales to professional markets in thirty countries and two dozen languages. He has published three short story Chimerascope (ChiZine Publications, Canada, 2010), Impossibilia, (PS Publishing, UK, 2008), and just recently, La Danse des Esprits (Dreampress, France, 2011). Doug has twice won Canada's Aurora Award for speculative fiction, and have been a finalist for the international John W. Campbell Award, the Canadian Broadcast Corporation's Bookies Award, and the juried Sunburst Award.",
  "genres": [
    "Horror"
  ],
  "author": "Douglas  Smith",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/11371089-out-of-the-light"
}