{
  "title": "The Outcasts",
  "description": "Harriet met the guy of her dreams. And then aliens. Yeah, aliens.Do you love science fiction? Do you ever wonder what growing up is like in the future?Get set for a journey across space, time, and even other universes.\nThe Outcasts\nTwo years after their friend Jeff Bowman was lost in a disaster in space, Harriet Brightway and Hugh Benson are moving up in the world. Their amazing and inexplicable academic progress recently has earned them a place at the elite Westfald Academy where they rub shoulders with the children of the rich and powerful.However, entering the world of the financial aristocrats is not easy for Harriet and Hugh. Harriet soon meets the magnetically handsome Leonardo de Medici and the volatile Tiffany Montague. Tiffany, immediately jealous of the attention that Leo pays to Harriet, vents her fury at Harriet in any way she can.Suddenly, Harriet, Leo, and Tiffany find themselves on the run from an unknown assailant and helped by a mysterious boy from a distant star. Quickly discovering that Hugh has been targeted as well, the five of them begin an odyssey across known space in an attempt to flee from their attacker. Piecing together the clues they gather as they go, Hugh, Harriet, Leo, Tiffany, and the enigmatic Foi search for ways to stop their relentless pursuer and get their lives back.\nThe Possessor Wars Series\nThe Possessor Wars is a compelling six-book series documenting humanity's First Contact with energy beings from another universe who seek the one thing that we have that they don't-physical bodies. Wanting the fuller existence granted by human form, these formidable aliens will do anything to subject the human race to their wills.Set in the 28th Century, the Possessor Wars spans time, space, and even multiple universes as Jeff Bowman and his friends make humanity's final stand against conquering aliens who want to take their bodies, their life energy, their memories, and their very souls.If you loved Harry Potter, Divergent, and Hunger Games, you should not pass up The Possessor Wars.Books in this SeriesThe Boy Who Fell into the SkyThe OutcastsMore to Come...Publisher's NoteThis coming of age series deals with first contact with multiple alien species and the moral dilemmas of teens at the nexus of an impending alien invasion and species war. It is also interspersed with a humorous look at slices of life in the 28th Century as mankind moves outward to explore and colonize space.www.possessorwars.com",
  "genres": [],
  "author": "Chad Spencer",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/22907347-the-outcasts"
}