{
  "title": "Roasting: A Simple Art",
  "description": "When you're hungry, roast.When you're in a rush, roast.When you're in doubt, roast.When you're entertaining, roast. Crank up the oven and throw in a chicken; roasting is simply the easiest and best way to concentrate and deepen flavor, to seal in succulence, and make robust, crusty, and sweet all kinds of meats, birds, fish, fruits, and vegetables. Roasting offers more flavor on its own than any other cooking technique. Everything you need for a lifetime of happy roasting can be found here in the pages of Barbara Kafka's ground-breaking new book. Even baby goat, a suckling pig, and loin of buffalo make it into this bible of roasting. Roasting is absolutely essential, whether you're planning to roast a potato or leg of lamb, a turkey or a tomato, a pepper or a red snapper. Barbara's fussless high-temperature method caramelizes the surface of meat, the skin of birds or fish, or the outside of vegetables, transforming them into such savory sweet dishes as Roast Chicken with Pomegranate Glaze and Fresh Mint, aromatic Garlic Roast Pork Loin, moist and sweet Roasted Striped Bass with Fennel, and Whole Roasted Peaches with Ginger Syrup. Nearly one hundred stellar recipes for roasted vegetables attest to the fact that Barbara Kafka's new book is not for meat eaters alone. The recipes for roasted vegetables begin where other books leave off. Try the Roasted Sliced Fennel Bulb and the Roasted Chinese Eggplant with Balsamic Marinade, the Roasted Portobello Mushrooms with Garlic Marinade, and more. Roasting is packed with indispensable tips, techniques, and innovative cooking ideas. There are great recipes for marinades, salsas, vinaigrettes, and stuffings. You'll also find an inspiring assortment of simple but original recipes for sauces that will lift your everyday roasts into perfect party fare. You'll discover, too, the many joys of \"companion roasting,\" learning when to add the carrots or the onions so they don't over- or undercook, and guaranteeing everything comes out at the same time. Never a believer in unnecessary work, Barbara Kafka is a cook's best friend. Barbara never follows; she blazes new trails, challenging the sacred rules of roasting by never trussing a chicken or basting a turkey. She proves you can actually walk away from your oven and enjoy your food and your guests. It's all so quick and easy, most dishes don't need to go into the oven until your guests walk in the door. Often the best part of the roast is the leftovers, and Roasting is overflowing with possibilities. In Barbara's knowing hands leftover onions become a smoky-flavored Roasted Onion Soup with Cannellini Beans; last night's roasted cod and boiled potatoes are transformed into a scrumptious Best Cod Hash; a deeply flavored Roast Duck Pasta Sauce is a rich reward to the cook for having made last night's duck dinner. Nearly one hundred recipes for leftovers show you how to build them into new meals of soups, salads, pasta sauces, hashes, fritters, fish cakes, and more. Replete with all the tables, timing charts, and the encyclopedic wisdom that are hallmarks of every Barbara Kafka book, A Simple Art is a dream of a cookbook, one that will soon bear the soils, stains, and well-worn pages of constant and creative use.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference"
  ],
  "author": "Barbara Kafka",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/22905.Roasting"
}