{
  "title": "The Boy Who Fell into the Sky",
  "description": "Top 100 in Amazon's Teen & Young Adult Aliens eBooks on 8/20/14!Do you love science fiction?Get set for a journey across space, time, a dizzying array of unique worlds, and even other universes!\nThe Boy Who Fell into the Sky\nJeff Bowman doesn’t know that he is anything other than a normal 14 year old. No one does-at least, no one that's human. Not yet.Like most kids his age in the year 2715, Jeff lives in a building that’s 3,000 stories tall. He deals with all the challenges a normal guy faces where he lives-escaping poverty, making the grade in school, handling a bully gone wild, making friends, and maybe finding a girl that’s more than a friend.But Jeff suddenly finds his world turned upside down and he ends up leaving Earth to colonize a distant planet. On the trip through the Federated Alliance, a disaster strikes and tosses the ship far across the galaxy to a region of space where humanity has never been. Cut off from outside help, the crew and passengers of the lost starship quickly find that they are carrying armed and hostile terrorists. For reasons that no one can understand, the relentless fighters not only want to take control of the ship, but they are specifically targeting Jeff. Struggling against all odds, Jeff must find a way to survive in a dangerous universe that seems bent on destroying him.\nThe Possessor Wars Series\nThe Possessor Wars is a compelling six-book series documenting humanity's First Contact with energy beings from another universe who seek the one thing that we have that they don't-physical bodies. Wanting the fuller existence granted by human form, these formidable aliens will do anything to subject the human race to their wills.Set in the 28th Century, the Possessor Wars spans time, space, and even multiple universes as Jeff Bowman and his friends make humanity's final stand against conquering aliens who want to take their bodies, their life energy, their memories, and their very souls.If you loved Harry Potter, Divergent, and Hunger Games, you should not pass up The Possessor Wars.Books in this SeriesThe Boy Who Fell into the SkyThe OutcastsMore to Come...Publisher's NotesThis coming of age series deals with first contact with multiple alien species and the moral dilemmas of teens at the nexus of an impending alien invasion and species war. It is also interspersed with a humorous look at slices of life in the 28th Century as mankind moves outward to explore and colonize space.www.possessorwars.com",
  "genres": [],
  "author": "Chad Spencer",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/22907331-the-boy-who-fell-into-the-sky"
}