{
  "title": "Tudor Cousins: Rivals for the Throne",
  "description": "How close did England come in the 16th century to a dispute—perhaps escalating to civil war—between rival candidates for the throne? Indeed, how close did England come to having a Queen Margaret, a King Ferdinando, or a Queen Arbella? Or a King Edward whose consort Queen Honora whose father was a notorious smuggler and friend of pirates? The fact that Henry VIII was succeeded by his three children, in turn, and the last of them by their cousin the king of Scotland, hides the fact that for the best part of 80 years the royal succession was in doubt, a matter for speculation and debate. At almost any time, the Tudor succession might have been diverted to a descendant of one of Henry VIII's sisters—a Douglas or Brandon, Grey or Clifford, Seymour or Stanley, or a Lennox Stuart. Nomination by a monarch as his/her heir or promotion by an English faction or a foreign power was, for each Tudor cousin, always a distinct to be a Tudor cousin from the 1520s to the end of the 16th century was to live in constant uncertainty, wondering if \"fate\" would offer crown and throne. There were times when the crown hovered just out of for Margaret, Lady Lennox, for example, when Mary I seemed close to having her half-sister Elizabeth charged with treason and naming her cousin Margaret as heir; for Katherine Grey, in October 1562, when Elizabeth I was apparently on the brink of death—it would have been necessary to release \"Queen Katherine\" from the Tower of London in which she was a prisoner. Only one of the cousins, Lady Jane Grey, actually challenged for the crown, and that under duress, but her speedy overthrow in 1553 and execution the following year served as a warning to the others to beware manipulation by those who sought to rule through them. Suspicion was enough. Nine of the cousins were at one time or another imprisoned in the Tower. The descendants of Henry VIII's sisters showed many of the traits admired or deplored in the characters of the Tudor monarchs. Their stories offer a new perspective on the Tudor monarchs' actions and policies. It is a dramatic one, containing conspiracy, rebellion, usurpation, treason, execution, and themes which are more often the stuff of fiction—clandestine weddings, secret agents, murder, and witchcraft. This book reveals the ways in which proximity to the throne dominated and frequently marred the lives of the Tudor cousins, sometimes contributing to their deaths.",
  "genres": [
    "Nonfiction",
    "Tudor Period",
    "Historical"
  ],
  "author": "Dulcie M. Ashdown",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/2290438.Tudor_Cousins"
}