{
  "title": "Trillion Years Universe Theory",
  "description": "‘Trillion Years Universe Theory’ is a non-fiction cosmology theory book. It is available in paperback and Kindle eBook. The new theories bring a powerful new voice to cosmology theory. Trillion’s new controversial concepts challenge old Big Bang Theory and provide a brand new exploration into the age and origin of our universe. Discover how dynamic black holes played a major role when our universe began small and grew over a trillion year history to its enormous size with billions of galaxies, solar systems, and quintillions of stars. Author Ed Lukowich reveals: “We definitely aren’t alone, at least not as a solar system. Plus, the stars in our sky are merely the current rendition. They are just one story in our universe’s trillion year history.”At what date are we in cosmic history? Ed Lukowich's dramatic new Trillion Theory (T Theory) estimates that we are at a trillion years.Trillion Years Universe Theory is the 2nd book in the 5 book cosmology theory series of Canadian theorist Ed Lukowich. Ed says, “This TYUT book takes the new theories seen in Trillion Theory (TT) and places their founder Ed Lukowich under the scrutiny of a questioner. Answers supplied by Ed widen and clarify the scope of the new and fascinating concepts purported and professed within Trillion Theory (TT).”Are you open to reading a new universe theory which TRUMPS the fraudulent Big Bang? Most definitely, Trillion Theory (TT) reverberates a new robust voice to cosmology theory. Trillion Theory, in search of the true origin of our cosmos, demolishes the explosion notions associated with any type of Big Bang origin, thereby negating the Big Bang as a theory. Trillion Theory states, \"Stars in our sky are merely the current rendition - just today’s story in an amazing trillion-year cosmic history of recycled stars and solar systems. Ever wondered why our cosmos is so gigantic, or why there are billions of stars, solar systems, and galaxies? Well, Trillion Theory (TT) takes the wrapper off of those ageless mysteries. Discover the hidden power behind magical black holes which TT claims to be responsible for all of exponential cosmic growth over the past trillion years.”Trillion Theory (TT) is a new theory which depicts our universe as far older that the supposed 13.7 billion years of the preposterous wrongly accepted Big Bang. TT shows how our cosmos has steadily marched forward and grown in size each 15 billion years or so over the past Trillion years of cosmic history. Follow Trillion Theory as it correctly depicts the exciting origin and growth of our cosmos. Justifiably, the ways in which Trillion Theory advocates this cosmic origin and growth surprises even the top echelon of astronomers and astrophysicists of today. Trillion Theory can be found both as a paperback on Amazon and as an ebook through Kindle. See the Ed Lukowich website www.trillionist.com for all of his recent books and e-books related to our universe.Ed Lukowich is also the author of ‘The Trillionist,’ a futuristic sci-fi novel published in 2013. These books are available on Amazon and the author’s website for these books is www.trillionist.com",
  "genres": [],
  "author": "Ed Lukowich",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/22913017-trillion-years-universe-theory"
}