{
  "title": "Call of the Kokako",
  "description": "Call of the Kokako is a journey of discovery into what makes the kokako ‘tick’ in order to save the species. This journey and work resulted in the restoration of the largest population of kokako in New Zealand with the help and dedication of many down to earth conservationists.Jeff Hudson spent 20 years helping to save the kokako from extinction. He was a passionate, multi-talented man who made an enormous impression on all those lucky enough to work and socialize with him. He was a musician, a raconteur, a formidable bushman, and an inspirational teacher. He is fondly remembered as ‘the birdman’; indeed, the local iwi have erected a carved statue in his honour at the Otamatuna hut in Te Urewera National Park. Jeff first came into contact with the kokako as a possum trapper in the Bay of Plenty. His skills in locating the kokako in remote areas got him a position with the Department of Conservation, where he turned from trapper to bird expert. He tells how he gained insights into the kokako’sbehaviour and ecology, as well as developing an appreciation of the workings of New Zealand’s forests. His acute observation skills and musical ability led to breakthroughs in understanding kokako nesting behaviour and the importance of their unique song dialects.Jeff directed the biggest survey of kokako ever attempted and was key to engineering the recovery of the species, especially in Te Urewera National Park. The successful recovery of existing kokako populations by controlling predators lead to transfers of birds to start new populations elsewhere. Jeff became the National Kokako Recovery Group leader and led the first series of large transfers and the first transfer onto Maori owned land on the east coast. The methods that were developed then are now in wide use today.Jeff had real charisma, and was well known beyond New Zealand conservation circles. He has co-authored research papers; appeared in the New Zealand Geographic magazine; was the inspiration for characters in Barry Crump’s ‘Pork and Watercress’, and the radio play ‘King Pig’ (Colin Rock, Radio New Zealand), Jeff died from cancer in late 2007, but dictated this book during his illness. He talks lovingly about the bush, the birds, his fellow workers, but also of political intrigues, bureaucracy, and scientific research. Every person engaged in or interested in animal conservation will appreciate this story. New Zealanders, in particular, will enjoy the laconic style. This is a story that hasn’t been told before and will be an eye-opener to those who read it.﻿",
  "genres": [
    "Nonfiction"
  ],
  "author": "Jeff Hudson",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/22910333-call-of-the-kokako"
}