{
  "title": "The Succubus and other Femdom Stories",
  "description": "\"The Succubus and other Femdom Stories\" is a devilish good romp of five hell raising tales of Femdom, CFNM, Foot Worship, Forced Nudity and loads of Tease and Denial for the demon in all of us. Keep your holy water ready to douse yourself before reading as each tale is hotter than the next.   The Succubus – Wealthy and handsome Dr. Pincher thought a vacation in rural Romania would be the trip of a lifetime. Finding an ancient book of arcane spells, and summoning the Succubus to service his carnal needs, he wishes now he had read the fine print before performing the ceremony.  Snowed In – When the worst blizzard in a hundred years hit the state, Steve thought the weekend was shot. Thinking he would be cooped up and bored, things turned quite hot when one of his three gorgeous roommates broke out the wine and suggested a game of strip monopoly. Finding himself the loser when he lands on boardwalk with two hotels, he further discovers that their evening of fun has awoken some dark desires in his roomies as they administer his penalty for losing.  Panty Raid Gone Bad – A simple raid on the freshman girl’s dorm goes horribly awry as young track star, and rushing pledge Carl gets captured. Tied, stripped, shaved and milked he pays a high price for his attempted theft.  Why I hate Colonial Williamsburg – Tri-corner hats, cheesy touristy t-shirts and the obligatory staged photo, Colonial Williamsburg has something for everyone. When the handsome, yet perpetual dog, Ted plays a game of truth or dare with some college hotties in the middle of the night, he thought for sure he was heading for a threesome. When he finds himself helpless and naked in public in the stockade he realizes he might just end up the most popular new attraction in the Old Town square.   The Big Game – Jordan Baker was a star. Handsome, hung and Captain of the football team, he had everything a college boy could hope for. Drowning in endless tail, he was living the dream. When he learns that if he wins the big game he will be given the opposing teams cheerleaders as his own personal sex slaves for the summer, he thought life could not get any better. He should have thought about what would happen if he lost, as his summer dreams turn into an embarrassing and very frustrating nightmare.",
  "genres": [],
  "author": "M.V. Gaius",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/22915687-the-succubus-and-other-femdom-stories"
}