{
  "title": "Magische Verführung",
  "description": "Eine Vampirjägerin gerät zwischen die Fronten eines tödlichen Konflikts. Eine junge Werleopardin verliebt sich in einen mächtigen Wächter ihres Rudels. In den Schluchten des Großstadtdschungels und in den luftigen Höhen über den Dächern der Stadt treiben Gestaltwandler, Vampire und Engel ihr Unwesen. Getrieben von tiefen Gefühlen - Rache, Hass und Leidenschaft. Auf der Suche nach einer Liebe, die alle Grenzen überwindet ... Die packende Vorgeschichte zu Nalini Singhs Gestaltwandlerserie und ihren erfolgreichen Engelromanen.\nOriginaltitel der Novellas:\n\nAngel’s Pawn\n (ebook; wird im Frühjahr 2012 auch in Angel's Flight in Print erscheinen)Angels' Pawn introduces readers to a world of beauty and danger where angels and vampires coexist. The novella is the prequel to Nalini Singh's Guild Hunter series. In Atlanta, a vampire hunter is caught between two rival factions and the angel who is manipulating them both. Her only assistance comes from a vampire who may have his own reasons for helping her...Beat of Temptation (in der Anthology An Enchanted Season)Young Tamsyn has always held a special place in her heart for her powerful fellow pack-member Nate. But as a dominant male leopard in the pack, the more experienced Nate doesn’t want to trap Tamsyn into the fierce demands of the mating bond—a bond driven by the animal within—when she’s hardly had the chance to grow into a woman. But Tamsyn knows what she wants for Christmas, and she’s going to get it…Stroke of Enticement (in der Anthology The Magical Christmas Cat)Stroke of Enticement features Zach, a DarkRiver soldier you’ll love, and Annie, a human woman who finds herself tangling with this irresistible cat.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "German Literature",
    "Vampires",
    "Paranormal",
    "Angels",
    "Romantasy"
  ],
  "author": "Nalini Singh",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/11373274-magische-verf-hrung"
}