{
  "title": "The NOVA Trilogy Boxed Set",
  "description": "New Edition. Old editions of the NOVA Box Set purchased before 11/4/2017 can be updated by asking Amazon to push the new content to your device. The NOVA trilogy is intended for mature audiences due to explicit sex, strong language, and abusive situations. It may be disturbing to some readers.Sophia Jameson is the daughter of adult entertainment mogul, Paul Jameson. She suffers from an abusive past and sees nothing wrong with sleeping around; after all, sex is the cure for her depression. A long-term relationship with any man is not on the agenda–until she meets Cove Everton. The two fall fast and hard; diving into a relationship they know will be forbidden by Sophia's father. Cove Everton was once the biggest star of Jameson Industries. Forced into the company at a young age, he still suffers mental and physical scars from the business owned by Paul Jameson. Angst-ridden and tormented that his family's been blackmailed and his father framed for crimes that were committed by Paul, he continues to work for the adult industry, hoping to discover proof that will bring Paul to his knees and set his father free. -----------------------------------------✼ From Sophia ✼My story begins in St. Louis with my best friend and former college roommate, Mera. I'm twenty-three, not the romantic type, and convinced that I can mistreat my body however I see fit. I'm not worried about any consequences, only my therapist is. I see her twice a week as requested by my father. He believes I have issues with my mother and that my lack of motivation, foul mouth, and immaturity all stem from her neglect. But my therapist? She thinks I'm a sex addict. All of this is about to change... because of him.Cove Everton holds secrets that are infinitely darker than mine. The demons he carries are destroying him, and his connection to my family is tragic. He distances himself, but our attraction is too powerful for that withdrawal to last. Once his private life is exposed there's no turning back. We fall fast and hard, both virgins to this kind of love and troubled by the unknowns of a future together. Can we erase the scars of one another's past and move forward? Or will we be consumed by our former lives? You'll spend time in shallow water getting to know me before you advance into the deep end with Cove. And it is deep, be patient. The unexpected is coming. ~ Sophia Jameson---------------------------------------- *The characters in this trilogy have frequent sex. 18+ only*  ---------------------------------------- Please Note: Cove's not an alpha. He's a passive character who's dominated by Sophia's father. The trilogy contains kidnappings, physical and psychological abuse, and sensitive subject matter involving teenagers.",
  "genres": [
    "Dark",
    "Abuse",
    "Suspense",
    "Romance",
    "Adult",
    "Contemporary"
  ],
  "author": "Aven Jayce",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/22915697-the-nova-trilogy-boxed-set"
}