{
  "title": "Savage Love",
  "description": "Six years ago, Chaz Savage was on top of the world: Beloved NFL star, filthy rich, great friends -- and a man he was close to falling in love with. Lev Chirkoff was smart, funny, sexy and freaking adorable. Then, one night he was gone with no explanation. Chaz is devastated, left wondering what happened to the only man who ever had his heart. Eventually, hurt turns to anger and then to rage. If he EVER sees that man again....  Lev Chirkoff has an impossible job forced on him by the mob boss his father works for. It involves a professional athlete he has worshiped since the first time he saw him, and the very thought of it sickens Lev. He meets Chaz and they seem to be made for each other. Soon, his only plan is falling in love. When a traumatic night forces Lev out of Chaz's life, he disappears. But Chaz Savage never leaves his heart.  Six years later, Lev returns to Seattle, makes new friends and finds a purpose in life. A Halloween party puts him in Chaz's orbit again, and unsportsmanlike conduct doesn't begin to cover the big man's reaction. With the mob after Chaz, Lev is assigned to protect him as they go into hiding. But Chaz Savage isn't about to make it easy for the man who devastated him. Once old feelings stir, he finally has a chance to discover the truth of Lev's betrayal. Lev falls even more deeply for the man who is so much more than just a football star -- but surely his secret will only cost him Chaz's love forever.  They say it takes a village, but in this case it's a reservation -- and as Chaz and Lev come to an uneasy peace, they discover that the people around them are more than willing to give their lives for the safety of their family.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Military Fiction",
    "Magic",
    "Fantasy"
  ],
  "author": "Sandrine Gasq-Dion",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/22917395-savage-love"
}