{
  "title": "Deadly Double",
  "description": "Double Down with this Mystery Thriller Double Feature from New York Times and USA Today Bestselling Authors Diane Capri and J. Carson Black!2 Complete Novels by 2 of Today’s Bestselling Authors who have teamed up to bring you a Deadly Double dose of reading pleasure.FATAL DISTRACTION introduces relentless victims’ rights advocate Jess Kimball. She and Jack Reacher both deliver justice when the legal system fails. Reacher waits until trouble finds him and then he does whatever it takes. But Jess pursues legal justice and draws lines she will not cross. How can she win against killers who refuse to follow the rules?Three years ago, beloved Florida Governor Helen Sullivan’s world shattered when her only son died in a senseless car crash, killing his best friend, too. Helen quickly discovered Eric’s crash was no accident and lured the killer to her son’s funeral to be caught.When the shooting ceased in the small country church, Helen believed her nightmare was over. Instead, she’d unwittingly escalated her duel with a cunning and patient assassin.Now, investigative journalist Jess Kimball is driven to find the horrifying truth. Is the Central Florida Child Killer guilty? Or is the real killer still out there?Helen and Jess together face the determined killer in a pitched battle of wit and nerve. Who will survive?DARKNESS ON THE EDGE OF TOWN features Laura Cardinal: Packs a SIG Sauer P226 9mm. Investigates homicides in small towns that have limited resources. Brings justice to murder victims--and to their killers. Laura’s job description: Criminal Investigator with the Arizona Department of Public Safety. But maybe it should just say “Troubleshooter.” Used to be kids played outdoors until time for dinner, now social media’s the new game in town. These days, they play on their smartphones. But with more freedom comes greater danger. Mobile devices are a conduit into a child’s life, not just for friends but for those who intend harm. This is the message of J. Carson Black’s Daphne du Maurier Award-nominated thriller, DARKNESS ON THE EDGE OF TOWN. When Laura investigates the murder of a fourteen-year-old girl found in a town’s park bandshell, she knows immediately what she’s up against: a cunning sexual predator. But why is she plagued by the abduction of a schoolmate eighteen years earlier? In a runaway case that propels Laura from a lavish Tucson estate to the secretive heart of a northern Florida town, she must confront the ghosts of her own past. Then another child goes missing—and Laura must race the clock to find her. BONUS: Eavesdrop on the conversation between Jess Kimball and Laura Cardinal",
  "genres": [
    "Amazon",
    "Mystery Thriller",
    "Collections"
  ],
  "author": "Diane Capri",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/22915406-deadly-double"
}