{
  "title": "You Look Like That Girl: A Child Actor Stops Pretending and Finally Grows Up",
  "description": "At the age of twenty-two, Lisa Jakub had what she was supposed to want: she was a working actor in Los Angeles. She had more than forty movies and TV shows to her name, she had been in blockbusters like Mrs. Doubtfire and Independence Day, she walked the red carpet and lived in the house she bought when she was fifteen. But something was missing. Passion. Purpose. Happiness.Lisa had been working since the age of four, after a man approached her parents at a farmer's market and asked her to audition for a commercial. That chance encounter dictated the next eighteen years of her unusual - and frequently awkward - life. She met Princess Diana...and almost fell on her while attempting to curtsy. She filmed in exciting locations...and her high school asked her not to come back. She went to fancy parties...and got kind of kidnapped that one time. Success was complicated.Making movies, traveling the world and meeting intriguing people was fun for a while, but Lisa eventually realized she was living a life based on momentum and definitions of success that were not her own. She battled severe anxiety and panic attacks while feeling like she was living someone else's dream. Not wanting to become a child actor stereotype, Lisa retired from acting and left L.A. in search of a path that felt more authentic to her.In this funny and insightful book, Lisa chronicles the adventures of growing up in the film industry and her difficult decision to leave behind the only life she had ever known, to examine her priorities and write the script for her own life. She explores the universal question we all ask ourselves: what do I want to be when I grow up?",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Mental Health",
    "Biography Memoir",
    "Autobiography",
    "Adult"
  ],
  "author": "Lisa Jakub",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/22914495-you-look-like-that-girl"
}