{
  "title": "The Lost Tribe of Coney Island: Headhunters, Luna Park, and the Man Who Pulled Off the Spectacle of the Century",
  "description": "Coney Island, summer 1905: a new attraction opened at Luna Park. Within weeks it would be the talk of the nation.For the first time, The Lost Tribe of Coney Island unearths the incredible true story of the Igorrotes, a group of “headhunting, dog eating” tribespeople brought to America from the Philippines by the opportunistic showman Truman K. Hunt. At Luna Park, the g-string-clad Filipinos performed native dances and rituals before a wide-eyed public in a mocked-up tribal village. Millions of Americans flocked to see the tribespeople slaughter live dogs for their daily canine feasts and to hear thrilling tales of headhunting. The Igorrotes became a national sensation—they were written up in newspaper headlines, portrayed in cartoons, and even featured in advertising jingles, all fueled by Truman’s brilliant publicity stunts.By the end of the summer season, the Igorrote show had made Truman a rich man. But his genius had a dark side and soon he would be on the run across America with the tribe in tow, pursued by ex-wives, creditors, Pinkerton detectives, and the tireless agents of American justice.Award-winning journalist Claire Prentice brings this forgotten chapter in American history to life with vivid prose and rich historical detail. The book boasts a colorful cast of characters, including the mercurial Truman Hunt; his ambitious, young Filipino interpreter, Julio Balinag; Fomoaley Ponci, the tribe’s loquacious, self-important leader; Luna Park impresarios Fred Thompson and Elmer “Skip” Dundy; and Frederick Barker, the government man dead set on bringing Truman to justice.At its heart, The Lost Tribe of Coney Island is a tale of what happens when two cultures collide in the pursuit of money, adventure, and the American Dream. It is a story that makes us question who is civilized and who is savage.",
  "genres": [
    "History",
    "Nonfiction",
    "New York",
    "American History",
    "Anthropology",
    "Historical",
    "True Crime"
  ],
  "author": "Claire Prentice",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/22915479-the-lost-tribe-of-coney-island"
}