{
  "title": "Licensed to Thrill: Volume 6",
  "description": "New York Times & USA Today Bestselling Author DIANE CAPRI Returns!  HUNT FOR JACK REACHER SERIES Boxed Set More than 50 5-Star Reviews!  THIS BOXED SET CONTAINS 2 #1 Bestselling Titles: Full Novel: Get Back Jack (approximately 80,000 words) Full Novella: Jack in the Green (approximately 25,000 words)  Get Back Jack —  When Jack Reacher Makes Mistakes, Who Handles The Fall-Out?  FBI Special Agents Kim Otto and Carlos Gaspar’s off-the-books assignment leads them to the surviving members of Jack Reacher’s elite military unit. Five years ago, Reacher sorted and destroyed a team of arms dealers in Lee Child’s \nBad Luck & Trouble\n before he moved on. But he made mistakes. Now, his bad luck and trouble legacy plunges Otto and Gaspar into the minefield of a grudge war between Reacher’s fearless old friends and chilling new enemies.  When his enemies take women and children hostage for ransom, Kim’s relentless pursuit leads her deeper into the deadly war Reacher failed to finish. Mercenaries and Kim’s unwavering heart push her through — until she meets the wrong woman with nothing to lose.  Jack in the Green —  FBI Agents Kim Otto and Carlos Gaspar track Reacher’s past in Tampa where they team up with Judge Willa Carson, investigative journalist Jessica Kimball, and attorney Jennifer Lane. When Retired Army Colonel Thomas Weston returns to MacDill Air Force Base for a public event after sixteen years, he's an easy target for his enemies, including Jack Reacher. The Hunt for Justice and the Hunt for Jack Reacher collide in this long-awaited follow up to Get Back Jack.  US and UK Author Diane Capri:  #1 Amazon Mystery #1 Amazon Thriller #1 Amazon Hard-boiled Mystery #1 Amazon Police Procedural #1 Amazon Women Sleuth's Mystery #1 Amazon Legal Thriller #1 Amazon Anthology and more!",
  "genres": [],
  "author": "Diane Capri",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/22918059-licensed-to-thrill"
}