{
  "title": "The Waiting",
  "description": "On the banks of the Pontchartrain…  Ambitious Dr. Andrew Douglas is always looking for ways to have more. More power. More money. More women. But when Slidell businessman, Dr. Bob O’Malley propositions him to bring River City Medical Center in New Orleans, Louisiana, into a black market organ trade, he’s hesitant. How would they get away with it? What happens if they get caught? What happens if he says no?  Conservative and proper Arianne Douglas seems to have it all. A happy marriage, three handsome sons, a loving stepdaughter, and fulfilling career that gives back to others. But when her husband’s ex-wife discovers her deepest secret, how will Arianne prevent her two worlds from colliding—especially since her secret involves her husband’s best friend and her thirteen-year-old son?  Stoic and solemn Dr. Gregory Adams is an honorable man with a heart of gold. Proud of the legacy passed down through his father and grandfathers, he takes his job as Chief Medical Officer of River City Medical Center seriously. But after discovering that his best friend, Andrew is involved with something that is legally and ethically wrong, Gregory doesn’t know what to do. Further complicating his decision, are his long-standing feelings for Andrew’s wife—his one true love.  Brazen Dr. Millicent Douglas has been on a twenty-seven year mission: destroy Arianne Douglas. And thirteen years ago, she was joined by the most unlikely of allies—Arianne’s oldest son Nash. Effortlessly, she persuades her ex-husband to convince his best friend to rehire her at Rivers, allowing her closer to the black market organ trade known as the “Operation.” With Nash’s help, she infiltrates the accounts of Arianne’s charitable organization and manages to discover her nemesis’ long-hidden secret. But the stakes are raised when Millie realizes that the relationship between her and Nash is changing, and she’s powerless to stop it. Is she strong enough to say no? Or will his love break down her walls?  Ruthless Dr. Bob O’Malley has a score to settle with Andrew Douglas—for more reasons than one. The most recent offense—fifteen years ago when Andrew’s gross negligence left Bob’s youngest son in a vegetative state. Together with his eldest son, Sol, and a mysterious accomplice called the Congressman, Bob vows to exact his revenge any way possible. If that takes them down the road to death, then so be it. ***The Waiting Series is intended for 18+ audiences due to language and adult content.",
  "genres": [
    "Thriller",
    "Contemporary",
    "Suspense",
    "Romance",
    "Mystery Thriller",
    "Amazon",
    "Dark Romance"
  ],
  "author": "Elizabeth  Burgess",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/22915102-the-waiting"
}