{
  "title": "Dimitri",
  "description": "A captivating paranormal romance from NYT & USA Today best-selling author Kym Grosso.Dimitri LeBlanc, sexy and charismatic beta of Acadian Wolves, survives a brutal attack after his wolf succumbs to a dark force, threatening his very existence. Waking up, tied to a bed, his amusement transforms into lust as a beautiful stranger heals his beast. Intrigued by his mysterious savior, the tables quickly turn, when in the heat of a dark desert night, he rescues her from a barbaric Alpha. Dimitri is inexplicably drawn to the alluring woman, and the discovery that she’s his mate rouses his hunger to claim her as his own.Gillian Michel, a New York City photographer, conceals a secret hybrid past and mystical abilities. An entire lifetime, she’s deliberately avoided wolves, but a seductive encounter with an irresistible beta leaves her craving his touch, his lips on hers. Passion ignites her desire, leaving her yearning to submit to the powerful wolf who tests her limits.Deep in the heart of New Orleans, Dimitri and Gillian seek a cure to the parasite maligning his mighty beast. Still on the run from a malevolent force, they lure their enemy into the bayou. Will Gillian sacrifice her gifts to save the man she loves, destroying her own immortality? And will Dimitri eradicate the evil that has invaded his soul while protecting his mate from an adversary who threatens to kill them both?Dimitri is the sixth book in the Immortals of New Orleans series. Although many of my readers prefer reading the series in order, each book is written to be read standalone.THE IMMORTALS OF NEW Kade's Dark EmbraceLuca's Magic EmbraceTristan's Lyceum WolvesLogan’s Acadian WolvesLéopold’s Wicked EmbraceDimitriLost EmbraceJaxJakeQuintusHunterChristmas EmbraceViktorJulian (coming soon)CLUB ALTURA Carnal RiskWicked RushSolstice BurnHard AssetRiptide (coming soon)WITCHES OF Second Chance Hex",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Vampires",
    "Shapeshifters",
    "Werewolves",
    "Audiobook"
  ],
  "author": "Kym Grosso",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/22916532-dimitri"
}