{
  "title": "Cold Trap",
  "description": "If you'd like a free review copy, PLEASE drop me a note at waskan2006.at.gmail.dot.comRead Amazon  South Pole … MoonMiles from the multinational Unity lunar outpost, a lone explorer extracts a mysterious object – a missing chapter from the primordial past – from deep beneath the grime ice in the perpetual darkness of crater 6L43A. Inexplicably, the explorer vanishes, and the object along with him. Nearby, the gears spin on a secret device, setting in motion a chain reaction that could avert a civilization-ending cataclysm. Known only to a select few, the machine must be protected.But watching from the shadows, a brilliant sociopath has plans of his own. . .____________________________________________AboutInspired by Crichton, Asimov, and Brown, “Cold Trap” straddles the hard science fiction and technothriller genres. It has intense action, political intrigue, a deep central mystery, and a backdrop of real-life science and high-tech gadgetry, a combination that is sure to resonate with fans of contemporary science fiction and techno-thrillers.____________________________________________Reviews“In this novel things are often not as they seem and no assumptions should be made. Full of well-drawn and interesting characters as well as challenging scientific concepts, \"Cold Trap\" is Highly Recommended. Four and a half RIVETING Stars!”Amazon (Top 500, Vine Voice) Reviewer, RBSProds\"Cold Trap is an outstanding book where novel, yet plausible scientific scenarios complement an excellent story, filled with characters that I actually cared about.\"Amazon (Top 1000) Reviewer, D. Buxman“COLD TRAP combines a murder mystery with political intrigue, hints of a major game changing scientific discovery and some thrills and chills…It is a well constructed who dunnit, and even after we learn who and why, we're still not done, with perhaps the biggest and most exciting reveal held back until the very end…If you like smart SF on the hard side, I think you'll like COLD TRAP. I look forward to Waskan's next.”Amazon (Vine Voice) Reviewer, J. Tepper“I eagerly recommend without reservation this book to anyone looking for a mind-expanding, thought-provoking, fun and ultimately satisfying top tier science fiction read.” Best eBook Reviews\"Tremendous creativity and an in-depth look at exo-geology – the study of rocks and deposits on the surface of the moon and other ‘space rocks’ – create a realistic background for action involving the basic human emotions of love, greed, the desire for knowledge and the hunger for power.”Readers' Favorite",
  "genres": [
    "Science Fiction"
  ],
  "author": "Jon Waskan",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/22921817-cold-trap"
}