{
  "title": "Spirit Prophecy",
  "description": "Two sisters, haunted by more than their past... Just weeks after discovering each other’s existence, Jess and Hannah Ballard arrive at Fairhaven Hall, where they will learn the clandestine ways of the Durupinen, an ancient sect of women who control the Gateways between the worlds of the living and the dead. Though they are considered outcasts by most of their classmates, Jess and Hannah are determined to learn what they can to fulfill their responsibility to the many ghosts that haunt them. But danger, it seems, has followed them as closely as a shadow to their new home, and they have more questions than ever. Who is the desperate child spirit pursuing Jess, and what do her terrifying visions mean? What has happened to Dr. David Pierce, Jess’ friend and mentor, who has suddenly and mysteriously vanished? And just what is it about Hannah’s unique abilities that has the other Durupinen frightened of her? The Ballard sisters are about to find out, and the answers could destroy their newfound life before it has even begun. Spirit Book 2 of the Gateway Trilogy is the second of 10 thrilling paranormal page-turners in \"The World of the Gateway\" series by E.E. Holmes. What Amazon readers are  ★★★★★ 'One of THE BEST ghost themed paranormal books I've ever read!' ★★★★★ 'Hauntingly thrilling.' ★★★★★ 'A must-read for those interested in the paranormal.' ★★★★★ 'Twilight combined with Harry Potter and then some!' ★★★★★ 'Every turn of the page is like a new discovery.' ★★★★★ 'A masterfully woven story.' ★★★★★ 'Holmes has written a lovely series with something for everyone; humor, self reflection, loyalty, mystery, intrigue, action and so much more.' ★★★★★ 'If you're into the paranormal, like ghosts, ghost hunting, ghost stories, crossing over, Gaelic folklore, dark secrets, plot twists that I didn't even see coming (and I am a writer myself!) and even a little magic, you should definitely read this book.' Experience the captivating paranormal series that obsessed readers have described as “unputdownable” and “spellbinding”. If you love ghost stories, with plenty of action and suspense, along with a tough and independent heroine you’ll want to stand up and cheer for, you will fall in love with this best-selling series… but proceed with you’ll be up all night reading!",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Fiction",
    "Magic",
    "Urban Fantasy",
    "Supernatural"
  ],
  "author": "E.E. Holmes",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/22919557-spirit-prophecy"
}