{
  "title": "Main Street / Babbitt",
  "description": "In Main Street and Babbitt, Sinclair Lewis drew on his boyhood memories of Sauk Centre, Minnesota, to reveal as no writer had done before the complacency and conformity of middle-class life in America. The remarkable novels presented here in this Library of America volume combine brilliant satire with a lingering affection for the men and women, who, as Lewis wrote of Babbitt, \"want \"to seize something more than motor cars and a house before it's too late.\"\"Main Street (1920), Lewis's first triumph, was a phenomenal event in American publishing and cultural history. Lewis's idealistic, imaginative heroine, Carol Kennicott, longs \"to get [her] hands on one of those prairie towns and make it beautiful,\" but when her doctor husband brings her to Gopher Prairie, she finds that the romance of the American frontier has dwindled to the drab reality of the American Middle West. Carol first struggles against and then flees the social tyrannies and cultural emptiness of Gopher Prairie, only to submit at last to the conventions of village life. The great romantic satire of its decade, Main Street is a wry, sad, funny account of a woman who attempts to challenge the hypocrisy and narrow-mindedness of her community.\"I know of no American novel that more accurately presents the real America,\" wrote H.L. Mencken when Babbitt appeared in 1922. \"As an old professor of Babbittry I welcome him as an almost perfect specimen. Every American city swarms with his brothers. He is America incarnate, exuberant and exquisite.\"In the character of George F. Babbitt, the boisterous, vulgar, worried, gadget-loving real estate man from Zenith, Lewis fashioned a new and enduring figure in American literature—the total conformist. Babbitt is a \"joiner,\" who thinks and feels with the crowd. Lewis surrounds him with a gallery of familiar American types—small businessman, Rotarians, Elks, boosters, supporters of evangelical Christianity. In biting satirical scenes of club lunches, after-dinner speeches, trade association conventions, fishing trips and Sunday School committees, Lewis reproduces the noisy restlessness of American commercial culture.In 1930 Sinclair Lewis was the first American to be awarded the Nobel Prize in Literature, largely for his achievement in Babbitt. These early novels not only define a crucial period in American history—from America's \"coming of age\" just before World War I to the dizzying boom of the twenties—they also continue to astonish us with essential truths about the country we live in today.",
  "genres": [
    "Fiction",
    "Classics",
    "Literature",
    "American",
    "Collections",
    "Literary Fiction",
    "Book Club"
  ],
  "author": "Sinclair Lewis",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/11374.Main_Street_Babbitt"
}