{
  "title": "Delay of Game",
  "description": "There is an alternate cover for this ASIN here.With her father’s health in question, Sara Thomas is focused on reducing his anxiety. That’s no small feat considering his high-stress job, not to mention her own distractions. Everyone knows Sara’s single; no one knows she’s pregnant. There’s never a good time to unexpectedly get knocked up, but now is definitely not it. Regardless, she doesn’t want anyone to know—especially not her father—until she has a game plan in place. But when Jonny, one of her father’s players, seeks vigilante justice on the ice, everything gets tossed out the window.  Cam Johnson’s role as a fourth-line winger with the NHL’s Portland Storm entails more than scoring goals. He has to ensure other teams don’t take liberties with the Storm’s star players. The way Cam sees it, that’s the most important aspect of his job. His teammates call him Jonny; opposing fans call him a goon; the media calls him an enforcer. The title’s unimportant. Cam will always fight for his team—even if he has to break the rules. He’s used to taking penalties, but he never meant for anyone else to suffer from his choices.  When Cam’s actions cause Sara’s worst fears to be realized, he blames himself. He’s screwed everything up; now he has to set things right. Mutual attraction leads to lust, and suddenly Cam is taking penalties at every turn…at least where Sara is concerned. He’s got to think on his feet or he’ll end up with a Delay of Game.  The Portland Storm Series 1) Breakaway 2) On the Fly 2.5) Taking a Shot - found in the Seduced by the Game anthology, or releasing separately on September 4, 2014 3) Light the Lamp 4) Delay of Game 4.5) Double Major - releasing September 18, 2014 5) In the Zone - releasing November 20, 2014",
  "genres": [
    "Sports",
    "Sports Romance",
    "Romance",
    "Contemporary Romance",
    "Hockey",
    "Amazon",
    "Family"
  ],
  "author": "Catherine Gayle",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/22923176-delay-of-game"
}