{
  "title": "Mimi",
  "description": "\"Mimi' is the story of of one man's obsession with the woman of his dreams. the novel explores lust, loss, true love and what people will do to try and change their fate.In 1978, Karl Cerelli is a promising young attorney and writer in los angeles. he enjoys a nearly perfect life. One night at a party he meets Cynthia Jamison, an older \"B\" movie actress and the most famous nude model of the decade.They are immediately drawn to each other and spend the night having mind-blowing sex.She tells him her real name and that all of her friends back home call her Mimi. Karl is smitten with the beautiful redhead but Cynthia has a predilection for older, wealthier men with access to drugs.Karl is saddened but distracts himself with an assortment of female companionship. Then Karl's best friend Bill,a police detective, gets Karl an invitation to a party at the \"bachelor pad\" the home of the magazine that Cynthia posed for. When Karl calls Cynthia to invite her to the party, she tells him she is bringing her boyfriend. He then calls a fellow lawyer, Deborah Ann Marbeaux, a beautiful, ruthless southern belle from Alabama. Deborah Ann is thrilled to hear from Karl. she has been in love with him since they met several years earlier and desperately wants to marry him. They go to the party where Deborah Ann is the center of attention. Cynthia shows up and tells Karl she is breaking up with her boyfriend. Karl is now conflicted and must make a choice between a life of stability and comfort with Deborah Ann or the uncertain path of wooing the wild and unpredictable Cynthia. His decision is not helped by the fact that his best friend, Deborah Ann, his family and even the owner of the magazine Cynthia posed for, all think Mimi will only break his heart.Cynthia calls Karl up several days later and invites him to celebrate her birthday. Karl is thrilled and plans a romantic getaway to Lake Tahoe. They enjoy a fantastic week of amazing sex and getting to know each other. On Mimi's birthday Karl gives her a special present-a screenplay he has written just for her. She is overcome with emotion, since the main character in the manuscript would be the role she has been searching for.All seems to be going well until the day they are leaving when Karl accidentally discovers a small stash of heroin in Mimi's belongings. She becomes furious . They arrive back in Los Angeles where Mimi tells Karl he is out of her league and they are finished. she leaves his screenplay on the seat of the car.Karl is crushed and realizes how foolish he's been. Unexpectedly, he receives a call from his literary agent. the biggest producer in Hollywood is interested in his screenplay. Karl meets the producer and his wife, a well known actress, at a popular restaurant to discuss the script. Things are going well, when Mimi appears with her drug dealing boyfriend and humiliates Karl. he is devastated , retreats to the men's room and breaks down. He regains his composure and joins the producer, more confident than ever and starts discussing terms for the sale of his screenplay.After the incident in the restaurant,Karl decides that he can no longer stay in Los Angeles. he interviews at law firms in several cities but decides one in Atlanta is the most attractive. He also sleeps with the senior partner's daughter while there.Karl returns to Los Angeles with his mind made up that he will take the offer. as he gets out of his cab and walks to his front door , Mimi is waiting for him,\"Mimi' is a novel with many twists and turns. at time the reader will be challenged to decide what is real and what is merely the manifestation of hope. The book demonstrates the fine line between dreams and nightmares-and how easily love can lead to obsession.The ending is quite shocking and seems to come out of nowhere, but the clues are there.Like Mimi herself, the book is seductive, sometimes cruel but always irresistible.",
  "genres": [],
  "author": "Eric  J. Karell",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/22920126-mimi"
}