{
  "title": "Predator's Fire",
  "description": "Nina never dreamed a world of shape shifters could exist. Killian never dreamed he’d fall in love with a human. Neither of them ever expected their love would make them targets of a vicious shifter cult. Together, they’ll have to find a way to protect Gemini Island from destruction! Rosanna Leo is pleased to bring you Predator’s Fire, Book 5 of her passionate romance series, Gemini Island Shifters.  When Nina Suzuki discovers the body of her best friend Janine, her world turns upside down. Things go from bad to worse when Janine’s corpse seems to transform into that of a large, brown wolf. For the first time, Nina is faced to confront all the clues indicating her BFF was not what she seemed. A letter from the dead woman opens Nina’s eyes to a strange, new world. The same letter warns of a sinister group called the Alpha Brethren, and urges her to find Killian Moon of the Ursa Fishing Lodge and Resort on Gemini Island.  Killian Moon is a jaguar shifter and teen mentor at the Ursa Lodge in Northern Ontario. He may be a comfort and inspiration to confused teen shifters, but he also has a fiery past. His past comes back to haunt him when human Nina arrives at the resort, demanding to speak with him. Demanding answers. Can he trust her with knowledge that will not only change her life, but possibly endanger those around him?  As Killian begrudgingly tutors Nina on all things shifter, their mutual curiosity flares into passionate need. Once they touch, once they succumb to desire, there is no going back. Killian realizes Nina is his mate and they both begin to comprehend the terror threatening those on their shifter-friendly island. He is forced to confront the tragedy in his family and determines to protect Nina at all costs.  But can they protect everyone they love from a cult of dangerous shifters, intent on horror and destruction?  Content Hot, Paranormal, Shifters, Wolves, Contemporary, Suspense",
  "genres": [
    "Paranormal Romance",
    "Romance",
    "Shapeshifters",
    "Paranormal"
  ],
  "author": "Rosanna Leo",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/22919722-predator-s-fire"
}