{
  "title": "Surprises",
  "description": "An alternate cover edition exists here.“Surprises” is the third book in a five book series. The story, as well as the series, is centered around the title characters of the series Suzy and Katie.Surprises picks up the story an unspecified period of time after the end of Growing Love. Suzy is asked by her husband to meet him for dinner in New York City, since she is already there attending a high end auction. Surprise number 1 happens as she enters the auction house and sees her long time friend and occasional lover from Ireland is also at the auction. (Maggie co-stars with Suzy in their own story in the Suzy Q. Series, Suzy and Maggie, in Fun in New York City)While her next surprise is not so pleasant, as she learns the real reason that Richard, her husband, walked away and let Suzy and Katie’s relationship grow. The shock of seeing Richard, as well as his story, and his requests of her, leaves her emotionally distraught, and very much in need of the arms of a friend.The trip to New York, along with an incident on the flight home leaves Suzy emotionally torn, and in need of help and guidance. Something she gets from Katie picking her up at the airport unexpectedly, from Sam, her loyal employee and friend, and from some sound professional guidance and help.Her thoughts and emotions, once again back under control. Suzy committees her love to Katie, and they head off to Tennessee to meet Katie’s family and friends. Two weeks of fun and love and a string of surprises, that begin with their first stop in Cleveland, and that don’t stop happening until they get home. Some of which are their own doing, but many of which are bestowed up the unsuspecting duo, by both family, friends, and complete strangers. Even mother nature steps in to make one of Katie’s surprises for Suzy even more special than planned.",
  "genres": [],
  "author": "D.D. Story",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/22920305-surprises"
}