{
  "title": "The Disappearance of Emily H.",
  "description": "A girl who can see the past tries to save the future in this compelling tween mystery. A girl is missing. Three girls are lying. One girl can get to the truth. Emily Huvar vanished without a trace. And the clues are right beneath Raine’s fingertips. Literally. Raine isn’t like other eighth graders. One touch of a glittering sparkle that only Raine can see, and she’s swept into a memory from the past. If she touches enough sparkles, she can piece together what happened to Emily. When Raine realizes that the cliquey group of girls making her life miserable know more than they’re letting on about Emily’s disappearance, she has to do something. She’ll use her supernatural gift for good . . . to fight evil. But is it too late to save Emily?Sparkling praise for THE DISAPPEARANCE OF EMILY “ The Disappearance of Emily H has everything—a quirky, believable heroine, a complex mystery that keeps you guessing , and even a touch of the paranormal. Readers won’t put this one down until the final sparkle.” — Gordon Korman, #1 New York Times bestselling author“An extra-special extrasensory suspense story with unexpected twists and turns .” —Eric Walters, author of The Rule of Three\"An involving mystery thriller with a touch of fantasy and just a hint of romance .\"-- Booklist\"Realistically captures the quiet horror of bullying . . .  the mystery of Emily’s whereabouts unfolds with gripping tension and a dramatic conclusion.\"-- PW\"Magic exposes the extent of vicious school bullying in this arresting middle school mystery.\"-- Kirkus Reviews\"Will be well received . . . a scary exposé on the power of cell phones and the Internet in high schools.\" --VOYAFrom the Hardcover edition.",
  "genres": [
    "Mystery",
    "Middle Grade",
    "Fantasy",
    "Fiction",
    "Paranormal",
    "Magical Realism",
    "Young Adult"
  ],
  "author": "Barrie Summy",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/22926538-the-disappearance-of-emily-h"
}