{
  "title": "Vital Signs",
  "description": "Winner of Cuba’s prestigious Premio Carpentier, this collection of eight inventive stories explores the pursuit of love and meaning in contemporary Cuba. One story takes you into a world of art and the marketplace, another into divination and the numbers racket, another into cooking and S&M. These characters inhabit a real country full of contradictions and compulsions, far from our stereotyped images of nightclubs, beards, beaches and American cars. They are survivors, brought to us by a narrator who is sympathetic yet ironic, incisive yet serene.Lucid marginality, the contradiction and curse of such clarity at odds with our surroundings: from the fog of a chaotic world Pedro de Jesús, ever watchful, draws out characters as if plucking them from a shipwreck. Vital Signs shows off the mature work of one of the most unmistakable voices in recent Cuban fiction. —José Manuel Prieto, author of Rex and Encyclopedia of a Life in Russia  Pedro de Jesús’s stories trace the vital, disobedient forces that animate us beyond the constraints of the authoritative and the normative: our intellect, our imagination, our erotics. This careful, attentive translation allows de Jesus’ uniquely Cuban voice and vision to live on, naked and seductive and compelling, speaking directly to fortunate readers beyond Cuba, and beyond Spanish. —Ricardo Ortíz, Georgetown University, author of Cultural Erotics in Cuban AmericaVital Signs is an extraordinary and fascinating work that offers both an example of Pedro de Jesús’ creativity and a window into the imagination of the Cuban people. De Jesús’s subtleties have been masterfully translated into English by another artist, Dick Cluster. The stories will inspire any sophisticated mind, and the flavor of everyday Cuban speech and idiosyncrasies is also on display. —Emilio Bejel, author of Gay Cuban Nation and José Martí: Images of Memory and Mourning Raunchy, sublime, always compelling, the stories of Pedro de Jesús capture the essence of Cuban literature of the absurd. I am reminded of Calvert Casey and Virgilio Piñera, but Pedro de Jesús forges his own path. Dick Cluster, master translator, follows de Jesús, turning his words into magical, fabulous English. —Pablo Medina, author of Cubop City Blues, and co-translator, with Mark Statman, of Poet in New York.",
  "genres": [],
  "author": "Pedro De-Jesús",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22924466-vital-signs"
}