{
  "title": "McKay's Werewolf Ways",
  "description": "McKay’s world and heart shrank when his grandfather died. While settling his estate a chance meeting with Mahihkan, a hot and sexy Metis artist, is about to teach the red-headed professional model that the world is much larger—and more magical-- than he ever imagined. It’s also more dangerous as he discovers his new companion is really a Loup-Garou--what the Metis call a werewolf. In the U.S. to install a new art piece, Mahihkan is considered a “lone wolf” without a pack to depend on for protection. The arrangements he made with the local packs have just fallen apart when a werewolf has been left for dead in the Turtle Island Maze Mahihkan created. Now he fears not only for his own life but McKay’s as well. What happens when a human discovers the Supernatural is real? The policy is elimination of humans who know The Secret.(This gay werewolf romance introduces McKay in his first encounter with paranormal romance. His story will continue with Roots and Scottish Shifter Romance, as he retraces the route his grandfather took from Scotland to arrive in America. This story is intended for an adult audience. It expresses a graphic same-sex loving relationship. All characters are over eighteen years old)ExcerptMahihkan sat silent for a moment and poured himself a second shot. In for a penny, in for a pound. You go from not telling humans anything to then just handing them the store when they finally find out The Secret. God, no wonder The Enforcers felt it was easiest to just kill everybody. “The average Garou needs the full moon to change shape. But there are members of the community who are, well, I guess you could say they’re more gifted than the others. These are the natural leaders. We call them Alphas. Technically an Alpha is someone who can change at any time—they don’t need the moon. I’m what’s called a potential Alpha. That means I have all the strength and abilities of an Alpha, but I’m not in a formal leadership position. I don’t need the moon to change. Obviously my guest can do it on his own as well.”Mahihkan looked up from his glass. As he stared into McKay’s eyes, his own eyes shifted into the strange golden color the other man—the other Garou-- had shown. “I thought I saw a flash of yellow in your eyes the first time I met you, but I had managed to convince myself I was just seeing things.”“Unless we work hard to control it, our eyes change color if we’re aroused, excited, or scared. We slip up more than we should, but our greatest ally is an enduring belief by humans we don’t exist in the first place. Even when we do show our true eye color, most people will manage to instantly convince themselves they didn’t see what they thought they saw.”“What do we do now?” McKay was feeling the edge of the alcohol. He almost laughed when he thought about upgrading his Facebook Met this hot Garou who was helping a friend recover from attempted murder. Note to buy a bottle of Tito’s Vodka. It’s just the thing to have when your world goes bat-shit crazy. Who would even believe him? His only regular involvement with anything unusual was the modeling industry where all magic was done with Photoshop.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Romance",
    "Wolves",
    "Shapeshifters"
  ],
  "author": "Skye Eagleday",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/22925748-mckay-s-werewolf-ways"
}