{
  "title": "The Wayward Daughter",
  "description": "Sierra Hall is not a family girl.  Sierra Hall hasn't been home for years because she hates her father. Between blaming him for her brother's death and his business ties to crime boss James Northrop, she would rather run wild. But Richard Hall wants his daughter back so he can convince her to marry James, and he uses the one man he has leverage on, to find her.   It is hard for Chad Pender to care for anyone.  Full of regret and living one day at a time, Chad Pender can't forget his best friend's death. Scott Hall was the reason Chad joined the Shadow Souls MC, but Richard's shady dealings cost Scott his life. Chad was there when Scott died and can't shake the guilt; remorse so strong he's willing to help the man who could cause him to lose everything.   Two strangers thrown together, unaware of their common bond.  Finding Sierra is only the beginning for Chad. Sierra never knew Chad and Scott were friends, but she wishes she had met him sooner. When she convinces him to forget his mission, events are set in motion that could pull them apart. Her father is determined to find her, and when Chad reneges, Richard turns the Shadow Souls against him with lies about Chad's involvement with James that led to Scott's death.  EXCERPT  What would Chad say? Would he tell her the whole truth? Would he tell her about Scott’s death and about working for her father? About the guilt? She didn’t need that. Would he tell her anything about her father? If he lied, that would probably just be worse, but he could disguise the truth a little…maybe.  She most likely wanted answers about her brother, about everything that happened that night, about what he was involved in before he died. He could give her that in some small way; he could give her some aspect of the truth of the situation – not all of it, never all of it. All of it would ruin everything he was trying to accomplish here…  …Chad was not at all what Sierra imagined he would look like. He was tall with sandy brown hair. His eyes were a penetrating blue stare that took her by surprise with their intensity. He had a little red cut under his chin, probably from shaving. He was wearing a blue button-down, dark wash jeans, and leather boots. His shirt wasn’t tucked in and was wrinkled. Bachelor, probably has been his whole life. His left ear was pierced, but he didn’t have any jewelry in it.  He was definitely more attractive than she could’ve possibly expected.",
  "genres": [],
  "author": "Tamara Knowles",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/22924120-the-wayward-daughter"
}