{
  "title": "Marketplace of the Marvelous: The Strange Origins of Modern Medicine",
  "description": "An entertaining introduction to the quacks, snake-oil salesmen, and charlatans, who often had a point Despite rampant scientific innovation in nineteenth-century America, traditional medicine still adhered to ancient healing methods, subjecting patients to bleeding, blistering, and induced vomiting and sweating. Facing such horrors, many patients ran with open arms to burgeoning practices that promised new ways to cure their ills. Hydropaths offered cures using “healing waters” and tight wet-sheet wraps. Phineas Parkhurst Quimby experimented with magnets and tried to replace “bad,” diseased thoughts with “good,” healthy thoughts, while Daniel David Palmer reportedly restored a man’s hearing by knocking on his vertebrae. Lorenzo and Lydia Fowler used their fingers to “read” their clients’ heads, claiming that the topography of one’s skull could reveal the intricacies of one’s character. Lydia Pinkham packaged her Vegetable Compound and made a famous family business from the homemade cure-all. And Samuel Thomson, rejecting traditional medicine, introduced a range of herbal remedies for a vast array of woes, supplemented by the curative powers of poetry. Bizarre as these methods may seem, many are the precursors of today’s notions of healthy living. We have the nineteenth-century practice of “medical gymnastics” to thank for today’s emphasis on regular exercise, and hydropathy’s various water cures for the notion of regular bathing and the mantra to drink “eight glasses of water a day.” And much of the philosophy of health introduced by these alternative methods is reflected in today’s patient-centered care and holistic medicine, which takes account of the body and spirit.Moreover, these entrepreneurial alternative healers paved the way for women in medicine. Shunned by the traditionalists and eager for converts, many of the masters of these new fields embraced the training of women in their methods. Some women, like Pinkham, were able to break through the barriers to women working to become medical entrepreneurs themselves. In fact, next to teaching, medicine attracted more women than any other profession in the nineteenth century, the majority of them in “irregular” health systems. These eccentric ideas didn’t make it into modern medicine without a fight, of course. As these new healing methods grew in popularity, traditional doctors often viciously attacked them with cries of “quackery” and pressed legal authorities to arrest, fine, and jail irregulars for endangering public safety. Nonetheless, these alternative movements attracted widespread support—from everyday Americans and the famous alike, including Mark Twain, Louisa May Alcott, and General Ulysses S. Grant—with their messages of hope, self-help, and personal empowerment. Though many of these medical fads faded, and most of their claims of magical cures were discredited by advances in medical science, a surprising number of the theories and ideas behind the quackery are staples in today’s health industry. Janik tells the colorful stories of these “quacks,” whose oftentimes genuine wish to heal helped shape and influence modern medicine.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Medicine",
    "Health",
    "Medical",
    "Historical"
  ],
  "author": "Erika Janik",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/22926609-marketplace-of-the-marvelous"
}