{
  "title": "Making Modern Science: A Historical Survey",
  "description": "The development of science, according to respected scholars Peter J. Bowler and Iwan Rhys Morus, expands our knowledge and control of the world in ways that affect-but are also affected by-society and culture. In Making Modern Science , a text designed for introductory college courses in the history of science and as a single-volume introduction for the general reader, Bowler and Morus explore both the history of science itself and its influence on modern thought.Opening with an introduction that explains developments in the history of science over the last three decades and the controversies these initiatives have engendered, the book then proceeds in two parts. The first section considers key episodes in the development of modern science, including the Scientific Revolution and individual accomplishments in geology, physics, and biology. The second section is an analysis of the most important themes stemming from the social relations of science-the discoveries that force society to rethink its religious, moral, or philosophical values. Making Modern Scienc e thus chronicles all major developments in scientific thinking, from the revolutionary ideas of the seventeenth century to the contemporary issues of evolutionism, genetics, nuclear physics, and modern cosmology.Written by seasoned historians, this book will encourage students to see the history of science not as a series of names and dates but as an interconnected and complex web of relationships between science and modern society. The first survey of its kind, Making Modern Science is a much-needed and accessible introduction to the history of science, engagingly written for undergraduates and curious readers alike.",
  "genres": [
    "Science",
    "History",
    "History Of Science",
    "Nonfiction",
    "Popular Science",
    "Textbooks",
    "Read For School"
  ],
  "author": "Peter J. Bowler",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/1137506.Making_Modern_Science"
}