{
  "title": "Another Day Another Name",
  "description": "Don't fall in love.Words to live by for anyone in the business of corporate espionage and assassination. Especially Mable Young. Her latest job brought her to New York to assassinate the head of the largest corporation in America.This wasn’t how she envisioned her life, but after The Crash a lot of dreams changed. So, she took the skills the CIA taught her and put them to work in the corporate world.But in an age of hands-off government and Cowboy Capitalism, payback is swift and vicious. The very company who hired Mabel for the assassination is mopping up the blood of their own massacre...now who’s in charge and who’s next?FBI agents Steven Howards and Mateo Miles start the Federal Investigation that will stop at nothing to see the killer is brought to justice.Mabel isn’t taking any chances and she moves to a small town in Idaho to lay low while the heat dies down. What she wasn’t expecting was meeting Henry Ricks. For the first time, she feels a restless burning passion where before there had been nothing. Will this small town romance risk the mystery of her life?.This is the world of Another Day Another Name...FBI agents hungry to get to the bottom of Mabel’s corporate assassination...Henry Ricks, desperate to break the chains with his ruthless ex-wife and her influential power family...Mabel Young, a tenacious assassin in high demand...Danger, suspense and steamy temptation lurk around every corner of Clark Chamberlain’s all-new gritty pulp epicAnother Day Another Name is a taut pulp noir thriller with riveting action, breathless romance, and provocative characters all embroiled in a luscious scheme of shadows and desperate dreams.Fans of Gone Girl by Gillian Flynn, A Walk Among the Tombstones by Matthew Scudder, The Husband by Dean Koontz, Killing Floor by Lee Child and great pulp fiction will love Another Day Another Name.",
  "genres": [],
  "author": "Clark Chamberlain",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/22927856-another-day-another-name"
}