{
  "title": "Scream Angel",
  "description": "2004 Aurora Award WINNER2004 Year’s Best Fantasy & Horror honorable mentionThink of human emotion as a geography, with peaks of pleasure and valleys of pain. Imagine a drug that flips the valleys and makes them peaks, too. You react now to an event based not on the pleasure or pain that it brings, but solely on the intensity of the emotion created. Pain brings pleasure, grief gives joy, horror renders ecstasy.Now give this drug to a soldier. Tell them to kill. Not in the historically acceptable murder of war, but in a systematic corporate strategy--of xenocide.They will kill. And they will revel in it.Welcome to the world of Scream.Jason Trelayne is a Screamer, a soldier forced to take part in the enslavement or death of entire races. But Trelayne falls in love with Philomela, a Scream Angel, an alien who produces the addictive drug. Does he love her for her beauty, for the drug she gives him, from guilt for what he has done to her people? And does she love truly him as she swears? Or is he simply her only hope for freedom, for her and her entire race? Forced to choose between freedom and love, what will they do?Note: includes an afterword by the author and excerpts from many of his other stories.“...the book’s most skillfully crafted story...a multi-layered tale about a circus that features a pair of ‘angels’ who have the ability to produce a drug that produces pleasure based on intensity of emotion. Factor in that the owner of the circus is in love with one of the angels as well as addicted to the drug she produces, and the story quickly becomes one that holds the reader’s attention until the very end.”— SpecFicWorld, 2003“Smith describes a disturbingly plausible military application for the narcotic ... The basic concept behind the drug strikes me as one of those rare ideas that seems at once so perfect and so natural that someone must have come up with it before; but if someone has, I haven't heard about it, and regardless Smith exploits the potential of the idea extraordinarily well here.”—Strange Horizons, 2010This story was originally published in Low Port (anthology, Meisha Merlin, Aug 2003), and is included in Doug's collection, Chimerascope (ChiZine Publications, Jan 2010).Doug is an award-winning Canadian author of speculative fiction, whose stories have appeared in over a hundred professional magazines and anthologies and twenty-four languages around the world, including InterZone, Amazing Stories, Cicada, Baen's Universe, Weird Tales, The Mammoth Book of Best New Horror, Postscripts, On Spec, and The Third Alternative, as well as anthologies from Penguin/Roc, DAW, and others.His newest collection, Chimerascope, including an Aurora winner, a Best New Horror selection, and nine Aurora finalists, is now available from ChiZine Publications. His first collection of short fiction, Impossibilia, is available from the award-winning UK press, PS Publishing. Doug was a finalist for the international John W. Campbell Award for best new writer, and has twice won the Canadian Aurora Award. He's been an Aurora finalist seventeen times and has several honourable mentions in The Year's Best Fantasy & Horror. A complete list of Doug's published fiction is available on his web site at smithwriter.com along with reviews of his stories.An independent film producer has just finished shooting a short film based on his story \"By Her Hand, She Draws You Down.\" He recently completed his first novel, based on his award-winning short story, \"Spirit Dance.\"",
  "genres": [
    "Science Fiction",
    "Military Fiction",
    "Fantasy",
    "Short Stories"
  ],
  "author": "Douglas  Smith",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/11374613-scream-angel"
}