{
  "title": "Ministers at War: Winston Churchill and His War Cabinet",
  "description": "In May 1940, with France on the verge of defeat, Britain alone stood in the path of the Nazi military juggernaut. Survival seemed to hinge on the leadership of Winston Churchill, whom the King reluctantly appointed Prime Minister as Germany invaded France. Churchill’s reputation as one of the great twentieth-century leaders would be forged during the coming months and years, as he worked tirelessly first to rally his country and then to defeat Hitler. But Churchill—regarded as the savior of his nation, and of the entire continent—could not have done it alone.As prize-winning historian Jonathan Schneer reveals in Ministers at War, Churchill depended on a team of powerful ministers to manage the war effort as he rallied a beleaguered nation. Selecting men from across the political spectrum—from fellow Conservative Anthony Eden to leader of the opposing socialist Labor Party Clement Attlee—Churchill assembled a War Cabinet that balanced competing interests and bolstered support for his national coalition government. The group possessed a potent blend of talent, ambition, and egotism. Led and encouraged by Churchill, the ministers largely set aside their differences, at least at first. As the war progressed, discord began to grow. It reached a peak in 1945: with victory seemingly assured, Churchill was forced by his Minsters at War to dissolve the Government and call a General Election, which, in a shocking upset, he lost to his rival Attlee.Authoritatively recasting our understanding of British high politics during World War II, Schneer shows that Churchill managed the war effort by managing his team of supremely able yet contentious cabinet members. The outcome of the war lay not only in Churchill’s individual brilliance but also in his skill as an executive, and in the collective ability of men who muted their personal interests to save the world from barbarism.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "World War II",
    "Politics",
    "European History",
    "British Literature"
  ],
  "author": "Jonathan Schneer",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/22928872-ministers-at-war"
}