{
  "title": "The Shelf: From LEQ to LES: Adventures in Extreme Reading",
  "description": "Phyllis Rose, after a career of reading from syllabuses and writing about canonical books, decided to read like an explorer. She \"wanted to sample, more democratically, the actual ground of literature.\" Casting herself into the untracked wilderness of the New York Society Library's stacks, she chose a shelf of fiction almost at random and read her way through it. Unsure of what she would find, she was nonetheless certain \"that no one in the history of the world had read exactly this series of novels.\"What results is a spirited experiment in \"Off-Road or Extreme Reading.\" Rose's shelf of roughly thirty books has everything she could wish for--a remarkable variety of authors and a range of literary ambitions and styles. The early-nineteenth-century Russian classic A Hero of Our Time by Mikhail Lermontov is spine by spine with The Phantom of the Opera by Gaston Leroux. Stories of French Canadian farmers sit beside tales about aristocratic Austrians. California detective novels abut a novel from an Afrikaans writer who fascinates Rose to the extent that she ends up watching a YouTube video of his funeral.Curious about the life of writers across a broad spectrum of time and space, with a keen interest in the challenges for literary women, Rose occasionally follows her reading with personal encounters. One of her favorite discoveries is the contemporary American novelist Rhoda Lerman, in whom she believes that she has found an unrecognized Grace Paley--\"another funny feminist humane earth-mother Jewish writer.\" But Lerman, who becomes a friend, turns out to be not \"another\" anything: in addition to writing she now raises prizewinning Newfoundlands and \"talks of champion canines with the reverence I reserve for Alice Munro.\"A joyous testament to the thrill of engagement with books high and low, The Shelf leaves us with the feeling that there are treasures to be found on every library or bookstore shelf. Rose investigates her own discoveries with exuberance, candor, and wit while exploring and relishing the centripetal nature of reading in the Internet age. Measuring her finds against her own inner shelf--those texts that accompany her through life--she creates an original and generous portrait of the literary enterprise.",
  "genres": [
    "Nonfiction",
    "Books About Books",
    "Memoir",
    "Literary Criticism",
    "Writing",
    "Essays",
    "Adult"
  ],
  "author": "Phyllis Rose",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/22929724-the-shelf"
}