{
  "title": "The Reef: A Passionate History: The Great Barrier Reef from Captain Cook to Climate Change",
  "description": "Iain McCalman's brilliant history of the Great Barrier Reef, told in twelve extraordinary tales, charts its shifting status from labyrinth of terror to global treasure.Equal parts gifted storyteller and acclaimed historian, McCalman brings to life the people who've shaped our knowledge and perception of this World Heritage-listed site. Arguing that the Barrier Reef is a product of human as much as natural history, created by minds as well as corals, McCalman describes encounters between peoples and places, ideas and environments, over the past two centuries and more.Where today the Reef is known for its astonishing underwater beauty and diversity, once it was notorious for the shipwrecks in its treacherous waters. Navigators struggled to chart a safe passage through, and scientists later theorised about the creation of this massive structure - the largest marine environment on the planet. Quixotic individuals spent years sailing the globe for an answer, and the fiery debate between Darwinists and creationists caught the world's attention. Then came successive waves of resource hunters and exploiters, followed by beachcombers and artists who fought to stop them, and the marine specialists who first became aware of the threats to the Reef's survival.In between, the Indigenous peoples of the Reef gave succour to castaways like Eliza Fraser, and were then vilified for it. Other survivors of shipwrecks lived for years with the clans of the region, were adopted by them and taught their traditional ways of life.The first social, cultural and environmental history to be written of the Great Barrier Reef, The Reef is an effortlessly readable and often moving story of one of the seven natural wonders of the world.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Nature",
    "Australia",
    "Environment",
    "Natural History"
  ],
  "author": "Iain McCalman",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/22929721-the-reef"
}