{
  "title": "Texts from Mittens: A Cat Who Has an Unlimited Data Plan...and Isn't Afraid to Use It",
  "description": "Texts from Mittens is a series of text message conversations between a snappy, self-absorbed housecat named Mittens and his long-suffering human, a single woman who works away from home during the day. Mittens relentlessly hassles his human all day long, while only taking breaks to watch Judge Judy, hang with his best friend Stumpy, complain about the antics of Drunk Patty the neighbor, ask Grandma for money to buy useless items from QVC, and harass the \"filthy beast\" dog, Phil.Angie Bailey is an award-winning writer and blogger, humorist, and professional member of the Cat Writers' Association. Her primary blog, Catladyland, has won many awards, and her humor writing is featured nearly daily on Catster.com, one of the most popular cat sites on the Web. She loves to photograph her cats in silly poses and sleeps with one eye open. And yes, she has three cats.\"Each installment of Texts From Mittens is like a little gift to brighten your day!\" —Kate Benjamin, Hauspanther founder and co-author of Catification with Jackson Galaxy\"Texts From Mittens makes me wish my cat had thumbs! This is a hilarious book; Angie Bailey has done it again!\" —Jeremy Greenberg, Author of Sorry I Barfed on Your Bed\"We all knew that cats were hilarious, but Ms. Bailey's sardonic cat quips really take their mannerisms, attitude and occasional apathy to another level.\" —Susan Michals, Curator of Cat Art Show Los AngelesCome home! There's an emergency! What?? Are you OK? My dish is half empty! I'll be home soon. You wish starvation upon me! Stop being dramatic. Am weeak. Caan hasrdly tyyppe.  Are you going to wear those black pants on your bed? Yes. I have a date. They're comfortable. Mittens, get off my pants!",
  "genres": [
    "Humor",
    "Animals",
    "Cats",
    "Nonfiction",
    "Comedy",
    "Graphic Novels",
    "Dogs"
  ],
  "author": "Angie Bailey",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/22929085-texts-from-mittens"
}