{
  "title": "Illuminating Disease: An Introduction to Green Fluorescent Proteins",
  "description": "Green fluorescent proteins have been floating in the ocean for more than 160 million years, but it took a curious scientist, fascinated by pinpricks of green light, to begin unlocking their potential. Now these jellyfish proteins have become one of the most important tools available to researchers in modern medicine and biology. By using them to illuminate other proteins that were previously invisible even under a microscope, scientists are now able to observe facets of disease that would have otherwise gone undetected. Green fluorescent proteins are used in over three million experiments a year and have proved invaluable for tasks such as tracking HIV, breeding bird flu-resistant chickens, and confirming the existence of cancerous stem cells.In Illuminating Disease, Marc Zimmer introduces us to these revolutionary proteins, acquainting readers both with the researchers responsible for the proteins' discovery as well as their wide utility. The book details the history of genetically modified fluorescent parasites and viruses, which provide scientists with lifesaving information about the spread of diseases. Green fluorescent proteins allow scientists and doctors to understand diseases better by quite literally illuminating various microscopic interactions occurring in living cells that otherwise would have gone unseen.The book is richly illustrated, showing the visually striking uses of green fluorescent proteins, and many of these scans have won awards in biological imaging competitions. An ideal introduction for students and advanced researchers alike, Illuminating Disease is an accessible yet deeply probing investigation into one of the most important developments in medical research of the last several decades.",
  "genres": [
    "Science",
    "Nonfiction"
  ],
  "author": "Marc Zimmer",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/22935593-illuminating-disease"
}