{
  "title": "The End is Now",
  "description": "Famine. Death. War. Pestilence. These are the harbingers of the biblical apocalypse, of the End of the World. In science fiction, the end is triggered by less figurative means: nuclear holocaust, biological warfare/pandemic, ecological disaster, or cosmological cataclysm.But before any catastrophe, there are people who see it coming. During, there are heroes who fight against it. And after, there are the survivors who persevere and try to rebuild. THE APOCALYPSE TRIPTYCH will tell their stories.Edited by acclaimed anthologist John Joseph Adams and bestselling author Hugh Howey, The Apocalypse Triptych is a series of three anthologies of apocalyptic fiction. THE END IS NIGH focuses on life before the apocalypse. THE END IS NOW turns its attention to life during the apocalypse. And THE END HAS COME explores life after the apocalypse.THE END IS NIGH is about the match. THE END HAS COME is about what will rise from the ashes. THE END IS NOW is about the conflagration.• • • •table of contents:INTRODUCTION by John Joseph AdamsHERD IMMUNITY by Tananarive DueTHE SIXTH DAY OF DEER CAMP by Scott SiglerGOODNIGHT STARS by Annie BelletROCK MANNING CAN’T HEAR YOU by Charlie Jane AndersFRUITING BODIES by Seanan McGuireBLACK MONDAY by Sarah LanganANGELS OF THE APOCALYPSE by Nancy KressAGENT ISOLATED by David WellingtonTHE GODS WILL NOT BE SLAIN by Ken LiuYOU’VE NEVER SEEN EVERYTHING by Elizabeth BearBRING THEM DOWN by Ben H. WintersTWILIGHT OF THE MUSIC MACHINES by Megan ArkenbergSUNSET HOLLOW by Jonathan MaberryPENANCE by Jake KerrAVTOMAT by Daniel H. WilsonDANCING WITH BATGIRL IN THE LAND OF NOD by Will McIntoshBY THE HAIR OF THE MOON by Jamie FordTO WRESTLE NOT AGAINST FLESH AND BLOOD by Desirina BoskovichIN THE MOUNTAIN by Hugh HoweyDEAR JOHN by Robin Wasserman",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Anthologies",
    "Horror",
    "Post Apocalyptic",
    "Fiction",
    "Dystopia"
  ],
  "author": "John Joseph Adams",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/22930598-the-end-is-now"
}