{
  "title": "M is for Munchers: The Serial Killers Next Door",
  "description": "\"The first time someone tried to kill me, I was four years old.\" Thus begins the true crime memoir of a woman who survived a serial killer. Most scholars, psychologists, and law enforcement officers concentrate on researching male serial killers, especially the ones they term \"sexual predators,\" like Ted Bundy, John Wayne Gacy, and Jeffrey Dahmer. It's been discovered, however, that female serial killers are infinitely more successful and dangerous than their male counterparts. Female serial killers are less flashy, less flamboyant, more patient, and tend to kill in ways that are rarely detected as murder. Also, female serial killers tend to murder people known to them, rather than the strangers that male sexual predators seek out. Black Widow serial killers usually murder husbands, lovers, boyfriends, children, and even boarders for insurance proceeds, inheritance money, or Social Security checks. Medeas kill their children to punish their ex-husbands or to otherwise manipulate the men in their lives. Angels of Death kill those who are dependent upon their care — in hospitals, nursing homes, or in private care — often murdering them with drugs or in ways that are undetected by medical examination. Team Killers work with partners or operate in a group, often blaming other team members for all the violence and killing.The most dangerous female serial killers are the women who viciously abuse, torture, and often kill their own children, children in their care, or others who are entirely dependent upon them. Posing as ideal mothers and self-less caregivers, these female serial killers practice Munchausen's by Proxy (MBP), an incurable personality disorder where the woman intentionally and repeatedly sickens, injures, tortures, abuses, and kills her victims in order to get attention, respect, admiration, and love for herself. Often called \"Munchers\" by those in law enforcement and the medical establishment who eventually discover the terrible truth behind the illnesses, injuries, and deaths of the children and others in their care, women who practice Munchausen's by Proxy are the most dangerous of all serial killers because they operate openly, virtually flaunting their crimes while appearing, at the same time, to be completely and unquestionably innocent. They are the serial killers next door.2nd formatting changes and expanded Index.",
  "genres": [
    "True Crime",
    "Nonfiction"
  ],
  "author": "Alexandria Constantinova Szeman",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/22931343-m-is-for-munchers"
}