{
  "title": "Moosewood Restaurant Celebrates: Festive Meals for Holidays and Special Occasions",
  "description": "For three decades, the famed Moosewood Collective has prepared innovative meatless meals that have left vegetarians and non-vegetarians alike clamoring for more. Now, just in time for the thirtieth anniversary of their internationally acclaimed Ithaca restaurant, The Moosewood Collective presents their first-ever collection of menus for memorable occasions, with vegetarian specialties for every season.Holidays and celebratory gatherings can present a challenge for vegetarian cooks who want to serve festive meals that will satisfy all of their guests. The Moosewood Collective has met this challenge brilliantly, with more than thirty-five ingenious menus that can transform even casual get-togethers into a party. Covering a diverse array of holidays and occasions both traditional and spur-of-the-moment, Moosewood Restaurant Celebrates provides the perfect excuse to get to-gether with friends and family more often. You’ll find inspiring food ideas for all these and more:• Traditional holidays, such as Thanksgiving, Ramadan, Kwanza, Passover, Diwali, and Christmas • Family gatherings, from a casual Rainy Day Picnic on the Porch to an outdoor Labor Day Get-Together to a fully orchestrated Wedding or Commitment Celebration• Just-for-fun events, perfect any time of year, including a Tapas Party, a Birthday Breakfast in Bed, and a Sports Night SupperThere is even an additional section on versatile party nibbles and celebration cakes to choose from, plus a chapter of delectable foods you can make to give (or mail) as gifts. Filled with practical advice on preparing holiday feasts with the minimum amount of fuss, and incorporating the rich flavors and ethnic influences that the Collective is renowned for, Moosewood Restaurant Celebrates is an indispensable assortment of lively vegetarian menus spanning a dazzling array of cultures and occasions.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Christmas",
    "Vegetarian"
  ],
  "author": "The Moosewood Collective",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/229522.Moosewood_Restaurant_Celebrates"
}