{
  "title": "Red Planet",
  "description": "The Barnes & Noble ReviewRobert A. Heinlein's Red Planet (originally published by Scribner's in 1949 as a \"juvenile\" novel) is considered one of science fiction's seminal works for good reason: It not only laid the foundations for later Heinlein classics like Stranger in a Strange Land and Double Star but also -- along with other thematically challenging Heinlein \"young adult\" books like Space Cadet, Starman Jones, and Citizen of the Galaxy -- has helped convert countless young readers into lifelong science fiction fans. Dramatically different from the original 1949 edition, (in which Scribner editors, fearing some passages were too controversial for their young readership, hacked and slashed entire sections), this version of Red Planet comes directly from Heinlein's original manuscript. Equal parts rip-roaring sci-fi adventure and powerfully compelling coming-of-age tale, the novel revolves around the relationship between young space colonist Jim Marlowe and Willis, a globular Martian creature with retractable appendages and eye stalks. After saving Willis from a frightening native predator, Jim brings the sentient alien home and begins to bond with his furry friend. But upon taking Willis to school, Jim inadvertently sets off a chain of events that not only uncovers a plot that threatens the lives of all colonists on Mars but also sparks a planet-wide revolution! Heinlein's Red Planet is so much more than a classic science fiction story -- it's an invaluable piece of literary history. With stunning new cover art from master artist John Picacio, this definitive edition is an absolute must-read for young and old science fiction fans alike. Paul Goat Allen",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Young Adult",
    "Classics",
    "Science Fiction Fantasy",
    "Adventure",
    "Audiobook"
  ],
  "author": "Robert A. Heinlein",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/2295251.Red_Planet"
}