{
  "title": "Antony and Cleopatra",
  "description": "ACT IScene 1. Mark Antony, together with Octavius Caesar and Lepidus, is one of the three Triumvirs who rule the Roman Empire. But Antony is slavishly in love with Cleopatra, Queen of Egypt, and shows no interest in affairs of state.Scene 2. Members of Cleopatra’s entourage amuse themselves consulting a soothsayer. Antony learns that his wife Fulvia, who has been in rebellion against Caesar, is dead. Forces opposed to the Triumvirs are having considerable success and he finally realizes that he must leave Egypt.Scene 3. Antony tells Cleopatra that he intends to return to Rome.Scene 4. Caesar is angered by Antony’s behavior and will not be mollified by Lepidus. News floods in of their enemies’ growing strength.Scene 5. Cleopatra languishes in Antony’s absence. ACT IIScene 1. Pompey, the Triumvirs’ principal enemy, is disturbed to hear of Antony’s return to Rome. Menas remains optimistic that the insurrection of Antony’s brother and wife has soured his relations with Caesar, but Pompey foresees that divisions will be forgotten in the face of an external enemy.Scene 2. A tense meeting between Caesar and Antony is smoothed over by Lepidus and Agrippa, who suggest that Antony marry Caesar’s sister Octavia. Enobarbus, Antony’s trusted lieutenant, remembers Antony’s first meeting with Cleopatra; he is sure that Antony will never leave her.Scene 3. A soothsayer tells Antony that he cannot shine with Caesar is near. He decides to return to Egypt.Scene 4. Lepidus, Agrippa, and Maecenas prepare to go to war.Scene 5. When a messenger tells Cleopatra of Antony’s marriage to Octavia, she flies into a violent rage.Scene 6. Pompey invites the Triumvirs to a banquet aboard his galley. Enobarbus predicts Antony’s infidelity to Octavia and that her sighs will “blow the fire up in Caesar.”Scene 7. At the banquet, Menas suggests that Pompey could become master of the world if he were to order the murder of his guests. Pompey rejects the idea, but regrets that Menas has not acted on his own initiative. ACT IIScene 1. In Syria, Ventidius enters triumphant with the body of the son of the Parthian king. Ventidius plays down his achievement, wary of losing Antony’s favor by raising himself up too high.Scene 2. Enobarbus and Agrippa ridicule Lepidus’ devotion to Antony and Caesar. Octavia bids Caesar a sad farewell as she leaves for Athens with Antony.Scene 3. Cleopatra questions a messenger about Octavia and concludes that, being “dull of tongue, and dwarfish,” she is no threat.Scene 4. Antony is furious that Caesar has spoken slightingly of him and, contrary to their agreement, has gone to war against Pompey. Octavia will return to Rome in an attempt to reconcile her brother and husband.Scene 5. Caesar has imprisoned Lepidus for allegedly communicating with Pompey.Scene 6. Caesar rails against Antony’s division of the Eastern provinces among Cleopatra and her children. Octavia seeks to defend her husband, but Caesar informs her that he is now in Egypt with Cleopatra, who is levying forces for war.Scene 7. Despite strong advice to the contrary, Antony insists on a naval battle rather than fighting on land where he has the advantage.Scene 8. Caesar gives the order to meet Antony at sea.Scene 9. Antony positions his squadrons within view of Caesar’s battle line.Scene 10. Enobarbus, Scarus, and Canidius watch appalled as Cleopatra’s ships flee, followed by Antony. Canidius decides to join forces with Caesar, whilst Enobarbus, against his better judgement, remains with Antony.Scene 11. Back in Alexandria, Antony is riven with shame. Cleopatra claims she had not thought he would follow when she retreated. He replies, “thou knew’st too well/My heart was to thy rudder tied by the strings.”Scene 12. Caesar rejects Antony’s terms for surrender, but shows clemency to Cleopatra on condition that she betray her lover.Scene 13. Antony rages against Caesar, challenging him to single combat. Only Cleopatra’s assurance of her love finally calms him. Believing that Antony has lost his reason, Enobarbus resolves to leave him. ACT IVScene 1. Caesar rejects Antony’s challenge and gives the order to do battle the next mornign.Scene 2. Enobarbus reproaches Antony for his melancholy words.Scene 3. Full of trepidation, soldiers gather for the battle.Scene 4. Antony prepares for battle.Scene 5. Antony hears that Enobarbus has gone.Scene 6. When Enobarbus learns that Antony has sent his treasure after him, he is struck to the heart that he has deserted a man of such nobility.Scene 7. The battle goes in Antony’s favor.Scene 8. Antony, jubilant with success, meets Cleopatra after the first day’s fighting.Scene 9. Enobarbus dies heartbroken.Scene 10. Scarus tells Antony that Caesar will attack by land and sea.Scene 11. Caesar gives orders for the battle.Scene 12. Antony loses the battle when the Egyptians desert him. He rejects Cleopatra bitterly.Scene 13. Cleopatra, frightened by Antony’s rage, hides in her monument and sends word that she has killed herself.Scene 14. When he hears of Cleopatra’s alleged death, Antony falls on his sword.Scene 15. Antony is carried to Cleopatra and dies. ACT VScene 1. When Caesar hears of Antony’s death, he dispatches an ambassador to Cleopatra.Scene 2. Dolabella tells Cleopatra that Caesar intends to lead her in triumph through Rome. Caesar treats Cleopatra with courtesy, though he warns her against attempting suidice. Horrified at the thought of being exhibited in front of the Roman rabble, Cleopatra announces that she will follow Antony’s example and die. A country fellow brings Cleopatra a basket containing poisonous snakes. Crowned and robed as a queen, she clasps the snakes to her bosom and dies. Caesar, now sole ruler of the Roman world, orders that Cleopatra he buried with her Antony. CASTMark Ciaran Hinds / Estelle Kohler / Domitius David Burke / Octavius Ian Hughes / Eve Matheson / Emma Gregory / Trevor Martin / Charles Simpson / Tracy-Ann Oberman / John McAndrew / Steve Hodson / Arthur Cox / Michael N. Harbour / Jonathan Tafler / Mark Bonnar / Will Keen / Cleopatra’s Gary Bakewell / Richard Durden / Christopher Luscombe / Other parts played by David Bannerman, Sean Baker, Philip Bretherton, Anthony Jackson, Martin Marquez, Nicholas Murchie, Alisdair Simpson, and Stephen Thorne Clive Brill / Dominique Le Gendre / Production Polly Coles and Charlotte Harvey / Sound Wilfredo Acosta / Bill Shepherd and Tom Treadwell TRACK LISTDisc 1Track 1: Act I, Scene iTrack 2: Act I, Scene iiTrack 3: Act I, Scene iiiTrack 4: Act I, Scene ivTrack 5: Act I, Scene vTrack 6: Act II, Scene iTrack 7: Act II, Scene iiTrack 8: Act II, Scene iiiTrack 9: Act II, Scene ivTrack 10: Act II, Scene vTrack 11: Act II, Scene vi Disc 2Track 1: Act II, Scene viiTrack 2: Act III, Scene iTrack 3: Act III, Scene iiTrack 4: Act III, Scene iiiTrack 5: Act III, Scene ivTrack 6: Act III, Scene vTrack 7: Act III, Scene viTrack 8: Act III, Scene viiTrack 9: Act III, Scene viiiTrack 10: Act III, Scene ixTrack 11: Act III, Scene xTrack 12: Act III, Scene xiTrack 13: Act III, Scene xiiTrack 14: Act III, Scene xiiiTrack 15: Act IV, Scene iTrack 16: Act IV, Scene iiTrack 17: Act IV, Scene iiiTrack 18: Act IV, Scene ivTrack 19: Act IV, Scene vTrack 20: Act IV, Scene vi Disc 3Track 1: Act IV, Scene viiTrack 2: Act IV, Scene viiiTrack 3: Act IV, Scene ixTrack 4: Act IV, Scene xTrack 5: Act IV, Scene xiTrack 6: Act IV, Scene xiiTrack 7: Act IV, Scene xiiiTrack 8: Act IV, Scene xivTrack 9: Act IV, Scene xvTrack 10: Act V, Scene iTrack 11: Act V, Scene ii",
  "genres": [
    "Classics",
    "Plays",
    "Drama",
    "Fiction",
    "Historical Fiction",
    "Romance",
    "Literature"
  ],
  "author": "William Shakespeare",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/229464.Antony_and_Cleopatra"
}