{
  "title": "Chicago Death Trap: The Iroquois Theatre Fire of 1903",
  "description": "On the afternoon of December 30, 1903, during a sold-out matinee performance, a fire broke out in Chicago’s Iroquois Theatre. In the short span of twenty minutes, more than six hundred people, two thirds of whom were women and children, were asphyxiated, burned, or trampled to death in a panicked mob’s failed attempt to escape. A century after the fire—the deadliest in American history—Nat Brandt provides the only detailed chronicle of this horrific event to assess not only the titanic tragedy of the fire itself but also the municipal corruption and greed that kindled the flames beforehand and the political cover-ups hidden in the smoke and ash afterwards. Advertised as “absolutely fireproof,” the Iroquois was Chicago’s most modern playhouse when it opened in the fall of 1903. With the approval of the city’s building department, theater developers Harry J. Powers and William J. Davis opened the theater prematurely to take full advantage of the holiday crowds, ignoring flagrant safety violations in the process. During the matinee on this particular Wednesday, all 1,724 seats were filled and an additional two hundred people were standing.  Midway through the second act, a spark from a defective light ignited a drop curtain and the blaze spread quickly to the scenery. Roof vents designed to handle smoke and heat were sealed off, and the fire curtain snagged before it could shield the audience from danger. A blast of gaseous fumes shot across the auditorium from an open stage door and asphyxiated hundreds of theatergoers almost instantly. Others were trampled or burned to death in the panic that ensued as they struggled to escape through locked exits, succeeding only in piling body upon body as the flames closed in. For days afterward, Chicago mourned as relatives and friends searched hospitals for missing loved ones. The aftermath of the fire proved to be a study in the miscarriage of justice. Despite overwhelming evidence that the building was not complete, that fire safety laws were ignored, and that management had deliberately sealed off exits during the performance, no one was ever convicted or otherwise held accountable for the enormous loss of life. Lavishly illustrated and featuring an introduction by Chicago historians Perry R. Duis and Cathlyn Schallhorn, Chicago Death Trap: The Iroquois Theatre Fire of 1903 is rich with vivid details about this horrific disaster, captivatingly presented in human terms without losing sight of the broader historical context.",
  "genres": [
    "History",
    "Nonfiction",
    "Adult",
    "Historical",
    "Theatre",
    "True Crime"
  ],
  "author": "Nat Brandt",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/2295181.Chicago_Death_Trap"
}