{
  "title": "Buddy Holly",
  "description": "Buddy Holly occupies an enigmatic position in pop and rock music history, partly because of his premature death at the age of 22 in a plane crash in February 1959. Designated in Don MacLean's hit \"American Pie\" as 'the day the music died', this enabled him to be included in the trope 'the death of rock 'n roll', alongside the less drastic musical demises of Elvis Presley (joined army), Chuck Berry (imprisoned), Jerry Lee Lewis (disgraced) and Little Richard (joined priesthood). The view that Holly belongs only to the 1950s has often obscured the originality of his music. In an era when the music world was divided into hard rockers, soft pop balladeers and hardcore Nashville country & western singers, his songs transcended the boundaries. Equally innovatory was his use of the recording studio as a laboratory, a place to experiment with sounds. In addition, the two guitars, bass and drums line-up of his group the Crickets was the major contributor to the small group template for generations of rock musicians down to the present day. As well as becoming an influence on other musicians in a conventional sense, Buddy Holly has had his own lengthy musical and cultural afterlife. From the vantage point of 2009, a half century after 'the day the music died', Holly has been the longest-serving member of the rock immortals club, those singers and musicians for whom death seemed to inaugurate a new phase of their career. He has been re-embodied in a biopic, a stage show, in iconic images and numerous reissues of his recordings. While he cannot rival Elvis Presley in terms of sightings (nobody, I think, believes Buddy is still alive) or in terms of 'virtual' performance with his old band, he has been re-embodied in a biopic, a stage show, in iconic images and numerous reissues of his recordings. This book is partly based on the author's 1970 study in the \"Rockbooks\" series. But it aims to provide a new perspective on Buddy Holly by discussing his career and art in the context of his unique contribution to the swiftly-evolving music scene of the late 1950s and his posthumous 50 year multi-media career through films, stage-shows and copious reissues of his oeuvre.",
  "genres": [
    "Music",
    "Biography"
  ],
  "author": "Quentin Hogg Research Fellow Dave Laing",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/22956066-buddy-holly"
}