{
  "title": "The Bob Dylan Encyclopedia: Revised and Updated Edition",
  "description": "The Bob Dylan Encyclopedia is one of the most wide-ranging, informed, entertaining, provocative, and compulsively readable books ever written about popular music. It's the culmination of over thirty years of dedicated research and scholarship by Michael Gray. Inside these pages, you'll find a world of ideas, facts, and opinions. It's a world in which Baudelaire flows on from the Basement Tapes and A.S. Byatt looks out at the Byrds; in which Far from the Madding Crowd follows Ezekiel and Bob Geldof introduces Jean Genet; and in which Hank and William Carlos Williams stand side by side while J.R.R. Tolkien trails the Titanic. Most of all, of course, it's a world in which everyone and everything interconnects, in endlessly fascinating ways, with one of our greatest living Bob Dylan. Click here to read an interview with Michael \"Michael Gray... probably Dylan's single most assiduous critic.\" - New York Review of Books\"Fans of Bob Dylan have a multitude of choices when it comes to biographies and retrospectives, but author Michael Gray outdistances them all with this voluminous collection of all things Dylan. ... Insightful andentertaining, Gray's tome will broaden appreciation of the artist, his influences and his legacy.\" -Publishers Weekly (starred review)\"...has all you need to know, and more\" -Richard Corliss, Time\"This is no mere catalog of facts, but a work of oceanic immersion. It has wit, opinion, style, and asks to be read, not just consulted.\" -Village Voice\"Deeply impressive...destined to be the most important Dylan book, bar none.\"-Gerry Smith, The Dylan Daily\"Utterly idiosyncratic.\" -Janet Maslin, New York Times\"Amazingly well-researched and surprisingly readable work.\" -Library Journal (starred review)\"Door-stopping detail.\" -Toronto Star\"Magnificent...won't just astonish readers with its detail about Dylan's work...contains so many insights and refutes so many myths about the rock 'n' roll era in general that it's invaluable as both a reference guide and a personality study.\" -Nashville City Paper\"Comprehensive and up-to-date.\" -Slate",
  "genres": [
    "Music",
    "Biography",
    "Reference",
    "Nonfiction"
  ],
  "author": "Michael  Gray",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/2297730.The_Bob_Dylan_Encyclopedia"
}