{
  "title": "The Bloodless Boy",
  "description": "'It's extremely difficult to pull off a historical crime novel that manages to be accurate enough, exciting enough and smart enough to satisfy as thoroughly as 'The Bloodless Boy', but Robert J. Lloyd makes it look easy.'Christopher Fowler, author of the Bryant and May mysteries.'The Bloodless Boy is a cracker that had me gripped from the first chapter and me on edge until the end.'Julian Woodford, author of The Boss of Bethnal Green.'Lloyd really excels in his descriptions of London, and his understanding of Seventeenth Century science and medicine at the dawn of the Enlightenment.' Jemahl Evans, author of the Sir Blandford Candy Adventure Series.London, 1678.The blood-drained body of a young boy is discovered in the snow on the bank of the Fleet River.The city, overlooked by the exhumed head of the Lord Protector Oliver Cromwell, teeters on the brink of riot and hysteria, with rumours of Catholic plots, devil-boys, and sinister foreign assassins.It is twelve years since the Great Fire ripped through the heart of the city. Robert Hooke, natural philosopher and Curator of Experiments of the Royal Society is an architect of the rebuilding. Hooke and his assistant, Harry Hunt, reluctantly agree to investigate the murder of the bloodless boy after instruction from King Charles II.Harry, ambitious, wanting to prove himself as an able natural philosopher and to break free from the shadow of Hooke's brilliance, takes the lead in investigating the death of the boy. He finds a sinister tale with roots in the dark past of the Civil Wars.As he gets closer to finding the use of the bloodless boy, he uncovers the terrible consequences of experiments performed in the name of the New Science.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Crime",
    "Historical Mystery",
    "Mystery Thriller",
    "Thriller"
  ],
  "author": "Robert J. Lloyd",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/22971271-the-bloodless-boy"
}