{
  "title": "Day of Wrath",
  "description": "Guns in schools? This novella by New York Times bestselling author William R. Forstchen imagines a horrifying scenario where, in the course of one day, the terrorist group ISIS carries out massacres in schools and on highways across the United States. With a surprisingly small but well-organized and ruthless force, the nightmarish devastation brings America to a state of near-paralysis. Author of ONE SECOND AFTER and PILLAR TO THE SKY, this heart-stopping novella brings home just how fragile our defenses and infrastructure really are. It is also a story of heroic efforts to save lives, while sounding a wake-up call to American citizens and their government. Bob Petersen arrives with his daughter at the Middle Grade school in Maine where he teaches, expecting another regular day but worried about what recent ominous news reports might portend. Suddenly his school -- along with many others across the United States -- is under attack. Gunmen burst in, slaughtering children and adults alike. From the ISIS leader in Syria, to the murderous rampages throughout the U.S., Day of Wrath reveals with chilling effect how national panic and paralyzing terror at the spiraling violence can bring a mighty country to a near-standstill. Petersen's fight to save lives and stop the merciless gunmen provides edge-of-the-seat drama. Day of Wrath is a provocative work that should stimulate an intense national debate. ONE SECOND AFTER was cited on the floor of Congress as the book everyone should read. “A THRILLING — AND TERRIFYING — TALE OF WHAT COULD BE OUR NEXT 9/11!” - W.E.B. Griffin & William E. Buttersworth IV, #1 Wall Street Journal & New York Times Bestselling Authors \"Bill Forstchen is highly respected in the military history community because he is the only one working in the field who understands the operational aspects of war, as well as the tactical and the policy/Strategic levels.\" - Dr. Dennis Showalter, Past President of the Society for Military History, author of Tannenberg, Clash of Empires Praise for ONE SECOND “A riveting cautionary tale.\" - Booklist “Good storytelling consists very simply of creating characters so believable that the reader forms a deep bond. Forstchen did such a damned fine job with One Second After that shortly after the first page, I had been reeled in hook, line, and sinker.” - David Hagberg, New York Times bestselling author of The Expediter about the William R. Forstchen is the author of over forty books, has a Ph.D. in history from Purdue University and is a Faculty Fellow at Montreat College. He has a broad spectrum of works including science fiction and fantasy, historical fiction, alternate history, several scholarly works, numerous short stories and articles and near-future novels ONE SECOND AFTER, PILLAR TO THE SKY and ONE YEAR AFTER. He is a New York Times bestselling author. www.onesecondafter.com www.dayofwrathbook.com www.spectrumliteraryagency.com/forstc...",
  "genres": [
    "Fiction",
    "Thriller",
    "Terrorism",
    "Audiobook",
    "Survival",
    "War",
    "Horror"
  ],
  "author": "William R. Forstchen",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/22962338-day-of-wrath"
}