{
  "title": "The Cowboy and the Canal: How Theodore Roosevelt Cheated Colombia, Stole Panama, & Bamboozled America",
  "description": "Within a richly layered context, The Cowboy and the Canal probes the intrigue behind Roosevelt's decision to purchase the expiring concession, rotting machinery, and dilapidated buildings from the bankrupt French Panama Canal Company and dig the interoceanic canal in Panama instead of the favored site, Nicaragua. Drawing from primary sources-newspaper stories, editorials, political cartoons, the Congressional record, books, magazines, journals, and letters-The Cowboy and the Canal reintroduces the voices who criticized Roosevelt's actions and questioned his motives, that through time and historical homogenization, have removed from what was at the time, a heated national conversation. These voices add a balance to what has been a one-sided conversation that lauds Roosevelt for \"taking Panama\" and ignores his indispensible role in manufacturing a rebellion within the country of an ally, Columbia, and in creating one of the biggest frauds of its kind ever perpetrated upon the American public. The villains who abetted, encouraged and facilitated Roosevelt's behind-the-scenes American takeover of the Columbian province of Panama and the subsequent diversion of millions of American taxpayer dollars into the hands of a few capitalists and financiers are varied. They range all the way from Roosevelt's youngest sister Corrine and her husband Douglas Robinson, to the scheming would-be French aristocrat, Philippe Bunau-Varilla, a slick New York corporate lawyer, William Nelson Cromwell, and the venerable John Hay, Roosevelt administration Secretary of State. Some of the most prominent industrialists and capitalists of the day, including financier J.P. Morgan, former president of the New York Stock Exchange, J. Edward Simmons, railroad magnate C. P. Huntington, and Charles Taft, multimillionaire older brother of the soon to become U.S. president, William Howard Taft, played supporting roles in this saga. An ex-Confederate general, Democratic Senator John Tyler Morgan, and an ailing but indomitable Joseph Pulitzer, and Pulitzer's editorial staff of his The World newspaper are among the unlikely heroes in this political drama.",
  "genres": [],
  "author": "J.M.  Carlisle",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/22963302-the-cowboy-and-the-canal"
}