{
  "title": "Public Offerings Book Two: The Price of a Life",
  "description": "One person stands between pandemic and hope for stopping this nightmare virus… Kirkus Reviews said this about Public Offerings Birthright (Book One) - \"…A densely plotted thriller that churns out suspenseful scenes… Characters are refreshingly intricate. Protagonist Dave isn’t a flawless hero; he seems to be an obsessive workaholic. The bad guys are even better.\" … Public Offerings continues as the threat to Liv Clement, Lokoma village mounts in this second of four installments, The Price of a Life. ... Revenge! Claire McQuaid has been obsessed with it for decades. Now, as the CEO of a large pharmaceutical firm, she holds the future of the world in her hands. She and powerful associates in banking and oil assemble an ingenious plan designed to wipe out the HIV virus, AIDS and malaria…or so it appears. The real mission is far more sinister. Millions of innocent people will be sacrificed in a manmade pandemic to accomplish the vengeful plot behind the plan. There’s one Dave Clement… Survival! Dave has dedicated his career to wiping out AIDS. Claire needs his network and skills to execute her pandemic scheme. Dave's conscience won't allow it. So Claire forces Dave to make a choice no father ever wants to keep her secret and help the pandemic advance unimpeded – or lose Liv, his 15 year old daughter, to the very virus he set out to eradicate. This breathtaking roller coaster ride ascends the snowy peaks of northern Colorado and hurtles through the rainforests of West Africa as Claire and her associates drive their new world order forward. With everything that ever mattered to him on the line, Dave races the clock to outwit the powerful plotters and to save Liv.Public Offerings won the prestigious Writers League of Texas manuscript contest for best thriller. It is available in four books as a thriller series. This volume, Public Offerings Part The Price of a Life, is the second installment.",
  "genres": [],
  "author": "Bob LiVolsi",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/22962826-public-offerings-book-two"
}