{
  "title": "The Bridge of Light",
  "description": "The Bridge of Light is a \"Lost World\" Science Fiction novel by American writer A. Hyatt Verrill. (In the same genre as Arthur Conan Doyle's \"The Lost World\" and H. Rider Haggard's \"She\".) It was originally published in the Fall 1929 edition of the pulp magazine Amazing Stories Quarterly. It was subsequently republished in book form in 1950 by Fantasy Press in an edition of 2,556 copies.The novel concerns the search for a lost city in South America. . .Before there was Indiana Jones, there was A. Hyatt Verrill . . . for this story, drawing on his own experiences in Central and South America. Against a background of tropical jungles, colorful Mayan ruins and a strange and fascinating city of the ancient Mayas, still alive and flourishing in the heart of Guatemala, this gripping science novel runs its course. Beginning in Vigo, Spain, events move swiftly, and strange adventures follow each other in rapid succession. An ancient Mayan codex, a priceless example of picture writing twenty centuries old, leads the reader through a maze of danger to the fabulous city, Mictolan. In the words of the ancient Maya chief, \" \"To reach it one must pass through the Valley of Death, the Tunnel of Serpents, the Pit of the great Crocodile. And even having passed such perils, one must cross the eight deserts with the raging whirlwind that cuts solid rock and must face the demon Ixputeque and the fiend Neztpehua in the realm of hot ashes and the two blazing mountains; and at last must enter the Cave of the Bats and cross The Bridge of Light. . .\" By many preliminary adventures, he does make it to Mictolan, where the major portion of the action occurs in a city hidden behind almost insurmountable barriers, where the civilization of the Mayas has flourished without external influence for two thousand years. The result is a startling blend of superstition and super-science, a civilization without benefit of the wheel—yet one which has explored the mysteries of the atom. Here he trades knowledge with the Mayan inhabitants and enjoys Mayan culture for a brief time. But before he can leave with his beloved Itza back across The Bridge of Light he must deal with a malevolent high-priest and gain freedom for the Mayans. Hyatt Verrill has drawn heavily upon his intimate knowledge of the Mayas in the writing of this highly entertaining yet informative novel of science.",
  "genres": [],
  "author": "A. Hyatt Verrill",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/2296589.The_Bridge_of_Light"
}