{
  "title": "Tour of Duty: John Kerry and the Vietnam War",
  "description": "Covering more than four decades, Tour of Duty is the definitive account of John Kerry's journey from war to peace. Written by acclaimed historian Douglas Brinkley, this is the first full-scale, intimate account of Kerry's naval career. In writing this riveting narrative, Brinkley has drawn on extensive interviews with virtually everyone who knew Kerry well in Vietnam, including all the men still living who served under him. Kerry also entrusted to Brinkley his letters home from Vietnam and his voluminous \"War Notes\" -- journals, notebooks, and personal reminiscences written during and shortly after the war. This material was provided without restriction, to be used at Brinkley's discretion, and has never before been published. John Kerry enlisted in the Navy in February 1966, months before he graduated from Yale. In December 1967 Ensign Kerry was assigned to the frigate U.S.S. Gridley ; after five months of service in the Pacific, with a brief stop in Vietnam, he returned to the United States and underwent training to command a Swift boat, a small craft deployed in Vietnam's rivers. In June 1968 Kerry was promoted to lieutenant (junior grade), and by the end of that year he was back in Vietnam, where he commanded, over time, two Swift boats. Throughout Tour of Duty Brinkley deftly deals with such explosive issues as U.S. atrocities in Vietnam and the bombing of Cambodia. In a series of unforgettable combat-action sequences, he recounts how Kerry won the Purple Heart three times for wounds suffered in action and was awarded the Bronze Star and the Navy’s Silver Star for gallantry in action. When Kerry returned from Southeast Asia, he joined the Vietnam Veterans Against the War (VVAW), becoming a prominent antiwar spokesperson. He challenged the Nixon administration on Capitol Hill with the antiwar movementcheering him on. As Kerry's public popularity soared in April-May 1971, the FBI considered him a subversive. Brinkley -- using new information acquired from the recently released Nixon tapes -- reveals how White House aides Charles Colson and H. R. Haldeman tried to discredit Kerry. Refusing to be intimidated, Kerry started running for public office, eventually becoming a U.S. senator from Massachusetts. But he never forgot his fallen comrades. Working with his friend Senator John McCain, he returned to Vietnam numerous times looking for MIAs and POWs. By the time Bill Clinton was elected president in 1992, Kerry was the leading proponent of \"normalization\" of relations with Vietnam. When President Clinton officially recognized Vietnam in 1995, Kerry's three-decade-long tour of duty had at long last ended.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "War",
    "Military Fiction",
    "Audiobook",
    "American History"
  ],
  "author": "Douglas Brinkley",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/229640.Tour_of_Duty"
}