{
  "title": "Hanoi Adieu: A Bittersweet Memoir of a Frenchman in Indochina",
  "description": "2007 NSW Premier's Literary Awards ShortlistJudges' Comments Hanoi, Adieu encapsulates the recent tragic history of a complex and beautiful country, and at its heart is the city of Hanoi '. . . an enchanting mélange of east and west'.Hanoi, Adieu is the elegiac memoir of Michel L'Herpinière, a young man who comes of age in the waning years of French colonialism. His story is recorded and transmuted by his stepdaughter, Mandaley Perkins. It is, as she says ... ' the story of his love for Indochina and its people ... the story of the march of folly that led France into war with the Vietminh ... the story of how decisions made far away in Paris, Saigon and Washington affected the lives of the people in this beautiful and provocative city .'Written in the first person, the narrative is as strong and clear-eyed in discerning the political intricacies and their deadly consequences, as it is poetically evocative of the landscape and people that had captured young Michel's heart. When, with his countrymen, he is forced to flee at the eleventh hour, it is the end of the French era in Vietnam . But ... ' for the Americans ... it was just the beginning '.As it can be with a truly dispassionate memoir or a totally engaged biography, in this book the microcosm of one man's experience holds the tragedy of his the forever-lost world of French Indochina. This is also, then, a gentle but expert lesson in the history of Indochina, making the complexities of cross-cultural and cross-ideological conflict comprehensible on the smallest of scales, that of one human being to another.The Indochinese milieu is fascinating, exotic, and the reader suspends all moral certainties and accepts the opium den and the brothel as valid sites for Michel's rite of passage. There, in the house by the Citadel, Michel finds an unlikely mother-surrogate in the Maîtresse de la Maison , Jo, a métisse (a French-Annamese) who is perhaps fifty -- elegant, decadent, sophisticated -- and who initiates him into the rituals of love-making and opium. But, like the city itself, she is not to be read on the surface, for Jo becomes Michel's mentor, his protector and saviour as Hanoi becomes increasingly dangerous.Hanoi, Adieu is an exquisitely beautiful and most beguiling story.",
  "genres": [
    "Biography",
    "Asia",
    "Nonfiction",
    "Memoir",
    "Historical"
  ],
  "author": "Mandaley Perkins",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/229741.Hanoi_Adieu"
}