{
  "title": "The Bee and the Butterfly: A Fable",
  "description": "ABOUT THE BOOK THE BEE AND THE BUTTERFLY is a fable about an encounter between a vain monarch butterfly and a modest, hard working honey bee. The butterfly spends his time flying about so he can show off his great beauty to the world. When he spots a bee busy at work sucking nectar from a flower so she can make honey out of it, the butterfly taunts the bee, urging her to quit her work and fly about. He goes so far as to insult the bee, but the bee ignores the butterfly and keeps doing her work. The moral of the story is sure to touch young and old alike. ABOUT THE AUTHOR Born in Israel (then called \"Palestine\"), Judith Weinshall Liberman came to the United States in 1947 to pursue higher education. She earned four American university degrees including two in law, a J.D. from the University of Chicago Law School and an LL.M. from the University of Michigan Law School. After settling in the Boston area in 1956, she studied art and creative writing. Beginning in the early 1960s, and for four decades thereafter, Ms. Liberman created numerous series of artworks. Her art has been widely exhibited and is represented in the collection of museums and other public institutions. During her long career in visual art, Ms. Liberman wrote several books, among them some children's books. Her book THE BIRD'S LAST SONG (Addison-Wesley, 1976), which she also illustrated, won a citation as one of the \"fabulous books of the year.\" Since 2012, she has published several additional picture books, including ICE CREAM SNOW (2012), THE LITTLE FAIRY (2013), COLOR IN OUR WORLD (2014), THE VERY OLD PAINTER AND HER HUSBAND (2014), HAIFA (2014) and ANGEL'S PUPPIES (2014). Judith Weinshall Liberman's archives can be found in the Arts Department of the Boston Public Library and at the Smithsonian Archives of American Art. ABOUT THE ILLUSTRATOR Radu Costea was born and raised in Iasi, Romania, where he studied computer science. In 2001 he moved to the United States to work in the information technology industry. He has designed product packaging and logos and has had extensive experience in publishing. THE BEE AND THE BUTTERFLY is the second book on which Mr. Costea and the author, Judith Weinshall Liberman, have collaborated; the first was HAIFA (2014). Mr. Costea's well developed artistic sense is evident from the illustrations he has created for the present book.",
  "genres": [],
  "author": "Judith Weinshall Liberman",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/22965622-the-bee-and-the-butterfly"
}