{
  "title": "Lidia's Family Table",
  "description": "The best-loved and most-admired of all America’s television cooks today, Lidia Bastianich, now gives us her most generous, instructive, and creative cookbook. The emphasis here is on cooking for the family, and her book is filled with unusually delicious basic recipes for everyday eating Italian-style, as well as imaginative ideas for variations and improvisations.Here are more than 200 fabulous new dishes that will appeal both to Lidia’s loyal following, who have come to rely on her wonderfully detailed recipes, and to the more adventurous cook ready to experiment. • She welcomes us to the table with tasty bites from the sea (including home-cured tuna and mackerel), seasonal salads, and vegetable surprises (Egg-Battered Zucchini Roll-Ups, Sweet Onion Gratinate). • She reveals the secret of simple make-ahead soup bases, delicious on their own and easy to embellish for a scrumptious soup that can make a meal. • She opens up the wonderful world of pasta, playing with different shapes, mixing and matching, and creating sauces while the pasta boils; she teaches us to make fresh egg pastas, experimenting with healthful ingredients–whole wheat, chestnut, buckwheat, and barley. And she makes us understand the subtle arts of polenta- and risotto-making as never before. • She shares her love of vegetables, skillet-cooking some to intensify their flavor, layering some with yesterday’s bread for a lasagna-like gratin, blanketing a scallop of meat with sautéed vegetables, and finishing seasonal greens with the perfect little sauce.• She introduces us to some lesser-known cuts of meats for main courses (shoulders, butts, and tongue) and underused, delicious fish (skate and monkfish), as well as to her family’s favorite recipes for chicken and a beautiful balsamic-glazed roast turkey.• And she explores with us the many ways fruits and crusts (pie, strudel, cake, and toasted bread) marry and produce delectable homey desserts to end the meal.Lidia’s warm presence is felt on every page of this book, explaining the whys and wherefores of what she is doing, and the brilliant photographs take us right into her home, showing her rolling out pasta with her grandchildren, bringing in the summer harvest, and sitting around the food-laden family table. As she makes every meal a celebration, she invites us to do the same, giving us confidence and joy in the act of cooking.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Italian Literature",
    "Nonfiction",
    "Reference"
  ],
  "author": "Lidia Matticchio Bastianich",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/22966.Lidia_s_Family_Table"
}