{
  "title": "سیری در سیره نبوی",
  "description": "کتاب حاضر دارای سه بخش است. بخش اول که (دیباچه) نام گرفته است شامل دو مقاله تحت عنوانهای (دعوتهای سه بعدی) و (موج اسلامی) به قلم متفکر شهید استاد مرتضی مطهری است. این دو مقاله در اصل مقدمه های جلدهای اول و دوم کتاب (محمد خاتم پیامبران) که مجموعه مقالاتی از چند تن از نویسندگان اسلامی است و در سال 1346 هجری شمسی برابر با 1400 هجری قمری به مناسبت آغاز پانزدهمین قرن هجرت از سوی مؤسسه حسینیه ارشاد (قبل از استعفای استاد) منتشر گردید می باشد. البته در آن کتاب این دو مقدمه به نام استاد چاپ نشده بلکه با امضای مؤسسه مذکور درج گردیده ولی اصل این مقالات به خط استاد موجود است و مناسب دیدیم که این دو مقاله را در ابتدای این کتاب قرار دهیم تا هم کتاب پربا ر شود و هم آثار استاد تمرکز بیشتری پیدا کند. بدیهی است قسمتهای اندکی از این دو مقاله که در توضیح مقالات آن کتاب می باشد حذف گردیده است. بخش دوم که قسمت اصلی کتاب می باشد مشتمل بر هشت سخنرانی استاد شهید تحت عنوان (سیره نبوی) است که در ایام فاطمیه سال 1396 هجری قمری مطابق با فروردین 1354 هجری شمسی در مسجد جامع بازار تهران ایراد شده است. عنوان اولیه این بحث (منابع شناخت از نظر اسلام) بوده است. که استاد پس از برشمردن چند منبع، سیره اولیاء دین را نیز به عنوان یکی از منابع شناخت از نظر اسلام معرفی نموده و از آنجا وارد بحث (سیره نبوی) می شوند. قبل از ورود به این بحث، استاد شهید بحث کوتاهی پیرامون این فکر انحرافی که (ما قادر به پیروی از اولیاء دین نیستیم) می نمایند. این بحث را مقدمه آن هشت جلسه سخنرانی قرار دادیم. بدیهی است بحث (سیره نبوی) بحثی بسیار گسترده است و اگر کسی بخواهد کتابی در این باب بنگارد چند مجلد قطور خواهد شد، چنانکه استاد در همین کتاب می فرمایند: (چند سال پیش من فکر کردم که در زمینه سیره پیغمبر اکرم کتابی بنویسم به همین سبکی که عرض خواهم کرد. مقدار زیادی یادداشت تهیه کردم ولی هر چه جلوتر رفتم دیدم مثل این است که دارم وارد دریایی می شوم که به تدریج عمیقتر می شود. البته صرف نظر نکردم و می دانم که من نمی توانم ادعا کنم که می توانم سیره پیغمبر را بنویسم ولی ما لا یدرک کله لا یترک کله بالاخره تصمیم دارم به حول و قوه الهی روزی چیزی در این زمینه بنویسم تا بعد دیگران بیایند بهترش را بنویسند). به همین جهت بهتر آن دیدیم که نام این کتاب را (سیری در سیره نبوی) بگذاریم. همان طور که استاد خود متذکر شده اند، درباره (سیره نبوی) یادداشتهای زیادی از ایشان موجود است. این یادداشتها به فضل خدا جهت استفاده محققین در سلسله یادداشتهای استاد منتشر خواهد شد. بخش سوم این کتاب که (ضمیمه) نام گرفته است متشکل از یک سخنرانی و ترجمه صد سخن از پیامبر اسلام (ص) می باشد. سخنرانی مذکور، تاریخچه ای است از زندگی رسول اکرم (ص) و نیز تحلیل سخنانی چند از آن بزرگوار که در هفدهم ربیع الاول مصادف با زاد روز پیامبر (ص) و امام صادق (ع) و در حدود سال 1348 هجری شمسی در حسینیه ارشاد ایراد شده است، و آن (صد سخن) توضیحی دارد که در همین کتاب ذکر شده است. بخش اعظم این کتاب یعنی نه سخنرانی مذکور قبلا با کسب اجازه از مسؤولین امر به صورت کتابی تحت عنوان (سیره نبوی) منتشر شده است. اگر چه تنظیم آن کتاب نسبتا خوب بود ولی جهت حفظ اصالت آثار استاد لازم بود که تنظیم مجددی با اعمال دقت کافی صورت گیرد. لهذا سخنرانیهای مذکور از نوبه دقت از نوار استخراج شد و مجددا با دقت وامانت لازم تنظیم و خوشبختانه اشکالات جزئی موجود در چاپ گذشته برطرف گردید و اینک با اضافاتی به صورتی که ملاحظه می شود منتشر می گردد. لازم به ذکر است که غیر از چاپ گذشته اول بار این کتاب از سوی یکی از واحدهای انتشاراتی بدون کسب اجازه از مسؤولین امر به صورت تلفیقی از آن هشت جلسه سخنرانی منتشر شد که در آن. تنظیم کننده، مطالب استاد را به قلم خود درآورده و اصالت کلام استاد را از بین برده بود و به علاوه دقت لازم در تنظیم آن به کار نرفته بود که البته در همان ایام از نشر مجدد آن جلوگیری به عمل آمد و بدیهی است که کتاب مذکور فاقد اعتبار می باشد. به هر حال از این پس این کتاب فقط به صورت حاضر عرضه خواهد شد و امید است که همچون دیگر آثار آن متفکر گرانقدر در استحکام پشتوانه فرهنگی انقلاب اسلامی مفید، و راهنمای عمل همه علاقمندان به این انقلاب الهی واقع شود، و چه راهنمایی بهتر از سیره و روش رسول اکرم، از خدای متعال توفیق بیشتر مسئلت می نمائیم. شورای نظارت بر نشر آثار استاد شهید مرتضی مطهری",
  "genres": [
    "Religion"
  ],
  "author": "Morteza Motahhari",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/2296798._"
}