{
  "title": "Mistaken Identity",
  "description": "Ever held your breath as the elevator doors slide open unsure of who could be staring back at you? And what about walking to your car and finding a note? Ever wish it was from the man who catches your attention? Poor Samantha isn’t sure when to let loose of her breath. Her fresh start causes more problems than the nerves she feels on the first day of work. She soon falls prey to a love that transforms into evil, lies that become twisted, and threats that come to be promises. She’s oblivious that the elevator holds her love, her heart break and her strength.***Warning***This book contains graphic sexually explicit content and intense violence that could be disagreeable or distressing to readers. The content is intended for mature readers only.Life sometimes gives you a fork in the road and doesn’t give you a hint of which direction to take. There’s no signs, no arrows, no neon lights to help. Luckily, Samantha Beckman chose the right path years ago and escaped from the horrors of her childhood. Along with her best friend, Jess, she lives a wonderful life—happy and carefree just as any twenty six year old should. Opportunity arises when Samantha lands the job of a lifetime as the COO’s executive assistant for North Carolina’s leading business, Weston Company. Yet, not everything is as it seems. Samantha soon learns Mr. Eye Candy from the elevator isn’t who he says he is, the sexy construction worker isn’t what she thought he was, and don’t forget about her new unwanted and clever stalker. Maybe her life isn’t as simple as she hoped it would be.Caught in the sights of two men and a stalker, Samantha is forced to decide between flight and fight, fear over strength. Will she be able to take the right path again, or has her luck finally run out?",
  "genres": [
    "Romance",
    "Dark",
    "Suspense",
    "Romantic Suspense"
  ],
  "author": "T.C. Matson",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/22996542-mistaken-identity"
}