{
  "title": "Broken Silence: Opening Your Heart and Mind to Therapy--A Black Woman's Recovery Guide",
  "description": "For too many years, African American women have suffered in silence under the dual oppressions of racism and sexism. Expected to care for others before they care for themselves, forced to deal alone with emotional and physical abuse, black women have turned stress and rage inward—with devastating consequences. But life doesn’t have to be this way. In Broken Silence, renowned psychologist Dr. D. Kim Singleton, herself a black woman, shares the inspiring stories of eight African-American women who have healed themselves by opening their hearts and minds in therapy.Dr. Singleton traces the psychology of today’s black women back to the days of slavery, when female slaves suffered abuse in silence—or died. Over the centuries, black women have learned to survive by adopting strategies like “keep your business to yourself” or “take your problems to the Lord,” with the result that giving voice to their pain is often the hardest part of the process. For Amy, breaking the silence meant facing up to the sexual abuse she suffered from her father for years. For Ava, it meant admitting that she depended, emotionally and financially, on a husband who tried to kill her. For Kate, it meant acknowledging a pattern of surrendering her identity and self-esteem to the men whose love she wanted. For all of these women, and hundreds of others Dr. Singleton has helped over the years, entering therapy took courage they didn’t know they had. But it has literally saved their lives. The stories gathered here read like novels about remarkable women struggling to overcome a legacy of suffering, loneliness, and deep humiliation. But Broken Silence also provides clear advice and guidance that will help all women deal with their most difficult life issues. Whether it’s keeping a journal, turning to the Bible for solace and insight, or adopting new strategies for coping with the pressures of the work place, there are many practical ways to confront stress and build hope.Women, especially black women, need to know that they are not alone in their experience of abuse, failed relationships, and career disappointment. They need to see that personal change is possible, and that lasting change can come from breaking the silence in therapy. Broken Silence is the book that will start the healing process and give women the power and clarity to live happy, effective lives.",
  "genres": [],
  "author": "D. Kim Singleton",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/229964.Broken_Silence"
}