{
  "title": "Wicked Hot Reads",
  "description": "WICKED HOT READS: Ten Paranormal RomancesIndulge in ten sexy paranormal romance novels, written by New York Times and USA Today bestselling romance authors. With shifters, vampires, demons, and otherworldly creatures all looking for their own forever-loves... This box set bundle will get you in the mood for a sensual Halloween!The books in Wicked Hot Reads: 10 Paranormal Romances would cost over $30 to buy individually. Save $29 by getting the bundle for just 99c for a limited time!Featuring:Beauty and the Beast (an erotic re-imagining) by NYT & USA Today bestseller Shoshanna Evers: The Beast can’t let his little Beauty go free, not while there’s still hope that she might be the one to end his decade-long curse…Knocking on Demon's Door by NYT & USA Today bestseller Cathryn Fox: When Michelle discovers what's really going on at the resort, will her trust in a demon turn her in to one of the missing, or will he save her from the real monsters?The Wolf Who Played With Fire by NYT & USA Today bestseller Sarah Mäkelä: Mia’s mistakes have forever changed the lives of those close to her, but when her soldier boyfriend, Ethan, goes missing on duty, she harness every magic power she possesses to get him safely back…Fallen Ever After by NYT & USA Today bestseller A.C. James: Arie wanted Holly from the very first moment he met her, but the long-standing feud between the faeries that run the Chicago Crew puts Holly and other fledgling vampires in danger. Can they stop a vampire-fae war that’s been brewing for nearly a century? Bared to Him by NYT & USA Today bestseller Jan Springer: Human by day, and a tentacle shapeshifter by night, sexy Gray Wagner, is the last male that Miranda Bolton dreams of falling in love with, until she begins to fantasize about all the naughty things he can do to her…A Mate's Bite by USA Today bestseller Milly Taiden: After an explosive night of passion, Karla is sure she’s a one-night stand for the man she’s wanted for years, but Nate has marked Karla. Only true love and a wolf's promise can hold together a relationship created with a bite and a hope for tomorrow.Archangel Rafe by Lisa Hughey: Angelina’s only respite from her overwhelming life is in her dreams with a stunningly hot angel, but when an unexpected threat puts both the Angelic Realm and Earth in jeopardy, Angelina will need to accept her destiny before it’s too late...Blaze of Secrets by Jessie Donovan: Rescued from a prison for magic users, Kiarra is now a wanted criminal and must rely on a mysterious Brit to help her evade capture. Before long, her handsome rescuer becomes much more than just her trainer…Mark of the Serapath by Titania Ladley: After a catastrophe unleashes Josie’s Serapathian witch magic, she suspects her sexy, mysterious lover is a Kynthian vampire ordered to kill all Serapaths. Despite the risks, passion explodes between them, threatening the future of the entire world.Dragon’s Honor by Mina Carter: Bodyguard duty. Undercover. As human. Simple. Until shadow-dragon Baron realizes the woman they’re protecting is his mate. Add in a crazy warlock…and Baron might have to make the ultimate sacrifice to save her.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Shapeshifters",
    "Anthologies",
    "Magic",
    "Fantasy"
  ],
  "author": "Shoshanna Evers",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/22999091-wicked-hot-reads"
}