{
  "title": "The Succubus Trilogy",
  "description": "The Succubus Trilogy is a dark paranormal tale of lust, deceit, love and indomitable will, available as one volume for the first time. 18+ readers only. Series includes M/F, M/M situations as well as violence and incubus ‘force feeding.’ If this isn't to your taste, please don't read.Seeking The Succubus For latent vampire Gwendolyn Jones, her role is clear. Keep the males of her clan satisfied, prevent them seeking partners amongst the fragile humans, and exposing their diminishing species. Its an essential function, but contempt from the fertile females and many of her ‘clients’ makes her yearn for a life where she’s considered more than a sex toy. A part-time job in a souvenir shop seems like an ideal compromise until the overwhelmingly sexy chef next door turns out not only to be a rogue latent, but one with a deluded fantasy that Gwen isn’t a vampire at all, but a kidnapped succubus he’s been seeking across the globe for years. Before The Succubus Grades are all that seem to be important to Lucas’ parents, that and securing their own future through his hoped for, lucrative career. The double standards of the older generation, especially their ‘do what we say, not what we do’ philosophy, makes life difficult for the most sought after virgin in school, especially as his parents indulge themselves as often as possible. Sneaking out to go to a party proves just how unimportant grades are, and how little his parents told him about the supernatural world. It seems like sex demons like himself are in high demand by vampire clans. But if the bloodsuckers expect him to roll over and play the submissive, they have another thing coming. As anyone who knows him would say, he's a stubborn git. But it seems as if that may be exactly what they want. Winning The Succubus Lucas thought all his troubles were over when he fulfilled his ambition to find the succubus Josie Dubois and return her to her loving parents and their varied supernatural friends on a tropical island paradise. Giving her time to come to terms with her new life, including the unfamiliar freedoms and choices it comes with, including whether to make a lifelong bond with him, was the only option, but time was not on their side. Her freedom had been negotiated, but his had been stolen at the cost of vampire lives, and they want their toy back.",
  "genres": [
    "Vampires",
    "Dark",
    "BDSM",
    "Dark Romance",
    "Paranormal"
  ],
  "author": "E. Jaye",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/22997414-the-succubus-trilogy"
}