{
  "title": "HOOKER",
  "description": "Who was the greatest pro wrestler of the 20th century?  The debate is a real one among those who seriously study the history of this American pop-culture creation. Like the arguments over any effort to crown \"the greatest,\" \"the best,\" or \"the worst,\" that answer is unlikely to ever be resolved to everyone's satisfaction. One fact is indisputable, though. For those who watched wrestling before it became \"sports entertainment,\" there is only one answer — Lou Thesz.  The son of European immigrants, Thesz discovered his love of amateur wrestling as a shy eight-year-old, scuffling with his father at night on the linoleum floor of the family's kitchen in south St. Louis. He was a natural at the sport, blessed with lightning-fast reflexes and a determination to succeed. He was obsessive about conditioning and hungry to learn, and those qualities eventually led him, as a teenager, into the closed and secretive world of pro wrestling, the only place where he could continue to compete on the mat.  This is Thesz' story — an adventure that took him to the heights of his chosen profession at a very young age and eventually into rings throughout the world. A devoted fan of pro wrestling, he won the respect and friendship of many of the legends. In the 1940s, when television demanded more action and a flashier style of wrestling, he became the transitional figure, the link to the past. Thesz decried the rise of \"gimmick\" performers like Gorgeous George and Buddy Rogers, who diminished the importance of the authentic style of wrestling he loved and practiced, but he adjusted because the bottom line of pro wrestling, as with any pro endeavor, was making money, and he could see where the future lay.  In the late 1940s and well into the 1950s, he was the world heavyweight champion of the National Wrestling Alliance, its standard-bearer, and he carried those colors with dignity and class. \"My gimmick was wrestling,\" he said, and it was evident to anyone who ever bought a ticket to see Lou Thesz that he was the real thing.  \"Hooker\" was something of a sensation among wrestling fans when it was first published in the 1990s because it was among the first accounts ever published by a major wrestling star that discussed the business with candor from the inside. Academics praised the book, too, for its clear depiction of an era and the rise of a cultural phenomenon.  This is a book for everyone with an interest in professional wrestling. This new edition published by Crowbar Press contains pages and pages of new material — stories and anecdotes — none of which has been published in any previous edition and all in the voice of one of the legendary figures of the game. Every sentence has been thoroughly combed over and vetted in order to answer any questions previously asked by readers, or to correct and/or re-order the \"facts\" as Lou recalled them, and each chapter now has detailed endnotes to further supplement the text. Combine all those ingredients with all-new, spellbinding forewords by Charlie Thesz and Kit Bauman (comprising 26 pages), an extensive 32-page \"addendum\" in Lou's own words, and a comprehensive name-and-subject index, and you have the definitive tome devoted to wrestling's golden era. This is \"no holds barred\" material — far more open and truthful than anything ever written about professional wrestling.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Autobiography",
    "Sports"
  ],
  "author": "Lou Thesz",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/22996887-hooker"
}