{
  "title": "Lessons I Never Learned At Meadowbrook Academy",
  "description": "\"Liz Maccie's debut novel is as tough, optimistic, and beautiful as her heroine, Roberta Romano. Roberta's voice is heartfelt and funny. Her story is exceptionally moving and honest. I love this book and the hope it has for young women everywhere.\" —Stephen Chbosky, New York Times bestselling author of The Perks of Being a WallflowerThe most important lessons aren't learned in the classroom.It’s the first day of sophomore year for Roberta Romano, but instead of the comfort of her local high school, she's been thrust into the elitist embrace of the affluent Meadowbrook Academy.Surrounded by wealth, Roberta battles her own insecurities to prove her worth and maybe land the boy of her dreams. With the help of two unlikely allies—and an inflatable toy raft—Roberta embarks upon a journey of dark secrets and self-discovery to learn the true meaning of friendship and acceptance.\"Roberta will charm and delight you with a voice that’s candid, hilarious, and hopeful, as she narrates her first day at a new high school, reminding us of the epic nature of each hour in our adolescent lives. Lessons I Never Learned at Meadowbrook Academy will make you laugh, cringe, cry, and cheer for the power of friendships that can change us in a single day.\" —Ava Dellaira, author of Love Letters to the Dead\"You wish your first day of prep school was this epic! Every single page of Lessons I Never Learned sparkles with heart and humor. Like a teenage Bridget Jones, Roberta Romano will make you laugh, cry, and cringe as she tries to navigate her first day at Meadowbrook Academy. She finds friends and enemies, earns detentions and serious respect, and makes memories that will last her a lifetime.\" —Siobhan Vivian, author of The List",
  "genres": [
    "Contemporary",
    "Young Adult",
    "Romance",
    "Teen"
  ],
  "author": "Liz Maccie",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/23000321-lessons-i-never-learned-at-meadowbrook-academy"
}