{
  "title": "Lacing Shadows: Anthology",
  "description": "Lose yourself in the Shadows.  Five young women each encounter a different supernatural seductive werewolves, shadowy vampires, dangerous fae, mysterious ghosts, and nightmare creatures.  Asia, a young college student, struggles between two seductive temptations. Farren is desperate to escape her heart-wrenching grief when she encounters vampires. Holly finds herself home alone on winter break when she rescues a handsome Fae. Lena has always been aware of a world beyond our own when she attempts to help a mysterious ghost. Ruby is entranced by a creature made of nightmares...  Lace yourself in scintillating tales of fated meetings, undying love, and eternal life.  Lacing Shadows features New Adult paranormal tales from five talented authors.  Spirit of the Wolf Asia, a young college student, struggles between two seductive temptations—her boyfriend, Jesse, and a new friend, Nati. Meanwhile, hidden forces strive to draw out the wolf spirit inside her. Will she embrace her nature…or have it driven out against her will? In the end, the spirit of the wolf may be the only thing that can save her and those she holds dear.  Eternal Guard Farren is desperate to escape her heart-wrenching grief, attempting to end her life when fate suddenly intervenes... Rescued by Joe, she finds herself an unwilling pawn in a vampire tug-of-war over her life. In a world where she can choose if her death will be final or eternal, why would she fight to live?  Into The Dark College freshman Holly Barclay finds herself home alone on winter break with plans to do some soul-searching. Being a Good Samaritan to a handsome wounded stranger, this human girl has not only endangered her heart but quite possibly her life. The holidays suddenly got a lot more exciting.  The Unspoken Truth Lena has always been aware of a world beyond our own. She is happily married and employed by the police to uncover the secrets of the dead, helping to solve cold cases. But when she meets Jessica Clayton, the abused wife of a rich industrialist who died in the 1800's, the parallels between them change her life completely. Is she ready to learn The Unspoken Truth?  Spinning Scars Some believe in legends, Others don’t want them to exist…. Immortality can have its downfalls, especially when you’re a creature made of nightmares constantly on the run. Enrolling in college, Matthias meets Ruby. When he discovers who she really is they are both in mortal danger, but for reasons Matthias has all wrong.",
  "genres": [
    "Fantasy"
  ],
  "author": "Andrea Stanet",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/23001803-lacing-shadows"
}