{
  "title": "Living With An Alcoholic: How To Take Control Of Your Relationship and Save The Person You Love",
  "description": "Can You Save Your Relationship from Alcoholism? Anyone who has ever watched a loved one experience the pain and suffering of dealing with alcoholism understands that it is an incredibly difficult illness to overcome. Is alcoholism part of your relationship? You might be wondering how you can best support your loved one as they become sober and battle the illness of alcoholism. This book will provide you with some of the best tools and advice to serve you, your relationship and your well-being throughout this tough situation. This book will help  1. Understand Alcohol Addiction, alcoholism symptoms and how it effects your loved one; 2. What your role is, as the partner of someone suffering from alcohol addiction; 3. How to avoid codependency, becoming an enabler or losing yourself to your loved one’s alcoholism; 4. Different methods and strategies for supporting your loved one and for taking care of yourself. If your loved one is suffering from alcohol addiction... this could be the most important book you ever purchase. Take control of your relationship and fight to save it. The aim of this book is to give you and your loved one the tools you need to become a success story. It won’t be easy and there will be bumps in the road along the way, but as sobriety has already been achieved by millions of alcoholics, you should have no doubt that it can be done. This book is unique as it’s written from the perspective of you – the loved one or partner of an alcoholic. Scroll Up To Download Your Copy Today! For a very limited time, you can get this Kindle book for just $2.99! Regularly priced at $4.97. Read it on your PC, Mac, Smart Phone, Tablet, or any Kindle device! alcoholism, codependency, enabler, gain control, living with an alcoholic, substance abuse, take back control, AA, al-anon, partnership, abuse, abuser, help, not alone, positive results, change, fiends, family, understanding, support, hidden alcohol, behavior, modification, holiday gatherings, embarrassment, anger, drunk driving, keeping secrets, blame the behavior, feeling better, relief, hope, better future, adult children of alcoholics, alcoholism symptoms, take control",
  "genres": [],
  "author": "Jamie Sandulf",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/23003556-living-with-an-alcoholic"
}