{
  "title": "Strangelove",
  "description": "In the summer of 1985, Fantage was poised to become the “next big thing” to emerge from the New York music scene. Formed by the brooding bassist and fiery keyboardist, Nigel Thompson and Zach Nichols, and fronted by the libidinous lead singer Leigh Stevens, their abundant good looks and rock-influenced, dance-friendly sound made them a fixture at Cinderblocks, uptown’s newest hotspot owned by their manager and benefactor Frank Monroe.  Meanwhile, hairdresser Shelly Bates was oblivious to anything happening north of her West Village studio. For five years, she had carefully dodged most forms of romance until the sudden reappearance of Lenny Sullivan—“the first man to break her heart and the last she ever wanted to see again\"—smashed their worlds together. He had finagled his way into Fantage as their new drummer just as the band was about to embark on their inaugural cross-country club tour with the hopes of scoring an elusive recording contract along the way. However, Lenny’s hopes for a reunion were doused when Shelly became so enchanted by his bandmates and their lifestyle that before she even joined the entourage she had catapulted them toward a destiny no one could have predicted.  Fantage was well aware that the tour was an enormous risk with a slim chance of paying off, especially since the advent of MTV had already begat a boisterous flock of pop music groups competing for the same spotlight. It was the 'style over substance' decade that saw only a handful of bands actually make it big, adding their synthesized flare to arena rock and inciting teenage hysteria wherever they went. Some bands languished in college dorm rooms while others became casualties of their own vices—and thus tabloid fodder—without even meriting a footnote in musical history. Even more prevalent were those bands who flew up the charts with a monstrous megahit that struck a chord with the record-buying, club-hopping public, never suspecting they had simultaneously written their own epitaph as a “one-hit wonder.” That particular trajectory Fantage was determined to avoid, if they even made it that far. As their unconventional mobile commune became riddled with calamities, the only place to hide from the bruised egos, frayed nerves, submerged emotions and severe claustrophobia was onstage…unless you were the hairdresser trying to mend your splintered heart.  Inspired by the song of the same name, STRANGELOVE is the first in a series of novels that unfolds as Shelly becomes an integral part of the band’s chaotic—and at times tragic—journey, on and off the tour bus. Part love story, part thriller and part homage to an unforgettable era of music, fashion and attitude, it is entirely a work of fiction and any similarities between the characters and persons living or dead is mostly coincidental…",
  "genres": [],
  "author": "S.A. Youngman",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/23008579-strangelove"
}