{
  "title": "Rescue Me: We Have Escaped",
  "description": "A hurricane's a bad time to learn why people say 'no good deed goes unpunished'.For Sergeant Ike Porter, a solo rescue of two citizens stranded in raging flood waters should earn him the final gold star on his way to a slot on Georgia's new anti-gang task force. When his victims' car slams into the rescue boat, both Ike and the tin can passing for a rescue vessel sustain damage, leaving the three of them high and far from dry.It could be worse.He could be Heather Harmon, the CERT emergency response volunteer who sees their plight and tows them all to safety. Heather thinks fast on her feet, but has no way of knowing the same tool she used to save the flood victims is fresh from a murder.It isn't often a cop gets rescued by a civilian. Widower Ike is quickly smitten with this brave woman and isn't about to let the sins of her ex interfere with their future, but he doesn't quite know the solution to helping Heather let go....Or that rescuing a killer has made her his next unwitting target.Picking up a cop boyfriend should be pretty handy under such dire circumstances, but as the bodies pile up and evidence of murder mounts against Heather, close proximity to law enforcement becomes a double-edged sword for them both.Sharpshooters like Ike aren't known for their Cassanova skills and he soon learns voicing your doubts is a real romance killer. Heather distances herself from his protection, leaving the field wide open for the murderer to strike again, frame his heroic victim, and walk away clean. ...All while rubbing every bit of it in Ike's face. Heather and Ike's faith in God is strong enough to sustain them individually, but if they can't show some faith in each other, history will repeat itself. Heather will square off with a killer alone, Ike will lose his last shot at love,and this time, he'll know he had the power to save her.",
  "genres": [],
  "author": "K.D. Harp",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/23008075-rescue-me"
}