{
  "title": "Captured Miracle",
  "description": "Sometimes the darkest of hearts are the most blinding. Not because of their light, but because of their suffocating endlessness. The dark abyss of their possession claims you before you’re even aware of the capture. Love is not linear. There is no timeline in which the emotion blooms. Sometimes it is a slow succession of events where one soul learns another and sometimes it’s quick. Sometimes it’s like lightning. Possessive. That’s what Calix was to me. He infused himself within my life – my mind – my body – and my heart. Until he possessed my soul. And then he shattered it all. The worst part of it all was that he owned me. Completely. And it only took him four days. What started out as an act of revenge quickly becomes so much more. After years of plotting and two years of watching Nova, Calix takes her. In the dead of the night, three strange men in her room, tugging her from her bed, wake Nova. Terrified of forcing the men to act on their threats to harm her mother and sisters, Nova agrees to allow them to cart her from the safety of her home. She never expected they would lead her to Calix. A dark and captivating man determined to have her as his wife – and every other way. As Nova tries to keep Calix from pushing his way past her barriers, his determination to capture her heart in the same way he captured her body grows. In his quest for her heart, Calix pushes her past her barriers and tests her every limit. When her heart softens, the reason for the game of revenge turns very real and Calix is forced to tell Nova just why he took her. Only, the truth will harden the heart that had softened against him. But Calix still won’t let Nova go. Until the end of time, she is his. *** This is an erotic romance. Captured Miracle is the first novel in what will be a three book series. This novel does end in a cliffhanger.",
  "genres": [],
  "author": "Alannah Carbonneau",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/23005534-captured-miracle"
}