{
  "title": "Fate Twister",
  "description": "Wayne Gamm was born on a remote sheep farm on a mountainside in north-mid Wales on a stormy night in June. The weather was not significant because it rains a lot in that part of Wales in most parts of Wales, in fact, pretty often. The doctors, the midwife and even the family itself, wanted the baby to be delivered in the nearest hospital because they knew that he was going to be large and it was her first baby, but for reason's that will become apparent, his mother and grandmother thought that would be a very bad idea. His father, Samuel Gamm, was the son of sheep farmers from Devon in England and he had met his future wife while touring in Wales as an itinerant sheerer. Wayne's mother, Gwynedd was a Welsh-speaker from the area. All of her family had been born on the farm, Yr Ardd Y Ddraig, The Dragon's Garden, for as far back as they knew - a family bible put that at at least three hundred years. All of Wayne's ancestors on his mother's side, and that included Rhiannon, his maternal grandmother, or Nain in Welsh, were witches, or male witches, or warlocks, of the White variety, meaning that their intentions were good, rather than that their skin was pale. The problem with the males of Gwynedd's line in her own words was that they were 'lose cannon(s)', meaning that they had difficulty focussing their energy or powers. Wayne followed after this fashion, although all witch babies have to learn some self-control, even the females. So, Gwynedd and Rhiannon held out high hopes that Wayne would be able to focus, or concentrate, more than his male antecedents, but he showed little sign of it. It turned out that he had such great power, and so little control, that even his own family were wary of him. He was feared and shunned at school and college by teachers and fellow-students alike although they didn't know the full extent of the Gann's family history. They only knew from experience, that things could be a little bit weird when Wayne was around. The more astute noticed that when he was happy, good things happened, but when he had been upset, well, anything could befall anyone, not only the person responsible for Wayne's bad mood. Luckily, Wayne had a sunny disposition. He was a happy person by nature, but this made it worse for him, because he didn't want to hurt people, so he would not accept that it was he who was causing the disruptions. They called him Fatetwister behind his back. Wayne grew up dejected, rejected, lonely and in denial. He discovered that girls were more friendly towards him, especially those who didn't know his background, because he was tall, dark and handsome. He was also quiet - the strong, silent type rather than brash like most boys of his own age. This is the story of the first part of the life of Wayne Gamm, Fatetwister.",
  "genres": [
    "Witches"
  ],
  "author": "Owen  Jones",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/23006706-fate-twister"
}