{
  "title": "Seduction - One Fortune at a Time",
  "description": "Seven steamy novellas from seven acclaimed romance authors, guaranteed to bring good fortune (or at least a hot read) to any romance fan. There's a seduction for everyone in this collection of never-before published stories that range from sensual to erotic—all for one seductive price!Temptation Returns by Lisa Carlisle – Antonio returns from the Marine Corps and runs into the woman he never forgot at a rock club. Lina can't believe Antonio is back in town, right before her wedding. Can she resist temptation in the form of a dark-haired Italian Marine?Love Charm for Fiona by Carly Carson – When Fiona receives a fortuneteller's love charm, she casts the spell to bring her dead fiancé back to life. But a love charm has its own magic, and what she gets is a surprise in the form of a SEAL on \"shore leave.\"Fear Of Flying by Leigh Court – Book publicist Jessie Jordan is deathly afraid of flying, which prompts travel writer Regan Quade to come up with a highly imaginative (and intimate!) way to calm her anxiety. Thrown together on a two-week book tour, the result just might be a bestseller!Hearts on Fire by Roz Lee – They’ve been burned before, but desire will rekindle the flames of love in this sensual and heart wrenching story of redemption and second chances.Heart's Destiny by Jennifer Lynne – Eve Perroniʼs quest to find her past leaves no time for love, until a chance prediction leads to the seductive Ky Ransom and a destiny that could make—or break—both their hearts.Moonlit Seduction by Anne Kane – Winston is a mutt with a mission - to convince Natalie that her fortune lies in surrendering to the seductive Jacob McKinley.Hidden Fortune by Laura Sheehan – Ava has always played it safe, but after a midnight run-in with a handsome stranger, she discovers that perhaps fortune favors the bold. Can she find the courage to seek the ultimate treasure?",
  "genres": [],
  "author": "Jennifer    Lynne",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/23005695-seduction---one-fortune-at-a-time"
}