{
  "title": "Errands Into the Metropolis: New England Dissidents in Revolutionary London",
  "description": "Errands into the Metropolis offers a dramatic new interpretation of the texts and contexts of early New England literature. Jonathan Beecher Field inverts the familiar paradigm of colonization as an errand into the wilderness to demonstrate, instead, that New England was shaped and re-shaped by a series of return trips to a metropolitan London convulsed with political turmoil. In London, dissidents and their more orthodox antagonists contended for colonial power through competing narratives of their experiences in the New World. Dissidents showed a greater willingness to construct their narratives in terms that were legible to a metropolitan reader than did Massachusetts Bay's apologists. As a result, representatives of a variety of marginal religious groups were able to secure a remarkable level of political autonomy, visible in the survival of Rhode Island as an independent colony. Through chapters focusing on John Cotton, Roger Williams, Samuel Gorton, John Clarke, and the Quaker martyrs, Field traces an evolving discourse on the past, present, and future of colonial New England that revises the canon of colonial New England literature and the contours of New England history. In the broader field of early American studies, Field's work demonstrates the benefits of an Atlantic perspective on the material cultures of print. In the context of religious freedom, Errands into the Metropolis shows Rhode Island's famous culture of toleration emerging as a pragmatic response to the conditions of colonial life, rather than as an idealistic principle. Errands into the Metropolis offers new understanding of familiar texts and events from colonial New England, and reveals the significance of less familiar texts and events.",
  "genres": [],
  "author": "Jonathan Beecher Field",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/23006112-errands-into-the-metropolis"
}