{
  "title": "A Good Mother",
  "description": "Two mothers. Two daughters. One devastating truth.Alex Blake was terrified of water, and had been since she nearly drowned at age five. So when police find her body in the river and rule it a suicide, her mother, Jen knows they’re wrong. But no one will listen to a grieving mother.The police dismiss her. Her husband thinks she’s in denial. Even their neighbours, the Higgins family, urge her to accept the truth and move on. But something isn’t right. Why was Alex messaging Lia Higgins, Jen’s former best friend, the day she died? And why is Lia now so desperate to shut down Jen’s questions?The more Jen digs into the perfect family next door, the more she realises Alex was keeping secrets. Dangerous ones. Someone knows what really happened to her daughter. And they’re determined to keep Jen from uncovering the truth.A breathtaking, stay-up-all-night emotional page-turner about motherhood, friendship and betrayal. Perfect for fans of K.L. Slater, Lisa Jewell and Nicola Sanders. Readers love Michelle ‘A compelling page turner... what a rollercoaster read..’ Liz Nugent, bestselling author of Strange Sally Diamond‘If you love Freida McFadden this book will blow you away.’ Reader Review, ⭐️⭐️⭐️⭐️⭐️‘Gets right under your skin with a complex web of secrets and lies that draw the characters together in twist after original and unexpected twist. You might think twice about booking a luxury break after reading this!’ Sam Blake, No.1 bestselling author of Remember My Name‘Such a brilliant read - could not put it down.’ Reader Review, ⭐️⭐️⭐️⭐️⭐️‘A stunning thriller that will keep you hooked until the spectacular ending.’ Reader Review, ⭐️⭐️⭐️⭐️⭐️‘Honestly, I read it all in one sitting and I couldn't get enough of it.’ Reader Review, ⭐️⭐️⭐️⭐️⭐️‘Wow! I loved this! I couldn't put it down and read during every free second I could spare.’ Reader Review, ⭐️⭐️⭐️⭐️⭐️‘What a fantastic read - my favorite book so far this year.’ Reader Review, ⭐️⭐️⭐️⭐️⭐️‘Absolutely sensational... The twists the storyline and the gripping tension are phenomenal. I read this book in one sitting…’ Reader Review, ⭐️⭐️⭐️⭐️⭐️‘So many twists and turns! ... a real page turner!’ Reader Review, ⭐️⭐️⭐️⭐️⭐️‘What a thrilling and exciting book.’ Reader Review, ⭐️⭐️⭐️⭐️⭐️‘Kept me engrossed, wanting to find out how all the characters are connected. The plot is intricate and emotional.",
  "genres": [],
  "author": "Michelle Dunne",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/230086243-a-good-mother"
}