{
  "title": "The Scarred Box set",
  "description": "The Scarred Box Set  Scarred and Healed together in one box set!  Sometimes the deepest scars are the ones you don't see.  Everyone in Jonesville thought that Bryce Evans had the perfect life in High School: he was the Mayor’s son, the quarterback for the football team, the boyfriend of the head cheerleader and had a 4.1 GPA. His acceptance to Notre Dame came as no surprise but when he chose to enlist in the marines instead everyone was shocked.  Lexi Lord was the quiet girl in school and kept to her small group of eccentric friends. She had no connection to any of the popular kids except for one incident on Prom Night when her path crossed with Bryce’s. When Bryce enlisted Lexi was the only one that wasn’t disappointed and decided to send him anonymous letters as a way to feel connected to him. She stopped after a year because she felt there was nowhere for their relationship to go.  Fast-forward four years and Bryce is back in Jonesville and once again he and Lexi cross paths. Only he’s no longer the seemingly perfect man and Lexi’s no longer the quiet girl.  This time their relationship is quite different but both of them have secrets from the past and friends that threaten to ruin their chance at happiness together.  Healed  Sometimes love can heal you from your scarred past. But sometimes it's the love we don't expect that makes the biggest impact  Lexi Lord has dreamed of dating Bryce Evans for years. But now that her dream has become a reality, she is no longer sure that he is the man for her. When a death unveils a deep secret, Bryce and Lexi's world together is torn apart and they are both forced to question everything surrounding their relationship and very existence.  There are some bonds that can never be broken, but Lexi and Bryce have to decide which love can heal them from their scarred pasts and which love they have to let go of. Because sometimes letting go of someone can be the greatest gift of all.  New Adult Contemporary Romance **Mature Content** Recommended for ages 17+ due to sexual situations and language.",
  "genres": [],
  "author": "J.S. Cooper",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/23006348-the-scarred-box-set"
}