{
  "title": "Inked",
  "description": "Three contemporary romance and erotica authors bring you the collection INKED--three full-length novels centering around all things tattoos.All sales from INKED will benefit women in need of mastectomy tattoos and tattoos that cover scars. Award-winning, world-renowned tattoo artist Madame Lazonga specializes in tattooing women, particularly in beautifying women who have experienced the scars that surviving cancer can leave behind.PUNCTURED, BRUISED, AND BARELY TATTOOED – Jade C. JamisonKory McCallister has had her eyes on tattoo artist Stone Bowman for quite some time—so long, in fact, that no other guy will do. Stone pushes every turn on button Kory has—he’s tattooed from head to toe (well, at least she prays he’s tattooed on his lower half); he’s hot; he’s funny and charming; and he’s also mysterious. So when Kory’s friends dare her to ask Stone out on a date, she can’t believe she actually finds the guts to do it.More surprising? He takes her up on the offer.She discovers that, while his past might not be quite as dark or mysterious as she’d imagined, it’s bigger than she’d expected, and it’s something she will need to contend with if she decides she wants to keep him around to color her life for good.SHATTERED STRINGS – JM WalkerEvancroft. This one word means everything to me. My band. My heart. My life. Without the music, I am nothing. I don’t exist. When we play, we are one. We are in control.On stage I am a woman. Powerful. Dominating. Forcing the crowd to submit to my words. Off stage? I am the complete opposite. Innocent.Jace Croft. He is the oil to my water. The darkness to my light. My band mate. My best friend.One unexpected night together unleashes new feelings that we both try to ignore but the band comes first. It always comes first.Or so I thought.HOUSE OF PAYNE – Stacy GailLife is supposedly what you make of it, but that’s crap as far as 3D artist Becks Delgado is concerned. She never wanted her brother to die in a car accident… or to be the one who was behind the wheel. Her external scars are nothing compared to the raw wounds inside, and death seems to be the only way to find peace.Sebestian Payne took the concept of a tattoo parlor and transformed it into a sophisticated gallery of living art. The House Of Payne now caters to the rich and infamous, has garnered a worldwide following, and is run by Sebastian with an iron fist. He knows Becks is exactly what The House Of Payne needs, but there’s a problem. The accident that changed her life left its mark on him as well, and whether he likes it or not, it’s time to put his House in order.",
  "genres": [],
  "author": "Jade C. Jamison",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/23009140-inked"
}