{
  "title": "Love and Other Ways of Dying: Essays",
  "description": "In this moving, lyrical, and ultimately uplifting collection of essays, Michael Paterniti turns a keen eye on the full range of human experience, introducing us to an unforgettable cast of everyday people. In the seventeen wide-ranging essays collected for the first time in Love and Other Ways of Dying, he brings his full literary powers to bear, pondering happiness and grief, memory and the redemptive power of human connection. In the remote Ukranian countryside, Paterniti picks apples (and faces mortality) with a real-life giant; in Nanjing, China, he confronts a distraught jumper on a suicide bridge; in Dodge City, Kansas, he takes up residence at a roadside hotel and sees, firsthand, the ways in which the racial divide turns neighbor against neighbor. In each instance, Paterniti illuminates the full spectrum of human experience, introducing us to unforgettable everyday people and bygone legends, exploring the big ideas and emotions that move us. Paterniti reenacts François Mitterrand’s last meal in a rustic dining room in France and drives across America with Albert Einstein’s brain in the trunk of his rental car, floating in a Tupperware container. He delves with heartbreaking detail into the aftermath of a plane crash off the coast of Nova Scotia, an earthquake in Haiti, and a tsunami in Japan—and, in searing swirls of language, unearths the complicated, hidden truths these moments of extremity teach us about our ability to endure, and to love. Michael Paterniti has spent the past two decades grappling with some of our most powerful subjects and incomprehensible events, taking an unflinching point of view that seeks to edify as it resists easy answers. At every turn, his work attempts to make sense of both love and loss, and leaves us with a profound sense of what it means to be human. As he writes in the Introduction to this book, “The more we examine the grooves and scars of this life, the more free and complete we become.”",
  "genres": [
    "Essays",
    "Nonfiction",
    "Journalism",
    "Short Stories",
    "Travel",
    "Unfinished",
    "Literary Fiction"
  ],
  "author": "Michael Paterniti",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/23012474-love-and-other-ways-of-dying"
}