{
  "title": "Heroes & Heartbreakers",
  "description": "Meet five sexy, irresistible heroes and heartbreakers in these full-length contemporary romance novels by NYT and USA Today Bestselling Barbara Freethy, Carly Phillips, Christie Ridgway, Barbara Samuel and Roxanne St. Claire. *This special boxed set will be available for a limited time. Join the fun now!Ryan's Return by Barbara FreethyFamous photojournalist Ryan Hunter has come back to a family torn apart by mistrust -- to the father who disowned him, to the brother who betrayed him, to the little boy who shares his features. Ryan, the charismatic \"bad boy\" stirs up conflicts like a whirlwind...throwing Kara Delaney's fragile, passionate heart into turmoil. Kara has built a new life for herself and her little girl, but Ryan's return and nature's impending fury threatens to expose long-buried secrets. Kara and Ryan must work together to save their families.... and to explore a dangerous, irresistible love as mighty and enduring as the onrushing river.Perfect Partners by Carly PhillipsNo sooner had lawyers Chelsie Russell and Griffin Stuart lost their siblings in a car crash than they find themselves fighting for custody of their two year old niece. Griff wins but finds he still needs Chelsie. As they slowly bond over the little girl, the desire between them grows. But lingering mistrust threatens their relationship. What will it take for these two unexpected lovers to believe they can be perfect partners after all?First Comes Love by Christie RidgwayKitty Wilder longed for a little respectability, so eight years ago she finagled an \"I do\" out of local hero Dylan Matthews. The ceremony was only supposed to be a tourist attraction sham, but a loophole made it legal ... a little fact she'd \"conveniently\" neglected to share until Dylan comes storming back into her life ready to have it out with his unexpected wife.Breaking The Rules by Barbara SamuelMattie O’Neal was on the run. She’d stolen a car, cut off her hair, changed her name and was slinging hash in a small Arizona town. She thought she was safe – until Zeke Shephard walked through the door.Space In His Heart by Roxanne St. ClaireCommander Deke Stockard, a Navy fighter pilot turned astronaut, has one thing on his a mission to space. Until PR superstar Jessica Marlowe shows up and announces Deke’s going to become “the face of NASA” to make America fall in love with the space program again. Consumed with the safety of the upcoming shuttle launch, Deke has zero interest in being part of a lame media blitz, but orders can't be ignored. He also can’t ignore the way Jessica's sexy smile and single-minded determination throw his well-ordered life into a tailspin....and ignite an undeniable attraction. But when the next launch becomes a ticking time bomb, Deke and Jessica will have to work together to uncover sabotage and secrets before they can find the space in their hearts for love.",
  "genres": [],
  "author": "Barbara Freethy",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/23008904-heroes-heartbreakers"
}