{
  "title": "Het lied van de rode robijn",
  "description": "Agnar Mykle was een van de bekendste romanschrijvers van het hedendaagse Noorwegen. Volgens vooraanstaande critici in de Scandinavische landen, zowel als in Engeland en Amerika moet zijn levenswerk Het lied van de rode robijn tot de literatuur worden gerekend.Deze roman is het verhaal van de 23-jarige student Ask Burlefot, die aan een Handelshogeschool gaat studeren. In de eerste ronde van zijn jeugdjaren heeft hij het er slecht afgebracht, vooral wat zijn liefdesleven betrof. Voor hij het schip verlaat, dat hem naar de onbekende stad waar hij gaat studeren voert, is hij al in een nieuw liefdesavontuur verwikkeld. Toch is Ask niet ‘De Casanova van Bergen’, zoals Paul Gjesdahl (de Noorse Hans van Straaten) in Arbeidersbladen (het Noorse Vrije Volk) boven zijn recensie schreef.Ask is vooral een jongeman die naar het pure en edele streeft, een ietwat verlate puber, een idealist, een socialist (die veel vermakelijke kritiek heeft op praktijk va het socialisme) en een doodverlegen jongen die, als hij eindelijk het meisje van zijn dromen vindt, zich de eerste jaren niet durft uiten. Amerikaanse critici hebben Mykle vergeleken met Thomas Wolfe en D.H. Lawrence. The British Weekly schreef: “Puriteinen zullen het ergste verwachten, en vinden: maar het zou heel bar zijn als dat alles was, wat er te zeggen viel. Dit is een zeer gevoelig en mededogend boek.”Toen deze roman al enige tijd in de handel was en reeds door een aantal Noorse bladen gunstig besproken zowel als afgekraakt was, verscheen er op een kwade dag een rechercheur van de zedenpolitie in de wachtkamer van Uitgeverij Gyldendal in Oslo en verzocht de directeur, Harald Grieg, te spreken. Nu is Gyldendal een van de grootste en meest eerbiedwaardige uitgeverijen van Scandinavië en het was op die kwade dag al meer dan 70 jaar geleden, dat een officier van justitie in Noorwegen een boek in beslag had doen nemen op beschuldiging van pornografie. Daarom is het begrijpelijk, dat de directeur van deze uitgeverij de hem onbekende functionaris rustig liet verzoeken, op een andere dag te willen terugkomen, aangezien hij druk bezig was. De rechercheur voelde daar niet veel voor en het hoge woord kwam er weldra uit: de heer Grieg en zijn auteur Mykle kregen een procesverbaal wegens het verspreiden, respectievelijk schrijven van een onzedelijke, althans aanstotelijk boek, genaamd Het lied van de rode robijn.Weldra schreef Het Vrije Volk, Amsterdam, onder het opschrift “Zedenloos (?) boek zet Noorwegen op stelten”: “Sedert het proces tegen de landverrader Quisling is er in Noorwegen en geheel Scandinavië voor een rechtsgeding niet zó’n enorme belangstelling geweest als thans voor de zaak tegen de bekende Noorse auteur AGNAR MYKLE.Mykles standpunt: ‘Ik ben een dichter, ik wens vrij te zijn, niemand kan mijn pen bedwingen’, wordt onder meer gedeeld door enige bekende Zweedse en Deense critici en schrijvers, die als getuigen à décharge zullen optreden.De principiële inzet van het debat over deze zaak (aldus het Vrije Volk) dat ver buiten culturele en kerkelijke kringen nu al maanden lang in geheel Scandinavië met grote heftigheid wordt gevoerd, is deze: zal de Noorse literatuur in de toekomst al dan niet onder juridisch toezicht komen te staan.Het proces begint maandag (zo vervolgde het Vrije Volk), Mykles verdediger heeft geëist, dat het bewuste boek, dat in Noorwegen in beslag is genomen, maar dat in andere Scandinavische landen grif wordt verkocht, volledig wordt voorgelezen. De interesse voor deze rechtszaak overschaduwt die voor de volgende maand te houden parlementsverkiezingen volledig. Honderden journalisten, fotografen en radioreporters hebben om een perskaart gevraagd, maar slechts dertig kunnen er worden geplaatst. Op de publieke tribune is slechts ruimte voor 25 personen.” Tot zover het Vrije Volk te Amsterdam.Wat er na die maandag allemaal gebeurde kan men lezen in een door Gyldendal uitgegeven witboek, waaruit wij enige vermakelijke en leerzame dingen zullen aanhalen. Drie dagen gingen voorbij met het voorlezen van het gehele boek. In Nederland is dit een conclusie van de Hoge Raad uit 1911, maar in Noorwegen staat dit zelfs in de wet: een boek moet in zijn geheel aanstotelijk voor de eerbaarheid zijn, niet voldoende is dat passages of hoofdstukken dat zijn. Na voorlezing van het boek kwam een stoet letterkundigen en critici (die het boek verdedigden als kunstwerk), psychologen, theologen, uitgevers (!) en andere deskundigen uit Noorwegen, Denemarken en Zweden vertellen, dat het Openbaar Ministerie zich had vergist. De zittingen duurden totaal 14 dagen en de kranten brachten dagelijks uitvoerige verslagen onder vette koppen.De getuigen à charge: 2 dominees, een hoogleraar en een psycholoog (ongeveer dezelfde samenstelling als in Nederland tegen het derde deel van Bob en Daphne!) vonden dat het boek aanstoot gaf aan de gevoelens van eerbaarheid (i.c. de oneerbare gevoelens van eerbaarheid...) van ‘normale’ mensen.Bijna een maand na het begin van de rechtszaak kwam de rechtbank tot de conclusie dat de heren Grieg en Mykle vrijspraak kregen, aangezien zijn te goeder trouw hadden gehandeld, maar dat de voorraad van het boek vernietigd moest worden, aangezien de inhoud aanstoot zou kunnen geven.Van dit vonnis ging Gyldendal terstond in hoger beroep. Het aantal rechters van het Hof, normaal 5, werd verhoogd tot 15. Met 12 tegen 3 stemmen kwam dit eerbiedwaardige rechtscollege tot de slotsom, dat het boek niet aanstotelijk voor de eerbaarheid in de zin der wet was, ondanks gevoelens van twijfel ten aanzien van sommige passages. De meerderheid van de rechters wilde de nadruk leggen op een onmiskenbare ontwikkeling in de richting van meer vrijheid en meer openhartigheid waar het de seksualiteit betreft en noemden diverse romans, waaronder Lady Chatterley’s Lover.Na deze inleidende opmerkingen concludeerde het Hof, dat het niet voldoende is, een boek pornografisch of aanstotelijk voor de eerbaarheid te noemen louter omdat het in staat is gevoelens van afschuw bij vele lezers te wekken. Met instemming van het begrip ‘vrijheid van drukpers’ concludeerde het Hof tot vrijspraak.Na 18 maanden opschudding, debatten, pro- en contra-duels in de pers kwam er een eind aan de zaak, een eind, dat even logisch als gelukkig was.De eerste druk van deze roman bedroeg in Noorwegen 4.000 exx. Een jaar na de vrijspraak waren er in Noorwegen 75.000 exx. verkocht. Thans is deze roman verschenen in de drie Scandinavische landen, Duitsland, Frankrijk, Italië, Japan, Engeland, Amerika, Nederland en België.",
  "genres": [
    "Classics",
    "Fiction",
    "Novels",
    "Romance",
    "Banned Books",
    "Roman",
    "Scandinavian Literature"
  ],
  "author": "Agnar Mykle",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/23010869-het-lied-van-de-rode-robijn"
}