{
  "title": "SOLD",
  "description": "SOLD is the first book in the SOLD series, however it is recommended that you read MASTER OF PASSION and TAKEN prior to reading SOLD, as some of the characters are introduced in those books and key events take place prior to SOLD.  *** All my life I wanted to belong. I wanted to get away from my drunken mother. And my asshole of a father. I've lived a privileged life, one that I've tried to hide from. All it has gotten me is heartache. I left on a trip to find myself. I was taken, blindfolded, beaten, and sold. My story doesn't end there. Now I belong. To him. Unwillingly. He says he will own me, own my body, soul and mind. This is my story. It isn't a fairy tale. It's the fucked up mess of my life, and the man who owns me. He has demons of his own that he fights. He lives a privileged life but it wasn't always that way. He's been living in his own hell. And I've introduced him into mine. He says he's broken. I am the piece to his puzzle. The puzzle that is his life. I wont give up without a fight. I wont give in. I want my freedom, I want my life. What if I come to discover that what I've been searching for is him? He can heal my soul, fill me, break me and make me new again. He is my true Nightmare. I don't need to sleep to see him.  *** My name is Chase. I have been watching and waiting for this day for over seven years. Since my father was murdered my life was surrounded by her. I took comfort in the fact that soon I would be able to make him hurt just as he has hurt me. I would be able to make him beg as I begged him all those years ago when he was standing behind my dad with a gun to his head.  I was a young man then. I hadn't decided what I wanted to do with my life yet. I didn't know where I wanted to go, but I did want to go. I wanted to escape. But watching my father as he was murdered before my eyes changed everything. Now I am motivated by revenge. I was out to make him pay. He would pay through her.  I would make her my slave. She would pay the sins that her father Michael James Lippman committed. She would bow to my will. She would do whatever I ask of her. I planned on using her until she was broken beyond repair.  I planned on breaking her and then tossing her out to hurt him even more. To pour more salt in his wounds. What I hadn't planned on was falling irrevocably and madly in love with her. I hadn't planned on her changing everything, but she did. I found my escape; in her.          Taken and Bound (Taken 2 and SOLD 2) is coming out September/October 2014  18+ Contains sex trafficking, abuse, disturbing content, and other subject matter. If such material offends you please don't buy this book.  Follow me on Facebook for up to date information, giveaways, spoilers, sneak peeks, and teasers! https://www.facebook.com/pages/Nikki-...",
  "genres": [
    "Dark",
    "Erotica",
    "Erotic Romance",
    "Dark Romance",
    "BDSM"
  ],
  "author": "Nikki Faye",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/23011316-sold"
}