{
  "title": "It's Not About Perfect: Competing for My Country and Fighting for My Life",
  "description": "It's Not About Perfect is inspirational memoir of the most decorated gymnast in American history, her recovery from cancer, and her miracle pregnancy.\"When the odds were against me, I was always at my best.\"When she retired at age 19, Shannon Miller did so as one of the most recognizable gymnasts in the country. The winner of seven Olympic medals and the most decorated gymnast, male or female, in U.S. history, Shannon tells a story of surviving and thriving. A shy, rambunctious girl raised in Oklahoma, Shannon fell in love with gymnastics at a young age and fought her way to the top.In 1992 she won five Olympic medals after breaking her elbow in a training accident just months prior to the Games. Then, in 1996, a doctor advised her to retire immediately or face dire consequences if she chose to compete on her injured wrist. Undeterred, Shannon endured the pain and led her team, the \"Magnificent Seven,\" to the first Olympic team gold medal for the United States in gymnastics. She followed up as the first American to win gold on the balance beam.Equally intense, heroic and gratifying is the story of her brutal but successful battle with ovarian cancer, a disease from which fewer than fifty percent survive. Relying on her faith and hard-learned perseverance, Shannon battled through surgery and major chemotherapy to emerge on the other side with a miracle baby girl.Her story of trial, triumph and life after cancer reminds us all that its life's bumps and bruises that reveal our character. From early on in her career, Shannon knew that life wasn't about perfection. In this incredible and inspirational tale, Shannon speaks out so as to be seen and heard by thousands as a beacon of hope.",
  "genres": [
    "Memoir",
    "Sports",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Shannon Miller",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/23014656-it-s-not-about-perfect"
}