{
  "title": "Break Maiden",
  "description": "The thrilling conclusion to the Chrome Horsemen MC trilogy   In For A Penny, In For A Pound  When Nicole is set up to look like a traitor to the Chrome Horsemen MC and the man who risked his life to save her, Nicole doesn't expect that anyone will come to her rescue. Now held captive by the man she fought so hard to escape, Nicole is looking for any opportunity to get word to Cole to convince him that his plight wasn't in vain. Either way, for the first time in Nicole's life, she is determined to finish what she started.   Knowing Who To Trust Is Hard When You've Been Betrayed  Though Cole loses the faith of his MC brothers, he can't shake the nagging feelings he has for Nicole. As Cole struggles to put it all behind him, a stranger brings proof that Nicole hasn't been living with her pimp, Gabriel by choice. Now Cole must convince the brothers who have shunned him to help him fight to get her back, but will they be willing to risk their lives to help him or will Cole be facing this battle alone?   There are no rules in love and war  Nicole Bowers has cost Gabriel plenty of money trying to escape his grasp, and Gabriel is going to make her pay in spades. When he downgrades Nicole from high-dollar call girl to resident sex slave, Gabriel makes sure that she learns a lesson or two on her way down from the top. But Cole now has Gabriel set in his sights, and this time, he isn't planning to miss the mark.  EXCERPT  Cole woke the next morning with what he could only describe as an emotional hangover. He had a shot at the bar and a shot when he got home, but wasn't close to intoxication when he went to bed at ten. His night's dreams were deep and what he mostly remembered were feelings of confusion and suffocation -- trapped in a dense, weighted fog and couldn't figure out which was up or where to go. There was a feeling of panic, or rather what should have been panic, but the panic couldn't seem to get past the fog either; it was always there, but never surfacing so he could scream.  He woke drenched in sweat and gripping his pillow hard enough that the seam broke.  Making it to the coffee pot, he put the makings together and started the brew. From his stash, he put out a line of cocaine and sent that into his sinus. Then he grabbed a cold bottle of beer and headed for the shower. Between the steam and hard streams of water, the cold beer, and the cocaine, his chemistry was shocked enough to reset and the emotional hangover was gone as he dried off.",
  "genres": [],
  "author": "Carmen Faye",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/23014380-break-maiden"
}