{
  "title": "Dangerous When Wet: A Memoir of Booze, Sex, and My Mother",
  "description": "\"A blisteringly funny, wrenching account of wrestling way too close to-and later loose from-booze, sex and drugs and his adorable, infuriating mother. Bravo!\" -Mary Karr, New York Times bestselling author of The Liars' Club\"Whoever said you can't get sober for someone else never met my mother, Mama Jean. When I came to in a Manhattan emergency room after an overdose to the news that she was on her way from Texas, I panicked. She was the last person I wanted to see on that dark September morning, but the person I needed the most.\" So begins this astonishing memoir-by turns both darkly comic and deeply poignant-about this native Texan's long struggle with alcohol, his complicated relationship with Mama Jean, and his sexuality. From the age of five all Brickhouse wanted was to be at a party with a drink in one hand and a cigarette in the other and all Mama Jean wanted was to keep him at that age, her Jamie doll forever. A Texan Elizabeth Taylor with the split personality of Auntie Mame and Mama Rose, always camera-ready and flamboyantly outspoken, Mama Jean haunted him his whole life, no matter how far away he went or how deep in booze he swam. Brickhouse's journey takes him from Texas to a high-profile career in book publishing amid New York's glamorous drinking life to his near-fatal descent into alcoholism. After Mama Jean ushers him into rehab and he ultimately begins to dig out of the hole he'd found himself in, he almost misses his chance to prove that he loves her as much as she loves him. Bitingly funny, raw, and insightful, Dangerous When Wet is the unforgettable story of a unique relationship between a son and his mother.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Humor",
    "Autobiography",
    "LGBT",
    "Biography Memoir",
    "Queer"
  ],
  "author": "Jamie Brickhouse",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/23014613-dangerous-when-wet"
}