{
  "title": "Tangled Vines: Greed, Murder, Obsession, and an Arsonist in the Vineyards of California",
  "description": "A New York Times BestsellerOn October 12, 2005, a massive fire broke out in the Wines Central wine warehouse in Vallejo, California. Within hours, the flames had destroyed 4.5 million bottles of California's finest wine worth more than $250 million, making it the largest destruction of wine in history. The fire had been deliberately set by a passionate oenophile named Mark Anderson, a skilled con man and thief with storage space at the warehouse who needed to cover his tracks. With a propane torch and a bucket of gasoline-soaked rags, Anderson annihilated entire California vineyard libraries as well as bottles of some of the most sought-after wines in the world. Among the priceless bottles destroyed were 175 bottles of Port and Angelica from one of the oldest vineyards in California made by Frances Dinkelspiel's great-great grandfather, Isaias Hellman, in 1875. Sadly, Mark Anderson was not the first to harm the industry. The history of the California wine trade, dating back to the 19th Century, is a story of vineyards with dark and bloody pasts, tales of rich men, strangling monopolies, the brutal enslavement of vineyard workers and murder. Five of the wine trade murders were associated with Isaias Hellman's vineyard in Rancho Cucamonga beginning with the killing of John Rains who owned the land at the time. He was shot several times, dragged from a wagon and left off the main road for the coyotes to feed on. In her new book, Frances Dinkelspiel looks beneath the casually elegant veneer of California's wine regions to find the obsession, greed and violence lying in wait. Few people sipping a fine California Cabernet can even guess at the Tangled Vines where its life began.",
  "genres": [
    "Nonfiction",
    "Wine",
    "History",
    "True Crime",
    "Food",
    "Crime",
    "Book Club"
  ],
  "author": "Frances Dinkelspiel",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/23014598-tangled-vines"
}