{
  "title": "The Soul of Place: A Creative Writing Workbook: Ideas and Exercises for Conjuring the Genius Loci",
  "description": "Gold Medal Winner, Nautilus Awards, in the category Creative Process\"Insightful exercises help creative writers of all levels attune themselves to the power of place in order to churn out evocative prose that jumps off the page.\" Intelligent Traveler, NationalGeo.com“Invaluable advice for the writer and traveler, deeply thoughtful.” –Lavinia Spalding, author of Writing Away In this engaging creative writing workbook, novelist and poet Linda Lappin presents a series of insightful exercises to help writers of all genres—literary travel writing, memoir, poetry, fiction, creative nonfiction—discover imagery and inspiration in the places they love. Lappin departs from the classical concept of the Genius Loci, the indwelling spirit residing in every landscape, house, city, or forest—to argue that by entering into contact with the unique energy and identity of a place, writers can access an inexhaustible source of creative power. The Soul of Place provides instruction on how to evoke that power. The writing exercises are drawn from many fields—architecture and landscaping, painting, cuisine, literature and literary criticism, geography and deep maps, Jungian psychology, fairy tales, mythology, theater and performance art, occult philosophy and metaphysics—all of which offer surprising perspectives on our writing and may help us uncover raw materials for fiction, essays, and poetry hidden in our environment.An essential resource book for the writer’s library, this book is ideal for creative writing courses, with stimulating exercises adaptable to all genres. For writers or travelers about to set out on a trip abroad, The Soul of Place is the perfect road-trip companion, attuning our senses to a deeper awareness of place.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Travel"
  ],
  "author": "Linda Lappin",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/23013926-the-soul-of-place"
}