{
  "title": "Hot Alphas",
  "description": "In Erin’s Kiss by Lora Leigh, ex-Marine Turk has become Erin’s sworn protector. The consistent target of her CIA-operative brother’s deadly foes, Turk is the only port Erin has to cling to in a storm. He promised her brother long ago never to touch her—but how can he resist a woman who aches to be with him as much as he burns for her?In misTaken by Laurelin McGee, Jaylene Kim is a strong independent woman whose feminist values run deep. Even though attractive men are her weakness the last thing she wants is one telling her what to do. Until she meets her mysterious new neighbor. He makes her realize that you can still be strong and relinquish control . . . in the bedroom. But as their passion consumes them both Jaylene isn't so sure he is who he says he is.In Burn for Me by Shiloh Walker, Tate longs to spend his nights with Ali, a woman he’s loved for years. But while Ali’s heart pines to be with Tate, her head has reservations. Ali knows that Tate has never forgiven his father for the fight he had with his mother right before she left the house—and was never heard from again. Tate's unresolved anger is a force to be reckoned with . . . but the heat that blazes between them is undeniable. Now both Tate and Ali are left to wonder: Can love really conquer all?In Tangled by Kate Douglas, Nate shows up to work at Tangled Vineyards ready to do all the things he loves best—work with his hands, grow the grapes, and craft award-winning, full-bodied wines. But when something better comes along in the form of Cassie, the winemaker and former owner of the vineyard, Nate becomes completely love-drunk. Getting involved with Tangled’s number-one mixologist is a bad way to start off a new job, but with Cassie as a constant temptation, Nate doesn’t stand a chance…",
  "genres": [
    "Romance",
    "Anthologies",
    "Contemporary Romance",
    "Contemporary",
    "Paranormal",
    "Novella",
    "Military Fiction"
  ],
  "author": "Lora Leigh",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/23014762-hot-alphas"
}