{
  "title": "Beware Beware: A Juniper Song Mystery",
  "description": "Juniper Song—an unforgettable new crime heroine hailed as \"young, sharp, and worldly-wise\" by New York Times bestselling author Meg Gardiner—returns in this smart, fast-paced follow-up to Steph Cha's critically acclaimed debut Follow Her HomeWorking as an apprentice at a P.I. firm, Juniper Song finds herself nose deep in a Hollywood murder scandal where the lies may be more glamorous than most, but the truths they cover are just as ugly. When a young woman named Daphne Freamon calls looking for an eye on her boyfriend, her boss punts the client to Song. Daphne is an independently wealthy painter living in New York, and her boyfriend Jamie Landon is a freelance screenwriter in Los Angeles, ghostwriting a vanity project for aging movie star Joe Tilley. Song quickly learns that there's more to this case than a simple tail, and her suspicions are confirmed when Tilley winds up dead in a hotel room. Nonetheless, when Jamie becomes the prime suspect in the movie star's murder, she agrees to help the charismatic couple discover the truth, even as the police build their case against Jamie. As she chases leads and questions grieving Hollywood insiders, she uncovers a sordid layer of blackmail and hidden identities, of a history of violence that leaves no one—not even Song—safe from judgment.An edgy, gorgeously written read, Beware Beware is perfect for fans of Megan Abbott and Tana French. It's a tale that twists around the lies we tell ourselves and others, that examines the ugliness under the skin-deep glamor of L.A. Praise for Follow Her Home\"[Song] is a compelling and original protagonist… One only hopes that Cha and her driven, neo-noir detective have more opportunities to explore those troubling intersections over many books to come.\" –LA Times\"Engrossing… Steph Cha's intriguing debut Follow Her Home works as a testament to the power of storytelling and a cautionary tale against forsaking reality for fiction…Cha elevates Follow Her Home with glimpses at the culture of Korean-American families.\" –Oline Cogdill, Tulsa World\"Stephanie Cha's brilliant debut is as Noir as Old Nick's sense of humour. Compelling from first to last page, she takes on contemporary L.A., sweeping the reader through Chandler's twilight, heartbroken city from mansions to faux K-town hostess bars. L.A. Noir at its finest.\" -- Denise Mina, author of The Dead Hour",
  "genres": [
    "Mystery",
    "Noir",
    "Crime",
    "Fiction",
    "Mystery Thriller",
    "Adult Fiction",
    "Asian Literature"
  ],
  "author": "Steph Cha",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/23015299-beware-beware"
}