{
  "title": "Owning Regina: Diary of my unexpected passion for another woman",
  "description": "This is an updated cover edition of B00KKYKUYC.Note: The cover was updated, but the book content is the same.Everything you ever believed about your sexuality may be turned on its head upon meeting the right person.When television commercial production coordinator Meg Curtis gets stood up by her longtime boyfriend, she vents her frustration by feverishly writing in a diary. At a time when she is unsure about all things romantic, she encounters 5th grade teacher Regina Baker at yoga class, a free-spirited single mom who is beautiful, playful, and impossibly intriguing. What starts as friendship turns sharply toward something more as they learn they each share a love for very dark and unconventional sensual expression. Despite significant differences in lifestyle, each woman is desperate to get close to the other to explore the depths of devotion.Shocked, yet thrilled by the intense level of Regina’s erotic desire, Meg turns apprehensive. She had never been with a woman— never had to be in society with a woman, never had to wonder what labels may be placed upon her relationship, never considered herself anything but obsessed with men. Regina, also enchanted by a woman for the first time, finds freedom from the pressures of daily life by committing herself to Meg. Compelled by the need for a balance between worlds, the two embark on a daring, passionately physical role-playing game. Welcoming Regina’s darkest needs, Meg explores her own deep-seated desires that have been locked away in the shadows her whole life.Erotic, amusing, and profoundly romantic, Owning Regina is a tale that will awaken you, possess you, and transport you to an alternate universe that steams with passion and danger.This book, featuring elements of BDSM, is intended for mature audiences.The Author:Lorelei Elstrom is an office executive and blossoming writer based out of the San Francisco Bay Area. She never considered a career in writing until coming upon the idea of working in a fictionalized diary format, which provides absolute freedom to truly express one’s most private thoughts in the first person. Discovering this format helped her gain the courage to pick up the pen to write her first novel, Owning Regina.",
  "genres": [
    "Lesbian",
    "BDSM",
    "Erotica",
    "Romance",
    "Lesbian Romance",
    "LGBT",
    "Audiobook"
  ],
  "author": "Lorelei Elstrom",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/23015852-owning-regina"
}