{
  "title": "Mystery Mashup Vol 1: Lowcountry Boil and Board Stiff",
  "description": "Get 2 books in 1We’ve mashed two of our popular mystery books into a single ebook, because if you like one Henery Press mystery, you’ll probably like them all…In this Volume 1, two Southern PIs take over the South Carolina Islands when board members (a beloved grandmother and a New Jersey cowboy) turn up dead. This ebook contains Lowcountry Boil (A Liz Talbot Mystery #1) by Susan M. Boyer and Board Stiff (An Elliott Lisbon Mystery #1) by Kendel LynnLowcountry Boil:PI Liz Talbot is a modern Southern belle: she blesses hearts and takes names. She carries her Sig 9 in her Kate Spade handbag, and her golden retriever, Rhett, rides shotgun in her hybrid Escape. When her grandmother is murdered, Liz high-tails it back to her SC island home to find the killer. When her police-chief brother shuts her out of the investigation, she opens her own. Then her long-dead best friend pops in and things really get complicated. As more folks start turning up dead in this small seaside town, Liz must use more than just her wits and charm to keep her family safe, chase down clues from the hereafter, and catch a psychopath before he catches her.Board Stiff:As director of the Ballantyne Foundation on Sea Pine Island, SC, Elliott Lisbon scratches her detective itch by performing discreet inquiries for Foundation donors. Usually nothing serious until Jane Hatting, Ballantyne board chair, is accused of murder. The Ballantyne’s reputation tanks, Jane’s headed to a jail cell, and Elliott’s sexy ex is the new lieutenant in town. Armed with moxie and her Mini Coop, Elliott uncovers a trail of blackmail schemes, gambling debts, illicit affairs, and investment scams. The closer she gets to the truth, the more treacherous her investigation becomes. With victims piling up faster than shells at a clambake, Elliott realizes she’s next on the killer’s list.",
  "genres": [],
  "author": "Susan M. Boyer",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/23016919-mystery-mashup-vol-1"
}