{
  "title": "كلمات سبارتكوس الأخيرة",
  "description": "كلمات سبارتاكوس الاخيرة - كاملة بصوت أمل دنقل( مزج أوّل ) :المجد للشيطان .. معبود الرياحمن قال \" لا \" في وجه من قالوا \" نعم \"من علّم الإنسان تمزيق العدممن قال \" لا \" .. فلم يمت ,وظلّ روحا أبديّة الألم !( مزج ثان ) :معلّق أنا على مشانق الصباحو جبهتي – بالموت – محنيّةلأنّني لم أحنها .. حيّه !... ...يا اخوتي الذين يعبرون في الميدان مطرقينمنحدرين في نهاية المساءفي شارع الاسكندر الأكبر :لا تخجلوا ..و لترفعوا عيونكم إليّلأنّكم معلقون جانبي .. على مشانق القيصرفلترفعوا عيونكم إليّلربّما .. إذا التقت عيونكم بالموت في عينيّيبتسم الفناء داخلي .. لأنّكم رفعتم رأسكم .. مرّه !\" سيزيف \" لم تعد على أكتافه الصّخرهيحملها الذين يولدون في مخادع الرّقيقو البحر .. كالصحراء .. لا يروى العطشلأنّ من يقول \" لا \" لا يرتوي إلاّ من الدموع !.. فلترفعوا عيونكم للثائر المشنوقفسوف تنتهون مثله .. غداو قبّلوا زوجاتكم .. هنا .. على قارعة الطريقفسوف تنتهون ها هنا .. غدافالانحناء مرّ ..و العنكبوت فوق أعناق الرجال ينسج الردىفقبّلوا زوجاتكم .. إنّي تركت زوجتي بلا وداعو إن رأيتم طفلي الذي تركته على ذراعها بلا ذراعفعلّموه الانحناء !علّموه الانحناء !الله . لم يغفر خطيئة الشيطان حين قال لا !و الودعاء الطيّبون ..هم الذين يرثون الأرض في نهاية المدىلأنّهم .. لا يشنقون !فعلّموه الانحناء ..و ليس ثمّ من مفرلا تحلموا بعالم سعيدفخلف كلّ قيصر يموت : قيصر جديد !وخلف كلّ ثائر يموت : أحزان بلا جدوى ..و دمعة سدى !( مزج ثالث ) :يا قيصر العظيم : قد أخطأت .. إنّي أعترفدعني- على مشنقتي – ألثم يدكها أنذا أقبّل الحبل الذي في عنقي يلتففهو يداك ، و هو مجدك الذي يجبرنا أن نعبدكدعني أكفّر عن خطيئتيأمنحك – بعد ميتتي – جمجمتيتصوغ منها لك كأسا لشرابك القويّ.. فان فعلت ما أريد :إن يسألوك مرّة عن دمي الشهيدو هل ترى منحتني \" الوجود \" كي تسلبني \" الوجود \"فقل لهم : قد مات .. غير حاقد عليّو هذه الكأس – التي كانت عظامها جمجمته –وثيقة الغفران لييا قاتلي : إنّي صفحت عنك ..في اللّحظة التي استرحت بعدها منّي :استرحت منك !لكنّني .. أوصيك إن تشأ شنق الجميعأن ترحم الشّجر !لا تقطع الجذوع كي تنصبها مشانقالا تقطع الجذوعفربّما يأتي الربيع\" و العام عام جوع \"فلن تشم في الفروع .. نكهة الثمر !وربّما يمرّ في بلادنا الصيف الخطرفتقطع الصحراء . باحثا عن الظلالفلا ترى سوى الهجير و الرمال و الهجير و الرمالو الظمأ الناريّ في الضلوع !يا سيّد الشواهد البيضاء في الدجى ..يا قيصر الصقيع !( مزج رابع ) :يا اخوتي الذين يعبرون في الميدان في انحناءمنحدرين في نهاية المساءلا تحلموا بعالم سعيد ..فخلف كلّ قيصر يموت : قيصر جديد .و إن رأيتم في الطريق \" هانيبال \"فأخبروه أنّني انتظرته مديّ على أبواب \" روما \" المجهدةو انتظرت شيوخ روما – تحت قوس النصر – قاهر الأبطالو نسوة الرومان بين الزينة المعربدةظللن ينتظرن مقدّم الجنود ..ذوي الرؤوس الأطلسيّة المجعّدةلكن \" هانيبال \" ما جاءت جنوده المجنّدةفأخبروه أنّني انتظرته ..انتظرته ..لكنّه لم يأت !و أنّني انتظرته ..حتّى انتهيت في حبال الموتو في المدى : \" قرطاجه \" بالنار تحترق\" قرطاجه \" كانت ضمير الشمس : قد تعلّمت معنى الركوعو العنكبوت فوق أعناق الرجالو الكلمات تختنقيا اخوتي : قرطاجة العذراء تحترقفقبّلوا زوجاتكم ،إنّي تركت زوجتي بلا وداعو إن رأيتم طفلى الذي تركته على ذراعها .. بلا ذراعفعلّموه الانحناء ..علّموه الانحناء ..علّموه الانحناء ..",
  "genres": [
    "Poetry",
    "Egypt"
  ],
  "author": "أمل دنقل",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/11380377"
}