{
  "title": "Lo strano caso dell'apprendista libraia",
  "description": "Esme ama ogni angolo di New York e soprattutto il suo posto speciale: The Owl, la piccola libreria nell'Upper West Side. Un luogo magico in cui si narra che Pynchon amasse passare pomeriggi d'inverno. Un luogo che può nascondere insoliti tesori, come una prima edizione del Vecchio e il mare di Hemingway.Tra quei vecchi e polverosi scaffali Esme si sente felice. Ed è lì che il destino ha deciso di sorriderle. Sulla vetrina della libreria è appeso un cartello: cercasi libraia. E' l'occasione che aspettava, il lavoro di cui ha tanto bisogno. Perchè a soli ventitrè anni è incinta e non sa cosa fare:il fidanzato Mitchell l'ha lasciata prima che potesse parlargli del bambino.La più grande passione di Esme è la lettura, ma non ha nessuna idea di come funzioni una libreria. Eppure ad aiutarla ci sono i suoi curiosi colleghi: George che crede ancora che le parole possano cambiare il mondo, Linda che ha un consiglio per tutti, David e il suo sogno di fare l'attore. E poi c'è Luke timido e taciturno che comunica con lei con la sua musica, con le note della sua chitarra.Sono loro ad insegnarle la difficile arte di indovinare i desideri dei lettori: Il Mago di Oz può salvare una giornata storta, Il giovane Holden fa vedere le cose da una nuova prospettiva e tra le opere di Shakespeare si trova sempre una risposta per ogni domanda.E proprio quando Esme riesce di nuovo a guardare al futuro con fiducia, la vita la sorprende ancora: Mitchell scopre del bambino e vuole tornare da lei. Esme si trova davanti a un bivio: non sa più se è quello che vuole davvero.Ma a volte basta la pagina di un libro, una melodia sussurrata, una chiacchierata a cuore aperto con un nuovo amico per capire chi si è veramente. Ed Esme non è più un'apprendista libraia, ora è una libraia per scelta.",
  "genres": [
    "Fiction",
    "Books About Books",
    "Romance",
    "Chick Lit",
    "Contemporary",
    "New York",
    "Adult Fiction"
  ],
  "author": "Deborah Meyler",
  "average_rating": "3.07",
  "url": "https://www.goodreads.com/book/show/23081994-lo-strano-caso-dell-apprendista-libraia"
}