{
  "title": "Belle in the Big Apple: A Novel with Recipes",
  "description": "When Belle Lee, a vivacious, tart-tongued daughter of Mobile, Alabama, decides that the only way she'll ever make a name for herself as a journalist is to leave the family paper and head to New York,she soon realizes just how daunting life in the big city can be. An outsider desperate to carve a place for herself in the cutthroat world of New York journalism, Belle marches all over town in her kitten heels and her single Chloé suit to hand-deliver résumés and smiles, and to beg for a job from the indifferent or downright hostile office drones. She refuses to give up. With heroic persistence,a wicked sense of humor and a taste for the gourmet, Belle sees what it takes to become a New Yorker. She flirts with a gorgeous young man on the subway, only to learn later that he's stolen her purse; braves the judgmental stares of her neighbors; goes on a series of hilariously disastrous dates and then, finally, she catches her big a job as a production assistant at a conservative twenty-four-hour news network. Belle throws herself into her work, sure that her talents will be noticed. All the while, she suffers the sexually suggestive commentary of one of the station's better-known male anchors, doggedly fetches scripts and pulls footage in the wee hours of the morning while working the midnight shift. Belle even maintains her Southern charm, baking cakes for her coworkers and befriending the office security guard. Things start to look up when Paige Beaumont, the channel's star female news anchor, takes Belle under her wing. Paige shows Belle the ropes, dispenses career advice, includes her in the office gossip and also sets her up on dates at restaurants where, before, Belle had only dreamed of one day being inside. But when Belle uncovers the truth behind an illegal network deal that may jeopardize the election of female presidential candidate Jessica Clayton, she realizes that intelligent and ambitious women need to stick together -- and she has no choice but to take matters into her own hands. With thirty recipes for everything from Bribe-Your-Coworkers Pound Cake to Single-Girl Sustenance and how to make the perfect Manhattan -- all told in the delightful and plucky voice of a determined and saucy young woman -- Belle in the Big Apple is about finding love in the most unlikely places, following your dreams and staying true to yourself.",
  "genres": [
    "Fiction",
    "Chick Lit"
  ],
  "author": "Brooke Parkhurst",
  "average_rating": "2.25",
  "url": "https://www.goodreads.com/book/show/2305671.Belle_in_the_Big_Apple"
}