{
  "title": "The Politics of Promotion: How High-Achieving Women Get Ahead and Stay Ahead",
  "description": "Break into the power circle and build relationships that advance careers The Politics of Promotion offers women the tools and guidance they need to successfully navigate the realities of their organization, emphasizing the need to understand office politics to get the promotions and recognition they deserve. Written by Bonnie Marcus, a professional coach who focuses on helping women advance their careers, this book demonstrates the impact of relationships and sponsorship on career trajectory. Readers will learn why excellence and achievement aren't propulsion enough to get ahead, and how networking with power and intention can make all the difference in perception, reputation, and promotion. Far beyond the typical advice of \"be assertive\" and \"embrace ambition,\" this book provides a unique and proven method for becoming a bigger player in the workplace and avoiding unexpected trip-ups that can add years to the climb—or end it for good. Many women focus on performance, thinking that good work garners promotion. Too often, they're left outside of the circles of power and influence where decisions are made that affect their careers. The Politics of Promotion provides a framework for breaking into that circle, and taking control of one's own career path, specifically showing how to: Women who want to advance cannot afford to view politics as \"dirty.\" It's the reality of the workplace, one that differs between organizations and fluctuates over time. Although being savvy about office politics is important for both genders, unconscious bias and stereotypes create special challenges for women. Learning to navigate these complex rules and customs is the key to professional recognition for women, fostering relationships that reach far beyond the next evaluation. Women looking to get ahead will find that the insights in The Politics of Promotion can help smooth the way.",
  "genres": [
    "Nonfiction",
    "Business",
    "Self Help",
    "Leadership",
    "Management",
    "Personal Development"
  ],
  "author": "Bonnie Marcus",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/23059776-the-politics-of-promotion"
}