{
  "title": "General Grant and the Rewriting of History: How the Destruction of General William S. Rosecrans Influenced Our Understanding of the Civil War",
  "description": "In 1885, a former president of the United States published one of the most influential books ever written about the Civil War. An entire generation of Americans had eagerly awaited his memoirs and it has remained so popular that it has never gone out of print. Historiansathen and now have made extensive use of GrantOCOs recollections, which have shaped how we understand and evaluate not only the Union armyOCOs triumphs and failures, but many of the warOCOs key participants. TheaMemoirsaof Ulysses Simpson Grant may be a superbly written book, Frank P. Varney persuasively argues in General Grant and the Rewriting of History, but is so riddled with flaws as to be unreliable.Juxtaposing primary source documents (some of them published here for the first time) against GrantOCOs own pen and other sources, Professor Varney sheds new light on what really happened on some of the Civil WarOCOs most important battlefields. He does so by focusing much of his work on GrantOCOs treatment of Maj. Gen. William S. Rosecrans, a capable army commander whose reputation Grant (and others working with him) conspired to destroy. GrantOCOs memoirs contain not only misstatements but outright inventions to manipulate the historical record. But GrantOCOs injustices go much deeper. He submitted decidedly biased reports, falsified official documents, and even perjured himself before an army court of inquiry. There is also strong evidence that his often-discussed drinking problem affected the outcome of at least one battle.General Grant was an outstanding soldier and, so we have long believed, a good man. HistoryOCOs wholesale acceptance of his version of events has distorted our assessment of Rosecrans and other officers, and even of the Civil War itself. Grant intentionally tried to control how future generations would remember the Civil War, and in large measure he succeeded. The first of two volumes on this subject, General Grant and the Rewriting of History aptly demonstrates, however, that blindly accepting historical truths without vigorous challenge is a perilous path to understanding real history.",
  "genres": [
    "Civil War",
    "American Civil War",
    "Nonfiction",
    "History",
    "Presidents",
    "Biography",
    "American History"
  ],
  "author": "Frank P. Varney",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/23089365-general-grant-and-the-rewriting-of-history"
}