{
  "title": "Coney Island: The People's Playground",
  "description": "At the beginning of the twentieth century, Coney Island was the uncontested epicenter of America’s emerging mass culture. It was the quintessential American the birthplace of the amusement park, the hot dog, and the roller coaster. Its history is one of breathtaking transformation and re-invention. Celebrated for its glittering amusement parks and its enormous crowds, it was in times past a mecca of grand hotels, race tracks, beer gardens, gambling dens, concert saloons, and dance halls. A new mass culture began to take shape there. Its harshest critics decried it as Bedlam by the Sea, but others deemed it as a necessary outlet for the masses where the democratic spirit was granted free rein. Despite its precipitous decline, Coney Island remains a metaphor for the American amusement industry and the hundreds of honky-tonk resorts and amusement parks it has spawned.Coney The People’s Playground is the first new history of Coney Island in almost half a century, tracing its evolution and cultural impact as an amusement center from its earliest development as a seaside resort to the present day Mermaid Parade. Presented in a photo-documentary format featuring more than one hundred vintage photos, archival material, personal accounts, and contemporary sources, the book evokes the atmosphere of the resort as experienced by those who visited it during its heyday. Through the reminiscences of nineteenth and twentieth century writers, literary figures, and amusement historians, Michael Immerso traces Coney Island’s remarkable evolution and subsequent decline, while at the same time examining the remarkable individuals and complex social forces that contributed to its rise and fall.Coney Island is not merely a documentary of the amusement industry or the story of a fabled amusement park, but rather a narrative of the way Americans, and particularly immigrants and urban Americans, came to regard the pursuit of leisure as part of their national birthright.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Michael Immerso",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/231100.Coney_Island"
}