{
  "title": "The House of Twenty Thousand Books",
  "description": "The House of Twenty Thousand Books is the story of Chimen Abramsky, an extraordinary polymath and bibliophile who amassed a vast collection of socialist literature and Jewish history. For more than 50 years, Chimen and his wife, Miriam, hosted epic gatherings in their house of books that brought together many of the age's greatest thinkers. The atheist son of one of the century's most important rabbis, Chimen was born in 1916 near Minsk, spent his early teenage years in Moscow while his father served time in a Siberian labor camp for religious proselytizing, and then immigrated to London, where he discovered the writings of Karl Marx and became involved in left-wing politics. He briefly attended the newly established Hebrew University in Jerusalem, until World War II interrupted his studies. Back in England, he married, and for many years he and Miriam ran a respected Jewish bookshop in London's East End. When the Nazis invaded Russia in June 1941, Chimen joined the Communist Party, becoming a leading figure in the party's National Jewish Committee. He remained a member until 1958, when, shockingly late in the day, he finally acknowledged the atrocities committed by Stalin. In middle age, Chimen reinvented himself once more, this time as a liberal thinker, humanist, professor, and manuscript expert for Sotheby's auction house. Journalist Sasha Abramsky re-creates here a lost world, bringing to life the people, the books, and the ideas that filled his grandparents' house, from gatherings that included Eric Hobsbawm and Isaiah Berlin to books with Marx's handwritten notes, William Morris manuscripts and woodcuts, an early 16th-century Bomberg Bible, and a first edition of Descartes' Meditations . The House of Twenty Thousand Books is a wondrous journey through our times, from the vanished worlds of Eastern European Jewry to the cacophonous politics of modernity.",
  "genres": [
    "Books About Books",
    "Biography",
    "Nonfiction",
    "Memoir",
    "History",
    "Jewish",
    "Biography Memoir"
  ],
  "author": "Sasha Abramsky",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/23106539-the-house-of-twenty-thousand-books"
}