{
  "title": "A Time for Truth: Reigniting the Promise of America",
  "description": "The first book from controversial Senator Ted Cruz whom many consider the front-runner for the GOP presidential nomination in 2016 Liberals love to hate Ted Cruz. The outspoken Texas Senator has a knack for getting under their skin. His quotable remarks - and even more, his principled stands on numerous national issues - have made him a political lightning rod and the most googled man in Washington. Indeed, his name has become a national punchline for liberals - he was even mentioned in a recent episode of True Blood. There is a simple reason Senator Cruz has dominated so much of the national conversation. Since his election to the Senate in 20 2 he has refused to go along with the established way of doing business in Washington. As a result, he has become a voice for millions of Americans frustrated with governmental corruption and gridlock. Telling the truth is a radical act in our nation's capital - a city dominated by empty promises, meaningless 'show votes,' and a self-protection racket designed to get politicians re-elected rather than heeding the demands of the American people. Cruz has told the truth - about Washington collusion, a corrupted political process, and the institutional barriers to actually fixing the enormous challenges we face. The book will tell Cruz's story as a Cuban immigrant's son who made it to the Ivy League, to the Supreme Court bar, and eventually the U.S. Senate. It's a deeply personal journey that begins with Cruz's father experiencing brutality in a Cuban prison and ends with Cruz's discovery that Washington has neither the courage nor the desire to preserve the freedom and opportunities that gave hope to his father, and millions like him. Pulling back the curtain on the backroom deals between Republicans, Democrats, and the lobbyists who keep them in office (instead of keeping them accountable to their constituents), the book will offer an inside look at what has gone wrong in our nation's capital. Cruz will argue that the need for change is urgent, and that the only way to bring about real change is to revitalize the Constitutional principles that made our country great. It's a book that will win Ted Cruz few friends in Washington. Then again, that isn't why he went there in the first place.",
  "genres": [
    "Politics",
    "Biography",
    "Nonfiction",
    "History",
    "Autobiography",
    "Audiobook",
    "Memoir"
  ],
  "author": "Ted Cruz",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/23110076-a-time-for-truth"
}