{
  "title": "Vulnerable",
  "description": "Bridie Calyer I learned early on that hope is a dangerous drug. I grew up in a trailer with my meth-head aunt Caroline and her endless stream of dealers and gentlemen callers. It wasn’t a problem until the men started to notice me, and sure enough Caroline noticed too—she saw the way they wanted to touch me in my private areas, and she became less interested in having me around. The only other thing you really need to know, to understand my miserable years in Waco (the only thing worth mentioning, anyway) is that I know people tended to forget about me. In school, because I was shy and strange and had no “people,” I flew pretty much below the radar. I had no friends. I was in no clubs. And though the boys liked to call out my tits and my ass and my hair, I'd bet you dollars not a one of them could remember my name. But the thing about invisible people? We can be dangerous. Because we see a lot of things we're not supposed to see. Tucker LaRouche Rumor has it this 18-year old sweet piece of ass saw some gruesome shit go down in her aunt’s trailer, and now the Waco Police Department is calling in a favor from our club the Baron’s of Sodom MC—witness protection—but they brought her to the wrong place, that’s for sure. Moral fucking caliber is a ridiculous notion; we’re bikers after all, not nannies. The man upstairs had practically issued a mandate: fuck her. Fuck that sweet little Baby. Make her moan. Me, I do what I’m told, don't I? She looks frightened. And, against all my instincts I'd ever known, I want nothing more than to scoop Baby into my arms and carry her to some cozy place. I want to peel off her rain-dampened clothes and kiss all her crevices—I want to nudge her quivering legs wide to let me move in. Then I want to take her, long and hard and deep. I want to hear this woman's screams of ecstasy echo across the dull plains…I'd like to see that frightened face collapse into joy and peace. She’s only technically been a woman for 24-hours. And I’m her first test. This is a STANDALONE contemporary romance novel. No Cliff Hanger. Content suitable for adults only, contains violence, and graphic sexual content.",
  "genres": [],
  "author": "Abriella Blake",
  "average_rating": "2.85",
  "url": "https://www.goodreads.com/book/show/23110505-vulnerable"
}