{
  "title": "New Frontier of Love",
  "description": "2014 Amazon Breakthrough Novel Award Romance Quarter-Finalist and a 2015 Readers' Favorite Gold Medal Winner!Captain Sam Wyllie lost too much in the Revolutionary War, and he's determined to safeguard his heart. When he meets widowed Catherine Adams, Sam commits himself to protecting her from the dangers of frontier life, but can he protect himself from the dangers of love?This heart-wrenching historical romance blends high action, heroism, and humor with a love and passion as powerful and beautiful as the wilderness. Unblinkingly gritty, Dorothy Wiley's NEW FRONTIER OF LOVE is a memorable, pulse-pounding western adventure set in 1797 on America's romantic frontier.The Revolutionary War left Captain Sam Wyllie battle-hardened. His courageous but cold heart defies danger--and love. Along with his four brothers, he is determined to make a fresh start in the far west, the new state of Kentucky. Newly widowed, Catherine Adams knows she should return to her wealthy father in Boston but fears he will once again force her to marry for prestige and wealth, not love. Drawn to Sam's keen intelligence, harsh masculinity, and rugged warrior facade, she decides the west holds a chance for real love.But dark forces--a ruthless enemy and a secret sorrow from Sam's past--conspire against them. Harboring her own secrets, Catherine resolves to help this brave buckskin-clad warrior lay down his heart's armor. Despite the undeniable attraction between them, Sam refuses to risk his heart again. Catherine won't give up, believing he could be as passionate about love as he is about his country and family.NEW FRONTIER OF LOVE, set in what was then America's West, is the heart-pounding second novel in the American Wilderness Series Romances, however each book may be read independently. Like Dorothy Wiley's other award-winning and compelling novels, this exciting tale is emotionally powerful. If you love romantic thrillers, don't miss this action-packed read!A Readers' Favorite Gold Medal winner in 2015, Wiley has earned nearly 300 five-star Amazon ratings. Her epic love stories of the frontier captivate readers of romance, westerns, and historical fiction. Charmed by the beauty of her poignant love stories, romance lovers cheer for her endearing heroes and heroines. Spell-bound by horrific events and heinous villains, readers of westerns fear for her valiant characters--settlers of the untamed West. But all readers appreciate Wiley's ability to take them on a thrilling journey to a new world for the brave. With her singular voice, passionate narrative, and thrilling plots, Wiley has written an enthralling, highly romantic, and timeless western series.Available from:http://www.amazon.com/dp/1497438640/?...",
  "genres": [
    "Romance",
    "Westerns",
    "Historical",
    "Historical Romance",
    "Historical Fiction",
    "Western Romance",
    "Amazon"
  ],
  "author": "Dorothy Wiley",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/23113911-new-frontier-of-love"
}