{
  "title": "Blacklisted by History: The Untold Story of Senator Joe McCarthy and His Fight Against America's Enemies",
  "description": "Accused of creating a bogus Red Scare and smearing countless innocent victims in a five-year reign of terror, Senator Joseph McCarthy is universally remembered as a demagogue, a bully, and a liar. History has judged him such a loathsome figure that even today, a half century after his death, his name remains synonymous with witch hunts. But that conventional image is all wrong, as veteran journalist and author M. Stanton Evans reveals in this groundbreaking book. The long-awaited \"Blacklisted by History,\" based on six years of intensive research, dismantles the myths surrounding Joe McCarthy and his campaign to unmask Communists, Soviet agents, and flagrant loyalty risks working within the U.S. government. Evans's revelations completely overturn our understanding of McCarthy, McCarthyism, and the Cold War. Drawing on primary sources--including never-before-published government records and FBI files, as well as recent research gleaned from Soviet archives and intercepted transmissions between Moscow spymasters and their agents in the United States--Evans presents irrefutable evidence of a relentless Communist drive to penetrate our government, influence its policies, and steal its secrets. Most shocking of all, he shows that U.S. officials supposedly guarding against this danger not only let it happen but actively covered up the penetration. All of this was precisely as Joe McCarthy contended. \"Blacklisted by History\" shows, for instance, that the FBI knew as early as 1942 that J. Robert Oppenheimer, the director of the atomic bomb project, had been identified by Communist leaders as a party member; that high-level U.S. officials were warned that Alger Hiss was a Soviet spy almost a decade before the Hiss case became a public scandal; that a cabal of White House, Justice Department, and State Department officials lied about and covered up the Amerasia spy case; and that the State Department had been heavily penetrated by Communists and Soviet agents before McCarthy came on the scene. Evans also shows that practically everything we've been told about McCarthy is false, including conventional treatment of the famous 1950 speech at Wheeling, West Virginia, that launched the McCarthy era (\"I have here in my hand . . .\"), the Senate hearings that casually dismissed his charges, the matter of leading McCarthy suspect Owen Lattimore, the Annie Lee Moss case, the Army-McCarthy hearings, and much more. In the end, Senator McCarthy was censured by his colleagues and condemned by the press and historians. But as Evans writes, \"The real Joe McCarthy has vanished into the mists of fable and recycled error, so that it takes the equivalent of a dragnet search to find him.\" \"Blacklisted by History\" provides the first accurate account of what McCarthy did and, more broadly, what happened to America during the Cold War. It is a revealing expose of the forces that distorted our national policy in that conflict and our understanding of its history since.",
  "genres": [
    "History",
    "Politics",
    "Biography",
    "Nonfiction",
    "American History",
    "American",
    "Historical"
  ],
  "author": "M. Stanton Evans",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/231155.Blacklisted_by_History"
}