{
  "title": "Leah's Seduction: 1",
  "description": "Gianni Rinaldi is one of the most eligible bachelors in the fashion scene in New York. By accident, a journal filled with a woman’s most intimate fantasies falls into his hands. He is driven to find the author of the sensual writings when he meets Leah, and suspects it might be her. The quest to discover if she is that woman unexpectedly turns into a sexual relationship that quickly spins out of control. Will the woman he wants submit to his terms?Leah Ivers has landed a job as a marketing coordinator in one of the fashion showrooms of New York. Her passion bubbles to the surface when she meets Gianni at an industry event. Knowing she is not his type, Leah is surprised by his interest in her. Intimate encounters make it clear that he can satisfy her as no man has before. How much is she willing to give up in order to have him?Excerpt:“There was a connection between them. When he gazed at her, Leah transformed into a stunning beauty before his eyes. It was as though his look was the sunshine she required to thrive. Gianni had to get a grip. He couldn’t let all of this go to his head.He needed to keep things in perspective, which was difficult. Because the way she had looked at him had affected him. Too much. And not in a way he’d anticipated, allowing just that little bit of control to slip through his fingers.It was better to rein things in early. Before the situation slipped from his grasp. He wanted Leah again. And what he hoped to do with her hadn’t changed. As long as she didn’t start to expect more, it could work. But even as he thought it, Gianni was riddled with doubt.No woman had affected him this way before. He should just walk away. He didn’t need this, and he had plenty of women to call on. Any urge he had, or could dream up, could be satisfied. So why deal with such complexities?”",
  "genres": [
    "Romance",
    "Contemporary",
    "Short Stories",
    "Erotica",
    "Contemporary Romance"
  ],
  "author": "Emily Jane Trent",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/23119219-leah-s-seduction"
}