{
  "title": "Hunter Moon",
  "description": "Being a teenage girl is difficult. Being a teenage Werewolf is almost impossible. A few weeks ago I found out that I’m a Werewolf. Yup, that’s right. I tend to get furry around the full moon. Don’t believe me? Well, it only gets more fantastic from here.You see, I’m bound by an ancient pact my ancestors made to serve with the Hounds of God. They’re like this mega Wolf pack who technically work for the Catholic Church. The Hounds have been fighting an age old battle against covens of Witches who want to claim dominion over the Earth for the Devil.You heard me correctly. I mean the actual Devil, you know, Lucifer, the Father of Lies. Yup. That’s the one. You see, the Devil, is an actual being. Not some metaphor for evil. He is a fallen angel and his minions take many forms. The Hounds of God fight those minions. We are an ancient order dedicated to protecting humanity.My father before me was a Hound. He and my mother died fighting this battle when I was about three years old. I keep a picture of them next to my bed.I don’t remember that much about them, except for this recurring dream I have of my mom. Anyway, I was raised by my maternal grandmother, Nonna Rosa. Her son is my Uncle Vito. He and his family live with us too. Only Nonna knows the truth about me.Hard to believe? You betcha. I didn’t really buy it either until last night when I got all furry and fangy and ripped the throat out of my high school librarian.Scary, right? But they aren’t the only things out there. There’s much more that I have yet to learn.This world is new to me. It is full of dark and dangerous things. And most of them seem to want me dead. I’m scared, I mean, I’m not crazy. But I have to survive. I just have to. To find out what really happened to my parents. And to avenge them.",
  "genres": [
    "Fantasy",
    "Romance",
    "Paranormal",
    "Shapeshifters",
    "Contemporary",
    "Magic",
    "Young Adult"
  ],
  "author": "C.D. Gorri",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/23125582-hunter-moon"
}