{
  "title": "Fearless passion: find the courage to do what you love",
  "description": "Wouldn’t it be wonderful to do what you love every single day?Many of us graduate from college and plunge ourselves into the working world, only to realize that our job is not a good fit for us. We feel stuck, not knowing whether to change our career or not. Thoughts and fears run through our mind: “I have already invested so much in my previous education. I can’t possibly give it up now.”  “What if I pick a wrong career path again? Wouldn’t I waste more money and time?”  “What if I don’t have the talent to pursue what I love?” Do you feel trapped in your current job and don’t know what to do about it?Fearless Passion aims to release you from the fears that are holding you back and inspire you to take action on your passion. The biggest mistake is not choosing the wrong career — it’s sticking with a career that makes you unhappy.Based on the author's own personal story and many others, Fearless Passion shows you how you can expose your hidden fears and harness them, identify your current passions and discover new ones, use your passions to build the skills you wanted, find time to pursue multiple passions and make a smooth career transition.Fearless Passion isn't just a book on career change. It's a book to inspire everyone to love themselves more by doing what they love.Fearless Passion includes successful stories from: Yong Kang Chan (the author) - An accountant who left his job to pursue his passion for animation.  Simon Gudgeon - A world-renowned sculptor who only discovered his passion for sculpting when he was forty years old.  Larry Jacobson - An entrepreneur who gave his successful travel business to sail around the world and later became an award-winning bestseller author.  Peter Yang - A senior manager who left his job to set up a social enterprise that helps nonprofit and social organizations.  Dan Conway - A jobless youth-worker who created a viral marketing campaign that got him the advertising job he always wanted.  TaJuan \"TeeJ\" Mercer - An award-winning Hollywood TV editor who later became an International Bestselling Author and a reality TV coach.  Leanne Spencer - An account director who left her job to be a personal trainer and fitness entrepreneur.  Anne Rupert - A manager in the real estate industry who left her job for a six month career break to reconnect her passion for the Arts.  Dr Siew Tuck Wah - An aesthetic doctor who used to be afraid of dogs but now heads a nonprofit group to save stray dogs.",
  "genres": [
    "Self Help",
    "Nonfiction"
  ],
  "author": "Yong Kang Chan",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/23122885-fearless-passion"
}