{
  "title": "Claire, After All",
  "description": "Claire Penwarren is a force to be reckoned with. Commissioned by her widowed father, she descends on the green Sussex hills with three assignments. Ready Loden Hall for her father's arrival as the new earl. Find the perfect husband for her gorgeous half-sister. Acquire a tutor for her rapscallion twin brothers. At twenty-eight Claire--now Lady Claire--has had years of experience running an orderly household in India and cannot imagine England will be any different. Older. Wiser. That's Claire.But England refuses to cooperate with Claire's well laid plans. How did beautiful Loden Hall become such a ruin and how will she make it right in time? Why is her usually cooperative sister so resistant to Claire's recommendation for a husband? Why are her brothers so unhappy that stowing away on a merchant ship holds more appeal than her loving care at home? Really, if it weren't for the unexpectedly practical advice of her neighbor the Marquis of Symonton, she would feel quite alone.For Claire, focused on the tangled knots of her own family, Symonton is the perfect ally. Who better to offer guidance than a man savvy enough to maneuver his way through society for six and thirty years without being trapped into matrimony? And how fortunate that the man is entertained by her family's exploits! But even with Symonton, Claire manages to get it wrong. It's not her family he's interested in and amusement is not what he feels. The man has other plans entirely. Maturity and experience are all well and good, but Claire will learn that neither is as valuable as love.Book I of The Penwarrens, a series of 3 light-hearted Victorian romances.Claire, After All   ~   Listening to Abby   ~   Jubilee Rose",
  "genres": [
    "Historical",
    "Historical Romance",
    "Romance",
    "Regency",
    "Victorian",
    "Fiction",
    "British Literature"
  ],
  "author": "Karen J. Hasley",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/23124625-claire-after-all"
}