{
  "title": "Gray Ghost",
  "description": "While on a fly fishing vacation to Andros Island in the Bahamas, narcotics detectives Dix and Petersen discover their fishing guides were killed when a sudden blast of gunfire fractured their speedboat, Gray Ghost. Local gossip has it that Gray Ghost went to the ocean floor with a hundred million dollars’ worth of cocaine in the hull. Dix and Petersen, against their better judgment, are drawn into helping their island friends even though it could cost them their careers. Leads are chased down in the Bahamas and Miami. The two detectives identify a diabolical plot of a sinister man known only as “The Caller.” An elaborate trap is set for The Caller, but he's two steps ahead of the detectives. As the drama unfolds, it's unclear who can be trusted. When it appears The Caller will get away once again, lead detective Dix and his sidekick Petersen exhaust everything they have in an effort to capture the criminal mastermind. From the Author:Gray Ghost was developed from headline news and blended with real life cases I've investigated over my career in law enforcement as a narcotics and homicide detective. Although this is fiction, there is much truth to the story. I researched the area the story takes place in and visited the location. I interviewed law enforcement members from the various agencies to ensure my work is valid.  C. L. Swinney is a narcotics investigator currently residing in the San Francisco Bay Area. I have investigated hundreds of narcotics, homicide, gang, and Mexico cartel cases along the west coast of the United States, Mexico, Canada, London, and China. I have been invited to speak at law enforcement conferences throughout the United States, and I'm recognized as an expert in narcotics, wiretaps, and cell phone forensics. I recently became a contributor to Policeone.com, the nation's premier law enforcement website.",
  "genres": [
    "Mystery",
    "Thriller",
    "Amazon",
    "Crime"
  ],
  "author": "C.L. Swinney",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/23126497-gray-ghost"
}