{
  "title": "A Hidden Element",
  "description": "Evil lurks within…When Caleb Madroc is used against his will as part of his father’s plan to breed a secret alien community and infiltrate society with their unique powers, he vows to save his oppressed people and the two children kept from him.Seven years later, Laura and Ben Fieldstone’s son is abducted, and they are forced to trust a madman’s son who puts his life on the line to save them all. The enemy’s desire to own them—or destroy them—leads to a survival showdown.Laura and Ben must risk everything to defeat a new nemesis that wants to rule the world with their son, and Caleb may be their only hope—if he survives. But must he sacrifice what he most desires to do so? Editorial Reviews:\"Chilling and dark, Donna Galanti’s A Hidden Element is a twisty journey into another world, where fathers and sons fight the ultimate battle, and ghostly strangers manipulate those left behind on Earth. Don’t miss it.\" —J.T. Ellison, New York Times bestselling author of When Shadows Fall\"A Hidden Element is a fascinating look at the bleak and graphic world of the Elyon Destroyers, a humanoid race with special powers and a strong drive to endure and procreate at all costs, and other Elyons who struggle to stop them and save humanity. It is also a haunting story about just how far parents will go to protect, or destroy, their children in the name of love.\" —Rebecca Cantrell, New York Times bestselling author of The World Beneath\"Donna Galanti's A Hidden Element expertly mixes genres, combining sci-fi with mystery, thriller and romance. The result is a pulse-pounding read that will keep you up long past your bedtime, turning pages as fast as you can. If you love suspense, do yourself a favor and make Donna Galanti’s Element series your next read.\" —Allan Leverone, New York Times and USA Today bestselling author of Final Vector\"A darkly fresh take on the paranormal genre.\" —Scott Nicholson, international bestselling author of The Red Church\"An intoxicating blend of sci-fi and suspense! Donna Galanti brings together all my favorite elements—psi-powers, aliens hiding among us, sex as a weapon and secret rebellions that could change worlds. A Hidden Element is an edge-of-your-seat read that had me holding my breath and crossing my fingers…at least until I had to turn the next page!\" —John Everson, Bram Stoker award-winning author of Siren\"A compelling page turner! A Hidden Element is an evocative mirror on humanity as seen through the eyes, hearts, and desires of a dying alien race. Bone-chilling suspense with a tantalizing palpable menace readers will devour.\" —Jordan Dane, bestselling author of the Sweet Justice series\"Donna Galanti’s A Hidden Element masterfully depicts the most powerful battle of all: great love against great evil, with an unearthly twist. The book wraps its confident storytelling around you on page one and rivets your attention to the heart-racing ending. A triumph of craft and characterization, A Hidden Element drips suspense from every compelling word. A gripping, emotionally involving, and unsettling read—highly recommended!\" —Dakota Banks, award-winning author of the Mortal Path series\"Donna Galanti's new novel, A Hidden Element, is a wonder of a book. I loved it through and through. Galanti has a gift, especially for dialogue that sweeps the reader away into the land of Story. I'd call this one of the most magical books I've read in ages. It's human, it's got heart, and it's told by a true storyteller who cares about her characters so that we care too. I couldn't put it down—and that's the best we can ever say about a work of fiction. Galanti has a winner here.\" —Billie Sue Mosiman, author of Banished",
  "genres": [
    "Suspense",
    "Paranormal"
  ],
  "author": "Donna Galanti",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/23127004-a-hidden-element"
}