{
  "title": "The Book of Ruth",
  "description": "Since her youth, Ruth Desponsyni, the diamond eminent and only daughter of a materialistic English Canadian supermodel and a brilliant yet controversial billionaire amorist of French Algerian descent, leads an extraordinarily privileged and sexual life---from the Ivy halls of Dartmouth getting poked by jocks and professors to an unforgettable menage a trios with the lusty young and the wanton on the posh Lake Winnipesaukee in moneyed New Hampshire.In Toronto, mother Val Desponsyni secrets away with a young well-hung drone for an affair not too soon to become known, while in Montreal dad Usak Desponsyni find similar, even more forbidden desires inside the chateau described as home.Yet all is not pleasure in paradise.A fullblown scandal threatens the House that is Desponsyni. From money to Islamic, dangers are many and hardly cease coming, as Ruth Desposyni, a worshipper at the temple of male body organs. _As profound as it is pornographic, THE BOOK OF RUTH is in part a numination on the nature of desire and pleasure and the experience of living a life that is sensually fantastic and specifically arranged to let desire and pleasure have their way with you. An actual thrilling novel of staggering sexual promiscuity with references to comtemporary art, metaphysical musings on nature of perception and aesthetic theory, RUTH is also a story about taboo and forbiddence, about a fortunate and famous family's complicity, whether knowingly or unknowingly, in creating not just a lust-hunter but the most primal of love triangles: one that ensnares a mother and father. _In THE BOOK OF RUTH, Ej Bernard creates a luscious, most powerful and candid erotic tale, a deeply intelligent depiction of sheer entertainment, solitary stimulation and unfettered sexuality. The most fascinating eroticist since Anais Nin and Susan Bright.",
  "genres": [],
  "author": "E.J. Benard",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/23122780-the-book-of-ruth"
}