{
  "title": "The Circle of Ceridwen",
  "description": "It is the year 871. Of seven Anglo-Saxon kingdoms, five have fallen to the invading Vikings. No trait is more valued than loyalty, and no possession more precious than one's steel. Across this war-torn landscape travels fifteen year old Ceridwen, now thrust into the lives of the conquerors.Epic...immensely satisfying...an impressive achievement - Historical Novel Society The English Adventure loved by over 100,000 readers in 125 countries...Lost in the frozen woods, Ceridwen is discovered by the warriors accompanying young Ælfwyn, daughter of a Saxon lord, sold against her will in marriage as part of a peace treaty with a marauding Viking war chief. Their destination is the captured fortress of Four Stones, a ruin holding glittering treasure. There Ælfwyn must keep her vow and wed Yrling - and Ceridwen must do all she can to support her new friend in the rebuilding of the ravaged village and great hall.But living with the enemy affords Ceridwen unusual freedoms - and unlooked-for conflicts. Amongst them she explores again her own heathen past, and learns to judge each man on his own merits. Yrling's nephews Sidroc and Toki, both formidable warriors yet as different as night and day, compete to win Ceridwen for their own.Through both guile and goodness Ceridwen and Ælfwyn begin transforming the world of Four Stones. But the threat of full-scale war escalates, and a midnight party of furtive Danes delivers someone to Four Stones who destroys the girls' hopes of peace and contentment. Now Ceridwen must summon all her courage - a courage which will be sorely tested as she defies both Saxon and Dane and undertakes an extraordinary adventure to save a man she has never met..",
  "genres": [
    "Historical Fiction",
    "Fantasy",
    "Historical",
    "Fiction",
    "Romance",
    "Medieval",
    "Historical Romance"
  ],
  "author": "Octavia Randolph",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/23123223-the-circle-of-ceridwen"
}