{
  "title": "Dreamworld: Book 1",
  "description": "High school is tough. Hormones running wild, teachers out to get you, and girls-well, they're impossible to understand and even harder to pull your eyes away from. For Trayvian James, it's worse than normal. His parents are non-existent, he doesn't have a single person he can call a friend, and the only girl who will talk to him is pretty enough, but naked-neighbor crazy. Luckily for Tray, his real life isn't the only one he lives. Tray isn't normal. Not by a long stretch. Every night when he falls asleep, Tray is transported into Havehn-a world created in his own mind-to a life filled with magic and adventure. In Havehn, Tray attends The Academy, the premier school in the entire realm, and is about to take the Test to become a Warrior Mage (the most beast of all the three Orders of Magic). No one has ever taken the Test at Trayvian's age, but there's no time to waste because there are signs that an ancient prophecy is about to come true. For over a thousand years, The Darkness has been imprisoned. Now prophecies say the Dreamer must find a way to stop The Darkness from escaping or face the unfathomable evil in the Last Great War. While Tray gets more than his fill of excitement and adventure in his dreams, his boring real existence is altered when an amazing girl moves to his school. Tray falls hopelessly in love the first day Claire sways into history class, and she makes him question which life he holds most dear-falling for Claire could mean losing his dream world forever. Tray, along with his best friends Damon and Trill, must fight the unspeakable power of The Darkness in his dreams. When evil slithers its way into Tray's real life, threatening the only person he's ever loved, Tray finds nothing is as it seems. He must unlock the secrets of his own past to save the girl he loves.",
  "genres": [],
  "author": "Brian Wood",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/11384816-dreamworld"
}