{
  "title": "Ultrasonic",
  "description": "Ultrasonic is a \"brilliant and disarming\" collection of linked essays that explore how sound can be used to search for deeper meaning beneath the surface of everyday life. Beginning with his 2011 Best American Essay, \"Auscultation,\" a piece that is now taught in high schools across the country, Steven Church takes the reader on an associative journey into questions of identity, family, fear, loss, and the politics of space. With a trademark relentless curiosity reminiscent of David Shields, Matthew Gavin Frank or Ander Monson, and the stylistic gymnastics of Lia Purpura, Bernard Cooper or Maggie Nelson, the book explores the emotionally resonant experiences of witnessing a drowning, losing a sibling in a car accident, and raising a young daughter. But Ultrasonic is also a book about the mysteries and wonder of language, a book that considers the various meanings of words like, \"dither,\" \"sounding,\" or \"loitering;\" Even the seemingly mundane word pairing, \"crown and shoulder\" become, for Church, touchstones for an idiosyncratic meditation on the death of his brother in car accident and the way such losses return in our present lives. At every turn, Ultrasonic dares us to think more deeply about each other and about the world around us. How many times do we see a, \"No Loitering,\" sign and think nothing of it? Church thinks everything about it, using the sign as a way to consider the politics of public liminal spaces and the ways we attempt to criminalize or marginalize those who inhabit such spaces. More than one reader has compared Church's exploration of the everyday and his confronting of himself on the page to the work of Montaigne; and it's true that a stethoscope may never look the same to you again after reading Ultrasonic, but Church is also a mischievous and humorous writer who isn't afraid to imagine what Elvis Presley's last racquetball game might have been like or how he might respond to the ever-present police helicopters in his neighborhood. Like Eula Biss's Notes from No Man's Land or Leslie Jamison's Empathy Exams, Ultrasonic moves in layers and circles of association or juxtaposition, where the meaning accretes as the reader progresses and doubles back over ideas and images. With \"equal parts tenderness and rage,\" each chapter operates both as an independent essay and as an echo chamber for the larger ideas, gazing at our human predicament through such eccentric and varied lenses as trapped miners, stethoscopes, racquetball, language, loitering, violence, Elvis, and the music of torture. The result is, among other things, \"one of the oddest and loveliest mediations on parenthood,\" you'll ever read.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Steven Church",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/23129431-ultrasonic"
}