{
  "title": "Enormous Smallness",
  "description": "Enormous Smallness is a nonfiction picture book about the poet E.E. cummings. Here E.E.'s life is presented in a way that will make children curious about him and will lead them to play with words and ask plenty of questions as well. Lively and informative, the book also presents some of Cummings's most wonderful poems, integrating them seamlessly into the story to give the reader the music of his voice and a spirited, sensitive introduction to his poetry.In keeping with the epigraph of the book -- \"It takes courage to grow up and become who you really are,\" Matthew Burgess's narrative emphasizes the bravery it takes to follow one's own vision and the encouragement E.E. received to do just that.Matthew Burgess teaches creative writing and composition at Brooklyn College. He is also a writer-in-residence with Teachers & Writers Collaborative, leading poetry workshops in early elementary classrooms since 2001. He was awarded a MacArthur Scholarship while working on his MFA, and he received a grant from The Fund for Poetry. Matthew's poems and essays have appeared in various journals, and his debut collection, Slippers for Elsewhere, was published by UpSet Press. His doctoral dissertation explores childhood spaces in twentieth century autobiography, and he completed his PhD at the CUNY Graduate Center in June 2014.Kris Di Giacomo is an American who has lived in France since childhood. She has illustrated over twenty-five books for French publishers, which have been translated into many languages. This is her sixth book to be published by Enchanted Lion Books. The others are My Dad Is Big And Strong, But . . . , Brief Thief, Me First!, The Day I Lost My Superpowers, and",
  "genres": [
    "Poetry",
    "Biography",
    "Picture Books",
    "Nonfiction",
    "Childrens",
    "History",
    "Biography Memoir"
  ],
  "author": "Matthew  Burgess",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/23129884-enormous-smallness"
}