{
  "title": "Up and In",
  "description": "A laugh-out-loud debut that will delight fans of Liane Moriarty and Fiona Higgins, this is The Devil Wears Prada at the school gates.Distinctly middle-class parents, Maria and Joe have committed every bit of available income to giving their daughters Kate and Sarah the best education possible, which to them means attending the most exclusive girls school in the state. But when Kate befriends the spoilt and moody Mirabella, Maria must learn to play nicely with Mirabella's mother, Bea - the beguiling yet beastly queen of the toffee-nosed school mothers at Riverton.A series of social blunders and intentional snubs make Maria determined to ensure Kate's rightful position both at school and on the Saturday morning netball team, but as Maria works hard to negotiate the social hierarchy, her previously contented life with Joe falls far from view.With her mastery of dialogue and character, Australian author Deborah Disney skillfully balances keen and witty observations about daily life with the more serious issues of schoolyard bullying and social isolation.You will laugh, you will nod along, and you will want to take the increasingly neurotic Maria aside and point out that in all her desperate, gaffe-filled attempts to fit in with the well-heeled, champagne-swilling mummies of Riverton, she might just be risking all that she holds dear.'My stand-out fiction read for 2015' Rebecca Sparrow, author, Mammamia columnist and host of So What Are You Reading?'This story showcases a world where motherhood is a competitive sport ... highly recommended' Chicklit Club (High Raters)'While the book is satirical and clearly a mummy-mafia-on-speed version of events, it has so many nuggets of truth that Up and In is destined to become the next must-read for any mum navigating schoolyard politics' Kidspot Parenting Magazine'I am so excited that this is Deborah Disney's debut novel. It's accomplished, compelling and one of those novels that will tug at the heartstrings one minute and have you giggling the next. Warm, extremely well-written and a complete delight to read. If you're looking for a light, funny, yet insightful novel then congratulations - you've found it!' Bookaholic Holly",
  "genres": [
    "Chick Lit",
    "Fiction",
    "Womens Fiction"
  ],
  "author": "Deborah Disney",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/23129363-up-and-in"
}