{
  "title": "The Nightmare Returns",
  "description": "In this true tale of demonic revenge, a Connecticut family, their friends, and their pets face the most vicious and wicked repercussions imaginable for standing up to the demonic spirits who have invaded their world.  In the late evening hours, after a demonic spirit invades her home and penetrates her mind, psychic medium Yvonne Saxon receives a series of horrific visions.  These visions reveal the diabolical spirits' plans to exact their revenge on everyone who was in any way involved in the McLaughlin case just two months earlier.  After several unsuccessful attempts to get through to and warn the family and her colleagues, Yvonne makes a last-ditch, desperate call to the Archdiocese in Boston — specifically, to Bishop Marcus Phelan, who had previously been so instrumental in that case.  Bishop Phelan realizes the grave danger they face when he meets misfortune while setting out on the long drive to Connecticut. Will he reach the beleaguered family in time? Can he save his friends from the savage attacks Yvonne has revealed to him in her desperate plea for help?  Dark Siege: The Nightmare Returns is the continuation of McLeod's most terrifying case of diabolical Infestation, Oppression, and Possession. His work was first published in his best-selling debut novel, Dark Siege: A Connecticut Family's Nightmare. Like its predecessor, it is a must-read for any paranormal enthusiast, investigator, or researcher - and most of all, for anyone who had endured, or who is currently experiencing paranormal activity for themselves.  This book, like its predecessor, is a paranormal powerhouse. What makes it truly unique is McLeod's chapter-by-chapter analysis where he explains spirit activity through Quantum Physics, The Universal Laws of Attraction, Vibration, Intention, and Conscious Manifestation.",
  "genres": [],
  "author": "Jason McLeod",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/23130964-the-nightmare-returns"
}