{
  "title": "Every Creeping Thing: True Tales of Faintly Repulsive Wildlife",
  "description": "\"Despite the efforts of many earnest and life-affirming people to persuade me that the vampire bat is our friend and that Native Americans enjoyed true harmony with Brother Wolf, I have never quite overcome the gut feeling that fear of nature is normal....It can also be pleasurable....What I really find creepy and wonderful about nature are not its great terrors, but its weird, unsuspected minutiae...for instance, that some sharks practice sibling cannibalism in the womb, or that a mole will paralyze earthworms, ball them up in a knot, and seal them away in individual cells in the walls of its chambered mound, still living, to be eaten at leisure. I am captivated by the sight of a keyhole limpet...[which] carries a sort of vicious pet under its shell, like an old lady's lap dog.\"--From Every Creeping ThingIn this sequel to Spineless Wonders, Richard Conniff once again explores the tangled connections between human beings and animals (this time mostly vertebrates). His adventures take us from an island in the Gulf Stream, where a man devotes his life to the devilbird, to provincial England, where bloodhounds and riders on horseback hunt down a human being for sport.With his characteristically offbeat approach, Conniff focuses on some of the least huggable members of the animal world-- porcupines, snapping turtles, cormorants, bats, mice, moles. Through their lives, Conniff introduces us to some of the strangest behaviors on earth. We meet sharks that practice sibling cannibalism in their mother's womb, bats that delight in a sybaritic \"disco mating strategy,\" and five-hundred-pound grizzly bears that gorge themselves on moths in August. Every Creeping Thing is a fascinating, comic tour through the far side of the animal kingdom.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Science",
    "Nature",
    "Biology",
    "Natural History",
    "Anthropology"
  ],
  "author": "Richard Conniff",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/1015135.Every_Creeping_Thing"
}