{
  "title": "The Temple of Doubt",
  "description": "“Fiercely original with a capable and plucky heroine, The Temple of Doubt rips open a door to a fresh new fantasy world.” —Amalie Howard, author of the Aquarathi series and Alpha GoddessIt’s been two six-days since a falling star crashed into the marshes beyond Port Sapphire, putting the wilds of Kuldor off-limits to fifteen-year-old Hadara. She feels this loss deeply and is eager to join her mother beyond the city limits to gather illegal herbs and throw off the yoke of her tedious religious schooling. Medicines of any sort are heresy to the people of Port Sapphire, who must rely on magic provided by the god Nihil for aid. And if people die from that magic, their own lack of faith is surely to blame. At least, that’s what Hadara has been taught—and has so far refused to believe.Hadara and her mother have ignored the priests’ many warnings about their herb gathering, secure in knowing their tropical island is far from Nihil’s critical gaze. Then two powerful high priests arrive from Nihil’s home city to investigate the fallen star, insisting it harbors an unseen demon. This sets off speculation that an evil force is already at work in Port Sapphire and brings one of the holy men to Hadara’s doorstep. When he chooses Hadara as a guide into the wilds, she sets off a chain of events that will upend everything she’s been taught about the sacred and the profane.The Temple of Doubt is the first installment in a series that follows a teenager who is given a greater destiny and purpose than she could’ve ever imagined.Sky Pony Press, with our Good Books, Racehorse and Arcade imprints, is proud to publish a broad range of books for young readers—picture books for small children, chapter books, books for middle grade readers, and novels for young adults. Our list includes bestsellers for children who love to play Minecraft; stories told with LEGO bricks; books that teach lessons about tolerance, patience, and the environment, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Dystopia"
  ],
  "author": "Anne Boles Levy",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/23130282-the-temple-of-doubt"
}