{
  "title": "Something Must Be Done About Prince Edward County: A Family, a Virginia Town, a Civil Rights Battle",
  "description": "Combining hard-hitting investigative journalism and a sweeping family narrative, this provocative true story reveals a little-known chapter of American history: the period after the Brown v. Board of Education decision when one Virginia school system refused to integrate.In the wake of the Supreme Court’s unanimous Brown v. Board of Education decision, Virginia’s Prince Edward County refused to obey the law. Rather than desegregate, the county closed its public schools, locking and chaining the doors. The community’s white leaders quickly established a private academy, commandeering supplies from the shuttered public schools to use in their all-white classrooms. Meanwhile, black parents had few options: keep their kids at home, move across county lines, or send them to live with relatives in other states. For five years, the schools remained closed.Kristen Green, a longtime newspaper reporter, grew up in Farmville and attended Prince Edward Academy, which did not admit black students until 1986. In her journey to uncover what happened in her hometown before she was born, Green tells the stories of families divided by the school closures and of 1,700 black children denied an education. As she peels back the layers of this haunting period in our nation’s past, her own family’s role—no less complex and painful—comes to light.At once gripping, enlightening, and deeply moving, Something Must Be Done About Prince Edward County is a dramatic chronicle that explores our troubled racial past and its reverberations today, and a timeless story about compassion, forgiveness, and the meaning of home.",
  "genres": [
    "Nonfiction",
    "History",
    "Education",
    "Race",
    "Memoir",
    "Social Justice",
    "Politics"
  ],
  "author": "Kristen Green",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/23131084-something-must-be-done-about-prince-edward-county"
}