{
  "title": "Collide Into You",
  "description": "Collide Into You: A Romantic Body Swap Love StorySHE'S ALL ABOUT ORDER. HE NEEDS A CHALLENGE. THEIR LIVES ARE ABOUT TO COLLIDE.Love, by its very definition, is disorder...When twenty-seven-year-old Army Sergeant Keira Holtslander, an orderly and rule-loving intelligence analyst, is reassigned to the Pentagon for a special assignment, she agrees to room with her brother's best friend, Dillan Pope. But there's a problem. Several, in fact. He's sarcastic, egotistical, full of himself, extremely attractive, and a womanizer. Within a matter of days, her life is chaos. She didn't like him when they met nine years ago, and her opinion isn't likely to change now. Love... crashes around you...Dillan Pope, a thirty-year-old career businessman climbing his way up the corporate ladder, has learned to use his looks, charm, and sexual skills to his advantage. There isn't much he cannot accomplish. Women easily tumble into his bed and business deals come about effortlessly. But when his best friend's little sister moves in, he knows he's in trouble. She's rather hostile toward him, which takes him by surprise. Not even his patented smile works on her, but maybe that’s why Keira, aka Sergeant Prim and Proper, has always been the one girl he hasn’t been able to forget since their first meeting, nine years ago. Love... blinds you...When a meddling barista puts a charm on the roommates, causing them to swap bodies, they must live as the other until they both own up to some hard truths. They quickly learn that panic, fighting, and accusations will get them nowhere. Until they can learn the lessons they refuse to acknowledge, they experience life as the other. Along the way they are forced to concede that maybe the other isn’t so bad. Love... heals you...Maybe there's a reason they hated each other. And admitting the feelings that lay hidden may be the only way to undo the switch. ~*~*~*~*~*Kelly Washington's new contemporary, military romance, written with a touch of magic, will make you laugh and believe in love all over again",
  "genres": [
    "Paranormal",
    "Romance"
  ],
  "author": "Kelly Washington",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/23128096-collide-into-you"
}