{
  "title": "The Governor",
  "description": "Librarian's note: Alternate cover edition of ASIN B00M8PLXOW.THIS IS NOT PART OF A SERIES. I'M NOT SURE WHY IT'S LISTED AS SUCH. GOODREADS LIBRARIANS ARE FREE TO REMOVE THE SERIES STATUS AND MAKE IT A STANDALONE. THANKS FOR ALL YOU GUYS DO:)Anthony:If you saw me on the street you would immediately know me due to my high profile life of being the Governor. I am a politician. I'm seated in church on Sundays. I am a man with an impeccable reputation.But you and I both know--we all have vices. My vice is--and always will be--Talia. She is an addiction that is in my system and that addiction will go to the grave with me. I own her now. I pursued her with a vengeance and I now have a contract that states for the next year of her life she is my property.Talia:My name is Talia and I am what some people term a hooker, whore, prostitute, escort, or lady of the evening. I do fine on my own. I don't need a knight in shining armor-until now.He is dark, demanding, in control, dangerous, and powerful--He is the Governor and he is my knight in shining armor--or so he says... He now owns me. From the moment that he laid eyes on me he coveted me. He pursued me until he convinced me to sign a contract giving him ownership of me for a year. He can do anything that he chooses to me. I am his property--to do with as he sees fit and he is one sexually deviant--twisted individual.This is our story. It is NOT a love story. It IS a dark erotic tale.Warning: This is not romance. It is the story of two extremelydamaged people in a very dysfunctional relationship. Whether you would view their relationship as love, or not--I can't say. What I can say as the author, is that Anthony and Talia demanded a voice. They demanded that their story be told and I have been faithful in telling it. Their story is one of dark, twisted, and chaotic passion. I have remained true to them and for that I hold a special place in their heart, and they most definitely hold a sacred place in mine.",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Politics",
    "Contemporary"
  ],
  "author": "Suzanne Steele",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/23130654-the-governor"
}