{
  "title": "Fearless Part I: Lying Down With Dogs",
  "description": "From the author of the Walker Series comes a family drama like no other, a sprawling character epic, a forbidden love story full of angst, adventure, heartbreak, and second chances. Welcome to the mother chapter of the Lean Dogs Motorcycle Club; meet the girl raised by outlaws, and the fearsome man who will always hold her heart.  Ava Teague left for college with a busted heart and a deeply ingrained love for her biker family. She returns home to Knoxville for grad school, just in time for her father to accept the burden of president…and for Mercy Lécuyer to roll back into town, looking to patch into the Tennessee chapter once more. She’ll steer clear of him, she tells herself. She has a new life, a new boyfriend, and a new outlook. But she can’t shake her DNA. And maybe she doesn’t want to. Felix Lécuyer left the swamps of Louisiana for a life as an outlaw biker named Mercy, but it was his family, and the retribution he dealt because of it, that made him famous within the club. Fourteen years ago he fled New Orleans for Knoxville, to become an extractor and bodyguard within the mother chapter, guarding Ghost Teague’s family, becoming a constant companion to little Ava. When she was seventeen, he finally crossed the line. Now she’s twenty-two, and he’s back in town as on old nemesis rears its ugly head, and puts the entire club in danger. The fate of the club is uncertain, but Mercy has no doubts about his heart; it still belongs to Ava.  Told in installments, this is the first of four parts of a complete novel. Fearless will later be offered in its entirety, as a full 600+ page novel; the price will be comparable; Lauren wanted to experiment with releasing a novel in parts, so readers could enjoy it as she completes writing on each section. Readers can follow along with her, or wait for the finished novel. This rich narrative travels from the swamps outside New Orleans to the foothills of Tennessee, spanning fourteen years, following a family of outlaws bound by brotherhood, blood, and a love that knows no boundaries. Dive into Fearless Part I: “Lying Down With Dogs,” and be on the lookout for Part II: “Crossing Lines”. Mercy can also be found in Lauren Gilley's third Russell novel, KEEPING BAD COMPANY, a Southern outlaw series that kicks off with book one: MADE FOR BREAKING.",
  "genres": [
    "Dark",
    "Romance"
  ],
  "author": "Lauren Gilley",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/23128926-fearless-part-i"
}