{
  "title": "Zee's Story",
  "description": "Who are the two funniest guys at Camp Wolf Trail? Will ’n’ Zee—no question! The best buddies have emailed all winter long, and now they’re back at camp, with millions of great ideas for practical jokes and more than a few big surprises to spring on their fellow campers and counselors. Will and Zee are a trickster team of two. They’re partners-in-pranks, a dynamic duo, a famously hilarious pair.At first, all the mayhem and mischief they cause is a big success. Who’d have guessed that a stuffed octopus, toilet paper, and pies could be combined so comically? Will and Zee’s twist on a Camp Wolf Trail tradition is brilliant—and means that they’re rewarded with the privilege of doing Dead Man’s Dive off Big Boulder into O’Mannitt’s Cove. They’re sure their next triumph will be finding the camp’s best-kept the location of Hidden Falls. But when Zee tries to include other guys in the searching, plotting. planning, and fun, Will gets mad, and their friendship blows up. Zee must face his scariest, most dangerous crisis on his own while on a kayaking trip, and for a while, it looks like all is lost. Will Zee be able to save Cookie’s life and rescue his friendship with Will, too? Is this the end of Will ’n’ Zee? Must Hidden Falls remain hidden? One thing’s for Zee will have an adventure-packed summer at Camp Wolf Trail!Sky Pony Press, with our Good Books, Racehorse and Arcade imprints, is proud to publish a broad range of books for young readers—picture books for small children, chapter books, books for middle grade readers, and novels for young adults. Our list includes bestsellers for children who love to play Minecraft; stories told with LEGO bricks; books that teach lessons about tolerance, patience, and the environment, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [],
  "author": "Kitson Jazynka",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/23130130-zee-s-story"
}