{
  "title": "The Song of Synth",
  "description": "Williams Burroughs meets Philip K. Dick in this dystopian drug-fueled novel set in the not-so-distant future.Synth is a drug able to induce hallucinations indistinguishable from reality. But it’s brand new, highly addictive, and more than likely dangerous. Even the dealers peddling the pills don’t know what long term effects the drug will have on its users. For Markus Olsen, Synth offers an easy escape to his crumbling life. Markus, an ex-hacker, has been caught red-handed, and while his friends were sent to jail for thirty years, Markus decided to cooperate, agreeing to lend his services and particular criminal expertise to Viborg City’s secret service, aiding the oppressive state power he’d been fighting to break in exchange for his relative freedom.But Markus’ past as an anarchist comes back to haunt him, in the form of a credit card with no account but an seemingly unlimited balance as well as the discovery of a mysterious novel in which he is a main character. How much of his reality is being produced by Synth? How disconnected from real life has Markus become? Forced to face his past and the decisions he’s made, Markus must decide to choose between the artificial comfort of his constructed life and the harsh reality of treason and the struggle for freedom.Skyhorse Publishing, under our Night Shade and Talos imprints, is proud to publish a broad range of titles for readers interested in science fiction (space opera, time travel, hard SF, alien invasion, near-future dystopia), fantasy (grimdark, sword and sorcery, contemporary urban fantasy, steampunk, alternative history), and horror (zombies, vampires, and the occult and supernatural), and much more. While not every title we publish becomes a New York Times bestseller, a national bestseller, or a Hugo or Nebula award-winner, we are committed to publishing quality books from a diverse group of authors.",
  "genres": [
    "Science Fiction",
    "Speculative Fiction",
    "Fiction",
    "Literary Fiction"
  ],
  "author": "Seb Doubinsky",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/23130259-the-song-of-synth"
}