{
  "title": "Against All Odds - Angel's Story",
  "description": "Angel and Chase come from two different worlds. Angel grew up privileged. Her father is CEO of Cavanagh and Associates and her mother owns a successful dance school. Chase on the other hand grew up with a neglectful, manipulating mother, who put her numerous husbands and boyfriends before the welfare of her own son. So much so that when he was twelve, his stepfather at the time, who also happens to be a member of a notorious bikie gang, walked away from his marriage, taking Chase with him.Angel Angel is daddy’s little princess. In his eyes, no one is good enough for his little girl. Due to his overprotectiveness, at the age of twenty-two she’s never had a serious boyfriend. She decides to move away from home to finish school, so she can experience all that life has to offer. That includes men.When she meets Chase Daniels, sparks fly. He’s the ultimate womanising bad boy. Even though her common sense says stay away, she can’t seem to control the attraction she feels for him.ChaseChase doesn’t hold women in high regard due to his past. With his good looks and charm though, he has women falling at this feet. Just the way he likes it. He’s a playboy and doesn’t do commitment. Then he meets Angel. She’s not only beautiful, but sweet and innocent. Nothing like the women he’s used to. The feelings he has for her are foreign to him and he doesn’t like it one bit. Despite all this, he’s drawn to her, like a moth to a flame.Not only do they have their families to contend with, there’s also the secrets from Chase’s past. Not only do they have the potential to destroy him, it will also tear them apart. The odds are stacked against them, but will they still be able to find happiness together? Or will it be enough to stop the one thing they want more than anything, each other?***WARNING this is recommended for 18+ due to coarse language, sexual content and some violence.Coming early 2015.",
  "genres": [
    "Romance"
  ],
  "author": "J.L. Perry",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/23127831-against-all-odds---angel-s-story"
}