{
  "title": "Gemma",
  "description": "Recomendado a partir de los 10 años y para todo aquel que tenga interés en espiar dentro de un mundo mágico escondido en la Argentina que conocemos, “Gemma” es una obra interesante, atractiva y entretenida, ágil de leer y fácil de seguir y su vocabulario es claro y agradable.Son 292 páginas llenas de secretos, aventura, magia, entretenimiento, amor, valores, suspenso y mucho más en donde se cuenta la historia de Gemma Rivero.A los dieciocho años, la joven maga creía que estaba preparada para el cambio pero desconocía que su papá Rodolfo, un importante funcionario del gobierno de la Comunidad Mágica Argentina, la adoraba y le borró la memoria para protegerla de personas que quieren encontrarla para lastimarla o chantajearlo. Por eso, las mudanzas constantes y la preocupación desmedida de su mamá.Algo había cambiado. Hasta el noticiero de los no-magos había reflejado una mala noticia que la chica no llegaba a comprender: un hombre muerto. ¿Quién?Gemma quería saber la verdad de lo que estaba pasando. Sin embargo, tenía miedo. Un ataque inesperado tuvo lugar durante su fiesta de egresados y es el ahijado de su padre, Diego, el guardia que la rescata, llamándola por el nombre que casi nadie pronuncia. ¿Y la persona encargada de cuidarla esa noche? Ya no importa. La custodia de una piedra legendaria ya no era un misterio guardado bajo siete llaves. Su identidad tampoco. La cacería de las mujeres de la familia había comenzado y, a pesar de tantos años de mantenerla ajena de la Comunidad Mágica Argentina por decisión de sus padres cuando nació, la habían encontrado.Es buscada mientras ella y Diego tratan de encontrar a Valeria Rivero, su tía. Alguien muy cercano amenaza a Rodolfo con matarla si no entrega la gema que su familia ha protegido desde el asesinato a su creador.El plazo está por expirar y con el zafiro mágico en su cuello la muchacha deberá confiar en las personas que tiene a su alrededor y, principalmente en su instinto. Ya no había mentiras. Y sus poderes comenzaban a salir a la luz; también sus caprichos y travesuras… y el amor.Al leer el libro se descubre junto a Gemma un mundo mágico y atrapante.PODÉS ADQUIRIRLO EN: www.tintalibre.com.ar/ info@tintalibre.com.arMÁS INFO: http://gemma-vaninarodriguez.blogspot...",
  "genres": [],
  "author": "Vanina Rodríguez",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/23148684-gemma"
}