{
  "title": "Hades",
  "description": "******WARNING*******This is not a story about a hero, or some bad boy-badass-antihero.This is a love story between two monstrous villains and one valiant kid, held together by their entwined heartstrings.It won't be pretty.It won't be pleasant.There's no fluffy good feelings about it.It will rip out your heart and never give it back.Breno Hades el Oscuro took no bullshit from anyone. He ruled the crime world of the United States. When the King fell, what was left in the ashes was not the small boy that grew up without his father, not the same kid that chose a life of crime at seventeen, nor was it the King who had killed and clawed through a river of blood to stand at the top.The King was dragged from his throne of bones into a deep dark pit, leaving only the raw flesh of a savage monster to crawl out of Hell.One that knew love, but didn't want it again.Kemono Orochi was destined to inherit the legacy of his father, known as The Dragon's Tongue. It was an inheritance he never wanted it, never desiring the power that came with the title of Dragon. Kemono ended it all by tearing off the Dragon's head, watching the serpent's remains be consumed in hellfire. Now tormented by the scars of his past inflicted by his father, he is struggling to come to terms with the Akuma he has become.One that wants to devour everyone in his path to protect the only one that matters to him.The only person that had ever made his icy heart beat.His heart. His love. His beautiful pride.Rex Hunter dreams of becoming a principal ballerino...all fierce, like a Phoenix. But this Phoenix has lost his wings and fallen prey, straight into the clutched claws and callus hands of two vicious beasts. Each bore the blackest of hearts, each desiring to keep him safe, cherished and loved unconditionally. Or was Rex just destined to be the goo that would stick two shattered souls together and prevent them from forever falling to pieces?There will be blood, gore and nasty shit.There will be watersports, crude, angry, sometimes sensual and other times just downright dirty and dysfunctional sex.BUT...There will always be LOVE...Because even villains understand the tortured scars love leaves in its wake.",
  "genres": [
    "M M Romance",
    "BDSM",
    "Dark",
    "Erotica",
    "Romance",
    "LGBT",
    "Gay"
  ],
  "author": "Wulf Francú Godgluck",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/23146393-hades"
}