{
  "title": "The New Way Things Work",
  "description": "Did you know that the principle behind the zip fastener also governed the building of the pyramids? Did you know that the dentist's drill is a direct descendant of the first windmill? Did you realise that for a computer to carry out complex tasks, it first has to convert information into simple numerical codes? These are some of the fascinating connections made by David Macaulay in this accessible guide to the workings of machines. Employing all the skills of imagination and draughtsmanship that have brought him a prize-winning international reputation, David Macaulay has created, and now updated, a book for anyone who wants to understand how things work and would like to be stimulated and entertained in the process. David Macaulay not only demonstrates how machines do what they do - from the simplest lever to the far-reaching capabilities of the Internet - he also shows how the concept behind one invention is linked to the concept behind another. Using the humorous analogy of a woolly mammoth to illustrate principles, he offers even the least technically-minded reader a window of understanding into the complexities of today's technology. \"The New Way Things Work\" is arranged in five sections. Together they provide comprehensive coverage of the workings of hundreds of machines and devices - holograms, helicopters, airliners, mobile phones, compact discs, hard disks, bits and bytes, and cash machines. They also provide explanations of the scientific principles behind each machine - how gears make work easier, why jumbo jets are able to fly, how computers actually compute. \"The New Way Things Work\" has been conceived for readers of all ages. It has especially been designed for those who find technology intimidating, and who wish it were less so. For them, David Macaulay's treatment of the subject, offers access to knowledge in the most captivating manner, while at the same time making the discovery seem like fun.",
  "genres": [
    "Science",
    "Nonfiction",
    "Reference",
    "Childrens",
    "Engineering",
    "Technology",
    "Picture Books"
  ],
  "author": "David Macaulay",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/2313182.The_New_Way_Things_Work"
}