{
  "title": "Potemkin och Katarina den stora: En kejserlig förbindelse",
  "description": "Grigorij Potemkin var Katarina den storas älskare och hemlige make, som tillsammans med henne regerade över det ryska imperiet. Enligt Katarina var han \"en av de största, mest excentriska och spirituella personerna under sin tid\", och hon såg honom som sin \"tvillingsjäl\" och \"herre och härskare\".Deras relation var mycket stormig och de kom så småningom överens om ett arrangemang som innebar att de delade på makten, och det gav också Potemkin frihet att ha förhållanden med andra kvinnor. Kärleken mellan Katarina och Potemkin upphörde dock aldrig. Den hör till de största och märkligaste i historien.Potemkin visade sig vara en enastående statsman; han erövrade Krim, anlade skeppsvarv, skapade Svartahavsflottan, grundlade städer som Sevastopol och Odessa, och han gjorde Ryssland till en stormakt. Hans militära bedrifter tål att jämföras med Peter den stores.Potemkins fiender hävdade att han uppförde fuskbyggen, \"Potemkinbyar\", ett förtal som denna biografi definitivt vill vederlägga.Potemkin utgjorde sinnebilden av Ryssland: ombytlig, temperamentsfull, vacker, sensuell och alltid överraskande. Med sin bisarra och magnifika personlighet blev han skandalomsusad i hela Europa. Han förde ett vällustigt och överdådigt leverne och kunde förföra en prinsessa genom att räcka fram ett fat med diamanter i stället för dessert.Efter fem års forskning i en mängd arkiv från Sankt Petersburg till Odessa har Simon Sebag Montefiore fått fram en fascinerande bild av hur samarbetet mellan Potemkin och Katarina den stora fungerade, hur de skapade en egen \"familj\". Montefiore berättar här inte bara om en relation som byggde på kärlek och politik utan ger också Potemkin den plats han förtjänar i Rysslands historia.",
  "genres": [
    "History",
    "Russia",
    "Nonfiction",
    "Biography",
    "Russian History",
    "Biography Memoir",
    "European History"
  ],
  "author": "Simon Sebag Montefiore",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/23148296-potemkin-och-katarina-den-stora"
}