{
  "title": "Better When He's Brave",
  "description": "In New York Times and USA Today bestselling author Jay Crownover’s third novel in her sexy, thrilling Welcome to the Point series, a woman’s search for repentance leads her to the one man from her past she can’t forget as they join forces to save their city—and the explosive love neither can live without.Titus King has always seen his world in black and white. There is a firm right and wrong in his mind, which is why as a teenager he left behind the only family he’d ever known to make a better life for himself. Now a police detective in one of the worst cities in the country, he can’t deny his life has turned into a million different shades of gray.The new criminal element in The Point has brought vengeance and destruction right to Titus’s front door, and walking the straight and narrow seems far less important now. The difference between right and wrong is nothing compared to keeping those he loves alive. To add to his already strained moral compass, the beautiful and mysterious Reeve Black has made her way back to town. This girl might be as dangerous to Titus as the guy trying to destroy the Point but he can’t walk away because he needs her—in more ways than one.Reeve knows all about the threat trying to destroy The Point. She knows how ruthless, how vicious, and how cruel this new danger can be… and instead of running away, she wants to help. Reeve knows that she has a lot to repent for and saving the city, plus the hot cop that she hasn’t been able to forget might just be the only way she can finally find some inner peace.With an entire city poised on the brink of war, Titus and Reeve stand in the crossfire—and it will take two brave souls to fight for the ultimate love.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Contemporary Romance",
    "Audiobook",
    "Adult",
    "Crime"
  ],
  "author": "Jay Crownover",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/23148605-better-when-he-s-brave"
}