{
  "title": "The Quincy Solution",
  "description": "Would you like to share a $500 billion reward?  It might sound too good to be true, but this is the benefit to society of adopting the Quincy Solution with its proven practices to dramatically reduce domestic violence crime.  Barry Goldstein has spent his career working to prevent abuse so he knew how to synthesize history and research about practices that stop domestic violence with medical research about the enormous health impact from stress related to domestic violence and child abuse. Barry started by reviewing the successful practices in Quincy, San Diego, and Nashville.  Domestic violence is not inevitable, and it is not surprising it can be prevented with a group of best practices.  He updated the proven practices with new research, technology, and inclusion of the custody courts.  The primary obstacle was inertia and money.  Then the ACE (Adverse Childhood Experiences) research established that children exposed to domestic violence, child abuse, and other traumas suffer more illnesses and injuries throughout their lives.  We can reduce societal problems like cancer, heart disease, substance abuse, and crime―and dramatically improve our economy.  This is the Quincy Solution. ABOUT THE Barry Goldstein has dedicated his career to stopping men’s violence against women and preventing the mental, emotional and physical trauma it inflicts on their children.  A passionate and sought-after speaker, Barry’s the author of four other books on domestic violence. “I can’t help but think of all the courageous women who died and all the anguished faces of the children they left behind -- who might have been saved by this book.”~ Rita Smith, Former Executive Director, National Coalition Against Domestic Violence   “Barry Goldstein compiles shocking data showing how our legal system enables violence against women and children.  Buy this book.”~ Wendy Murphy, New England Law Boston, Author “And Justice For Some”   “Domestic violence can be stopped.  This book proves it.”~ Andrew Willis, Survivor, Founder Stop Abuse Campaign“Barry Goldstein has eloquently captured the crisis that is domestic violence in America today, but his real gift is that of hope.”  ~ Sarah Buel, Survivor, Advocate, Law Professor and former Quincy Prosecutor “A must-read for advocates, police officers, lawyers, judges and anyone who cares about saving the lives of domestic violence victims.” ~ Lt. Mark Wynn (ret), Nashville PD “A long-awaited, desperately-needed gift to battered women and their children.  This plan could become the Holy Grail of custody litigation.”~ Mo Therese Hannah, PhD, Chair of the Battered Mothers Custody Conference“Preventing domestic violence can interrupt the cycle of violence that harms children, families and communities.  It’s critical to use science to demonstrate what works, then move from science to practice.”~ Linda C. Degutis, DrPH, MSN, Former Director, NationalCenter for Injury Prevention and Control, CDC “Shocked to learn the courts don’t already make the health and safety of children priority one when deciding custody and visitation.”~ Kelly Rutherford Actress   S ales of this book support the National Coalition Against Domestic Violence and the Stop Abuse Campaign's implementation of the Quincy Model.",
  "genres": [],
  "author": "Barry Goldstein",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/23140041-the-quincy-solution"
}