{
  "title": "The Gridlock Economy: How Too Much Ownership Wrecks Markets, Stops Innovation, and Costs Lives",
  "description": "25 new runways would eliminate most air travel delays in America. Why can’t we build them? 50 patent owners are blocking a major drug maker from creating a cancer cure. Why won’t they get out of the way? 90% of our broadcast spectrum sits idle while American cell phone service lags far behind Japan’s and Korea’s. Why are we wasting our airwaves? 98% of African American–owned farms have been sold off over the last century. Why can’t we stop the loss? All these problems are really the same problem—one whose solution would jump-start innovation, release trillions in productivity, and help revive our slumping economy.Every so often an idea comes along that transforms our understanding of how the world works. Michael Heller has discovered a market dynamic that no one knew existed. Usually, private ownership creates wealth, but too much ownership has the opposite effect—it creates gridlock. When too many people own pieces of one thing, whether a physical or intellectual resource, cooperation breaks down, wealth disappears, and everybody loses. Heller’s paradox is at the center of The Gridlock Economy. Today’s leading edge of innovation—in high tech, biomedicine, music, film, real estate—requires the assembly of separately owned resources. But gridlock is blocking economic growth all along the wealth creation frontier.A thousand scholars have applied and verified Heller’s paradox. Now he takes readers on a lively tour of gridlock battlegrounds. Heller zips from medieval robber barons to modern-day broadcast spectrum squatters; from Mississippi courts selling African-American family farms to troubling New York City land confiscations; and from Chesapeake Bay oyster pirates to today’s gene patent and music mash-up outlaws. Each tale offers insights into how to spot gridlock in operation and how we can overcome it.The Gridlock Economy is a startling, accessible biography of an idea. Nothing is inevitable about gridlock. It results from choices we make about how to control the resources we value most. We can unlock the grid; this book shows us where to start.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Politics",
    "Business"
  ],
  "author": "Michael A. Heller",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/2313380.The_Gridlock_Economy"
}