{
  "title": "The Iron Wire",
  "description": "In 1870 an enterprise began in Australia that was breathtaking in its ambition: to construct a single galvanised iron wire between Adelaide and Darwin, crossing two thousand miles of virtually unexplored wilderness. This was the Overland Telegraph Line, using local trees as poles, thousands of them, and hundreds of men who would not return to civilization for two years or more. Some would not return at all.Alex McKenzie is a young telegrapher who believes his chosen profession to be at the cutting edge of contemporary science. A man who knows that once the last pole is erected and the line is open from Adelaide, to Darwin, to London and on to New York, the world will have shrunk and messages that used to take four months from sender to receiver will then take only minutes. His hopes for the future, for him and the love of his life, Sally, rest on the success of this magnificent Australian achievement. However, there are those whose enmity he has aroused and who would not hesitate to rob him of his life simply because he represents all they hate: someone who has grabbed at his opportunities and has risen from farm labouring roots to man of science.The Iron Wire: a novel of human hope and progress in a land where men die, women are widowed, and bushrangers live by the lie and the gun.“His characters are strong and the sense of place he creates is immediate.” (Sunday Times on In Solitary)“The Songbirds Of Pain is excellently crafted. Kilworth is a master of his trade.” (Punch Magazine)“Atmospherically overcharged like an impending thunderstorm.” (The Guardian on Witchwater Country)“A convincing display of fine talent.” (The Times on A Theatre Of Timesmiths)“A masterpiece of balanced and enigmatic storytelling ...Kilworth has mastered the form.” (Times Literary Supplement on In The Country Of Tattooed Men)“An absolute delight, based on the myths and legends of the Polynesian peoples.” (Mark Morris on The Roof Of Voyaging)“A subtle, poetic novel about the power of place – in this case the South Arabian Deserts – and the lure of myth. It haunted me long after it ended.” (City Limits Magazine on Spiral Winds)",
  "genres": [],
  "author": "Garry Kilworth",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/23133141-the-iron-wire"
}