{
  "title": "The World Turned Upside Down",
  "description": "29 short stories from 1933-1967 that left permanent significant impact on the three editors as teens.1 Rescue Party by Arthur C. Clarke (Astounding Science Fiction May'46)2 Menace from Earth by Robert A. Heinlein (The Magazine of Fantasy and Science Fiction Aug'57)3 Code Three by Rick Raphael (Analog Feb'63)4 Hunting Problem by Robert Sheckley (Galaxy Sep'55)5 Black Destroyer by A. E. Van Vogt (Astounding Science Fiction July'39)6 Pail of Air by Fritz Leiber (Galaxy Dec'51)7 Thy Rocks and Rills by Robert Ernest Gilbert (If Sep'53)8 Gun for Dinosaur by L. Sprague de Camp (Galaxy Mar'56)9 Goblin Night by James H. Schmitz (Analog Apr'65)10 Only Thing We Learn by C. M. Kornbluth (Startling Stories July'49)11 Trigger Tide by Wyman Guin (as Norman Menascoe Astounding Science Fiction Oct'50)12 Aliens by Murray Leinster (Astounding Science Fiction Aug'59)13 All the Way Back by Michael Shaara (Astounding Science Fiction July'52)14 Last Command by Keith Laumer (Analog Jan'67)15 Who Goes There? by John W. Campbell (as Don A. Stuart Astounding Science Fiction Aug'38)16 Quietus by Ross Rocklynne (Astounding Science Fiction Sep'40)17 Answer by Frederic Brown (Angels and Spaceships 1954)18 Last Question by Isaac Asimov (Isaac Asimov: The Complete .. #1 1956)19 Cold Equations by Tom Godwin (Astounding Science Fiction Aug'54)20 Shambleau by C. L. Moore (Wierd Tales Nov'33)21 Turning Point by Poul Anderson (If May'53)22 Heavy Planet by Lee Gregor (Astounding Science Fiction Aug'39)23 Omnilingual by H. Beam Piper (Astounding Science Fiction Feb'57)24 Gentle Earth by Christopher Anvil (Astounding Science Fiction Nov'57)25 Environment by Chester S. Geier (Astounding Science Fiction May'44)26 Liane the Wayfarer by Jack Vance (The Dying Earth 1950)27 Spawn by P. Schuyler Miller (Wierd Tales Aug'39)28 St. Dragon and the George by Gordon R. Dickson 29 Thunder and Roses by Theodore Sturgeon (Astounding Science Fiction Nov'47)",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Short Stories",
    "Anthologies",
    "Fantasy",
    "Horror",
    "Space"
  ],
  "author": "Eric Flint",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/2315183.The_World_Turned_Upside_Down"
}