{
  "title": "The Awakening",
  "description": "Raina was use to being alone. In fact she desired to be alone. She had cut herself off from the world because she had lost one that she loved. She hadn't asked much of life but life had asked a lot of her.  She’d been crippled by depression for too long. She knew this, but if she hid herself away than she couldn't be hurt again.  Normalcy! That's all she needed now. She wanted to feel like a normal living breathing person. But again life has a wicked sense of humor. Normalcy she did not get. In walks a whole lot of abnormal, and a whole lot of intrigue. Of no choice of her own, her dreams are bombarded by two strangers.  The silver eyed savior with the commanding voice, she can deal with. It's the green eyed devil with a penchant for mischief that has her worried. Soon her worry turns to full on panic when the strangers not only invade her dreams but her real life.  But they both bring something into her life that she's needed.  Nolan shows her that she is of great worth and that spark that she thought she had lost long ago with her previous love is still capable of burning.  The green eyed one, shows her redemption and change are never too far gone even when he acts as though he were the devil himself.  They carry secrets with them and she desires to know why they are here and what they want of her! She soon finds that immortality has been gifted to them! She also finds that their eyes do not see as mortals see. Her unremarkable appearance is seen as a great thing of beauty in their sight. In their world, inner beauty does truly shine through! She is asked to keep all of this is a secret and in turn they will keep her safe and secret as well. She is even offered the chance to completely forget all that she has learned. She refuses to let go.  Raina, who had always been intrigued by the paranormal, must now accept it's realness in her life. And she must accept the role that she's given when neither are able to keep her a secret. And those with not as pure of heart seek to take the beauty she has.  She found in herself a strength that she didn't know she had. She found that the normalcy she once craved would no longer satisfy her. She needed this jolt so that she could transform. What she had once found fantasy was now her true reality.",
  "genres": [
    "Romance",
    "Paranormal Romance",
    "Paranormal"
  ],
  "author": "Sarah Brocious",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/23152414-the-awakening"
}