{
  "title": "Please Mrs Butler: The timeless school poetry collection",
  "description": "The bestselling and much-loved children's poetry classic, Please Mrs Butler by Allan Ahlberg is celebrating its 30th anniversary! With a fresh new look for a brand new generation of school children to take to its heart, every teacher, parent and child should have a copy. Nobody leave the room. Everyone listen to me. We had ten pairs of scissors At half-past two, And now there's only three. This witty collection of school poems by Allan Ahlberg, re-jacketed for its 30th anniversary and for a whole new generation of school children to fall in love with, is full of typical classroom events that will be recognized and enjoyed by everyone. From never-ending projects, reading tests, quarrelling, making-up, excuses and 'Please, Sir, it isn't fair.' Fritz Wegner's line drawings beautifully complement the hilarious and poignant verses. Please Mrs Butler was voted the most important twentieth-century children's poetry book in a Books for Keeps poll. Praise for Please Mrs 'Hilarious and poignant school verses about primary school life. A real winner' - Guardian 'Clever, funny and nostalgic, the collection is a delight' - Sunday Times PLEASE MRS BUTLER - The most important 20th-century children's poetry book' - Books for Keeps poll Praise for Allan 'By far our best writer for the young,' - Telegraph Author Allan Ahlberg, a former teacher, postman, plumber's mate and grave digger, is in the super-league of children's writers. He has published over 100 children's books and, with his late wife Janet, created such award-winning picture books as Each Peach Pear Plum and The Jolly Christmas Postman - both winners of the Greenaway Medal. He has also written prize-winning poetry and fiction for older readers. The Telegraph described him as 'By far our best writer for the young.'",
  "genres": [
    "Poetry",
    "Childrens",
    "Humor",
    "Classics",
    "Fiction",
    "School",
    "Young Readers"
  ],
  "author": "Allan Ahlberg",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/1015148.Please_Mrs_Butler"
}