{
  "title": "Love and the Mystery of Betrayal",
  "description": "This achingly moving chronicle and meditation on the mysteries of love and betrayal shows how faith and love can triumph even after the most life-shattering revelations and loss. What is it like to recover from betrayal of trust today in a culture that is blind to the trauma and impatient with grief? When her long-time partner abruptly left shortly before their wedding, the author found nothing had prepared her for the depth and duration of the pain. She could not understand why this shock hit her so hard. Despite having endured her husband's death years earlier, she was stunned by the intensity of suffering. Her loss of faith in this one person precipitated an existential and spiritual crisis that called her very understanding of human nature into question. She wanted to know why. As she wrested with what turned out to be unrecognized trauma and subsequent PTSD, she began to keep careful notes of her inner life. She was intent on capturing the paradoxes of love, grief and longing mixed with bewilderment and post-traumatic stress. With bracing frankness and fearlessness, she succeeds. \"Love and the Mystery of Betrayal\" seamlessly blends research and reflection, love and heartbreak, rage and transformation, and the personal with the collective. The deep, engaging writing provides the type of solace only a kindred spirit who has been there can. This book blows the whistle on a culture that is blind to betrayal and denies and dismisses emotional suffering. Meanwhile, it guides you through the turmoil, pain and anguish with a gentle touch, understanding heart, and deep wisdom.This is a multiple award-winning NONFICTION psychological/spiritual narrative book — not recommended for the general reader. It IS highly recommended for those suffering from betrayal and heartbreak or any interpersonal grief, and for healers, family and friends who want to help them get through the crisis.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Relationships"
  ],
  "author": "Sandra Lee Dennis",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/23151487-love-and-the-mystery-of-betrayal"
}