{
  "title": "Hannah's Garden",
  "description": "Step into the Victorian Era, Turn -of- the- Century time period with every turn of the page in this inspirational, Christian, love story! Meet Hannah Jubilee Parker of Brookside Meadow Farm. Travel back in time with her on a journey that begins with tragic and challenging circumstances that threaten to destroy her future; but ends with renewed faith, true love and the triumph that comes in finding purpose, hope and meaning in life.If you loved reading Lucy Maude Montgomery's \"Anne of Green Gables,\" you will find \"Hannah's Garden\" reminiscent of the orphan girl the world fell in love with. Experience the heartache and victory of a closely knit family steeped with the rich heritage of strong values and hard work. They are presented with progress in every area of life. Queen Victoria, a woman, rules and reigns over the British Empire; Henry Ford is building his \"Quadricycle;\" and McKinley is winning a campaign for the Presidency --from his front porch!Enjoy getting to know the Parkers and their ten children; a Godly family destined to succeed in spite of economic collapse. Be delighted by the characters of a scenic, rural Kentucky town situated on the Ohio River as they struggle to survive the Panic of 1893. While mortgage foreclosures and job losses mount, Hannah's father, the Reverend Calvin Parker, does his best to foster courage and faith during uncertain times. As Hannah learns to cope with the anxiety of a painful past through Christ-centered living and even risks dreaming big, she also begins to embrace the large family that adopted her; but she isn't going to fuss over the new intern who recently graduated from Westminster Theological Seminary --who all of the young ladies in Lincoln County haven't stopped trying to trap since he stepped off the train from Baltimore.Study Guide for \"Hannah's Garden\" Included in this book with Scriptures on Salvation. Lisa Prysock is also the author of \"To Find a Duchess,\" An Inspirational Regency Romance Novel and \"Abigail's Melody,\" Volume 2 in The Victorian Christian Heritage Series.",
  "genres": [],
  "author": "Lisa M. Prysock",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/23152949-hannah-s-garden"
}