{
  "title": "The Young and the Evil",
  "description": "Note that the correct title of this book is The Young and Evil, not The Young and the Evil as seen in this modern reprint. The same cheap edition hyphenated Ford's last name, something the author never did.A milestone in the history of gay literature and of homosexuality itself, and praised unflinchingly by Djuna Barnes and Gertrude Stein, this stunning and experimental work, first published in 1933 by the Obelisk Press, Paris, is a non-judgemental depiction of gay life and men, told using characters modeled on the authors lives themselves. With the added interracial connotations, also unmentionable at the time, it remained largely unread for decades due to censorship suppression in England and the U.S. It survives as the first modern unapologetic thoroughly gay novel.Plotless and heavily influenced by Gertrude Stein's writing, this novel presents a queer group of friends in New York City who spend much time becoming uproariously drunk at parties, swapping beds and apartments, avoiding the hostile attentions of both the police and sailors; they cruise in the park, eat on the cheap at all-night \"coffeepots,\" wear make-up and gaudy gowns, and occasionally create art.In August 1933 a limited edition of 2500 copies of The Young and Evil appeared. Five hundred of these were destroyed by British customs, and American customs officials returned to France all shipments of the book that arrived in the United States. The book received only a single review in its authors' native country (in The New Republic, which praised it), and was generally not read by American audiences until its republication in the United States in editions issued in 1960, 1974, and 1988.",
  "genres": [
    "Fiction",
    "Queer",
    "LGBT",
    "Gay",
    "Classics",
    "American",
    "Literature"
  ],
  "author": "Charles Henri Ford",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/1138575.The_Young_and_the_Evil"
}