{
  "title": "Score on Me",
  "description": "This book has been re-edited and re-released. Issues have been fixed and new story line has been added. I hope you'll take a moment and check out the new version of Kris and Kat's story.This is the first book in the hockey romance series, the Renegades about a fictional hockey team based in Pittsburgh.Kat Torella didn't believe real love existed outside of her romance novels. She didn't believe in Prince Charming, or happily ever afters. Well, actually, she just didn't believe they would ever happen to her.Kat was not built for love. She always felt like the fat girl that no one really saw. Being bullied as a child led to a lifetime of self-doubt. She feared that she would always see that little fat girl staring back at her in the mirror. Even as an adult, she's still dealing with it.Hockey was her escape. She loved the game and she loved the players. One player in particular. He was dreamy. Even swoon-worthy. His dark eyes were mesmerizing. His smile devilishly sexy. His signature flowing locks always looked effortlessly perfect. He was flawless in every way...Too bad she would never get a guy like him. Well, at least that's what she thought.Kris Lafleur was the star defenseman for the Pittsburgh Renegades. Hockey was his life. Well, it was easy to be so dedicated to the game when he hadn't had much luck in the romance department. His hockey star status attracted puck bunnies and gold diggers. Neither was the kind of girl you wanted to bring home to mom; actually neither were the kind of girl that Kris even wanted to associate with. Deep down he was a hopeless romantic. He was looking for someone who was as devoted to him as he was to her, and not so interested in his bank account.Then he saw her... Was it her smile? Was it her laugh? He didn't know what it was, but she already had his heart. She was beautiful.",
  "genres": [
    "Sports",
    "Hockey",
    "Romance",
    "Sports Romance",
    "Contemporary",
    "Contemporary Romance",
    "Fiction"
  ],
  "author": "Melody Heck Gatto",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/23150714-score-on-me"
}