{
  "title": "Juliette and the Monday ManDates",
  "description": "MEET THE GUSTAFSON GIRLS When Paul and Simone Gustafson are killed by a drunk driver, the lives of their four daughters change irrevocably. Although raised by loving grandparents, it’s the G-FOURce—the Gustafson Four Sisters Club—that binds them together when their differences would tear them apart. All grown up now, Juliette has become the quintessential doormat, Renata, two years younger, the self-appointed matriarchal figure. Phoebe is borderline narcissistic, according to Renata at least, and Gia is on the verge of a major identity crisis. But they’re still a force with which to be reckoned as they continue the time-honored tradition of meeting together to love and support one another, and if necessary, to intervene in each others lives. What none of the sisters has been willing to address is the hovering presence of Angela Clinton, the senior class darling who drove her cherry black 1970 el Camino into the side of their parents’ car on the night of Juliette’s high school graduation. But Angela’s prison sentence is winding down; soon she’ll be eligible for parole, so face her, they must. Will the G-FOURce be strong enough to hold them together as they step into the eye of the storm that’s been brewing for the last fifteen years? Will they finally be able to let go of the past and embrace the future, no matter what it holds? JULIETTE AND THE MONDAY MANDATES Juliette Gustafson is heart-broken after waiting nearly ten years for a proposal from her boyfriend that never came. Determining she isn’t “getting over Mike” quickly enough, her three younger sisters come up with The Monday ManDates; an intervention plan requiring Juliette to endure what turns out to be a series of remarkably disastrous blind dates. Between TheraPaul, Frisky Frank, TAZ the rock star, and the stoic Tim Larsen, the Monday ManDates are doomed from the start. Then there’s Victor Jarrett, the police officer with an affinity for pulling Juliette over when she’s at her very worst. But no one is more surprised than Juliette when she meets the one man who can right the wrongs in her past and change her future, if she will only let herself fall in love with him.",
  "genres": [
    "Romance",
    "Christian Fiction",
    "Christian",
    "Contemporary",
    "Fiction",
    "Chick Lit",
    "Christian Romance"
  ],
  "author": "Becky Doughty",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/23149282-juliette-and-the-monday-mandates"
}