{
  "title": "Meridian",
  "description": "Dissenting with his destiny as a Vampire Courtesan, Kutra “K” Lapin resolves to flee Los Angeles in 2125. His ticket to Meridian, the only human controlled city in an otherwise suprabeing-ruled US, is a transporter known as Tiger, who —by the way— has decided to keep calling K “Bunny.”Thirteen hundred miles of free-for-all superhighway separates Los Angeles from Meridian. In this journey, the courtesan and the transporter will face clingy former clients; bar brawls; Werewolf, Fae and Warlock outlaws; invisible, firebombing hovercrafts; discover unknown powers, and survive spells and enchantments, all to reach K’s freedom.And perhaps, in the meantime, find a love that is beyond appearances. This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. Dear Author,In futuristic/apocalypse USA, most cities are led by the supernaturals. We, humans, become the second class citizen. New York’s leader is a werewolf, Chicago is led by a warlock, and Los Angeles? Los Angeles belongs to vampires. Los Angeles human citizens are marked by numbers on their wrists, based on our blood type, and we must donate our blood on scheduled days for those vampires. This is where I live. I’m 18 years old, I’m blood type AB, and I dream of going out of this city. I hear that there is still a city where humans still have controls, where they are able to keep the supernaturals out. That is where I’m going— with this bad boy on a bike, whom everyone knows as “Tiger”. I have a deep crush on him and well, on his bike (they both are just so sexy). Even if he annoys me by keep calling me “Bunny” (yes, I know I’m kinda lightweight). But heck, I’ll survive this road trip and who knows, maybe I’ll make him fall in love with me too *smile*Photo Description: Anime-style depiction of two men embracing at night. A brightly lit, futuristic city is their background, as if they stand on a hill. One man is tall and blond, and the other is shorter with dark hair. They seem to have come to this place on the shiny motorcycle beside them.This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Futuristic",
    "Dystopia",
    "Vampires"
  ],
  "author": "Gabbo De La Parra",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/23156255-meridian"
}