{
  "title": "He & She",
  "description": "*** 5-star Silver Medal winner in the 2014 Readers' Favorite Annual International Award Contest *** What does a man do when nothing tastes good anymore? he finds She.A Web photo of a dominatrix sends a man in midlife crisis on a last-ditch attempt to feel truly alive one more time, even if it kills him. \"... a stylish piece of literary fiction... intellectually engaging throughout. A finely drawn portrait of desire in its fall and winter seasons.\"- BlueInk Review \"...All in all, this is a delectable novel about a man exploring his unknown sexual fantasies at the price of possibly losing his true self along the way.\"- Red City Review Growing numb to life, to his on-and-off girlfriend of many years, his career, even Scotch, a man turns fifty. He is a translator who can no longer dream of translating beautiful works of fiction. He is an amateur musician who can no longer dream of expressing his life on a higher plane, without words. As he glares inside himself he sees little but his declining sexuality, his crumbling hold on life, a growing list of failed relationships, and a darkening well of loneliness. Stumbling upon an image on the Internet one night, he suddenly hears cell doors sliding open. He stares at a young woman, in profile, beautiful, unblinking, regal. Instinctively he knows that by lingering on that image he will shatter a relationship that has kept him on the sane side of loneliness as surely as if he stepped in front of a speeding eighteen-wheeler. But desperate to feel alive again before time runs out, he knows he must see the stranger behind the pixels on his laptop screen. Although it is her image that first transfixes him, his eye afterwards chances on a handful of words on the Internet page. She is a dominatrix. The word triggers something inside him, blows the dust off fantasies trickling back to adolescence, and slowly begins to re-choreograph his decades of sexual memories. Was he ever really the dominant male he thought he was? Did he have a sexual alter-ego? Was this the last card he had to play in life? The face on the screen held the answer. He would find out even if it killed him.",
  "genres": [
    "Erotica",
    "BDSM",
    "Literary Fiction"
  ],
  "author": "Wayne  Clark",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/23154850-he-she"
}