{
  "title": "Haylee Awakened Seed",
  "description": "An ancient pattern begins anew…Generations of oracles, seers, soothsayers and healers pass a relic of their lineage from hand-to-hand. They protect and prepare one another for the eventual blooming of a terrible secret… An oath made long ago has been broken. Haylee Garrett, a California teen growing up in the ‘70’s, is an expert at coping with things on her own. Before her mother died, her dad had been a loving and affectionate father. Since then, he works all the time and barely speaks. Haylee manages as best she can by doing chores, cooking their meals, and by staying out of her father’s sight.Haylee thinks that her paranormal ability to communicate with animals is perfectly ordinary.At fifteen, she is plagued with worry over her failure to physically mature. She wears sweats and avoids people who ask too many questions. Haylee has no idea that she is about to take part in an age-old relay.Excruciating pain starts at her temples and radiates out like pinpoint pricks of burning sparks throughout her entire body. On the eve of her eighteenth birthday, a horrific development changes everything. Raw fear courses through her. What’s wrong with me? her mind screams.After the change. Reveling in a sense of power and adventure, Haylee explores new adult boundaries within the confines of her life. She intuitively understands that this must be kept a secret—even from her father.Suddenly, everyone in high school wants to know her. Haylee is thrilled when the boy she’s been fantasizing about finally notices her. A romance begins to grow. Haylee remembers a few unusual things that her mother told her about the women in their family...what has happened is still a mystery. When Haylee’s condition begins to cause an urgent drive to steal what should never be stolen, Haylee grows increasingly afraid of what she is capable of doing—and to whom.",
  "genres": [],
  "author": "Lisa Redfern",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/23155386-haylee-awakened-seed"
}