{
  "title": "The Etiquette of Social Media",
  "description": "Did you know that 30% of College Admissions Officers found something online about an applicant that negatively impacted their college application?Or that more than two in five (43%) Hiring Managers found information online that caused them not to hire a candidate? Is social media preventing you, or someone you know from achieving their dreams and desired opportunities? Quite frankly, it is hard to say, as usually when we are denied something, more frequently than not, we are never told why.From the statistics above, we can see that social media is a huge determining factor in whether or not us, our children or our friends and family are accepted into the college of our dreams or into our dream jobs. In my professional life, I have always been told that an ounce of prevention is worth a pound of cure. In other words, it is better to be fully equipped and prepared for the opportunity as it arises, as opposed to wondering what we did wrong after we are passed up. Much like how a building must have their foundation built into the cornerstone that allows it to withstand the tests of time, we must have our foundation etched and chiseled out so we can be the best that we can be. This book, The Etiquette of Social Media, is the complete guide on the basic foundation that we all need to ensure that our online image is bulletproof from being judged by the decision makers of the world who may be able to have control of our destiny. Social Media is paving the way of the future. It is a new trend that is becoming standardized as a part of our daily lives. This new standard includes media outlets ranging from Facebook to LinkedIn to Quora and Twitter, along with many others. With how new social media is, there are no classes at our schools that cover the etiquette of social media. Whether you are in high school or a senior level executive, chances are you are oblivious to the guidelines of how to act on social media. In this day and age, that has been forgivable.Why? Because never before has there been a guide covering The Etiquette of Social Media, until now.Inspired by best-selling author James Altucher, Leonard Kim decided to write his first book of many. Being a personality with high visibility and a Top Writer on Quora, an Online Knowledge Market, Leonard has seen it all. From comments to messages to public attacks, Leonard has broken free from the viewpoint we all have of what is right in front of us. He has been able to expand outside of the myopic bubble of the Internet we have all come to see. He has expanded his view of our online society as a whole. In a single year, Leonard went from being a nobody to having over five million views on the internet. He went from being an introvert with less friends than he has fingers to cultivating friendships all across the world.Through decades of experience, Leonard has acquired a unique skill set. With a background in branding, Leonard understands the importance of your online reputation. He has been able to identify the key points to ensure that you come across as an approachable and likable human being. Are you looking to make new friends? Manage your online reputation? Or expand your business connections? This book will provide you with the essential tools you need to get ahead. The world is changing. Soon it will no longer be forgivable to be ignorant of your behavior on social media. People will start to judge you for each action you make. Read this guide to prepare yourself before that dreadfully awaited day finally arrives.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Leonard Kim",
  "average_rating": "3.02",
  "url": "https://www.goodreads.com/book/show/23155290-the-etiquette-of-social-media"
}