{
  "title": "Juice",
  "description": "Oh what a tangled web we weave, when first we practice to deceive. Three years after the tragic accident that claimed the life of her brother Harry, Cassidy Evans is still struggling. Determined to focus on her career as an artistic consultant in London; when Cassidy lands the commission of a lifetime she has no choice but to dive in head first. There is only one very tall, very beautiful, man-shaped problem. Her attraction to her new client Rory O’Malley is proving impossible to ignore. Cassidy finds herself falling for Rory and for once she allows herself to be carried away by the prospect of true love. Rory seems almost too good to be true. Is he? As CEO of the exclusive O’Malley resorts, Rory O’Malley frequently travels around the world. His good looks and healthy bank balance have always ensured that he has his pick of beautiful women, but through choice has been celibate for over six months. Whenever Rory is at home in Ireland his family provides more than enough drama to keep him entertained. Rory thinks his life is grand just as it is--until he meets Cassidy. Rory has never met anyone as sweet as Cassidy, both inside and out. Cassidy is unaware that Rory harbours a secret about her brother’s accident. A secret that could potentially ruin their blossoming love affair. Soon, he is willing to move mountains to love--and protect--her, but should he be protecting her from himself? Cassidy had vowed never to make the mistake of loving a man again. So, how the hell did she end up in his bed? And how the hell did he end up in her heart? The attraction between them sparkles and sizzles and love winds its grip around them both. But secrets rarely stay hidden and very soon Rory’s secret puts their love in jeopardy. Can Cassidy forgive the worst betrayal she had ever known? This book contains sexual scenes and language that is only appropriate for those over 18.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Amazon"
  ],
  "author": "Michelle McLoughney",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/23154719-juice"
}