{
  "title": "Snow the Vampire Slayer",
  "description": "Lady Snow Gwyn is tired of playing \"mother\" to her seven Vampire Slaying brothers. For the past two years, she's yearned to be out there fighting at their side as they hunt for bloodsuckers in the black of night. Snow is as good a fighter as any man, but she wasn't called to be a Slayer. A mere formality in her book.Prince Sageren, Son of Lothar has spent the last fifty years in exile, awaiting the day when he can finally avenge his family and take back his throne. Barely existing, he's forced to face his inner demons and the monster he once was, compelling him to vow to never drink from humans again. A simple enough task--until he crosses paths with a human who makes his fangs ache to drain her.When Snow runs into Prince Sage on a late night trip to the woods, she's torn between the urge to kill him and the desire to succumb to the feeling he stirs within her. And when Snow's life is threatened by the same evil that murdered his family, Prince Sage must enlist the aid of Snow's brothers to not only help him save her life, but to also regain his rightful place as King of the Vampires.If Sage can keep the Slayers from killing him first.For fifty years vampire prince Sageren Son of Lothar, has been in exile from his homeland and his throne. Forced to face his inner demons and the monster he once was, he vows to never drink from humans again. Which is only a mild problem until he runs into a female who makes his fangs ache to drain her.Lady Snow Gwyn is tired of staying at home to take care of her seven Vampire Slaying brothers, instead of being out with them at night, hunting for bloodsuckers. For the past two years Snow has wanted nothing more than to be out there fighting at their side. But it isn't her place.So when Snow runs into Sage on a late night trip to the woods, she's torn between the need to kill him and the desire to give in to the feeling he stirs within her. And when the unthinkable happens, Sage must enlist the aid of Snow's brothers to help him not only save her life, but to also regain his rightful place as King of the Vampires. If only he can keep them from killing him first.",
  "genres": [
    "Fantasy",
    "Vampires",
    "Romance",
    "Paranormal",
    "Fairy Tales",
    "Shapeshifters",
    "Supernatural"
  ],
  "author": "Rebekah R. Ganiere",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/23160575-snow-the-vampire-slayer"
}