{
  "title": "Operation Ivy Bells",
  "description": "Winning the Cold War is in the balance…A super-secret, off-the-books spy organization; a security-clearance starting at Top Secret and going up from there; an attack by giant squid during a thousand-foot dive while breathing an exotic gas; a cat's whisker escape from death during a three-day decompression – and that's just the first two chapters of \"Operation Ivy Bells,\" before the action really gets underway.In a fast-paced, personal narrative, J.R. \"Mac\" MacDowell details a breathtaking series of events during a super-secret intelligence gathering operation at the height of the Cold War. Riding the nuclear submarine \"Halibut,\" Mac and his saturation diving team surreptitiously enter the Soviet-controlled Sea of Okhotsk on a proof-of-concept mission. They install a tap on an underwater communications cable at 400 feet, and narrowly escape death when a storm snaps \"Halibut's\" anchor cables. They retrieve missile parts from a Soviet missile-test splash-zone, getting caught in a sonar-web set by the crafty skipper of an old Soviet diesel submarine. Mac's divers temporarily disable the sub, and \"Halibut\" escapes to Guam, dogged by the sub Skipper.Having proved the concept, they return in a \"Halibut\" outfitted with skids so she can sit on the bottom to attach a 12-thousand-pound pod to the cable for future retrieval. In the missile splash-zone, they lock in deadly underwater combat with Soviet divers. With the free world at stake, they capture one and kill the rest. \"Halibut's\" submariners and saturation divers finally return home without ever publicly revealing their crucial contribution to winning the Cold War, receiving an unpublicized Presidential Unit Citation.Blending personal experience and real-world events in a fictional wrapping, \"Operation Ivy Bells\" offers a never-before-seen glimpse of these heroic men fearlessly facing death to gather the intel that tipped the scales to win the Cold War.",
  "genres": [
    "Thriller",
    "Adventure",
    "Fiction",
    "Military Fiction",
    "Spy Thriller",
    "Mystery",
    "Espionage"
  ],
  "author": "Robert G. Williscroft",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/23160176-operation-ivy-bells"
}