{
  "title": "Another Place in Time",
  "description": "Welcome to another place in time...where one can be swept away into lands and eras long forgotten. This collection of short stories was birthed because a sworn \"I don't like historicals\" reader fell in love with what have become some of her favorite books by most of her favorite writers. Surprisingly, they were all historicals. Determined to make others feel the love, these authors were asked to contribute small tastes of how amazing historical storytelling can be. Along with a foreword written by Alex Beecroft, enjoy these original short stories that make up \"Another Place in Time\". Office Romance by Tamara AllenThe post-war economy is at a standstill, much like Foster Wetherly’s life until he’s forced to do battle with irritatingly confident—and competent—fellow ex-doughboy Casey Gladwin for a position in their shrinking department at Manhattan Security Mutual.Introducing Mr. Winterbourne by Joanna ChambersLysander Winterbourne appears to lead a charmed life. Handsome, amiable, and a renowned sportsman, he is the darling of London society. As far as Adam Freeman is concerned though, Lysander is just another spoiled aristocrat.A wealthy mill owner, Adam has no time for the frivolous world of the ton, but when his younger brother becomes engaged to Althea Winterbourne, he reluctantly agrees to be introduced to society–with the Winterbourne clan’s golden boy as his guide.Resigning himself to a few days of boredom, Adam is surprised to learn that there is much more to Lysander than his perfect surface. But will Adam have the courage to introduce Lysander Winterbourne to his own secret self?The Ruin of Gabriel Ashleigh by KJ CharlesLord Gabriel Ashleigh is a ruined man. Last night he lost everything at the card tables to his brother’s worst enemy, notorious gambler Francis Webster. Tonight, he’s going back for one more game. Ash thinks he has nothing left to lose. But Francis sets the stakes, and they’re higher than Ash could have imagined… Two Regency bucks. One game of cards. Everything to play for.Unfair in Love and War by Kaje HarperMany men lost brothers overseas in the summer of 1944. Warren Burch was one of them. For months he still clung to his big city life in Philadelphia, but finally he's made the difficult choice to return to his home town. Warren's polio-stricken leg won't let him serve, so the least he can do is be there for his mother, when brother Charlie never again will. Arriving home means a whole new life, constrained by the rhythms and prejudices of a small town. Fortunately, it's made more interesting by the mysterious and attractive young man next door.Carousel by Jordan L. HawkWhen a child goes missing, is it a simple case of a young runaway, or are more sinister forces at work?“Carousel” is part of the Whyborne & Griffin series and takes place between the events of Stormhaven and Necropolis. It can be read as a standalone.Deliverance by Aleksandr VoinovThis is a re-vamped, re-edited, improved version of \"Deliverance\". It's about William Raven, a templar, who thought he'd escaped his past. (Same character as in \"The Lion of Kent\".)",
  "genres": [
    "Historical",
    "Anthologies",
    "M M Romance",
    "Romance",
    "Historical Fiction",
    "Short Stories",
    "Historical Romance"
  ],
  "author": "Tamara Allen",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/23158673-another-place-in-time"
}