{
  "title": "Kisses After Dark",
  "description": "She’s avoided men all her life… Growing up with an abusive father, Katie Lawry learned a thing or two about men and has made a conscious choice to stay far away from them. Until the day of her brother Owen’s wedding when she’s rescued from nearly drowning by Shane McCarthy. With everyone who matters to Katie assuring her that Shane is one of the good guys, she feels safe to give in to the attraction that simmers between them. Katie has waited a long time to take a chance on love, but is Shane the right guy for her?  He’s ready to move on… More than two years after a painful divorce, Shane has a life on Gansett Island that makes sense to him. With his father, sister and beloved baby nephew living close by and a job that he enjoys, Shane is content if not entirely happy. One thing he knows for sure is he’s tired of living in the past. Spending time with sweet, sensitive, sexy Katie Lawry makes him feel hopeful again, and he might be ready to risk his heart again.  Surrounded by the Gansett Island community, Shane and Katie take an important step forward together, but is their new relationship strong enough to withstand an unexpected challenge?  Enjoy Shane and Katie’s story while catching up with some of your Gansett Island favorites in this latest book in the New York Times bestselling McCarthys of Gansett Island Series!  The McCarthys of Gansett Island Series McCarthys of Gansett Island Boxed Set Book 1: Maid for Love Book 2: Fool for Love Book 3: Ready for Love Book 4: Falling for Love Book 5: Hoping for Love Book 6: Season for Love Book 7: Longing for Love Book 8: Waiting for Love Book 9: Time for Love Book 10: Meant for Love Book 10.5: Chance for Love, A Gansett Island Novella Book 11: Gansett After Dark Book 12: Kisses After Dark",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Family",
    "Chick Lit",
    "Adult"
  ],
  "author": "Marie Force",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/23158314-kisses-after-dark"
}