{
  "title": "The Face of Any Other",
  "description": "A man without a face infects the lives of others, becoming the person he discovers to be most interesting, feasting on their flaws, peering into their peculiarities in order to fulfill their meaningless desires. The main protagonist of the novel has lost his identity in favor of, much like a genie, being able to adopt, accentuate, and adorn the identities of others. He cannot remember his past or how this condition came to be; for all he knows, he’s always been faceless and invisible, forced to watch others, reading their eyes, interpreting every facial gesture, while seeking the most interesting flaw. He is one of the people, if only the people would notice him standing there, right next to them, staring back, as if to say, “Hey, I know you…”When you have the face of any other, you see the cracks peeling apart a person’s face, showing bone, bleeding with the hidden anguish of hushed nerves. You feel each and every nerve tensing, and you feel for them—for everyone—when they buckle, unable to bear the burden of each daunting episode. When you spend all your time and energy making sure the people around you are happy, no one will question whether or not you feel the same way. No one is there to question your motivations.“The Face of Any Other bravely explores the tenuous personhood of the young and the urban, whose lives grow more ghostly the more they are particularized. Michael J Seidlinger has graced us with a quietly but unsettlingly original novel of the day-by-day slippages from alienation to asphyxiating despair.”—Gary Lutz, author of Stories in the Worst Way\"An absurdly comic cross between Kobo Abe's The Face of Another and Dostoevsky's Notes from Underground, with self-help and personality tests thrown in, The Face of Any Other is, at once, funny and terrifying, humane and startling. It's an incisive look at the doubts and fears we try to keep hidden but that instead percolate their way to the surface of our skin.\"—Brian Evenson, author of Windeye“The Face of Any Other picks up where Oblivion-era David Foster Wallace stopped and goes about fragmented and episodic narrative with the same knife Lydia Davis uses. It is chilling, manic, and strangely beautiful. It captures the OCD and ADD of our times with equal attention and paints the genuinely weird and yet post-weird consciousness of a universe I wish was less like ours.”–Porochista Khakpour, author of the novels Sons and Other Flammable Objects and The Last Illusion“Stylistically and structurally innovative, yet with clear, clean prose, Seidlinger exhibits compassion for the inner and outer anxieties, the mundane and not so mundane aspects of our human existence. Instead of using the cold detachment too often employed by young writers, in The Face of Any Other, readers are sure to discover a refreshingly, emotionally-resonant work.”–Paula Bomer, author of Inside Madeleine“The idea of a man with no face latching onto random people and swimming in their insecurities is both horrifying and a little hilarious. But the real horror, and humor, in The Face of Any Other is found in the consumer concerns, office anxieties, and daily banalities that Seidlinger exposes, skewers, and transforms into art. Seidlinger has a face—I’ve seen it!—but his novel is a mirror revealing us to ourselves.”–Lincoln Michel, author of Upright Beasts“Michael J Seidlinger is a technician of collapse. Read this book, then ask why you’ve read it. Then ask again why Seidlinger wrote it. The Face of Any Other is the cry on the page of Edvard Munch’s screaming man, a dirge not for the end of the answer but of the question itself.”—D. Foy, author of Made to Break“Told in Brautigan-length chapters through both sorrowful and eerie tones, Seidlinger’s The Face of Any Other conjures the one-hundred-and-four-year-old voice of Rilke’s Malte Laurids Brigge, who similarly grappled with identity by asserting, ‘There are quantities of human beings, but there are many more faces, for each person has several.’ Like a merry-go-round of postmodern disaster scenarios, a carnival of performance upon performance, the narrator pushes itself beyond its own breaking point. By the end, the tables turn on the reader as the narrator seems to become a mirror looking into a mirror: a haunting, seething, and beautiful mise en abyme.” —Christopher Higgs, author of The Complete Works of Marvin K. Mooney“The Face of Any Other crawls into the cracks of our dreary days and finds the strange light at the center of it all. Boredom and blankness are transfigured into something new and exciting. This is, by far, Michael J. Seidlinger’s best book yet—warm and human even as it wanders through inhospitable landscapes. Assured, mature and wonderfully creepy.”—David Connerley Nahm, author of Ancient Oceans of Central Kentucky",
  "genres": [
    "Fiction",
    "Surreal"
  ],
  "author": "Michael J. Seidlinger",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/23158318-the-face-of-any-other"
}