{
  "title": "Accidental Karma",
  "description": "Dear Author,Everyday I take the train to school. When the warning lights and signals announce the train, he’s there on the platform. I don’t know where he comes from, maybe he does the park’n ride (I’m trying to not be too stalkerish). Always gets into the same car as me, usually one seat over and across. Still in his seat when the train reaches the university’s station. He’s never there on my trip home. I’ve smiled, he just stares, not a ‘fucking fag’ stare, I think it’s a ‘who me’?Today I went to school early for a study session; I was sad to miss him, there wasn’t many people on the platform. I had my board with me, as always, and when I stopped, I heard three claps. There he was, like he was stalking me. I know he probably thinks I’m a kid, but I’m twenty-two and I’m tired of this dancing around.Photo Description: Two men:Photo 1: The first is a slim young man in ripped jeans, black T-shirt, and hoodie. He leans on a chain-link fence, fingers gripping the wire, staring out at the camera. His strong face is framed by a mass of wavy, long, blond hair.Photo 2: The second man is older, perhaps in his late-thirties, with short-cropped dark hair, and an elegant look, despite his sweatshirt and loose, casual jacket. He’s turned to his right, smiling slightly.This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Short Stories",
    "College",
    "Gay",
    "Erotica"
  ],
  "author": "Katies Crewman",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/23162022-accidental-karma"
}