{
  "title": "Diablo Archive",
  "description": "Since the beginning of time, the angelic hosts of the High Heavens and the demonic hordes of the Burning Hells have been locked in a struggle for the fate of all Creation. That war has now come to the mortal realm...and neither Man nor Demon nor Angel will be left unscathed.... LEGACY OF BLOOD: Norrec Vizharan has become a living nightmare. While on a quest for magical treasure, he discovers an artifact beyond his wildest dreams: the ancient armor of Bartuc, the legendary Warrior of Blood. But the mysterious armor is cursed, channeling a malevolent power into Norrec's tortured soul. Pursued by demons who covet the dark armor for their own purposes, Norrec must overcome a bloodlust he can scarcely control and learn the truth about his terrifying curse before he is lost to darkness forever. THE BLACK ROAD: Darrick Lang is coming home. Years ago he left the town of Bramwell to walk the wide world as a champion of the realm. But Bramwell is not as he left it. Something dark and terrifying has ensnared the townsfolk, something very old and very patient, tangling innocents in a web of malice and profaning the very earth itself. Now that same power calls to Darrick...and his only hope may be to walk the same perilous path of damnation. THE KINGDOM OF SHADOW: Legend speaks of a long-dead city known as Ureh, thought by many to have been a gateway to the High Heavens. It is said that every two thousand years, Ureh is reborn -- and all its lost riches are revealed to those brave enough to seek them out. Now the Vizjerai sorcerer Quov Tsin has come to witness Ureh's rebirth for himself with Kentril Dumon and his band of mercenaries in tow. But what awaits them is like nothing they imagined. DEMONSBANE: What was to have been a victorious last stand against a demonic invasion of Blackmarch has instead become a massacre. Only Siggard remains, a warrior unable to remember the final hours of the battle. As he hunts the demon lord who butchered everything dear to him, Siggard pieces together the truth of that terrible battle...and finds that his nightmare is only beginning.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Gaming",
    "Games"
  ],
  "author": "Richard A. Knaak",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/2316346.Diablo_Archive"
}