{
  "title": "Ruin Series Boxed Set",
  "description": "For a limited time get the first two books+the bonus epilogue in the NYT bestselling stand alone Ruin series. Special price only until the third book in the series releases October 6RUINI'm not your typical girl. I've been running away from the memories that haunt me for so long that depression has become my only comfort. I was content in the darkness... until Wes Michels offered to be my light.I didn't know that time wasn't my ally -- that every second that ticked past was one step closer to the end of something that was beginning to mean the end of myself. He tried to warn me. He promised me all he was able to offer -- each moment as it came -- but it would never be enough.Sometimes when you think it's the end, it's only the beginning. Wes thought he could save me, but in giving me everything, he ruined me. Because after one kiss, one touch, I couldn't -- I wouldn't ever be the same.And from that moment on, his heartbeat became my own.ToxicEveryone has a secret...Gabe Hyde is on borrowed time. He's been hiding his identity for over four years-hidden from the world that used to adore him -- obsess over him -- driven to the edge of insanity by one poor choice.But that one choice, altered the course of his life forever.Pretending isn't all it's cracked up to be, especially when pretending means hiding your real self from the people that care about you the most. But if anyone ever discovered the truth it wouldn't just be his life at risk--but hers.Saylor doesn't hate men.Just Gabe.Only Gabe.He's a reckless, happy-go-lucky, silver spoon fed pain in her ass. Everything about him makes her more and more confused. Unfortunately, they both donate time at the same Group Home. If she wasn't afraid of flunking, she'd be long gone. She hates that she's attracted to him almost as much as he hates that he's attracted to her -- and she can tell, especially since their first encounter ended up making her knees so weak she couldn't form coherent sentences for weeks afterwards. But the closer she gets to him, the more confused she becomes. He isn't who he says he is, and he's hiding something big.What happen when two worlds collide? Two worlds that never should have met in the first place? Some secrets are too big to be hidden forever--the only question? Will his destroy everyone he loves? Or finally bring about the redemption he's been craving for the past four years?Everyone has a secret... What's yours?Extended Epilogue FearlessWhen I met Kiersten, time stood still. It was as if every cell in my body screamed HER. I couldn't look away, I couldn't walk away, I couldn't even move. My other half, my soul mate, was staring right at me. I had to have her. I had to make her mine. But I felt selfish doing that -- knowing that I may not have endless amounts of time to give her... and even now that every things' over with and I've been given that time back.Nothing is ever certain in this life.Which is why I'm about to do something crazy, impulsive, daring.After all, what type of person would I be if I didn't take my own advice?I'm jumping off the cliff, I'm living fearlessly.This is the continuation of Wes and Kierstens story.",
  "genres": [
    "New Adult",
    "Contemporary Romance",
    "Romance",
    "College"
  ],
  "author": "Rachel Van Dyken",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/23161489-ruin-series-boxed-set"
}