{
  "title": "Zero Day / Infected / Destroyer",
  "description": "Librarian's note: There is an Alternate Cover Edition for this edition of this book here.\nSurvive the infection! Survive the Infected!\n  Book 1 A new flu strain has been spreading across Africa, Europe, and Asia. Disturbing news footage is flooding the cable news channels. People are worried and frightened.  But Zed Zane is oblivious. He needs to borrow rent money from his parents. He gets up Sunday morning, drinks enough tequila to stifle his pride and heads to his mom’s house for a lunch of begging, again.  But something is wrong. There’s blood in the foyer. His mother’s corpse is on the living room floor. Zed’s stepdad, Dan is wild with crazy-eyed violence and attacks Zed when he comes into the house. They struggle into the kitchen. Dan’s yellow teeth tear at Zed’s arm but he grabs a knife and stabs Dan, thirty-seven times, or so the police later say.  With infection burning in his blood, Zed is arrested for murder but the world is falling apart and he soon finds himself back on the street, fighting for his life among the infected who would kill him and the normal people, who fear him.  Book 2 Slow Burn: Infected picks up the story of Zed, Murphy, and Jerome where Slow Burn: Zero Day ended.  All three have been infected but have not succumbed to the most pernicious symptoms of the virus. Nevertheless, their band of fearful survivors, have ostracized them.  Back on the street, with weapons to defend themselves but little food in their packs, they embark on a search for Murphy’s family while following a rumor of safe haven in the form of a doomsday bunker in east Austin.  But the world is more hazardous than they know. They expect violence from the voracious infected but they have harsh lessons to learn about the uninfected. And humans to support the infrastructure of modern civilization, they find that danger comes in many forms.  Book 3 Zed is saying goodbye to one friend and pressing forward with two new ones, Mandi, whom Zed and Murphy rescued from the bunker, is immune to the virus, and Russell, also a slow burn, but lower-functioning, childlike and docile.  After seeing the carnage at the dormitory, a raging, vengeful Zed wants only to kill Mark, his nemesis and the former leader of the ROTC squad. Since Mark has disappeared, Zed unleashes his fury on untold numbers of infected in his path as he makes his way back to the hospital, in an attempt to rescue Steph, a nurse whom he befriended while seeking help for the feverish Murphy shortly after the prison riot. But the brave medical staff, holed up on the tenth floor of the hospital, and running out of provisions, has decided to take matters in hand by exposing themselves to the virus, and shooting those who “turn.” Zed is determined not to face another loss, but time is running out.  The Slow Burn Series Book 1 – Slow Burn: Zero Day Book 2 – Slow Burn: Infected Book 3 & 4 - Box Set Slow Burn: Destroyer & Dead Fire Book 3 – Slow Burn: Destroyer Book 4 - Slow Burn: Dead Fire Book 5 - Slow Burn: Torrent",
  "genres": [
    "Horror",
    "Zombies",
    "Post Apocalyptic",
    "Fiction",
    "Science Fiction",
    "Amazon",
    "Fantasy"
  ],
  "author": "Bobby Adair",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/23162703-zero-day-infected-destroyer"
}