{
  "title": "Phoenix",
  "description": "*** Phoenix is the sequel to Spider Web. It is a Forbidden Love novel from the Boston Clan. It contains graphic violence, mature language, explicit sex and other adult themes. Recommended for ages 18+ ** From the Author: I have been asked many times if Phoenix would ever get his own story. He made appearances in Out of the Dark and Into the Divine. He has always been one of my favorite characters. I only hope that I have done him justice in his own book. The beginning of this book is a recap of Spider Web so that anyone who has not read Spider Web isn't lost. (Just wanted you to be prepared) It is my hope that you will love Phoenix as much as I do. He is as old as time. He is fire. He is healing. He is the symbol for new life and for new beginnings. He is powerful. Invincible. He is myth and he is legend, and He is real. He is Phoenix. Phoenix had lived for as long as man had walked the earth. He had seen his fair share of love and war and had been through every hardship that mankind had ever experienced. He lived in legends and myths, never truly opening himself up to anyone–until he met up with the Boston Vampire Clan. Together, they stopped an evil from enslaving mankind and in the process, Phoenix finally found a place he could call home. He had grown to accept the fact that he would never find a mate for himself in any species. Until he saw her. Kelly was the daughter of his best friend's wife. When he met her, feelings he never thought possible began to form within him and a fierce urge to protect her at all costs became his only mission in life. As the Dark Alliance sets up for their final attack, Phoenix isn't willing to sacrifice the lives of innocent people to win the battle. But when Kelly is put in danger, he will sacrifice all of mankind to save her.",
  "genres": [
    "Paranormal",
    "Romance",
    "Fantasy",
    "Supernatural",
    "Paranormal Romance"
  ],
  "author": "Danielle James",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/23163883-phoenix"
}