{
  "title": "The Immortal Rapture Collection",
  "description": "This exciting collection includes the first three paranormal romance novels in the Immortal Rapture Arielle Immortal Awakening, Arielle Immortal Seduction, and Arielle Immortal Passion.Arielle Immortal AwakeningA mortal soul…From the time college co-ed Arielle Lloyd had been young, she had been able to hear the thoughts and feel the pain of certain others, and those she comes to think of as her special group. One friend’s dabbling with spells and magic showed her the power of love that can endure beyond the grave. But another friend’s terrifying encounter with a warlock left Arielle wary of those who claim otherworldly powers. On holiday in the south of France, a chance encounter could change her mind. Or could cost her life.An Immortal man…Sebastian Gaulle is the wealthy, handsome owner of an international company. He is also an Immortal. For five centuries he has sought the one soul who can fulfill his dreams of everlasting love. Then he meets Arielle, whose heart calls out to him like no other.A timeless love…Sebastian has made his choice clear. But jealous Immortals from his past threaten retaliation. They have vowed to destroy any woman who becomes involved with him. In spite of the powerful protection amulet Sebastian gives Arielle, death stalks their newfound love. Their love may be eternal, but they may be running out of time.Arielle Immortal SeductionA time of waiting...Arielle Lloyd has found the love of her life, but his business as the owner of an international company calls him away. She longs for Sebastian, but stays busy with school, and finds comfort in spending time with her best friends, Gabby and Eva. It is during Sebastian's absence that a stranger enters Arielle's life at the university and threatens to shatter her joy with a vicious assault.A time of renewal...The return of Sebastian Gaulle, Arielle's Immortal love, brings a return of joy. Her terrifying experience has her rethinking her vow of remaining chaste until marriage. Arielle already knows Sebastian is the one man she will love for eternity. Sebastian has longed for Arielle, like no other. He has carried a ring in his pocket for her almost from the first moment they met. He's only waiting for the right moment to pledge his eternal love for her.A time of danger...But Sebastian's past still threatens their future. A trio of jealous Immortal women has vowed Sebastian will belong to no other woman for centuries to come. Arielle, Sebastian, and their friends must join together to fight off the Immortals bent on utter destruction, if they are ever to find their eternal happiness.Arielle Immortal PassionAn interlude in paradise…St. Jean De Luz, in the south of France, is the setting of one of Sebastian Gaulle’s family estates. It is to this gorgeous place that the Immortal takes his love, Arielle Lloyd, and her friends, to relax and spend a holiday exploring the surroundings and learning about his family’s history.A snake in the garden…There is no safety in this paradise, however, as Sebastian’s past continues to haunt him. The Immortal Annabel still lusts for vengeance and seeks to destroy Sebastian’s new love. While exploring, Arielle’s life is endangered when she discovers dangerous dark places and hidden strangers occupying the house.Evil that will not die…Trapped, threatened, and nearing her last breath, Arielle must call on the powerful magic of her friend, Eva, for help. Sebastian must rally his Immortal friends and family to protect his love and expel the evil before his coveted paradise is forever lost.",
  "genres": [],
  "author": "Lilian Roberts",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/23161526-the-immortal-rapture-collection"
}