{
  "title": "Reagan: The Life",
  "description": "From master storyteller and New York Times bestselling Historian H. W. Brands comes the definitive biography of a visionary and transformative president In his magisterial new biography, H. W. Brands brilliantly establishes Ronald Reagan as one of the two great presidents of the twentieth century, a true peer to Franklin Roosevelt. Reagan conveys with sweep and vigor how the confident force of Reagan’s personality and the unwavering nature of his beliefs enabled him to engineer a conservative revolution in American politics and play a crucial role in ending communism in the Soviet Union. Reagan shut down the age of liberalism, Brands shows, and ushered in the age of Reagan, whose defining principles are still powerfully felt today.Reagan follows young Ronald Reagan as his ambition for ever larger stages compelled him to leave behind small-town Illinois to become first a radio announcer and then that quintessential public figure of modern America, a movie star. When his acting career stalled, his reinvention as the voice of The General Electric Theater on television made him an unlikely spokesman for corporate America. Then began Reagan’s improbable political ascension, starting in the 1960s, when he was first elected governor of California, and culminating in his election in 1980 as president of the United States.Employing archival sources not available to previous biographers and drawing on dozens of interviews with surviving members of Reagan’s administration, Brands has crafted a richly detailed and fascinating narrative of the presidential years. He offers new insights into Reagan’s remote management style and fractious West Wing staff, his deft handling of public sentiment to transform the tax code, and his deeply misunderstood relationship with Soviet leader Mikhail Gorbachev, on which nothing less than the fate of the world turned. Reagan is a storytelling triumph, an irresistible portrait of an underestimated politician whose pragmatic leadership and steadfast vision transformed the nation.",
  "genres": [
    "Biography",
    "History",
    "Presidents",
    "Nonfiction",
    "Politics",
    "American History",
    "Us Presidents"
  ],
  "author": "H.W. Brands",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/23164920-reagan"
}