{
  "title": "The Theft of Memory: Losing My father, One Day at a Time",
  "description": "House author Jonathan Kozol's deeply personal biography of his father, a brilliant neurologist who suffered from Alzheimer's.There are few writers of conscience who write as beautifully as Jonathan Kozol. Departing from the South Bronx and turning his sensitive eye to his own life and legacy, The Theft of Memory is Kozol's most personal book to date, as it explores the life of his father, Harry. Dr. Harry L. Kozol was a nationally-renowned neurologist whose work helped establish the emerging fields of forensic psychiatry and neuropsychiatry. He was a remarkable clinician with unusual capacity to diagnose and identify neurological and psychotic illnesses in highly complicated and sophisticated people, including well-known artists, writers, and intellectuals. Notably, in Eugene O'Neill's last years, the playwright moved to Boston so that he could live close to Kozol's father's office.In addition to his successful private practice in Boston, Kozol operated in a grim arena marked by extreme violence. But while his role as a forensic expert placed him in the public eye for high-profile criminal defendants such as Albert DeSalvo (the Boston Strangler) and Patty Hearst, he was--as his son articulates--\"a healer of tormented people, not their judge, not their interrogator.\"With the same lyricism and clarity that have defined Kozol's acclaimed work on education for decades,The Theft of Memory intimately describes Harry's vibrant life, the challenges following his self-diagnosis of Alzheimer's, and the evolution of their relationship throughout.This unique biography will have a long shelf life as a moving portrait of an extraordinary man, a window into the heart of one of our nation's foremost education activists, and a frank examination of how we come to terms with caregiving.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography Memoir",
    "Biography",
    "Medical",
    "Health",
    "Audiobook"
  ],
  "author": "Jonathan Kozol",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/23164945-the-theft-of-memory"
}