{
  "title": "Life in a Jar: The Irena Sendler Project",
  "description": "During World War II, Irena Sendler, a Polish Catholic social worker, organized a rescue network of fellow social workers to save 2,500 Jewish children from certain death in the Warsaw ghetto. Incredibly, after the war her heroism, like that of many others, was suppressed by communist Poland and remained virtually unknown for 60 years. Unknown, that is, until three high school girls from an economically depressed, rural school district in southeast Kansas stumbled upon a tantalizing reference to Sendler's rescues, which they fashioned into a history project, a play they called Life in a Jar. Their innocent drama was first seen in Kansas, then the Midwest, then New York, Los Angeles, Montreal, and finally Poland, where they elevated Irena Sendler to a national hero, championing her legacy of tolerance and respect for all people. Life in a Jar: The Irena Sendler Project is a Holocaust history and more. It is the inspirational story of Protestant students from Kansas, each carrying her own painful burden, each called in her own complex way to the history of a Catholic woman who knocked on Jewish doors in the Warsaw ghetto and, in Sendler's own words, \"tried to talk the mothers out of their children.\" Inspired by Irena Sendler, they are living examples of the power of one person to change the world and models for young people everywhere.*****60% of the sales of this book are donated to the Irena Sendler/Life in a Jar Foundation. The foundation promotes Irena Sendler's legacy and encourages educators and students to emulate the project by focusing on unsung heroes in history to teach respect and understanding among all people, regardless of race, religion, or creed.",
  "genres": [
    "Nonfiction",
    "History",
    "Book Club",
    "Biography",
    "Holocaust",
    "World War II",
    "Historical"
  ],
  "author": "Jack Mayer",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/11387491-life-in-a-jar"
}