{
  "title": "The Afflictions",
  "description": "Shadowing an elderly librarian on his first day at the great Central Library, Máximo is thrilled to get a peek at the exclusive Encyclopedia of Medicine. It's a dizzying collection of maladies: an amnesia that causes everyone you've ever met to forget you exist, while you remain perfectly, painfully aware of your history. A wound that grows with each dark thought or evil deed you commit but shrinks with every act of kindness. A disease that causes your body to imitate death, stopping your heart, cooling your blood. Will the fit pass before they bury you-or after?As Máximo soon discovers, medicine at the Central Library may be more than he bargained for.The Afflictions is a magical compendium of pseudo-diseases, an encyclopedia of archaic medicine written by a contemporary physician and scientist. Little by little, these bizarre and mystical afflictions frame an eternal struggle: between human desire and the limits of bodily existence.Reviews:\"Paralkar...sketches these mythical misfortunes in brief, elegant entries written as if by a physician-philosopher, setting out the preposterous specifics of symptoms, diagnoses and treatments beside mock scholarly debates over etiology and final ruminations on existential import...Paralkar's tragicomic imagination, sly sendup of pseudo-Latinate medical prose and fine sense of irony make for an arresting read. A haunting take on the ills of flesh and soul.\" - Kirkus\"...Paralkar shares with Borges a collector's delight in details. One can practically feel Paralkar luxuriating in the task... The Afflictions returns us to the idea of the essential interconnectedness of mind and body, that our faculties of memory, of language, of morality, of love, are no less real and necessary to survival than the organs of the heart or kidney or lungs.\" - The Believer\"We are constantly invited to ponder the enormity of human experience and the sensation of transcendence, while acknowledging that the physical material from which we are made--and from which we both suffer and rejoice--cannot be severed from our sense of self... The Afflictions is a partnership between author and audience, which takes on a life of its own in spite of and because of disease's closest intimate: death.\" - Tweed's Magazine of Literature and Art\"The imagined text on which The Afflictions is based - the Encyclopedia Medicinae - is written as though it were lifted directly out of the Age of Enlightenment, when science and religion were still easy bedfellows.\" - The Pulse, WHYY/NPR Radio",
  "genres": [
    "Fiction",
    "Fantasy",
    "Speculative Fiction",
    "Horror",
    "Medicine",
    "Science Fiction Fantasy",
    "Science Fiction"
  ],
  "author": "Vikram Paralkar",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/23167150-the-afflictions"
}