{
  "title": "My Highland Lover",
  "description": "Maeve Greyson unleashes a thrilling tale of magic and desire as a feisty Southern gal falls into the arms of a rough-hewn Highland chieftain.  As the proprietor of a homeopathic store in rural Kentucky, Trulie Sinclair knows that her neighbors think she’s strange—but they have no idea how strange she really is. Trulie was born in Scotland in the thirteenth century to a line of time-traveling Highlanders. When Trulie’s grandmother convinces her to return to their homeland, Trulie jumps back in time, right onto the powerful chest of Gray MacKenna. Just as his steely good looks send ripples through her body, their fierce attraction will send ripples through the ages.   After his parents are murdered, Gray is consumed by thoughts of revenge. As the new chieftain of the MacKenna clan, he has reason to believe that there’s a traitor in his midst, and nothing—not even the bonny lass who suddenly drops from the sky—can distract him from his single-minded pursuit of the culprit. But when Gray learns that this sassy beauty possesses gifts beyond the sparkle in her eye, he allows his gaze, and his heart, to linger. While he hunts for the murderer, Gray finds in Trulie a precious companion—and a timeless love.Praise for My Highland Lover\n \n“One of those books that stay in your mind long after you have finished reading it . . . I cannot wait for the next installment.”—Fresh Fiction“Maeve Greyson surprises and enchants. The imaginative storytelling is hard to resist in this time-traveling tale of love, betrayal, and sacrifice.”—Victoria Roberts, bestselling author of My Highland Spy  “Allow Maeve Grayson to take you on a magic carpet ride from present-day Kentucky to the Highlands of the thirteenth century. My Highland Lover is a sensual story of desire, danger, and devilment woven with the strongest thread of love.”—Vonnie Davis, author of the Highlander’s Beloved series“From the wow opening to the ahh ending, My Highland Lover is a winner, a brilliant blend of historical and contemporary romance. Maeve Greyson writes with humor, heart and heat. She’s an author to keep an eye out for!”—Kelly Moran, award-winning author of Return to Me  “A heady, mystical mixture of modern wit and romantic historical charm.”—Award-winning author Mackenzie Crowne“This was a fun, emotional and intriguing story that held my rapt attention. Can’t go wrong with this book!”—Kilts and Words  “A very well written Highland romance . . . There was something here for a lot of different kinds of readers. Mystery, romance, paranormal elements, Greyson gives us all of them and more, even a little bit of humor coming from the matchmaking efforts of Granny and her friends.”—Debbie’s Book Bag  “A great new series for the talented Maeve Greyson . . . If you’re like me, a fan of historical romance and paranormal romance, My Highland Lover is the perfect book for you! Can’t wait to read the next one!”—Proserpine Craving Books  “If you enjoy a little time travel, humor, and paranormal elements in your historical romance, you will enjoy this book.”—Romance with a Book“I loved this book and I can’t wait for the next one.”—A Crazy Vermonter’s Book ReviewsIncludes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "Time Travel",
    "Historical Romance",
    "Romance",
    "Historical",
    "Paranormal Romance",
    "Historical Fiction",
    "Fantasy"
  ],
  "author": "Maeve Greyson",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/23167115-my-highland-lover"
}