{
  "title": "Vampire Princess Bride",
  "description": "As the daughter of the Vampire King and the heir to the Blood Throne, it is Bianca Morvant's duty to marry and carry on the royal family line. The duty is tradition, and since the last uprising, more important than ever before - or so her parents keep telling her. But to Bianca, marriage only means one thing: being forced to choose between her two lovers. Aspen has noble blood, a kind heart, and a gentle touch that she has grown to love. Dorian comes from the lowest of Sanguini Houses, inspires fear in nearly everyone he meets, and does whatever it takes to rouse her most carnal desires. With a very public bedding ceremony set to take place before all of the Sanguini, Bianca is expected to choose just one consort to share her kingdom and her bed. The problem is that Bianca loves both of her men equally, and for different reasons. Neither Aspen nor Dorian wants to let her go, and both are determined to vie for her affections the night before the ceremony--in very different ways. Bianca invites them into her bed, knowing that this night is the last that she will spend with one of them. But as usual, each one pleases a different side of her, and she finds herself more torn than ever before. Content Warning: This novella is a non-nonsense hot read and with explicit language and material from start to finish. Although it is a romantic erotica story, the heat rating is as high as it gets. For readers 18+ only! Themes Explored in Vampire Princess Bride: Exhibitionism, voyeurism, public consummation, bondage, spanking, submission, domination, scopophilia, hematolagnia, polyamory, and much more. Book Extras: Sneak peeks and excerpts from Menage Maid Service (Menage Maids Series) and Lolly Learns a Lesson (Classroom Kink Series) Series Note: Vampire Princess Bride is a short novella. It is the first book in the Sanguine Erotica series and meant to serve as an introduction to Bianca Morvant and the world of Sanguine Erotica.",
  "genres": [
    "Vampires",
    "Erotica",
    "Paranormal Romance"
  ],
  "author": "Cara Cane",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/23165230-vampire-princess-bride"
}