{
  "title": "Terry:: My Daughter's Life-and-Death Struggle with Alcoholism",
  "description": "NATIONAL BESTSELLER  • “Raw and riveting . . . A compassionate reminder that every alcoholic was once somebody’s baby.”— USA TodayJust before Christmas 1994 Terry McGovern was found frozen to death in a snowbank in Madison, Wisconsin, where she had stumbled out of a bar and fallen asleep in the cold. Just forty-five years old, she had been an alcoholic most of her life. Now, in this harrowing and intimate reminiscence, her father, former Senator George McGovern, examines her diaries, interviews her friends and doctors, sifts through medical records, and searches for the lovely but fragile young woman who had waged a desperate, lifelong battle with her illness.What emerges is the portrait of a woman who was loved by everyone but herself. Surrounded by devoted parents, caring siblings, and two young daughters of her own, Terry maintained an appearance of control but was haunted by the twin demons of alcohol and depression. Her story is a heartbreaking tale of her attempts at sobriety, the McGovern family’s efforts to help her—and the failure of both. With courage and compassion, George McGovern addresses a private tragedy with an honesty rarely achieved by a public figure, looking candidly at his inability to save his child. A primer for other families who live with addiction, McGovern’s book is filled with wisdom and an understanding that can come only from sharing his tremendous loss with others.Praise for Terry“Harrowing, riveting . . . A family drama of love and loss.” — The New York Times Book Review“An agonized cry from the heart . . . McGovern’s abiding love for his daughter, and his anguish at the thought of failing her, scorch these pages.” — Newsweek“Haunting . . . speaks for all families engaged in the private struggles of addiction.” — Washington Post“The loving chronicle of a daughter who lost her life and a father who could not keep her alive . . . a simple, moving story that would touch the heart of any parent.” — Houston Chronicle",
  "genres": [
    "Memoir",
    "Biography",
    "Nonfiction",
    "Mental Health",
    "Biography Memoir"
  ],
  "author": "George S. McGovern",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/2316636.Terry"
}