{
  "title": "Up Till Now",
  "description": "“It is now Bill Shatner’s universe---we just live in it.”---New York Daily News\nAfter almost sixty years as an actor, William Shatner has become one of the most beloved entertainers in the world. And it seems as if Shatner is everywhere. Winning an Emmy for his role on Boston Legal. Doing commercials for Priceline.com. In the movie theaters. Singing with Ben Folds. He’s sitting next to Jay Leno and Jimmy Kimmel, and he’s practically a regular on Howard Stern’s show. He was recently honored with election to the Academy of Television Arts & Sciences Hall of Fame. He was a target on a Comedy Central’s Celebrity Roast entitled “The Shat Hits the Fan.” In Up Till Now, Shatner sits down with readers and offers the remarkable, full story of his life and explains how he got to be, well, everywhere. \nIt was the original Star Trek series, and later its films, that made Shatner instantly recognizable, called by name---or at least by Captain Kirk’s name---across the globe. But Shatner neither began nor has ended his career with that role. From the very start, he took his skills as an actor and put them to use wherever he could. He straddled the classic world of the theater and the new world of television, whether stepping in for Christopher Plummer in Shakespeare’s Henry V or staring at “something on the wing” in a classic episode of The Twilight Zone. And since then, he’s gone on to star in numerous successful shows, such as T.J. Hooker, Rescue 911, and most recently Boston Legal. \nWilliam Shatner has always been willing to take risks for his art. What other actor would star in history’s first---and probably only---all-Esperanto-language film? Who else would share the screen with thousands of tarantulas, release an album called Has Been, or film a racially incendiary film in the Deep South during the height of the civil rights era? And who else would willingly paramotor into a field of waiting fans armed with paintball guns, all waiting for a chance to stun Captain…er, Shatner?\nIn this touching and very funny autobiography, William Shatner reveals the man behind these unforgettable moments, and how he’s become the worldwide star and experienced actor he is today.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Autobiography",
    "Star Trek",
    "Memoir",
    "Audiobook",
    "Humor"
  ],
  "author": "William Shatner",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/2316748.Up_Till_Now"
}