{
  "title": "Under the Influence",
  "description": "USA Today Bestselling Novel.\"I have always belonged to you. I will always belong to you. Regardless of what you've done, what you do, or what you will do, I will forever be yours. And that's my choice to make, whether you choose me or not.\"By the age of thirteen, Dalton Greer had already experienced abuse unfathomable to most. So by the time he was finally rescued from the latest of his long string of foster homes, he was already traveling down a very dangerous path. Indebted to a known drug lord as a means of protection, he chose the life of the streets thinking that's all his life had to offer...until he met her. Five years later, she's the only bright spot in his very bleak existence. There isn't anything he won't do to shield her from the evil he's experienced and he wants nothing more than to protect her from the life he's chosen, as well as from himself. The day Spencer Locke found Dalton sitting on her porch, she felt his pain and understood his rage. They were bonded by both, though he would never know understand why. He had been lost while she was found, and in that moment, she vowed to help him find his way too. As the years pass by, that initial bond forms into something deeper. Spencer loves Dalton regardless of his past, in spite of his choices. And when all secrets are unleashed between the two, that love becomes binding. One night is all they have before fate makes its own decision. Dalton is forced to choose the path he will travel, and Spencer is left unknowing as to why.  A journey about the discovery of true friendship as it blossoms into first love, the experience of crucial sacrifice and ultimate betrayal, and endurance of agonizing heartbreak on the way to finding lasting redemption, two lost souls find solace...  Under the Influence of love. *******NA Contemporary Romance that can be read as a STANDALONE***********Due to themes of child abuse, domestic violence, sexual situations and explicit language, recommended for readers 17+*****",
  "genres": [
    "New Adult",
    "Romance",
    "Friends To Lovers",
    "Contemporary",
    "Abuse",
    "Contemporary Romance",
    "Second Chance Romance"
  ],
  "author": "L.B. Simmons",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/23165655-under-the-influence"
}