{
  "title": "Up Till Now: The Autobiography",
  "description": "This is the story of William Shatner's half-century career and private life. The audio will take readers from the streets of Montreal to regional theatre, where Shatner was once called upon to replace Christopher Plummer as Henry V-- in a role he had never rehearsed, with actors he had never met. It will describe his early TV work and movies, among them Roger Corman's The Intruder, a movie about racism filmed in the south in 1961; Kingdom of the Spiders, in which he costarred with 30,000 tarantulas; and Incubus, the only film ever made in the language of Esperanto.It will include his private life, including the complete story of the drowning death of his third wife. It will include stories from three other series, T.J. Hooker, Rescue 911--which saved more than 240 lives--and Boston Legal, as well as his work on Third Rock from the Sun, for which he won his first Emmy for playing \"the Big Giant Head.\"And of course, it will include the story of Star Trek; how it came about and how it affected him--and fans--concluding with the story of a taxi driver who told Shatner he'd been a prisoner in Vietnam and that pretending they were the Star Trek crew kept him and his fellow inmates sane. And yes, it will include his singing and commercials and quiz show hosting and award show hosting and the greatest practical joke ever played, Invasion, Iowa, not to mention the story about Shatner being invited into a cage with Koko the Gorilla--who wanted to take him back to her bedcage.After almost 60 years, William Shatner has become one of our most beloved entertainers. And as evidenced by Comedy Central's roast, \"The Shat Hits the Fan,\" Shatner gets the joke. For the first time, William Shatner shares with listeners the remarkable, full story of his life.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Autobiography",
    "Star Trek",
    "Memoir",
    "Audiobook",
    "Humor"
  ],
  "author": "William Shatner",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/2316750.Up_Till_Now"
}