{
  "title": "Tocqueville: A Biography",
  "description": "\" A Biography is a book of considerable importance, primarily because of its comprehensive treatment of both Tocqueville's public life and his private life--including many details necessarily absent from the two previous biographical essays.\"--John Lukacs, The New Yorker In this first major biography of the author of Democracy in America , André Jardin traces Alexis de Tocqueville's eventful life from his birth in 1805 to aristocratic parents in post-revolutionary France, through his trip to antebellum America as a young man, his adventures in Algeria, and his political career in France's Second Republic, to his return to writing and the publication of his other classic work L'Ancien régime et la révolution in 1856. Jardin also offers an illuminating critical analysis of Democracy in America , arguing that the concerns for just government that inform this famous work dominated Tocqueville's thought throughout his life. \"His scholarship is meticulous, his judgment careful and fair, his style plain and clear... Jardin has put all students of Tocqueville deep in his debt... More than any of his contemporaries--more than Marx, more than Mill, much more than Mazzini, Comte or Proudhon--[Tocqueville] is the man for the late twentieth century. It is the triumph of André Jardin's biography that it shows so clearly how this is so.\"--Hugh Brogan, Times Literary Supplement \"Mr. Jardin is the complete master of his subject. His portrait of the writer is lucid and well composed, his comments are penetrating, and he draws on a wide range of unfamiliar material... Mr. Jardin is telling a story that has been told many times before. But he manages to recapture much of its original freshness, and he makes effective use, as elsewhere, of previously unpublished documents.\"--John Gross, New York Times \"Jardin gives us a concise and balanced account of Tocqueville's public positions and passions. He does this with economy, grace, thoroughness, and reliability.\"--George Armstrong Kelly, New Republic",
  "genres": [
    "Biography",
    "American History",
    "History",
    "France",
    "European History"
  ],
  "author": "André Jardin",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/113878.Tocqueville"
}