{
  "title": "Randy's Ghost",
  "description": "Dear Author,[Photo 1] This is Randy, a 28 year old researcher. Ever since his car accident a month ago, he’s felt completely lost. Wrong. He swears a puzzle piece from his soul is gone, but he can’t explain it. He looks around his home and knows, down to his bones, that something is off. He can’t sleep because of nameless nightmares and when he does finally sleep, he wakes up in the morning reaching for something that isn’t there. That was never there. He knows he’s losing it when just looking at the framed pictures in his apartment or knick-knacks that have no meaning, creates an unexplained anger. He wants to throw them across the room— destroy them. But only certain pictures, certain items. His anger makes no sense. Nothing makes sense anymore. His friends start to worry about him and think he needs to get out. Maybe meet someone. After all, he hadn’t even gone out on a date in well over a year.[Photo 2] This is Chilton. He works for a med-tech agency from the future. When he was assigned the case to go back in time to obtain the info they needed (some data not recorded because it wasn’t relevant in our time, but will be then: Ex. Experimental drugs for chicken pox, common cold, etc.) it was a simple task. Randy was researched and found to be the best person to infiltrate because he had access to the lab and it would cause the least ripple effect. After living with Randy for a year, it wasn’t so simple anymore. With his assignment completed, Chilton had no choice but to return to his own time, and to wash Randy’s and everyone else’s memory of him before leaving. Even his image was deleted from their pictures. But months after Chilton’s return, the pain of leaving Randy behind is still with him. He’d loved before, but not like this. When an unexplained ripple is found, he must return and welcomes the chance to see Randy again, even if Randy can’t remember him. He thinks if he sees Randy has moved on with a good life, he’ll be able to move on too. So he goes back years (years in our time, not his) after he’s left. What he didn’t expect was to find that Randy had never moved on— with or without the memory of the time they shared— or that Randy’s life is in a shambles it was never meant to be in. But, especially, the extreme pain of loss in Randy’s eyes.All Chilton knows or cares about is fixing it. But how?Photo Description: There are two photos to go with this prompt. The first photo is of a fit, young, shirtless man, with disheveled blond hair. He sitting, hugging his knees, with his eyes closed and eyebrows slightly drawn. Clearly, he has lost something or someone. He himself seems lost. The second photo is a man in a crisp dress shirt with dark hair and eyes. There is a sadness to him as well, as if he is waiting for someone that isn’t coming.This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Science Fiction",
    "Romance",
    "Time Travel",
    "Fantasy",
    "Short Stories",
    "LGBT"
  ],
  "author": "William W. Tate",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/23168463-randy-s-ghost"
}