{
  "title": "Last of the Red-Hot Riders",
  "description": "The toughest rodeo rider in Hell, Texas, discovers his tender side with a feisty cowgirl in this sexy new novel from USA Today bestselling author Tina Leonard.   Cameron Dix knows that becoming an elite rider is the first step to realizing her dream: owning a special-needs equestrian academy. Only one thing stands in her way—and he’s big, tall, and sizzles like a Texas steak. Superhunk Saint Markham claims that he isn’t happy about all the women galloping into town, but the heat in his eyes tells Cameron a different story. What else can a fiery redhead do but let her hair down and give in to desire hot enough to melt her saddle?   Saint has seen what happens when women come marching into the Hell’s Outlaws Training Center: Strong men crumble. Problem is, he’s got rivals willing to train a talented lady rider like Cameron. But after one night of passion, he’s branded. And from the moment he kisses her ruby lips, Cameron is his—even if he’s too stubborn to admit it. Now Saint must stake his claim on a life of delicious sin with the woman he loves.  Praise for Last of the Red-Hot Cowboys\n \n “If you like your cowboys smokin’ and your cowgirls sassy, you’ll love the sparks that fly between Trace and Ava in Tina Leonard’s Last of the Red-Hot Cowboys.”—Laura Moore, author of Once Tasted  “Perfect for readers who enjoy heroes and heroines who clash upon first meeting and several times thereafter.”—Library Journal (starred review)“Hijinks and conflict propel Leonard’s first entry in her Hell’s Outlaws series, Last of the Red-Hot Cowboys.”—RT Book ReviewsIncludes a special message from the editor, as well as excerpts from other Loveswept titles.",
  "genres": [
    "Romance",
    "Contemporary",
    "Westerns",
    "Western Romance",
    "Romantic Comedy",
    "Humor",
    "Contemporary Romance"
  ],
  "author": "Tina Leonard",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/23166849-last-of-the-red-hot-riders"
}