{
  "title": "Clipped by Love",
  "description": "Things are heating up for the Sinclair boys! With one already in the NHL, Jayden Sinclair is hoping to be next! This has been the toughest year of my life. I watched my brother go into the draft without me, my mom got divorced, and the weight of my family’s issues is heavy on my shoulders. I feel like it’s my job to fix everything while working my butt off in school and trying to make my game better. I have to go into the draft. It will give my family the support they need, and it will prove that I’m good enough. But to get there, I have to show I can be the best captain for the Bellevue Bullies. The spot is mine—no one can take it. First though, Jude is making me go on a brother’s weekend. Innocent enough, I guess…until I see her. She’s the biggest competitor I’ve ever faced. Not only for my spot but also my heart. It’s hard to ignore someone like Baylor Moore. I don’t lose. I can’t. My dad has bred me to be the best in anything I do. I am driven, I am smart, and I am going to be the first woman in the National Hockey League. No two ways about it. I’ve worked too hard. I’ve been through too much not to have what I want. I know I can do it. I will make my dad proud, and no one will stand in the way of that. That is, until I let him in. He scares me. He makes me feel. And he could very well be the one person who can make me want more than just to win. We both have the same goal. Victory. But how do you compete against the person you want to win? It’s not easy. Love isn’t something you can control. It isn’t like a puck that can be handled by a stick. No, it has a mind of its own and does what it wants. Neither of us saw it coming, and we really don’t know if there is a way to score, especially when you’re being Clipped by Love.",
  "genres": [
    "Sports",
    "Sports Romance",
    "Romance",
    "Hockey",
    "New Adult",
    "College",
    "Contemporary"
  ],
  "author": "Toni Aleo",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/23172090-clipped-by-love"
}