{
  "title": "Hooked by Love",
  "description": "Things are out of control for the Sinclair boys! With two already in the NHL, Jace Sinclair is ready to follow in his brothers’ HUGE skates in the last Bellevue Bullies novel…Jace Sinclair here, and I’m amazing. There is no other way to describe me. I am the leading scorer for the Bellevue Bullies, I’m the captain, and people love me: my family, my teammates, my coach, and the NHL. I already have one foot in the draft and I’m ready. This is my last year in college–it’s basically a conditioning year to get me ready for the NHL, to further my game, and I have to be focused. But then, it’s also my last year to have fun and not give a damn before my life really starts. Which means I’m gonna run through every girl I meet. That’s my plan. Because my one and only love is hockey. It keeps me warm even when it’s freezing. It’s always there when nothing else is. And it pushes me to be the best I can be. It’s my love.That is, until I see her against a tree with a guitar.Avery.The last thing I wanted was to meet anyone. My heart is on the bench because I’ve watched my mom get broken by the person I call my father, and I don’t want that for myself. I don’t want to be hurt by anyone. I can’t give them that power.But my heart is begging for ice time, and I can’t control it around her.* * *I’ve always been in the background. No one has ever had time for me and that’s fine; I’ve learned to cope. Coming from a family where hockey is life, the last thing I want is some big, burly hockey player charging at me. I don’t have time for it, but Jace Sinclair isn’t one to be deked around. The thing is, I came to the University of Bellevue for one reason and one reason only. To make my dreams of being a singer/songwriter come true. To work in the industry and pay my dues. Become who I really want to be.I didn’t want to meet anyone. I didn’t want to end up freezing the puck with him. It’s not what I want.I have demons.I have issues.Living in the shadows, no one even knew until it was too late. But Jace wants to know.He wants me.And that scares me the living hell out of me.We were so worried about what would happen if we fell, but we never thought what could happen in the process of falling. We never saw it coming. But it’s here, and the repercussions are not pretty. We should have known that there is no way out of the zone when you are being Hooked by Love.",
  "genres": [
    "Sports",
    "Sports Romance",
    "Romance",
    "College",
    "Hockey",
    "New Adult",
    "Contemporary"
  ],
  "author": "Toni Aleo",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/23172091-hooked-by-love"
}