{
  "title": "Captured Boxed Set: 9 Alpha Bad-Boys Who Will Capture Your Heart",
  "description": "CAPTURED is a steamy collection from today's hottest authors featuring 9 sexy bad boys trying to capture your heart, every way they know how. New York Times and USA Today bestselling authors Opal Carew, Cathryn Fox, Eve Langlais, T. J. Michaels, Sharon Page, S.E. Smith, and Pepper Winters, along with Teresa Morgan and Mandy Rosko bring you nine tales of sensual seduction featuring alpha male heroes determined to have their way, and willing to do anything to get it, even if that means a little seductive persuasion... We've included a real mix of stories, from light & funny to dark & sinister, contemporary to paranormal. Seriously, for .99 you can't go wrong!DEBT OF HONOR by Opal CarewHeld captive by a domineering sheikh... and made to pay for a crime she did not commitYOURS TO TAKE by Cathryn FoxRevenge takes on a sexy twist when a powerhouse lawyer is stripped of her control by the handsome multi-millionaire she once took down in the courtroom.ACCIDENTAL ABDUCTION by Eve LanglaisFall in love? Never! An alien assassin turned pirate has no use for an emotion he can't sell, but that doesn't stop him from falling for the human he captures.JAGUAR'S RULE by T. J. MichaelsAfter an irresistible night of passion with Reya, Aaron James longs to hold her close forever. Little does he know that the tall, sleek beauty has a carnal secret--and he's the one who needs protection.HANDCUFFED TO THE SHEIKH by Teresa MorganThe last thing Maxine Foss ever expected was to be handcuffed to a sexy, but crazy, guy who claims he's an Arabian prince... and is determined to seduce her. Best. Abduction. Ever.FAST AND MINE by Sharon PageCollege student Claire gets lessons in seduction from sexy, hot street bike racer, Sawyer. But when she's kidnapped by his psychotic sponsor to force him to race, can Sawyer save her and win her heart?BURNS LIKE FIRE by Mandy RoskoJack Marilla is out for revenge for the deaths of his family, and the burn scars that cover his body. To get it, he has to hunt down the woman he used to love, the paranormal fire starter who set his house ablaze with him, and his family, locked inside of it. When he catches her, however, he faces his biggest challenge yet. To not believe her when she claims to be innocent, or fall for her seduction..DEBT INHERITANCE by Pepper WintersJethro Hawk receives Nila as an inheritance present on his twenty-ninth birthday. Her life is his until she's paid off a debt that's centuries old. He can do what he likes with her--nothing is out of bounds--she has to obey. There are no rules. Only payments..CHOOSING RILEY by S. E. SmithThings take a turn for the worse when Riley St. Claire is kidnapped by aliens and forced to choose a mate. The problem is, it would have been better, and safer, for the aliens if they had left Riley back on Earth.",
  "genres": [
    "Anthologies",
    "Erotica",
    "Romance",
    "Erotic Romance",
    "Contemporary Romance",
    "Paranormal Romance",
    "Paranormal"
  ],
  "author": "Opal Carew",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/23168869-captured-boxed-set"
}