{
  "title": "Deepak Chopra Collection",
  "description": "Four of the most popular and celebrated books by New York Times bestselling author Deepak Chopra are now available together in this collection.Buddha is an inspiring re-imagining of the life of a prince who gave up the trappings of royalty for something much more important—wisdom and enlightenment. This revolutionary journey has changed the world forever, and the lessons Buddha taught continue to influence every corner of the globe today. This is a new form of teaching for beloved Chopra and with it he brings us closer to understanding the true nature of life and ourselves.Jesus captures the extraordinary life of Christ in this surprising, soul-stirring, and page-turning novel. Uncovering the transformational \"lost years\" that are not recounted in the New Testament, Chopra has imagined Jesus's path to enlightenment moving from obscurity to revolutionary, from doubt to miracles, and then beyond as the role of the long-awaited Messiah. As a teenager, Jesus has premonitions of his destiny, and by the end, as he arrives to be baptized in the River Jordan, he has accepted his fate, which combines extremes of light and darkness.Born into the factious world of war-torn Arabia, Muhammad's life is a gripping and inspiring story of one man's tireless fight for unity and peace. In a world where greed and injustice ruled, Muhammad created change by affecting hearts and minds. Just as the story of Jesus embodies the message of Christianity, Muhammad's life reveals the core of Islam.In the groundbreaking and imaginative God, the evolution of our highest spiritual figure is told through a unique blend of storytelling and teaching. By capturing the lives of ten historical prophets, saints, mystics, and martyrs who are touched by a divine power, Chopra brings to life the defining moments of our most influential sages, ultimately revealing universal lessons about the true nature of God.",
  "genres": [
    "Spirituality"
  ],
  "author": "Deepak Chopra",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/23171455-deepak-chopra-collection"
}