{
  "title": "In a Dark Wood: What Dante Taught Me About Grief, Healing, and the Mysteries of Love",
  "description": "In the aftermath of a heartbreaking tragedy, a scholar and writer uses Dante’s Divine Comedy to shepherd him through the dark wood of grief and mourning—a rich and emotionally resonant memoir of suffering, hope, love, and the power of literature to inspire and heal the most devastating loss. Where do we turn when we lose everything? Joseph Luzzi found the answer in the opening of The Divine Comedy : “In the middle of our life’s journey, I found myself in a dark wood.” When Luzzi’s pregnant wife was in a car accident—and died forty-five minutes after giving birth to their daughter, Isabel—he finds himself a widower and first-time father at the same moment. While he grieves and cares for his infant daughter, miraculously delivered by caesarean before his wife passed, he turns to Dante’s Divine Comedy for solace. In a Dark Wood tells the story of how Dante helps the author rebuild his life. He follows the structure of The Divine Comedy , recounting the Inferno of his grief, the Purgatory of healing and raising Isabel on his own, and then Paradise of the rediscovery of love. A Dante scholar, Luzzi has devoted his life to teaching and writing about the poet. But until he turned to the epic poem to learn how to resurrect his life, he didn’t realize how much the poet has given back to him. A meditation on the influence of great art and its power to give us strength in our darkest moments, In a Dark Wood opens the door into the mysteries of Dante’s epic poem. Beautifully written and flawlessly balanced, Luzzi’s book is a hybrid of heart-rending memoir and critical insight into one of the greatest pieces of literature in all of history. In a Dark Wood draws us into man’s descent into hell and it is Dante’s journey, Joseph Luzzi’s, and our very own.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Death",
    "Grief",
    "Literary Criticism",
    "Biography Memoir"
  ],
  "author": "Joseph Luzzi",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/23173053-in-a-dark-wood"
}