{
  "title": "The Black Woman: An Anthology",
  "description": "A collection of early, emerging works from some of today's most celebrated African American female writersWhen it was first published in 1970, The Black Woman introduced readers to an astonishing new wave of voices that demanded to be heard. In this groundbreaking volume of original essays, poems, and stories, a chorus of outspoken women -- many who would become leaders in their fields: bestselling novelist Alice Walker, poets Audre Lorde and Nikki Giovanni, writer Paule Marshall, activist Grace Lee Boggs, and musician Abbey Lincoln among them -- tackled issues surrounding race and sex, body image, the economy, politics, labor, and much more. Their words still resonate with truth, relevance, and insight today. Contents:Woman poem by Nikki GiovanniPoem by Kay LindseyNaturally by Audre LordeAnd what about the children by Audre LordeReena by Paule MarshallThe diary of an African nun by Alice WalkerTell Martha not to moan by Shirley WilliamsMississippi politics - a day in the life of Ella J. Baker by Joanne GrantMotherhood by Joanna ClarkDear black man by Fran SandersTo whom will she cry rape? by Abbey LincolnThe black woman as a woman by Kay LindseyDouble jeopardy: to be black and female by Frances BealeOn the issue of roles by Toni CadeBlack man, my man, listen! by Gail StokesIs the black male castrated? by Jean Carey Bond and Patricia PeeryThe kitchen crisis by Verta Mae Smart-GrosvenorEnd racism in education: a concerned parent speaks by Maude White KatzI fell off the roof one day (a view of the black university) by Nikki GiovanniBlack romanticism by Joyce GreenBlack people and the Victorian ethos by Gwen PattonBlack pride? Some contradictions by Ann CookThe pill: genocide or liberation? by Toni CadeThe black social workers' dilemma by Helen WilliamsEbony minds, black voices by Adele Jones and groupPoor black women's study papers by poor black women of Mount Vernon, New York by Pat Robinson and groupA historical and critical essay for black women in the cities, June 1969 by Pat Robinson and groupThe black revolution in America by Grace Lee BoggsLooking back by Helen Cade BrehonFrom the family notebook by Carole BrownThinking about the play The great white hope by Toni CadeAre the revolutionary techniques employed in The battle of Algiers applicable to Harlem? by Francee Covington",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Race",
    "Essays",
    "Poetry",
    "Gender",
    "Anthologies"
  ],
  "author": "Toni Cade Bambara",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/11389601-the-black-woman"
}