{
  "title": "Smart Vs. Pretty",
  "description": "Out-of-work urban professional Francesca Greenfield has always known that she was the \"smart\" sister. Amanda was the soft and lovely one who, from the beginning, had always garnered most of the attention -- and all the dates. Now they've been thrown together in a last-ditch effort to save the family coffeehouse business before it goes permanently down the drain.In the chaotic misdt of mad promotional schemes and piranhalike next-door competitors, the sisters Greenfield are going to have to put aside their hard-faught sibling rivalry -- and quick! -- for the family good.What happens when a single woman in her early thirties gets stuck living and working with her sister again along with all the insecurities of sibling rivalry?\"From where I stood now, fifteen years out of high school, I knew that smart was more valuable than pretty.For one thing, pretty is available to anyone who has the time, energy, money, and will. And even without exercise or makeup, I considered myself to be serviceably attractive. I elicit a grunt from workmen. Baggers at the supermarket, however, called me ma'am.\"Meet Francesca Greenfield, a smart, urban professional suddenly tossed out of her so-so career and into the business of selling coffee alongside her pretty, perky sister Amanda.But selling coffee is only the start of their worries.Francesca has always known that she was the smart sister, \"though our mother never set us down and said, 'Francesca, we'll call you the smart one.'\" Amanda was soft and lovely from the beginning and had always garnered most of the attention-and all of the dates. Now they've been thrown together in a last-ditch effort to save the family business before it goes permanently down the drain.As for the coffeehouse itself, well, there's rarely a dull moment. Consider the piranha-minded next-door franchise and the brainstorms of one nearly psychotic marketing manager for starters. And who can forget about love? Or at least sex. Thanks to a promotional contest, it's not long before Amanda is looking to explore the aura of a buff mountain climber while Francesca considers shedding more than her inhibitions with a J. Crew model.The stakes are rising. It's time to find out if smart or pretty knows best, whether the distinction really suits either one of them, and if the Greenfield sisters can actually live happily ever after.",
  "genres": [
    "Chick Lit",
    "Romance",
    "Fiction",
    "Contemporary",
    "Adult Fiction",
    "Read For College",
    "Comedy"
  ],
  "author": "Valerie Frankel",
  "average_rating": "3.08",
  "url": "https://www.goodreads.com/book/show/231832.Smart_Vs_Pretty"
}