{
  "title": "The Art and Science of Healing, with Light",
  "description": "Chronic pain has reached epidemic proportions but it is not a disease. Chronic pain is a genuine physical problem and its epidemic is being spread by the very treatments the doctors are prescribing. Over thirty percent of patients across the world present with back, neck, or head pain, the majority of whom are in chronic pain, but all doctors offer is a prescription for painkillers and a referral for intensive physical therapy. The patients never improve, in fact they get worse. Instead of receiving empathy and understanding they are often accused of being dishonest about the severity of their pain. Some are even sent for psychotherapy. 'The Art and Science of Healing - with Light' breaks that vicious cycle. Within it is explained to patients how they developed chronic pain in the first place and how to begin to heal their migraines, back pain, neck pain, tinnitus, fibromyalgia, chronic fatigue syndrome, and all forms of chronic pain in general. Doctor Mark Rogers bases the healing process on his 7 Principles of Healing Chronic Pain. His methods are all based in science, are common sense, pain free, drug free, have no painful exercises, and no 'mind over matter' meditations for coping because the problem is not in the mind of the patients, it is in their bodies at a deep cellular level. The 7 Principles have a conservative efficacy of eighty-five percent. As long as the Principles are followed the patient will heal. It is the medical system that is keeping patients in pain through ignoring the origin of the pain. Pain is not a mystery, it is not a disease, it means you are being hurt. Chronic pain means you are still being hurt. Written in a clear easy to read style with minimal medical jargon it is designed to give patients control over their healing processes so they can start healing today.",
  "genres": [],
  "author": "Mark J. Rogers",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/23181698-the-art-and-science-of-healing-with-light"
}