{
  "title": "Framing the Early Middle Ages: Europe and the Mediterranean, 400-800",
  "description": "The Roman empire tends to be seen as a whole whereas the early middle ages tends to be seen as a collection of regional histories, roughly corresponding to the land-areas of modern nation states. As a result, early medieval history is much more fragmented, and there have been few convincing syntheses of socio-economic change in the post-Roman world since the 1930s. In recent decades, the rise of early medieval archaeology has also transformed our source-base, but this has not been adequately integrated into analyses of documentary history in almost any country.In Framing the Early Middle Ages Chris Wickham aims at integrating documentary and archaeological evidence together, and also, above all, at creating a comparative history of the period 400-800, by means of systematic comparative analyses of each of the regions of the latest Roman and immediately post-Roman world, from Denmark to Egypt (only the Slav areas are left out). The book concentrates on classic socio-economic themes, state finance, the wealth and identity of the aristocracy, estate management, peasant society, rural settlement, cities, and exchange. These are only a partial picture of the period, but they are intended as a framing for other developments, without which those other developments cannot be properly understood.Wickham argues that only a complex comparative analysis can act as the basis for a wider synthesis. Whilst earlier syntheses have taken the development of a single region as 'typical', with divergent developments presented as exceptions, this book takes all different developments as typical, and aims to construct a synthesis based on a better understanding of difference and the reasons for it. This is the most ambitious and original survey of the period ever written.",
  "genres": [
    "History",
    "Nonfiction",
    "Medieval",
    "Medieval History",
    "European History",
    "Ancient History",
    "World History"
  ],
  "author": "Chris Wickham",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/231863.Framing_the_Early_Middle_Ages"
}