{
  "title": "Encounters with the Unknown",
  "description": "ENCOUNTERS WITH THE UNKNOWN; A collection of True Stories of Encounters with Paranormal Entities..including;It came from the Basement;They would come for him at night;The girl in the lift;The twin assassins; Clairta's bites;The Grey Man;The Suicide Ledge;From beyond the Grave;The Noppera-bo.Excerpts: 'The scream was unlike anything we had ever heard before. It sounded as if it was surrounding us rather than coming from one direction.The screams came from every direction.''She wrenches her hands together as her horror grows, trying to maintain some grip on her sanity. She does not understand what is happening to her.'\"They had red eyes, their eyes hurt my head. They told me they would come for me tonight...\"'They were afraid this thing would kill them as it had the others who had dared to cross it.''She was found crumpled on the floor, \"Don't let it touch me!,\" she whimpered.'I began to hear noises behind me. Every step i took, i would hear a crunch behind me, then another, as if someone or something was walking behind me.''Something large, dark, and shapeless was entering the room.''A flash of lightning lit up the room. I saw something; there was a figure. His smile was much too large to be normal.''Looking around she tried to see who it was that had spoken to her, but no-one was there.'\"I thought i was going to die. It was like being plunged into a burning furnace.\"\"The arms started getting longer, closer...i truly thought i was going to die from the fear.\"'He was dead; his face contorted into a mask of terror. He had, they said, died from fright.'\"Opening my eyes i saw a man, wearing a grin that set my heart pumping.\"'It walked along the street at super-human speed. Then i realized the shape was getting bigger; he was coming back my way.'A collection of True stories of Unexplained Mysteries; Encounters with Unknown Paranormal entities, collected from around the world.Occult, supernatural, paranormal unexplained phenomenon.Terrifying true stories.",
  "genres": [
    "Horror",
    "Nonfiction"
  ],
  "author": "Stephen Young",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/23174294-encounters-with-the-unknown"
}