{
  "title": "The Disunited States of America",
  "description": "Time travel doesn't work. You can't go backward or forward; you're stuck at \"now\". What you can do is travel sideways, to the same \"now\" in another timeline where history turned out differently.So far, only our home timeline has figured out how to do that. We use Crosstime Traffic to conduct discreet trading operations in less advanced timelines, selling goods just a little bit better than the locals can make. It's profitable, but families who work as Time Traders have to be careful to fit in, lest the locals become suspicious.Justin's family are Time Traders. The summer before he's due to start college, he goes with them to a different Virginia, in a timeline where the American states never became a single country, and American history has consisted of a series of small wars. Despite his unease, he accompanies Randolph Brooks, another Time Trader, on a visit to the tiny upland town of Elizabeth, Virginia. He'll only be away from his parents for a few days.Beckie Royer thanks her stars that she's from California, the most prosperous and advanced country in North America. But just now she's in Virginia with her grandmother, who wants to revisit the tiny mountain town where she grew up. The only interesting thing there is a boy named Justin--and he'll be gone soon.Then war between Virginia and Ohio breaks out anew. Ohio sets a tailored virus loose on Virginia. Virginia swiftly imposes a quarantine, trapping Becky and Justin and Randolph Brooks in Elizabeth. Even Crosstime Traffic can't help. All the three of them can do is watch as plague and violence take over the town.It's nothing new in history, not in this timeline or any other. It's part of the human condition. And just now, this part of the human condition sucks.",
  "genres": [
    "Alternate History",
    "Science Fiction",
    "Fiction",
    "Young Adult",
    "Historical Fiction",
    "Fantasy",
    "Time Travel"
  ],
  "author": "Harry Turtledove",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/101517.The_Disunited_States_of_America"
}