{
  "title": "The Mission Driven Hospital",
  "description": "WARNING! Most hospital (and healthcare) Mission Statements are not worth the paper they are written on....even worse, once they're formally \"approved\", they go absolutely nowhere. Sure, they adorn hospital walls, entrance lobbies and annual reports. But no one EVER remembers them or what their nice sounding words even mean. As a result, most mission exercises and retreats are a complete waste of time...TIME  that could be better spent helping patients.But that need not - and should not - be the case. A great mission statement, and the process used to execute it, can turn a hospital's performance from mediocre to magnificent.  Employees will become more focussed and truly engaged. And patient satisfaction will soar!  The hospital's culture will transform!In The Mission Driven Hospital, Dr. Chris Bart brings his unparalleled expertise as the world's leading expert on mission statements to bear on health care providers, and hospitals in particular. The book is the result of Bart's latest research into the principles and practices of almost 500 hospitals.Using case study examples drawn from real-life hospital operations, written in a clear language, and featuring the latest in in-depth research data, The Mission Driven Hospital is a practical, thorough, and essential step-by-step guide for hospital Boards and their CEOs looking to make their mission statements truly matter and thereby capture the elusive mission mystique!.The Mission Driven Hospital has already been wholeheartedly endorsed by the health care leadership community in North America including the influential Ontario Hospital Association. It is predicted that The Mission Driven Hospital will become mandatory reading for every CEO and Board Chair in the health sector today. You won't be disappointed!",
  "genres": [],
  "author": "Chris Bart",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/23173695-the-mission-driven-hospital"
}