{
  "title": "Soldier of the Legion",
  "description": "A rough truce divides the known galaxy between the System, the despotic slave empire that rules the inner systems, and the Confederation of Free Worlds, claiming the awesome infinity of the Outvac frontier. When Squad Beta of the ConFree Legion drops onto the primitive world of Andrion 2 to counter a mysterious System incursion they know the Systies are out there somewhere, armored DefCorps soldiers waiting to slice them to bloody bits in a microfrac. The young immortal trooper Thinker vows that this will never happen on his watch. It soon becomes chillingly clear that Beta is facing more than Systies. The ultimate Evil is awaiting them all, writhing in the shadows, merciless and all-powerful, and humanity itself is poised on the brink of extinction. As he travels further into the dark Thinker finds both love and death, and realizes that the Legion has always been his destiny. He is torn between his desire for the violently possessive Valkyrie and the sweet innocent Priestess. The squad is soon seeking its fate in a series of suicidal attacks on hostile planets against an enemy that has never known defeat. Beta One says they are going to change history, but Thinker doesn't care about history. He cares only about Beta and his closest comrades - and he knows that immortality will not ward off bullets. Soldier of the Legion was a Finalist for the 2003 Benjamin Franklin Award in the \"Popular Fiction\" category. Soldier of the Legion was a Finalist for the 2002 ForeWord Magazine Book of the Year Award in two Science Fiction and Audio Fiction. The unabridged full-cast audio version of Soldier of the Legion was broadcast and re-broadcast nationally on XM Radio during 2005 and 2006. \"This is a great first novel, with a well-thought-out background and neat technological war toys. I look forward to their next battle.\" -- Henry L Lazarus, sciencefiction.com, Philadelphia Weekly \"...exciting read... Heart pounding action. Mind blowing battles... Adrenalin pumping encounters with alien life... futuristic sci fi masterpiece... Marshall Thomas should soon be a major name in futuristic sci fi. I enthusiastically recommend this book.\" -- Laurel Johnson, Midwest Book Review \"...a deep, rich story that captures the heart of Sci-fi... a perfect story... captivating... moving. I highly recommend SOLDIER OF THE LEGION, one the best books I've read this year!\" -- Nancy Mehl, MyShelf.com \"[the audio is]...superbly written, presented and performed science fiction action/adventure audiobook thriller. ...enthusiastically recommended.\" -- Midwest Book Review",
  "genres": [
    "Science Fiction",
    "Military Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "Space Opera"
  ],
  "author": "Marshall S. Thomas",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/2317876.Soldier_of_the_Legion"
}