{
  "title": "Charlie and Chocolate's Purrfect Prayer",
  "description": "Inspired by the true story of a boy and a cat, \"Charlie and Chocolate's Purrfect Prayer\" is a great way to teach children about the importance of family, prayer, and the unconditional love of God's furry creatures.  Charlie has been spending a lot of time at his grandmother's house because his mom is sick. Grandma's cat, Chocolate, has never cared for kids, and usually pays no attention to Charlie when he visits, but Grandma has promised Charlie that if he is patient and kind, Chocolate and he may one day become the best of friends. One night, as Charlie says his bedtime prayers, he learns that sometimes love can come from very unexpected places, and just when it's needed the most.  \"Like young Charlie in this book, many of us have been fortunate to have wise, caring grandmothers who are always there for us, and have helped shape us into the best people possible. Many of us have also had the companionship of cats and dogs who just seem to know when we are feeling sad, and are immediately ready to give us some extra love and sympathy. 'Charlie and Chocolate's Purrfect Prayer' is a heartwarming story about young Charlie's loving relationship with his devoted Grandma, and how a pompous, disinterested cat rises to the occasion when he senses the boy really could use a friend.\" --Diane Bryan, Ed.M., Executive Director, The Intelligence Group \"As an Early Childhood Educator I am constantly seeking out books that not only entertain but also educate. I found \"Charlie and Chocolate's Purrfect Prayer\" to be an inspiring book of courage and friendship as Charlie, a little boy dealing with his mother's illness, and Chocolate, his grandmother's not so friendly cat, become the best of friends. Through this delightful tale, Charlie learns that when things are difficult, prayer and patience can work wonders.\" --Kathy Ramirez, Disney Children's Center",
  "genres": [],
  "author": "J. Suthern Hicks",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/23178838-charlie-and-chocolate-s-purrfect-prayer"
}