{
  "title": "Twelve Bar Blues",
  "description": "This rich and epic novel is written with each chapter a phrase of a twelve bar blues structure, each of the different pieces of the harmonic progression coordinating with a different storyline.The book begins with a Prologue set in the mythical Afican kingdom of Zimindo in 1790, where two young best friends, the mesmerizing singer Zike and the zukulu (witchdoctor) Mutela become romantic rivals until Mutela uses witchcraft to spoil Zike’s relationship—and transporting him out of the village and into the hands of slavers who take him to New Orleans. One hundred years later, his descendant Fortis James (Lick) Holden grows up in a life of poverty in Mount Marter, Louisiana with his grandmother, mother, half-sisters, and stepsister, the beautiful fair-skinned “quadroon” Sylvie Black. At the age of ten shows his skill with playing the coronet, but when he runs afowl of the law he is sent away to reform school. There he joins a band and learns to play with his “head, chops, and heart” from a man called the Professor.The story then shifts to present-day Zimindo, now the fictional African nation of Zambawi, and follows the reactions of chief Tongo, his argumentative pregnant wife Kudzai, and Musa, his zukulu, to the arrival of the African-American archaelogist from Northwestern University named Olurunbunmi (Bunmi) Durowoju (formerly Coretta Pink). She has excavate the remains of an old tribal village nearby and turned up a fantastic tribal headdress but needs Tongo’s permission to take it, which he refuses (hoping to sleep with her in exchange), but his wife intervenes, and when he goes to Musa for advice the shaman tells him he can’t help, because he is about to embark on a journey…Meanwhile in 1912 Lick returns from reform school and begins making a name for himself among the juke joints of his small home town. He soon travels to New Orleans at the height of its jazz age glory at the suggestion of a local star (and also to search for the missing Sylvie), but his connection doesn’t pan out—though a young Louis Armstrong takes him under his wing, which transforms his sound, but he departs the Big Easy once he hears that Sylvie has returned to his hometown, abandoning the prostitute he married.Back in 1998, a black Englishwoman, Sylvia di Napoli is boarding a plane bound for New York, to untangle the secret of his ancestry. Born of two ostensibly white parents, she had run away from her angry father’s household as a teenager, becoming a prostitute before deciding that she wanted to turn her life around and become a singer. She meets an Englishman named Jim on the plane who she tells her story to Jim over the course of the planeride and at a bar in New York. He decides to join her in meeting her great uncle in Harlem.In 1920 Mount Marten, Louisiana, Sylvie Black has become a prostitute for the young white gentlemen of the town, while Lick searches for her in between infrequent performances. Lick encounters her at a dance but she leaves him for the young white man she came with.In 1998 New York, Jim and Sylvia meet with Fabrizio Berlone, her long-lost grand uncle, who reveals the mystery of her racial heritage: her grandmother was a mixed-race blues singer named Sylvia who was passing for white and gave birth while in New York. They head to Chicago in search of her great aunt (where Musa the zukulu has also turned up) and go to the Apostolic Church of All Saints, where the pastor reveals that her great aunt has been survived by a daughter: Coretta Pink. They head to her office at the university, where they are informed that she is in Africa, but Musa is there to meet them.Back in Zambawi, Kudzai abandons Tongo in a fury and he makes a rash pass at Bunmi, who rejects his moves with a swift knee to the groin—but after Tongo agrees to let her take the mask, she relents. But six months later, after Musa has returned to the village Tongo reveals he did not sleep with her, and Kudzai has returned to the village with a son, now named Tongo.Six months earlier in New Orleans, Jim, Sylvia, and Musa, frequent an “Irish” bar where a blues guitarist named Fortnightly plays. There Jim reveals his jealousy at Sylvia’s attraction to Musa and Musa reveals that Fortnightly is Fortis Holden Jr.Back in 1920 Mount Martin, LA, Sylvie seeks out Lick and stays with him for five days but leaves to return to her white lover, and sees Lick on the side and begins performing with his band. But when she becomes pregnant, they decide they must leave. Fortis Holden Jr. explains the rest of the story to Jim, Sylvia, and Musa in 1998 New Orleans, and tells of how Sylvie’s white lover comes to kill Lick, Sylvie goes to New York and becomes the wife of the Italian man who Sylvia knows as her grandfather. After an ugly bout of jealousy, Jim reveals his love for Sylvia, and months later Sylvia meets Bunmi to complete the circle and the story.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Music",
    "Historical",
    "Contemporary",
    "Africa",
    "Novels"
  ],
  "author": "Patrick Neate",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/231791.Twelve_Bar_Blues"
}