{
  "title": "The Beautiful Things That Heaven Bears",
  "description": "A haunting and powerful first novel that views the streets of Washington, D.C. and Addis Ababa through the eyes of Sepha who, seventeen years ago, fled Ethiopia during the Revolution, and now runs a failing convenience store in a poor African-American neighborhood in Washington. Published as The Beautiful Thing That Heaven Bears in the USA, Canada and Australia; and as Children of the Revolution in the UK.Seventeen years ago, Sepha Stephanos fled the Ethiopian Revolution after witnessing soldiers beat his father to the point of certain death, selling off his parents' jewelry to pay for passage to the United States. Now he finds himself running a grocery store in a poor African-American neighborhood in Washington, D.C. His only companions are two fellow African immigrants who share his feelings of frustration with and bitter nostalgia for their home continent. He realizes that his life has turned out completely different and far more isolated from the one he had imagined for himself years ago. Soon Sepha's neighborhood begins to change. Hope comes in the form of new neighbors-Judith and Naomi, a white woman and her biracial daughter-who become his friends and remind him of what having a family is like for the first time in years. But when the neighborhood's newfound calm is disturbed by a series of racial incidents, Sepha may lose everything all over again. Told in a haunting and powerful first-person narration that casts the streets of Washington, D.C., and Addis Ababa through Sepha's eyes, The Beautiful Things That Heaven Bears is a deeply affecting and unforgettable debut novel about what it means to lose a family and a country-and what it takes to create a new home. Published as The Beautiful Thing That Heaven Bears in the USA, Canada and Australia; and as Children of the Revolution in the UK. Winner of the Guardian (UK) 2007 book award.",
  "genres": [
    "Fiction",
    "Africa",
    "Book Club",
    "Ethiopia",
    "Contemporary",
    "Literary Fiction",
    "Novels"
  ],
  "author": "Dinaw Mengestu",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/231851.The_Beautiful_Things_That_Heaven_Bears"
}