{
  "title": "A Family Affair: Fall",
  "description": "Heartache. Betrayal. Forgiveness. Redemption. It's time to head back to Magdalena, New York, and spend a little time with the people we love to love and even a few we love to hate.Gina Servetti was raised to believe she wasn't enough--not thin enough, not pretty enough, not clever enough. She's more comfortable with a spreadsheet than a conversation and doesn't trust easily, especially where men are concerned, most notably the good-looking, smooth-talking ones like Ben Reed.When city boy Ben Reed arrives in Magdalena, he's not planning a long-term stay in a town filled with too many busybodies and too little excitement. He just needs things to settle down in Philly for a few months before he returns to his old life and his plan to win back his ex-wife. But once he gets to know the people in this town, he starts to care about them: one in particular--Gina Servetti. The longer he's around her, the more he realizes she's so much more than a woman with a scowl and a sharp tongue. She's real and honest, and as afraid of trusting as he is.But can Ben and Gina open up and take a risk for a chance at real love? Well, if the rest of the town has anything to say about it, and they always do, this couple will take the big leap and end with an \"I do\"!And would the story be complete without checking in on Harry Blacksworth's latest debacle...ahem...adventure? Harry's moved his brood to Magdalena and is taking advice but, thankfully, not fashion lessons from Pop Benito. That spells trouble on so many levels. Oh, but it's going to be interesting...Join me as we peek into the lives of some of our favorites: Pop Benito, Lily, Nate and Christine Desantro, Harry and Greta Blacksworth, Mimi Pendergrass, Bree Kinkaid...and many more.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Contemporary Romance",
    "Womens Fiction"
  ],
  "author": "Mary Campisi",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/23174935-a-family-affair"
}