{
  "title": "How Sweet It Is",
  "description": "Over 3.5 million readers have fallen for Kate Perry's novels. Get into her new Summerhill series…  Viola Summerhill needs sex.  Her sisters say a rebound fling is just the thing to wash away the bad taste left from her recently crumbled marriage. But Viola knows she needs more than that. She has to reinvent herself, to regain the identity she lost being a wife and a mother. And she's going to do it as an art gallery owner.  Stocking her new gallery with work worthy of the grand opening she desires isn't easy, though. She needs a smashing piece--something that'll steal everyone's breath. And she finds the most amazing work she's ever seen where she least expects in the home of what was supposed to be a one night stand.  Don't miss the rest of Kate's new Summerhill Book 1: SAY YOU WILL Book 2: LOST IN LOVE Book 3: LET'S MISBEHAVE Book 4: STAY THE NIGHT Book 5: ONCE UPON A DREAM Book 6: HOW SWEET IT IS Book 7: GIVE A LITTLE  Kate's fun, sexy Laurel Heights series is available Book 1: PERFECT FOR YOU Book 2: CLOSE TO YOU Book 3: RETURN TO YOU Book 4: LOOKING FOR YOU Book 5: DREAM OF YOU Book 6: SWEET ON YOU Book 7: TAMED BY YOU Book 8: HERE WITH YOU  ALL FOR YOU Book 9: MAD ABOUT YOU Book 10: LOVED BY YOU  Like strong independent women and the sexy alpha heroes who love them? Are you a fan of the greats like Bella Andre, Kristan Higgins, and Marie Force? Then try Kate's quirky romances. We think you'll love them, too.   \"Kate Perry is on my auto buy list.\" –Night Owl Romance  \"Hot! Recommended!\" –Bookpleasures  \"Kate's brilliant, as evidenced by the fact that she married me.\" - the Magic Man, Kate's husband  \"I can't help the ear-to-ear smile I have plastered to my face when reading any of Kate's books… She makes me laugh out loud, even on a crowded bus!\" –Donna, Public Transit Romance Reviewer  \"Perry's storytelling skills just keep getting better and better!\" –Romantic Times Book Reviews  \"Kate's writing is fluid, with a touch of sexiness and loads of romance, just what you need to relax after a long, hard-working day.\" –Gabby, Romance Reader Extraordinaire  \"Kate writes books?\" –Kia, Kate's brother  \"Kate Perry's Laurel Heights series is of my most guilty pleasures. ;) Keep on keepin' on and kickin' ass!\" –R, Closet Romance Fan  \"Reading Kate Perry's books is my favorite way to spend an afternoon (well..okay, my second favorite way, the husband insists I clarify...)\" –M.W., Bedroom Enthusiast  \"A winning and entertaining combination of humor and pathos.\" –Booklist",
  "genres": [
    "Romance",
    "Contemporary",
    "Chick Lit",
    "Apple"
  ],
  "author": "Kate Perry",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/23173369-how-sweet-it-is"
}