{
  "title": "My Story as told by Water: Confessions, Druidic Rants, Reflections, Bird-watchings, Fish-stalkings, Visions, Songs and Prayers Refracting Light, from Living Rivers, in the Age of the Industrial Dark",
  "description": "In his own words, David James Duncan was \"struck by a boyhood suspicion that rivers and mountains are myself turned inside out. I'd heard at church that the kingdom of heaven is within us and thought, Yeah, sure. But the first time I walked up a trout stream, fly rod in hand, I didn't feel I was 'outside' at I was traveling further and further in.\" An estimated three thousand river walks later comes My Story as Told by Water , in which Duncan braids his contemplative, activist, and rhapsodic voices together into an irresistibly distinctive whole, speaking with a power and urgency that will recharge our national appreciation of the vital connections between our water-filled bodies and this water-covered planet.Offering a wide-ranging, contemplative exploration of the rivers that touch his life, Duncan backs his insights with a fierce defense of the sacred cultures and fauna that living waters sustain. With a bracing blend of story, logic, science, and comedy, he dissects the hollow industrial platitudes that lead to the ruin of publicly owned rivers for private profit. Standing up for the river made famous by the pen of his neighbor, Norman Maclean, Duncan exposes America's anachronistic federal mining policy and the devastating cyanide technology to which it has led. As an advocate for the bankrupted fishing towns, Native tribes, and unraveling web of life of the Pacific Northwest, he lays bare our biological and religious obligation to breach four of the Columbia and the Snake rivers' 221 massive dams to save wild salmon. Yet Duncan centers even his darkest explorations in the joys, gratitude, and wonder that walking rivers, rod in hand, provides him.Here is a brilliant writer revealing captivating speculations on being born lost, on the discovery of water, on wading as pilgrimage, coho as interior compass, and industrial creeks as blues tunes. Here are rivers perceived as prayer wheels, dying birds as prophets, salmon as life-givers, brown trout as role models, wilderness as our true home, wonder as true ownership, and justice as biologically and spiritually inescapable.",
  "genres": [
    "Nonfiction",
    "Essays",
    "Nature",
    "Memoir",
    "Environment",
    "Philosophy",
    "Religion"
  ],
  "author": "David James Duncan",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/23194.My_Story_as_told_by_Water"
}