{
  "title": "Slavery by Another Name: The Re-Enslavement of Black Americans from the Civil War to World War II",
  "description": "In this groundbreaking historical exposé, Douglas A. Blackmon brings to light one of the most shameful chapters in American history—an “Age of Neoslavery” that thrived from the aftermath of the Civil War through the dawn of World War II.Under laws enacted specifically to intimidate blacks, tens of thousands of African Americans were arbitrarily arrested, hit with outrageous fines, and charged for the costs of their own arrests. With no means to pay these ostensible “debts,” prisoners were sold as forced laborers to coal mines, lumber camps, brickyards, railroads, quarries, and farm plantations. Thousands of other African Americans were simply seized by southern landowners and compelled into years of involuntary servitude. Government officials leased falsely imprisoned blacks to small-town entrepreneurs, provincial farmers, and dozens of corporations—including U.S. Steel—looking for cheap and abundant labor. Armies of “free” black men labored without compensation, were repeatedly bought and sold, and were forced through beatings and physical torture to do the bidding of white masters for decades after the official abolition of American slavery.The neoslavery system exploited legal loopholes and federal policies that discouraged prosecution of whites for continuing to hold black workers against their wills. As it poured millions of dollars into southern government treasuries, the new slavery also became a key instrument in the terrorization of African Americans seeking full participation in the U.S. political system.Based on a vast record of original documents and personal narratives, Slavery by Another Name unearths the lost stories of slaves and their descendants who journeyed into freedom after the Emancipation Proclamation and then back into the shadow of involuntary servitude. It also reveals the stories of those who fought unsuccessfully against the re-emergence of human labor trafficking, the modern companies that profited most from neoslavery, and the system’s final demise in the 1940s, partly due to fears of enemy propaganda about American racial abuse at the beginning of World War II.Slavery by Another Name is a moving, sobering account of a little-known crime against African Americans, and the insidious legacy of racism that reverberates today.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Politics",
    "American History",
    "Social Justice",
    "African American"
  ],
  "author": "Douglas A. Blackmon",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/2319745.Slavery_by_Another_Name"
}