{
  "title": "الوليد: الملياردير، رجل الأعمال، الأمير",
  "description": "لتحميل الكتابhttp://www.mediafire.com/download/25g...قلّة هم الأشخاص الذين يتحلّون بسمات الأمير الوليد بن طلال بن عبد العزيز آل سعود الفريدة وهمّته وحيويّته.تروي هذه السيرة الذاتيّة لخامس أغنى رجل في العالم - بثروة تقدّر بنحو 24 مليار دولار - قصّة رجل أعمال بدأ مشواره بقرض مصرفيّ متواضع نسبيّاً، وبنى إمبراطوريّة تضمّ ألمع الأسماء التجاريّة وأكثرها شهرة، من مجموعة سيتي إلى أبل كمبيوترز وفنادق فور سيزنز.الوليد هو أكبر مستثمر أجنبيّ فرد في الاقتصاد الأمريكيّ، حيث لديه مصالح في كل ما يمسّ نمط الحياة الأميركيّة تقريباً. وعلى غرار المعلّم الكبير للاستثمار وارن بافيت، طبّق نجاح الوليد الآفاق من خلال عدّة استثمارات استراتيجيّة متتالية حظيت بتغطية إعلاميّة واسعة، وأكسبته الاحترام والشهرة في وول ستريت.في هذه السيرة الذاتيّة المرخّصة الرائعة والفريدة في آن، يلقي الصحافيّ والمذيع الدوليّ ريز خان نظرة داخليّة شفّافة على عبقريّ الأعمال المثير للاهتمام، تركّز على عدّة قضايا تشمل:- تاريخ أسرته الفريد.- منشأ دوافعه القويّة لتحقيق النجاح.- نجاحه الخارق في إنقاذ الشركات المتعثّرة مثل العملاق الأمريكيّ سيتي بنك.- استثماراته في الأسماء التجاريّة اللامعة، بما في ذلك فنادق فور سيزنز وساكس فيفث أفنيو ونيوز كورب.- أسلوبه الفريد في الاستثمار - وبعض استراتيجيّاته الأكثر تحقيقاً للأرباح.بعيداً عن نمط حياة الملياردير الدائم التسفار، يرتبط الوليد بعلاقة وثيقة وعاطفيّة بالصحراء وأهلها. ويقف عند الحدّ الفاصل بين عالم الصحراء بخيامها وجمالها وبدوها الذين يحملون البنادق... وعالم وول ستريت السريع الخطى بطموحاته وسيّارته الفارهة وملابسه الأنيقة.تكشف هذه القصة الشخصيّة عن حياة هذا الملياردير اللامع والرائع والشغوف بالعمل بشكل خارق للعادة، عن تفاصيل تستحوذ على الانتباه وتستند إلى مقابلات معمّقة مع أسرة الأمير ومرافقيه وشركائه الأوثق في الأعمال - ومن بينهم أسماء لامعة مثل ساندي ويل وروبرت مردوخ وجيمي كارتر.\"الوليد\" صورة شفّافة عن فرد غير عادي لا نظير لحضوره في الاقتصاد العالمي؛ إنّه سفير القرن الحادي والعشرين الذي يمكن أن يكون جسراً للتواصل الحاسم بين الشرق الأوسط والغرب.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Business",
    "Banking",
    "Unfinished"
  ],
  "author": "Riz Khan",
  "average_rating": "2.69",
  "url": "https://www.goodreads.com/book/show/2318921._"
}