{
  "title": "Alibi in High Heels",
  "description": "#1 Amazon, New York Times & USA Today Bestselling series! Will death on a Paris runway ruin fashion week?Baguettes, bodies, and haute couture galore! Shoe designer turned amateur sleuth, Maddie Springer, is at it again, this time in fabulously fashionable Paris. When Europe's designer de jour, Jean Luc LeCroix, invites Maddie to show her creations at Paris Fashion Week, Maddie's sure she's died and gone to heaven. That is until Jean Luc's top model is actually found dead on the runway, stabbed with a familiar stiletto heel. Sure someone is trying to frame her, Maddie enlists the help of her friends, including the sexy Detective Jack Ramirez, to uncover a daring jewel heist, a devious blackmailer, and even a few skeletons lurking in the closets of those closest to her. But as the evidence mounts, Maddie becomes the prime suspect, and Ramirez is stuck between a badge and a cute blonde with a tendency for trouble. Will he stand by her as she attempts to track down an international killer, or will this be the case that finally comes between them? One thing's for sure, if Maddie doesn't uncover the real killer soon, she may be saying her final adieu. This story does not contain any graphic violence, language, or sexual encounters. Its rating would be similar to PG-13 or what you would find on a Hallmark Channel movie or TV series.What critics are saying about Alibi in High \"Alibi in High Heels is a clever and stylish addition to Gemma Halliday's laughter-infused Maddie Springer series.\"~ Chicago Tribune\"Halliday is on top of her game, and readers will love Maddie's new adventure.\"~ Booklist\"I started Alibi in High Heels around 2 pm and read non stop until 11 pm when I finished it. The writing was so engaging and so fun that I did not want to put this book down. This is a 5 star book that I HIGHLY recommend to Janet Evanovich fans who are looking for a new author to try that they will LOVE!!! Alibi in High Heels is the best book that I have read in a while, and I can't wait to read more books by Gemma Halliday.\"~ Fresh Fiction\"Maddie Springer is like a cross between Paris Hilton and Stephanie Plum, only better. The dialogue is snappy and the suspense beautifully interwoven with Ms. Halliday's unique humor. This is one HIGH HEEL you'll want to try on again and again \"~ Romance Junkies",
  "genres": [
    "Mystery",
    "Romance",
    "Chick Lit",
    "Cozy Mystery",
    "Humor",
    "Contemporary",
    "Fiction"
  ],
  "author": "Gemma Halliday",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/2319493.Alibi_in_High_Heels"
}