{
  "title": "Księgi Jakubowe",
  "description": "Rok 1752. Do Rohatyna na Podolu przybywają kasztelanowa Katarzyna Kossakowska i towarzysząca jej poetka Elżbieta Drużbacka. Jednym z gości na powitalnej kolacji jest miejscowy proboszcz Benedykt Chmielowski, autor pierwszej polskiej encyklopedii. Ksiądz i poetka, osoby rozmiłowane w księgach, szybko znajdują wspólny język – rozpoczynają rozmowę, którą później kontynuować będą w listach.Nieco później, także na Podolu, pojawia się młody, przystojny i charyzmatyczny Żyd - Jakub Lejbowicz Frank. Tajemniczy przybysz z odległej Smyrny zaczyna głosić idee, które szybko dzielą społeczność żydowską. Dla jednych heretyk, dla innych zbawca już niebawem ma wokół siebie krąg oddanych sobie uczniów, zaś wywołany przezeń ferment może odmienić bieg historii.Niemal tysiąc stron, kilkadziesiąt wątków i postaci — Księgi Jakubowe imponują literackim rozmachem, wielością poziomów i możliwych interpretacji. Olga Tokarczuk pełnymi garściami czerpie z tradycji powieści historycznej, poszerzając jednocześnie jej granice gatunkowe. Z ogromną dbałością o szczegóły przedstawia realia epoki, architekturę, ubiory, zapachy. Odwiedzamy szlacheckie dwory, katolickie plebanie i żydowskie domostwa, rozmodlone i zanurzone w lekturze tajemniczych pism. Na oczach czytelników pisarka tka obraz dawnej Polski, w której egzystowały obok siebie chrześcijaństwo, judaizm, a także islam.Księgi Jakubowe to nie tylko powieść o przeszłości. Można ją czytać również jako refleksyjne, momentami mistyczne dzieło o samej historii, jej zakrętach i trybach, które decydują o losach całych narodów. To właśnie w połowie XVIII wieku, u progu Oświecenia i przed rozbiorami, wybitna pisarka poszukuje odpowiedzi na pytania o dzisiejszy kształt naszej części Europy.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Poland",
    "Polish Literature",
    "Historical",
    "Literary Fiction",
    "Literature"
  ],
  "author": "Olga Tokarczuk",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/23199866-ksi-gi-jakubowe"
}