{
  "title": "Sleeping with the Sun",
  "description": "\"Beautiful. Atmospheric. Disturbing.\"Set against a backdrop of 1930’s rural Suffolk during the depression era, Sleeping with the Sun is a powerfully compelling snapshot of a young girl’s life. Separated from the rest of the community by her isolated, domineering father, Katie begins to feel more and more alone. Her only friend appears to be her gentle mother, Bea – a woman who’s also under husband Nader’s selfish control. A change occurs within the family that no one predicts. The illusion of who is mad and who is sane and what lies between threatens to shape Katie’s new reality, until she realises that the concept of reality only works when everyone sees the world exactly the same. In a dark cloud of grief, urged on by an inner strength she has yet to fully understand, the young girl takes her mother’s pencils and draws a boy. When there’s no one else to talk to, she talks to him – and it’s then that Katie’s secret is born.Author Carla H. Krueger hits another high note with this beautifully dark tale, inviting the reader to put themselves in unexpected shoes and to question more deeply the difference between wrong and right – a difference that might be far more subtle than many of us are willing to believe. Strong themes of emotional control, the power of lies, manipulation and surprising role reversals work together to give us an uneasy atmosphere, a sinister pseudo-reality that’s becoming a mainstay of this author’s fiction. Through each character, the author explores her own struggle to unmask the artist within, to fight external controls, and to embrace, as an adult, those precious roots of discovery, rebellion and risk.As with every short story in Carla’s six-part From the Horse’s Mouth Collection, a crime is committed – but these are no ordinary whodunits. There is no clear-cut answer. It’s up to the reader to solve the mystery of who they think the real perpetrator is...",
  "genres": [
    "Contemporary",
    "Thriller",
    "Horror",
    "Short Stories",
    "Gothic"
  ],
  "author": "Carla H. Krueger",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/23201812-sleeping-with-the-sun"
}