{
  "title": "Journey to Wasteland",
  "description": "In the land of Wetsfalia, Mesha P. Longbottom descends from a long line of shepherds and is expected to carry on the family tradition. Since the death of his parents he now lives with his grandparents and spends his days slacking off in the pastures, reminiscing of the magical tales his father told before passing. Was tending to smelly sheep the only life that awaited him, or could the magic his father spoke of really exist in WESTFALIA?When life at home proves too much to bear, the olive-skinned boy decides to live out the tales of his father in hopes to find adventure, grow closer to his father's memory, and above all to find his own place in the world. In particular he searches for a swampy island called Wasteland, for it was there his father claimed, lived a banished WIZARD by the name of Arcadia. Finding Arcadia and the Wasteland become the obsessions of the boy, it is the island and only the island he believes, that will bring him happiness.In his travels the boy meets several new companions, the brother-sister combination of Piper and Driggs, as well as a mysterious man from the hill-tribes named Fang who travels with his shadowy pet wolf. Piper and Driggs prove to be both quarrelsome and helpful, while Fang's knowledge of the land and combat prove indispensable. Mesha possesses little to no survival skills except for a strong will and belief in Wasteland's existence. But as the group encounters countless perils along the journey, it is unforeseen if these traits will be enough to help the travelers reach their fabled destination.Journey to Wasteland begins as a simple tale that quickly evolves into a dark psychotropic fantasy thriller. It is a tantalizing cocktail of adventure, self-exploration, humor, romance, and a cast of quirky characters that will make you never want to leave their world.",
  "genres": [],
  "author": "Austin Miller",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/23200736-journey-to-wasteland"
}