{
  "title": "Cybersecurity Leadership: Powering the Modern Organization",
  "description": "Widely acclaimed and cited by practitioners and scholars alike as the definitive book on cybersecurity leadership and governance appropriate for anyone within or outside the cybersecurity discipline. Explains cybersecurity, Chief Information Officer, Chief Information Security Officer roles, the role of ethical leadership and the need for perpetual innovation in the discipline. This is listed as one of the best books of all time in cybersecurity as well as management by BookAuthority.The book provides an authoritative peer reviewed definition of cybersecurity based on models explained in the book. It is a significant reference book for leadership in any organization; however, it specifically addresses the challenges unique to technology and cybersecurity. The book provides a business-level understanding of cybersecurity and critical leadership principles for interdisciplinary organizational leaders and technology professionals. It should be the starting point of anyone seeking to enter the cybersecurity field or gain a business level understanding of what is required for anyone to successfully implement cybersecurity in an organization.\"The book defines cybersecurity ... It also continues to expand on the three key tenets of people, policy and technology. Hasib does well at describing such complex topics as the seven essential functions of a CIO, the challenges that occur when organizations place the CIO as a direct report to the CFO, and why the CIO and CISO must have a mutually supportive relationship. ...\" - - excerpt from review by DaMon Ross.\"Dr. Mansur Hasib brings an executive MBA to technology professionals in one book in Cybersecurity Leadership: Powering the Modern Organization. It is a significant reference book for leadership in any organization; however, it specifically addresses the challenges unique to technology and cybersecurity. The book provides a business-level understanding of cybersecurity and critical leadership principles for interdisciplinary organizational leaders and technology professionals. ...\" - excerpt from review by Dawn-Marie Hutchinson.\"Every sitting and aspiring CIO and CISO should read this book. As I read the book, I had frequent flashbacks to my past experiences as the FBI CIO and as a Wall Street executive. \"Cybersecurity Leadership\" is a holistic approach and roadmap for leaders to ponder and to follow as they strive to build a world class organization and an effective cyber program. Most of the lessons parallel what I've done in practice while others stimulate and almost mandate a lively conversation.\" - Chad Fulgham, Former CIO, FBI and one of the most respected global thought leaders.\"Mansur has a unique perspective since he has served as a CIO. If you are a newly appointed CIO/CISO, or if you are looking for those jobs, this is a book worth reading. It is well researched, a lot of personal experience and is a pretty quick read at 165 pages ..\" - Stephen Northcutt, Director Academic Programs, SANS Institute. \"... not just a book, but a go to manual on how to lead in the 21st century. From his model for CEO to his intuitive insights on electronic medium in healthcare is on target. If you are looking for answers to fundamental questions on management, leadership and ethics, this book is a must read. Thank you for sharing your years of experience with us.\" - Wayne Richards - Former graduate student.\"Mansur Hasib is the 'Peter Drucker\" of Cyber Security ..\" - Todd Bell, CISO, Board Advisor, International Cybersecurity Expert.\"I've had the pleasure of taking Dr. Hasib's class and learning about both Cybersecurity Management and Ethical Leadership. In an ever changing field, there are certain principles that we can apply consistently. Dr. Hasib covers these principles and does it in a way that (is) easy to learn and understand ..\" - B. Avery Greene - Former graduate student.\"..The dynamic of his classroom was so different than any class I've had. He is paving the way for future CEO's CISO's and entrepreneurs and is making a direct positive impact for cybersecurity students. Even though my background is not very technical, I was able to fully comprehend and excel in his classroom .. \" -Sarah Purdum - Former graduate student.\"...explains what an organization needs to know to implement cybersecurity governance.\" Council of Graduate Schools Testimony at the US Senate Appropriations Committee Meeting, April 29, 2014.\"...this book will change both the way we think about leadership and the way we understand information technology. I recommend this book highly to everyone.\" - Eric Schwartz - Executive Director at Advena World LLC.",
  "genres": [
    "Business"
  ],
  "author": "Mansur Hasib",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/23201316-cybersecurity-leadership"
}