{
  "title": "The Turn of the Story",
  "description": "Elliot Schafer has been carried off to a magical land and called to fight… but he has no intention of doing so. He is a little disappointed by the facilities on the Border, but he gets to meet Serene-Heart-In-The-Chaos-Of-Battle, an elf warrior, and Luke Sunborn, an annoyingly brave human warrior native to the magical land he’s crossed into. There are also mermaids, unicorns, harpies and assorted battles and political issues, with Elliot alternating between diplomatic genius and saying the completely wrong thing.Rees Brennan is an expert storyteller than can have you laughing out loud one moment and in tears the next. Her characters are tridimensional and varied and nobody is without good reason to do good and terrible things. \"The Turn of the Story\" was inspired in the magical worlds of Tamora Pierce, Diana Wynne Jones’s Witch Week, Harry Potter, Neil Gaiman’s The Books of Magic, Eva Ibbotson’s Which Witch? and Jill Murphy's Worst Witch but it's an original piece which awknowledges and comments in its influences, engaging with its predecessors both with the joy of a reader and the critical self awareness of a writer. Elliot is marked by SRB's distinctive voice and the reader is constantly delighted by his referencing of a world that, accross the Border, it's as fictional as the Border is for us, creating a metafictional loop in which the reader and Elliot are the only ones aware of the implications of the plot in its context in our reality. So far magic school was total rubbish.Elliot sat on the fence bisecting two fields and brooded tragically over his wrongs.He had been taken away from geography class, one of his most interesting classes, to take some kind of scholarship test out in the wild. A woman in odd clothing had ‘tested’ him by asking him if he could see a wall standing in the middle of a field. When he told her “Obviously, because it’s a wall. Walls tend to be obvious” she had pointed out other people blithely walking through the wall as if it was not there, and told him that he was one of the chosen few with the sight.“Are you telling me that I have magical powers?” Elliot had asked, extremely excited for a moment, and then he added: “… because I can’t walk through walls? That doesn’t seem right.”",
  "genres": [
    "Fantasy",
    "Young Adult",
    "LGBT",
    "Romance",
    "Fiction",
    "Queer",
    "Adventure"
  ],
  "author": "Sarah Rees Brennan",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/23199431-the-turn-of-the-story"
}