{
  "title": "Five Alarm Alphas: Eight Sexy All New Romances",
  "description": "Feeding the Flames ~ Leah Breamel: When chef Tabatha Morgan returns to Barnett Springs, her burning crush on firefighter Zac Buchanan flares back to life. Trouble is, Zac has made a promise to keep his distance from Tabby, so Zac’s best friend and fellow firefighter Quinn decides to help feed the flames of their mutual desire.Combustible ~ Lexxie Couper: Arson investigator, Desmond Russell is the best in Australia. Cool, calm and collected, nothing ruffles him. Until he meets Outback fire brigade captain, Jess Montgomery, a woman who ignites all his sexual desires. The initial spark will engulf them both…but will their hearts survive the inferno?Wet Down ~ Delilah Devlin: Out with the old, in with the new...Or so Sherry Thacker thinks. Problem is, her ex is always on her mind and right across the street. When a “Wet Down” ceremony to retire an old fire truck is planned by the city council she has to put aside her hurt and anger and do her job. Blake Thacker wants his wife back—in every way and he’ll use whatever means necessary to win her back. Sex is always best served WET.Two to Spark ~ Marie Harte: When a psychic predicts that a faulty toaster, a black cat, and the wrong address will bring Cooper together with Ms. Right, he shrugs off the notion as crazy. But before long, fate has something else in store for the sexy firefighter when a spark of attraction ignites into true love.Controlled Burn ~ Desiree Holt: Montana Wade was home after writing off the past ten years of her life, but she needed one more night of courage before she faced her family. Boone Crider, hotshot firefighter, was burned out form the rash of malicious fires. They thought one night as strangers would cure them both, but the fire they started between them soon became a barely controlled burn.Up In Smoke ~ Lissa Matthews: Half-brothers, Josh and Jay, share everything from a house, to a love of curvy, older women. So when their dream woman accidentally sets her kitchen on fire, they ride to her rescue, sirens blaring, promising to kindle flames that may never be extinguished.Rekindled ~ Cari Quinn: Some blazes refuse to be contained. It's been months since ex-firefighter Katie Kemp has spoken to her former lover and squad mate, Dash Carlton. But when a late night drive down memory lane leads her to a small fire at Dash's house, she realizes she's not willing to turn her back on the hottest flame of her life.Into the Fire ~ Shelli Stevens: Shannon has always prided herself on holding her own in the male dominated field of firefighting. She likes to be in control. Until she strikes a bargain with a sexy man from her past who makes her give it all up in the bedroom.While we want as many people to enjoy this collection of original novellas as possible, it is intended for mature readers, 18 years of age and older.",
  "genres": [
    "Anthologies",
    "Firefighters",
    "Erotica",
    "Contemporary",
    "Romance",
    "Contemporary Romance"
  ],
  "author": "Leah Braemel",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/23200208-five-alarm-alphas"
}