{
  "title": "The Victorious Opposition",
  "description": "Harry Turtledove’s acclaimed alternate history series began with a single question: What if the South had won the Civil War? Now, seventy years have passed since the first War Between the States. The North American continent is locked in a battle of politics, economies, and moralities. In a world that has already felt the soul-shattering blow of the Great War, North America is the powder keg that could ignite another global conflict—complete with a new generation of killing machines.“Freedom! Freedom! Freedom!” In 1934, the chant echoes across the Confederate States of America, a country born of bloodshed and passion, stretching from Mexico to Virginia. But while people use the word to greet each other in the streets, the meaning of “Freedom” has become increasingly unclear.Jake Featherston, leader of the ruling Freedom Party, has won power—and is taking his country and the world to the edge of an abyss. Charismatic, shrewd, and addicted to conflict, Featherston is whipping the Confederate States into a frenzy of hatred. Blacks are being rounded up and sent to prison camps, and the persecution has just begun. Featherston has forced the United States to give up its toeholds in Florida and Kentucky, and as the North stumbles through a succession of leaders, from Socialist Hosea Blackford to Herbert Hoover and now Al Smith, Featherston is feeling his might. With the U.S.A. locked in a bitter, bloody occupation of Canada, facing an intractable rebellion in Utah, and fatigued from a war in the Pacific against Japan, Featherston may pursue one dangerous proposition above all: that he can defeat the U.S.A. in an all-out war.The Victorious Opposition is a drama of leaders and followers, spies and traitors, lovers and soldiers. From California to Canada, from combat on the high seas to the secret meetings where former slaves plot a desperate strategy for survival, Harry Turtledove has created a human portrait of a world in upheaval. The third book in his monumental American Empire series, The Victorious Opposition is a novel of ideas, action, and surprise—and an unforgettable re-imagining of history itself.",
  "genres": [
    "Alternate History",
    "Fiction",
    "Science Fiction",
    "Historical Fiction",
    "Fantasy",
    "War",
    "Military Fiction"
  ],
  "author": "Harry Turtledove",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/101519.The_Victorious_Opposition"
}