{
  "title": "Learning to Love Myself: A memoir of healing after child sexual abuse",
  "description": "Viga Boland, author of the Gold Medal winning book \"No Tears for My Father,\" was a victim of incest at the hands of her biological father for 14 years. She told no one about the abuse until she was 65. Why did she stay quiet for so long, not even telling her husband or children about her past? How did they react when they finally found out? Before you open this book, find out by visiting the author's website at http://www.vigaboland.com and watching her TV interviews where she explains why she kept silent and how her family reacted.  What readers and other victims of incest should NOT expect from this book is therapy or guidance on how to heal yourself after childhood sexual abuse. This is, first and foremost, a continuing memoir of the author's life after she left her abusive home. It's a story of learning about true, unconditional love and how it frees a woman to finally become herself, to find out all she is capable of doing and achieving, and, in the process, learning to love herself. As she does, she rids herself of the shame and blame, and, finally, the secret she kept hidden for too long, as most victims of incest do.  What the author relates is her personal journey to healing; other victims are not as lucky. The author didn't write this book as therapy or help for others. But her story does offer hope to other victims that there is the chance of happiness if you believe in and follow the wisdom of the serenity prayer: Accept what you cannot change, change what you can, and have the wisdom to know the difference.  As to the questions so many readers ask and can't understand: \"Why didn't she speak up sooner?\" \"Why didn't she bring him to justice?\" Go ask the thousands of other victims of incest the same questions. Only they can understand the silence.  \"Learning to Love Myself\" is a memoir of rebirth and recovery from abuse. But even more than that, it is a love story: The love of a husband and wife, the love of children, and the love of self.",
  "genres": [
    "Memoir"
  ],
  "author": "Viga Boland",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/23202196-learning-to-love-myself"
}