{
  "title": "Time Gamers The Chameleon Quest",
  "description": "Mysterious teacher Miss Brady creates action adventure games for imaginative students. Time is the portal through which each game is entered and played, but while the students subconsciously gain much from the games, they inexplicably forget them after playing. When Miss Brady grants 12-year-old Tim Carter a game from her Slither Collection Tim realizes too late he is actually embarking on a highly dangerous quest. After an eventful and frightening transportation into the game, Tim and his multicultural group of friends find themselves hundreds of years into the future and left to cope for themselves on a rugged and creepy volcanic island. They are not alone. They soon discover Miss Brady's time game has glitches and is very dangerous. Secrets abound on the island and capacity for chameleon-like physical change can be either a survival mechanism or a deadly threat. Helped by unlikely game guide Magi, Tim and his Time Gamers must thwart ferocious game opponents. In order to defeat his foes and succeed in his challenging quest, Tim's leadership skills will be stretched to their limits. As the fast action moves from dense jungle to dark caves, from stormy skies to the boiling depths of the ocean, from beach to steamy mangroves and the looming crest of a sinister volcano Tim and the Time Gamers must develop selfless teamwork and new powers beyond their wildest imaginings. Unless the threat is immediate and deadly, Miss Brady will not permit the Time Gamers to leave the game until they are successful in their quest, but the game is no longer the simple adventure she originally created. When mortal danger inevitably becomes overwhelming, Tim and the Time Gamers must discover a way to complete their quest, thwart their ghastly opponents and save the island from a terrible fate. All the while, Tim has another heavy responsibilty; somehow he must find a way to summon the time funnel to return everyone safely back to real time and home.",
  "genres": [],
  "author": "Lesley Reed",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/23201495-time-gamers-the-chameleon-quest"
}