{
  "title": "Hospital: Man, Woman, Birth, Death, Infinity, Plus Red Tape, Bad Behavior, Money, God and Diversity on Steroids",
  "description": "A bestselling author and award winning journalist follows a year in the life of a big urban hospital, painting a revealing portrait of how medical care is delivered in America today.Most people agree that there are complicated issues at play in the delivery of health care today, but those issues may not always be what we think they are. In 2005, Maimonides Hospital in Brooklyn, New York, unveiled a new state-of-theart, multimillion-dollar cancer center. Determined to understand the whole spectrum of factors that determine what kind of medical care people receive in this country, bestselling author Julie Salamon spent one year tracking the progress of the center and getting to know the characters who make the hospital run. Located in a community where sixty-seven different languages are spoken, Maimonides is a case study for the particular kinds of concerns that arise in institutions that serve an increasingly multicultural American demographic. Granted an astonishing “warts and all” level of access by the hospital higher-ups, Salamon followed the doctors, patients, administrators, nurses, ambulance drivers, cooks, and cleaning staff. She explored not just the action on the ground—what happens between doctors and patients—but also the financial, ethical, technological, sociological, and cultural matters that the hospital community encounters every day. Drawing on her skills as interviewer, observer, and social critic, Salamon presents the story of modern medicine, uniquely viewed from the vantage point of those who make it run. She draws out the internal and external political machinations that exist between doctors and staff as well as between hospital and community. And she grounds the science and emotion of medical drama in the financial realities of operating a huge, private institution that must contend with issues like adapting to the specific needs of immigrant groups that make up a large and growing portion of our society. Salamon exposes struggles of both the profound and humdrum variety. There are bitter internal feuds, warm personal connections, comedy, egoism, greed, love, and loss. There are rabbinic edicts to contend with as well as imams and herbalists and local politicians. There are system foul-ups that keep blood test results from being delivered on time, careless record keepers, shortages of everything except forms to fill, recalcitrant and greedy insurance reimbursement systems, and the surprising difficulty of getting doctors to wash their hands. This is the dynamic universe of small and large concerns and personalities that, taken together, determine the nature of our care and assume the utmost importance. As Martin Payson—chairman of the board at Maimonides and ex-Time-Warner vice chairman—puts it: “Hospitals have a lot in common with the movie business. You’ve got your talent, entrepreneurs, ambition, ego stroking, the business versus the creative part. The big difference is that in the hospital you don’t get second takes. Movies are make-believe. This is real life.”",
  "genres": [
    "Nonfiction",
    "Medical",
    "Medicine",
    "Science",
    "Health Care",
    "Health",
    "Audiobook"
  ],
  "author": "Julie Salamon",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/2320120.Hospital"
}