{
  "title": "Napoleon: on War",
  "description": "This is the book on war that Napoleon never had the time or the will to complete. In exile on the island of Saint-Helena, the deposed Emperor of the French mused about a great treatise on the art of war, but in the end changed his mind and ordered the destruction of the materials he had collected for the volume. Thus was lost what would have been one of the most interesting and important books on the art of war ever written, by one of the most famous and successful military leaders of all time. In the two centuries since, several attempts have been made to gather together some of Napoleon's 'military maxims', with varying degrees of success. But not until now has there been a systematic attempt to put Napoleon's thinking on war and strategy into a single authoritative volume, reflecting both the full spectrum of his thinking on these matters as well as the almost unparalleled range of his military experience, from heavy cavalry charges in the plains of Russia or Saxony to counter-insurgency operations in Egypt or Spain. To gather the material for this book, military historian Bruno Colson spent years researching Napoleon's correspondence and other writings, including a painstaking examination of perhaps the single most interesting source for his thinking about war: the copy-book of General Bertrand, the Emperor's most trusted companion on Saint-Helena, in which he unearthed a Napoleonic definition of strategy which is published here for the first time. The huge amount of material brought together for this ground-breaking volume has been carefully organized to follow the framework of Carl von Clausewitz's classic On War, allowing a fascinating comparison between Napoleon's ideas and those of his great Prussian interpreter and adversary, and highlighting the intriguing similarities between these two founders of modern strategic thinking.",
  "genres": [
    "History",
    "Military Fiction",
    "Philosophy",
    "Military History",
    "France",
    "War"
  ],
  "author": "Bruno Colson",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/23200317-napoleon"
}