{
  "title": "The Other Side Of Sin",
  "description": "Tina, Elaine, Bella, and Maxine are four beautiful women struggling to gain money, success, fame, and love. They meet in central London at the Mayfair Nightclub, where they get to know the spectrum of politicians and celebrities to drug dealers, pimps, and gangsters. While they are taken around the world and living lavish lives, they are unsatisfied with their roles as playthings destined only to give pleasure. To reach the top, they continually risk their health, mental integrity, and their lives. The Other Side of Sin follows each woman as they try to break out of their soulless lives.TINA tries to escape her call-girl life and gets a position in a top Vegas casino. Tragedy strikes on her wedding day, when she and her new husband Nick Santini are shot on the steps of the church. After recovering, Tina tries to flee, but has in her possession some compromising documents that threaten her safety...ELAINE has just purchased an apartment when she meets Eddie Brown, an aspiring singer and a very ambitious man, but also penniless. He starts manipulating Elaine to get money, and she, blinded by her love and adoration for him, seems oblivious to the danger he puts her in, until she is caught at the Bangkok Airport…BELLA’s stunning looks make life easy for her. Her company is sought by many, including princes of blood. Whatever she desires is given to her, except one thing: her six-year-old son. His Greek tycoon father keeps him away from his mother because after their marriage she double-crossed him and lost everything. She is determined to reclaim her little boy, so she comes up with a plan to kidnap him--can she manage to get her son back?MAXIME always seems to fall in love with the wrong man: Paco, the Brazilian football player, almost killed her in a car accident outside Rio. She then meets Tymur, the Iranian prince on the run from the Khomeini regime with only a suitcase of diamonds to his name and a hefty prize on his head. Maxine suddenly finds herself on the run with him, trying to escape terrorists, but can they escape death?The Other Side of Sin is the ultimate adventure full of passion and intrigue, sacrifice and betrayal, love and death.",
  "genres": [],
  "author": "Maria Cowen",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/23199186-the-other-side-of-sin"
}