{
  "title": "Paradigms Lost",
  "description": "In a world of data manipulation and cyberspying, an investigative journalist find that&nbsp;the supernatural lurks!&nbsp; A major&nbsp;revision of&nbsp;Spoor's first novel, Digital Knight, with all new material.Being an expert in information searches, image processing and enhancement, pattern matching, and data forensics earned Jason Wood a lot of money &#8211; from private contracts and working with the police. And it was a nice, comfortable job most of the time.&nbsp;But then an informant showed up dead on his doorstep, a photograph didn't show someone who'd been in the viewfinder when the picture was taken, and Jason's world is suddenly turned upside-down.&nbsp; Against things that violate the very reality he thought he understood, Jason has only three weapons: his best friend Sylvie, his talent for seeing patterns&#8230; and his ability to think beyond the pattern and see a solution that no one else imagined. Against the darkness of the unknown, the greatest weapon is the light of reason.&nbsp; A vastly expanded and revised edition of Digital Knight, Ryk E. Spoor's first published novel, Paradigms Lost adds two brand new adventures for Jason and includes many chapters of additional material within the originals.About Ryk E. Spoor's Spheres of Influence:&#8220;Fast and entertaining action and a world that has the feel of Asimov&#8217;s Foundation series.&#8221;&#8212;Sarah A. Hoyt, author of the Darkship sagaAbout Ryk E. Spoor&#8217;s Grand Central Arena:&#8220;&#8230;an imaginative piece of space opera that&#8217;s set on a near-future Earth where artificial intelligence is taken for granted.&#8221;&#8212;Shiny Reviews&#8220;Grand Central Arena&#8217; is space opera in the grand old tradition . . . but with modern sensibilities and awareness of current speculations in cutting edge physics.&#8221;&#8212;Fantasy Book Critic About the Threshold Series by Ryk E. Spoor and Eric Flint&#8220;. . . fast-paced sci-fi. . . light in tone and hard on science . . .&#8221; &#8212;Publishers Weekly&#8220;. . . [the series is filled with] linguistics, biology, physics, and evolution further the story, as well as wacky humor, academic rivalries, and even some sweet romances.&#8221; &#8212;School Library Journal\n\nAbout Ryk E. Spoor's Phoenix Rising:&#8220;A winner! Great characters, and thrilling adventure. I want more!&#8221;&#8212;Ed Greenwood, best-selling author of the Forgotten Realms series&#8220;[E]xciting adventure, scary monsters, strange gods, and wondrous magic.&#8221;&#8212;Lawrence Watt-Evans",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Mystery"
  ],
  "author": "Ryk E. Spoor",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/23202292-paradigms-lost"
}