{
  "title": "Sasha",
  "description": "When it comes to relationships, I have really bad luck. Each time I meet a guy, I cross my fingers and hope he is at least halfway normal. I’m so tired of dealing with crybabies and freak shows that I could just scream. At this point, I’m so close to just joining a convent, taking the vow of chastity, and calling it quits with men entirely. Well, I probably don’t need to go to that extreme... I mean who am I kidding? There's no way I could be a nun. But becoming an old crotchety lady with 20 cats lurking around? Now THAT is a definite possibility. That is until I see him, my brown-eyed stallion man, swooping in to save me from an unforeseen wrinkly old balls attack, and then... he is gone. Well, not gone completely, because I can’t stop fantasizing about him. I fantasize about him so much that when I finally do see him again, I make a complete and total ass of myself. Several times in fact. How I do not drop dead of embarrassment right then and there is beyond me. So, remember I said I have really bad luck? Well, sit back, grab a glass of wine or your favorite mixed drink, and let me tell you how it all started, and how it all ends...   ~ Renaming my past boyfriends has always been a favorite pastime of ours. Why not give them a more fitting name, because who really needs to remember the guy’s real name? You want a name to remind you why it didn’t work, so at three in the morning on a drunken, horny night you don’t call him. Thinking you made a mistake. In this case, The Huffer left no room for regret.  ~ \"So are we going to talk about the fact that your jeans have ripped apart like a hooker's legs on a Friday night?\" he asks and starts laughing  ~ \"I could go for a Sinful 7, but only if you will share it with me.\" I say as I look up from the menu to Bash  \"I think I could be sinful with you\" he responds seductively. Bash gives me a look that I haven't seen yet. I think it is a lets go back to your apartment and get sinful look. I look back at the bartender and say \"One Sinful 7 please. Togo!\"",
  "genres": [
    "Romance",
    "Humor",
    "Romantic Comedy",
    "Contemporary Romance"
  ],
  "author": "Rae Matthews",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/23202363-sasha"
}