{
  "title": "The Angel of Death: An Extreme Horror Novel",
  "description": "Do you like EXTREME HORROR? This is it... Summary:This is book two in the, A Glimpse into Hell, series. The main character, Seth Coker, has invited a reporter, Wyatt Carter, to go on a road trip across America. Seth takes the man on a journey into his twisted world of vengeance filled with the most unimaginable and barbaric things that could only be found in the deepest and darkest parts of hell.The streets are no longer a safe haven for the wicked with Seth lurking in the shadows of the dark, waiting to bestow the most sadistic and over the top inhumane acts of vengeance that will stagger the mind.Offering up heart-pumping tales of revenge, suspense and horror in all its guises, this book is filled with dark humor, political incorrectness, gruesome and sadistic acts from beginning to end. Warning- may be disturbing to sensitive readers.- Originality –From the sheer ingenuity of the story to the appropriateness of the punishments makes this one of the most original story lines on the market.- Politically Incorrect –If you’re a P.C. type person, do not read this book. This also pertains to rapists, molesters and weirdoes--you'll just get your feelings hurt and leave a low rating with a BS review.- Gruesome and Horrifying -This book is not for the meek. Seth will take you on a journey through his twisted world of vengeance that is filled with the most gruesome and horrifying things imaginable and unimaginable.- Cruel and Unusual -If you like filthy sick, over the top sadistic inhumane acts of revenge that stagger the mind, this book will not disappoint.- Dark Humor -If you like gore and dark humor, this book will make you laugh and gag at the same time.- Suspense -From front to back, The Angel of Death is filled with one intense moment after another that is interwoven in a story line filled with humor. From the horrifying punishments of the mind and flesh to the main character’s unpredictable persona, it will keep you turning the page.  - Disturbing -So disturbing that it was difficult for my editor to stomach the content.- Fascinating -The punishments that Seth bestows on deserving criminals are not only very sadistic and gruesome, but cleverly inventive, unusual and shocking as well.- Mind Rape -The sick and twisted images in this book will be implanted into your mind, causing your brain to feel it has been assaulted.A brief comment from the author:I had a certain vision when I started writing The Angel of Death. I knew I wanted plenty of gore and dark humor, similar to The Angel of Vengeance, but I didn’t want to be repetitive and I wanted to portray Seth differently. I wanted him out of the gloomy chamber and mixed in with society. I wanted to humanize him, if possible. This book introduces another major character, Wyatt Carter, who brings Seth’s character to a completely new level. The chemistry between Seth and Wyatt far exceeded my expectations, resulting in a relatable story. From the beginning, this novel took a life of its own. It is a rollercoaster ride filled with mild-to-extreme gore, off-color comedy, dark humor, passion, and the most violent, sadistic and barbaric behavior imaginable. It also turned out to be very long, 635 Kindle pages, which wasn’t intentional, but as I stated, the story took a life of its own.My subject matter and humor is not for everyone, especially criminals (particularly molesters and rapists), and people that believe criminals have rights, or even people that are sensitive to extreme gore. I know this will occasionally cost me a low rating and BS review, even though I posted numerous warnings. In addition, I welcome advice from my readers. I write because of you, so I listen to criticism and praise. I’ve tried to create the best quality read possible, but unfortunately, most of us indie authors don't have the means to hire an expensive editing agency like the mainstream authors/ publishers use, and some of us rely on friends, family, fans and individuals that charge a reasonable fee. I can read a sentence ten times with a mistake, and my brain plugs in the correct word, even if it’s missing, so I’m useless as a proofreader. Even though I used editing software and numerous people have proofread it, there could be some errors remaining. If anyone wants to proofread/ edit my book(s), please email me.If you like The Angel of Death, please leave a review. The more positive reviews, the higher it is on Amazon’s search list, resulting in more people finding it. I truly appreciate the positive reviews, comments and support that I have been receiving, and that is the reason that I wrote this book, the second one in this series, and will continue writing as long as there are people that appreciate my work.If you have any questions, comments or advice, please feel free to contact me at wade.garrett.777@gmail.com.Best wishes,Wade H. Garrett ** Sold Exclusively on Amazon **",
  "genres": [
    "Horror",
    "Splatterpunk",
    "Dark"
  ],
  "author": "Wade H. Garrett",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/23202552-the-angel-of-death"
}