{
  "title": "The Anchor",
  "description": "Parker Hayes has just graduated at the top of his class from law school. He has an amazing new job and a killer new bachelor pad. Life is good! It’s damn near perfect. But something is missing. No matter how hard he tries, he hasn’t been able to get Nikki Reese off his mind. The mind-blowing, sex-filled weekend they spent together was more incredible than anything he’s ever experienced. But the brief encounter wasn’t enough, and now Parker finds himself musing over if he’ll ever see Nikki again. Just one more touch… Nikki Reese is Holly Spring’s beauty queen. She’s the kind of woman that can smile, taking a man’s breath away, all while flipping him the bird. Pageants are her life and she’s determined to make it to the Miss USA pageant no matter what. No. Matter. What. But what was supposed to be a fun-filled—no strings attached—weekend together in New York changes all of that. Months after their fling, Nikki discovers the incredible time they spent together will forever change her life. Two bold pink lines have written a fate she’s not sure how to deal with.  When Parker discovers the news, to her surprise, he rushes to Nikki’s side, ready and willing to help in any way he can. Seeing Nikki again sends Parker’s imagination running wild, but he keeps his cravings in check for the time being. The two agree to work together for the sake of their child, but neither can fight the intense, raw chemistry between them. But when Nikki’s abandonment issues threaten to divide them, brutally sending them drifting apart, Parker must become the one who keeps them grounded and intact. He must be The Anchor. She may feel like she’s shattered into a million little pieces, but he’s about to show her that letting him go again is not an option.",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "New Adult",
    "Contemporary",
    "Erotica",
    "Fiction",
    "Adult"
  ],
  "author": "B.N. Toler",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/23204259-the-anchor"
}