{
  "title": "Cinder & Ella",
  "description": "Cinder458: Your blogaversary is coming up, right? EllaTheRealHero: Do all those Hollywood friends of yours know you use words like blogaversary?Cinder458: Of course not. I need your address. Got you a blogaversary present.Cinder got me a gift?My heart flipped.Not that I was in love with my Internet best friend or anything. That would be utterly ridiculous. The boy was cocky and stubborn and argued with everything I said just to be infuriating. He also had lots of money, dated models—which meant he had to be hot—and was a closet book nerd.Funny, rich, hot, confident, book lover. Definitely not my type. Nope. Not at all.Yeah, okay, fine, so he wasn’t my type by default because he lived in California and I live in Massachusetts. Whatever.Cinder458: Hello? Ella?? Address??EllaTheRealHero: I don’t give out my address to creepy Internet stalkers. Cinder458: I guess you don’t want this autographed first-edition hardback of The Druid Prince, then. Shame. I had it signed it to Ellamara when I met L.P. Morgan at FantasyCon last week, so I can’t try to impress any other girls with it.Not my type. Not. My. Type.What would you do if your anonymous Internet best friend turned out to be Hollywood’s hottest celebrity? It’s been almost a year since eighteen-year-old Ella Rodriguez was in a car accident that left her crippled, scarred, and without a mother. After a very difficult recovery, she’s been uprooted across the country and forced into the custody of a father that abandoned her when she was a young child. If Ella wants to escape her father’s home and her awful new stepfamily, she must convince her doctors that she’s capable, both physically and emotionally, of living on her own. The problem is, she’s not ready yet. The only way she can think of to start healing is by reconnecting with the one person left in the world who’s ever meant anything to her—her anonymous Internet best friend, Cinder.Hollywood sensation Brian Oliver has a reputation for being trouble. There’s major buzz around his performance in his upcoming film The Druid Prince, but his management team says he won’t make the transition from teen heartthrob to serious A-list actor unless he can prove he’s left his wild days behind and become a mature adult. In order to douse the flames on Brian’s bad-boy reputation, his management stages a fake engagement for him to his co-star Kaylee. Brian isn’t thrilled with the arrangement—or his fake fiancée—but decides he’ll suffer through it if it means he’ll get an Oscar nomination. Then a surprise email from an old Internet friend changes everything.With a heartwarming online celebrity romance reminiscent of Jennifer E. Smith’s This Is What Happy Looks Like, bestselling young adult author Kelly Oram has struck gold with her new adult contemporary retelling of the timeless classic Cinderella.",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary",
    "New Adult",
    "Retellings",
    "Contemporary Romance",
    "Audiobook"
  ],
  "author": "Kelly Oram",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/23203752-cinder-ella"
}