{
  "title": "Project X",
  "description": "Morgan Bentley is a bastard. Always was and always will be.  At least that’s what Matthew Hopkins thinks. Unfortunately, Morgan is also a brilliant law student, and easily eclipses Matthew, academically and socially.  Matthew insists he hates Morgan. According to Matthew’s best friend, Cory, perhaps he doth protest a bit too much.  Cory has received the chance of a lifetime in the form of an internship with ITM—Information Technology and Medicine—the prestigious research company where Morgan’s father is the CEO. Too inquisitive for his own good, the naturally curious Cory stumbles on a deadly secret inside of ITM. What he has learned will tip the balance of everything, but for good or bad?  Just what is the mysterious Project X?  What is Morgan’s involvement?  Matthew has to sort fact from fiction, friend from foe, as his world is turned upside down and inside out, and nothing can be the way it was.   About the Author  Nephylim was born into a poor mining family in the South Wales Valleys. Until she was 16, the toilet was at the bottom of the garden and the bath hung on the wall. Her refrigerator was a stone slab in the pantry and there was a black lead fireplace in the kitchen. They look lovely in a museum but aren’t so much fun to clean.  Nephylim has always been a storyteller. As a child, she’d make up stories for her nieces, nephews and cousin and they’d explore the imaginary worlds she created, in play.  Later in life, Nephylim became the storyteller for a re-enactment group who travelled widely, giving a taste of life in the Iron Age. As well as having an opportunity to run around hitting people with a sword, she had an opportunity to tell stories of all kinds, sometimes of her own making, to all kinds of people. The criticism was sometimes harsh, especially from the children, but the reward enormous.  It was here she began to appreciate the power of stories and the primal need to hear them. In ancient times, the wandering bard was the only source of news, and the storyteller the heart of the village, keeping the lore and the magic alive. Although much of the magic has been lost, the stories still provide a link to the part of us that still wants to believe that it’s still there, somewhere.  In present times, Nephylim lives in a terraced house in the valleys with her son and her two cats. Her daughter has deserted her for the big city, but they’re still close. The part of her that needs to earn money is a lawyer, but the deepest, and most important part of her is a storyteller and artist, and always will be.",
  "genres": [
    "M M Romance"
  ],
  "author": "Nephylim",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/23206692-project-x"
}