{
  "title": "Cover Me",
  "description": "Sometimes love can give you a second chance...   Bruce Harrison isn't just a Rock Star, he's the Rock Star. The penultimate bad boy rocker, he's since grown up and cleaned up his act. He's given up partying and loose women. His health is great and he has more money that he could spend in twenty lifetimes. The trouble is, he's never been less satisfied.  Katrina Henley has a secret. She's running from a less than perfect past and she has responsibilities to fulfill that would overwhelm a lesser woman. But the talented beauty is no pushover when it comes to men. So when the legendary Bruce Harrison offers her a job, she makes it clear that he's getting her voice and that's it.  Bruce isn't easy to dissuade though. He wants Katrina more than anything he's wanted in his life and he's determined to persuade the sultry singer to give him a chance. Even if he wins her love, will he be able to accept her secret and everything it entails?  Excerpt:  The girl was asleep in the car. He stared open mouthed as she moved in her sleep. She looked like a sculpture- only one that was warm and alive. She shifted and her blouse got caught, pulling the neckline down. He swallowed at the sight of her luscious curves as her cleavage came into view.  Bruce was still staring at her when he realized something else.  She was awake.  His eyes snapped to hers and he smiled sheepishly. She looked alarmed and then annoyed, like an angry kitten.  She yanked her top up and stepped out of the car.  He leaned against the side and watched her, further irritating her. God, she was cute when she was mad.  \"You're here early.\"  She glanced over her shoulder at him while she locked the car. As if anyone would want to steal that heap of junk. It didn't even really look safe to drive.  \"I couldn't risk being late.\"  \"Where are you coming from?\"  \"Canoga Park.\"  He stared at her.  \"That's hours from here.\"  She shrugged gracefully. Obviously she didn't think he'd care that she was driving three hours in the middle of the night to get to rehearsal. But he did care. He hated the thought of her doing that. The risk she was taking.  \"You can't do that every day. Get a room near here.\"  She frowned and stared at her shoes. He glanced down. Her black ankle cowboy boots were literally falling apart- barely holding on by a thread.  \"We'll pay for it. We need you at your best.\"  \"It's fine. I- I just need a cup of coffee.\"  He raised an eyebrow.  \"No coffee. Just tea. It's too drying on your cords.\"  Her gorgeous lips opened in surprise. Harry had been right. The girl was really raw. She didn't even know how to look after her voice.  \"Come on, I'll show you where they hide the good stuff. I'm Bruce by the way.\"  He held out his hand and she stared at it, then glanced back at his face. Finally she reached out and he closed his hand over hers. Her skin was incredibly soft and silky. The bones of her hand were delicate, like a bird’s. He felt a sudden wave of protectiveness wash over him.  \"I'm Kat. Katrina.\"  As she pulled her hand back he felt the telltale callouses on her fingers.  \"Kat. It suits you. So do you play too?\"  She nodded and followed him to the entrance. He gestured that she should walk ahead of him.  He was doing his best to put her at ease as they walked through the darkened studio, but it wasn't working. Her narrow back was stiff and straight. Her eyes were narrowed and suspicious.  Crap, if only she hadn't caught him ogling her in the car.",
  "genres": [
    "Romance",
    "Contemporary",
    "Musicians"
  ],
  "author": "Joanna Blake",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/23206514-cover-me"
}