{
  "title": "Hunted",
  "description": "Deep in the heart of New York City’s netherworld, a horrible disease is ravaging the vampire community. The Vampire Council is on a crusade to obliterate those infected, and Harrow Gates is target Number One. The unwitting source of the plague, he suffers from the same nightmarish symptoms as his victims. The world he’d been thrust into was cold, cruel, and intent on eradicating him, and the legions of afflicted vampires he created with his bite. A bounty hanging over his head, satisfying his hunger has become an enormous challenge for Harrow. The less he feeds, the more hideous and painful his lesions become. Constantly running for his life and learning new tricks to survive, Harrow is in no position to refuse when Pritchard Tack offers him a unique opportunity. Pritchard not only gives Harrow a new beginning, but also a purpose and a chance to rectify the chaos he created in the vampire world. However, the multibillionaire has an agenda of his own.Jordan is a reluctant new vampire and a woman on a mission. After the demise of her family and her own transformation at the hands of Goran, the ruthless leader of the Vampire Council, her only focus is revenge. Constantly faced with one frustrating dead-end after another, a stroke of luck leads her to an underground facility that she suspects is the lair of the monster for whom she is looking.  Upon learning more about the truth behind the secret bunker, Jordan must fight against her growing feelings of friendship and concern for the facility’s inhabitants. One man in particular threatens to pull her heart away from her sworn mission. There is something behind Harrow’s dark lenses that unsettles the hardened female. Once again, she trembles and hungers for something other than red-stained revenge. Is love strong enough to override her hate-fueled thirst for vengeance?",
  "genres": [
    "Vampires",
    "Paranormal Romance",
    "Fantasy",
    "Paranormal"
  ],
  "author": "Lorenz Font",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/23206881-hunted"
}