{
  "title": "At Hell's Gates",
  "description": "When evil overflows from the deepest, fiery pits, the battle will be At Hell’s Gates…Whether you are a zombie aficionado, or you feed on horror, there is something for everyone. We've summoned some of the top Zompoc authors, masters in horror, and even some new talent to strike fear into even the most jaded soul. Dare you look, let alone approach, the dreaded gates? Each skillfully crafted vignette showcases previously created worlds in the individual author’s works. If you've ever yearned for more back story or ached to learn what happened to a peripheral character; your wait is over. But, as they say, “Be careful what you wish for”. Once it has been seen, you cannot go back. And once infected; there is no cure. This collaboration is in honor of the brave men and women in our Armed Services who willingly lay down their lives for our freedom. Words could not possibly express our undying gratitude, so we have banded together, doing what we do best, to show our appreciation. All proceeds from the sale of this anthology will go to The Intrepid Fallen Heroes Fund, a non-profit organization whose sole purpose is to serve wounded soldiers and their families. This is for you, those who have truly been…At Hell’s Gates.For more information on this release, future anthologies in the At Hell's Gates series, and how to get involved with the project, visit www.athellsgates.com. For more information on The Intrepid Fallen Heroes Fund, visit www.fallenheroesfund.org.Stories from seventeen of your favorite authors, and set in the worlds you know! Black Crow Laughing by Devan SaglianiTyler, a high school student living with his family in Pasadena, risks his life during the zombie apocalypse to find and rescue his girlfriend Emily. Stuck together in a small wooden shack behind her parents house they wait for the right moment to make a break away from the hungry hordes pressing in and threatening to tear them to pieces at any moment.Black Crow Laughing is set in the Undead L.A. universe. Exploding Shit Zombies by Stephen KozeniewskiIn the space of a 24-hour period, Stephen Kozeniewski was once asked: \"Can zombies poop?,\" \"Would you survive your own zompocalypse?,\" and \"Would you be willing to reinvent the zombie yet again?\" In answer to all three he is proud to present EXPLODING SHIT ZOMBIES, a story which delivers exactly what it says on the tin. Outlining the fate of the residents of Kozeniewski's current home Harrisburg, PA, this story expands the universe of his magnum opus, THE GHOUL ARCHIPELAGO.No Shelter by Lesa Kinney Anders and Matthew KinneyA charity mission at a homeless shelter soon becomes a nightmare as the dead begin to walk in Lansing, Michigan. A group of bikers led by an aging Vietnam vet makes a stand as the plague spreads and the reanimated dead fight to get inside. The carnage that ensues rocks the foundation of the group’s beliefs, and they begin to question their purpose in the world.Ollie Ollie Oxen Free by Shana FestaAfter dismissing shocking news coverage as marketing for Southwest Florida’s upcoming Zombie-Con, Ollie Laurence wakes to discover she was wrong – dead wrong. The newly risen undead are knocking at her door.In what has been the most-asked question from fans of the Time of Death series, Ollie Ollie Oxen Free will unlock the mystery of Ollie’s fate. Will she survive the outbreak? Or will she fall victim to the hordes, only to rise again?Nefarious by Stevie KopasMoira Eckhart has lost everything, including her mind. Nefarious tells the story of the unraveling of a trophy wife thrust into the zombie apocalypse, a mother with an undying love for her children, and how she will do anything to ensure those children remain cared for, despite the apocalypse unfolding beyond her mansion walls. Remember: The end of the world is not glamorous, even for the glamorous Moira Eckhart.Set in the world of The Breadwinner Trilogy by Stevie Kopas, this short story gives the reader a harrowing glimpse into the unraveling moments of Book One’s most detestable character. “I chose the world of The Breadwinner and the character of Moira, simply because she has one of the smallest parts in the book and still left one of the biggest marks on my readers. I wanted to give them more. I wanted to deliver them the moment during the zombie apocalypse where Moira officially crosses the point of no return.” Says Kopas, of Nefarious.Home Defense by James CrawfordFrank and Shawn are characters from my Blood Soaked series, available on all e-pub formats. The Blood Soaked novels follow the gruesome, raunchy, comedic, and touching moments of his community as they cope with life beyond the appearance of zombies.This short story takes place well before the events in my first novel, Blood Soaked and Contagious, available on all e-pub formats, and Audible. Frank has only been a member of the survivor’s community for a month or so, but is quickly gaining their trust, and making friends.Stories from the Apocalypse by J. RudolphThese entries are an example of how Cali viewed surviving life following the end of the world, and how she continued to try to hold on to the human side of her even though humanity was dying out. The Reanimates, the series that focuses on Cali's story, will be released by Permuted Press in 2016.Journal of the Undead: The Beginning by S.G. LeeDecades prior to the uprising in Littleville and the outbreak in New York, Dr. George E. Mitchell wrote, Journal of the Undead: A Survivor’s Guide. Before he was able to write his guide, he had to live it.Princess and the Flea by Paul ManneringIn the world of Tankbread, where intelligent zombies have ruled for 200 years, a stranger from a distant land arrives on an isolated farm and finds a shocking secret.Hour of the Beast by Joe MartinThis tale explores estrangement, betrayal, loss, and isolation, all from the perspective of a young wife heavy with child, whose world crumbles as she makes dark discoveries about a husband haunted by his misdeeds.The Err Apparent by Tim MarquitzSent to investigate a satanic cult blamed for a spate of brutal murders, Frank “Triggaltheron” Trigg finds nothing is what it seems. A supernatural creature has been set loose in the woods of Ruidoso, and it won’t stop until the last of its prey is dead. Unfortunately for Frank, he’s been added to the list of victims.Cracked by Rachel AukesAs the world succumbs to insatiable zombies, the remnants of the U.S. military forces switch gears from stopping the spread of infection to eradicating infected zones. A National Guard platoon, led by Captain Tyler \"Maz\" Masden, is trapped in Des Moines and has ninety minutes to escape the city before the Air Force rains H6 hellfire upon their heads. Undead Britain (Surviving The Evacuation) by Frank TayellOne by one nations fell. In Britain, the press was nationalised and broadcast the message; ‘There are no reported outbreaks in the UK’. Martial law, rationing and curfews were implemented. It was not enough. The inland cities of Britain were to be evacuated to the more defensible, and more easily supplied coast. Charlotte and Trevor decided not to take their children on the evacuation. They thought they would be safe. When their food runs out they are forced to scavenge for scraps left behind after weeks of rationing, they find out how wrong they were. The Emergency Broadcast lied. Zombies stalk the streets of Britain. Nowhere is safe from the undead.The Weight of Darkness by Sean T. SmithSet in the smashed world of the WRATH Trilogy, this story belongs to Sonja Larson, a battle hardened soldier fighting to survive one night and one day in the Vatican while THE WEIGHT OF DARKNESS crushes in.Seth by Jacqueline DrugaWhen a mysterious stranger appears at a coffee shop, Psychic Jena believes she she merely helping out a man in need. There is more than meets the eye and the deeper she digs, the darker things get.Fertile Land by Jacqueline DrugaOn the other side of the yellow zone, lies a forbidden world that was at one time peaceful. Until the giants took over. Now a young warrior, his tribe starving, must brave the dangerous world of Nam to find fertile land for his tribe.The Wife by Jacqueline DrugaMariam was fed up. Her perfect life just wasn't perfect for her. And with years of pent up frustration, she reclaims her life.Welcome to Hell by Sharon StevensonIt’s Halloween and twin demon trackers Shaun & Sarah Gallows are sent to take care of a vampire problem in White Oaks. It’s a busy Friday night and Shaun would rather be sleeping, but there’s no rest for the wicked when Sarah’s in charge. This story is set before the first novel in my Gallows modern fantasy series and follows the twins on their first job after Shaun’s near fatal encounter with a vicious pack of wolves. I wanted to write it as an introduction to the characters for those who haven’t met them and as a little extra adventure for those who have.",
  "genres": [
    "Horror",
    "Zombies",
    "Anthologies",
    "Short Stories",
    "Fiction"
  ],
  "author": "Monique Happy",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/23208570-at-hell-s-gates"
}