{
  "title": "In the Beginning",
  "description": "THE VELVET BOOK, YA/NEW AGE Fantasy. An incredible debut fantasy novel from author, Jacquelyn Verze-Reeher.All her life she has been told by society, she isn’t good enough. She’s not smart enough, not pretty enough, not rich enough, not worth the worlds time, or care. So now, at the age of seventeen she’s begun to believe them. She has fallen into the mentality of why bother, why try, why give a damn. She will end up just like her mother waitressing, living paycheck to paycheck, until the day she dies. So why try?Amy and her younger brother John grew up in a broken home with only their mother for guidance. Her father a military officer left them destitute for another woman. She grew up in clothes from charity shops, in shoes with holes in them and in a tiny studio apartment in San Francisco’s Mission district.When her father is finally pressured into caring about his first two children, he decides to send them to a wealthy private boarding school. John is more than thrilled to make his father proud, but Amy sees no point to it. “I’ll end up just like mom anyway, why bother?”Amy quickly finds out there’s much more to this school than meets the pamphlet. Amy, her brother John, and their roommates end up being dragged through a portal to another world, where they are the only ones who could save billions (including those on in our world) from becoming enslaved body, mind, and soul to a wicked wizard out to prove to the world he is their rightful god. Amy must now go on a journey of self-discovery. With Vampires, talking wolves, Dragons, witches, and other vile creatures all after her, all pulling her one way or another she must learn her self-worth…and quickly. For the sake of everyone’s soul.Join Amy, John, Melody, and James in this harrowing tale of self-discovery, through JVR’s fantastical world of Mirunder. A tale that will take hold, and be sure to never let go.",
  "genres": [],
  "author": "Jacquelyn Verze-Reeher",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/23206389-in-the-beginning"
}