{
  "title": "Simple Courage: A True Story of Peril on the Sea",
  "description": "“HEAVEN HELP THE SAILOR ON A NIGHT LIKE THIS.”–old folk prayerIn late December 1951, laden with passengers and nearly forty metric tons of cargo, the freighter S.S. Flying Enterprise steamed westward from Europe toward America. A few days into the voyage, she hit the eye of a ferocious storm. Force 12 winds tossed men about like playthings and turned drops of freezing Atlantic foam into icy missiles. When, in the space of twenty-eight hours, the ship was slammed by two rogue waves–solid walls of water more than sixty feet high–the impacts cracked the decks and hull almost down to the waterline, threw the vessel over on her side, and thrust all on board into terror.Flying Enterprise’s captain, Kurt Carlsen, a seaman of rare ability and valor, mustered all hands to patch the cracks and then try to right the ship. When these efforts came to naught, he helped transfer, across waves forty feet high, the passengers and the entire crew to lifeboats sent from nearby ships. Then, for reasons both professional and intensely personal, and to the amazement of the world, Carlsen defied all requests and entreaties to abandon ship. Instead, for the next two weeks, he fought to bring Flying Enterprise and her cargo to port. His heroic endeavor became the world’s biggest news.In a narrative as dramatic as the ocean’s fury, acclaimed bestselling author Frank Delaney tells, for the first time, the full story of this unmatched bravery and endurance at sea. We meet the devoted family whose well-being and safety impelled Carlsen to stay with his ship. And we read of Flying Enterprise’s buccaneering owner, the fearless and unorthodox Hans Isbrandtsen, who played a crucial role in Kurt Carlsen’s fate.Drawing on historical documents and contemporary accounts and on exclusive interviews with Carlsen’s family, Delaney opens a window into the world of the merchant marine. With deep affection–and respect–for the weather and all that goes with it, he places us in the heart of the storm, a “biblical tempest” of unimaginable power. He illuminates the bravery and ingenuity of Carlsen and the extraordinary courage that the thirty-seven-year-old captain inspired in his stalwart crew. This is a gripping, absorbing narrative that highlights one man’s outstanding fortitude and heroic sense of duty.“One of the great sea stories of the twentieth century… [a] surefire nautical crowd-pleaser.”--Booklist é (starred review)“Frank Delaney has written a completely absorbing, thrilling and inspirational account of a disaster at sea that occasioned heroism of the first order. In the hands of a gifted storyteller,the ‘simple courage’ of the ship’s captain and the young radio man who risked their lives to bring a mortally wounded ship to port reveals the essence and power of all true courage–a stubborn devotion to the things we love.”–Senator John McCain",
  "genres": [
    "History",
    "Nonfiction",
    "Survival",
    "Audiobook",
    "Memoir",
    "Adventure",
    "Biography"
  ],
  "author": "Frank Delaney",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/1139222.Simple_Courage"
}