{
  "title": "Dakota Skies",
  "description": "Born in the wrong time...  In 1875 Dakota, Sheriff Jamie Carter has to hide his interest in men, even from his gutsy twin sister, Anna. On a good day, the truth can mean a bullet between the eyes, and on a bad, one in the back.  A man on a mission...  Jamie leaves Anna in charge of Blackrock and he hits the bounty hunting trail, along with his faithful equine companion, Houston. Five territories, scores of ‘Wanted’ posters, and many bullets later, his path unexpectedly converges with that of enigmatic loner, Kit Brooks.  Two men with one soul...  Will the smoldering fire between them rage into an inferno and break down protective barriers, allowing them to find love? Or will it separate and kill them?  Beneath Dakota skies...  Jamie and Kit’s story is a sweeping saga of cowboys, Indians, persistent broads, and vengeful villains, where the cowboys aren't always the good guys, and love can’t be taken for granted.   About the Author  Taylin Clavelli lives in the United Kingdom, about 15 miles south of Birmingham, and a short journey from the world famous Cadbury’s Chocolate factory. She’s married with children and loves her family with all her heart.  Her love of books has been a long standing affair, with Taylin liking nothing better than to lose herself in an imaginary world.  Until she met Lily Velden, she never considered trying her hand at writing. However, after talking ideas, Lily encouraged her to put pen to paper—or rather, fingers to keyboard. Since, with a few virtual kicks in the right place, she hasn’t stopped. Her confidence eventually led to her writing an original work for submission.  Now she absolutely adores immersing herself into the characters she creates, and transferring the pictures in her brain to paper, finding it liberating, therapeutic, and wonderful.  Outside of writing, her interests include; martial arts (she’s a 2nd Degree Black Belt in Taekwon-do), horse-riding, and movies, all of which facilitates her love of a wide variety of genres. Her action heroes include Jet Li and Tony Jaa—finding the dedication these men have for their art combined with their skill both amazing and a privilege to watch. If pressed, she’ll admit to thinking that the screen entrance of Johnny Depp as Captain Jack Sparrow in the Pirates of the Caribbean – Curse of the Black Pearl, and Shadowfax in LOTR, to be the greatest screen entrances ever. Her all-time favorite movies are Star Wars and Lord of the Rings.  The simple things in life that make her day, putting a smile on her face  Laughter - especially that of her children.  The smell of lasagne cooking – it makes her mouth salivate.  The dawn chorus – no symphony ever written can beat the waking greetings of the birds.  Taylin Clavelli can be found     taylinclavelli@gmail.com",
  "genres": [
    "M M Romance",
    "Historical",
    "Westerns",
    "Gay",
    "Historical Romance",
    "Friends To Lovers"
  ],
  "author": "Taylin Clavelli",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/23206246-dakota-skies"
}