{
  "title": "Gay Unicorns: Three Book Collection",
  "description": "Collecting three tales of hardcore, gay unicorn sex, \"Gay Unicorns\" is a wild bundle for someone looking to explore your beastly side. These stories include rough sex, anal, horn sex, oral, dub con, mind control, cream pies and more! Not suitable for under 18! This collection includes: Unicorn Forced Me Gay Charlie is a camp leader at the Top Cloud Camp in Michigan, watching over campers as a summer job. Bored and trying to excite up their lives at the kid camp, Charlie and his friend Dwayne end up sneaking off and drinking in the woods one night. Charlie vividly remembers seeing what he thinks was a unicorn, who happened to unlocked his wildest fantasies. He uses the rest of his summer to find this beast that brings out his wild side. This is a 4,000 word hardcore short erotic novel. It includes anal, oral, mind control, horn sex, cream pies, straight-to-gay and more! Punished By The Dark Unicorn After a major breakup with his ex-boyfriend, Adam takes a spur of the moment trip to Finland! On his surprise Nordic vacation, Adam goes kayaking through the labyrinth of lakes and discovers a beast he never knew existed! A Dark Unicorn! Something about this creature brings out his wildest and darkest fantasies which he wants to make a reality! This is a 3,500 word hardcore gay erotic novel. It includes- horn sex, rough sex, anal, oral, cream pies and more! First Time With A Unicorn Ryan, a freelance oil painter from Maine, is on a road trip across the country looking for inspiration for his next collection. While stopping in the mountainous regions in Montana, Ryan comes across a beast he has only ever read about in fairy tales, a unicorn! His road trip (and his body) are turned upside down when this unicorn decides what he wants to do to Ryan. This is a 3,000 word hardcore gay erotic novel. It includes- unicorn sex, anal, oral, mind control, horn sex, cream pies and more!",
  "genres": [],
  "author": "Hunter Fox",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/23207402-gay-unicorns"
}