{
  "title": "Christmas in the Duke's Arms",
  "description": "The Duke’s Arms is an undistinguished little inn in the tiny village of Hopewell-on-Lyft. But one Christmas season sees both inn and village seething with adventure, intrigue, rabbits, and, above all, love as four couples find Yuletide happiness. An anthology of Regency novellas by Grace Burrowes, Shana Galen, Carolyn Jewel and Miranda Neville.A Knight Before Christmas by Grace BurrowesWith her year of mourning at an end, Penelope Carrington must remarry in haste, or her portion of her late husband's estate won't be enough to dower her younger sisters. Shy, handsome man of business Sir Leviticus Sparrow longs to give Penelope a marriage proposal for Christmas—and his heart—but Sir Levi must first foil the other bachelors scheming to meet Penelope under the mistletoe in his place.In The Duke’s Arms by Carolyn JewelWhat's a Duke to do when he's made an awful impression on the love of his life?The Duke of Oxthorpe lost his intensely guarded heart to Miss Edith Clay when Edith’s rich cousin sought to attach the duke’s marital interest. So smitten is Oxthorpe with the former poor relation that he’s gone through intermediaries to sell Edith a property adjoining the ducal seat.Edith doesn't much care for the haughty duke, but as Christmas approaches, Oxthorpe reveals himself to be reserved rather than arrogant, considerate, and—blame the mistletoe!—an accomplished kisser. Will Edith hold Oxthorpe’s earlier behavior against him, or will she learn that the best holiday gifts can be the most unexpected?Licensed To Wed by Miranda NevilleIf Lord Carbury could learn to take no for an answer, his marriage proposal might earn him a yes!Wyatt, Viscount Carbury is much too busy to court a bride, but when his childhood neighbor, Robina Weston, is left orphaned and penniless, Wyatt dutifully adds marrying Robina to his list of responsibilities. Wyatt is dismayed to learn that for Robina, poverty and pride are preferable to sharing life with an arrogant, infuriating man who always thinks he knows best.When Wyatt and Robina must endure Christmas in the country together, antipathy turns to interest, and then to unexpected attraction. Will they fight their feelings, or yield to the surprising gifts the holidays offer?The Spy Beneath The Mistletoeby Shana GalenFledgling spy Pierce Moneypence seeks a highwayman and the key to Eliza's heart...When weapons designer Eliza Qwillen (Q) and clerk to the mysterious M, Pierce Moneypence, arrive in the English countryside, they're unprepared for the dangers that await. The operatives are intent upon capturing the highwayman styling himself as the New Sheriff of Nottingham. Secret rendezvous, mistaken identities, and cat-and-mouse games challenge these fledgling agents, but rediscovering their passion for each other is the most rewarding mission of all.",
  "genres": [
    "Anthologies",
    "Romance",
    "Holiday",
    "Historical Fiction",
    "Novella",
    "Christmas",
    "Historical Romance"
  ],
  "author": "Grace Burrowes",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/23211998-christmas-in-the-duke-s-arms"
}