{
  "title": "El espanto de Arganza. Una novela de los Mitos de Cthulhu",
  "description": "No hay muchas historias relacionadas con los mitos de Cthulhu creados por Lovecraft que se desarrollen en España. A la cabeza se nos viene aquella maravillosa novela de 1981 firmada por Ramón Gimeno Lizasoain, El chozo del obispo, un mito de pura raigambre campera. Si ha habido más aventuras de este estilo, que supongo que las habrá, para mí están todavía por descubrir. De todos modos, esta novela, primera novela de Hugo Magenis, cumple sobradamente con todos los requisitos para convertirse en española de los mitos. Ambientada en una Extremadura de lo más conocida, no necesita recurrir, como hiciera Frank Belknap Long en su maravillosa novela El horror de las colinas , a los sueños del maestro de Providence para dar forma a los suyos propios. Aquí no hay legionarios romanos, sino hombres de a pie que, como siempre en las aventuras que describen la guerra que enfrenta a hombres y monstruos por el control de nuestro mundo, se las ven y se las desean para librarse de los Dioses Primigenios abandonados en nuestro mundo y con toda una cohorte de servidores dispuestos a servirles y sacarles del olvido en que están sumidos desde que perdieron aquella guerra que les enfrentó con otros dioses de su misma calaña. El hombre que da con lo que parece ser un antiguo altar en una casa señorial en un pueblo de Cáceres, un hombre normal, está muy lejos de suponer que ese altar lo que no parece, que no es un altar cristiano, sino de un altar dedicado a dioses más antiguos que los que conocemos y que están a punto de ser devueltos al mundo para que puedan dominarnos de nuevo, esclavizarnos y aniquilarnos como las simples alimañas que somos a su entender y que andamos correteando por unos jardines que les corresponden por derecho divino para toda la eternidad. Menos mal que cuenta con la ayuda de sus amigos, con la de los hombres de la Universidad de Miskatónic y con la del mismísmo Philippe Houart de Louvrecraque, gran sabedor de deidades antiguas. Así, cualquiera.",
  "genres": [],
  "author": "Hugo Magenis",
  "average_rating": "2.50",
  "url": "https://www.goodreads.com/book/show/23212283-el-espanto-de-arganza-una-novela-de-los-mitos-de-cthulhu"
}