{
  "title": "There Are No Men",
  "description": "Divorced thirty-something Claire doesn’t know who’s in her dating pool—but she’s doing her best to avoid shark infested waters. Leaving her clueless and insensitive husband behind was a smart move after losing her fertility, but now she’s riding the wave of flying toupees, strange men in leather thongs and drunken nights in painfully impractical shoes. Claire desperately wanted to be a mother, but now she’ll settle for one middle aged man worthy of a second date. After a long drought, men are flooding her shores and she’s drowning in choices. There’s Justin, the 25-year-old IT boy-genius with the GQ looks and cougar fetish, who won’t take ‘no’ for an answer. A woman would have to be a blind, lesbian nun not to fall for him, but he reminds Claire of her wasted youth. And then the charming but mysterious Dr. Nathan appears, but he’s cheating on her with his medical mistress—a demanding cardiology practice. To further rock her boat, Claire’s ‘stable’ career in publishing has been tossed about by her floundering company’s launch of a new line of trendy, salacious books. Cookbooks aren’t selling these days, but erotica is flying off the shelves—and challenging Claire’s attitude about sex, work . . . and her tempestuous new life. When her best friend convinces her to buddy up to the aspiring writer who just moved in across the street, Claire rejects the idea—he has already caught her in more than one embarrassing and scantily clad situation. Giving in to her friend’s nudging, she tries to ignore the details she discovers about him, including his hard rock night gig and his mesmerizing blue eyes, in the hopes his literary talents can pull her publishing house up from the bottom of the ocean. Claire’s dilemma begs the question: Are there NO men or TOO MANY?",
  "genres": [
    "Romance",
    "Chick Lit",
    "Humor",
    "Fiction",
    "Contemporary Romance",
    "Contemporary",
    "Comedy"
  ],
  "author": "Carol Maloney Scott",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/23212822-there-are-no-men"
}