{
  "title": "Stormbringer",
  "description": "In Liesmith, a “wildly entertaining debut novel . . . guaranteed to resonate with fans of mythopoeic fantasy from the likes of J.R.R. Tolkien, George R. R. Martin, and Neil Gaiman” (Library Journal), Alis Franklin introduced a band of charming, unforgettable heroes. Now they’re playing host to reincarnated Norse gods who are settling ancient grudges in the twenty-first century.   Ragnarok—aka the end of the world—was supposed to doom the gods as well. Instead, it was a cosmic rebooting. Now low-level IT tech and comic-book geek Sigmund Sussman finds himself an avatar of a Norse goddess. His boyfriend, the wealthy entrepreneur Lain Laufeyjarson, is channeling none other than Loki, the trickster god. His best friends, Em and Wayne, harbor the spirits of slain Valkyries. Cool, right?   The problem is, the gods who survived the apocalypse are still around—and they don’t exactly make a great welcoming committee. The children of Thor are hellbent on reclaiming their scattered the gloves, belt, and hammer of the Thunder God. Meanwhile, the dwarves are scheming, the giants are pissed, and the goddess of the dead is demanding sanctuary for herself and her entire realm.   Caught in the coils of the Wyrd, the ancient force that governs gods and mortals alike, Sigmund and his crew are suddenly facing a second Ragnarok that threatens to finish what the first one started. And all that stands in the way are four nerds bound by courage, love, divine powers, and an encyclopedic knowledge of gaming lore.Praise for Stormbringer \n \n “An engaging read, suitable for YA audiences [and] for those who enjoy mythology and complex relationships.”—Libromancer’s Apprentice   “Another great volume of this series . . . I really loved this book . . . and I will be looking forward to reading more.”—A Shared Brain Cell   “While I really enjoyed Liesmith, I loved Stormbringer. . . . [There’s] plenty of action and more than a few sweet moments. . . . I’m looking forward to whatever is next.”—SF Crowsnest \n \n “I can highly recommend Stormbringer. . . . Franklin has pretty much cemented herself in my virtual buy-everything-they-release headspace.”—Between Once Upon a Time and Ever After   “Like Liesmith, [Stormbringer] ends with a surprising bang, and goes nowhere that anyone involved, including the reader, ever imagined. And it’s utterly cool.”—Reading Reality",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "M M Romance",
    "Mythology",
    "Magic",
    "Gods",
    "Gay"
  ],
  "author": "Alis Franklin",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/23210100-stormbringer"
}