{
  "title": "The Melissa Ring",
  "description": "John Dorman is watching!Canada has joined the United States as the one hundred second through one hundred sixteenth states. The world is divided into five trade blocs. A prolonged and controversial world war is being waged in the Horn of Africa. A deranged serial killer, named the Jabberwock, is terrorizing the country. Martian colonies, communication with dolphins and arcologies are becoming a reality. Route 66 is still in commission; and Boulder Dam never changed its name. It is a world similar yet markedly different from our own, where things seem normal on the surface but bizarre things lurk in the shadows.In this world, after a mysterious, five-year, road trip, Paul Gray has returned to his father’s hometown of River City, Wabash, specifically, an area of the city, referred to by locals as “the Forrest.” Over time, the city has deteriorated into an urban wasteland due in part to the exploitive business practices of Paul’s wicked great-grandfather, Silas Gray. However, Silas has died; and Paul has inherited his vast fortune. Will Paul use the money to reverse the damage and restore the city to its former glory? Or, will he fall prey to the same sins of pride, lust, and greed, which destroyed his ancestor? Paul discovers that he must tackle many problems at the same time: dislodge a street gang, who is squatting in the subbasements of his apartment building, discharge a dictatorial hotel manager, repair the roof of an iconic church, and rescue a failing diner, threatened with foreclosure. To solve these and other problems, Paul must rely on his martial arts and communication skills, his innate compassion and generosity, and his faith in God.At every step, Paul and his motley band of helpers are met by the forces of Silas Gray’s former partner, Claude Zumbini, aka Zumbo the Clown. Zumbini, who is the host of a popular, local, morning children’s show, an unscrupulous businessman, and most importantly, a powerful crime lord, has an iron chokehold on the city and its residents and no intention of allowing it to be wrested from his grasp.The eccentric Sam Hayne, proprietor of a local, horror-themed, amusement park and Paul’s distant cousin, offers to assist Paul in defeating Zumbini. However, can Paul trust him? Moreover, what is the peculiar, gold signet ring, which Hayne gave Paul? It seems to have its own agenda. At the oddest times, it glows; and strange events soon follow.What will Paul Gray do with…The Melissa Ring?",
  "genres": [],
  "author": "Robert Wayne Bee",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/23211776-the-melissa-ring"
}