{
  "title": "No brakes 2",
  "description": "https://leanpub.com/nobrakes2The number 1 bestselling leanpub erotica author presents...No Brakes 2Rachel Holt returns to her childhood home in Jackson Heights Queens NY, to ready it for sale. She feels a deep gnawing pain in her gut, but continues to rifle through her recently deceased fathers affects. Rachel comes across an envelope addressed to her, with a picture and a note inside. The photo is from 1980 and it is in front of the big globe in Corona Park. Her parents always took her there to talk over things or just hang out. She goes there immediately upon hearing of his death as if he would be there waiting to console her. She knew that (in her mind) this is not possible, however, in her heart; she holds a belief that if her father’s spirit is anywhere it is here. Therefore, she went to talk with him one more time. The one place on earth she knew he could hear her.Those memories of that day fade away, and she opens the letter.\"I have no need to lie, I'm not married to ya... Rachel I am writing this because I fear my time is approaching. Yes I know I am not that old, but I somehow managed to cram 80 into 50. I write this as I live and breathe, however if you are reading it then I am long gone, no worries.All of my life I have hated bad guys, and now that I am dead it's your turn. Look up in my attic, behind an old brown leather satchel; there is a cold case file that I have labeled No Brakes. It is a metaphor for the times of the day in 70s NYC, when our lives seemed like a runaway train with no brakes. Inside you will find five cases I could never solve before my retirement in 97.I believe there is a common thread between them all, at least that is what I tell myself. Delusions can keep us warm I guess. Rachel you have a keen eye for the abstract, please put this to rest so that I may finally have peace. Each case comes with a brief synopsis and more of my own observations.P.S.; Oh, Rachel if this leads to some old schmuck, now living in a retirement home somewhere in Bensonhurst show no pity. Use both barrels!! Loving you from the other side pops-“‘This is an odd letter, never knew pops to write let alone type out a letter. How long did you know you were sick pops?' As she looks upon a distant memory, a tear rolls down her cheek.Rachel must now decide on whether to pursue this oddity from 25 years ago, or let it go like so many other things in her present life.",
  "genres": [],
  "author": "James Lee Nathan III",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/23213154-no-brakes-2"
}