{
  "title": "The Frangipani Hotel: Fiction",
  "description": "An extraordinarily compelling debut—ghost stories that grapple with the legacy of the Vietnam War  A beautiful young woman appears fully dressed in an overflowing bathtub at the Frangipani Hotel in Hanoi. A jaded teenage girl in Houston befriends an older Vietnamese gentleman she discovers naked behind a dumpster. A trucker in Saigon is asked to drive a dying young man home to his village. A plump Vietnamese-American teenager is sent to her elderly grandmother in Ho Chi Minh City to lose weight, only to be lured out of the house by the wafting aroma of freshly baked bread. In these evocative and always surprising stories, the supernatural coexists with the mundane lives of characters who struggle against the burdens of the past.   Based on traditional Vietnamese folk tales told to Kupersmith by her grandmother, these fantastical, chilling, and thoroughly contemporary stories are a boldly original exploration of Vietnamese culture, addressing both the immigrant experience and the lives of those who remained behind. Lurking in the background of them all is a larger ghost—that of the Vietnam War, whose legacy continues to haunt us.   Violet Kupersmith’s voice is an exciting addition to the landscape of American fiction. With tremendous depth and range, her stories transcend their genre to make a wholly original statement about the postwar experience.  Praise for The Frangipani Hotel “[A] subversively clever debut collection . . . These stories—playful, angry, at times legitimately scary—demonstrate a subtlety of purpose that belies [Kupersmith’s] youth.”—The New York Times Book Review\n \n“Magical, beautiful, modern stories, all based on traditional Vietnamese folktales, [The Frangipani Hotel] invokes the ghosts of the land that was left behind.”—San Francisco Chronicle  “[A] sparkling debut . . . playful and wise, an astonishing feat for a young writer.”—Chicago Tribune   “A series of short stories that are as fresh as they are mesmerizing, The Frangipani Hotel will haunt you long after the last words have drifted off the page.”—Lisa See   “Auspicious . . . wildly energetic.”—Elle  “Enthralling stories . . . teeming with detail and personality.”\n—Asian Review of Books\n  “Chilling and lovely . . . Kupersmith has combined traditional storytelling with a post-modern sense of anxiety and darkness, and the result is captivating.”—Bookreporter  “The stories shimmer with life. . . . Kupersmith [is] one to watch.”—Publishers Weekly (starred review)From the Hardcover edition.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Fantasy",
    "Horror",
    "Asia",
    "Paranormal",
    "Asian Literature"
  ],
  "author": "Violet Kupersmith",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/23209970-the-frangipani-hotel"
}