{
  "title": "Last Chance Mail Order Bride: Violet's Cowboy",
  "description": "It was not Violet Gladstone’s idea to become a mail order bride. She felt it was foolhardy for a woman to leave everything behind to marry a man she had never met. However, when her greedy fiancé Ned jilted her for a rich woman, her friend convinced her to answer an ad. Soon she was exchanging letters with a nice widower who wanted to wed her. For months, they wrote to each other. All his letters were charming, except the last one. It contained an marry him now or never. He could wait no longer. She wrote back that she would come right away, but she did not. Instead, when the time came, she turned in her ticket to Texas and posted an apologetic letter to the widower breaking off their engagement. When Ned heard Violet stayed, he accused her of holding a torch for him and offered to make her his mistress. Violet scoffed at his lewd offer and his vile conceit. In a flash he was in her face, pointing out that a strong-willed 27-year-old servant was too old, too poor, and too disagreeable to find a husband in man-starved postwar Georgia. He predicted she would live out her life, a spinster dwelling in the servants’ quarters while she pined away for what might have been. That was all it took for her to pen another letter asking the widower to forgive her fickleness, and informing him she was on her way. There was no way Ned was going to ruin her dreams. She left on the very next stagecoach bound for Texas. Her fury kept her doubts and fears at bay for some time, but when the road got rough as they travelled farther and farther into the frontier, she regretted leaving Atlanta. When she really thought about it, being a spinster seemed like a pleasant carefree lifestyle and the servants’ quarters a safe haven. Her rationalization was for naught; it was too late to turn back. Certain she had left the frying pan for the fire, she stared out the window of the stagecoach as it rattled down the bumpy dirt road heading to her uncertain future. What if the widower would not have her? This is the second edition. Each book of the Westward Wanted Series can serve as a stand-alone novel because the main characters do not carry over from the previous books. In each, new main characters take up the torch while the lives of many of the former characters continue to develop within the story. Last Chance Mail Order Violet’s Cowboy is a sweet Western romance by Crystal Anne Tilden, author of the Best-Selling Christian Mail Order Savannah’s Cowboy, Nobody’s Mail Order Adeline, and Mail Order Carrie and the Cowboy.",
  "genres": [],
  "author": "Crystal Anne Tilden",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/23211532-last-chance-mail-order-bride"
}