{
  "title": "The Harder They Come",
  "description": "Acclaimed New York Times bestselling author T.C. Boyle makes his Ecco debut with a powerful, gripping novel that explores the roots of violence and anti-authoritarianism inherent in the American character.Set in contemporary Northern California, The Harder They Come explores the volatile connections between three damaged people—an aging ex-Marine and Vietnam veteran, his psychologically unstable son, and the son's paranoid, much older lover—as they careen towards an explosive confrontation.On a vacation cruise to Central America with his wife, seventy-year-old Sten Stensen unflinchingly kills a gun-wielding robber menacing a busload of senior tourists. The reluctant hero is relieved to return home to Fort Bragg, California, after the ordeal—only to find that his delusional son, Adam, has spiraled out of control.Adam has become involved with Sara Hovarty Jennings, a hardened member of the Sovereign Citizens’ Movement, right-wing anarchists who refuse to acknowledge the laws and regulations of the state, considering them to be false and non-applicable. Adam’s senior by some fifteen years, Sara becomes his protector and inamorata. As Adam's mental state fractures, he becomes increasingly schizophrenic—a breakdown that leads him to shoot two people in separate instances. On the run, he takes to the woods, spurring the biggest manhunt in California history.As he explores a father’s legacy of violence and his powerlessness in relating to his equally violent son, T. C. Boyle offers unparalleled psychological insights into the American psyche. Inspired by a true story, The Harder They Come is a devastating and indelible novel from a modern master.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Audiobook",
    "Novels",
    "Literary Fiction",
    "Literature",
    "Thriller"
  ],
  "author": "T. Coraghessan Boyle",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/23215481-the-harder-they-come"
}