{
  "title": "The Counterfeit Bride",
  "description": "Can a counterfeit bride steal the heart of a suspicious groom?When Cassidy Cooper’s flighty sister Angela comes to Miss Brookfield’s Academy for Young Ladies and begs Cassie to take her place as a mail order bride, the practical Cassie is scandalized. But before she knows it, Cassie is on a train to Silver Strike, Nevada—on her way to wed a stranger. To her delight, Noah Bridger turns out to be everything her yearning heart has ever desired in a bridegroom. As she thrills to his tender touch, Cassie has no way of knowing that Noah is hiding a dangerous secret of his own.Scotsman Ian MacKenzie has agreed to masquerade as a wealthy silver mine owner to catch his best friend’s killer, not to lose his heart to the woman he’s supposed to be investigating. But every time he gazes down into his mail order bride’s stormy blue eyes, he has to fight the temptation to taste her soft, pink lips and make her his bride in more than name only. He never suspects the warm, willing woman in his arms is also an imposter.As they fight the irresistible attraction building between them, Ian and Cassie must decide if a passion built on lies can grow into a love real enough to last a lifetime…Book 4 of the BORROWED BRIDES Series, which includes Golden Chances, Harvest Moon, Something Borrowed, The Counterfeit Bride, and Twice A Borrowed Brides Novella“Rebecca Hagan Lee warms my heart and touches my soul. She’s a star in the making!”—Sabrina Jeffries, New York Times bestselling author“Tender, enthralling romance straight from the heart!”—Eloisa James, New York Times bestselling author“Rebecca Hagan Lee taps into every woman’s fantasy!”—Christina Dodd, New York Times bestseller“Rebecca Hagan Lee is a writer on the rise!”—Romantic Times",
  "genres": [
    "Romance",
    "American",
    "Westerns"
  ],
  "author": "Rebecca Hagan Lee",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/23215329-the-counterfeit-bride"
}