{
  "title": "Elizabeth I and Her Circle",
  "description": "This is the inside story of Elizabeth I's inner circle and the crucial human relationships which lay at the heart of her personal and political life. Using a wide range of original sources - including private letters, portraits, verse, drama, and state papers - Susan Doran provides a vivid and often dramatic account of political life in Elizabethan England and the queen at its centre, offering a deeper insight into Elizabeth's emotional and political conduct - and challenging many of the popular myths that have grown up around her. It is a story replete with fascinating questions. What was the true nature of Elizabeth's relationship with her father, Henry VIII, especially after his execution of her mother? What was the influence of her step-mothers on Elizabeth's education and religious beliefs? How close was she really to her half-brother Edward VI - and were relations with her half-sister Mary really as poisonous as is popularly assumed? And what of her relationship with her Stewart cousins, most famously with Mary Queen of Scots, executed on Elizabeth's orders in 1587, but also with Mary's son James VI of Scotland, later to succeed Elizabeth as her chosen successor? Elizabeth's relations with her family were crucial, but almost as crucial were her relations with her courtiers and her councillors (her 'men of business'). Here again, the story unravels a host of fascinating questions. Was the queen really sexually jealous of her maids of honour? What does her long and intimate relationship with the Earl of Leicester reveal about her character, personality, and attitude to marriage? What can the fall of Essex tell us about Elizabeth's political management in the final years of her reign? And what was the true nature of her personal and political relationship with influential and long-serving councillors such as the Cecils and Sir Francis Walsingham?",
  "genres": [
    "History",
    "Nonfiction",
    "Tudor Period",
    "Biography",
    "European History",
    "Audiobook",
    "Historical"
  ],
  "author": "Susan Doran",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/23215868-elizabeth-i-and-her-circle"
}