{
  "title": "The Last Precinct",
  "description": "Patricia Cornwell's legendary crime fiction creation, Virginia's Chief Medical Examiner Kay Scarpetta, has logged a host of fans among mystery readers and, within the bounds of her fictional world, an equally impressive tally of individuals intent on causing her grievous physical or psychological harm.The 11th Scarpetta novel, The Last Precinct, doesn't add any new names to the second roster. Instead, in a sweeping narrative gesture toward retrospection (less-than-fervent fans might whisper \"or stagnation\"), the novel depends largely on ground already covered in its predecessors, Black Notice and, to a lesser extent, Point of Origin. All the familiar faces--friend and foe--are here: police captain Marino, Kay's niece Lucy, the so-called Werewolf murderer, and (in memoriam) Kay's lover Benton Wesley and his killer, Carrie Grethen. Kay, who nearly killed the Werewolf in self-defense as Black Notice came to a close, now finds herself the target of a corrupt police investigation that will dredge her darkest secrets from the deepest corners of her past.Torn between a desire to clear her name and the instinct of a wounded animal to turn against even its would-be rescuers, Kay sifts through the forensic evidence that seems to link Chandonne to other horrific events in her past, up to and including Wesley's murder. Physical analysis, however, will not be enough to right her up-ended world. Instead, Kay must rely on the strategic support of her niece, cofounder of the Last Precinct (an odd, ill-defined organization that is, in the words of its motto, \"where you go when there is nowhere left\"), and on her willingness to examine her own fears, misconceptions, and anything-but-altruistic motives. The most important setting in this novel is not the morgue--it's the living room where Kay's therapist forces her to address (you guessed it) \"unresolved issues.\" The novel's focus on Kay's emotional evolution does not, unfortunately, mask the leaps of illogic that pepper the plot's murky stew. More disturbing than these occasional lapses, however, is the feeling that Cornwell has written herself into a corner. The Scarpetta of The Last Precinct is a far cry from the irritably independent woman of previous books. Her often over-inflated musings are more tiresome than tantalizing. Cornwell's impressive track record makes this excursion a bit disappointing, but that same record means that loyal fans will race to acquire the book anyway and that the odds of her returning to her usual stellar form next time are (hurrah!) favorable. --Kelly Flynn",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Thriller",
    "Mystery Thriller",
    "Suspense",
    "Audiobook"
  ],
  "author": "Patricia Cornwell",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/232139.The_Last_Precinct"
}