{
  "title": "Bad Money: Reckless Finance, Failed Politics, and the Global Crisis of American Capitalism",
  "description": "The bestselling author reveals how the U.S. financial sector has hijacked our economy and put America's global future at riskIn American Theocracy, Kevin Phillips warned us of the perilous interaction of debt, financial recklessness, and the increasing cost of scarce oil. The current housing and mortgage debacle is proof once more of Phillips's prescience, and only the first harbinger of a national crisis. In Bad Money, Phillips describes the consequences of our misguided economic policies, our mounting debt, our collapsing housing market, our threatened oil, and the end of American domination of world markets. America's current challenges (and failures) run striking parallels to the decline of previous leading world economic powers; especially the Dutch and British. Global overreach, worn-out politics, excessive debt, and exhausted energy regimes are all chilling signals that the United States is crumbling as the world superpower. \"Bad Money\" refers to a new phenomenon in wayward megafinance – the emergence of a U.S. economy that is globally dependent and dominated by hubris-driven financial services. Also \"bad\" are the risk miscalculations and strategic abuses of new multitrillion-dollar products such as asset-backed securities and the lure of buccaneering vehicles like hedge funds. Finally, the U.S. dollar has been turned into bad money as it has weakened and become vulnerable to the world's other currencies. In all these ways, \"bad\" finance has failed the American people and pointed U.S. capitalism toward a global crisis. Bad Money is the perfect follow- up to Phillips's last book, whose dire warnings are now proving frighteningly accurate.",
  "genres": [
    "Economics",
    "Politics",
    "Nonfiction",
    "Finance",
    "History",
    "Business",
    "Money"
  ],
  "author": "Kevin Phillips",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/2321788.Bad_Money"
}