{
  "title": "The War That Forged a Nation: Why the Civil War Still Matters",
  "description": "More than 140 years ago, Mark Twain observed that the Civil War had \"uprooted institutions that were centuries old, changed the politics of a people, transformed the social life of half the country, and wrought so profoundly upon the entire national character that the influence cannot be measured short of two or three generations.\" In fact, five generations have passed, and Americans are still trying to measure the influence of the immense fratricidal conflict that nearly tore the nation apart.In The War that Forged a Nation , Pulitzer Prize-winning historian James M. McPherson considers why the Civil War remains so deeply embedded in our national psyche and identity. The drama and tragedy of the war, from its scope and size--an estimated death toll of 750,000, far more than the rest of the country's wars combined--to the nearly mythical individuals involved--Abraham Lincoln, Robert E. Lee, Stonewall Jackson--help explain why the Civil War remains a topic of interest. But the legacy of the war extends far beyond historical interest or scholarly attention. Here, McPherson draws upon his work over the past fifty years to illuminate the war's continuing resonance across many dimensions of American life.Touching upon themes that include the war's causes and consequences; the naval war; slavery and its abolition; and Lincoln as commander in chief, McPherson ultimately proves the impossibility of understanding the issues of our own time unless we first understand their roots in the era of the Civil War. From racial inequality and conflict between the North and South to questions of state sovereignty or the role of government in social change--these issues, McPherson shows, are as salient and controversial today as they were in the 1860s.Thoughtful, provocative, and authoritative, The War that Forged a Nation looks anew at the reasons America's civil war has remained a subject of intense interest for the past century and a half, and affirms the enduring relevance of the conflict for America today.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American History",
    "American Civil War",
    "War",
    "Military Fiction"
  ],
  "author": "James M. McPherson",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/23215861-the-war-that-forged-a-nation"
}