{
  "title": "Twisted Boss",
  "description": "My name is James and if you met me out on the street or in a business meeting you would think that I was just another very successful, white collar business man.I am not. There is a dark recess in the depths of my soul which cannot be witnessed with the casual eye. It is a receding alcove which can only be seen by those who discover it, or by those whom I choose to reveal it to.I guess that I have always known that I am different. From the first time I thought, engaged, daydreamed, or fantasized about sex, it has never been the traditional form of what most would deem 'missionary' or 'vanilla'.You see... I would much rather have a woman strapped down on my bed, or even to a wall, because I enjoy taking a woman. I am an Alpha male in every sense of the word and that definitely goes for my bedroom activities. I enjoy angry sex and it takes a certain kind of woman to handle me--or better yet to be handled by me.Up until this point in my life I have yet to find a compatible mate--but then again I'm not looking. I f@#k who I want, when I choose, and how I want. The whole clingy thing doesn't work for me. Needless to say, I end up breaking it off with women as soon as they start calling and want to know where I am, and what I'm doing.I like a woman who not only resists me sexually but emotionally. And as I said, I have yet to find a woman with that temperament--so I continue to f@#k them and move on with my life. It has worked for me thus far. My cock mandates that it has its way and I oblige it.This is not romance. It is the story of two extremely damaged people in a very dysfunctional relationship. Whether you would view their relationship as love, or not--I can't say. What I can say as the author, is that James and Amanda demanded a voice. They demanded that their story be told and I have been faithful in telling it. Their story is one of dark, twisted, and chaotic passion. I have remained true to them and for that I hold a special place in their heart, and they most definitely hold a sacred place in mine.",
  "genres": [
    "BDSM",
    "Dark",
    "Dark Romance",
    "Erotica",
    "Romance",
    "Contemporary",
    "Erotic Romance"
  ],
  "author": "Suzanne Steele",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/23214029-twisted-boss"
}