{
  "title": "ممالك تحت الأرض",
  "description": "مقطع من الرواية ...أكلت سبع زيتونات، وناولتني راضية شربة لبن ذات طعم لاذع، سألتها عنه فقالت: أعشاب مقوية، أفرغتها في جوفي، وشيعتني مودعة بنظرة كاسمها. ثم بدلت ثيابي وانتظرت أن أتدلى وراء الملثم إلى قعر الجب، لكنه امتنع وأشار لي بأن أهبط وحدي، وقال: أنت والطريق وحدكما، وإياك والتعثر، فقد تهلك. اطمأن قلبي وتجلدت للأمر، وعلمت أنه لا مفر، وأنه لا نجاة إلا من هذه السبيل. تدليت وشققت الماء، معزيا نفسي بأني سوف أصل مع انتصاف القرآن إلى الجب الآخر، ولتكن هذه فسحة للذكر والتوبة والإنابة، ولأكن ذاكرا لله في هذه اللجة كما ذكره يونس في بطن الحوت. وشرعت في التلاوة بصوت مرتفع ضجت له الصخور، وجهدت في الخوض والسباحة، ووفقني الله، فوصلت إلى موضع الغوص في ثلاثة أرباع الوقت المتوقع، وكنت قد انتصفت في سورة مريم، مع أنني بدأت من الأنفال. كتمت نفسي ونطقت الشهادة ثلاث مرات وغصت فولجت الجب الأول. وصعدت بالحبل إلى سطح الأرض. الشمس موشكة على الهبوط إلى مهدها ولا حس ولا خبر، فقدت وجهتي. وندمت لأنني لم أستوثق منه: هل أنتظرك عند الجب، أو أدخل في غار الجبل؟ كل ما أتذكره كلمة ضياء: ستعودان من الطريق نفسها. أي طريق هذه التي يقطع فيها السائر في اليوم الواحد ألف ميل؟ وينتقل فيها بين المواطن تحت الأرض من غير مدعاة لذلك؟ بدأت النجوم تحدق في الفسحة الخاوية التي ينتصب فيها جسدي الواهن. وغلبني الإعياء، فصليت المغرب، واستكنت إلى النوم. واستيقظت كما في المرة السابقة ويد الملثم ممسكة بيدي، يخوض بي غيابة النفق. غير أنه توقف لحظة، وطرق بابا على اليمين. ودخلنا، فإذا ضوء خافت أحمر كضوء مبغى ربع ميرهم، الذي صحبني إليه ضياء، قرب الشونة الشريفة. قال الملثم: تجلّد لما ستراه. كان تقسيم المكان كتقسيم المبغى، حذو القذة بالقذة، تناثرت الغرف على أطراف الحائط من الجهات الأربع، وتوسطت المكان فسحة مسقوفة. وتوجه بي إلى أول غرفة على الجانب الأيمن. وإذا رجل حاله رثة، مقيد القدمين بالسلاسل، بين يديه مصحف كبير يقرأ فيه، وبجواره حفرة مغطاة تفوح منها رائحة عفنة، خمنت منها أنها لقضاء الحاجة. قلت: ما هذا؟ قال: هذا رجل كان من أهل الطريق، وحين فقد الإمدادات عرضناه للابتلاء والسجن. سألته: من أنت؟ قال: أنا عمر الفحام، عصيت مشايخي، وأنا هنا منذ سنة وثلاثة أشهر للتكفير. قال الملثم: لم يبق له إلا تسعة أشهر. اضطربت جوانحي. فأخرجني، وتقدمني إلى حجرة ثانية. وإذا طفل عمره بين الحادية عشرة والخامسة عشرة، مفتوح الذراعين، قد قيد كفاه إلى الجدار واقفا. قلت: ومن هذا؟ قال: هذا لقيط ربيناه، وسقط في براثن السرقة، وخشينا عليه السجن، فجئنا به إلى هنا لنؤدبه شهرا، وقد حفظ القرآن، غير أن عليه فرض وقوف كل ليلة من منتصف الليل حتى الفجر. قلت: لماذا؟ قال: كي يستعظم خطر الوقوف بين يدي الله وهو لا يزال في مدة الإمهال. قلت: هل نحن في سجن؟ قال: بل نحن في مدرسة للتربية والتصفية. وأخذ يجول بي على الحجرات واحدةً واحدة. فرأيت امرأة مقيدة، أدركتها الفاقة وحملتها على الزنى وأرادت أن تقصد الطريق، فحُبست على هذه الحال حتى تختم القرآن خمسين ألف ختمة. ومررت بمدمن على الخمر يقضي عقوبته في شرب الماء الساخن منذ ثلاثة أشهر. ثم دخلت إلى حجرة خاوية. فقلت: ومن هنا؟ قال: هذا موضعك. أدركني الفزع، وكدت أهوي مجهشا لأقبل أقدامه، غير أنني تجشمت المشقة وتذكرت الله، فطأطأت رأسي مسلّماً، وقلت: وكم عليّ أن أقضي؟ قال: ضع القيد في قدميك. اقتربت إلى الحصير وسحبت السلسلة المثبتة في الجدار وقيّدتُ قدميّ وأطبقت بالقفل عليهما. ناولني شربة لبن، وقال: هذه ليلة معراجك. وسري عني حين قال: التزم قراءة القرآن، وغدا آتي وأحملك كي تلقى الشيخ ضياء.ظللت أتأمل في سقف الحجرة وأستكنه مصدر نورها الأحمر. فعرفت أن الأمر عائد إلى القنديل المعلق في وسط سقفها، وقد طلي زجاجه بالوردي. غبت في ملكوت الله، وقلبي يهمس في أضلاعي أين أنا؟ انزاح الباب الحديدي ودخل شبح مهيب، اقترب مني وجلس على طرف الحصير. وصمت يتمتم. قلت: من أنت؟ قال: ليست العبرة بمن أكون، وإنما هي بمن تكون أنت يا هذا. وعندئذ عرفته، كان الشيخ أحمد صاحب الزاوية. وقلت: مرحبا بسيدي. ردّ قائلا: وبك. ثم أردف: هل تعلم فيم جئتك؟ قلت: لا أدري، غير أن سيدي الملثم قال إنها ليلة معراجي. قال: معراجنا بالقلب والروح. قلت: وما معراجنا؟ قل: لكل منا معراجه، غير أن المقدر لك أن نعرج بك من أفكار العلوم التي تعتمد القرائن المادية، إلى فن الذوق. قلت: وأنى لي ذلك؟ قال: نطهرك من الأسئلة. قلت: وكيف ذاك؟ قال: نظرنا في أمرك فعلمنا أن بلواك راجعة إلى خواطرك. قلت: حق. قال: الخواطر سبعون ألف خاطر، تخطر كل يوم على القلب، لا يتخلف منها واحد، والقلب كالبيت المعمور، يدخله كل يوم سبعون ملك، إذا خرجوا منه لم يعودوا أبدا. كذلك القلب، وخواطره مقسومة على أربعة أقسام، قسم يلبسه الشيطان، وقسم تلبسه النفس، وقسم يدخل معه الملك، وقسم لا يدخل معه شيء وهو الرباني...",
  "genres": [],
  "author": "عبد الواحد الأنصاري",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/11393786"
}