{
  "title": "Aspertools: The Practical Guide for Understanding and Embracing Asperger's, Autism Spectrum Disorders, and Neurodiversity",
  "description": "If you ask Dr. Harold Reitman, labels are a lousy way to describe a unique human being, whether it's Asperger's, high functioning autism, ADHD, dyslexia, Tourette's or even the so-called neurotypical brain itself. One size does not fit all. Everyone's brain is different.Helping others 'get it' when it comes to dealing with those with so-called learning disabilities is why Reitman has written this book. It's also why he wrote and produced The Square Root of 2, a movie about a college student who encounters—and fights—her school's unjust system. The film was inspired by the real events faced by his daughter and contributing author, Rebecca, when she went to college; her seizure disorder and—at the time—undiagnosed Asperger syndrome posed unique challenges not faced by most students.After reviewing the scientific community's research, conducted over the last nearly 40 years, Dr. Reitman believes that it's time to not just accept neurodiversity, but to embrace it, and this book will help people do just that. It is the first book to offer simple tools, action plans and resources to help understand and deal with anyone whose brain is a bit different. The astonishing rate of autism births alone (1 in 68) means that society will have to adapt to neurodiversity, just as it has had to adapt to other cultural and racial differences. Our educational system, our workplaces, and society at large will no longer be one size fits all—each individual will have the opportunity to maximize their potential—and we will be the better for it. Dr. Harold \"Hackie\" Reitman is an orthopedic surgeon, a former professional and Golden Gloves champion heavyweight boxer, philanthropist, and a movie producer. His recent release, The Square Root of 2, is a fictionalized adaptation of his daughter Rebecca's challenges at college (TheSquareRootOf2.com).",
  "genres": [
    "Autistic Spectrum Disorder",
    "Psychology",
    "Nonfiction",
    "Adhd",
    "Health",
    "Self Help"
  ],
  "author": "Harold Reitman",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/23217276-aspertools"
}