{
  "title": "Crafting the Character ARC",
  "description": "Many writers believe once they have their basic plot points in place, their stories are destined to succeed. But many narratives fall flat between those plot points and lose their audience before the big finish. Engaging the audience and moving the story forward in every scene is the responsibility of the characters, not the plot. But while many books on the craft of writing state that characters need to be three dimensional and change, a beginning writer isn't always sure how to turn these rather abstract ideas into concrete craft on the page. Crafting the Character Arc offers a practical guide to character creation and development by expanding upon the concept of the character arc and creating a step-by-step guide for writers to ensure that their characters are dynamic and engaging. Using narrative examples from multiple platforms, including novels, films and games, this is the essential guide for helping writers create an active and well-defined character arc. Crafting The Character Arc is structured in three main parts. Part One covers the more traditional, basic approach to creating character, including personality traits, depth, secrets, goals versus emotional needs, active versus reactive protagonists, and dramatic functions. Part Two introduces the Major Dramatic Curve, a detailed pictorial representation of a character arc and its major elements: place of rest, inciting incident, rising action, crisis point, climax and falling action/resolution. Part Three offers practical applications of the Major Dramatic Curve. The writer is given guidance for using the curve to create a dynamic and engaging narrative work. Lastly, some variations in using the Major Dramatic Curve are explored and exceptions to the rules are addressed. Character Arcs are a critical part of every story making this guide applicable to multiple mediums: novels, short stories, films, TV, games, plays, and Web series.",
  "genres": [
    "Writing",
    "Nonfiction"
  ],
  "author": "Jennie Jarvis",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/23230614-crafting-the-character-arc"
}