{
  "title": "Conqueror Series Collection: Wolf of the Plains, Lords of the Bow, Bones of the Hills",
  "description": "Wolf of the plains. Originally published: 2007 --Lords of the bow. Originally published: 2008 --Bones of the hills. Originally published: 2008.For the first time in one volume - three bestselling, action packed novels telling the life of a great warrior and hero - Gengis Khan Wolf of the Plains 'I am the land and the bones of the hills. I am the winter.' Temujin, the second son of the khan of the Wolves tribe, was only eleven when his father died in an ambush. His family were thrown out of the tribe and left alone, without food or shelter, to starve to death on the harsh Mongolian plains. But Temujin's destiny is not to perish - He will become the khan of the sea of grass, Genghis. Lords of the Bow The gathering of the tribes of the Mongols has been a long time in coming but finally, triumphantly, Temujin of the Wolves, Genghis Khan, is given the full accolade of the overall leader and their oaths. Now he can begin to meld all the previously warring people into one army, one nation. Not only must Genghis succeed in this incredible campaign, but he must also reconcile the restless factions among his own generals, mediate between his ambitious brothers and cope with his own reactions to his growing sons. The young warrior has become a notable and victorious military commander of thousands: he must now learn to become a great leader of peoples of many different races and religions. Bones of the Hills Genghis Khan has united the warring tribes and even taken his armies against the great cities of their oldest enemies. Now he finds trouble rising west of the Mongolian plains. His emissaries are mutilated or killed; his trading gestures rebuffed. So, dividing his armies, using his sons as generals of the various divisions, he sends them out simultaneously in many directions, ranging as far as modern Iran and Iraq. As well as discovering new territories, exacting tribute from conquered peoples, laying waste the cities which resist, this policy is also a way of diffusing the rivalries between his sons and heirs and working out who should succeed the khan.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Fantasy",
    "Book Club",
    "Historical"
  ],
  "author": "Conn Iggulden",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/11394010-conqueror-series-collection"
}