{
  "title": "Angels at the Gate",
  "description": "Little is known about Lot’s wife, the unnamed biblical figure who was turned into a pillar of salt as she fled the destruction of Sodom. But for writer T.K. Thorne, just one reference was enough to ignite her imagination and form the basis for her dazzling new novel, ANGELS AT THE GATE (Cappuccino Books, March 2015). Like Noah’s Wife, Thorne’s highly praised debut, this book brings the ancient world to life through the eyes of an extraordinary woman.Based on historical, biblical, and archaeological research, visits to the Middle East, and a large measure of creativity, ANGELS AT THE GATE is the story of Adira, destined to become Lot’s wife. A daughter of Abram's tribe, Adira is an impetuous young girl whose mother died in childbirth. Secretly raised as a boy in her father’s caravan and schooled in languages and the art of negotiation, Adira rejects the looming changes of womanhood that threaten her nomadic life and independence. But with the arrival of two mysterious strangers – Northmen rumored to be holy or possibly even “Angels” – Adira’s world unravels. Raiders invade the caravan, and she loses everything she values most – her father, her freedom, and even the “Angels.” Caught between her oath to her father to return to her tribe and the “proper life for a woman” and tormented by an impossible love, she abandons all she has known in a dangerous quest to seek revenge and find her kidnapped “Angel.” With only her beloved dog, Nami, at her side, Adira must use the skills she learned in the caravan to survive the perils of the desert, Sodom, and her own heart. ANGELS AT THE GATE is a story of adventure and the power of love, exploring themes about choice – the importance of asking the right questions and walking the fine edge between duty and personal freedom. Based on a simple mention in the Bible, T.K. Thorne has developed a complex and full-bodied character in the wife of Lot, a woman both ancient and modern, who will touch readers’ hearts, and live in their memories for years to come. As Dianne Mooney, founder of Southern Living At Home says, “For all those whose curiosity is piqued by how it might have been in the time of Sodom and Gomorrah, this is a must read!” “A masterpiece of historical research, interweaving history and theology in a re-visioning of an ancient story from a woman’s perspective. Thorne is a dazzlingly gifted writer.” –Sue Walker, Poet Laureate of Alabama, 2003-2012“Thorne unspools an ancient adventure with crackling undertones of our contemporary lives. Lean, polished action sequences render a young woman’s life with both intensity and nuanced truth.”–Dale Short, public radio commentator and author of A Shinning, Shinning Path",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "New Adult",
    "Historical"
  ],
  "author": "T.K. Thorne",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/23231687-angels-at-the-gate"
}