{
  "title": "Essential Psychodynamic Psychotherapy: An Acquired Art",
  "description": "Essential Psychodynamic Psychotherapy : An Acquired Art provides an essential, accessible grounding in current psychodynamic theory and practice for a wide range of readers. For trainees, it offers a very useful toolset to help them make the transition from purely theoretical training to the uncharted territory of clinical practice. For more seasoned therapists and those seeking to deepen their understanding of psychodynamic therapy, it provides conceptual clarity, and may also serve as a stepping stone to more complex and denser psychoanalytic works written for advanced clinicians. Essential Psychodynamic An Acquired Art is an introduction to how to think and work psychodynamically. It is written primarily for those training at a postgraduate level in psychoanalysis and psychodynamic psychotherapy, but reaches well beyond that audience. It is grounded in contemporary psychoanalytic theory, drawing on the work of Winnicott, Bion, and Ogden, all of whom are pivotal in current psychodynamic thought and practice. It also integrates attachment theory and research, and includes fresh contributions from neuropsychological research. The voice of the book is honest and intimate. The tone is practical. It is written with a clear-minded understanding of contemporary psychodynamic theory that allows the new therapist to access the deepest and richest parts of the therapy itself. It translates many of the key theoretical tenets of psychodynamic psychotherapy, giving the reader a clear (but non-formulaic) guide as to how handle the contours of any analytic session; how to open one’s perceptual and emotional apertures as clinician; how to work in and understand \"the relationship\"; and how to work with the most common intra- and interpersonal problems patients present. This publication will be a valuable guide for new analysts and therapists, and also for those seeking to understand what the world of psychodynamic therapy may hold for them, no matter where they are in their clinical careers. Dr. Teri Quatman is an Associate Professor of Counseling Psychology in the Graduate Department of Counseling Psychology at Santa Clara University. She earned her Ph.D. from Stanford University in 1990, and has studied, practiced, and taught psychodynamic psychotherapy to graduate students for the past 25 years.",
  "genres": [
    "Psychology",
    "Psychoanalysis",
    "Nonfiction",
    "Social Work",
    "Counselling",
    "Education",
    "Textbooks"
  ],
  "author": "Teri Quatman",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/23219585-essential-psychodynamic-psychotherapy"
}