{
  "title": "Thirst: Tales of Vampire Romance Boxed Set",
  "description": "Thirst: An EIGHT Author Vampire Bundle of Edgy Vampires that THIRST for the one. Deliciously inhuman, paranormal sexiness!  *NO CLIFFHANGERS*  Are you THIRSTING for the unusual? Try thousand-year-old vampires, Latin and French vamps, vampire Earls, sexy Native American vampires and even berserker vampires! This bundle will slake your THIRST for otherworldly, hot and sexy, unique vampire stories.  EIGHT creative and original stories that prove, one little seductive bite doesn't hurt. ------ Vampire Berserker by Carl East: A vampire that needs to feed on other vampires in order to survive.  The Vampire and the Rose by Yvonne Anthony: Rose’s mother has often warned her to stay away from dark places—especially at night, but curious Rose will ignore the warnings, jumping headlong into danger with startling consequences.  Dark Velvet by Lisa Carlisle: Savannah is thrilled for her residency at an art colony where she meets the sculptor Antoine. She discovers his dark secret, putting her life in jeopardy.  Vampire Lords of Blacknall by Shirl Anders: Only a creature of the night can save her. Lady Beth never stays home in the evenings. She fears her evil stepbrother. Then a monster stalks her in the dark and she cannot tell beast from savior.  The Vixen Torn by J.E. & M. Keep: Anjasa has been through the worst parts of hell and come back from it wounded but stronger. A trained assassin and courtesan, she’s seen the worst in others… and herself.  When Comes the Night by Anita Dobs: Trying to leave a troubled past far behind, Stacy escapes to England, but gets more than she bargained for when she meets Rafe Hawkins, the mysterious C.E.O at the renowned Sirius Advertising Agency.  Ash: Before Dawn by Skye Eagleday: Ash drank deeply of the blood of his enemies at Custer’s Last Stand. Now the beautiful Native American Vampire hunts in the gay bars of Seattle, where he will face an ancient Vampire far more deadly than the troops at Little Big Horn. Will he and his new human lover be able to use his powers of seduction and warrior skills to survive until dawn?  Love Blind by Claudia D. Christian: 1978. Rio de Janeiro. Josephine made a desperate bargain with a vampire named Julio Alberto. Her life for another. Kept in a gilded cage, will she ever allow herself to truly love her charming captor?",
  "genres": [],
  "author": "Shirl Anders",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/23233022-thirst"
}