{
  "title": "Conqueror: A Novel of Kublai Khan",
  "description": "For lovers of thrilling adventure and grand history, the bestselling co-author of the #1 New York Times bestseller The Dangerous Book for Boys has written a magnificent novel with a hero for the the legendary, visionary conqueror Kublai Khan.   A succession of ruthless men have seized power in the wake of Genghis Khan’s death—all descendants of the great leader, but none with his indomitable character. One grandson, Guyuk, strains the loyalties of the tribes to the breaking point, and another, Mongke, brutally eliminates the opposition and dispatches his younger brothers Kublai and Hulegu to far-flung territories.   Hulegu displays his barbarity with the savage destruction of Baghdad and his clash with the Khan’s age-old enemies, the cult of assassins. But it is Kublai—refined and scholarly, always considered too thoughtful to take power—who will devise new ways of warfare and conquest as he builds the dream city of Xanadu and pursues the ultimate the ancient empire of Sung China. His gifts will serve him well when an epic civil war breaks out among brothers, the outcome of which will literally change the This edition includes an excerpt from Conn Iggulden's The Blood of Gods.   “Conqueror is as real as military fiction gets. Conn Iggulden’s story of one of history’s most ferocious and brilliant warriors is full of lessons for our warfighters today.”—Gunnery Sergeant Jack Coughlin, USMC (ret.), New York Times bestselling author of Shooter and Kill A Sniper Novel   “A rollicking, dangerous and often very gory gallop through the largest land empire the world has ever known.”—Sunday Express (U.K.)   “A thrilling journey, rippingly told . . . Iggulden’s most satisfying to date.”—The Daily Telegraph (U.K.)",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "War",
    "Fantasy",
    "Audiobook",
    "Asia"
  ],
  "author": "Conn Iggulden",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/11394008-conqueror"
}