{
  "title": "Risk It",
  "description": "Jennifer Chance’s Rule Breakers series turns up the heat as a wealthy playboy and a beautiful con artist engage in a high-stakes game of seduction.  As dominating in business as he is in bed, Rand Sterling Winston IV always gets what he wants. And even before he realizes that she’s scammed him into paying triple the cost for her friend’s painting, he wants Dani Michaels. To catch her alone, Rand demands that she personally deliver his purchase. The attraction between them is immediate and electric, and he knows she feels it, too. So when the part-time petty thief rebuffs his advances, he gives her a a night in jail or an evening with him.   Despite her checkered past, Dani has never met someone like brooding, intense, and oh so tempting. Only a man with a broken soul could make control feel this dangerous. Still, when Rand proposes a no-strings, no-holds-barred affair, Dani’s more than a little intrigued. It’ll be the trickiest con she’s ever run and a chance to indulge her steamiest fantasies—nothing more. But as their encounters grow increasingly intimate, Dani uncovers a vulnerable side to Rand’s steely exterior and opens her heart to the ultimate risk.  Praise for the novels of Jennifer Chance  “Rock It is perfect for those of us who like our books the way we like our smart, sexy, sweet, and a damn good time!”—New York Times bestselling author Lexi Ryan   “Fun, flirty, and fantastic! Fake It is one sweet and exciting ride.”—New York Times bestselling author Tracy Wolff   “Sometimes outrageous, often funny, and always sexy . . . I love this author’s voice, I love these books . . . and I absolutely love her bad-boy heroes.”—Guilty Pleasures Book Review  Includes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "BDSM",
    "Erotic Romance",
    "Amazon"
  ],
  "author": "Jennifer Chance",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/23235091-risk-it"
}