{
  "title": "Hot for Teacher",
  "description": "Debating Number Ten by Amalie SilverHis goal was ten. Ten notches on his bed post before seducing his debate coach, Miss Shields. Will Simon reach his ideal woman, or will he end up Debating Number Ten?Deviation by M.C CernyDeviation: an action, behavior, or condition that is different from what is usual or expected. Example: Edith and Jack deviate from the acceptable student teacher relationship.The Life Plan by Phalla S. RiosEverything was perfect, until the middle of my senior year. Our art teacher succumbed to bad health, leaving us with a substitute--and my plans turned to flames, turning into ashes. I thought I wasn't going to fall anymore. But the moment I laid eyes on Mr. Tomlinson, I begin to fall all over again.This can't be happening…Back to School by Vicki GreenEmma Danielson's last year of College and with bartending at night she's walking through life like a zombie. But, when the new teacher walks into her music class she definitely wakes up and takes notice. Josh Tyler's playing and singing at bar's and practices doesn't give him much time but, when he walks into the first day of his new music class and notices a beautiful girl sitting in the back, a fresh set of issues arise and a whole lot of trouble.Unwritten History by Missy Johnson and Carly GreyWe met online.We’d been friends for nearly six months before we finally met.Sparks fly. Things happen.I don’t know what it is we have, but then again, I’m only seventeen.He thinks I’m twenty, because that’s what I tell him.But Secrets never stay hidden for long.Rite of Passage by Mandee Mae Haley knew she had a lot to learn since she pretty much grew up in a bubble. She just didn’t realize the classroom wasn’t the only place she was going to be taught new and exciting things.The Teacher's Pet by NiquelThe Cunningham twins looked alike but were polar opposites. When Maxine Sheppard, the sexy English teacher, arrived, they had one common goal: becoming the teacher's pet.Love Lessons by Liv MorrisDesperate to find a teaching job after graduating college, Tali Tillman returns to her high school to teach English Literature. One of her students and star quarterback, Daniel Johnson, begins to fail her class, so Tali's asked to tutor him after-hours. Lines between teacher and student become blurred, but will they be crossed?Teach Me by Elle BrightHistory belongs in the past. Or so Savannah thought, until her new history professor decides to teach her a thing or two…Extra Credit by Nicole BlanchardIf nothing else the expensive education at St. Christopher's College should have thoroughly instilled upon Eve Stratton the virtues of avoiding risks. But much like her namesake, all it takes for her resolution to be swayed are the smooth words of a charming devil. And Theodore Drake, her new professor, may as well have come with a warning label. Even though she’s well aware that a relationship could mean ruin for them both, there's nothing more alluring than the temptation.",
  "genres": [
    "Anthologies",
    "Romance",
    "Novella"
  ],
  "author": "Mandee Mae",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/23244742-hot-for-teacher"
}