{
  "title": "The Mountain",
  "description": "ABOUT THE BOOK  The story of THE MOUNTAIN was first published as a poem titled \"SORE FEET\" in Judith Weinshall Liberman's book PASSION: Poems of Love and Protest (iUniverse, 2013). THE MOUNTAIN tells the story of a boy who, with his scout troup, undertakes to climb a tall mountain. Due to various factors, the boy lags behind his mates. However, he persists, and although he reaches the mountain top after his mates have already done so and are on their way back, the boy feels special pride in his accomplishment. THE MOUNTAIN will inspire readers to put in their best effort despite apparent obstacles.  ABOUT THE AUTHOR  Born in Israel (then called \"Palestine\"), Judith Weinshall Liberman came to the United States in 1947 to pursue higher education. She earned four American university degrees including two in law, a J.D. from the University of Chicago Law School and an LL.M. from the University of Michigan Law School. After settling in the Boston area in 1956, she studied art and creative writing. Beginning in the early 1960s, and for four decades thereafter, Ms. Liberman created numerous series of artworks. Her art has been widely exhibited, and is represented in the collection of museums and other public institutions. During her long career in visual art, Ms. Liberman wrote several books, among them some children's books. Her book THE BIRD'S LAST SONG (Addison-Wesley, 1976), which she also illustrated, won a citation as one of the \"fabulous books of the year.\" Since 2012, she has published several additional picture books, including ICE CREAM SNOW (2012), THE LITTLE FAIRY (2013), COLOR IN OUR WORLD (2014), THE VERY OLD PAINTER AND HER HUSBAND (2014), HAIFA (2014), ANGEL'S PUPPIES (2014), THE GIANT HOUSE (2014) and THE BEE AND THE BUTTERFLY (2014). Judith Weinshall Liberman's archives can be found in the Arts Department of the Boston Public Library and at the Smithsonian Archives of American Art.  ABOUT THE ILLUSTRATOR  This is the fifth book on which Judith Weinshall Liberman, the author, has collaborated with Gail Davis, the illustrator. Since she did not feel that, in light of her deteriorated eyesight, she could do justice to illustrating THE MOUNTAIN herself, Ms. Liberman selected a fine artist, Ms. Gail Davis, to create the illustrations under the author's guidance. The two had previously collaborated on THE LITTLE FAIRY, on THE VERY OLD PAINTER AND HER HUSBAND, on ANGEL'S PUPPIES, and on THE GIANT HOUSE. In the present book, Ms. Davis beautifully captures the spirit of the story and of its characters.",
  "genres": [],
  "author": "Judith Weinshall Liberman",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/23236887-the-mountain"
}