{
  "title": "Twin Dragons",
  "description": "Melina Franklin was barely sixteen when she and her grandfather were kidnapped from their small farm in Georgia by an alien trader and sold to an Antrox mining asteroid in deep space. Mistaken for a young boy, she lives in fear of being found out and sold. Her only companionship for the next four years is her grandfather and the Pactors, the large creatures used for hauling the mining ore, that she takes care of. She dreams of the day when she and her grandfather will somehow escape and return home to the rolling green hills of their farm.Calo and Cree Aryeh have been secured as the personal guards for Creon Reykill’s mate, Carmen Walker. The twin brothers are a rare species of dragon known for their fierceness in battle. Born to the mystic dragon clan of the Northern Mountains, they have given their allegiance to the Dragon Lords vowing to serve and protect the royal family and their new true mates. The brothers know they will never be able to have a true mate of their own. Never in the history of their clan have twin dragons been able to find a mate capable of handling two male dragons. They can only hope that they die in battle so they are not destined to be caged when the loneliness eventually drives their dragons insane.The twin dragons are confused when two humans are discovered on an abandoned asteroid mine. The old man and his grandson appear normal enough, but their dragons and their symbiots are driving them crazy, insisting the boy is their true mate. Neither knows how to handle the other two parts of themselves or their need to remain close to the boy. On top of that, the young human male refuses to have anything to do with either of them. He hides and avoids them every time they get near him.Things become clearer when they discover Mel is really Melina. Unfortunately, finding out their true mate is really a woman does little to change her feelings toward them. She is even more determined to return to her world. When her wish comes true, the brothers know they have no choice but to kidnap her and hide her away. Can they convince her to give them a chance at happiness or will she seek protection from the royal family they have vowed to serve? If that is not bad enough, there is another who has his eye on their mate and will do whatever is necessary to keep her – including killing the twin dragons who have claimed her first.",
  "genres": [
    "Aliens",
    "Dragons",
    "Romance",
    "Science Fiction",
    "Menage",
    "Paranormal",
    "Fantasy"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/23245994-twin-dragons"
}