{
  "title": "Abe: Four in Hand",
  "description": "THIS EDITION IS NO LONGER AVAILABLETwenty-six-year-old Abraham O’Donnell is the CFO of Steel Inc. After working tirelessly for over a year, he takes a week off to enjoy the sand, surf, and bikini-clad women of Ft. Lauderdale, Florida. After all, he's earned it. When a brief interlude with a flight attendant in her hotel room goes awry, Abe heads to a rental home with a private beach. While floating naked in the pool, he learns a guest house on the property is also occupied. So much for rest and relaxation. Ever the gentleman, Abe tries to make the most of his misfortune, and offers to make the beauties staying on the property some dinner. It's senior year and Nikolette (Nikki) Bassett is a few days late for her last college Spring Break with her four best girlfriends. When she arrives, all these ladies can talk about is the guy next door. And once Nikki gets a look at him, she knows what they mean. Fresh from an afternoon of surfing, Nikki can hardly believe her eyes when Abe approaches. The sexual tension and banter between the two of them leads to steamy hot sex on the Atlantic shore. It's only a Spring Break fling, and both Abe and Nikki know better than to make it out to be more than that. Or do they? Abe’s calm demeanor changes once he has a taste of Nikki. That night, no location is safe. He takes her on the beach and ravages her in his bed. But despite their mind-blowing sex, Abe's taste for ultimate control in the bedroom makes Nikki uneasy. Nikki's just getting over a heartbreak and she can't afford to let Abe in. So, she pushes aside her budding feelings, and leaves Florida and Abe behind without a backwards glance. Not used to being dumped and afraid to admit how much it hurts, Abe cuts his loses and heads back to Steel Inc., resume his role at the top of Steel Inc., pouring his heart and soul into his work. But Nikki Moore won't be forgotten so easily. Her taste, scent, voice, the noises she made when he brought her to ecstasy, the way she tasted on his tongue, and felt under his touch haunts him. Always fighting for control, Abe tries to push Nikki far into the back of his mind, as he fucks the rented women he had grown accustom to. But Karma is a bitch, and Abe blames her for Nikki leaving him the way she did. So when Nikki shows up unexpectedly, Abe welcomes Karma with open arms. Control has left the building and safety of one's heart is no longer strong enough to stop what happens next. Abe, is the first in the Ties of Steel series from bestselling erotica author MJ Fields. It is a spin-off of the bestselling Men of Steel series featuring the Steel brothers: Jase, Cyrus, Zandor and Xavier.",
  "genres": [
    "Romance",
    "BDSM",
    "Erotica",
    "Contemporary Romance",
    "New Adult",
    "Contemporary",
    "Amazon"
  ],
  "author": "M.J. Fields",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/23247100-abe"
}