{
  "title": "Blueprints",
  "description": "New York Times Bestseller Returning to her beloved New England, the New York Times bestselling author of Sweet Salt Air explores the limits of love and asks what happens when the right man comes along at the wrong time?Caroline and Jamie McAfee are close. Not only do they enjoy their relationship as mother and daughter, they're in business together as the team that fronts the popular home renovation show Gut It! All is well with these two strong women, but when the network tells Caroline that Jamie is to replace her as host, Caroline feels betrayed by her daughter and old in the eyes of the world.Jamie is unsettled by the cast change and devastated by her mother's anger, but she has little time to brood when a tragic accident leaves her two-year-old half-brother in her care. Accustomed to a life of order and precision, Jamie suddenly finds herself out of her depth, grappling with a toddler who misses his parents and a fiancé who doesn't want the child.Amid such devastation, Caroline and Jamie find themselves revising the blueprints they've built their lives around. With loyalties shifting and decisions looming, mother and daughter need each other; but the rift between them is proving difficult to mend. As the women try to remake themselves and rebuild their relationship with each other, they discover that strength and even passion can come from the unlikeliest places. For Caroline, it's an old friend, whose efforts to seduce her awaken desires that have been dormant for so long that she feels foreign to herself. For Jamie, it's a staggering new attraction that allows her to breathe again-and breathe deeply-for the first time in forever.A riveting novel from a master storyteller, Barbara Delinsky's Blueprints reminds us that sometimes love appears when we least expect it, and when we need it most.",
  "genres": [
    "Fiction",
    "Romance",
    "Chick Lit",
    "Contemporary",
    "Womens Fiction",
    "Family",
    "Audiobook"
  ],
  "author": "Barbara Delinsky",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/23245586-blueprints"
}