{
  "title": "Pro: Reclaiming Abortion Rights",
  "description": "A New York Times Book Review Notable BookFrom noted feminist and longtime columnist for The Nation , award-winning author Katha Pollitt's Reclaiming Abortion Rights presents a powerful argument for abortion as a moral right and social good. As the Supreme Court is set to overturn the landmark decision that legalized abortion nationwide, this urgent, controversial book reframes abortion as a common part of a woman's reproductive life, one that should be accepted as a moral right with positive social implications.Nearly fifty years after the Roe v. Wade ruling, \"Abortion\" is still a word that is said with outright hostility by many, despite the fact that one in three American women will have terminated at least one pregnancy by menopause. Even those who support a woman's right to an abortion often qualify their support by saying abortion is a \"bad thing,\" an \"agonizing decision,\" making the medical procedure so remote and radioactive that it takes it out of the world of the everyday, turning an act that is normal and necessary into something shameful and secretive. Meanwhile, the rights once upheld by the Supreme Court are threatened to be repudiated and systematically eroded by state laws designed to end abortion outright.Pro reaffirms the priority of a woman's life and health, and discusses why terminating a pregnancy can be a force for good for women, families, and society. It is time, Pollitt argues, that we reclaim the lives and the rights of women and mothers.“A refreshing and comprehensive look at abortion rights… Pro is a passionate plea―and a book that is needed now more than ever.” ― Salon“Ultimately, Pollitt is arguing not just for reproductive rights but for reproductive justice, which places the right to mother, or not, within the global context of human rights and social and economic justice, inextricable from the fight for universal health insurance, immigration reform and a host of social challenges.” ― The Chicago Tribune",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Politics",
    "Sociology",
    "History",
    "Gender",
    "Womens"
  ],
  "author": "Katha Pollitt",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/23245632-pro"
}