{
  "title": "William's Whimsy",
  "description": "Dear Author,I know this is a difficult task, but you may be just the person to take it on. Write a contemporary, HEA, double gay-for-you. What makes this a challenge? Well gay-for-you is always a challenge, and a double-gay-for you has been done very well by a select few. But these stories are dynamite.See these two guys in the flannel shirts? Well, this isn’t insta-love, but they are taken by surprise by the growing attraction, and it causes them to question who they are. The ramifications are different for each one. What will make this story fun and hot is how they get to the HEA. Awkward situations, soul searching and above all, believable based on their characters. The old miscommunication thing is not as interesting as internal conflict. Maybe they’ve been friends for years? How do they ease into the physical side of the relationship? Or maybe they don’t ease into it, who knows.Photo Description: Two formerly straight young guys holding hands… the distance between them showing a fledgling relationship with some uncertainty and hesitation in their affection… the clasped hands indicating the desire for connection and their attraction to each other… will love conquer social and family expectations?This story was written as a part of the M/M Romance Group's \"Love’s Landscapes\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story. This story may contain sexually explicit content and is intended for adult readers. It may contain content that is disagreeable or distressing to some readers. The M/M Romance Group strongly recommends that each reader review the General Information section before each story for story tags as well as for content warnings.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Short Stories",
    "Disability",
    "Gay For You",
    "Friends To Lovers"
  ],
  "author": "Beck Mitchell",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/23247710-william-s-whimsy"
}