{
  "title": "Time Eternal",
  "description": "Alternate-cover with Lily Morgan's name can be found here.Time Eternal is the story of Skyla Gray, a TSCAA agent in the present day, and Rei Dusan, the crown prince of the sixteenth-century Serbian Empire, who has traded his soul to the gods so he can travel through time to find his one true love, Elizabeth Magini.The story opens with Agent Gray time-ported to an underground bank vault. Her mission is to retrieve a device, but someone else has gotten there first. More maddening is that she recognizes this man’s voice even though she cannot remember ever having met him before. Sent back to the present day by this stranger, she finds the life she knew slowly beginning to unravel... and learns that the stranger is not the only one who has been looking for her these past five centuries. At the Last Battle, Rei Dusan lay dying alongside his father, his brothers, and his countrymen, when a handmaiden from the gods offered him a bargain: his soul and his eternal pledge to do the gods’ bidding in exchange for immortality. With his life, he will avenge his family, his country, and his beloved Elizabeth, who sacrificed her life to save his. He accepted the bargain with the gods only to later discover Elizabeth did not perish in the fire. Will Skyla remember who she really is? What Rei meant to her - to Elizabeth? Will she accept Rei in her present life, where she is no longer a helpless young girl needing rescue from an evil Medici lord, but an ass-kicking agent fighting terrorists for a living? And how will Rei answer to the gods when they find out he has defied their orders? Will there be a happily ever after for Rei and Skyla? Time Eternal is the first book of the Time series, which tells the story of the men and women who are part of a secret government agency, fighting not garden-variety terrorists but the gods and their enemies, who are facing off in a final showdown. Should their wars not be contained, the world will go up in flames - literally.",
  "genres": [
    "Time Travel",
    "Time Travel Romance"
  ],
  "author": "Lily  Morgan",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/23246755-time-eternal"
}