{
  "title": "JUMP: The Fallen: Testament 1",
  "description": "The State took almost everything Jake Blake ever cared about. Tonight, they want to take everything else.Seattle. One man is trapped on the roof of a tall scraper downtown. Six angry agents are threatening to “remand him to Protection.” Jake knows that means he’ll be tortured and killed. Every citizen knows that.Hiding and on the run for the past two years, for Jake, it’s the end of the lying. Now, there’s only one easy way down off this scraper, and getting captured and killed … isn’t it.Welcome to a world where freedom means a citizen still has the power of choice. But most of those choices are between bad and worse.The citizens of the future have assured their security … by giving up just about every freedom they ever had. And they also gave up the only means any one of them ever had to resist.There are no more guns in Jake Blake’s version of eternity, buried or otherwise. And if there are? If a citizen does dig one up? Well, they might find themselves trapped between the “heaven” of a quick and easy death and the “hell” of a long and torturous judgement.Because, as Jake likes to say to anyone who will listen to one of his rants, “Sooner or later the boot finds its way to everyone’s neck.”But tonight is citizen Jake Blake’s sooner, and this time … the neck under that boot is his.Revenge for the daughter they took. Right now, it’s about as tall an order as the top of this scraper. But depending on the last decision he’ll ever make as a man… Jake doesn’t know it yet, but the fate of this eternity—the one where he’s standing on the ledge of a forty-eight story building—hangs in the balance.In and out of reality and nightmare, in the end, Jake must find his own absolution. His own faith.But no matter what happens next, if he doesn't figure himself out, humanity has one day left.The first in THE FALLEN series, JUMP is a fast-paced, action-packed thriller that explores the accepted beliefs of religion and reality against a backdrop of tyranny and dystopian existence.",
  "genres": [
    "Thriller",
    "Science Fiction",
    "Fiction"
  ],
  "author": "Steve  Windsor",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/23249095-jump"
}