{
  "title": "Freed",
  "description": "The conclusion of the multi-episode series The Cage Sessions Thunderclaps and lightning bolts slam through Miami...  Damien Cage is in BIG trouble. Arrested and in jail for a crime he didn't commit... all because of Annika's actions.  Annika finds herself frozen out of Damien's world. Even Jasmine won't talk to her. The only solace she finds is an odd spiritual connection with comatose porn star Marcellina Montero, Damien's former love now withering away in a hospital bed.  Soon, events change with a fury. Annika is thrust into an epic confrontation between her fears of the future and the ghosts of the past.  The aftermath shows her that the bond between Damien and Marcellina may never be broken, forcing her to make a tough decision... one that could be the end of Damien Cage for her.  WARNING: My books are the raw, unfiltered vision of a slightly schizophrenic, sex-obsessed, vodka-swilling \"living contradiction\" with profanity issues. They are often unrealistic (translation: FUN) depictions of what life would be like if erotic romance fantasies came true, so sometimes... gasp!... things happen that aren't \"realistic\". (You know, kind of like how dull boring everyday life is realistic. Seriously, do you want to read about that?) If you are offended by the excessive use of dirty words, crass descriptions, or crude stream-of-consciousness writing laced with potty-mouthed expressions and graphic descriptions of non-traditional carnal delight, then you need to RUN from my writing right now! Don't say you weren't warned. (Oh, and you'd better be over 18! Don't even think about buying my books if you aren't.)  Approximate length: 20,000 words (a novella)  This is the fifth and final title in a series. There is no cliffhanger ending.  There is a heavy emphasis on pansexuality, including a M/F scene and a T/F/M scene. Do not read if this offends you.  Themes: Erotic romance, new adult, rock star, alpha male, tattoos, body piercings, transsexual, pansexual, controlling parent, sex positive, sexual freedom.",
  "genres": [],
  "author": "Skylar Cross",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/23247794-freed"
}