{
  "title": "Beauty and the Geek",
  "description": "Sage was an out of work, down on her luck, classically trained artist when she met Tom. At that point in her life, all her hopes and dreams had been crushed and she was living in the back seat of her car. When Tom came around promising forever and a warm meal, Sage readily agreed.For years she doggedly ignores Tom’s guarded behavior until she suspects he’s having an affair. Upon discovering his most secret possession, a little black book, she goes in search of proof. She discovers he is not only having an affair, but worse, he’s a hired hit man.Tom catches Sage in the act of leaving him and quickly puts two and two together. Knowing what she now knows could land him in prison; he quickly decides that Sage has outlived her usefulness.Sage survives the physical attack and makes tracks to get out of town fast. She has no real friends and nowhere to go except to a high school classmate’s wedding. There, she rediscovers Aden. Aden was the class’ sexiest genius. He wasn’t like the other guys, but Sage knows he’s always had a thing for her and the best part is, he lives across the country – three thousand miles away from Tom and his associates.She offers him an arrangement; she’ll fulfill his every nerdy sexual fantasy if he takes her to live with him in the secluded northern woods of California. Aden agrees and takes her to his home and he immediately goes on with his life and work as though nothing’s changed.Alone all the time, Sage starts snooping around, only to discover small things about who he was and who he’s become. She’s also falling in love, but she’s convinced herself that she’s only good for one thing to him and as soon as the danger’s passed he will ask her to leave.Sage gets a warning from an old friend that Tom knows where she is and he’s coming for her. In an effort to protect Aden she tells him what happened with Tom and why she ran, only to discover that their reunion was far from happenstance. Aden is a U.S. Marshal and he, and others like him, have been trying to nail Tom for a long time. They needed proof, and Sage just happens to be the best witness they could get their hands on.They’ve effectively baited and set the trap, now all they needed was Tom.Has Sage once again fallen in love with the wrong man?What will Sage do once the danger has passed and Aden no longer needs his star witness?Will Sage and Aden's trap catch the hired killer, or is Sage destined to be on the run for the rest of her life?",
  "genres": [
    "Romance"
  ],
  "author": "Kara Huntington",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/23245445-beauty-and-the-geek"
}