{
  "title": "Iceman: My Fighting Life",
  "description": "“When I walk out of the tunnel, I can see the lights, hear the music, feel the crowd, but it all begins to close off as I near the cage. By that point I’m thinking, I’ve been training hard, it’s time to focus....Every man is born with a fight-or-flight instinct, and mine is to fight. It always has been.” —From the Prologue  What’s it like to have no fear, to make people cower in their shoes, to know the sweet satisfaction of knocking a guy out with a single, devastating punch? You have to read my book to find out. I’ve been called the baddest man on the planet. I’m the face of Ultimate Fighting Championship, the leader in mixed martial arts and the fastest growing sport in America. In 1998 I won my first MMA fight. Not long after, the UFC came calling, and eventually fought my way to become the #1 ranked light-heavyweight contender in the world. Not bad for a bartender with a college degree in accounting.  I was raised by a single mother and inspired by my grandfather, a first- generation Irish American from Mafia-run Brooklyn. I learned how to fight at a very young age. Now I’m 6'2\", 220 pounds, and a trained lethal weapon, but I’m also fiercely loyal, maybe even a bit sensitive, and unexpectedly romantic. In raw detail, and with total honesty, I’m going to tell you the story of my fighting life—both inside and outside the Octagon— including my childhood in the poor section of Santa Barbara, gritty insider accounts of my major fights, stories behind my trademark mohawk and nickname, my ongoing rivalry with Tito Ortiz and deep-rooted friendship with Dana White, and how I balance life as a father, a UFC champ, and a superstar—or try to, anyway. With never-before-seen photos, Iceman is my true, no-holds-barred story of fighting my way to become a champion.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Biography",
    "Mixed Martial Arts",
    "Autobiography",
    "Martial Arts",
    "Memoir"
  ],
  "author": "Chuck Liddell",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/2325230.Iceman"
}