{
  "title": "Silver & Black",
  "description": "As the CEO of Silver Coffee, the largest coffeehouse chain in the world, Brian Silver has everything: money, power, sex, and luxuries at his disposal. But when a tragic health event leaves him vulnerable, he realizes those things are worthless. He is on a mission to fill the void in his life when he first meets the young, gorgeous Greyson Black, who is working his way through school as a barista at one of his coffee shops.Silver wants Greyson, and he’s used to getting what he wants. Greyson Black is determined to make the best out of his life, but despite his best efforts, life hasn’t played fair, and neither has love. He is nursing a broken heart when Brian Silver walks into his life, and for once, Greyson thinks fate has finally granted him the opportunity for happiness. But fate can be manmade, and Greyson soon discovers that a relationship with Brian Silver comes at a cost. Silver and Greyson emerge on a hot and passionate journey, but danger lurks in the darkness, threatening to destroy everything they’ve worked for. When the mind games make Greyson question Silver’s motives, he will have to determine if their love is worth the risk. Shots are fired, leaving all trust dead. They say love is blind, but Greyson would say, suspicion is the real killer. And sometimes, secrets are worse than bullets. Silver & Black is a gay mystery romance and is intended for readers 18 years of age or older for sexual content, language, and mild violence.Second edition includes: New cover, updated blurb, a chapter added, updated and added scenes, change of tense, added dialogue, new editing and formatting.There is SIGNIFICANT changes to the book, but the plot is the same. First edition, published May 2016; Second edition, published July 2018.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Gay",
    "Mystery",
    "LGBT",
    "Audiobook"
  ],
  "author": "Tyler May",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/23252649-silver-black"
}