{
  "title": "Spies and Saucers",
  "description": "adness, murder and mayhem abound in SPIES & SAUCERS, a collection of three sui generis novellas by ROBERT GUFFEY. Each of these tales explores the anti-Communist hysteria of the 1950s, as well as the flying saucer obsession of that era, while straddling the boundaries of seemingly disparate genres: metaphysical science fiction, espionage, satire, and crime noir.  The first part of SPIES & SAUCERS, “The Fallen Nun,” takes place in 1959. Our protagonist, Kyle Black, wakes up one morning to discover a dead nun lying facedown in the marijuana garden in his backyard. Attempting to solve the mystery of how the nun ended up in his garden leads Kyle to strange encounters with an Irish Cyclops named Finn mac Cumhall, a Devil Bat grown to enormous proportions by a dead mad scientist, two homicidal tabloid journalists, and a sickly extraterrestrial abducted by a time travelling mother superior . . .  In “Communist Town, U.S.A.,” a young FBI agent named Philip Trowbridge is sent to Wisconsin in 1955 with orders to infiltrate a small town, reportedly a hotbed of underground Communist activity, in which several previous FBI agents have disappeared without a trace . . .  \"Spies and Saucers\" is set three years earlier in 1952 and involves a blacklisted, left-wing Hollywood screenwriter named Curt Adamson. Down on his luck after having been dumped by every studio on the West Coast, Adamson is recruited by a covert spy agency to write a screenplay for an unknown reason—unknown only to Adamson, that is. Adamson’s superiors are well aware of the screenplay’s purpose. Though consistently told he doesn’t have a “need to know,” Adamson insists on discovering the truth behind the tale he himself is weaving, and uncovers a plot far more outlandish and ominous than the cheap horror and science fiction B-movies on which he’s built his tarnished reputation . . .",
  "genres": [],
  "author": "Robert Guffey",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/23252733-spies-and-saucers"
}