{
  "title": "One Enchanted Evening",
  "description": "One Enchanted Evening is the cheeky retelling of the classic story of Little Red Riding Hood. The heroine finds a wellspring of courage she didn't know she had. The hero discovers disability doesn’t equal weakness. The villain—well, he’s just plain rotten. Meanwhile, the reader will never look at a clothing from a consignment shop the same way again. Blurb:Enchanted clothing has a mind of its own. Restlessness plagued Charlotte Becker. Unable to settle down, she moved from place to place searching for an elusive something to calm her turbulent spirit. A sudden invitation from her sister sends her across country to Lobster Cove, Maine. Anchors abound by the sea, but surely nothing would keep her rooted in place in a pokey resort town during the off-season. Drawn into a consignment shop named One Enchanted Evening, Charlotte is confronted by a mysterious article of clothing requesting her help to stop a man in a wolf mask from killing women. Charlotte agrees to protect the citizens of Lobster Cove and find the hunter before an innocent is slain. Luke Maddox’s hunting days are over. Wounded in action, he left the Marines to return to Lobster Cove, the only place to bring him peace as a child. Hiding his disability, he accepts life will be nothing more than dull routine. Then he meets a singular young woman wearing an unusual cloak. She tells an incredible story of a wolf that walks on two legs. And the hunt begins…Excerpt:The woman’s gaze raked over Charlotte. Sharp brown eyes caught her in an unblinking stare.“Um, hi,” said Charlotte, suddenly feeling as if she had walked out of her apartment without pants. Unconsciously, she ran a hand down her side, and was relieved to touch denim.“Oh? A consignment shop?” chirped Annabel. “Perhaps we could look around. My sister and I love vintage wear,” she added with her winning smile. Charlotte rolled her eyes. Annabel never gave up easily. She’d have that woman arm-wrestling over a price for the armoire before she could say interior designer discount.“Your life is complete, Mrs. Fisher,” said the shop owner pleasantly. “Nothing in here would fit.” Amused, Charlotte for once noted Annabel at a complete loss for words.The coins on the woman’s scarf jangled as her head swung toward her. Charlotte swallowed hard as the pantsless feeling crept up her legs again. “You have possibilities,” the woman said. “The path traveled can be diverted. Come back when you’re ready to accept the consequences. I warn you, though; the first step to fulfilling one’s destiny can be dangerous. Good day.” She shut the door in their faces.Annabel gawked at the building. “Helluva way to run a business. She’s not going to last long in Lobster Cove with that attitude.” She slipped her arm into Charlotte’s. “Come on, I know a fabulous little place around the corner that sells dynamite shoes.”As Charlotte allowed herself to be led away, she glanced back over her shoulder. The curtains were still closed. The shop appeared as vacant as before, but she couldn’t shake the feeling that behind one of those obscured windows stood a little old lady peering intently in her direction.",
  "genres": [
    "Romance",
    "Paranormal"
  ],
  "author": "L.A. Kelley",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/23251933-one-enchanted-evening"
}