{
  "title": "Trouble Makers",
  "description": "Tyler kissed me with all the expert skill of a man who’d done it thousands, maybe hundreds of thousands, of times, but he made me feel like I was the only woman he’d ever wanted to kiss, now or ever. His mouth made so many promises, I couldn’t keep track of them all.   TROUBLE IN PARADISE (Book #2 Katie and Tyler's Story - Book #5 in the Trouble Series)  amazon.com/dp/B013ZQ5NSO TROUBLE RISING (Book #3 Katie and Tyler's Story - Book #6 in the Trouble Series) amazon.com/dp/B017UNW3FO  TROUBLE ~ Amazon Top 100 Bestselling Series ~ FROM NEW YORK TIMES BESTSELLING AUTHOR EMME ROLLINS ----- When your best friend falls in love with a rock star, you either join her in her fixation, or you spend a lot of nights eating ice cream and watching Netflix by yourself. If you can’t beat them, join them, isn’t that what they say?  While Bree—my best friend since forever—couldn’t get enough of “Trouble” and their lead singer, Rob Burns, I set my sights a little lower – and to the left. Rob’s immediate left, that is, at least on stage. Tyler Cook was Trouble’s lead guitarist, a tall, glorious, dark blonde, beautiful specimen of a man who could make ovaries explode and panties drop with just one twist of that smirky smile of his.  Of course, it was all just in good fun, two girls going to Trouble concerts and screaming ourselves hoarse along with the rest of the fans. Bree’s fascination with Rob, and mine with Tyler, was a fun little fantasy, a distraction from our boring everyday lives, mine as a dental hygienist and Bree’s as an elementary school music teacher, until one day the “what-if” game Bree liked to play—and in, “what if we met Trouble some day?” and “What if they asked us to go on tour with them?”—actually happened.  Actually. Happened.  One minute we were going to see Trouble in concert, and the next, we were backstage, face-to-face with the real-live, sexy thing. I never expected to meet rock god Tyler Cook. I never expected to end up on a tour bus with sex god Tyler Cook. I certainly never expected to fall in love with the man, that beautiful, broken, wild man, or become so hooked I simply couldn’t give him up—no matter what it cost, or who I hurt, even myself.  Because sometimes you have to stop asking yourself, “What if?”  \nSometimes you have to find out what happens next...",
  "genres": [
    "Romance",
    "New Adult",
    "Music",
    "Contemporary Romance",
    "Erotica",
    "Musicians",
    "Amazon"
  ],
  "author": "Emme Rollins",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/23254242-trouble-makers"
}