{
  "title": "Christmas Bizarre",
  "description": "READERS' FAVORITE 5-STAR REVIEW !What do Santa’s Sidekick, a dead lawyer and a geriatric vampire have in common? Meet Mina Kitchen--a forty-something single who finds trouble quicker than she can whip up a batch of breakfast breads. Plural. Her catering disorder runs neck-and-neck with her weird luck, and her cat’s weirder tendency toward gnawing elf gear. Okay, and getting kidnapped a couple of times in one week is a little strange, too.Her next door neighbor Vito's past as ex-leader of the Moils, the Jewish-Polish Family from Bumville, New Jersey, comes to light and throws a dollop of dilemmas into an already simmering plot.Top it all off with a counterfeiting ring, a county-wide dearth of holiday wrapping tape, and a mass of pets running loose at the local mall, and what do you have? A recipe for disaster that Mina whips to a froth.If you're looking for funny novels for women, packed with humor, cozy animals (in the guise of pets) -- and recipes -- look no further. The second book in the hilarious Mina Kitchen Comedies, Christmas Bizarre will keep you smiling when you’re not shouting up a belly laugh. It delivers a LOL tour of Lancaster, “Pee-Ay”, where you’ll discover a lively cast of characters, funny dialogue and lots of twists and turns.Do you like funny fiction with a hint of thrillers, mysteries and suspense? Download Christmas Bizarre NOW! Chock full of delightful surprises, this cozy mystery closes with a bonus section of free recipes, inspired by the story and vetted by Lund's chef husband, for your own culinary creation and consumption.˃˃˃AMAZON READER \"...feel of Jerry Seinfeld meets Catch 22 while watching a Pink Panther movie. I will be looking for more from Ms. Lund.\"\"Laugh out loud funny in places and snicker worthy in others.\"˃˃˃BET YOU CAN'T STOP LAUGHING!\"Miss Lund has a wonderful and quirky since of humor. While charging from one crazy temp job to another, (Christmas at the mall will never be the same;) she managed to pickup a stalker. Mina, not Miss Lund. Please come meet this wonderful cast of characters.\"˃˃˃DON'T WAIT FOR CHRISTMAS TO READ THIS ONE!\"Well written, brilliantly paced and laugh-out-loud funny, Lizz Lund rises head and shoulders above a lot of the offerings out there. Her books are chock full of accessible characters, unpredictable conflicts and wonderful plot twists. Farcical perhaps, but there's never a sense of it being self-conscious or contrived. Mina Kitchen's just an ordinary gal, struggling to make ends meet, looking for love, and finding herself knee- and sometimes neck-deep in bizarre developments. But in the end, it's her down to earth, roll with it attitude that engages the reader and keeps us laughing all the way.\"Scroll up NOW and click the \"buy now with 1 click\" button!Or read it for FREE with Kindle Unlimited!Also available in paperback through Amazon!",
  "genres": [
    "Christmas",
    "Fiction",
    "Humor",
    "Cozy",
    "Holiday",
    "Cozy Mystery",
    "Amazon"
  ],
  "author": "Lizz Lund",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/23257250-christmas-bizarre"
}