{
  "title": "Fierce Series - Boxed Set",
  "description": "From USA TODAY Bestselling Author Clarissa Wild comes the highly anticipated Boxed Set of the bestselling Fierce Series, a New Adult College Romance! Over 1000 pages! \n***Enjoy reading the complete Autumn & Hunter ARC in the Fierce series with these four complete books in one volume!***\n ~FIGHT  \nMocked. Scolded. Smeared. Betrayed.\n  Teased and bullied her whole life, nerd girl Autumn Blakewood is withdrawing more and more. Nobody can protect her from her malicious classmates who seem set on destroying what’s left of her heart. However, devastating news now also rips her family apart. It’s up to her to pick up the pieces of her life and find a way to fix everything. Will she find the courage to fight?  ~FIERCE  \nFight for your dreams. Fight for your life. Fight for love.\n  Nerdy girl Autumn Blakewood is the prime example of a goody two-shoes. She studies every night, is never late for class, and always follows the rules. She has never felt the need to step out of her comfort zone. That is, until she meets Hunter.  Hunter Bane is a cocky, confident bad-boy, who's nothing but trouble. He's a dangerous distraction to everyone around him. Sexy and strong, Hunter enjoys the swooning effect he has on women. Especially those who aren't used to attention, like Autumn.  Autumn finds it hard not to give into Hunter's advances, even though it all seems like a game to him. Trying to understand him is impossible, because he shrouds himself in mystery. What she doesn't know is that Hunter has more baggage than anyone should have to carry. When she discovers he's in an illegal frat club to save the one person that matters to him, Autumn realizes this could mean the end of her undeniable connection to him. Even their lives are at risk. But it's too late to turn back now ...  ~FURY  \nWould you risk everything for love?\n  Cocky, fighter Hunter Bane is falling for the charms of geeky Autumn Blakewood, but when his brother is caught dealing drugs and sent to prison, Hunter’s world shatters. To save his brother, Hunter has to join the gang he’s feared his entire life. Now he’s forced to choose between his family and the one girl he loves. Fighting for both, his fury is all he needs…  ~FLAME  \nWhen trust is challenged and desire takes control, is love enough to conquer fear? \n  Geeky girl Autumn Blakewood fell for the cocky, confident fighter Hunter Bane.",
  "genres": [
    "Anthologies",
    "Romance",
    "College",
    "Abuse",
    "New Adult",
    "Fighters",
    "Contemporary"
  ],
  "author": "Clarissa Wild",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/23257315-fierce-series---boxed-set"
}