{
  "title": "Seven Sunsets",
  "description": "Emery wants to die. Good thing she just ran into a killer.\"They say what doesn't kill you makes you stronger, but that's bullshit. What doesn't kill you leaves a scar. More than the eyesore down my torso, I was a scar, the jagged, fucked up remains of a tragedy.\"Scar's Nomad status gives him a chance to fulfill his one wish, but his lonely mission is interrupted when a possible one-night stand goes horribly wrong.\"They say what doesn't kill you makes you stronger, but what if I can't live with myself anymore?\"Finding the blonde face down in a puddle of her own blood jeopardizes everything. Saving her and keeping her quiet could get Scar killed, but when Emery wakes up, her shocking proposal for him to kill her starts the ride of his life.Money alone won't be enough for Scar to take the job, but he could use an accomplice with nothing to lose, one who won't be around to tell tales. Agreeing to a week on the back of his motorcycle, keeping his bitch seat warm for the woman Scar's hell bent on saving from a rival gang, Emery sets out on her last adventure. But saying goodbye is harder than they could ever imagine after seven sunsets.\"How can one week change your whole god damn life?\" With the Heelz and Mutherfukers on their tails, Scar has to call on two of his brothers to help them rescue Halley from the Son's of Satan MC. As their loyalty saves him over and over, he finds himself reevaluating his place in the Asphalt Gods' MC. Will he really leave the Gods to live a normal life with Halley when all of this is over? The more Scar learns about Emery, the more he mistrusts her but he can't deny his other feelings for long. When Emery learns about Scar's past, she sees this killer in a new light but can she overcome her debilitating depression to let him really know about hers? When she learns that the woman he's saving is actually his sister, can love bring her back from the edge? This is an erotica so you've been warned!",
  "genres": [
    "Romance",
    "Novella",
    "Erotica",
    "Contemporary"
  ],
  "author": "Morgan Jane Mitchell",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/23262803-seven-sunsets"
}