{
  "title": "Sally Hemmings",
  "description": "When this stirring work by Philadelphia-born Paris-based sculptress and historical-fiction writer Barbara Chase-Riboud first appeared in 1979, it was dismissed by many mainstream historians as \"hogwash.\" But with DNA evidence proving that Thomas Jefferson, the third president of the United States, did indeed father at least one child by his black slave mistress, Sally Hemings, Chase-Riboud's book deserves a new read. With her painstaking eye for research, Chase-Riboud unfolds a complex 19th-century quilt of miscegenation, denial, hypocrisy, slavery and, yes, love in Virginia. She brings to life Heming's relationship with Martha, her half-sister and the President's wife on his Monticello estate; Jefferson's seduction of Hemings in Paris after Martha's death; and his lifelong concubinage of Hemings until his own death, when she and her offspring were freed. Chase-Riboud avoids the sentimental \"tragic-mulatto trap\" that other writers have fallen into when they deal with slave relations by making Hemings not only multidimensional and believable, but, given late-20th-century political scandals, chillingly contemporary. Along with the novel's other sub-themes, including black disenfranchisement and the fear of reenslavement, Riboud intimates that Jefferson-- despite his racist rantings in Notes on the State of Virginia , which Chase-Riboud uses as epigraphs--may have actually loved this black woman, and that the relationship between Thomas Jefferson and Sally Hemings was perhaps the clearest example of the American imperative of \"seeking a more perfect union,\" a controversial portrayal that Chase-Riboud makes plausible with skillfully written prose. --Eugene Holley Jr.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "African American",
    "Romance",
    "Book Club",
    "American History"
  ],
  "author": "Barbara Chase-Riboud",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/232624.Sally_Hemmings"
}