{
  "title": "The Nixon Effect: How Richard Nixon s Presidency Fundamentally Changed American Politics",
  "description": "The Nixon Effect examines the 37th president’s political legacy in broad-ranging ways that make clear, for the first time, the breadth and duration of his influence on American political life. The book argues that Nixon is the key political figure in postwar American politics in multiple ways, some barely acknowledged until now. His legacy includes a generational shift in the ideological orientations of both the Republican and Democratic parties; the Nixon influence, both intentional and unintentional, was to push both parties further out to their ideological poles. So stark was Nixon’s influence on party identities that it shaped the hardened partisan polarization in Washington today and the evolution of what has come to be called Red and Blue America.Stemming in part from this, and also from Nixon’s scorched-earth political warfare and eventually his Watergate scandal, we have also seen the evolution of politics as war, where adversaries and ideological opponents are seen as evil or unpatriotic. Finally, Nixon’s pioneering tactics—from the identification of the Silent Majority to the Southern Strategy, from “triangulating” between both parties and claiming the political center to launching the culture war with attacks on “elites” in media, academia, and the courts—have shaped political communications and strategy ever since.Other books have argued for Nixon’s importance, but Douglas E. Schoen’s is the first to take into account the full range of this fascinating man’s influence. While not discounting Nixon’s many misdeeds, Schoen treats his presidency and its importance with the seriousness—and evenhandedness—that the subject deserves.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "American History"
  ],
  "author": "Douglas E. Schoen",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/23258921-the-nixon-effect"
}