{
  "title": "Hesitant Heart",
  "description": "Welcome to the Hampton Road Club. It’s the 1920’s and men who enjoy Dominance and submission have to be very careful that their dark desires aren’t discovered. The exclusive and secret Hampton Road Club near Hollywood is one of many private homes around the world that offers facilities for those who practice sadism and masochism. Meet the men who search for love amongst the world of bondage, whips and chains. This is where a Master can find a submissive to cherish forever and a submissive can give himself to his Master for a lifetime of painful pleasure. Eighteen year-old Sam Cunningham is used to living with lots of secrets. He’s had to hide his true nature his entire life or else incur the wrath of his strict and abusive father. When he’s faced with a horrible ultimatum, he flees to Hollywood where he hopes he can escape the fate his father has planned for him. Aaron Rubenstein is a wealthy and sophisticated man who loses himself in painting portraits of bound men to help stave off his loneliness and despair. Unable to find a lasting connection with anyone, he’s had to resort to paying lovers not only for their affections, but to be allowed to indulge in his darker passions. Aaron’s only respite is his nights at the Hampton Road sadomasochism club where he’s a respected Dominant. Naïve and inexperienced in the ways men can please one another, Sam takes a job at a bathhouse where he first glimpses a beautiful older man. Aaron notices the sweet towel boy watching him with interest every time he patronizes the Temple of Eros bathhouse. A traumatic incident for the innocent towel boy triggers Aaron’s protective tendencies and he’s compelled to rescue the gentle Sam from the clutches of the Temple’s manager. They embark on a journey together that teaches them both things about themselves that they never knew. As their bond deepens and Sam is trained for his first night at the Hampton Road Club, an unknown danger lurks. Will Sam’s father find him and destroy both men’s chance for true happiness together? Or will Aaron protect his boy and keep him for always?",
  "genres": [
    "BDSM",
    "M M Romance",
    "Historical",
    "Historical Romance",
    "Erotica",
    "Romance",
    "Gay"
  ],
  "author": "Morticia Knight",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/23262875-hesitant-heart"
}