{
  "title": "Im Zeichen des Ypsilon",
  "description": "Im Zeichen des Ypsilon hat alles, was einen spannenden Fantasy-Roman ein düsteres Geheimnis in Form einer versiegelten Flasche, einen Bösewicht in der Tradition des verrückten Wissenschaftlers und einen jungen Protagonisten, der es zusammen mit seiner Verbündeten gegen den Rest der Welt aufnimmt. Die Welt, in der der vierzehnjährige Finn sich bewegt, steckt voller Geheimnisse. Nicht zuletzt er selbst verbirgt etwas, nämlich sein alter ego „Silber“, eine Art Superhelden, der früher mit seinen Freunden des Nachts die Stadt unsicher machte und Häuserfassaden mit Figurenmalerei bedeckte. Doch die Zeiten von Silber scheinen seit dem tragischen Tod von Coco, Finns bestem Freund ein für allemal vorbei zu sein. Bis eines Nachts ein junges Mädchen auf den Dächern der Stadt auftaucht, das von einem der „Geheimen Doktoren“ der Kummerschule verfolgt wird. In höchster Not wirft sie Finn eine versiegelte Flasche zu, bevor sie wieder verschwindet. Bereits in der nächsten Nacht verliert Finn die Flasche jedoch wieder an die Geheimen Doktoren und somit an Konstantin York, den Leiter der Furcht einflößenden Kummerschule. Nun überstürzen sich die Ereignisse. Ein namenloser Junge taucht plötzlich halb erfroren im Schnee auf, Delphine, das Mädchen vom Dach, wird von Konstantin York zu einem teuflischen Pakt gezwungen und Silber kehrt auf die Straßen der Stadt zurück. Dimitri Clou ist es gelungen, in seinem Roman traditionelle Fantasy-Elemente mit der Welt der Jugendlichen von heute zu verbinden. Der Superheld Silber ist ein talentierter Graffiti-Sprayer und besitzt zwar keine übersinnlichen Kräfte, wohl aber einen silberfarbenen Motorroller. In rasanten Schnitten entfaltet sich die atemlose Handlung um den Kampf zwischen Gut und Böse, dessen Rolle hier von einem Wissenschaftler übernommen wird, der ein Malaria-Medikament entwickelt hat, dieses aber der Welt vorenthält. Der Roman bietet eine gelungene Mischung aus bekannten Sagen und Mythen sowie den ethischen Fragenstellungen der heutigen Zeit, und wird ob seines Tempos und Sprachwitzes sicherlich nicht nur Kinder und Jugendliche fesseln. --Nathalie Schwering",
  "genres": [
    "Fantasy",
    "Fiction",
    "Young Adult"
  ],
  "author": "Dimitri Clou",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/2325875.Im_Zeichen_des_Ypsilon"
}