{
  "title": "Vain: The Complete Series",
  "description": "Part one:Sex.That's all Noah Foster wanted when Alexa Jackson showed up at his apartment. After returning from a semester in Paris, Alexa is back in her hometown of Boston and looking for anything but the drama that surrounds Noah. He's intense, gifted, famous and a bastard through and through. Alexa doesn't take life too seriously. Noah doesn't do calm and easygoing.Their unexpected meeting sets them both on a course towards an unlikely connection. As Noah embarks on a journey to teach school teacher Alexa the ways of his dark and mysterious world, she's fighting her own demons and the memory of a stranger in Paris. When Alexa's past suddenly becomes her present, she's forced to face the reality of whether the passionate moments she's spent in Noah's arms, in his bed, and in his life mean anything to him, or has it all been in vain? Part Two:Posing nude for the illustrious Noah Foster seemed like an exciting escape from Alexa's life. No one was supposed to find out, but when the one man who owned her heart, discovers her secret, everything changes. Alexa is not only caught in a compromising position but in a situation in which her past and present collide. Determined to build a future for herself, she takes on the dual task of focusing on her career and burying her past regrets. It's never that easy though, and Noah Foster doesn't give up when he sets his sight on something or someone.As Alexa chases after her own dreams, both men in her life pursue her in a reckless fight to the emotional finish.When one man offers her a proposal almost too tempting to resist, she makes a decision that brings her face-to-face with an unexpected reality. Part Three:Alexa Jackson was falling hard and fast for Noah Foster. The world renowned photographer had woven a path straight into her heart. He offered her another chance at love and she offered him the path to a world that he no longer believed existed for him. That all ground to a startling halt when Alexa came face-to-face with Noah's past. Not everything is as it seems and as he helps her piece together the puzzles that exist within his world, they both realize that their needs might not match what's best for either of them. As Alexa begins a new life away from Noah, she's faced with new opportunity, past reminders and an uncertain future. He can't face what's happened to him. She can't face a life without him. Will they finally discover a way to help one another find love again?",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Adult",
    "New Adult",
    "Fiction",
    "Erotica"
  ],
  "author": "Deborah Bladon",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/23261666-vain"
}