{
  "title": "The Man Who Killed Kennedy: The Case Against LBJ",
  "description": "\"We appreciate Roger Stone, he is one tough cookie.\" - President TrumpThe sensational New York Times bestseller, now in paperback.Find out how and why LBJ had JFK assassinated.The Man Who Killed The Case Against LBJ hit the New York Times bestseller list the week of the 50th Anniversary of the assassination of President John F. Kennedy. Consummate political insider Roger Stone makes a compelling case that Lyndon Baines Johnson had the motive, means, and opportunity to orchestrate the murder of JFK. Stone maps out the case that LBJ blackmailed his way on the ticket in 1960 and was being dumped in 1964 to face prosecution for corruption at the hands of his nemesis attorney Robert Kennedy. Stone uses fingerprint evidence and testimony to prove JFK was shot by a long-time LBJ hit man-not Lee Harvey Oswald.President Johnson would use power from his personal connections in Texas, from the criminal underworld, and from the United States government to escape an untimely end in politics and to seize even greater power. President Johnson, the thirty-sixth president of the United States, was the driving force behind a conspiracy to murder President Kennedy on November 22, 1963.In The Man Who Killed Kennedy, you will find out how and why he did it.Legendary political operative and strategist Roger Stone has gathered documents and uses his firsthand knowledge to construct the ultimate tome to prove that LBJ was not only involved in JFK’s assassination, but was in fact the mastermind.Skyhorse Publishing, as well as our Arcade imprint, are proud to publish a broad range of books for readers interested in history--books about World War II, the Third Reich, Hitler and his henchmen, the JFK assassination, conspiracies, the American Civil War, the American Revolution, gladiators, Vikings, ancient Rome, medieval times, the old West, and much more. While not every title we publish becomes a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "True Crime",
    "American History",
    "Biography",
    "Historical"
  ],
  "author": "Roger Stone",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/23263090-the-man-who-killed-kennedy"
}