{
  "title": "HEROES Urban Fantasy and Super Powers Bundle #1",
  "description": "\"Over $15 of books for only 99 cents? Impossible for fans of fantasy and superheroes to pass up!\"An impressive collection of the most powerful voices in Urban Fantasy todayThe heroes in these hand-selected 10 books are all spectacular, whether born with special abilities or created, by choice or by science lab. Some of these tales fit neatly into sci-fi or fantasy categories, but many fall into the wonderful gap between. For example, what do you call a story with ghosts and magic, plus high-tech devices? Which genre do mutants fall into? Or genetically-modified superhumans? The 10 tales contained within this bundle (congrats on discovering this great bargain, by the way!) stretch the limits of imagination while blurring genre boundaries. What they do have in common is originality, and some of the most compelling, unique voices in publishing today.Ready to dive in?Included books are from different authors and may be read in any order. Lengths vary. Please note: some stories contain mature subject matter; all are appropriately labeled.INCLUDED IN THIS 10-BOOK BUNDLE:About Last Night by T. Paulin(130 pages - Paranormal Mystery)A geeky delivery driver with ADD becomes a ghost detective and solves his first haunting. Comedic with touches of horror. First in series, no cliffhanger. Published June 2014, first time in an anthology.Sterling (Mageri Series Book 1) by Dannika Dark(376 pages - Urban Fantasy Romance)A young woman must let go of her past in order to accept her future as an immortal Mage.Ellie Jordan, Ghost Trapper (Book 1) by J. L. Bryan(296 pages - Paranormal Mystery)Ellie specializes in removing restless ghosts from haunted houses, but her new case turns out to be darker and more dangerous than she ever expected. First in series, no cliffhanger. Originally released September 2014, first time in an anthology.Accession (Sarath Web) by Terah Edun(256 pages - Young Adult Fantasy)Sixteen year old Katherine Thompson leads a boring life—until her sister is killed in a horrifying accident and she’s forced to take on the responsibility of heir to the coven throne.Code Breakers: Alpha by Colin F. Barnes(260 pages - Sci-Fi / Cyberpunk)In a post-apocalyptic world, humanity comes under threat from a deadly Artificial Intelligence. Gerry Cardle, coder extraordinaire, is the only one who can save mankind, even if it means sacrificing everything he has ever loved.Maggie for Hire (Maggie MacKay: Magical Tracker) by Kate Danley(288 pages - Urban Fantasy)When monsters appear in Los Angeles, Maggie MacKay is on the job. Her latest gig? To stop the vampires from turning Tinseltown into an all-you-can-kill buffet.Flaming Dove by Daniel Arenson(352 pages - Dark, Post-Apocalyptic Fantasy)Outcast from Hell. Banished from Heaven. Lost on Earth. Laira’s mother was an angel, her father a demon. As Heaven and Hell battle around her, Laira’s own war rages between her two halves.Alone (Girl in the Box #1) by Robert J. Crane(220 pages - Urban Fantasy)A young woman held prisoner in her own house for a decade finds herself on the run and discovering mysterious powers she never knew she had.Crystal Magic (Clearwater Witches) by Madeline Freeman(320 pages - Young Adult Urban Fantasy)Magic can be as dangerous as fire, as Kristyl Barnette is about to learn. When a curse threatens someone she loves, witches could help her, but is dealing in magic worth the consequences?Feyland: The First Adventure by Anthea Sharp(65 pages - Young Adult Urban Fantasy)High-tech gaming and ancient magic collide when a young woman hacks into a computer game that opens a gateway to the treacherous Realm of Faerie.",
  "genres": [],
  "author": "T. Paulin",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/23266135-heroes-urban-fantasy-and-super-powers-bundle-1"
}