{
  "title": "Scar Jones",
  "description": "Scar Internet Lunatic  You should instantly download this book because it makes hacker geeks poop their pants. If you're lucky, it won't be painful.   'Funniest book I've read in a long, long time.'  'Had me chuckling out loud - a lot.'  'Pretty weird, but helluva fun read.'  'SCAR! Holy shit. He is the MAN!'      Winner of the 2024 most wierdest book aWard!! Runner up of the disturbed narrative secret prize worth nothing to the author. Shortlisted for the Harry Butt prize.    Scar Jones (Comic Urban Fantasy - or whatever)   Scar ain’t got but one eye and no memory to speak of, neither. Plus, he gets his words all mixed around and he’s a homeless black dude from Texas. But he gets himself a job handing out business cards for a fin a week, so life ain’t too bad. Something blessed him good, though, ‘cause them cards was some clever SOB’s big plan and now everybody thinks Scar done pulled off the biggest scam in internet history, plus it must have been legal, ‘cause instead of locking him up, they put him on TV. Pretty quick, he’s about one of the most famous people out there. Everybody’s watching his show. But the mess is kicking down in the background. Some weirdo calling himself the Killer is out hunting down people who took part in that internet stunt. Another darko what’s called Entropy, the one that got Scar the job in the first place, has got some internet super power and he’s making all sorts of bat-stuff happen. Them companies following Giggle and Microsuck and what not, he’s attacking them online. He’s also got all sorts of lawsuits happening all over the place. Probably, he’s controlling that Killer, too. He’s madder’n hell at this little skirty Ikea, who stood him up on a coffee date, so he goes in and wrecks her stores. Those suits that work for her like it, though. They film him doing it and turn it into a commercial and make money. Strange world, Scar knows and he's about to send it a whole mess of stranger.  But he doesn’t care about none of that, anyway. He’s having too much fun being schizifrenetic or whatever it’s called.",
  "genres": [],
  "author": "Kelly Mitchell",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/23265125-scar-jones"
}