{
  "title": "Productivity Tools for Business: 57 Proven Online Tools to Recapture the Hours of Your Day",
  "description": "REVISED AND UPDATED for 2018!In 1993 I founded my software company 21st Century Technologies, Inc. I have since build custom database software systems for the top pharmaceutical and semiconductor companies in the world. Although I still build database software systems, my efforts have moved in the direction of building websites that increase companies sales and doing online marketing, search engine optimization and search engine marketing/pay per click advertising. This experience has led me to founding the publishing company WildBlue Press along with my partner Steve Jackson. I'm past CTO and founder of Mercury Leads, and I'm past CTO of Well.org.In my marketing shoes I have increased a software product customer's sales from $500,000/year to $4,000,000/year, an 8-fold increase in sales. I increased an HVAC customer's sales by $400K in one month and I have helped countless customers establish, maintain and grow their online presence.Efficiency and delivery of top-quality services in all of these endeavors is absolutely critical to the success of my companies, and more importantly my customers. I am always on the hunt for great tools that will improve the fruits of my labors and save me time.In writing this eBook I have literally combed through my installed applications, paid services, daily routines and bookmarks (one of the tools) to make sure this list of productivity tools is complete. I have been thinking about doing it for years, not these tools are all here for you to incorporate into your own business and research efforts.I have no doubt that you will find multiple tools here that will make your life, or the lives of your customers better and more efficient.",
  "genres": [
    "Business",
    "Productivity",
    "Self Help"
  ],
  "author": "Michael Cordova",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/23266417-productivity-tools-for-business"
}