{
  "title": "His Naughty Little Mate",
  "description": "As an astrobiologist fresh out of graduate school, Carmen jumps at the chance for a journey to the red planet to search for signs of ancient alien life. What she didn’t bargain for is Command Pilot Erik Manning, a tough, no-nonsense military man whose authoritative presence always sets her on edge. But her issues with Erik quickly take a backseat when a disastrous explosion during a spacewalk leaves both of them floating amidst the debris with little hope for survival. After a white flash of unknown origin suddenly renders them unconscious, Carmen awakens in a strange room that seems to be a cross between a nursery and a medical facility. She quickly discovers that her alien rescuers don’t understand human biological development—in particular the fact that Carmen is a highly capable, adult woman—and she is thoroughly humiliated when her caretaker feeds her, puts her in diapers, and spanks her when she resists such treatment. Even worse, Erik believes that the more they cooperate with the aliens, the better their chances of returning to Earth one day, and he promises to punish Carmen himself the next time she misbehaves. But after she defies his warnings and ends up over his knee for a long, hard, bare-bottom spanking, her eventual surrender to his discipline alters the nature of their relationship forever. When he discovers Carmen’s yearning to be loved and nurtured by a firm daddy, Erik takes to the role whole-heartedly and delights in treating her as his little girl. The aliens, meanwhile, are intrigued to learn that humans still procreate naturally. In return for the opportunity to observe human mating habits in detail, Carmen and Erik are promised safe passage home. After a series of intimate, embarrassing medical examinations, Carmen finds herself both blushing with shame and trembling with desire as she submits to Erik’s passionate, dominant love-making in full view of an enthralled audience. But will the aliens uphold their end of the deal, or are Carmen and Erik destined to remain captives for the rest of their lives? Publisher’s Note: His Naughty Little Mate is an erotic romance novel that includes spankings, sexual scenes, age play, medical play, and more. If such material offends you, please don’t buy this book.",
  "genres": [
    "Science Fiction",
    "Romance",
    "BDSM",
    "Paranormal",
    "Erotica"
  ],
  "author": "Sue Lyndon",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/23266112-his-naughty-little-mate"
}