{
  "title": "On the Growl",
  "description": "From a pack of your favorite NYT and USAT best-selling paranormal romance authors comes a collection of ALL NEW novellas that will make you howl, scratch and bite... and leave you roaring for more!Love comes in all shapes and sizes. No surprise there, right? Passionate, wild, hungry, dripping, salty, sweaty, steamy; falling in love is the best thing in the world.It doesn’t matter if you’re a bunny with curves, a brand new werewolf without much clue what’s happening, a feisty wolverine shifter, a fun-loving house cat or a were-tigress with a short temper for obnoxious men, there’s a big, protective, incredible alpha for everyone... or in some cases, two of them!Except... sometimes, it gets complicated. Mysterious and magical resorts, dangerous rogue wolves, dentists that get just a little too excited and start growing hair in funny places, a couple of bears who might be terrorists, and a tiger with a bad attitude?Gulp. Things could get REAL complicated.In places where the only rules are Pack rules; in towns where shifters and witch doctors rub shoulders; on exotic vacations where only eagles dare, and on planes where a wolverine shifter is sandwiched between two of the sexiest bears she’s ever imagined, you’ll never have more fun, or get more steamy, seductive, incredible paranormal romance in ONE PLACE at ONE LOW PRICE.From our pack to yours, enjoy these incredible novellas, and keep howling for the moon!Waking Up Were by Celia KyleWhat’s a gal to do when a dog bite isn’t a dog bite and her boss makes her want to howl at the moon? Keep him.Bear Your Teeth by Lynn RedA slightly clutzy rabbit-shifter and a big, bad bear of a dentist will take you along on a steamy, hilarious ride you’ll never forget!Tiger by the Tail by Jessica SimsWere-tiger Adrian Merino is determined to see the newest shifter on the block, Mandy, become his mate. But it's got to be her idea first...Bears Repeating by Flora DareIt takes double the werebears to handle one cranky wolverine in this menage romance.To Screech His Own by Marina MaddixIt may be against the rules, but when a hot eagle shifter lands at an exclusive resort, one employee really wants to ruffle his feathers. What’s a curvy kitty to do?",
  "genres": [
    "Shapeshifters",
    "Paranormal Romance",
    "Romance",
    "Paranormal",
    "Anthologies",
    "Erotica"
  ],
  "author": "Celia Kyle",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/23266455-on-the-growl"
}