{
  "title": "Prime Imperative",
  "description": "The Prime race is facing extinction, but the research of Dr. Brianna Martin may hold the answer to their salvation. There’s just one problem, a group of Pure Blood fanatics will stop at nothing to see her dead! On the run from deadly peril, Bria meets her match in Iolyn Caradoc, a man determined to save her at all costs! Prime Imperative is a fast-paced, sexy, and thoroughly entertaining addition to Monette Michaels’ exciting series, The Prime Chronicles.  Adopted and raised by Terrans, Dr. Brianna Martin never quite fit in. She’s thrilled to learn she’s a long-lost female of the Prime race. And that she has a mate living somewhere on the planet Cejuru Prime—one genetically destined to be hers alone. Before she figures out how to approach him, she’s attacked in her research lab.  Iolyn Caradoc is stunned at the news that his mate, matched to him soon after birth, still lives. Even more amazing, she’s a research scientist on the verge of discovering why the Prime race is dying. But Pure Blood fanatics are trying to kill her and she’s on the run. Every primal instinct in him insists he find, claim, and protect his mate. But the woman won’t stay put.  When Bria finally meets Iolyn, she’s thrilled. He’s everything she could want—physically strong, highly intelligent, and … the other half of her soul. Yet, he’s also an overwhelmingly dominant and stubborn Prime warrior who wishes to protect her from everything—including her own Prime nature. As a Prime battle-mate, she has newfound instincts and skills—skills that will make her a true warrior. Skills she fully intends to learn and use.If she manages to survive.  Content Hot, Anal Play, Anal Intercourse, Light BDSM, Non-Sexual Violence",
  "genres": [
    "Science Fiction",
    "Romance",
    "Science Fiction Romance",
    "Paranormal",
    "Aliens",
    "Fantasy",
    "Paranormal Romance"
  ],
  "author": "Monette Michaels",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/23263875-prime-imperative"
}