{
  "title": "Yogo (#1).",
  "description": "Searching For Gold—Bumbling Onto SapphiresHe already had two noted gold discoveries, so what could the guy do for an encore? Stumble onto the greatest gemstone lode in world history—that’s what! Caught by a cloudburst on an open plateau, he squatted alongside his horse in the pelting rain until the sun at last emerged. While shrugging from soaked clothing and spreading them on nearby rocks to dry, the naked man caught the twinkle of blue glistening from the brown mud of a deluge-flattened marmot mound. When he held it, he chuckled at the way sunbeams reflected through the tiny stone’s hexagonal prisms. As his clothes dried, still in his altogether, the man wandered from marmot mound to marmot mound, picking up additional queer blue stones until he held a handful.That's how Jake Hoover lucked into the most fabulous sapphire deposit of all time.Eventually, Jake filled a cigar box with the queer blue stones, showing them to his grubstake partner, S.S. Hobson, a Lewistown banker. Hobson, as puzzled as Jake, forwarded the box of stones to a Helena assayer for analysis. The assayer, as mystified as Hobson and Hoover but suspecting rough gemstones, sent the box to Tiffany’s in New York for their appraisal. Tiffany’s returned a check for $3,500, along with a letter describing the blue stones as “… sapphires of unusually high quality.” Hoover filed a series of lode claims along the sapphire-bearing dike, then he and grubstake partner Hobson took in partners for operating capital. Others wanted a piece of the action; enough so that greed became laced with murder from the outside and in-fighting on the inside. Jake could cope with murderous killers, but the tough mountain man was in over his head when it came to crooked money men and their fleet of shyster lawyers.Perhaps there is a God, however, as the financiers who robbed Jake Hoover, proved outclassed when they butted heads with an English gem cartel who believed a flood of New World sapphires could suppress the value of their jewels worldwide.YOGO is a story of a good man in luck meeting bad men with money who, in turn, must struggle with worse men with more money.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Roland Cheek",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/23266367-yogo-1"
}