{
  "title": "Celestial",
  "description": "From the beginning of time, the mysteries of the night sky have captivated humanity. Our ancestors foretold the future through the phases of the moon, worshiped the countless stars, and feared the comets that streaked across the sky before disappearing back into darkness. Now, ten YA authors have come together to explore the impact the appearance of a comet can have on a life, a relationship… or an entire world.'Shadow' by Sarah Dalton. When Mary visits her Aunt Izzy's remote seaside bungalow, past and present collide. She soon realises a dark shadow hangs over her childhood memories, leaving her a task she would rather not complete... A haunting ghost story that explores the delicate relationships between women. Part of the 'Mary Hades' series. ‘The Sleeping Goddess’ by Zoe Cannon. On the eve of a once-in-a-thousand-years celestial event, the last surviving priestess must decide whether to obey her goddess and destroy an entire race… or follow her heart and let her own people die.‘Before the Pageant’ by Susan Fodor. In a dystopian city where appearances are everything, Ambrose Addams spends all her time striving to be number one. With classical beauty, the hottest boyfriend in Tealé, and the most sought after position in the city, Ambrose should be happy; things rarely go the way they should. One fortuitous exchange will not only change her priorities, but the whole course of her life. ‘Comet Cotillion (A Celestial Mini-Wave)’ by Sutton Shields. Marina Valentine spends her days in The Helena Hambourg House for Maladies, where each hour presents a new fight for survival. Life in an institution isn’t exactly ideal, but for Marina, nothing could be more dangerous than being caught in the middle of a vicious scheme cooked up by the evil Head Hoodooess, Madame Helena. Now, Marina and her quirky friends must find a way to escape before everything that makes them special is taken away forever. ‘Comet Cotillion’ is a short, fun-filled prequel to the events occurring in The Merworld Water Wars series by Sutton Shields. ‘The Shadow Keepers’ by Anya Allyn. At the terrifying moment that seven-year-old Molly discovers her mother dead, she sees a stranger standing in the a teenage girl. The girl holds a shocking secret. A new story from The Dark Carousel series.‘Tragic Magic’ by Jamie Campbell. A stalking ex-boyfriend is one thing. When he is a demon, it’s a whole new ballgame. Lacey would like to think she is an average teenager, except the witch is anything but. In order to get rid of her crazed ex, she must draw on all her powers to vanquish him forever.‘The Greenhouse Gas’ by Ariele Sieling. Galya wakes up to the flash of a falling comet, and discovers that her escape pod is floating in a graveyard of spaceships. Confused and scared, she and her brother set out to search the destroyed ships for signs of their father... or any life at all. This story retells Hansel and Gretel is set in outer space.‘Project #45’ by Marijon Braden. The Brightness wasn’t the end of the world, but it might as well have been. Now, Amy and her family are trying to rebuild their lives, trying to return to some kind of normalcy, all the time wondering…why did it happen? How? And when will it happen again? And a million years (Miles? Worlds?) away, the answer is so simple…‘Moon Warrior’ by H.S. Stone. Separated from her tribe after a sand dragon attack, Luna finds herself alone with no food or shelter. She must cross a desert wasteland to find her people again, but when she loses their trail, she discovers that her warrior instincts may not be enough to save her.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Short Stories",
    "Anthologies",
    "Dystopia"
  ],
  "author": "Jamie  Campbell",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/23271677-celestial"
}