{
  "title": "The Wren",
  "description": "Captured by Comanche as a child, Molly Hart was assumed dead. Ten years later, Texas Ranger Matt Ryan finds a woman with the same blue eyes.“A rousing, spicy story of long lost love in the gritty Old West. The Wren will make your pulse flutter and your heart sing.” —Ann Charles, USA Today Bestselling Author of the Award-winning Deadwood Mystery SeriesTen years have passed since Molly Hart’s ranch was attacked, her folks murdered, and she was abducted. Now, at nineteen, she’s finally returning home to North Texas after spending the remainder of her childhood with a tribe of Kwahadi Comanche. What she finds is a deserted home coated with dust and the passage of time, the chilling discovery of her own gravesite, and the presence of a man she thought never to see again.Matt Ryan is pushed by a restless wind to the broken-down remains of the Hart ranch. Recently recovered from an imprisonment that nearly ended his life, the drive for truth and fairness has all but abandoned him. For ten years he faithfully served the U.S. Army and the Texas Rangers, seeking justice for the brutal murder of a little girl, only to find closure and healing beyond his grasp. Returning to the place where it all began, he’s stunned to encounter a woman with the same blue eyes as the child he can’t put out of his mind.A sensuous historical western romance set in 1877 Texas.The Wren is an emotional story of love and loss in the Old West. It features a strong-willed heroine, a hero with deep wounds, medium spice, and a happily-ever-after.2003 CAPA WINNER The Romance Studio ~ Best New Author Traditional2004 Holt Medallion FINALIST ~ Best First Book2004 Texas Gold FINALIST ~ Historical Category“…McCaffrey’s mastery of setting and historic details gives this western gritty realism.” ~ RT Book Reviews“…a heart wrenchingly emotional story…” ~ Coffeetime Romance“Handsome, rugged heroes, strong heroines and a super storyline make The Wren a keeper.” ~ The Best Reviews\nEach novel can be read as a standalone, but don’t miss all the books in the series\nThe Wren: Book 1The Dove: Book 2The Sparrow: Book 3The Blackbird: Book 4The Shiny Penny: Short Story 4.1 (available to Kristy’s newsletter subscribers)Song Of The Wren: Novella 4.2 (available to Kristy’s newsletter subscribers)The Bluebird: Book 5The Songbird: Book 6 (Novella)Echo of the Plains: Book 7 (Short Story)The Starling: Book 8The Canary: Book 9The Nighthawk: Book 10The Swan: Book 11 (Coming Soon)",
  "genres": [
    "Romance",
    "Westerns",
    "Historical",
    "Historical Romance",
    "Historical Fiction",
    "Western Romance",
    "Fiction"
  ],
  "author": "Kristy McCaffrey",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/23268187-the-wren"
}