{
  "title": "The Merchant and the Menace",
  "description": "The Seraphim. Beings of power, created to guide the world in times of trouble. They live their lives of near immortality in servitude to a lesser creature, man. One rebelled. Amird, the Hand of the Creator, bridled at the sovereignty of his lord. In defiance he murdered a brother and was cast into the Mists of Chaos. Millennia passed as the Deceiver plotted his return. Backed by the might of a seemingly unstoppable army of Ulrog Stone Men and their fire-eyed Malveel Lords, Amird plans to wrest control of the world from the Creator and rain violence on the humans he once served. All that stands between Amird and his triumphant return are the remnants of battered human armies and the hope that Seraphim, loyal to the Creator, still roam this world. Kael knows little of this struggle. His quiet village lies deep in the Southlands, unchanged and unchallenged by the wars raging in the frozen North. In fact, the boy longs for a bit of adventure and freedom from the boring routine at his father’s inn. Freedom comes at a cost. Kael’s first journey outside his secluded village results in a tragedy so deep it destroys the boy’s sheltered world and immerses him in the struggle. Revelations surface. Kael uncovers a past linking him to legends, grapples with a present that resembles nothing he knows, and confronts a future that demands he tap long dormant power and stake a claim in the defense of the human races. Kael’s first step toward that future lies through the darkness of the Nagur Wood, and rumor has it something prowls the Nagur! This is the 4th edition of \"The Merchant and the Menace.\" Formatting has been updated to enhance the visuals on newer Kindle platforms and eliminate text glitches from earlier editions. REVIEWS FOR \"THE MERCHANT AND THE MENACE\" 5.0 out of 5 stars The Old and the New in the Next Great Fantasy Series If you like David Eddings and Terry Brooks, then this is the book for you. Like Eddings, McHugh loves to play around with old philosophical and religious ideas, dressing them up in new clothes for a night on the town in the 21st century. Like Brooks, McHugh is enchanted by the same tropes all fantasy lovers are enchanted elves, a young hero shepherded by a mysterious but wizard-like guide, and big battles with swords and magic. But McHugh is no Tolkien-lite. He has provided his readers with some fresh creations that fill the imagination with vivid pictures and scenes, reminding the reader why fantasy is such a beloved genre. Well worth the $3. Another great Fantasy series I've read them all... Robert Jordan, David Eddings, George R.R. Martin, Isaac Asimov, Terry Goodkind, etc, etc....and of course the master, Tolkien. I love a good long story with complex characters, a different world that becomes alive to me, good vs. evil, and everyday people who are confronted with a choice to make a difference. Dan McHugh is now added to my list of authors who can deliver! Can't wait for the next books! 5.0 out of 5 stars This author is a ringer, Books 1 through 3 of the Seraphinium series ended much too soon. The characters are interesting and consistent. The plot twists are legion. A writing style reminiscent of Chronicles of Narnia or Lord of the Rings. As a former editor I was elated to find the books seem to be professionally edited with hardly any sentences I would question or change. I've asked to be on Daniel McHugh's mailing list so I can keep reading. 5.0 out of 5 stars Fast and Fun, The characters are vivid and the world they live in feels real.",
  "genres": [
    "Fantasy",
    "High Fantasy",
    "Science Fiction Fantasy",
    "Fiction",
    "Fae"
  ],
  "author": "Daniel McHugh",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/11399934-the-merchant-and-the-menace"
}