{
  "title": "The Couple",
  "description": "The accident had happened in a crazy way. Maybe, all accidents happen that way. They don't need to happen; it just seems like everything is there, then somebody does something stupid. All the parts fall into place. The accident occurs, and the unfortunate, stupid bastard ends up in the hospital.John Wright lay in the hospital bed, a body cast constricting his torso from hips to chest, and tried to fit all the parts together leading up to his accident. He was not quite sure how it all had happened.In his position as Assistant Production Manager, he had given the order to pull that malfunctioning high-speed router off the line, to be replaced by a newer model slated to arrive the following morning. He hadn't needed to be down there on the floor just then, but he wanted to see the job done properly. He knew the section foreman, Steve Matulich, could handle the job . . . so why in hell was he there? Management personnel weren't supposed to be involved in such activities, but the last time something had gone wrong, Royce had practically held him personally responsible. He told himself it was because he had wanted to do a good job; however, that gnawing fear of being called into Royce's office, the little man sitting there, behind his oversized desk, a picture of glacial ice, coolly enumerating production-loss figures and assessing the reason for them; all of which seemed to indicate some non-performanceon John's part, had drawn him like a magnet to the vast production floor to oversee, personally, the removal of the machine. It was stupid!He saw himself, now, for the damned fool he was, but it was too late. It was part of Royce's game, one in which the Production Manager held up numbered hoops for his assistants to jump through, pushing them to the ultimate to find out the limits of their humiliation. Perhaps, he reflected, it was to find out whether they wanted to become a part of his trained seal act, or resign and move on to another plant.",
  "genres": [],
  "author": "Zoe Jasmine",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/23270774-the-couple"
}