{
  "title": "Seeing the Dead",
  "description": "From New York Times bestselling author Sheila Connolly!  Ever since her first ghostly sighting, Abby Kimball has been trying to unravel the mystery of her newly discovered ability. So when she sees the apparition of a Revolutionary War soldier in the middle of the town green—just days before the annual Patriot’s Day celebration, no less—she’s determined to figure out her connection to the man.  The ethereal soldier is not the only mystery in Abby’s life. She’s also trying to sort out her connection to Ned Newhall, the man who shares her ability and is playing a more serious romantic role in her life every day. But with plans for the celebration ramping up and her job becoming more chaotic by the minute, Abby’s finding it hard to catch her breath, much less come to grips with all the new turns her life has taken.  And when another eerie episode is followed by the appearance of a very curious young girl who seems wise beyond her years, Abby discovers she and Ned may have only scratched the surface of their special ability, and that Ned may hold the biggest surprise yet.  About the  Sheila Connolly is an Anthony and Agatha Award–nominated author who writes three bestselling cozy mystery the Museum Mysteries, the Orchard Mysteries, and the County Cork Mysteries, including Buried in a Bog and Scandal in Skibbereen, both New York Times bestsellers. In addition, she has published Once She Knew, a romantic suspense; Reunion with Death, a traditional mystery set in Tuscany; and Relatively Dead, a paranormal romance and a New York Times bestseller, as well as a number of short stories. She lives in Massachusetts with her husband and three cats and travels to Ireland as often as possible.",
  "genres": [
    "Mystery",
    "Paranormal",
    "Cozy Mystery",
    "Cozy",
    "Fiction",
    "Audiobook",
    "Ghosts"
  ],
  "author": "Sheila Connolly",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/23268087-seeing-the-dead"
}