{
  "title": "Bake, Love, Write: 105 Authors Share Dessert Recipes and Advice on Love and Writing",
  "description": "What do most authors have in common, no matter what genre they write? They love desserts. Sweets sustain them through pending deadlines and take the sting out of crushing rejection letters and nasty reviews. They also often celebrate their successes—selling a book, winning a writing award, making a bestseller list, or receiving a fabulous review—with decadent indulgences. And when authors chat with each other, they often talk about their writing and their lives. Recipes. Writing. Relationships. In this cookbook 105 authors not only share their favorite recipes for fabulous cakes, pies, cookies, candy, and more, they also share the best advice they’ve ever received on love and writing.Authors include: Brenda Novak, Lois Winston, Debra Holland, Dale Mayer, Shelley Noble, Caridad Pineiro, Diana Orgain, Lisa Verge Higgins, Lynn Cahoon, Jasmine Haynes, Jan Carol, Meg Bellamy, Bobbi Chukran, Melissa Keir, Amy Gamet, Kristy Tate, Terry Shames, Barbara Phinney, Kitsy Clare, Raine English, Cathryn Cade, Haley Whitehall, Shilpa Mudiganti, Melinda Curtis, Jessa Slade, Jill Blake, Daryl Devore, Molly MacRae, Elizabeth Rose, Helena Fairfax, Lourdes Venard, Jessica Aspen, Maegan Beaumont, Kay Kendall, Elizabeth John, Victoria Adams, Cyndi Pauwels, Alice Loweecey, June Shaw, Donnell Ann Bell, T. Michelle Nelson, Nina Milton, Pam DeVoe, Skye Taylor, Conda V. Douglas, Pepper Phillips, Judy Alter, Cadence Denton, Lesley Diehl, Erin Farwell, Regan Walker, Kaye Spencer, Barbara Monajem, Kathleen Kaska, Catherine Kean, Rose Anderson, Suzie Tullett, Deborah Hughes, Cynthia Luhrs, Judy Baker, Alicia Dean, Leslie Langtry, Janis Susan May, Mitzi Flyte, Ruby Merritt, Renee D. Field, Kathryn Quick, Susan Cory, Judy Penz Sheluk, Kay Manis, Kathryn Jane, Debra Goldstein, E. Ayers, Chantilly White, Sloan McBride, Triss Stein, Ana Morgan, Adele Downs, L.C. Giroux, Pamela Aares, Nancy Warren, Barbara Lohr, J.J. Cook, Lynn Reynolds, Cori Arnold, B.V. Lawson, Lynn Franklin, M.L. Guida, Irene Peterson, Sue Viders, Liese Sherwood-Fabre, Susan Santangelo, Sheila Seabrook, Elaine Charton, Sharleen Scott, Kathy Bennett, Jody Payne, Reggi Allder, Ashlyn Chase, Beverley Bateman, Susan Lohrer, Donis Casey, Barbara Leavy, Stacy Juba, Karen Rose Smith.",
  "genres": [],
  "author": "Lois Winston",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/23267757-bake-love-write"
}