{
  "title": "Αναζητώντας την Αλάσκα",
  "description": "Ο Μάιλς Χάλτερ γοητεύεται από τα τελευταία λόγια φημισμένων ανθρώπων... κι έχει κουραστεί από την ασφαλή ζωή στο σπίτι του. Φεύγει οικότροφος για το Κάλβερ Κρικ προκειμένου να αναζητήσει αυτό που ο ετοιμοθάνατος ποιητής Φρανσουά Ραμπελέ ονόμασε το Μεγάλο Ίσως. Πολλά περιμένουν τον Μάιλς εκεί, ανάμεσα στα οποία και η Αλάσκα Γιανγκ. Ευφυής, αστεία, μπερδεμένη και θανατηφόρα σέξι, η Αλάσκα θα παρασύρει τον Μάιλς στο λαβύρινθό της και θα τον εκσφενδονίσει προς το Μεγάλο Ίσως.Το Αναζητώντας την Αλάσκα καταγράφει με μοναδικό τρόπο την ανεξίτηλη επίδραση που μπορεί να ασκήσει μια ζωή πάνω σε μια άλλη. Έχοντας τιμηθεί με σειρά λογοτεχνικών βραβείων, αυτό το εκπληκτικό βιβλίο σηματοδότησε την άφιξη του Τζον Γκριν ως μιας ρηξικέλευθης νέας φωνής στο χώρο της σύγχρονης λογοτεχνίας.Ήξερα να αναγνωρίζω με τη μία τα τελευταία λόγια που είχαν ιδιαίτερη βαρύτητα, οπότε έβαλα με το νου μου να εξασφαλίσω μια βιογραφία αυτού του τύπου, του Σιμόν Μπολίβαρ. Ήταν πολύ όμορφα τελευταία λόγια, αλλά δεν τα καταλάβαινα ακριβώς.«Σε ποιο λαβύρινθο αναφέρεται;» θέλησα να μάθω.Νομίζω πως τώρα είναι η κατάλληλη στιγμή να πω ότι η Αλάσκα ήταν πανέμορφη. Έτσι όπως καθόταν στο σκοτάδι δίπλα μου, μύριζε ιδρώτα και ήλιο και βανίλια, ενώ εκείνη τη νύχτα με το αδύναμο φεγγάρι μονάχα τη σιλουέτα της μπορούσα να ξεχωρίσω… Ακόμη και στο σκοτάδι όμως, μπορούσα να διακρίνω τα μάτια της – φωτεινά σμαράγδια. Είχε τέτοια μάτια, που σε προδιέθεταν να την υποστηρίξεις σε κάθε της προσπάθεια. Και δεν ήταν απλώς πανέμορφη, αλλά κουκλάρα...Εκείνη ακριβώς τη στιγμή, το διάστημα που μεσολάβησε από τη στιγμή που τη ρώτησα για το λαβύρινθο μέχρι που μου απάντησε, συνειδητοποίησα την αξία που έχουν οι καμπύλες... Είχα παρατηρήσει καμπύλες κι άλλοτε φυσικά, όμως ποτέ ως τότε δεν είχα συλλάβει επακριβώς τη σημασία τους.",
  "genres": [
    "Young Adult",
    "Fiction",
    "Contemporary",
    "Romance",
    "Realistic Fiction",
    "Coming Of Age",
    "Teen"
  ],
  "author": "John Green",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/23275659"
}