{
  "title": "Mark of the Crow",
  "description": "Cliff-hangerTashi takes on the climbing of a challenging rock face, and runs the risk of placing himself in a dangerous position, learning that it’s perhaps best to think before you leap.Mark of the CrowAt 14 Shanti Prakash is suddenly orphaned when her family, part of her village’s reigning hierarchy, is brutally killed in a landslide before her eyes as she returns home from school. She is then sent far away from her village by ambitious relatives fearing that she might be in their way towards gaining power and influence over the villagers. Shanti must then live with an uncle she has never met and who is considered even more of a black sheep than she is. Six years later her village appears to be cursed with an influx of crows, due to the selfish and cruel acts of her relatives, and Shanti, being the last direct descendant of the village founder, may be the only one who can remove the village curse. That is if she can be persuaded by her childhood friend Kumar to come out of her enforced exile. Sorry, Sorry, Sorry Aditya returning home from working overseas in the Middle East has been looking forward for the last two and a half years to be reunited with his beautiful girlfriend Kumari. Yet imagine his surprise when not only is she not waiting for him at the airport as he expects, but she isn’t at her apartment nor will his key unlock the door. Worst of all when he tries to reach her she seems to be ignoring him. Shifting SandsFive men lost in the desert after their plane crashes, one of them is possibly a spy but which one? Who is the phantom Bedouin, is he friend or foe, is he real or just mirage? Will the reach the oasis which is their salvation or will they parish?Leap of FaithHere is a light-hearted discussion between two monks about Buddhism, the meaning of death, existence in general and John Lennon songs.",
  "genres": [],
  "author": "Andrew James Pritchard",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/23275239-mark-of-the-crow"
}