{
  "title": "Far Reach",
  "description": "“I know this place!” I told him. “It's … um ...” “Giza, dumb-dumb. The Giza Plateau. Earth. Way back a long time ago.” “Who's flying the ships?” I asked. “Pilots. Who usually flies them?” “In school they said the pyramids were built by human hands.” “They were,” he answered. “Human hands flying these ships.” On the distant outpost world of Aquaria, Marcus Roderick is about to have his life in the sprawling, canal-based city of New Venice uprooted. The construction company employing his father is transferring him to head up a new project: construction of a new city core half a continent away. The youngest of three children, Marcus is looking forward to the only positive aspect of the move: his family will make the trip to their new home via a luxury cruise liner. However a simple mishap sends Marcus falling overboard, where he is rescued and 'repaired' by a reclusive alien race called the Aravel. For reasons unknown, the Aravel fill Marcus' mind with seemingly endless spacefaring data, from detailed star charts all the way down to the precise locations of standard shipping lanes for all alien races. When the Central Government inadvertently discovers what Marcus is carrying in his head, his family becomes hunted, along with his friend Cayce and his parents. When Marcus' father - who is secretly working for a covert group planning to seed a new, breakaway civilization to escape their own Central Government - discovers what has been implanted in his son, he desperately arranges for an immediate emergency pickup off their cruise liner. As if matters were not bad enough, the small space yacht that retrieves them is carrying newly developed cloaking technology which the Central Government was thus far unaware of. During their escape, their possession of that technology becomes known, making their capture even more imperative for the government pursuers. Far Reach is the fast-paced story of the flight of eight individuals from those hunting them. Armed with the information Marcus is carrying, their cloaking technology, and a mysterious 'viewer' capable of displaying any location in the universe, in the present or any time in the past, they are able to stay one step ahead of their pursuers until Marcus is finally forced to take a stand in the story's climax.. Far Reach is filled with surprise twists and turns. It underscores the potential of the individual in the most adverse of conditions, and will serve as an inspiring story that is targeted at teens but can be enjoyed by anybody.",
  "genres": [],
  "author": "Chris Malcheski",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/23274680-far-reach"
}