{
  "title": "The Accused",
  "description": "\"The Accused draws the reader into a roiling world torn between lethal paranoia and sexual combustion, dread and incapacitating pleasure, as tender flesh is ruthlessly tested for evidence of witchcraft.\" – best-selling author Pam McKenna“This story is perfect to curl up with on a spooky autumn night, with a cup of hot cider, and get lost in a decadent place where your wicked fantasies and fears come true.\" – erotic romance author Debra Druzy\"Explosively erotic with unexpected twists and surprises that keep the pages turning.” – 2013 RITA Finalist, Pamela HearonFrom the THE ACCUSED, Book 2 in the Immoral Virtue Trilogy continues the highly erotic, non-romantic, tale of resistance and of submission. Due to its explicit sexual nature, with elements of BDSM and dubious consent, THE ACCUSED is intended for audiences 18 and over.The AccusedThere is no shame in pleasure.“Wherefore for the sake of fulfilling their lusts (women) consort even with devils.” -Heinrich Kramer, 1486 “Malleus Maleficarum” (The Hammer of Witches)To clear their names and save their souls the accused are stripped and bound before all as they await their governor’s examination.At the governor’s direction, Abigail Prescott, herself accused as a witch a mere hour past, will help test the women’s responses, for a witch marked by the devil cannot feel, no matter how gently caressed, no matter how deeply probed. Under the governor’s scrutiny Abigail is to thoroughly examine their naked flesh for the black mark of the beast.But the prideful Elizabeth Hobbs withdraws consent. And her fate is sealed. Taken deep into the forest by the watchman, she will remain naked and open to the elements to await her punishment.Stirred by her proud tears, the watchman touches her. Soothes her. But when a man succumbs to a witch’s charms, he too stands among THE ACCUSED",
  "genres": [
    "Erotica",
    "BDSM",
    "Historical",
    "M F Romance",
    "Dark"
  ],
  "author": "Arla Dahl",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/23275051-the-accused"
}