{
  "title": "SOUTH BEACH SIZZLES Collection: Contempory Romance in Miami's Sexy South Beach",
  "description": "Top 100 Amazon Bestseller Top 30 Romance Bestseller Savor the sizzle of four sexy stories set in Miami's glamorous South Beach Each of these novels shares the different flavors of life along the glittering streets of one of America's hottest and sexiest places NOW AND ALWAYS Connie Gonzalez is a driven, ambitious woman who is one of the FBI’s best agents and determined to prove herself in a man’s world. Assigned to the Miami Bureau, Connie soon finds herself going undercover in Miami's glamorous South Beach area. An injury throws her together with the very rich and tempting Dr. Victor Cienfuegos. Victor is everything Connie should avoid, but despite the risks of her work and allowing any distractions, Connie cannot deny the attraction between herself and the sexy physician. Will danger keep them apart or is their love strong enough to survive for now and always? FAITH IN YOU Paul Stone accepts Connie Gonzalez’s invitation to join her for a traditional and fun-filled Cuban Christmas Eve dinner. Paul is instantly captivated by her intriguing kid sister. Carmen Gonzalez is leery of the self-assured FBI agent whose upscale upbringing provided him with all he ever needed. . .except love. After a fast-paced courtship, Paul and Carmen are ready to walk down the aisle, blissfully unaware that fate – and their own secret fears – will test their fragile commitment long before they make it to the altar . . . . TORI GOT LUCKY Finding Mr. Right wasn’t what she had in mind . . . When Tori got lucky, she never imagined that her one night fling would turn into something more. But her birthday surprise turns out to be \"the one\" and before long, she and Gil are talking about making it something a little more permanent. There’s just one problem. Okay, maybe more than one. Like Tori’s three best friends who fear that once Tori gets married, she’ll disappear as so many of their friends have over the years. And her mother and father who are making all kinds of noises about Tori and Gil’s plans for a quick and simple wedding. Not to mention Tori’s perfect sister with her new little baby. . . With pressure building from all sides, Tori and Gil do the only possible Elope. But can their new marriage survive the demands of friends, family, and their own insecurities? Only time will tell whether Tori truly got lucky. USA TODAY BESTSELLER from the Dangerous Dozed Boxed Set TO CATCH HER MAN Truth tries the bond between a reporter and the detective who nearly died for her. Handsome cop Carlos Ramirez nearly lost his life protecting reporter Sylvia Amenabar after her investigative report went south. Carlos knows Sylvia is a tough nut with lots of relationship issues, but he’s never been one to give up without a fight. Even if Sylvia has a lot of luggage she’s carrying into their new relationship. Sylvia has never had time for a real relationship. She’s too busy trying to make a name as one of Miami’s top journalists. Besides, she’s seen what can happen when you make bad choices. Her mother had made that kind of mistake with Sylvia’s playboy father. But when her mother warns her that some men can start an itch that no amount of scratching can stop, Sylvia worries that Carlos might just be that itch.",
  "genres": [],
  "author": "Charity Pineiro",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/23275195-south-beach-sizzles-collection"
}