{
  "title": "Bad Karma",
  "description": "Rated “R” for language and violence. Mature audiences only.Flynn, is a disgraced former cop, an unlicensed PI and underground street lawyer Flynn’s got a problem. He pulls in a routine blackmail case, and sees a signature blackmail scam and goes to Lamar, a local scammer, to get it straightened out. Lamar has other plans and if he wants Lamar’s help, then Flynn needs to help Lamar with a problem of his own. Speaking of personal problems, Flynn has demons of his own, including being haunted by the ghost of James Cobalt, who Flynn had a part in his murder. Lamar is a clever hustler who has problems of his own.Lamar’s got a problem too. He’s being pressed out of business by the local Vietnamese mafia. Lamar wants Flynn to surveil and set up a sting so Lamar can neutralize his chief rival, an insane Vietnamese enforcer, named Johnny Tran. In return, Lamar won’t go ahead with the blackmail plot against Flynn’s client. Johnny Tran is psychotic, runs prostitution and drugs through his Vietnamese nail salons and restaurants. Johnny Tran is a psychotic enforcer for the Vietnamese mafia.Johnny Tran has so many psychological problems they can’t be counted with a calculator. Flynn is survelling a nail salon when a beautiful woman walks out and flags down Flynn’s yellow taxi surveillance car. Flynn picks her up and learns she works for Max Cobalt, James Cobalt’s son. The son of the man Flynn helped assassinate. Flynn gets drawn into a conflict that, once again, is spinning out of control. Max Cobalt has enough enemies and doesn’t need any more. Enter Max Cobalt, Ning, and Wee. Max is a corporate raider, Ning is his chief negotiator and VP, Wee is his slightly insane bodyguard. The three are drawn into Flynn’s plan when all hell breaks loose with Lamar trying to take out Johnny Tran during a backroom poker game that goes horribly wrong.Battle lines are now drawn between Flynn, and Johnny Tran and neither side can afford to lose. Street smart good guys, psychotic bad guys, human sex trafficking, prostitution, martial artists, corporate raiders, and a Asian beautiful business negotiator.Come together when Flynn uncovers Johnny Tran’s operation of recruiting young girls from Vietnam, and using the nails salons as a front for his prostitution business. This starts an epic cat and mouse battle between Flynn and Johnny Tran that will leave the reader gasping for air.Readers of John Rebell know that no one else blends fact and fiction, nonstop action, plot twists and turns, and surprising climaxes the way he does.Get ready for another nonstop thrill ride into urban hell.",
  "genres": [],
  "author": "John Rebell",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/23272344-bad-karma"
}