{
  "title": "Beast: Great Bloodlines Converge",
  "description": "The blood lines of seven great houses come together in the greatest knight of them all.He bears the name of de Russe, but the bloodlines of seven great houses converge in the greatest knight England has yet seen.As the uncle of Gaston de Russe, the Dark One, Sir Bastien de Russe beholds a great and terrible legacy, one that makes him both the target and the leader, the hunter and the hunted. His story is the most powerful of all. 1431 A.D. - As the premier knight for the Duke of Bedford, Bastian has been assigned a great and terrible task - he becomes the jailer for the Maid of Orleans, Joan of Arc. At first her enemy, he comes to know the woman who has fought so hard to free France from English rule, and an odd but symbiotic friendship grows. On the day Joan is taken to meet her death at the stake, Bastian is both her escort and her comfort. But before the flames are lit, Joan begs Bastian for one last favor. Reluctantly, he complies, but the rumors are already flying fast and furious about the English knight and the Maid. Some say he loves her; some say she has bewitched him.Hoping to remove Bastian from France and from whatever spell the Maid may have cast upon him, the Duke of Bedford makes arrangements to return him to England and to a new assignment - as the protector of young King Henry VI. Additionally, Bastian is awarded a bride for his services in France, but it an award he doesn't want. His bride, Lady Gisella le Bec, daughter of the great Richmond le Bec (from the novel GREAT PROTECTOR), has no desire to marry a man who was rumored bewitched by the Maid of Orleans.With neither Bastian or Gisella having any choice in the matter, a hasty marriage is made.Thus begins their saga. Through triumph, intrigue, battles, and grief, Bastian and Gisella come to know one another and in spite of everything, a powerful love begins to bloom. But Bastian still has a promise to fulfill, a promise he made to the Maid just before she died, and it is this promise that drives him to risk both his life and Gisella's. From the dungeons of Rouen to the royal halls of London, don't miss this deeply romantic and exciting adventure. Great passion and great benevolence abide in the man known as the Beast.Read for FREE in Kindle Unlimited!!",
  "genres": [
    "Medieval",
    "Historical Romance",
    "Historical",
    "Medieval Romance",
    "Romance",
    "Audiobook",
    "Amazon"
  ],
  "author": "Kathryn Le Veque",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/23276187-beast"
}