{
  "title": "Burned by Abi",
  "description": "For Mature Adult Audiences. Contains language and actions some may deem offensive. Contains extreme violence. Ménage – MFM.In book two of the Devil Savages Abi Moon was raised by her brother, Sledge, after their parents passed away. Sledge did his best with the help from the only family he had left—the Devil Savages. He shipped her off to boarding schools and college, in the hope of keeping her from the hard MC life. What he didn't expect was while at college, she'd worked hard—just not on her studies. She found a new major in mixed martial arts and devoted her time in the octagon instead of the classroom. With a fierce attitude and the talent to back it up, she heads home to the one place her brother had worked so hard to keep her from. Upon her arrival, Sledge quickly learns even good intentions can turn bad when she makes even the toughest and roughest of bikers feel like emotional teenage girls.Yo Neg’s been nursing his pride since the night a woman used him for a one-night stand and walked away without looking back. But imagine his surprise when that same evil vixen waltzes back into his life—and still wants nothing to do with him.Tonka lives and breathes the MC life and never considered locking himself down with an ol’ lady. He enjoys the love ‘em and leave ‘em relationships the rats and bitches are more than happy to provide. His beliefs start to change after one taste of the most forbidden and untamable Abi. The problem—he's best friends with her brother.With the Diablos in their territory and lives hanging in the balance, the Devils fight to protect their own. Can Yo Neg and Tonka keep the club protected and manage to beat Abi at her own game? Or does Abi prove to them that you can take the girl out of the club, but the woman who returns, forever has the blood of the Devils running through her veins.",
  "genres": [
    "Menage",
    "M F M",
    "Contemporary",
    "Erotica"
  ],
  "author": "Harley McRide",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/23273230-burned-by-abi"
}