{
  "title": "Queen of Clubs",
  "description": "He's the only one who's given her a real second chance  When she first accepted the job to help Jack Carter and the Desert Sons MC steal several multi-million dollar cars, it seemed like Tina Harris finally found the escape route that she's been looking for her entire life.   She wasn't supposed to be anything more than a means to an end  When he first recruited Tina Harris, Jack Carter thought that it would be a one-time business relationship with the feisty little vixen... until Tina suddenly finds a way into his heart that leaves him unable to just let her go.   An unexpected turn for the worse will force them to be brutally honest.  When the buyer backs out at the last second and the cops come knocking on the front door, both Tina and Jack's future are now in jeopardy. Will Jack risk it all to keep Tina safe from the clutches of the law, or will she be left to fend for herself like she's always done her entire life?  EXCERPT  “I don’t want you to do go back inside.”  “And I don’t want to go back inside. But I’ll be fucked before I let you throw your life away like that. It’s not happening, Jack! So forget about it!”  He stared at her a moment. “What if we get caught?”  “What if we don’t? We’ve done okay so far,” she said more calmly.  “But things can change.”  “Yes they can. And when they do, we can talk about this again. But for now there is something else I would much rather be doing than talking about to you about you turning yourself in.”  “What’s that?” Jack asked with a smile.  “Well… let’s see. We’ve eaten the pizza, drank the beer, talked to Marshall and watched television. But as I recall, there was one more thing you had planned to do tonight.”  He chuckled as his mood began to brighten. “Yeah. Seems like I remember something, but I can’t recall what it was.”  “Should I remind you?”  “That might help.”  Tina kissed him gently on the lips as she waited for him to respond. Slowly, the kiss became deeper before she slowly pulled back. “Does that ring any bells?”  “It’s coming back to me.”  “How about this, then?” she said as she captured his lips with hers again, then began to kiss down his jaw and under his chin as she worked her way slowly down his body and covered him in fleeting kisses.  Each touch of her lips was a fair of pleasure and he breathed deep. As she approached his manhood, he stopped her by pulling her gently away. “No. Not tonight.”",
  "genres": [],
  "author": "Kathryn Thomas",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/23275040-queen-of-clubs"
}