{
  "title": "Basis Of Singaporean Spirit - People Power: A Wake-Up Call for Leaders around the World",
  "description": "[This book is printed in full colour]You have heard and read books about Mr Lee Kuan Yew (LKY), the 'founding father of Singapore', and impressed with what he did for Singapore. But do you know that without supportive people, there is no way for him to achieve what he did today? Picture this: During the earlier years, if we were to airdrop LKY to China for him to do what he did for Singapore, what do you think would happen? Well, more likely than not, he would be wiped out by the Cultural Revolution. Or let's airdrop him to America instead. Would he be who he is today? Unlikely, given his character, and in the democratic environment of America, he would be labelled as radical or even extremist and there would be riots every day. Chinese Art of War believes in the 3-Powers for success: Right Time, Right Place and the Right People. Only when these 3 Powers are in harmony, would one be able to make huge achievements. LKY was a great leader who knew these and used these to his advantages. You had read how great the timing was for Singapore's independence to coincide with China's Cultural Revolution; you had also read how strategic the location of Singapore is. Now, it is time to look at the 3rd Power - the Right People. There are many countries full of admiration of LKY and the achievements made by Singapore and hoped to replicate this over to their countries, but they will find it impossible to replicate the recipe because they are lacking in one of the most important ingredients: The People. This book investigates this \"People Power\" and guides you through the understanding of the Basis Of Singaporean Spirit (BOSS) - Written by the People, for the People. No matter whether you are a leader, commoner, celebrity, philanthropist, rich or poor, there is always something useful for you. In this book, Basis Of Singaporean Spirit - People Power, the author combined his professional business consulting knowledge, with the vast knowledge of Chinese Wisdom to highlight the criticality of the \"People Power\" and the need for leaders to focus on the basis first - for when the basis is wrong, nothing will be right. This is not the ordinary leadership book that 'reverse engineered' the success of somebody, and presents it as 'the model that he took'. This is a book on the basis of it all. You can pay top dollars to employ the so-called 'best and most qualified' people, you can leverage the best methodologies, you can perform the most complex analysis and modelling, but when the basis is wrong, nothing will be right. Getting the \"basis\" right is of utmost importance in anything. This book is based upon the issues and unhappiness in today's Singapore and extended to the global stage to highlight the basis of the problems. In the book, the author uses different case studies and business analysis to lead the readers down to the basis of it all. The author also presented a comparison of Logical Analysis vs Statistical Analysis to demystify the credibility of Statistical Analysis. If you want to understand the games that politicians around the World are playing and how you can counter that, you need to read this book. Throughout the book, the author highlighted key concepts, which he called \"BOSS Wisdom\" to share with the readers. These \"BOSS Wisdom\" are summary concepts that the author hoped readers can ponder over. The chapter \"Why Do You Want to Go to Heaven?\" was initially written for Singapore. However, during the writing of this book, there were conflicts in the Gaza area. Thus, the author would also like to dedicate this chapter to the People of Israel & Palestine. This chapter will not resolve the conflicts, but the author hoped that the People can remind themselves about the \"3-Powers training ground\" the next time before they fight.",
  "genres": [],
  "author": "B.O.S.S.",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/23274076-basis-of-singaporean-spirit---people-power"
}