{
  "title": "China Dolls",
  "description": "NEW YORK TIMES BESTSELLER • Look for special features inside. Join the Random House Reader’s Circle for author chats and more.The author of Snow Flower and the Secret Fan, Peony in Love, and Shanghai Girls has garnered international acclaim for her great skill at rendering the intricate relationships of women and the complex meeting of history and fate. Now comes Lisa See’s highly anticipated new novel, China Dolls.   It’s 1938 in San Francisco: a world’s fair is preparing to open on Treasure Island, a war is brewing overseas, and the city is alive with possibilities. Grace, Helen, and Ruby, three young women from very different backgrounds, meet by chance at the exclusive and glamorous Forbidden City nightclub. Grace Lee, an American-born Chinese girl, has fled the Midwest with nothing but heartache, talent, and a pair of dancing shoes. Helen Fong lives with her extended family in Chinatown, where her traditional parents insist that she guard her reputation like a piece of jade. The stunning Ruby Tom challenges the boundaries of convention at every turn with her defiant attitude and no-holds-barred ambition.   The girls become fast friends, relying on one another through unexpected challenges and shifting fortunes. When their dark secrets are exposed and the invisible thread of fate binds them even tighter, they find the strength and resilience to reach for their dreams. But after the Japanese attack Pearl Harbor, paranoia and suspicion threaten to destroy their lives, and a shocking act of betrayal changes everything.Praise for China Dolls “Superb . . . This emotional, informative and brilliant page-turner resonates with resilience and humanity.”—The Washington Post\n \n“This is one of those stories I’ve always wanted to tell, but Lisa See beat me to it, and she did it better than I ever could. Bravo! Here’s a roaring standing ovation for this heartwarming journey into the glittering golden age of Chinese nightclubs.”—Jamie Ford, author of Hotel on the Corner of Bitter and Sweet  “A fascinating portrait of life as a Chinese-American woman in the 1930s and ’40s.”\n—The New York Times Book Review\n   “A sweeping, turbulent tale of passion, friendship, good fortune, bad fortune, perfidy and the hope of reconciliation.”\n—Los Angeles Times\n  “Lisa See masterfully creates unforgettable characters that linger in your memory long after you close the pages.”\n—Bookreporter\n  “Stellar . . . The depth of See’s characters and her winning prose makes this book a wonderful journey through love and loss.”—Publishers Weekly (starred review)  “China Dolls plunges us into a fascinating history and offers an accessible meditation on themes that are still urgent in our contemporary world. The women’s story explores burning questions about the possibilities of friendship, the profound effects of betrayal, the horrors of prejudice and the nature of ambition—especially female ambition. . . . These Asian artists were true pioneers, breaking ground, chasing vast dreams, subverting stereotypes simply by appearing onstage against the odds. Here, in China Dolls, they have found another stage of sorts, another place to rightfully shine.”—San Francisco Chronicle  “China Dolls is [Lisa See’s] most penetrating since Snow Flower and the Secret Fan.”—The Seattle Times",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Book Club",
    "China",
    "Audiobook",
    "Asia"
  ],
  "author": "Lisa See",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/23278596-china-dolls"
}