{
  "title": "Seeing Home: The Ed Lucas Story: A Blind Broadcaster's Story of Overcoming Life's Greatest Obstacles",
  "description": "Soon to be a major motion picture, Seeing The Ed Lucas Story is the incredible true tale of a beloved Emmy-winning blind broadcaster who refused to let his disability prevent him from overcoming many challenging obstacles and achieving his dreams.In 1951, when he was only twelve years old, Ed Lucas was hit between the eyes by a baseball during a sandlot game in Jersey City. He lost his sight forever. To cheer him up, his mother wrote letters to baseball superstars of the day, explaining her son’s condition. Soon Ed was invited into their clubhouses and dugouts, as the players and coaches personally made him feel at home.Despite the warm reception he got from his heroes, Ed was told repeatedly by others that he would never be able to accomplish anything worthwhile because of his limitations. But Hall-of-Famer Phil Rizzuto became Ed’s mentor and encouraged him to pursue his passion—broadcasting. Ed then overcame hundreds of barriers, big and small, to become a pioneer—the first blind person covering baseball on a regular basis, a career he has successfully continued for six decades.Ed may have lost his sight, but he never lost his faith, which got him through many pitfalls and dark days. When Ed’s two sons were very young, his wife walked out and left him to raise them all by himself, which he did. Six years later, Ed’s ex-wife returned and sued him for full custody, saying that a blind man shouldn’t have her kids. The judge agreed, tearing Ed's sons away from their father's loving home. Ed fought the heartbreaking decision with appeals all the way up to the highest level of the court system. Eventually, he prevailed, marking the very first time in US history that a disabled person was awarded custody over a non-disabled spouse.Even in his later years, Ed is still enjoying a remarkably blessed life. In 2006, he married his second wife, Allison, at home plate in old Yankee Stadium, the only time that such a thing ever happened on that iconic spot. Yankee owner George Steinbrenner himself catered the whole affair, which was shown live on national television.Seeing The Ed Lucas Story is truly a magical read and a universally uplifting and inspirational tale for everyone, whether or not you happen to be a sports fan. Over his long and amazing life, Ed has collected hundreds of anecdotes from his personal relationships and encounters with everyone, from kings and presidents to movie stars and sports Hall-of-Famers, many of which he shares in this memoir, using his trademark humorous and engaging style, cowritten with his youngest son, Christopher.",
  "genres": [
    "Sports",
    "Biography",
    "Baseball",
    "Nonfiction",
    "Audiobook"
  ],
  "author": "Ed Lucas",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/23280261-seeing-home"
}