{
  "title": "The Unlikely Pilgrimage of Harold Fry and The Love Song of Miss Queenie Hennessy",
  "description": "Two beloved novels in one volume!THE UNLIKELY PILGRIMAGE OF HAROLD FRY Recently retired, sweet, emotionally numb Harold Fry is jolted out of his passivity by a letter from Queenie Hennessy, an old friend, who he hasn't heard from in twenty years. She has written to say she is in hospice and wanted to say goodbye. Leaving his tense, bitter wife Maureen to her chores, Harold intends a quick walk to the corner mailbox to post his reply but instead, inspired by a chance encounter, he becomes convinced he must deliver his message in person to Queenie--who is 600 miles away--because as long as he keeps walking, Harold believes that Queenie will not die. So without hiking boots, rain gear, map or cell phone, one of the most endearing characters in current fiction begins his unlikely pilgrimage across the English countryside. Along the way, strangers stir up memories--flashbacks, often painful, from when his marriage was filled with promise and then not, of his inadequacy as a father, and of his shortcomings as a husband. Ironically, his wife Maureen, shocked by her husband's sudden absence, begins to long for his presence. Is it possible for Harold and Maureen to bridge the distance between them? And will Queenie be alive to see Harold arrive at her door?THE LOVE SONG OF MISS QUEENIE HENNESSYWhen Queenie Hennessy discovers that Harold Fry is walking the length of England to save her, and all she has to do is wait, she is shocked. Her note had explained she was dying. How can she wait?      A new volunteer at the hospice suggests that Queenie should write again; only this time she must tell Harold everything. In confessing to secrets she has hidden for twenty years, she will find atonement for the past. As the volunteer points out, 'Even though you've done your travelling, you're starting a new journey too.'      Queenie thought her first letter would be the end of the story. She was wrong. It was the beginning.",
  "genres": [
    "Fiction",
    "Book Club"
  ],
  "author": "Rachel Joyce",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/23278263-the-unlikely-pilgrimage-of-harold-fry-and-the-love-song-of-miss-queenie"
}