{
  "title": "Shadow Scale",
  "description": "Seraphina took the literary world by storm with 8 starred reviews and numerous “Best of” lists. At last, her eagerly awaited sequel has arrived—and with it comes an epic battle between humans and dragons.   The kingdom of Goredd: a world where humans and dragons share life with an uneasy balance, and those few who are both human and dragon must hide the truth. Seraphina is one of these, part girl, part dragon, who is reluctantly drawn into the politics of her world. When war breaks out between the dragons and humans, she must travel the lands to find those like herself—for she has an inexplicable connection to all of them, and together they will be able to fight the dragons in powerful, magical ways.    As Seraphina gathers this motley crew, she is pursued by humans who want to stop her. But the most terrifying is another half dragon, who can creep into people’s minds and take them over. Until now, Seraphina has kept her mind safe from intruders, but that also means she’s held back her own gift. It is time to make a choice: Cling to the safety of her old life, or embrace a powerful new destiny?    Praise for Seraphina: \n \n A New York Times Bestseller An Indie Bestseller Winner of the William C. Morris Debut Award Winner of the Cybil Award for Teen Fantasy and Science Fiction An Amazon Top 20 Teen Book of the Year A Chicago Public Library Best Book of the Year A Kirkus Reviews Best Teen Book of the Year A School Library Journal Best Book of the Year A Library Journal Best Young Adult Literature for Adults Selection A Booklist Editors’ Choice An ABA New Voices Pick A Publishers Weekly Flying Start Author An ALA-ALSC Notable Children’s Book An ALA-YALSA Top Ten Best Fiction for Young Adults Book Recipient of 8 Starred Reviews   “Beautifully written, well-rounded characters, and some of the most interesting dragons I’ve read in fantasy for a long while. An impressive debut novel; I can’t wait to see what Rachel Hartman writes next.” —Christopher Paolini, New York Times bestselling author of Eragon   “A novel that will appeal to both fans of Christopher Paolini’s Eragon series and Robin McKinley’s The Hero and the Crown.” —Entertainment Weekly",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Dragons",
    "Fiction",
    "Romance",
    "High Fantasy",
    "Audiobook"
  ],
  "author": "Rachel Hartman",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/23280186-shadow-scale"
}