{
  "title": "The Old Kingdom Collection: Sabriel, Lirael, Abhorsen, Clariel",
  "description": "Game of Thrones fans will love the New York Times bestselling Abhorsen series. Sabriel, the first installment in the series, launched critically acclaimed author Garth Nix onto the fantasy scene as a rising star. This collection gathers all four titles in the popular series, including the long-awaited prequel, Clariel.Sabriel: Since childhood, Sabriel has lived outside the walls of the Old Kingdom, away from the power of Free Magic, and away from the Dead who refuse to stay dead. But now her father, the Abhorsen, is missing, and Sabriel must cross into that world to find him. There she confronts an evil that threatens much more than her life and comes face-to-face with her own hidden destiny. . . .Lirael: Lirael has never felt like a true daughter of the Clayr. She doesn't even have the Sight—the ability to see into possible futures—that is the very birthright of the Clayr. Nevertheless she must undertake a desperate mission under the growing shadow of an ancient evil—one that threatens to break the very boundary between Life and Death itself. With only her faithful companion, the Disreputable Dog, to help her, Lirael must find the courage to seek her own hidden destiny.Abhorsen: The Abhorsen Sabriel and King Touchstone are missing, leaving only Lirael—newly come into her inheritance as the Abhorsen-in-Waiting—to stop the Destroyer. With only a vision from the Clayr to guide her, Lirael must search in both Life and Death for some means to defeat the evil destructor—before it is too late. . . .Clariel: Clariel is the daughter of one of the most notable families in the Old Kingdom, with blood relations to the Abhorsen and, most important, to the King. She dreams of living a simple life but discovers this is hard to achieve when a dangerous creature is loose in the city and there is a plot brewing against the King. When Clariel is drawn into the efforts to find and capture the creature, she finds hidden sorcery within herself, yet it is magic that carries great dangers.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Science Fiction Fantasy",
    "Novels"
  ],
  "author": "Garth Nix",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/23277163-the-old-kingdom-collection"
}