{
  "title": "Crazy And It Was: Surviving the Corporate Pharmaceutical Corruption of Western Medicine",
  "description": "CRAZY AND IT WAS is a frighteningly compelling, multi-layered story of one individual's lost years in the prescription drug-saturated medical and mental health care systems. The book details how corporate forces are influencing healthcare decisions for the millions who take the advice, “talk to your doctor.” The author, who is no conspiracy theorist and still relies upon medication, shows through her own research, medical records and journal entries, an up close and personal account of how and why these systems alarmingly fail so many whom they aim to help. Written solely for her own catharsis, this page turner is also an eye-opening source of information for anyone reexamining the widely-pervasive, social assumptions regarding the reliability of pharmaceuticals and the systems that bring them into our lives.Front Flap:How much stock should one place in the strategically used phrase, research shows...Research shows that the prescription pain-reliever, Vioxx, is a safer alternative to aspirin, yet Vioxx was withdrawn from the market in September of 2004 after leading to at least 88,000 heart attacks and strokes, and after contributing to the deaths of an estimated 38,000 individuals.Research shows SSRI anti-depressants like Paxil and Zoloft are safe and effective treatments for depression, yet there have been an alarming number of suicides connected with the drugs, one of many known side-effects that have been repeatedly downplayed by drug manufacturers.  And now, “new and exciting” research shows that a freshly patented anti-anxiety medication similar to Klonopin holds promise for treating autistic behaviors even though a key benzodiazepine researcher, more than thirty years ago, called for follow-up studies to confirm or rule out suspected brain damage for millions who had suffered after taking the drugs. Those studies have yet to be undertaken.  The science-as-sales-tactic, research shows, delivered a bill of goods to returning college student and single parent, Laurie Oakley. One she never bargained for. Anti-depressants prescribed by her general practitioner were the gateway drugs that landed her squarely into the mental health system where she continued to experience the side-effects of multiple medications, side-effects that were repeatedly misdiagnosed as a worsening mental illness. After even her medical doctors labeled her a hypochondriac while overlooking the side-effects of medications clearly listed in her chart, she decided to do some research of her own. She recovered her health, save for persistent insomnia that sent her back for more treatments. This time, when presented with medication treatments that she knew could cause harm, she would insist upon accountability. While her story may not manage a happy ending, she nevertheless closes on an unexpected high note.",
  "genres": [],
  "author": "Laurie Oakley",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/23279695-crazy-and-it-was"
}