{
  "title": "The Automation",
  "description": "The capital-A Automatons of Greco-Roman myth aren’t clockwork. Their design is much more divine. They’re more intricate than robots or androids or anything else mortal humans could invent. Their windup keys are their human Masters. They aren’t mindless; they have infinite storage space. And, because they have more than one form, they’re more versatile and portable than, say, your cell phone—and much more useful too. The only thing these god-forged beings share in common with those lowercase-A automatons is their pre-programmed existence. They have a function—a function their creator put into place—a function that was questionable from the start…Odys (no, not short for Odysseus, thank you) finds his hermetic lifestyle falling apart after a stranger commits suicide to free his soul-attached Automaton slave. The humanoid Automaton uses Odys’s soul to “reactivate” herself. Odys must learn to accept that the female Automaton is an extension of his body—that they are the same person—and that her creator-god is forging a new purpose for all with Automatons…The novel calls itself a “Prose Epic,” but is otherwise a purposeful implosion of literary clichés and gimmicks: A Narrator and an Editor (named Gabbler) frame the novel. Gabbler’s pompous commentary (as footnotes) on the nameless Narrator’s story grounds the novel in reality. Gabbler is a stereotypical academic who likes the story only for its so-called “literary” qualities, but otherwise contradicts the Narrator’s claim that the story is true.THE AUTOMATION is a this-world fantasy that reboots mythical characters and alchemical concepts. Its ideal place would be on the same bookshelf as Wilson’s ALIF THE UNSEEN and Gaiman’s AMERICAN GODS—though it wouldn’t mind bookending Homer, Virgil, and Milton, to be specific.And, yes, \"B.L.A. and G.B. Gabbler\" are really just a pen name.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "LGBT"
  ],
  "author": "G.B. Gabbler",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/23277532-the-automation"
}