{
  "title": "Freedomnomics: Why the Free Market Works and Other Half-Baked Theories Don't",
  "description": "How free-market economies really work(and why they work so well)Are free market economies really based on fleecing the consumer? Is the U.S. economy truly just a giant free-for-all that encourages duplicity in our everyday transactions? Is everyone from corporate CEOs to your local car salesman really looking to make a buck at your expense?In Why the Free Market Works and Other Half-Baked Theories Don't,economist and bestselling author John R. Lott, Jr., answers these and other common economic questions, bravely confronting the profound distrust of the market that the bestselling book Freakonomics has helped to popularize. Using clear and hard-hitting examples, Lott shows how free markets liberate the best, most creative, and most generous aspects of our society--while efforts to constrain economic liberty, no matterhow well-intentioned, invariably lead to increased poverty and injustice. Extendingits rigorous economic analysis even further to our political and criminal justicesystems, Freedomnomics ? How the free market creates incentives for people to behave honestly? How political campaign restrictions keep incumbents in power? Why legalized abortion leads to family breakdown, which creates more crime? Why affirmative action in police departments leads to higher crime rates? How women's suffrage led to a massive increase in the size of government· Why women become more conservative when they get married and moreliberal when they get divorced? How secret ballots reduce voter participation? Why state-owned companies and government agencies are much more likely to engage in unfair predation than are private firms? Why the controversial assertions made in the trendy book Freakonomics are almost entirely wrongEntertaining, persuasive, and based on dozens of economic studies spanning decades, Freedomnomics not only shows how free markets really work--but proves that, when it comes to promoting prosperity and economic justice, nothing works better.",
  "genres": [
    "Economics",
    "Nonfiction",
    "Politics",
    "Business",
    "Philosophy",
    "Audiobook",
    "Finance"
  ],
  "author": "John R. Lott Jr.",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/1140177.Freedomnomics"
}