{
  "title": "Out Came the Sun: Overcoming the Legacy of Mental Illness, Addiction, and Suicide in My Family",
  "description": "A moving, compelling memoir about growing up and escaping the tragic legacy of mental illness, suicide, addiction, and depression in one of America's most famous families: the Hemingways.She opens her eyes. The room is dark. She hears yelling, smashed plates, and wishes it was all a terrible dream. But it isn't. This is what it was like growing up as a Hemingway. In this deeply moving, searingly honest new memoir, actress and mental health icon Mariel Hemingway shares in candid detail the story of her troubled childhood in a famous family haunted by depression, alcoholism, illness, and suicide. Born just a few months after her grandfather, Ernest Hemingway, shot himself, it was Mariel's mission as a girl to escape the desperate cycles of severe mental health issues that had plagued generations of her family. Surrounded by a family tortured by alcoholism (both parents), depression (her sister Margaux), suicide (her grandfather and four other members of her family), schizophrenia (her sister Muffet), and cancer (mother), it was all the young Mariel could do to keep her head. In a compassionate voice she reveals her painful struggle to stay sane as the youngest child in her family, and how she coped with the chaos by becoming OCD and obsessive about her food, schedule, and organization. The twisted legacy of her family has never quite let go of Mariel, but now in this memoir she opens up about her claustrophobic marriage, her acting career, and turning to spiritual healers and charlatans for solace. Ultimately Mariel has written a story of triumph about learning to overcome her family's demons and developing love and deep compassion for them. At last, in this memoir she can finally tell the true story of the tragedies and troubles of the Hemingway family, and she delivers a book that beckons comparisons with Mary Karr and Jeanette Walls.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Mental Health",
    "Audiobook",
    "Mental Illness",
    "Biography Memoir"
  ],
  "author": "Mariel Hemingway",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/23280224-out-came-the-sun"
}