{
  "title": "Toxic",
  "description": "He Loves Me, He Loves Me Not...New York Times bestselling author Kim Karr turns up the heat in a smoking hot, emotionally compelling new novel that takes you into the world of Manhattan’s elite.In Toxic, Jeremy McQueen, a sexy, intense, sometimes brooding entrepreneur goes after what he wants—the woman he left behind years ago. Phoebe St. Claire, a put together, in control socialite-turned-CEO has been drifting through life searching for something she thought she'd never find again—the right man to share her future. Our passion was boundless. Our lust untamed. And our desire endless. He was the only man who ever made me feel alive. Then, I betrayed him. When he reappeared, I didn’t question it. Trust rarely survives the wrecking ball, so when he let me in back in—I didn’t hesitate. Maybe I should have. What began as a bid to save my family business, turned into a second chance at love. It felt so romantic. Working together, side by side, with the man I loved. My dream come true. Nothing is as good as it seems. We had our issues, but then again, every couple does. It wasn’t jealousy, or our too-hot sex life that I should have been worried about. It was his darkside. I never saw the end coming, until it slammed me in the face. The question is—did he?  Was revenge his plan all along?****Sometimes you have to wonder if your life is too good to be true.Is it real or just an illusion?Does the man lying beside you really love you like he says he does?If the answer is yes, you’re meant to live happily ever after.If the answer is no, you’re living my life, and nothing will ever be the same.What you do about it—that’s up to you.Me, I’m in too deep and there’s no getting out.I’ll take whatever I can get for as long as I can because I know when it’s over…I’ll never find another man like him.Ever!",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "New Adult",
    "Contemporary",
    "Second Chance",
    "Second Chance Romance",
    "Audiobook"
  ],
  "author": "Kim Karr",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/23276722-toxic"
}