{
  "title": "Distant Neighbors: The Selected Letters of Wendell Berry and Gary Snyder",
  "description": "In 1969 Gary Snyder returned from a long residence in Japan to northern California, to a homestead in the Sierra foothills where he intended to build a house and settle on the land with his wife and young sons. He had just published his first book of essays, Earth House Hold. A few years before, after a long absence, Wendell Berry left New York City to return to land near his grandfather’s farm in Port Royal, Kentucky, where he built a small studio and lived there with his wife as they restored an old house on their newly acquired homestead. In 1969 Berry had just published Long-Legged House. These two founding members of the counterculture and of the new environmental movement had yet to meet, but they knew each other’s work, and soon they began a correspondence. Neither man could have imagined the impact their work would have on American political and literary culture, nor could they have appreciated the impact they would have on one another.Snyder had thrown over all vestiges of Christianity in favor of becoming a devoted Buddhist and Zen practitioner, and had lived in Japan for a prolonged period to develop this practice. Berry’s discomfort with the Christianity of his native land caused him to become something of a renegade Christian, troubled by the church and organized religion, but grounded in its vocabulary and its narrative. Religion and spirituality seemed like a natural topic for the two men to discuss, and discuss they did.They exchanged more than 240 letters from 1973 to 2013, remarkable letters of insight and argument. The two bring out the best in each other, as they grapple with issues of faith and reason, discuss ideas of home and family, worry over the disintegration of community and commonwealth, and share the details of the lives they’ve chosen to live with their wives and children. Contemporary American culture is the landscape they reside on. Environmentalism, sustainability, global politics and American involvement, literature, poetry and progressive ideals, these two public intellectuals address issues as broad as are found in any exchange in literature.No one can be unaffected by the complexity of their relationship, the subtlety of their arguments, and the grace of their friendship. This is a book for the ages.",
  "genres": [
    "Poetry",
    "Nonfiction",
    "Nature",
    "Memoir",
    "Biography Memoir",
    "History",
    "Biography"
  ],
  "author": "Chad Wriglesworth",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/23281504-distant-neighbors"
}