{
  "title": "Sofrito",
  "description": "\"In this entertaining debut novel, Frank Delgado tries to save his failing restaurant by returning to Cuba, his dead father’s homeland, to get ahold of a top-secret chicken recipe. But there is more than delicious chicken at stake here. Food is the road home―geographically, emotionally, metaphorically. Peppered with cooking advice from chefs, ordinary folks, and celebrities including Fidel Castro himself (an advocate of pork), Phillipe Diederich’s Sofrito is a love letter to the deepest recesses of nostalgia’s heart.\" Cristina Garcia , author of Dreaming in Cuban and King of Cuba Frank Delgado is no thief. He co-owns a failing Cuban restaurant in Manhattan's Upper East Side. The restaurant, like Frank, is rudderless. Lost. He decides he'll save the restaurant by traveling to Cuba to steal the legendary chicken recipe from the famed El Ajillo restaurant in Havana. The recipe is a state secret, so prized that no cook knows the whole recipe. But Frank's rationale is ironclad―Fidel stole the secret from his family, so he will steal it back. He will triumphantly bring that recipe back to Manhattan and turn his fortunes around. Frank has no interest in Cuba. His parents fled after the Revolution. His dead father spent his life erasing all traces of Cuba from his heart with barbeques, television, lawn mowing and alcohol. So Frank is not prepared for the real Cuba. Sure, he gets beat up and almost killed, the secret service threatens him, but in the midst of the chaos, he falls in love with a prostitute and the city, and he unwraps the heroic story of his parents' life. Cuba begins to bind Frank together, the way a good sofrito binds the flavors of a Cuban dish. Phillippe Diederich is a Haitian American writer and photojournalist raised in Mexico City and Miami, Florida. The dictator Papa Doc kicked his parents out of Haiti in the 1960s. Phillippe grew up listening to stories of nostalgia, revolution, and exile. His friends were the sons and daughters of parents who had fled oppressive regimes throughout Latin America.",
  "genres": [
    "Fiction",
    "Adult",
    "New York",
    "Latino"
  ],
  "author": "Phillippe Diederich",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/23282002-sofrito"
}