{
  "title": "Into the Dangerous World",
  "description": "*\"This striking combination of story and illustration creates a powerful portrait of a budding artist.\" Publishers Weekly starred reviewRaised on a Staten Island commune in the 1980s, Aurora has never attended a day of school, and has seen little of the outside world. What she knows best is drawing. To her, it’s like breathing; it’s how she makes sense of the world. When her father burns down the commune, killing himself in the process, Ror’s life changes. She ends up in Manhattan, where she discovers that the walls, the subways, the bridges are covered with art. Before long, she runs into trouble with Trey, the ultimate bad boy and president of Noise Ink, a graffiti crew she desperately wants to join. When Ror falls in love with Trey, she realizes she’ll do just about anything to get up in the scene. She has some decisions to make: she wants to be a street artist but she doesn’t want get shot by the cops; she wants her art in the museum but she doesn’t want to die waiting to become famous; she wants to makes money selling her work in a gallery but she doesn’t want to be a puppet at the mercy of a dealer. The book follows her descent into a dangerous world, where her drawings are her only salvation. \"I think I’ve found my new favorite author! This story of a young artist’s struggle to find her voice against all odds shimmers with authenticity. Julie Chibbaro understands the actual dynamics of being a high school student and struggling with the volatile world of street art and the insular nature of high art. Every character feels like someone I’ve known, debating how art fits into their life.” --Ron English, acclaimed street artist, culture jammer, and designer of Popaganda.“Rebellion, peer pressure, the desperation to belong—who can't relate? But there's more here. Chibbaro's wholly original outsider character, Ror, takes us into the world of graffiti artists. Written with a wild abandon matched only by a haunted and unapologetic main character, this bold book wakes us up to an urban tribe who operate in the margins. Then there's the powerful, primal art by JM Superville Sovak. The art feels so organic to the text, it's hard to imagine one without the other. Yes, this is a dangerous world, but all the world is dangerous until, like Ror, you learn to listen to your own voice, and determine to be the architect of your own dreams. A little rough around the edges where it needs to be (I can hear some parents and teachers groaning about the language), Into the Dangerous World is a journey worth taking. This is one author I'll definitely be watching.” --Nikki Grimes, award-winning author of Bronx Masquerade",
  "genres": [
    "Young Adult",
    "Art",
    "Realistic Fiction",
    "Contemporary",
    "Fiction",
    "Graphic Novels",
    "Romance"
  ],
  "author": "Julie Chibbaro",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/23281834-into-the-dangerous-world"
}