{
  "title": "The Dalai Lama's Cat and the Power of Meow",
  "description": "\"If you ever doubted that your feline companion has her own inner life, just watch what happens when she falls asleep, and loses conscious control of her physical being . . . a twitching of limbs, a quivering of the jaw, sometimes, perhaps, a snuffling noise or a meow.. . . Cats may indeed be capable of great mindfulness, but we are thinking beings too. In my own case, unfortunately, a being who thinks rather too much.\"In the latest installment of the Dalai Lama’s Cat series, His Holiness’s Cat (\"HHC\") is on a mission: to think less, to experience more, to live in the moment. She soon learns the proper phrase for this, being mindful, or, a concept better known to her as the power of meow. What ensues is a journey to discover her own true nature, to gain a deeper understanding of her mind, and to experience life’s greatest joy, the here and now.Throughout, there are encounters with familiar inhabitants of Dharamsala, as well as a whole new cast of characters: a senior exec from one of Silicon Valley’s most famous social media companies (hint: the name rhymes with \"litter\"), the Pope’s beloved dog (who shares a shockingly similar title: HHD, His Holiness’s Dog), and a public health inspector who threatens to have our poor narrator banned from the Himalaya Book Café.In this follow-up to the Dalai Lama’s Cat and the Art of Purring , readers escape to the enchanting and exotic world of the Dalai Lama’s monastery in the Himalayas, and take a peek inside the mind of a delightfully imperfect creature on the path to enlightenment. By accompanying HHC on her journey, you will learn new ways to relate to your own mind: slowing down, finding peace, and abiding in the boundless radiance and benevolence that is your own true nature.",
  "genres": [
    "Fiction",
    "Spirituality",
    "Buddhism",
    "Cats",
    "Animals",
    "Self Help",
    "Philosophy"
  ],
  "author": "David Michie",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/23280913-the-dalai-lama-s-cat-and-the-power-of-meow"
}