{
  "title": "The Sunshine Crust Baking Factory",
  "description": "Nominated for the Brooklyn Public Library's Brooklyn Eagles Literary Prize for Fiction\"Wakefield wrote an intrepid nonfiction book about modern squatting, Not for Rent (1996), and now vividly fictionalizes the experience, portraying various oddball characters in her charmingly laid-back, dialogue-rich first novel with empathy and insight.\"--\nBooklist\n\"Wakefield...draws on personal experience for this colorful and entertaining depiction....the sentiment of the nomadic community in New York in the '90s comes alive through historical references and Sid's journey as she forges a network of like-minded individuals.\"--\nPublishers Weekly\n\"A book that Wakefield's characters would love.\"--\nKirkus Reviews\n\"The angst and passion of a witty, determined young rebel makes for a saga that is compelling and vivid, and a story that will draw in any young rebel who has dreamed of bucking convention.\"--Midwest Book ReviewOne of \nThe L Magazine\n's 50 Books You’ll Want to Read This Spring and Summer\"The lively novel brings to life the misfits and eccentrics that inhabited the neighborhood decades before The Wyeth Hotel and Blue Bottle opened up.\"--GalleyCat\"A good novel...Wakefield's conversational tone keeps the narrative flowing and you really can't help but like Sid because of her optimistic view of squatting (and the world in general).\"--LitReactor\"The residential squatting brought to life in Wakefield's novel is its own kind of political statement, but one that is made in everyday life choices....The characters--at least some of whom are composites of people Wakefield met while squatting--are immediate and rub up against you in familiar ways, especially if you lived through the '90s and knew people who lived this lifestyle.\"--\nKGB Bar Lit Magazine\n\"This gritty book gives readers a rare glimpse into the lives of the squatters in the 90s NYC scene.\"--\nLiterary Orphans\n\"The book is a celebration of the do-it-yourself living ethos that allowed many punks to live communally in New York City at the end of the last century, but it is also a cautionary tale about the struggles of trying to get along when living in large groups.\"--\nThe Brooklyn Paper\nSid arrives in New York City in 1995 eager to join the anarchist squatting scene. She's got a tattoo, she listens to the right bands...so why would she get a job and rent some tiny shoe-box apartment when she could take over a whole building with a gang of wild young pirates? But the Lower East Side is changing; there are no more empty buildings, the squats are cliquey and full.Sid teams up with a musician from Mexico and together they find their way across the bridge to Williamsburg, Brooklyn. Packs of wild dogs roam the waterfront and the rough building in which they finally find space is occupied by misfits who don't know anything about the Manhattan squatting scene, Food Not Bombs, Critical Mass, or hardcore punk. But this is Sid's chance and she's determined to make a home for herself — no matter what.Wakefield spent years living in squatted buildings in Europe and New York and brings firsthand knowledge to Sid's story: how urban homesteaders lived without plumbing or electricity, how they managed their semilegal status, and what they cared about and fought for. With Sid, Wakefield has created a character who belongs to that world and is also entirely relatable. Sid is a resourceful, intrepid young woman with a wry sense of humor; she's great company on our journey into the lost world of New York City's recent past.",
  "genres": [
    "Fiction",
    "Punk"
  ],
  "author": "Stacy Wakefield",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/23281970-the-sunshine-crust-baking-factory"
}