{
  "title": "Blackjack: Wicked Game",
  "description": "Book Two of The Thomas Hunt SeriesSex, love, and a wicked game throw Samantha Drake and Thomas Hunt into an adventure that takes them to places they’ve never been. From the mountains above Las Vegas to the glitzy casinos of Monte Carlo, Sam and Thomas are forced to confront demons from the past while nurturing their fledgling relationship. Thomas goes from being Sam’s skilled young submissive lover to discovering his own inner Dominant side. Will she be able to surrender control? Will love be enough to see them through the twists and turns of this new adventure? Don’t miss the hot follow-up to the highly acclaimed Love Is A Losing Game. **Blackjack is a modern, steamy erotic novel set in Las Vegas. It contains explicit sexual situations, light BDSM, and frequent profanity. It is intended for adults over the age of 18 only. This is a full-length novel of approximately 61,400 words. It is the second of a 3 book trilogy. Book 3, the Conclusion of The Thomas Hunt Series, is expected to be released in December 2014.** Don't miss Book 1, Love Is A Losing Game, available now. ***** HOT and STEAMY, funny, and adventurous. 5 STARS!!! AMAZING sequel. …Action packed, sexy scenes, and role reversal make this an enjoyable read! …the perfect amount of suspense, SEX, comedy, and adventure! ***** Hot and sexy 5 star read!!! I love this series!! Blackjack made me fall even more in love with Sam and Thomas! ***** Adventurous and Sexy! By Explicit Escapes Blackjack is one hell of a ride. Not only is it ultra sexy and funny, but I also loved the sense of adventure and suspense in this one. Again, it was a pleasure to be able to take the journey with Sam and Thomas as they figure out how their relationship will work. It's awesome to see the love between these 2 grow. And let's not forget about the scorching hot sex! Cannot wait for the final installment to this awesome series. ***** Holy hotness Sam J.D. Hunt has done it again! I LOVE IT!!!! Roulette was hot and Blackjack is just as hot if not hotter! Thomas is to die for!! This book starts out with a bang!! Sam doesn't leave you waiting and waiting for it like others! First chapter and they're there! My favorite part is the beginning of the book! Well...I'm partial because I love these books! Cannot wait for the third installment!!!! ***** Make sure you have time to read this book, once you pick it up, you will not be able to put down. The characters, Thomas and Sam pull you in and take you on an adventure with them. The sex in this book, is OMG, top of the hotness scale. It is scorching ladies, you will need to change you panties when you finish this book. This is a must read for all you naughty ladies out there!!! ***** Sam doesn't hold back at Blackjack! Be prepared to sit down and not get up till its over. The book takes right off where we left Sam & Thomas in Roulette. The adventures these two get involved in are out of this world, along with the hot sex! !! Definitely a must read!",
  "genres": [
    "M F Romance",
    "Contemporary Romance"
  ],
  "author": "Sam J.D. Hunt",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/23280508-blackjack"
}