{
  "title": "Tall, Dark and Deadly Books 0.5 - 3",
  "description": "The box set now includes FOUR full sized novels:Hot SECRETS: Book 1 Royce WalkerRoyce Walker, a former FBI Agent, who's opened a private security firm with his brothers, has always had the hots for the prim, proper Assistant District Attorney, but considered her hand's off because of a family connection. However, when danger threatens Lauren, he isn't willing to stand by and watch her get hurt. Now the passion for survival is only rivaled by the passion burning between them. And that passion, might just be the death of them both.DANGEROUS SECRETS: Book 2 Luke WalkerBeing a divorce attorney for the rich and famous isn't all it's cracked up to be. Julie Harrison has learned that love doesn't last, and she's sworn never to make the same mistakes as her mother, or her clients. She uses the games men play to keep them at a distance. The only man who managed to break down her walls was Luke Walker, a Navy SEAL who loved her and left her, and changed her forever.When Luke arrives back in New York, running Walker Security with his brothers and having left his Navy SEAL days behind, he sets his sights on Julie, the woman he's always wanted and couldn't have. Except, she runs from him every time he gets close.But now, one of Julie's clients, a powerful judge, gets involved with a dangerous cartel, and his soon-to-be-ex wife ends up dead. Julie's next on the list, and she finds herself on the run from those who believe she knows too much, and counting on Luke to keep her alive. In the deepest, darkest moments of the night, passion will bring them together while danger threatens to tear them apart. Can Julie and Luke trust each other and find their happy ending before they find ... the end?BENEATH THE SECRETS: Book 3 Blake WalkerTwo will paths collide. Two people who will do anything, including sleeping with the enemy, to avenge or save someone they love. But what if everything isn't as it seems and the enemy isn't the enemy at all? Can these two broken people drawn together by their sizzling hot attraction see beyond their pain and their need for vengeance Undoubtedly, they will face the ghosts of their pasts, but will those ghost destroy them or forever bind them?SECRETS EXPOSED: A bonus story lightly connectedAttorney Lindsey Paxton is about to have a brutal case from her past come back to haunt her in the most dangerous of ways. To survive she will end up in the arms of a man she considers her enemy, but might just be her only salvation.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Contemporary Romance",
    "Amazon",
    "Military Romance",
    "Collections"
  ],
  "author": "Lisa Renee Jones",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/23280834-tall-dark-and-deadly-books-0-5---3"
}