{
  "title": "All This Life",
  "description": "With a wide cast of characters and an exciting pace that mimics the speed of our modern, all-too-connected lives, All This Life examines the dangerous intersection of reality and the imaginary, where coding and technology seek to highlight and augment our already flawed human connections.Morning rush hour on the Golden Gate Bridge. Amidst the river of metal and glass a shocking event occurs, leaving those who witnessed it desperately looking for answers, most notably one man and his son Jake, who captured the event and uploaded it to the internet for all the world to experience. As the media swarms over the story, Jake will face the ramifications of his actions as he learns the perils of our modern disconnect between the real world and the world we create on line.In land-locked Arizona, as the entire country learns of the event, Sara views Jake’s video just before witnessing a horrible event of her her boyfriend’s posting of their intimate sex tape. As word of the tape leaks out, making her an instant pariah, Sara needs to escape the small town’s persecution of her careless action. Along with Rodney, an old boyfriend injured long ago in a freak accident that destroyed his parents’ marriage, she must run faster than the internet trolls seeking to punish her for her indiscretions. Sara and Rodney will reunite with his estranged mother, Kat, now in danger from a new man in her life who may not be who he--or his online profiles--claim to be, a dangerous avatar in human form.Using his trademark talent for creating memorable characters, with a deep insight into language and how it can be twisted to alter reality, Joshua Mohr returns with his most contemporary and insightful novel yet.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Dark",
    "Adult",
    "Relationships",
    "Technology"
  ],
  "author": "Joshua Mohr",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/23281478-all-this-life"
}