{
  "title": "The Hunter Jackson Tales",
  "description": "Crying Wolf War is reality... Love is hard to come by... The two worlds should never collide.  Hunter Jackson has been a major force in the werewolf army since he turned eighteen. When he hit twenty-one is father the commanding officer of the entire force gave him complete control over his own unit. Their mission is simple take down the shape shifters.  There is one problem with this... Her name is Amelia.  Two months before his team raids the home of the Shape Shifter heads he meets Amelia Brecken. She is like no one else he has ever known; she also is the daughter of Sir Reid and Mistress Lilyann leaders of the Shape Shifters.  War becomes his reality and love takes a backseat. A collision course is paved and only Hunter can prevent the accident. Danger is real. Her protection key, even if he has to break her heart to keep her safe.  Shaping the Wolf Shaping one's future... Depends on more than yourself... When you find the one willing to help hang on tight.  Hunter Jackson knows he is a loser. The love of his life is sitting in a prison because of him. When his team raided the home of the Brecken Family, the heads of the shape shifters he knew in order to save her he'd have to get to her first and arrest her. He did and now...well now he doesn't know what to do. Explanations are slow to sink in, she's hurting because of him. He kept her in the dark, and he's paying the price.  His father is pushing... Pushing for Amelia's execution.  Since she's a shape shifter she's in special chains preventing her from using her powers. He gets alone time by pretending he needs to question her. It works, but he's running out of time. He needs a plan if he fails this will shape the rest of his life. Losing Amelia is not an option.  Loving the WolfLove... Not always achievable... Love... Is worth the fight... So fight till the death.  Since their escape Hunter and Amelia have been stuck. Hunter can’t leave his cabin, all he has left of his mom. Amelia won’t go anywhere without him. Hunter knows the end is coming, and he has to find strength inside of him, strength he didn’t know existed in order to keep her and their unborn child safe.  His father.... Is stalling and it’s making Hunter nervous.  Amelia has forgiven him, trusted him, and loved him through everything. He doesn't want to fail her now. Not after failing her so many times in the past. He can see the light at the end of the tunnel even after he learns information that sends his head spinning. If Amelia is by his side then he can walk through the darkness and prevail. Love is power he just has to believe.",
  "genres": [],
  "author": "Amanda Kay",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/23288092-the-hunter-jackson-tales"
}