{
  "title": "The Harmony Series Boxset",
  "description": "Now's your chance to grab the boxset of New York Time & USA Today Bestselling Harmony Series.Inevitable, Book 1-After experiencing a humiliating breakup, twenty-two-year-old Cassandra Clarke is fresh out of college and living a simple solitary life without any intentions of pursuing love anytime soon.When the estate next door sells, the last thing Cassandra expects is the unnerving attraction she feels for her sinfully handsome neighbor, Logan West, the young and charming single father with a playboy reputation.It's through Oliver, Logan's four-year-old son, who keeps popping up in her childhood tree house, that she slowly begins to catch glimpses of the compassionate and wounded man Logan has hidden beneath his strong exterior.Cassandra knows it's wrong and that she's heading for another heartbreak.Logan will never be able to give her what she wants...love.Irreplaceable Book 2- It wasn't his fault she lay broken and battered. He wasn't responsible for the injuries covering her bruised body.Her heart, however, told a different story. She endured the pain of its jagged edges as it shattered against her chest, ripping through the hope she once held. Her spirit was broken, and only one man was to blame for that.Cassandra Clarke had known better than to trust her all to a man like Logan West. She'd thought he was different--a better man than he'd portrayed to others. A man worth risking it all for.But she was wrong, and would never make that mistake again.What happens when you question everything you longed to believe--deny all emotions you still hold for a man unworthy of them?Faced with Logan's persistence, Cassandra must find the strength to keep her guard up or risk falling again for the one man her body feels...is irreplaceable.Indestructible, Book 3-Love. Passion. Respect.Logan West finally has the one thing he believed unattainable: the fiery woman who challenges, protects, and adores him just as much as she does his young son, Oliver.After having her world shaken yet again, Cassandra Clarke is ready to move forward, eagerly embracing the beautiful man who has laid claim to her heart. With secrets revealed at every turn, she refuses to lose the only man she's ever loved.Not every battle is hers to fight, but she's never been one to back down. Logan and Oliver are part of her now, and together they are...indestructible.",
  "genres": [
    "Contemporary Romance"
  ],
  "author": "Angela  Graham",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/23287350-the-harmony-series-boxset"
}