{
  "title": "Beirut Noir",
  "description": "Akashic Books continues its groundbreaking series of original noir anthologies, launched in 2004 with Brooklyn Noir. Each story is set in a distinct neighborhood or location within the city of the book.Featuring brand-new stories by: Rawi Hage, Muhammad Abi Samra, Leila Eid, Hala Kawtharani, Marie Tawk, Bana Baydoun, Hyam Yared, Najwa Barakat, Alawiyeh Sobh, Mazen Zahreddine, Abbas Beydoun, Bachir Hilal, Zena El Khalil, Mazen Maarouf, and Tarek Abi Samra.Most of the writers in this volume are still living in Beirut, so this is an important contribution to Middle East literature--not the \"outsider's perspective\" that often characterizes contemporary literature set in the region.From the introduction by Iman Humaydan (translated by Michelle Hartman):\"Beirut is a city of contradiction and paradox. It is an urban and rural city, one of violence and forgiveness, memory and forgetfulness. Beirut is a city of war and peace. This short story collection is a part of a vibrant, living recovery of Beirut. Beirut Noir recovers the city once again through writing, through the literary visions of its authors...\"From within this collection of stories, a general attitude toward Beirut emerges: the city is viewed from a position of critique, doubt, disappointment, and despair. The stories here show the vast maze of the city that can't be found in tourist brochures or nostalgic depictions of Beirut that are completely out of touch with reality. Perhaps this goes without saying in a collection of stories titled Beirut Noir. But the 'noir' label here should be viewed from multiple angles, and it takes on many different forms in the stories. No doubt this is because it is imbricated in the distinct moments that Beirut has lived through and how they are depicted in the stories.\"",
  "genres": [
    "Short Stories",
    "Fiction",
    "Mystery",
    "Lebanon",
    "Noir",
    "Anthologies",
    "Novels"
  ],
  "author": "Iman Humaydan",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/23282230-beirut-noir"
}