{
  "title": "In Deep",
  "description": "BrielleWhat would you do if you met a man that made you burn like wildfire from the inside out? Burn so hot that with one touch you forgot to breathe?And if you knew that he had dangerous secrets? Would you be able to walk away? I couldn’t. As strong as I know I am, I kept going back for more of him. That body… those eyes…I saw him for the first time on my very first day in Vegas, and even then I think a part of me knew, because I couldn’t look away. It was like that moment when you see something flying towards you and you know it’s going to hit you before you can ever move out of the way, so you just watch, transfixed, as it crashes into you. Cristos Vicario: owner of the illustrious Adagio hotel and casino and reputed billionaire playboy. He sure as hell wasn’t what he seemed on the surface. That man had secrets. No one knew what a dark and dangerous world he lived in, and when I finally saw him for what he was, it was already far too late. I found myself inextricably tied to him forever. The course of my life altered. My entire world changed forever as he took away my freedom and gave me the key to my dreams in one fell swoop.How could I have known that the one man who should have been my greatest nightmare would become the one thing I couldn’t live without? And all I had to do was forgive him…CristosI was only living for one thing, one goal, one endgame… until I saw Brielle. And when I touched her, it was all over for me… I just didn’t know it yet. Not until I broke all of my rules for her, one after another, and that still wasn’t enough. I wanted more. I wanted it all. Yeah, what I did to her was pretty much unforgivable. I know that now. Some small part of me might have known it then, too, but it didn’t matter. I had to hold on to her. I would have done anything to keep her… and I did.Now I’ve put her in danger, dragged her into my world, and I don’t know whether to push her away or hold her tighter. Letting her go would be the right thing to do… but every time I try to do the right thing… I can’t. When I take her, it’s always hard and desperate, as if she’ll disappear if I can’t make her feel the same things I feel... if I can’t force her to care about me enough that she’ll look past everything else and see into my heart.Last night, after she fell asleep, still wrapped in my arms, I rested my lips against the top of her head and inhaled the scent of her as she slept. Trusting me, even though she shouldn’t. “I don’t deserve you”, I whispered. “But I want you. God, I want you so badly.”",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Adult",
    "Crime",
    "Suspense",
    "Mystery"
  ],
  "author": "Kella McKinnon",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/23290446-in-deep"
}