{
  "title": "Highland Werewolf Boxed Set",
  "description": "The Highland Werewolf Boxed Set contains the first four books in Terry Spear's Highland Werewolf series.In Heart of the Highland Wolf a modern werewolf laird and a beautiful red female werewolf enter into an intrigue involving the laird's secretive clan, an ancient relic, and a romance novel. Has this wiley female met her perfect hero?In A Howl for a Highlander the driven Duncan MacNeill has left his highland home to chase a thief into a tropical paradise. When he meets lone wolf and botanist Shelley Campbell on Grand Cayman Island, he'll discover just how tempting paradise can be.Scottish Cearnach MacNeill and sexy little American werewolf Elaine Hawthorn collide, quite literally, on a foggy Highland road in A Highland Werewolf Wedding. Now they're stuck with each other while they wait for help to arrive, and it's going to be a delightful, steamy and devilishly funny wait.She's never been to Scotland, but when werewolf Colleen Playfair learns she must spend a year and a day in the highlands learning to manage her new estate, she's up for the challenge. But she did count on the stubborn Grant MacQuarrie whose clan has been managing the castle for the last three centuries and will do anything it takes, including taking Colleen to bed, to convince her that nothing needs to change in A Hero of a Highland Wolf.\"Spear combines captivating characters, gripping mysteries, and all-consuming love stories.\" -Fresh Fiction\"With just enough wolf detail and werewolf lore, this action-packed story crackles with mystery, adventure, violence, and passion.\" -Library Journal\"Romance, adventure, and a paranormal twist...If you like your werewolf stories with a bit of a bite, then pick this series up now.\" -Night Owl Romance (Reviewer Top Pick)",
  "genres": [
    "Paranormal Romance",
    "Werewolves",
    "Shapeshifters"
  ],
  "author": "Terry Spear",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/23290745-highland-werewolf-boxed-set"
}