{
  "title": "Planning An Addition",
  "description": "He'd had a secret for years. And it was time for it to come out.Dating two younger men! Molly Walters never thought she'd be that woman, one of those \"cougars\" everybody talks about. Peyton Stokes, wounded warrior and one of Tony Walters' employees, is the perfect man. She decides to ask him out, and to her delight, he accepts. And once he admits he was already considering asking her for a date, sparks fly. Then former cage fighter turned security specialist Jose Flores, Peyton's much-younger best friend, asks her out too, and Molly decides to go. She knows full well what kind of disaster she's creating by dating best friends, but she just can't help herself. Between Peyton's powerful build and bright blue eyes, and Jose's dark, almost-sinister beauty, Molly is seduced on all levels by both men, much to her delight.As the relationships deepen, Molly comes to a startling conclusion: She wants them both. That's fine with Jose, because he's got a secret he's never been able to tell Peyton, and this turn of events just might make all his dreams come true. But as soon as the truth comes out, things fall apart faster than anyone could've ever imagined.Is it true that blood's thicker than water? If the relationship disaster wasn't enough, there's a horrible set of circumstances in Jose's family of origin that thrust him into the biggest crisis of his life. When it becomes obvious that his very existence is in jeopardy, Peyton must decide if the self-imposed labels he's clung to all his life are worth enough to him to risk losing his best friend forever. It'll take a real man to take that leap of faith, and Peyton's not sure he's that man, but failing could cost him the love of his life - maybe even both of them.As Peyton struggles, Nikki Walters grows weaker and hope grows dim. Tony and his broken heart can't survive without her, but he may not have any choice. When Nonna Annamaria steps in to help, Tony calls on the last tiny bit of faith he has. Unfortunately, chances are really good that it won't be enough, and his one true love will leave them all forever. And that's a prospect he can't bear to face.WARNING: This book contains graphic sexual situations and is not suitable for readers under the age of 18.",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Contemporary",
    "M M F",
    "Contemporary Romance",
    "Dark"
  ],
  "author": "Deanndra Hall",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/23291553-planning-an-addition"
}