{
  "title": "I ragazzi della via Pal",
  "description": "Az ifjúsági irodalom egyik alapművének tartott regény 1907-ben jelent meg, s nem csak hazánkban, de a világon mindenütt nagy sikert aratott. Ezt bizonyítja az is, hogy Bulgáriától kezdve Dél-Koreáig nagyon sok nyelvre fordították le. Olaszországban például az irodalmi mítoszok közé emelkedett, az ottani zsebkönyvtár sorozatban már a tizenharmadik kiadása is megjelent, épp csak nem kötelező tananyag. A józsefvárosi Füvészkertben játszódó történet ugyanis olyan mondanivalóval rendelkezik, hogy azok számára is érthetővé válik, akik a Föld más területén élnek.Kevés regény ábrázolja olyan sokrétegűen és érzékenyen a kamaszok világát, mint Molnár Ferenc műve, a Pál utcai fiúk. Ezért sem véletlen, hogy kötelező olvasmány lett belőle. Az 1890-es évek pesti gyerekvilágának ezt a lírai krónikáját többször is feldolgozták, színpadon és filmen egyaránt. Leghíresebbnek közülük a Fábry Zoltán rendezte 1968-as változat bizonyult, ami magyar-amerikai koprodukcióban készült. A Pál utcai fiúk főszereplői józsefvárosi gyerekek, akiknek két bérház közötti grund jelenti a szabadságot és a hadszínteret. Ezen kereten belül mutatja be az iskola és játék, barátság és harc, összetartás és árulás megnyilvánulásait a kamaszvilág tükrében, a gyerekek szemszögéből nézve és megértve. A történet két rivális banda között játszódik, akik a grundon – és a grundért – folyó harcot élet-halál kérdésének tekintik, ám ez a romantikus játékhadszíntér az író fantáziája által jelképpé válik, ahol a fennmaradásért kell háborúzni. Mert ennek a világnak is megvannak a saját törvényei, szokásai, egyesületei és erődítményei. Tehát vezérei és közkatonái is. Boka és Ács Feri a két tábor vezére, Geréb, az áruló, s az önfeláldozó Nemecsek Ernő egytől-egyig kiforratlan, alakuló egyéniségek, s Nemecsek híres önfeláldozása sem a szokványos hősi tett, sokkal inkább a grundért folyó háború során önkéntelenül is bátor hőssé váló hétköznapi kamasz természetes cselekedete",
  "genres": [
    "Classics",
    "Fiction",
    "Hungarian Literature",
    "School",
    "Childrens",
    "Hungary",
    "Novels"
  ],
  "author": "Ferenc Molnár",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/11404233-i-ragazzi-della-via-pal"
}