{
  "title": "Bidden: Trilogy",
  "description": "It all began with a Candidate and a Gentleman... CANDIDATE FOUR: Like most college graduates, Natalie Harlow is swimming in debt. Her post-graduate job can barely afford her the chance to move out of her parents' apartment, or make any headway on her $700 a month student loan. So when her glamorous, dresses-like-she-isn't-hurting-for-money co-worker Quinn offers her the opportunity to make a lot of money for just one night of work - a \"job\" that is as secretive as it is lucrative - Natalie is hesitant, but curious. Twelve glamorous “Candidates” line up for twelve gentlemen bidders in a luxurious, private residence high in the hills above the city. The item up for auction? One night with a Candidate. He pays, she stays. What they do is up to him. Is the lure of cash enough for Natalie to lay herself aside for one night as Candidate Four? SINFUL REUNION: Natalie Harlow's prospects are improving. She's debt free, living on her own and can occasionally get through the day without thinking of a certain Gentleman and the steamy night they spent together five months ago. When her party-loving friend Quinn suggests they go to Vegas to celebrate Natalie's new promotion she's game, but Natalie is about to learn that in the city of Sin anything can happen - including a passionate reunion with the one man she'd never thought she'd see again. Spend another night with Natalie and Gentleman Twelve in this sexy follow-up to CANDIDATE FOUR, and discover the secrets that connect them far beyond the four walls of the bedroom. SECRET DESIRES: Natalie Harlow’s professional life is on track. Junior Vice President and account manager to Brighton New Media’s biggest client - Fitson Entertainment Groupe - she has everything she ever knew she wanted. All she has to do to keep it that way is hide the fact that her nights are spent with Fitson’s Chief Creative Officer, James Fitzgerald (known only to her as Gentleman Twelve). Their secret meetings under the guise of work are thrilling, but Natalie is constantly on alert that someone could find out - it is against Brighton policy to date clients - and bring to an end everything she has worked so hard to earn. James, meanwhile, is growing tired of pretending in public that Natalie means little more to him than a stranger, and has hinted at an ultimatum: him or her job. Straining the already-burdened relationship is Celine, James’ soon-to-be ex-wife who has come to Los Angeles with a secret of her own; Ivy Whitcomb, an opportunistic co-worker with a past connection to Fitson; and Joe Gallo, who has his professional (and maybe personal?) sights set on Natalie. Can Natalie and James' relationship withstand bombshell revelations and secrecy? Find out in this provocative follow-up to SINFUL REUNION and CANDIDATE FOUR!",
  "genres": [],
  "author": "Crystal Cierlak",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/23292408-bidden"
}