{
  "title": "The Wanderer's Children",
  "description": "The Wanderer's mission three decades ago: secretly sire children to hide his bloodline, and protect them until their destinies can unite in the final battle between good and evil. That time has come... Cara Collins, the First of the Holy Twelve, longs for one last peaceful weekend with her bridesmaids as she plans her wedding to Simon Young, her former Trinity Guardian, before duty calls with the Angelorum to gather the Twelve and prepare them for battle. Life, as she knew it, has changed; weird is Cara's new normal. Her newly acquired Nephilim DNA is wreaking havoc on her and those closest to her as her body transforms into Amazonian proportions and an overabundance of pheromones threatens to land her in hot water with Simon--not to mention a sudden suspicious outbreak of \"insta-love\" among her friends. Michael Swift, Cara's Trinity Messenger, has spent months running from his attraction to Cara's brazen best friend Sienna, the only woman who has ever skirted his considerable defenses. But if he wants a future with her, he must confront his tormented past head on, or risk losing her and destroying the future of the Angelorum. As Lucifer's fallen angels known as the \"Dark Ones\" and outside threats gather, Cara has more to worry about than fitting into her wedding dress and playing Cupid to her friends. A second encounter with rock star Brett King shows Cara once again that there are no coincidences. One of the Wanderer's children, Brett and his secret siblings are the key to gathering the rest of the Twelve. When the newly forming team finally comes together, an unexpected revelation shakes them to their core. They must all look deeper into their souls as new secrets come to light to discover what's really at stake in the final battle between good and evil...if betrayal and Lucifer don't rip them apart first. Second book in a four-part series [urban fantasy (40%) / sci-fi (20%) / paranormal angel romance (40%)] for adults (18+) with crossover to new adult. **** Can be read as a stand alone **** Adult language and explicit love scenes.",
  "genres": [
    "Urban Fantasy",
    "Angels"
  ],
  "author": "L.G. O'Connor",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/23292465-the-wanderer-s-children"
}