{
  "title": "Some Men: Feminist Allies and the Movement to End Violence against Women",
  "description": "What does it mean for men to join with women as allies in preventing sexual assault and domestic violence? Based on life history interviews with men and women anti-violence activists aged 22 to 70, Some Men explores the strains and tensions of men's work as feminist allies. When feminist women began to mobilize against rape and domestic violence, setting up shelters and rape crisis centers, a few men asked what they could do to help. They were directed \"upstream,\" and told to \"talk to the men\" with the goal of preventing future acts of violence.This is a book about men who took this charge seriously, committing themselves to working with boys and men to stop violence, and to change the definition of what it means to be a man. The book examines the experiences of three generational a movement cohort of men who engaged with anti-violence work in the 1970s and early 1980s, during the height of the feminist anti-violence mobilizations; a bridge cohort who engaged with anti-violence work from the mid-1980s into the 1990s, as feminism receded as a mass movement and activists built sustainable organizations; a professional cohort who engaged from the mid-1990s to the present, as anti-violence work has become embedded in community and campus organizations, non-profits, and the state. Across these different time periods, stories from life history interviews illuminate men's varying paths--including men of different ethnic and class backgrounds--into anti-violence work.Some Men explores the promise of men's violence prevention work with boys and men in schools, college sports, fraternities, and the U.S. military. It illuminates the strains and tensions of such work--including the reproduction of male privilege in feminist spheres--and explores how men and women navigate these tensions.To learn more please visit somemen.org",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Gender"
  ],
  "author": "Michael A. Messner",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/23288174-some-men"
}