{
  "title": "Dreams",
  "description": "A Young Adult Urban Fantasy Novel (book 2)BOOK \"A truly remarkable piece of literature. A powerful, thought-provoking read that leaves the reader in wonder.\" ~Julie S. (Amazon reviewer).\"This is a fantastic and clean love story with mystery, danger, and adventure for anyone 13+. Definitely not your typical paranormal read it is unique and refreshing and I can't wait to read the next installment!!!\" ~Anonymous Amazon Customer\"This book was simply amazing. It brings to life the books of childhood fae in so many ways... a 5 STAR read from start to finish\" ~Random Musesomy (Amazon reviewer)***BLURB***Being forced into a fantastical world was never in Arie’s life plan, but after spending time with her previously thought dead father, she’s falling in love with the world of enchantment. She’s determined to create a life for her newfound little sister, Amary, that is full of hope, tranquility, and love like her mother had done for her up until she died.Losing her best friends, River and Starling, during the transition into her new life wasn’t easy on Arie, but a necessary sacrifice to ensure the safety of Amary and the natural balance of light and darkness. She is the chosen one who, through a choice of love, could cause the further destruction of balance, but is also the only one who could save them all.Her journey is riddled with increased power, new discoveries, and a gut-wrenching decision that will further prove why she was chosen to lead the newly evolved. Arie’s mother always told her to follow her heart, and with the dedication to keep her mother’s spirit alive, she would let love lead and trust that the rest would follow.Would love be enough to save the ones she protected? To save the balance of the worlds she relied on for support? Or would she lose it all because the price was too high?",
  "genres": [
    "Paranormal",
    "Fantasy"
  ],
  "author": "Dani Hart",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/23293085-dreams"
}