{
  "title": "Something for the Pain",
  "description": "Tempting, inked, and highly addictive. Alex is all that and more…I’ve made a lot of mistakes – ones I’m not proud of, and definitely ones that have left their marks both mentally and physically.Things got lonely; I got lost in my own fucked up mind and in the end, it left me fucked out of my mind and unable to fight – or at least win. That life’s over for me and I’ve moved on.Six months into tattooing at Ravage Tattoos and already I’m the most wanted and sought out tattooist. My biggest clientele consists of women. They come into the shop, end up in my bed and we both come out happy. It’s been my release since I’ve stopped fighting. It’s become part of the “new” me. But when Tripp reappears in my life, I can’t deny the fact that I would do anything for that girl.So when she asks me to move in with her and her ‘boyfriend’ – our other childhood friend – I never expected for things to get so fucked up and twisted that I would find myself only more attracted to her by each passing second or wanting to protect her from everything that isn’t me.I have worked so hard over the years to suppress my feelings for her but when I find out that she and Lucas have been having an open relationship, I have the strong urge to rip his heart straight from his chest – to destroy the very thing that keeps him breathing.What I didn’t expect was for Lucas to ask what he did. For him to ask me to do the one thing I have secretly longed for since I was old enough to know what the need was. The second thing I never expected was the look of need that I saw in Tripp’s eyes when he asked.One night of free passion could change our lives forever. I never said that was a good thing either...",
  "genres": [
    "Romance",
    "Friends To Lovers",
    "Contemporary Romance",
    "New Adult",
    "Contemporary",
    "Audiobook",
    "Erotica"
  ],
  "author": "Victoria Ashley",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/23290861-something-for-the-pain"
}