{
  "title": "A Portrait of the Artist as a Young Man / Dubliners",
  "description": "Widely regarded as the greatest stylist of twentieth-century English literature, James Joyce deserves the term “revolutionary.” His literary experiments in form and structure, language and content, signaled the modernist movement and continue to influence writers today. His two earliest, and perhaps most accessible, successes—A Portrait of the Artist as a Young Man and Dubliners—are here brought together in one volume. Both works reflect Joyce’s lifelong love-hate relationship with Dublin and the Irish culture that formed him.In the semi-autobiographical Portrait, young Stephen Dedalus yearns to be an artist, but first must struggle against the forces of church, school, and society, which fetter his imagination and stifle his soul. The book’s inventive style is apparent from its opening pages, a record of an infant’s impressions of the world around him—and one of the first examples of the “stream of consciousness” technique.Comprising fifteen stories, Dubliners presents a community of mesmerizing, humorous, and haunting characters—a group portrait. The interactions among them form one long meditation on the human condition, culminating with “The Dead,” one of Joyce’s most graceful compositions centering around a character’s epiphany. A carefully woven tapestry of Dublin life at the turn of the last century, Dubliners realizes Joyce’s ambition to give his countrymen “one good look at themselves.” Kevin J. H. Dettmar is Professor of English and Cultural Studies at Southern Illinois University Carbondale. He is the author or editor of a half-dozen books on James Joyce, modernist literature, and rock music. He is currently finishing a term as President of the Modernist Studies Association.--back cover",
  "genres": [
    "Classics",
    "Fiction",
    "Literature",
    "Short Stories",
    "Irish Literature",
    "Ireland",
    "Novels"
  ],
  "author": "James Joyce",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/23296.A_Portrait_of_the_Artist_as_a_Young_Man_Dubliners"
}