{
  "title": "Barefoot Kisses",
  "description": "Who meets their Prince Charming in an elevator on a day when nothing seems to go right?Lena Masterson was having a rough day.Her coffee pot exploded, her favorite heel broke on the way to work, her computer died, and her coworker sabotaged her performance review that she should have aced. To top it all off, she had to stay late to fix someone else's mistake. So when she literally ran into a handsome stranger at work, she was fairly certain that it might actually be the worst day of her life. Instead, it was the start of something wonderful.From the moment she nearly bowled the man over, she couldn't take her mind off of him. She didn't know anything about him, and could only assume that he was someone's assistant. Still, the encounter left her with new self-confidence. She made a move assertive enough to get the attention of her boss' boss, and be granted a new position as the personal paralegal of the head partner. This promotion soon led to an important trip to the Caribbean, where she saw a familiar face on the beach...Everything seemed perfect when she was in Aiden's arms (other than her missing shoe), but he was holding something back. Worse, Lena was keeping a secret from him as well. She knew that she couldn't keep up her little white lie forever, but it turned out that Aiden's secret was much bigger. Much much much bigger. A billion times bigger, in fact. Even though he treated her like Cinderella while away from real life, it was possible that the billionaire playboy just thought of her as one of his \"flavors of the week\". After saying goodbye with one last barefoot kiss and returning to the real world, there was a burning question on Lena's mind: Did this Prince Charming love her as much as she loved him?",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Fiction",
    "Chick Lit",
    "New Adult",
    "Amazon"
  ],
  "author": "Krista Lakes",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/23296611-barefoot-kisses"
}