{
  "title": "The Pragmatics of Early Modern Politics: Power and Kingship in Shakespeare's History Plays",
  "description": "Early modern kings adopted a new style of government, Realpolitik, as spelled out in Machiavelli's writings. Tudor monarchs, well aware of their questionable right to the throne, posed as great dissimulators, similarly to the modern prince who \"must learn from the fox and the lion\". This book paints a portrait of a successful politician according to early modern standards. Kingship is no longer understood as a divinely ordained institution, but is defined as goal-oriented policy-making, relying on conscious acting and the theatrical display of power. The volume offers an intriguing discussion on kingship in pragmatic terms, as the strategic face-saving behaviour of Shakespeare's kings. It also demonstrates how an efficient or inefficient management of the king's political face could decide his success or failure as a monarch, and how the Renaissance world of Shakespeare's history plays is combined with modern theories of communication, politeness and face.“Many studies in historical pragmatics or historical stylistics purport to expose language use in social context, but they fall short when measured against this study. The author approaches Shakespeare with concepts from literary studies and linguistic pragmatics, and weaves them together seamlessly with social history. The result is a treasure trove of insights.”– Jonathan Culpeper, Lancaster University“Exploring Machiavellian politics from the perspective of linguistic pragmatics and sociological role theory, Urszula Kizelbach’s study sheds interesting new light on Shakespeare’s stage kings. Her discussion of the strategic uses of polite speech is a particularly welcome addition to our thinking about Shakespeare’s English history plays. A promising new voice in European Shakespeare studies!”– Andreas Höfele, Munich University Contents:Part One: Power, Kingship and History in the English RenaissanceIntroduction: Critical Approaches to Power, Kingship and History in the English RenaissanceChapter One: Power, Politics and the Elizabethan World Picture in Early Modern EnglandChapter Two: The Renaissance Idea of KingshipChapter Three: Shakespeare and the Question of HistoryPart Two: Is This Kingship For Real? Being a King, Playing a KingIntroduction: Shakespeare’s Kings on Stage, and Queen Elizabeth’s Role Play in Real LifeChapter Four: “A Woeful Pageant Have We Here Beheld”: Actors on Stage in Richard III and Richard IIChapter Five: “I Am Richard II, Know Ye Not That?”: Queen Elizabeth I and Her Political RolePlayingPart Three: Power and Pragmatics in Action in Shakespeare’s HistoriesIntroduction: Pragmatic Strategies of Performing Kingship in the History PlaysChapter Six: The Theoretical Grounding of Politeness and ImpolitenessChapter Seven: “Charismas in Conflict” in Their Struggle for PowerChapter Eight: The Pragmatics of Politics and the Reformation of Prince Hal in 1 and 2 Henry IV and Henry V",
  "genres": [],
  "author": "Urszula Kizelbach",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/23295069-the-pragmatics-of-early-modern-politics"
}