{
  "title": "Of My Own Hand's Weaving",
  "description": "Romantic fiction at its very best! Set against the background of the Swinging Sixties it tells of a web of intrigue and a maelstrom of affections as Jeannie, the heroine, becomes involved with Col, a sensuous young Sicilian who is working in a classy hair salon in England.  Jeannie has been corrupted by all that's happened in the past. Now twenty seven, she's living in her friend Gretch's botched up attic conversion, and a right pair of weirdos they are. Sexy, money-grubbing Gretch, having escaped the misery of post-war Germany via dependable Frank, is stuck - for now - with a husband she despises and two kids. As for our heroine, Jeannie, well, she's done what had to be done to get, if not love or affection, at least men's attention. And she settles for that.  Until, that is, Colombo Borgia comes into her life. Col is a powerfully attractive and talented hairstylist with an unshakable belief in the importance of family, honour and fedeltà. Fidelity! In the Swinging Sixties? Gretch has hysterics but urges Jeannie to make use of Col's gorgeous body and practise 'sexual manoeuvres' after a long lay-off.  Maybe she's got the right idea for Jeannie finds Col's passion, and stamina, compelling. If his brother, back in Sicily, hadn't got word of their liaison, their affair might have continued indefinitely. Or Jeannie thinks it might. Instead, LeoLuca arrives and insists on meeting her.  LeoLuca – idolised by an adoring Mamma – demands, as of right, anything he wants. Especially anything belonging to his younger brother. Women – even, way back, Col's chosen teenage bride-to-be – have inconstantly fallen for the devil. One look, one quick intake of breath, and Jeannie knows why. The stink of depravity is familiar to her. And when he indecently gropes her, she watches four men struggle to drag Col away. Yet he follows LeoLuca back to Sicily. Who knows how men's warped minds work? But when Col returns, he's determined to marry his 'Gina'. What is left for him in Sicily? Seven years earlier, when his father had refused to disinherit his younger son, Papà had had to die. At Mamma's hand? LeoLuca's? Or some collusion of the conniving pair? Too late any which way, the will already signed and sealed. The witch, Maggalà, must be bribed with gold. A cut of Col's hair is snatched and his silk shirt, the pink silk shirt Jeannie loves so much they've been sharing it, week and week about. Does that mean she will become infected?  The plot thickens as Col falls ill and struggles to recover but recover he does and, when Mamma dies, he takes Jeannie, the wife he has secretly married, back to Sicily for the funeral, and to resolve the situation with his beguiling and bewitching brother by any means he can conjure up.  Col has knowledge of sorcery. As a boy, he'd helped the strega, Maggalà, and draws on the skills he'd learned. His step-by-step 'intervention' carries mortal risks to both he and Jeannie but – Thank God! – succeeds.  And Jeannie's conversion is absolute, she knows it will be. All you need is love.  Take a ‘Look Inside’ to find a compelling and absorbing love story with a difference. Filled with passion, action and bound by a wonderfully evocative narrative, this innovative piece of romantic fiction will delight and surprise in turns.",
  "genres": [],
  "author": "Mary Boscoletta",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/23298083-of-my-own-hand-s-weaving"
}