{
  "title": "A Nation Like No Other: Why American Exceptionalism Matters",
  "description": "It’s become fashionable among the liberal elite to downplay, deride, even deny America’s greatness. The political correctness police insist that America is “hated” around the world for being too big, too powerful, too rich, too successful, too loud, too intrusive. And besides, it’s not nice to brag.They are completely missing the point.America’s greatness, America’s exceptional greatness, is not based on that fact that we are the most powerful, most prosperous—and most generous—nation on earth. Rather, those things are the result of American Exceptionalism.To understand American Exceptionalism, as Newt Gingrich passionately argues in A Nation Like No Other , one must understand our unique birth as a nation. American Exceptionalism is found in the simple yet utterly remarkable principles expressed in the Declaration of Independence, “that all men are created equal, that we are endowed by our Creator with certain unalienable rights, that among these are life, liberty, the pursuit of happiness.”Our nation is exceptional, continues Newt, because we—unlike any nation before or since—are united by the belief and the promise that no king, no government, no ruling class has the power to infringe upon the rights of the individual. And when such a government attempts to do so, we will vigorously reject them.Sadly, many politicians and leaders today have forgotten our sacred commitment to these ideals. Our government has strayed alarmingly far from the scope of limited powers framed by our Founders. Meanwhile, the liberal media seek out, and sometimes create, stories intended to portray America as a bully and a thief. Even our own president seems clueless, assuring us that yes, yes, he believes in American exceptionalism, just like the Greeks believe in Greek exceptionalism and the British in British exceptionalism.But American Exceptionalism is not about cheerleading for the home team. It’s about recognizing and honoring the history-making, world-changing ideals our Founding Fathers enshrined to make this a nation of the people, by the people, for the people. And, as Lincoln warned, we must rededicate ourselves to those principles, lest our truly exceptional nation perish from this earth.",
  "genres": [
    "Politics",
    "Nonfiction"
  ],
  "author": "Newt Gingrich",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/11405725-a-nation-like-no-other"
}