{
  "title": "Ten Western Romance Books",
  "description": "Western Historical Romance in a Rugged, Wild Land  This Collection of some of the best historical romance novels Includes:  *10 Books, Full, Unabridged Text, written by bestselling authors  *Links to Four Free Full Length Audio Books of Books In This Collection  *Comes with a Clickable Linked Table of Contents for Easy Navigation  *Annotation Specially Created for this Collection, about the Daring Women, and the Rugged Men of the Western novel  Books Included in This Collection:  \"The Heart of the Desert\" by Honore Willsie Morrow (\"Kut-le of the Desert\") \"A Voice in the Wilderness\" by Grace Livingston Hill \"The Girl from Montana\" by Grace Livingston Hill \"Her Prairie Knight\" by B. M. Bower \"Riders of the Purple Sage\" by Zane Grey \"The Rainbow Trail, A Romance (The Desert Crucible)\" by Zane Grey \"The Border Legion\" by Zane Grey \"Wildfire\" by Zane Grey \"A Texas Ranger\" by William MacLeod Raine \"Letters of a Woman Homesteader\" by Elinore Pruitt Stewart  Book Descriptions:  In \"Heart of the Desert\", Rhoda is drawn to Kut-Le (Charlie Cartwell), a Native American, after he carries her when she is stung by a scorpion. Can she recover her health and overcome her own fears about falling in forbidden love?   In \"A Voice in the Wilderness\", Margaret mistakenly gets off a train at a water stop, and finds herself in the middle of desert in the dark. She faces dangers of both man and beast, and meets the charming Lance. A link to a free, full length audio book of this novel is included.  \"The Girl from Montana\": Alone in the mountains, Elizabeth runs from the man who may have shot her brother. He has Elizabeth in his sights-to be his woman.  \"Her Prairie Knight\": In this lighthearted romance, Beatrice must choose between an English nobleman or her handsome cowboy neighbor. It's a delightful read.  In \"Riders of the Purple Sage\" & the sequel \"The Rainbow Trail\" (aka \"The Desert Crucible\"), writer Zane Grey depicts gunman Lassiter, the role model for bold western characters. He is a complex man, with a reputation that would scare a less insightful woman than Jane Withersteen. Links to free, full length audio books of these novels are included.  In \"The Border Legion\" by Zane Grey, Joan regrets her quarrel with Jim. and sets out alone in the wilderness to track Jim, before he makes a fatal error. But will Jack, the leader of the outlaws, be the one to claim Joan's heart?  In \"Wildfire\", an incident with bold Lucy stealing a rude man's clothes (while he swims) leads to an adventure with a wild horse, a vengeful spurned man, and finding love with a hero.  In \"A Texas Ranger\", the heroine, desperate to help her brother, tries to steal horses at gunpoint. She chooses a man who turns the tables on her and steals kisses.  In this real life \"Letters from a Woman Homesteader\", Elinore delivers colorful and sometimes humorous descriptions of people and real life incidents. A link to a free, full length audio book of this book is included. Widowed Elinore travels to Denver, and then Wyoming, for work to support herself and her two-year-old daughter. She finds love and friends along the way. Elinore Pruitt Stewart's homestead is listed on the National Register of Historic Places. Her letters became the basis for the movie, \"Heartland\" and showed the important role women homesteaders played in the West.",
  "genres": [],
  "author": "Paula Sunsong",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/23298658-ten-western-romance-books"
}