{
  "title": "Blood & Iron",
  "description": "AMERICAN EMPIRE: BOOK ONETwice in the last century, brutal war erupted between the United States and the Confederacy. Then, after a generation of relative peace, The Great War exploded worldwide. As the conflict engulfed Europe, the C.S.A. backed the Allies, while the U.S. found its own ally in Imperial Germany. The Confederate States, France, and England all fell. Russia self-destructed, and the Japanese, seeing that the cause was lost, retired to fight another day.The Great War has ended, and an uneasy peace reigns around most of the world. But nowhere is the peace more fragile than on the continent of North America, where bitter enemies share a single landmass and two long, bloody borders.In the North, proud Canadian nationalists try to resist the colonial power of the United States. In the South, the once-mighty Confederate States have been pounded into poverty and merciless inflation. U.S. President Teddy Roosevelt refuses to return to pre-war borders. The scars of the past will not soon be healed. The time is right for madmen, demagogues, and terrorists.At this crucial moment in history, with Socialists rising to power in the U.S. under the leadership of presidential candidate Upton Sinclair, a dangerous fanatic is on the rise in the Confederacy, preaching a message of hate. And in Canada another man--a simple farmer--has a nefarious plan: to assassinate the greatest U.S. war hero, General George Armstrong Custer.With tension on the seas high, and an army of Marxist Negroes lurking in the swamplands of the Deep South, more than enough people are eager to return the world to war. Harry Turtledove sends his sprawling cast of men and women--wielding their own faiths, persuasions, and private demons--into the troubled times between the wars.From the Hardcover edition.",
  "genres": [
    "Alternate History",
    "Fiction",
    "Science Fiction",
    "Historical Fiction",
    "Fantasy",
    "War",
    "Science Fiction Fantasy"
  ],
  "author": "Harry Turtledove",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/101534.Blood_Iron"
}