{
  "title": "Virtually Impossible",
  "description": "Fairy tales aren’t real…but love is.Sara has a kick-ass life—loyal friends, a house in San Francisco, and an amazing job as a virtual assistant. It's perfect…except that Sara doesn’t actually exist. She’s just a borrowed name that Andi Clark hides behind. Using a fake identity lets Andi stay safely shielded behind the screen of her computer and concealed from the real world. With her history, pretending to be someone she’s not is the only way Andi can make up for the mistakes of her past. Not exactly ideal, but hey, no one’s life is perfect.Actually...Hayden Bennett’s life is pretty damn perfect. He’s married to a beautiful woman, lives in a luxury apartment, and is prepped to take over the multi-million dollar company his father built. Perfect...except that his wife is madly in love with someone else, his career is meaningless, and he’s forgotten how to live, let alone be happy. But when Hayden hires a new virtual assistant named Sara, her sharp wit and intelligence leaves him wanting something more. Something real. Something incredible.Two people need to wake up to understand how perfect they are...for each other. If they can't, any chance either of them have of finding a happily ever after will be virtually impossible. ***This highly-anticipated sequel to DARKER WATER is Hayden and Andi's story, and this is how their fairytale begins:Once upon a time there was a woman who made the mistake of trusting the wrong man. And that mistake led to another. And another and another, each more damaging than the last. But the woman was as ignorant of her mistakes as she was of the damage they caused. Until she was punished for them.Around the same time, but in a totally separate part of the city, lived a noble man and his beautiful wife. Though their castle was the envy of all, its empty halls echoed of loneliness and regret. For the man had lived his entire life asleep, and both of them remained silent of who they truly were and what they truly wanted.And then one day, the woman entered the man's life and forced him to awaken...",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "New Adult",
    "Friends To Lovers",
    "Adult",
    "Fiction"
  ],
  "author": "Lauren Stewart",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/23302092-virtually-impossible"
}