{
  "title": "Destroyed",
  "description": "Jade Moore was no stranger to the MC lifestyle. Growing up the daughter of the President of the Satan's Rebels, she knew all about family and loyalty. Her world slowly crumbles when she loses not only her parents, but her brother and best friend. Her uncle steps in and becomes the family she so desperately needs. But what happens when the only family you have left betrays everything you have ever known? Jade is drug into the Condemned Warrior world where she is imprisoned for four agonizing years. Beaten and brutalized, she wishes for death, but it never comes. Reaper inherited the MC from his brother, Halo, and will do whatever it takes to keep the club safe. Anything, including handing over his niece to the club's enemy. All he has to do is convince her brother, Tank, and best friend, Shadow, that she has run away. Easy. But what Reaper never expects is for Tank and Shadow to come home looking for answers years later and discovering the truth. Tank and Shadow return to their hometown to investigate missing funds. It's when they begin digging for the evidence, they discover a much darker secret that Reaper has been hiding. Enlisting the help of the club's Sergeant at Arms, Viper, they set out to rescue Jade and bring her home where she belongs. Viper's reputation is well known both inside and out of the MC. He is a cold-blooded killer, incapable of any feeling but hatred. His allegiance lies with Tank and the club. He will do whatever it takes to bring Jade home, even if it means crossing enemy lines to save her. What he doesn't expect is to fall for her. This book is intended for adults 18 and over due to graphic scenes involving sex, language, and violence. This novella is book one in the Satan's Rebels MC series.",
  "genres": [
    "Dark",
    "Abuse",
    "Romance",
    "Contemporary",
    "Motorcycle",
    "Dark Romance",
    "Contemporary Romance"
  ],
  "author": "Kira Johns",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/23300443-destroyed"
}