{
  "title": "Wanton Christmas Wishes",
  "description": "HIS TO COMMAND by bestselling author Monica Burns. Book 1 (Novella) Self-Made Men series. A Christmas Eve blizzard and one small act of discipline compromises Charlotte Clayworth, but she refuses John Fordyce's proposal. Now, years later, the Self-made Men decide to reunite the lovers for one more wanton Christmas wish.THE KISSING BOUGH by NYT & USA TODAY bestselling author Madelynne Ellis. Percy Gilling and Lord William Ricborough share a special bond and require a very particular woman to satisfy their needs. When they encounter Viola Marsh beneath the mistletoe, they know she's the perfect choice. Now all they need do is persuade her that some things are worth sacrificing ones reputation for.HAMISH by Samantha Kane. Book One of The 93rd Highlanders. During the Crimean War, injured Captain Hamish Fletcher is sent to the hospital in Scutari, where he finds his old friend and lover Dr. Phineus Harper treating the wounded. Finn can keep him at the hospital until Christmas. Will it be enough time to convince widowed nurse Edith Lambeth to grant both men their Christmas wishes?ALL A MISTRESS WANTS by Eliza Lloyd. Eloisa Larkin wishes for the one thing she can’t have—the love of the powerful Duke of Sterling. Being his mistress provides many luxuries but being hopelessly devoted to a man who loves another as left her feeling alone and the last thing she wants is to spend Christmastide with him and his family.LOVING MICHAEL by NYT & USA TODAY bestselling author, Kate Pearce. Since returning from the peninsular wars, Michael Waterstone has learned to live within restricted boundaries and taught himself not to yearn for what he can never have. Fortunately for him, ex-courtesan Angelique Delisle is no respecter of boundaries of any kind, and offers him a provocative Christmas wager that might change his life forever...A CHRISTMAS KISS by Jess Michaels. Tricked into spending time alone with the husband who made it clear he doesn't care about her, the Countess of Blackgrove, Amelia, has no idea how to react. But Stephen only wants seduction... and love.",
  "genres": [
    "Anthologies",
    "Historical",
    "Historical Romance",
    "Erotica",
    "Romance",
    "Christmas",
    "Short Stories"
  ],
  "author": "Monica Burns",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/23299963-wanton-christmas-wishes"
}