{
  "title": "Daddy's Sweetheart Parts 1-5: The Complete Collection",
  "description": "This is a collection, containing all five books in the Daddy’s Sweetheart series.  Amelia grew up in a mansion where she had to hide from her father, who blamed her for her mother's death. She grew up longing for attention and love. She wanted to prove to him that she was worth his love by being the perfect student.  After graduating from her boarding school, she returns home, hoping that he will be proud of her. He isn't. Instead, he kicks her out, giving her a week to leave.  Brian, his young business partner, was present to hear him throw her out. He decides that he should take her in. He wants to mold her into being the perfect wife … for him. Brian wants his own little girl.  This is a book about two people getting married not because they are in love, but because they are both in need. Brian needs a little girl who looks up to him and accepts him the way he is. Amelia needs a family to take interest in her.  Amelia isn't sure how to react when her husband insists that she have a nanny to care for her, or when he insists that she call him 'Daddy'.  As the story continues, we see two people who are not perfect, trying to believe that the other could really love them just the way they are. They suffer through ups and downs. Their own self doubts cause the other pain.  This book contains sexual activities which include age play, spankings as well as harsh punishments. If such things offends you, please, don't buy the book.  Note: The men in my books are never perfect, they make mistakes and learn from them. They also have feelings, and they have their pride. But they love their wives above all else. Their love for them grows every day.  The last name of this family is never mentioned, and it never will be. The reader is free to choose any famous early American family name that they would like. But it is important for the story that Brian is a member of the 'old boys club' and that his last name is a household word.  For Ages 18 and up.",
  "genres": [],
  "author": "Rachel Burns",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/23304020-daddy-s-sweetheart-parts-1-5"
}