{
  "title": "Ten Christmas Brides",
  "description": "Join ten New York Times, USA Today and National best-selling authors to celebrate the holiday season with a boxed set of stories brimming with emotion, holiday spirit and happy ever afters. From sweet to sexy, suspense to small town drama, travel from Belarus to Africa to the snowy Highlands of Scotland as Santa delivers our gift to you--love, laughter and happiness this Christmas! Recipe for Love by Ruth Cardello, New York Times and USA Today bestselling author. All Madison Andrade wants for Christmas is a place to hide and she finds it in the home of a lusty French chef. Richard D'Argenson's recipes are famous, but they lack one necessary ingredient--love. Must Love Santa by Nina Bruhns, New York Times and USA Today bestselling author. Detective Nick Palladin just needs to close one last case in Vice--going undercover as Santa--before getting his Christmas transfer to the K-9 Unit. But when a cute little fluffball and the knockout holding her leash stumble into the op and are attacked, Santa and his faithful dog come running to the rescue! An Almost Perfect Christmas by Donna Fasano, USA Today bestselling author. Aaron Chase is desperate to give his daughter a perfect Christmas and elicits the help of Pediatric Nurse Christy Cooper to do it. When Aaron's impish eight-year-old talks them into a make-believe wedding, can the magic of Christmas make the vows stick? Christmas Captive (The Decorah Security Series) by Rebecca York, New York Times and USA Today best-selling author. How did hard-driving businessman Jordan Campbell end up in a coma? And can nurse Hannah Andrews use her psychic talent to connect with him and trap his would-be killer? As she and Jordan work together, she knows she's putting her own life--and her heart--at risk. The Army Doctor's Honeymoon Baby (The Army Doctor's Series) by Helen Scott Taylor, Award-winning and National bestselling author. Army doctor, Blair Mackenzie, secretly loves his childhood friend, Lorna, and protects her in the African refugee camp where they work. Lorna depends on Blair--he's her best friend, the only man she's ever loved. She longs to admit her feelings but a family secret from their past prevents her. Kiss Me Santa by Patrice Wilton, National bestselling author. Widowed schoolteacher, Cindy Harris meets Brad Williams--posing as Santa--when she takes her young son to the mall. Imagine her surprise when he shows up as the hot-shot realtor selling her family home. Sparks fly between them. Can the magic of Christmas give them the best gift of all -- love? An Unusual Christmas by Mona Risk, Award-winning and National bestselling author. Running away from Christmas celebrations and the demons of her past, Dr. Jillian has dedicated her life to saving third-world children. In Belarus, a baby girl, four little boys, and a handsome doctor may teach her the true meaning of Christmas. A Cowboy for Christmas by Annie Jones, Award-winning and National bestselling author. A single mom who has pinned all her hopes on reviving a popular tourist dude ranch gets a Christmas surprise that may change everything when her son asks Santa for a new dad. And that very night a Christmas-skipping cowboy shows up at their door. The Christmas Honeymoon by Alicia Street, Award-winning and National bestselling author. Quiet librarian Serena always loved Christmas, until she was jilted before her December wedding. A year later, while trying to rekindle her tarnished holiday spirit, she meets Damien, handsome daredevil--and a total Scrooge. Their unlikely mutual attraction brings on a challenge that leads to one very romantic Christmas. She's Not You by Mimi Barbour, National bestselling author. Sick and widowed, running scared from a man who insists she belongs to him, Belle is forced to let the charmer down the hall help out. Not just for her sake, but it's Christmas, she's in trouble and her little girl has decided their sympathetic neighbor is her special hero.",
  "genres": [
    "Christmas",
    "Romance",
    "Anthologies",
    "Contemporary Romance",
    "Holiday",
    "Contemporary",
    "Amazon"
  ],
  "author": "Ruth Cardello",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/23303877-ten-christmas-brides"
}