{
  "title": "On My Knees",
  "description": "NATIONAL BESTSELLERJackson Steele and Sylvia Brooks continue to thrill in the second novel of a scintillating, emotionally charged trilogy that returns to the world of J. Kenner’s beloved Stark novels: Release Me, Claim Me, and Complete Me.  \nI never thought I’d lose control, but his desire took me right to the edge. \n   Powerful, ambitious, and devastatingly sexy, Jackson Steele was unlike any other man I’d ever known. He went after what he wanted with his whole mind, body, and soul—and I was the woman in his sights. One touch and I surrendered, one night together and I was undone.    Jackson and I had secrets, dark pieces of our pasts that threatened to swallow us both. We couldn’t outrun our demons, or the people trying to tear us apart. But in our passion we found salvation, and in each other’s arms we found release.    I was scared to trust Jackson fully, to finally let go. Yet no matter the dangers that lay ahead, I knew I was his—and now that we’ve laid claim, there’s no more holding back.   On My Knees is intended for mature audiences.Praise for On My Knees\n \n “Kenner brings sizzling heat and high-pitched emotional tension to this second installment of her Stark International trilogy . . . with a taut plotline and plenty of searing interludes.”—RT Book Reviews\n \n “Kenner once again grabs a hold of your thoughts and shakes the feels out of you. Secrets abound. Truths are exposed. Vulnerabilities are laid bare. . . . Basically, I’m floating in an ocean of Jackson Steele paradise. . . . [On My Knees] keeps you on the edge of pleasure and captures your interest with the threat of exposure.”—Obsessed with Myshelf  “[The] heat quotient is very high, with Jackson and Sylvia . . . burning up the pages. . . . This is something I’ve come to expect from J. Kenner and she never disappoints. If you’re looking for a very hot, sexy read with a suspenseful storyline that keeps you guessing to the last page, On My Knees is definitely one to give a try.”—Cocktails and Books  “Hot! Running the gamut from fast and wild to slow and tender, the love scenes were intense and wonderfully written. . . . This trilogy is just getting better and better as we learn more about Sylvia’s resiliency and Jackson’s caring side. . . . Readers will devour this book and be waiting on pins and needles . . . to find out how it all ends in the upcoming finale.”—Harlequin Junkie  “J. Kenner is on my automatic-purchase list and with very good reason. . . . [This book] sizzles with both sensuality and a complex plotline! . . . Pick up a copy of On My Knees as soon as possible!”—Plot Twist Reviews  “Fans of J. Kenner, you know that where there’s a really engaging story line there’s equally engaging heat and passion. There’s no shortage of that here. . . . It’s powerful, it’s sexy, it’s downright naughty at times and it’s hot.”—Diary of an Eager Reader  “A great read for any contemporary romance readers who like their plots with a side of steam and a big helping of secrets and suspense . . . If you enjoyed Damien and Nikki’s story you will definitely be a fan of this series.”—Reads All the BooksFrom the Trade Paperback edition.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "Contemporary",
    "BDSM",
    "Erotic Romance",
    "Adult"
  ],
  "author": "J. Kenner",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/23308148-on-my-knees"
}