{
  "title": "Ace's Redemption",
  "description": "Ace’s Redemption is the first standalone novel in the Devil’s Despair series. Although the main character of Ace was introduced during the Lights of Peril trilogy, you do not need to read that series in order to follow this one.   Cherry  Memories alone can ruin you. Fear has a paralyzing effect and love isn’t always enough to keep you safe.  Ace was the gateway to a freedom that I hadn’t known since I was fifteen. He offered his protection from the demons that haunted me; both living and dead.  Although I knew I wasn’t enough to keep him, this didn’t deter my hope that one day he’d love me for who I was, not the broken girl he tried so desperately to save.  In the end, the ghosts of my past found me. Their malevolence knew no bounds and I was forced to succumb to their will of darkness. Each threat given against those I loved made my escape impossible; choosing my life for theirs became my desolate absolution.  Inevitably, it was my own weakness and self-doubt that became my undoing.   Ace  Emotional ties are sometimes severed. Friendships don’t always endure their hardships, and love offered isn’t always returned.  I was in love once. For me, leaving her back in Ohio was the hardest thing I had to do. For her, moving on with her life that included her son and the man she loved was no less than she deserved; unconditional happiness.  My reasons to bring Cherry home to California were obvious. I needed help with my family and she needed help staying clean and convincing her parents that she was ready to give her son the life he deserved.  It was a perfect plan. However, the best laid plans often get lost amidst their good intentions.  Cherry fell in love with me, and in return my love for her acted as the catalyst to her destruction.    Authors Note: This novel contains material that is not suitable for individuals under the age of 18. Content includes: drug use, explicit language, violence, rape, and other scenarios with content that readers may find offensive. Please use caution when deciding on this book, as every reader has the right to understand the product before purchase.   Editorial Reviews:  “Love is a tricky thing, especially when you're putting someone else's heart before yours; and that was a brutal couple of moments between Ace and Rae. I may have even gotten a little bleary eyed a time or two.” – Lara, Mean Girls Luv Books  “Ace's Redemption has everything - you'll laugh, cry, cringe, get pissed and fall in love. – Jessica, Breathless Ink Book Blog  “This book twisted me up, chewed me up, and spit me out. I went from screaming, to sighing to crying and back again.” – Jordan, Not Another Damn Book Blog  “If you are in need of reading about sexy yet relatable characters, oh and hot sex, this is the book for you! It's not your typical story by far, it's so much more.” – Jessica, The Lovely Books Blog  “This book veered seamlessly from the Peril crew and into its own. The characters are loveable and relatable with every flaw they show.” – Dana, Madam Hooks Book Blog  “Their friendship is strong and tension is thick, but what needs to be said is finally laid on the table. It’s emotional, it’s gripping and it’s a bitter sweet moment.” Saavy, Let’s Misbehave Book Blog  “You will laugh. You will cry. You will be angry and yet you will fall in love.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Dark",
    "Abuse",
    "Erotica",
    "New Adult"
  ],
  "author": "A.C. Bextor",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/23307124-ace-s-redemption"
}