{
  "title": "Father's Blood",
  "description": "Forty years ago, the Helsban armies from the east ravaged the peaceful land of Kutteridge with unprecedented brutality. The young Crown Prince, Errick Wise, rose up to defend his land, taking charge of his father's army and driving the Helsban horde back across their border. With the help of a young sorceress called Grissam, who had experienced the Helsban brutality firsthand, he created a magickal boundary at the river separating Kutteridge from Helsbeth, ensuring that no Helsban would ever cross back into Kutteridge again. Errick became king, and spent the first decade of his reign repairing the land from the horrors of the war. Grissam toiled at the upkeep of the boundary; its maintenance dragged at her spirit and caused her untold weariness. Seeing her distress, Errick brought her to the castle's tower to live, where she could work at keeping up the boundary in peace. In time, Errick took a wife: Liania, daughter of the Terran of Dralith, and she bore him a son as every Kutterish queen has done for thousands of years. Errick passed the Bond of Kings (the magickal bond between King and Prince, called the Ba'ag Mandor in Elder Kutterish) to his infant son, and set Grissam in charge of his early education. For a long while, as Eathan grew to manhood learning from his father what he must know to be king, there was peace. Then on a red-dawning morning, Grissam cries to Eathan in shock and rage as she discovers her boundary has been violated. A wild, red-haired Helsban witch has somehow crossed the boundary, and is making her way directly to the Kutterish crown city of Mallowthorne. Is she a spy? An assassin? Had the Helsbans put off violence in favor of stealth? Eathan must set out to find and capture the Helsban intruder before she becomes a threat to his people -- or worse, to his father. As challenging as the copper-haired Helsban will prove to be, her presence in Eathan's live will soon become the least of his worries, for as he digs deeper into the history of that war with Helsbeth, it soon falls to Eathan to discover his father's only dark secret, and to remedy Errick's only real mistake -- for if he cannot set right his father's wrong, his entire kingdom will be forfeit.",
  "genres": [],
  "author": "Amanda Sebring",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/23303754-father-s-blood"
}