{
  "title": "This Sweet Escape",
  "description": "A dark, sexy, emotional love story from NYT and USA Today Bestselling author Jessie Evans writing as J. EvansCan you run far enough, fast enough, to escape a broken heart?SamanthaFor six months I’ve hidden my shameful secret behind my “good girl” image. Perfect grades, perfect smile, perfectly fractured family, with a stepbrother who swears he loves me, and a stepmom who buys me designer clothes—even a perfect boyfriend. I’m the only one who knows that Danny’s life has been anything but picture perfect. He’s always trusted me with his truth; I only want to escape mine. But now I know that’s impossible, and I have to get out before it’s too late. Reality has let me down for the last time. From here on out, I’m making my own reality, and taking Danny with me.DannySince we were kids, I’ve known Sam and I were meant to be. Her smile is the most beautiful thing I’ve ever seen, and her laughter is a mystery I want to spend the rest of my life solving. No one believed we would last for the long haul, but I never doubted it. Not until this summer, when Sam meets me at the airport, and says it’s time for a great adventure. As we hop a plane to New Zealand, I want to believe we’re just getting an early start on the world travel we’ve been planning, but deep down, I know something’s wrong. Sam is running from something bad, and the bad things always catch up with you, sooner or later.And when they do, they have a habit of tearing people who love each other apart.Please note: The reading order for the Wild Rush series is One Wild Night, followed by This Wicked Rush, One Perfect Love, This Sweet Escape, and One Beautiful Revenge. The last two books tell Danny and Sam’s complete story and can be read as stand alone companion books without reading the first three novels. WARNING: The Wild Rush series contains graphic sensuality, unconventional morality, and good people forced into making bad choices. Read at your own risk.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Amazon",
    "Friends To Lovers",
    "Dark",
    "College"
  ],
  "author": "J.  Evans",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/23305765-this-sweet-escape"
}