{
  "title": "Empress Theresa",
  "description": "There are a million romance, mystery, and modern angst novels, but there is only one book about a heroic teenage American girl winning against impossible odds and changing the world. Read five sample chapters here: http://www.empresstheresa.com/look_in... Judge for yourself! This one of a kind story is a great gift for a teenager. An 18 year old girl gets enormous power over the whole world. What will she do with it? DESCRIPTION: Theresa is honest, courageous, brilliant, loved by everybody ( even China wants her to take herself out of danger ), happily married, powerful but harmless, thoughtful of others' welfare not just her own, a believer in God, and an inspiration to the young and old. She attacks \"impossible\" problems with everything she's got and she never gives up. ____ \"Those who challenge Theresa Hartley's power are fools\" says the Israeli Prime Minister. \"She could destroy the world.\"____ \"Don't mess around with Empress Theresa!\" says her husband Steve. __ Empress Theresa is what some people would consider impossible, a book about a good girl, with no sex, foul language, or violence, but still giving the reader an action-filled fascinating story. THE BOOK'S INTRODUCTION FOLLOWS What would you do with limitless power? We know what many people in the world would do. History is full of examples. But the world lucks out. It’s Theresa who gets limitless power. Eighteen year old Theresa only wants a quiet life when she’s suddenly burdened with global responsibilities. She is challenged by a series of “impossible” problems. Especially tricky is the one that prompts her to complain, “What am I supposed to do, change the laws of physics? This is the most impossible problem yet.” Can you guess the solutions before reading what Theresa does? Write a book about a decent girl and some critics will say every character must have serious flaws. I might have made Theresa another kind of personality, a less desirable and troubled kind of girl which would satisfy certain critics, but then people would come at me with a noose complaining, “This was our only chance to see a super-powerful girl in action and you messed up. Why didn’t you give us a loveable, inspiring Theresa?” I did, but I didn’t overdo it. A girl as fine as Theresa can be found in any high school. You know one. Empress Theresa is a tribute to the common, decent human being who quietly builds the world but hasn’t gotten enough attention lately. Norman Boutin, BS, BSN, DMD",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Novels"
  ],
  "author": "Norman Boutin",
  "average_rating": "1.56",
  "url": "https://www.goodreads.com/book/show/23308436-empress-theresa"
}