{
  "title": "Six",
  "description": "* Kirkus Starred *Parker and his sister will do whatever it takes to find their father in this adventure packed with action and mystery from the author of The Ability and Mindscape.Parker and his family share a secret: they can, with the help of advanced technology, communicate between themselves through their thoughts.When Parker, his dad, and sister Emma move to New York three years after his mother's death, Parker is having a hard time. He misses London and his friends, his father is distracted with his new job, and Emma is looking out for him instead of the other way around. And then Parker's dad, on the cusp of a technological breakthrough, is kidnapped. Thanks to a message his dad sent via thoughts before the signal cut off, Parker is suddenly on a rescue mission. Now Parker and Emma, along with their friend Michael and Polly the pig, must find this person - the only link to their father; but the search asks more questions than it answers. But all the signs point to one thing: the company his dad works for is up to something big. Huge. A perfectly sinister project that threatens far more than Parker's family. A project called SIX.* Kirkus - Starred Review *Three kids, a pet pig and a helpful chauffeur must unravel a mystery of cosmic proportions.Twelve-year-old Parker is struggling with his family’s move from England to upstate New York. Parker has a new nemesis. His inventor father has mounting job stress. Only his 10-year-old sister, Emma, seems to be acclimating. With a specialized program for the deaf at their school, friends and a new pet pig, she is thrilled. Keeping secrets in the Banks family is difficult, thanks to his father’s invention, which allows each of them to hear one another’s thoughts—but Parker’s father is hiding something from his family that could change everything if it comes to light. When Parker and Emma’s father disappears, the two siblings enlist Michael, a fellow victim of bullying and an uber-wealthy computer genius, to help them find him. Unfortunately the only people willing to lend a hand are a conspiracy theorist and a patient at a psychiatric hospital. Creative details, likable characters—Brendan, Michael’s chauffeur, stands out especially—and an X-Files–worthy mystery keep the pages turning, but it is the supportive and loving Banks family that makes this story shine. A surprise ending will encourage readers to think beyond the text and grapple with some real-world dilemmas.Inventive, entertaining and thought-provoking. (Fantasy. 8-12)",
  "genres": [
    "Science Fiction",
    "Middle Grade",
    "Adventure",
    "Fiction",
    "Fantasy",
    "Mystery",
    "Childrens"
  ],
  "author": "M.M. Vaughan",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/23309632-six"
}