{
  "title": "Art Quilts of the Midwest",
  "description": "A milestone in perception occurred in 1971, when the Whitney Museum of American Art displayed quilts in a museum setting: Abstract Design in American Quilts bestowed institutional recognition of the artistry inherent in these humble textiles. In subsequent decades, quilting’s popularity exploded. Some who took up quilting created pieced quilts that honored traditional patterns, symmetry, and repetition. But others saw the potential for pushing beyond patchwork, giving birth to the art quilt. Today, adherents from both art and quilting backgrounds incorporate storytelling, digital images, nonfabric materials, asymmetry, and three dimensions—in short, anything goes in the world of art quilting, as long as the result is stitched, layered, and not primarily functional. As a writer covering textiles, art, and craft, Linzee Kull McCray wondered just how deeply fiber artists were influenced by their surroundings. Focusing on midwestern art quilters in particular, she put out a call for entries and nearly 100 artists responded; they were free to define those aspects of midwesterness that most affected their work. The artists selected for inclusion in this book embrace the Midwest’s climate, land, people, and culture, and if they don’t always embrace it wholeheartedly, then they use their art to react to it. The proof can be seen in the varied, powerful quilts in this energizing book. Enlivened by the Midwest’s landscapes and seasons, Sally Bowker paints her fabrics with acrylics, creating marks and meaning with layers of hand stitching and appliqued bits of fabric. Shin-hee Chin uses sketchlike stitching for its ability to penetrate fabric and create depth; living in the Midwest helps her stay balanced between eastern philosophy and western culture. The metals and mesh that Diane Núñez incorporates into her quilts connect to her days as a jeweler as well as to the topography of her home state of Michigan. Pat Owoc prepares papers with disperse dyes, then selects from as many as 150 to create her fabrics; her art-quilt series honors midwestern pioneers. Martha Warshaw photographs old fabrics, tweaks the images in Photoshop, and prints the results for her pieces, which connect her to the legacy of quilting in past generations. The Midwest has always had strong textile communities. Now the twenty artists featured in this beautifully illustrated book have created a new community of original art forms that bring new life to an old tradition. The Artists Marilyn Ampe, St. Paul, Minnesota Gail Baar, Buffalo Grove, Illinois Sally Bowker, Cornucopia, Wisconsin Peggy Brown, Nashville, Indiana Shelly Burge, Lincoln, Nebraska Shin-hee Chin, McPherson, Kansas Sandra Palmer Ciolino, Cincinnati, Ohio Jacquelyn Gering, Chicago, Illinois Kate Gorman, Westerville, Ohio Donna Katz, Chicago, Illinois Beth Markel, Rochester Hills, Michigan Diane Núñez, Southfield, Michigan Pat Owoc, St. Louis, Missouri BJ Parady, Batavia, Illinois Bonnie Peterson, Houghton, Michigan Luanne Rimel, St. Louis, Missouri Barbara Schneider, Woodstock, Illinois Susan Shie, Wooster, Ohio Martha Warshaw, Cincinnati, Ohio Erick Wolfmeyer, Iowa City, Iowa",
  "genres": [
    "Art"
  ],
  "author": "Linzee Kull McCray",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/23309912-art-quilts-of-the-midwest"
}