{
  "title": "Catch Your Death",
  "description": "**Your last chance to get the UK No.1 Bestseller in its original version. This version will no longer be available after Dec 12th 2011. A new version will be published by HarperCollins on Jan 5th 2012 in the UK only.**A secret conspiracy. A killer virus. A race to save the world.Imagine if Dan Brown, Steig Larsson and Michael Crichton sat down together to write a fast-paced medical conspiracy thriller set in the English countryside, featuring evil scientists, stone-cold killers, a deadly virus and a beautiful but vulnerable Harvard professor.That's CATCH YOUR DEATH, the No.1 UK Bestseller from Louise Voss and Mark Edwards, the writing team behind the smash hit thriller KILLING CUPID.Esteemed virologist Kate Maddox thought she was escaping to a new life. But before she can face the future she must deal with the ghosts of the past.20 years ago, Kate was a volunteer at a research unit in the English countryside where scientists experimented to find a cure for the common cold.That summer, Kate fell in love with a handsome young doctor, Stephen. But her stay at the unit ended in Stephen's tragic death and Kate fled to Boston and a new life at Harvard.Now, Kate is back in England and on the run again – this time, from her cruel husband – and trying to find a fresh start for her and her young son. But a chance encounter with Stephen’s twin brother, Paul, sets her on a terrifying path of discovery. What really happened at the Cold Research Unit two decades ago?As Kate and Paul travel across England in search of the answers, they are unaware they are being hunted. Pursued by both her estranged husband and a psychopathic killer who has an unhealthy obsession with his quarry, Kate must fight to solve the puzzles of the past – uncovering a sickening betrayal and a truth she never dreamed possible.CATCH YOUR DEATH is a fun, page-turning thriller that also asks serious questions about how much we can rely on the people we entrust with our lives.",
  "genres": [
    "Thriller",
    "Crime",
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Psychological Thriller",
    "Suspense"
  ],
  "author": "Louise Voss",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/11408100-catch-your-death"
}