{
  "title": "Backlands",
  "description": "In this Bonnie and Clyde story of love and betrayal, a band of outlaws fight for control of the brutal Brazilian outback.Set in the sparse frontier settlements of northeastern Brazil—a dry, forbidding, and wild region the size of Texas, known locally as the Sertao—Backlands tells the true story of a group of nomadic outlaws who reigned over the area from about 1922 until 1938. Taking from the rich, admired—and feared—by the poor, they were led by the famously charismatic bandit Lampiao. The gang maintained their influence by fighting off all the police and soldiers the region could muster.A one-eyed goat rancher who first set out to avenge his father's murder in a lawless land, Lampiao proved to be too good a leader, fighter, and strategist to ever return home again. By 1925 he commanded the biggest gang of outlaws in Brazil. Known to this day as a \"prince,\" Lampiao had everything: brains, money, power, charisma, and luck.&nbsp;Everything but love, until he met Maria Bonita.\"You teach me to make lace, and I'll teach you to make love\"—this was the song the bandits marched to, across the vast open reaches of their starkly beautiful backlands, and it was Maria Bonita who made it come true. She was stuck in a loveless marriage when she met Lampiao, but she rode off with him, becoming \"Queen of the Bandits.\" Together the couple—still celebrated folk heroes—would become the country's most wanted figures, protecting their extraordinary freedom through cunning.Victoria Shorr's stunning literary debut tells Maria's story, her narrative of the intense freedoms, terrors, and sorrows of this chosen life, the end of which is clear to her all along. With the federal government in Rio mobilizing against the bandits, Backlands describes the epic final days of Lampiao’s \"fatal month,\" July on the River of Disorder, as the gang struggles to summon their good star to save them one more time.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Brazil",
    "Historical",
    "Cultural"
  ],
  "author": "Victoria Shorr",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/23316512-backlands"
}