{
  "title": "Domesticated: Evolution in a Man-Made World",
  "description": "We would still be living at subsistence level as hunter-gatherers if not for domestication. It is no accident that the cradle of civilization--the Middle East--is where sheep, goats, pigs, cattle, and cats commenced their fatefully intimate association with humans.Before the agricultural revolution, there were perhaps 10 million humans on earth. Now there are more than 7 billion of us. Our domesticated species have also thrived, in stark contrast to their wild ancestors. In a human-constructed environment--or man-made world--it pays to be domesticated.Domestication is an evolutionary process first and foremost. What most distinguishes domesticated animals from their wild ancestors are genetic alterations resulting in tameness, the capacity to tolerate close human proximity. But selection for tameness often results in a host of seemingly unrelated by-products, including floppy ears, skeletal alterations, reduced aggression, increased sociality, and reduced brain size. It's a package deal known as the domestication syndrome.Elements of the domestication syndrome can be found in every domesticated species--not only cats, dogs, pigs, sheep, cattle, and horses but also more recent human creations, such as domesticated camels, reindeer, and laboratory rats. That domestication results in this suite of changes in such a wide variety of mammals is a fascinating evolutionary story, one that sheds much light on the evolutionary process in general.We humans, too, show signs of the domestication syndrome, which some believe was key to our evolutionary success. By this view, human evolution parallels the evolution of dogs from wolves in particular.A natural storyteller, Richard C. Francis weaves history, archaeology, and anthropology to create a fascinating narrative.",
  "genres": [
    "Nonfiction",
    "Science",
    "Animals",
    "History",
    "Evolution",
    "Biology",
    "Nature"
  ],
  "author": "Richard C. Francis",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/23316482-domesticated"
}