{
  "title": "Rising Strong: The Reckoning. The Rumble. The Revolution",
  "description": "Social scientist Brené Brown has ignited a global conversation on courage, vulnerability, shame, and worthiness. Her pioneering work uncovered a profound truth: Vulnerability—the willingness to show up and be seen with no guarantee of outcome—is the only path to more love, belonging, creativity, and joy. But living a brave life is not always easy: We are, inevitably, going to stumble and fall.It is the rise from falling that Brown takes as her subject in Rising Strong. As a grounded theory researcher, Brown has listened as a range of people—from leaders in Fortune 500 companies and the military to artists, couples in long-term relationships, teachers, and parents—shared their stories of being brave, falling, and getting back up. She asked herself, What do these people with strong and loving relationships, leaders nurturing creativity, artists pushing innovation, and clergy walking with people through faith and mystery have in common? The answer was clear: They recognize the power of emotion and they’re not afraid to lean in to discomfort.Walking into our stories of hurt can feel dangerous. But the process of regaining our footing in the midst of struggle is where our courage is tested and our values are forged. Our stories of struggle can be big ones, like the loss of a job or the end of a relationship, or smaller ones, like a conflict with a friend or colleague. Regardless of magnitude or circumstance, the rising strong process is the same: We reckon with our emotions and get curious about what we’re feeling; we rumble with our stories until we get to a place of truth; and we live this process, every day, until it becomes a practice and creates nothing short of a revolution in our lives. Rising strong after a fall is how we cultivate wholeheartedness. It’s the process, Brown writes, that teaches us the most about who we are.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Personal Development",
    "Audiobook",
    "Leadership",
    "Mental Health"
  ],
  "author": "Brené Brown",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/23317538-rising-strong"
}