{
  "title": "Dark Places of the Earth: The Voyage of the Slave Ship",
  "description": "Los Angeles Times Book Prize Finalist in HistoryA dramatic work of historical detection illuminating one of the most significant―and long forgotten―Supreme Court cases in American history. In 1820, a suspicious vessel was spotted lingering off the coast of northern Florida, the Spanish slave ship Antelope . Since the United States had outlawed its own participation in the international slave trade more than a decade before, the ship's almost 300 African captives were considered illegal cargo under American laws. But with slavery still a critical part of the American economy, it would eventually fall to the Supreme Court to determine whether or not they were slaves at all, and if so, what should be done with them. Bryant describes the captives' harrowing voyage through waters rife with pirates and governed by an array of international treaties. By the time the Antelope arrived in Savannah, Georgia, the puzzle of how to determine the captives' fates was inextricably knotted. Set against the backdrop of a city in the grip of both the financial panic of 1819 and the lingering effects of an outbreak of yellow fever, Dark Places of the Earth vividly recounts the eight-year legal conflict that followed, during which time the Antelope 's human cargo were mercilessly put to work on the plantations of Georgia, even as their freedom remained in limbo. When at long last the Supreme Court heard the case, Francis Scott Key, the legendary Georgetown lawyer and author of \"The Star Spangled Banner,\" represented the Antelope captives in an epic courtroom battle that identified the moral and legal implications of slavery for a generation. Four of the six justices who heard the case, including Chief Justice John Marshall, owned slaves. Despite this, Key insisted that \"by the law of nature all men are free,\" and that the captives should by natural law be given their freedom. This argument was rejected. The court failed Key, the captives, and decades of American history, siding with the rights of property over liberty and setting the course of American jurisprudence on these issues for the next thirty-five years. The institution of slavery was given new legal cover, and another brick was laid on the road to the Civil War. The stakes of the Antelope case hinged on nothing less than the central American conflict of the nineteenth century. Both disquieting and enlightening, Dark Places of the Earth restores the Antelope to its rightful place as one of the most tragic, influential, and unjustly forgotten episodes in American legal history. 8 pages of illustrations",
  "genres": [
    "History",
    "Nonfiction",
    "Audiobook",
    "True Crime",
    "Crime",
    "American History"
  ],
  "author": "Jonathan M. Bryant",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/23317726-dark-places-of-the-earth"
}