{
  "title": "The Long Shadow of the Little Giant: The Life, Work and Legacy of Tubby Hayes",
  "description": "Forty years have elapsed since the death of the British jazz legend Tubby Hayes and yet his story still continues to captivate. Beginning as a precociously talented teenage saxophonist, he took first the local and then the international jazz scene by storm, displaying gifts equal to the finest American jazzmen, appearing with none other than Duke Ellington and proving almost single-handedly that British jazz need not labour under an inferiority complex. Hayes' triumphs during the 1950s and 60s enabled still later generations of English musicians to take their music onto the world stage. However his story has rarely been accurately recorded. Distorted by the folklore surrounding his tragically early death, aged only 38, much of what has been written, broadcast and recounted about Hayes has added only confusion to our understanding of his short but brilliant life. In this book, award-winning saxophonist and writer Simon Spillett, widely regarded as the world's leading authority on Hayes and his work, painstakingly outlines a career which alternated professional success and personal downfall. Using credible eye-witness recollection, drawn from conversations with Hayes' family, partners, friends and musical colleagues, unique access to Hayes' own tape, photographic and personal archives, and extensive contemporary research material, Spillett has reconstructed the trajectory of his subject's life both candidly and respectfully. Hayes' meteoric musical rise from boy wonder to youthfully mature virtuoso, from saxophonist to multi-instrumentalist and composer is faithfully documented, as is his struggle for relevance as rock, pop and the avant-garde took over the musical landscape in the 1960s and, for the first time, the opaque world of his inconsistent and troubled personal life is recounted in full. His unsettled childhood, his battles with addiction and ill-health and his difficult personal relationships are all exposed, and the confused accounts of his final days are unravelled and made clear as never before. The Long Shadow of The Little Giant also traces Hayes' path through one of the most vibrant periods of history, beginning in the austerity of post-World War Two London, through the \"never had it so good\" 1950s, the \"Swinging Sixties\" and into the privations of the \"State of Emergency\" early Seventies, and outlines the cultural and musical developments of the times which underpinned the life of arguably the UK's finest ever jazz musician.",
  "genres": [],
  "author": "Simon Spillett",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/23332096-the-long-shadow-of-the-little-giant"
}