{
  "title": "The Work of Fire",
  "description": "Since the middle of the twentieth century, Maurice Blanchot has been an extraordinarily influential figure on the French literary and cultural scene. He is arguably the key figure after Sartre in exploring the relation between literature and philosophy. Blanchot early developed a distinctive, limpid firm of essay writing, and, apart from his fiction, his main work has appeared as collections of essays. His essays, in form and substance, unmistakably left their imprint on the work of the most inluential of French theorists. The writings of Barthes, Foucault, and Derrida, for example, are hardly imaginable without Blanchot, and, indeed, all three have generously paid tribute to him. Published in French in 1949, The Work of Fire is a collection of 22 essays originally issued as review essays in literary journals. Certain themes return again and the relation of literature and language to death; the sigificance of repetition; the historical, personal, and social function of literature; and perhaps most important, simply the question, What is at stake in the fact that something such as art or literature exists? Within each essay, Blanchot raises anew these central themes in the context of a particular work or a particular author. He has read, it appears, practically everything, and an essay on a given writer or work will bristle with apposite references to other authors and works. Among the authors discussed in The Work of Fire are Kafka, Mallarme, Holderlin, Baudelaire, Rimbaud, Sartre, Gide, Pascal, Valery, Hemingway, Henry Miller, and such lesser figures as Benjamin Constant and Jean Paulhan. The essays demonstrate Blanchot's ability to pose the most lucid questions about the essence of literature while saying something new and probing about the author or work in question.",
  "genres": [
    "Philosophy",
    "France",
    "Theory",
    "Nonfiction",
    "Literature",
    "20th Century",
    "Essays"
  ],
  "author": "Maurice Blanchot",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/233351.The_Work_of_Fire"
}