{
  "title": "Van Gogh and Money: The Myth of the Poor Artist",
  "description": "Van Gogh: a poor Artist? Van Gogh and Money focuses on Vincent’s financial situation. Known as the ultimate embodiment of the notion of the “poor artist”, Vincent was largely unable to sell his work during his lifetime. The letters between Vincent and his brother Theo tell of an eternal lack of money, and the difficulties this created when it came to practising his art. Paint, canvases and models were, as he discovered, not cheap. He was, however, more than happy to sacrifice his physical wellbeing in the interest of producing his masterpieces. Van Gogh and Money follows Vincent during two critical periods of his artistic career, his time spent in The Hague and Arles. At both stages, he was supported by his brother Theo, who sent him a monthly allowance that never seemed sufficient. This dependency on his brother caused Vincent immense guilt. From his letters we get a good insight into Vincent’s financial affairs, since the brothers’ correspondence often touched on the subject of money. This book presents a more nuanced view of Vincent as the impoverished artist, as Van Gogh was in fact in a rather fortunate position compared to many of his peers. Regardless of the actual amount of money he received from his brother, it becomes clear that Vincent was poor in the light of his ambition. By reading this publication, we hope that you will be able to better appreciate and understand Vincent’s work by shedding light on the man behind the iconic paintings. Van Gogh and Money combines enlightening quotations from archival material with an entertaining and easy-to-read format, staying clear of jargon. Van Gogh and Money is part of the series Secrets of Van Gogh (www.secretsofvangogh.com) Secrets of Van Gogh 1: The 1-Hour Van Gogh Book Secrets of Van Gogh 2: Van Gogh's Inner Struggle: Life, Work and Mental Illness Secrets of Van Gogh 3: Van Gogh Today - Short Stories Secrets of Van Gogh 4: Van Gogh and Love Secrets of Van Gogh 5: Van Gogh and Money",
  "genres": [],
  "author": "Liesbeth Heenk",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/23336748-van-gogh-and-money"
}