{
  "title": "The Fighting Series Box Set: BONUS: Fighting the Fall Prologue",
  "description": "New York Times, USA Today, and RONE Award winning author JB Salsbury brings you the first three books in her Fighting Series and the prologue to her new release, Fighting the Fall, in this limited addition box set.  FIGHTING FOR FLIGHT The only daughter of an infamous Las Vegas pimp, Raven Morretti grew up an outsider. Until she catches the eye of local celebrity, UFL playboy, Jonah Slade. Jonah trades in his bad-boy reputation and puts his heart on the line. But when her father contacts her, setting in motion the ugly truth of her destiny, Jonah must choose. In a high-stakes gamble where love and freedom hang in the balance, a war is waged where the price of losing is a fate worse than death.  FIGHTING TO FORGIVE Blake Daniels flies through life the way he burns through women: on his terms, no regrets. But when his training is compromised by injury, the stakes grow impossibly higher. Layla's through with men. Emotional abuse has left her insecure and terrified. Chased by shadows of the past, Blake and Layla know what they don't want, but their hearts have a different plan. As a web of lies and betrayal threatens to destroy them, they're forced to make a choice. Is love enough to heal even the deepest wounds?   FIGHTING TO FORGET Every fighter is drawn to the violence, but very few are drawn to the pain. Rex Carter lives behind a wall of indifference. The demons from his childhood act as an anesthetic, keeping him distant from emotional connections. Working in a Las Vegas bar isn't Georgia McIntyre's dream. But she hopes it'll be an end to the nightmare. She's lived his pain every single day, since the day he left. Changed by time, Rex doesn't remember the girl from his past. If only she could do the same.  BONUS: FIGHTING THE FALL Prologue Release date: November 4, 2014 The toughest fighters aren’t created in the octagon but are born of necessity. When life delivers blow after punishing blow, you fight back or get destroyed. Eve Dawson has had her fill of bad luck. But life isn’t finished with her, and when things can’t possibly get worse . . . they do. Stay on your feet. It’s Cameron Kyle’s motto. He takes on the position of CEO of the UFL, intent on hiding his biggest weakness in order to forge a path that leads him back into the octagon.The distraction of a sass-mouthed girl seventeen years his junior is the last thing he needs until a tragic accident shatters the firm foundation of his resolve and he realizes just how far he’s fallen.",
  "genres": [],
  "author": "J.B. Salsbury",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/23330098-the-fighting-series-box-set"
}