{
  "title": "Cruise Quarters - a Novel About Casinos and Cruise Ships",
  "description": "Product DescriptionCruise Quarters - A novel About Casinos and Cruise Ships is a fun, fast paced tale of working in the casino aboard a Regal Cruises cruise-ship. The crew of the Regal Star resemble a mini United Nations, hiring people from all over the world. But unlike the UN, Regal Cruise's employees present a united front above decks as they attend to their passenger's every need. Below decks though, that is a different story. Sarah Seldon is a croupier on the luxury liner. After many unhappy endings, and burnt out on shipboard romance, she is determined to forget about men and concentrate on becoming a casino manager. On land women face a dearth of GOOD men but on a ship giving up men would take willpower. The mostly male crew exists to serve her every need. Handsome Italian waiters bring her food, the Filipino steward cleans her room, English officers play poker with her and the Welsh plumber fixes her sink. She leads a cushy life, sleeping 'til noon, eating gourmet food, and the topper - she gets to wake up in beautiful new place everyday. All because she works in a casino, a place so bad it has SIN in the middle. After college she took a summer job at Lake Tahoe in the casino business and became a member of the Church of Gambling. She has been in the gambling business long enough to know that in order for a gambler to be successful, they must have Lady Luck on their side. But a gambler also has to follow the rules of basic strategy. When love unexpectedly sneaks up on Sarah on the magical island of Mayreau, she wonders whether she could apply the rules of gambling to love? What if she could write Sarah Seldon's Basic Strategy of Love?Book a cruise and travel with Sarah and the crew as they work, play, feast, and fall in and out of love, all while the ship sails around the globe, stopping at exotic ports of call. Along the way, from Venice to Barcelona sight-see in the Med, shop in St. Martin, take an eco-cruise down the Amazon, and feast in Glasgow. Let the crew tell you their own stories as they sit in the hallway in the wee hours of the morning. While the ship travels to new destinations, tired and tipsy they share tales of love and betrayal. When people sat down at Sarah Seldon’s blackjack game, they always wanted to talk about The Book. Excerpt from Cruise Quarters “Should I double down? Should I hit? Dealer, I know you’re a gambler; you could let me win if you wanted to. What does the book say?” She had never read this book, this mythical Bible for gamblers. The truth is there are 2256 books, each teaching its own foolproof winning system. But Sarah had been in the casino business long enough to think with a gambler’s mind. Gamblers knew they could follow all the rules of basic strategy, utilize money management and still lose if they weren’t dealt the right cards. The allure and curse of gambling was that there were no sure things. In the end it all came down to luck; gamblers prayed that Lady Luck would show up and that she would stick around for awhile. On that particular day, Sarah perched on a chair to get a better view through her salt-stained porthole onto the dock, filled with people busying themselves with the activities necessary to supply a huge cruise ship. Port activities in Hong Kong demonstrated a model of modern efficiency. Even though the ship had been docked for under an hour, already the crew had begun to perform the necessary safety checks. At the same time operators steered forklifts, moving wooden pallets filled with provisions into the hold. Like a patient hooked up to life support, long, fat hoses attached to the side of the ship fed water and gas into tanks, providing nutrients for the upcoming voyage. Based on a true story:On a summer break from her teaching job Cara took a summer job in Lake Tahoe and didn't leave for many years. Raymond was studying at City University in London when he saw an advert 'Train up To Be a Dealer, see the world'. He took that advice and worked as an inspector in casinos all over Europe, from Moscow to Greece. The couple met while working on a cruise ship in the Caribbean. Raymond jumped ship to be with Cara and they married after a whirlwind romance. Their knowledge offers a rare insiders look at casino operations. The couple also walked 500 miles across Spain, Their movie of the trip, Camino De Santiago - A Walker's Guide, is a popular guide to the Camino. You can find them at www.caminovideo.com or on Amazon.",
  "genres": [
    "Fiction"
  ],
  "author": "Cara Bertoia",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/11409033-cruise-quarters---a-novel-about-casinos-and-cruise-ships"
}