{
  "title": "Trudge",
  "description": "For Cade Grayson, husband, father, and former Delta Force operator, that one warm sunny Saturday in July - later to be labeled Z-Day by some anonymous person probably long dead - began like all the others before, and none since. With his daughter, Raven and wife, Brook, away visiting her parents in Myrtle Beach, South Carolina, Cade hopes his immediate future holds nothing but an easy chair, Mariners on the tube, and paring down a honey-do list a mile long. But those hopes were quickly dashed and his life forever changed when news broke of a clash in downtown Portland between soldiers from the Oregon National Guard and hundreds of anarchist protesters suddenly turned violent and, by one anchor's account, blood-thirsty and cannibalistic. As the first waves of injured bystanders, Guardsmen, and rioters arrived at hospitals in and around Portland, it became apparent that a deadly new disease had been unleashed on the population. Whether the virus was naturally occurring or an escaped lab experiment Cade hadn't a clue, and he wasn't especially concerned until he learned of its unprecedented virulence, unusual method of transference, and the fact that, according to the talking heads on the news, it brought the newly dead back to life, semi-mindless, and with an insatiable desire to feed on the flesh of the living. Armed with this new information and now seeing the bigger cities such as Washington D.C., New York, and Los Angeles rocked by the rapidly spreading scourge, Cade ignores the volley of contradictory edicts drawn up by the White House and set into motion by FEMA and DHS, dusts off his tools of war, and loads his truck with supplies. Unable to get ahold of Brook and Raven and unwilling to leave them at the mercy of some distant politician's inability to hold the nation together, he begins an impossible 3,000 mile journey across a reeling United States with presumably millions of infected in his path and only one acceptable outcome: find Brook and Raven alive-or die trying.",
  "genres": [
    "Zombies",
    "Horror",
    "Fiction",
    "Post Apocalyptic",
    "Apocalyptic",
    "Science Fiction",
    "Fantasy"
  ],
  "author": "Shawn Chesser",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/23338453-trudge"
}