{
  "title": "Spirit Warrior",
  "description": "Allie Whitewater was used to living between two worlds. She embraced both the Native American heritage of her father and the white heritage of her mother. She was happy with both and didn’t have the identity crisis many of her friends had growing up. Growing up on a large working ranch in Montana, she loved every aspect of the life that her twin had left behind. She had no desire to live town, or worse, a large city. She plans on spending the rest of her life on the ranch her father started, running it and making it even better than ever. All of that changes when she decides to take a little vacation to help out her best friend and sister of the heart, Indiana, return to her new home.Jacob Tucker enjoys building up the ranch he and his twin brother, Jonathan, had settled. Sure, there were dangers – rustlers, the harsh environment, Indians – but he wouldn’t trade it for anything in the world. He is happy with life in the Montana territory. He never thinks there could be something or someone out there that could make him change his mind. At least, not until he travels with his brother to rescue his brother’s new bride, Indiana, when she is kidnapped. His idea of life and the world changes when he leaves his ranch in 1867 to travel to 2013. The world has changed a lot and so have the women – namely one called Allie Whitewater. She has the mouth of a cowpuncher, the body of an angel, and the temper of the Devil himself. Now all he has to do is get her back to his time and hold her so tight she won’t miss her fancy metal wagons and flying birds.Jacob thinks his plan is fool-proof. He just needs to kidnap Allie long enough to make her never want to leave him to return to her world. But things change as tension between the red-skins and the white settlers and the army escalate. History won’t stand still for two souls separated by time. How can he hope to keep Allie safe when the whites see her as a red-skin savage and the Indians don’t know what to think of her?When the two cultures clash, it is up to Allie to show she is capable of walking in both worlds. She will prove to the whites that she is a force to be reckoned with and she will prove to her ancestors that she is a Spirit Warrior who will fight to the death to protect her hasáŋni, her mate.Can the past handle a modern woman’s view that the two cultures are really not that different when it comes to love and family or will it destroy the very thing that makes her the perfect partner for a man of the past – her warrior spirit?",
  "genres": [
    "Time Travel",
    "Romance",
    "Audiobook",
    "Paranormal",
    "Historical",
    "Fantasy",
    "Westerns"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/23340316-spirit-warrior"
}