{
  "title": "Buried Agendas",
  "description": "A devastating secret drove her from the man she loved. Will a deadly secret lead her back to him?Diana Reid is an investigative reporter skilled at uncovering other people’s secrets. It’s her own secret that she’ll go to great lengths to keep buried—a secret that drove her to leave her fiancé and hometown of Diamond, Texas eight years ago. All that’s about to change when she receives a letter stating people are dying, and implicating her hometown’s largest employer. With no other choice, Diana risks her life and her secrets by returning to Diamond, Texas to uncover the deadly plot. It took Brad Jordan years to put his life back together after Diana walked out on him. Leaving his brother in charge of the family business, Jordan Industries, Brad pursued a law degree and is now mayor of Diamond, Texas. Just as he rebuilt his life after Diana’s desertion, he plans to rebuild his hometown by bringing in new industry and businesses. Those plans are threatened, however, when an El Paso physician notifies Brad that his family’s company may be conducting illegal practices and sacrificing the public’s health. The doctor’s evidence is circumstantial at best, but just the hint of impropriety will shut down the company and bankrupt the town. Brad is further conflicted when the physician suggests bringing in Diana Reid to uncover the wrongdoing. Diana is the last person he wants to see professionally or personally, and he nixes the idea. Unfortunately, she shows up anyway. Torn between his family and his oath of office, and recognizing she may be Brad’s only option to get at the truth, he’ll join forces with the very woman he’s vowed to forget.Together, Diana and Brad face a dangerous adversary intent on keeping their deadly agenda buried.",
  "genres": [
    "Suspense",
    "Romantic Suspense",
    "Romance",
    "Fiction"
  ],
  "author": "Donnell Ann Bell",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/23340698-buried-agendas"
}