{
  "title": "Paths of Alir",
  "description": "The first two books in A Pattern of Shadow & Light introduce readers to the realm of Alorin and its magical Adept race, which is facing extinction. The race's tragic decline is the result of Malorin'athgul, powerful beings from the fringes of Chaos, whose presence in Alorin has caused a shift in the cosmic Balance. Fate bends to their will, and their will is set upon Alorin's destruction. Alone in understanding the threat they pose, Alorin's Fifth Vestal, Bjorn val Gelderan, has launched a desperate plan to stop them: a \"great game\" played upon the tapestry of mortal life. Now, in Paths of Alir, A Pattern of Shadow & Light Book 3, Bjorn's Players have taken the field: Along the lush Caladrian coast of Agasan...the truthreader Tanis d'Giverny returns to the place of his birth and finds mysterious and wonderful workings waiting for him. But the zanthyr Phaedor warns Tanis that ominous events lie ahead, and the lad soon begins to wonder if even his mother's magical lessons will be enough to keep him alive. In the dungeons of Tal'Shira...held prisoner by the Adept Inquisitor Taliah hal'Jaitar, Prince Trell val Lorian is facing a life of enslavement. Only two paths lie open before him: one means an eternity of torture fighting Taliah's attempts to break him; the other requires surrendering to her will. But can he really sacrifice everything he is to walk Taliah's path of twisted magic known as mor'alir? In the snow-bound Castle of Tyr'kharta...Prince Ean val Lorian must choose to save his brother Sebastian or his loyal men. But to choose his men means leaving Sebastian to an eternity of enslavement; while rescuing Sebastian means abandoning his friends, and his honor along with them. Either decision will test Ean's newfound skills as well as his conviction, for as the prince learns, once a man becomes a Player in the First Lord's game, not even death can give reprieve.",
  "genres": [
    "Fantasy",
    "Audiobook",
    "Epic Fantasy",
    "Science Fiction Fantasy",
    "Fiction",
    "High Fantasy",
    "Epic"
  ],
  "author": "Melissa McPhail",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/23338347-paths-of-alir"
}