{
  "title": "Sweet Madness",
  "description": "Seventeen-year-old Bridget Sullivan is alone in Fall River, a city that sees Irish immigrants as nothing more than a drunken drain on society. To make matters worse, she's taken employment with the city’s most peculiar and gossip-laden family—the Bordens. But Bridget can’t afford to be picky—the pay surpasses any other job Bridget could ever secure and she desperately needs the money to buy her little sister, Cara, passage to the states. It doesn’t hurt that the job location is also close to her beau, Liam. As she enters the disturbing inner workings of the Borden household, Bridget clings to these advantages. However, what seemed like a straightforward situation soon turns into one that is untenable. Of course Bridget has heard the gossip around town about the Bordens, but what she encounters is far more unsettling. The erratic, paranoid behavior of Mr. Borden, the fearful silence of his wife, and worse still…the nightly whisperings Bridget hears that seem to come from the walls themselves.The unexpected bright spot of the position is that Lizzie Borden is so friendly. At first, Bridget is surprised at how Lizzie seems to look out for her, how she takes a strong interest in Bridget’s life. Over time, a friendship grows between them. But when Mr. Borden’s behavior goes from paranoid to cruel, and the eerie occurrences in the house seem to be building momentum, Bridget makes the tough decision that she must leave the house—even if it means leaving behind Lizzie, her closest friend, alone with the madness. Something she swore she would not do.But when Bridget makes a horrifying discovery in the home, all that she thought she knew about the Bordens is called into question…including if Lizzie is dangerous. And the choice she must make about Lizzie’s character could mean Bridget’s life or death.SWEET MADNESS is a retelling of the infamous Borden murders from the point of view of Lizzie’s Irish maid, Bridget Sullivan.",
  "genres": [
    "Historical Fiction",
    "Young Adult",
    "Mystery",
    "Retellings",
    "Historical",
    "Fiction",
    "Horror"
  ],
  "author": "Trisha Leaver",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/23340891-sweet-madness"
}