{
  "title": "STORIES FROM THE LIFE OF JESUS, BY HIS MOTHER",
  "description": "When the young Virgin Mary is informed by an angel that she is pregnant with the very special baby Jesus, despite not even being married, she takes the news with great equanimity. Nine months later, when she’s struggling through a difficult labour in a stable with cows and donkeys breathing down her neck, the Blessed Virgin feels a lot less pacific. The birth of the baby Jesus changes all that though and Mary knows that she will love Him forever, no matter what the future brings. And the future does indeed bring a lot of heartache (and annoyance) into the life of the Mother of God. Having to deal with the complications of having a Divine Son is only part of the story for Mary. There are also some very eccentric relatives to be contended with and even miracles can sometimes have unexpected consequences. The roller-coaster life, the young mother is embarking on, swings her from the highs of the Nativity and the visit of the Three Kings, to the devastating heartbreak of the Crucifixion. Never a dull moment for this Blessed Virgin. All of the sadness and a lot of the fun also, that permeates the life story of Jesus and His Blessed Mother, is contained within the pages of this hilarious, but loving, account. You can never look at the Bible stories the same way again, after reading this highly original retelling of “The Greatest Story Ever Told”.  CHECK OUT THESE GREAT COMMENTS FROM REVIEWERS.   By  Cara J Alexander “When I first saw this book I confess to being somewhat surprise. To take on this subject the writer must either be very brave or completely daft!!!!!! Christopher in my opinion is certainly brave mixed with a very whacky sense of humour.” Robert “If you enjoy satire that is not caustic, realize nothing in life is as noble as we might wish it to be, and need a few laughs and chuckles, give the story a read.” Kitty Muse Book Reviews “True or not, these memories are in turn hilarious, tragic, and touching. And never once is there anything disrespectful written in these pages. This is what truly made me love this book.  I suspect that somewhere above, the heavenly hosts are laughing their haloes off from reading Mr Meade’s wonderful book.”",
  "genres": [],
  "author": "Christopher Antony Meade",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/23341779-stories-from-the-life-of-jesus-by-his-mother"
}