{
  "title": "Aster Wood and the Book of Leveling",
  "description": "After failing to locate the celebrated sorcerer Almara, Aster Wood has done the next best thing; he has found, and rescued, Almara’s daughter, Jade. Now, the two are traveling through the Maylin Fold together, still searching for the lost wizard. He is the one man who can answer their questions about why the planets within the Fold are dying, what it means for Earth, and how the evil can be stopped. But when they finally do find Almara, he’s in no state to be of any help to anyone. They must push on with him in tow and hope to find the little known Book of Leveling, an ancient tome said to hold the key to balancing the planets in the Fold. Little by little, tiny fragments of information leak from Almara’s fractured mind, and they draw closer and closer to their goal. Aster hopes that the discovery of the book will lead to not just the healing of worlds, but the healing of the people who inhabit them. Including the one person Aster has barely dared think of for the past eight years, his long-mad father. But a new enemy is waiting for them, watching every step that they take. The Corentin, a force of evil so great that few dare to pass along their knowledge of him, is examining their every move, playing with them like puppets on strings. And Jade. Aster thought he had saved her for good, that the release from her mountain prison would be enough to bring her back from the misery she had experienced for so many years. But her happiness is fading, and in her eyes Aster sees flashes of a malice so deep that it chills him to his core. Aster must make it to the book and wrench it from the clutches of the Corentin before it’s too late. Before his friend, and her old, mad father, are lost to his strange hold over them. And before he, himself, falls to the dark bed of madness the Corentin has waiting.",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Childrens"
  ],
  "author": "J.B. Cantwell",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/23344161-aster-wood-and-the-book-of-leveling"
}