{
  "title": "Haunting",
  "description": "Murder in the Vale- Michelle GywnnIn between folklore and evidence, a forbidden attraction develops as the handsome priest, Father Cai Sayer, and the jaded detective, Sheila Leeds, find themselves sucked into a forty-five year old murder mystery. Who killed Jameson Putnam and Philippa George in Llandaff Cathedral, and why?October Rust –Alicia SparksNew Orleans is full of things that go bump in the night, and the vampires are pretty much under control thanks to Canon Helaire and his brand of leadership. But Canon’s world is about to spiral around him, and all the things he’s feared the most are about to come to fruition.Sybil La Cour thinks Canon is the devil incarnate, and she has good reason to. In her past life, Canon was responsible for her death, and part of her soul will never rest until he pays.The Perfect Little Bite –Eryn BlackStepping through a mysterious red door, Anna has entered a sexual halloween celebration hosted by the mysterious Victor, who sees in her the love he had lost more than two hundred years ago. Before this night is over Anna will discover a new level to her sexual awareness submitting to Victors desires and offering him that perfect little bite.Dying to Live – Isobelle CateWhile in Manila on her study-aboard, Melissa Cullen is drawn to a headstone in the local cemetary--a simple military marker with the name James Parrish emblazoned across its face. As she studies it, she is confronted by a man who seems to be there for the same purpose as she is. A visit. But this stranger stirs curious feelings in her, and when he appears in Melissa's dreams, she knows she must find out more about him-- and James Parrish.To Love a Dragon –Jami BrumfeldHomicide Detective Charity Holiday comes across some interesting characters when she works on a murder case of a stripper. One of those characters happens to be her mate.Malick Pendragon isn’t thrilled when his mate, who happens to be a witch, walks into his life. The timing is completely wrong. What he doesn’t expect is her life to be threatened or that he’d have to save her or risk dying himself. Passion Flames – Katherine RhodesBelle Ptolemny, the youngest daughter of the Demon Slayer family, has been sent on a quest: to find what happened to the Book of Tahat Sheol. It is the one book that might help her family defeat a demon on the rise. Raphale Astor is the leader of a clan of Others, who hide in the shadows of the world. He is the one man who may be able to help Belle find her book, and she is completely enamored with him instantly. Now, if only he weren't a demon.The Hunt – Jaden SinclairThe time has come for the annual hunt, a time when males of the Pack are permitted to let loose and do what comes naturally to them-- mate. Bastian has been waiting a very long time for the one woman he’s wanted to come of age. Now that she has joined the hunt, there is nothing and no one to stop him from having her.Wolf Call – Sable Hunter & Ryan O’LearyRafe Kenyon is all man…and all wolf. He’s a shifter and a Texas good ole boy. And who would have thought the two would mix? But, it works for him. The only problem is: Rafe is alone, he has no mate. He loves women, he loves sex, but he can never get too involved. No one can know his secret. Until…it is a secret no more.Karoline Durand comes to town to study the wolf sightings in a place where no wolves are supposed to exist. She meets a sexy wolf of another sort when Rafe spots her in a club. Sparks fly as their sexual energy combusts like a volcanic explosion.But soon Karoline is not the only one hunting the wolf. Rumors fly and the woods are full of hunters – all intent on bagging Rafe. His world is closing in on him and soon he learns who he can trust and the true meaning of love and home.",
  "genres": [
    "Mystery",
    "Romance",
    "Paranormal Romance",
    "Paranormal"
  ],
  "author": "Sable Hunter",
  "average_rating": "4.90",
  "url": "https://www.goodreads.com/book/show/23344004-haunting"
}