{
  "title": "Eleven",
  "description": "UN projections show global population reaching 11 billion—and the world economy growing by 500%—by the end of this century. But can the planet accommodate an additional 3.7 billion people and a five-fold economic expansion given our current ecological footprint already exceeds Earth's biocapacity by 60%?This question will preoccupy humanity throughout this century. Our mission is daunting: Somehow, we must support 50% more people and raise billions out of poverty and reduce our ecological footprint to a sustainable level last found in 1976, when we were 4 billion. Clearly, humanity has to change direction. Yet every facet of our social-economic-political order—indeed the totality of the dominant global culture—trains us to maintain the status quo: perpetual material growth. ELEVEN considers how we got into this predicament and maps a way forward. It argues that solving this conundrum will require an ethical revolution, one that will wholly transform humankind, reshaping its inner life and external conditions. This process will result in the emergence of a new culture, a new agriculture, and ultimately a new human race. Current models cannot generate the level of change that is demanded. ELEVEN introduces a framework for global transformation: Only a dynamic, grassroots capacity-building process, involving individuals, communities, and institutions, in neighbourhoods and villages everywhere—linked together on a global scale—can make this transformation succeed. Making the world work for 11 billion people will be humanity’s greatest challenge. That we will unite to meet this ultimate challenge is neither a utopian vision, nor even a matter of choice. It is the next, inescapable stage in human evolution.ELEVEN is available from www.friesenpress.com/bookstore, most online booksellers, and select bookstores.",
  "genres": [
    "Nonfiction",
    "Science"
  ],
  "author": "Paul  Hanley",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/23343455-eleven"
}