{
  "title": "Tattered Angel",
  "description": "Prequel to The Cage Sessions seriesBefore rockstar Damien Cage rocked Annika's world...Before Jasmine Ryder was Jasmine Ryder...Before the decadent Friday night \"Cage Girl\" parties...There was the tragic story of Damien's first love Marcellina.Damien Cage gets whatever girl he wants. As frontman for Platinum-selling band Eon Sphinx, girls throw themselves at him night after night. Concert after concert.But Damien is tired of groupies. He yearns for a woman of substance who is on his level.While escaping screaming fans at an airport, Damien meets the one girl who rocks his world into a downward spiral of passion, turmoil, and vengeful wrath.Marcellina Montero has it all. Brains. Drive. And an ass that drives Damien wild. A former adult film star who's recovered from porn and heroin addiction, she now wants to be a serious actor. She even convinces Damien to fund the movie she's written.Nights of throbbing delight. Days of sunny bliss. Sex for breakfast, lunch, and dinner. Life is good.Too good.Because when Marcellina's troubled past comes barreling back, Damien Cage is forced to learn the toughest lesson of his life... and become a better man because of it. My books are the raw, unfiltered vision of a slightly schizophrenic, sex-obsessed, vodka-swilling \"living contradiction\" with profanity issues. They are often unrealistic ( FUN) depictions of what life would be like if erotic romance fantasies came true, so sometimes... gasp!... things happen that aren't \"realistic\". (You know, kind of like how dull boring everyday life is realistic. Seriously, do you want to read about that?) If you are offended by the excessive use of dirty words, crass descriptions, or crude stream-of-consciousness writing laced with potty-mouthed expressions and graphic descriptions of non-traditional carnal delight, then you need to RUN from my writing right now! Don't say you weren't warned. (Oh, and you'd better be over 18! Don't even think about buying my books if you aren't.)Approximate 21,000 words (a novella)This is a prequel to a five-book series. There IS a tragic cliffhanger ending. You have been warned.There is also a heavy emphasis on pansexuality, including graphic descriptions of sexual situations. Do not read if this offends you. Erotic romance, new adult, rock star, alpha male, tattoos, body piercings, transsexual, pansexual, sex positive, sexual freedom, heroin addiction.",
  "genres": [
    "Contemporary Romance"
  ],
  "author": "Skylar Cross",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/23344485-tattered-angel"
}