{
  "title": "A Chave de Salomão",
  "description": "O corpo de Frank Bellamy, o director de Tecnologia da CIA, é descoberto no CERN, em Genebra, na altura em que os cientistas procuram o bosão de Higgs, também conhecido por Partícula de Deus. Entre os dedos da vítima é encontrada uma mensagem incriminatória. A mensagem torna Tomás Noronha o principal suspeito do homicídio. Depressa o historiador português se vê na mira da CIA, que lança assassinos no seu encalço, e percebe que, se quiser sobreviver, terá de deslindar o crime e provar a sua inocência. Ou morrer a tentar.Começa assim uma busca que o conduzirá às mais surpreendentes descobertas científicas alguma vez feitas. Será que a alma existe? O que acontece quando morremos? O que é a realidade? Com esta empolgante aventura que arrasta o leitor para o perturbador mundo da consciência e da natureza mais profunda do real, José Rodrigues dos Santos volta a afirmar-se como o grande mestre do mistério. Apesar de uma obra de ficção, \"A Chave de Salomão\" usa informação científica genuína para desvendar as espantosas ligações entre a mente, a matéria e o enigma da existência. «Melhor do que Dan Brown.» Tros Nieuwsshow, Holanda Excerto: «A notícia deixou Tomás estupefacto, sem reacção, os olhos vidrados, a boca entreaberta. Já perdera o pai e sabia que um dia perderia a mãe, mas esperava que a coisa levasse mais tempo, fosse mais lenta, que os dias não passassem tão rápido, que o inevitável fosse infinitamente adiado, que a orfandade não o deixasse tão só tão depressa. \"Ela...\", balbuciou Tomás, tentando dizer a palavra terrível mas recusando-se a pronunciá-la, só a ideia da morte constituía uma punhalada que lhe era cravada no coração. \"Ela...\"Ouviu um suspiro resignado do outro lado. \"Está em coma e sobra-lhe pouco tempo.\"",
  "genres": [
    "Thriller",
    "Fiction",
    "Romance",
    "Portuguese Literature",
    "Portugal",
    "Mystery",
    "Mystery Thriller"
  ],
  "author": "José Rodrigues dos Santos",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/23346101-a-chave-de-salom-o"
}