{
  "title": "The Burning Man",
  "description": "No case is too curious for Arthur Bryant and John May, London’s most ingenious detectives. But with their beloved city engulfed in turmoil, they’ll have to work fast to hold a sinister killer’s feet to the fire.   In the week before Guy Fawkes Night, London’s peaceful streets break out in sudden unrest. Enraged by a scandal involving a corrupt financier accused of insider trading, demonstrators are rioting outside the Findersbury Private Bank, chanting, marching, and growing violent. But when someone hurls a Molotov cocktail at the bank’s front door, killing a homeless man on its steps, Bryant, May, and the rest of the Peculiar Crimes Unit is called in. Is this an act of protest gone terribly wrong? Or a devious, premeditated murder?   Their investigation heats up when a second victim is reported dead in similar fiery circumstances. May discovers the latest victim has ties to the troubled bank, and Bryant refuses to believe this is mere coincidence. As the riots grow more intense and the body count climbs, Bryant and May hunt for a killer who’s adopting incendiary methods of execution, on a snaking trail of clues with roots in London’s history of rebellion, anarchy, and harsh justice. Now, they’ll have to throw themselves in the line of fire before the entire investigation goes up in smoke.   Suspenseful, smart, and wickedly funny, Bryant & May and the Burning Man is a brilliantly crafted mystery from the beloved Christopher Fowler. Praise for Christopher Fowler’s ingenious novels featuring the Peculiar Crimes Unit  “A brilliant series.”—The Denver Post   “Fowler, like his crime-solvers, is deadpan, sly, and always unexpectedly inventive.”—Entertainment Weekly   “Mr. Fowler’s small but ardent American following deserves to get much larger. And The Invisible Code is a delightful introduction to his work. . . . The Invisible Code has immense charm, but its plotting will satisfy serious mystery fans. . . . Best of all are the two main characters, particularly Bryant, whose fine British stodginess is matched perfectly by the agility of his crime-solving mind.”—Janet Maslin, The New York Times, on The Invisible Code   “Picture a television series that is a rough mash-up of Law & Order, The X-Files, and Monty Python’s Flying Circus . . . and you have the Peculiar Crimes Unit. . . . These stories are witty, challenging, engrossing, informative and incredibly well-written.”—Bookreporter   “Spiced with a little screwball-comedy dialogue and a touch of the occult.”—The Washington Post, on The Memory of Blood   “May and Bryant make a stellar team.”—The Wall Street Journal   “Fowler reinvents and reinvigorates the traditional police procedural.”\n—The Boston Globe",
  "genres": [
    "Mystery",
    "Crime",
    "Fiction",
    "Mystery Thriller",
    "Audiobook",
    "British Literature",
    "Detective"
  ],
  "author": "Christopher Fowler",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/23346783-the-burning-man"
}