{
  "title": "The Loneliness of the Long-Distance Runner",
  "description": "Nine classic short stories portraying the isolation, criminality, morality, and rebellion of the working class from award-winning, bestselling author Alan Sillitoe The titular story follows the internal decisions and external oppressions of a seventeen-year-old inmate in a juvenile detention center who is known only by his surname, Smith. The wardens have given the boy a light workload because he shows talent as a runner. But if he wins the national long-distance running competition as everyone is counting on him to do, Smith will only vindicate the very system and society that has locked him up. “The Loneliness of the Long-Distance Runner” has long been considered a masterpiece on both the page and the silver screen. Adapted for film by Sillitoe himself in 1962, it became an instant classic of British New Wave cinema.    In “Uncle Ernest,” a middle-aged furniture upholsterer traumatized in World War II, now leads a lonely life. His wife has left him, his brothers have moved away, and the townsfolk treat him as if he were a ghost. When the old man finally finds companionship with two young girls whom he enjoys buying pastries for at a café, the local authorities find his behavior morally suspect. “Mr. Raynor the School Teacher” delves into a different kind of isolation—that of a voyeuristic teacher who fantasizes constantly about the women who work in a draper’s shop across the street. When his students distract him from his lustful daydreams, Mr. Raynor becomes violent.   The six stories that follow in this iconic collection continue to cement Alan Sillitoe’s reputation as one of Britain’s foremost storytellers, and a champion of the condemned, the oppressed, and the overlooked.   This ebook features an illustrated biography of Alan Sillitoe including rare images from the author’s estate.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Classics",
    "Literature",
    "Sports",
    "British Literature",
    "20th Century"
  ],
  "author": "Alan Sillitoe",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/233436.The_Loneliness_of_the_Long_Distance_Runner"
}