{
  "title": "The Feeling of Humanity",
  "description": "The Bible Belt has never been a good place to be out. In Greenbow, Alabama, a town only on the map for a fictional character and a town lost in a haze of Good Christian Family Values, it’s especially dangerous to fall in love, especially for the protagonist of The Feeling of Humanity, a radically passionate teenage rebel known as Ellis Hastings. She’s always been a girl who wears many hats over her partially shaved head. For some, she’s the fierce, fearless president of her school’s gay-straight alliance. To others, she’s the dyke trying to change the world, one protest at a time. But, to herself, Ellis is just the fucked up one with the dead girlfriend and the family of perfect people who don’t get it. For the past year, Ellis’s life has been a blur of GSA meetings, trans*formation nights, protests, fundraisers, and anything else she can use to keep her mind off Grace Win, a dance prodigy with the allure of a far away city on her lips, the girl she loved and lost Last March. That’s her life, putting on the mask of being Madame President to some and Public Enemy Number one to others while fighting for those without voices even though she can’t quite get a grip on her own. That is, until she meets Audrey Alton, who transferred not from a mystical city but a town just like Greenbow. Audrey is…complicated. She freaks out when Ellis smokes around her but can down four shots of whiskey with ease. Her dad’s in a wheelchair for reasons she doesn’t like to talk about and it’s her responsibility to care for him. Except she still gets out of bed every morning, puts on a floral dress and paints on her face to hide things. Audrey makes Ellis feel human again, like anything is possible and maybe someone finally understands what it’s like to be empty and awake. So, with the help of a colorful cast of characters, the two set out to change the world or, at the very least, the great state of Alabama.",
  "genres": [],
  "author": "Jani Berghuis",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/23349282-the-feeling-of-humanity"
}