{
  "title": "The War in South Africa: Its Causes and Effects",
  "description": "This prophetic book, first published in 1900, describes in clinical detail the lies, deception, underhanded maneuverings, false propaganda—and the ubiquitous Jewish lobby—which lay behind the outbreak of the Second Anglo-Boer War in 1889.Hobson’s book reveals the trail of lies in the build-up to that war. These included faked “atrocity” propaganda, faked allegations of Boer barbarity, corruption, maladministration, and the deliberate distortions and double-crossing in the “negotiations” which preceded the war.Hobson even shows how the lies also included fake stories of “Boer armament build-ups” which were portrayed as evidence of the “Boer threat” to British interests.He also spends time explaining how these allegations were spread across the English-speaking world. They were generated, he proves, in the newsrooms of the anti-Boer “newspapers” in Johannesburg, and sent by telex to London, from where they were fed into the major English language newspapers, conservative and liberal-aligned alike, where they were faithfully repeated without question.In this way, Hobson proves, an atmosphere of hatred against the Boer Republics was engendered, and the British public were incited into supporting armed intervention in a nation on another continent which posed no threat to Britain at all.Finally, Hobson reveals the true source behind the anti-Boer agitation and incitement to war: the powerful Jewish lobby in South Africa, who he openly calls the “Jew-Imperialists.”This Jewish lobby, Hobson shows, owned not only the mineral and trading wealth of the Transvaal Boer republic, but also the major media outlets in Johannesburg, which generated the false propaganda against Paul Kruger’s isolated and ultimately inoffensive state.“A few of the financial pioneers in South Africa have been Englishmen, like Messrs. Rhodes and Rudd; but recent developments of Transvaal gold-mining have thrown the economic resources of the country more and more into the hands of a small group of international financiers, chiefly German in origin and Jewish in race.Hobson also provides the casus belli why this Jewish lobby wanted the war: not to seize the mineral wealth of the Boer republic (they already owned that) but to ensure that its political masters were brought under control to ensure a steady cheap supply of black—and white—labor to toil in the dark mines.He is also biting about South Africa’s racial policies, pointing out that the reliance on non-white labor would ultimately cause the death of white rule in that country.This book, first published by MacMillan in New York and London as the Second Anglo-Boer war was already underway, was highly popular, but its open naming of the Jewish Randlords as the source of the lies and agitation raised an outcry from those so named, and the work quickly disappeared down the memory hole.This brand new edition has been completely reset and updated with annotations to inform present-day readers of all references to persons and events mentioned in the book. In addition, it also contains a new short history of the course of the Second Anglo-Boer War as a backgrounder.Finally, it contains a brand new introduction “South Africa 1899, Iraq 2003: The Awful Parallels” by Arthur Kemp, which details the Jewish lobby’s role in inciting the Iraq War, using forgery, lies, deception and mass media—following the exact pattern used in the run-up to the Boer War. Fully annotated.",
  "genres": [],
  "author": "J.A. Hobson",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/23349209-the-war-in-south-africa"
}