{
  "title": "Mr and Mrs Disraeli: A Strange Romance",
  "description": "Deep in the archives of the Bodleian Library lies a tattered scrap of paper with newlyweds’ scribbles on it. It is a table, listing the qualities of a couple. One column reads ‘Often says what he does not think’, ‘He does not show his feelings’, ‘He is a genius’; the other ‘Never says what she does not think', ‘She shows her feelings’, ‘She is a dunce’. The writing is Mary Anne Disraeli’s: the qualities listed contrast her with her husband, Benjamin Disraeli, one of the foremost politicians of the Victorian age.The daughter of a sailor, on her second marriage and 12 years older than her husband, Mary Anne was highly eccentric, liable to misbehave and (worse still) overdressed for grand society dinners. Her beloved Diz was of Jewish descent, a mid-ranking novelist and frequently mired in debt. He was fiercely protective and completely devoted to his wife. She was devoted to him, too, and they were both devoted to the very idea of being devoted. They wrote passionate letters to one another through their courtship and their marriage, spinning their unusual tale into a romance worthy of the novels they so loved.Reading between the lines of a great cache of their letters and the anecdotes of others in chilly Oxford reading rooms, Daisy Hay shows how the Disraelis rose to the top of the social and political pile. Along the way, we meet women of a similar station and situation whose endings were far unhappier than Mary Anne’s, acting as a counterpoint to her fairy tale ending as the landed Angel of the Prime Minister’s House.In an age where first ladies are under ever-increasing pressure to perform and conform, Mr and Mrs Disraeli offers a portrait of one who refused to do either, in a society which demanded she do both.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Victorian",
    "19th Century",
    "Biography Memoir",
    "British Literature"
  ],
  "author": "Daisy Hay",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/23350856-mr-and-mrs-disraeli"
}