{
  "title": "Just a Little Flirt",
  "description": "Saying yes has always come easy for Fallon. Now, as Renita Pizzitola’s steamy, poignant Crush series continues, winning her dream job means saying no to the guy she wants the most.\n   Between all the parties and random hook-ups, Fallon Carr is this close to flunking out of college. But her internship working with pediatric patients means the world to her—especially since, at the end of the summer, one lucky intern will be offered a paid position. Determined to leave her bad reputation behind, Fallon even takes a bet that she won’t sleep with anyone from work. But there’s one little catch. . . .   Not only is Cade Ryan the hottest guy Fallon has ever laid eyes on, he’s a therapy dog handler who volunteers his time to visit kids at the hospital. So when he starts pursuing her, Fallon can’t believe her bad timing. The thing is, Cade is different. He’s not like the college guys who see her as a one-night stand, or the high-school boyfriend who took a part of her she can never get back. Cade genuinely wants to spend time with her—and not just between the sheets.   Fallon won’t let her growing feelings for Cade get in the way of her dreams. Besides, no guy can break down the walls she put up long ago. So what’s the harm in a little flirting? It’s not like she’s falling in love. But she may have seriously underestimated how complicated things can get when the perfect guy falls for her first.Praise for Renita Pizzitola’s Just a Little Crush   “Brinley and Ryder are the perfect combination of sweet and hot. They’ll have you pulling for second chances.”—USA Today bestselling author Lisa Desrochers   “Be prepared to swoon hard over Ryder in Just a Little Crush, Renita Pizzitola’s impressive New Adult debut. Brinley and Ryder are drawn together in an almost hypnotic way and I couldn’t help but be mesmerized by the utterly sexy, sweet, romantic, and scorching moments between them. I loved it!”—Christina Lee, author of the Between Breaths series",
  "genres": [
    "Romance",
    "New Adult",
    "College",
    "Contemporary",
    "Contemporary Romance",
    "Young Adult",
    "Erotica"
  ],
  "author": "Renita Pizzitola",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/23350235-just-a-little-flirt"
}