{
  "title": "Shivers",
  "description": "Blood and Lilies: Once cast from Heaven, Zillah has vowed to destroy God and overtake his kingdom. But a key is needed to open the gates between the two realms. The Key to the gate walks the earth in the form of a woman: young, innocent and completely unaware of her importance in the battle between good and evil. Once her blood is shed, Zillah can open the portal to release her father: Lucifer himself. Cara, a college sophomore, is quickly thrown into the world of the supernatural, as well as learning of her true ancestry. Vampires, werewolves and the Nephilim are now a part of her reality. As the beings struggle to protect her, she fights to keep her sanity as her mortal realm is crushed. Secrets are revealed that could shatter Cara’s new found love, as well as lead to her ultimate death. A family is torn apart as the battle to save the key leads them down a road of betrayal and heartache. Loved ones are lost, lines are crossed, and nothing is as it seems. Lies and truths twist and turn, leaving us with only one question… Could you sacrifice the one you love to save the world? Demonically Yours: He was built for sin... I fell for a dark stranger, a painfully beautiful one. With his impressive physique and exotic accent, I couldn't keep him out of my dreams. But when those dreams turned to nightmares I started looking for answers. I'd asked the questions before, but I'd always been kept in the dark. Who Am I? Why Am I Different? I demand the truth, I have to know what my part in this war is before it's too late. And why the vision of this dark stranger captivates me. Lone Wolf Rising: Revenge has deadly consequences. Seventeen year old Rebecca Winters’ main goal for ten years has been to graduate high school and take down the people who killed her parents. When she stumbled upon a werewolf pack in the middle of Phoenix, she knew she’d found a way to make her dream come true. Instead of getting vengeance, an act of war has put her into a position of power and forces her to put her thirst for family justice on a temporary hold. He is duty bound to protect her. Lucian (Lucky) Lamont is a member of the Protectors, an elite supernatural police force who works for the Authority. Their main goal is to keep humans in the dark about the creatures who live among them. Lucky is assigned to protect and manage Rebecca, despite her refusal of help. His cover is simple; he poses as the dutiful ‘pretend’ boyfriend in order to keep an eye on the new alpha wolf. She is his mate. Gabriel Black thought taking his pack back from the witch who was chosen as the new alpha would be simple. He thought wrong. His entire world was turned upside down the moment he met Rebecca at the Authority Council meeting…and he was hooked the moment he had to prove she wasn’t dating his best friend, Lucky. But the heart wants what the heart wants. And the wolf gets what the wolf wants – or so her alpha believes. While Rebecca manages to keep her head above water as she unlocks political and family secrets which could destroy her, she loses sight of the most important people in her life and one of them pays the ultimate price. Love At First Bite: Jeremy is a handsome millionaire with a deep, dark secret. He has a hollow life until Sasha shows up, quite literally on his doorstep in the middle of the night. At first the recluse pushes her away and fears telling her his secret, but fate has other plans. Plans that could include being bitten by love and mated for life. When he realizes what he’s done in a moment of passion, he pushes her away and tries to save her from the biggest danger of all, himself. Sasha knows the mercurial man is nothing but trouble, but she's lured in like a moth to a flame. As he shows he's more than a hotheaded jerk, she can't help but fall for him. When all his secrets come to light, she realizes the danger is much worse than anything she could imagine. Things that go bump in the night aren't real, until you suddenly",
  "genres": [],
  "author": "Lyn Croft",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/23353070-shivers"
}