{
  "title": "An Interrupted Love Story",
  "description": "Joe has finally had enough. He’s leaving Liz, his girlfriend of almost three years. After this business trip he’s not coming back. He’ll visit his sister Sarah for a while.Danielle is getting really frustrated with her ex Pete, who simply won’t accept her reasons for ending their relationship. She wasn’t happy? Well, does she even know what makes her happy?Sarah is thrilled. Not only is a long-planned weekend reunion with her group of friends coming up, her brother Joe is unexpectedly going to be there for it. Now Sarah only has to break the news to Danielle (D), who would rather never see Joe again – no matter how over him she might claim to be.This is a (European) story about two people in their twenties who thought they were done with each other. And then they’re not… Three years after their breakup because of another girl, D and Joe are now forced to deal with each other again during a weekend reunion of their group of friends – whether they like it or not. This happens at a time when Joe thinks that all he needs is peace and quiet and time to recuperate from the relationship of hell he just walked out of, and where D has her hands (and her mind) full with things such as applying for a job in London and getting some distance between herself and a clingy ex-boyfriend. Seeing each other again, turns out to have quite an impact. And even if that impact is neither welcome nor desired, it is still impossible to ignore.So, while Sarah, Joe’s sister and D’s best friend, is having a worried eye on the two, afraid she’ll get caught between the frontlines once again, Joe and D are already heading for an emotional roller-coaster ride – torn between feelings some of which they don’t even want to admit to themselves and well-aware that they better not spoil the weekend for all their friends by not getting along.This book is not just about two people trying to come to terms with how they (still) feel about each other, it’s also about the troubles of breaking up, about friends who are there when you need them and about the complex relationship between brothers and sisters. -For everyone who has outgrown young adult by a few years but still likes a good, realistic story (that’s not only a love story) about people like you and I.",
  "genres": [
    "Romance",
    "Love Story",
    "Young Adult",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Billy Wood-Smith",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/23352002-an-interrupted-love-story"
}