{
  "title": "Beggars Ride",
  "description": "Nancy Kress, one of the leading writers of science fiction today, has written a number of provocative and award-winning stories and novels. But it is with the Beggars trilogy that she has reached the pinnacle of her success. Developed out of her Hugo and Nebula Award-winning novella, \"Beggars in Spain,\" the trilogy was launched with Beggars in Spain (1993), also a Nebula nominee for best novel, and continued in Beggars and Choosers (1995). Both received widespread praise and unusual enthusiasm. Locus , for instance, referred to \"the joy of reading a work of SF so intelligent, humane, involving, utterly genuine...magnificent,\" and went on to say, \"It is Kress's brilliant achievement in Beggars and Choosers , that scientific progress and human idealism, the driving forces behind some of the best hard SF...,never leave behind the passionate muddle that is life....\"Now the trilogy is completed in Beggars Ride, a compelling novel of science fiction that raises one of the most ambitious and large-scale works of the decade to the status of finished masterpiece. Kress, a writer who had been appropriately compared to H.G. Wells and Aldous Huxley, deals with evolutionary forces, genetic engineering, technological progress, and social and class conflict, confronting enduring issues that face human society in this century and the next.The Sleepless and the SuperSleepless, two generations of genetically modified superhumans, are now in conflict with each other, and with the spectrum of normal humanity, whose radical division into the rich and poor has made a parody of democracy in the twenty-second century. Human civilization has been transformed. Now it may be destroyed. And if it falls, what kind of world is left, what kind of humanity?Nancy Kress has written a work of fiction that culminates and brings to new fruition the Wellsian strain of SF invented a century ago.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Speculative Fiction",
    "Science Fiction Fantasy",
    "Audiobook",
    "Dystopia",
    "Fantasy"
  ],
  "author": "Nancy Kress",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/1141192.Beggars_Ride"
}