{
  "title": "The Valkyrie Mandate",
  "description": "The Valkyrie Mandate tells a gripping, unforgettable story of peace and war, love and hate...and one man's struggle to defend what he knows in his heart to be right.  First time available as an ebook Nominated for the Pulitzer Prize for Fiction. Denounced as \"...a damned lie...\" by Henry Cabot Lodge  Late Summer, 1963. Saigon. Just behind the barricades that safeguard the Presidential Palace, five Buddhist monks commit suicide by setting fire to themselves. Moments later, an anonymous assassin slips inside the palace walls. That same night, Colonel Doung, Commander of the Special Police, leads a convoy into Hoa Ginh, where he sets the village and its sacred Buddhist shrine ablaze and declares martial law.  A few days later, a general dispatched by Washington summons Colonel Justin Barclay for a covert assignment: To negotiate and carry out a political coup that could have critical, far-reaching consequences for both Occupied Vietnam and the United States… An American who has lived in the East for over ten years, Justin Barclay holds an exalted position of respect and honor among the Asian community. He alone understands the complexities—and subtleties—of their culture. Now he is a man caught in the middle of a deadly conspiracy that will force him to choose—and to act. For in this fabled, exotic land where no one can be trusted, and where a people will die to preserve their way of life, a diabolical game of cat and mouse is about to be played out on a world stage.  The target is in place. A single act of act of violence stands between peace and war, freedom and oppression. With his own life—and the life of Doung’s beautiful, brutalized wife at risk— Barclay races to stop a deadly plot from igniting…and bringing down the free world in flames. And when it’s over, no one and nothing will be the same",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Robert Vaughan",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/23358543-the-valkyrie-mandate"
}