{
  "title": "Living in the Crosshairs: The Untold Stories of Anti-Abortion Terrorism",
  "description": "Abortion is a legal, common, and safe medical procedure that one in three American women will undergo. Yet ever since Roe v. Wade was decided in 1973, anti-abortion forces have tried nearly every tactic to eliminate it. Legislative and judicial developments dominate the news, but a troubling and all-too-common phenomenon-targeted vigilante action against individual abortion providers-is missing from the national discussion, only cropping up when a dramatic story like the murder of an abortion provider pushes it to the forefront. Every day, men and women who are associated with abortion care are harassed, threatened, stalked, picketed, sent hate mail, and otherwise terrorized. Those who seek help from the law are sometimes successful, but not always, either because there are insufficient protections built into the law, or because law enforcement officials fail to respond.In Living in the Crosshairs , the voices of these providers are heard for the first time, through extensive interviews that David S. Cohen and Krysten Connon conducted across the country. Abortion providers are targeted at home, at work, or in community spaces; they can be harassed in person or online. Abortion opponents target not only the providers themselves but also may go after their families, neighbors, and others close to them. This kind of targeting happens anywhere in the country, not just in more conservative areas, and can victimize all providers, not just high-profile doctors. For some, being the victim of targeted harassment inspires significant fear and leads to changes in behavior; for others, it has become a normal part of life; and for yet others, it actively strengthens their resolve. The response of law enforcement at the federal, state, and local levels is spotty-though there are some strong laws on the books, especially at the federal level, abortion providers havehad mixed experiences when it comes to legal recourse, and effectiveness varies. Drawing on ideas from the interviews, the authors propose several legal and societal reforms that could improve the lives of providers, foremost among them redefining targeted harassment as terrorism rather than protest.Living in the Crosshairs is a rich and humane portrait of women's health professionals who persist in their work despite harassment because they believe in what they are doing. These providers' voices have not been heard in recent debates, leaving the public with a deficient understanding of exactly how abortion is limited in this country, yet their experiences illuminate the truth of the issue and offer us a path to a better policy.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Politics",
    "History",
    "Womens",
    "True Crime",
    "Terrorism"
  ],
  "author": "David S.   Cohen",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/23363159-living-in-the-crosshairs"
}