{
  "title": "Einstein: His Space and Times",
  "description": "From the prizewinning Jewish Lives series, a revealing new portrait of Albert Einstein, the world’s first scientific “superstar”“With graceful lucidity, Gimbel illuminates the intensely personal challenges facing the great physicist.”— Booklist , Starred ReviewThe commonly held view of Albert Einstein is of an eccentric genius for whom the pursuit of science was everything. But in actuality, the brilliant innovator whose Theory of Relativity forever reshaped our understanding of time was a man of his times, always politically engaged and driven by strong moral principles. An avowed pacifist, Einstein’s mistrust of authority and outspoken social and scientific views earned him death threats from Nazi sympathizers in the years preceding World War II. To him, science provided not only a means for understanding the behavior of the universe, but a foundation for considering the deeper questions of life and a way for the worldwide Jewish community to gain confidence and pride in itself. Steven Gimbel’s biography presents Einstein in the context of the world he lived in, offering a fascinating portrait of a remarkable individual who remained actively engaged in international affairs throughout his life. This revealing work not only explains Einstein’s theories in understandable terms, it demonstrates how they directly emerged from the realities of his times and helped create the world we live in today.About Jewish  Jewish Lives is a prizewinning series of interpretative biography designed to explore the many facets of Jewish identity. Individual volumes illuminate the imprint of Jewish figures upon literature, religion, philosophy, politics, cultural and economic life, and the arts and sciences. Subjects are paired with authors to elicit lively, deeply informed books that explore the range and depth of the Jewish experience from antiquity to the present.In 2014, the Jewish Book Council named Jewish Lives the winner of its Jewish Book of the Year Award, the first series ever to receive this award.More praise for Jewish \"Excellent\" –New York Times\"Exemplary\" –Wall Street Journal\"Distinguished\" –New Yorker\"Superb\" –The Guardian",
  "genres": [
    "Biography",
    "Science",
    "Judaism",
    "Nonfiction",
    "History",
    "Physics",
    "Philosophy"
  ],
  "author": "Steven Gimbel",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/23360175-einstein"
}