{
  "title": "The Age of Earthquakes: A Guide to the Extreme Present",
  "description": "A highly provocative, mindbending, beautifully designed, and visionary look at the landscape of our rapidly evolving digital era.50 years after Marshall McLuhan's ground breaking book on the influence of technology on culture in The Medium is the Message, Basar, Coupland and Obrist extend the analysis to today, touring the world that’s redefined by the Internet, decoding and explaining what they call the 'extreme present'.   THE AGE OF EARTHQUAKES is a quick-fire paperback, harnessing the images, language and perceptions of our unfurling digital lives. The authors offer five characteristics of the Extreme Present (see below); invent a glossary of new words to describe how we are truly feeling today; and ‘mindsource’ images and illustrations from over 30 contemporary artists. Wayne Daly’s striking graphic design  imports  the  surreal,  juxtaposed,  mashed  mannerisms  of screen to page. It’s like a culturally prescient, all-knowing email to the reader: possibly the best email they will ever read.   Welcome to THE AGE OF EARTHQUAKES, a paper portrait of Now, where the Internet hasn’t just changed the structure of our brains these past few years, it’s also changing the structure of the planet. This is a new history of the world that fits perfectly in your back pocket. 30+  artists  contributions: With  contributions  from  Farah Al Qasimi, Ed Atkins, Alessandro Bavo, Gabriele Basilico, Josh Bitelli, James Bridle, Cao Fei, Alex Mackin Dolan, Thomas Dozol, Constant Dullaart, Cecile B Evans, Rami Farook, Hans-Peter Feldmann, GCC, K-Hole, Liam Gillick, Dominique Gonzalez-Foerster, Eloise Hawser, Camille Henrot, Hu Fang, K-Hole, Koo Jeong-A, Katja Novitskova, Lara Ogel, Trevor Paglen, Yuri Patterson, Jon Rafman, Bunny Rogers, Bogosi Sekhukhuni, Taryn Simon, Hito Steyerl, Michael Stipe, Rosemarie Trockel, Amalia Ulman, David Weir, Trevor Yeung.",
  "genres": [
    "Nonfiction",
    "Technology",
    "Philosophy",
    "Art",
    "Essays",
    "Design",
    "Science"
  ],
  "author": "Douglas Coupland",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/23359966-the-age-of-earthquakes"
}