{
  "title": "The Wes Anderson Collection: The Grand Budapest Hotel",
  "description": "This book, part of the New York Times bestselling The Wes Anderson Collection series, takes readers behind the scenes of the Oscar®-winning film The Grand Budapest Hotel with a series of interviews between writer/director Wes Anderson and movie/television critic Matt Zoller Seitz.Introduction by award-winning playwright Anne WashburnLearn all about the film’s conception, hear personal anecdotes from the set, and explore the wide variety of sources that inspired the screenplay and imagery—from author Stefan Zweig to filmmaker Ernst Lubitsch to photochrom landscapes of turn-of-the-century Middle Europe. Also inside are interviews with costume designer Milena Canonero, composer Alexandre Desplat, lead actor Ralph Fiennes, production designer Adam Stockhausen, and cinematographer Robert Yeoman; essays by film critics Ali Arikan and Steven Boone, film theorist and historian David Bordwell, music critic Olivia Collette, and style and costume consultant Christopher Laverty; and an introduction by playwright Anne Washburn. Previously unpublished production photos, artwork, and ephemera illustrate each essay and interview.The Wes Anderson The Grand Budapest Hotel stays true to Seitz’s previous book on Anderson’s first seven feature films, The Wes Anderson Collection , with an artful, meticulous design and playful, original illustrations that capture the spirit of Anderson’s inimitable aesthetic, offering an overview of Anderson’s filmography.Praise for The Wes Anderson Collection :“ The Wes Anderson Collection comes as close as a book can to reading like a Wes Anderson film. The design is meticulously crafted, with gorgeous full-page photos and touches.”— The A.V. ClubAlso available from Matt Zoller The Wes Anderson CollectionThe Wes Anderson Bad DadsThe Oliver Stone ExperienceMad Men CarouselAlso The Wes Anderson Isle of DogsThe Wes Anderson The French Dispatch",
  "genres": [
    "Nonfiction",
    "Film",
    "Art",
    "Design",
    "Media Tie In",
    "Photography",
    "Pop Culture"
  ],
  "author": "Matt Zoller Seitz",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/23359622-the-wes-anderson-collection"
}