{
  "title": "First Blood",
  "description": "Four all-new stories of forbidden passion and dark desire.Susan Sizemore - Cave Canem (Laws Of The Blood #5.5)When hellhound pups are stolen from under Dan Conover’s nose, an unlikely alliance is made. Vampire enforcer Dan is bound by a promise to guard the hellhounds. Werewolf Tess Sirella is charged with making sure no hellhound is trained to tap into its evil, murderous potential. Vampires and werewolves aren't supposed to be attracted to one another… but for every rule, there’s an exception.Erin McCarthy - Russian Roulette (Vegas Vampires #5)Alistair Kirk is a bar owner, a musician, and a vampire. When he hears that a fledgling vampire is being held captive and faces certain death, he rushes to the rescue.Sasha Chechikov, once a vampire slayer, now a vampire herself, is on the run from her former associates. Sasha’s past leaves her wary of trusting anyone, but she can’t deny the sparks that fly between her and her sexy saviour. Will Alistair be able to protect Sasha from her enemies? And will two vampires who seem so different from one another learn what it means to truly love?Chris Marie Green - Double the Bite (Vampire Babylon #3.5)On a hunt to find the cause of his brother’s mysterious death, Ben Tyree finds himself at the infamous Studio 54, and soon in the path of two preternaturally beautiful women. Ginny and Geneva aren't just twins, they're vampires. Their connection is put to the test when Ginny falls for Ben, much to Geneva’s anger. How can Ginny choose between the man she’s falling in love with and the sister who won't let her go?Meljean Brook - Thicker Than Blood (The Guardians #3.5)Six years ago, Jack Harrington was in love with Annie Gallagher, until her sudden death turned his world upside down. But when an intruder breaks into his home one night, the former FBI agent can barely believe his eyes – Annie’s alive... and a vampire.After her sudden transition, Annie couldn't bear to let Jack see all that she had become. One night she gives into temptation and decides to feed off a man who resembled Jack, only to find herself face to face with the man himself. Now that they're together again, Jack’s not about to let Annie go, vampire or no. And Annie needs Jack’s help to find a missing girl named Cricket. Danger swirls around the pair as they search for Cricket while a demon bent on destroying all vampires closes in on the pair. Will love lost and found be able to overcome supernatural odds?",
  "genres": [
    "Paranormal Romance",
    "Anthologies",
    "Paranormal",
    "Vampires",
    "Romance",
    "Fantasy",
    "Urban Fantasy"
  ],
  "author": "Susan Sizemore",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/2336321.First_Blood"
}