{
  "title": "Bioplasticity: Hypnosis Mind Body Healing",
  "description": "\"Bioplasticity is consciousness or the mind's ability to alter or heal the body, including the brain.\" - Joseph Sansone Bioplasticity: Hypnosis Mind Body Healing discards the fluff and presents the evidence in support of the incredible healing art of hypnosis. Bioplasticity brings the lost healing art of hypnosis out into the light of day. Backed up by a couple hundred sources this unique book demonstrates the wide range of issues that hypnosis has successfully treated. From medical issues, to mental health disorders, and self improvement in general, hypnosis has a role to play in people's lives. This adaptable healing modality has been shown to be extremely effective as a stand alone treatment or as an adjunct to other healing modalities. After presenting the evidence, Joseph Sansone shares a view of hypnosis from a transpersonal perspective as he offers guidelines on how to begin a daily practice of basic self hypnosis. Bioplasticity is unique in that it is a comprehensive study on the scientific validity of hypnosis, yet it is also a book on self improvement and spirituality as well. \"Carl Jung opined that all healing is done through one's true self and the elevation of awareness. Bioplasticity opens our minds to such awareness and enlightenment through the past, present and future influences of hypnosis. Current writings on epigenetics reveal the ability of the power of the unconscious to create the psychological environment to influence our blood and accordingly our genes in their preventative, or healing, or disastrous health journeys. Hypnosis and the repetitive programming of the unconscious is the intercessor. We are no longer slaves to our DNA. Thanks for your insights, Joe\". - Anthony F. De Marco, LL.B., Ph.D., Co-Founder of the Academy of Professional Hypnosis \"Joe Sansone's excellent book de-mystifies hypnosis and makes it available to everyone as a genuine healing modality. I myself have experienced how profound hypnosis can be in improving medical situations, as well as offering a path to success and happiness. Bioplasticity is a fascinating read and I highly recommend it!\" - Tolly Burkan, Best Selling Author, Speaker, and founder of the Firewalking Center TM.",
  "genres": [
    "Psychology"
  ],
  "author": "Joseph Sansone",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/23360793-bioplasticity"
}