{
  "title": "The Science of Discworld",
  "description": "The fantastic first book in the Sunday Times bestselling Science of Discworld seriesWhen a wizardly experiment goes adrift, the wizards of Unseen University find themselves with a pocket universe on their Roundworld, where neither magic nor common sense seems to stand a chance against logic.The Universe, of course, is our own. And Roundworld is Earth. As the wizards watch their accidental creation grow, we follow the story of our universe from the primal singularity of the Big Bang to the internet and beyond.Through this original Terry Pratchett story (with intervening chapters from Cohen and Stewart) we discover how puny and insignificant individual lives are against a cosmic backdrop of creation and disaster. Yet, paradoxically, we see how the richness of a universe based on rules, has led to a complex world and at least one species that tried to get a grip of what was going on.Terry Pratchett is the acclaimed creator of the global bestselling Discworld series, the first of which, The Colour of Magic, was published in 1983. Raising Steam is his fortieth Discworld novel. His books have been widely adapted for stage and screen, and he is the winner of multiple prizes, including the Carnegie Medal, as well as being awarded a knighthood for services to literature. After falling out with his keyboard he now talks to his computer. Occasionally, these days, it answers back.www.terrypratchett.co.uk@terryandrobProfessor Ian Stewart is the author of many popular science books. He is the mathematics consultant for New Scientist and a Professor of Mathematics at the University of Warwick. He was awarded the Michael Faraday Prize for furthering the public understanding of science, and in 2001 became a Fellow of the Royal Society.Dr Jack Cohen is an internationally-known reproductive biologist, and lives in Newent, Gloucestershire. Jack has a laboratory in his kitchen, helps couples get pregnant by referring them to colleagues, invents biologically realistic aliens for science fiction writers and, in his spare time, throws boomerangs. Jack, who has more letters to his name than can be repeated here, writes, lectures, talks and campaigns to promote public awareness of science, particularly biology. He is mostly retired.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Humor",
    "Science Fiction",
    "Comedy",
    "Audiobook",
    "Popular Science"
  ],
  "author": "Terry Pratchett",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/233674.The_Science_of_Discworld"
}