{
  "title": "A Murder of Crows",
  "description": "A Murder of Crows: Seventeen Tales of Monsters and the MacabreA collection of short horror, ghost, and dark fantasy stories for adults, woven together by a flock of crows, telling stories to entertain a girl trying to survive a tragedy... It was we crows who took your daughter, in case you were wondering. She didn’t run away. We had--I had--been watching her for some time, listening to her tell stories in the grass behind the house. She would sit near the chicken coop and watch the white chickens pick at the dirt, pulling up fat worms and clipping grasshoppers out of the air as they jumped toward the fields. Some of them were good stories. Some of them were bad. But that’s what decided it, even more than any issue of mercy or salvation or anything else. Crows are, for one, possessive of stories. And also by then I had pecked almost all the elders into coming to listen to her at least once, except Facunde, who was then mad and responded to nobody’s pecking, not that I had had the courage to exactly take my beak to her. “She is like a daughter to me,” I had pled with the others. “She listens.” They laughed at me, they rattled their beaks, they came and heard her and were convinced, or at least bullied into pretending they were convinced. We took her on the same cold winter day that you traded your son to the fairies, the wind blowing in cold gray threads, ruffling our feathers. It had snowed a few days before that, a storm that had killed your husband, or so it was said. The wind had snatched the snow out onto the prairie, hiding it in crevices. It had been a dry year, and even though it was still too cold to melt the snow, the thirsty dirt still found places to tuck it away in case of a thaw. I stamped my feet on a sleeping branch while the others argued. Some argued that we should wait for spring. So many things are different, in the spring. But old Loyolo insisted: no, if we were to take the child, we would have to take her then and there: there had been at least one death already, and no one had heard the babe’s cry for hours. We covered the oak trees, thousands of us, so many that the branches creaked and swayed under our weight. I don’t know if you noticed us, before it was too late. You were, it is to be admitted, busy. The girl played on the swings, rocking herself back and forth in long, mournful creaks. She wore a too-small padded jacket and a dress decorated in small flowers. She was so clean that she still smelled of soap. Her feet were bare under their shoes, the skin scabbed and dry, almost scaly. Her wrists were pricked with gooseflesh, and her hair whipped in thin, colorless threads across her face as the wind caught it. The house had the smell of fresh death, under the peeling paint and the dusty windows, and seemed to murmur with forgotten languages, none of which were languages of love or tenderness. Afternoon was sinking into evening. The girl’s breath smelled like hunger. “Now!” called old Loyolo, at some signal that not even I could have told you. And thousands of birds swept out of the trees toward her. From the middle of it, I can tell you, it seemed a kind of nightmare. Wings in my face, claws in my feathers. The sun was temporarily snuffed out, it was a myriad of bright slices reflected off black wings...",
  "genres": [
    "Short Stories",
    "Fantasy",
    "Horror",
    "Paranormal"
  ],
  "author": "DeAnna Knippling",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/23364832-a-murder-of-crows"
}