{
  "title": "Under the Same Blue Sky",
  "description": "From the USA Today bestselling author of When We Were Strangers and Swimming in the Moon comes a lush, exquisitely drawn novel set against the turmoil of the Great War, as a young German-American woman explores the secrets of her past.A shopkeeper's daughter, Hazel Renner lives in the shadows of the Pittsburgh steel mills. She dreams of adventure, even as her immigrant parents push her toward a staid career. But in 1914, war seizes Europe and all their ambitions crumble. German-Americans are suddenly the enemy, \"the Huns.\" Hazel herself is an outsider in her own home when she learns the truth of her birth.Desperate for escape, Hazel takes a teaching job in a seemingly tranquil farming community. But the idyll is cracked when she acquires a mysterious healing power--a gift that becomes a curse as the locals' relentless demand for \"miracles\" leads to tragedy.Hazel, determined to find answers, traces her own history back to a modern-day castle that could hold the truth about her past. There Hazel befriends the exiled, enigmatic German baron and forges a bond with the young gardener, Tom. But as America is shattered by war and Tom returns battered by shell-shock, Hazel's healing talents alone will not be enough to protect those close to her, or to safeguard her dreams of love and belonging. She must reach inside to discover that sometimes the truth is not so far away, that the simplest of things can lead to the extraordinary.Filled with rich historical details and intriguing, fully realized characters, Under the Same Blue Sky is the captivating story of one woman's emergence into adulthood amid the tumult of war.",
  "genres": [
    "Historical Fiction",
    "World War I",
    "Fiction",
    "Book Club",
    "Historical",
    "20th Century",
    "Literary Fiction"
  ],
  "author": "Pamela Schoenewaldt",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/23367391-under-the-same-blue-sky"
}