{
  "title": "Wolfsgate",
  "description": "Forced to marry in a cruel game of family greed, no one counted on Brandon and Justine falling in love.Not even Brandon and Justine.Gripping and sensual, a deeply romantic 18th century tale of deception and revenge, and the healing of two souls hungering for love and absolution.A fateful shipwreck leaves the young and wealthy Lord Brandon presumed dead, and his estate in England lies abandoned and ripe for the picking. Years later, his step-cousin Justine finds him alive and drug-addicted, and against his family’s wishes, boldly brings him home to reclaim his inheritance.Dark surprises disturb Brandon at every turn—a ruined property, a traitorous, bitter family, his fiancée married to his rival. And Justine, the shy, quiet girl he grew up with is no longer a little girl, but an alluring and determined young woman. Can he trust her or is she a part of the intricate web of lies and half-truths?As they work together to salvage what’s left of Wolfsgate and their place in society, age-old jealousies and shadowy secrets threaten at every turn, but irresistible passions run wild and prove even more powerful.Justine is his wife, after all.Justine and Brandon have been bound in a marriage forced upon them by their family for their own deceitful purposes. But the deep, loyal bond that grows between husband and wife isn’t part of their enemies’ plan.In fact, it could destroy their plan.No one counted on Brandon and Justine falling in love.Not even Brandon and Justine.>> Please Note: This book has been re-edited & re-formatted in July 2020 since the book's release in 2014 <<\"Sexy, dark, and suspenseful...Definitely not your mother's historical romance!\" - Guilty Pleasures Book Reviews",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Historical Fiction",
    "Dark",
    "Abuse",
    "Audiobook"
  ],
  "author": "Cat Porter",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/23365149-wolfsgate"
}