{
  "title": "Twice",
  "description": "“Looking at her weakened body, my eyes got lost in a far-away universe. She was still beautiful. Still smiling. Even now. Worried about her hairstyle. About what people may see in her. How she was dressed. Ensuring she always remains a desired woman. She remained somehow the cute yet sexy woman I once enjoyed life with.”It all started as a teenage romance. To be then put at risk by the cold breeze of death. Twice.“Twice”, a fictional memoir by Frank van der Kok is not a love story. Rather the story of love. Of true love. One that endures time. And a brain damage caused by an unfortunate car accident. And breast cancer. Will it endure further trials?Frank van der Kok tells this unique and touching story in a light and informal way. As if we would be discussing throughout the night, at the candle light, over a good old wine. Dare to open his books. You will never put them down again...Dare to step in. Read on and experience a unique life story. With its immense swings. I will take you to the ups and downs of Flower’s story. Hell and Heaven in one place. Past, present and future combined in one dimension.Inspired by a true life experience.“She was beautiful. Amazing. Gorgeous. Angelic. We didn’t organise too much the details, yet, it was all out of a perfect romance. Calm rays of the sun peeked into the church through the tall windows. To then meet her white dress and create a unique glitter all around. The stone walls that always seemed cold to me, now warmed up when reflecting the smooth sounds of the organ. She was approaching in small steps. Normally I’m against ceremonies and formal events. Not extremely patient either... Yet, in that loving moment I was enjoying every second of it. Her face started revealing itself to me more and more, as she was approaching. Her smiling, joyful face. Always loved her smile. All women are most beautiful when smiling. Their cheeks play along, creating a new harmony. Making them cute and lovable. Flower was maxing out this experience. Her eyes were, to be more precise. She was smiling through her eyes. One could easily see the sparkle of happiness in her smile. The dress, the organ, it all made it even more amazing.- I promise to be true to you in good times and in bad, in sickness and in health. I will love you and honour you all the days of my life.\"Frank van der Kok is a Hungarian writer, currently living in Netherlands. Author of “Fights of Your Life” and “Twice”, a series of fictional memoire.Frank van der Kok's dèbut novel, the Fights of Your Life was first released in Hungarian in September 2013, to be then published in April 2014 in English as well. It tells the story of a young woman fighting for her life after a severe car accident.The story of Flower now continues. Only years after recovering from a severe brain damage, Flower is now back in the surgery rooms. To fight the biggest nightmare of our times - cancer. Will she survive? Twice?",
  "genres": [],
  "author": "Frank van der Kok",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/23366965-twice"
}