{
  "title": "Archpriest Avvakum, the Life Written by Himself",
  "description": "During the three decades between Nikon's elevation to the patriarchate (July 1652) and the execution by fire of the prisoners of Pustozersk, including Avvakum (April 1682), the Archpriest's influence and fame grew steadily among those committed to the old rituals. He was thirty-one in 1652, simply one among several outstanding clerics from the younger generation who had impressed Neronov and Vonifat'ev by their piety, force of personality, and devotion to spiritual renewal. Thirty years later he was considered a saint by many; he had become the authoritative doctrinal arbiter among the dissenters and an inspiring example of unflinching defiance no matter the risk or cost. In reading Avvakum's Life we are struck by the astonishing record of his tumultuous existence prior to his final imprisonment. Yet many of his contemporaries could have matching him tale for dramatic tale, had they his narrative gifts. Avvakum's sufferings had little to do with his special destiny. When he returned from his Siberian exile in 1664, the older leaders of the Lovers of God were scattered, discouraged, or dead. Conservatives were understandably attracted by this charismatic and already well-known spokesman for their convictions, especially as his visibility increased in proportion to his growing antipathy for the reformers and their conciliatory blandishments. When Avvakum did not bend under his second exile nor break under the excommunication and anathema heaped upon his by the Ecumenical Council of 1666-67, he was thrust into a position of lasting preeminence. His entire life seems to have been a preparation for this culminating confrontation with the devil's deputies and for his subsequent imprisonment in the arctic village of Pustozersk; it was there in bestial incarceration that he produced the writings which consolidated his place among the schismatics, in the annals of Russian history, and in the cultural consciousness of every literate Russian. This volume includes a preface, introduction, remarks, annotation, notes, and references by Kenneth N. Brostrom. The study of Life by V. V. Vinogradov is also included. Avvakum'sThe Life of the Archpriest Avvakum is translated by Kenneth N. Brostrom.",
  "genres": [
    "Russia",
    "Nonfiction",
    "Russian Literature",
    "Religion",
    "History",
    "Classics",
    "Biography"
  ],
  "author": "Kenneth N. Brostrom",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/2336357.Archpriest_Avvakum_the_Life_Written_by_Himself"
}