{
  "title": "The Bush Tragedy",
  "description": "This is the book that cracks the code of the Bush presidency. Unstintingly yet compassionately, and with no political ax to grind, Slate editor in chief Jacob Weisberg methodically and objectively examines the family and circle of advisers who played crucial parts in George W. Bush’s historic downfall.In this revealing and defining portrait, Weisberg uncovers the “black box” from the crash of the Bush presidency. Using in-depth research, revealing analysis, and keen psychological acuity, Weisberg explores the whole Bush story. Distilling all that has been previously written about Bush into a defining portrait, he illuminates the fateful choices and key decisions that led George W., and thereby the country, into its current predicament. Weisberg gives the tragedy a historical and literary frame, comparing Bush not just to previous American leaders, but also to Shakespeare’s Prince Hal, who rises from ne’er-do-well youth to become the warrior king Henry V.Here is the bitter and fascinating truth of the early years of the Bush dynasty, with never-before-revealed information about the conflict between the two patriarchs on George W.’s father’s side of the family–the one an upright pillar of the community, the other a rowdy playboy–and how that schism would later shape and twist the younger George Bush; his father, a hero of war, business, and Republican politics whose accomplishments George W. would attempt to copy and whose absences he would resent; his mother, Barbara, who suffered from insecurity, depression, and deep dissatisfaction with her role as housewife; and his younger brother Jeb, seen by his parents as steadier, stronger, and the son most likely to succeed.Weisberg also anatomizes the replacement family Bush surrounded himself with in Washington, a group he thought could help him correct the mistakes he felt had destroyed his father’s presidency: Karl Rove, who led Bush astray by pursuing his own historical ambitions and transforming the president into a deeply polarizing figure; Dick Cheney, whose obsessive quest to restore presidential power and protect the country after 9/11 caused Bush and America to lose the world’s respect; and, finally, Donald Rumsfeld and Condoleezza Rice, who encouraged Bush’s foreign policy illusions and abetted his flight from reality. Delving as no other biography has into Bush’s religious beliefs–which are presented as at once opportunistic and sincere–The Bush Tragedy is an essential work that is sure to become a standard reference for any future assessment. It is the most balanced and compelling account of a sitting president ever written.From the Hardcover edition.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Biography",
    "History",
    "Presidents",
    "Audiobook",
    "American History"
  ],
  "author": "Jacob Weisberg",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/2336565.The_Bush_Tragedy"
}