{
  "title": "Shifters After Dark",
  "description": "COMING OCTOBER 27, 2014SIX BOOKS FOR ONLY 99 CENTS!! LIMITED TIME ONLY(Retail Value over $20)Dive into six incredible fantasy worlds by NYT and USA Today Bestselling authors where shifters rule! Whether it's an action-packed urban fantasy or steamy paranormal romance, this collection delivers what you crave most. Six nail-biting stories of adventure, romance, danger, suspense, alpha males, and tough heroines... Dark secrets and imprisoned hearts await. Come unlock them! Cliffhanger-free!SM Reine - OF WINGS AND WOLVESDannika Dark - SEVEN YEARSMarie Hall - HOOD'S OBSESSIONKate Danley - THE DARK OF TWILIGHTMelissa F. Olson - BLOODSICKPhoenix Sullivan - HEARTSONGOF WINGS AND WOLVES by SM Reine - $3.99 valueSummer Gresham's unique shapeshifting nature is a well-hidden secret, so the 20-year-old coed is baffled to be singled out for a prestigious internship. She’s even more stunned to discover the man who wants to hire her—Nash Adamson—specifically requested her…and won’t take no for an answer. A rebel angel in exile, Nash has more than a few secrets of his own. Summer is the key to his freedom, and her warmth and beauty stirs something inside of him, almost making him forget he’s imprisoned. Then Summer finds herself at the crux of an ancient war, and angels don’t care how many mortals get caught in the crossfire. Torn between saving Summer and freeing himself, Nash has to choose what matters most: their love, or his freedom.SEVEN YEARS by Dannika Dark - $3.99 valueLexi Knight hasn't seen Austin Cole since her brother's funeral seven years ago. Austin's no longer the boy she once knew, but a dangerous bounty hunter with dark secrets. When he reveals to Lexi that he's an alpha Shifter, her world is flipped upside down. But there's a shocking twist no one saw coming, and now her family is in danger. Can Austin salvage a relationship from the ruins of their past? Reality meets Paranormal Romance in this bestselling series about family, second chances, and finding that person who completes you.Cliffhanger-free, HEA, 18+HOOD'S OBSESSION by Marie Hall - $3.99 valueLilith Wolf, the daughter of the Big Bad Wolf and Little Red Riding Hood has a problem, she's an unmated female in heat. She has to get away from the males of her village unless she wants to find herself involuntarily hand fasted to the first one to tame her wolf. So when Giles Damien comes to her calling due the pact she'd signed with Rumpelstiltskin years ago, she doesn't really think twice about the fact that she'll be journeying to Fyre Mountain. Even though that means she'll be crossing paths with an angry water dragon, a pub full of rowdy Merry Men, and rock dwarves with a taste for flesh... but she'd never counted on falling in love. These are the other fairy tales no one ever told you about...THE DARK OF TWILIGHT by Kate Danley - $3.99 Boxed Set ExclusiveAein always longed to become a member of Lord Arnkell's army, ever since she was a child working in the stronghold's kitchen. When that day finally comes and she is sent to patrol the border's swamp with fellow warrior, Lars, it seems like her dream has come true. But something has followed her home. When Lord Arnkell's wedding is interrupted by a werewolf attack, the dream shifts into a nightmare… and Aein is the only one awake. Book One in the brand new epic fantasy series Twilight Shifters. A boxed set exclusive!BLOODSICK by Melissa F. Olson –$2.99 Boxed Set ExclusiveAll her life, Sashi’s mother warned her not to get involved with werewolf problems. But Sashi, a witch who uses healing magic on sick and injured bodies, has never made a habit of ignoring trauma. When she meets an abused shapeshifter that no one else seems willing to help, Sashi will risk everything –including her fledgling relationship – to save a woman who can’t save herself. An Old World novella from the author of Dead Spots, Trail of Dead, and Hunter's Trail.HEARTSONG by Phoenix SullivanBy night, in her Gabriel Hound form, Brinn runs with The Wild Hunt. When she's unwittingly thralled by brother princes Alain and Pellinore, only one thing can free her: the blood of her captors. But freedom is not so easily won as the three of them form a grudging bond that soon turns intimate. Love should be easy, but The Wild Hunt wants Brinn back, the Questing Beast wants Pel, and Alain wants the impossible--to keep them both at his side. (an Arthurian-era fantasy, 17+)",
  "genres": [
    "Paranormal",
    "Romance",
    "Anthologies",
    "Fantasy",
    "Shapeshifters",
    "Paranormal Romance",
    "Collections"
  ],
  "author": "S.M. Reine",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/23365536-shifters-after-dark"
}