{
  "title": "Chameleo: A Strange but True Story of Invisible Spies, Heroin Addiction, and Homeland Security",
  "description": "A mesmerizing mix of Charles Bukowski, Hunter S. Thompson, and Philip K. Dick, Chameleo is a true account of what happened in a seedy Southern California town when an enthusiastic and unrepentant heroin addict named Dion Fuller sheltered a U.S. Marine who’d stolen night vision goggles and perhaps a few top secret files from a nearby military base.Dion found himself arrested (under the ostensible auspices of The Patriot Act) for conspiring with international terrorists to smuggle Top Secret military equipment out of Camp Pendleton. The fact that Dion had absolutely nothing to do with international terrorists, smuggling, Top Secret military equipment, or Camp Pendleton didn’t seem to bother the military. He was released from jail after a six-day-long Abu-Ghraib-style interrogation. Subsequently, he believed himself under intense government scrutiny — and, he suspected, the subject of bizarre experimentation involving “cloaking”— electro-optical camouflage so extreme it renders observers practically invisible from a distance of some meters — by the Department of Homeland Security. Hallucination? Perhaps — except Robert Guffey, an English teacher and Dion’s friend, tracked down and interviewed one of the scientists behind the project codenamed “Chameleo,” experimental technology which appears to have been stolen by the U.S. Department of Defense and deployed on American soil. More shocking still, Guffey discovered that the DoD has been experimenting with its newest technologies on a number of American citizens.A condensed version of this story was the cover feature of Fortean Times Magazine (September 2013).",
  "genres": [
    "Nonfiction",
    "Conspiracy Theories",
    "History",
    "The United States Of America",
    "True Crime"
  ],
  "author": "Robert Guffey",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/23365123-chameleo"
}