{
  "title": "Fearless Part II: Crossing Lines",
  "description": "From the author of the Walker Series comes a family drama like no other, a sprawling character epic, a forbidden love story full of angst, adventure, heartbreak, and second chances. Welcome to the mother chapter of the Lean Dogs Motorcycle Club; meet the girl raised by outlaws, and the fearsome man who will always hold her heart.  After a bloody homecoming, and a shattering run-in with her lost love, Ava Teague is launched into her past, forced by circumstance to remember the events five years ago that led to Mercy’s departure from Knoxville. At seventeen, she was raw, vulnerable, and green, and too in love with him to be coy about it. Mercy had no idea how his feelings for her had become so muddied, only that he had to do something about them. They were electric; they were doomed.  Told in installments, this is the second of four parts of a complete novel. Fearless will later be offered in its entirety, as a full 600+ page novel; the price will be comparable; Lauren wanted to experiment with releasing a novel in parts, so readers could enjoy it as she completes writing on each section. Readers can follow along with her, or wait for the finished novel. This rich narrative travels from the swamps outside New Orleans to the foothills of Tennessee, spanning fourteen years, following a family of outlaws bound by brotherhood, blood, and a love that knows no boundaries. Read Part I: “Lying Down With Dogs,” and Part II: “Crossing Lines,” and be on the lookout for Part III: “All-American Monsters,” this fall. Mercy can also be found in Lauren Gilley's third Russell novel, KEEPING BAD COMPANY, a Southern outlaw series that kicks off with book one: MADE FOR BREAKING.  Keep up to date with all the new releases and inside scoop on Lauren’s blog: hoofprintpress.blogspot.com, on her Twitter feed: @lauren_gilley, or her Facebook page: Lauren Gilley – Author. Or contact her at authorlaurengilley@gmail.com.",
  "genres": [
    "Dark"
  ],
  "author": "Lauren Gilley",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/23364023-fearless-part-ii"
}