{
  "title": "One Mississippi, Two Mississippi: Methodists, Murder, and the Struggle for Racial Justice in Neshoba County",
  "description": "During Freedom Summer 1964, three young civil rights workers who were tasked with registering voters at Mt. Zion Methodist Church in Neshoba County, Mississippi were murdered there by law enforcement and Ku Klux Klansmen. The murders were hardly noticed in the area, so familiar had such violence become in the Magnolia State. For forty-one days the bodies of the three men lay undetected in a nearby dam, and for years afterward efforts to bring those responsible to justice were met only with silence.In One Mississippi, Two Mississippi, Carol V.R. George links the history of the Methodist Church (now the United Methodist Church), with newly-researched local history to show the role of this large denomination, important to both blacks and whites, in Mississippi's stumble toward racial justice. From 1930-1968, white Methodists throughout the church segregated their black co-religionists, silencing black ministers and many white ministers as well, locking their doors to all but their own members. Finally, the combination of civil rights activism and embarrassed Methodist morality persuaded the United Methodists to restore black people to full membership. As the county and church integrated, volunteers from all races began to agitate for a new trial for the chief conspirator of the murders. In 2005, forty-one years after the killings, the accused was found guilty, his fate determined by local jurors who deliberated in a city ringed with casinos, unrecognizable to the old Neshoba.In one sense a spiritual history, the book is a microhistory of Mt. Zion Methodist Church and its struggles with white Neshoba, as a community learned that reconciliation requires a willingness to confront the past fully and truthfully. George draws on interviews with county residents, black and white Methodist leaders, civil rights veterans, and those in civic groups, academia, and state government who are trying to carry the flag for reconciliation. George's sources--printed, oral, and material--offer a compelling account of the way in which residents of a place long reviled as \"dark Neshoba\" have taken up the task of truth-telling in a world uncomfortable with historical truth.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Carol V.R. George",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/23367594-one-mississippi-two-mississippi"
}