{
  "title": "Kun Fayakun",
  "description": "Namaku Hardi Kobra.Kalau ada orang yang ngaku preman, penjudi, pembunuh, pemabuk, penzina, atau penguasa gelap suatu kawasan di Jakarta ini yang tak gemetar kala disebut namaku, pastilah dia orang baru di sini. Jika diadakan status jabatan presiden untuk dunia hitam ini, maka akulah presidennya! Berbagai jenis pertarungan, perkelahian, tawuran, dan pembunuhan pernah kulakukan. Bahkan, sekalipun kadangkala hanya atas nama sesuatu yang maya: kehormatan sebagai preman!Itulah aku, Hardi Kobra, tapi itu dulu....Di atas semua kemewahan dan kehormatan yang kumiliki sebagai penguasa dunia hitam di sini, di kala setiap preman tunduk atas titahku dan setia wanita nakal selalu setia dengan bangga menemani tidurku, aku tak kunjung menemukan jati diriku sebagai manusia yang berakal dan berhati. Jiwaku tak pernah bahagia dengan semua keduniawian ini. Ruhaniku selalu nestapa dan lara di atas semua kekejian dan kemungkaran ini.Di manakah Engkau, Kebahagiaanku? Di manakah Engkau, Jiwaku? Di manakah Engkau, Ruhaniku?Aku termasuk insan beruntung lantaran aku dihentakkan oleh suatu peristiwa mahadasyat yang menjebol semua kekelaman hatiku, Cahaya Keilahian itu begitu teduh menyelusupi hatiku, batinku, ruhaniku.Inikah Yang Maha Kuasa itu? Inkah Engkau, ya Allah?Novel inspiratif berlatar kisah kehidupan kelam dan keras dunia premanisme Jakarta ini menyajikan kesaksian-kesaksian perjuangan ruhaniah seorang pemuka preman paling digentari, Hardi Kobra. Setting nya yang kuat, alurnya yang kompleks tapi sangat terjaga, serta ledakan-ledakan konflik yang mengenaskan dan kadangkala mengharukan siap menghantarkan setiap kata untuk mengarungi jadad kelam premanisme ibukota. Sebuah bacaan religius Islam bercorak Thriller dengan citarasa lokal yang sanggup menggugah rasa penasaran pada setiap helainya...Inilah novel yang sangat inspiratif, yang akan menghantarkan Anda menjadi lebih menghargai kehidupan ini.",
  "genres": [
    "Fiction"
  ],
  "author": "Andi Bombang",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/2337861.Kun_Fayakun"
}