{
  "title": "Twisted",
  "description": "HONORABLE MENTION of The 2014 London Book Festival Annual Competition! BRONZE MEDAL WINNER of The 2016 Readers' Favorite International Book Award! Riveting New Adult SUSPENSE THRILLER, Profoundly Moving and Dark REALISTIC FICTION. Inspired by real life events, Twisted is a fascinating story of vulnerability, courage and the art of making a living in the sex trade... “A gripping and mature story deftly woven by Lola Smirnova, \"Twisted\" is the kind of suspense novel that will linger in the mind and imagination long after it is finished and set back upon the shelf... \"Twisted\" introduces an extraordinarily gifted author to an appreciative readership looking eagerly toward her next literary effort.” - Midwest Book Review * * * Back in the 90’s, the corrupt post-Soviet Ukraine with its faltering economy, is thrown into a devastating depression. Times are hard. Opportunities are scarce. Three young and eager sisters – Natalia, Lena and Julia - dream of a better life and weigh their do they stay and struggle like their parents, or join scores of their compatriots in the sex trade in glittering western European cities, who earn in a night what they’d take several months to earn at home? Naive and tempted by the allure of 'quick' money, the girls set off on an adventure that changes their lives forever... Can they stay out of trouble enough to fulfill their ambitions? Can they hold on to their idealism in a world where depravity and danger are constant companions? How far are they willing to go to make a buck? * * * TWISTED' IS THE FIRST BOOK OF A PLANNED TRILOGY. THE SECOND ONE - 'CRAVED' WAS RELEASED IN JULY 2015. To stay updated about the upcoming book #3 of the series and other news from the author, follow Lola on Facebook - or Twitter - @AuthorSmirnova Editorial  “Charged with some disturbing sexual scenes (including rape), the book manages a steady, readable flow as it shines a light on the multifaceted world of the European sex trade.”  - Kirkus Reviews “Smirnova takes us on a philosophical and pseudo-psychological pilgrimage through the sexual underworld as Julia, in first person narrative, describes her struggling introduction into a profession where she can ply the only skills currently marketable.” - 5 star review from Readers’ Favorite “I highly recommend ‘Twisted’ to open-minded readers who aren’t afraid of a little blood, sweat and semen. It’s sure to shock and surprise you, with both its storyline and its literary value.” - 5 star review from Red City Review “In the meantime, Smirnova hopes that Twisted will raise awareness to the problems of the sex industry… Kudos to Smirnova for an outstanding job achieving that goal!” - 5 star review from Pacific Book Review “While the subject matter does not make for a light read, a breezy writing style and Julia’s willingness to fully and shamelessly lift the veil on her controversial lifestyle makes an irresistible combination.”  - IndieReader “The book is a dark, straight-forward tale of how a young woman becomes a prostitute.",
  "genres": [
    "Dark",
    "Thriller",
    "Suspense",
    "Fiction",
    "Adult",
    "Realistic Fiction",
    "New Adult"
  ],
  "author": "Lola Smirnova",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/23368003-twisted"
}