{
  "title": "Healing Submission",
  "description": "Safety. Security. Trust. Discipline. How do you heal a shattered heart? With their dominants’ masterful handling and unique approaches to comfort, these lovers with hurt and trauma in their pasts get another chance at finding the love they deserve. This boxed set contains ten novels from bestselling D/s romance authors including NYT/USA Today bestsellers Anna Antonia, Adriana Hunter, Selena Kitt and Linda Barlow. Some books are from existing series, but each book stands alone - no cliffhangers! Mastering Meg by Saskia Walker: When Piers finds Meg's secret stash of BDSM material he sees the way to unbuckle her and win her heart. Meg is wildly aroused, but getting her to admit that is going to be his biggest challenge! Force Majeure by Arden Aoide: The mind of Jeff Rainier is remarkable and strange. It separates him from true intimacy. Until Evan. She revels in his obsessive nature and captivating idiosyncrasies. Can he trust her affections? The Dangerous Hero by Linda Barlow: Stephen and Viola had amazing sex 9 years ago, and the chemistry is still sizzling when they meet again. But after an abusive marriage, can she trust a man whose home contains a dungeon? Catching Caitlin by Amy Isan: Hugh Evans. He's not the man I remember, but more powerful. He walked up to me in the dumpy bar. The speakers bled while he licked salt off my drink. A sly grin and twinkle in his eye. Her Two Doms by Adriana Hunter: When Sebastian invites Brooke to his club and introduces her to his best friend Jax, things quickly heat up. But what happens when they find themselves wanting more than just her submission? Trust by Anna Antonia: Nicola Dawson was once married but the severe emotional neglect left her feeling broken and unloved. When she meets handsome neurosurgeon Henry Kain it's her chance to learn to live and love again... Coming Clean by Selena Kitt: When divorced Donnie hires Elena as a housekeeper, he has no idea the dark desires she will inspire in him, or the dark past he will help her overcome. Lost in His Woods by Penelope L’Amoreaux: She woke close to death in the snow. He saved her, but struggles to give her what she craves: comfort. Tolik and Clare's journey take them through dark, sensual depths, and a thrilling adventure. Dysphoria by Hildred Billings: A woman dealing with severe gender dysphoria approaches her wife to help her become more submissive. Unlearning twenty years’ worth of repression, however, does not come without its sacrifices. Not Your Damn Dom by Amy Valenti: After a disastrous mistake, Spencer swears off BDSM forever. When he falls in love again, he battles the urge to introduce Alex to his Dom side. Can he trust himself with a submissive's safety again?",
  "genres": [],
  "author": "Amy Isan",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/23377984-healing-submission"
}