{
  "title": "Lady Catherine's Secret",
  "description": "Winner of the Where the Magic Begins contest for Best Historical RomanceLondon, 1853 – Lady Catherine and Alexander Gray share a passion… because Catherine IS Alexander Gray! Despite Catherine’s love of fencing, she needs to stop pretending to be a boy and fraternizing with men…but not until after she competes in the upcoming fencing tournament! Her mother plans to marry her off by the end of the season, so this will be her last chance to enjoy her freedom. When she impulsively puts her reputation at risk to save the life of a dashing competitor, all seems lost when he sees through her disguise. Can the Mad Marquess find a bride? Daniel, Marquess of Huntley, needs to overcome rumors of his father’s madness to be embraced by London society. He’ll marry the most proper woman who will have him, and then raise stable, respectable children. He certainly isn’t interested in some hoyden with a penchant for masquerading as a boy and flaunting society’s rules. In fact, he’d prefer to keep his distance. It comes down to a question of honor… When an obsessed suitor discovers Catherine’s secret and threatens blackmail, the only path out of social ruin is marriage. But what kind of protection does matrimony provide when a vengeful suitor is plotting the ultimate revenge? Note from the author:My books aren't edgy or stomach-churning. If you're looking for something dark and twisty, go elsewhere. If you're looking for something to take your mind off the world for a while and leave you feeling a bit better about life, then this is the book for you! + This is not a cliffhanger. Each book's hero and heroine have their own complete romance and HEA (happily ever after). Characters from the books will reappear throughout the series, but in supplementary roles. ++ The romance scenes in this book are explicit, but not frequent.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Victorian",
    "Mystery",
    "Historical Fiction",
    "Historical"
  ],
  "author": "Sheridan Jeane",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/23379827-lady-catherine-s-secret"
}