{
  "title": "The Chesapeake Series: Sea Swept / Rising Tides / Inner Harbor / Chesapeake Blue",
  "description": "#1 \"New York Times\" bestselling author Nora Roberts presents her breathtaking Chesapeake Series--SEA SWEPT, RISING TIDES, INNER HARBOR, and CHESAPEAKE BLUE presented together in one set for the first time.SEA SWEPTWhen Cameron Quinn receives word that his father has been in a terrible car accident and is near death, Cam returns home. Along with his two adopted brothers, Ethan and Phillip, Cam promises his dying father to raise a boy Ray had taken in just prior to his accident. Assuming that Seth, like Cam, Ethan and Phillip before him, is simply a troubled boy off the streets, Cam is shocked and outraged by persistent rumors that Seth is Ray's natural son, conceived in an affair with one of his college students. Determined to fight the rumors and clear their father's name, the Quinns commit themselves to making Seth a permanent part of the Quinn family. Before the adoption can proceed, however, the Quinns must prove themselves to be fit guardians, and convince Seth's case worker, Anna Spinelli, that the Quinn brothers can form the proper environment to raise Seth. Complications arise when Cam finds himself increasingly attracted to Anna, and a relationship develops between the two. Always the footloose adventurer, Cam must now decide if he has the ability to stay permanently in Maryland and help raise Seth, and commit himself to his family and to Anna, or if his old lifestyle would always call to him.RISING TIDESEthan Quinn is a waterman. He wasn't born to the tradition, but has embraced it. He's a quiet man whose heart runs as deep as the waters he loves. But now he faces more than the challenge of making his living on the Bay or struggling to make the fledgeling boat-building business he and his brothers began a success.There's a young boy who needs him, and a woman and child he loves but never believed he could have. To shape his life around them, Ethan must face his own dark past, and accept not only who he is, but what he hopes to become.INNER HARBORPhillip Quinn valued his fast-paced and successful life in Baltimore, but he knew that for Seth's sake, he, like his brothers, would have to make compromises on his bachelor lifestyle. Dr. Sybill Griffin was a renowned sociologist, in town ostensibly to study small town life, but in reality she had a different agenda: to study the Quinns, and how they were treating little Seth. Attracted from the first to the reserved doctor, Phillip was determined to discover her secrets, but when the truth comes out, the power of their passion may not be enough to overcome the truth about her betrayal. The Quinns will have to pull together as a family, once and for all, to protect and care for Seth as they promised her father, and Sybill will learn that sometimes a tie without blood is just as strong as a tie of blood.CHESAPEAKE BLUESeth Quinn is finally home.It's been a long journey. After a harrowing boyhood with his drug-addicted mother, he was taken in by the Quinn family, and grew up with three older brothers who watched over him with love.Now, a grown man returning from Europe as a successful painter, Seth is settling down on Maryland's Easter Shore, surrounded by Cam, Ethan, and Phillip once again, and their wives and kids, all the blessed chaos of the extended Quinn clan. Finally, he's back in the little blue-and-white house where there's always a boat at the dock, a rocker on the porch, and a dog in the yard.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Romantic Suspense",
    "Love"
  ],
  "author": "Nora Roberts",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/114147.The_Chesapeake_Series"
}