{
  "title": "Club El Diablo Box Set",
  "description": "Club El Diablo - A rich Dom's paradise, a submissive’s dream.One Dom at a Lydia & Damian - Damian found her in a seedy BDSM club administering a twelve-foot bull whip to perfection. Lydia was the most popular Domme in the state and he wanted her for his famous Club El Diablo in Houston. He’s richer than dirt, sexier than sin, and the last man Lydia wants. She's a Dominatrix, in control of her universe, and no one knows her biggest secret; she craves to be mastered in the bedroom.Piercing a Dom's Willow & Brandon - Brandon Edward Sterling IV inherited his father’s corporation before he was ready to settle down. He works grueling hours and follows the accepted path of society’s socially elite. Damian, the owner of Club El Diablo, asks his friend Bran to keep an eye on Damian’s visiting pierced-out, Goth-chick, sister Willow. She’s spirited and curious, with messy braided hair, piercings in places that drive a Dom wild, and ready to explore her submissive cravings. She’s also unacceptable in the wealthy world of Wall Street’s rich and famous.Touched By a Trisha & Kyle - Sir Kyle’s need for pain terrifies all but the kinkiest submissives. The willing screams of his hardcore subs ring through the walls of Club El Diablo. Trisha is new to the BDSM lifestyle and has never experienced the big “O” with a man. Her vibrator does the job better than her last boyfriend so who needs more? Kyle’s dark secret usually keeps him from training new subs but he’s hot to test Trisha’s limits.Domination in Lydia & Damian - Lydia is pregnant with her first child and Damian, her hot and horny Dom husband, can’t keep his hands off her. Her baby thickened body desires rough play but Damian wants to worship every fluffy inch of her, slowly. Outside of the bedroom, Lydia is a sought after Domme. Can she bring her private love toy around to her way of thinking or does she need to pull out the big guns and practice Domination in Pink?These novellas are intended for mature 18+ readers. They contain BDSM themes, strong language, and content that may be objectionable to some but perfect for others.",
  "genres": [
    "BDSM"
  ],
  "author": "Holly S. Roberts",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/23381188-club-el-diablo-box-set"
}