{
  "title": "Ditching the Dream / Not In My Wildest Dreams",
  "description": "~ This version is no longer available ~BOOK 1: DITCHING THE DREAM Feeling dead in her marriage, Elizabeth Fairchild ditches the dream of her seemingly perfect life with her husband in search of who she really is.  She went from her parents' house to her husband's home and never really learned to stand on her own two feet. She decides to leave her comfortable life in Napa Valley in search of her inner fire in New York City. She certainly didn't leave her husband to find another man, but she soon finds herself involved with two: Jack Stevens and Kevin Parker.  Jack is older. He has heart-stopping good looks, is wildly successful, and is very much in control of everything around him - especially Elizabeth. Kevin is younger. He is carefree with a heart of gold and loves Elizabeth's spunk.  While Elizabeth's old life still calls to her, she also finds what she needs in New York. But which dream will she choose?  BOOK 2: NOT IN MY WILDEST DREAMS 1979... When eighteen-year old Jack Stevens is spotted in his rural Colorado town by a scout from a New York City modeling agency, his life is flipped upside down. With little more than his looks, he heads to New York with a dream he didn’t know he had. Jack has a rough start, but finds his feet and embarks on an exciting life as a male model in the 1980s living in Manhattan.  2013... Thirty-four years later, a confirmed bachelor, and very successful, Jack is satisfied with his life, until he meets a breath of fresh air—Elizabeth Fairchild. Never in his wildest dreams did he think he’d find a love like he does with 'Beth.' It’s an instant connection.  Following wild dreams had worked for him in the past… Is this another wild dream he should follow?  WARNING: EROTIC ROMANCE... These books contains subject material of an adult nature (i.e. language & explicit sex) intended for readers of 18 years old and older. You’ve been warned. Happy reading!",
  "genres": [],
  "author": "Isabelle Peterson",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/23381792-ditching-the-dream-not-in-my-wildest-dreams"
}