{
  "title": "The Bonobo Way",
  "description": "\"First things first: this book is really good... The Bonobo Way is a very unusual book: whimsical yet serious, easy to read yet thoroughly researched, challenging yet ultimately deeply comforting. Dr. Susan Block is living proof that bonobos aren’t just sexy and fun—some of them are damned smart, too.\"--Christopher Ryan, Ph.D., best-selling author of Sex at DawnIn her unique and game-changing book, internationally acclaimed and controversial sex educator Dr. Susan Block offers a brilliant new view of human sexuality, war, peace and community, inspired by a role model who isn’t even human: our closest genetic cousin, the bonobo. With a provocative, humorous and engaging style that makes science fun and ecology erotic, The Bonobo Way boldly asks: What do these great apes know about sex, war and the rest of life that we don’t? Here are some things we know about bonobos: They have a lot of sex. They never kill each other. They empower the females. They stay younger longer. They live in peace through pleasure. And we thought humans were the smartest apes!\tFor decades, scientists and philosophers have used the “killer ape” paradigm to explain why humans murder, make war, bomb and behead each other, and supposedly always will. Sure, our common chimp cousins kill, but do they tell the whole story? Luckily, they don’t. The Bonobo Way shows the other side of the primate story, presenting the bonobos as an exciting new great ape paradigm for humanity that could change the world… or at least improve your love life. From the lush depths of the Congo rainforest to the satin sheets of your own bedroom, Dr. Block takes you on an unprecedented and fascinating journey into an erotic, peaceful paradise on Earth. Powerful yet playful, heartfelt but science-based, she weaves stories, studies, theories and fantasies into possibilities and a practical path of action, presenting a very different kind of “12-Step Program” to release your “inner bonobo,” help save the real bonobos from extinction and energize all facets of your life. Whether you don’t know bonobos from bananas, or you think you know all about these amazing creatures, The Bonobo Way will show you the way to a happier, healthier, sexier life, and a more peaceful, sustainable culture. Take it for a test drive! You'll be glad you did, and so will everyone you know.www.TheBonoboWay.com",
  "genres": [],
  "author": "Susan Block",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/23383212-the-bonobo-way"
}