{
  "title": "The Man Beside Her",
  "description": "Part of an integration program to include women in a previously all male ministry, Diane McPherson is the first of seven female pastors to be installed in ministry in the Tri-State Conference of Second Advent Believers (SAB). Assigned to Judah SAB Church in the town of Appleton, New York, she quickly discovers that small town people have the same big city problems she's used to, coming from Brooklyn, New York. Problems like private sins with public consequences, family secrets and scandals, and more prevalent than the rest possessiveness where church positions are concerned. Eugene Bennett, music director and organist at Judah, has the possessiveness problem on a really large scale. Diane’s ministry gets off to a challenging start when she recommends changes in Judah's worship services. She finds herself faced with an elders' board hostile to her gender and a music director determined to end her tenure before it has properly begun. Slade Patterson comes to church on Sabbath morning out of curiosity. He left Judah twenty years ago because of frauds like Eugene Bennett, pretending to be 'the faithful.' He only walks into Judah on this particular morning to see if the new preacher can hold her own against her persecutor, Eugene Bennett. Hold her own she does; and when she opens her mouth and sings a cappella, Slade finds himself at the piano, strumming the keys and picking up the notes the pastor is singing. His visit of observation turns into one of participation, although he doesn't understand how or why. But when God is in the mix, what else do you expect? Quicker than he can come up with excuses, Pastor McPherson convinces him to return to play at Judah. Slade plans on temporary service in God's house, but Diane McPherson is a praying and persuasive pastor who wants to keep him there permanently. While he resists long-term commitment to God's service, he begins thinking long term about the attractive pastor who preaches complete obedience and service to God. Slade doesn't want her preaching, but he wants the pastor. Diane appreciates all Slade's help and support in the music ministry of the church, and she appreciates Slade Patterson, the man, too. But with his service only a short term thing, will the duration of their relationship be the same—short lived?",
  "genres": [],
  "author": "Brigette Manie",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/23382329-the-man-beside-her"
}