{
  "title": "Prisoner Prodigal Pawn",
  "description": "A young attorney digging in his law firm's past in order to free his father from prison, is warned to be careful, \"some things are like sacred burial grounds, and are better left alone... out of respect.\" He charges ahead nevertheless, and confronts those he believes are responsible, but when a close colleague is found dead and the evidence points to him as the murderer, Elton Mozingo is faced with his greatest fear; ending up just like his father, an innocent man in jail for a crime he didn't commit. Prisoner Prodigal Pawn, follows the adventures of the Mozingo family as they try to unravel a conspiracy that has led to one of their own, Elton Mozingo, to be set up for murder. The story is an insider’s tale, set in the city of Albuquerque, New Mexico and revolves around a law firm, an Indian casino, tribal politics, and delves into questions of race and identity throughout. The Mozingo brothers, Elton and Charles, as well as their convicted-felon father, BP, are the eponymous prisoner, prodigal son, and pawn caught up in an elaborate embezzlement scheme that its perpetrators would kill to keep hidden. As a fugitive from justice, Elton soon realizes that the death of his colleague and the pursuit of his father’s innocence are connected. Bill Baxter, of the Baxter and Baxter law firm wants Elton captured before he uncovers much more of the past that will destroy him and his firm. Rather than seek help from his estranged brother, a tribal police officer, Elton turns to the aid of a childhood friend, Oda Raines who uses him to pursue an agenda of her own. She has been an outspoken critic of the tribal leaders for the corruption associated with the casino. The firm’s largest client is the local Native American tribe, and it is the wealth from its gaming operations that is at the heart of Elton’s troubles. Oda is ultimately faced with the choice of either saving herself or turning on an old friend.  The chase for freedom propels Elton on a suspense filled journey where the forces at play eventually push him and his brother together on a quest for vengeance against those that created the wedge between them.Prisoner Prodigal Pawn, with its diverse characters, will appeal to readers who enjoy thrillers, but also to readers of varied cultural backgrounds looking for a new kind of protagonist to root for. In addition, the subplot takes a look at a phenomenon quietly sweeping across the Native - American landscape, that of tribal members who are being disenrolled due to – some would say— the greed associated with the success casino gambling on Native – American soil.",
  "genres": [],
  "author": "Robert Sparkman",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/23387104-prisoner-prodigal-pawn"
}