{
  "title": "Jeff Madison and the Shimmers of Drakmere: A magical fantasy adventure",
  "description": "A magical fantasy adventure.  What if there existed a dark kingdom forged on a web of evil spells, with a conniving king plotting to infiltrate the dreams of children all over the world?JEFF MADISON fantasy adventure novels for teen and young adult fantasy readers, feature magic, sorcery, dragons, witches and wizards, and suspense. The author, Bernice Fischer, creates a path for the reader to escape with the characters into a world of mythology, where the legendary Sandman and his Sandustians protect the children of Earth. In this series, believable characters, compelling dialogue, tense scenes, and exciting fight scenes are balanced with infectious humor to bring about a true page-turner that captures the reader from the very first page.JEFF MADISON and the Shimmers of Drakmere is a humorous, action packed fantasy adventure story about a 12-year old boy hero, trapped in the magic world of Drakmere, where he is trying to rescue his little brother, Matt, who was captured and held prisoner by an evil king and his wicked witch in the land of nightmares.Escape into a fantasy world with Jeff, Rhed, Matt and the rest of the cast now by ordering your copy of Jeff Madison and the Shimmers of A magical fantasy adventure.Why Readers Love This \"Loved the characters immensely. Loved the background and legends. Loved the friendships, main plot, and sub-plots. I'm chomping at the bit for the next book!\" - Tonja Klein, Amazon reviewer.\"Keeps you gripped with tension interlaced with humor right to the end.\" - Grant Kitchener, Amazon reviewer.\"An interesting story for children. I was amazed by the way the writer approached this story.Bernice Fischer had gripped my attention all the way.\" - Devika Primic, Amazon reviewer",
  "genres": [
    "Fantasy"
  ],
  "author": "Bernice Fischer",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/23385879-jeff-madison-and-the-shimmers-of-drakmere"
}