{
  "title": "Never Say Never",
  "description": "This is the ultimate arrangement for Sofia Herrera. Sometimes in life, you’re forced to consider the unthinkable—especially when desperation is the only card you have left to play.Lose yourself in this sensual, sexy and steamy romantic erotica for women series between Billionaire, Bryce Van Der Linden, and former real estate queen, turned escort, Sofia Herrera in this kinky and tumultuous billionaire romance novel that contains themes of domination and submission.If you liked Gone - Part One (The GONE Series Book 1) by Deborah Bladon, Filthy Beautiful Lies by Kendall Ryan or His Absolute Arrangement: A Scandalous Billionaire Love Story (Jessika, #1) by Cerys du Lys, you’ll LOVE Scarlett Avery’s Unbearable Passion Coming Of Age Erotica series.* * *I never imagined I’d be forced in this position, but I really don’t have a choice after my financial debacle. I really can only blame myself for taking on that weasel as a partner. I desperately need the money and I’m willing to contemplate the unimaginable...a new career as a New York City high-priced escort.Let’s be honest, there are few professions that pay this well and come with these perks.I just hope my first client is well, decent. As I approach him, I notice the unlit cigar sitting in front of him and my heart skips a beat when he turns to look at me. As nervous as I’ve been all day long anticipating this encounter, I’m excited to see that Billionaire Bryce Van Der Linden is absolutely breathtakingly stunning. He was just supposed to be a client, but he’s giving me more pleasure than any other man has ever given me before.Bryce makes it impossible for me to be with another man and I don’t know how long I can resist his charms.If I fully submit to his desires, will I lose myself? I am Sofia Herrera, but as an escort, I’m known Amanda Hardy and this is my story. **Warning: This Erotic Romance Series For Adult is full of mind-blowing sex, spanking, afternoon quickies in public places, domination and a few other naughty things that will make you blush. Proceed at your own risk... but, it’s well worth the naughty ride!**Note: These scintillating steamy romantic suspense new releases contain themes of domination and submission.**This romantic erotica for women novel is for discerning eyes ONLY. Mature Content Warning** 18+ for language and adult situations.**Discover What Other Readers Already Know About These Romantic Suspense Novels**",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary",
    "Novella",
    "Contemporary Romance",
    "BDSM",
    "Adult"
  ],
  "author": "Scarlett Avery",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/23388755-never-say-never"
}