{
  "title": "Wings in the Dark",
  "description": "Witty and stylish in the classic Dashiell Hammett tradition, Michael Murphy’s latest high-flying Jake & Laura mystery features a Hawaiian honeymoon that’s interrupted when their friend Amelia Earhart is accused of murder.   Hawaii, 1935. Mystery novelist Jake Donovan and actress Laura Wilson are in gorgeous sun-soaked Hawaii, but their best-laid plans for canoodling on the beach are interrupted by a summons from famed aviatrix Amelia Earhart. It seems a local businessman has been gunned down next to her plane. In just days, the famous pilot intends to fly from Honolulu to Los Angeles, making aviation history over the Pacific. But now, without Jake and Laura’s help, Earhart’s flight might never take off.   Trailing a killer, the newlyweds’ sleuthing leads to a jealous pilot, a cigar-chomping female officer of the “Royalist Militia,” and a notoriously disagreeable lieutenant colonel named Patton. With a sinister killer lurking in the shadows, it’s safe to say the honeymoon is over . . . and the danger has just begun.Praise for Wings in the Dark   “Wow! . . . An enthralling mystery with strong characters, a complex plot and a fantastic ending tying things together superbly . . . I have no hesitation in highly recommending it to anyone who enjoys thrillers and mysteries!”—Splashes Into Books   “The third installment in Murphy’s series is just as much fun as the first. The mystery is full of twists with an ample amount of red herrings, suspects, and action.”—Mystery Please!   “Jake and Laura are a really engaging crime-fighting couple.”—It Takes a Woman   “I heartily recommend the Jake & Laura mysteries, and this book specifically, if you like cozy mysteries that have a flair for the dramatic, a great sense of style, and an epic amount of witty banter. Goes well with fresh-caught seafood, grilled over an open fire on the beach, and drinks served in coconut shells.”—Bibliotica   Praise for Michael Murphy’s Jake & Laura mysteries   “Glittering with a hint of Nick and Nora, Michael Murphy’s 1930s Manhattan provides a witty setting for murder and mayhem.”—Mary Daheim, bestselling author of The Alpine Yeoman, on The Yankee Club   “[Jake and Laura] are fun, witty, and charming, and [All That Glitters] is filled with the same kind of 1930s Hollywood glamour that made the film of The Thin Man such a classic.”—Popcorn Reads",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Cozy Mystery",
    "Detective",
    "Historical",
    "Fiction"
  ],
  "author": "Michael  Murphy",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/23395370-wings-in-the-dark"
}