{
  "title": "The Grand Hotel: A Novel",
  "description": "Welcome to the hotel where nobody checks out.When a desk clerk welcomes a group of tourists into his mysterious and crumbling hotel, the last thing he expects is that a lone girl on his tour may hold the power to unravel the hidden mystery that has lain for untold centuries within the structure’s walls.The Grand Hotel is a horror novel by esteemed bestselling author Scott Kenemore ( Zombie, Ohio ) that takes the reader on a thrilling ride through an interconnected series of stories narrated by the desk clerk and the residents of the hotel itself. And while it is not known whether or not the desk clerk is actually the devil incarnate, it is strange that so many visitors who come for a tour of the hotel have a way of never leaving.As the narrator takes you deeper and deeper into the heart of the hotel, secrets that have been hiding for aeons begin to show themselves. Although he is quite prepared for this experience, there is some question as to whether or not the rest of the world shares this readiness.Kenemore’s incredible style and originality carry The Grand Hotel to places most people only see in their nightmares. And while we don’t know all of the secrets that lie within the Grand Hotel, we know that the person who does hold that knowledge puts fear into the narrator himself—a thought that ought to terrify everyone.Skyhorse Publishing, under our Night Shade and Talos imprints, is proud to publish a broad range of titles for readers interested in science fiction (space opera, time travel, hard SF, alien invasion, near-future dystopia), fantasy (grimdark, sword and sorcery, contemporary urban fantasy, steampunk, alternative history), and horror (zombies, vampires, and the occult and supernatural), and much more. While not every title we publish becomes a New York Times bestseller, a national bestseller, or a Hugo or Nebula award-winner, we are committed to publishing quality books from a diverse group of authors.",
  "genres": [
    "Horror",
    "Audiobook",
    "Fantasy",
    "Fiction",
    "Mystery",
    "Short Stories",
    "Paranormal"
  ],
  "author": "Scott Kenemore",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/23396039-the-grand-hotel"
}