{
  "title": "The Collapse: The Accidental Opening of the Berlin Wall",
  "description": "On the night of November 9, 1989, massive crowds surged toward the Berlin Wall, drawn by an announcement that caught the world by East Germans could now move freely to the West. The Wall -- infamous symbol of divided Cold War Europe -- seemed to be falling. But the opening of the gates that night was not planned by the East German ruling regime -- nor was it the result of a bargain between either Ronald Reagan or George H.W. Bush and Soviet leader Mikhail Gorbachev. It was an accident. In The Collapse, prize-winning historian Mary Elise Sarotte reveals how a perfect storm of decisions made by daring underground revolutionaries, disgruntled Stasi officers, and dictatorial party bosses sparked an unexpected series of events culminating in the chaotic fall of the Wall. With a novelist's eye for character and detail, she brings to vivid life a story that sweeps across Budapest, Prague, Dresden, and Leipzig and up to the armed checkpoints in Berlin. We meet the revolutionaries Roland Jahn, Aram Radomski, and Siggi Schefke, risking it all to smuggle the truth across the Iron Curtain; the hapless Politburo member GüSchabowski, mistakenly suggesting that the Wall is open to a press conference full of foreign journalists, including NBC's Tom Brokaw; and Stasi officer Harald Jär, holding the fort at the crucial border crossing that night. Soon, Brokaw starts broadcasting live from Berlin's Brandenburg Gate, where the crowds are exulting in the euphoria of newfound freedom -- and the dictators are plotting to restore control. Drawing on new archival sources and dozens of interviews, The Collapse offers the definitive account of the night that brought down the Berlin Wall.",
  "genres": [
    "History",
    "Nonfiction",
    "Germany",
    "Politics",
    "Russia",
    "European History",
    "German Literature"
  ],
  "author": "Mary Elise Sarotte",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/23393023-the-collapse"
}