{
  "title": "Saving Mr. Terupt",
  "description": "\"An exciting story about what really matters, Saving Mr. Terupt is warm, wise, and packed with hope.\"--JOAN BAUER, Newbery Honor WinnerThe kids and their favorite teacher from Because of Mr. Terupt and Mr. Terupt Falls Again return for a third book in the funny, warmhearted series for fans of Wonder.Seventh grade was going to be awesome. The only thing missing was Mr. Terupt.The kids from Mr. Terupt’s fifth- and sixth-grade classes are entering their first year of junior high school. There’s a lot to be excited about, but there are new challenges, too. Peter and Jeffrey face tough competition on their wrestling team. Alexia has a disastrous first day of school, and that’s only the beginning. Anna is desperate for Charlie to propose to her mother—what is he waiting for?! Danielle isn’t feeling so well, but she's trying to tough it out, like Grandma. Trouble with a bully makes Luke dread going to school for the first time ever. And Jessica is waiting anxiously for an acceptance to a theater retreat in New York City.      Everyone is missing Mr. Terupt. When a fight threatens to break up the group forever, they think their favorite teacher is the only one who can help them. But the kids soon find out that it’s Mr. Terupt who needs saving.  This novel includes extra content in the back of the book. Readers will find a Junior High Survival Guide with tips from the old gang!  \"Buyea has a knack for making his character’s voices distinct. This offering will resonate with tween audiences seeking realistic stories with multifaceted characters. Fans of the “Terupt” novels will cheer as the Snow Hill crowd enters seventh grade, though this latest volume will also appeal to newcomers to the series.\"--\nSchool Library Journal\n\"This third in the series [is] as easy for new readers to pick up as it is for returning fans. A warmly gracious invitation to a convincing middle school world.\"--\nKirkus Reviews\n \"The individual personalities and abilities of Buyea’s characters emerge through their narratives as they tell about their interests and feelings, including moves from friendships to budding romantic relationships. Danielle’s narrative includes a scientific explanation of diabetes type one and her courageous attitude in learning how to manage her health. This is an engaging read with broad appeal.--VOYA, RecommendedFrom the Hardcover edition.",
  "genres": [
    "Realistic Fiction",
    "Middle Grade",
    "Fiction",
    "Young Adult",
    "Friendship",
    "Contemporary",
    "School"
  ],
  "author": "Rob Buyea",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/23395368-saving-mr-terupt"
}