{
  "title": "Enabling Acts: The Hidden Story of How the Americans with Disabilities Act Gave the Largest US Minority Its Rights",
  "description": "The first major behind-the-scenes account of the history, passage, and impact of the Americans with Disabilities Act (ADA)—the landmark moment for disability rightsThe Americans with Disabilities Act (ADA) is the widest-ranging and most comprehensive piece of civil rights legislation ever passed in the United States, and it has become the model for disability-based laws around the world. Yet the surprising story behind how the bill came to be is little known.In this riveting account, acclaimed disability scholar Lennard J. Davis delivers the first on-the-ground narrative of how a band of leftist Berkeley hippies managed to make an alliance with upper-crust, conservative Republicans to bring about a truly bipartisan bill. Based on extensive interviews with all the major players involved including legislators and activists, Davis recreates the dramatic tension of a story that is anything but a dry account of bills and speeches. Rather, it’s filled with one indefatigable character after another, culminating in explosive moments when the hidden army of the disability community stages scenes like the iconic “Capitol Crawl” or an event when students stormed Gallaudet University demanding a “Deaf President Now!”From inside the offices of newly formed disability groups to secret breakfast meetings surreptitiously held outside the White House grounds, here we meet countless unsung characters, including political heavyweights and disability advocates on the front lines. “You want to fight?” an angered Ted Kennedy would shout in an upstairs room at the Capitol while negotiating the final details of the ADA. Congressman Tony Coelho, whose parents once thought him to be possessed by the devil because of his epilepsy, later became the bill’s primary sponsor. There’s Justin Dart, adorned in disability power buttons and his signature cowboy hat, who took to the road canvassing 50 states, and people like Patrisha Wright, also known as “The General,” Arlene Myerson or “the brains,” “architect” Bob Funk, and visionary Mary Lou Breslin, who left the hippie highlands of the West to pursue equal rights in the marble halls of DC.",
  "genres": [
    "Disability",
    "History",
    "Nonfiction",
    "Politics",
    "Disability Studies",
    "Health"
  ],
  "author": "Lennard J. Davis",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/23395734-enabling-acts"
}