{
  "title": "Bombs Away",
  "description": "In his acclaimed novels of alternate history, Harry Turtledove has scrutinized the twisted soul of the twentieth century, from the forces that set World War I in motion to the rise of fascism in the decades that followed. Now, this masterful storyteller turns his eyes to the aftermath of World War II and asks: In an era of nuclear posturing, what if the Cold War suddenly turned hot?Bombs Away begins with President Harry Truman heeding the advice of General Douglas MacArthur, whose control of the ground war in Korea has slipped disastrously away. MacArthur recognizes a stark reality. The U.S. military has been cut to the bone after victory over the Nazis—while China and the U.S.S.R. have built up their forces. The only way to stop the Communist surge into the Korean Peninsula and save thousands of American lives is through a nuclear attack. MacArthur advocates a strike on Chinese targets in Manchuria. In actual history, Truman rejected his general’s advice. But here, he does not. And the miscalculation turns into a disaster when Truman fails to foresee Russia’s reaction.Almost instantly, Stalin strikes U.S. allies in Europe and Great Britain. And as the shock waves are settling, the two superpowers are caught in a horrifying face-off. Will they attack each other directly with nukes? And what countries will be caught in between?The fateful global drama plays out through the experiences of ordinary people—from a British barmaid to a Ukrainian war veteran to a desperate American soldier alone behind enemy lines in Korea. For them, as well as Truman, Mao, and Stalin, the whole world has become a battleground. Strategic strikes lead to massive movements of ground troops. Cities are destroyed, economies ravaged. And on a planet under siege, the sounds and sites of nuclear bombs become a grim harbinger of a new reality: the struggle to survive man’s greatest madness.",
  "genres": [
    "Alternate History",
    "Fiction",
    "Historical Fiction",
    "Science Fiction",
    "Audiobook",
    "War",
    "Historical"
  ],
  "author": "Harry Turtledove",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/23395673-bombs-away"
}