{
  "title": "The Sweet Life: Find Passion, Embrace Fear, and Create Success on Your Own Terms",
  "description": "One of YouTube’s top beauty and fashion influencers offers her motivational manual on finding your passion, building confidence, and creating your own success story.   After emigrating from Mexico at six years old with her family, Dulce Candy Ruiz spent her formative years in a trailer park, watching her parents work in strawberry fields. After high school, Dulce joined the military as a mechanic and was soon deployed to Iraq, fixing generators in an environment that forced this bubbly girlie-girl to blend in. Tired of wearing fatigues and no makeup for weeks on end, Dulce started filming makeup tutorials and posting them to YouTube to reclaim her femininity—and have a little fun. In just a few years, Dulce has skyrocketed into superstardom with the creation of her YouTube channel, Dulce Candy—which now has more than two million subscribers—becoming one of the site’s top beauty and fashion influencers, transforming Dulce from a shy, self-doubting army specialist into a risk-taking businesswoman, confident role model, and beauty expert.   THE SWEET LIFE chronicles Dulce Candy’s inspiring story, sharing her hard-won wisdom about finding your passion, answering opportunity when it knocks on your door, and overcoming failure. She emphasizes the importance of inner and outer beauty and being true to yourself, embracing the things that make you unique and using them to live your dreams, including practical advice on building your career (“keep your role models close but your mentors closer”), staying focused when the going gets tough (“progress, not perfection”), and balancing the personal and professional (“don’t settle, settle down”).",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Self Help",
    "Fashion",
    "Personal Development"
  ],
  "author": "Dulce Candy Ruiz",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/23398812-the-sweet-life"
}