{
  "title": "Mental Shrillness",
  "description": "The Mental Shrillness ward will shock with six twist ending horror tales:\"Memorial Day Descent\" - experience a showdown between an old mansion and a soldier's painful, recurring war memories. A first place story contest winner.\"Pains in the Glass\" - Tim and Wanda love each other but neither sees the cracks in their flawed marriage looking glass. Today is the day one learns of betrayal so powerful that it will shatter, cut and bleed the other to pieces.\"Dead Warmed Over\" - learn if it's possible that a tortured man can love his wife too much. Ben's intense love for wife Jackie is realized in a haunted bathtub. Another first place story contest winner.\"Falling the Bobbitt Way\" - Tracy and John's sweet marriage vow warps into sinister sadomasochism. Find out if they can break the vow and ever be the same.\"Dueling Eyes\" - GAZE upon an unmoving glass eye compelling its host to entertain self-mutilation tendencies. WATCH as Madison tries to save Killroy in the dark, dirty alley from the glint of a malevolent mugger's blade. STARE helpless as the cold steel and the glass eye attempt to complete a shocking mission.\"The Illusion\" - There are things Damon Brooks wishes he could change about his life. He thinks he has it bad until a dying, misshapen creature shows him that the other side wants much more to change their deaths. Prepare for a nightmarish struggle at a carnival between good and evil.At the end of Mental Shrillness author notes are provided for readers interested in each story's history and what motivated author Todd Russell to pen these strange, dark tales. BONUS MATERIAL (1st Edition Bonus Material)- Includes four additional stories written during the same era: \"Father Knows Winners Best\" \"The Clock Called Fate\" \"$$$ Knowledge & Power $$$\" \"Honey, I Shrunk the In-Laws\"- Bonus Mental Shrillness Author Notes",
  "genres": [
    "Horror"
  ],
  "author": "Todd Russell",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/11416476-mental-shrillness"
}