{
  "title": "Captives of the Night",
  "description": "Leila Beaumont is a gorgeous and talented portrait painter trapped in a loveless marriage with her profligate husband, Francis. Though long ago, Francis very much played the hero, rescuing and wedding the orphaned 17-year-old Leila - Francis' more recent hedonistic lifestyle of drinking, drugging and womanizing has not only earned him quite a few enemies in London, but lost him the love of his wife.When Francis turns up dead in the Beaumont townhouse, right after a loud and vitriolic argument with his wife, Leila is seen as the primary suspect, innocent though she is. Because of Francis' many enemies and victims, government officials instigate a quiet investigation, many of whom fear fallout from Francis' numerous blackmail and extortion schemes.The man they call on - the sexy blue-eyed Comte d'Esmond - is a man of many talents who has spent the past ten years as one of the government's most trusted covert operatives; a man who also has a dark and treacherous past.Neither Leila, nor d'Esmond is especially happy to be working together - their relationship is one of intense attraction accompanied by intense resistance. Leila had long ago given up on the idea of love and saw her husband as a means of propriety in London, but now she finds the dangerous Esmond's seductive charm nearly irresistible.But work together they must: Esmond, with a carefully hidden identity that would shock Leila to the core and Leila with her own secrets to keep...It's danger that unites them and it's danger that chains their hearts: Esmond's virility and bold touch enflame Leila's blood...and draw her into the most irresistible intrigue of all...truly passionate love.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Regency",
    "Historical Fiction",
    "Fiction",
    "Audiobook"
  ],
  "author": "Loretta Chase",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/11417291-captives-of-the-night"
}