{
  "title": "Lesser Beasts: A Snout-to-Tail History of the Humble Pig",
  "description": "Unlike other barnyard animals, which pull plows, give eggs or milk, or grow wool, a pig produces only one thing: meat. Incredibly efficient at converting almost any organic matter into nourishing, delectable protein, swine are nothing short of a gastronomic godsend—yet their flesh is banned in many cultures, and the animals themselves are maligned as filthy, lazy brutes.As historian Mark Essig reveals in Lesser Beasts, swine have such a bad reputation for precisely the same reasons they are so valuable as a source of food: they are intelligent, self-sufficient, and omnivorous. What’s more, he argues, we ignore our historic partnership with these astonishing animals at our peril. Tracing the interplay of pig biology and human culture from Neolithic villages 10,000 years ago to modern industrial farms, Essig blends culinary and natural history to demonstrate the vast importance of the pig and the tragedy of its modern treatment at the hands of humans. Pork, Essig explains, has long been a staple of the human diet, prized in societies from Ancient Rome to dynastic China to the contemporary American South. Yet pigs’ ability to track down and eat a wide range of substances (some of them distinctly unpalatable to humans) and convert them into edible meat has also led people throughout history to demonize the entire species as craven and unclean. Today’s unconscionable system of factory farming, Essig explains, is only the latest instance of humans taking pigs for granted, and the most recent evidence of how both pigs and people suffer when our symbiotic relationship falls out of balance.An expansive, illuminating history of one of our most vital yet unsung food animals, Lesser Beasts turns a spotlight on the humble creature that, perhaps more than any other, has been a mainstay of civilization since its very beginnings—whether we like it or not.",
  "genres": [
    "History",
    "Nonfiction",
    "Food",
    "Animals",
    "Science",
    "Nature",
    "Audiobook"
  ],
  "author": "Mark Essig",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/23399050-lesser-beasts"
}