{
  "title": "Intentions",
  "description": "Originally published in 1891 when Wilde was at the height of his form, these brilliant essays on art, literature, criticism, and society display the flamboyant poseur’s famous wit and wide learning. A leading spokesman for the English Aesthetic movement, Wilde promoted \"art for art’s sake\" against critics who argued that art must serve a moral purpose. On every page of this collection the gifted literary stylist admirably demonstrates not only that the characteristics of art are \"distinction, charm, beauty, and imaginative power,\" but also that criticism itself can be raised to an art form possessing these very qualities.In the opening essay, Wilde laments the \"decay of Lying as an art, a science, and a social pleasure.\" He takes to task modern literary realists like Henry James and Emile Zola for their \"monstrous worship of facts\" and stifling of the imagination. What makes art wonderful, he says, is that it is \"absolutely indifferent to fact, [art] invents, imagines, dreams, and keeps between herself and reality the impenetrable barrier of beautiful style, of decorative or ideal treatment.\"The next essay, \"Pen, Pencil, and Poison,\" is a fascinating literary appreciation of the life of Thomas Griffiths Wainewright, a talented painter, art critic, antiquarian, friend of Charles Lamb, and — murderer.The heart of the collection is the long two-part essay titled \"The Critic as Artist.\" In one memorable passage after another, Wilde goes to great lengths to show that the critic is every bit as much an artist as the artist himself, in some cases more so. A good critic is like a virtuoso interpreter: \"When Rubinstein plays … he gives us not merely Beethoven, but also himself, and so gives us Beethoven absolutely…made vivid and wonderful to us by a new and intense personality. When a great actor plays Shakespeare we have the same experience.\"Finally, in \"The Truth of Masks,\" Wilde returns to the theme of art as artifice and creative deception. This essay focuses on the use of masks, disguises, and costume in Shakespeare.For newcomers to Wilde and those who already know his famous plays and fiction, this superb collection of his criticism offers many delights.The introduction is by Percival Pollard New York, July, 1905.",
  "genres": [
    "Classics",
    "Essays",
    "Nonfiction",
    "Art",
    "Philosophy",
    "19th Century",
    "Plays"
  ],
  "author": "Oscar Wilde",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/1141685.Intentions"
}