{
  "title": "Ron Jeremy: The Hardest (Working) Man in Showbiz",
  "description": "Dear Reader,You probably think you already know me because you've seen one of my two thousand porn movies, or maybe you caught me on VH1's The Surreal Life, or rented my movie Pornstar, or heard me rapping in someone's music video. . . . Yeah, that's me. But believe it or not, that's not the real me. The real me is just an average guy trying to make it in the world like everyone else.Well . . . sort of . . .I always wanted to be a legitimate actor (that's right, don't laugh). But when the gigs didn't come I didn't let it get me down. Instead, I'd fall into the arms of beautiful women and let them heal my bruised soul. One of them insisted on taking nude pictures of me and sending them to Playgirl. For some reason I agreed, and when it was published, I got tons of phone calls. One of them was from a casting director who wanted me in his next picture. There was only one problem: it was a porno.\"What do you think?\" I asked my dad.He rubbed his chin and paused for a moment.\"I think you should do it,\" he said. \"I mean, you're already halfway there, and . . . at least you'll be performing, right?\"That's exactly what I thought. From there, my life only got better. I traveled all over the world, made tons of money, and got more famous every year. But more than anything, I wanted to be legit, so I started doing stand-up comedy, moved to Hollywood, and kept my acting hopes alive by mingling with every major—Wait a minute, you don't care about any of this, do you? You just want to know about the celebrity orgies, the constant sex, and how I learned to blow myself. . . . All right, fine.But keep reading. . . . I guarantee you'll get more than you bargained for. . . .—Ron Jeremy",
  "genres": [
    "Biography",
    "Nonfiction",
    "Autobiography",
    "Memoir",
    "Pornography",
    "Film",
    "Science"
  ],
  "author": "Ron Jeremy",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/234026.Ron_Jeremy"
}