{
  "title": "Triumph and Treasure",
  "description": "She was a means to an end…he wasn’t supposed to ever love her.He lived an idyllic life…One day, Flynn, Earl of Luxmoore was a wealthy, carefree lord, courting the woman he intended to wed. And the next day, he’s stripped of all but his title and left with no means to care for his loved-ones. When the person responsible for his ruination offers him a solution—marriage to an unwilling and resentful American beauty—he has no choice but to accept. Not if he wants to care for his ailing mother, elderly grandmother, and disabled sister. Fate dealt her a cruel hand… Angelina Ellsworth unwittingly committed bigamy, and when she finds herself pregnant, she’ll do anything to protect her baby. Including fleeing to England and marrying a handsome nobleman, every bit as desperate and opposed to their marriage of convenience as she. She agrees to wed Flynn, stipulating two conditions: the union is in name only, and after a year, they’ll go their separate ways. Except, Angelina didn’t count on her first husband refusing to let her go.Resentment and anger war with passion and desire…Flynn risks his life to protect Angelina from the madman pursuing her, but is his sacrifice enough? Can a woman who’s vowed to never trust a man again and an embittered lord find contentment in an arranged marriage neither wanted? ________________________________________________________________________Historical romance at its best! This sigh-worthy Scottish Regency by a USA Today bestselling author will have you reaching for the tissues! You’ll eagerly escape into this page-turner and cheer as Flynn and Angelina take a chance on love. If you enjoy reading arranged marriages love stories packed with suspense, a dash of humor, and heartwarming emotion, then you’ll adore Collette Cameron’s passionate HIGHLAND HEATHER ROMANCING A SCOT Series. Buy TRIUMPH AND TREASURE today and settle into your favorite reading nook for an unforgettable historical romance escapade you can’t put down. Though this book can easily be read as a stand-alone, most readers prefer to read the series in order.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Regency",
    "Historical Fiction",
    "Regency Romance",
    "Scotland"
  ],
  "author": "Collette Cameron",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/23411579-triumph-and-treasure"
}