{
  "title": "Strong Inside",
  "description": "This fast-paced, richly detailed biography, based on more than eighty interviews, digs deep beneath the surface to reveal a more complicated and profound story of sports pioneering than we've come to expect from the genre. Perry Wallace's unusually insightful and honest introspection reveals his inner thoughts throughout his journey.Wallace entered kindergarten the year that \"Brown v. Board of Education\" upended \"separate but equal.\" As a twelve-year-old, he sneaked downtown to watch the sit-ins at Nashville's lunch counters. A week after Martin Luther King Jr.'s \"I Have a Dream\" speech, Wallacehe entered high school, and later saw the passage of the Civil Rights and Voting Rights Acts. On March 16, 1966, his Pearl High School basketball team won Tennessee's first integrated state tournament the same day Adolph Rupp's all-white Kentucky Wildcats lost to the all-black Texas Western Miners in an iconic NCAA title game.The world seemed to be opening up at just the right time, and when Vanderbilt recruited him, Perry Wallace courageously accepted the assignment to desegregate the SEC. His experiences on campus and in the hostile gymnasiums of the Deep South turned out to be nothing like he ever imagined.On campus, he encountered the leading civil rights figures of the day, including Stokely Carmichael, Martin Luther King Jr., Fannie Lou Hamer, and Robert Kennedy and he led Vanderbilt's small group of black students to a meeting with the university chancellor to push for better treatment.On the basketball court, he experienced an Ole Miss boycott and the rabid hate of the Mississippi State fans in Starkville. Following his freshman year, the NCAA instituted \"the Lew Alcindor rule,\" which deprived Wallace of his signature move, the slam dunk.Despite this attempt to limit the influence of a rising tide of black stars, the final basket of Wallace's college career was a cathartic and defiant dunk, and the story Wallace told to the Vanderbilt Human Relations Committee and later \"The Tennessean\" was not the simple story of a triumphant trailblazer that many people wanted to hear. Yes, he had gone from hearing racial epithets when he appeared in his dormitory to being voted as the university's most popular student, but, at the risk of being labeled \"ungrateful,\" he spoke truth to power in describing the daily slights and abuses he had overcome and what Martin Luther King had called \"the agonizing loneliness of a pioneer.\"\"",
  "genres": [
    "Sports",
    "Nonfiction",
    "Biography",
    "History",
    "Basketball",
    "Biography Memoir",
    "Education"
  ],
  "author": "Andrew Maraniss",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/23413849-strong-inside"
}