{
  "title": "Sea of Faith: Islam and Christianity in the Medieval Mediterranean World",
  "description": "The long, shared history of Christianity and Islam began, shortly after Islam emerged in the early seventh century A.D., with a Who would inherit the Greco-Roman world of the Mediterranean? Sprung from the same source―Abraham and the Revelation given to the Jews―the two faiths played out over the course of the next millennium what historian Stephen O'Shea calls \"a sibling rivalry writ very large.\" Their cataclysmic clashes on the battlefield were balanced by long periods of co-existence and mutual enrichment, and by the end of the sixteenth century the religious boundaries of the modern world were drawn. In Sea of Faith , O'Shea chronicles both the meeting of minds and the collisions of armies that marked the interaction of Cross and Crescent in the Middle Ages―the better to understand their apparently intractable conflict today. For all the great and everlasting moments of cultural interchange and tolerance―in Cordoba, Palermo, Constantinople―the ultimate \"geography of belief \" was decided on the battlefield. O'Shea vividly recounts seven pivotal battles between the forces of Christianity and Islam that shaped the Mediterranean world―from the loss of the Christian Middle East to the Muslims at Yarmuk (Turkey) in 636 to the stemming of the seemingly unstoppable Ottoman tide at Malta in 1565. In between, the battles raged round the Mediterranean, from Poitiers in France and Hattin in the Holy Land during the height of the Crusades, to the famed contest for Constantinople in 1453 that signaled the end of Byzantium. As much as the armies were motivated by belief, their exploits were inspired by leaders such as Charles Martel, Saladin, and Mehmet II, whose stirring feats were sometimes accompanied by unexpected changes of heart.",
  "genres": [
    "History",
    "Religion",
    "Nonfiction",
    "Medieval",
    "Islam",
    "Medieval History",
    "Christianity"
  ],
  "author": "Stephen O'Shea",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/234212.Sea_of_Faith"
}