{
  "title": "Brilliant: Made in the Image of God",
  "description": "This coffee-table-sized hardcover uses a timeline of scientific and archaeological facts to validate that the Creation account of the Bible is accurate.  Cultures throughout the world are filled with mysteries which do not fit the pervasive evolutionary time-frame, but make perfect sense if the Biblical timeline of history is accepted. Brilliant takes the Bible seriously and every page contains an artifact from some ancient culture testifying to the reality of these true events of history.Every two-page spread is a different topic filled with revelations showing that the biblical timeline is correct and the millions-of-years evolutionary time-frame could not possibly be true. For  •    Soft, non-decayed dinosaur tissue has been documented inside of numerous dinosaur bones. This is absolutely impossible if these bones are millions of years old but perfectly fits the burial of dinosaurs 4350 years ago during Noah’s flood. Yet professors showing this information to students have been fired. Other pages display ancient burial stones from Peru revealing drawings of dinosaurs and ancient medical technology – both testifying to mankind’s brilliance and recent creation. •    The ice age was a direct consequence of the global flood. This is carefully explained and documented throughout the book. Following the flood, mankind was traveling the world looking for places to settle and seeking new sources of raw materials. One page documents an ancient map showing the coastline of Antarctica BEFORE it was covered by ice of the ice age. Modern textbooks place the start of the ice age starting 200,000 years ago - making this map impossibility. The Bible would place the ice age after the flood - meaning the existence of this map confirms biblical reality because people after the flood would have been exploring this area before it was covered with ice and documented what they found. •    Carbon-14 levels would have radically shifted following the flood and the implications of this are explained so that readers clearly understand why this method of dating cultures gives erroneous dates and has mislead people as to the true age of ancient artifacts. •    Neanderthal and Cro-Magnon man were simply races of people living in a harsh ice age environment immediately after the flood. They were actually highly intelligent human beings who developed chemical glue compounds which even modern researchers have struggled to reproduce and artwork few today could duplicate. There were obviously as intelligent and creative as modern man. •    Ancient Chinese artifacts document events from the Garden of Eden in both the written symbols of their language and ancient bronze sculptures. •    Pyramid structures build by ancient civilizations have been documented from around the world and had to have been produced simultaneously with the Egyptian pyramids. Even today it is debated how these ancient cultures could have developed such advanced technology so early in human history. Brilliant shows how this knowledge came from a source which predates the flood of Noah (i.e. knowledge from brilliant people living before the flood would have come through the flood with Noah and his family) and shows how multiple civilizations containing millions of people would have rapidly developed within 4-5 centuries of the flood. In general, Christians are woefully ignorant of how to fit the ice age, ape-men, archeological discoveries, continental plate tectonics, and/or ancient Chinese/Egyptian/Peruvian/and other cultures into a real Biblical timeline. Brilliant shows how all these things not only logically fit a Biblical perspective but confirm its accuracy while contradicting the evolutionary perspective.",
  "genres": [],
  "author": "Bruce A. Malone",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/23422500-brilliant"
}