{
  "title": "Dead Serious",
  "description": "\"You ever see one of those old western movies where the sheriff and the outlaw face each other in a dusty street? Revolvers at the ready? Good versus evil and all. Well, this is kind of like that. Only more f***ed.\" Naomi Knox is on her way to becoming the world's most worshipped Rock Goddess. I'm so in love with this chick that I could be the King to her Queen, the Devil to her Angel. But a wise soul once told me that your past is your foundation, and if it's crumbling, then you've got nothing left to build on. I'll fight the f*cking world to see her safe, risk my life just to hear her sing one more time. And then I'm going to marry her, put Turner babies in her belly, and live happily f*cking ever after. Or at least that's the plan. But you know what they say: the best laid schemes of mice and men … & & & Turner Campbell is a douche bag. No, seriously. He's a f*cking train wreck. But a precious train wreck. And I can't help myself: I love the sh*t out of him, even though I hate him. Even though I don't. Don't ask. It's complicated. But he's also a rock star and now, so am I. The Goddess of Guitar, I guess. All I really want is to make music and see how hard it is to fall in love with a man who's a devil at heart but sings like an angel. If I'm going to lay my heart on the line again though, I deserve a real chance. I won't be a pawn in this f*cking game any longer. I don't care how dangerous the stakes are anymore. I'm taking charge of my own destiny, like I should've all along. I won't have the wool pulled over my eyes and I won't bend over for fate. Get ready, b*tches, because Naomi Knox is coming for you. Mature - Ages 18 and Up. Contains sex, drugs, violence, and rock 'n' roll.",
  "genres": [
    "Romance",
    "New Adult",
    "Music",
    "Contemporary",
    "Musicians",
    "Contemporary Romance",
    "Dark Romance"
  ],
  "author": "C.M. Stunich",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/23413934-dead-serious"
}