{
  "title": "Oneness",
  "description": "LIFE CHANGING! IN UNPRECEDENTED DIVINE REVELATIONS, ONENESS GIFTS HUMANITY WITH AN ASTOUNDING NEW VISION OF WHO WE REALLY ARE - AND WHERE WE'RE HEADING.In February,1998, Rasha began a profound dialogue with the Universal Presence, \"Oneness\" - the Divinity we all share, and many refer to as \"God.\" As Oneness guided her step by step through the agonies and the exultation of an experiential voyage to God realization, Rasha painstakingly documented the principles that lay the foundation for a new level of understanding of the phenomenon we call \"life.\"These pages hold belief-shattering insights into the changes that are silently shaking the foundation of our lives, and our world. Here we learn how our personal reality is manifested - vibrationally -- and how our emotional responses set the stage for drawing those life-experiences to each of us. We learn to recognize the signs and symptoms of the ascension process - the shifting of our awareness to accelerating levels of reality - and exactly how to harness its potential.Oneness speaks in a voice that reaches out to the very heart of each of us. The words of Divine wisdom are loving and personal -- and the experience of embracing the understandings they hold is transformational. We come away from the simple act of reading feeling like we've been touched by something indescribable -- and holy.Filled with astounding metaphysical concepts and catalysts for change, Oneness speaks in a tone that is non-technical, and easy to grasp. Yet, in the same breath, the principles are totally life-altering. This book takes us to the outer reaches of our own humanness and to the depths of the Divinity within. Reading it becomes a sacred, experiential journey that leaves the reader empowered with timeless tools for real transformation and a clear roadmap of the inner path to enlightenment.Every now and then a book comes along that is so powerful that words cannot begin to describe the experiences people have when they read it. These rare, life-altering books always seem to show up at just the right moment, for each of us. Oneness is such a book - one that will change your life.",
  "genres": [
    "Spirituality",
    "Nonfiction",
    "Philosophy",
    "Self Help",
    "Religion",
    "Psychology"
  ],
  "author": "Rasha",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/234129.Oneness"
}