{
  "title": "طوابير الخوف",
  "description": "تتناول الرواية أثر الأحداث الأخيرة في مصر على مستقبل مصر والدول المجاورة العربية والإفريقية، تتناول الرواية أثر الأحداث الأخيرة في مصر على مستقبل مصر والدول المجاورة العربية والإفريقية، وخاصة على فلسطين، وعلى باقي دول العالم وتحالفاتها السياسية والعسكرية، بعد ثلاثين سنة تقريبًا من الآن، تحديدًا في عام 2050، من خلال رحلة مهاجرة طوارقية تبحث فيها عن الحقيقة، و إعادة التواصل بين البشر بحثًا عن سبلٍ أقل دموية لحل الخلافات.تبدأ الرواية في النيجر حيث احتكرت فرنسا ومصر، استغلال آبار الذهب واليورانيوم في المنطقة ما بين جوثاي وعولام، المسماه بخط الذهب. مصر تقدم خدمة توفير الأمن ضد السكان المحليين الذين يحاولون الدفاع عن مواردهم الطبيعية، وتدور معارك غير متكافئة القوى. تقوم مريمة، بقيادة وفد من عشيرتها، بالذهاب لمصر بحثًا عن التواصل دبلوماسيًا مع الحكومة المصرية، لكن الأحداث في مصر تأخذها في اتجاهٍ آخر، لم تتخيل الوصول إليهِ. يعينها في رحلتها ضابط أمن منشق، يسعى للبحث عن الحقيقة في عالمٍ امتلأ بالأوهام والأكاذيب حتى لم يعد يفرق بين أي حقٍ وضلال، فيذهب للبحث عن قائدهِ المنشق أيضًا في القدس حيث دبرت له عملية اغتيال فاشلة. من هنا تتفرع الأحداث بين ما يدور مع مريمة في مصر، وما يدور مع مازن في القدس، لكن الأحداث تعود لتترابط في النهاية، فيكتشف القارئ الصورة البانورامية لما حدث طوال عقودٍ من الزمان خلفت وراءها عالمًا كاملا على شفا الانفجار. -----فقرة الغُلاف الخَلفى:قلتُ لها أنهم يجب أن يفهموا أن الصراع ليس بيننا وبينهم، يجب أن نثبت لهم أننا لسنا جبهة الشرِّ التي يجب قتالُها.قالت وهي متكورةً حول نفسها محملقةً في الفراغ؛ أن الصراع لم يعد بين خير وشر؛ ولا بين حقٍ وضلال. الصراعُ الآن يتجلى في نفوسِ الناسِ على نحوٍ آخر؛ صراعٌ بين الثورةِ والانتصار لكرامةِ الإنسان وحريتهُ، وبين نفوسٍ أدمنت الاستكانة في حضنِ أبٍ غير شرعيٍ تترك مقاليد أمرها لهُ يصرفّها لهم كيف شاء؛ ثم تكبرهُ وتعظمهُ.صراعٌ بيننا وبين نفوسٍ فارغةٍ لا تملك القدرة على الثقةِ في نفسها، ولا ترغب في أن تتحمل مسئولية حياتها ومصيرها فتترك كل شيءٍ بيده.قالت أن في نفسِ كلٍّ منّا شهوة التعبّد – وهي رغبةٌ كباقي الرغائب الإنسانية- تبحثُ عن إلهٍ تقدسهُ وتقر له بالألوهيةِ، غير أن فشلهم في التدين – كفشلهم في كلِّ شيءٍ آخر- يجعلهم غير قادرين على تطبيق الجانب الغيبيّ في معادلة الإيمان، فيبحثون سريعًا عن إلهٍ و واضح وملموس يعرض أمامهم مباشرةً عجائب قدراتهِ في القتلِ والتعذيبِ والمنح، فيدينون لهُ بالولاءِ والتقديس.غير أنهم في هذه الأرض قد وجدوا لهم عدة آلهة!للتحميل مباشرةً :http://www.4shared.com/office/wU0thw2...",
  "genres": [],
  "author": "مصطفي يحيي",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/23429949"
}