{
  "title": "Taken",
  "description": "WELCOME BACK TO PASKELL  The spellbinding continuation of the best-selling YA fantasy saga, The Chasing the Wolf Series. Discover why readers are calling this series completely engrossing and downright addicting!  “Wow, Katie ,I am not surprised you did it again with this book 2 of the series, so good, had me feeling intense at the ending and can't wait for the third one to come out - I will be doing the countdown, please make it quick.lol .. Love that my characters Ava & Cyrus and Harry are still part of the book .. Good job as always my friend ...Love Gideon and Maysie, they are adorable together ....” – 5 Star Review“Love, love love it. A must read.” – 5 Star Review“This book is amazing felt like going home to Paskell again and having strangers come to town some very loveable some not....at first! Maysie and Gideon are perfect for each other, but have some obstacles to overcome that's an understatement! As usual there are some Harry twists and turns....scary moments when you think all is lost..but well no spoilers here you've got to read this one to find out what's going on with the pack Ava, Cyrus and the gang and see if Paskell survives this latest attack!!! This book is great for anyone who loves paranormal romance ad suspense just make sure you read book 1 Hunted. Loved it!” – 5 Star review Being a werewolf in Paskell means you’re safe from the world . . . At least it used to. Maysie Baptiste is settling into married life and making a place for herself in Paskell with all the other werewolves, but when Zoe and Rory M'Guire come back to town with their hybrid, Eve, it sets off an explosive chain of events that will rock the world. At the same time, Harry and Sam's relationship is heating up and while Harry would love to talk commitment, Sam is positive being involved with an Alpha is a one-way road to disaster. But with Spartak still hunting werewolves, love might have to wait - Forever . . . TAKEN is the highly anticipated second installment in The Chasing the Wolf Series, a fast-paced paranormal romance filled with betrayal, self-discovery, suspense, and a unique supernatural world that will leave you captivated and hungry for more. LOST (The Chasing the Wolf Book 3) is now available!",
  "genres": [
    "Paranormal"
  ],
  "author": "Katie Lee O'Guinn",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/23434868-taken"
}