{
  "title": "Pulcinellopedia",
  "description": "From the intriguing mind behind Codex Seraphinianus comes this beautifully illustrated tribute to the famed Neapolitan character Pulcinella (or \"Punch\" as he is referred to in English). This short monograph on Pulcinella is conceived as a extension of the Codex Seraphinianus , an encyclopedia filled with variations and fantasies on a theme.  Pulcinellopaedia Seraphiniana contains over one hundred extraordinary graphite illustrations with scarlet accents, some of which are depicted in comic-strip style. Conceived as a musical Suite, it is divided into nine scenes with an intermission. It features the oddly surreal and globally recognized character, whose origins have been lost in the mists of the time. An ancestor of Pulcinella was certainly Maccus, the protagonist of the Atellanae Fabulae , very popular farces in ancient Rome, but it was in the early seventeenth-century that the character assumed the name and costume that we all know. Distinguished by a long nose and typically dressed in white with a black mask, Pulcinella is often depicted in various kinds of misadventures and singing about love, hunger, and money. As he famously did in the Codex , Luigi Serafini, has created Pulcinellopaedia Seraphiniana in a unique language all its own, and has filled it with fascinating and mysterious illustrations that will no doubt prompt devotees to obsessively try to decipher the artist’s intention. Written by Serafini’s imaginative coauthor and alter ego \"P. Cetrulo,\" who represents Pulcinella himself, the book artfully presents the struggles of a rebellious antihero who must come to grips with the challenges of everyday life. Originally, a book about Pulcinella and his world appeared in 1984, after Serafini’s involvement with the 1982 Carnival of Venice, the first revival of the famous festivity after two centuries of silence. Now more than three decades later, this new edition has been extensively revised and includes a new afterword by the author. Like its predecessor, the original edition became immensely sought after and highly valuable, fetching more than one thousand dollars if book collectors were lucky enough to get their hands on a copy. All fans of Serafini’s work will treasure this volume. Rizzoli will also publish a deluxe limited edition with a signed and numbered print.",
  "genres": [
    "Art"
  ],
  "author": "Luigi Serafini",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/23439953-pulcinellopedia"
}