{
  "title": "Original Sin",
  "description": "Book 1 of the Dark Saints Motorcycle Club trilogy   Vicky's brother has done everything to keep her away from the Dark Saints MC  Vicky Platt has always been kept out of her brother Darren's affairs within the Dark Saints MC. But when she unknowingly meets the Saints' newest prospect in a bar far away from the clubhouse, Vicky suddenly finds herself with the chance to indulge in her most forbidden fantasies.   Liam Beck has no idea what he's gotten himself into  Harder than most other prospects and never one for obeying authorities, Liam Beck is intrigued by the woman who can match him drink for drink and wit for wit. But as he gets caught up more and more with Vicky Platt, he'll find that there are some lines that are best left uncrossed.   One kiss is all it takes.  One errant kiss, one wayward look, and one overheard whisper is enough to start a rumor that Vicky has gotten herself involved with someone at the club. When word reaches her brother's ears, Vicky must find a way to diffuse the situation or risk losing Liam.   EXCERPT  He was shocked for perhaps two seconds before his lips parted beneath hers, causing Vicky to moan lowly at the pliant softness of his mouth. While she might have initiated the kiss, he quickly took control, pulling her into his lap to plunder her mouth ruthlessly. His tongue probed, teased, and played, making her entire body hum with arousal as she clung to him. Both of them were oblivious to the taxi driver's exasperated expression as they devoured one another.  Liam tasted like cigarettes, whiskey, and pure, dark masculinity. It was like some kind of sweet, spicy, intoxicating liquor that she couldn't get enough of. As he sipped from her mouth again and again, she found herself quickly drugged. Groaning his name lowly, she ran her hands through his dark waves, her mouth leaving his to trail heated kisses over his neck and throat.",
  "genres": [],
  "author": "Amy Love",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/23439700-original-sin"
}