{
  "title": "Lust of the Vampires",
  "description": "A Paranornal Short Story Anthology. Within the cover of this book comes four short tales combining a mixture of lust, passion, fear, sex, and the mystery you have come to expect with vampires. Be enthralled as each story introduces a new vampire, and their prey, to chill your blood and raise your temperature with each sinful situation.Find out what happens when Damon leaves his sanctuary, his only intention to satisfy his hunger, or when Trent goes out in search of victims to create a new family to replace the one slaughtered by vampire hunters. Meet Paul, who bites off more than he can chew when he takes an older woman home for a night of rampant sex, and finally Reid, whose only concern is for the safety of the girl running into the forest, fear etched on her face.Four tales, four different settings, all full of passion, fear, lust, sex, and above all, vampires.Damon's StoryWaking from his sleep, Damon's hunger is eating away at his very existence and he knows he has to feed before it is too late. Leaving the safety of his sanctuary, he scours the streets until he finds the perfect home. In total darkness and set back from the other homes on the street, Damon peers through the window and sees Tyra.Entering silently, he is stunned to find his intended victim not only partially awake, but also waiting for him. As she tells him about the dreams she has been plagued by, Damon is drawn to her beauty, and as the heat of the moment becomes too much for the pair of them, he realizes he has found not just another victim, but the perfect partner for all eternity.Paul's StoryFor Paul, a night out usually meant going to a bar, downing a few shots, and then setting his sights on some young, twenty-something year old woman. Once he had marked his prey, he would buy her a few drinks, work his charm on her, then take her back to his place for a night of animalistic lust. But Roberta was different to his usual conquests. He had never seen her before and instead of being the shy, quiet type he normally set his sights on, she was a lot older than he was, and she oozed a natural confidence which made Paul want her even more.Following the usual night of sex, drink, and even more sex, Paul found out more about Roberta then he wanted, and also exactly why he had been warned to be careful.Trent's StoryFor the first time in his life, Trent awoke to find himself alone, his whole family taken from him by the hunters. Only Trent wasn't a normal man. Trent was a vampire, and the family the hunters had taken from him were the last of his kind. For Trent, this was the final insult.With nothing to lose and not wanting to spend eternity alone, Trent knew he had to create a new family. Only this family would be taken from the very society which had detested him and his kind for centuries.Using his vampire charm, good looks, and good old fashioned bluff on them, Jenn and Terri were unlucky enough to be the first to fall under his spell. By the time they realized what Trent really was, it was too late.Reid's StoryReid always tried his hardest to be totally honest, decent, and well mannered, especially when it came to women. So the day she ran past him and into the trees with a look of fear on her face, he did what all good Samaritans did, and followed her.All he wanted to do was make sure she was okay and unhurt, but each time he got close enough to speak to her, she screamed and sprinted further into the mists of the forest. Reid, still concerned for her safety, continued to chase after her until he suddenly stumbled and knocked himself out.When he woke, the thick forest was gone, and Reid found himself strapped to a wooden bed and held captive.With his own safety now his only concern, Reid decided to make a break for it and escape.",
  "genres": [],
  "author": "J.S. Morbius",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/23436464-lust-of-the-vampires"
}