{
  "title": "Bug",
  "description": "I stood in the clearing in the heart of the woods where the stars looked down upon the night. Head tilted back toward the darkened sky, eyes closed, I listened. The woods bordered my house—all one-hundred and thirty-something acres. Every little sound, every gurgle, rustle, bustle, buzz, hiss, peep, screech, hoot, cry, creak, crack or croak, I knew well. Harvest came every third Friday of the month. On that night, regardless of the weather, I carried the leather pouch into the woods to collect my mother’s specimens. I had done this for as long as I could remember. In the life of Bug Martin there are three things that are for certain. One, the third Friday of each month, also known as harvest night, she is forced to go into the woods alone to collect her mother’s shopping list of weirdness. Two, her mother’s less than sound mental state. And finally, the fact that Bug feels like an outsider both at home and at school. In her somewhat problematic, repetitive, lonely existence Bug has very little knowledge of her heritage…actually her memories in general are vague. Bug’s world seems to revolve around marking yet another day off her calendar and carrying on with her daily routine—the one true thing that she’s still in control of. However, just when Bug begins to question the circumstances that surround each harvest night, she is confronted with a blast from the past. Her old nemesis, Tobias Keogh, the boy who accused her mother of being a witch in front of their sixth grade class, has returned home. His reappearance brings two revelations into the light: one, that his memories don’t mesh with hers and two, that he knows far too much about her. In the process of questioning things and trying to come to terms with Tobias’s homecoming, Bug’s eyes are opened not only to new possibilities but to a whole new world…one that she never even knew she was a part of.",
  "genres": [],
  "author": "Shawn Reilly",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/23435426-bug"
}