{
  "title": "Christmas Cheer",
  "description": "Six talented authors make your Christmas lights twinkle with these modern-day adaptations of Jane Austen's novels. Curl up with some peppermint tea and enjoy something special in your stocking this holiday season.~~~~~~~The Work of an Instantby Jennifer BectonWhen Frederick Wentworth's ship docks at the Navy base in Charleston just in time for Christmas, Anne Elliot feels torn between desire to see her former fiancé and fear of rejection. Will taking a risk end in humiliation or give Anne a second chance with her first love? To find out, all she has to do is turn around and face him.Mischief and Mistletoeby Melissa BuellThrifty designer and secret Gothic novel enthusiast Cate Morland gets the opportunity of a lifetime to plan the costumes for the upcoming Dickens' Christmas Festival. There she meets Henry Tilney who shows an interest in more than Cate's costume designs. Mistaken by Henry's father as a rich heiress, Cate is invited to stay with the Tilney family at their estate. Will Henry feel the same for Cate once he discovers she is a seamstress paying her own way through design school?A Tale of Three Christmasesby Rebecca M. FlemingWhen their father dies, leaving their brother everything, life changes radically for the Dashwood girls. Librarian Ellie and musician Marianne have their work of course, but what about teenage Maggie? Maggie only has her writing—a surprising saving grace that helps her chronicle the ups and downs of life, love and family in this tale of three Christmases.With Love, from Emmaby Cecilia GrayA visit to Emma Gold's flower shop can save a relationship but a date at Lance Knightley's bar can take that relationship to the next level, so who should be considered Heartfield, Oregon's resident romance expert? Emma and Lance square off at their best friends' wedding to settle the score. Sparks fly as bets are made and favors are won in this contemporary Christmas retelling, recounted With Love, from Emma.It's a Wonderful Latteby Jessica Grey Evie St. Laurent can always count on three things: being single during Christmas in Los Angeles, her job as manager at Mansfield Perk, and Frank Nakatomi, her best friend and coworker, cheering her up when she's down. But when the glamorous Piper siblings come to town and sweep everyone off their feet, what Evie thought was sure in her life starts slipping away. It will take some Christmas magic and the help of a very special angel named Jane to help Evie see that the love she's been waiting for has been there all the time.Pride & Presentsby Kimberly TruesdaleLiz Bennet wants to make this Christmas the best that Longbourn Community Center has ever had. When basketball superstar Charles Bingley shows up to volunteer, it looks like that just might happen—even in spite of his unhelpful friend Will Darcy. But when everything starts to go wrong and Longbourn itself is in danger, Liz must set aside her pride and ask for help. Then she'll discover that the best presents are the ones you never expect.",
  "genres": [
    "Christmas",
    "Romance",
    "Fiction",
    "Holiday",
    "Short Stories",
    "Modern",
    "Chick Lit"
  ],
  "author": "Jennifer Becton",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/23435339-christmas-cheer"
}