{
  "title": "الدجاجة التي حلمت بالطيران",
  "description": "\"الدجاجة التي حلمت بالطيران\" رواية من الأدب الشعبي الكوري للروائية الأكثر شهرة \"صن - مي هوانغ\" تحكي فيها قصة دجاجة تدعى إبساك، لم يعد يرضيها أن تضع بيضها بحسب الطلب، تلك البيوض التي تؤخذ منها بعيداً لتباع في السوق. كانت تحلم بمستقبلها كل صباح وهي تتأمل الحظيرة التي تسرح فيها الحيوانات الأخرى بكل حرية. لذا، وضعت إبساك خطة للهروب إلى البرية لتفقيس إحدى تلك البيوض التي تضعها هي.تنجح إبساك في الهروب من قفص الدجاج وتبدأ بالبحث عن حلمها وهو أن يكون لها فرخ \"الكتكوت\" الخاص بها والذي تقوم بتربيته والاحتفاظ به، ولتحقيق تلك الغاية تتوجه إلى البرية، ولكن يتعين عليها بعد ذلك خوص صراع مع الكثير من الصعوبات غير المتوقعة، ولكنها مع ذلك لم تتخل عن حلمها، وذات يوم، تعثر إبساك على بيضة ضالة، فترقد عليها وتنتظر لكي تفقس. ولكن، سرعان ما تدرك أن هذه البيضة تنتمي إلى بطة برية، وليس إلى دجاجة.عندما تفقس البيضة، تبدأ الدجاجة وصغير البط الصغير \"جرين توب\" في مواجهة الواقع، وهو أنهما مختلفان في كل شيء وخاصة من ناحية الشكل... وبعد حين من الوقت تطير \"جرين توب\" بعيداً وتترك \"إبساك\" وراءها على الأرض، وتبقى إبساك وهي تراقب بعينيها طفلتها في فخر، وشعور من الحزن يعتورها ... ولكن يبقى عليها مواجهة ما هو أصعب لقد كانت عيني أنثى \"ابن عرس\" تترصدها! لتنتهي القصة نهاية فاجعة، ولتقول لقارئها أنه حتى في عالم الحيوان ثمن الحرية باهظ.. باهظ جداً.تصلح هذه الرواية لكي تكون ترنيمة للحرية، والشخصية الفردية، والأمومة. فهي تعرض قصّة بطلة تتمرد على عالمٍ محكومٍ بتقاليد الحظيرة.الدجاجة التي حلُمت بالطيران رواية ذات أبعاد عالمية، حيث تفتح نافذة على كوريا، وحيث أسرت قلوب ملايين القراء. تذكّرنا هذه الرواية نتيجة لتنوع شخصياتها الحيوانية؛ الدجاجة، البطة، الديك، الكلب، ابن عرس - بالروايات الكلاسيكية في الأدب الإنكليزي؛ مثل \"مزرعة الحيوانات\"، و\"شارلوتس ويب\".تُبرز هذه النسخة العربية الأولى من رواية صن- مي هوانغ (الخرافية) في زماننا هذا مسيرة شخصية لا تُنسى في الأدب العالمي بشكلٍ جميلٍ؛ وبالرسومات الخاصة التي ازدانت بها.",
  "genres": [
    "Fiction",
    "Fantasy",
    "Animals",
    "Asian Literature",
    "Novels",
    "Contemporary",
    "Childrens"
  ],
  "author": "Sun-mi Hwang",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/23441811"
}