{
  "title": "Destiny Series Volume 1-3",
  "description": "This is all three books from the Destiny Series combined into a boxed set. It's over 1,000 pages of Romance, Love, Suspense, Drama and Hotness.  **Warning these stories are recommended for 18 + due to the sexual content, coarse language and violence**  My Destiny  Brooke  Brooke gave up her dreams, relocating to another state with her husband Jake so he could pursue his, but when he commits the ultimate betrayal against her, she’s lucky to escape with her life. After moving back to her hometown, alone, she runs into Logan, the man who helped her, all those months ago. From the moment they first met, Brooke felt that they had a connection, and now she finds it stronger than ever. There is one thing stopping her from acting on her feelings towards him, though…her past.  Logan  From the moment he saw Brooke, Logan knew that she was the one he’d been searching for his whole life. Can he convince Brooke to let go of her insecurities so they can be together? What will happen when Brookes past comes back to haunt her? Will Logan still be around her to help her, or will she be left to face it on own her own?  Join Brooke and Logan as they share their dramatic story in My Destiny, the first of a two part instalment in the Destiny series. Their story is told in dual POV.  My Forever  My Forever is a continuation of Brooke and Logan’s fairy-tale love affair that started in My Destiny.  Brooke  Brooke finally lets go of her insecurities and accepts what’s in her heart…her undying love for Logan. After everything they went through in the beginning of their relationship, Brooke’s hopes of a happy life with her soul mate are crushed when tragedy strikes them yet again.  Logan  Logan finally has everything he ever wanted. Now that the threat to Brooke’s safety is behind them, all he wants is to live out the rest of his days with the woman of his dreams. Unfortunately, we don’t always get what we want. He has no idea that over the next few years they will face their toughest challenges yet.  Will their love for each other be strong enough to survive what lies ahead? Or will their fairy-tale finally come to an end?  Join Brooke and Logan in the final and dramatic conclusion to the Destiny series.  Damaged – Jacinta’s Story  Jacinta’s story takes place seven years after the day Brooke and Logan Cavanagh saved her from the violent clutches of her father. Her mother has now remarried and Jacinta has a new step-brother, Connor, whom she adores.  Jacinta  After Jacinta’s step-brother Connor moves to Sydney, she decides to move back there to live with him. She’s still so damaged from her violent past that, at twenty years of age, she has never had a serious boyfriend, and is still a virgin. So her best friend, Cassie, convinces her to have a one-night-stand with a stranger before her twenty-first birthday. The next day, Jacinta is surprised to find she’s actually upset that she will never see him again, but would not take back the memories of that night for anything. She also feels that she is way too damaged to ever have a serious relationship anyway. Unbeknownst to her, their paths will cross again. Will the attraction she felt that night still be there? Or will she regret it ever happened?  Mason  Mason doesn’t do relationships…ever. He has sex with random women, often.",
  "genres": [],
  "author": "J.L. Perry",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/23442053-destiny-series-volume-1-3"
}