{
  "title": "Broken Love",
  "description": "The second in a three book series by Ghiselle St. James.This isn't a perfect story. It's gritty, dark, frustrating but beautiful. Love isn't all hearts and flowers and bullshit declarations that are hollow and empty. If you love someone, you have to PROVE you're worth they're love. The road to happily ever after is paved with mistakes and horrible decisions...don't hold mine against me.******Sullivan:I have been captured by the only person I hate in this life; a person that I once foolishly loved. He is poison to me. Will I ever be free of him? Will I ever see Rachel again? Will I ever see my parents, my brother again? And Ben...will he ever know how I feel about him? So many wasted days I spent resisting him. A tear trickles down my face at that; because as I see Rick shaking that needle with a wicked gleam in his eye, I know this is thelast time anyone will ever see me alive.Ben:I've worked very hard to maintain this control I have, but in just a few weeks Sullivan Beal came into my life and toppled my carefully constructed walls, and for a moment I didn't care. Now that she is out of my life, I should be happy...but all I can do is think about her; how I miss her smileand how she made me feel free. I have to get her back. The love I have for her may not be perfect,but our relationship scarcely is. And that's what makes it perfect. She may be tainted with demons from her past that she holds close to her chest, but I will free her from them; because as frustrating as my sweet girl is...I'm in this for thelong haul. She might be broken, but I love her anyway.But one phone call...that dreaded phone call has me in a tailspin. Sullivan is kidnapped & it's a raceagainst time to find her before he hurts her...Or worse...",
  "genres": [
    "BDSM",
    "Romance",
    "Dark",
    "Erotica",
    "Erotic Romance"
  ],
  "author": "Ghiselle St. James",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/23445501-broken-love"
}