{
  "title": "Mended",
  "description": "The Steel Talons have gotten themselves in hot water.  With the Devils making a serious push in Talons territory and the Steel Talons president Ari worsening things with his rash actions, it's up to Jim to keep the fragile peace. The job's hard enough for him to do without Susan invading his thoughts.   Susan's facing a crisis of her own.  When her father is admitted to the hospital, it seems to jump start a new flood of problems that are threatening to bury Susan under. Worse, her newfound relationship with Jim has cast an uncertain shadow over her future medical career.   They must come to terms with who they are or risk losing it all.  Neither Susan nor Jim finds it easy keep away from each other. But just how true can they remain to who and what they are when everything in their worlds seems hell-bent on ripping them two of them apart.   Can they bridge the gap threatening to rip the two apart or will they always be on opposite sides of the law?   EXCERPT:  She clutched at him for dear life, and strangely, this felt more intimate than when they had sex. She was pressed against his back, and unlike getting laid, she had to put complete trust in his ability to keep her safe. She didn't like giving up control, especially to do something she had sworn she never would.  He increased his speed gradually as they continued, and stray hairs blew out of her clip, flying around her face in the brisk wind that felt fresh on her face.  He turned a corner, and the bike leaned. Susan nearly panicked as he leaned with it, and she had to lean with him. She was sure they were going to skid across the ground any second, crushing their legs beneath the heavy bike, but he righted it and sped down the street. Overwhelmed, Susan looked from side to side, noticing the buildings they passed streaking behind them. She’d never noticed how quickly the world went by in a car, and now, she wondered just how fast he drove. But it didn't matter; he held steady, and she loosened her hold on his waist just a bit so air could flow between them and cool her.  The sensation made her throw her head back, and for a moment, she didn't seem to be connected to the ground. The machine that vibrated beneath her disappeared with the road, and the wind carried her body. She closed her eyes and imagined clouds floating beneath her, and it made her laugh out loud.",
  "genres": [],
  "author": "Evelyn Glass",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/23446259-mended"
}