{
  "title": "Knights in Time",
  "description": "Three friends...warrior knights, One battle will change their lives, Love will change their worlds. HEROES LIVE FOREVERElinor Hawthorne has inherited a house haunted by two medieval knights, Basil Manneville and Guy Guiscard. Basil is literally the knight of her dreams. She never expected to “meet” a ghost face to face let alone fall in love with one. Living the normal life together that they’d want is impossible unless fate intervenes. A lifetime later fate does intervene. Basil, still in love with Elinor, is told her spirit lives on in a young woman. He is given another chance at life to find her. JOURNEY IN TIMEThe budding romance between London attorney, Shakira Constantine, and her client, Alex Lancaster is put to the test when the couple finds themselves torn through time back to the medieval world. It’s a world Alex has a strong connection to, a connection that will cost him his life unless they can find a way to return to this time. Without him, Shakira is condemned to live in a dangerous medieval world alone. Together they’ll struggle to discover a way back to the modern world while dealing with the political and social intrigues of 14th Century England. The intrigues of that world all too often work against their efforts to get home. KNIGHT BLINDNESSStephen Palmer, a wounded medieval knight finds himself torn through time from the battlefield to the modern and alien world. Seriously injured, he now must make his way in a world he has no context for and no knowledge about. Esme Crippen is hired as his tutor. Love is something he does understand and as the two fall into love, they both must overcome the fact the world thinks him mad with his time-travel talk, including Esme.  Show less",
  "genres": [
    "Time Travel",
    "Historical",
    "Romance",
    "Anthologies",
    "Historical Romance"
  ],
  "author": "Chris Karlsen",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/23442471-knights-in-time"
}