{
  "title": "Jacksonland: President Andrew Jackson, Cherokee Chief John Ross, and a Great American Land Grab",
  "description": "Jacksonland is the thrilling narrative history of two men—President Andrew Jackson and Cherokee chief John Ross—who led their respective nations at a crossroads of American history. Five decades after the Revolutionary War, the United States approached a constitutional crisis. At its center stood two former military comrades locked in a struggle that tested the boundaries of our fledgling democracy. Jacksonland is their story. One man we Andrew Jackson—war hero, populist, and exemplar of the expanding South—whose first major initiative as president instigated the massive expulsion of Native Americans known as the Trail of Tears. The other is a half-forgotten John Ross—a mixed-race Cherokee politician and diplomat—who used the United States’ own legal system and democratic ideals to oppose Jackson. Representing one of the Five Civilized Tribes who had adopted the ways of white settlers—cultivating farms, publishing a newspaper in their own language, and sending children to school—Ross championed the tribes’ cause all the way to the Supreme Court. He gained allies like Senator Henry Clay, Chief Justice John Marshall, and even Davy Crockett. In a fight that seems at once distant and familiar, Ross and his allies made their case in the media, committed civil disobedience, and benefited from the first mass political action by American women. Their struggle contained ominous overtures of later events like the Civil War and set the pattern for modern-day politics. At stake in this struggle was the land of the Five Civilized Tribes. In shocking detail, Jacksonland  reveals how Jackson, as a general, extracted immense wealth from his own armies’ conquest of native lands. Later, as president, Jackson set in motion the seizure of tens of millions of acres—“Jacksonland”—in today’s Deep South. Jacksonland is the work of renowned journalist Steve Inskeep, cohost of NPR’s Morning Edition , who offers here a heart-stopping narrative masterpiece, a tragedy of American history that feels ripped from the headlines in its immediacy, drama, and relevance to our lives. Harrowing, inspiring, and deeply moving, Inskeep’s Jacksonland is the story of America at a moment of transition, when the fate of states and nations was decided by the actions of two heroic yet tragically opposed men. CANDICE MILLARD, author of Destiny of the Republic and The River of Doubt“Inskeep tells this, one of the most tragic and transformative stories in American history, in swift, confident, colorful strokes. So well, and so intimately, does he know his subject that the reader comes away feeling as if Jackson and Ross’s epic struggle for the future of their nations took place yesterday rather than nearly two hundred years ago.”",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Biography",
    "Politics",
    "Presidents",
    "Native American"
  ],
  "author": "Steve Inskeep",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/23453117-jacksonland"
}