{
  "title": "Medical Apartheid: The Dark History of Medical Experimentation on Black Americans from Colonial Times to the Present",
  "description": "From the era of slavery to the present day, the first full history of black America’s shocking mistreatment as unwilling and unwitting experimental subjects at the hands of the medical establishment.\n\nMedical Apartheid is the first and only comprehensive history of medical experimentation on African Americans. Starting with the earliest encounters between black Americans and Western medical researchers and the racist pseudoscience that resulted, it details the ways both slaves and freedmen were used in hospitals for experiments conducted without their knowledge—a tradition that continues today within some black populations. It reveals how blacks have historically been prey to grave-robbing as well as unauthorized autopsies and dissections. Moving into the twentieth century, it shows how the pseudoscience of eugenics and social Darwinism was used to justify experimental exploitation and shoddy medical treatment of blacks, and the view that they were biologically inferior, oversexed, and unfit for adult responsibilities. Shocking new details about the government’s notorious Tuskegee experiment are revealed, as are similar, less-well-known medical atrocities conducted by the government, the armed forces, prisons, and private institutions.The product of years of prodigious research into medical journals and experimental reports long undisturbed, Medical Apartheid reveals the hidden underbelly of scientific research and makes possible, for the first time, an understanding of the roots of the African American health deficit. At last, it provides the fullest possible context for comprehending the behavioral fallout that has caused black Americans to view researchers—and indeed the whole medical establishment—with such deep distrust. No one concerned with issues of public health and racial justice can afford not to read Medical Apartheid, a masterful book that will stir up both controversy and long-needed debate.",
  "genres": [
    "Nonfiction",
    "History",
    "Race",
    "Science",
    "Medicine",
    "Social Justice",
    "Medical"
  ],
  "author": "Harriet A. Washington",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/114192.Medical_Apartheid"
}