{
  "title": "Zane",
  "description": "*** USA Today Bestseller - New Adult Contemporary Romance***From USA Today and New York Times bestselling author Jo Raven comes the third installment in the Inked Brotherhood series which began with ASHER.They call me Zen-man, the cool-headed one, the protector. I keep an eye out for everyone, take them in, find them homes. They think I’m the calm and collected one, the self-assured one, the one who knows the way. They think they see me. They think they know me.But they’re all wrong, because inside I’m broken. I have a jagged hole in my soul I can’t fix, a festering blackness. I’ve been to the pits of hell, and nobody comes back unscathed. Life in foster care f*cked me up, and now a thread is all that’s holding me together.So I sleep around and never date, keeping chicks away. One day I’ll snap, and when I do, there’s no telling who I might take down with me.All the same, there’s this one girl who won’t be scared away. Dakota. She’s hot, and I won’t deny I want her. But she keeps coming back, pushing me, trying to get me to talk, to open up to her.She has no idea she’s playing with fire. When the demons come, she’d better be far away from me, just like everyone else.Standalone novel. No cliffhanger.* Mature readers only. Not intended for young readers.*Inked Brotherhood Five boys brought together by fate. Five young men trying to overcome their troubled pasts. Five tattoos marking them as a brotherhood built on tragedy. Will they find understanding and rise above the pain?Five girls tied by friendship. Five young women fighting their own demons. Five lives laced with sorrow. Will they be strong enough to save the men they love and make them happy?The series comprises five interconnected, stand-alone Asher, Tyler, Zane, Dylan and Rafe.Kiss me Goodbye, a short prequel to ASHER, is FREE!!Next is DYLAN, book 4 in the series.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "Audiobook",
    "College",
    "Abuse",
    "Contemporary"
  ],
  "author": "Jo Raven",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/23447531-zane"
}