{
  "title": "The Road Not Taken: Finding America in the Poem Everyone Loves and Almost Everyone Gets Wrong",
  "description": "A cultural “biography” of Robert Frost’s beloved poem, arguably the most popular piece of literature written by an American“Two roads diverged in a yellow wood . . .” One hundred years after its first publication in August 1915, Robert Frost’s poem “The Road Not Taken” is so ubiquitous that it’s easy to forget that it is, in fact, a poem. Yet poetry it is, and Frost’s immortal lines remain unbelievably popular. And yet in spite of this devotion, almost everyone gets the poem hopelessly wrong.  David Orr’s The Road Not Taken dives directly into the controversy, illuminating the poem’s enduring greatness while revealing its mystifying contradictions. Widely admired as the poetry columnist for The New York Times Book Review, Orr is the perfect guide for lay readers and experts alike. Orr offers a lively look at the poem’s cultural influence, its artistic complexity, and its historical journey from the margins of the First World War all the way to its canonical place today as a true masterpiece of American literature.  “The Road Not Taken” seems a nameless traveler is faced with a two paths forward, with only one to walk. And everyone remembers the traveler taking “the one less traveled by, / And that has made all the difference.” But for a century readers and critics have fought bitterly over what the poem really says. Is it a paean to triumphant self-assertion, where an individual boldly chooses to live outside conformity? Or a biting commentary on human self-deception, where a person chooses between identical roads and yet later romanticizes the decision as life altering? What Orr artfully reveals is that the poem speaks to both of these impulses, and all the possibilities that lie between them. The poem gives us a portrait of choice without making a decision itself. And in this, “The Road Not Taken” is distinctively American, for the United States is the country of choice in all its ambiguous splendor.Published for the poem’s centennial—along with a new Penguin Classics Deluxe Edition of Frost’s poems, edited and introduced by Orr himself— The Road Not Taken is a treasure for all readers, a triumph of artistic exploration and cultural investigation that sings with its own unforgettably poetic voice.",
  "genres": [
    "Poetry",
    "Nonfiction",
    "Biography",
    "Literary Criticism",
    "Literature",
    "Criticism",
    "Essays"
  ],
  "author": "David Orr",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/23453114-the-road-not-taken"
}