{
  "title": "The Fairyland Series #1-3",
  "description": "The Fairyland Series (Books 1-3): The Girl Who Circumnavigated Fairyland in a Ship of Her Own Making, \nThe Girl Who Fell Beneath Faiyland and Led the Revels There\n, and \nThe Girl Who Soared Over Fairyland and Cut the Moon in Two\n\n\n\"One of the most extraordinary works of fantasy, for adults or children, published so far this century\"—Time magazine, on the Fairyland seriesTwelve-year-old September lives in Omaha, and used to have an ordinary life, until her father went to war and her mother went to work. One day, September is met at her kitchen window by a Green Wind (taking the form of a gentleman in a green jacket) who invites her on an adventure, implying that her help is needed in Fairyland. . . . Perfect for fans new to the series, the first three books of Catherynne M. Valente's Fairyland Series are available together in this bundle.\nThe Girl Who Circumnavigated Fairyland in a Ship of Her Own Making\n: Upon arriving in Fairyland, September learns the new Marquess is unpredictable and fickle, and also not much older than she is. Only September can retrieve a talisman the Marquess wants from the enchanted woods, and if she doesn't . . . then the Marquess will make life impossible for the inhabitants of Fairyland.The Girl Who Fell Beneath Fairyland and Led the Revels There: September has longed to return to Fairyland after her first adventure there. And when she finally does, she learns that its inhabitants have been losing their shadows—and their magic—to the world of Fairyland Below. This underworld has a new ruler: Halloween, the Hollow Queen, who is September's shadow. And Halloween does not intend to give Fairyland's shadows back.The Girl Who Soared Over Fairyland and Cut the Moon in Two: September misses Fairyland and her friends Ell, the Wyverary, and the boy Saturday. She longs to leave the routines of home and embark on a new adventure. Little does she know that this time, she will be spirited away to the moon, reunited with her friends, and find herself faced with saving Fairyland from a Moon-Yeti with great and mysterious powers.",
  "genres": [
    "Fantasy",
    "Dragons",
    "Adventure"
  ],
  "author": "Catherynne M. Valente",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/23453910-the-fairyland-series-1-3"
}