{
  "title": "The Disciplined Women of Chapel Island",
  "description": "When 18-year-old Kate and her wealthy parents make yet another house move, this time to their luxury new home on Chapel Island, Kate senses from the outset that there is something both mysterious and exciting about the place. The island is beautiful, though somewhat unusual in that it has its own currency and a police and security force known as The Guardians - and it isn't long before Kate has her first encounter with them. Whilst exploring on her bicycle, she narrowly avoids colliding with a golf cart (the mode of transport on the island) and is later questioned by two Guardians who tell her that her mother will be informed.  Subsequently, Kate is puzzled when she notices that her mother has to go out and pay some kind of penalty, and on returning home is taken by her husband to his study where she later emerges rubbing her bottom. Kate's curiosity deepens and she follows her mother to the Accountability Suite in the House of the Guardians. As a result of Kate's investigations, she discovers that domestic discipline and corporal punishment are an accepted way of life on the island - and the reason Kate's parents chose to reside here. Under this regime, many infractions are dealt with publicly with all manner of spanking implements.  This is a rite of passage for Kate, who discovers that the ritual of such punishments excites her, and that excitement is carried through to her intimate relationships. When she breaks the rules, she is up for correction, and joins the other island women on stage, all naked and waiting for their punishment, which is often severe. But she is still inquisitive and discovers there is much subterfuge going on, with hidden cameras in her home. Why is she being spied on? Who can she trust? And who are 'The Five' who have control of everything that happens on Chapel Island? She finds out eventually, and becomes empowered...",
  "genres": [
    "BDSM"
  ],
  "author": "Susan Thomas",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/23459842-the-disciplined-women-of-chapel-island"
}