{
  "title": "Devil's Gate: Brigham Young and the Great Mormon Handcart Tragedy",
  "description": "The Mormon handcart tragedy of 1856 is the worst disaster in the history of the Western migrations, and yet it remains virtually unknown today outside Mormon circles.Following the death of Joseph Smith, founder of the Mormon church, its second Prophet and new leader, Brigham Young, determined to move the faithful out of the Midwest, where they had been constantly persecuted by their neighbors, to found a new Zion in the wilderness. In 1846-47, the Mormons made their way west, generally following the Oregon Trail, arriving in July 1847 in what is today Utah, where they established Salt Lake City. Nine years later, fearing a federal invasion, Young and other Mormon leaders wrestled with the question of how to bring thousands of impoverished European converts, mostly British and Scandinavian, from the Old World to Zion. Young conceived of a plan in which the European Mormons would travel by ship to New York City and by train to Iowa City. From there, instead of crossing the plains by covered wagon, they would push and pull wooden handcarts all the way to Salt Lake.But the handcart plan was badly flawed. The carts, made of green wood, constantly broke down; the baggage allowance of seventeen pounds per adult was far too small; and the food provisions were woefully inadequate, especially considering the demanding physical labor of pushing and pulling the handcarts 1,300 miles across plains and mountains. Five companies of handcart pioneers left Iowa for Zion that spring and summer, but the last two of them left late. As a consequence, some 900 Mormons in these two companies were caught in early snowstorms in Wyoming. When the church leadership in Salt Lake became aware of the dire circumstances of these pioneers, Younglaunched a heroic rescue effort. But for more than 200 of the immigrants, the rescue came too late.The story of the Mormon handcart tragedy has never before been told in full despite its stunning human drama: At least five times as many people died in the Mormon tragedy as died in the more famous Donner Party disaster.David Roberts has researched this story in Mormon archives and elsewhere, and has traveled along the route where the handcart pioneers came to grief. Based on his research, he concludes that the tragedy was entirely preventable. Brigham Young and others in the Mormon leadership failed to heed the abundant signs of impending catastrophe, including warnings from other Mormon elders in the East and Midwest, where the journey began. Devil's Gate is a powerful indictment of the Mormon leadership and a gripping story of survival and suffering that is superbly told by one of our finest writers of Western history.",
  "genres": [
    "History",
    "Nonfiction",
    "Religion",
    "Mormonism",
    "American History",
    "Westerns",
    "Lds"
  ],
  "author": "David  Roberts",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/2345513.Devil_s_Gate"
}