{
  "title": "Here and Now: Complete Series",
  "description": "**This omnibus edition includes all three full-length novels from the USA Today Bestselling Here and Now series: Lost in Me, Fall to You, and All for This. The Here and Now series is a sexy, amnesia love triangle intended for mature readers.**  Even when the mind can't remember, the heart can't forget...  When an injury leaves Hanna Thompson without her last year of memories, she wakes to a perfect life—right down to an engagement ring from her unrequited love, Max Hallowell. But each day makes her question if she has the life she always wanted or if she's been living a lie. As she searches for answers, every path leads to rocker Nate Crane. And Nate wants her for himself.  “Sexy, twisty and utterly addictive...Clear your schedule. An amazing read!” –NYT Bestselling Author Kendall Ryan  LOST IN ME The last thing I remember is having drinks at Brady’s and trying to avoid eye-contact with my life-long crush—the gorgeous, unattainable Maximilian Hallowell. They tell me that was a year ago, but I have no memories of anything since then. What I do have is this ring on my finger that Max says he gave me, and this much-thinner body I’ve dreamed of most of my life. Aside from a case of retrograde amnesia, everything seems almost...perfect.  But the deeper I immerse myself into this new world of mine—planning a wedding to a man I don't remember dating, attempting to run a business I don't remember starting—the clearer it becomes that nothing is as it seems. Do I have the life I’ve always wanted or is it a facade propped up by secrets I don't even know I have?  I need answers before I marry Max, and the only person who seems to have them is the angry, tatted, sexy-as-sin rocker Nate Crane. And Nate wants me for himself.  FALL TO YOU Torn between two men… When I woke up after the accident, I couldn’t remember anything from the last year—including my relationship with Max Hallowell or anything about Nate Crane. Now my memories are returning, but instead of answering my questions, they’re leaving me with more. The man who broke my heart and wants to be my future… Max is all I ever wanted, and now he wants to marry me. He’ll do everything he can to fill my life with love, family, and security. I need those things now more than ever. But can I trust him? The man who stole my heart and wants to let me go… Nate never made me promises, and I never asked him to. I’d been on the rebound, looking for a distraction, and he made me feel beautiful and wanted when I needed to feel those things most. He says he has to let me go, but what if I can’t let go of him? With every revelation and every passing day, I feel more like Alice down the rabbit hole. I’m falling. Who will catch me?  ALL FOR THIS What if you would never remember the day you made the most important decision of your life?  That’s what they’re telling me about the day of my accident—the day I put on Max’s ring and chose him over Nate. I’m counting on the wisdom behind a decision I don’t remember making.  Max is amazing—sexy, sweet, and kind. I was starting to believe happily-ever-after might be in my future after all. Then the unthinkable happened and my world imploded. If I’m going to make this work with Max, I need my missing memories, or at least answers from about those five days before my accident.  But what does my future hold if those answers aren’t anything like I imagined?",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "New Adult",
    "Contemporary",
    "Suspense",
    "Second Chance",
    "Anthologies"
  ],
  "author": "Lexi Ryan",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/23453482-here-and-now"
}