{
  "title": "The Universes Inside the Lighthouse",
  "description": "Two teenagers on a summer vacation on an unassuming island ...A mysterious girl who appears in photographs taken decades apart ...A science lab set up in a place that exists both nowhere and everywhere ...A storage closet that is far more than it seems ...A parallel Earth, exactly like our own ...A universe made up entirely of ghosts ...An entity that is taking over innocent lives and infiltrating the universes ...Adventure, mystery, travel through space and time to find a man who seeks to rip the universes apart. Reminiscent of A Wrinkle in Time with just a dash of Doctor Who ...and it all begins ... inside the lighthouse.\"Aliens, infinite universes, ghosts AND time travel ... a winning literary combination if ever there was one.\" — Just One More Chapter reviewsSeventeen-year-old Emma and her twin brother Charlie think they’re in for a boring summer vacation. That is, until Emma notices something unusual in the lighthouse lobby. Unraveling this mystery proves to be just the beginning of an adventure that will take Emma, Charlie, and their unlikely new friends to distant planets, throughout the multiverse, and to a place where everything is possible ... and will ultimately lead Emma to discover the unfathomable powers that reside within her own mind. \"Reminded me of Christopher Pike’s wonderful series Spooksville (one of my all time favourites growing up) .... The plot was full of twists and turns ... it was suspenseful and exciting, a perfect children’s adventure story and a compelling read. I would recommend this to anyone with teenagers that enjoy adventure stories of any kind, and I can't wait for the second in the series.\" — Alison, Chapter One Reviews\"I never grew tired of seeing what [the author] might come up with next.... What would it be like to visit other planets? As someone who has often wondered about this, I was intrigued by all of the places that these characters see. Earth is unique in many different ways. It was nice to see this subtly acknowledged before the author went on to show the amazing range of possibilities.I would have liked to visit (almost) all of them.\" — Astilbe, Long and Short Reviews\" Pam Stucky is also the author ofThe Wishing Rock series (adult contemporary fiction)The Pam on the Map series (travelogues)",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Science Fiction",
    "Middle Grade",
    "Fiction",
    "Time Travel",
    "Adventure"
  ],
  "author": "Pam Stucky",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/23453396-the-universes-inside-the-lighthouse"
}