{
  "title": "Divorced, Desperate and Delicious",
  "description": "“Readers who enjoy Jenny Crusie and Janet Evanovich will fall head over heels for Divorced, Desperate and Delicious . . .” —New York Times bestseller Dianna LoveEver since photographer Lacy Maguire caught her ex playing Pin the Secretary to the Elevator Wall, she's been content with her dog Fabio, her three cats, and a vow of chastity. But all of that changes when the reindeer-antlered Fabio drags in a very desperate, on-the-run detective who decides to take refuge in her house—a house filled with twinkling lights and a decorated tree. (Okay, so it's February, but she has a broken heart to mend, a Christmas-card shoot to do, and a six-times divorced, match-making mother to appease.) For the first time in a looooong while, Lacy reconsiders her vow. Because sexy Chase Kelly, wounded soul that he may be, would be an oh-so-delicious way of breaking her fast. Now, if she can just keep them both alive and him out of jail . . .Bonus At the end of the book, get a sneak peek at Christie Craig's newest book in the Divorced and Desperate series, Divorced, Desperate and Dangerous, coming in November!And as an added bonus, you'll also get a look at the first four chapters of Reborn, the first book in the YA paranormal series Shadow After Dark, that Christie is writing as C. C. Hunter!!About the New York Times bestselling author Christie Craig is an award-winning writer, photo journalist, motivational speaker, writing teacher, and author of The Everything Guide To Writing a Romance Novel. Texas Hold 'Em, the next book in her humorous romantic suspense trilogy, is available now. Chosen at Nightfall, the fifth book in her New York Times bestselling Shadow Falls young adult paranormal series written under the name C. C. Hunter, is also available now. And Reborn, the first book in her new Shadow After Dark series, is available now.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Chick Lit",
    "Contemporary",
    "Mystery",
    "Romantic Suspense",
    "Humor"
  ],
  "author": "Christie Craig",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/11419869-divorced-desperate-and-delicious"
}