{
  "title": "Crave: Tales of Vampire Romance Boxed Set",
  "description": "Immortal. Impassioned. Impossibly sexy. These vampires are masters of seduction, delightfully dark creatures with insatiable appetites who are hungry for more than just hot blood. Let them lure you with their magnetic gaze, their fascinating charm, their intoxicating bite, into a dark, delicious world that has everything you CRAVE. Sink your teeth into this quintessential boxed set collection of eight vampire romance novels filled with exquisite obsession and dark desire from some of your favorite USA Today and New York Times bestselling authors.If you enjoyed THIRST and HUNGER, this boxed set will be everything you CRAVE!Beholden by Marian Tee - 18-year-old Zari, pet to Alexandru, a powerful, gorgeous vampire, is torn. Everyone tells her she has to be a perfect pet, but why bother when her Master seems bent on replacing her?Her Vampire Mate by Tabitha Conall - Werewolf Jennalynn discovers the perfect way to ruin a job...find out her competition is her mate. And worse, a vampire. Thrown together, they team up, not knowing that hidden danger lurks.Her Bark His Bite by A.E. Grace - Lillian doesn't believe in monsters... but vampires exist. One of them turned a child. She vows to hunt him down! Allied with a gorgeous vampire, she never expects to start falling in love with him...Devil's Descent II: Impure by Claudia D. Christian - Lily Walker is contemplating murder. Pureblood vampire Julian Douglas is contemplating the same. Both will realize love and hate aren't so simple when obsession itself can't be killed so easily...The Blood of Angels by Selena Kitt - Everything you've ever heard about fairies, angels and vampires is wrong. Zeph knows what he is, but Sam doesn't have a clue. She's about to find out the brightest lights cast the darkest shadows.Blood Struck by Michelle Fox - In a world where vampires are real, blood is a financial asset and sex mixed with blood commands the highest price. As for love...it can kill you.Thrall by Abigail Graham - Christine is a vampiric thrall without a master. By night she hunts, by day she hides, and with every setting of the sun hope slips further away until a mysterious stranger claims her as his ownKnight Fall by Alexis Dare - Sometimes things that go bump in the night aren't supernatural. Vampire Detectives Knight & Fall are chasing a killer. As they discover clues, they find that sometimes love and murder go hand in hand.",
  "genres": [],
  "author": "Michelle Fox",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/23460488-crave"
}