{
  "title": "The American Revolution: A Very Short Introduction",
  "description": "Here is a brisk, accessible, and vivid introduction to arguably the most important event in the history of the United States--the American Revolution.Between 1760 and 1800, the American people cast off British rule to create a new nation and a radically new form of government based on the idea that people have the right to govern themselves. In this lively account, Robert Allison provides a cohesive synthesis of the military, diplomatic, political, social, and intellectual aspects of the Revolution, paying special attention to the Revolution's causes and consequences. The book recreates the tumultuous events of the 1760s and 1770s that led to revolution, such as the Boston Massacre and the Boston Tea Party, as well as the role the Sons of Liberty played in turning resistance into full-scale revolt. Allison explains how and why Americans changed their ideas of government and society so profoundly in these years and how the War for Independence was fought and won. He highlights the major battles and commanders on both sides--with a particular focus on George Washington and the extraordinary strategies he developed to defeat Britain'ssuperior forces--as well as the impact of French military support on the American cause. In the final chapter, Allison explores the aftermath of the American how the newly independent states created governments based on the principles for which they had fought, and how those principles challenged their own institutions, such as slavery, in the new republic. He considers as well the Revolution's legacy, the many ways its essential ideals influenced other struggles against oppressive power or colonial systems in France, Latin America, and Asia.Sharply written and highly readable, The American A Very Short Introduction offers a concise introduction to this seminal event in American history.About the Oxford's Very Short Introductions series offers concise and original introductions to a wide range of subjects--from Islam to Sociology, Politics to Classics, Literary Theory to History, and Archaeology to the Bible. Not simply a textbook of definitions, each volume in this series provides trenchant and provocative--yet always balanced and complete--discussions of the central issues in a given discipline or field. Every Very Short Introduction gives a readable evolution of the subject in question, demonstrating how the subject has developed and how it has influenced society. Eventually, the series will encompass every major academic discipline, offering all students an accessible and abundant reference library. Whatever the area of study that one deems important or appealing, whatever the topic that fascinates the general reader, the Very Short Introductions series has a handy and affordable guide that will likely prove indispensable.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "American",
    "American Revolution",
    "United States",
    "18th Century"
  ],
  "author": "Robert J. Allison",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/23462740-the-american-revolution"
}