{
  "title": "She",
  "description": "115,000 words in length. For readers 18+ over only. Contains explicit sexual content, a hero that will make your heart flutter, and a heroine who will make you laugh out loud.The She series is designed to be read and enjoyed in its entirety. Part 2 will be released on October 1st.LOVE and SEX at once, is a powerful combination.Escape into Annabel Fanning’s bestselling erotic debut. She Part 1 is a contemporary and humorous look into the lives of two people who are on the precipice of true love. The novel uniquely crosses several genres, mixing first-grade erotica seamlessly with women’s lit and breathtaking romance.The story unfolds over sixteen thrilling and erotically-charged days, during which the reader is thrust into the heart of Paris, the novels backdrop, and into the daily lives of the construction world’s elite.Logan Leary is a reformed bad-boy who moved to the city of love fifteen years ago to start his life over. Now he owns one of Paris’s most successful companies and leads as seemingly charmed life. There’s just one thing missing: Gemima Samuels.Gemima Samuels moved to Paris with her down-on-his-luck boyfriend eight years ago. She coasted through life (in that annoying way we sometimes do) until her boyfriend cheated on her and life dealt her a wake up call. Choosing to start afresh, Gemima ends her relationship and quits her job before being hired by the most prestigious interior design firm in the city.A supposedly inconsequential lunch date turns out to be the start of something phenomenal that will change both of their lives forever.“Everything about Logan is new to me. Everything. He is the difference between watching television in black and white, verses watching it in colour: he adds dynamic and depth and stimulation when my life used to be so dull.”Blurb:Logan has loved Gemima for years. Gemima doesn't know. After her deadpan relationship implodes, Logan seizes his chance to rock her world.Set in picturesque Paris, SHE is an erotic tale about falling madly in love. Combining sex, passion, and romance, these two high-flying professionals will leave you saying, “Oh, la la!”For readers 18+ over only. Contains very explicit sexual content, and romance that may cause heart flutterings.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "New Adult",
    "Contemporary"
  ],
  "author": "Annabel Fanning",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/23462308-she"
}