{
  "title": "Briar Queen",
  "description": "The dark, moody, and mystical fantasy begun in Thorn Jack, the first novel in the Night and Nothing series, continues in this bewitching follow up--an intriguing blend of Twilight, Buffy the Vampire Slayer, Alice in Wonderland, and A Midsummer Night's Dream--in which Finn Sullivan discovers that her town, Fair Hollow, borders a dangerous otherworld . . .Serafina Sullivan and her father left San Francisco to escape the painful memory of her older sister Lily Rose's suicide. But soon after she arrived in bohemian Fair Hollow, New York, Finn discovered a terrifying secret connected to Lily Rose. The placid surface of this picture-perfect town concealed an eerie supernatural world--and at its center, the wealthy, beautiful, and terrifying Fata family.Though the striking and mysterious Jack Fata tried to push Finn away to protect her, their attraction was too powerful to resist. To save him, Finn--a girl named for the angels and a brave Irish prince--banished a cabal of malevolent enemies to shadows, freeing him from their diabolical grip.Now, the rhythm of life in Fair Hollow is beginning to feel a little closer to ordinary. But Finn knows better than to be lulled by this comfortable sense of normalcy. It's just the calm before the storm. For soon, a chance encounter outside the magical Brambleberry Books will lead her down a rabbit hole, into a fairy world of secrets and legacies . . . straight towards the shocking truth about her sister's death.Lush and gorgeously written, featuring star-crossed lovers and the collision of the magical and the mundane, Briar Queen will appeal to the fans of Cassandra Clare's bestselling Mortal Instruments series and Melissa Marr's Wicked Lovely.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Urban Fantasy",
    "Magic",
    "Fae",
    "Romance"
  ],
  "author": "Katherine Harbour",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/23460928-briar-queen"
}