{
  "title": "Game",
  "description": "From USA Today and NYT bestselling author Cora Brent....Those dirty-talking, hard-loving, sexy alpha triplets are back!This time it's Chase Gentry who has met his match in the latest story filled with gritty realism, steamy bedroom antics and the unbreakable bonds of love and brotherhood. May be read as a stand alone. 348 print pages.Stephanie...As a bookie, I know more about money lines, pay sheets and point spreads than any six men. I always thought I was in control until a terrible betrayal taught me otherwise. The price was my dignity and I can't bear to make any more mistakes.Chase Gentry figured it would be easy to get to me. He thought I was like every other girl, just dying to spread wide for him. I knew it was a rotten gamble to get mixed up with a guy too smart and too hot for his own good. Chase is destined to be as much trouble to those around him as he is to himself. But it's too late. He's already won my heart.Everyone around us insists that we're wrong for each other; too intense, too explosive. Everyone might be right.Chase...Gentry men aren't supposed to be very bright. We're big. We're brutal. Women can't wait to invite us inside. I know I can have any one of them I want any time I want.It seems unlikely that some bad-tempered chick and her snotty attitude would keep my interest but here it is. Stephanie has no idea what she does to me. I want that girl in more ways than I can even talk about.It should have been enough to have her and be done with it. But no matter how volatile we are together, it's never enough. To hell with anyone who objects. I'm not letting her go.Warning: The third book in the bestselling Gentry Boys series contains explicit language, sexual situations and violence that may be upsetting to some.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "College",
    "Contemporary",
    "Abuse",
    "Erotica"
  ],
  "author": "Cora Brent",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/23462201-game"
}