{
  "title": "Always Have, Always Will",
  "description": "A story from Boughs of A Holiday Anthology  ALWAYS HAVE, ALWAYS WILL by AMELIA MANN  Jay thinks official commitments aren’t necessary in a relationship. For the last fourteen years, he has loved waking up beside Gabriel, watching their two adopted kids grow up—even enjoyed painting the fence once in a while and paying his part of the mortgage on their New Jersey home. To Jay, that’s a family. No papers or ceremonies will make their relationship better than it already is...though Gabriel has a different opinion. Their lives are turned upside-down a month before Christmas, when he collapses in the plumbing aisle of the store. In the aftermath, Gabriel discovers that Jay’s only legal next of kin is his long-time absent father, and later Jay has to confront the painful memories of growing up, and the real truth behind his parents’ divorce. But perhaps now Jay might be ready to give Gabriel a Christmas gift he will never forget. * * * * *  ABOUT BOUGHS OF EVERGREEN  Boughs of Evergreen is a two-volume collection of short stories celebrating the holiday season in all its diversity. Penned by authors from the UK, the USA, Scandinavia and Eastern Europe, these are tales of the young and the not-so-young from many different walks of life.  Themes of family, friendship and romance take readers on a journey through some of the major holidays, both past and present, including Thanksgiving, Advent, St. Lucia Day, Hanukkah, Saturnalia, Winter Solstice, Yule, Christmas and New Year. In each we find at the very least hope, and often love, peace and happiness.  Proceeds from sales of this anthology will be donated to The Trevor Project. The Trevor Project is the leading national organization [USA] providing crisis intervention and suicide prevention services to lesbian, gay, bisexual, transgender and questioning (LGBTQ) young people ages 13-24. For more information, www.thetrevorproject.org.",
  "genres": [
    "M M Romance",
    "Christmas",
    "Contemporary",
    "Holiday",
    "Anthologies",
    "Family",
    "Romance"
  ],
  "author": "Amelia Mann",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/23462816-always-have-always-will"
}