{
  "title": "Glaciers: The Politics of Ice",
  "description": "Though not traditionally thought of as strategic natural resources, glaciers are a crucial part of our global ecosystem playing a fundamental role in the sustaining of life around the world. Comprising three quarters of the world's freshwater, they freeze in the winter and melt in the summer, supplying a steady flow of water for agriculture, livestock, industry and human consumption. The white of glacier surfaces reflect sunrays which otherwise warm our planet. Without them, many of the planet's rivers would run dry shortly after the winter snow-melt. A single mid-sized glacier in high mountain environments of places like California, Argentina, India, Kyrgyzstan, or Chile can provide an entire community with a sustained flow of drinking water for generations. On the other hand, when global temperatures rise, not only does glacier ice wither away into the oceans and cease to act as water reservoirs, but these massive ice bodies can become highly unstable and collapse intodownstream environments, resulting in severe natural events like glacier tsunamis and other deadly environmental catastrophes. But despite their critical role in environmental sustainability, glaciers often exist well outside our environmental consciousness, and they are mostly unprotected from atmospheric impacts of global warming or from soot deriving from transportation emissions, or from certain types of industrial activity such as mining, which has been shown to have devastating consequences for glacier survival. The Politics of Ice is a scientific, cultural, and political examination of the cryosphere -- the earth's ice -- and the environmental policies that are slowly emerging to protect it. Jorge Daniel Taillant discusses the debates and negotiations behind the passage of the world's first glacier-protection law in the mid-2000s, and reveals the tension that quickly arose between industry, politicians, and environmentalists when an international mining company proposed dynamiting three glaciers to get at gold deposits underneath. The book is a quest to educate general society about the basic science behind glaciers, outlines current and future risks to their preservation, and reveals the intriguing politics behind glacier melting debates over policies and laws to protect the resource. Taillant also makes suggestions on what can be done to preserve these crucial sources of fresh water, from both a scientific and policymaking standpoint.Glaciers is a new window into one of the earth's most crucial and yet most ignored natural resources, and a call to reawaken our interest in the world's changing climate.",
  "genres": [
    "Nonfiction",
    "Science",
    "Environment",
    "Nature",
    "Sustainability"
  ],
  "author": "Jorge Daniel Taillant",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/23461205-glaciers"
}