{
  "title": "A Keeper's Destiny",
  "description": "They are out there, somewhere...waiting...watching...lurking in the shadows. Every creature we have ever heard about...every story...legend...myth...all real. Maybe not exactly as we thought, but there is some truth behind it all. Vampires, shape-shifters, zombies, monsters, creatures that dwell in the deepest darkest area of our minds, are around every corner we turn. Years ago a group of ancient races known as guardians put up barriers between the realms to separate the peaceful and the dangerous, linking them to the main world by portals only they could activate. For years, with the help of a group of hand-picked humanoids helping them, they protected those portals from being breached. Then one day all that changed. An evil King developed a way to rip holes in the barriers between worlds. That began a war with the guardians and their helpers.Today only a handful of protectors remain. Rogue holes appear at random, allowing access to the main world for all manner of beings. Now many different races live here, some peacefully, but others with vicious intentions, including world domination. For now, most of the main world is oblivious to what is happening around them, but that won't last long. All we can do is hope for a hero.Book one of the Portal Prophecies Series, A Keeper's Destiny, follows a group of ancient races who join together with some unlikely teenage heroes.The only clues they have to help them are hidden within predictions contained in a book written long ago. Can they unravel the mysteries of their past and over come the deceptions of their leaders? Will they be able to decipher the prophecies in time to stop invading armies? Join Willow and her friends in this fast paced adventure.Warning: This book ends in a cliff-hanger. Book two starts where this book ends. The two are separated by different prophecies and themes. There are 6 books in the series. Thank you.",
  "genres": [
    "Fantasy",
    "Young Adult"
  ],
  "author": "C.A. King",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/23465064-a-keeper-s-destiny"
}