{
  "title": "Fallen Angel, Part 3",
  "description": "Being married to the dark and dangerous Robert Stone doesn’t come without its problems - trust being one of them. Trusting your average husband means you believe he won’t cheat on you. Trusting a man like Robert is accepting that he will kill to protect his family.Brooke loves her husband - mind, body, and soul - she will do whatever is necessary to protect that love.But what happens when Robert discovers he wants something Brooke can’t give him? This is a story of an extraordinary couple who find the strength to become the people they want to be. But can they have it all?Fallen Angel, Part 3 part of the Amazon best selling Fallen Angel Series - A Mafia romance.Contemporary romance for readers over the age of 18, contains graphic scenes of sex.So what is the Fallen Angel series...This is a mafia 'romance', with the emphasis on the romance. The four books are narrated by Brooke, a British woman who travels to Washington, DC, and falls in love. This is her story, her journey into a world she has only ever seen in a movie. As is traditional, Brooke will be shielded from any 'mafia' activity, she won't know what's going on, what she finds out will be a surprise. Please don't go into this book expecting a gun-slinging mafia moll from the 1950's :) This is a modern take on what the mafia are now, in the twenty-first century. There is a reason for the title, you'll discover this throughout the books. There are four books in this story so, no, you won't know it all in book one. I wanted to explore what it would be like for me, or you, to fall into a world we have no knowledge of. It's my belief that perhaps, we as British women, wouldn't take it seriously, perhaps we'd find it exciting. Our major reference into that world is a movie made a lot of years ago :) I hope you enjoy the read.This book is not paranormal, has nothing to do with angels, fallen or otherwise.",
  "genres": [
    "Romance"
  ],
  "author": "Tracie Podger",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/23464307-fallen-angel-part-3"
}