{
  "title": "Independence Lost: Lives on the Edge of the American Revolution",
  "description": "A rising-star historian offers a significant new global perspective on the Revolutionary War with the story of the conflict as seen through the eyes of the outsiders of colonial society Over the last decade, award-winning historian Kathleen DuVal has revitalized the study of early America’s marginalized voices. Now, in Independence Lost, she recounts an untold story as rich and significant as that of the Founding Fathers: the history of the Revolutionary Era as experienced by slaves, American Indians, women, and British loyalists living on Florida’s Gulf Coast. While citizens of the thirteen rebelling colonies came to blows with the British Empire over tariffs and parliamentary representation, the situation on the rest of the continent was even more fraught. In the Gulf of Mexico, Spanish forces clashed with Britain’s strained army to carve up the Gulf Coast, as both sides competed for allegiances with the powerful Chickasaw, Choctaw, and Creek nations who inhabited the region. Meanwhile, African American slaves had little control over their own lives, but some individuals found opportunities to expand their freedoms during the war. Independence Lost reveals that individual motives counted as much as the ideals of liberty and freedom the Founders espoused: Independence had a personal as well as national meaning, and the choices made by people living outside the colonies were of critical importance to the war’s outcome. DuVal introduces us to the Mobile slave Petit Jean, who organized militias to fight the British at sea; the Chickasaw diplomat Payamataha, who worked to keep his people out of war; New Orleans merchant Oliver Pollock and his wife, Margaret O’Brien Pollock, who risked their own wealth to organize funds and garner Spanish support for the American Revolution; the half-Scottish-Creek leader Alexander McGillivray, who fought to protect indigenous interests from European imperial encroachment; the Cajun refugee Amand Broussard, who spent a lifetime in conflict with the British; and Scottish loyalists James and Isabella Bruce, whose work on behalf of the British Empire placed them in grave danger. Their lives illuminate the fateful events that took place along the Gulf of Mexico and, in the process, changed the history of North America itself. Adding depth and moral complexity, Kathleen DuVal reinvigorates the story of the American Revolution. Independence Lost is a bold work that fully establishes the reputation of a historian who is already regarded as one of her generation’s best.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "American Revolution",
    "American Revolutionary War",
    "American",
    "Native American"
  ],
  "author": "Kathleen DuVal",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/23465981-independence-lost"
}