{
  "title": "The Hogs of Cold Harbor: The Civil War Saga of Private Johnny Hess, CSA",
  "description": "\"This book is a discovery. It gave me so close a sense of what it was like to be a Confederate soldier in the Civil War that I began to think of my own army experience. Old fears old excitements, even memories of my old equipment, and with it all, vivid as the sound of gunfire, came the smell of battle in the air of the book. I loved reading The Hogs of Cold Harbor. I was in the Civil War on the Southern side. That is no small education for a Northerner like me.\"-Norman MailerThe wild hogs of Virginia are vicious. They attack, kill and devour. They show no mercy and eat their victims alive. The wild hogs are smart. They strategize with their enemies. They are worthy adversaries. But the wild hogs have honor. They will not hurt or destroy their own.In the minds of some, this last, simple fact raises the wild hogs of Virginia to an ethical level far above that of Man. A hog will not kill its own. But Man will and has.The Civil War brought man against man, family against family, and brother against brother. Some fought for their God, others for freedom and liberty, still others to protect their homes and loved ones. Young men fought for the pride of their land and country and heritage.But in the battlefields, looking upon the mountains of dead and wounded, seeing the enemy’s face and recognizing it as your own, a man begins to question the true meaning of honor. As the wild pigs feast upon the slaughtered masses of men, yet show compassion and solitude with their own kind, field soldiers may begin to look deep into their souls at their own morality and purpose.John Henry Hess joined the confederate army with his heart filled with pride. He would fight for his country, for his wife and unborn child, and for the right of the Lord to rule over His great land. There was not a Rebel more proud than Johnny Hess was.But in those dark fields, young Johnny Hess came to realize that there were stunning similarities between Man and Animal. The body of a man, blown apart by gunfire, is almost identical to that of a hog. There was little difference between the yearly slaughter of the farm hogs and the slaughter of men on the battlefield. Except that a hog would not kill its own, as he had done.The Hogs of Cold Harbor implores readers to question our history as well as themselves. Author and historian Richard Lee Fulgham, M.A. crafted this haunting tale of the good and evil that dwells within us all based on the diaries of Southwest Virginian John Henry Hess, Pvt., CSA (Company G, 29th Virginia Infantry Regiment, Pickett’s Division, Longstreet’s Corps, 1862-1864). Is Man truly no better than the animals he commands and destroys? The Hogs of Cold Harbor is a powerful, haunting story in which Richard Lee Fulgham delves deep into the timeless questions of our existence. Are we Man? Are we Animal? And what is the difference?",
  "genres": [
    "Civil War"
  ],
  "author": "Richard Lee Fulgham",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/2347456.The_Hogs_of_Cold_Harbor"
}