{
  "title": "The Country of the Pointed Firs",
  "description": "First published in 1896, The Country of the Pointed Firs was considered by Willa Cather to be one of the three novels most likely to achieve a permanent place in the canon of American literature: “I can think of no others that confront time and change so serenely… The young student of American literature in far distant years to come will take up this book and say ‘a masterpiece!'” Long neglected and even ignored by criticism, this enduring classic by Sarah Orne Jewett now appears in a format worthy of its contents.Set in the fictional small coastal town of Dunnet Landing, Maine, this is as much a series of small, intimate sketches as a sustained narrative. As Fiction. O. Matthiessen pointed out, “in these loosely connected sketches, she has acquired a structure independent of plot. Her scaffolding is simply the unity of her vision.” Her vision was of a gentle and generous people on a rugged and dangerous coast, of New England character and “characters” limned in colors of high summer and blue skies. Here, too, you will meet the people of Dunnet Landing; the women, who are probably the most unforgettable characters of her book; and Elijah Tilley (among the very few men in Jewett’s cast) who, after the death of his wife, learns the skills of husband and wife, of farm and sea. The black-and-white pencil drawings by Douglas Alvord are nothing short of spectacular. Closely observed and carefully rendered, they possess all of the haunting serenity of Jewett’s landscapes. Faithfully reproduced and printed to the highest standards, this is destined to become a standard gift and reading book for everyone fascinated by New England, the rich history of its rockbound coast, and this magical author.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Classics",
    "19th Century",
    "Historical Fiction",
    "Literature",
    "American"
  ],
  "author": "Sarah Orne Jewett",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/2347137.The_Country_of_the_Pointed_Firs"
}