{
  "title": "Jodi and the Witch of Bodbury",
  "description": "Jodi Shepherd, a feisty teenage orphan raised by her aunt in the English village of Bodbury, spends most of her time helping her eccentric inventor friend, Denzil Gossip, with his menagerie of beloved animals. When a group of local waifs, the Tatters Children, speculate that the Widow Pender is keeping a Small in her house, Jodi has to break in to discover the truth. What follows is a lyrical tale filled with whimsy, danger and intrigue, where a witch or her fetch may approach anyone unawares and cast spells on them, where dead men talk and Smalls—tiny people—are alive. Originally appearing as a story-within-a-story in de Lint’s acclaimed novel The Little Country (written for adults), finally the magical tale of Jodi’s adventures, published for the first time on its own, can be enjoyed by young adults as well as mature readers.Charles de Lint is a folksinger as well as a writer and it is this voice we hear...both old and new, lyric, longing, touched by magic.— Jane YolenMr. de Lint's handling of ancient folklore to weave an entirely new pattern has never, to my knowledge, been equalled.— Andre NortonDe Lint's touch is deft and clean in a genre choked with tin eared dialogue and warmed over Dunsany and Tolkien. His narrative has the deceptive simplicity and tension of Alan Garner.— Parke GodwinCharles de Lint is the modern master of urban fantasy. Folktale, myth, fairy tale, dreams, urban legend—all of it adds up to pure magic in de Lint's vivid, original world. No one does it better.— Alice HoffmanCanadian writer and folk musician Charles de Lint has been a steady producer of fantasy fiction that shows clear respect for what Tolkien accomplished in The Lord of the Rings, yet has moved beyond it, into something distinctly his own. De Lint can feel the beauty of the ancient lore he is evoking. He can well imagine what it would be like to conjure the Other World among ancient standing stones. His characters have a certain fallibility that makes them multidimensional and human, and his settings are gritty. This is no Disneylike Never-Never Land. Life and death in de Lint's world are more than a matter of a few words or a magic crystal.— Darrell Schweitzer",
  "genres": [
    "Fantasy"
  ],
  "author": "Charles de Lint",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/23474214-jodi-and-the-witch-of-bodbury"
}