{
  "title": "His First His Second",
  "description": "A unique female detective. A serial killer who has abducted another victim. A ruthless father who will stop at nothing to find his daughter. Meet Detective Sergeant Alicia Friend. She’s nice. Too nice to be a police officer if she’s honest. And maybe—if pushed—she might admit she keeps her quirky personality front and centre to keep the darkness of her job at bay. But when a third girl is taken amid a killer’s sick murder spree, she has to face this dark world head-on.Alicia has less than a week to get her new colleagues to trust her, chip away the secrets of a high-society family, and uncover the killer’s real objective.But Richard—the father of the latest victim—believes the police are not moving quickly enough, so launches a parallel investigation, utilising skills honed in a dark past that is about to catch up with him.As Richard’s secret actions hinder the police, the clock is ticking until another innocent person dies, and Alicia will be forced into choices that will impact the rest of her life.\nIf you like British crime thrillers with unique female protagonists, buy His First His Second, the first in A. D. Davies's compelling Alicia Friend Investigations series, today.\n\n\nThis edition of His First His Second has been reformatted to be more accessible to people with dyslexia. It has larger print, more space between lines of text, and a dyslexia friendly font. The content is the same as all other editions.\n\n˃˃˃ Reviews “An intriguing mix of police procedural and serial killer thriller, that will tease, involve and unnerve you. An entertaining and intriguing debut.”Undercover Book  “Want a book with twists and turns? This is the one. It will not disappoint.”Alicia Friend Books in Order:\nHis First His Second\nIn Black In WhiteWith Courage With FearA Friend in SpiritTo Hide To SeekA Flood of BonesTo Begin the End",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Crime",
    "Mystery Thriller",
    "Amazon"
  ],
  "author": "A.D. Davies",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/23473947-his-first-his-second"
}