{
  "title": "Aliens in the Gift Shop",
  "description": "\"Aliens in the Gift Shop\" follows two extra-terrestrial scientists who have arrived on Earth for their first reconnaissance mission: to study and gather information about human society and interaction. Due to a miscalculation in their environmental data the mission is a complete disaster. While trying to salvage their assignment, they discover that they have brought with them an object that is vital to the survival of their planet. This discovery unwittingly puts them, and the Earth, into the interstellar cross-hairs of their enemies, who will stop at nothing to acquire it.EDITORIAL REVIEWQuirky and imaginative, Aliens In The Gift Shop is the new SF novel from author D.E. Morris and it's a rip roaring read from start to finish. The plot isn't particularly complex, but it is well considered as Morris spins his intergalactic yarn and introduces his readers to a host of wonderfully colourful characters. There is Marcy, the beleaguered store owner, Zort, Quigbat and the villainous Vorx, Morris captures the essence of each in timely prose and upbeat dialogue that is always on the button.All the elements of popular Science Fiction are introduced as his tale rapidly evolves, but he avoids the typical tendency for overly elaborate tech and foremost keeps it fun. It certainly isn't meant to be hard science fiction; nor should it be compared to scientifically stringent fiction. For this reason alone it is likely to have much broader appeal, but Morris's style of writing and linear plot also makes it a great tale for transitioning to wider mediums, particularly the big screen and on this level it is hard not to draw comparisons with Men In Black.A genuine gem of a read, Aliens In The Gift Shop marks an enjoyable debut for author D.E Morris and certainly bodes well for his forthcoming sequel. It is certainly recommended.- BookViral.comAlternate Cover Edition for ISBN: 1492849189",
  "genres": [],
  "author": "D.E.  Morris",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/23471784-aliens-in-the-gift-shop"
}