{
  "title": "Double Trouble",
  "description": "Librarian's Note: An alternate cover for this ISBN can be found hereIt all began 100,000 years ago when life was stupendously savage and every day was a test of both your will and your strength. An epic love was born. Two cave dwellers, Nat-ul daughter of Tha, and Nu the son of Nu, each a stupendously mighty hunter and warrior to match that time, vowed to love one another as long as the moon would rise in the night sky, which, in their primitive fashion, meant forever. The very day following this sacred oath the warrior and warrior maiden both died in an earthquake and tsunami. Buried by the earth, swallowed up by the sea, one would think their story was ended. Yet, since that time the wise of every generation and every culture have proclaimed that true love never dies. There is a reason they say this. In the early 20th century the moon still was rising in the night sky, when Nat-ul returned as Victoria Custer who vividly remembers that former primeval life. That painful, frightening memory from a thousand generations past has forged her into something more than she was and has emboldened her with unrelenting purpose empowering her to take action in even the most savage of circumstances. Now, under the pen name Vic Challenger, she works as a writer of adventure travel articles and her job allows her to literally comb the world as she searches for Nu. The proclamation of a stone age woman should never be dismissed. You might say it is chiseled in stone and Vic has made it plain, she is determined to find her eternal love Nu - no matter what it takes. As Vic Challenger, she will confront the grimmest peril and venture into situations so horrible they make the bravest of men cower and weep for their mother. Vic has embarked against all odds on an epic quest that may last a lifetime and on any day could bring violent death. She learned from her mysterious avatar Nat-ul, even when you face the gravest of threats, you need not be brave, you just need to do what needs done. It’s all just living. It looks to be a long, hard ride!Vic: Double Trouble brings you the beginnings of Vic Challenger in the first and second books of the series, Time Doesn’t Matter and Mongol. In Africa Vic learns the secret of her dim past when every day was a series of fights for life. As the farm girl from Nebraska she faces several deadly situations in Africa of 1919 from slavers to wild animals. Then, taking brother Barney along, she visits the Yucatan Peninsula of Mexico. There she must battle a mythical creature, war criminals and nature just to survive. Then after Barney leaves for Europe, Vic takes her friend from high school, Lin Li on a ‘vacation’ in Mongolia. They will be OK if they survive the nameless subterranean man things, the fabled creature that dissolves it’s prey, the Chinese Redbeards, the White Russians and the legendary cold weather. Or maybe it will be enough just to save their guide’s adorable twin girls.",
  "genres": [],
  "author": "Jerry   Gill",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/23475342-double-trouble"
}