{
  "title": "Renegade 1: Renegade",
  "description": "PICCADILLY PUBLISHING is dedicated to issuing classic fiction from Yesterday and Today! RENEGADENo one’s going to stop Captain Gringo!He’s snatched his life from the noose, wangled his freedom from his Army jailer, cajoled bed, board and a disguise from the town madam. He’s a man on the run – Captain Gringo. By wit, by guile, by force, by skill with guns and women, he’ll burn his way across the border – wiping out a troop of Rurales and the sadistic pervert who commands them, leading a guerilla band on daredevil raids, hijacking, fighting, killing, winning. He’s Captain Gringo, driven by fate to be a soldier of fortune and by sheer will to be – a renegade.ABOUT THE AUTHOR Lou Cameron (June 20, 1924 - November 25, 2010) was an American novelist and a comic book creator. He was born in San Francisco in 1924 to Lou Cameron Sr. and Ruth Marvin Cameron, a vaudeville comedian and his vocalist wife. Cameron served in Europe during World War II in the U.S. Army's 2nd Armored Division (\"Hell On Wheels\"). Before becoming a writer, Cameron illustrated comics such as Classics Illustrated and miscellaneous horror comics. One of his first written stories, \"The Last G.I.,\" is a science Other fiction story about American soldiers struggling to survive in a nuclear battlefield. It appeared in Real War (volume 2 number 2, October 1958). The film to book adaptations he wrote include None But the Brave starring Frank Sinatra,California Split, Sky Riders starring James Coburn, Hannibal Brooks starring Oliver Reed and an epic volume based on a number of scripts for the award winning CBS miniseries How the West Was Won (not to be confused with the novelization by Louis L'amour of the identically titled feature film, although the TV series was loosely based on that film.) He also wrote two novels based on TV series: an original, The Outsider, based on the Private Eye series starring Darren McGavin (alone among Cameron's tie-ins, it's written in the first person, from the POV of its main character, P.I. David Ross, a device inspired by the main character's voice-over commentary in the episodes); and \"A Praying Mantis Kills\", one of the novelizations of the Kung Fu television series, under the \"house name\" (shared pseudonym provided by the publisher) \"Howard Lee\". (The three other books in that series were written, also as Howard Lee, by Barry N. Maltzberg and Ron Goulart.) . Between 1979 and 1986, using the pseudonym \"Ramsay Thorne\", pulp fictioneer extra-ordinaire Lou Cameron wrote 36 \"Captain Gringo\" adult western novels featuring as protagonist Richard Walker, better known as \"Captain Gringo\". He has received awards such as the Golden Spur for his Western writings. He wrote an estimated 300 novels.",
  "genres": [
    "Westerns"
  ],
  "author": "Ramsay Thorn",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/23474650-renegade-1"
}