{
  "title": "Dreams Unleashed",
  "description": "It’s the near-future year of 2015, where technology governs life. In this dystopian world, governments control their citizens by tracking them with RFID. The right to personal privacy does not exist. The heroine, Ann Torgeson, having been trained by the CIA as a paranormal spy at nineteen years old, has enhanced abilities. Twenty-five years later, she lives a double first, as a technical writer for a tidal energy company in the Pacific Northwest, and second, as a member of the worldwide anti-government subversive organization, called GOG. When Ann’s vivid dreams turn real, she questions whether the doorway between her subconscious and reality has been permanently altered. When she starts to dig into her past, her present begins to unravel, leading the reader through events that twist and turn everything upside down. Question everything you know is essential in this trilogy.Quotes from Book “Ann is one of the most complex characters I’ve ever read…. The world is the government is the evil Big Brother keeping people safe even against their will. Yet, the characters aren’t depressed or desperate. They try to live their normal lives which includes laughter, too.”“The book really pushed me out of my comfort zone as I’ve never read any other book similar to this…. From the very beginning, the book kept me intrigued by its mystifying plot and excellent narration. I must laud the author for her ability to write her story in the finest detail, which makes the story sound somewhat believable. Everything was described superbly…. Overall, this novel is a real and pure page-turner.”Vanessa Eric, “The book has some references to current political figures and situations that make it very easy to get sucked into the story. The book is extremely well written and had my attention from the beginning to the end.”Scott, “It's like a present that you are slowly unwrapping layer by layer.”“If you put Dana Scully and Fox Mulder into a blender and hit puree, they’d make a mean Ann Torgeson. Dreams Unleashed was a great start to what I’m sure will be a fantastic book series. It poked fun at the TSA, and gave a frightful vision into a not-too-distant world where privacy truly is a thing of the past.”“Linda Hawley blends science and metaphysics well together and creates a thinking story that kept me turning the pages. Action and suspense combined with philosophical discussion makes this book a winner.”",
  "genres": [
    "Dystopia",
    "Science Fiction",
    "Paranormal",
    "Fantasy",
    "Young Adult",
    "Suspense",
    "Adventure"
  ],
  "author": "Linda Hawley",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/11423197-dreams-unleashed"
}