{
  "title": "A Very Romantic Christmas",
  "description": "Christmas has the power to bring people together…families, friends, and especially lovers. The vision of four special authors, including a NY Times Bestseller, A Very Romantic Christmas reaches across time and space to remind us that the holidays are about love and connection. Settle in with a plate of Christmas cookies and some hot tea, tune to a carol-only radio station, and indulge in this holiday treat. No matter what the weather, this collection will transport you into the very heart of the season. A Very Romantic Christmas contains a full-length boos and two novellas.  BLUE CHRISTMAS by Lorraine Bartlett: Christmas seems to have lost all its magic for Judi Straub. She's facing another Blue Christmas. Her boss takes her for granted, her parents have passed away, her siblings are so busy with their exciting lives that they ignore their lonely sister. Friends were usually too caught up in their own holiday madness to see her. Then, late one December, rather magically, she wins an almost-all-expenses-paid trip to Puerto Rico. Sun, fun…romance? To add to the wondrous time of year, she meets Harry Powell, the kind of passionate man she's dreamed of. He sweeps her off her feet but, all too soon, the holiday season has passed and it's back to her old, dreary life. But perhaps Christmas will offer one more moment of magic in the New Year?  Christmas romance heals love and recovers lost trust in THE TWELTH NIGHT BRIDE by Kelly McClymer Long ago, wealthy Kate Fenster promised faithfully to marry Sean McCarthy, the silver-tongued Earl of Blarney, if he let her ride his prized stallion Diablo. Now that they are of marriageable age, he's come to redeem her promise which tempts her more than she wishes to admit. Not quite trusting the Irish lord, she wants him to prove he is more interested in her heart than her dowry.  No sooner do they finally marry on Twelfth Night than he learns that his sister in Ireland is being accused of murder by his sworn enemy. Abandoning his new bride, Sean hurries home to rescue his sister. Unhappy to be apart from her husband, despite his letters telling her he will return to her soon, Kate travels to Ireland and finds that everything her quick-witted husband told her was only half-true. Now it is up to her to prove to him that she is the one who will stand by his side while he rebuilds his lands, regains the trust of his people, and keeps his mad, fey sister safe.  The power of Christmas is so much more than trees, decorations or family-get-togethers in AN INVITATION TO LOVE by Shirley Hailstock.. Elizabeth and James had seemed destined for the perfect happily-ever-after, each the other's perfect mate. Then a tragedy destroyed all their hopeful dreams. Three years later, has the grief that tore them apart healed enough to allow a glimpse of that joyful future once more? Or will their pain continue to dig a divide between them too deep ever to bridge?",
  "genres": [],
  "author": "Lorraine Bartlett",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/23479143-a-very-romantic-christmas"
}