{
  "title": "Loving The Senator",
  "description": "On the outside, Alex Conrad has everything. He’s gorgeous, rich, and has just been elected to the United States Senate by the state of Virginia.  But for the past few years, something has plagued Alex. Something has been missing from his life of privilege and opportunity. Something he has never allowed himself to acknowledge, until the night of his election.  Prudence Romaine is seventeen years Alex’s junior. The daughter of a friend whose life had taken a wrong turn, Prudence came into Alex’s life when she was just sixteen. Despite the passage of time and evidence to the contrary, Alex still thinks of Prudence as the little girl he once tried to rescue.  On election night, the sexual tension between Prudence and the senator reaches a tipping point. Prudence has been in love with Alex for some time, and now that she is in a position to do something about it, she has her aim set on Senator Conrad with no plans of giving up.  But Alex is already committed and a scandal is the last thing the newly-elected politician needs. As Alex pushes Prudence away, convinced their relationship can only end badly for them both, Prudence becomes even more determined to have Alex Conrad in her bed as well as her heart.  And Alex? He can only hold out for so long. And once he gives in, the passion they've held back for years threatens to undo them. But loving the senator is not all it's cracked up to be.  Prudence must learn to handle the pressure that comes with being with a high-profile politician, Alex's jealous ex-girlfriend, and the demands of the people, if she wants to make this work. Loving the Senatoris an erotic romance aimed at mature audiences and is part of the Capitol Affairs series of novels.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary",
    "Contemporary Romance",
    "Politics",
    "Adult",
    "Erotic Romance"
  ],
  "author": "Mia Villano",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/23475718-loving-the-senator"
}