{
  "title": "Homeward Bound",
  "description": "The twentieth century was awash in war. World powers were pouring men and machines onto the killing fields of Europe. Then, in one dramatic stroke, a divided planet was changed forever. An alien race attacked Earth, and for every nation, every human being, new battle lines were drawn.\nHOMEWARD BOUND\nWith his epic novels of alternate history, Harry Turtledove shares a stunning vision of what might have been–and what might still be–if one moment in history were changed. In the WorldWar and Colonization series, an ancient, highly advanced alien species found itself locked in a bitter struggle with a distant, rebellious planet–Earth. For those defending the Earth, this all-out war for survival supercharged human technology, made friends of foes, and turned allies into bitter enemies.For the aliens known as the Race, the conflict has yielded dire consequences. Mankind has developed nuclear technology years ahead of schedule, forcing the invaders to accept an uneasy truce with nations that possess the technology to defend themselves. But it is the Americans, with their primitive inventiveness, who discover a way to launch themselves through distant space–and reach the Race’s home planet itself.Now–in the twenty-first century–a few daring men and women embark upon a journey no human has made before. Warriors, diplomats, traitors, and exiles–the humans who arrive in the place called Home find themselves genuine strangers on a strange world, and at the center of a flash point with terrifying potential. For their arrival on the alien home world may drive the enemy to make the ultimate decision–to annihilate an entire planet, rather than allow the human contagion to spread. It may be that nothing can deter them from this course.With its extraordinary cast of characters–human, nonhuman, and some in between–Homeward Bound is a fascinating contemplation of cultures, armies, and individuals in collision. From the novelist USA Today calls “the leading author of alternate history,” this is a novel of vision, adventure, and constant, astounding surprise.",
  "genres": [
    "Science Fiction",
    "Alternate History",
    "Fiction",
    "Historical Fiction",
    "Fantasy",
    "Audiobook",
    "Military Fiction"
  ],
  "author": "Harry Turtledove",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/101553.Homeward_Bound"
}