{
  "title": "Mildred Budge in Cloverdale",
  "description": "Mildred Budge couldn’t say no for long. She knew how. Mildred could breathe the word no to a second cup of ice cream. Could resist drinking too much champagne. But when it came right down to a friend needing a favor, she might say no first, but if someone really needed her—really needed her! —she always said yes.  That’s how Mildred ended up with strangers camped out in her spare bedroom, helping her friend Fran to start a new business at the antique emporium, and walking around the empty church with a dust rag in her hand even though she hated to dust. She couldn’t say no to dust for long either. The only real no Mildred had said in recent history was to a man who loved her. Hugh wasn’t the first man to pursue her. But he was the most recent. And she had been flattered but not interested—not in the way he wanted her to be interested. Hugh didn’t give up right away. He lodged himself near her at church. Found her in the church kitchen after a fellowship supper to aid in the clean-up. And finally, her would-be lover had just asked her outright. That was the moment when Mildred had to say no. Until then Millie had been artfully dodging him. Only her best friend Fran understood. Fran said when Mildred finally felt the regretful effects of that no, “We’re all of us such fools.”  But they aren’t fools. Mildred Budge and her friends are just people trying to live inside the faith released from heaven through the One who didn’t say no.  This is the first novel in the series about Mildred Budge and her friends—just ordinary people trying to live out an extraordinary hope available to anyone who realizes what kind of help he or she really needs. That hope has a name, and Mildred Budge knows it. Need hope? Need a friend. Mildred Budge is a very good friend. If you like spending time with people who are just ordinary but extraordinarily hopeful, then you’ll love this story. Get a copy of this first novel in the series and find out for yourself what church ladies really think. About the author: Daphne Simpkins is an Alabama writer who writes about a variety of subjects and often on the secret lives of church ladies. Befriend her on Facebook, Twitter, or Linkedin.com.",
  "genres": [
    "Fiction",
    "Christian",
    "Christian Fiction",
    "Contemporary",
    "Book Club"
  ],
  "author": "Daphne Simpkins",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/23477308-mildred-budge-in-cloverdale"
}