{
  "title": "Indivisible",
  "description": "Jim is being swept back into his past  Everything's gone to hell as far as Jim is concerned. Grasping for just a hint of normalcy, he finds himself reeling through memories of his past and the lone anchor in his life, the single person who can help him lead a normal life free from the ghosts of his past is nowhere to be found after the shootout.   Susan is having second thoughts about it all  She's reconsidering being with Jim after finding out about him being involved in the shootout. But try as she might to tear herself away from him, she can't deny the feelings still lingering in her heart--feelings that urge her to give him another chance.   There's more at stake than either of them wants to admit  When news of the shootout reaches the Feds and the Steel Talons find themselves in deeper hot water than they already are. With the situation going from bad to worse, Jim is determined to right every wrong he's caused--with the club, with himself, and with Susan.   Will they survive this one final ride? Or will it all come crashing down around them?   Excerpt  Susan looked drawn, concerned, and angry. Jim wanted to ask her if there was something bothering her, but at the moment, he wanted to pretend she was just that upset at finding him this ill. “You didn’t answer my calls,” he rasped, each word making his head throb worse. “I bet you didn’t even listen to my voicemails.”  She pressed her lips tightly together, and it made lines appear around her eyes and mouth. “I haven’t answered anyone’s calls or heard anyone’s voicemails. I haven’t felt like having company. Besides, I’ve had other things to tend to lately.”  Her voice was detached, aggravated, and distant. “Talk to me, Susan. Tell me what’s wrong.” He wanted to fix her, whatever was wrong. If that meant she was going to rail at him for his behavior, so be it. That meant she cared, and he deserved the punishment anyway. Then, when she was done, they could erase everything that had come between them, kiss, and make up.",
  "genres": [],
  "author": "Evelyn Glass",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/23481325-indivisible"
}