{
  "title": "Discovering Their Destiny",
  "description": "\"I LOVE the repartee between Jami and Devlin, and how she gets what she needs and wants from him.  Bravo, Jami!\" --------------Deena Remiel  Int'l Best-Selling Kindle Author  Jami – Content with her life working for a publishing house, enjoying her caffeine addiction and her daily banter with best friend Todd. Jami wasn’t one to believe in Destiny. When her world turns upside down just days before her 25th birthday, her beliefs are challenged and time is ripped away. Dozing off in the sun one moment and sitting in a field of heather with a talking hamster the next will rattle any normal girl. But hearing a sexy deep voice and turning to find the Highlander it belongs to will rock anyone’s world!  Devlin- He always looked forward to the festival every year. He loved to see all the hustle and bustle around the keep, what he couldn’t handle was his mother hounding him about finding that “one” to settle down with as the middle brother he still had plenty of time. He escaped daily to do his rounds along the land’s perimeter, but one day he found something or should I say someone he wasn’t expecting. One look, one smell was all it took. He would find out who she was.  Jami- not one to believe in destiny tucked herself into the library for a quick respite from the annual Christmas party quickly turns into the journey of a lifetime. Gazing out the window at the full moon, the world goes hazy and time shifts. Gone are the glittering decorations and dazzling dresses, replaced with Highland warriors, fields of heather, and a tiny talking hamster?  Faced with the obstacle of overcoming her fears and embracing her powers, Jami’s destiny is hers to take. Or is it?",
  "genres": [
    "Time Travel",
    "Paranormal",
    "Romance",
    "Historical Romance",
    "Time Travel Romance",
    "Fantasy"
  ],
  "author": "Miranda Lynn",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/23477595-discovering-their-destiny"
}