{
  "title": "Sons of Natal",
  "description": "1879. British Natal stands on the brink of the Anglo-Zulu war. The British High Commissioner is seeking to provoke the native Zulus into rising up against the British invaders, to start a war which will give the British an excuse to rule the whole of southern Africa. The colonialists are gathering their forces, in fear of the Zulu king’s warriors. Edmund Wade, a hotel manager with a controversial military past, volunteers to join the Town Guard. But after a run-in with an influential soldier he is left unemployed. And so, when he is offered the chance to lead a dangerous military mission, he has no choice but to accept. The newly-promoted captain is sent with a rag-tag contingent of redcoats to recover a haul of stolen rifles before they fall into the Zulu king’s hands, arming him for the coming conflict. It is Wade’s chance to redeem himself in the eyes of the army. But the stolen rifles are just the beginning… The captain starts to uncover a conspiracy which cuts to the heart of the British colonial establishment. Who really stole the rifles, and for what purpose? Can Wade expose the plot before it plunges South Africa into war? Or will he fall victim to the Sons of Natal…? 'Sons of Natal' is a brilliant fictional account of military conflict during the Boer War. 'A gripping historical yarn.' - Tom Kasey, best-selling author of 'Trade Off'. Ian Carr is the author of 'Sons of Natal', a historical fiction novel set during the Anglo-Zulu war of 1879. Having graduated with a degree in archaeology, he worked briefly in town planning before accompanying his wife to South Africa for five years while she trained to be a vet. His interest in the 19th century and his experience of living in South Africa helped inspire the setting of this first book following the adventures of British Army officer, Edmund Wade. Ian now lives in the South Devon fishing town of Brixham where, among other writing projects, he is working on the second book in the Wade series. Endeavour Press is the UK's leading independent publisher of digital books.",
  "genres": [],
  "author": "Ian   Carr",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/23483823-sons-of-natal"
}