{
  "title": "Highland Winds",
  "description": "SEVEN BRAND NEW SCOTTISH ROMANCE NOVELLAS FROM THE GUARDIANS OF CRIDHE.Highland Revenge by Ceci GiltenanDoes he hate her clan enough to visit his vengeance upon her? Or will he listen to her secret and his own heart's yearning?The Taming of Mairi MacKenzie by Sue-Ellen WelfonderA forbidden love so powerful it could destroy them both.Stealing Moirra's Heart by Suzan TisdaleShe didn't believe he was a thief when she rescued him... until he stole her heart.Spirit Stones by Kate RobbinsSheona MacLeod has a gift. Malcom MacDonald seeks change. Together, they can change destiny...if they dare.A Tear For Memory by Kathryn Lynn-DavisHow can a seer paint 'Truth' when she's lived a life of lies? Will she allow a man who has twice deceived her to open her heart to the truth?A Jewel in the Vaults by Lily BaldwinShe has never met a man like him before. Then again, he has never met a lad like her.Lord Grayson's Bride by Tarah ScottShe can't allow his love for her to destroy him...The Legend...Long, long ago, in the time before time, seven sisters were called from the far reaches of the realm. Each brought unique talents, but had one common gift; the ability to weave ageless tales of love and courage. An evil witch coveted their gifts and locked them in a tower, silencing their voices upon threat of death. But the Highlands are enchanted, and magic will not countenance seven pure hearts such as theirs to be lost.With no one else to hear them, they sang their stories to each other. Fate blew a braw Highland wind to their prison, and the sweet, high timbre of the sisters' voices enthralled it. The wind gathered close their silver words as it raced past each day, and carried their love and goodness throughout the world...then across the ages.Today, their words live on in the Guardians of the Cridhe, seven sisters who have sworn to preserve those pure and musical hearts so long as they live. It is said these seven descend from those ancient female bards. Only their words can bear witness to that truth...",
  "genres": [
    "Historical Romance",
    "Short Stories",
    "Historical",
    "Anthologies",
    "Romance"
  ],
  "author": "Tarah Scott",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/23487158-highland-winds"
}