{
  "title": "Politics the Wellstone Way: How to Elect Progressive Candidates and Win on Issues",
  "description": "During the past four years, political activism has grown to a level that has not been seen in the United States since the Vietnam War. Tensions over the war in Iraq and the presidential election motivated hundreds of thousands of people on both sides of the political fence to take to the streets. Politics the Wellstone Way offers a comprehensive set of strategies to help progressives channel that energy into winning issue-based and electoral campaigns.Wellstone Action is a nonprofit organization dedicated to continuing Paul and Sheila Wellstone’s fight for progressive change and economic justice by teaching effective political action skills to people across the country. Politics the Wellstone Way is a workshop in book form, providing the detailed framework needed to jump-start a new generation of activists plus plenty of helpful tools for old pros, including articulating a strong message, base building, field organizing, budgeting, fundraising, scheduling, getting out the vote, and grassroots advocacy and lobbying, illustrated by practical and inspirational examples.From the school board all the way to the White House, Politics the Wellstone Way instructs people on becoming better organizers, candidates, campaign workers, and citizen activists, empowering them to make their voices heard.Wellstone Action was established by the Wellstones’ two surviving sons, David and Mark. The main vehicle for this ongoing work is Camp Wellstone, a weekend training program that Wellstone Action leads regularly in locations across the country. Jeff Blodgett, Paul Wellstone’s longtime campaign manager, is the executive director of Wellstone Action. For more information visit www.wellstoneaction.org.",
  "genres": [
    "Politics",
    "Nonfiction"
  ],
  "author": "Bill Lofy",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/234876.Politics_the_Wellstone_Way"
}