{
  "title": "P.O.W.ER",
  "description": "P.O.W.ERWhat would happen if women and girls joined their unique abilities together to change the world? In a world where access to the written word is reserved to men, Andra BetScrivener has been able to read and write ever since she was a little girl without anyone teaching her. She must keep her abilities a secret in the country of New North, or she could lose her hands, her eyes or her life. In fact, the only paths offered to her–and all young women–are to either marry or enter the government-run Women’s Training Program, where she’ll be taught “feminine” arts like drawing, painting, and homemaking.On her seventeenth birthday, Andra discovers that her abilities extend beyond reading. She can write events to life. As she begins to explore her new ability, she must take care not to jeopardize her father’s job as head scrivener at the Ministry. Despite her efforts to keep her powers hidden, she comes to the attention of both the government and a rebel group, who each desire to use Andra for their own goals. At the same time, she begins to meet other gifted women who have never dared use their unique powers. With the help of her friends Brian and Lauren—who has the ability to read minds—Andra must find a way to unite the power of women to create change.When one side manipulates Andra’s words into killing someone, and the other threatens her father’s life and her own freedom, Andra decides to use her writing to empower others to stop governmental oppression. But in a society ruled by lies, cruelty, and inequality her journey will not be easy or safe.Short listed for the Sarton LIterary Award in Contemporary Fiction.For each book sold, a portion of the proceeds will be donated to causes that support women and children around the world.Cover Art by Jacqueline Haltom.",
  "genres": [
    "Young Adult",
    "Fiction",
    "Dystopia",
    "Science Fiction",
    "Fantasy"
  ],
  "author": "Lisa A. Kramer",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/23484844-p-o-w-er"
}