{
  "title": "Forsaken",
  "description": "J.D. Barker's Forsaken is a remarkable debut, a gripping tale of suspense in the tradition of Stephen King, Dean Koontz, and John Saul. Truly the birth of a new master in the genre.“J.D. Barker is a one-of-a-kind writer and that’s a rare and special thing. Stephen King comes to mind and Lee Child, John Sandford. All one-of-a-kinds. Don’t miss anything J.D. writes.” James Patterson #1 International Bestselling Author Bram Stoker Award Nominee - Superior Achievement in a First Novel “Barker’s ambitious debut is aimed squarely at fans of classic horror. Witches, spells, miniature demons, and personal doubt give plenty to latch on to… the plot moves at a brisk pace… a promising start to a planned series.” - Editorial Review, Publisher’s Weekly \"A talented writer with a delightfully devious mind!\" Jeffery Deaver #1 International Bestselling Author After reading Forsaken, I completely understand why Stephen King would grant this author permission to reference his world from Needful Things. Barker is that good. You do not want to miss this book! - The Haven Herald \"Incredibly written, supremely creepy. I don't say this lightly: J.D. Barker is a force to be reckoned with.\" Tosca Lee NY Times Bestselling Author When horror author Thad McAlister began his latest novel, a tale rooted in the witch trials of centuries past, the words flowed effortlessly. The story poured forth, filling page after page with the most frightening character ever to crawl from his imagination. It was his greatest work, one that would guarantee him a position among the legends of the craft. But was it really fiction? He inadvertently opened a door, one that would soon jeopardize the lives of his family. She wants to come back. At home, his wife struggles to keep their family alive. Secretly wondering if she caused it all…a deal she made long ago. A deal with the Forsaken.",
  "genres": [
    "Horror",
    "Fantasy",
    "Fiction",
    "Paranormal",
    "Witches",
    "Thriller",
    "Audiobook"
  ],
  "author": "J.D. Barker",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/23488236-forsaken"
}