{
  "title": "Miller's Creek Collection 1",
  "description": "Christian Contemporary Romance and Romantic Mystery/Suspense   This collection of the first three faith-based stories in the beloved Miller's Creek novels by Christian author Cathy Bryant shares the messages of finding true home, trusting God in the most trying of circumstances, and sharing the gift of God's grace and mercy with others, including our enemies.   Texas Roads  \nOne secret kept, another uncovered...\n  Dani Davis just wants a place to call home. With quirky residents, quaint country charm, and loads of business potential, Miller's Creek, Texas seems like the perfect place to start over...except for the cowboy who gives her a ride into town. Dani secretly finances renovations to downtown Miller’s Creek, but malicious rumors force her to choose between keeping her involvement a secret and the home for which she’s always longed. Then a devastating discovery propels her down a road she never expected to travel. Steve Miller is determined to rescue his dying hometown. When vandals jeopardize the renovation, he can’t help but suspect Dani, whose strange behavior has become fodder for local gossips. Can Steve and Dani call a truce for a higher cause, and in the process help Dani recognize the true meaning of home?  \"...one of those stories that sticks in your heart.\" -Amazon Reviewer   A Path Less Traveled  \n\"A grieving widow, her daddy-starved little boy, and the man who loves them both...\"\n  Trish James is tired of being rescued. When a spooked horse claims her husband's life, she’s determined to blaze a path for herself and her traumatized son without outside help. But will that mean leaving the place etched on her heart? Andy Tyler has had to struggle for everything, and starting a new law practice in Miller's Creek, Texas is no different. Though prepared for business challenges, he's not prepared for falling in love--especially with yet another woman who will probably abandon him for her career. Will Andy and Trish be able to see past their limited human understanding to take a path of faith--a path less traveled?  \"...a story of faith, healing, and love.\" -Amazon Reviewer   The Way of Grace  \n\"In pursuit of justice, in need of grace...\"\n  A justice-seeking perfectionist pursues her dream of a perfect life in her hometown of Miller’s Creek, Texas. Then a disheveled free spirit turns Grace Soldano's perfectly ordered world upside down, challenging the concept of personal goodness. A fall from perfection leaves her teetering between vengeance and grace, caught in a deadly crossfire that leaves her dreams in a heap of ashes. In spite of life-altering circumstances, can she bestow on even her enemies the grace and mercy God has lavished on her?  \"...much more than just a story.\" -Amazon Reviewer   Also Includes a Sneak-Peek Chapter From PILGRIMAGE OF PROMISE, the fourth book in the Miller's Creek novels    Miller's Creek Novels eBook Categories:   Inspirational Fiction Inspirational Romance Christian Fiction Contemporary Christian Fiction Christian Romance Contemporary Christian Romance Christian Romantic Suspense Contemporary Christian Romantic Suspense Women's Religious Romance Christian Women's Fiction Christian Contemporary Western Romance Inspirational",
  "genres": [],
  "author": "Cathy Bryant",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/23486487-miller-s-creek-collection-1"
}