{
  "title": "True of Blood",
  "description": "\"I have a television so I know what a family is supposed to look like but mine is nothing like that. To begin with, both my parents are dead. Not the kind of dead where you bury them in the ground, say some nice words, cry a lot and then never see them again. Nope, when they died they refused to ‘go into the light’ or whatever it is you’re supposed to do when you die. Instead, they came back home. As ghosts. Have you ever been sent to your room by a parent who has no corporeal form? I have and it sucks...\"Xandra Illuminata Smith has lived for the last three years with ghosts as parents but her life gets even stranger after her seventeenth birthday when she finds out that her mother is actually a Witch in hiding and her biological father, whom she knew nothing about, is a Fairy and King of the Fae realm. Xandra is the first Witch Fairy to be born in thousands of years for very good reason. No one should be able to control that much magic and Xandra was never meant to be born at all but her mother has managed to keep her hidden away until now.The Witches want her dead and the Fairies want her blood, for only her blood will reopen the gateway to the Fae realm and allow them back into this realm to take revenge on humans and Witches alike for having banished them hundreds of years ago.Xandra has very little time to learn how to use her powerful Witch and Fairy magic that has been bound since her birth while running from the Fairies who managed to jump realms and want to take her blood to set the others free. She needs someone to teach her and her parents enlist the help of one powerful Fairy who claims to want to keep the realms closed to each other. He will help keep her safe and alive as she learns, at least that's what he says...",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Fae",
    "Witches",
    "Romance",
    "Magic"
  ],
  "author": "Bonnie Lamer",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/11425560-true-of-blood"
}