{
  "title": "Saban: The Making of a Coach",
  "description": "In the tradition of When Pride Still Mattered, Paterno, and Joe DiMaggio: The Hero’s Life—the definitive biography of Nick Saban, the influential and controversial University of Alabama football coach who not only transformed college football, but might be the best ever at winning.As the head coach of the University of Alabama’s football team, Nick Saban is perhaps the most influential—and controversial—man in the sport. Unpredictable in his professional loyalties, uncompromising in his vision, and unyielding in his pursuit of perfection, the highest-paid coach in college football has changed the face of the game. His program-building vision has delivered packed stadiums, rabid fans, legions of detractors, countless NFL draft picks, and a total of four national championships, including three in the last five years. Monte Burke’s Saban—the first definitive biography of the man who has come to epitomize the game—presents this towering figure with a never-before seen human depth.Though a great deal is known about Nick Saban the coach, not much is known about Nick Saban the man. Little is written about his early climb through the coaching ranks as an assistant in college and in the NFL, or his head-coaching stints at Michigan State and Louisiana State and his struggles as a pro coach with the Miami Dolphins. Through unprecedented interviews with more than 250 friends, coworkers, rivals, former players, and others, Burke reveals the defining moments of the coach’s life, including:-The beginning of his recruiting career at age ten as he walked door to door with his demanding father gathering players for a Pop Warner football team.-A team meeting that deterred his plans to attend a student rally at Kent State that would later make history.-His rapid and at times rocky ascent up the assistant coaching ranks.-His complicated relationship with one of his coaching mentors, Bill Belichick.-The birth of his now-famous “Process” and the unlikely man who became its co-architect.-His dramatic and controversial departures from three different high-profile football teams.-The building of championship programs at Louisiana State and Alabama.Saban paints a portrait of a complex and compelling man, fundamentally shaped by both his past and the game he loves, in a way that no previous book has.",
  "genres": [
    "Sports",
    "Biography",
    "Football",
    "Nonfiction",
    "Leadership",
    "History"
  ],
  "author": "Monte Burke",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/23492440-saban"
}