{
  "title": "Cursed Immortals Omnibus 1: Judas & The Vampires",
  "description": "Plague of William Barrow carries a dark secret. A very dark secret.An archivist for the Smithsonian Institute and also a part-time operative for the CIA, no one would ever suspect the handsome ‘thirty-ish’ William is in fact the most reviled human being to ever walk the earth. His infectious warmth and sense of humor make such an assertion especially hard to believe.But long ago, William Barrow had another name…one that is synonymous with shame and Judas Iscariot.Forced to walk the earth as a cursed immortal, William/Judas is on a quest to reclaim the thirty silver shekels paid to him in exchange for Jesus Christ. Twenty-one coins have now been recovered—thanks in large part to the help from his latest son, the esteemed Georgetown University history professor, Alistair Barrow.Ever hopeful the complete coin collection will buy him a full pardon from God and end his banishment from heaven, William plans a visit to a remote village deep within Iran’s Alborz Mountains to retrieve ‘silver coin number twenty-two’. But the CIA has a different objective for this trip, one that pits both father and son against an unscrupulous Russian billionaire searching for something else that’s just as precious within the ancient mountains of Iran…something that threatens peace in the modern world if William and Alistair fail to reach it first.The Vampires’ Last Txema Ybarra is the most unenviable nineteen-year-old girl alive.Smart, pretty, and athletically gifted, this University of Tennessee freshman should be enjoying college life and her entrance into adulthood. And for a moment she does…until the vampires show up.Born with an unusual ‘twin teardrop’ birthmark on her neck, Txema (pronounced Chema) is one of only a handful of females in the world who bear this trait. It marks her as a vessel of eternal youth and beauty for an elite vampire society determined to protect her precious blood…. But it also is the only thing standing in the way of a rogue ‘undead’ nation determined to destroy mankind and usurp the power their sexier brethren have held uncontested for centuries.Caught in the middle of this war after all the other bearers of the birthmark are murdered, Txema must flee America and heads to France under the protection of five beautiful vampires who all have a vested interest in her survival. The race is on to save her blood, as well as her very life, to ensure the survival of Les Amants de Vampire. Otherwise, Txema will be the last one…the vampires’ last lover.Acclaim for the novels of Aiden “The intense writing style of Aiden James kept my eyes glued to the story and the pages seemed to fly by at warp speed. …Twists, turns, and surprises pop up at random times to keep the reader off balance. It all blends together to create one of the best stories I have read all year.”—Detra Fitch, Huntress Reviews for The Devil’s Paradise“Aiden James has written a deeply psychological, gripping tale that keeps the readers hooked from page one.”—Bookfinds review for The Forgotten Eden“The hook to this excellent suspense thriller is the twists that will keep readers wondering what is going on as nothing is quite what it seems…Aiden James provides a dark thriller that grips fans from the opening.”—Harriet Klausner, for The Forgotten Eden“Aiden James writing style flows very easily and I found that Cades Cove snowballed into a very gripping tale. Clearly the strengths in the piece were as the spirit’s interaction became prevalent with the family… The Indian lore and ceremonies and the flashbacks to Allie Mae’s (earthly) demise were very powerful. I think those aspects separated the work from what we’ve seen before in horror and ghost tales.”—Evelyn Klebert, author of A Ghost of a Chance and Dragonflies“Aiden James is insanely talented!”—J.R. Rain, author of Moon Dance and Vampire Moon",
  "genres": [
    "Paranormal",
    "Action",
    "Thriller",
    "Suspense"
  ],
  "author": "Aiden James",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/11425445-cursed-immortals-omnibus-1"
}