{
  "title": "Sassy Mates, Volume 1",
  "description": "A collection of the first 3 books from the popular Sassy Mates series!Book 1: Scent of a MateWhen a good intention creates a problem for the Wolfe family, Jordan Alvarez finds herself being stalked by a woman intent on claiming Aric as her own. Battle lines will be drawn, love will be put to the test, and Aric will have to fight Jordan’s strong personality to keep her alive. Two alpha hearts seeking control will either find the balance or risk losing their love forever. Book 2: A Mate’s BiteShe. Is. His. Nathan Wolfe marked Karla. His mate. Deeply involved in pack politics, Nate has had to stay away. When his sister warns that Karla needs him more than he thinks, he'll discover a bundle of secrets only his wolf can sniff out. But getting the woman he cares about to let down her guard may prove to be his undoing. Book 3: Unexpectedly MatedAfter years of lusting over Jake Wolfe, Nicole Acosta finally got a taste of the dirty-talking bad boy. During the scenting ceremony, he showed her how explosive things can be between them. But Nicole doesn’t do love. She doesn’t even know what love is. So how can she know if a relationship with Jake would be the right path to take? Jake wants Nic more than his next breath. She’s curvy, mouthy and so hot his blood boils just thinking of her. But Nic’s been keeping him at a distance. And Jake is tired of her games. One fateful trip to Sin City and all bets are off. Warning: If you don't like sex of any kind, this is probably not the book for you. There's graphic language (yes, they tell their women how they like it), sassy humor (come on, it's Milly Taiden's books) and women that won't allow a man to browbeat them into doing what they say (unless they're naked). This omnibus is intended for adults that have no problems with dirty sex, humor and action. If that's what you, enjoy!",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Shapeshifters",
    "Erotica",
    "Amazon",
    "M F Romance"
  ],
  "author": "Milly Taiden",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/23489514-sassy-mates-volume-1"
}