{
  "title": "Boughs of Evergreen: A Holiday Anthology [Combined Edition]",
  "description": "Boughs of Evergreen is a two-volume collection of short stories celebrating the holiday season in all its diversity. Penned by authors from the UK, the USA, Scandinavia and Eastern Europe, these are tales of the young and the not-so-young from many different walks of life.Themes of family, friendship and romance take readers on a journey through some of the major holidays, both past and present, including Thanksgiving, Advent, St. Lucia Day, Hanukkah, Saturnalia, Winter Solstice, Yule, Christmas and New Year. In each we find at the very least hope, and often love, peace and happiness.Each story is also available as a separate ebook.Proceeds from sales of this anthology will be donated to The Trevor Project. The Trevor Project is the leading national organization [USA] providing crisis intervention and suicide prevention services to lesbian, gay, bisexual, transgender and questioning (LGBTQ) young people ages 13-24.THE STORIES:(combined edition includes all 22 stories)Volume One\"A Friend for Christmas\" - JP Walker\"A Midnight Clear\" - Debbie McGowan\"From All of Us to All of You\" - Ofelia Gränd\"Homme for the Holidays\" - Jonathan Penn\"Kiss Me At Kwanzaa\" - LL Bucknor\"Lion's Hero\" - Alexis Woods\"One Nightstand\" - Rick Bettencourt\"Shiny Things\" - Amy Spector\"The Bard and his Boyfriend\" - Kathleen Hayes\"The Christmas Present\" - Larry Benjamin\"X-Mas Cake: A Modern Fairytale\" - Raine O'TierneyVolume Two\"A Christmas Tale\" - Hans M Hirschi\"A Family Christmas\" - Terry Kerr\"A Little Christmas Magic\" - K.C. Faelan\"Always Have, Always Will\" - Amelia Mann\"An Angel in Eyeliner\" - Hunter Frost\"Boyfriend Goes Home\" - Laura Susan Johnson\"Christmas Commitment\" - Shayla Mist\"Coming in from the Cold\" - Ava Penn\"Holidays with Drum and Bell!\" - Matthias Williamson\"Te Amo, You Mushrooms\" - S.H. Allan\"The Invasion of Tork\" - Al Stewart and Claire Davis",
  "genres": [
    "Anthologies",
    "M M Romance",
    "Christmas",
    "Holiday",
    "Romance"
  ],
  "author": "J.P. Walker",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/23494152-boughs-of-evergreen"
}