{
  "title": "The Pine Tar Game: The Kansas City Royals, the New York Yankees, and Baseball's Most Absurd and Entertaining Controversy",
  "description": "An award-winning veteran sportswriter who personally covered the Pine Tar Game looks back and explores one of the wackiest events in baseball history.On July 24, 1983, during the finale of a heated four-game series between the dynastic New York Yankees and small-town Kansas City Royals, umpires nullified a go-ahead home run based on an obscure rule, when Yankees manager Billy Martin pointed out an illegal amount of pine tar—the sticky substance used for a better grip—on Royals third baseman George Brett’s bat. Brett wildly charged out of the dugout and chaos ensued. The call temporarily cost the Royals the game, but the decision was eventually overturned, resulting in a resumption of the game several weeks later that created its own hysteria.The Pine Tar Game chronicles this watershed moment, marking a pivot in the sport, when benign cheating tactics, like spitballs, Superball bats, and a couple extra inches of tar on an ash bat, gave way to era of soaring salaries, labor struggles, and rampant use of performance-enhancing drugs. Filip Bondy paints a portrait of the Yankees and Royals of that era, featuring two diametrically opposed owners, in George Steinbrenner and Ewing Kauffman; a host of bad actors and phenomenal athletes; and lots of yelling. Players and club officials like Brett, Goose Gossage, Willie Randolph, Ron Guidry, Sparky Lyle, David Cone, and John Schuerholz offer fresh commentary on the events along with their take on a rivalry that culminated in one of the most iconic baseball tantrums of all time. Rush Limbaugh, employed by the Royals at the time as a promotions director, offers his own insider’s perspective. Through this one fateful game, the ensuing protest, and ultimate fallout, The Pine Tar Game examines a more innocent time in professional sports, as well as the shifting tide that gave us today’s modern iteration of baseball.",
  "genres": [
    "Baseball",
    "Sports",
    "Nonfiction",
    "History"
  ],
  "author": "Filip Bondy",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/23492660-the-pine-tar-game"
}