{
  "title": "Betsey Brown",
  "description": "This is a unique and vividly told novel about a girl named Betsey Brown, an African American seventh-grader growing up in St. Louis, Missouri. While rendering a complete portrait of this girl, author Ntozake Shange also profiles her friends, her family, her home, her school, and her world. This world, though a work of fiction, is based closely and carefully on actual history, specifically on the nationwide school desegregation events of the Civil Rights movement in America’s recent past. As such, Betsey Brown is a historical novel that will speak to and broaden the perspectives of readers both familiar with and unaware of America’s domestic affairs of 1950s and 1960s.Shange has set her story in the autumn of 1959, the year St. Louis started to desegregate its schools. In May of 1954, in its ruling on Brown vs. Board of Education of Topeka--a verdict now seen by many as the origin of the Civil Rights movement--the United States Supreme Court outlawed school segregation. The novel is firmly located in the wake of this landmark ruling; the plot of Shange’s novel and the history of America’s quest for integration during the Civil Rights era are fundamentally entwined. Thus textual references abound to the watershed events at Little Rock’s Central High School in the September of 1957, for example, and to \"fire-bombings and burningcrosses\" in the South as well as \"'battalions of police and crowds of crackers'\" at a demonstration in St. Louis.Betsey is the oldest child in a large, remarkable, and slightly eccentric African American family. Her father is a doctor who wakes his children each morning with point-blank questions about African history and Black culture while beating on a conga drum; her mother is a beautiful, refined, confident, and strong-willed social worker who is overwhelmed by the vast size of her young family and who cares very little for “all that nasty colored music.”Indeed, Betsey’s whole existence can be seen as a perceptive, adventuresome, and still-developing hybrid of her parents’ most distinctive qualities. Her feelings of internal conflict are often clearer or easier to identify when seen as the collision of her father’s dreams and her mother’s manners, or her father’s music and her mother’s cosmetics. There are several fascinating characters in this novel—and encountering, describing, and trying to figure out these characters will appeal to students of all backgrounds—but the two characters who, after Betsey, most influence the directions, themes, and issues of this tale are Betsey’s mother and father, Jane and Greer. Their her parents' difficult marriage, like the difficult era of desegregation that has only begun in St. Louis and the rest of America, is the realistic, conflicted, yet ultimately hopeful backdrop before which Betsey’s lip-synching, poem-reciting, soul-searching, truth-seeking, tree-climbing, and fact-finding take place. In fact, her parents' stubborn disagreements, heartfelt reconciliations, past glories, and future worries are all, at various times in the book, anchored or else set adrift by the activities of theireldest daughter (and first teenager!). Betsey’s running away sends her parents into a vicious fight, while her subsequent return seems to bring them closer together (if only temporarily).As a novel, Betsey Brown is panoramic yet personal. It tells us what being a Black student in the early days of American desegregation was like by showing us what being Betsey Brown is like. This is an episodic, character-driven saga of the Black experience in St. Louis at the end of the “Fabulous Fifties,” but it is also a story about the many and various—and basically familiar—growing pains of a precocious, passionate, spunky young protagonist. We see Betsey fall in love; make friends; say prayers; argue with, look after, inspire, and ignore her younger siblings; run away from home; return to those who love and value her above all else; and switch from a school she knows and enjoys to a school on the other side of town where she is a minority and an outcast. We see Betsey outside the very door of her womanhood, we are told all about the steps and path that have brought her to this door, and we are left to wonder at what she will find beyond it.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Young Adult",
    "African American",
    "Coming Of Age",
    "Novels",
    "Race"
  ],
  "author": "Ntozake Shange",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/234937.Betsey_Brown"
}