{
  "title": "Life and Death in the Andes: On the Trail of Bandits, Heroes, and Revolutionaries",
  "description": "Unique portraits of legendary characters along South America’s mountain spine, from Charles Darwin to the present day, told by a master traveler and observerThe Andes Mountains are the world’s longest mountain chain, linking most of the countries in South America. Emmy Award-winning filmmaker Kim MacQuarrie takes us on a historical journey through this unique region, bringing fresh insight and contemporary connections to such fabled characters as Charles Darwin, Pablo Escobar, Che Guevara, and many others. He describes living on the floating islands of Lake Titicaca, where people still make sacrifices to the gods. He introduces us to a Patagonian woman who is the last living speaker of her language, as he explores the disappearance of indigenous cultures throughout the Andes. He meets a man whose grandfather witnessed Butch Cassidy’s last days in Bolivia and the school teacher who gave Che Guevara his final meal. MacQuarrie also meets the Colombian police officer who made it his mission to capture Pablo Escobar—the most dangerous cocaine king in the world.Through the stories he shares, MacQuarrie raises such questions as, where did the people of South America come from? Did they create or import their cultures? Why did the Incas sacrifice children on mountaintops—and how did these “ice mummies” remain so well preserved? Why did Peru’s Shining Path leader Guzmán nearly succeed in his revolutionary quest while Che Guevara in Bolivia so quickly failed? And what so astounded Charles Darwin in South America that led him to conceive the theory evolution? Deeply observed and beautifully written, Adventures in the Andes shows us this land as no one has before.",
  "genres": [
    "History",
    "Nonfiction",
    "Travel",
    "Audiobook",
    "Adventure",
    "Historical",
    "Geography"
  ],
  "author": "Kim MacQuarrie",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/23492808-life-and-death-in-the-andes"
}