{
  "title": "The Invisible Bridge: The Fall of Nixon and the Rise of Reagan",
  "description": "The New York Times bestselling dazzling portrait of America on the verge of a nervous breakdown in the tumultuous political and economic times of the 1970s.In January of 1973 Richard Nixon announced the end of the Vietnam War and prepared for a triumphant second term—until televised Watergate hearings revealed his White House as little better than a mafia den. The next president declared upon Nixon’s resignation “our long national nightmare is over”—but then congressional investigators exposed the CIA for assassinating foreign leaders. The collapse of the South Vietnamese government rendered moot the sacrifice of some 58,000 American lives. The economy was in tatters. And as Americans began thinking about their nation in a new way—as one more nation among nations, no more providential than any other—the pundits declared that from now on successful politicians would be the ones who honored this chastened new national mood.Ronald Reagan never got the message. Which was why, when he announced his intention to challenge President Ford for the 1976 Republican nomination, those same pundits dismissed him—until, amazingly, it started to look like he just might win . He was inventing the new conservative political culture we know now, in which a vision of patriotism rooted in a sense of American limits was derailed in America’s Bicentennial year by the rise of the smiling politician from Hollywood. Against a backdrop of melodramas from the Arab oil embargo to Patty Hearst to the near-bankruptcy of America’s greatest city, The Invisible Bridge asks the question: what does it mean to believe in America? To wave a flag—or to reject the glibness of the flag wavers?",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "American History",
    "Biography",
    "Presidents",
    "American"
  ],
  "author": "Rick Perlstein",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/23492635-the-invisible-bridge"
}