{
  "title": "Not a Game: The Incredible Rise and Unthinkable Fall of Allen Iverson",
  "description": "“This is more than just great sports writing, this is writing at its best. Babb strips away the public persona of iconic superstar Allen Iverson to tell a stunning story of triumph, tribulation and ultimate tragedy.”— R.G. Belsky, author of “The Kennedy Connection” and “The Midnight Hour”“Allen Iverson was impossible to ignore, a one man hurricane, on the court and off; equal parts dynamic and depressing. With Not a Game Kent Babb brilliantly tells his story and it's a tour de force like AI himself.” — Dan Wetzel, National Columnist, Yahoo! Sports and New York Times bestselling authorFormer NBA superstar Allen Iverson was once one of America's most famous athletes: a trendsetter who transcended race, celebrity, and pop culture, and emerged from a troubled past to become one of the most successful and highly compensated athletes in the world. Now, his life and career comes vividly to light in this hard-hitting biography that examines what drove his successes and failures.Through extensive research and interviews with those closest to Iverson, acclaimed Washington Post sportswriter Kent Babb gets behind the familiar, sanitized, and heroic version of Iverson: the hard-charging, hard-partying athlete who played every game as if it were his last. Babb brings to life a private, loyal, and often generous Allen Iverson who rarely made the headlines, revealing the back story behind some of Iverson's most memorable moments, such as his infamous \"Practice\" rant, delving even deeper to discover where Iverson's demons lurked. He drank too much, stayed out too late, spent more money than most people could spend in a dozen lifetimes: blowing more than $150 million of his NBA earnings alone. His then wife Tawanna, seen often as the mild-mannered woman who tamed the bad boy, tried to keep her husband and family on the rails. But she was no match, as so many others learned on basketball courts, for the force of nature that Iverson was: jealousy, meanness, and a restlessness eventually wearing down even his biggest fan, teammate, and, eventually, his most formidable opponent. Over time, Iverson himself had come to believe his own hype: that he lived in a world where celebrity is eternal and riches are everlasting. He was about that life even when he was no longer the fastest man on the court, as endorsement deals and long-term contracts became a thing of the past. Some in his inner circle saw the writing on the wall and encouraged Iverson to embrace life beyond basketball. But instead, he remained in denial.Not a Game is an impeccably researched, sometimes uncomfortable look at the factors that led to the rise and fall of a basketball superstar. In doing so, it illuminates the dark side of our modern day, multi-billion dollar sports and entertainment culture in which talented players are disposable and all too often success and tragedy wear the same number.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Basketball",
    "Biography",
    "Audiobook",
    "Book Club",
    "Biography Memoir"
  ],
  "author": "Kent Babb",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/23492756-not-a-game"
}