{
  "title": "Big Science: Ernest Lawrence and the Invention that Launched the Military-Industrial Complex",
  "description": "From a Pulitzer Prize winning journalist and Los Angeles Times contributor, the untold story of how science went big,built the bombs that helped win World War II, and became dependent on government and industry and the forgotten genius who started it all, Ernest Lawrence.Since the 1930s, the scale of scientific endeavors has grown exponentially. Machines have become larger, ambitions bolder. The first particle accelerator cost less than one hundred dollars and could be held in its creator's palm, while its descendant, the Large Hadron Collider, cost ten billion dollars and is seventeen miles in circumference. Scientists have invented nuclear weapons, put a man on the moon, and examined nature at the subatomic scale all through Big Science, the industrial-scale research paid for by governments and corporations that have driven the great scientific projects of our time.The birth of Big Science can be traced to Berkeley, California, nearly nine decades ago, when a resourceful young scientist with a talent for physics and an even greater talent for promotion pondered his new invention and declared, \"I'm going to be famous!\" Ernest Orlando Lawrence's cyclotron would revolutionize nuclear physics, but that was only the beginning of its impact. It would change our understanding of the basic building blocks of nature. It would help win World War II. Its influence would be felt in academia and international politics. It was the beginning of Big Science.This is the incredible story of how one invention changed the world and of the man principally responsible for it all. Michael Hiltzik tells the riveting full story here for the first time.",
  "genres": [
    "Science",
    "History",
    "Biography",
    "Nonfiction",
    "Audiobook",
    "Politics",
    "Technology"
  ],
  "author": "Michael Hiltzik",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/23492843-big-science"
}