{
  "title": "The Year’s Best Military SF & Space Opera: First Annual Edition",
  "description": "The Year’s Best Military SF & Space Opera: First Annual Edition. Book One of a new Series (Year's Best Military and Adventure SF), featuring the best stories of the year from the top magazine and online venues with a military and adventure science fiction theme. With an introduction by best-selling military science fiction author David Drake and selected by editor David Afsharirad from the top short story markets in the field, here are the most thrilling, pulse-pounding, and thought-provoking stories of the past year. Stories of future military men and women, space opera on a grand scale, and edge-of-your-seat adventure tales in the pulp tradition, from giants of the genre to brilliant up-and-comers.Contents: Preface (The Year's Best Military SF & Space Opera) • essay by David Afsharirad Excitement! Adventure! Science Fiction! • essay by David Drake Codename: Delphi [The Red] (2014) / short story by Linda Nagata Persephone Descending (2014) / novelette by Derek Kunsken The End of the Silk Road (2014) / novelette by David D. Levine Picket Ship (2014) / novelette by Brad R.Torgersen Decaying Orbit (2014) / short story by Robert R. Chase Morrigan in the Sunglare (2014) / short story by Seth Dickinson Light and Shadow (2014) / short story by Linda Nagata Icarus at Noon (2014) / short story by Eric Leif Davin Soft Casualty [Freehold Short Fiction] (2014) / short story by Michael Z. Williamson Palm Strike's Last Case (2014) / novelette by Charlie Jane Anders Brood (2013) / novelette by Stephen Gaskell Stealing Arturo (2014) / novelette by William Ledbetter Rules of Engagement (2014) / novelette by Matthew Johnson Ten Rules for Being an Intergalactic Smuggler (the Successful Kind) (2014) / novelette by Holly Black War Dog (2014) / short story by Mike Barretta [as by Michael Barretta].",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Short Stories",
    "Fiction",
    "Military Science Fiction",
    "Anthologies"
  ],
  "author": "David Afsharirad",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/23492557-the-year-s-best-military-sf-space-opera"
}