{
  "title": "A Plague of Shadows",
  "description": "Enter the world of O, where a plague of shadows creeps through the land, ensnaring those it infects and turning them into soulless shadow people damned to pollute all of the nine worlds along the world tree. Fear of these darklings, and the magic they possess drives people to kill those that appear different or go against the light.At nineteen Abagail Bauer should be setting off on her own, not still caring for her father and her family home as she’s doing. The hard life has made her practical, and she has little time for flights of fancy, unlike her sister, Leona, who insists her doll can predict the future. That all changes one day. While tending their bees she encounters a blackness spreading through the hive. Abagail knows what it is: the shadow plague, the sickness that will creep into ones soul and make them nothing more than a shadow, a darkling bent on the destruction of all things good. And now she’s caught it. She doesn’t believe in other worlds outside of the land of O, but when her father finds out she’s infected he decides to send her to the one person who can help her learn to control this weird power: her Aunt Mattelyn in a distant world called Agaranth, and for Abagail everything she’s believed to be myth becomes a staggering reality.Joined by her neighbor, Rorick Keuper, on a quest of revenge against the darklings who destroyed his home, and her seer sister, Leona, Abagail sets off across the rainbow bridge to another world in hopes of curing herself of the plague. But Abagail finds that her infection is only the beginning of her ill fate. When she arrives in the new world, she’s far from where she needs to be. Braving the winter of this new land, along with the darklings that hunt her, will Abagail be able to find her aunt before the shadow consumes her, or is she destined to become a husk of who she once was and kill those she loves?",
  "genres": [
    "Fantasy",
    "Young Adult"
  ],
  "author": "Travis Simmons",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/23497944-a-plague-of-shadows"
}