{
  "title": "Sherlock Holmes and the Frightened Golfer",
  "description": "London, February 1896. A bright crisp day is the first hint of the spring to come, a welcome intrusion into the winter gloom of the great industrial city. But as Watson welcomes the sun and tries to cheer up a restless Holmes, there is an urgent knock at the door of 221B Baker Street. A moment later, a large man bursts into the living quarters of the famous detective. Alfred Bullimore is a very skilled but also an extremely frightened golfer and he brings with him one of the strangest cases ever to be recorded in Dr Watson's assiduous notes. What had seemed at first to be no more than tasteless horseplay at Royal Blackheath Golf Club is now threatening to escalate into serious violence. Already there has been an attack upon an elderly member walking his dog at dusk, and soon this is followed by an attempt at murder, which brings Holmes and Watson swiftly to the scene of the crime at the famous old golf club. Bullimore is a good enough golfer to mount a serious challenge to win the Open Championship of 1896. But as his successes accumulate in the month before the Open, the threat to his safety seems ever greater. The climax of the tale is set thrillingly on the last day of the 1896 Open Championship at Muirfield, with the solution as unexpected as it is timely. Sherlock Holmes and the Frightened Golfer is a brilliant addition to the stories of Victorian London's greatest detective. Praise for J M Gregson: ‘Begins with quiet observation before pouncing to murderous effect’ - Sunday Express ‘A chilling story that never flags from start to finish’ - Bolton Evening News J M Gregson is a Lancastrian by birth and upbringing. He taught for twenty-seven years in schools, colleges and universities before taking early retirement to concentrate on full-time writing. His other titles include ‘Girl Gone Missing’, ‘An Unsuitable Death’, ‘Bring Forth Your Dead’, ‘Making a Killing’ and ‘Stranglehold’. Endeavour Press is the UK's leading independent publisher of digital books.",
  "genres": [
    "Mystery",
    "Crime"
  ],
  "author": "J.M. Gregson",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/23494237-sherlock-holmes-and-the-frightened-golfer"
}