{
  "title": "Club Alpha",
  "description": "Want to take a peek behind that red velvet curtain? Come join our Club Alpha authors as they take you into the inner sanctums of some of the hottest, most exclusive clubs you'll ever have the privilege of witnessing. Some come for the discipline, some come for the thrill, some come to find sweet passion, but all go away initiated in the ways of love.Surrender to the dominance of these thirteen novels from authors including Adriana Hunter, Selena Kitt and Terry Towers.Club Alpha isn't a place--it's a state of mind you're going to want to visit again and again!Claiming His Tease by Amy Valenti - Josh is all Dom and sexy as hell, and he's prepared to wait for Lena to come to him. All she has to do is kneel at his feet, and she'll be his. But is she too stubborn to give him the satisfaction?Breaking Boundaries by Sienna Stapleton - With the hopes of expanding her sexual horizons, Beth books a weekend at a sexual therapy retreat. Once there, she quickly learns that the weekend will be much more than she bargained for.The Billionaires' Club: Deceiving Him by Terry Towers - Going under cover, Lexie finds herself in a world like none other. After she meets the sexy billionaire Vince and is introduced to unimaginable pleasures, can she still go through with her expose?Club Soria by Emilia Kincade - Maya's life is falling apart. She runs away to Thailand to find some peace. When she is invited to Club Soria, she doesn't know what to expect. Her 'awakening' catches her entirely by surprise!The Sybian Club by Selena Kitt - Tasha convinces husband, Max, to buy a Sybian, starting a club to pay for it. Friend Ashley helps but Tasha doesn't know how to tell Max she wants to add more to their sex life than just a new toy.His Desire, her Surrender by Malia Mallory - When Marcus tracks Tabitha down to resume the sizzling affair they began in the islands, can Tabitha prove that she has what it takes to be both his partner and his submissive?Escape by PJ Adams - Just who is the masked stranger at Club Extraordinaire and what is it that draws Julie so powerfully? Is it the way he's so confident and masterful? Or is it that he reminds her so strongly of her ex?Pavlov by Arden Aoide - Tyrone Parker had obstinacy down to an art and was the reigning champion of Having the Last Word. He had his own definition of Domination that had women running away fast. Until the one that stayed.Control: Masters of the Sanctuary by Elsa Day - When Amy sneaks into the sanctuary, she has no idea what she's in for. She runs into trouble, and Master J is the only one who can help her. But his health comes with a price: her total submission.At the Billionaire's Command by Juliette Jaye - Recent small town transplant to New York City Sophie never expects to hook up with the billionaire boss of her company. But the even bigger surprise is when she finds herself falling in love with him.Rough Edges by Adriana Hunter - I didn't expect to wake up, unable to move. When he told me that I was a player in his wicked game I knew I had made a mistake. I didn't ask for this. I didn't want it. At least not in the beginning.Club Red by Sophie Sawyer - When curvy beauty Tori visits Club Red for no-strings fun, the last thing she expects is to find everything she ever wanted!Precious Pet by Candy Quinn - What started as a way to make some ext",
  "genres": [
    "BDSM",
    "Erotica",
    "Anthologies",
    "Erotic Romance",
    "Contemporary Romance",
    "Romance",
    "Amazon"
  ],
  "author": "Selena Kitt",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/23498304-club-alpha"
}