{
  "title": "Mate With Me",
  "description": "Another sizzling erotic tale of female surrender from author BJ Wane – this time with a vampire twist!Damien LaRue has spent the better part of two hundred years trying to atone for an act he’d been driven to commit shortly after master vampiress, Isabelle Sartre ended his life in 1815. Because he can never forgive himself, he plans to ‘meet the dawn’ soon, never intending to claim his mate. However, he hadn’t counted on Abrielle Chirac’s tenacity and her utter faith in him. When a strange mark suddenly appears on her breast, Abby discovers that she is destined to become her guardian’s mate. She’s determined to use her body to break through Damien’s wall of resistance. She wants the man as much as her body craves the vampire! Unfortunately, Damien’s will is stronger than her attempts at seduction, and it isn’t until she’s attacked by rogues and Damien brings her to his home for protection that she gets the chance to finally become his in every way.Damien isn’t the only one to have a run-in with vampire rogues. Jacob Carter has spent decades longing to find his mate, but when he finally does, it’s to rescue her from one of his own. Grace Larsen is shocked to discover an immediate sexual response to the vampire who comes to her rescue. But ignoring her body’s desires, she refuses to believe that Jacob is any different than the vampire who tormented her. However, when Jacob is critically wounded from a rogue attack, Grace is left with two choices—watch the man she has grown to care for die, or use her body, the one thing she’s withheld from him, to save him.In time, Damien, Jacob and their fellow vampires discover that their nemesis, Isabelle, is behind the rogue attacks. But before they have any hope of permanently ending Isabelle’s existence, they must resolve the issues that keep them from completing their mating bonds.This sexy tale of love and surrender includes spanking, exhibitionism, oral and anal, ménage.",
  "genres": [
    "Menage",
    "BDSM"
  ],
  "author": "B.J. Wane",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/23498004-mate-with-me"
}