{
  "title": "Mizpah Cousins: life, love and perilous predicaments during the Great War era.",
  "description": "This compelling true and unique story is set in the East End of London around the World War One era. Ambitious working class cousins, Amalia and Agnes yearn to escape the grime of London. They follow love, with hope of advancement. Agnes falls for a handsome waiter; their illicit love in Paris could spell her doom. Shocked by Agnes's predicament—Amalia tries not to judge. She has wed and found happiness living in idyllic Versailles. Meanwhile back in the East End, the family are oblivious to Agnes’s trauma.The families are living in London, Hamburg and Versailles (different lines of the conflict) as the War begins. Amalia's family are imprisoned in Versailles. This leads to her epic journey across France to hostile Germany with two small children. The families, who are still living in the East End of London, now suffer the new phenomenon of German bombing raids. Meanwhile, Agnes now living in Hamburg tells the story of her life. She is a child. Her husband’s poignant letters arriving from the front line- imply the horrors of war. Cousin George is serving in the Royal Navy. He describes a fine adventure in Bermuda, while cousin Otto is facing the perils of German U boats, serving in the merchant navy. The depravities of war chase these brave and stoic souls. Each cousin’s story reflects different sides of this momentous conflict. This illustrated family saga contains original photographs. It tells of cousins, born in the East End of London from the German émigré families. The story begins in the emerging Edwardian society of 1909. It describes the hardships and ambitions, the life and loves of working class cousins. This era is portrayed with sparkling authenticity. M A Lossl has extensively studied archive material. M A Lossl's next book 'Betweenwhiles' will chart the continuing family saga as the echoes of war effect the newly forged peace. Hope springs eternal despite tragic family circumstances.",
  "genres": [],
  "author": "M.A. Lossl",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/23502675-mizpah-cousins"
}