{
  "title": "Burning Down Rome",
  "description": "Out of Print. Used paperback copies may be available through select Amazon Sellers.\"When your life becomes a lie you can close your eyes. Or start bucking like a wild horse and become a legend.\" BURNING DOWN ROME follows four friends on their spectacular journey to rock super-stardom.Hand picked by a record label at too young an age, they quickly came to understand that the business of fame was all a big game. Nothing was real. Sold out show after sold out show, autograph after autograph, screaming fans, television appearances and interviews in every major city, pushing through exhaustion just for the high they got on stage... Living the dream was all that mattered.Until the day arrived when not one of them could remember what the dream was about anymore.In spite of being caught in the maelstrom of unprovoked media attacks, vicious personal vendettas, and massive professional pressures, their band - Cry Baby Jake - brazen, bold and ultra-talented, ascended to the top of the rock'n'roll world where they held steady for six solid years. That's when the work related injuries - the behind-the-scenes mental torture, intense physical tolls and the hidden, soul-numbing truths of the industry that fans never see, set in.\"Living the dream\" began to unravel for Cry Baby Jake's fearless leader, Aiden \"Kid\" Cade. His thoughts and emotions were drowned out by the millions of strangers crying his name - all of them believing that they knew him intimately, but to him were strangers. He lost his inner compass. He forgot who he was. Then he lost his ability to reason. And, a victim to inner demons he could no longer control, eventually, he nearly lost his life.One band member saw it coming. Another ignored the signs.And the third loved him through it all.While the world cheered for him, so loud he couldn't hear his own heart beating, behind the scenes Kid was poised between the band's overwhelming success and his feelings of crushing personal failure. In the midst of it all Kid fell in love, fell apart, melted down to almost nothing, and finally realized that making his way in a land of make-believe could either be deadly, or it could set him free. Burning Down Rome is the story of a rock'n'roll dream that became a nightmare for four unconquerable souls who nearly lost it all: Themselves, each other, and their passion... And who then reclaimed their destinies, and blazed beyond what the world said they were allowed to do.",
  "genres": [
    "Music",
    "Literary Fiction",
    "Coming Of Age",
    "Romance",
    "Friendship",
    "Fiction"
  ],
  "author": "Melodie Ramone",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/23501174-burning-down-rome"
}