{
  "title": "KNIGHT STORM",
  "description": "~Knight Storm~A storm was brewing and Rhianna du Montefort knew that nothing good would come of it. Known for her skills with herbs and respected as a Healer, she turned a deaf ear to the hurtful whispers of “witch”. She and her brother, Randall were the sole heirs of their parents’ thriving keep and outlying lands. Even as a child, she rose to the task at hand so long as her brother was beside her. The problem was that her brother had been missing for nearly six moons. There had been no word of his whereabouts or for that matter if he was dead or alive.Sir Erik Ragnorsen, a high ranking Knight of the Realm known for his prowess on the battle field and his unyielding sense of honor, had been commanded to marry the heir of du Montefort Keep. What he had heard about her was that she was a witch and a crone, well past the age of marrying. He did not want to marry anyone, let alone a magic wielding hag. Though he petitioned the king to retract the edict, Sir Erik was obliged to comply. With a sick heart and spirit, he would never forsake his honor and would do his duty as bidden by the King. Only upon reaching the du Montefort lands, Erik soon realizes that things were not as he had been told. The crone was nothing more than a young woman; a beautiful one at that. As for the other, well, Sir Erik could attest that he had quite possibly been bewitched by the raven-haired Lady Rhianna.When Rhianna learns that the storm she had been sensing was really a maelstrom in the form of a man named Erik Ragnorsen, she vows she would not marry him. Upon seeing the blond giant who rivaled the Norse god of Thunder, Thor, she felt her resolve crumbling. Not only that, he had been in her dreams; he was there when she dreamed of her parents’ demise on the seas that stormy night when she was just a child. Erik vows to protect the Lady Rhianna at all costs and his promise will be sorely tested when an evil baron decides to take her for his own. Amid lies and betrayal, Rhianna still dreams of the one who saved her so long ago. Will their love be strong enough to weather the storm that threatens to tear them apart?",
  "genres": [],
  "author": "Ria Cantrell",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/23502075-knight-storm"
}