{
  "title": "Tear Asunder - Box Set",
  "description": "WITH YOUSculpt is an illegal fighter.He’s also the lead singer of a local rock band.No one knows his real name.And from the moment I met him, he made me forget mine.In order to convince Sculpt to give me self-defense lessons, I had to follow his one rule—no complaining or he’d walk. I didn’t think it would be a problem. I could handle a few bruises. What I hadn’t anticipated was landing on my back with Sculpt on top of me and my entire body burning up for him.I tried to ignore it.I failed of course. And having a hot, tattooed badass on top of me week after week, acting completely immune to what he was doing to my body — it was frustrating as hell, so I broke his rule — I complained.Then he kissed me.TORN FROM YOULove is like an avalanche. It hits hard, fast and without mercy.At least it did for me when Sculpt, the lead singer of the rock band Tear Asunder knocked me off my feet. Literally, because he’s also a fighter, illegally of course, and he taught me how to fight. He also taught me how to love and I fell hard for him. I mean the guy could do sweet, when he wasn't doing bossy, and I like sweet.Then it all shattered.Kidnapped.Starved.Beaten.I was alone and fighting to survive.When I heard Sculpt's voice, I thought he was there to save me.I was wrong.OVERWHELMED BY YOULove is ugly and secrets will destroy you.KATI don’t beg.I don’t cry.And I don’t give second chances.Ream, the lead guitarist of the rock band Tear Asunder, deserves a gold medal for best dick move ever when he ran the moment he discovered my secret after two days of hot sex. Then he brings some chick to my coming home party from the hospital — after being shot.I hate him.Until …Ream’s six foot two frame unfolds out of the car after being gone on tour for eight months. I stared. And in my defense, any girl would stare. It would almost be rude not to because Ream was the type of guy who stood out. Not because he was loud and obnoxious. No, it was because he was the complete opposite. Subtle and dangerously quiet. If he spoke, you’d better hope he liked you because otherwise you’d be falling at his feet begging for mercy. Except me … I don’t beg—ever.But when our eyes locked, it was Ream’s steady confidence that had my nerves shooting off like jet sprinklers.Then…Ream told me he didn't need a second chance because he was still working on his first.REAMSex is ugly. It’s using someone for your own narcissistic pleasure. I did it, but hated it—until her. She was unexpected. Then I had to wreck our beginning with my screwed up past. I don’t deserve her, but I’m selfish and I’m taking her anyway. This is who I am and it’s too late to change me.",
  "genres": [
    "Romance"
  ],
  "author": "Nashoda Rose",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/23501977-tear-asunder---box-set"
}