{
  "title": "The Physicist and the Philosopher: Einstein, Bergson, and the Debate that Changed Our Understanding of Time",
  "description": "On April 6, 1922, in Paris, Albert Einstein and Henri Bergson publicly debated the nature of time. Einstein considered Bergson's theory of time to be a soft, psychological notion, irreconcilable with the quantitative realities of physics. Bergson, who gained fame as a philosopher by arguing that time should not be understood exclusively through the lens of science, criticized Einstein's theory of time for being a metaphysics grafted on to science, one that ignored the intuitive aspects of time. The Physicist and the Philosopher tells the remarkable story of how this explosive debate transformed our understanding of time and drove a rift between science and the humanities that persists today.Jimena Canales introduces readers to the revolutionary ideas of Einstein and Bergson, describes how they dramatically collided in Paris, and traces how this clash of worldviews reverberated across the twentieth century. She shows how it provoked responses from figures such as Bertrand Russell and Martin Heidegger, and carried repercussions for American pragmatism, logical positivism, phenomenology, and quantum mechanics. Canales explains how the new technologies of the period--such as wristwatches, radio, and film--helped to shape people's conceptions of time and further polarized the public debate. She also discusses how Bergson and Einstein, toward the end of their lives, each reflected on his rival's legacy--Bergson during the Nazi occupation of Paris and Einstein in the context of the first hydrogen bomb explosion.The Physicist and the Philosopher reveals how scientific truth was placed on trial in a divided century marked by a new sense of time.Jimena Canales holds the Thomas M. Siebel Chair in the History of Science at the University of Illinois, Urbana-Champaign, and was previously associate professor of the history of science at Harvard University. She is the author of A Tenth of a Second: A History.Review:\"In illuminating a historic 1922 debate between Albert Einstein and Henri Bergson about the nature of time, Canales marks a turning point in the power of philosophy to influence science.\"--Publishers Weekly\"Sparks—both incendiary and illuminating—fly from the collision of two giants!\"--Booklist, starred review\"This fascinating, scholarly, readable look at physics and epistemology will interest readers of science, history, philosophy, and biography.\"--Library Journal, starred review\"Whether or not you agree, this humane and melancholy account of how two talents misunderstood each other will linger in the mind.\"--New Scientist\"[Canales] weaves a tale around Europe and to America. . . . [Her] subject raises important core philosophical issues, like the scope of philosophy itself.\"--Michael Ruse, The Chronicle of Higher Education\"This fascinating book traces a debate about the nature of time. . . . Canales has done a masterful job of research and explication. Her account of the debate is lively, the background of it is interesting, and the debate’s ramifications as filtered through other minds are downright exciting. Anyone interested in physics or philosophy will have a field day with this book.\"--Kelly Cherry, The Smart Set\"Canales does sterling work investigating these engagements . . . [A] stimulating book.\"--Graham Farmelo, Nature\nEndorsement:\n\"The Physicist and the Philosopher explores the nature of time, the meaning of relativity, and the place of philosophical thought in a scientific age. Canales aims to reposition Einstein's work in a field of disputation and give Bergson back the significance he had in his contemporaries' minds.\"--Cathryn Carson, University of California, Berkeley",
  "genres": [
    "Philosophy",
    "Science",
    "Nonfiction",
    "History",
    "Physics",
    "History Of Science",
    "Audiobook"
  ],
  "author": "Jimena Canales",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/23500546-the-physicist-and-the-philosopher"
}