{
  "title": "Mochi's War: The Tragedy of Sand Creek",
  "description": "Colorado Territory in 1864 wasn't merely the wild west, it was a land in limbo while the Civil War raged in the east and politics swirled around its potential admission to the union. The territorial governor, John Evans, had ambitions on the national stage should statehood occur--and he was joined in those ambitions by a local pastor and erstwhile Colonel in the Colorado militia, John Chivington. The decision was made to take a hard line stance against any Native Americans who refused to settle on reservations--and in the fall of 1864, Chivington set his sights on a small band of Cheyenne under the chief Black Eagle, camped and preparing for the winter at Sand Creek.When the order to fire on the camp came on November 28, one officer refused, other soldiers in Chivington's force, however, immediately attacked the village, disregarding the American flag, and a white flag of surrender that was run up shortly after the soldiers commenced firing.In the ensuing \"battle\" fifteen members of the assembled militias were killed and more than 50 wounded Between 150 and 200 of Black Kettle’s Cheyenne were estimated killed, nearly all elderly men, women and children.As with many incidents in American history, the victors wrote the first version of history--turning the massacre into a heroic feat by the troops. Soon thereafter, however, Congress began an investigation into Chivington's actions and he was roundly condemned. His name still rings with infamy in Colorado and American history. Mochi’s War explores this story and its repercussions into the last part of the nineteenth Century from the perspective of a Cheyenne woman whose determination swept her into some of the most dramatic and heartbreaking moments in the conflicts that grew through the West in the aftermath of Sand Creek.",
  "genres": [
    "History",
    "Native American"
  ],
  "author": "Chris Enss",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/23503216-mochi-s-war"
}