{
  "title": "February The Fifth",
  "description": "After the sudden and mysterious death of his father, a young fool becomes the ruler of twelve whole sun systems, and quickly discovers he has some very nasty enemies. Particularly the ones, who quite quickly, start shooting at him. \"Author Derek Haines has truly outdone himself with this fabulous story of a very unlucky young man.\" \"Like Haines' other books, the character development is unparalleled.\" \"...insanely imaginative...intensely insightful...just plain fun.\" In a remarkable turn of events, a young man with a lot definitely not going for him, manages to come to terms with a startling reality. He has to grow up. Being handicapped by not only having rather nasty acne and an odd eye impediment, he also has to suffer the fact that his name is February. Or at best, Feb to his very limited number of friends. While not at all wishing to rush into this startling new reality, circumstances and a few elbow nudges from his very protective elder sister ensure that his ‘not at all wishing’ turns out to be a complete waste of time. Thrust totally and unwillingly into a position of authority by early afternoon, February finds himself with a new appendage tacked on to the end his name. The Fifth. The new and very authoritative part of his name. February The Fifth and Supreme Potentate of the Twelve Sun Systems of Gloth. Of course, as is the case in all such rapid and thrusting types of promotion to positions of power, there will be those who are not happy about it. In February’s case however, he finds that in fact these those amount to just about everyone apart from his three sisters. Undaunted by this reality, Feb accepts his new responsibility and by early evening sets about getting himself into a real tangle. His only true achievement being that he discovers that quite a few of these those who weren’t so happy, are in fact really very upset about the whole Fifth appendage deal. By bedtime, he thinks he is in trouble. Before lunchtime the next day, he is sure. Read February The Fifth, a laugh a minute romp around the galaxy.",
  "genres": [
    "Fantasy"
  ],
  "author": "Derek Haines",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/10155399-february-the-fifth"
}