{
  "title": "The Vampire Awakening Series: Awakened & Destined Box Set",
  "description": "Librarian note: Older cover of 9781310938931.The first three books in the USA Today bestselling Vampire Awakenings Series.Book 1, Awakened.Traumatized by her past, and struggling to move on from it, Sera has spent the past three years of college hiding from the world and content to stay that way. A chance encounter with Liam shatters her sheltered world. Sera is shaken by the strange emotions he arises in her, emotions she never thought she would experience, but she finds herself opening up to him more every day. Harboring a dark and deadly secret of his own, Liam knows he should stay away from Sera as he will only bring her more hurt. However, he finds himself irresistibly drawn to her.But when their pasts collide with their present, and Liam’s true nature is revealed, will their love for each other be enough, or will they be torn apart forever?Book 2, Destined.Terrified of becoming mated like her parents, Isabelle has locked herself away to avoid their fate. She is content to stay sheltered amongst her family as she lives out her days away from the human race, and the world. Despite her determination to remain alone, her world is rocked when a person from her parent’s past arrives at their door, bringing with them the powerful, and stunning vampire Stefan.Stefan isn't expecting to walk into a nest full of vampires, but he is immediately drawn to the vibrant, often defiant, and willful Isabelle. To his surprise, Isabelle does everything in her power to avoid him, and her desire for him. No matter how hard she tries to fight it though, Isabelle begins to realize that trying to deny her destiny may destroy them both, as some things cannot be stopped. Just as she starts to let her guard down, Stefan’s dark and deadly past catches up to him and threatens to destroy them both.Book 3, Untamed.His entire life Ethan has been keeping his more violent urges a secret from his family. They all think he is just antisocial, what they don’t know is that every day he struggles not to give into his growing desire to kill. Looking to escape for a little bit and hoping a change of scenery will help him, he agrees to join Isabelle and Stefan in Bermuda.What he doesn’t expect is for Emma to walk into his life and change it in ways he never could have anticipated. Just when he finally begins to find some peace in his life, a dangerous threat from Emma’s past arrives. Ethan is willing to do anything to keep Emma safe, even if it means giving into the brutality he’s spent his entire life fighting. Giving in a little though, may mean giving in forever, if he is unable to bring himself back from the darkness that has always enticed him.***Due to sexual content, violence, and language, this book is recommended for readers 18+ years of age.***Each book in this series involves a different couple.Recommended Reading Order for The Vampire Awakenings Series:Awakened (Book 1)Destined (Book 2)Untamed (Book 3)Enraptured (Book 4)Undone (Book 5)Fractured (Book 6)Cover art by EbookLaunch",
  "genres": [
    "Vampires",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Paranormal Romance",
    "Amazon",
    "Suspense"
  ],
  "author": "Brenda K. Davies",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/23506946-the-vampire-awakening-series"
}