{
  "title": "The Mark of the Dragonfly",
  "description": "For fans of Wrinkle in Time  and The School of Good and Evil, the New York Times bestseller The Mark of the Dragonfly is a fast-paced adventure story about a mysterious girl and a fearless boy, set in a magical world that is both exciting and dangerous.    Piper has never seen the Mark of the Dragonfly until she finds the girl amid the wreckage of a caravan in the Meteor Fields.    The girl doesn’t remember a thing about her life, but the intricate tattoo on her arm is proof that she’s from the Dragonfly Territories and that she’s protected by the king. Which means a reward for Piper if she can get the girl home.    The one sure way to the Territories is the 401, a great old beauty of a train. But a ticket costs more coin than Piper could make in a year. And stowing away is a difficult prospect—everyone knows that getting past the peculiar green-eyed boy who stands guard is nearly impossible.    Life for Piper just turned dangerous. A little bit magical. And very exciting, if she can manage to survive the journey.Praise for The Mark of the Dragonfly : ★ “This magnetic middle-grade debut …[is] a page-turner that defies easy categorization and ought to have broad appeal.”— Publishers Weekly , Starred ★ “ Heart, brains, and courage find a home in a steampunk fantasy worthy of a nod from Baum.”-- Kirkus Reviews , Starred ★ “ A fantastic and original tale of adventure and magic ...Piper is a heroine to fall in love smart, brave, kind, and mechanically inclined to boot.”— School Library Journal , Starred “ A complex and impeccably developed plot —there is plenty to recommend in this novel.”— The Bulletin “Appealing characters and lots of action make it a good choice for young adventure readers. ”— Booklist",
  "genres": [
    "Fantasy",
    "Middle Grade",
    "Steampunk",
    "Adventure",
    "Young Adult",
    "Science Fiction",
    "Fiction"
  ],
  "author": "Jaleigh Johnson",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/23502623-the-mark-of-the-dragonfly"
}