{
  "title": "Te vendo un perro",
  "description": "En un ruinoso edificio de la ciudad de México, un grupo de ancianos pasa los días entre rencillas vecinales y tertulias literarias. Teo, el narrador y protagonista de esta historia, tiene setenta y ocho años y un apego enfermizo a la Teoría estética de Adorno, con la que resuelve todo tipo de problemas domésticos. Taquero jubilado, pintor frustrado con pedigrí –hijo de otro pintor frustrado–, sus mayores preocupaciones son llevar la cuenta de las copas que toma al día para extender al máximo sus menguantes ahorros, escribir en un cuaderno algo que no es una novela y calcular las posibilidades que tiene de llevarse a la cama a Francesca –presidenta de la asamblea de vecinos– o a Juliette –verdulera revolucionaria–, con las que constituye un triángulo sexual de la tercera edad que «le habría erizado la barba al mismísimo Freud». La vida rutinaria del edificio se rompe con la irrupción de la juventud, encarnada en Willem –mormón de Utah–, Mao –maoísta clandestino– y Dorotea –la dulce heroína cervantina, nieta de Juliette–, en un crescendo de absurdos que arriba a un clímax para mojarse los pantalones. Concebida bajo el dictado de Adorno, que afirma que «el arte avanzado escribe la comedia de lo trágico», entrelazando fragmentos del pasado y del presente, esta novela recorre el arte y la política del México de los últimos ochenta años, marcados en la historia familiar por la sucesión de perros de la madre del protagonista, en un intento por reivindicar a los olvidados, los malditos, los marginales, los desaparecidos y los perros callejeros. Con su tercera novela, el escritor mexicano Juan Pablo Villalobos, tras la excelente acogida, tanto en lengua española como en sus muchas traducciones, de Fiesta en la madriguera y Si viviéramos en un lugar normal, se confirma como un narrador imprescindible, con una voz personal y un sentido del humor muy singulares.",
  "genres": [
    "Fiction",
    "Humor",
    "Spanish Literature",
    "Contemporary",
    "Novels",
    "Literary Fiction",
    "Book Club"
  ],
  "author": "Juan Pablo Villalobos",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/23507339-te-vendo-un-perro"
}