{
  "title": "Relentless Savage: A Peter Savage Novel",
  "description": "\"Not since Crichton's Jurassic Park have I read such an engaging mix of genetic misdeed and thrilling action.\" - Gary W. Stout, author of Serial SamaritanRelentless Savage launches the reader into a fast-paced, action-driven adventure confronting the greater questions of genocide, genetic manipulation, and the tipping point in the balance of world power.When Peter Savage's son Ethan is kidnapped by rebel forces in Sudan while on a service trip, Peter will stop at nothing to get his son home. Recruiting old friends and tapping into the expertise of commander James Nicolau, Peter puts together an unlikely rescue mission that will pit him against deadly forces. What Peter and his team find in the Sudan is a force far more sinister and dangerous than they could ever imagine. They are drawn into a much larger top-secret government mission, one that leads them to a hidden research site with an army of genetically-perfect soldiers.Relentless Savage was a INDIES finalist for Thriller & Suspense in 2015\"Relentless Savage could easily be turned into a blockbuster movie...masterfully written.\" - Weidknecht.Praise for Dave Edlund's Peter Savage Novels\"I would follow Peter Savage into any firefight.\" -James Rollins,New York Times bestseller of The Demon Crown\"Edlund is right at home with his bestselling brethren, Brad Thor and Brad Taylor.\" - Jon Land, USA Today bestselling author of the Caitlin Strong series\"Required reading for any thriller aficionado\" –Steve Berry, New York Times and #1 international bestselling author\"Action on almost every page\" -Foreword Reviews\"Plenty of heart-racing action\" -San Francisco Book ReviewRead the whole series!• Crossing Savage - Book 1• Relentless Savage - Book 2• Deadly Savage - Book 3• Hunting Savage - Book 4• Guarding Savage - Book 5• Lethal Savage - Book 6",
  "genres": [],
  "author": "Dave Edlund",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/23507694-relentless-savage"
}