{
  "title": "Christmas in Snow Valley",
  "description": "Christmas in Snow Valley is packed with six wonderful Christmas novellas sure to bring romance into your holiday season.Snow Valley, Montana, is a small community with the tradition of doing Christmas big. Festivities begin with tree lighting in the town square the day after Thanksgiving and continue until the culminating romantic Christmas Ball. From the Polar Express to a Winter Carnival, there’s something for every wonder-filled child—and every couple who’s in love—or about to be.An Unexpected Kiss by Amazon Top Seller Cindy Roland AndersonLucy Phillips doesn’t want to spend her Christmas vacation dodging her ex-boyfriend, so when he turns up at the airport to give her a ride home, Lucy panics and asks a complete stranger to kiss her. Although the kiss is incredible, Lucy never expects to see the guy again. Is it bad luck or destiny when Lucy comes down with a sore throat and the new doctor in Snow Valley is none other than the guy she kissed at the airport?Feels Like Love by Jeanette LewisChristmas in Snow Valley is the perfect way for April Winston to introduce her city slicker fiancé, Scott Mecham, to life on a farm. If only Wade Hadley, hometown boy and high school sweetheart, will cooperate! But Wade has no intention of letting April go without a fight. This Christmas, Wade is determined to overcome their painful past and show April that she already has what she’s been seeking all along.Full Court Devotion by Amazon Top Seller Cami CheckettsKazlyn is too busy with her schooling and future plans to enjoy life, let alone fall in love with a man who has heartbreak written all over him. Tyrese Hamilton, a college basketball star and major heartthrob, is intrigued when Kazlyn doesn't pursue him or even seem interested. Ty's career is in jeopardy, and he needs a miracle and Kazlyn to save him.The Christmas Eve Kiss by Taylor HartMolly O’Hare gets the utterly ridiculous prediction that she will kiss her true love on Christmas Eve. But when she returns to Snow Valley and comes face to face with Kevin Snow, suddenly the kiss thing seems…a lot less ridiculous. Too bad the reason she left still has the power to make her deny her real feelings. Now Molly is left with a choice—forget the home town and the boy that she never quit loving or let Christmas work out a miracle all on its own.Risking it all for Love by Award-Winning author, Kimberley MontpetitSuccumbing to family pressure, Jessica Mason reluctantly comes home for Christmas. Ever since her high school boyfriend's death from a car accident three years earlier, Jessica and religion have not been compatible. So, when she visits Michael’s grave, she's surprised to meet the handsome James Douglas, Pastor John’s nephew, who’s studying for the ministry. James can not only dish back Jessica’s finely-tuned sarcasm but understands grief all too well, turning Jessica’s world upside down. Is she ready to take another risk on love?Blue Christmas by Lucy McConnellAs head of Snow Valley hospital's fundraising effort, Paisley Hackett barely has time to organize the craft show, cookie decorating party, and the annual Christmas Ball. What she doesn't have time for is falling in love with Clay Jett, the incredibly handsome bass player who sweeps into town. She's been burned by a tourist romance before and, with everything going on, Paisley will have to work overtime to protect her heart from Clay and his swoon-worthy ballads.",
  "genres": [
    "Christmas",
    "Romance",
    "Anthologies",
    "Clean Romance",
    "Contemporary",
    "Fiction",
    "Christian Romance"
  ],
  "author": "Cindy Roland Anderson",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/23510646-christmas-in-snow-valley"
}