{
  "title": "Pretty in Punk: Girl's Gender Resistance in a Boy's Subculture",
  "description": "Pretty in Punk combines autobiography, interviews, and sophisticated analysis to create the first insider’s examination of the ways punk girls resist gender roles and create strong identities. Why would an articulate, intelligent, thoughtful young women shave off most of her hair, dye the remainder green, shape it into a mohawk, and glue it onto her head? What attracts girls to male-dominated youth subcultures like the punk movement? What role does the subculture play in their perceptions of themselves, and in their self-esteem? How do girls reconcile a subcultural identity that is deliberately coded “masculine” with the demands of femininity? Research has focused on the ways media and cultural messages victimize young women, but little attention has been paid to the ways they resist these messages. In Pretty in Punk, Lauraine Leblanc examines what happens when girls ignore these cultural messages, parody ideas of beauty, and refuse to play the games of teenage femininity. She explores the origins and development of the punk subculture, the processes by which girls decide to “go punk,” patterns of resistance to gender norms, and tactics girls use to deal with violence and harassment. Pretty in Punk takes readers into the lives of girls living on the margins of contemporary culture. Drawing on interviews with 40 girls and women between the ages of 14-37, Leblanc examines the lives of her subjects, illuminating their forms of rebellion and survival. Pretty in Punk lets readers hear the voices of these women as they describe the ways their  constructions of femininity—from black lipstick to slamdancing—allow them to reject damaging cultural messages and build strong identities. The price they pay for resisting femininity can be steep—girls tell of parental rejection, school expulsion, institutionalization,  and harassment. Leblanc illuminates punk girls’ resistance to adversity, their triumphs over tough challenges, and their work to create individual identities in a masculine world.",
  "genres": [
    "Music",
    "Feminism",
    "Nonfiction",
    "Punk",
    "Gender",
    "Sociology",
    "History"
  ],
  "author": "Lauraine Leblanc",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/235098.Pretty_in_Punk"
}