{
  "title": "The Nonhuman Turn",
  "description": "Edited by Richard Grusin of the Center for 21st Century Studies, this is the first book to name and characterize—and therefore consolidate—a wide array of current critical, theoretical, and philosophical approaches to the humanities and social sciences under the concept of the nonhuman turn. Each of these approaches is engaged in decentering the human in favor of a concern for the nonhuman, understood by contributors in a variety of ways—in terms of animals, affectivity, bodies, materiality, technologies, and organic and geophysical systems. The nonhuman turn in twenty-first-century studies can be traced to multiple intellectual and theoretical developments from the last decades of the twentieth actor-network theory, affect theory, animal studies, assemblage theory, cognitive sciences, new materialism, new media theory, speculative realism, and systems theory. Such varied analytical and theoretical formations obviously diverge and disagree in many of their assumptions, objects, and methodologies. However, they all take up aspects of the nonhuman as critical to the future of twenty-first-century studies in the arts, humanities, and social sciences. Unlike the posthuman turn, the nonhuman turn does not make a claim about teleology or progress in which we begin with the human and see a transformation from the human to the posthuman. Rather, the nonhuman turn insists (paraphrasing Bruno Latour) that “we have never been human,” that the human has always coevolved, coexisted, or collaborated with the nonhuman—and that the human is identified precisely by this indistinction from the nonhuman. Jane Bennett, Johns Hopkins U; Ian Bogost, Georgia Institute of Technology; Wendy Hui Kyong Chun, Brown U; Mark B. N. Hansen, Duke U; Erin Manning, Concordia U, Montreal; Brian Massumi, U of Montreal; Timothy Morton, Rice U; Steven Shaviro, Wayne State U; Rebekah Sheldon, Indiana U.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Theory",
    "Research",
    "Academic"
  ],
  "author": "Richard Grusin",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/23508393-the-nonhuman-turn"
}