{
  "title": "Boss",
  "description": "HAZELI loved Clayton Bishop. Huge love. Hug him tight and never let go love. We were best friends, near inseparable, and had been for years.He loved me back. He’d have done anything for me. He thought I was the most beautiful girl in the world. I knew it because he told me, but also, I could see it in his eyes. He was in love with me.I loved Clayton, but I was in love with his brother, Declan.Declan, who hated me.Declan, who would barely look at me. Who went out of his way to avoid me.He hadn’t always hated me. I used to be as close to him as the rest of the Bishop brothers.It happened about two years ago, the hate. Came out of nowhere and trampled its way all over my heart.And to this day, I did not know why.It didn’t matter. I was lovesick. Totally. I couldn’t see beyond the agony of my feelings for him, not even for Clayton.Declan did things to me. Wonderful, terrible things. Confused, complex, tragic things.When he was nearby, my body knew it. Not just the same room, but even near that room, and I swear I changed, things in my body started throbbing, I lost brain cells, and became an utter fool.He, on the other hand, barely seemed to notice me now.I couldn’t have gotten his attention if I stripped down and started dancing naked.It was so unfair, because he had all of my attention all the time.It was an obsession that had kept me company for so long that I needed it. Needed it to get through the day.And as if unrequited love weren’t enough, our lives were securely and inevitably entwined. It wasn’t even an issue of seeing him daily. This was an hourly affliction, with shared car rides, classes, and often, when I went home, even shared dinners between our close-knit families. There was no escape, no relief, no reprieve from the barrage of feelings that I held inside of me for a guy who’d barely given me solid eye contact for nearly two years.I was so screwed.This dilemma had been the contentious focal point of my life for so long that a lot of other things slipped my notice.Significant things.Important things.Things I’d soon come to regret.",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "Contemporary",
    "New Adult",
    "Erotica"
  ],
  "author": "R.K. Lilley",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/23511828-boss"
}