{
  "title": "The Girl with the Solar Eyes",
  "description": "WARNING: This book contains sex, violence, gritty characters, dark magic, righteous indignation, life, death, and love. It is belligerent, like the Truth, for it wages constant war against falsities, erroneous dogma, willful ignorance, moral relativism, and lies. It serves the True Great Work, and is only meant for those who seek to understand Natural Law, how freedom and morality are directly proportional, and what it means to manifest into this realm as a sovereign. In Book Two, a man struggles to convince his wife to allow his misbegotten son to stay in their home long enough to learn the truth of why he was absent from the boy’s life. At the western edge of the Caliphian Steppe, where fertile land gave way to a desert that married an ocean, a Queen despairs over her missing child while an elite convoy of Oussanean warriors uncovers how the prince bribed the Skywaymen to flee the kingdom. An unplanned brutal skirmish erupts, forcing the Oussaneans to engage in an event that will no doubt invite retribution and escalate into a large-scale conflict. In the vast timberland of the Eidolon Woods, Dani and the Bannitlarn Brothers groom Aithein into a swordsman and expand his consciousness so that he may infuse his skills with magic. Caelwyn teaches Baelwyn Restoration Magic so that he may accompany the troupe into battle and protect them with enchantments and healing spells. The group seeks out a renegade Amori named Neilath to help them uncover the source of Aithein’s nightmares, to prepare Aithein for his summons with the faelen tree, and to plot the necessary course of action against Chako and those responsible for the arms confiscation. Meanwhile, Aithein wrestles with the unnatural dynamic of his relationship with Ellia while his dreams are haunted by the girl with the solar eyes.",
  "genres": [
    "Fantasy"
  ],
  "author": "Dylan Saccoccio",
  "average_rating": "1.42",
  "url": "https://www.goodreads.com/book/show/23511895-the-girl-with-the-solar-eyes"
}