{
  "title": "Fusion: An Anthology",
  "description": "NEW from HiJinks Ink Publishing….. Nine outstanding fantasy stories merged together to create a bestselling reaction.A value-priced anthology designed for readers of fantasy . . . Paranormal, urban/contemporary fantasy, science fiction and dystopian fused together in one epic fantasy bundle. Make your way through fire and ice, love, lust and hate as NINE International Bestselling Authors come together to spin their tales of magic and destruction. This is a truly unique bundle that successfully blends all aspects of the Fantasy genre.\"Elementally Priceless\" an Exclusive Novella by Shannon Mayer (International Bestselling Author) Urban Fantasy. Heat Rating 2\"My name is Rylee, and I am a Tracker.\"A missing child, a deadly prophecy, and a world of unusual supernaturals slam together in this EXCLUSIVE novella from Shannon Mayer.\"Ethereal (Celestra Series, Book 1)\" by Addison Moore (NY Times, USA Today and Wall Street Journal Bestselling Author) YA Paranormal Romance. Heat Rating 2The Celestra Series has been optioned for film by 20th Century Fox.Sixteen year-old, Skyla Messenger is a dead girl walking. With her life in upheaval, she finds refuge in Logan Oliver, a boy who shares her unique ability to read minds and has knowledge she desires.\"Here (On the Otherside Series, Book 1)\" by Denise Grover Swank (NY Times and USA Today Bestselling Author) YA Science Fiction. Heat Rating 2Sixteen year old Julia Phillips buries herself in guilt after killing her best friend in a car accident. But guilt can’t explain how she can suddenly draw, has false memories of the accident and how a bracelet engraved with her name ended at the scene. Suddenly, Evan Whittaker is interested in her and her life.\"Inescapable (The Premonition Series, Book 1)\" by Amy Bartol (International Bestselling Author) YA Paranormal Romance. Heat Rating 2I’m Evie and this was to be the making of me-my first year of college. I’d hoped that once I’d arrived at Crestwood, the nightmare that I’ve been having would go away. It hasn’t.\"The Cure” by Stephanie Erickson (Bestselling Author) YA Dystopian. Heat Rating 1“One life will make the difference.” Macey Holsinger has heard that phrase her whole life, in the name of fighting a disease that has claimed so many lives.\"Uprising (A Collide Novel, Book 2)\" by Shelly Crane (NY Times and USA Today Bestselling Author) YA Science Fiction. Heat Rating 2Sherry and Merrick come face to face with old friends and new enemies in this sequel to Collide. When a little girl is found, things change for everyone and loyalties will be tested.\"Aracadia's Gift (Arcadia Series, Book 1)\" by Jesi Lea Ryan (Bestselling Author) YA Paranormal. Heat Rating 2When teenager Arcadia Day wakes in a hospital after what can only be described as a psychic episode, she finds her family in tatters.\"Birth (Allie’s War, Early Years)” by J.C. Andrijeski (Bestselling Author) Contemporary Fantasy. Heat Rating 4High in mountain caves, surrounded by kind-hearted monks, the shadow of the Rooks hangs over Revik’s head, a constant reminder of the dark warrior he used to be.\"Wickedest Witch” by Eve Langlais (New York Times and USA Today Bestselling Author) Paranormal Romance. Heat Rating 4Evangeline is not a very nice witch, and she’s not afraid to show it. She lands a job where she is forced to work with a rude, cocky and totally unsuitable shifter.",
  "genres": [
    "Anthologies",
    "Dystopia",
    "Fantasy"
  ],
  "author": "Shannon Mayer",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/23513563-fusion"
}