{
  "title": "Still On Herring Cove Road: Hickory, Dickory, Death",
  "description": "Book #2 of the Herring Cove Road series.*WARNING* This second novel in the Herring Cove Road series contains speckles of strong language and involves disturbing story elements.The first murder of a child raised eyebrows; the second raised alarms.Ten-year-old Dewey is moving, and he couldn't be more excited; though, he's alone in his enthusiasm. Lisa, his mother, and recently retired Avriel, his next door neighbour and best buddy, don't share in his excitement regarding the move from their suburban bungalow to a dirty basement level apartment in the lower class area, where two murders have recently occurred.This sometimes lighthearted and at other times intense novel follows naive Dewey as he befriends two 'different' streetwise boys, learns the pros and cons of friendship and is then stalked by a killer preying on children.\"More than just another mystery. This one grabs you by the heart\" -Review by Karen Laird of Under the Shade Tree Blog.**ABOUT THE SERIESThe second of the four novels in the unique, evocative and not-so-nuclear family saga series Herring Cove Road, where a small group of troubled individuals, dealing with their own personal issues, accidentally come together to form a family unit, and then while struggling to maintain it, are forced to deal with its dark results, such as: racism, death, murder, suicide and much more.Taking place primarily in the 70's, with believable characters and mostly situated in several areas of Halifax, Nova Scotia, the series chronicles the actions (and their results) of an old and introverted Jewish man, a struggling mother, her naive and lonely son, and a boy streetwise beyond his years.Volume 1) On Herring Cove Road: Mr. Jew and the Goy BoyVolume 2) Still on Herring Cove Road: Hickory, Dickory, DeathVolume 3) Off Herring Cove Road: The Problem Being BlueVolume 4) Before Herring Cove Road: Ruth Goldman and the Nincompoop",
  "genres": [],
  "author": "Michael Kroft",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/23516225-still-on-herring-cove-road"
}