{
  "title": "The Parallel Place",
  "description": "Description of Habitan Book I: The Parallel Place:Melissa, Michael and Annabelle were each separated from their parents as infants. Our story begins where they now live, together in an orphanage in northern Canada in the 1600's. Discovering a strange kinship, they have become true friends, and support one another. But why do they feel they are meant to be somewhere else? Is this where they truly belong?Then a mysterious event occurs, transporting them to another land called Habitan, a magical place where anything and everything is possible if you believe and strive hard enough. In Habitan, sorcery, magic, and powers 'of the mind' abound. Animals talk, and the spirit of the woods is alive. While in Habitan, the children join forces with three animal guides, encounter a wicked sorceress named 'Oskana', and embark on an adventure to discover their true heritage and destiny.Can they develop their innate powers and magical gifts soon enough to protect themselves and to help the Good of Habitan? Will they be reunited with their parents again? Who can they really trust? How can they save Habitan from the tyranny of Oskana's rule? Finally, how do the events on Habitan affect the Parallel Place, the 'earth' they grew up on?The children discover that they may be Habitan’s last hope for salvation from the evil sorceress Oskana. They face challenges and surprising twists along the way, all while also developing their own innate gifts and magic. As they begin the path to finding their own inner strength, they learn how to face unbearable odds with determination and courage, standing up for what is right despite the possible personal costs.Inspiration for the Habitan Series by Cheryl Skory Suma:The author’s children grew up enthralled with their mother’s bedtime stories. Then came the question, “Mommy, could you write me a longer story?”. The Habitan Series grew out of these imaginative bedtime stories and the author promises continued plot twists, surprises and new mysteries along the way in this four book series. A proud Canadian, Cheryl has a multi-cultural background that includes not only Canadian settlers of various European descent, but also one-quarter Cree Indian/Inuit mix from her maternal grandmother. Her grandmother’s spirit and grace were inspirational to the creation of this story and the use of Cree as the basis for the magical language of Habitan. The scenery and animals behind the story were drawn from the naturally varied and beautiful landscape of Canada.Resources for Teachers, Librarians and Book Clubs:Chapter questions and discussion notes can be found on the Habitan Series website.",
  "genres": [
    "Fantasy"
  ],
  "author": "Cheryl Skory Suma",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/23513147-the-parallel-place"
}