{
  "title": "A Christmas Arrangement",
  "description": "It's Christmastime in Hillside, but there's a lack of holiday spirit for flower shop owner Quincy McKay. She's in charge of the town festival and her shop's open house, but her Santa's a no-show and her flower cooler is on the fritz. To make matters worse, she's learned her ex-husband isn't as ex as she'd thought. Just when she thought things couldn't get any worse, her boyfriend, hot cop Alex Cooper announces his parents are coming to town.Alex Cooper is the perfect man in Quincy's book, but unfortunately his mother thinks so too. And no woman is perfect enough for her perfect son, but especially not the weird flower shop girl who works too much, can't cook and who she catches kissing another man in the department store. And what's this she hears about Quincy being married? Eleanor Cooper must help her son dodge a bullet (and not the kind from his job) during the romantic holiday season to prevent him from being ensnared in a regrettable relationship.Quincy's dignity (of which lately she's in short supply), her reputation, and every business in town are riding upon the success of the city's Christmas celebration. If she can figure out a way to make it work despite failing equipment, helpers dropping out of the picture as fast as snowflakes in a blizzard, a troubling and inappropriate Secret Santa, and the possibility of arrest, she might win the respect of everyone in the town, but more importantly, Alex's parents.If Alex can survive his loving but meddling mother until Christmas, and keep Quincy safe from her crazy ex-husband, with a little help from the MLM (Mormon Ladies Mafia), and K.C. the she-Santa, he'll arrange for the perfect holiday for himself and the woman who has captured his heart.",
  "genres": [
    "Mystery",
    "Christmas",
    "Cozy Mystery",
    "Romance",
    "Cozy",
    "Holiday",
    "Fiction"
  ],
  "author": "Annie Adams",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/23513338-a-christmas-arrangement"
}