{
  "title": "Misguided",
  "description": "A biker: Lucas 'Mortician' Banks stopped believing in love after a bitter betrayal. As Club Enforcer, the Death Dwellers MC is his home, where no rules exist and brotherhood rule. He never expected to fall for the daughter of K-P Andrews, a biker from the old guard, who is now deceased. Is love enough to survive secrets, brutality, and betrayal?A beauty: Bailey Andrews was fascinated by the biker from the first moment they met. She seized the opportunity to have his phone number and, somehow, ended up married to him when she accompanied Mortician on a run to Las Vegas. She uncovers the connection between her father and Mortician’s father and the horrible betrayals it led to within the MC. Can she leave the secrets stay buried? Or will she expose them and ruin her marriage to the only man she’ll ever love?A bet: Smug in his assumption he’d never fall as hard for as woman as his Prez fell for a girl, Mortician put his money where his mouth was and made that bet. With 20 G's on the line and two weeks left before he wins or loses, Mortician has to decide if Bailey and their marriage is more important or saving face and keeping his money. Having only ever seen the destruction of love gone wrong, what will Mortician decide?A baby: Now, Bailey’s pregnant with his baby and hiding another detrimental secret that she, herself, recently discovered. Will she have to choose between her life and the baby’s? Or will she find a way to save both herself and her child?Warning: This is a brutal tale of worlds colliding—a mega-church with the command to destroy, powerful men with their own agendas, and raw and dirty bikers who will win at all costs. Contains violence, drug use, and excessive foul language.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Dark",
    "Erotica",
    "Adult",
    "M F Romance",
    "Erotic Romance"
  ],
  "author": "Kathryn C. Kelly",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/23522619-misguided"
}