{
  "title": "Dante-Part 1",
  "description": "Dante, the second-eldest Guardian of the White and an Immortal, has spent more than a thousand years destroying the Demons and Shadows that walk among us. After so many years of fighting, he has lost his compassion for humans and only finds pleasure in his art, his lovers, and killing Demons. The only love he knows is for himself and his native Italy. Until he meets her, his ancient soul had not known what it means to truly love someone greater than himself.Giovanna is a Mortal Artist who ran from the evil that lurked in the darkest recesses of her husband’s soul. In spite of the nightmares that plague her, she finally embraces her new life in Italy. All she wants is to live a quiet life and create her art, but then she meets him—a man who could change everything. Now, everything she thought she knew about herself is changing, including the Shadows that linger in her eyes and the stain on her heart she believed was permanent.Zaqar, a lost soul that has had everything taken from him is about to emerge from the shadows. Sanity has fled this celestial being and he will take back what was taken from him so very long ago. Blood rims his once clear eyes and flows freely as he enacts his revenge.The Prince was here in the beginning and will be here until the end of days, his motives that began in purity have taken an entirely different turn. He and his Fated One have altered the course of history, and this world.You know nothing about the beings that surround you and their history. But you’re about to.**Disclaimer** There are extreme examples of sadistic behavior in this book that could be triggers for some who have suffered from domestic violence. This violence is not condoned by the Author but was necessary character development for a very sick villain. There is also extreme language and sexual content that is not suitable for anyone under the age of 18.** **This is Part 1 of 2. Part 1 is nearly 140,000 words and Part 2 will be here in late Winter 2014 or early Spring 2015. You will not wait long for the conclusion of this epic tale. If you enjoyed this work, the greatest thank you that you can give an Author is a review. Happy Reading! xx **THIS NOVEL IS PART OF A SERIES. In order to understand the world which moves forward even though they are stand alone Novels, they should be read in order. The order is:Keltor-The Guardian Archives (Book 1-375 Pages)Ratha-The Magic Within (Book 1.5- 175 Pages)Dante-Part One (Book 2- 400 Pages)Dante-Part Two (Book 3 - Coming late Winter 2014/ Early spring 2015, 350-400 Pages)",
  "genres": [],
  "author": "Jennifer Sage",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/23521177-dante-part-1"
}