{
  "title": "Lust",
  "description": "\"With no timid strokes on her canvas, Ms. Ward may become the new standard to beat in the paranormal romantic intrigue genre. The detail to each scene, the sights, the sounds, the smells of sweat and fear, it’s all here, page after page...\" - Tome Tender Book Review The Second Book in the Wildly Popular Shadow-Keepers Series! THE INTRODUCTION OF THE NEW KEEPER - MCKENZIE MILLER Welcome back to the world of the Grid. Where heroes and eaters of souls walk among us. Where a war rages and the price is mankind—its existence or its loss. Can a heart that is walled away be allowed to love or trust and find its beat in one that needs someone to save it? A heartbeat that destiny denied but death can give? McKenzie Miller had never needed anyone. Not since she lost both her parents to a crime of passion at a young age. Shuffled from foster home to foster home, Kenzie finally took control of her own life and lived on the streets. Now she's an adult and has a hard-wired survivalist core to never be used or abused again. She's strong and no one will ever hurt her—because she will never let someone inside the one part of her that can still feel—her heart. Lana had everything that her parent's money could buy and until they lost it all in the economy crash, the young ballet dancer had a bright future with the San Francisco Ballet Company. Now she struggles to reach for her dream and still survive. And do so, alone. Until one night... What Dark Power Makes YOUR Heart Beat? Have no fear Twiz Keeper fans, there is also plenty of your favorite Candyman, Reno Sundown and his witch, Emma. As well as BOUNCE and of course, Lucifer. And twists? Oh there is ALWAYS twists with a Ward book. Shadow-Keepers Reading Order: E-Novella - CANDYMAN MADNESS: Book One of the Shadow-Keepers Series E-Novella - BOUNCE LUST: Book Two of the Shadow-Keepers Series",
  "genres": [
    "Dark"
  ],
  "author": "Jas T. Ward",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/23522412-lust"
}