{
  "title": "Crazy Dumplings",
  "description": "Librarian Note: Alternate Cover Edition for ISBN-10: 0990775313 / ISBN-13: 9780990775317.Dumplings. Wontons. Jiaozi. This remarkably simple food is found throughout Asia and in Chinese restaurants and kitchens around the world, but have you ever filled a dumpling wrapper with chicken? Lobster? North American Plains Bison? Hardly anyone has! The Crazy Dumplings Cookbook features over 100 recipes with some of the craziest and most delicious dumpling filling recipes you will ever see. From Chicken Taquito Dumplings to Timey-Wimey Dumplings to a dumpling for your dog, Crazy Dumplings will show you all the crazy things you can stuff into a dumpling wrapper for an easy meal or snack.\"Amanda Roberts' Crazy Dumplings is a gift from the Dumpling Gods. Having experienced authentic jiaozi firsthand while living in China, the author has taken them to new, transcendent heights.\" ~ Kerah13 amazon.com/review/R2KAA7N5NVFKJJ/ref=...\"Crazy Dumplings is the holy grail of dumplings. ..this is definitely not your average cookbook. The cookbook includes traditional dumpling recipes and the not so traditional...there is a dumpling in this cookbook for everyone.\" ~ Nerisa Eugenia Waterman nerisaewaterman.com/2015/06/21/fifty-...\"Although I am not the typical cookbook reader (nor cook...), Crazy Dumplings suits me perfectly as an expat. I love the interplay between dumplings - the delicious local cuisine - and the wide assortment of tastes that possibly only a foodie westerner abroad could come up with.\" ~ Ray Hecht goodreads.com/review/show/1265535247?...\"Crazy Dumplings is immediately enticing with full colour photographs of how to fold your dumplings as well as the finished products...Although it is cheap and cheerful to eat out locally, sometimes we forget how great it is to eat something we have prepared ourselves. With Crazy Dumplings on your shelf or your e-reader, you have every reason to eat in!\" ~ Rachel Dillon basedtravelershenzhen.com/book-review...\"This is a daring book as so much one would never expect can turn into a delicious dumpling.\" ~ Maria Catalina Vergara Egan introspectivepress.blogspot.com/2015/...\"This would be a great cookbook to give to a coed in their first apartment, or for a newly married couple, with some accessories and spice mixes.\" ~ Bless Their Hearts Mom blesstheirheartsmom.blogspot.com/2015...\"This was a delightfully informative cookbook. It's inventive and traditional and made from scratch, like the recipes.\" ~ Dab of Darkness dabofdarkness.com/2015/11/04/giveaway...\"I tried the Beef Stir-Fry and even now thinking about it I can still taste the mixture of flavors playing havoc in my mouth. I really appreciate the author for writing such a great and valuable book.\" ~JulezRulez amazon.com/review/REFEC9W0O6Q3J/ref=c...",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction"
  ],
  "author": "Amanda   Roberts",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/23519469-crazy-dumplings"
}