{
  "title": "Nova The Dark Reach Wars Vol I",
  "description": "Avara Serros, Captain of the QS Excalibur, decorated Human war-hero and famed Quorum Shield Operative, heads her own proven and hand-picked SpecOps team, Nova Squad. When Avara and her Squad are given their next mission, to track down and capture the Vosaia STF Agent K’llan Z’arr and recover the deadly Arcatech Enhancement research she has stolen, what Avara thought would be a very straightforward mission quickly becomes anything but.Assigned to work with a second Shield Operative to maintain political relations between the Human Ministry and Vosaia Consulate, it becomes apparent that hard questions need to be asked as to the identity of the true culprit behind the missing data, inquiries made all the more critical as it is revealed that the intended recipient of the pilfered Arcatech is the hostile Karukai Imperium. With the Margrom War ended only two and a half years ago, the apparent defection of Quorum agents and the theft of the newly developed Arca technology threatens to crack the fragile status quo of the ongoing cold war between the Quorum Aligned Systems and the Karukai Imperium. If ignited, such a large-scale conflict would result in the enslavement or death of trillions of people. The demands of this mission will push Captain Avara Serros and Nova Squad to the very limits of what they can physically and emotionally endure, and beyond.Nova, The Dark Reach Wars, features complex and highly diverse characters in a gritty narrative that blends heart-racing firefights, suspense, romance, and tension-laden struggles for survival within the context of looming war. Set in the far future when Earth no longer exits and Humans are only one of a dozen sentient species, Nova is epic cinema made page-turning literature set in a fully realized futuristic world.",
  "genres": [
    "Lesbian",
    "Science Fiction",
    "LGBT",
    "Military Fiction"
  ],
  "author": "Lora E. Rasmussen",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/23523525-nova-the-dark-reach-wars-vol-i"
}