{
  "title": "Tartine",
  "description": "An utterly fresh, inspiring, and invaluable cookbook: Every once in a while, a cookbook comes along that instantly says \"classic.\" This is one of them. Acclaimed pastry chef Elisabeth Prueitt and master baker Chad Robertson share their secrets, fabulous recipes, and expertise to create a truly priceless collection of culinary delights.\"One peek into Elisabeth Prueitt and Chad Robertson's sensational cookbook whisks you into their popular Tartine Bakery and reveals everything you need to know to create their superb recipes in your own home.\" –Flo Braker, author of The Simple Art of Perfect Baking and Sweet MiniaturesIt's no wonder there are lines out the door of the acclaimed Tartine Bakery in San Francisco. Tartine has been written up in every magazine worth its sugar and spice. Here, the bakers' art is transformed into easy-to-follow recipes for the home kitchen. The only thing hard about this cookbook is deciding which recipe to try first.Features easy-to-follow recipes meant to be made in your home kitchen. There's a little something here for breakfast, lunch, tea, supper, hors d'oeuvres and, of course, a whole lot for dessert.Includes practical advice in the form of handy Kitchen Notes, that convey the authors' know-how.Gorgeous photographs are spread throughout to create a truly delicious and inspiring party cookbook.Makes a delectable gift for any dessert lover or aspiring pastry chef.Pastry chef Elisabeth Prueitt's work has appeared in numerous magazines, including Food & Wine, Bon Appétit, and Travel & Leisure, and she has appeared on the television program Martha Stewart Living. France Ruffenach is a San Francisco-based photographer whose work has appeared in magazines and cookbooks including Martha Stewart Living, Real Simple, and Bon Appétit magazines, and in Cupcakes, Everyday Celebrations, and Ros.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Foodie",
    "Culinary"
  ],
  "author": "Elisabeth Prueitt",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/114299.Tartine"
}