{
  "title": "Say Something Anthology",
  "description": "Have you ever been moved by the lyrics of a song? In this anthology, seven authors of various genres listened to A Great Big World's evocative hit song, \"Say Something\" – and used their interpretation of the words as inspiration for a short story. Contemporary to paranormal to historical, enjoy a wide variety of characters and settings, all with the same basic theme: say something.JENNIFER’S STORY by V.S. NelsonPlagued by the ancient past, Jennifer resorts to going through a past life regression. But that leaves her with more questions than answers. Will she be able to uncover the truth or is history once again repeating itself?BEHIND THE SCENES by Morgan KearnsBest Friends Forever… Except friendship isn’t good enough for Ben anymore. Fear of what those three little words will do to his relationship with Scarlett keeps the life-changing three little words stiffly behind his closed lips. Scarlett loves Ben, of course she does, he’s her best friend. Right? A NORDIC KNIGHT IN HENRY’S COURT by Kris TuallaLondon, 1518 - Jakob Hansen, a knight in service to King Christian II of Denmark and Norway is being sent to Barcelona, Spain as the king's representative at the 1519 gathering of The Order of the Golden Fleece. On the way, he delivers a gift for England's two-year-old Princess Mary, daughter of young Henry VIII - and meets the enigmatic Lady Avery Albergar, the \"Ice Maiden\" of Queen Catherine's court. While Jakob is pressed into keeping Henry's secrets, it becomes clear that Lady Avery has some dark secrets of her own.ANGEL RISING by Deena RemielHannah and Gabriel have always gotten along, first as friends, then as co-workers. She manages his life and he protects hers. A perfect, symbiotic relationship, so it would seem, until suppressed feelings for each other surface and forever change the landscape of their lives. Deceit and seduction, desire and repression, collide in this epic, immortal story of love, duty, and sacrifice.MEANT TO BE by Camelia Miron SkibaFirefighter Grace Wilde stops at nothing to protect her family—including ... strip dancing. Entrepreneur Oscar Molinari visits the club he just bought, expecting a night of hot sex with the club's main attraction. Instead he finds an imposter with a truck driver’s mouth and secrets galore. Oscar struggles to control his changing life, dancing on the edge of becoming a responsible adult or staying an impetuous ass, while Grace battles against a growing attraction for him. Can their unexpected feelings for each other sway their future or will their troubled pasts keep them apart?MOVING ON by April LondonFresh starts are what it's all about. Shaking off the past and the cheating husband, Beth finds out there's more to life than waiting around for someone who doesn't really care about her. A handsome stranger catches her eye and might even catch her heart if she lets him stick around long enough. WHY NOT ASK by Angelica FrenchCarrie and Harlan, business partners in a high-end brothel in New York City, also entered into an exclusive romantic relationship. Carrie’s abusive childhood and years as a street prostitute make her suspicious of any man’s commitment. Especially sex addict Harlan. When she thinks she has evidence of infidelity she retaliates with a sexual liaison of her own. Harlan flees her and their relationship, but Carrie vows to fight for the only man she has ever loved.",
  "genres": [],
  "author": "V.S.  Nelson",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/23529935-say-something-anthology"
}