{
  "title": "The Heart Remembers",
  "description": "This final book in the Frontier Doctor trilogy continues the story of Dane and Tharyn Logan, husband and wife medical team serving a mining community west of Denver. While caring for the physical ailments of the residents of this frontier town, the Logans also minister to their spiritual needs. And Dane has the joy of leading a Ute Indian chief and his family to faith in Christ. Dane’s biggest challenge comes, however, when the stagecoach he’s riding crashes down a ravine. Dane survives, but loses his memory. Who is he? Does he have a family somewhere? And will his trust in God help him find his way back home?THE FRONTIER DOCTOR TRILOGYCountless perils menaced the settlers of the vast wilderness, and one of the most severe was the scarcity of medical care. Risking his own life by day or by night, in all kinds of weather, the frontier doctor was a rare, unsung hero of the West.Strong Heart, Able HandsDr. Dane Logan and his wife, Tharyn, are happily settled in Central City and considering the right time to start a family. Their medical practice in the little mining town keeps them busy with everything from new babies and appendicitis to gunshot wounds and a rancher gored by a bull. It’s almost more than one doctor can keep up with. Then when the stagecoach he’s riding in crashes down a ravine, Dane awakens with a head injury—and no idea who he is. Will his trust in God help him find his way back home?Story Behind the BookOf all the perils confronting the settlers of the Wild West, serious illness, injuries from mishaps of countless number, and wounds from battles with Indians and outlaws were the most dreaded. The lack of proper medical care resulted in thousands of deaths. It is our desire that the reader will be deeply impressed with the courage of those frontier doctors who helped settle the West. We think you’ll find this final book in this trilogy filled with our faith—gained from so many years of serving the Lord and trusting His written Word.",
  "genres": [
    "Christian Fiction",
    "Fiction",
    "Christian",
    "Historical Fiction",
    "Historical"
  ],
  "author": "Al Lacy",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/235300.The_Heart_Remembers"
}