{
  "title": "Comfort and Joy",
  "description": "A Holiday anthologyRest and Be Thankful by Joanna ChambersTwo stormy hearts find peace when feuding neighbors in the Scottish Highlands are trapped by a blizzard.Things haven’t been going well for Cam McMorrow since he moved to Inverbechie. His business is failing, his cottage is falling apart and following his very public argument with café owner Rob Armstrong, he’s become a social outcast.Cam needs to get away from his troubles and when his sister buys him a ticket to the biggest Hogmanay party in Glasgow, he can’t leave Inverbechie quick enough. But when events conspire to strand him in the middle of nowhere in a snowstorm, not only is he liable to miss the party, he’ll also have to ask his nemesis, Rob, for help.Out by Harper FoxCan a stranger unlock the courage and passion in a young man’s captive heart?It’s Christmas at Edinburgh’s magnificent Barlinney Hotel, and chief housekeeper Cosmo Grant is in charge of the festivities. He’s already got his hands full when handsome Ren Vaudrey checks in.It soon turns out that Ren is an undercover cop. Cosmo wants to help him, but unless he can do it within the Barlinney’s walls, Cosmo is stuck. A victim of crippling agoraphobia, he’s been a prisoner in this gilded cage for over a year. Cosmo gathers all his courage to do the right thing by Ren and Sam—and as a glittering Christmas Eve descends on the city, finds himself confronting his very darkest fears.Waiting for Winter by LB Gregg Some mistakes are worth repeating.Luke always thought he and Winter were the perfect couple—until the day Winter announced he was taking a new job and they were uprooting and headed for Germany. No discussion. No debate. For the first time in his life, Winter miscalculated. Badly. Now Luke is trying his best to move on with his life, but Winter is back in town and he’s set on digging their relationship out of the deep freeze.Baby, It's Cold by Josh Lanyon Or maybe it's the flu. Breaking up is hard to do -- especially around the holidays.Talk about Kitchen Nightmares! TV Chef Rocky and Foodie blogger Jesse have been pals forever, so it should have been the most natural thing in the world to move their relationship to the next level. Instead, it turned out to be a disaster. But Christmas is the season of love, and someone's cooking up a sweet surprise...",
  "genres": [
    "Anthologies",
    "M M Romance",
    "Holiday",
    "Romance",
    "Contemporary",
    "Christmas",
    "Short Stories"
  ],
  "author": "Joanna Chambers",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/23524655-comfort-and-joy"
}