{
  "title": "Curves 'em Right",
  "description": "Paranormal Dating Agency Book 4 - STANDALONEA BBW in search of love + two sexy wolf shifters ready to claim her as their mate = Sizzling Ménage RomanceDaniella Flores is looking for a good man. A man who will accept her as she is and go crazy for her curves. So far she’s had no luck in the romance department and is worried she might never find the right one. When Mrs. Wilder of the PDA offers to help, Dani is all for trying anything. Mrs. Wilder promises to find her love, romance and hot sex. What woman in her right mind would say no to that?Kane and Blake have been searching for a mate to complete their Alpha triad. There’s just one problem: they’ve yet to find a woman they both want. Not to worry, Kane’s mother comes to the rescue and brings in the PDA. Unfortunately for them, Mrs. Wilder has something up her sleeve and it’s not a bra. When they meet their mysterious date, they know she’s the woman they need.A masquerade ball brings Dani and the shifters together. The two men who are really good friends with Dani’s overprotective older brother. She’ll get one chance to finally live the fantasy night she’s always wanted with the wild wolves. Besides, it’s not like they could really want her for a mate. It will take some maneuvering for Kane and Blake to keep Dani, not lose their friend and their pack, and prove her curves are the only ones they want.Reader Warning: This book contains panty-melting sex (the kind that makes you need fudge and a cold shower), adult language (we like some freaky dirty talk), and violence. If this is not the kind of stuff you like to read, skip this book. However, if you like dirty, raunchy sex with two men on one curvy sarcastic girl, then this is right up your alley. Enjoy!",
  "genres": [
    "Paranormal",
    "Shapeshifters",
    "Menage",
    "Romance",
    "Paranormal Romance",
    "Erotica",
    "Fantasy"
  ],
  "author": "Milly Taiden",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/23525198-curves-em-right"
}