{
  "title": "Cruel Devices",
  "description": "Warning: This ultimate box set of taboo fantasies contains extreme bondage and punishment, including the use of cruel devices such as the rack, guillotine, pear of anguish and the stocks. It is highly explicit and for mature readers and lovers of forbidden temptation only!  Hot and controversial, all three of J D Cirque’s ‘punishment’ books are now available in the one complete bundle ready to light your Kindle up. Included stories include:  PUNISHED IN THE STOCKS Virgin serf girl Isabel has just been convicted of a crime she did not commit. Sentenced to one day and one night in the stocks, she knows what befalls those left in the village square once darkness falls. Hands and head locked tight, all she can do is wait as voices gather and the village men grow bolder, keen to deliver their own select form of chastisement. Contains strong bondage, multiple penetration, defloration, group menage and reluctant bodily penance.  PUNISHED ON THE RACK Untouched peasant girl Avice knows the penalties for thieves who dare to steal behind the castle walls. She’s heard the rumours of the castle’s cruel master and his personal torture chamber, but it all becomes stark reality when she’s caught red-handed. Taken to the dungeon, Avice is about to learn the true cost of her actions. Enduring the rack and the pear of anguish, she will learn that pain, and pleasure, know no bounds when you have everything to lose. Contains strong bondage, defloration and multiple penetration with dark themes.  PUNISHED BY THE GUILLOTINE Revolutionary Marie is about to assassinate a powerful general in French Army when her plan is thwarted at the last moment. Taken to the dungeons, she knows she will be executed, severed head from body by the guillotine, but the cruel lieutenant who captured her has other ideas. Taken alone to the terrible machine, she will discover the line between life and death is thinner than she ever imagined. Contains strong bondage, multiple and cross penetration, A2M and reluctant bodily penance.",
  "genres": [],
  "author": "J.D. Cirque",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/23534401-cruel-devices"
}