{
  "title": "Billy the Kid: An Autobiography",
  "description": "Did Pat Garrett kill Billy the Kid?  It was a moonlit night in Ft. Sumner, NM when history tells us that Sheriff Pat Garrett shot down the notorious outlaw Billy “the Kid”. Newspapers across the country quickly reported that the Kid was dead and Garrett quickly put the body in the ground. But rumors spread that the Kid had survived and the testimony of Garrett’s posse was contradictory about how, exactly, the shooting had gone down. Nevertheless, without evidence, the story of the heroic Sheriff stood for almost 70 years. Then, in 1950, an old man from Hico, TX petitioned the governor of New Mexico for a pardon for crimes he committed as Billy the Kid. No one took him seriously, and yet the old man was an exact match in physical characteristics and knew intimate details about the Kid’s life. He also knew details about the fateful shooting the night Garrett claimed to have shot him that had been erased by history. Details, for example, that Garrett had killed his very drunk bearded half-Mexican partner, a claim that has only recently been verified by modern research. It has been said that the living write history and not the dead, but when one returns from the dead, so to speak, that which was lost to history is restored. This is the true story of Billy the Kid, complete with new evidence that he lived to a ripe old age and died a free man. THE STORY In 1882 the notorious outlaw Jesse Evans, a childhood friend of Billy the Kid and a participant in the Lincoln County War, walked out of jail after serving a sentence for killing a Texas ranger. Jesse walked out of prison a free man and disappeared, never to be heard from again. Never, that is, until 1949 when Jesse came out of hiding after almost 60 years to claim an inheritance left to him by his brother. In the course of proving his identity to a court Jesse told some amazing stories of his time when he was an outlaw but his biggest revelation of all was that his good friend Billy the Kid was still alive. Jesse led a young lawyer named William Morrison to an old man named not William H. Bonney but William H. Roberts who after some consideration finally agreed to come forward and reveal himself as Billy the Kid. He agreed to this on one condition- that the lawyer help him obtain the pardon he was promised by the Governor but never received so he could die a free man. You see, Billy the Kid was still wanted for murder and was condemned to hang. To reveal himself was to risk arrest and death. This was a risk that William H. Roberts was willing to take. He sat down with Mr. Morrison and told his story. This book contains that story. It is the one true autobiography of Billy the Kid. A story that aside from some definite highlights and adventures that one would expect from the Kid, was remarkable normal and focused on his skill breaking horses as much or as more as his skill as a gunslinger. Billy the Kid was, in fact, just a gifted young cowhand who found himself juxtaposed against corrupt officials and lawmen at what became a key moment in American History. Before one dismisses Mr. Roberts it should be considered that 5 living acquaintances of Billy the Kid, aside from Mr. Evans who revealed him, were willing to sign legal affidavits that Mr. Roberts was the man they knew as Billy the Kid. Further, new photographic comparison shows beyond a shadow of a doubt that they were the same man. Mr. Roberts' story became the inspiration for the opening scene in hit movie \"Young Guns II\" starring Emilio Estevez as Billy the Kid. Also Consider that Pat Garrett was denied his reward for killing the kid for many months, and that only a special act of the legislature allowed him to finally receive it. All of this and more is contained in this book. Thanks to Mr. Morrison each of us can now pull up a chair, sit down across from Billy the Kid, and listen as he shares his story.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Westerns",
    "Autobiography"
  ],
  "author": "Daniel A. Edwards",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/23534946-billy-the-kid"
}