{
  "title": "A Blue Puttee at War: The Memoir of Captain Sydney Frost, MC",
  "description": "Sydney Frost, a young Nova Scotian, was working in St. John’s at The Bank of Nova Scotia when the First World War began in August 1914. He joined the newly revived Newfoundland Regiment on 21 August 1914, the first night that volunteers were accepted. Assigned Regimental Number 58, he became one of the First Five Hundred, often known as the Blue Puttees. He served with the Regiment throughout the entire War, rising from the rank of Private to that of Captain. He led one of the two Companies of the Regiment that marched in the Triumphal March of the Dominion Troops through London on 3 May 1919 and returned to St. John’s with the Regiment on 1 June 1919.Frost was one of the few original members of the Regiment who survived to fight throughout the entire War. He recorded, on Christmas Eve 1917, that fewer than thirty of the Blue Puttees were still in active service. That was eleven months before the end of the War in November 1918; those months saw the Regiment take heavy casualties in the fighting during the last “One Hundred Days” before the 11 November Armistice, as the British advanced through northern France and into Flanders and Belgium.Sydney Frost was awarded the Military Cross for his heroism during the action at Keiberg Ridge, in Belgium, on 29 September 1918. Frost returned to The Bank of Nova Scotia at the end of the War and rose steadily through its ranks. He became its President and Chief Executive Officer in June 1956 and retired as President in 1958, at the age of sixty-five. He remained a Director until January 1969, when he became an Honorary Director. He died in 1985, at the age of ninety-two.Late in life Sydney Frost wrote a memoir, which he specifically instructed his family was not to be published. They disregarded his admonition and authorized Edward Roberts to edit the memoir and to publish it. The memoir is unique. It is by far the most complete account of World War I by any member of the Royal Newfoundland Regiment. Frost’s account is frank, detailed, and authoritative. It is enriched greatly by the extraordinary archive of Regimental history he assembled over his lifetime. His service in the Regiment was a central feature of his long life. He kept every scrap of paper that came his way, together with a detailed record of his daily activities between 21 August 1914 and 2 June 1919. His scrapbooks—which he later donated to the Regimental Museum in St. John’s—contain thousands of items, including newspaper cuttings and published articles of every description about the Regiment and the men with whom he served.",
  "genres": [],
  "author": "Sydney  Frost",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/23531402-a-blue-puttee-at-war"
}