{
  "title": "The Spirit of New York: Defining Events in the Empire State's History",
  "description": "Presents New York history in a fresh way through sixteen dramatic events.In this lively and engaging book, Bruce W. Dearstyne presents New York State history by exploring sixteen dramatic events. From the launch of the state government in April 1777 to the tragedy of September 11, 2001, these events altered the course of state and US history. Chapters describe great political changes, historical turning points, and struggles for social, racial, and environmental reform. The book includes daring acts of courage and against-the-odds stories of struggle and triumph. Dearstyne puts the fascinating people who made history at the center of the story, including John Jay, the lead writer of the first state constitution; Elizabeth Cady Stanton, the irrepressible crusader for women’s rights; Glenn Curtiss, New York’s aviation pioneer; and Robert Moses, controversial president of the 1964 New York World’s Fair. This book makes history come alive. The momentous events illustrate the “spirit” of New York—the elusive traits that make New York State unique and a leader among the fifty states—and the complexity of its history.“Bruce Dearstyne’s beautifully written and thoroughly researched biography of New York opens new vistas for understanding the enormous impact the state has had on American history writ large. With attention to and sensitivity toward geographical, ethnic, economic, and ecological diversity, the book offers an important new explanation of why New York has been able to meet so many of its challenges with dynamism and creativity. It also shows how ego and self-interest have sometimes gotten in the way, balancing the determined problem solving that is often seen as a hallmark of the state with a true account of rises and falls, booms and busts, and vision and drift that are equally a part of its spirit.” — Louise Mirrer, President and CEO, New-York Historical Society“Bruce Dearstyne brings a fine narrative style and superb storytelling to The Spirit of New York . Readers will learn about New York politics, the state’s role in racial conflict, recasting the role of women in New York, and far more. The book is about the people of New York responding individually and collectively to the opportunities, problems, and tragedies that have punctuated the history of the Empire State from its beginnings to the present.” — Warren Roberts, author of A Place in Albany in the Age of Revolution, 1775–1825“This book offers a fascinating odyssey through New York’s past by using examples of its national leadership, ranging from the state’s early women’s rights movements to Jackie Robinson’s historic integration of major league baseball, and from aviation pioneer Glenn Curtis to the construction of a landmark superhighway, the New York State Thruway. Dearstyne presents fresh insight into several salient events that made New York the Empire State. In doing so, he comes as close to a recent general history of the state as currently exists.” — F. Daniel Larkin, State University of New York at Oneonta.",
  "genres": [
    "New York"
  ],
  "author": "Bruce W. Dearstyne",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/23531580-the-spirit-of-new-york"
}