{
  "title": "Christmas Alpha",
  "description": "Warning – This is a NEW COVER but there is NO new story content. If you bought the original book there is no need to buy this one. Christmas Alpha is the first book in USA Today Bestselling and Amazon #1 Author Carole Mortimer’s dark and sizzling ALPHA Series, contemporary romance with an added dash of suspense. Finn Devlin is being stalked by his ex-girlfriend, and the last thing he wants or needs is to find himself stranded in a blizzard, four days before Christmas, with a woman he’s only just met but already knows he wants in his bed. Underneath him. On top of him. Any way he can have her! Eva Shaw has no idea why Finn Devlin would choose to live alone in such a remote place miles from his nearest neighbors. One thing she does know, however—she isn’t the woman he’s mistaken her for. The woman he ‘hired’ from an ‘agency’...While the blizzard continues to rage fiercely outside the passion inside the house becomes even hotter, taking Finn and Eva to new and undeniable heights of raw sensuality and passion.While someone outside watches and waits...ALPHA Alpha (ALPHA 1)Dark Alpha (ALPHA 2)Shadow Alpha (ALPHA 3)Midnight Alpha (ALPHA 4)Renegade Alpha (ALPHA 5)Warrior Alpha (ALPHA 6)Rogue Alpha (ALPHA 7)Savage Alpha (ALPHA 8)Also available by Carole MortimerContemporary Romance Knight Security Series – spin-off to Alpha 0.5–6: Series is now completeKingston ’s Ransom (Kingston Security 1)Kingston’s Captive (Kingston Security 2)Kingston’s Redemption (Kingston Security 3) 275th BookKingston’s Enigma (Kingston Security 4)Kingston’s Salvation (Kingston Security 5)More books to come in this seriesRuthless Regency Wager (Ruthless Regency Dukes 1)The Mistress (Ruthless Regency Dukes 2)The Widow (Ruthless Regency Dukes 3)The Guardian (Ruthless Regency Dukes 4)More books to come in this seriesDance with the Devil – Contemporary Romance 1 – 5 Series now completeRegency ScandalBks 1 – 4 Series now complete Russian Dragon HeatVLADIMIR (Russian Dragon Heat 1)VAUGHN (Russian Dragon Heat 2)VIKTOR (Russian Dragon Heat 3)Regency Club 1-5 Series now completeSteele Protectors contemporary romance 1-6 Series now completeRegency Men in Love – MM romance written as C A MortimerHIDDEN LOVER (Regency Men in Love 1)HIDDEN DESIRE (Regency Men in Love 2)Regency Lovers 1-6 Series now completeDragon 1-8 Series now completeRegency Sinners 1-8: Series now completeRegency Unlaced 1-9: Series is now completeCarole Mortimer has written over 275 books, in contemporary romantic suspense, Regency romance, MM Regency romance & paranormal romance. She became an indie author in 2014. In May 2017 she received a Career Achievement Award from Romantic Times. She is the Recipient of the 2015 Romance Writers of America’s Lifetime Achievement Award. Is an Entertainment Weekly Top 10 Romance Author—ever. Carole is a 2014 Romantic Times Pioneer of Romance.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Christmas",
    "Contemporary Romance",
    "Contemporary",
    "Novella",
    "M M Romance"
  ],
  "author": "Carole Mortimer",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/23551313-christmas-alpha"
}