{
  "title": "تفسير ابن عربي",
  "description": "إن استعداد محيى الدين بن عربي الفطري ونشأته في بيئة تقية، واختلافه في الأندلس إلى المدرسية الرمزية الوحيدة التي تدرس المبادئ الخفية والتعاليم الرمزية كل ذلك تضافر على إبراز الناحية الروحية عنده في سن مبكرة وعلى صورة ناصعة لا تتيسر للكثيرين ممن تشوب حياتهم الأولى شوائب الغرائز والنزوات. فلم يكد يختم الحلقة الثانية من عمره حتى كان قد انغمس في أنوار الكشف والإلهام، ولم يشارف العشرين حتى أعلن أنه جعل يسير في الطريق الروحاني بخطوات واسعة ثابتة، وأنه بدأ يطلع على أسرار الحياة الصوفية، وأن عدداً من الخفايا الكونية قد تكشف أمامه، وأن حياته منذ ذلك العهد المبكر لم تعد سوى سلسلة من البحث المواصل عما يحقق الكمال لتلك الاستعدادات الفطرية التي تنير أضواؤها جوانب عقله وقلبه.ولذلك الهدف وفيما بين سنتي 597، 620هـ-1223م بدأ رحلاته الطويلة المتعددة إلى بلاد الشرق فيتجه في سنة 1201م إلى مكة، وفي هذه البيئة النقية سطعت مواهبه العقلية والروحية، وتركزت حياته الصوفية، وجعلت تصعد في معارج القدس شيئاً فشيئاً حتى بلغت شأواً عظيماً وهذا ما تجلى في مؤلفاته ومنها هذا التفسير القرآني المصنف ضمن التفسير الإشاري وهو تأويل القرآن بغير ظاهرة لإشارة خفية تظهر لأرباب السلوك والتصوف، ويمكن الجمع بينها وبين الظاهر المراد أيضاً-ويعدّ تفسير ابن عربي هذا من أهم كتب التفسير الإشاري. وهم أربعة: تفسير النيسابوري، وتفسير الألوسي، وتفسير التستري وتفسير ابن عربي، وقد قال في خطبة تفسيره هذا ما نصّه: قد تذكرت خبراً قد أتاني فازدهاني، مما وراء القصد والأماني، قول النبي الأمي الصادق، عليه أفضل الصلوات من كل صامت وناطق: \"ما من القرآن آية إلا ولها ظهرٌ وبطن، ولكل حرف حدٌّ، ولكل حدّ مطلع\".وفهمت منه أن الظهر هو التفسير، والبطن هو التأويل، الحدّ ما يتناهى إليه المفهوم من معنى الكلام، المطلع ما يصعد إليه منه فيطلع على شهود الملك العلام. وقد نقل عن الإمام المحقق السابق جعفر بن الصادق عليه السلام أنه قال: \"لقد تجلّى الله لعباده في كلامه ولكن لا يبصرون\". وروي عنه عليه السلام أنه خرّ مغشياً عليه وهو في الصلاة، فسئل عن ذلك فقال: \"ما زلت أردّد الآية حتى سمعتها مِنَ المتكلم بها\". قال ابن عربي: \"فرأيت أن أعلق بعض ما يسنح لي في الأوقات، من أسرار حقائق البطون، وأنوار شوارق الكائنات، دون ما يتعلق بالظواهر والحدود؛ فإنها قد عيّن لها حدٌّ محدود\". ومن هنا تبيّن بأن تفسير ابن عربي هذا جاء متوافقاً مع المعنى التأويلي للآيات القرآنية وذلك ما ظهر له مما تضمنته الآيات من الأسرار التي اطلع عليها بكونه من أرباب الحقائق، دون أن يتعرض لبيان المعاني الوضعية للنصوص القرآنية.",
  "genres": [],
  "author": "Ibn ʿArabi",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/10155592"
}