{
  "title": "রস রহস্যের সাতকাহন",
  "description": "রুদ্ধশ্বাস সাতটি রহস্যঘন গল্পের রসালো সংকলন নিয়ে এই বই। 'দেশ' পত্রিকায় একটি ও 'উনিশ কুড়ি' পত্রিকায় প্রকাশিত চারটি গল্প ছাড়াও এতে রয়েছে আরও দুটি বড় গল্প। কোনওটিতে মিষ্টি প্রেম, কোনওটিতে হালকা হাসি, কোনওটিতে শিহরিত ভয়। কিন্তু সবকটিতেই রয়েছে অকল্পনীয় রোমাঞ্চ আর প্রত্যেকটির শেষেই মোক্ষম এক মোচড়, যা কিছুতেই আগে থেকে আন্দাজ করা সম্ভব নয়। এই রোমাঞ্চ, এই থামতে না পারা, এই অমোঘ মোচড়ের টানেই পড়ে ফেলতে হবে গল্পগুলি।বাংলা ছোটোগল্পের তরুণ পাঠকদের জন্য অবশ্যপ্রয়োজনীয় ছিল নতুন প্রজন্ম থেকে উঠে আসা লেখকগোষ্ঠীর — যাদের ভাষা, সংলাপ, পারিপার্শ্ব ও মূল্যবোধের সঙ্গে তারা নিজেদের আইডেন্টিফাই করতে পারবে। যেখানে গল্পের ছলে তাদের ‘সংকটময়’ জীবন বা ‘মূল্যবোধের অবক্ষয়’-এর প্রতি মরাল মেসোমশাইগিরি নেই। সুখের কথা অতি সম্প্রতি খুব কম হলেও অন্তত কয়েকজন তরুণ লেখকের লেখায় এই গুণগুলি দেখতে পাওয়া যায়। প্রসেনজিৎ বন্দ্যোপাধ্যায় তাদেরই একজন।প্রসেনজিতের গল্পে প্রথমেই চোখে পড়ে বিষয়বৈচিত্র্য। প্রতিটি গল্পই ইউনিক। পুনরাবৃত্তির ঝোঁক নেই। তাঁর গল্পে ঘটনাই নায়ক। তাঁর প্রখরতম মুন্সিয়ানা কিন্তু গল্পের শেষ দিকে। প্রতিটি গল্পেই অভাবিত উপসংহার। ঘটনার দিক পরিবর্তন অদ্ভুত। তাই চমক তাঁর গল্পে নিশ্চিত প্রাপ্তি।‘দীপান্বিতা’ গল্পটি প্রকাশিত হয়েছিল ‘দেশ’ পত্রিকায় ২০১৩ সালে। \t‘নিঠুর হে’ আর ‘প্রেম আমার’ দুটো গল্পই উনিশ-কুড়ি পত্রিকায় প্রকাশিত হয়েছিল। ননীগোপাল সিরিজেরও দুটি গল্প প্রকাশিত হয়েছিল উনিশ-কুড়ি পত্রিকায়। ‘ননীগোপালের গল্প’ ফ্রেন্ডস এফ এম রেডিও চ্যানেলে সতীনাথ মুখোপাধ্যায়ের কণ্ঠে ভাষ্যপাঠ হিসেবে ‘রহস্য রোমাঞ্চ - আসছে সে আসছে’তে অনেকেই শুনে থাকতে পারেন। অনবদ্য এই গল্পটি প্রথমেই পড়ে ফেললে লেখকের লেখার ধাঁচ সম্বন্ধে একটা ধারণা হয়তো গড়ে উঠবে অবচেতনে, কিন্তু একের পর এক ভিন্নস্বাদের গল্পের বৈচিত্র্যে সে ধারণা বারংবার রিফাইন্ড হতে থাকবেই।\tপ্রসেনজিৎ বন্দ্যোপাধ্যায় এই সময়ের অনন্য শক্তিধর গদ্যকারদের মধ্যে একজন। নতুন প্রজন্মের কথা-ভাষা-দৃষ্টিভঙ্গি-হাসি-কান্না-আড্ডা, কয়েকটি নিজগুণে-অনন্য-ছোটোগল্পে ব্যাকগ্রাউন্ড মিউজিকের মতো ব্যবহার করার জন্যও তিনি প্রশংসার্হ।বইটি মিলবে 'ধ্যানবিন্দু' সহ কলেজ স্ট্রিটের নানা বইয়ের দোকানে। তবে বইটি পাবার সবচেয়ে সহজ উপায় হল সঙ্গের ছবিতে দেওয়া ফোন নম্বরে (9434343446, 9874458244, 8013245158) ফোন করে ঘরে বসে নিশুল্কে পেয়ে যাওয়া।",
  "genres": [],
  "author": "Prosenjit Bandyopadhyay",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/23550128"
}