{
  "title": "Emerged",
  "description": "Anna has escaped from Devin. Now she must learn what it is to live without a master. Yet Devin will not let her go so easily, his power depends on what he takes from her.Will Anna's freedom last? Can she even learn to live as a free woman? Is Devin’s power too great for her to escape?There is a subculture within our own world that you’ve only heard whispers of. The conspiracy theorists wish they knew Anna’s story. What the conspiracy theorists think they know is only disinformation, put out there to keep them from the real story.***NOTE***This is not a stand-alone novel. This is the final of five novels that tell Anna’s story.***WARNING***This book is for grownups. This book is not for people who are easily offended, get nightmares easily, or have difficulty reading books about tough subjects. I do not glorify bad things, but bad things do happen to my poor characters. This is not your typical love story. My heroine does not fall in love and live happily ever after... at least not like the typical heroine. There is a happily ever after, but it is a long, painful journey to that end.This book will likely offend you. This book might make you cry; it might make you throw up. It is a dark book. As my friend, Heidi, said, “It’s dark. It gets darker. It gets even darker, and then it gets even more darker. And then, just when you think it can’t get any darker, it does.”But, don’t worry. I take you to the deep end gradually. ;)There are many sexual situations in this series of books. People die. People get hurt. Things aren’t always truly the way they appear. The antagonist isn’t just a bad guy; he’s EVIL. My heroine’s worldview is skewed; things that may appall you are perfectly normal to her.Any violence in this book is non-gratuitous and crucial to the plot and character development.Do not read this if you are under the age of consent in your country. Do not get angry if the subject or actual book upsets you. If you're reading this, you've been warned.",
  "genres": [
    "Dark",
    "Dark Romance",
    "Paranormal",
    "Abuse",
    "Romance",
    "BDSM",
    "Paranormal Romance"
  ],
  "author": "Marissa Honeycutt",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/23550770-emerged"
}