{
  "title": "The Haunting",
  "description": "Ever wonder how much your life would change if you won a million dollars? Well, that fantasy is about to become reality for one lucky winner of the new reality game show, The Haunting. Six people will enter the contest, but not everyone will win. In fact, there can only be one winner. A drug dealer, an exotic dancer, a drug addict, an entrepreneur, a district attorney, and a rich kid, are all desperate in some way. Whether they need the money, or are looking for something different and need a break from their boring everyday life. It may seem that these contestants have nothing in common, but that's not the case. They have one very important thing in common, their desperation to win the prize . But, winning the money is going to be anything but easy. Not only will they have to spend a full twenty-four hours together in a haunted mansion, but they will have to overcome their weaknesses and make alliances with their competitors just to survive.The many people who have visited Waverly Mansion have gone missing and never returned home to their loved ones. Are these contestants so desperate that they would risk their lives just to win money? A million dollars can mean the difference between life and death to some people, but there are many questions you need to ask yourself. Is the money worth the torment and anguish you will have to endure in order to win? What about your life? Is dying the price you are willing to pay in order to win that amount of money? Can these people survive long enough to claim their prize? Or will their desperation take hold of them and sabotage the other's chances at winning the game? Who deserves to win the money when no one is really the person they appear to be?",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Novella",
    "Contemporary Romance",
    "Thriller"
  ],
  "author": "Nicole Garcia",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/23546980-the-haunting"
}