{
  "title": "Please Hug Me--I'm an Office Monkey: The Only Guide You'll Ever Need to Survive Life in a Cubicle",
  "description": "For anyone who makes a living working in an office, this book is certain to become your new bible. Following his hit guide to air travel, Please Hug Me—I’ve Been Delayed, author and former cube-dweller Jeff Michaels takes you on a roller coaster ride of how to survive the in’s and out’s of today’s modern office. From tips on landing an interview, to dealing with annoying coworkers, to going on extended vacation without your boss finding out, this book is certain cure any case of the Monday Blues. Learn how to: -\tReorganize your cubicle for maximum comfort and minimal work -\tConvert the handicapped stall into a cozy studio apartment -\tClaim your rightful Jewish holidays -\tGo home early with the creative use of tree sap - Deal with the Hallway Blocker, Cubical Leaner, and other chronic office offenders -\tNever again do an ounce of real work Additionally, you will learn: -\tAdvance techniques for controlling your boss (AKA: the head chimp) -\tThe ONE reference that will land you any job -\tThe proper method of napping in the bathroom stall -\tCreative ways to boost your annual salary with expense reports Follow the real-time case study and learn the horrors of getting a P.O. number assigned in a major corporation. Discover the best in corporate ice breakers. Gain tips on how to dominate your team in Departmental Dodge Ball. Learn how to date your coworkers with minimal Next Morning Awkwardness (NMA). Play along with Corporate Buzzword Bingo…. and much more! Comes complete with bonuses: Guide to Break Room Coffee, and How to Start an Online Business from Your Cubicle. Follow all of the hilarious advice in this book and watch your workdays fly by! For Fans of Scott Adams Dilbert, The Office, Office Space, and workplace office humor. EDITORIAL REVIEWS: Having lived the office life and facilitated hundreds of courses focused on leadership in my career, I’ve come to the conclusion that the modern office can, in fact, become a jungle that requires a thoughtful, challenging and compassionate leader. Michaels has a unique take on the inner workings (and non-workings) of an office, and does an excellent job of showing the many areas where things have gone awry, while potentially leading the masses to some sense of salvation. Any monkey looking for a light-hearted read to brighten their workday would be a fool not to pick this up and peel away the insightful information. -Robert H. Thompson, Author of The Offsite: A Leadership Challenge Fable My favorite book in the jungle. -Curious George (W. Bush) Part of the Please Hug Me Series www.pleasehugmeseries.com",
  "genres": [],
  "author": "Jeff  Michaels",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/23550816-please-hug-me--i-m-an-office-monkey"
}