{
  "title": "Outward Bound",
  "description": "\"Have Spacesuit Will Travel\": Kip wants to go to the Moon badly. Everything about him is average; his only claim to fame is that he won a contest and now owns an obsolete but fully equipped space suit. One day, he's walking around his back yard testing it out, when a voice comes over the talkie & the next thing he knows, he's onboard a spaceship heading for the very place he dreams about. But this is no dream. For Kip has been captured by a race of monstrous yet highly advanced aliens who see humans as untrained animals...and a good source of protein....\"Starship Troopers\": In a far future where military service is voluntary, even discouraged, there is of course a catch: enlist or forfeit full citizenship. Basic training is made particularly harsh so that only those of the highest character will survive. But the logic of this escapes Johnnie Rico, an ordinary kid from a wealthy family. Thinking he's joining a peacetime army, the 18-year-old signs up on a whim and becomes a soldier in the Mobile Infantry where his sergeant tells him, We'll make a man of you or kill you trying. To Johnnie's surprise, he gets through the toughest boot camp in the Universe...just in time to be sent into battle against mankind's most terrifying enemy.\"Podkayne of Mars\": Podkayne Fries is a thoroughly modern young Marswoman with a timetable for success based on one goal to be the first female starship captain & she has her strategy all mapped out. So when she gets a chance to travel to Earth with her Uncle Tom, a distinguished elder statesman, Poddy jumps at it...despite the fact that her obnoxiously brilliant kid brother, Clark, is coming along as well. What Poddy doesn't realize is that her uncle is the official Ambassador Plenipotentiary from Mars to the Three-Planets Conference & that certain parties will stop at nothing to gain control of his vote. (Features both the first published ending and Heinlein's original ending.)",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "Collections",
    "Young Adult"
  ],
  "author": "Robert A. Heinlein",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/2354897.Outward_Bound"
}