{
  "title": "The Waste Land and Other Poems",
  "description": "The Waste Land is a revolutionary, highly influential 434-line modernist poem by T.S. Eliot. Despite the alleged obscurity of the poem–its shifts between satire & prophecy, its abrupt unannounced changes of speaker, location & time, its elegiac but intimidating summoning up of a vast & dissonant range of cultures & literatures–the poem has nonetheless become a familiar touchstone of modern literature. Among its famous phrases are its 1st line \"April is the cruellest month\"; \"I will show you fear in a handful of dust\" & its Sanskrit last line \"Shantih shantih shantih\". Eliot originally considered titling the poem 'He do the Police in Different Voices'. In the version he brought back from Switzerland, the 1st two sections of the poem–The Burial of the Dead & A Game of Chess–appeared under this title. This strange phrase is taken from Dickens' Our Mutual Friend, in which the widow Higden, says of her adopted foundling son Sloppy: \"You mightn't think it, but Sloppy is a beautiful reader of a newspaper. He do the Police in different voices.\" This would help the reader to understand that, while there are many different voices/speakers in the poem, there's one central consciousness. In the end, the title chosen was The Waste Land. In his 1st note to the poem he attributes the title to Jessie L. Weston's book on the Grail legend, From Ritual to Romance. The allusion is to the wounding of the Fisher King & the subsequent sterility of his lands. To restore the King & make his lands fertile again the Grail questor must ask \"What ails you?\" The poem's title is often mistakenly given as \"Waste Land\" or \"Wasteland\", dropping the article. In a letter to Ezra Pound, Eliot insisted that the title include the article.",
  "genres": [
    "Poetry",
    "Classics",
    "Fiction",
    "Literature",
    "20th Century",
    "American",
    "School"
  ],
  "author": "T.S. Eliot",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/2356093.The_Waste_Land_and_Other_Poems"
}