{
  "title": "The Far Side of Evil",
  "description": "This is the original edition and is in some respects obsolete; the 2003 edition has significant updating.On completion of her training as an agent of the interstellar federation’s Anthropological Service, Elana is sent to a world whose people may soon destroy their civilization. Since not enough is understood about the situation to justify any interference with their evolution, the Service has no power to act; its agents must go as helpless observers, posing as natives, in the hope of gaining knowledge that may help to save other worlds. This passive role proves intolerable to the young, inexperienced agent assigned to the same city as Elana, a city under totalitarian rule. After falling in love with a local girl who has become Elana's closest friend, he identifies too completely with the natives and unwittingly endangers the entire world by a well-meant but ill-advised attempt to intervene. Forced to assume responsibility for undoing the damage, Elana finds that only she--at great cost--can prevent an immediate war of annihilation.Although this book has the same heroine as Enchantress from the Stars, it should not be considered a sequel, as it is a completely independent story that is not appropriate for readers as young as many who enjoy the earlier book. Older teens and adults can read the two in either order.From the reviews of The Far Side of Evil\"A surprising, haunting, poetic book . . . full of provocative philosophical and psychological questions as well as tense adventure and romance.\" --Commonweal\"An intriguing, provocative story relevant to situations in today's world.\" --Booklist\"Gripping psychological science fiction . . . the relationship between the heroine and her sophisticated, unbrutish interrogator is beautifully balanced and adds another dimension to a story which is already multi-faceted.\" --Times Literary Supplement, London\"The author has a direct, forceful style of writing that sparks the reader’s imagination.\" --Publisher’s Weekly\"Fiction doesn't have to be profound, just entertaining. But every once in a long while, a novel comes along that is both. . . . [It] speak[s] to the very place of humanity in the universe, and what we need to do to attain and claim it. In an age in which terrorism has threatened our ways of life in unexpected ways, Engdahl's probing story, and the recommendation it contains, are especially relevant.\" --Paul Levinson\"This is a thoughtful and engrossing novel.\" --Chicago Daily News\"Contains good characterizations and some thoughtful concepts about our own world, set in a skillfully written SF plot.\" --School Library Journal\"Engdahl's faith in the importance of space exploration and the questions she poses about the nature of 'progress' and the dangers of well-intentioned intervention will amply reward the careful reader.\" --Terri Schmitz, Horn Book",
  "genres": [
    "Science Fiction",
    "Young Adult",
    "Fiction",
    "Fantasy",
    "Aliens",
    "War",
    "Dystopia"
  ],
  "author": "Sylvia Engdahl",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/2355496.The_Far_Side_of_Evil"
}