{
  "title": "All the Time You Need",
  "description": "Highlands of Scotland – 1295Alexander MacKillican is a man drowning in responsibility.With rumors of an impending war filling his head, Alex returns home after a year in Edinburgh to announce his plans to join the coming fight against the English. But when he arrives home, he finds his father dying, his castle under threat of siege by a rival clan, and his twin sister claiming that Faeries roam their lands.As the eldest son, it falls to Alex to take on the onerous task of setting things to rights and ensuring the welfare of Clan MacKillican. The last thing he needs is a strange woman arriving unannounced to add to the bedlam that his life has become. Honor demands that he offer her protection. But is he keeping her safe or has he allowed a spy into his home?Denver, CO – Present DayAnalise Shaw is a woman suffocating in her perfect life.Annie has spent her life being the perfect daughter. She’s even agreed to marry the “perfect” man to suit her parents. But as the wedding nears, she’s getting cold feet. What Annie really wants isn’t a husband, but time to herself and a place to call her own.A deathbed promise to her grandmother sends Annie to Scotland, to the cottage she’s inherited. Once there, her attempt to solve a mystery surrounding her grandmother takes a bizarre twist, landing her in another time–A time in which she finds a sense of purpose, a sense of belonging, and a quiet, brooding Highlander who makes her question all her old arguments against wanting a man of her very own.Alex and Annie face the challenges of lives taking paths completely different from the ones they expected to travel. Just as they begin to suspect that, together, they can face any obstacle, they are presented with the biggest obstacle of all: the Magic that would return Annie to her own time and the man who awaits her there.",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical Romance",
    "Historical",
    "Time Travel Romance",
    "Magic",
    "Scotland"
  ],
  "author": "Melissa Mayhue",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/23556771-all-the-time-you-need"
}