{
  "title": "Forever Christmas",
  "description": "The four best-selling, sweet romance Christmas stories together for the first time. The western Washington town of Glenville is threatened with the possible loss of their 100 year old Christmas tree farm to an outside corporation. Four friends join together to keep the tradition alive and create new opportunities with the rebirth of, Forever Christmas tree farm. \nChristmas Reflections\n - Joanne Jaytanie As a teenager Juliet Swanson couldn’t wait to get out of her home town of Glenville WA and move to the big city. She moved to California to attend college, and then went to work for a large corporation. It didn’t take her long to realize that clawing her way up the ladder at others expense wasn’t the life she wanted. She moved back to her home town, fallen in love with the ‘family feel’ of living there, and has a close knit group of girlfriends she shares everything with. Now if she could only find a way to make her dream career a reality she would have it all, except for Mr. Right. Colton Weatherly is a city guy who eats and breaths his career as a project manager for a development corporation. He is assigned to acquire the Glenville Ski Resort, along with the Schwartz Christmas Tree Farm. By his estimation it will be an easy close, and he plans to wrap it up in one short weekend. What he didn’t plan on was butting heads with Juliet, who is not the average ‘local girl.’ Reflecting on one’s life can sometimes lead to discovering a path you never knew existed. \nChristmas Kiss\n - Sharon Kleve Adelaide Duval has been told how to live her life from a very early age. First by her mother and then by her jerk boyfriend Jason. Both leave her expectantly and now she’s starting over with a new home and a new business. A new romance never crosses her mind. Roman Bennett leaves his old life behind in the big city and settles into the small town of Glenville. When he meets Adelaide, his wounded heart is healed with a Christmas Kiss. \nThe Christmas Wreath\n - Angela Ford Annie Dixon’s love for nature and her hometown of Glenville has her driven to find a way to keep the tree farm from outsiders. When the bank grants sixty days before the tree farm is listed for public sale, Annie and her friends devise a plan to finance the buy. The death of Annie’s childhood friend brings Detective Ryder Harris back to Glenville. A child in his eyes, he always called her ‘Sweet Annie’. Now he sees her differently. Annie never admitted she had a big crush for Ryder. Now that familiar flutter in her heart is back. Annie knows Ryder won’t settle in Glenville. And is Ryder really back for his sister’s funeral or is he connected to the town resort’s sudden disappearance of their manager? For the first time in many years, Ryder is excited about the holidays. Will the magic of Christmas forever connect these two hearts? \nCandy Cane Kisses\n - Elle Rush All bakery-owner Lindsay Leeds wants for Christmas is for her former high-school crush Sheriff Keith “Bodey” Bodewell to quit playing games. The sheriff has been dancing around asking her out for months and Lindsay is tired of it. His “fake girlfriend” ploy was cute and it was sweet that he recruited her friends to find out what she likes, but enough is enough. She’s a busy woman and he needs to step up or he’s going to lose his shot. How can a woman who runs two businesses be so clueless when it comes to managing her heart? Bodey has dropped more than enough hints that he’s interested, but Lindsay isn’t catching them. Just when the sheriff is running out of ideas on how he can convince her to be his for Christmas, Lindsay gives him a clue about what it will take for him to get a date. And the answer is pretty simple. At least, it was supposed to be. Christmas is days away and his plays keep failing on a spectacular level. It’s going to take the jolly fat man to make this holiday romance happen.",
  "genres": [
    "Romance",
    "Anthologies",
    "Holiday",
    "Christmas",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Joanne Jaytanie",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/23560735-forever-christmas"
}