{
  "title": "Missives from Maravida: A Family's Caribbean Sailboat Adventure",
  "description": "Alternate cover edition for ASIN B00AC54H1GThis e-book has 298 photos!Missives from MARAVIDA: A Family’s Caribbean Sailing Adventure documents the extraordinary journey I took with my husband and our two children. Our adventure is chronicled in the e-mail messages I sent to family and friends after we met up with MARAVIDA in Trinidad. It is supplemented with pictures, general information about the locations we visited, and web links. I’ve done my best to preserve the small details of our life, which might prove useful for those who would like to follow in our footsteps or vicariously experience the day-to-day life of a family of cruisers. During our three-and-a-half-year-long voyage, we visited more than 40 Caribbean Islands and the coastal areas of Venezuela, Colombia, and Panama.The goal? Adventure. To see the world and gain a better understanding of it. Our particular adventure required leaving behind our home, possessions, family, friends, and jobs. By removing ourselves from our protected life in the States, we faced the unknown, the unfamiliar, and the unpredictable.We were travelers, not tourists—an American family interacting with the people of different nations as we explored their towns, immersed ourselves in their various cultures, and lived and worked side by side with them, sometimes staying in a single place for months at a time. We also stepped into the counterculture scene of cruisers, a worldly bunch with one thing in common—living on a boat.Experienced travelers? Yes. Experienced boaters? No. There was a steep learning curve built in to our adventure. The challenges of rough seas, ongoing boat maintenance, and the occasional emergency required levelheadedness, extreme patience, and keen improvisation skills. We came away with a new understanding and acceptance of the fact that things could go wrong, and often they did. But it was all part of the adventure.In looking back, our travels aboard MARAVIDA opened our minds to different worldviews, built our confidence in each other, and allowed us to explore an alternative lifestyle. The journey wasn’t all white sand and palm trees; but it was life altering, authentic, and unforgettable.Any regrets on our part? Not a single one.(Locations: Trinidad, Connecticut, Venezuela, Puerto Rico, Virgin Islands, St. Martin, St. Barts, Nevis, Montserrat, The Saints, Martinique, St. Lucia, Bequia, Mustique, Tobago Cays, Union Island, Carriacou, Grenada, Los Testigos, Isla Margarita, Isla La Tortuga, Blanquilla, Los Roques, Las Aves, Bonaire, Curacao, Colombia, San Blas Islands, Panama, Islas de San Bernardo, Los Monjes, Aruba, and Portland, Oregon.)",
  "genres": [],
  "author": "Sandy L. Davis",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/23565204-missives-from-maravida"
}