{
  "title": "The Cage Sessions: Complete Box Set",
  "description": "***The Cage Sessions series is now available as a COMPLETE boxed set!*** ***All five books together (plus a BONUS prequel!) in one HOT and STEAMY bundle!***  Annika is a reporter for MiamiImproper.com, a struggling web magazine. Damien Cage is rock star frontman for the Platinum-selling band Eon Sphinx.  When her boss sends Annika to interview Damien at his Biscayne Bay estate, she can't believe it. Now 22 and trying to find her path in life, Annika struggles to let go of her strict religious upbringing. She yearns to be sexually free, enjoying all that life has to offer.  Just turned 30, Damien Cage is surrounded by beautiful girls. But none of them are on his level. Disillusioned and jaded after a heartbreaking tragedy, he has quit his band in search of something more meaningful out of life.  When Annika and Damien meet, sparks fly. The steam between them is hotter than the Florida sunshine.  What follows is a whirlwind story of sexual awakenings, experimentation, and intense passion.  Damien must learn to let go of his previous love Marcellina and become the inspiration he wants to be. Annika must learn to let go of her fears and become a strong woman who makes her own decisions.  Neither can do it without the other.  Approximate length: 118,000 words  WARNING: My books are the raw, unfiltered vision of a slightly schizophrenic, sex-obsessed, vodka-swilling \"living contradiction\" with profanity issues. They are often unrealistic (translation: FUN) depictions of what life would be like if erotic romance fantasies came true, so sometimes... gasp!... things happen that aren't \"realistic\". (You know, kind of like how dull boring everyday life is realistic. Seriously, do you want to read about that?) If you are offended by the excessive use of dirty words, crass descriptions, or crude stream-of-consciousness writing laced with potty-mouthed expressions and graphic descriptions of non-traditional carnal delight, then you need to RUN from my writing right now! Don't say you weren't warned. (Oh, and you'd better be over 18! Don't even think about buying my books if you aren't.)  This is a complete series. There is no cliffhanger ending.  There is also a heavy emphasis on pansexuality, including a strong transgender character and scenes with multiple partners and genders. Do not read if this offends you.  Themes: New adult romance, kink, rock star, alpha male, tattoos, body piercings, body paint, controlling parent, sex positive, sexual freedom.",
  "genres": [],
  "author": "Skylar Cross",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/23562610-the-cage-sessions"
}