{
  "title": "The Proletarian Revolution and the Renegade Kautsky",
  "description": "Anarchy In Petrograd. The 4th Year 1908th. Aided by the garriso'l of Petrograd, the Maximalists under Lenin have deposed the Kerensky Government, and have assumed office. They announce that this was acomplished without bloodshed, that several Ministers have been arrested, and that M. Kerensky is a fugitive. In a proclamation to the Arrny Committees they state that authority of Government has been taken over by the Military Revolutionary Committee until the creation of a Government of Soviets. At the head of their programme is \" the offer of an immzdiate democratic peace.\" They charge their adherents in the Army to arrest officers who do not join the movement imme- diately, and not to allow uncertain military detactments to leave the front for Petrograd. There has been fighting in Petrograd for posses- sion of the Winter Palace, the headquarters of the Kerensky Government, in which a cruiser took part. The Palace is now in possession of the Maximalists. Thq Livonza has been crossed, and the enemy are pursuing the Italians towards the line of tlie Piave. Between the two rivers, the Italian report says, brave covering troops succeeded in detaining the enemy's advance. The larger units retired without molestation. Prisoners, says the German report, now number over 250,000, and captured guns to over 2,300. Part of the large increase is from the battles oni tho Tagliamento line. A large Italian force was cut off in the arm of the upper river between Tolmezzo and Gemona. Part of it is still holding out, but 17,000 men have had to surrender. Mr. Lloyd George, M. Painleve, and Signor Orlando, with their advisers, have concluded their conference in Italy. General Maude has fought another brilliant action up the Tigris.",
  "genres": [
    "Politics",
    "Lenin",
    "History",
    "Theory",
    "Philosophy",
    "Nonfiction",
    "Political Science"
  ],
  "author": "Vladimir Lenin",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/10156061-the-proletarian-revolution-and-the-renegade-kautsky"
}