{
  "title": "The Science of Open Spaces: Theory and Practice for Conserving Large, Complex Systems",
  "description": "From the days of the American Frontier, the term \"open spaces\" has evoked a vision of unspoiled landscapes stretching endlessly toward the horizon, of nature operating on its own terms without significant human interference. Ever since, government agencies, academia, and conservation organizations have promoted policies that treat large, complex systems with a one-size-fits-all mentality that fails to account for equally complex social dimensions of humans on the landscape. This is wrong, argues landscape ecologist and researcher Charles Curtin. We need a science-based approach that tells us how to think about our large landscapes and open spaces at temporally and spatially appropriate scales in a way that allows local landowners and other stakeholders a say in their futures. The Science of Open Spaces turns conventional conservation paradigms on their heads, proposing that in thinking about complex natural systems, whether the arid spaces of the southwestern United States or open seas shared by multiple nations, we must go back to \"first principles\"--those fundamental physical laws of the universe--and build innovative conservation from the ground up based on theory and backed up by practical experience. Curtin walks us through such foundational science concepts as thermodynamics, ecology, sociology, and resilience theory, applying them to real-world examples from years he has spent designing large-scale, place-based collaborative research programs in the United States and around the world. Compelling for not only theorists and students, but also practitioners, agency personnel, and lay readers, this book offers a thoughtful and radical departure from business-as-usual management of Earth's dwindling wide-open spaces.",
  "genres": [],
  "author": "Charles G. Curtin",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/23569864-the-science-of-open-spaces"
}