{
  "title": "A Season To Remember",
  "description": "‘Second Chance Cafe’ is a collection of four tales of romance and second chances by Susanne Bellamy, Elizabeth Ellen Carter, Noelle Clark and Abbie Jackson. Susanne Bellamy’s The Wish List continues the author’s track record of rural romance set in Australia as well as contemporary and suspense romances set in exotic global locations. In the south-east Queensland city of Toowoomba, handsome accountant Jack Schulz sweeps into Julie Aster’s life. He is the answer to her dilemma and the embodiment of her wish list. Julie wants to save the animal shelter and Jack might have the answer but is he playing for love or profit? Bellamy weaves stories around the settings and people she encounters in her travels around the world. Her titles include ‘Engaging The Enemy’, ‘Winning the Heiress' Heart’, ‘One Night in Sorrento’, ‘Sunny With A Chance Of Romance’ and ‘One Night in Tuscany’. Bellamy placed third in the 2015 Pan Macmillan short story competition with ‘Chez Romeo’. In 'September Harvest' by Elizabeth Ellen Carter, seasonal crop picker Andrew is still a boy himself when he introduces 12 year old Tilly to reading. Instantly besotted both with Andrew and with books, Tilly eagerly awaits his return to her village over the course of 7 summers. Childish adoration is now a young woman’s love but has she misread his feelings for her over the years? With this story, historical romance author Carter paints a sensitive picture of life and growing up in rural Kent in the late 1800s. Her other titles include the Regency adventures ‘Moonstone Obsession’ and its sequel ‘Moonstone Conspiracy’, and ‘Warrior’s Surrender’, set in 1077 Northumbria. In Noelle Clark’s 'Encore', the roar of applause fills New York actress Louisa Frank's ears. Louisa has never forgotten a line, so why is she doomed to a life of waiting off-stage in the shadows? Noelle Clark writes contemporary romance novels, rural romance, and historical fiction. Her books entwine romance, intrigue and adventure in colourful and interesting settings. They feature characters who deal with love and loss, and who experience the often difficult facets of life, such as forgiveness and redemption. Clark’s published titles include ‘Let Angels Fly’, ‘Rosamanti’, and the ‘Robinhill Farm’ series. In 'Shannon's Legacy’ by Abbie Jackson, a young woman’s time is running out fast. The love of her family pushes her to find a cure for the cruel hand she’s been dealt. Will determination be enough? Author Jackson’s experience of more than 10 years as a pathology assistant in a major city hospital influences her writing across multiple genres including crime, thrillers, fantasy and medical mysteries, as well as children’s books. 'Shannon’s Legacy' is her debut published work, with other titles due for release in 2016. ‘Second Chance Cafe’ marks the second outing of the self-styled ‘Bathing Beauties’, a varying quartet of Australian authors and friends whose first anthology, ‘A Season To Remember’, was published in 2014 with stories by Elizabeth Ellen Carter, Noelle Clark, Eva Scott and Susanne Bellamy.",
  "genres": [
    "Christmas"
  ],
  "author": "Elizabeth Ellen Carter",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/23570333-a-season-to-remember"
}