{
  "title": "Brilliant Green: The Surprising History and Science of Plant Intelligence",
  "description": "Are plants intelligent? Can they solve problems, communicate, and navigate their surroundings? Or are they passive, incapable of independent action or social behavior? Philosophers and scientists have pondered these questions since ancient Greece, most often concluding that plants are unthinking and inert: they are too silent, too sedentary -- just too different from us. Yet discoveries over the past fifty years have challenged these ideas, shedding new light on the extraordinary capabilities and complex interior lives of plants.In Brilliant Green , Stefano Mancuso, a leading scientist and founder of the field of plant neurobiology, presents a new paradigm in our understanding of the vegetal world. Combining a historical perspective with the latest in plant science, Mancuso argues that, due to cultural prejudices and human arrogance, we continue to underestimate plants. In fact, they process information, sleep, remember, and signal to one another -- showing that, far from passive machines, plants are intelligent and aware. Through a survey of plant capabilities from sight and touch to communication, Mancuso challenges our notion of intelligence, presenting a vision of plant life that is more sophisticated than most imagine.Plants have much to teach us, from network building to innovations in robotics and man-made materials -- but only if we understand more about how they live. Part botany lesson, part manifesto, Brilliant Green is an engaging and passionate examination of the inner workings of the plant kingdom.Financial support for the translation of this book has been provided by SEPS: Segretariato Europeo Per Le Pubblicazioni Scientifiche.",
  "genres": [
    "Nonfiction",
    "Science",
    "Nature",
    "Biology",
    "Plants",
    "Audiobook",
    "Ecology"
  ],
  "author": "Stefano Mancuso",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/23569887-brilliant-green"
}