{
  "title": "Hell on Heelz",
  "description": "☆.•°*°•.☆AVAILABLE NOW☆.•°*°•.☆NEW FULL LENGTH, STAND ALONE BIKER ROMANCEHell on Heelz, An Asphalt Gods' MC Novel +18 for sexual situations, language and violence.*Even though we met the Hell on Heelz MC in Scar and Seven Sunsets, Asphalt Gods' MC, Hell on Heelz can be read as a stand alone\"My demons needed a long ride, a half bottle of Jack and a hard cock on a good day. One a bad day, they itched for trouble, a fight. The Heelz provided everything I needed. I didn't need a man to come rescue me. - RAGE\"[image]  \"They say time heals all wounds, but my time's done run out. I’m no spring chicken, but it’s more than that. I’ve been mad as hell for far too long. It’s made me a different woman, a bitter woman. No, they don’t call me Rage for nothing—I’m a twisting bitch tornado and that’s before you make me mad. When I’m not fuming, I’m secretly festering in suffocating smog of self-loathing. A man did this to me, and now that I’ve finally met another man, one who calms my storm, one I might let break through the thick thorny vines I’ve wrapped around my heart—I fear there’s nothing left of me.\" Edie Pearl, better known as RAGE, never thought her decision to leave her cheating husband and join the Hell on Heelz MC would land her as the potential president of the female outlaw motorcycle club when the Banshee is killed. Rage has spent the last two years mad as hell, nursing her broken heart with booze and fast men. When she's pitted against her fellow heel, Dixie, in a race to track down the Banshee's killer, she meets the man of her dreams. Mud may be the only man to get her motor running, but he's also her sworn enemy. Will Rage do the unthinkable and choose a man over her club? Or is time really up for her?Mud's been a mess since his twin brother left the Asphalt Gods' MC. He'd hate to have to kill his own kin. When Scar shows Mud mercy by sparing his brother, he thinks everything will finally be back to normal. He's proven wrong. A ride to California is interrupted by the Heelz. After he leaves his brothers and catches up to his enemy, he finds a beautiful woman, one he can not resist. Him showing her the same mercy puts him in even more jeopardy. His heart on the line with his life, which road will he choose?",
  "genres": [],
  "author": "Morgan Jane Mitchell",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/23567191-hell-on-heelz"
}