{
  "title": "Last Call",
  "description": "ONLY SHE CAN SAVE THE MAN SHE LOVES...\nA retired cop past her prime...A kidnapped bank robber fighting for his life...A former mob enforcer with a blood debt...A government assassin on the run...A wisecracking private eye with only one hand...A homicide sergeant with one week left on the job...And three of the worst serial killers, ever.This is where it all ends. An epic showdown in the desert, where good and evil will clash one last time.His name is Luther Kite, and his specialty is murdering people in ways too horrible to imagine. He's gone south, where he's found a new, spectacular way to kill. And if you have enough money, you can bet on who dies first.Legendary Chicago cop Jacqueline \"Jack\" Daniels has retired. She's no longer chasing bad guys, content to stay out of the public eye and raise her new daughter. But when her daughter's father, Phin Troutt, is kidnapped, she's forced to strap on her gun one last time.Since being separated from his psychotic soulmate, the prolific serial killer known as Donaldson has been desperately searching for her. Now he thinks he's found out where his beloved, insane Lucy has been hiding. He's going to find her, no matter how many people die in the process.All three will converge in the same place. La Juntita, Mexico. Where a bloodthirsty cartel is enslaving people and forcing them to fight to the death in insane, gladiator-style games.Join Jack and Phin, Donaldson and Lucy, and Luther, for the very last act in their twisted, perverse saga.Along for the ride are Jack's friends; Harry and Herb, as well as a mob enforcer named Tequila, and a covert operative named Chandler.There will be blood. And death. So much death...LAST CALL by JA KonrathAll things must end...If you are a more sensitive (or adventurous) reader, this handy scale rates specific categories from 1 (lowest) to 10 (highest) to give you some idea if this is your kind of book.LAST CALLBad Language - 7Scary - 5Violent - 8Funny - 8Sexy - 3Crossovers - Features Jack Daniels, Phineas Troutt, Harry McGlade, and includes characters from the Konrath Dark Thriller Collective, the Codename: Chandler series, the Timecaster series, and the Luther Kite series by Blake Crouch.",
  "genres": [
    "Mystery",
    "Thriller",
    "Crime",
    "Suspense",
    "Fiction",
    "Horror",
    "Mystery Thriller"
  ],
  "author": "J.A. Konrath",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/23567831-last-call"
}