{
  "title": "JD",
  "description": "Jonathan Ascher, an acclaimed 1960s radical writer and cultural hero, has been dead for thirty years.            When a would-be biographer approaches Ascher’s widow Martha, she delves for the first time into her husband’s papers and all the secrets that come tumbling out of them. She finds journals that begin as a wisecracking chronicle of life at the fringes of the New York literary scene, then recount Ascher’s sexual adventures in the pre-Stonewall gay underground and the social upheavals that led to his famous book “ JD .” As Martha reads on, she finds herself in a long-distance conversation with her dead husband, fighting with him again about their rocky marriage and learning about the unseen tragedy in her own apartment that ended with the destruction of their son, Mickey. Mickey comes to life in the space between Jonathan and Martha’s conflicting portraits of him, while Martha and the biographer tangle over the continued relevance of Jonathan’s politics and his unfulfilled vision of a nation remade. Martha learns about herself, finally, through her confrontation with a man who will not let her go, even in death.            Mark Merlis’s JD is a brilliant and harrowing view of a half century of the American experiment, acted out on a small stage by three people who cannot find a way—neither sex nor touch nor words—to speak their love for one another.Best Books of 2015: Fiction, Open Letters MonthlyFinalist, Gay Fiction, Lambda Literary AwardFinalist, Ferro-Grumley Award for LGBT Fiction, Publishing TriangleBest books for public & secondary school libraries from university presses, American Library Association“Many years after a ’60s New York writer's death, his widow confronts their tumultuous marriage and private identities through his journals. . . . JD ’s most masterful element is its treatment of these two characters, both of whom spent their lives groping for contentment like one trying to find a light switch in a darkened room. A great writer offers not just tight prose but also insight, a series of probing questions that extend from the fictional world into the real one. JD asks who its characters were, and in doing so, forces the reader to confront the intricate and fascinating politics of identity.”— Shelf Awareness for Readers, *starred review “A truly impressive work of literary fiction, JD documents author Mark Merlis as an extraordinary novelist able to deftly craft a complex plot and populate it with a roster of inherently fascinating characters and memorable events. The result is an entertaining and engaging read that will linger in the mind long after the book is finished. Very highly recommended for both community and academic library literary fiction collections.”— Midwest Book Review/Reviewer’s Bookwatch“The fantastic JD (U. of Wisconsin), by acclaimed gay writer Mark Merlis ( American Studies ), is the writer's first novel in a dozen years. It's told in two voices. The first is that of the late gay writer Jonathan Ascher, and we hear from him through his journals. The second belongs to his widow Martha, who learns more about Jonathan than she ever imagined while reading the journals after agreeing to help a biographer of her late husband.”—Gregg Shapiro, Bay Area Reporter",
  "genres": [
    "Gay",
    "Fiction",
    "Queer",
    "Gay Fiction",
    "Historical Fiction",
    "Historical",
    "LGBT"
  ],
  "author": "Mark Merlis",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/23576891-jd"
}