{
  "title": "Fountains in the Sand",
  "description": "\"The proposition tempted me; it is not every day that one is invited in such gentlemanly fashion to wallow on all fours with young Arabs.\"\"The traveller Temple was struck, at Nefta, with the beauty of its 'desart nymphs, whose eyes are all fire and brilliancy,' and he might have said the same of the boys.\"As the above quotations from Norman Douglas's Fountains in the Sand attest, one need not strain one's eyes too much reading between the lines to find the homoerotic in his travel writing. An Austrian-born Scott, Douglas spent much of his adult life traveling the world partially to see it and partially to escape the law in whatever country he recently had departed.Although he married his cousin in 1898 and fathered two sons (the marriage later ended in divorce), the year before that marriage he was having an affair not only with a mistress but also her fifteen-year-old brother. In 1916, Douglas fled England to, in his own words, \"avoid persecution for kissing a boy and giving him some cakes and a shilling.\" The sixteen-year-old boy in question described the matter less innocently to police, leading Douglas to be charged with indecent assault. Douglas settled in Capri. His book of travel Together, published in 1923, finds him traveling with a companion he refers to as \"Mr R,\" who in fact was a fifteen-year-old Italian boy who went by the name of René.Douglas was admired by E.M. Forster and Lytton Strachey (\"the thrill that only you can give goes down my back,\" Strachey wrote to him after reading Together), and more recently by Paul Fussell, who likens him to Nabokov. D.H. Lawrence was fascinated with Douglas enough to base the character James Argyle on him in Aaron's Rod. Indeed, Lawrence uses Argyle to make one of his more profound statements on love between men, the same sort of statement found in the final pages of Women in Love. Addressing the Marchesse, Argyle says, \"A man is drawn or driven. Driven, I've found it. Ah, my dear fellow, what is life but a search for a friend-that sums it up.\" The Marchesse smiles and adds, \"Or a lover,\" to which Argyle rejoins, \"Same thing, same thing...\"An even more intriguing characterization of Douglas is found in Roger Williams's Lunch with Elizabeth David. The book is written from the point of view of twelve-year-old Eric Wolton, a working class boy Douglas took with him through Calabria. In Julie Gray's review of the book for the New York Times (13 Aug 2000), she writes, \"The question at the novel's center concerns Douglas: Is he, as one character puts it, 'a monster, the pedophile of the century,' or is he, as Eric says, a great man who had led him into a 'warm and sensuous world of adventures and light'?\" Eric, no doubt, would insist he should have the final word.As for Douglas, his final words, after intentionally taking an overdose of pills to end a prolonged illness, are reported to have been: \"Get those fucking nuns away from me.\"",
  "genres": [
    "Travel",
    "Africa",
    "Tunisia"
  ],
  "author": "Norman Douglas",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/23575043-fountains-in-the-sand"
}