{
  "title": "Orconomics",
  "description": "Professional heroes kill and loot deadly monsters every day, but Gorm Ingerson's latest quest will be anything but business as usual. Making a Killing in Professional Heroics The adventuring industry drives the economy of Arth, a world much like our own but with more magic and fewer vowels. Monsters’ hoards are claimed, bought by corporate interests, and sold off to plunder funds long before the beasts are slain. Once the contracts and paperwork are settled, the Heroes’ Guild issues a quest to kill the monster and bring back its treasure for disbursement to shareholders. Life in The Shadows Of course, while professional heroics has been a great boon for Humans, Elves, Dwarves, and all the other peoples of light, it's a terrible arrangement for the Shadowkin. Orcs, Goblins, Kobolds, and their ilk must apply for to become Noncombatant Paper Carriers (or NPCs) to avoid being killed and looted by guild heroes. Even after getting their papers, NPCs are treated as second class citizens, driven into the margins of society. An Insane Quest Gorm Ingerson, a Dwarven ex-hero with a checkered past, has no idea what he's getting himself into when he stands up for an undocumented Goblin. His act of kindness starts a series of events that ends with Gorm recruited by a prophet of the mad goddess Al'Matra to fulfill a prophecy so crazy that even the Al'Matran temple doesn't believe it. Money, Magic, and Mayhem But there’s more to Gorm’s new job than an insane prophecy: powerful corporations and governments, usually indifferent to the affairs of the derelict Al’Matran temple, have shown an unusual interest in the quest. If his party of eccentric misfits can stop fighting each other long enough to recover the Elven Marbles, Gorm might be able to turn a bad deal into a golden opportunity and win back the fame and fortune he lost so long ago.",
  "genres": [
    "Fantasy",
    "Humor",
    "Fiction",
    "Audiobook",
    "High Fantasy",
    "Comedy",
    "Adventure"
  ],
  "author": "J. Zachary Pike",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/23582030-orconomics"
}