{
  "title": "Ether Day: The Strange Tale of America's Greatest Medical Discovery and The Haunted Men Who Made It",
  "description": "Ether Day is the unpredictable story of America's first major scientific discovery -- the use of anesthesia -- told in an absorbing narrative that traces the dawn of modern surgery through the lives of three extraordinary men. Ironically, the \"discovery\" was really no discovery at all: Ether and nitrous oxide had been known for more than forty years to cause insensitivity to pain, yet, with names like \"laughing gas,\" they were used almost solely for entertainment. Meanwhile, patients still underwent operations during which they saw, heard, and felt every cut the surgeon made. The image of a grim and grisly operating room, like the one in Mary Shelley's Frankenstein, was in fact starkly accurate in portraying the conditions of surgery before anesthesia.With hope for relief seemingly long gone, the breakthrough finally came about by means of a combination of coincidence and character, as a cunning Boston dentist crossed paths with an inventive colleague from Hartford and a brilliant Harvard-trained physician. William Morton, Horace Wells, and Charles Jackson: a con man, a dreamer, and an intellectual. Though Wells was crushed by derision when he tried to introduce anesthetics, Morton prevailed, with help from Jackson. The result was Ether Day, October 16, 1846, celebrated around the world. By that point, though, no honor was enough. Ether Day was not only the dawn of modern surgery, but the beginning of commercialized medicine as well, as Morton patented the discovery.What followed was a battle so bitter that it sent all three men spiraling wildly out of control, at the same time that anesthetics began saving countless lives. Meticulously researched and masterfully written, Ether Day is a riveting look at one of history's most remarkable untold stories.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Medicine",
    "Medical",
    "Microhistory",
    "Biography"
  ],
  "author": "Julie M. Fenster",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/2357328.Ether_Day"
}