{
  "title": "The Center Cannot Hold",
  "description": "AMERICAN EMPIRE: BOOK TWOIn this spectacular, thought-provoking epic of alternate history, Harry Turtledove has created an unparalleled vision of social upheaval, war, and cutthroat politics in a world very much like our own—but with dramatic differences.It is 1924—a time of rebuilding, from the slow reconstruction of Washington’s most honored monuments to the reclamation of devastated cities in Europe and Canada. In the United States, the Socialist Party, led by Hosea Blackford, battles Calvin Coolidge to hold on to the Powell House in Philadelphia. And it seems as if the Socialists can do no wrong, for the stock market soars and America enjoys prosperity unknown in a half century. But as old names like Custer and Roosevelt fade into history, a new generation faces new uncertainties.The Confederate States, victorious in the War of Secession and in the Second Mexican War but at last tasting defeat in the Great War, suffer poverty and natural calamity. The Freedom Party promises new strength and pride. But if its chief seizes the reins of power, he may prove a dangerous enemy for the hated U.S.A. Yet the United States take little note. Sharing world domination with Germany, they consider events in the Confederacy of little consequence.As the 1920s end, calamity casts a pall across the continent. With civil war raging in Mexico, terrorist uprisings threatening U.S. control in Canada, and an explosion of violence in Utah, the United States are rocked by uncertainty. In a world of occupiers and the occupied, of simmering hatreds, shattered lives, and pent-up violence, the center can no longer hold. And for a powerful nation, the ultimate shock will come when a fleet of foreign aircraft rain death and destruction upon one of the great cities of the United States. . . .From the Hardcover edition.",
  "genres": [
    "Alternate History",
    "Fiction",
    "Science Fiction",
    "Historical Fiction",
    "War",
    "Fantasy",
    "Speculative Fiction"
  ],
  "author": "Harry Turtledove",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/101563.The_Center_Cannot_Hold"
}