{
  "title": "Gaining: The Truth About Life After Eating Disorders",
  "description": "If you've ever suffered from an eating disorder-or cared for someone who is anorexic or bulimic-you may think you understand these illnesses. But do you really understand why they occur? Do you know what it takes to fully recover? Do you know how eating disorders affect life after recovery? Now, nearly three decades after she detailed her first battle with anorexia in Solitaire, Aimee Liu presents an emotionally powerful and poignant sequel that digs deep into the causes, cures, and consequences of anorexia and bulimia nervosa. Aimee Liu believed she had conquered anorexia in her twenties. Then in her forties, when her life once again began spiraling out of control, she stopped eating. Liu realized the same forces that had caused her original eating disorder were still in play. She also noticed that other women she knew with histories of anorexia and bulimia seemed to share many of her personality traits and habits under stress-even decades after \"recovery.\" Intrigued and concerned, Liu set out to learn who is susceptible to these disorders and why, and what it takes to overcome them once and for all. With GAINING, Liu shatters commonly held beliefs about eating disorders while assembling a puzzle that is as complex and fascinating as human identity itself. Through cutting-edge research and the stories of more than forty interview subjects, readers will discover that the tendency to develop anorexia or bulimia has little to do with culture, class, gender-or weight. Genetics, however, play a key role. So does temperament. So do anxiety, depression, and shame. Clearly, curing eating disorders involves more than good nutrition. Candidly recalling her own struggles, triumphs, and defeats, Aimee explores an array of promising and innovative new treatments, offers vital insights to anyone who has ever had an eating disorder, and shows parents how to help protect their children from ever developing one. Her book is sure to change the way we talk and think about eating disorders for years to come.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Mental Health",
    "Memoir",
    "Mental Illness",
    "Health",
    "Self Help"
  ],
  "author": "Aimee Liu",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/235870.Gaining"
}