{
  "title": "Airborn #1-3: Airborn, Skybreaker, and Starclimber",
  "description": "In Airborn, enter a past in which airplanes have never been invented, giant airships rule the skies and the glittering skyscrapers of Lionsgate City, Canada’s greatest metropolis, rise near the Pacificus Ocean. When Matt Cruse, the cabin boy on the luxury airship Aurora, fearlessly performs a dramatic rescue to save an old man from his damaged hot air balloon, he doesn’t know what events he’s setting in motion. Will he and the balloonist’s fiery granddaughter, Kate de Vries, be able to solve the mystery of impossible flying creatures seen among the clouds? And will they figure it out before pirates and shipwreck end their voyage forever?Pushed high into the sky by a storm over the Indian Ocean, the decrepit training ship Flotsam makes an astonishing discovery before being forced to descend. Adrift at 20,000 feet is a tattered, ice-crusted airship bearing the name Hyperion. Could it really be the legendary lost craft, now a vast treasure and a frozen mausoleum to a ghostly crew? Matt Cruse is the only member of Flotsam’s oxygen-starved crew able to remember the ghost ship’s coordinates—and it seems as if everyone in the fabulous city of Paris wants them. In Skybreaker, Matt and Kate de Vries are challenged with another thrilling adventure, this time among the icy dangers and strange wonders of the upper atmosphere.At long last, Matt Cruse is at the helm. Though it’s only a summer job piloting a humble aerocrane, he’s thrilled to be helping to build the Celestial Tower, Paris’s extraordinary gateway to outer space. But Matt’s idyllic summer is short-lived. He narrowly survives a deadly attack by the fanatical Babelites, who are opposed to humans reaching the heavens. Worse still, his nights spent stargazing with Kate de Vries must end when she’s summoned back to Lionsgate City by her parents. But then the chance of a lifetime boosts Matt’s hopes of being airborne once more. Canada wants to reach space first, and the Canadian Minister of Air has asked Kate to join the first expedition as an expert on aerial zoology. There’s a place for Matt, too—if he can pass the gruelling tests to become one of the world’s first astralnauts on board the incredible ship Starclimber.",
  "genres": [
    "Science Fiction",
    "Fiction"
  ],
  "author": "Kenneth Oppel",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/23587190-airborn-1-3"
}