{
  "title": "Chance Encounters: Travel Tales from Around the World",
  "description": "Travel never goes quite like we expect. Planes are late, maps are misread and unexpected detours are made. When this happens, the twisting roads of travel can lead to adventures we never imagined — and lessons we never expected to learn. Sometimes, if we’re lucky, we cross paths with people who show us life from a different angle or provide kindness when it’s needed most. Those we meet while traveling can change our journey, our experiences or even our lives. Come along with some of the world’s top travel writers as they share their stories from around the globe.Sometimes on the road of travel, we cross paths with unforgettable and extraordinary people. Here are 23 true stories of travel encounters that will long be remembered.• Meet three Americans who help a Belgian woman find her voice• Bust a move with harmonica-playing pygmies in Uganda• See how a former enemy can become your friend• Watch a Kenyan girl face a heartbreaking custom with bravery• Learn from a wise young monk as he hikes in Bhutan• Marvel at the kindness of strangers on a pilgrimage in Japan• Take an unforgettable elevator ride with a courageous woman in Paris• Gain new understanding during an unspoken conversation in Cambodia• Experience Nepal through the eyes of a child• Take a wild ride in Turkey depending only on the kindness of strangersAnd many more… Contributors include: •\tRick Neal•\tKimberley Lovato•\tMichele Peterson•\tJanna Graber•\tRob Woodburn•\tCece Romanyshyn•\tMargie Goldsmith•\tAnnia Lekka•\tChristina Hamlett•\tGabriella Brand•\tRick Zullo•\tPeter Mandel•\tC. Lill Ahrens•\tNithin Coca•\tShilpa Gupta•\tBill Wasserzieher•\tSofie Couwenbergh•\tJames Michael Dorsey•\tRebeca Dunn-Krahn•\tJohn A. KumiskiFor a complete list of contributor bios, see http://tinyurl.com/k4q8xsx",
  "genres": [
    "Travel",
    "Nonfiction"
  ],
  "author": "Janna Graber",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/23584964-chance-encounters"
}