{
  "title": "The Painter of Battles",
  "description": "Acclaimed author Arturo Pérez-Reverte has earned a distinguished reputation as a master of the literary thriller with his international bestsellers The Club Dumas and The Queen of the South. Now, in this haunting new work, Pérez-Reverte has written his most accomplished novel to date. The Painter of Battles is a captivating tale of love, war, art, and revenge.Andrés Faulques, a world-renowned war photographer, has retired to a life of solitude on the Spanish coast. On the walls of a tower overlooking the sea, he spends his days painting a huge mural that pays homage to history’s classic works of war art and that incorporates a lifetime of disturbing images.One night, an unexpected visitor arrives at Faulques’ door and challenges the painter to remember him. As Faulques struggles to recall the face, the man explains that he was the subject of an iconic photo taken by Faulques in a war zone years ago. “And why have you come looking for me?” asks Faulques. The stranger answers, “Because I’m going to kill you.”This story transports Faulques to the time when he crossed continents to capture conflicts on film with his lover, Olvido, at his side. Until she walked into his life, Faulques muses, he had believed he would survive both war and women.As the tense dialogue between Faulques and his visitor continues, the stakes grow ever higher. What they are grappling with quickly proves to be not just Faulques’ fate but the very nature of human love and cruelty itself.Arturo Pérez-Reverte perfectly balances the shadows of the heart with the chaos of war in this stunning composition on morality. Superb and tautly written, The Painter of Battles is a deeply affecting novel about life and art.",
  "genres": [
    "Fiction",
    "Spain",
    "War",
    "Art",
    "Spanish Literature",
    "Historical Fiction",
    "Philosophy"
  ],
  "author": "Arturo Pérez-Reverte",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/1143742.The_Painter_of_Battles"
}