{
  "title": "Geld verdienen met Ebooks op Amazon; Vergroot de Zichtbaarheid van jouw Kindle eBook en Domineer jouw Niche!",
  "description": "Geld Verdienen met eBooks op Amazon? Publiceer nu jouw eBook!Zou je een eBook willen uitgeven in eigen beheer? Wil je een wereldmarkt voor dat eBook? En ook niet afhankelijk zijn van uitgevers die een groot deel van de opbrengsten in eigen zak steken? Dan is deze uitgebreide handleiding Geld verdienen met eBooks op Amazon voor jou! Het is de eerste Nederlandstalige gids die van A-Z uitlegt hoe de marketing machine van Amazon werkt. Je leert niet alleen over het belang van goed vooronderzoek en de metadata van je eBook, maar VOORAL hoe je van je eBook een succes maakt op Amazon temidden van al die andere boeken!Ik heb zelf tientallen (e)Books uitgegeven en diverse self-publishing platforms geprobeerd. In eigen beheer uitgeven op Amazon met KDP bevalt het best: een mondiaal bereik, maximale opbrengsten (doorgaans 70%), optimaal gebruikersvriendelijk, en als auteur profiteer je van de geweldige kracht van Amazons marketing.Omdat het veel tijd vergt om precies uit te zoeken wat wel en niet werkt - het kostte mij bijna een jaar! - heb ik ALLE STAPPEN opgeschreven die nodig zijn om je eBook succesvol te publiceren op Amazon. En wel door gebruik te maken van een speciaal programma binnen Amazon: KDP Select. Met behulp van de promotiemiddelen van dit programma kun je in de top komen van jouw categorie of niche, en dat terwijl je moet concurreren met miljoenen andere (e)Books. Daar zijn speciale technieken voor nodig die in deze volledige up to date publicatie (november 2014) staan beschreven.Geld Verdienen met eBooks op Amazon behandelt uitvoerig het keyword onderzoek, categorie onderzoek, de keuze van de titel en ondertitel, de bookdescription, de metadata, schrijftips, de aangepaste content, het formatteren, converteren, cover design, het verkrijgen van reviews, hoe werkt het uploaden, en vooral ... hoe zorg je ervoor dat je jouw niche kunt domineren. Want het draait om zichtbaarheid door middel van een uitgekiende boekpromotie! Ik geef je stap voor stap uitleg hoe je met de Amerikaanse Internal Revenu Service moet omgaan. Door deze uitleg te volgen bespaar je veel tijd en frustratie.Staan je eBooks op Amazon, dan heb je de basis gelegd voor een mooie bron aan passieve inkomsten. Het is moeilijk te zeggen wat een eBook per maand opbrengt. Dat hangt af van het genre, de kwaliteit van de inhoud, de markt, je prijsstelling, en de taal waarin het eBook geschreven is.Voor wie is Geld Verdienen met eBooks op Amazon?Deze publicatie is bedoeld voor iedereen die een wereldmarkt zoekt: ondernemers, zzp-ers, studenten, auteurs, maar ook kleinere uitgevers. Voor iedereen die graag de wereld als speelveld ziet, en 100% in controle wil zijn en blijven.Als je je eBook in het Engels uitgeeft heb je overduidelijk een groter bereik dan in het Nederlands. Maar nu Amazon in Nederland is, is dit DE tijd om je Nederlandse eBook online te zetten.Download dit eBook nu en wees de competitie een streepje voor. Als je alle technieken opvolgt dan ben je binnen de kortste keren de #1 in jouw niche! Kijk op de website van www.amsterdampublishers.com naar de case study van Outcry - Holocaust Memoirs van Manny Steinberg om te zien wat het kan doen voor de aantallen downloads en de opbrengsten. In nog geen 6 weken tijd heeft dit eBook ruim 2400 euro netto opgebracht. Hoe komt dat? Goede inhoud, en vooral een slimme marketing strategie!",
  "genres": [],
  "author": "Liesbeth Heenk",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/23590528-geld-verdienen-met-ebooks-op-amazon-vergroot-de-zichtbaarheid-van-jouw"
}