{
  "title": "Winter's Ghost",
  "description": "Libby Prater moves to Tyler, Texas to find the perfect residence to suit her needs as a home office for her interior design business. At her aunt's urging, Libby purchases the historic 1920's era, Winter's House, a showcase of Colonial Revival architecture located in the Charnwood district. But, before Libby can call the house a home, she must unravel a hidden mystery in order to bring peace to the spirit that haunts the I remember the first time I saw the ghost. I went to inspect the Winter's House on an icy January afternoon. The home was vacant, without heat, but not without electricity and water. I was on the first floor in the dining room, examining the building plans.As I moved to step back into the living room, I felt a tug at the back of my jacket. I turned around in time to see a young boy standing in the kitchen doorway. With his right arm raised, he pointed to the kitchen.Stifling a gasp, I said to him, \"Hello. May I help you?\"The child remained frozen in place. I took a few steps closer.\"Hello?\" I repeated. I felt my voice quiver, my heart race, and my hands tremble. Who was this young boy? How did he get in? What is he pointing at in the kitchen? Dare I step closer? Three more steps and I would be standing right over him. I took one step closer.\"Who are you?\" I whisperedHe turned and faced me, and in a forlorn and barely audible voice he begged, \"Please Miss, let me out. I can't locate the door.\"I looked down at a hideous face that had little resemblance to anything human. How had this child been disfigured? With my hands stuffed into my pockets, I clenched my fists to steady my nerves, and answered, \"The door is to the right of the sink. You can exit there.\"\"No, Miss. It's stuck,\" he whimpered.I stepped around him and walked over to the kitchen door, determined to let this young child out of the home I wanted to purchase. I grabbed the door's handle and opened it. I turned around to show him.\"The door is open. You can leave.\"The boy stayed in place. He gazed up at me with lifeless, unseeing eyes. And, before I could utter another sound, he vanished right before my eyes.Then, I screamed.",
  "genres": [],
  "author": "Elizabeth Eagan-Cox",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/23593160-winter-s-ghost"
}