{
  "title": "Inside the Hearts of Bible Women",
  "description": "Modern Bible Women was written to help God’s women understand some of the more serious problems and challenges facing us in our modern age, and also faced thousands of years ago. Conversation and narrative have been added to help the reader imagine what it might have been like to walk in the shoes of these Bible women. This book is organized to be used in private, an established church class, or an outreach to women in the community. Three sets of discussion questions represent (a) the woman before the problem arose, (b) being hurled into the throes of the problem, (c) her efforts to pull out of the problem. There are no right or wrong answers. Unbeknown to your group, a seemingly stable woman may be going through any of these problems right now, and need suggestions from her sisters. Most such problems are not normally discussed openly, but we should not pretend they do not exist (James 1:24). Furthermore, we should not wait until, God forbid, you or a friend is thrust into one or more of these problems before figuring out how to handle it. How would you handle having to move over and over as Sarah did? Do you think you’d have the courage to publicly stand against homosexuality, or do you always find it easier to just go along for the sake of peace as Lot’s wife did? What if two of your grown children had a falling out and refused to speak to each other for years as happened to Rebecca? Would you fall apart completely if all your children were killed in one day, your husband lost his income, or he became grotesquely ill ~ all of which faced Job’s wife? Could you face loss of a husband in death, and then change religions and countries as did Ruth? Is it possible to keep your sanity while living with an abusive husband as did Abigail? Have friends tried to convince you that it is possible to harmlessly reach the spirit world as Endora experienced? Can a woman truly return to a normal life after having been raped as Tamar had been through incest? Is forgiveness possible when a spouse commits adultery over and over throughout marriage as Gomer did to Hosea? What about hiding one’s religion, then finding the courage to step out and be counted as Queen Esther experienced? Are you haunted with adult ADD and can’t seem to get anything done, despite working all day as was Martha’s fate? Do you think you can remain loyal to Jesus and his Body through thick and thin as loyal Priscilla did? Let us prepare ourselves now while we are thinking clearly. Let us march confidently into that unknown future, our feet shod with the preparation of the gospel of truth (Ephesians 6:15). Thus, we can courageously and assertively face anything!",
  "genres": [],
  "author": "Katheryn Maddox Haddad",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/23591971-inside-the-hearts-of-bible-women"
}