{
  "title": "Drawing Lessons",
  "description": "The estranged young wife of a Senator.A dark and brooding French artist.An artistic collaboration.A sizzling hot romance.Praise for Drawing Lessons ...“What a sigh-worthy tale! The relationship between Marie and Luc is a slowly growing burn. One that isn’t an insta-love relationship, it builds with each lesson, making it much more romantic ... There are twists and turns in this story that one will not expect, which is a delightful surprise. Ms. Gabriel does an amazing job of making the reader want to turn every page and savor it.” — InD’Tale Magazine“Gabriel paints white-hot sex scenes.\"— KirkusReviews“ Drawing Lessons is an old fashioned romance with a bucket-load of modern problems. A great read for a chilly autumn night.\"— Happily Ever After Thoughts BlogThirty-year-old Marie Witherspoon has spent her entire life as an accessory to other people’s political careers—first her father’s, then her husband’s. But then her husband—a United States Senator and rising political star in Washington—dumps her for his gossip blogger mistress, and Marie is left to build a new life that has nothing to do with politics or campaigns or keeping up appearances. When her best friend tries to cheer her up with a gift certificate for drawing lessons, Marie expects to rekindle an old hobby. Nothing more than that. She definitely doesn’t expect Luc Marchand. Sexy. Gorgeous. Infuriating. French. His teaching methods are unorthodox, to say the least.It’s been twelve long years since professor Luc Marchand’s life was shattered by a former student. Forced out of academia, he’s walled off his heart and his career. He’s been warned about his beautiful new student and her powerful family—but the more he sees her, the more powerless he becomes to resist her.When the senator calls off the divorce to bolster his re-election prospects, Marie must hatch a plan to gain her freedom once and for all. But Luc has a few secrets of his own ... secrets that ignite a high-stakes political scandal neither Luc nor Marie see coming. As the noose of her former life tightens around her, will Marie find the strength to escape—without walking away from the only person who truly sees her?",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Thriller",
    "Erotica"
  ],
  "author": "Julia Gabriel",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/23598335-drawing-lessons"
}