{
  "title": "It's Hard Not to Hate You: A Memoir",
  "description": "From the author of THIN IS THE NEW HAPPY comes a hilarious new memoir about embracing your Inner Hater. In the midst of a health and career crisis, Valerie uncorks years of pent up rage, and discovers you don't have to be happy to be happy. You don’t have to love everyone else to like yourself. And that your Bitchy Twin might just be your funniest, most valuable and honest ally.“The hate in you has got to come out.” After being advised to reduce stress by her doctor, humorist Valerie Frankel realized the biggest source of pressure in her life was maintaining an unflappable easing-going persona. After years of glossing over the negative, Frankel goes on a mission of emotional honesty, vowing to let herself feel and express all the toxic emotions she’d long suppressed or denied: jealousy, rage, greed, envy, impatience, regret. Frankel reveals her personal History of Hate, from mean girls in junior high, selfish boyfriends in her twenties and old professional rivals. Hate stomps through her current life, too, with snobby neighbors, rude cell phone talkers, scary doctors and helicopter moms. Regarding her husband, she asks, “How Do I Hate You? Let Me Count the Ways.” (FYI: There are three.) By the end of her authentic emotional experience, Frankel concludes that toxic emotions are actually good for you. The positive thinkers, aka, The Secret crowd, have it backwards. Trying to ward off negativity was what’d been causing Frankel’s career stagnation, as well as her health and personal problems. With the guidance of celebrity friends like Joan Rivers and psychic Mary T. Browne, Frankel now uses anger, jealousy and impatience as tools to be a better, balanced and deeper person. IT'S HARD NOT TO HATE YOU sends the message that there are no wrong emotions, only wrong ways of dealing with them.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Humor",
    "Comedy",
    "Chick Lit",
    "Contemporary",
    "Book Club"
  ],
  "author": "Valerie Frankel",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/11440755-it-s-hard-not-to-hate-you"
}