{
  "title": "The Table of Less Valued Knights",
  "description": "From Marie Phillips, author of the #1 national and international bestseller Gods Behaving Badly , comes a charming, funny story about a down-on-his-luck knight of Camelot, his eccentric band of misfits and their madcap quest to restore order to their lives, and the realm.     Sir Humphrey du Val has had enough. Relegated to the Table of Less Valued Knights--Camelot's least prestigious spot, boringly rectangular in shape and with one leg shorter than the other so that it has to be propped up with a folded napkin to stop it from rocking--he has been banned by King Arthur from going on quests, and hasn't left the castle in 15 years. After a chance meeting with Elaine, a young maiden in search of her kidnapped fiancé, Sir Humphrey, along with his squire Conrad (an undersized giant) and Jemima (Conrad's elephant), sets off on a journey to find the distressed damsel's betrothed, hoping to restore himself to a place of honour at the Round Table. Meanwhile, Martha, an errant queen on the run from her new power-hungry husband, is in disguise and on a quest of her own to find her long-lost brother, the true ruler of her realm. Martha soon runs--literally--into Humphrey's eccentric group, who take the incognito queen captive, believing her to be a boy. As they journey through countryside, castles and villages, they gather unlikely friends and enemies along the way. While each member of the party secretly harbours their own ambitions for the quest, their collective success, and the fate of the realm, rests on their grudging cooperation and unexpectedly interconnected lives. The Princess Bride meets Monty Python and the Holy Grail in this funny, charming, and delightful tale about lesser-known heroes in Arthurian England.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Historical Fiction",
    "Humor",
    "Arthurian",
    "Historical",
    "Book Club"
  ],
  "author": "Marie Phillips",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/23602465-the-table-of-less-valued-knights"
}