{
  "title": "Flame",
  "description": "Book 2 of the 4-book series The Stark Affair  Sofia is getting closer to uncovering the dark truth about Colton Stark, but she is torn between her duty as a police officer and her own overwhelming attraction to him.  What begins as a boxing date quickly becomes an exercise in futility as an all-consuming flame ignites. Sofia finds herself giving in to Colton's dirty filthy dominance.  As she attempts to stay focused on her assignment, Sofia fights a losing battle against her primal urges and ever-growing feelings for this criminal with the power to seduce her with such raw abandon.  Tension is also high at work. There is a rat on the police force and Sofia begins to suspect who it is, placing her life in danger.  Colton Stark has his own set of problems. When he learns some ugly information about the Chairman of the Board who rules his life, he decides to act.  But his decisions... including his devotion to the secret Talon Group... may get him and Sofia killed.  WARNING: My books are the raw, unfiltered vision of a slightly schizophrenic, sex-obsessed, vodka-swilling \"living contradiction\" with profanity issues. They are often unrealistic (translation: FUN) depictions of what life would be like if erotic romance fantasies came true, so sometimes... gasp!... things happen that aren't \"realistic\". (You know, kind of like how dull boring everyday life is realistic. Seriously, do you want to read about that?) If you are offended by the excessive use of dirty words, crass descriptions, or crude stream-of-consciousness writing laced with potty-mouthed expressions and graphic descriptions of non-traditional carnal delight, then you need to RUN from my writing right now! Don't say you weren't warned. (Oh, and you'd better be over 18! Don't even think about buying my books if you aren't.)  Approximate length: 16,000 words (a novella)",
  "genres": [],
  "author": "Skylar Cross",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/23603429-flame"
}