{
  "title": "Dancing Forever with Spirit",
  "description": "Dancing Forever with Spirit continues the saga of the author’s spiritual awakening that began when he was confronted on the street by a homeless man named Albert who turned out to be a wise spirit in disguise—an emissary from the spirit world, as recounted in the author’s first book, Dancing on a Stamp. In this sequel, the author describes his most recent exploits with Albert who appeared in his bedroom room one night to guide him on a series of out-of-body adventures to explore a dazzling white city on the Spirit Side, other planets in the galaxy with intriguing life forms, and some of the far-flung regions of our planet that suffer from human abuse. These fascinating astral excursions included a visit to a water planet where the resident cetaceans implore humans to stop the carnage of their cousins on Earth, a rendezvous with a benevolent race of extra-terrestrial beings who have been observing Earth for eons, and a trip to another dimension to observe the idyllic world of humans who have made the shift to the New Earth. With guidance from Albert, the author gains access to the Akashic Records (which contain the history of every life in the Universe) to view some gripping episodes from several of his previous lives that were often tragic but always enthralling and thought provoking, and to sneak a glimpse into the secret life of Jesus.These nightly escapades with Albert were designed to rouse us from our callous stupor by displaying some of the inexcusable abuse humans inflict on Mother Earth, the other creatures on our planet, and on other humans, with the hope that we will renounce the dark side of humanity in favour of spiritual enlightenment. Dancing Forever with Spirit is a call to action for humanity—a plea from Spirit for humans to wake up and recognize the harm caused by their actions and neglect, so they can focus their energy on helping themselves and everyone else make the transition to the New Earth.",
  "genres": [],
  "author": "Garnet Schulhauser",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/23600752-dancing-forever-with-spirit"
}