{
  "title": "Healthy Heart Healthy Planet: Delicious Plant Based Recipes and Tips to  Reduce Heart Disease, Lose Weight and Preserve the Environment",
  "description": "After a brush with a deadly illness at the age of forty, physician Rajiv Misquitta and his pharmacist wife, Cathi, set out to find ways to change their lifestyle to ensure they lived long enough to see their children grow up.Learning that roughly six hundred thousand people in the United States die annually from heart disease, Rajiv researched the medical literature and discovered that a low-fat vegan diet can actually reverse heart disease as well as help people lose weight—not to mention have a positive impact on the ecosystem.Finding existing vegetarian and vegan cookbooks less than satisfying, Cathi developed her own vegan recipes. Compiled and presented here is a bountiful collection of more than one hundred heart-healthy, eco-friendly, everyday vegan recipes for breakfast, lunch, dinner—and even snacks. Inspired by cuisines from around the world, the recipes include plenty of protein-rich grains and legumes as well as seasonal variations for a balanced diet that’s in tune with nature.In addition, the book provides advice on transitioning to a vegan lifestyle, and each chapter offers an eco-friendly kitchen tip. And with weekly sample menus and grocery lists, Healthy Heart, Healthy Planet delivers both inspiration and empowerment for anyone who desires to live a healthy life and ensure a healthy planet.Praise for the bookDr. Cathi Misquitta and Dr. Rajiv Misquitta have combined their expertise in an outstanding book not only for patients with heart disease but for the health of the planet as well. The recipes are easy to follow, contain NO oil and help show how delicious plant based eating can be. --Caldwell B. Esselstyn, Jr., M.D.author of Prevent and Reverse Heart DiseaseWhat is good for the health of your heart is also good for the health of the planet—and taking care of both is worth the effort. Doctors Cathi and Rajiv Misquitta show you how it’s done in their new cookbook Healthy Heart, Healthy Planet. Paging through the book and looking at all of the delicious recipes, you can’t help but want to get into the kitchen and start cooking. Don’t suppress that urge. Get the book and get going. These recipes might save your life, and they’ll surely help save the environment.--Neal Barnard, M.D.Nutrition researcher, New York Times bestseller author and health advocate",
  "genres": [
    "Cookbooks",
    "Cooking"
  ],
  "author": "Rajiv Misquitta",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/23601460-healthy-heart-healthy-planet"
}