{
  "title": "How to Cook Without a Book: Recipes and Techniques Every Cook Should Know by Heart",
  "description": "Pam Anderson grew up watching her parents and grandparents make dinner every night by simply taking the ingredients on hand and cooking them with the techniques they knew.Times have changed. Today we have an overwhelming array of ingredients and a fraction of the cooking time, but Anderson believes the secret to getting dinner on the table lies in the past. After a long day, who has the energy to look up a recipe and search for the right ingredients before ever starting to cook? To make dinner night after night, Anderson believes the first two steps--looking for a recipe, then scrambling for the exact ingredients--must be eliminated.  Understanding that most recipes are simply \"variations on a theme,\" she innovatively teaches technique, ultimately eliminating the need for recipes.Once the technique or formula is mastered, Anderson encourages inexperienced as well as veteran cooks to spread their culinary wings.  For example, after learning to sear a steak, it's understood that the same method works for scallops, tuna, hamburger, swordfish, salmon, pork tenderloin, and more. You never need to look at a recipe again. Vary the look and flavor of these dishes with interchangeable pan sauces, salsas, relishes, and butters.Best of all, these recipes rise above the mundane Monday-through-Friday fare.  Imagine homemade ravioli and lasagna for weeknight supper, or from-scratch tomato sauce before the pasta water has even boiled.  Last-minute guests? Dress up simple tomato sauce with capers and olives or shrimp and red pepper flakes. Drizzle sautéed chicken breasts with a balsamic vinegar pan sauce. Anderson teaches you how to do it--without a recipe. Don't buy exotic ingredients and follow tedious instructions for making hors d'oeuvres. Forage through the pantry and refrigerator for quick appetizers. The ingredients are all there; the method is in your head. Master four simple potato dishes--a bake, a cake, a mash, and a roast--compatible with many meals. Learn how to make the five-minute dinner salad, easily changing its look and flavor depending on the season and occasion. Tuck a few dessert techniques in your back pocket and effortlessly turn any meal into a special occasion.There's real rhyme and reason to Pam's method at the beginning of every chapter: To dress greens, \"Drizzle salad with oil, salt, and pepper, then toss until just slick. Sprinkle in some vinegar to give it a little kick.\" To make a frittata, \"Cook eggs without stirring until set around the edges. Bake until puffy, then cut it into wedges.\" Each chapter also contains a helpful at-a-glance chart that highlights the key points of every technique, and a master recipe with enough variations to keep you going until you've learned how to cook without a book.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Foodie",
    "Culinary"
  ],
  "author": "Pam Anderson",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/236011.How_to_Cook_Without_a_Book"
}