{
  "title": "Never Forgotten",
  "description": "Sal has learned why Josh left her so long ago without any explanation. It’s not exactly what she thought it would be and in her mind it was another woman or a commitment issue. What she learns instead is that he is a werewolf, a man that turns into this creature once a month during the full moon. Instead of shying away from it, she embraced it and even asked him to change her into one of them. He was reluctant at first, but eventually her persistence paid off and they became more than just a couple…they became a family. They had no idea that a man was watching them as they changed for the first time, showing off her baby bump and moving into the woods for her first hunt. Josh has been very secretive about his past and even family life. Sal believes that he is hiding something from her and has taken it upon herself to dig into his family tree. Josh on the other hand feels that the past should be left where it is and never wants to speak of his family or of the past again. Unfortunately, these things tend to raise their ugly head at the wrong moments. His love for her will be tested when she betrays him and brings to their doorstep a long lost family member. It will be a sister named Sheila, a woman that has been searching for her brother for a very long time. It is a strained relationship between the two of them and even though Sal pries about their family, neither one is willing to speak of it. If she thought that becoming a werewolf was going to be her biggest obstacle, she is about to find out that there is a lot more to Josh than just the change on the full moon. The man that has been following them will be revealed and just what is his problem with Josh? Is he somebody to be feared or embraced? Does he have only Josh’s best interest at heart or does his feelings for him go deeper than that? These are the questions that will be answered and by the end of it, a new revelation and shock will smack them both across the face.",
  "genres": [],
  "author": "Jodie Sloan",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/23610763-never-forgotten"
}