{
  "title": "Manners Cost Everything",
  "description": "Robbie is someone like you and me, except that he murders bad mannered people. He had always gone through life trying to do the right thing, respecting his elders and watching his manners. Then one day, a chance encounter made him snap. He developed an alter ego that unbeknownst to him, wreaked revenge on anyone crossing his path that had been disrespectful, ill-mannered or just plain rude. The ones that slam doors in your faces, the ones that don’t indicate on the roads, the bullies and the type that hurt innocent animals and people. The pushy, nasty human beings that are oblivious to the world around them.Now, the two parts of him continue separately, the likable one living a life of success and excess and the other, darker one leaving a bloody trail of murder and aptly delivered revenge. Only the black outs that Robbie suffers are an indication that anything is wrong, when he awakes from what he thinks are violent dreams. Otherwise, he doesn’t have a clue.Meanwhile, an up and coming Detective Lentus has his world changed forever by the first of these vicious murders, and devotes his life to hunting down and bringing the mysterious killer to justice; whilst being haunted by the ‘ghost' of his murdered sister. Lentus is a simple man with linear thinking, who now only has his job and his obsession driving him; now that he has lost his last remaining family member. The paths of the characters intertwine throughout London, sometimes knowingly, and sometimes not; ending in a breath taking conclusion.This is the first of a trilogy that will span the years 1996 to 2015, and it rampages its visceral course through the history, music, culture, sexual exploits and technological advances of the time. Manners Costs Everything covers the years 1996 to 2001.Written in shockingly graphic detail, with dark humour and an adult erotic tinge; this series of books is for the open minded lovers of horror fiction, crime fiction and thrillers.",
  "genres": [],
  "author": "Paul David Chambers",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/23611922-manners-cost-everything"
}