{
  "title": "Dreaming of Genie",
  "description": "Genie thought learning how to “do” The Hustle was the worst thing about 1977, right along with strobe lights and disco balls, but she discovers something far worse the day she is bottle banished by an unsanctioned hunter obsessed with her destruction. Thirty-seven years later, she is awakened from her spellbound slumber by a homeless alcoholic who wants whiskey not a wish. Overwhelmed with shame and keeping secrets from even himself, Reid Romans is the worst master ever. He stinks. He’s dirty. He’s rude, but even more maddening; he’s sinfully sexy under all the filth and attitude. When his green-eyed gaze captures Genie for the first time, she’s hooked, and being hooked on a human is not acceptable or allowed according to the genie rule book. While Reid’s unsavory past bites hard at his heels, and he’s accused of a murder he didn’t commit, a powerful jinn is stalking Genie, intent on adding her to his harem. She has rejected him too many times to count, but he won’t stop until he claims her—body and soul. Genie and Reid have way more than one love-sick jinn to deal with. A ruthless FBI agent; a cold-blooded cartel; and a hateful hunter, who wants genie back in her bottle, banished forever; keep them fighting for freedom and against the desire flaring between them. Dark secrets, forbidden love, and simmering suspense take Genie and Reid on an unforgettable journey where the past and future collide and wishes run out. Please be advised: For mature readers only/18-plus! Bottle Banished is a multiple POV (Point of View) dark fantasy with alpha males galore, graphic drug use, language, violence, and sexual situations that some may find offensive, including dubious consent/light BDSM. Several doors remain open for future installments.Readers will uncover numerous references to current and past pop culture sprinkled throughout the story. Watch author’s website for contests connected to these references!You can download the first three chapters right here on goodreads!",
  "genres": [
    "Paranormal",
    "Urban Fantasy"
  ],
  "author": "C.L. Riley",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/23605221-dreaming-of-genie"
}