{
  "title": "No Commitment Required",
  "description": "Yvonne Mitchelson owns a small string of lingerie boutiques in Atlanta. Lately her lingerie designs have been lackluster. To her partners, the answer is simple: there's nothing like love to spark creativity. But Yvonne doesn't want anything to do with love. Losing her parents and sister in an accident and her resulting mental and physical scars have left her afraid to love or be loved. Michael Benjamin is the epitome of the American male: tall, white, affluent, handsome. He has his own scars, given to him by his late wife. When he discovered her cheating on him one night, he threw her out, and she later died. Now 33, the marketing whiz has honed his guilt and anger into a love-them-and-leave-them facade. He is one of Atlanta's most eligible bachelors and is determined to remain that way. The two meet when a mutual friend, Jeff Grayson, sends Michael to retrieve Yvonne from the airport in his place. Sparks immediately fly through a misunderstanding that is quickly cleared, leaving the two very aware of each other. Both realize that while romance may be dead, business is not. They need each other professionally, yet are drawn to each other personally. Yvonne fights her growing attraction for Michael, knowing that even if her heart said yes, her scarred body says no. But Michael eases those fears, and they yield to their desire. Their first night of passion leaves both shaken, yet they are unable to go back to before. They agree to continue their personal relationship, no commitment required. Yet they are drawn deeper into each other's lives. When Yvonne loses her foster father, all of her old grief comes rushing back. Michael is there to comfort and support her. Their affection and passion has deepened to love, a love that blossoms, despite its challenges.",
  "genres": [
    "Interracial Romance",
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Adult",
    "Erotica"
  ],
  "author": "Seressia Glass",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/236155.No_Commitment_Required"
}