{
  "title": "Venice Vampyr: The Beginning",
  "description": "The first 3 Novellas in the Venice Vampyr series, a historical, paranormal romance about a group of vampires in 1800s Venice, Italy.Novella #1 (Venice Vampyr)Isabella Tenderini, a wealthy merchant's widow rescues a stranger from drowning in one of Venice's canals. And how does the man repay her selfless act? By kissing her - her, a respectable woman.Not only is Raphael di Santori grateful for his life being saved, he would also like to thank his rescuer very intimately - more intimately than decorum allows. But then, Raphael has never been one to play by the rules - as a vampire he doesn't have to.Novella #2 (Venice Vampyr: Final Affair)Viola Costa has been given three months to live but she refuses to die a virgin. She travels to Venice where she wants to experience physical pleasure with a man without causing a scandal for her family. Afterward, she plans to take her own life to ensure she exits the world painlessly and with dignity. Unfortunately, the man she meets in a disreputable club couldn’t be a worse choice for her plans.Dante di Santori, a hedonistic vampire, saves Viola from a violent rake. To stop her from seeking out even more dangerous men to find carnal pleasures, he offers her a night of passion in his arms, only to discover she’s a virgin.Viola flees, disdainful of the carnal act and determined to end her life. Horrified, Dante stops Viola from harming herself and proceeds to deliver the pleasure he promised – one kiss and one touch at a time until she’s ready to take all of him, over and over again.Then events force Dante’s hand ...Novella #3 (Venice Vampyr - Sinful Treasure)When vampire rake Lorenzo Conti finds a beautiful woman sleeping in the bedchamber of his newly acquired home, he believes her to be a housewarming gift bestowed upon him by his thoughtful friends. There’s only one thing to do with such a delicious present: ravish her!The mysterious Bianca rushes to Venice upon her father’s death but arrives too late: the house that she believes to contain a priceless treasure has already been sold. Hoping the new owner won’t move in for another few days, she breaks in to search for her father’s elusive treasure.But when Lorenzo discovers her, she has to think fast and find a way to remain at the house to continue her search. And what better way than to seduce the new owner?Total Length: approx. 97,000 words / approx. 450 pages on the NookThese vampire novellas are more explicit and steamier than my other books.",
  "genres": [
    "Vampires",
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Historical Romance",
    "Fantasy",
    "Novella"
  ],
  "author": "Tina Folsom",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/11442400-venice-vampyr"
}