{
  "title": "Nature's Confession",
  "description": "This is an updated cover edition of ISBN10: 0989596079/ ISBN13: 978098959607).The epic tale of two teens in a fight to save a warming planet . . . the universe . . . and their love. A cli-fi quest full of romance, honor, and adventure. LitPick 5-Star-Review Award winner #1 Top Fiction Read (ARC) of 2014, Marinovich Books  Best of a New Genre, included in “12 Works of Climate Fiction Everyone Should Read” Eco-Fiction Honorable Mention 5-Star Foreword review  When a smart-mouthed, mixed-race teen wonders why the work that needs to be done pays nothing compared to the busywork glorified on holovision news, the search for answers takes him on the wildest journey of anyone’s lifetime. Their planet is choked with pollution. They can’t do anything about it . . . or can they? With the girl of his dreams, he inadvertently invents living computers. Just as the human race allows corporations to pollute Earth into total desolation, institute martial law and enslave humanity, the two teens set out to save civilization. Can they thwart polluters of Earth and other fertile planets? The heroes come into their own in different kinds of relationships in this diverse, multicultural romance. Along the way, they enlist the help of female droid Any Gynoid, who uncovers cutting-edge scientific mysteries. Their quest takes them through the Big Bang and back. Will Starliament tear them from the project and unleash ‘intelligent’ life’s habitual pollution, or will youth lead the way to a new way of coexisting with Nature?  Nature’s Confession couldn’t be more timely, amidst the largest climate change march in world history when world leaders converged for an emergency UN Climate Summit in New York City. With illustrations and topics for discussion at the back of the book, JL Morin entertains questions about busywork; economic incentives to pollute; sustainable energy; exploitation; cyborgs; the sanctity of Nature; and many kinds of relationships in this diverse, multicultural romance.",
  "genres": [
    "Science Fiction",
    "Young Adult",
    "Climate Change Fiction",
    "Family"
  ],
  "author": "J.L. Morin",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/23618057-nature-s-confession"
}