{
  "title": "Mantrap",
  "description": "With a reputation akin to a nest of pit vipers with attitude, The Wyverns raise hell and leavechaos in their wake. Forced together because the alternatives are worse, they form the ultimatedysfunctional family. But how did this bunch of badass bikers end up baking in the arid heat ofsouthern Arizona?Never judge a book by its cover and never judge a biker by the patches on his leathers. Behindthe intimidating façade, The Wyverns are organised, intelligent and committed to relieving thecartels of their wealth. Ejected from various branches of law enforcement and the military, theyshare a healthy disregard for authority and a collective appreciation of the male anatomy. They alsohave the skills to make crime pay—talents recognised by the shady, manipulative bastardcalled Trap who pulls their strings from behind the scenes.The Wyverns are expendable. Surviving in their world takes guts and gritty determination. Littlewonder that the attractions of BDSM appeal to men that live their lives on a knife-edge. But eventhose who crave the adrenaline rush of danger search for the one elusive soul mate that makes lifeworth living. This series follows the members of The Wyverns as they risk everything for love.Book one in the The Wyverns seriesNot all cages have bars.The Wyverns Motorcycle Club has a reputation as fierce as its dragon emblem. Its enigmaticleader, Rogue Hellaby, has a police file so thick you could prop up a table with it. The qualificationsfor membership are a reckless disregard for authority and the attitude of a spitting cobra. But TheWyverns MC is not quite what it seems. All the riders have dubious histories in the military or thepolice—now they just serve and protect their own interests and those of Horatio Trap, themanipulative bastard who recruited them.When Rogue receives an instruction to kidnap and hold hostage the son of a powerful drug lord,he doesn’t bat an eyelid. But Rogue has never had to deal with a captive like Orlando de la Pena.Orlando is furious—not because he’s being held prisoner, but because he’s prevented frompartying at his favorite BDSM club. Rogue discovers that the only way to deal with Orlando is tobecome the Dom he so obviously needs. But Orlando’s father wants him back, and The Wyvernsmust face a battle that could cost them their lives.”The writing flowed smoothly and the story just grabbed me from the beginning.””I really, really, really, hope you plan on writing more about The Wyverns because you've hookedmy interest with all of these guys. Rogue is sexy beyond belief, and so hot I swear I needed a coldshower.””This was an exciting MC story. The characters felt real, and the writing was descriptive enoughfor you to visually imagine the story.”Lucinda lives in a small village in the English countryside, surrounded by rolling hills, cows andsheep. She started writing to fill time between jobs and is now firmly and unashamedlyaddicted.She loves the English weather, especially the rain, and adores a thunderstorm. She loves goodfood, warm company and a crackling fire. She's fascinated by the psychology of relationships,especially between men, and her stories contain some subtle (and some not so subtle) leaningstowards BDSM.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Erotica"
  ],
  "author": "L.M. Somerton",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/23612961-mantrap"
}