{
  "title": "Voices in the Ocean: A Journey into the Wild and Haunting World of Dolphins",
  "description": "While swimming off the coast of Maui, Susan Casey was surrounded by a pod of spinner dolphins. It was a profoundly transporting experience, and it inspired her to embark on a two-year global adventure to explore the nature of these remarkable beings and their complex relationship to humanity. Casey examines the career of the controversial John Lilly, the pioneer of modern dolphin studies whose work eventually led him down some very strange paths. She visits a community in Hawaii whose adherents believe dolphins are the key to spiritual enlightenment, travels to Ireland, where a dolphin named as “the world’s most loyal animal” has delighted tourists and locals for decades with his friendly antics, and consults with the world’s leading marine researchers, whose sense of wonder inspired by the dolphins they study increases the more they discover.Yet there is a dark side to our relationship with dolphins. They are the stars of a global multibillion-dollar captivity industry, whose money has fueled a sinister and lucrative trade in which dolphins are captured violently, then shipped and kept in brutal conditions. Casey’s investigation into this cruel underground takes her to the harrowing epicenter of the trade in the Solomon Islands, and to the Japanese town of Taiji, made famous by the Oscar-winning documentary The Cove, where she chronicles the annual slaughter and sale of dolphins in its narrow bay.Casey ends her narrative on the island of Crete, where millennia-old frescoes and artwork document the great Minoan civilization, a culture which lived in harmony with dolphins, and whose example shows the way to a more enlightened coexistence with the natural world.",
  "genres": [
    "Nonfiction",
    "Science",
    "Animals",
    "Nature",
    "Biology",
    "Audiobook",
    "Environment"
  ],
  "author": "Susan Casey",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/23615703-voices-in-the-ocean"
}