{
  "title": "Code Name Nanette: Behind Enemy Lines",
  "description": "\"I am Nanette. I break all the rules. During the war I was a spy for the British and helped save the world. I've kept my secrets for fifty years. But now I'm ready to talk.\"  *** \"A guilty pleasure.... The story-telling in this book is amazing.\" -Ingrid Hall  \"Exciting and soul-searching.\" -ABNA Review  ROYAL PALM LITERARY AWARD WINNER  The war gets personal. Their Gather intelligence behind enemy lines. Their Whatever it takes. At The future of the Free World. But the lines blur and the war heats up when Nanette and her spy partner, code name Regina, are forced to choose between their hearts and their duty.  Sexy, sassy, and thought-provoking. Joe Parker's search for his grandfather leads him to a former spy who worked with his grandmother in France during World War II. She still chain smokes, drinks her whisky straight, and loves telling sexy stories. He'll never see women, young or old, the same way again.  Inspired by real women who helped save the world. \"Code Name Nanette\" is a quirky, erotic, character-driven love story that honors the British and American female resistance fighters in France during World War II, who loved and fought behind enemy lines as intensely as their male counterparts, but whose names and achievements remain largely unheralded to this day. It opens a window into the hearts and the minds of women who take on new roles and risk everything for love, freedom, or just plain adventure. The result is more than a history lesson. It's a revealing and touching triumph of courage, love, and hope against all odds.  War always gets personal. Wars are not epic tales recounting the monumental achievements of larger-than-life heroes. They are bloody, devastating battles fought by discrete individuals who are swept up in the tides of history and forced to make personal life-a",
  "genres": [
    "Historical Fiction",
    "Historical"
  ],
  "author": "M.E. Dawson",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/23614090-code-name-nanette"
}