{
  "title": "Mad Heroes",
  "description": "Women's faces crawl across his floor and walls. He tore out his ceiling to spread headshots of Jefferson City’s most eligible females into the vacant apartment upstairs.Eligible, handsome, and a judge to boot, Justin is searching for a nice woman to settle down with and raise a family.Tonight, Justin sleeps peacefully for two reasons: he doesn’t know the smoke detectors have been ripped off the ceilings throughout his apartment block; and he doesn’t know that a quarter of the building is already on fire.When a mysterious woman wrapped in black gossamer splinters his doorway with a crowbar, it's love at first sight.And when a ceiling beam collapses on the mystery woman’s shoulder, the rescued must become the rescuer—a task complicated when, fleeing the burning building, Justin comes face to face with a threat more imposing than the conflagration: the Jefferson City paramedics.There is something you should know about Jefferson City: Governor John Locke says humanness exists along a Continuum. Adolescents capable of procreation experience more of the \"human condition\" than pre-pubescent boys.So they are more human.By the same logic, if you lose your hearing, or sight, or sense of humor ... you are less human.Consequently, Jefferson City is filled with non-humans. What’s more, it is run by a bunch of penny pinchers who keep expenses down by tossing non-humans into incineraries.Homeless, without recourse to a hospital bed, the mystery woman's whispers lead Justin to an oddly-enigmatic house.The heavy dressers, closets, and cabinets are empty. Frames ornament the walls and tabletops—all showing black space.And there are others eager to get their hands on the shrouded woman: why else is someone skulking below the windows at night, scratching the shutters with long fingernails?And why else has someone painted a long red stripe over the doorway? ... A stripe that looks uncomfortably like dried blood.Perhaps the most disturbing threat of all is the one laying on the living room couch: the victim herself who, as Justin unwraps her, is discovered to be wearing a series of thin masks.When the mysterious woman comes too, Justin is going to sit across from her and get to the bottom of this.His questions will be posed in the same tempered voice he uses behind the gavel at court: his purpose will be singular ... to determine whether he has at last unearthed the woman capable of spawning a son with perfect reason.One more thing: the blindfold he will wear during this interrogation will scare the hell out of her. But it is for her own good. Forced to stare into those wild blue eyes, Justin may catch the gleam of something horrifying, the kind of sudden insight that impels one to heave a person overhead, carry her to the window and cast her screaming to hell.Filled with mystery, breathtaking twists, and unforgettable characters, Mad Heroes is a dystopian thriller that explores the nascence of good and evil.",
  "genres": [],
  "author": "Kevin Garland",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/23621175-mad-heroes"
}