{
  "title": "Eye of the Storm",
  "description": "After all that they’ve been through, no one would deny that Hart and Drake deserve a happily-ever-after life together.  But, on the eve of their Christmas wedding, a threat long buried returns to threaten them. Not just their happiness, not only their lives, but everything they hold dear.  Separated and desperate to save each other, untangling a knot of mystery dating back to Hart’s Gram Rosa’s fight against the Nazis, and facing an enemy unlike any they’ve encountered before, both must search their hearts to find the strength to survive.  Meet the ER doctor who never quits…and the detective who will never give up on the love they share.  An unforgettable finale for an unforgettable couple who prove that two wounded souls have the power to save each other.  New to Hart & Drake? Their story begins in NERVES OF STEEL, the USA Today bestseller Sandra Brown called “the perfect blend of suspense and romance.”  Want to be the first to know when CJ has a new book out or a special readers’ offer? Text: “Follow CJLyonsReaders” (without the quotes) to 40404  Praise for CJ Lyons and her bestselling Thrillers with Heart: “Everything a great thriller should be—action packed, authentic, and intense.” —#1 New York Times bestselling author Lee Child  “Compelling…I love how the characters come alive on every page.” —New York Times bestselling author Jeffery Deaver  “A pulse-pounding adrenaline rush.”—Lisa Gardner, New York Times bestselling author  “The perfect blend of romance and suspense. My kind of read.”—Sandra Brown, #1 New York Times bestselling author  “A high-stakes adventure with dire consequences.”—Steve Berry, New York Times bestselling author  “Packed with adrenaline.”—David Morrell, New York Times bestselling author  “Tense, whip-smart medical scenes … gripping.”—Tess Gerritson, New York Times bestselling author  “Harrowing, emotional, action-packed and brilliantly realized … an irresistible read.”—Susan Wiggs, New York Times bestselling author  “Exciting … engrossing, intriguing.”—Heather Graham, New York Times bestselling author  “An adrenaline rush and an all-around great read.”—Allison Brennan, New York Times bestselling author  “Breathtakingly fast-paced.”—Publishers Weekly  \"Delves deep into the human soul.\" ~RT Book Reviews",
  "genres": [
    "Romantic Suspense",
    "Mystery",
    "Suspense"
  ],
  "author": "C.J. Lyons",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/23627077-eye-of-the-storm"
}