{
  "title": "The Lost Soul Trilogy",
  "description": "Primani: Where it all begins... Budding psychic Mica is a walking miracle. After surviving a brutal attack, she vows to live each day to the fullest. Little does she know her life is no longer hers to control. When Tall, Dark, and Annoying shows up to shadow her, she’s intrigued.Powerful and ruthless, Sean’s assigned to guard more than Mica’s body. Her future is at stake, and it’s his job to keep her on the right path. There are plans for her. Plans that’ll change everything she believes if she lives long enough to learn the truth. Guarding one human shouldn’t be this complicated, but Mica makes it anything but easy.Call the Lightning: The sizzle continues... After a disastrous raid leaves the team devastated, Mica and her Primani must get it together and get back to work. Evil doesn't grieve and the demon Dagin is upping the ante. In this second installment of the Primani series, the Primani are bombarded by shadowy enemies who threaten everything they know. When Mica is targeted, all hell breaks loose. Desperate to save her life, Killian pulls Mica into his private world of altars and blood. His intentions were honorable, but his blood awakens a destiny he thought long dead.When Killian takes over her training, Mica's mysterious powers evolve in a stunning new direction. Determined to learn control, she's unaware of the unseen eyes watching her every movement. But as the body count grows, she can't ignore the terrifying truth any longer.As the Primani struggle to destroy their personal demons, humans go about their business while a terrifying fate is hatching in the tunnels under their feet.Stone Angels: The riveting conclusion to Mica’s story... Mica’s got no options. Sean’s lost his mind. Violent and unstable, he’s teetering on the edge. Desperate to save him from falling, she risks everything she has, including Killian. How far will she go to pull him back? Every step moves her farther away from Killian’s plan. As they work together to save Sean and the rest of the world, she’s haunted by a sense of deja vu that leaves her feeling trapped between two worlds. Which future is the right one?3,000 years ago, Killian made a promise. Since then, he’s waited for fate to right the wrong that stole his life. The time has come for him to be free, but it’s never that easy. Knowing that Mica’s love is the only weapon against Sean’s demons, he sends her to rescue him. He trusts her completely, but can he trust Sean?His heart, her soul... Will the promises of angels heal them both?",
  "genres": [],
  "author": "Laurie Olerich",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/23626760-the-lost-soul-trilogy"
}