{
  "title": "Letters from Wolfgang Quella in the Village of Antioch",
  "description": "It all began with such humble beginnings. A young engaged girl from Creston saw a vision of an angel who told her that an elderly relative, Dee-Clare Selijah was with child. This caused her to look up an old relative, the wife of the deacon in Lincoln. Before long, she found out she too was pregnant. She gave birth to this child in a lowly basement, as there was no room for her to give birth upstairs.Some thirty years later, that child had grown up to be a man. The first thing this young man did was to visit his relative, the son of Dee-Clare Selijah. This second young man, Father Curtis, was preaching the need for confession. Upon the death of Father Curtis, the first young man, Brother Salvador took up his message. He went around Platte County, in Nebraska teaching that he came to proclaim liberty to captives and recovery of sight to the blind, to lead a life of example. He then went about living that example.He proclaimed liberty to captives, gave sight to the blind, healed many people, and taught by his example how we, his leadership are to lead. For this, he gave up his life. His body is missing. Come with me as I retrace the steps Brother Salvador took, and walk with me as I try to relearn just what it is he tried to teach. Also, help me as I try to discover just what happened to Brother Salvador.Molly Maguire McGill grew up near Philadelphia. She graduated from Kent State with a Bachelor-of-Arts where she He studied Community Counseling and Creative Writing. Her first book was Travels with Bother Retter. She also published via Kindle, Memoirs from the Journal of Will Kommen, Letters from Wolfgang Quelle in the Village of Antioch, and The Presidency of Sarah Palin. She is working on two romance novels, “Romance in New York,” and “A Sappy Piece of Crap.”Her mother named her after her Aunt, Molly McGuire. Organizations, to which her Aunt was an active member, included the Ancient Order of Hibernians, a non-violent order protecting the welfare of Irish Catholics, especially the clergy. Molly follows the advice of this widow. “Do not follow the ways of my sons. Their cause was just, their methods were not.” “You cannot use violence to fight manure; it just swishes around and ends up in your face.” Molly’s goal is to aid the Irish, and all people made in the image of Almighty God, socially and economically. Molly’s novels are in honor of Jesus who rescued her from the ravages of radical conservative ideology.",
  "genres": [],
  "author": "Molly Maguire McGill",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/11444236-letters-from-wolfgang-quella-in-the-village-of-antioch"
}