{
  "title": "The New Shame of the Cities",
  "description": "Liberal Democrats make their living by talking about how the policies of heartless Republicans oppress the poor and keep minorities down. But John Perrazo shows that the facts are otherwise. The vast majority of voiceless, powerless and poor people are concentrated in Detroit, Philadelphia, St. Louis, Chicago, Atlanta, and America’s other large urban centers. And all of them are run by Democrats and have been for 50 to 100 years. On the Democrats’ watch, these cities have become the equivalent of holding cells for the poor and minorities. Perrazo gives chapter and verse of the Democrats’ betrayal of our urban poor in The New Shame of the Cities. The title is an homage to muckraker Lincoln Steffens’ 1904 classic Shame of the Cities where he examined the inner workings of America’s great urban centers and found them swarming with graft and corruption orchestrated by Tammany Hall and the other political machines of the day. But as John Perazzo shows, over the last fifty years America’s urban centers have slid into a violence, corruption and savage dysfunction that make the snapshots of despair Steffens produced at the beginning of the 20th century seem mild by comparison. “Detroit, ruled by Democrats for nearly a half century, has hemorrhaged population, becoming a ghost town,” he writes, “as it has gone from being the automotive capital of America, producer of its dream machines, to the murder capital—according to Forbes magazine, the most dangerous city in the country.” About Baltimore, also governed by the Democratic Party for more than 50 years, the verdict is equally “As a result of widespread political corruption, a damaged economy, astronomically high taxes, and escalating crime rates, population fell by 120,000 just in the 1990s, making the city blacker and poorer. Tens of thousands of homes were simply abandoned by residents desperate to escape.” The verdict on Chicago is rendered by its new street nickname “Chiraq,” a reference to the killings that have become commonplace and know no holiday there were 45 shootings in the city on Easter weekend 2014 alone, six of the victims children.In The New Shame of the Cities, John Perrazo shows how Democratic Party policies have made America’s once great cities into the equivalent of reservations for blacks and other minorities who now, after two generations of immiseration, hope for only one thing—escape. This is why hundreds of thousands have fled these mad urban laboratories created by Democrats, leaving broken dreams and ghosts neighborhoods behind them.",
  "genres": [],
  "author": "John Perazzo",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/23621553-the-new-shame-of-the-cities"
}