{
  "title": "The Cyanide Canary: A True Story of Injustice",
  "description": "From Robert Dugoni, the #1 Kindle -bestselling author of MY SISTER’S GRAVE, and Environmental Protection Agency Special Agent Joseph Hilldorfer comes a true story of good and evil, greed and its consequences, and an elusive quest for justice…Early in the morning on August 27, 1996, twenty year old Scott Dominguez showed up for an ordinary day at the fertilizing plant where he worked. By 11:00am, he was clinging to life, unconscious and suffocating from toxic exposure to cyanide in a tank that was supposed to contain only mud and water. EPA Special Agent Joseph Hilldorfer was tasked with finding out what really happened on that horrific day in Soda Springs, Idaho, but the answers would not be easily uncovered. For more than four years Hilldorfer, his partner Bob Wojnicz, and a force of top-ranking U.S. attorneys struggled to expose the disturbing truths behind the tragedy, but would their efforts be enough to put the man responsible, Allan Elias, behind bars? Dugoni, a New York Times bestselling author known for his heart-pounding legal thrillers, and Hilldorfer, the agent who lived and breathed the Dominguez case, pen a compulsively readable work that is every bit as enthralling as fiction, yet is alarmingly true.***A Washington Post Best Book of the Year selection*** “The Cyanide Canary is a marvelously suspenseful tale...a bona fide thriller pitting joyous, decent good guys against a villain without a scintilla of redeeming social value. Who wins in this robust scenario? Read the book and find out.”The Washington Post “...As compelling as any brilliantly written murder mystery... A roller-coaster ride of a book.”New York Times bestselling author, Ann Rule“...An important book for anyone concerned about the world around them.”Former EPA Administrator, Christie Todd Whitman Kirkus STARRED Review: “...An electrically charged narrative... A top-notch nonfiction legal thriller.” Booklist STARRED Review: “An enthralling legal drama. This account engages the reader, evoking both outrage over worker safety and suspense over the outcome of the trial. The authors...tell a fully rounded, gripping story of how environmental crime is prosecuted in the real world.”",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Crime",
    "History",
    "Audiobook",
    "Mystery",
    "Science"
  ],
  "author": "Robert Dugoni",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/23632069-the-cyanide-canary"
}