{
  "title": "The Lincoln Lawyer Novels: The Lincoln Lawyer, The Brass Verdict, The Reversal",
  "description": "For the first time in one volume, the three novels that introduced the Lincoln Lawyer, Mickey Haller, who learns that \"There is no client as scary as an innocent man.\" The Lincoln LawyerFor Mickey Haller, the law is rarely about guilt or innocence, it's about negotiation and manipulation. When he gets hired by a Beverly Hills rich boy arrested for assault, Mickey sees a franchise case: a long, expensive trial with maximum billable hours-until it puts him face-to-face with pure evil and with a man who may truly be innocent. For a lawyer who has always gone for the easy score, getting justice means risking everything. The Brass VerdictWhen a former colleague is murdered, Mickey inherits his biggest case yet: defending a Hollywood producer accused of killing his wife and her lover. Haller scrambles to prepare for trial, and learns that the killer may be coming for him next. Enter LAPD Detective Harry Bosch, who will do whatever it takes to crack the case, including using Mickey as bait. As danger quickly mounts, these two loners realize that their only chance is to work together. The ReversalMickey is recruited to prosecute the high-profile retrial of Jason Jessup, a convicted child killer, exonerated after twenty-four years by new DNA evidence. Convinced Jessup is guilty, Haller brings in Harry Bosch as his investigator. With their key witness missing, and the odds and evidence against them, Bosch and Haller must nail a sadistic killer before he kills again. Together, these three exhilarating, fiercely paced novels show that \"Connelly is a master...once he has you on board, turning pages, you won't want to climb off\" (Boston Globe).",
  "genres": [
    "Mystery",
    "Fiction",
    "Legal Thriller",
    "Crime",
    "Suspense",
    "Thriller",
    "Audiobook"
  ],
  "author": "Michael    Connelly",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/11445565-the-lincoln-lawyer-novels"
}