{
  "title": "Mr. Parker Pyne, Detective",
  "description": "Agatha Christie's name is synonymous with brilliant deception, ingenious puzzles, and surprise denouements. The Queen of Crime.Curious? Then you're invited to read ... 'Parker Pyne Investigates'. Also known as, 'Mr. Parker Pyne, Detective'. Two titles, same great short stories. In fact 12 of them! Our detective's personal ad posed a simple question, 'Are you happy? If not, consult Mr. Parker Pyne'. The answer was a resounding 'I am not happy' for a jealous wife who suspects her husband of infidelity, for a lonely widow driven to assume a new identity, for a distraught mother whose son has been kidnapped, and for a strangely reclusive bride-to-be. But what sort of detective would solicit in the personal column? The sort who has a knack for investigating affairs of the heart. For therein lie the darkest motives for murder. And they are proving most lucrative for the hopelessly romantic, and highly suspicious Parker Pyne.The 12 stories are: 1. The Case of the Middle-Aged Wife, 2. The Case of the Discontented Soldier, 3. The Case of the Distressed Lady, 4. The Case of the Discontented Husband, 5. The Case of the City Clerk, 6. The Case of the Rich Woman, 7. Have You Got Everything You Want?, 8. The Gate of Bagdad, 9. The House at Shiraz, 10. The Pearl of Price, 11. Death on the Nile, and 12. The Oracle at Delphi. Librarian's note #1. the short story, Death on the Nile in this compilation starring Parker Pyne, should not be mistaken with the novel, Death on the Nile starring Hercule Poirot. Both by Christie.Librarian's note #2: there are two more Parker Pyne stories in other collections, 'The Regatta Mystery' and 'Problem at Pollensa Bay'.Librarian's note #3: this is the entry for the collection of 12 short stories, \"Parker Pyne Investigates' ('Mr. Parker Pyne, Detective'). Entries for each of the individual stories are located elsewhere on Goodreads. All 14 can be found by searching Goodreads for: 'a Parker Pyne Short Story'.",
  "genres": [
    "Mystery",
    "Fiction",
    "Short Stories",
    "Crime",
    "Classics",
    "Detective",
    "Mystery Thriller"
  ],
  "author": "Agatha Christie",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/2363314.Mr_Parker_Pyne_Detective"
}