{
  "title": "A Hard Place: A Sergeant's Tale",
  "description": "The story of combat in South Vietnam,Republic of, with the men of a small unit known as a Mobile Reaction or \"Mike Force\". Operating out of the Chu Lai base camp on the coast of South Vietnam,between Danang to the north and Cam Rhon Bay to the south. Home to the 23rd Infantry Division (Americal) the 75th Rangers and other support units. Their missions took place in the northern provinces, which were dubbed by the military as the 1st Combat Tactical Zone (1CTZ).From Rosemary's Point at Chu Lai, to Da Nang, to the Tuy Lon River and the White Mountains, across the Hai Van Pass to Phu Bai, Quang Tri City and on to the DMZ They were both recon and striker unit, sometimes just looking for intell, sometimes attacking and sometimes being attacked. Often deployed to reinforce a small camp or firebase. Sometimes workng as convoy security.Mostly it was just HOT! Life for them was either base camp boring, or \"boonie rat\" intense in full \"battle rattle\" sweat soaked, sneakin in the bush. Living on salt pills,nasty tasting water and even worse tasting rations.Often assigned missions to locate or capture specific targets. All of their missions were both classified and clandestine. Even their existence was denied. As much as possible their movements were hidden or camouflaged within larger unit operations and movements.Their operations were conducted with out back-up,or support readily available. They were required to move and survive on their bush skills, to adapt, over come, improvise, and if that failed, E&E (escape and evade) back to a pick-up or rendezvous point for extraction.This story is about serving in Vietnam as professional soldiers in a \"No Such Unit Exists\" status. Part of the \"other\" Army, the one not circumscribed by line unit regimentation, order of battle movement, or rules of engagement, in - South Vietnam, Republic of \"A HARD PLACE.\" .",
  "genres": [
    "War",
    "Military Fiction",
    "Thriller"
  ],
  "author": "Jacamo Peterson",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/2362997.A_Hard_Place"
}