{
  "title": "Third Girl from the Left",
  "description": "With Third Girl from the Left, Southgate brings her acute vision and emotional scope to a larger canvas. This enormously entertaining yet serious novel tells a story of African-American women struggling against all odds to express what lies deepest in their hearts. Like Michael Chabon’s The Amazing Adventures of Kavalier and Clay or E. L. Doctorow’s Ragtime, it ranges freely through time, fact, and fiction to weave an enthralling story about history and art and their place in the lives of three women. “My mother believed in the power of movies and the people in them to change a life, to change her life.” So explains Tamara, daughter of Angela, granddaughter of Mildred — the three women whose lives are portrayed in stunning detail in this ambitious novel spanning three generations of one family. Tulsa, Oklahoma, in 1970 is not a place a smart black girl wants to linger. For Angela, twenty years old and beautiful, the stifling conformity is unbearable. She heads to Los Angeles just as blaxploitation movies are pouring money into the studios and lands a few bit parts before an unplanned pregnancy derails her plans for stardom. For Mildred, movies have always been a blessed diversion in a life marked by the legacy of the 1921 Tulsa race riots. But after Angela leaves Tulsa following a bitter fight, the distance between them grows into a breach that remains for years. It falls to Tamara, a budding documentarian — raised in LA by Angela as though they have no family, no history — to help mother and grandmother confront all that has been silenced and left unsaid in their lives.A bold, beautifully written, and deeply involving novel, Third Girl from the Left deftly examines the pull of the movies, the power of desire, and the bonds of family in a quintessentially American story.",
  "genres": [
    "Fiction",
    "African American",
    "Historical Fiction",
    "Race",
    "LGBT",
    "Queer",
    "Literary Fiction"
  ],
  "author": "Martha Southgate",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/1144538.Third_Girl_from_the_Left"
}