{
  "title": "Looking at Forever",
  "description": "Mick Wheland, Ivory Tower's bad-boy guitarist, has recently realized two important things about himself. He prefers sex with men over women, and the idea of a committed relationship doesn't scare him as much as it once did. He's seen the positive effects of love from watching his band-mates find life partners, and now he's thinking he might be ready for the same himself. The problem is knowing where to look for Mr. Right, and living out of a suitcase while touring with a band is not exactly conducive to finding real love.Sonny (Rooster) Roostarelli leaves the seclusion of his Vancouver cabin, where he went to lick his wounds after a contentious divorce, and moves back to Los Angeles. He claims relocating to L.A. is for business purposes, but now that the dust has settled on his failed marriage, Rooster feels he might finally be ready to settle down – with a man.A chance encounter for Wheland and Rooster on a busy L.A. street rekindles an old friendship between the two professional musicians. Rooster needs a short-term place to stay and Wheland has plenty of extra space at his hillside estate and that lands Rooster in Wheland's guest room. What starts out as a music collaboration opportunity quickly turns personal when the chemistry they have becomes too strong to ignore and soon the music they're making spills from the studio and into the bedroom. The road is a grueling bitch musicians love to hate. Being on stage under the hot lights can sometimes be the only place they feel comfortable and alive. Can two high-profile rock stars make a life together in such an artificial world – on and off the stage... or will past mistakes and family secrets keep them from finding their forever?",
  "genres": [
    "M M Romance",
    "BDSM",
    "Romance",
    "Musicians",
    "Music",
    "Erotica",
    "Friends To Lovers"
  ],
  "author": "Ann Lister",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/23634811-looking-at-forever"
}