{
  "title": "Season of Miracles",
  "description": "In a classic contemporary romance from bestselling author Emilie Richards, a small town English teacher, certain the boy she loved seventeen years ago has forgotten her, learns that she couldn't be more wrong. The man returns, and he remembers her well.Elise Ramsey has made peace with her quiet life. She's a beloved high school English teacher in Miracle Springs, Florida, where the only genuine miracle is that nothing ever changes. Caring for a self-centered mother, Elise hasn't had time or inclination to change, either. Her one chance to break free came when her teenage lover, Sloane Tyson, begged her to leave town after their high school graduation. When she refused, Sloane never looked back.Now Elise's mother has died and the tie that bound her to the small town is severed. Before she can consider a different future, the past returns. Sloane moves back to town for one year, bringing Clay, the son he's only just discovered. Sloane and Clay need their own miracle, a chance to create the bonds between a father and son.Sloane has never forgiven Elise for not leaving with him all those years ago, and he plans to avoid her. But Elise proves to be the person most equipped to help Clay adjust to life outside the New Mexico commune where he was raised. She finds the boy a tutor, Amy Cargil, and between them, Amy and Elise help Clay find a place for himself in this very different world. By Christmas, that place is often at Amy's side.Despite himself Sloane finds that when Elise reaches out to his son, he wants to grasp her hand, as well. The passion two teenagers felt for each other never died, despite years and miles between them, but can Sloane, a perpetual loner and cynic, learn to trust the woman who once turned him away? And can Elise leave the cocoon she's spun for herself in the town of her birth?Christmas is a time for miracles in a town named for them. But can the holiday work its very real magic on four people caught up in its spell?",
  "genres": [
    "Romance"
  ],
  "author": "Emilie Richards",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/23637886-season-of-miracles"
}