{
  "title": "A Sailor's Story",
  "description": "\"No one, from Stephen Ambrose to Steven Spielberg, can tell a better story than A Sailor's Story.\" ― Max Brooks, author of World War Z\"What makes A Sailor's Story most compelling is its modest grace. It's not really a memoir of war, but of life aboard a floating town. Mr. Glanzman's stories are like those you'd hear from a favorite uncle, true tales about average men who were most concerned about beer, women and gambling, not life, death and the enemy.\" — The New York Times\"This flawlessly reproduced graphic novel will introduce a whole new generation of appreciative readers to one of the most talent artists and storytellers the Golden Age of comics ever produced. Very highly recommended.\" — The Midwest Book Review\"Sam Glanzman is one of the great storytellers of 20th-century comics.\"— A. V. ClubGolden Age comic book legend Sam Glanzman draws upon his own World War II experiences in this outstanding graphic novel. Hailed by Eisner Award–winning Astro City author Kurt Busiek as \"one of the most honest, dedicated and engaging cartoonists in comics history,\" Glanzman wrote and illustrated this intimate account of his life aboard a Navy destroyer, the USS Stevens. As legendary X-Men scribe Chris Claremont noted, this \"isn't a story of make-believe super-beings; these are real people, with real fears, being transformed by events and circumstances into men of courage.\" Back in print for the first time in more than twenty-five years, this new collection unites both A Sailor's Story and its sequel, A Sailor's Story: Winds, Dreams, and Dragons, plus a never-before-seen ten-page story of the USS Stevens, Even Dead Birds Have Wings. Exclusive Bonus Material:• New Foreword by bestselling author Max Brooks• New Introduction by original editor Larry Hama• New Afterword by Batman writer Chuck Dixon• Exclusive Glanzman tributes by Joe Kubert, Stan Lee, Denny O’Neil, Walt Simonson, Chris Claremont, Timothy Truman & many others",
  "genres": [
    "Comics",
    "Graphic Novels",
    "War",
    "History",
    "Comic Book"
  ],
  "author": "Sam Glanzman",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/23639243-a-sailor-s-story"
}