{
  "title": "حالة الاستثناء",
  "description": "هذا هو النصُّ الأول في العربيَّة للفيلسوف الإيطالي جورجو أغامبين. وحالة الاستثناء هو الجزء الأول من الكتابِ الثاني في رباعيَّة (الإنسان الحرام) التي تشتمل -حتى الآن- على سبعة مُجلَّدات كتبها أغامبين، بشكلٍ تدريجي غير مُنتظِمٍ، خلال فترة زمنيَّةٍ طويلة امتدَّت لعِقدين. يطرحُ الكتاب سؤالاً بسيطًا عبقريًّا؛ لمن السيادة وما هو مصدر الشرعيَّة في الدولة الحديثة؟ هل “للشعب”، مُمثَّلاً في سلطة التشريع عبر برلمانه المُنتخَبِ ديمقراطيًّا، أم لـ“صاحب السيادة/الحاكم/الدولة” مُمثَّلة في سلطتها التنفيذيَّة التي تملك تعليق القانون، حفاظًا عليه، في حالات الاستثناء/الطوارئ؟إشكاليَّة “السيادة في الدولة الحديثة” هي موضوع هذا الكتاب، وهي إشكاليَّة يناقشها أغامبين في إطار تجلِّيها العاري المُتمثِّل في حالة الاستثناء، مُتسائلاً عن العلاقة بين القانون والاستثناء، وإمكانية دسترة الاستثناء أو تقنينه في المنظومة القانونيَّة الليبراليَّة، وعن علاقة الإنسانِ الفرد بالدولة – أيضًا- حال غياب كل جدران الحماية القانونيَّة والحقوقيَّة التي يكفُلُها له “القانون” في الظروف العاديَّة.تقع دراسة أغامبين -إذن- على حدودِ التماسِّ بين “السياسي” و“القانوني” و“الحياة”؛ متتبِّعةً الأصول التاريخيَّة للنُّظم السياسيَّة والقانونيَّة الحديثة في القوانين الرومانيَّة القديمة، وقوانين الكنيسة الكاثوليكيَّة القروسطيَّة، وصولاً إلى لحظاتها النماذجيَّة الحديثة في التجربتين النازيَّة والفاشيَّة في ألمانيا وإيطاليا؛ كاشفًا عن السياقاتِ التاريخيَّة لدسترة حالة الاستثناء في تجاربِ الدول الديمقراطيَّة الغربيَّة كانجلترا وفرنسا وسويسرا والولايات المتحدة الأمريكية؛ مُحاوِلةً الإجابة عن السؤالِ الذي ظلَّ صداهُ يتردَّدُ طيلةَ التاريخ الغربي: ما السياسة، وما القانون؟أهم الفلاسفة ومُنظِّري السياسة والقانون الذين اعتمد عليهم أغامبين في دراسته هما الألمانيين كارل شميت ووالتر بنيامين، على تضادِّ موقفيهما الحادِّ من حالة الاستثناء، وتجربة النازيَّة التي عايشاها وأدت إلى إنتحار الثاني بعد رحلةِ فرارٍ طويلة من النازيين نتيجة لأصوله اليهودية. بينما كان شميت من كبار المُنظِّرين السياسيين والقانونيين للدولة النازية. مع اشتباكٍ واضح مع أفكار ميشيل فوكو عن \"السياسة الحيوية\" والعلاقة بين المعرفة والسلطةأما عن إمكانيَّات الاستفادة من أفكار أغامبين في تحليل أوضاعِنا العربيَّة فهي مُتعدِّدة؛ إذ يمكن دراسة حالة الحكم الإسرائيلي في الأراضي العربية المحتلة، وتجربة كرومر الطويلة في مصر، وتجارب الدول العربيَّة ما بعد الكولونياليَّة في الحكم حين استنسخت أدوات الحكم الكولونيالي الذي سبقها، وأسَّست شرعيتها على ادعاء الخلاصِ منه، كحالات استثناء كولونيالية أطول أجلاً -استمرت حالة الاستثناء النازيَّة 12 عامًا فقط- وأكثر تعقيدًا من مثيلاتها في الحالة الغربيَّة.",
  "genres": [
    "Philosophy",
    "Politics",
    "Nonfiction",
    "Theory",
    "History",
    "Law",
    "Sociology"
  ],
  "author": "Giorgio Agamben",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/23641179"
}