{
  "title": "My Highland Bride",
  "description": "Perfect for fans of the Highlander novels of Karen Marie Moning and Janet Chapman, Southern sass meets Highland heat in Maeve Greyson’s scintillating Highland Hearts romance.   With bedroom eyes and racetrack curves, Kenna Sinclair seems like just another pretty Kentucky girl. But she can also read minds, erase memories, and jump through time—a skill set that comes in handy when her matchmaking granny sends her back to thirteenth-century Scotland on the pretext of visiting her older sister. When she encounters the clan’s womanizing man-at-arms, Kenna instantly knows the gorgeous Highlander has only one thing on his mind. She vows to steer clear of him, but after a single electrifying touch, she finds that playing hard to get won’t be quite so easy. . . .   Bewitched by the first lass who could ever resist him, Colum Garrison will do anything to prove his devotion, even ask for Kenna’s hand in marriage—and swear off his chosen form of recreation until their wedding night. It’s a burden for a man of his thunderous appetite, but the sinful temptation is not his Colum’s fetching bride-to-be is practically trembling with anticipation for a moment that can’t come soon enough. When she’s willing, Colum will be ready and waiting—with a love that lasts a lifetime.Praise for My Highland Bride“My Highland Bride is an entertaining time-travel story packed with spice, humor, fantasy and nonstop adventure.”—Sandy Blair, USA Today bestselling author of The Laird“What a roller coaster of emotions throughout. I love, love, love the Sinclair sisters and can’t wait to read more about the twins. just yum!”—Cassidy Cayman, author of the Lost Highlander series “A captivating tale you won’t want to end, with the magic of time runners, sexy kilted men, and consuming love.”—Vonnie Davis, author of the Highlander’s Beloved series “Sensual . . . The quest for Colum and Kenna’s happiness propels the novel forward and will easily keep the reader’s attention.”—Publishers Weekly“The incongruity of Kenna’s modern-day language and behavior leads to plenty of laughs, while the serious content has emotional heft.”—Library JournalDon’t miss any of Maeve Greyson’s enticing Scottish The Highland Protector  SADIE’S HIGHLANDER | JOANNA’S HIGHLANDER | KATIE’S HIGHLANDERThe Highland Hearts  MY HIGHLAND LOVER | MY HIGHLAND BRIDE | MY TEMPTING HIGHLANDER | MY SEDUCTIVE HIGHLANDER Includes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "Time Travel",
    "Historical Romance",
    "Romance",
    "Historical",
    "Paranormal",
    "Historical Fiction",
    "Time Travel Romance"
  ],
  "author": "Maeve Greyson",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/23636546-my-highland-bride"
}