{
  "title": "Charlie",
  "description": "Have you ever faced the excruciating brutality of pure heartbreak; the kind that takes you and shakes you; rams its fist in your gut and its knife through your chest, relentlessly ripping at your soul with its unforgiving claws? It's an existence that ends each morning as you open your eyes, soaking in the light for that swift, fleeting moment before you realise that he's gone and all that's waiting is another bleak and endless day with nothing but pain and anger to get you through.  I have lived that once. I could not survive it twice.  I love him, he broke me and now he's back. Back in my bed and the heart that he shattered and I will do whatever it takes to keep it that way. I am what I've become; harder, stronger and fiercely determined. I am not the woman he knew before, but a product of the experiences that changed me forever, leaving their dark and indelible scars on my soul.  Charlie is mine and God help anyone that tries to get in my way.  Scarlett Everett is determined that one day Charlie will return the chest-crushing love that she harbours for him. She lives for him; breathes for him and is prepared to take down anyone that stands in the way of their future- including family.  Beautiful and smart, cunning and manipulative, Scarlett is used to winning battles in business; but this is personal. This is war.  Roman returns with an unexpected guest and Tyler’s star continues to rise. As Lucas settles into life with Jess, they are unprepared for the chaos about to be unleashed.  Trust is thrown into doubt and loyalties tested to their limits as the charismatic playboy of the Hunter family is caught between the women that dominate his life. The one he wants but can’t have; and the one addicting his body with her sinful brand of sexuality that suffocates his senses.  Prepare for the battle of the bitches. This is Charlie’s story.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "BDSM"
  ],
  "author": "L.J. Dee",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/23637316-charlie"
}