{
  "title": "The Crossing",
  "description": "Tammy continued to work through her 30th week of pregnancy; then she spent the next 6 weeks in bed. It was an extremely difficult delivery, and the baby, a boy, lived for only two days. According to the doctor, the baby was born with a serious heart defect, which could not have been prevented. He assured Tammy that her work, activities and personal care had nothing to do with the death of the baby – she didn’t believe him. Neither did Sonny.That was the end for Tammy and Sonny. They never forgave themselves and they never forgave each other.Tammy’s job at Alton Box was gone and now she needed something to keep herself busy and away from Sonny. Her brother, Richie, told her that ‘Skeeter’s’ in Jackson was looking for some inside and outside waitresses, and Tammy couldn’t get there fast enough to complete an application. ‘Skeeter’s’ is a restaurant similar to Chiefs, except they don’t offer rooms or cabins for rent. They do offer inside dining, a bar and outside curb service – just like Chiefs. What they offered Tammy was a way to get away from Sonny, Humboldt and the bad memories. What it also offered was an opportunity to meet other people, lots of people. For Tammy, it was also a chance to meet other men, and she did a lot of that.It was two days before anyone reported Tammy missing. Sunday and Monday were her days off and she always spent Monday visiting with her parents. When she missed her Monday visit, her father, Thomas Whitmore, called her house all day – no answer. He finally reached Sonny that afternoon, and Sonny told him that she had changed her work schedule and was working. Her father didn’t accept that answer, and Mr. Whitmore called the sheriff’s office to report Tammy as missing. The sheriff’s office collected information and made the usual and necessary calls. However, when she didn’t report for her shift at ‘Skeeter’s’ on Tuesday, her boss called her father to inquire about her absence. That’s when her father learned Tammy had definitely not worked on Monday, and in fact, had not worked since the previous Saturday.Tammy had not been seen by anyone since finishing her shift at ‘Skeeter’s’ at 1:00 AM Saturday night; however, it didn’t take long for the sheriff, Leroy Epsee, and his deputies to find Tammy.Crossing Rexall Drug Store, owned by Dr. Parker Williams and Dr. Whitley Johnson, is just around the corner from ‘Blue’s Pool Room’. ‘Blue’s Pool Room’ is a popular hangout for many of the residents of the ‘Crossing’, and many of the male colored citizens of Humboldt grew up inside the walls of ‘Blue’s Pool Room’. While the poolroom and the drug store don’t have much in common, they do share a trash dumpster located in the alley area behind both businesses. It was here where they found Tammy.Jack Cooley, better known as ‘Jack the Rack’, worked at ‘Blue’s Pool Room’ as a rack boy and ‘step and fetch-it’ for most of the patrons. It was his weekly responsibility to make sure all the trash was placed in the alley garbage dumpster for Tuesday’s collection day. Behind the dumpster, among all the discarded boxes and trash, is where he found Tammy Blurton. She was naked, except for an extremely bloodstained, short sleeve, blue work shirt with ‘Henry’ on the red name label above the left pocket. Tammy had been beaten, strangled, stabbed and presumably raped. It would be four days before the coroner could determine the exact cause of death.Leroy’s crime scene investigators did a good job and eventually located a large knife among the scattered trash bags. It was an eight- inch, butcher-type knife and had what appeared to be bloodstains on the blade. They also found a small slip of paper in the pocket of the shirt Tammy was wearing; it contained a name and phone number.Henry Walker SUnset 4 – 2031.",
  "genres": [],
  "author": "Gerald W. Darnell",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/23637279-the-crossing"
}