{
  "title": "The House at Midnight",
  "description": "On an icy winter weekend, seven friends celebrate New Year's Eve at Stoneborough, a grand manor in the English countryside. They've been brought together by Lucas Heathfield, a young man who recently inherited the property after the tragic death of his uncle Patrick. Though still raw from the loss of his last family member, Lucas welcomes this tight-knit group of friends to the estate he hopes will become their home away from home-an escape from London where they can all relax and rekindle the revelry of their college days. Lucas's best friend, Joanna, finds herself oddly affected by the cavernous manse, with its lavish mythological ceiling mural and sprawling grounds, and awakened to a growing bond with Lucas. Much to her surprise, he reveals that he's loved her for years. But as they begin to find their way from friendship to romance, Joanna can't shake the feeling that the house is having its own effect on them. Back in London, Joanna is stunned when Lucas announces that he and their impetuous friend Danny are moving into Stoneborough full-time. Her concern seems justified as Lucas, once ensconced, becomes completely ensnared in the turbulent past that seems to haunt the house - a past that is captured in old movie reels featuring Lucas's now-dead family: his charismatic uncle Patrick, his lovely mother, Claire, and his golden-boy father, Justin. Over one decadent, dramatic year, as the friends frequently gather at the shadowed residence, secrets slide out and sexual tensions escalate, shattering friendships and forever changing lives. And all the while, the house cradles a devastating secret. By turns taut and sensual, mesmerizing and disturbing, The House at Midnight is a gripping psychological novel that pulls the reader into the thrall of its ominous atmosphere. Newcomer Lucie Whitehouse has written a tense and captivating story that will linger long after the final, shocking pages.",
  "genres": [
    "Fiction",
    "Mystery",
    "Gothic",
    "Thriller",
    "Suspense",
    "Mystery Thriller",
    "Horror"
  ],
  "author": "Lucie Whitehouse",
  "average_rating": "3.16",
  "url": "https://www.goodreads.com/book/show/2363802.The_House_at_Midnight"
}