{
  "title": "Atlantis Glacial Tides",
  "description": "Atlantis Glacial TidesLost Daughters of Atlantis Book 5When a girl was wrong about a guy before…No one trusts Princess Adria. Not even her beloved big brother. Disgraced and discouraged after saving Kai who turned out to be the enemy, she’s still shocked when she finds out about her betrothal to a slimy prince from another ocean kingdom. But what does she know? Clearly, she can’t choose the right kind of male on her own.When she’s kidnapped by accident, she realizes she has no choices at all. Or does she?Adria finds herself back in the clutches of Kai, the guy she’d given her heart to and who’d then betrayed her and her family. Stuck as a prisoner in a glacial kingdom of ice and evil, she learns everything isn’t rainbow fish and roses. She must become a strong, independent princess who commands respect and is willing to sacrifice to save her family. But by sacrificing herself is she giving away the kingdom she loves?This is the fifth full-length novel in the Lost Daughters of Atlantis young adult fantasy action adventure novel series. The prequel to this story, Atlantis Twisting Tides, is free. Each of the books stands alone. “In this chilling addition to the Daughters of Atlantis series, Allie Burton plunges us into the freezing waters of despair and slavery in Atlantis Glacial Tides. Get ready for her quick wit, her fast-paced style and her attention to detail in each scene, while still giving us the feel of a sixteen-year-old girl, out of her depth, but never backing down or giving up. Ms. Burton can create nasty and nice characters as well as she can keep us wondering who is really playing on what side of good vs evil. From start to finish, this is non-stop fantasy! You may need an extra blanket to cozy up with as those frigid waters begin to feel real.” ReviewerOther books in the Atlantis series: Atlantis Riptide - free, Atlantis Red Tide, Atlantis Rising Tide, Atlantis Tide Breaker Novella, Atlantis Dark Tides, Atlantis Twisting Tides Novella",
  "genres": [
    "Fantasy"
  ],
  "author": "Allie Burton",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/23644071-atlantis-glacial-tides"
}