{
  "title": "The Conviction",
  "description": "In this exhilarating legal thriller from Robert Dugoni, the #1 Kindle bestselling author of MY SISTER'S GRAVE, attorney David Sloane must take the law into his own hands to save his son from a corrupt juvenile detention center.  As David Sloane continues to piece his life back together in the wake of his wife's vicious murder, he also struggles to handle his difficult teenage son, Jake. Reeling from the loss of his mother, Jake's bad behavior escalates and his relationship with Sloane is pushed to the brink. When Sloane's old friend, Detective Tom Molia, recruits Sloane and Jake to join him and his son on a camping trip, Sloane sees the trip as an opportunity to repair their broken father/son bond.  But the trip takes a distressing turn when the boys are arrested for vandalism in the middle of the night and the local judge, Earl Boykin, hastily sentences them to the \"Fresh Start\" detention program in the middle of the wilderness. Jake soon realizes the facility has little interest in rehabilitating wayward youths, beginning what will prove to be a grueling ordeal.  Sloane's legal expertise is rendered useless in overturning the boys' conviction, as he discovers that Judge Boykin's power reaches far beyond the courtroom. Finding their legal options limited and their sons in mounting danger, Sloane and Molia will stop at nothing to rescue their boys...the law--and their own safety--be damned.  New York Times bestselling author Robert Dugoni is in top form in this riveting tale of risk and redemption.   \"Dugoni is a superb storyteller, and his courtroom drama shines.\"--The Boston Globe  \"Dugoni is knocking on the A-list legal-thriller door and can be expected to gain entrance sooner rather than later.\"--Booklist STARRED Review  \"Serves up the perfect mix of action, emotion and courtroom drama, so much so that THE CONVICTION isn't just the best legal thriller of the year, it's one of the best thrillers period.\"--Author Magazine.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Legal Thriller",
    "Crime",
    "Audiobook",
    "Suspense"
  ],
  "author": "Robert Dugoni",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/23654264-the-conviction"
}