{
  "title": "Tales from the Archives, Volume 1: The Official Ministry of Peculiar Occurrences Anthology",
  "description": "The Ministry of Peculiar Occurrences has many forgotten stories in its Archives. Stories of madcap adventures in all corners of the Empire, dark doings in hidden places, and mysterious devices and artifacts that the everyday citizen should never become aware of for fear it would quite undo their minds.Archivist to the Ministry, Eliza D Braun (recently and unwillingly reassigned to the Archives) and Wellington Thornhill Books (recently and unwillingly assigned Eliza D. Braun) have selected some cases they feel the public is ready for.The Evil that Befell Sampson by Pip Ballantine- Eliza D Braun is a young field agent in the Ministry of Peculiar Occurrences (South Pacific Branch) when she is asked by New Zealand’s preeminent suffragist to investigate some strange goings within the organisation. She cannot possibly imagination that this little case will alter her entire life and thrust her into a world barely prepared for her.Dust on the Davenport by O M Grey – Agent Simon R. Boswell, still considered the green agent of the Ministry, takes on his own a supposed haunting in Islington. Hauntings tend to be nothing too serious for agents specializing in the unexplained; but for Simon, this case supplies surprises of all kinds, around every corner…The Astonishing Amulet of Amenartas by Nathan Lowell- Agent Heathcliff Durham finds himself crisscrossing Africa, looking for an Amulet that could spell disaster for any who come near it. Battling blistering heat, starvation, wild animals, and despair, he is not comforted by the company of a rough and ready sort named Morrison. Soon Durham begins to suspect he may never return home—and to top it all off the tea has almost run out.A Ruby in Rain by Grant Stone – From the farthest edge of the Empire, New Zealand agents Lachlan King and Barry Ferguson are called to interview a recent arrival to Auckland’s prisons. An infamous gambler, according to the constable’s account, has turned himself into their custody, not for the safety of society but for his own. The Ministry steps in to uncover a man’s story of impressive luck, and more incredible vision.",
  "genres": [
    "Steampunk",
    "Short Stories",
    "Science Fiction",
    "Mystery",
    "Anthologies",
    "Paranormal",
    "Speculative Fiction"
  ],
  "author": "Pip Ballantine",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/11447590-tales-from-the-archives-volume-1"
}