{
  "title": "Offensive Strategies",
  "description": "Ghost Wing Chronicles – Offensive Strategies, is book number 1 in what is expected to be a series of 5 books, though each book can be read as a standalone, as they are individual mission threads. The book is a first in a number of ways. Firstly it is based around a highly Covert Special Forces Unit out of India. Most books in this genre are about Special Forces out of the US, such as the SEAL Teams or Delta or SAS if UK based. Secondly, the author has not focused solely on one Special Forces Unit from India, such as either the Para Commandos / MARCOS / GARUD Commando Force / NSG instead the covert unit – OS Wing, has the best of the best from each of these Indian Special Forces. Whilst one expects the book to be conventional in its treatment of characters in this genre, the author surprises in that, he succeeds in bringing out a very human facet of every team member. The witty conversations, the barbing between the team mates, make it very easy to like these characters. It is incredibly fast paced; and once you get into the book, there are instances that will shock you, disgust you and make you smile, all the while rooting for these brave souls. Even though it is contemporary military fiction, the author has brilliantly blended fiction with scary reality at many levels which at times is difficult to separate. This first book definitely makes it’s presence felt with a good storyline and excellent tactical execution. With time running out and operating on minimal intelligence, which is unusual for this team – Will OS Wing be able to prevent India’s Biggest Nuclear Tragedy? Will one of their team members loose everything he holds dear as a result of his service to the Nation? Lovers of Military Fiction looking for something different should most definitely give this one a try! PS: Whilst the book is in English , it does use a few different languages in some places for authenticity , translations for which have been provided in the Glossary at the back and don’t miss a sneak peak at the next book in the Epilogue. Checkout www.jaihindauthor.com for more details.",
  "genres": [],
  "author": "Jai Hind",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/23645652-offensive-strategies"
}