{
  "title": "The Fifth Magic",
  "description": "The stars have gone…Long dormant relics bask in the light of a hundred comets, restoring magics of a previous age. Objects inert for eons become dangers and tools no one can ignore. The use of these artifacts will put everything at risk; all the while providing the greatest opportunity for human advancement in history. No matter what happens to the people of Godsland, the dragons have plans of their own.The Fifth Magic is Book Seven of the Godsland SeriesThe World of Godsland Epic Fantasy Series includes the following fairy tales & folklore The Dawning of Power trilogyCall of the HeraldInherited DangerDragon OreThe Balance of Power trilogyRegentFeralRegalThe Artifacts of Power trilogyThe Fifth MagicDragonholdThe Seventh MagicDragons of Dawn prequel trilogyAscensionOninDragon AirwaysKnown for his terrible dragon jokes on social media, Brian Rathbone brought some of that same brand of humor to an otherwise serious fantasy adventure with magic, gods & goddesses, and intrigue. Rathbone's experience as a professional horse trainer also comes into play as he explores relationships with creatures with whom you can't fully communicate and whose desires only sometimes align with their companions. A love of reading the best epic fantasy books as a young man inspired Brian to write the kinds of for boys and for girls that he liked reading in his young adult years. Getting older never dampened Rathbone's enthusiasm for a good epic fantasy adventure, and his books are widely enjoyed by readers young, old, and those somewhere in between.In the two other prequels to The World of Godsland Epic Fantasy Series, Brian Rathbone teamed up with writers Jack McCarthy and Morgen Rich to flesh out story lines that were not fully told in the main series. The collaboration between these writers resulted in three new entry points into Godsland ranging from dark fantasy to fantasy romance and contemporary steampunk adventure with dragons and other monsters.Ascension focuses on the story of Gwendolin and her journey from simple farm girl to the leader of a powerful order of monks and druids. Along her metaphysical journey, she learns a great deal about her world and herself--some magic must come from within.Onin explores the history of Onin of the Old Guard and and his dragon, Jehregard. In a world where dragons are bred for size, Onin finds himself standing in opposition to thousands of years of dogma and tradition, as he fights for the life of a dragon no one else would save. There is something different about this dragon--something special. Bearing a \"watch eye\", like that of a prized horse, Jehregard does everything he can to prove Onin both right and wrong.Dragon Airways explores a time when magic is a thing of the distant past and technology has come to dominance in its place. In a steampunk, dieselpunk, dragonpunk twist, Dragon Airways shows what happens when a group of misfits put their mind to something. The feral dragons and those who seek to dominate them, have other plans. Airplanes, airships, and battle balloons are no match for dragons and magic, and Emmet knows just how to solve the mystery of where to find them.These books are suitable for fans of epic fantasy, young adult epic fantasy, steampunk, and paranormal adventures. While the content appeals to older readers, its kept clean to make it accessible to younger readers as well.",
  "genres": [
    "Fantasy",
    "Dragons",
    "Audiobook"
  ],
  "author": "Brian Rathbone",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/23644368-the-fifth-magic"
}