{
  "title": "Dancing the Digital Tune: The 5 Principles of Competing in a Digital World",
  "description": "In a rapidly evolving and connected digital world, traditional digital engagement models will be inadequate for future success. We need an approach that orients our organizations to the new connected world. The 5 actionable frameworks in this book will help us align our digital strategy with the customer.This book is about partnership with customers, about connecting with them on multiple levels, about crafting uniqueness, about leveraging the transformation this connected world is going through, and as a result, about staying ahead of the pack.Learn why and how we * Not leave to chance what customers need to build context* Unify emotional appeal with physical interactions* Be un-commoditized* Not act as the proverbial 5 blind men while engaging with customers* Look beyond and create a chain of linksThe 5 principles represent a trophy. Those who will rise above the pack in today's connected world will win.For the first time, an overarching and systematic process has been presented to think about customer engagement. The five principles in this book will provide a validating structure for your existing strategies. The unique perspective that the 5 principles provide will help us connect our digital strategy with broader organizational goals, industry dynamics and above all, with our customers.1. The Principle of External ReinforcementHow should we be the customers' advocate and trusted advisor, so they make a decision \"with\" us instead of \"about\" us? Be our customers' reference point and one of the centers of their universe. If they have to look beyond us for validation, we've lost the advantage and submitted ourselves to an unforced error from our competitor. How can we embed ourselves in their decision process - explicitly or implicitly - and help them along this journey?2. The Principle of the Customer Interaction CycleIt's a fact. Some products are high touch, some are not. Some connect at the emotional level, some at the physical interaction level, and some at both. Both engagement models peg us in our customer's mind - that peg is called our brand. But our competition is not keeping still. They are constantly trying to de-throne us through direct or flank attacks. Hence, understanding how to create relationships from both ends of the engagement spectrum is the key to success.3. The Principle of Un-CommoditizationOur fundamental philosophy, our passion, our excellence, these are all factors that go towards differentiating ourselves. The term \"differentiation\" however has become an overused technical term that seems to distance our operations from our strategy. Instead I chose to use the word un-commoditization to reflect the harsh realities of today's connected world. This principle provides the elements of how to think about breaking away from the pack. Un-commoditization is always possible and is critical to securing a position in our customer's mind. Without a distinctive position in the customer's mind, we might as well save our brand marketing budget.4. The Principle of PresentingWho are you? If you are like most companies, your customers can potentially use more than one of your products or services. Are you presenting them in silos, or creating harmony between them? The principle of Presenting is aimed at helping us become the singular brand powerhouse that we should be, striving to meet customer needs.5. The Principle of CompletionIt's obvious that our products meet a customer need. But our customers also use products which have nothing to do with us. Many of these needs are linked to each other. This principle is about the art of alliances, building a set of offerings that span the spectrum of customers' needs. The alliances we choose will define us in the future. Those who are isolated will be left behind.",
  "genres": [
    "Business",
    "Nonfiction"
  ],
  "author": "Manish Grover",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/23646949-dancing-the-digital-tune"
}