{
  "title": "Darkness the Color of Snow",
  "description": "A haunting, suspenseful, and dazzlingly written novel of secrets, corruption, tragedy, and vengeance from the author of Crazy Heart—the basis for the 2009 Academy Award-winning film. An electrifying crime drama and psychological thriller in which a young cop becomes the fulcrum of a community's grief and rage in the aftermath of a tragic accident.\"What happened is what happened, and the effects of it rippled out continuously. How could you stop the rippling of water?\"Out on a rural highway on a freezing night, Patrolman Ronny Forbert sits in his ten-year-old Crown Victoria cruiser trying to keep warm and make time pass until his shift ends. Then a familiar beater Jeep Cherokee comes speeding over a hill, forcing the rookie cop to chase after it. The driver is his old-friend-turned-nemesis, Matt Laferiere, the rogue son of a man as beaten down as the town itself.Within minutes, what begins as a clear-cut arrest for drunk driving spirals into a heated struggle between two young men with a troubled past and ends in a fatal hit and run on an icy stretch of blacktop. The only witnesses are Officer Forbert and Laferiere's three drinking buddies inside the Jeep.As the news spreads around Lydell, a small upstate burg near the state line, Police Chief Gordy Hawkins is certain that Ronny Forbert followed the rules, at least most of them, and he's willing to stand by the young cop. Finding the driver of the car that hit Laferiere, the judicious police chief tries to keep the situation from escalating dangerously out of control. But in a town like Lydell, where jobs are scarce and everyone is hurting, a few people—some manipulative, some just plain greedy—see opportunity in the tragedy.Over the course of six days, as uneasy relationships, dark secrets, damning lies, and old grievances reveal themselves, the people of this small, tightly woven community decide that a crime must have been committed, and that someone—Officer Ronny Forbert—must pay a price, a decision that will hold devastating consequences for them all.Evocative, atmospheric, and powerful, Darkness the Color of Snow is a portrait of decency and desperation, ambition and pragmatism, heated passion and cool calculation—of ordinary American lives.",
  "genres": [
    "Fiction",
    "Mystery",
    "Crime",
    "Thriller",
    "Audiobook",
    "American Fiction",
    "Mystery Thriller"
  ],
  "author": "Thomas Cobb",
  "average_rating": "3.24",
  "url": "https://www.goodreads.com/book/show/23644802-darkness-the-color-of-snow"
}