{
  "title": "The Greatest Knight: The Remarkable Life of William Marshal, The Power Behind Five English Thrones",
  "description": "A renowned scholar brings to life medieval England’s most celebrated knight, William Marshal—providing an unprecedented and intimate view of this age and the legendary warrior class that shaped it.Caught on the wrong side of an English civil war and condemned by his father to the gallows at age five, William Marshal defied all odds to become one of England’s most celebrated knights. Thomas Asbridge’s rousing narrative chronicles William’s rise, using his life as a prism to view the origins, experiences, and influence of the knight in British history.In William’s day, the brutish realities of war and politics collided with romanticized myths about an Arthurian “golden age,” giving rise to a new chivalric ideal. Asbridge details the training rituals, weaponry, and battle tactics of knighthood, and explores the codes of chivalry and courtliness that shaped their daily lives. These skills were essential to survive one of the most turbulent periods in English history—an era of striking transformation, as the West emerged from the Dark Ages.A leading retainer of five English kings, Marshal served the great figures of this age, from Queen Eleanor of Aquitaine to Richard the Lionheart and his infamous brother John, and was involved in some of the most critical phases of medieval history, from the Magna Carta to the survival of the Angevin/Plantagenet dynasty. Asbridge introduces this storied knight to modern readers and places him firmly in the context of the majesty, passion, and bloody intrigue of the Middle Ages.The Greatest Knight features 16 pages of black-and-white and color illustrations.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Medieval",
    "Medieval History",
    "Historical",
    "British Literature"
  ],
  "author": "Thomas Asbridge",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/23653856-the-greatest-knight"
}