{
  "title": "The Early Cases of Akechi Kogoro",
  "description": "Akechi Kogoro, detective extraordinaire. In Japan, this is a name that fires the hearts and imaginations of readers young at heart. Cool and sophisticated, Akechi moves effortlessly through the world of Japan in the golden era between the wars, defeating masterminds and saving the day. He has been the hero of Japanese children for generations, and starred in a host of movies.The stories in this volume predate all of that; his secret origin, if you will. Readers familiar with the exploits of the great detective Akechi Kogoro might have some difficulty recognizing the impeccably dressed and universally respected man of action in the amateur detective, an eccentric twenty-something of little means with disheveled hair and a shabby kimono. The Akechi who appears in this volume is a hobbyist in crime whose identity is not yet fixed either in the eyes of the reading public or in the mind of his creator. Supporting characters such as Akechi's wife and his young assistant have not yet been introduced, and the first confrontation between the great detective and the Fiend with Twenty Faces is still a decade away.Rampo initially conceived of Akechi Kogoro only as a protagonist for 'The Case of the Murder on D___ Hill,' never intending to make further use of the character, but the positive reactions of Rampo's friends and colleagues prompted him to make Akechi a recurring protagonist in his detective fiction. The first five Akechi mysteries, 'The Case of the Murder on D___ Hill,' 'The Psychological Test,' 'The Black Hand Gang,' 'The Ghost,' and 'The Stalker in the Attic,' were all published in the first half of 1925 as part of Rampo's first serial for Shin-Seinen magazine.And now they are available in English as well, to delight a new audience!Includes:The Case of the Murder on D Hill 「D坂の殺人事件」The Black Hand Gang 「黒手組」The Ghost 「幽霊」The Dwarf 「一寸法師」",
  "genres": [
    "Mystery",
    "Japanese Literature",
    "Japan",
    "Classics",
    "Fiction",
    "Crime",
    "Short Stories"
  ],
  "author": "Edogawa Rampo",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/23650209-the-early-cases-of-akechi-kogoro"
}