{
  "title": "Seaside Whispers",
  "description": "Seaside Summers is a series of stand-alone romances that may also be enjoyed as part of the larger Love in Bloom series.  Fall in love with Matt Lacroux in Seaside Whispers. SEASIDE SUMMERS is the newest addition to the LOVE IN BLOOM series, featuring a group of fun, sexy, and emotional friends who gather each summer at their Cape Cod cottages. They're funny, flawed, and will have you begging to enter their circle of friends.  Having a mad crush on her boss’s son, Matt Lacroux—an intriguing mix of proper gentleman and flirtatious bad boy—is probably not the smartest idea for single mother Mira Savage. Especially when the company, and her job, is already on shaky ground. But as a Princeton professor, Matt’s life is hours away from Mira’s home on Cape Cod, keeping him safely in the fantasy-only zone. And as a single mother to six-year-old Hagen, with a floundering company to save, fantasies are all she has time for.  With hopes of becoming dean off the table, and too many months of longing for a woman who lived too far away to pursue, Matt’s publishing contract couldn’t have come at a better time. He heads home to Cape Cod on a brief sabbatical, intent on starting his book, and finally getting his arms around sweet, seductive Mira. A surprise encounter leads to white-hot passions and midnight confessions. The more time Matt and Mira spend together, the deeper their relationship grows, and the love and attention Matt showers on Hagen is more than she has ever dreamed of. But Matt’s sabbatical is only temporary, and Mira’s not saving his father’s company so she can leave it behind. Will their whispers of love be enough for one of them to change their life forever? \"You can always rely on Melissa Foster to deliver a story that's fresh, emotional and entertaining. Make sure you have all night, because once you start you won't want to stop reading. Every book's a winner!\" New York Times Bestselling Author Brenda Novak  \"Melissa Foster is synonymous with sexy, swoony, heartfelt romance!\" New York Times Bestseller Lauren Blakely  \"With her wonderful characters and resonating emotions, Melissa Foster is a must-read author!\" New York Times Bestseller Julie Kenner  \"Like Nora Roberts, Melissa Foster has captivated me with her fantastic, sexy, romantic stories.\" K. Winning  *** WANT MORE SEASIDE SUMMERS? All Seaside books can be read as stand-alone novels or as part of the series: . SEASIDE SUMMERS Seaside Dreams (Bella) Seaside Hearts (Jenna) Seaside Sunsets (Jamie) Seaside Secrets (Amy) Seaside Nights (Sky) Seaside Embrace (Hunter) Seaside Lovers (Grayson) Seaside Whispers (Matt) *** Seaside Summers is part of the Love in Bloom big family romance collection. Characters from each sub-series appear in future books. Read the complete Love in Bloom series: Visit Melissa's website for LOVE IN BLOOM family trees, series checklists, and more.  SNOW SISTERS Sisters in Love Sisters in Bloom Sisters in White . THE BRADENS (Weston, CO) Lovers at Heart (Treat & Max) Destined for Love (Rex & Jade) Friendship on Fire (Josh & Riley) Sea of Love (Dane & Lacy) Bursting with Love (Savannah & Jack) Hearts at Play (Hugh & Bree)  THE BRADENS (Trusty, CO) Taken by Love (Luke) Fated for Love (Wes) Romancing My Love (Pierce) Flirting with Love (Ross) Dreaming of Love (Emily) Crashing into Love (Jake) . THE BRADEN WORLD NOVELLAS Promise My Love (Rex & Jade's Wedding Novella) **Best if read after Weston & Trusty Bradens** Daring Her Love . THE REMINGTONS Game of Love (Dex) Stroke of Love (Sage) Flames of Love (Siena) Slope of Love (Rush) Read, Write, Love (Kurt) . THE BRADENS (Peaceful Harbor, MD) Healed by Love (Nate) Surrender My Love (Cole) River of Love (Sam) Crushing on Love (Shannon) Whisper of Love (Tempest) Thrill of Love (Ty) . AUTHOR BIO Melissa Foster is a New York Times & USA Today bestselling and award-winning author. She writes sexy and heartwarming contemporary romance, new adult romance, and women's fiction with emotionally compelling characters that stay with you long after you turn the last page. Melissa's emotional journeys are lovingly erotic and always family oriented. Melissa loves to chat with book clubs and readers, invite her to your next event.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Family",
    "Professors"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/23655979-seaside-whispers"
}