{
  "title": "Seaside Embrace",
  "description": "You can always rely on Melissa Foster to deliver a story that's fresh, emotional and entertaining. Make sure you have all night, because once you start you won't want to stop reading. Every book's a winner!\" --New York Times Bestselling Author Brenda Novak \"Like Nora Roberts, Melissa Foster has captivated me with her fantastic, sexy, romantic stories.\" --Kimberly Winning, avid reader. IN SEASIDE EMBRACE... After working hard all day, creating his beautiful metal sculptures, sinfully sexy Hunter Lacroux likes to unwind with a hot, sexy babe--or two. But after spending a handful of naughty nights with seductive and beautiful Jana Garner, the woman who challenges everything he does and says, Hunter wants more. As a dancer, boxer, actress, and waitress, Jana is tough, organized, and as dedicated as she is committed. She has to be to maintain her crazy schedule. But when it comes to men, Jana's had a string of bad relationships, and there's only one thing she'll commit to--not committing. White-hot passion ignites every time Jana and Hunter are together, but the closer Hunter gets, the faster Jana runs. When Hunter lays on the charm, Jana throws out a challenge she's sure he can't meet, and Hunter steps up to the plate, forcing her to face her hurtful past or let go of him forever. SEASIDE EMBRACE is part of the SEASIDE SUMMERS romance and \"Love in Bloom\" romance series. Each book may be read as a stand-alone novel, or as part of the series. *** Read the full LOVE IN BLOOM series:  SNOW SISTERSBOOK 1: Sisters in LoveBOOK 2: Sisters in BloomBOOK 3: Sisters in White  THE BRADENS (Weston, CO) BOOK 1: Lovers at Heart (Treat & Max) BOOK 2: Destined for Love (Rex & Jade)BOOK 3: Friendship on Fire (Josh & Riley)BOOK 4: Sea of Love (Dane & Lacy)BOOK 5: Bursting with Love (Savannah & Jack)BOOK 6: Hearts at Play (Hugh & Bree)  THE BRADENS (Trusty, CO)BOOK 1: Taken by Love (Luke)BOOK 2: Fated for Love (Wes)BOOK 3: Romancing My Love (Pierce)BOOK 4: Flirting with Love (Ross)BOOK 5: Dreaming of Love (Emily)BOOK 6: Crashing into Love (Jake)  THE BRADEN WORLD NOVELLASPromise My Love (Rex & Jade's Wedding Novella)**Best if read after Weston & Trusty Bradens**  THE BRADENS (Peaceful Harbor, MD)BOOK 1: Healed by Love (Nate)BOOK 2: Surrender My Love (Cole)BOOK 3: Crushing on Love (Shannon)COMING SOONBOOK 4: River of Love (Sam)BOOK 5: Whisper of Love (Tempest)BOOK 6: Thrill of Love (Ty)  THE REMINGTONSBOOK 1: Game of Love (Dex)BOOK 2: Stroke of Love (Sage)BOOK 3: Flames of Love (Siena)BOOK 4: Slope of Love (Rush)BOOK 5: Read, Write, Love (Kurt)  SEASIDE SUMMERS BOOK 1: Seaside Dreams (Bella)BOOK 2: Seaside Hearts (Jenna)BOOK 3: Seaside Sunsets (Jamie)BOOK 4: Seaside Secrets (Amy)BOOK 5: Seaside Nights (Sky)BOOK 6: Seaside Embrace (Hunter)  COMING SOONBOOK 7: Seaside Lovers (Grayson)BOOK 8: Seaside Whispers (Matt)  AUTHOR BIOMelissa Foster is a New York Times & USA Today bestselling and award-winning author. She writes sexy and heartwarming contemporary romance--perfect beach reads--with emotionally compelling characters that stay with you long after you turn the last page. Melissa also co-writes the Love on Rockwell Island series with New York Times bestselling author Bella Andre. Melissa's emotional journeys are lovingly erotic and always family oriented. Her books have been recommended by USA Today's book blog, Hagerstown Magazine, The Patriot, and several other print venues. She is the founder of the World Literary Cafe and Fostering Success. Melissa enjoys chatting with readers and book clubs. Send her an email invitation to your next event!",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Family"
  ],
  "author": "Melissa Foster",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/23655987-seaside-embrace"
}