{
  "title": "Life in the French Country House",
  "description": "Mark Girouard, author of Life in the English Country House and other superb books, extends his realm to France in this perceptive and witty portrait of the upper classes at home in their châteaux, manoirs, and gentilhommières.In these lavishly illustrated pages we experience all the variety and beauty of the châteaux. We learn how they reflected, in their decoration and organization, the manners and mores of their occupants--how the different rooms were lived in, how changes in taste accommodated the waxing and waning fortunes of the aristocracy (and then the bourgeoisie), how design and architecture evolved to serve changing lifestyles and values. The grim fortified donjons of old developed into the extravagant towers in which late-medieval seigneurs lived in luxury and splendor. In the time of Francis I and his successors, the romance of chivalry infused with Renaissance culture: the pageantry of balls and masques in the grande salle, the cultivation of privacy in richly decorated cabinets and galleries. In the ancien régime, the château offered intimate conversations in seventeenth-century alcoves, amorous encounters in Louis Quinze boudoirs, the pleasures of private theatricals, and the refined social life of the salon. After the Revolution, the noblesse returned to its medieval roots, but brought old values up to date with plush upholstered sofas, potted palms, and parks in the English manner. Seriousness was diluted by the extravagant entertainments of the Belle Epoque, and in our own time nostalgia combines with a dogged fight for survival.Mr. Girouard is as a marvelous guide to \"downstairs\" as he is to \"upstairs,\" showing us how the kitchens operated, how the stables were organized, how the servants were provided for, as well as how developments in lighting, plumbing, and water supply affected everyone's comfort and customs. He has explored scores of French houses, as well as the letters and diaries, inventories, and books of etiquette that give us an intimate sense of what it meant to inhabit a French country house.For everyone who has visited or dreamed of the French countryside, this endlessly appealing book will bring to life that storied place and its people.",
  "genres": [
    "History",
    "France",
    "Architecture",
    "Nonfiction",
    "Historical",
    "Sociology",
    "18th Century"
  ],
  "author": "Mark Girouard",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/2365458.Life_in_the_French_Country_House"
}