{
  "title": "Unsound",
  "description": "Time And Time Again by Chantal Fernando  I always thought I had luck on my side.  Things seemed to go in my favour, whether by will or by nature.  But that luck just ran out.  Jobless and on the verge of being homeless, I find a strength in me that I didn't even know existed and discover an unlikely savior --- Tag.  He avoids commitment like the plague, and starting anything with him will only lead to heartbreak.  I know this.  He knows this.  So why am I still here?  Oh, right. Because I want him more than I want my next breath.  =========================================  The Broken Pieces Of Us by M.N. Forgy  ***WARNING - This is not your typical happily ever after. This story heavily relates to the previous books in the series and will be more enjoyable if read as a companion to the series. That being said, it is not necessary to read the previous books to understand the story.  Babs is no stranger to the MC world. As an ol’ lady, she takes the hell that comes with it and dishes it out times two. When things take a turn for the worst, it leaves her questioning just how equipped she is for the hell she lives. She thought her marriage with Locks was it; that she had it all. But the past has a way of sneaking up and tearing life apart. Finding herself trapped as Locks’ ol’ lady, with the threat she will be his till the grave, her world spirals out of control. The only person risking it all to save her is the last person she thought would care: Bull.  President of the Devil’s Dust MC, Bull, is good at running women off and is even better at pissing off his brothers. When he sees the way his vice-president is treating his ol’ lady, he tries to keep his thoughts to himself. The one thing Bull insists on in his club is respect and loyalty: respect for the patch, respect for your brother, and loyalty to the club. However, after finding Babs in a harsh predicament after a run in with Locks, he can’t help but step in. Crossing lines and hurdling around life’s unpredictability, will they find refuge in each other or will they have to endure what life gives them?",
  "genres": [],
  "author": "Chantal Fernando",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/23665477-unsound"
}