{
  "title": "Mistletoe and Magick",
  "description": "Do you believe in magic? Lose yourself in these enchanting and spooky Christmas tales featuring bewitched mistletoe, a love charm, a spellbound snow globe, a mysterious shifter stag, a ghost, a magical toy shop, and eerie hauntings. These stories move from light and frothy magic to dark, pagan tales.Our heroes are even more delicious: From bad boys and billionaires to military men, dark fae, witches and warlocks, and even a Regency Lord. You're sure to fall in love in love with one, or all, of these hot guys.A Kiss is Just a Kiss by Linda BarlowThinking only of love and passion, college student Holly Mathers steals an enchanted kiss beneath bewitched mistletoe, but she finds that all magic comes with a price.Love Charm for Dakota by Carly CarsonInto Cabot's sedate Nantucket world blows Dakota Bishop, possessor of a wild spirit and a magical love charm. Will Cabot succumb to her charm, or will Dakota's witchcraft boomerang on her?The Snow Queen by Alana AlbertsonA curse follows those who perform in the Cambridge Ballet's production of The Nutcracker--every year for the past five, a cast member has gone missing. Now cast as the Snow Queen, can Nieves Alba break the curse, or will she be yet another victim of America's favorite ballet?How Lovely Your Branches by Kara Ashley DeyWhen a new neighbor and his three female companions take up residence across the road in the very house her friend had vacated four months ago, recluse Katie Crowe is intrigued. Gabe's eyes hold a promise, a way out of her exile, if Katie can break free of the past and the haunting secrets that surround her.The Perfect Gift by Nicole BlanchardWhen faced with the reality of a negative bank balance and a failing marriage, Sera Flaherty finds she's willing to sacrifice anything to fix her mistakes and find her husband the perfect gift...even if doing will cost more than she bargained for.In the Bleak Midwinter by Andra BrynnFor Ayla MacFarlane, coming home for the holidays is a prison sentence. The old gods of the solstice still listen and can answer her prayers, but old gods require old sacrifices, and power is sometimes fed in the bloodiest of ways.Until the Twelfth Night by Cherie ChulickSpending the holidays at an old countryside manor sounded like a good idea, but as rumors spread that the great house is haunted, and sparks fly with a handsome houseguest, will Lady Elizabeth regret her decision?",
  "genres": [],
  "author": "Alana Albertson",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/23669322-mistletoe-and-magick"
}