{
  "title": "Naked in Baghdad: The Iraq War and the Aftermath as Seen by NPR's Correspondent Anne Garrels",
  "description": "National Public Radio's correspondent provides a brilliant, intimate, on-the-ground account of history in the making with Naked in Baghdad.As NPR's senior foreign correspondent, Anne Garrels has covered conflicts in Chechnya, Bosnia, Kosovo, Afghanistan, and elsewhere. She is renowned for direct, down-to-earth, insightful reportage, and for her independent take on what she sees. One of only sixteen un-embedded American journalists who stayed in Baghdad's now-legendary Palestine Hotel throughout the American invasion of Iraq, she was at the very center of the storm. Naked in Baghdad gives us the sights, sounds, and smells of our latest war with unparalleled vividness and immediacy.Garrels's narrative starts with several trips she made to Baghdad before the war, beginning in October 2002. At its heart is her evolving relationship with her Iraqi driver/minder, Amer, who becomes her friend and confidant, often serving as her eyes and ears among the populace and taking her where no other reporter was able to penetrate. Amer's own strong reactions and personal dilemma provide a trenchant counterpoint to daily events. The story is also punctuated by e-mail bulletins sent by Garrels's husband, Vint Lawrence, to their friends around the world, giving a private view of the rough-and-tumble, often dangerous life of a foreign correspondent, along with some much-needed comic relief.The result is enthralling, deeply personal, utterly authentic--an on-the-ground picture of the war in Iraq that no one else could have written. As Chicago Sun-Times critic Lloyd Sachs wrote about Garrels's work in Baghdad, \"a few choice words, honestly delivered, are worth more than a thousand pictures . . . In your mind's eye, they carry lasting truth.\"",
  "genres": [
    "Nonfiction",
    "History",
    "War",
    "Memoir",
    "Journalism",
    "Politics",
    "Biography Memoir"
  ],
  "author": "Anne Garrels",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/236699.Naked_in_Baghdad"
}