{
  "title": "The Naked Olympics: The True Story of the Ancient Games",
  "description": "What was it like to attend the ancient Olympic Games?With the summer Olympics’ return to Athens, Tony Perrottet delves into the ancient world and lets the Greek Games begin again. The acclaimed author of Pagan Holiday brings attitude, erudition, and humor to the fascinating story of the original Olympic festival, tracking the event day by day to re-create the experience in all its compelling spectacle.Using firsthand reports and little-known sources—including an actual Handbook for a Sports Coach used by the Greeks— The Naked Olympics creates a vivid picture of an extravaganza performed before as many as forty thousand people, featuring contests as timeless as the javelin throw and as exotic as the chariot race.Peeling away the layers of myth, Perrottet lays bare the ancient sporting experience—including the round-the-clock bacchanal inside the tents of the Olympic Village, the all-male nude workouts under the statue of Eros, and history’s first corruption scandals involving athletes. Featuring sometimes scandalous cameos by sports enthusiasts Plato, Socrates, and Herodotus, The Naked Olympics offers essential insight into today’s Games and an unforgettable guide to the world’s first and most influential athletic festival.\"Just in time for the modern Olympic games to return to Greece this summer for the first time in more than a century, Tony Perrottet offers up a diverting primer on the Olympics of the ancient kind….Well researched; his sources are as solid as sources come. It's also well writen….Perhaps no book of the season will show us so briefly and entertainingly just how complete is our inheritance from the Greeks, vulgarity and all.\"--The Washington Post",
  "genres": [
    "History",
    "Nonfiction",
    "Sports",
    "Ancient History",
    "Greece",
    "Adult",
    "Historical"
  ],
  "author": "Tony Perrottet",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/236706.The_Naked_Olympics"
}