{
  "title": "Motorcycle Clubs Volume #1 Box Set",
  "description": "Try the first three stories in the Motorcycle Clubs series at a fantastic low price!  Collecting the first three novellas in the Motorcycle Clubs series, this box set features a shared world of three different MCs — the Death Lords, the Bedlam Butchers, and the Hellfire Riders — and the hot, steamy romances between strong alpha bikers and the fierce women who love them. The Motorcycle Clubs series is for readers who want all of the heat and emotion, but who don't have all of the time.  HIS WILD DESIRE (Death Lords MC, #1) by Ella Goode  I’m not supposed to want him, but I do. I’m not supposed to need him, but I can’t stop. I’m not supposed to love him, but my heart won’t listen. Most of all? I’m definitely, under no circumstances, supposed to sleep with him.  Grant “Wrecker” Harrison spent three years of his life locked away. He’s out and he’s tired of hiding. He wants everyone, even his father Judge President of the Death Lords MC, to know she’s his.  Chelsea Weaver loves Grant even though she knows its wrong. She knew it was wrong when she gave him her virginity and she knows it’s still wrong three years later…because Grant’s her stepbrother and Judge is the only father she’s ever known.  HIS WILD DESIRE is a 26,000 word novella. No cliffhangers.  OFF LIMITS (Bedlam Butchers MC, #1) by Ruby Dixon  He shouldn’t touch me, but he does. Late one night, in the middle of danger, he makes me feel things I shouldn’t. And I know I shouldn’t want more…but I do. Because hooking up with me? It could cost him his life.  Lucky…isn’t. In fact, she’s considered ‘off limits’ to the Bedlam Butchers because she’s caused them nothing but bad luck in the past. As a bonus? She’s also the president’s kid sister. Single and lonely? That’s Lucky’s way of life. Now, the Eighty-Eight Henchmen are harassing her and they’re out for blood.  Solo…is. In a club where pairing up with a brother to watch your back is mandatory, Solo still hasn’t gotten over his partner’s death two years ago. The club’s pressuring him to name a second Treasurer, but he has to trust that person in bed and out. And it’s damn hard for Solo to trust.  But when he rescues Lucky from the Eighty-Eight, maybe it’s time for Solo to find a partner, and time for Lucky’s luck to turn around…  OFF LIMITS is a 18,500 word novella. No cliffhangers.  WANTING IT ALL (Hellfire Riders MC, #1) by Kati Wilde  He’s the one man I can never have, but the only one I crave…  Saxon Gray has reason to hate me. He spent five years in prison after saving me from a brutal violation at the hands of a rival motorcycle club – and he paid for that rescue with his freedom. I’ve never been able to settle the debt I owe him…until now.  The menace of that old rivalry is flaring up again, and as president of the Hellfire Riders, Saxon is the one man who can keep me safe. But I want more than his protection. I want his heart.  WANTING IT ALL is a 24,000 word novella. No cliffhangers.  The Motorcycle Clubs series checklist:  Death Lords by Ella Goode, Bedlam Butchers by Ruby Dixon, Hellfire Riders by Kati Wilde. You can read these in order or by author.  Included in the Motorcycle Clubs series, Volume #1 Box Set: 1. Ella Goode's HIS WILD DESIRE (Death Lords #1) 2. Ruby Dixon's OFF LIMITS (Bedlam Butchers MC, #1)3. Kati Wilde's WANTING IT ALL (Hellfire Riders MC, #1)",
  "genres": [],
  "author": "Ella Goode",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/23667306-motorcycle-clubs-volume-1-box-set"
}