{
  "title": "To Bedevil A Beauty",
  "description": "Berry Malone’s life was currently ranking a D minus. Divorced, destitute and desperate. Returning home to the Southern Sanctuary to take on the role of local magistrate sounds like the perfect solution to her problems. A place to heal and recover. Regain her self-confidence as a single, empowered – sworn off men for life – woman.Unfortunately, her interfering extended magical family, along with the local devious cats, have other plans for her. Plans that include shredding every article of clothing she owns and throwing her into the company of the new Chief of Police as often as possible. A man too irritating for words, with all his heated looks, intentional looming and flirtatious comments. So what if the man sends her hormones into a tizzy, Berry is determined not to be led astray by her untrustworthy instincts or magic ever again.Ramsey Hughes is desperate to be declared mentally fit enough to return to his job as an undercover cop. If that means temporarily filling in as the Southern Sanctuary Chief of Police, so be it. Except the place is weird, and the inhabitants, even stranger. Then he runs across Berry Malone… naked, vulnerable and spitting mad. Damn, he loves to see her eyes spark with fire. Although she seems to be under the misapprehension that he’s some sort of smooth talking, playboy flirt.With bullets flying and danger stalking them, the two must unite to survive. As they grow closer, Berry remains wary, resolved to keep Hotshot Hughes at arm’s length. She’s too smart to fall for another lying, no-good - can’t be trusted - man. All Ramsey knows is that he wants Berry Malone in his life and he’ll do whatever it takes to keep her there, even if that means taking a leap of faith and believing that magic is real. And if that doesn’t work, then he’ll poke, prod and bedevil a beauty, until Berry Malone is willing to commit herself to him heart and soul.",
  "genres": [
    "Romance",
    "Paranormal Romance",
    "Paranormal",
    "Humor",
    "Magic",
    "Urban Fantasy",
    "Paranormal Urban Fantasy"
  ],
  "author": "Jane Cousins",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/23668756-to-bedevil-a-beauty"
}