{
  "title": "Cowboy 12 Pack: Twelve-Novel Boxed Set",
  "description": "If you love sexy cowboy romance books, get ready for a 12-pack of 'em from New York Times and USA Today bestselling authors!A COWBOY'S SEDUCTION - Cynthia D'AlbaSADIE AND HER COWBOY - Paige TylerTHE BILLIONAIRE HUSBAND TEST - Elle JamesHER UNIFORM COWBOY - Donna MichaelsI AM NOT YOUR MELODY - Shoshanna EversCHASE AND SEDUCTION - Randi AlexanderTHE COWBOY WINS A BRIDE - Cora SetonTHE HARDER THEY FALL - Beth WilliamsonTHE REAL MCCOY - Sabrina YorkBADASS - Sable HunterCOWBOYS NEVER FOLD - Lexi PostCUPID'S COWBOY - Becky McGrawA COWBOY'S SEDUCTION - Award-Winning Author Cynthia D'Alba - Sparks fly when an exhausted cowboy, on a forced tropical vacation, meets an uptight accountant in a bikini. As the seduction game begins, two weeks never looked so short.SADIE AND HER COWBOY - USA Today Bestselling Author Paige Tyler - A beautiful ranch owner hires an infamous gunslinger to protect her against a ruthless cattle baron, but risks losing everything when she falls for the sexy hired gunTHE BILLIONAIRE HUSBAND TEST - NYT & USA Today Bestselling Author Elle James - Skeptical billionaire takes a risk on a friend's dating service and finds the cowgirl of his dreams, only he has to convince her he's her perfect match.HER UNIFORM COWBOY - Donna Michaels - Texas Guardsman never planned his attraction to a curvy, military-hating Pennsylvanian, or saddling her with his stress issues. Will the town’s newest resident support him, or abandon him like others in his past?I AM NOT YOUR MELODY - NYT & USA Today Bestselling Author Shoshanna Evers - The baddest cowboy in Bear Creek Saddle partners with a sassy new bartender to save the family business. His rules: Don’t kill her. Don’t kiss her. And don’t fall in love.CHASE AND SEDUCTION - USA Today Bestselling Author Randi Alexander - Country music superstar Chase Tanner is determined to seduce screenplay writer Reno Linden. She risks the plunge into Chase’s arms, but will their attraction survive the glitz and stress of fame?THE COWBOY WINS A BRIDE - NYT & USA Today Bestselling Author Cora Seton –Jamie Lassiter just made the bet of his life—He’s got six weeks to prove to Claire Cruz he’s the man for her, or pay for her round-the-world trip. (The Cowboys of Chance Creek #2)THE HARDER THEY FALL - Beth Williamson - Cowboy Hank Beltane has no idea what's in store for him when he tries to seduce the stubborn, beautiful and sexy as hell rodeo owner TJ Maguire.THE REAL MCCOY - NYT & USA Today Bestselling Author Sabrina York - At a wild, girls-only weekend at a rowdy “stud” ranch, she meets the gruff, dominant man of her dreams. It’s too bad the sexy stripper is only a pretend cowboy…or is he?BADASS - Amazon Bestselling Author Sable Hunter - Isaac McCoy - Badass Isaac McCoy, as at home on a Harley as he is on a horse, is in love with the preacher's daughter— the angel of Kerr County—and that will never do.COWBOYS NEVER FOLD – Award-Winning Author Lexi Post – When a cowboy honors a promise by working at a nudist resort, he discovers that to win the sexy owner's heart he must go all-in, which could mean baring more than his soul.CUPID'S COWBOY - Amazon Bestselling Author Becky McGraw - Struggling country singer is struck by cupids arrow when delivering a breakup singing telegram on Valentine's Day to a beautiful music exec who could make all his dreams come true.",
  "genres": [],
  "author": "Cynthia D'Alba",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/23668466-cowboy-12-pack"
}