{
  "title": "القطار الأخير من هيروشيما: الناجون ينظرون إلى الخلف",
  "description": "مع اقترابنا من شفا هاوية الانتشار النووي المنفلت من أي ضوابط حتى الإرهاب النووي، يجب أن نتذكر أن هيروشيما وناغازاكي تمثلان قوة الأسلحة الأشد فتكاً التي سنراها في حياتنا على الأرجح. بهذه الكلمات تبدأ رواية \"تشارلز بلغرينو\" الموثقة بشهادات حية وأسماء وشهود عيان ناجين يروون ما حدث للبشر والحجر تحت القنبلتين النوويتين اللتين ألقيتا فوق هيروشيما وناغازاكي في الحرب العالمية الثانية. لم يكن تسوتومو ياماغوتشي الناجي الوحيد الذي تمكن من اختبار الانفجار مرتين والنجاة منه، كان حسن الحظ المحض المطلق هو الذي أنجى أولئك الذين سَلموا من تلك القنابل الأميركية رغم وجودهم ضمن مسافة قريبة من نقطة التفجير لحظة سقوطها. فقد كان هؤلاء في مأمن من أشعة غاما والأشعة الحمراء المميتتان فقد شاء القدر أن يكون هؤلاء الناجون في مواقع تمكنت من امتصاص الصدمة الطبيعية للانفجار من دون أن تؤثر على من فيها. قصص النجاة المزدوجة هذه تشكل جزءاً من مادة هذا الكتاب \"القطار الأخير من هيروشيما - الناجون ينظرون إلى الخلف\" والتي اعتبرها المؤلف مراجع تاريخية تضمنت ملخصات موجزة ومرتبة أبجدياً عن سير حياة شهود العيان الرئيسين في هذه الحكاية. يمكن وصف كتاب \"القطار الأخير من هيروشيما\" بأنه كاتالوج فاضح يسلط نظرة نافذة على مشاهد الرعب التي تحبس الأنفاس، وتتوقف القلوب ذعراً أمامها، فهو كتاب يكشف عن حقائق علمية لا تخطر على ذهن بشر \"كانت كل من ذرات اليورانيوم - 235 في نواة القنبلة قد تكونت قبل أكثر من 4.6 مليار سنة - في قلب شديد السطوع. تجمعت النواة من رماد نجوم كانت قد تشكلت واندثرت قبل وقت طويل من نشوء أقدم جبال القمر. أرغمت البقايا الأصلية، التي نشأت في أثناء خلق الكون، والتي خضعت لعملية تعدين وتكرير حتى أضحت درجة نقائها تفوق نسبة 83 بالمئة ورُصّت معاً بهندسة دقيقة جداً، بعد عصر من الخمول، على محاكاة الصرخة الأخيرة لنجم ينفجر. في كل عناصرها الأساسية الكمية المجردة، يشبه ما حدث فوق هيروشيما ذلك الصباح - وبعد ثلاثة أيام فوق ناغازاكي، في مرجل بلوتونيوم منفصل، مليء بمنتجات ثانوية لمفاعل يورانيوم - ظهوراً خفيفاً لشموس بعيدة (...)\". إنها أكثر من رواية، إنها حقيقة تنفث ألماً وغضباً تجاه قوى الشر في هذا العالم. ودعوة لإنهاء الحرب النووية بحسب وصف \"بلغرينو\" لخطة ياماغوشي \"الفئة الوحيدة التي ينبغي أن يسمح لها بحكم الدول التي تمتلك أسلحة نووية، هن الأمهات اللواتي ما زلن يرضعن أطفالهن من صدورهن\".",
  "genres": [
    "History",
    "Nonfiction",
    "Japan",
    "War",
    "World War II",
    "Historical",
    "Science"
  ],
  "author": "Charles Pellegrino",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/11449356"
}