{
  "title": "Sticks and Stones",
  "description": "For Lou it was always Dylan. She loved him from the moment they first met across a cadaver in the dissection room at medical school. The most gorgeous man she’d ever laid eyes on, with more Welsh charm than you could shake a stick at; she was a goner.  But Lou, despite her beauty, was just too extrovert to interest Dylan, who was convinced that a quiet, shy girl, like Lou’s best friend Frankie, was much more his style.  \n‘Have at it mate but I’ve got two words for you: high maintenance.’ ‘Don’t think I’d mind putting in the hard yards maintaining that piece of arse,’ one of Dylan’s more disgusting rugby mates replied. ‘Well good luck to you,’ Dylan returned, looking completely relaxed now that they were discussing Lou and not his precious Frankie. ‘I like mine heavy on the sweet and light on the ball-breaking bitch, but each to his own.’\n  After overhearing that exchange, Lou buries her pain and pines for him in private, but she can't give up their friendship. One night, eleven years later, she finally gets what she has been longing for, but the next morning realizes he was too drunk to even remember.  For Dylan it was always anyone but Lou. A born surgeon, Dylan resents having to down his orthopaedic power tools for a six-month spell in Elderly Care. He thought that at least working with Lou would make his skiving easier; after all she’s always helped him out before. And so what if he’s been having these weird dreams about her since he woke up in her flat? It’s not like he’d ever actually go there.  So when he mistakenly believes that she’s put his career in jeopardy he loses control and his vicious insults, publicly made, cut Lou to the bone. It’s only after he loses Lou’s warm smiles, dry wit, boundless energy and outrageous banter from his life that he realizes the extent of his stupidity.  Maybe sticks and stones can break bones, and that’s something Dylan’s surgical skills can deal with. But when it’s a heart he’s broken…  This book is a full-length contemporary romance/romantic comedy/medical romance of approximately 80,000 words. It is part of a series, involving characters from 'Broken Heart Syndrome', but can be read as a stand-alone novel.  About The Author Susie Tate is a general practitioner and when she’s not working she’s looking after her four yummy boys under five (okay well one is actually over thirty-five but it’s the mental age that counts!). Maybe it’s a bit strange for a doctor to be writing contemporary romance/romantic comedy, but she thought she could use her experience to write what she hopes are funny, occasionally bittersweet stories that give people a behind the scenes look at hospital medicine. She can only apologize to her orthopaedic friends for the way she has brutally stereotyped them in this book but she just couldn’t resist!",
  "genres": [
    "Romance",
    "Friends To Lovers",
    "Contemporary",
    "Contemporary Romance",
    "Slow Burn",
    "Medical",
    "Second Chance"
  ],
  "author": "Susie Tate",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/23683361-sticks-and-stones"
}