{
  "title": "The Connection: How al Qaeda's Collaboration with Saddam Hussein Has Endangered America",
  "description": "In the wake of 9/11 no one knew when the next attack would come, or where it would come from. America's enemies seemed gathered on all sides, and for several nerve-racking months, we lived in fear that the perpetrators might be plotting another action or, worse, that our most dangerous enemies -- al Qaeda and Saddam Hussein's murderous regime in Iraq -- could be banding together against us. The Bush administration and CIA director George Tenet warned against complacency and pointed to growing indications that al Qaeda and Iraq were in league. But their case was undercut by unnamed intelligence officials, skeptical politicians, and a compliant media. So America relaxed . A comforting consensus settled Osama bin Laden was an impassioned fundamentalist, Saddam a secular autocrat. The two would never, could never, work together. ABC News reported that there was no connection between them, and the New York Times said so too, and pretty soon just about everyone agreed. Just about everyone was wrong. In The Connection , Stephen Hayes draws on CIA debriefings, top-secret memos from our national intelligence agencies, and interviews with Iraqi military leaders and Washington insiders to demonstrate that Saddam and bin Laden not only could work together, they did -- a curious relationship that stretches back more than a decade and may include collaboration on terrorist acts, chemical-weapons training, and sheltering some of the world's most wanted radicals. Stephen Hayes's bombshell Weekly Standard piece on this topic was cited by Vice President Cheney as the \"best source of information\" about the Saddam-al Qaeda connections. Now Hayes delves even deeper, exposing the inner workings of America's deadliest opponents and providing a clear-eyed corrective to reams of underreported, politicized, and just plain wrong information. The Connection is both a gripping snapshot of the War on Terror and a case study in how bureaucratic assumptions and media arrogance can put us all at risk.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Stephen F. Hayes",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/236871.The_Connection"
}