{
  "title": "Nemova říše",
  "description": "Trilogie Kapitán Nemo českého autora J. M. Troska patřila na přelomu třicátých a čtyřicátých let k oblíbené četbě mladé generace. Ne nadarmo se J. M. Troskovi začalo říkat ,,český Julius Verne\". Jeho početné romány navazovaly na tradici verneovek a rozvíjely některé základní motivy z románů populárního Francouze, jak je konečně patrné už i z názvu naší trilogie.První díl tohoto dobrodružného a fantastického vyprávění o geniálním kapitánu Nemovi, nazvaný Nemova říše seznámí nejdříve čtenáře s dvojicí českých techniků - inž. Holanem, tvůrcem nezničitelného holanitu, materiálu, který se výborně hodí zejména na stavbu lodí a ponorek, a jeho přítelem inž. Farinem, vynálezcem paprsků smrti a vynikajícím odborníkem v oboru elektřiny. Oba přátelé jsou odhodláni sestrojit ponorku a vydat se v jejích útrobách na výzkum mořského dna. Vypraví se tedy na pustý ostrov kdesi za jižním polárním kruhem a tam v klidu hodlají realizovat svůj záměr. Takřka před začátkem plavby postihne ostrov ničivá sněhová bouře, v níž se ztratí inž. Farin spolu s dalším účastníkem výpravy prof. Rogerem. Oba postižení se za dramatických okolností dostanou do fantastické podzemní říše kapitána Nema, kde mají možnost seznámit se nejen s úžasnými technickými vymoženostmi a samotným kapitáneme Nemo, ake i stát se jeho spolupracovníky. Zatímco Farin a Roger cestují podzemní říší, připravuje inž. Holan svoji plavbu. Těsně před vyplutím bere nad ní záštitu sám kapitán Nemo, který prostřednictvím dokonalé techniky řídí plavbu ponorky, jíž propůjčil čestný název Nautilus, k cíli její cesty, k legendární Atlantidě. Jejím nalezením a vzrušujícími dobrodružstvími při průzkumu končí Nemova říše, první díl populární trilogie Kapitán Nemo, jejímž vydáním splácíme dluh našemu čtenáři i dluh ,,českému Juliu Vernovi\", spisovateli J. M. Troskovi.",
  "genres": [
    "Science Fiction",
    "Czech Literature"
  ],
  "author": "J.M. Troska",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/23676817-nemova-e"
}