{
  "title": "Love, Guilt and Reparation: And Other Works 1921-1945",
  "description": "This book shows the growth of Melanie Klein's work and ideas between 1921 and 1945, and traces her theories on childhood development, criminality and childhood psychosis, symbol formation, and the early development of conscience.Melanie Reizes Klein (30 March 1882 – 22 September 1960) was an Austrian-born British psychoanalyst who devised novel therapeutic techniques for children that had an impact on child psychology and contemporary psychoanalysis. She was a leading innovator in theorizing object relations theory. Klein had a major influence on the theory and technique of psychoanalysis, particularly in Great Britain. As a divorced woman whose academic qualifications did not even include a bachelor's degree, Klein was a visible iconoclast within a profession dominated by male physicians. After the arrival of Sigmund Freud and his psychoanalyst daughter, Anna Freud, in London in 1938, Klein’s ideas came into conflict with those of Continental analysts who were migrating to Britain. Following protracted debates between the followers of Klein and the followers of Anna Freud during the 1940s (the so-called 'controversial discussions'), the British Psychoanalytical Society split into three separate training divisions: (1) Kleinian, (2) Anna Freudian, and (3) independent. This division remains to the current time. Kleinian psychoanalysis remains a large and influential school of psychoanalysis within Britain, in much of Latin America, and to an extent in continental Europe. Melanie Klein's works are collected in four volumes, of which this is volume One. A timeless book: the pioneering and fascinating work of Melanie Klein who shaped child psychoanalysis. Her work is second only to S. Freud.",
  "genres": [
    "Psychology",
    "Psychoanalysis",
    "Nonfiction",
    "Philosophy",
    "Theory",
    "Womens",
    "Parenting"
  ],
  "author": "Melanie Klein",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/236824.Love_Guilt_and_Reparation"
}