{
  "title": "Golden Boy, Golden Man",
  "description": "Johnny Wilson has never been in love. Though women adore his golden-blond good looks, he never seems to connect. Still trying to convince himself he's straight when he checks out a local gay bar, one look at the handsome stranger is enough to set his heart on fire. Half-acknowledged fantasies and dangerous dreams are challenged as Johnny finally faces his own secrets. Eric Mendez, the handsome, much-sought-after Dom in the BDSM gay Manhattan scene, is used to getting just exactly what he wants with a snap of his fingers and a glance from his smoldering eyes. When he first lays eyes on Johnny Wilson, he assumes he's just another pretty boy cruising the clubs for a good time. When Johnny disappears without a trace, he unknowingly takes a piece of Eric's heart with him. Sizzling passion and hidden yearnings to experience the ultimate submission at the hands of another man are brought to the fore in this explicit but romantic exploration of a gay D/s lifestyle. Johnny must come to grips not only with his sexual orientation, but must also find the courage to submit in a loving exchange of power. Rekindle your love affair with Johnny Wilson and Eric Méndez in this sequel to Golden Boy. Golden Man continues Johnny's journey of self-discovery as a gay submissive. Moving past the near-disaster at the gay BDSM club, Johnny strives to please his dominant lover while coming to terms with his family's disapproval of his lifestyle and his fledgling confidence in the scene. Eric, Johnny's sexy Latino lover, must deal with his own issues of trust and commitment. Together they continue to explore their erotic exchange of power with Johnny eager to press his own sensual envelope as Eric learns to intertwine tenderness with the intensity of discipline. The lovers are tested when a man from Eric's past returns to tempt him, while a sexy artist with designs on Johnny makes him wonder if he has what it takes to commit to just one man. Ultimately this is a love story set against the backdrop of disapproving family and temptation from would-be players in the scene. As the exchange of power deepens to a true exchange of love, each man must confront his fear of giving away the thing he holds most precious his heart.",
  "genres": [
    "M M Romance",
    "BDSM",
    "Erotica",
    "Romance",
    "Contemporary",
    "Gay",
    "LGBT"
  ],
  "author": "Claire Thompson",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/2369714.Golden_Boy_Golden_Man"
}