{
  "title": "Touched By You",
  "description": "Sexy billionaire, Tanner Clarke, knows he is bad for Natalie.Natalie Baker, a young aspiring fashion designer, loves him from the moment she meets him. Even Tanner’s possessive alpha male, domineering ways don’t make her give up on the only man she will ever love. Tanner and Natalie’s international romance unfolds over 12 novellas in the Touched By You sensual romance series. Each book is a different stage in the relationship, a sensual romance filled with twists and turns.NEW OFFER: The first 4 books available in a boxed set. They were the original story, and have a happy ending. But don’t be surprised if you want to read all 12. This new adult steamy romance will make you believe in true love!Dark Desire (Touched By You #1)Natalie Baker has an unforgettable sexual encounter with wealthy hero, Tanner Clarke. The passion between them ignites a flame that can’t be put out. She discovers her dark desire, and her life will never be the same in this seductive romance.“There was something in his face. She couldn't think the thought she grasped for. His skin was pale, and she got the impression he wasn't out in the sun much. His baby blue eyes were so bright, they appeared luminous. And his dark brown hair shimmered with auburn highlights, here under the blaring brightness of the lobby. He was just beautiful. She'd never known a man could be beautiful, but he definitely was.”Naked Submission (Touched By You #2)Can Natalie submit to Tanner? The sex is hot. But she doesn’t understand her own desires anymore. Good or bad, she cannot leave the only man that can make her feel that way. Her submission affects Tanner, deeply. But will he admit to love?“Natalie felt the heat of desire flood her body. She wanted to tell him he couldn’t bully her, but was unable to look at him, without wanting him. If he touched her, she wouldn’t be able to deny him. She thought of many things she could say. Instead, she just stood there, looking into his blue eyes, and feeling her body melt.”The Heart’s Domination (Touched By You #3)Natalie gave her body, but he took her heart. Does she have his? Will her love be enough for both of them? The sex gets hotter, and Tanner just might get burned.“A white rose lay on the table beside Natalie. Swept up in the moment, Tanner had purchased the single rose from a street vendor, and presented it to her with a gallant bow. The gift signified the magic of their time together, a fairytale she never wanted to end. He didn’t only dominate her body, he dominated her heart. Alone and relaxed, looking out at the view, Natalie felt like she was in a storybook setting. Tanner chatted, and they laughed together, about silly things. Nothing that was important. He was just like any man one might fall in love with. Yet, he wasn’t.”Bound By Love (Touched By You #4)Natalie’s submission has Tanner’s desire spiraling out of control. She’s in touch with sexual pleasures she never dreamed of, and can’t imagine life without him. Tanner admits to his obsession with Natalie, but is that all it is?“I never met a woman I crave, like I crave you. It’s not so much what we do, as how we do it. There are no words. It’s different with you. You excite me, and sometimes I fear I will lose control,” Tanner admitted. A desperate look came over his normally reserved features, and Natalie stopped breathing.",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "Amazon",
    "Erotica"
  ],
  "author": "Emily Jane Trent",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/23690560-touched-by-you"
}