{
  "title": "Steel and Flame",
  "description": "It began as a difficult quest. Colbey returns home to find his village destroyed, a smoking ruin, destroyed by horrors the survivors tremble to describe. As a pledged protector of the village, his rage drives him to find those responsible, and make them pay the highest price they can.  It began as simple quest. Marik, son of a mercenary, leaves behind the life he knows to find his father, missing these last five years. His only lead is the name of the last mercenary band his father contracted with, the Crimson Kings.  Both join the Crimson Kings, believing that the best mercenary band in Galemar will lead them toward their goals. But their quests will follow paths through blood, combat and the consuming flames of war.  Galemar, a peaceful land for centuries, is about to be plunged into a chaos unknown in anyone’s lifetime.  Volume One in the epic Chronicles of the Crimson Kings Trilogy begins now!    The Chronicles of the Crimson Kings trilogy is the first series set in the world of Folcrist. In Folcrist, there exist multiple systems of magic, dozens of different types of magic users ranging from wizards to mages to sorcerers to geomancers, lands unexplored and lands long forgotten. It is a world where no two kingdoms are the same, and anything might happen. The Eternal Twelve, six paired gods and goddesses, watch over Folcrist, but most of them chose long ago to restrict their influence to indirect measures.  In the forested kingdom of Galemar, peace has reigned for over a century. Even for a common mercenary, finding work isn't all that easy. Mercenary Rail Drakkson leaves his home every spring to find what jobs he can and bring the pay home to his wife and son. But Rail never came home one winter. His fate was left a mystery to all. When his son Marik reaches his coming of age, he decides to set out into the larger kingdom to solve the mystery, with nothing to aide his quest except his father's old sword and a conviction that there is more to the disappearance than most people assume.  Deep in a seemingly haunted forest lies a secret village, protected from outsiders by its own clan of Guardians. Colbey, a young member of their ranks, abruptly finds himself one of the few survivors after a brutal surprise attack. Strangers casting frightening magic and commanding monsters slaughter every villager they can. Amidst the shattered buildings and hanging walkways, Colbey must come face to face with his failure. But despite the carnage, there remain duties to be performed. An artifact from a long forgotten war between gods and their mortal followers remains sealed within the village ruins. If the foreign magic wielders return in strength, they might break open the seals and unleash unimaginable horrors on the whole of Folcrist.  With Galemar being the peaceful land it is, the only realistic option for both men is offered by the best mercenary band within the borders, the Crimson Kings. Marik seeks both answers to his father's fate and to develop his own budding sword skills as a fighter. Colbey seeks signs of the strife that will undoubtedly sprout in the footsteps of his quarry, and who knows faster than the mercenaries about any slight trouble that arises anywhere in the kingdom? Neither will have much time before fighting and war fall upon them both.  Marik and Colbey will have to wade through sword fights, battle lines, combat magic, foreign armies, sieges and unrestrained warfare in pursuit of their answers. But in a mercenary band, there is never any guarantee that you'll live to see the next sunrise.",
  "genres": [
    "Fantasy"
  ],
  "author": "Damien Lake",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/23703158-steel-and-flame"
}