{
  "title": "Science of Happiness",
  "description": "Use the Science of Happiness to Life a Happy LifeDo you want to learn how to be happy?Do you want to apply scientifically-tested techniques to life a happy life?If yes – the Science of Happiness the book for you. It offers 30 days of happiness activities and insights from positive psychology; delivered in a structured format and with many examples and personal stories. It’s the right blend of evidence-based strategies and stories. Here’s what you will take away from the Science of Happiness:Make a real, positive differenceThat’s what makes the Science of Happiness stand out. It’s packed with real-life activities and exercises that are not only scientifically tested but also easy to use. At the core, the Science of Happiness is a practical guide to enable you to become happier. It's not only written to make you understand how to be happy. The ultimate goal of the book is to help you actually make a positive change in your life.Be sure it will workScience of Happiness is not just another self-help book about happiness. You will learn to use insights and strategies that are scientifically test. Hundreds of scientific experiments from positive psychology (= the science of happiness) have been done to prove the techniques work and really do bring more happiness to your life. The research evidence is the quality label on the Science of Happiness.Feel the difference – in 30 daysThe structure of the book is unique. It will take you through 30 days, each day with another activity to engage in. After this 30-day happiness project, you will certainly see a noticeable difference in your life. You will have learned a wide range of positive psychology strategies: You will engage in a series of writing interventions, techniques to cultivate positive emotions in your life, mindfulness, self-compassion, and kindness. We will also learn about the common mistakes people make when they pursue happiness, how positive emotions affect our brains and much more. After the 30-day period, you will see a difference. Guaranteed.",
  "genres": [],
  "author": "Manuel Kraus",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/23695540-science-of-happiness"
}