{
  "title": "That Summer: Part One",
  "description": "From Book 1: WARNING: I don't write about fairy tales and as much as I love Disney... I don't promise my readers or guarantee my characters a 'Happy Ever After...' Happy endings are harmonious but they're not always real life. I'm a sucker for bittersweet endings so please prepare yourself for one of them before purchasing one of my novels. Hearts and flowers won't be found in my writing and neither will perfect conclusions to my stories.  “Why now?” My therapist asks, leaning forward in her seat. “What’s made you decide to talk about him now?\" I contemplate her question whilst gazing out of the window to my left, admiring the clear blue sky and the flowers in the garden. “Desperation, I suppose.” I reply truthfully. “I still can’t get him out of my head. I guess I’m hoping that by talking about him now… all of this will go away. I’m praying that by talking about what happened, it will release me from it, release me from my memories.” “That makes sense.” She encourages me, smiling warmly. “There’s also the fact that I saw him yesterday.” I add, casually folding my arms across my chest as though it’s no big deal. “You saw him? You saw Cole?” She asks, unable to hide her shock and surprise from me. “Yes. I saw him at the park when I was on my way home.” She gapes at me in astonishment and concern, clearly worried about my revelation. She doesn’t quite know how to handle it and I can’t say that I blame her. \"Are you ok? What was his reaction when he saw you?” “He didn’t see me.” I explain. “I’m pretty certain I’d be in the hospital right now if that had happened.” “You do remember that you should never, ever approach him, don’t you?” She reminds me firmly. As though I could ever forget… “I don’t really think I would dare… even if I am tempted.” “For your own safety and emotional wellbeing you must never do this, Serena.” She advises me, making a note of this in her notepad. “I know.” I respond vacantly, my mind already elsewhere. “Where would you like to start with all of this, Serena? What do you want to tell me?” “I suppose I should start at the beginning… that way you will understand. You will be able to understand what happened to me that summer.”  I know I have to go back. I know I need to remember it all. How I first came to meet Cole and how he changed my life forever…  He crashed into my world like a tornado, destroying everything in its path. He shattered my heart and made sure he was the only one who knew how to place the broken pieces back together. He made me fall in love with him and I had absolutely no control and no choice in the matter.  I was an addict and he was my only drug of choice. That summer I was already in too deep, too far gone to fix it all. I had already fallen head over heels in love with him by the time I discovered the truth. The man I could not live without, the man I needed to survive was also something else. He was also my half-brother.  He once said that I shed light on the darkness inside of him. He said I took the fragmented pieces of his soul and put it back together again. He said I made him whole and that I somehow managed to heal the part of him he had convinced himself was broken. He told me I was his hope, his future, his weakness and his strength.  He eventually found out that I was his half-sister.",
  "genres": [
    "Romance",
    "New Adult",
    "Dark",
    "Young Adult",
    "Contemporary"
  ],
  "author": "Lauren  Crossley",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/23700351-that-summer"
}