{
  "title": "Love Notes",
  "description": "Pieces of Me by Kira AdamsFor sixteen year old Peyton Lane, life has never been easy. She’s not popular, overweight, and oh yeah, her sister is embarrassed of her. But over the course of a tumultuous year, everything changes for Peyton. Suddenly all eyes are on her and it’s not because she’s fat. From a pair of handsome twins to a couple of dangerously sexy rockers, Peyton will have to find out who she can trust with her heart. From the ups and downs to the twists and turns—this is Peyton’s story of finding one’s voice and growing into your own. This is a coming of age romance that involves realistic situations and raw emotions. This is Pieces of Me.The Right Song by Shane MorganPain never truly goes away, until you find something deeper and meaningful that cures the heart and fills it with love. That is what Aurora desperately wants to believe. That somehow her music can save her, or even touch the unreachable heart of the guy she has liked for years. Rora yearns for his attention and wants to experience this so-called love that could possibly end her long suffering and inspire her to chase after her dreams. In deeply understanding the feelings of others and herself, will Aurora give up on ever finding true happiness, or will an intriguing soul teach her about the greatest song ever written?Revenge of a Band Geek Gone Bad by Naomi RabinowitzLove. Lust. Blackmail. Romance. Revenge. Is finding love worth getting even?Shy, overweight Melinda Rhodes' sophomore year of high school isn't going so well. Her mother mocks her weight. She spends her weekends holed up in her room making what her friend calls \"Freaky eyeball paintings.\" Her pants split in the middle of school, earning her the nickname, \"Moolinda.\" She then loses first chair flute in band to Kathy Meadows, the pretty and popular mean girl who's tormented Mel for years. Her luck changes when she catches the eye of Josh Kowalski, a rebellious trumpet prodigy and class clown. Josh has also been hurt by Kathy and asks Melinda to help take Kathy down. Mel figures that she has nothing to lose ... and Josh is adorable with gorgeous blue eyes and a winning smile. She agrees to team up with him and looks forward to finally getting back at her rival.At first, the pair's pranks against Kathy are silly, and as they work together, Mel comes out of her shell. Wild, impulsive Josh gets her to do things she'd never done before and Mel enjoys being a bad girl. Even better, she and Josh fall in love and their teen romance blossoms.However, as their schemes become more involved and dangerous, Mel begins to question her loyalty to Josh -- and is surprised to find how dark her dark side really is. Just how far will she be willing to go to get what she wants -- and is keepng Josh really worth the risk of going against her beliefs?This is a coming of age tale about finding love, staying on top and staying true to yourself. Is it really possible for Melinda to have it all?Straight from the Heart by Breigh Forstner This is a story about a girl discovering and experiencing life for the first time. Bryn Schaefler grew up rich. Her parents expected the best out of her, picked her boyfriend for her, and groomed her to be the next trophy wife fresh out of High School. But when they discover she wants to pursue music instead of following in her mothers footsteps, they wanted to hear nothing about it. That was when Bryn left for good. By chance, she auditioned for main stream rock band Everlasting. Never in a million years did she think she would make it. Cale Pelton knew it was his fault for the band scrambling around to find a new guitarist. Once he saw Bryn audition, he knew he had to have her. Not just in the band, but in his mind, body and soul. This is the first book in the Straight from the Heart series. Follow Cale and Bryn as she goes on her first tour, and discovers there's so much more to her than she ever realized.",
  "genres": [],
  "author": "Kira Adams",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/23712323-love-notes"
}