{
  "title": "Sloth",
  "description": "Dear A. – I am writing to express my gratitude for your gift. There are no sufficient words, but please accept my sincerest thank you. Yours,R. She writes me back. I didn’t expect that. She tells me she’s a lover of chicken pizza and video games, a hot sorority girl with the nickname Sloth. She wants to know something about me in return. She says I owe her. This is how she saves my life. She doesn’t even know it. We’ve never even seen each other. But I need a reason. Just one reason to continue. She becomes mine.The anonymity is good. She doesn’t need to know me, but I need her kindness. We both live our lives: a letter here, a post card there. For three years, I escape my demons. And then one day I’m pulled back in. I’ve resigned myself to what I know is coming. Until the girl I’m spanking gives her safe word: Sloth. And then the lie I’m living starts to unravel. --Sloth is an erotic romance. It’s a dark mystery, so if you’re sad, read another book. This one is real, and hard. Not that kind of hard. (That kind of hard, too). Consider yourself warned. P.S. The book ends on a beach. That’s all I’m saying. As for an HEA, you’ll have to read and see. P.S.S. Sloth is long—about 500 pages. It was supposed to be short and quick. Instead it’s a behemoth that consumed its author for six months. As such, the price is going from $2.99 to $4.99 shortly after release.--I whirl around, because I need to go now. Need to run.He grabs my arms, snatching me around to face him, holding me in front of him. Holding me still as he tries to tell me things I never want to hear.\"Stop it! Shut up! Shut up, Kellan! Fuck you!\" He pulls me closer, and I slap his face.The sound echoes through the foyer. His smooth, tanned check stains brilliant crimson.He doesn't move a muscle. Doesn't even blink as I look at him for what I know will be the last time.I'm sorry. His lips move silently. I don't care. I can't. His secrets ruined my life. He ruined my life!If I live to be hundred, my heart will never be the same.Note: Sloth is the first in my new Sinful Secrets series. Each intense, erotic story is inspired by a sin, and centered around a life-altering secret. Each \"sin\" stands on its own, so they don't have to be read in order. After Sloth, I'm writing Envy. Between these two, I'm releasing a stand alone: a more traditional romance called The Boy Next Door.",
  "genres": [
    "Romance",
    "New Adult",
    "Dark",
    "BDSM",
    "Erotica",
    "Contemporary",
    "College"
  ],
  "author": "Ella James",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/23716176-sloth"
}