{
  "title": "Pride Series Books 4-7",
  "description": "Pride Series Romance Novels  Lasting Pride Roberta Stanton had grown up a thief on the streets of Portland. Breaking into the old building had been easy, and she’d gotten away with it. Or so she thought. It had cost her the lives of seven close friends. Years later, Rob finds herself on the other side of the law. Tracking down the thief of millions of dollars’ worth of art is the least of her problems. Her dilemma, now, is the handsome owner of that art. Ric Derby owns the Blue Spot art galleries. Murder and a million‑dollar theft bring them together, but a personal vendetta from a dark figure threatens them both. Retreating to the safety of the small town of Pride, Ric must fight to protect the only person he’s ever truly loved.  Red Hot Christmas Amber is new to Pride. As the new manager of the Golden Oar, she has big plans for helping make it one of the finest restaurants along the Oregon coast. But when she moves into town, she doesn’t count on running into, and almost killing, the most gorgeous man she's ever laid eyes on. Luke thinks he knows what he wants out of life. That is until the woman he's been waiting for all his life takes him down. Literally. Now he's out to prove he's not just another man-boy, but someone Amber can trust and come to love.  My Sweet Valentine Sara Lander was back in town. She had big plans for her inheritance along with her freshly printed business degree and years of experience in some of Seattle’s finest bakeries. She also had a rich idea for Pride. Sara's Nook was going to be the next biggest thing to hit town. All she needed now was to steer clear of the hunky ex-Navy SEAL who was hell‑bent on taking all her focus away from starting her own business. Allen Masters had been living in Pride for several years. Setting up a new branch of the Coastguard and training all the new recruits took years of skill and all his patience. But when he saw the black-haired beauty who had come back into town, he realized she was the one he'd been searching for. Taking one taste of her sweets, he knew he'd be in for a sinful time, but losing his focus while flying into the eye of a storm was the last thing he could afford.    Serving Pride Robert Brogan was destined to be sheriff in the small town of Pride, Oregon. He moved to Pride when he was eight after his mother’s mysterious disappearance. Always following the rules and sticking up for the weak, he had only one thing in mind after graduation—tracking down his mother. But after almost ten years of looking with no luck, he makes his way back to his hometown. When tragedy strikes, he’s given the opportunity of a lifetime. Being sheriff in the small town of Pride gives him the chance to pursue the girl he just can’t keep his mind off. Amelia Blake can never forget the boy that saved her from certain danger ten years ago. When she comes home after her father’s death, she only plans on a short visit, but her mother’s failing health and her feelings for Robert persuade her to move back home. When sparks fly, she can’t help finding herself falling fast for the new sheriff in town.",
  "genres": [],
  "author": "Jill Sanders",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/23703706-pride-series-books-4-7"
}