{
  "title": "Kandide and the Secret of the Mists",
  "description": "What if everything you loved was suddenly taken away . . . And everything you feared became your only hope? Still a teen in human years, Kandide is spoiled, vain, and the personification of perfection. She is also heir to the throne of Calabiyau and keeper of The Gift , the key to survival for all Fae. When a tragic accident leaves her less than perfect, her own mother casts her away to a treacherous world where strange beasts roam the dark, lifeless forest and even stranger Fae rule the land. Kandide must battle hideous creatures, as well as her own internal repulsion for the 'Imperfects' she is now like, if she is to survive. But these are just the beginning of her troubles; within Calabiyau, a presence far more deadly emerges. Joined by her prankster brother, Teren, her tomboy sister, Tara, and a group of misfit Imperfects, the Fae Princess must challenge the darkest of creatures to face an evil worse than any she could have imagined if she is to save the very Fae who sent her away. Calabiyau will forever change, or will it? Praise for Kandide : ' Kandide gives its readers one captivating, enthralling adventure after another.' -- S. Earl Statler, critic correspondent, The Los Angeles Newspaper Group ' Kandide is pure magic!' -- Lance Burton, internationally acclaimed magician 'Mixing adventure and fantasy with life lessons is making Kandide and the Secret of the Mists a favorite in my class for two years in a row. We were lucky to read it in pre-publication. Now, this year's students are REALLY enjoying Kandide . . .' -- Jeff Smith, teacher, Sable Point Elementary School, Florida 'Throughout my career, I've traveled everywhere and I've seen a lot of magic. Kandide 's world is without a doubt one of the most magical places I've ever visited, and I can't wait to go back'-- Cyril Takayama, International Magic Star and Magic Castle Magician on the Year",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Paranormal",
    "Fairies",
    "Childrens",
    "Teen"
  ],
  "author": "Diana S. Zimmerman",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/2371491.Kandide_and_the_Secret_of_the_Mists"
}