{
  "title": "Seneca Falls and the Origins of the Women's Rights Movement",
  "description": "In a quiet town of Seneca Falls, New York, over the course of two days in July, 1848, a small group of women and men, led by Elizabeth Cady Stanton and Lucretia Mott, held a convention that would launch the woman's rights movement and change the course of history. The implications of thatremarkable convention would be felt around the world and indeed are still being felt today.In Seneca Falls and the Origins of the Woman's Rights Movement , the latest contribution to Oxford's acclaimed Pivotal Moments in American History series, Sally McMillen unpacks, for the first time, the full significance of that revolutionary convention and the enormous changes it produced. Thebook covers 50 years of women's activism, from 1840-1890, focusing on four extraordinary figures--Lucretia Mott, Elizabeth Cady Stanton, Lucy Stone, and Susan B. Anthony. McMillen tells the stories of their lives, how they came to take up the cause of women's rights, the astonishing advances theymade during their lifetimes, and the lasting and transformative effects of the work they did. At the convention they asserted full equality with men, argued for greater legal rights, greater professional and education opportunities, and the right to vote--ideas considered wildly radical at the time.Indeed, looking back at the convention two years later, Anthony called it \"the grandest and greatest reform of all time--and destined to be thus regarded by the future historian.\" In this lively and warmly written study, Sally McMillen may well be the future historian Anthony was hoping to find.A vibrant portrait of a major turning point in American women's history, and in human history, this book is essential reading for anyone wishing to fully understand the origins of the woman's rights movement.",
  "genres": [
    "History",
    "Nonfiction",
    "Feminism",
    "Politics",
    "Womens",
    "Historical",
    "American History"
  ],
  "author": "Sally G. McMillen",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/2371794.Seneca_Falls_and_the_Origins_of_the_Women_s_Rights_Movement"
}