{
  "title": "The Consequence of High Caliber",
  "description": "Miko is a devoted son. An irresponsible brother. A protective friend. An anonymous lover. An assassin, nicknamed the Mako Shark after the sheer violence of his hits. Miko is deadly. And damaged.Miko is in love.Excerpt: The server shifted his weight, nervously asking, “Is everything all right, sir?” when it was very much apparent that everything was not all right.Miko stared unblinkingly at his dinner, seeing dead gray flesh floating in a plate of blood where there was only filet mignon with a side of steamed vegetables. He was trembling, his face pale and glistening with sweat. “I am a vegetarian,” he said quietly, finally turning away from his plate.“But…you ordered it. Rare, sir. Extra rare.”Gripping the steak knife in his shaking hand, Miko managed to stammer, “On a separate plate.”“Yes. I’m…I’m sorry, sir. You are correct. It’s my mistake. I’ll bring you—”“No. Please, the check. The check.”“Of course.” He departed with a bow.Miko released the knife and draped his napkin over the plate, his stomach turning. The napkin remained bleached white, failing to soak up the inches of gore that were not actually there. He loosened his tie, then pushed the plate away and slowly brought his hand into his coat pocket where he kept his nine millimeter. And his sanity.The waiter arrived with the check just as Miko slipped a little red candy between his lips, closing his eyes and pressing it against the roof of his mouth with his tongue. Spicy, sugared relief flooded his senses and he sighed languidly. “Thank you,” he said. His English was not particularly clear even without having his mouth full, but Miko did not care whether the waiter understood him. Or if he understood what his error could have cost them both.",
  "genres": [
    "M M Romance",
    "Dark",
    "Romance",
    "Contemporary",
    "Action",
    "Crime",
    "LGBT"
  ],
  "author": "Nicole  Castle",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/23718427-the-consequence-of-high-caliber"
}