{
  "title": "Barrel Child",
  "description": "What happens when mothers are forced to emigrate in search of economic opportunities to provide a better life for their children? What happens to the child? Feelings of abandonment... longing... anger... Barrel Child by Pamela K. Marshall is a fictional account of the struggles a family must overcome when circumstance forces proof of a mother's love to be sent via airmail, and the ripple effects of material things taking the place of a mother's presence. While the term \"barrel child\" is not widely known, the phenomenon's devastating effects on children and familial ties have long plagued Jamaica. With economic prospects declining in the country and almost half of Jamaican households headed by women, many mothers are forced to emigrate to the United States, Canada or Europe in search of employment and better economic opportunities to support their children. Sadly, these mothers must leave their children behind with close friends or relatives until they can amass the financial means to have their children join them overseas. Often, mothers are separated from their children for years, only able to send barrels of food, clothes, money and other sustenance to show their love. Such is the fate of Sara Lewis, a young woman left under her aunt and uncle's care while her mother ventures to America to set up a better life for them. The novel tells Sara's story from adolescence to young adulthood, with her thoughts and feelings interjected by the perspectives of others in her life, and details her search for love from the man in her life and the people around her. This story of love, expectations, parent-child conflict, cultural clash and family secrets is virtually impossible to put down once you start reading and become immersed in the protagonist's struggle to find herself and her place in the world, overcoming the psychological and emotional toll of being a barrel child to become a good mother to her own children.",
  "genres": [
    "Fiction"
  ],
  "author": "Pamela K. Marshall",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/11451647-barrel-child"
}