{
  "title": "October Dreams II: A Celebration of Halloween",
  "description": "Featuring Ray Bradbury, Dean Koontz, Robert McCammon, Robert Bloch, Stewart O’Nan, Glen Hirshberg, Joe R. Lansdale, Al Sarrantonio, Whitley Strieber, Lisa Morton, Matthew Costello, Elizabeth Massie, and dozens of others!October Dreams 2: A Celebration of Halloween edited by Richard Chizmar & Robert MorrishAbout the Book:The long-awaited follow up to one of the most acclaimed Halloween anthologies ever! This oversized volume will contain spooky Halloween short stories, dozens of authors and artists recalling their own personal memories of Halloween, and essays detailing the history of Halloween. Many of the contributing authors will also autograph the signed editions, which we don't expect will last long considering the popularity of the original October Dreams and the low print runs we have planned for these special editions.Contents:\"Mr. Dark’s Carnival\" by Glen Hirshberg\"Universal Horrors\" by Stephen Graham JonesMy Favorite Halloween Memory: \"Perspective\" by Michael McBride\"The Scariest Thing I Know\" by Dean Koontz\"Guising\" by Gemma FilesMy Favorite Halloween Memory: \"Gort Klaatu Barada Trick or Treat\" by Nancy HolderMy Favorite Halloween Memory: \"Under the Autumn Stars\" by Tim Waggoner\"Monsters\" by Stewart O’Nan\"Death and Disbursement\" by S.P. MiskowskiMy Favorite Halloween Memory: \"All the News\" by Karen Heuler\"Dear Dead Jenny\" by Ian McDowell\"What Blooms in Shadow Withers in Light\" by Richard GavinMy Favorite Halloween Memory by M. Rickert\"The ’Corn Factory\" by Benjamin Kane Ethridge\"In a Dark October\" by Joe R. LansdaleMy Favorite Halloween Memory: \"The Real Darkborn\" by Matthew Costello\"The October Game\" by Ray Bradbury\"Fear of Fallen Leaves\" by James NewmanMy Favorite Halloween Memory: \"Costume\" by Melanie TemMy Favorite Halloween Memory: \"Dancing With Mr. Death\" by Kealan Patrick Burke\"Scarecrow\" by Roberta Lannes\"Strange Candy\" by Robert McCammonMy Favorite Halloween Memory by Harry ShannonMy Favorite Halloween Memory: \"That Which Doesn’t Kill You Earns You Candy\" by Nate Southard\"The Pumpkin\" by Robert Bloch\"Mr. and Mrs. Werewolf \" by Whitley StrieberMy Favorite Halloween Memory: \"Rescuer?\" by Nicole CushingMy Favorite Halloween Memory by Ray Garton\"Great Pumpkins and Ghost Hunters: Halloween on TV\" by Lisa Morton\"The Pumpkin Smasher\" by Al Sarrantonio\"The House on Cottage Lane\" by Ronald MalfiMy Favorite Halloween Memory by Tim Curran\"The Dry Season\" by James A. Moore\"The Spirit of Things\" by John SkippMy Favorite Halloween Memory: \"Haunting Season\" by Orrin GreyMy Favorite Halloween Memory: \"The Witch of Walnut\" by Elizabeth Massie\"The Little Werewolf Who Cried\" by Al Magliochetti\"The Boy in the White Sheet\" by Bev VincentMy Favorite Halloween Memory by Richard GavinMy Favorite Halloween Memory: \"The Last Halloween\" by Ronald Kelly\"Sexy Pirate Girl\" by Lisa Morton\"Monster Night\" by Brian James FreemanMy Favorite Halloween Memory: \"Screams in the Asylum\" by James Newman\"Underfolk\" by Tina CallaghanMy Favorite Halloween Memory: \"Pumpkin Parade\" by Sephera Giron\"October Dreams\" by Michael Kelly",
  "genres": [
    "Horror",
    "Halloween",
    "Short Stories",
    "Anthologies"
  ],
  "author": "Richard  Chizmar",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/23733635-october-dreams-ii"
}