{
  "title": "The Complete Seaborn",
  "description": "The Complete Seaborn is the omnibus edition of the three books in the Seaborn Trilogy, along with all new transitional material, new stories, family trees, and a complete characters list for all the books.Saltwater WitchKassandra comes from the sea, but she has no memory of saltwater, seagulls, or an incoming tide. She's never seen an ocean, never heard the thunder of surf. She's an exile, betrayed by her own family, sent as far from the sea as they could arrange--somewhere in the middle of Nebraska.Everything changes the day she drowns in Red Bear Lake, and discovers she can't really drown. Not in the way everyone else can. Then a two-thousand year old king wakes inside her head and turns out to be a prodigy with mathematics. Kassandra cries for the first time in her life, and learns that her tears are doorways for calling things from the sea. With clues from summoned sea-demons and the voices in her head, Kassandra sets out to find out what the hell is going on...and discovers she's a prisoner, trapped between a murderous grandfather who controls an army of the drowned dead, river witches who spy on her through the plumbing, and Ms. Matrothy, the Girl's Department Director, who's been trying to kill her since she was four.SeabornCorina Lairsey has just clawed her way free from one controlling relationship when she finds herself in another-only this guy, Aleximor, has really gotten under her skin. Literally. A 400-year-old sorcerer who gathers the drowned dead off the ocean's floor for the King of the Seaborn, he's inside her head and is wearing her body like a wetsuit. Corina desperately schemes to regain control of her self, fighting against time as Aleximor trades pieces of her life away in exchange for power over the path between the worlds of the living and the dead . . . Kassandra is the King of the Seaborn's granddaughter. She comes from the sea, but has spent her whole life in exile on the surface, struggling to control frightening powers she barely understands. She declares war on her murderous grandfather and manipulates her family, friends, oceanic royalty, and the US Navy to aid her- but Aleximor intends to use Kass to carry out his revenge against the entire Seaborn royal line. And she's also fallen in love-one more struggle for an already troubled soul.Sea ThroneKassandra prepares for war against her grandfather, and is confronted on all sides. Nikasia, the daughter of the king's war-bard--who claims descent from Circe--seeks revenge for the murder of her father. A group of immortals bands together to take everything away, and Kassandra must take them on while holding her family together.",
  "genres": [
    "Fantasy",
    "Mermaids",
    "Urban Fantasy"
  ],
  "author": "Chris  Howard",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/11452283-the-complete-seaborn"
}