{
  "title": "Unbuttoning America: A Biography of \"Peyton Place\"",
  "description": "Published in 1956, Peyton Place became a bestseller and a literary phenomenon. A lurid and gripping story of murder, incest, female desire, and social injustice, it was consumed as avidly by readers as it was condemned by critics and the clergy. Its author, Grace Metalious, a housewife who grew up in poverty in a New Hampshire mill town and had aspired to be a writer from childhood, loosely based the novel's setting, characters, and incidents on real-life places, people, and events. The novel sold more than 30 million copies in hardcover and paperback, and it was adapted into a hit Hollywood film in 1957 and a popular television series that aired from 1964 to 1969. More than half a century later, the term \"Peyton Place\" is still in circulation as a code for a community harboring sordid secrets.In Unbuttoning America, Ardis Cameron mines extensive interviews, fan letters, and archival materials including contemporary cartoons and cover images from film posters and foreign editions to tell how the story of a patricide in a small New England village circulated over time and became a cultural phenomenon. She argues that Peyton Place, with its frank discussions of poverty, sexuality, class and ethnic discrimination, and small-town hypocrisy, was more than a tawdry potboiler. Metalious's depiction of how her three central female characters come to terms with their identity as women and sexual beings anticipated second-wave feminism. More broadly, Cameron asserts, the novel was also part of a larger postwar struggle over belonging and recognition. Fictionalizing contemporary realities, Metalious pushed to the surface the hidden talk and secret rebellions of a generation no longer willing to ignore the disparities and domestic constraints of Cold War America.",
  "genres": [
    "Nonfiction",
    "History",
    "Audiobook",
    "Books About Books",
    "Biography",
    "Sexuality",
    "Literary Criticism"
  ],
  "author": "Ardis Cameron",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/23737096-unbuttoning-america"
}