{
  "title": "Let Me Tell You: New Stories, Essays, and Other Writings",
  "description": "Named one of the best books of the year by NPR • From the renowned author of “The Lottery” and The Haunting of Hill House, a spectacular new volume of previously unpublished and uncollected stories, essays, and other writings.Features “Family Treasures,” nominated for the Edgar Award for Best Short StoryShirley Jackson is one of the most important American writers of the last hundred years. Since her death in 1965, her place in the landscape of twentieth-century fiction has grown only more exalted.As we approach the centenary of her birth comes this astonishing compilation of fifty-six pieces—more than forty of which have never been published before. Two of Jackson’s children co-edited this volume, culling through the vast archives of their mother’s papers at the Library of Congress, selecting only the very best for inclusion.Let Me Tell You brings together the deliciously eerie short stories Jackson is best known for, along with frank, inspiring lectures on writing; comic essays about her large, boisterous family; and whimsical drawings. Jackson’s landscape here is most frequently domestic: dinner parties and bridge, household budgets and homeward-bound commutes, children’s games and neighborly gossip. But this familiar setting is also her most subversive: She wields humor, terror, and the uncanny to explore the real challenges of marriage, parenting, and community—the pressure of social norms, the veins of distrust in love, the constant lack of time and space.For the first time, this collection showcases Shirley Jackson’s radically different modes of writing side by side. Together they show her to be a magnificent storyteller, a sharp, sly humorist, and a powerful feminist.This volume includes a foreword by the celebrated literary critic and Jackson biographer Ruth Franklin.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Essays",
    "Horror",
    "Classics",
    "Writing",
    "Adult"
  ],
  "author": "Shirley Jackson",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/23746546-let-me-tell-you"
}