{
  "title": "Taken by a Trillionaire",
  "description": "Three New York Times and USA Today bestselling authors.One wild project.Taken by a Trillionaire is an escapism fantasy that was born at a party at RWA. Over cocktails, J.S. Scott, Melody Anne, and Ruth Cardello laughed as they plotted this book with the help of two industry friends, Chris and Brian.If you are looking for a historically accurate representation of a monarchy or a serious depiction of how royals maintain their bloodlines, this may not be the book for you. If you love larger than life characters and fun storylines that take you to exotic places with sexy alpha men, then welcome to our imaginary kingdom: Rubare Collina. The men are insanely rich, the traditions are potentially deadly, and the sex will leave you craving a night on this dark isle.If you’ve ever fantasized about what it would be like to be swept off your feet—or tossed over a prince’s shoulder and taken—then you’ll enjoy our trilogy.Novella One: Xander by Ruth CardelloRoyal Prince Xander Demande needs to choose a wife before his thirtieth birthday, or he will lose his crown. His list of potential candidates is long but shortens to one woman after a brief encounter with the socially inept, but beautiful and brilliant, Dr. Reanna Fielding. She never thought Prince Charming would come for her. He never thought any woman would melt his heart. Love makes its own rules, but will it save her when she defies not only him but the laws of his kingdom? In Rubare Collina, a marriage proposal can be a dream come true—or a death sentence.Novella Two: Bryan by J.S. ScottGet married . . . or die. Prince Bryan Demande was left with only two unpalatable choices. When he decides to take his chances rather than marry, his father and the busybody royal adviser take matters into their own hands.Like it or not, Bryan is delivered a kidnapped bride, and it isn't a woman who's a total stranger. She's an American female who has haunted his dreams for the last five years, the only woman who has ever wanted him without his trillions of dollars or his royal title. Suddenly, marriage doesn't look like such a bad option to Bryan, but he'll have to convince his angry, kidnapped, bride-to-be that she belongs with him.Novella Three: Chris by Melody AnneChristopher Demande wants nothing to do with marriage and is willing to renounce his title to the throne to prove it. That is until he meets independent Adara Burnadette and decides he must have her. Unfortunately, Adara is opposed to marriages of convenience. So what does a young prince do when his chosen bride refuses his proposal? He kidnaps her of course.",
  "genres": [
    "Romance",
    "Anthologies",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Novella"
  ],
  "author": "Melody Anne",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/23737590-taken-by-a-trillionaire"
}