{
  "title": "Face Value",
  "description": "Hailed by critics for her brains, determination, and guts, San Francisco Bay Area lawyer and champion of not-yet-lost causes, Laura Di Palma, is back - and gutsier than ever. Laura's history of high-profile pro bono cases not only put her in the headlines but also recently cost her the position she had at a conservative law firm. Now, in Face Value, she is going it alone in private practice. Free from bureaucratic constraints at last, Laura takes on the most controversial - and dangerous - case of her career. When a distraught and disillusioned former devotee of northern California guru Brother Mike levels startling charges against him, a reluctant Laura eventually agrees to take the case. According to her new client, the spiritual leader was actually leading his unsuspecting flock into a terrible deceit, going so far as to tamper with video-tapes of his followers, which he then distributed as commercial pornography. Before Laura can even properly set up shop, her investigation sweeps her from the busy city streets of San Francisco to places beyond her wildest imaginings, where she meets a cast of mysterious people - all oddly influenced by Brother Mike. She begins at a striptease bar where, searching for clues, she instead finds herself face to face with seven murder victims. Her next stop is the guru's very own, very remote, but not-so private island, where she witnesses scenes almost as shocking as the mass murder itself. Back home she is \"welcomed\" by a series of deadly threats from someone eager to see her drop the investigation. But Laura has come too far to turn back now. With the help of private detective Sandy Arklett, her former colleague and close personal friend, Laura stays on course until she finds herself directly in the killer's line of fire and learns the final truth of this case: Nothing and no one can be taken at face value. Edgar Allan Poe Award nominee Lia Matera has pulled out all the stops in Face Value, her most dramatic and masterfully",
  "genres": [
    "Mystery"
  ],
  "author": "Lia Matera",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/2373590.Face_Value"
}