{
  "title": "My Lion's Heart: A Life for the Lions of Africa",
  "description": "Environmentalist, independent researcher and author, Gareth Patterson has spent his entire adult life working tirelessly for the greater protection of African wildlife and, more particularly, for that of the lion. Born in England in 1963, Gareth grew up in Nigeria and Malawi. From an early age he knew where his life's path would take him - it would be in Africa, and his life's work would be for the cause of the African wilderness and its wild inhabitants. His is an all-encompassing African story. From his childhood in West and East Africa to his study of a threatened lion population in a private reserve in Botswana to his work with George Adamson, celebrated as the 'Lion Man' of Africa, we witness Gareth's growing commitment to his life's mission. This is nowhere more evident than in his account of his life as a human member of a lion pride, experiencing life and death through its eyes, as he successfully rehabilitated three famous orphaned lion cubs back into a life in the wilds. At considerable risk to his own personal safety, he exposed the sordid canned lion 'industry' in South Africa, bringing this shameful practice to international attention. After moving to the Western Cape he took up the fight for the African elephant, notably the unique endangered Knysna population, and published his astonishing findings in his 2009 book The Secret Elephants . Perhaps unsurprisingly, given the stressful nature of his work, Gareth suffered a massive physical and mental breakdown in his forties, which he discusses here for the first time with an openness that underlines his courage. Lesser men might have been broken, but his 'lion's heart' fought back and he ultimately overcame his illness. Gareth Patterson's long-awaited autobiography is a moving account of one man's single-minded dedication to the preservation of Africa's wildlife. It is also a stark reminder that if the human race does not want to lose Africa's priceless wild heritage, there is no time to waste. 'The lion is my totem animal, and this is the story of my life in Africa, for the lion.'",
  "genres": [
    "Africa"
  ],
  "author": "Gareth Patterson",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/23753483-my-lion-s-heart"
}