{
  "title": "American Babylon: Race and the Struggle for Postwar Oakland",
  "description": "A gripping portrait of black power politics and the struggle for civil rights in postwar OaklandAs the birthplace of the Black Panthers and a nationwide tax revolt, California embodied a crucial motif of the postwar United States: the rise of suburbs and the decline of cities, a process in which black and white histories inextricably joined. American Babylon tells this story through Oakland and its nearby suburbs, tracing both the history of civil rights and black power politics as well as the history of suburbanization and home-owner politics. Robert Self shows that racial inequities in both New Deal and Great Society liberalism precipitated local struggles over land, jobs, taxes, and race within postwar metropolitan development. Black power and the tax revolt evolved together, in tension.American Babylon demonstrates that the history of civil rights and black liberation politics in California did not follow a southern model, but represented a long-term struggle for economic rights that began during the World War II years and continued through the rise of the Black Panthers in the late 1960s. This struggle yielded a wide-ranging and profound critique of postwar metropolitan development and its foundation of class and racial segregation. Self traces the roots of the 1978 tax revolt to the 1940s, when home owners, real estate brokers, and the federal government used racial segregation and industrial property taxes to forge a middle-class lifestyle centered on property ownership.Using the East Bay as a starting point, Robert Self gives us a richly detailed, engaging narrative that uniquely integrates the most important racial liberation struggles and class politics of postwar America.",
  "genres": [
    "History",
    "Race",
    "Nonfiction",
    "American History",
    "Politics",
    "Urban",
    "Urban Studies"
  ],
  "author": "Robert O. Self",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/114539.American_Babylon"
}