{
  "title": "Pitch Perfect: The Quest for Collegiate A Cappella Glory",
  "description": "Pitch Perfect is a behind-the-scenes look at the bizarre, often inspiring world of collegiate a cappella groups.The first collegiate a cappella group, the Yale Whiffenpoofs, was founded by Cole Porter back in 1909. But what had been largely an Ivy League phenomenon has, in the past fifteen years, exploded. And it's not what you think. There are now more than 1,200 a cappella groups at colleges across the country. The very best of these collegiate groups square off in the annual International Championship of Collegiate A Cappella showdown marked by wrenching close calls and exhilarating triumphs. And, really, where else can you hear Michael Jackson's Bad in four-part harmony? In Pitch Perfect, GQ editor Mickey Rapkin follows a season in a cappella through all its twists and turns, covering the breathtaking displays of vocal talent, the groupies (yes, a cappella singers have groupies), the rockstar partying (and run-ins with the law), and all the bitter rivalries. Along the way are encounters with boldfaced names such as President George W. Bush, Prince, David Letterman, Barack Obama, Barbra Streisand, Hillary Clinton, Marisa Tomei, Amanda Bynes, Nick Lachey, Merv Griffin, Jim Carrey, Microsoft's Paul Allen, John Legend, and Jessica Biel. At the heart of the narrative are three a cappella groups whose interactions are anything but harmonious: the historic Tufts Beelzebubs, founded more than forty years ago with 40,000 albums sold since, and struggling to record a new album that lives up to the hype; Divisi of the University of Oregon, a relatively new, all-female group attempting to overcome a loss in the 2005 championship; and the University of Virginia Hullabahoos, the so-called bad boys of collegiate a cappella, who will attempt to compete on a higher level this year while retaining their casual soul. Bringing a lively new twist to America's fascination with talent showdowns and peerless performers, Pitch Perfect is sure to strike a chord with readers.",
  "genres": [
    "Nonfiction",
    "Music",
    "Biography",
    "History",
    "College",
    "Humor",
    "Adult"
  ],
  "author": "Mickey Rapkin",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/2376467.Pitch_Perfect"
}