{
  "title": "Red Queen",
  "description": "Set on a California college campus just a decade or two from now, the world of Red Queen is post-terrorist disaster, repressive and censored — governed like China today, but with a stagnant economy and no jobs for young people. In that sense it is a dystopia, though not so far from our own day and time; only a few steps beyond where we are now. The students are cowed but not unaware, and they seize the opportunity to make a difference when their smarts and courage allow it. And so they change the world. This is Book 1 of Substrate Wars, the series: A growing band of campus freedom-fighters discover a new technology that could either destroy the world, or save it. They take on the responsibility of using it for good. Homeland Security is one step behind them. Spies and traitors lurk. Shall it be repressive bureaucratic stagnation, or expansion to the stars? Red Queen is a story about the yearning for freedom and agency in a world dominated by bureaucrats and propagandists, and it would not have been published by a major house. The world of Red Queen is just a decade or two away, and looks very much like the world we live in, just a few steps worse. In the tradition of Heinlein's If This Goes On--, I have extrapolated from current trends and imagined the politics that result. The authoritarian tendencies we see in modern western states will probably be reversed at some point--but what if they just keep getting worse? This is especially true of the US, with its 9/11-justified surveillance and interception of every citizen's email and message metadata, and a penal-industrial complex that imprisons about one in three black men at some point in their lives, often for victimless crimes like drug possession. A more serious terrorist incident might lead to even more restrictions on freedom and privacy. And that's where Red Queen begins.",
  "genres": [
    "Science Fiction",
    "Amazon",
    "Dystopia"
  ],
  "author": "Jeb Kinnison",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/23784452-red-queen"
}