{
  "title": "Genius Intelligence",
  "description": "The brain's potential IS the human potential!What if there are faster and easier ways to learn and study than the modi operandi currently being taught in mainstream education systems?GENIUS INTELLIGENCE: Secret Techniques and Technologies to Increase IQ is the ultimate treatise on accelerated learning methods. Written by novelists, filmmakers and independent researchers James Morcan & Lance Morcan with a foreword by leading scientist Dr. Takaaki Musha, this book shatters the myth that geniuses are born not developed. It reveals how most instances of above-the-ordinary intelligences are acquired thru superior cognitive techniques or brain enhancing technologies.Renowned geniuses examined include Apple founder Steve Jobs who as a 19-year-old began practicing an ancient discipline that activated previously dormant parts of his brain; Albert Einstein who came up with his great theory of relativity while using a rare method for accessing the subconscious mind; Kim Peek (the real ‘Rain Man’) who could speed read any book in five minutes flat with total comprehension; Indian mathematical mastermind Srinivasa Ramanujan who, although untrained, created extraordinary formulas that left academics gobsmacked; Wolfgang Amadeus Mozart who composed entire pieces while in a specific altered state of mind.Among the discoveries shared with readers are brain waves common to geniuses and the various ways to induce those brain waves; mental techniques the world’s elite and A-List celebrities are quietly using to help them process information while they’re asleep or in virtual worlds; chemical substances students and academics the world over employ to kick-start the brain into overdrive; and cutting-edge technologies business tycoons and professional athletes employ to gain a cerebral edge over their competitors.Drawing on the latest findings in neuroscience, GENIUS INTELLIGENCE lists dozens of practical methods to increase IQ and speed-learn any subject.“Talent hits a target no one else can hit. Genius hits a target no one else can see.” –Arthur Schopenhauer“The knowledge of all things is possible” –Leonardo da Vinci",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Science",
    "Neuroscience",
    "Self Help",
    "Education",
    "Brain"
  ],
  "author": "James Morcan",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/23782190-genius-intelligence"
}