{
  "title": "Nuclear Road Trip: Onward to Destruction",
  "description": "Terrorists are alive and well, busy with their sabotage of the United States, the country they expect to take over for themselves. A target city has been selected. A plan is in place. They are certain they can far surpass what happened to the twin towers in New York City on 9/11.Meanwhile one of the oldest nuclear power plants in the US has a major radiation leak. The power plant company does not want to reveal the severity of the accident. A cover-up is devised which shuts the plant down, but the inspectors, headed by John Rockford, are not to arrive for two weeks. The news has been reporting that nothing major has happened.The cover-up begins as the inspectors are ordered to take two-week vacation before arriving at the damaged nuclear plant. Four of these young scientists decide to use their vacation time to take a road trip down Route 66, heading toward a location outside of Chicago proper. In route, they discover it is now a well-traveled road, with much to offer. They make stops along the way, sitting upon the world's largest rocking chair, visiting with armadillos, and generally amusing themselves as they get to know each other. Valeria and Travis are in the back seat of John’s SUV. Aadhil is up front by John. Bear- Lee-a-Dog sits wherever he can.Tressa, the fifth nuclear scientist, a gorgeous tall blond who lives in Northern California, decides to take a more direct approach, and travels a different route. She stops along the way and meets up with a variety of people, some who seem to be planning foreboding things. Everyone meets in Chicago before their vacations are at an end, and spend time sightseeing there.After playing, they catch up on the news being reported about the radiation leak. Suspicions arise and begin to be discussed among them that these news stories are false. They decide to end their vacation early and go to the plant. The aged Morristown Nuclear Power Plant is the same type of plant as the Fukushima Nuclear Power Plant in Japan; it, too, had a boiling water reactor. While they tour the plant, they discover the plant is fraught with malfunctions and gross deterioration from an utter lack of proper maintenance. Some of the dangers can even be seen by the naked eye. Why has this occurred? It seems the money for the plant has not been well-spent or not spent on maintenance at all.The group realizes their own safety is on the line in this catastrophe-in-the-making. The sooner they are done with their inspection, and have given their recommendations in writing, the faster they can leave the area. They feel the vacation was a ruse, and begin to work long shifts, continuing to find an alarming number of issues at hand, most of which could not be ignored any longer. It does not matter what the owner, Pancorp, or Erich, the Plant Manager think. Life becomes very interesting and eventful, fraught with disaster as everyone struggles for the outcome each desires. Also, it seems there might be a traitor among them.Theirs is a saga of cover-ups, intrigue, espionage, sabotage and terrorism; theirs is the future of what will happen should terrorists attack a Nuclear Reactor Power Plant, and how individuals are torn asunder and pulled back together.",
  "genres": [],
  "author": "Barbara Billig",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/23785907-nuclear-road-trip"
}