{
  "title": "The Gallows Gem of Prallyn",
  "description": "How far would you go to be free from religious persecution? How would you liberate your believers in a land where its state religion is so entrenched that the church enjoys the privilege of having a standing army? What if you thought the only way to disestablish the church was to pit the crown against it, weakening both and creating the conditions to install a new regime? What if your plan put thousands of lives at risk? Would you pursue your ends? These questions bubble in Charano the Bright’s mind as Prallyn stews through an unprecedented drought and heat wave.Nerves are on edge in Thrylland’s capital city as the heat rises. The nobility are locked in a bitter, often deadly, debate on whether to constrain the king, each camp led by a duke with his own agenda. Only the Duke of Blackabbey seems to place the people’s interest ahead of his own as he protects the realm from the incursions of the Altapi, barbaric savages threatening the land’s western borders. At the same time, the Guardian Church’s prelates argue over allegations that its Ecclesiastical Guard has massacred pious followers. The only person seemingly unworried about something is King Jerryn IV, busy as he is attending the theatre.When an unexpected spark of insurrection arises among the poor, Charano the Bright, who practices his religion in secret from fear of persecution, decides that the time is right for liberating his congregation from the dictates of the Guardian Church. In his efforts, he will be joined by the Red Fox, a part-time weapons merchant and full-time rogue, as well as his spider web of contacts, the threads of which reach the inner chambers of the Saint Garyn Temple as well as the king’s cabinet table.Against this backdrop, Siko Bikoyo, a Baranthu witch secretly slips into Prallyn, for she believes that the heatwave and brewing rancour might have an ominous, dangerous source, a long-shrouded power that is growing in strength. Charano the Bright is forced to contemplate a final question. What if the dynamics at play that are being manipulated, are being manipulated not by him, but by someone … or something … else?",
  "genres": [
    "Fantasy"
  ],
  "author": "Ian  H. McKinley",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/23775653-the-gallows-gem-of-prallyn"
}