{
  "title": "Estate Series Box Set",
  "description": "The first three books in the best selling Estate Series Total word count of approximately 300k words Book 1: JOSEPH FALLEN There is a fine line between genius and madness… Between love and hate, Between right and wrong. Joseph had created The Estate for her… His wife, The woman he chose to bear his child. She was beauty unsurpassed; And her song was unlike anything he’d ever known. However, their love was a story that would not find a happy ending. In this prequel novella to the Estate series, follow Joseph Carmichael as he creates a world unlike any other. Because, in order to comprehend The Estate, you must understand Joseph; but, in order to understand Joseph, you must discover how a man falls from light into the pitch black depths of ultimate darkness. ------------------------------------------------ Book Two: MADELEINE ABDUCTED She was meant to be his destruction… A pawn played in a perilous game between father and son… Yet, her strength was more than either man could imagine. As Maddy learns to save herself… She becomes the one thing that could set the son free. Madeleine Clark was raised to become a concert cellist. Sheltered and naïve, she remains hidden behind her music, a protection from the world around her. On the night of her first solo performance, Maddy accepts the admiration of a stranger and finds herself captive in a cruel and twisted power struggle between a sadistic father and his son, Aaron. Seemingly dangerous and uncaring, Aaron manages the business operations of his father’s estate. Wanting nothing to do with the slaves kept at the Estate, Aaron refuses to take part in the deeper depravities of his father. Despite his resistance, Aaron’s father ‘gifts’ him with a petite, brunette woman he can’t refuse. A bond forged in conspiracy and deceit, Aaron struggles to save Maddy by teaching her to survive in the world in which he’d been raised. An unlikely union, Aaron soon learns that great strengths can exist within small packages, while Madeleine learns that love and light can exist in the darkest of places. --------------------------------------- Book Three: HOPE RESTRAINED She was meant to be his assassin A forced player in a rivalry within The Estate Yet her loyalty was to no person but herself When Hope is taken captive by Xander Black She becomes the one thing that can ensure Aaron’s reign Raised within a rival crime network, Hope Delacroix wanted nothing to do with The Estate. A fierce warrior, Hope is given no choice but to kill Aaron Carmichael. Caught in her attempt, Hope is captured by Aaron’s top guard in an effort to discover who sent her. Ever loyal and protective, Xander Black’s sole objective is to defend Aaron and Maddy. Willing to do whatever is necessary, Xander gives in to darkness in order to force information out of Hope. As Xander enslaves Hope to break her down completely, he learns that in the two years since Joseph Carmichael’s death, dissension still exists within The Estate. “I find it ironic that your name is Hope…especially considering that you have none.” ~ Xander Black *Disclaimer* The Estate Box series is intended for mature audiences only (18+) and contains graphic description of violence and sexual situations.",
  "genres": [
    "Dark Romance",
    "Dark",
    "Contemporary"
  ],
  "author": "M.S. Willis",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/23785091-estate-series-box-set"
}