{
  "title": "The Back Building",
  "description": "Iona Mueller arrives alone at the Willard Asylum for the Insane in this epic tale that spans a century. Through the Mueller family we take a deep look at what it means to be mentally ill in the year 1915 and in the present day.By the time she reached fifteen years old, Iona had failed to become a “proper young lady” which profoundly concerned her parents. Her one and only friend, Hetty, the family maid, warned her not to disobey them but Iona couldn’t help herself. Iona’s quirk of counting steps may have been overlooked but when her mother and father learned of her exploits in the woods near her home in Ithaca, New York, she was taken to the town doctor. The doctor took one look at her self-cut short, mangled hair, learned of her bizarre behavior, and declared her insane.At Willard Asylum on Seneca Lake there were plenty of activities to occupy her, including the job she procured working in the barn. Besides, she knew she was not anything like the crazy patients that banged their heads against the cinder walls until they bled or ran naked through the hallways. She was disobedient, that was true, and she would change. If only her parents would accept her correspondence and allow her to return home.Iona’s new roommate, Cat, made every night a fight for survival. When Iona was caught trying to run away she was sent to the second ward, where her fate was sealed. Subject to tranquilizers and hydrotherapy, ice baths and physical beatings, Iona had only one thing on her mind. She had to stay away from the back building. Once you were placed there you were never seen again.Iona met James at the institution’s barn. His kindness made the deprivation more bearable. He recognized that the violet hollows beneath her eyes, the bruises on her arms, and her apparent unraveling were the effect of the second ward. A plan was put into place, one that would remove Iona from harm’s way permanently.In present day, it is Jenna, a young relative of Iona’s, who is plagued with mental illness. Jenna’s odd behaviors, bizarre language, and confusion disrupt her once perfectly normal life. Jenna’s family members trace their roots back to Iona in hopes of understanding their predisposition to mental illness. The journey leads them to an amazing discovery of the suitcases left behind by hundreds of patients at the Willard Asylum.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Mental Health",
    "Mental Illness",
    "Psychology",
    "Historical",
    "Dark"
  ],
  "author": "Julie Dewey",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/23787073-the-back-building"
}