{
  "title": "Treasured Moments",
  "description": "A Moment in Time - Kelly CozzoneAlexa Wright is a happily married mother. Her son, Eric, was born in a previous marriage and he struggles with his place in both families. She has vowed to make the best decision for her son. Eric wants to live with his dad. How can she possibly figure out what the right decision is?Haunted Raine - R.E. HargraveLorraine Morrissey let life pass her by. Her wake up call comes when she realizes that her husband is rarely home, and she's filling her days with trivial tasks. A crazy idea to save her marriage leads to a summer vacation unlike any she's ever taken; one that involves buying a haunted house.Coming Home - Teri RiggsAbby, a young Navy SEAL's wife, must learn to cope after her husband dies in the line of duty. Hoping to learn how her husband spent his final days, she heads to Bethesda to sit with her husband's best friend, a soldier who remains in a coma caused by the same IED blast that killed her husband. But can anything mend Abby's broken heart?15 W. Gibson - Aubree LaneKnowing Uncle Sam is about to come knocking, Jimmy Franks enlists in the Navy. Leaving Suzy is the hardest thing he's ever had to do.Left alone to deal with their feuding families, Suzy Franks is heartbroken when Jimmy ships out. Her husband's letters of love brings comfort, but 15 W. Gibson is a lonely place without him.The Agent - Samantha JacobeyAn author of dark tales is looking for someone to represent her. An agent who thinks all writers are the same wants the job. Will one lunch date be enough to convince him that she's different, or will her clouded past continue to overshadow her future?The Bench - Nikki Lynn BarrettTen years ago, Neil spent a summer with his grandparents when he couldn't deal with problems at home. That one summer led him to his first love, Amber, until a family crisis pulled him away. Now he's back in town and face to face with the woman he never could forget.Summer Song - Linda Lee WilliamsJune Gorman might be imprisoned in a nursing home, but her mind roams free. In her private world, memories and melodies go hand in hand. Every day she embarks on a musical journey through her life, one filled with laughter, love, pain, and tears ... her summer song.Crazy Love - Jayne HyattWill Meg be forced to resort to using the crazy family tradition, which she has spent most of her life avoiding, in order to win the man of her dreams?The Treasured Legacy - Holly BarboLeone uses the last of her strength to share important family history with her only her grandson David. Despite her final wish not to sell the family heirlooms, David and his wife, Anne, look into it because of their desperate need for money. But the pieces have secrets and the young couple finds themselves in unexpected danger.Ghost Lost - Jami BrumfieldGhost Connection is a series centered around Cassandra O'Grady and her unwanted ability to see spirits. In episode one, Cassie and her ghostly best friend, Abel, help a girl save her family from a jealous boyfriend.Poppy - Cherime MacFarlaneA teenage girl learns that the father she adores is not her real father. From her friend's dad, Emma Kay learns her Poppy won her and her mother on the turn of a card. Wrecking her mother's car does not help.Camael's Gift - Michele E. GwynnIn the heavenly realms, conflict and war are as routine as escorting souls to the other side. For Camael, his routine has just been disrupted as he finds himself drawn to a human woman he encounters while comforting her dying child.Life Storms - Terri Hubbard CarleThroughout life, you face many types of storms. Learning to trust, believe, have faith and stand strong, will help Carley and her family, as well as Carley and Chad grow closer and stronger.The Tree House - J.B. YarbroughThe day her brother is born, Izzy hears the words Down Syndrome for the first time. Frightened, she runs to the safety of her tree house.",
  "genres": [],
  "author": "R.E. Hargrave",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/23787341-treasured-moments"
}