{
  "title": "Hellfire Riders Vol. 1-3",
  "description": "Collecting the first three novellas in the Hellfire Riders series, this box set features the complete story of one couple -- the president of the Hellfire Riders MC, Saxon Gray, and Jenny Erickson, the woman he'd cross any line to have...Wanting It AllHe's the one man I can never have, but the only one I crave... Saxon Gray has reason to hate me. He spent five years in prison after saving me from a brutal violation at the hands of a rival motorcycle club - and he paid for that rescue with his freedom. I've never been able to settle the debt I owe him...until now.The menace of that old rivalry is flaring up again, and as president of the Hellfire Riders, Saxon is the one man who can keep me safe. But I want more than his protection. I want his heart. Taking It AllHeaven is finally having Saxon Gray in my arms. Hell is knowing that I might lose him.After I spent years loving him from a distance, the president of the Hellfire Riders MC is finally mine. Every day he's at my side; every night he's in my bed. It would be everything I'd ever wanted, except my dad is sick, and trouble is brewing now that Saxon's club is taking over my father's. Because bad blood between the two MCs still lingers, and an old rule requiring Saxon to share me with the other club members is being used as a weapon, forcing him to choose between me and the Hellfire Riders.And I don't know if he'll choose me... or how far I might go to keep him.Having It AllNow that Jenny Erickson is mine, I've got everything I want. Until one shotgun blast almost rips it away...As president of the Hellfire Riders, there's two things I care protecting my woman and destroying the Eighty-Eight before they take everything I've fought for. They've hurt Jenny before and I swore that I'd rip out my own heart before they hurt her again. Every heated touch, every scorching kiss is a promise to keep her safe. Now the Eighty-Eight is coming for me--and no matter what it takes, I'm not going to let them lay a finger on her. I'll sacrifice anything to protect her. My freedom. My heart.Even my life.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Adult",
    "Anthologies",
    "Suspense",
    "Motorcycle"
  ],
  "author": "Kati Wilde",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/23789378-hellfire-riders-vol-1-3"
}