{
  "title": "Blue's Point",
  "description": "KIRKUS REVIEWIn Ferguson’s (The Thin Line Between Life and Death, 2013, etc.) thriller, a just-released convict and a journalist travel to a small Texas town where racial tension breeds contempt and violence.Steve Cox returns to Blue’s Point 10 years after his conviction for killing a black man. The prison released him into the custody of old Jim Blue, whose family has owned Blue’s Point and neighboring Freedman’s Town for decades. At the same time, black magazine writer Mykeisha “Mike” Ali rides into town, planning to expose Blue’s Point as a cesspool of racism where the Klan and skinheads run rampant, threatening (and sometimes killing) black people. Both Steve and Mike, however, may be a hindrance to a diabolical plot already under way, and there are men willing to resort to murder to keep the two quiet. Ferguson firmly establishes the story’s racial theme. Mike, for instance, is attacked by skinheads simply for stopping to get gas, and it’s abundantly clear that Freedman’s Town is a community for the blacks unwelcome in Blue’s Point. Ferguson fortunately allows the theme to enhance the novel rather than drive it. Steve, for one, is invested in finding who killed his father, who had been the Klan’s Grand Dragon, and he quickly learns that the murder that sent him to jail may have been a frame job. Establishing the villains, like the repugnant Tommy Saunder, reveals different levels of racism, some derived from ignorance, some from pure hatred. ...Ferguson further augments his tale with drama—e.g., unresolved issues with Steve’s high school football pal, police chief Champ Lee—a hint of romance between Steve and Mike, and a surprising amount of whoever framed Steve for murder may very well be trying to do it again.Respectful and astute handling of serious social conflicts in a satisfying yarn. --Kirkus ReviewsReviewed by Divine Zape for Readers' FavoriteBlue's Point by Richard Ferguson is a story with a strong setting and a well-developed racial theme, a thriller that will have the reader’s eyes glued to the pages. Meet ex-convict, journalist Steve Cox, recently released to the custody of old Jim Blue, the man whose family has owned Blue’s Point and the adjacent Freedman’s Town for decades. Mykeisha Ali is a black magazine writer who has just arrived in town on a mission to expose Blue’s Point as a breeding point for racism and violence, a turf for the Klan that would not hesitate to kill black men. Steve is determined to find his father’s killer, but little does he know that he and Mike could be great hindrances to a deadly plan that is underway, and some men will do anything to stop them, including murder.Blue's Point is a story that powerfully showcases murder investigation, crime, and racism in a thrilling tale that will enthrall readers who are into well-plotted novels with compelling settings. Readers will enjoy the historical elements of the story, the brilliant social and cultural commentaries, and Richard Ferguson’s beautiful prose. The characters are wonderfully developed and the author does an awesome job in exploring their personalities, unveiling their psychological depths, and thrusting them into a conflict that drives the plot ahead. The dialogues feel very natural and readers will enjoy the unique phraseology that seems to be Ferguson’s signature, the descriptions of the plot and characters, and the vivid setting. This is a spellbinding story with a huge conflict and a satisfying end.",
  "genres": [],
  "author": "Richard   Ferguson",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/23784619-blue-s-point"
}