{
  "title": "Milked Into Thrall",
  "description": "Heather Childe always gets what she wants. Always. Or at least that’s what she keeps telling herself. She might have been born into poverty. She might have spent the majority of her life taking care of a mother who never wanted to take care of her. And she might have even blown through a fortune in student loans just so she could pretend to have the life she always wanted. But that’s all about to change now. A new man has come to town, a rich man, a man who can finally give her the life of pleasure she’s always dreamed of. And that’s what Heather wants more than anything. Pleasure. She’s dealt with pain and sacrifice long enough. It’s her turn to be happy. But is the pleasure Mr. Mason has to offer her worth the price he demands? To Heather Childe it is. She’ll give him her body, her soul, and even her freedom. She’ll become the slave Mr. Mason demands, and she’ll learn to like it. She knows she’ll like it. After all, any life has to be better than the one she has now, right? Heather might think she can handle whatever Mason has planned, but soon she’ll learn the truth. He’ll take her. He’ll train her. And he’ll even transform her, too. Under his care, her breasts will grow. Her milk will fall. Her humanity will slowly slip away, and she’ll become the true creature of pleasure she always claimed she was, a creature with only one desire, a desire to be milked. To be milked…into Thrall. Newly revised and expanded, MILKED INTO THRALL is a 42,000 word erotica featuring BDSM themes including bondage, domination, lactation, milking, pet play, pony play, and dark sexual encounters involving male/female, and female/female pairings. This is a work of fiction meant for an adult audience. All characters are over 18. The author does not condone or endorse any of the behaviors carried out by its characters. For anyone interested in learning more about Thrall's secrets, the full-length novel, HIS BLACK PEARL, is a 53,000 word BDSM erotica which follows the capture and training of Adair Bartlett, another woman who learns just how strong the calling to Thrall truly can be. Her story can also be found on this site for download as well as Marissa Black's story in HIS BLACK BEAUTY, the 118,000 word second book of the Thrall Series. Other works by Jena Cryer also include the 92,000 word A SLAVE FOR THE MILKING series and the 62,000 word MILKED BY ROYALTY series, each available for download in parts or as the full collection.",
  "genres": [
    "BDSM",
    "Erotica",
    "Dark",
    "M F Romance"
  ],
  "author": "Jena Cryer",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/23789795-milked-into-thrall"
}