{
  "title": "Eden High: Series 1",
  "description": "This ebook contains the following works  Eden High Book 1  Sian Claiborne is not a happy camper. Just when she was getting into the groove of high school hijinks, her parents decides to pick up stakes. Now the popular cheerleader is off to the ritz and glamor of the Hollywood Hills, where her new school is home to the offspring of Hollywood's elite. Determined to hold her own, she befriends one of the school's outcast on her first day, thus drawing a line in the sand between her and the ever popular 'Mean Girls'. Little does she care, until she claps eyes on Jace Saunders and almost loses her pompoms. Of course the head cheerleader already has her eyes among other things set on Jace and lets Sian know in no uncertain terms that he's off limits. What's a girl to do when the first guy to make her heart go pitter patter seems to already be taken?  Eden High Book 2  Jace Saunders has taken one look at the new girl and this son of Hollywood royalty wants what he see. But Jace has history with the most popular girl in school, a girl who has already warned off Sian, and what about Sian's parents? Are they going to allow their daughter to date someone as high profile as Jace?  Eden High Book 3  Now that Jace has staked his claim, will things settle down for him and Sian or will rumors come between them? And what is going on with little Cassandra, what secret does she share with the school's heartthrob?  Eden High Book 4  Now that he has staked his claim Jace and Sian are the new 'It' couple and there's love in the air , not only for these two lovebirds, but their friends seem to have been bitten by the bug. Not everyone is thrilled at the sight of the rock on Sian's finger, that everyone knows is a sure sign of Jace's love and commitment to her, something that at least one member of the student body had always thought would be hers. What happens when Mandy starts to unravel and her secret lies get out of hand? How many people will she hurt to keep the truth from coming out?  Eden High Book 5  Sian might have seen something she shouldn't have. How will she deal with her suspicions and who can she share them with? If what she suspects gets out, it can destroy a lot of lives, but she's tired of spending so much time on her arch enemy. Should she dig deeper on her own, or was it just a figment of her imagination?  Eden High Book 6  With Sian in a coma, Jace is torn between looking for answers and staying by her side. Meanwhile her enemies, unaware as yet that she's been found are celebrating their good fortune. Mandy is sure that the way is now clear for her to get Jace back in her clutches and has all intentions on getting started on that right away. But soon word of Sian's return gets around and things start to unravel for some of Eden Heights most influential families.",
  "genres": [
    "New Adult",
    "High School",
    "Young Adult",
    "Romance",
    "Erotic Romance",
    "Contemporary",
    "Romantic Suspense"
  ],
  "author": "Jordan Silver",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/23792053-eden-high"
}