{
  "title": "Cruel Devices 2: Taboo Punishment Collection",
  "description": "Warning: This second, ultimate box set of taboo fantasies contains extreme bondage and punishment, including the use of cruel devices of torture and pain. It is highly explicit and for mature readers and lovers of forbidden temptation only!  Hot and controversial, these three latest installments of J D Cirque’s best-selling ‘punishment’ books are now available in the one complete bundle ready to burn your Kindle alive. Included stories include:  PUNISHED ON THE GALLOWS Untouched sailor Anna knows the price of piracy in these parts. Sentenced to death and brought to the gallows, all she wishes for is a quick end, but the commander and hangman will not be sated so easily. Noose around her neck, Anna is made to endure their cruel actions while her body betrays her, soon to learn that the trapdoor that creaks under her feet is the least of her worries. Contains: Extreme bondage, multiple penetration and erotic asphyxiation themes with strong bodily penance.  PUNISHED IN THE COFFIN Innocent village girl Annabelle is witness to a strange, pagan gathering in the woods that sparks something deep in her core. As she watches the naked figures dance and couple below, her body cannot help but respond, but little does she know she is the one being watched. Forced to the Altar, Annabelle loses all sense of time as she is placed into the waiting casket and lowered into the earth. In the darkness she's about to learn that the coffin in which she is confined holds many secrets - secrets that are about to propel her to dark and frightening sexual heights. Contains: First-time defloration, enclosed bondage, multiple penetration, group menage and more.  PUNISHED ON THE WHIPPING POST Convict girl Grace hoped to find a better life in the colonies. When a suitor makes her his wife, hope blooms... until she learns of his dark and taboo desires. Accused by her own husband of adultery, Grace is sentenced to fifty lashings at the whipping post. Her husband delivers the sentence as the village men watch, but little does she know that by the day's end she will service every one of them. Contains: Strong bondage, group, multiple penetration, spanking, flogging and reluctant bodily penance.",
  "genres": [],
  "author": "J.D. Cirque",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/23803165-cruel-devices-2"
}