{
  "title": "Night School: Genesis",
  "description": "Allie Sheridan’s world is falling apart. Her brother’s run away from home. Her parents ignore her. And she’s just been arrested. \nAgain.\n  This time her parents have had enough. They send Allie to Cimmeria Academy - far away from her London friends. The school is beautiful, and filled with gorgeous, ultra-wealthy teens who travel by private jet, and were raised by nannies.  Allie has never felt more of an outsider.  Instead of hating boarding school though, Allie begins to feel happy. She's slowly making friends. And there's Carter, a brooding loner with whom she feels an instant connection.  But when Allie is attacked late one night, the school suddenly begins to feel like a very dangerous place. Allie finds out that nothing at Cimmeria is what it seems.  And that she is not who she thought she was…   What people are saying about Night School  ‘Imagine a mixture of Hogwarts and Mallory Towers but filled with murder instead of magic. That is what you get. This book blew me away… The truth behind Night School really amazed me and it is definitely something I haven’t read before… This is definitely not a book to read whilst you are busy, as you will find yourself cursing at your lack of time to finish it. A chilling, nerve racking, nail biting thriller that left me wanting more.’ Serendipity Reviews  ‘…one of the best books I have read this year… If you love C.L. Stone’s (Ghost Bird and The Academy) series, you will enjoy reading Night School – Genesis!’ The Avid Reader  ‘What a brilliant debut novel. I absolutely cannot wait to jump headfirst into the sequel. If you trust me at all, YOU WILL READ THIS.’ Read Me Bookmark Me Love Me  'Night School is dramatic and full of great characters, the perfect blend of suspense and romance.' Sophie McKenzie  ‘C.J. Daugherty does a brilliant job of keeping the truth just out of reach from the reader by offering many different, plausible possibilities. I love books that make me think about where the plot is going even though I never quite get it right. While it’s fun to guess, it’s more fun to be surprised…’ Pretty Books  ‘New series alert!! *flashing red light* This is the series to look out for... Cimmeria Academy (I need me somebody to tell me how to pronounce it!) has mystery, murder and some mayhem and boys, boys, boys!!(so very important, hee..hee) and of course the bitchy girl... An awesome start to this series.... my mind boggles where it will be going as there is mystery, mystery, mystery.’ Novels on the Run Blog  ‘Let me be absolutely clear on this, Night School is pure awesome sauce, just not what you would have expected from the title. First of all, it’s not some silly paranormal YA. More of a murder mystery with few good old conspiracy theories and secret societies thrown in. Secondly, can I just gush about Allie and Carter? *insert gushing now* I haven’t read about such two gorgeous level-headed and mature teenagers since Brightest Kind of Darkness by P.T.Michelle. Absolutely loved this book and highly recommend it to everyone! Nocturnal Book Reviews",
  "genres": [
    "Young Adult",
    "Mystery",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Fiction",
    "Thriller"
  ],
  "author": "C.J. Daugherty",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/23790944-night-school"
}