{
  "title": "The Coalition",
  "description": "Our story is set in the not-too-distant future. Muslims have succeeded in becoming the majority of several European populations, adding to their dominance in the Middle East. With the accelerating spread of radical Islam and Sharia law as the backdrop, our character-driven novel tells the story of a divided world and two men who epitomize the ideological chasm. The collision of these forces is predictable, the fallout is anything but.Blake Kershaw, native son of Virginia, joined the Army out of high school and pushed through years of training to join the elite Special Forces. After recovering from multiple injuries acquired in the Hindu Kush, he pursued college to advance his career. Blake’s character and refined skills make him a choice recruit for agencies operating at the leading edge of the war on terror.The Sodality, (operating publically as Global Reparations, an NGO) was formed by a small group of mostly American retired military leaders, businessmen, politicians, and ministers. What started as a loose connection of friends and colleagues crystallized into a powerful network dedicated to fighting the onslaught of global jihad and those conspiring with them for their own agendas.Based in the Czech Republic with facilities in fifteen locations worldwide, the Sodality runs missions ranging from sabotaging terrorist finances and supply lines to assassinations of terrorist leaders. Their formation and activities were inspired by relentless attacks on a constitutional republic, attacks on the West, and fecklessness government leaders.Omar, born and raised in Lebanon is rescued and taken in by the Muslim Brotherhood at the age of seven. His intelligence and strength flourish under the tutelage of a powerful and well-connected jihadist. The lessons learned at the feet of his mother and father inculcates Omar with a deep understanding of Islam and hatred for anyone outside the faith, especially the Zionists and their allies.His dedication and training rewards Omar with favor from his superiors and ascension through the ranks. He becomes the go-to guy for the most important and dangerous missions, including arms transfers, kidnappings, assassinations, and incursion assaults.The Organization of Islamic Sura Councils, an international assemblage of Islamic leaders in religion, business, and politics from fifty-seven nations formed to coordinate the myriad jihadist groups toward a global caliphate. Though it seems to the outside world Islam is united, a deep division followed the death of Mohammad and the struggle over who would take the reins of power. The world media is helpful in limiting the exposure of the violence between the factions and the resulting alliances connecting governments and sects.As the spread of the Muslim religion accelerates toward dominance, the war between Sunnis and Shi’as is subjugated to the common desire to destroy Israel and America. They can divide the world between them after the Great Satan is obliterated.As Omar’s accomplishments compile, he moves closer to the OISC power base. He lusts after greater recognition and ascension to the upper echelons of the council. His pursuit also makes him a target in the sites of the Sodality.The paths of our main characters are destined to cross and when they do, a series of events are ignited neither could predict nor want. The ultimate result of their conflict will take our readers by surprise.Global Reparations approaches Blake Kershaw when he leaves the military after an assignment with Delta Force. Because he remained officially dead according to public record, he was the ideal choice to carry out precise missions against jihadist targets. Omar is the enticement used to recruit Blake and becomes his singular obsession. Battle, as they say, is always a fluid environment and in this case Blake finds it’s also toxic. The skewed outcome of their war sets a series of plotlines in motion which reach a climax of mangled relationships.",
  "genres": [],
  "author": "William G. Boykin",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/23789837-the-coalition"
}