{
  "title": "The Darkbow Collection - Six Epic Fantasy Novels",
  "description": "This specially-priced set collects the first six novels in the Kron Darkbow series of The Ursian Chronicles.  CITY OF ROGUES: Book I of The Kobalos Trilogy  Kron Darkbow seeks vengeance, and he plans to have it no matter the costs. Returning to the city of his birth after 15 years, he hunts down the wizard responsible for the deaths of those he loved only to find out another was responsible for the murders. That other is Belgad the Liar, a former barbarian chieftain who is now boss of the city's underworld.   ROAD TO WRATH: Book II of The Kobalos Trilogy  Kron Darkbow has fled the city of Bond, along with healer mage Randall Tendbones and professional duelist Adara Corvus. Everywhere they turn are enemies.  Even the goal of their travels offers no peace, for the group rides to the land of Kobalos where Randall must face that nation’s Lord Verkain, the alleged Dark King of the North.   DARK KING OF THE NORTH: Book III of The Kobalos Trilogy  Kron Darkbow and companions have survived the mean streets of the city of Bond and the dangers of the Prison Lands, but now they dare to journey into Kobalos, a dark northern land ruled by King Verkain, a powerful mage rumored to be immortal and mad.   Always on their trail is underworld crime boss Belgad the Liar and his crew of deadly killers. Not only does Belgad seek vengeance against Kron, but he also wants to capture Kron's friend, the healer Randall Tendbones, the last of Verkain's children whom the king wants dead.   It is in Kobalos, in the darkest of hours, alone with enemies all around, Darkbow becomes the last hope for all. But to defeat his foes, first he must learn to defeat his own rage.  GHOSTS OF THE ASYLUM: Book I of The Horrors of Bond Trilogy  The streets of the city of Bond boil with discontent.   Political struggles within a power vacuum bring dreams of dominance to some among the lower levels of the city’s underbelly. Common thugs and guild bosses alike conspire together, their goal to eliminate the figure of Kron Darkbow.   Permanently.   Kron has become a symbol on the streets, and his removal would not only clear the way for others, but also would be a sign of who has the real power in Bond.   Amidst the chaos, buildings burn, riots go nearly unchecked, and even the city guard find themselves forced to retreat.   DEMON CHAINS: Book II of The Horrors of Bond Trilogy  A sick murderer stalks the streets of the city of Bond.   The killer leaves behind tortured and twisted bodies sliced and ripped apart, often after the most horrible of violations.  It falls upon Kron Darkbow to hunt this killer preying upon the weak and the strong alike, but he soon realizes there is more than one culprit involved in these horrible crimes. A dark mage and his demon partner are at fault, and with each death they grow more and more powerful.   THE COMPANY OF SEVEN: Book III of The Horrors of Bond Trilogy  An undead mage thousands of years old slinks through the city of Bond.   Rising up from beneath the soil, he soon finds himself allied with escaped fugitives from the Prisonlands, a former knight, a pair of assassins and the chief of thieves.   Each has their own wants, their own goals, but the wizard's are the most deadly to the citizens of Bond, and he refuses to be denied his destiny.",
  "genres": [
    "Fantasy"
  ],
  "author": "Ty Johnston",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/23795967-the-darkbow-collection---six-epic-fantasy-novels"
}