{
  "title": "White Wind Rising",
  "description": "Product Description  WHITE WIND RISING is part one in the coming-of-age fantasy series GUNPOWDER AND ALCHEMY from author Dan Davis set in a vivid alternative history of 17th Century Civil War England where magic and dragons are a reality.  Archer simply wanted to ask the Alchemist for a little more food for his family this winter. For his troubles he is thrown into prison and must escape from the Alchemist’s Tower armed with nothing more than his bow and his wits.  As he does so he discovers he is not the only captive in the tower and gathers to him a band of unlikely heroes in the form of Writer, Weaver, Keeper and Burp. Only by using the skills of each can they take flight in a dragon balloon and quest home from deep within the Moon Forest.  During their travels they are shocked to discover that the Alchemist has dominated their home, the Vale, for a thousand years conducting experiments on their families and keeping them isolated from the world. But for what purpose? And what is this unknown place known as England that lies outside the Vale?  Join them in their journey as they each learn to bend the very elements to their will, and with them discover that together they can become more powerful than they could have imagined…  Featuring historical figures Oliver Cromwell, King Charles I and the Witchfinder General, the GUNPOWDER AND ALCHEMY series will delight fans of all ages of the genres of children’s fantasy, historical fantasy, alternative history and steampunk.  About the Author  Dan Davis was born in Birmingham in England but moved to the county of Essex when he was very young. As an adult he mounted a heroic escape from a life of toil in the City of London out to greener pastures in north Essex, not far from the Suffolk border and the Vale of Dedham. He lives there still, with his wife and daughter. He has been writing stories his whole life but White Wind Rising is the first novel he has published.",
  "genres": [],
  "author": "Dan  Davis",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/23801334-white-wind-rising"
}