{
  "title": "الامبراطورية الروسية",
  "description": "عقب الصعود الروسي على يد الرئيس فلاديمير بوتين ، اصبح واجبا ً ان تضم المكتبة العربية دراسة عن تاريخ روسيا منذ تأسيس الولايات الروسية وصولا ً الى العصر الراهن .هذا الكتاب يتناول التاريخ الروسي منذ تأسيس أولى الإمارات الروسية ، ثم الغزو المغولى و الاسلامي ، و قيام الامبراطورية القيصرية و حروبها مع العثمانيين و الفرس ، عن فترة حكم بطرس الاكبر و كاثرين العظيمة ، و الحملة الروسية العسكرية لنجدة حاكم مصر على بك الكبير ، ثم الحملة العسكرية الروسية فى قلب عاصمة الخلافة العثمانية لفرملة جيوش مصر بقيادة إبراهيم باشاو يتطرق الكتاب الى الثورة الفرنسية و قيام الجمهوريات الفرنسية الخمسة ، و الثورات الالمانية و قيام الامبراطورية الالمانية ثم الحرب العالمية الاولى و ما تلاها من ثورات شيوعية فى روسيا و المانيا و ايطاليا و امريكا ، و قيام الاتحاد السوفيتي و الثورات الروسية الناجحة و الفاشلة عبر تاريخ الامة الروسية ، وصولا ً الى الحرب العالمية الثانية و ما تلاها من حربا ً باردة اعادة رسم خارطة العالم .و يناقش الكتاب صعود نابليون بونابرت و محمد على و ادولف هتلر و تأثير ذلك على روسيا ، و مسيرة زعماء روسيا : فلاديمير لينين ، جوزيف ستالين ، نيكيا خروشوف ، ليونيد بريجنيف ، ميخائيل جورباتشوف ، بوريس يلتسن ، فلاديمير بوتين بكل معاركهم السياسية داخليا ً و خارجيا ً .و يصل الكتاب الى محطة الانهيار السوفيتي و ما تلاه من حروب الشيشان و صعود الارهاب الاصولى فى الجمهوريات الروسية ، وصولا ً الى علاقة روسيا بالثورات الملونة فى اوكرانيا و قيرقيزستان و جورجيا و حربي امريكا على العراق و افغانستان اضافة الى ثورات الربيع العربي وصولا ً الى ثورة 30 يونيو 2013 المصرية ثم اندلع الازمة الاوكرانية و ما تلاها من حرب باردة ثانية وصولا الى خارطة حرب الطاقة الصانعة الحقيقية لحروب و ازمات اليوم .و يسعى الكاتب فى هذا المؤلف الى تقديم التاريخ الروسي كاملا ً ، بعد الضعف و الفقر الذى تعاني منه المكتبة المصرية و العربية فيما يخص الشأن الروسي ، سواء فيما يتعلق بالماضى او الحاضر ، و لا ينسى المؤلف فى النهاية ان يقدم تصور مدعوم بالمعلومات عن مستقبل روسيا بوتين  إيهاب عمر ، صحفى و باحث سياسي من اعماله : الخليج البريطاني ، الجمهورية المظلومة .. أنهيار امة و سقوط نظام ، الثورة المصرية الكبري ، الحرب السرية .. أوهام المقاومة فى الشرق الاوسط ، مستقبل مصر ، سنوات اوباما ، امريكا و الربيع العربي",
  "genres": [],
  "author": "Ihab Omar",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/23806908"
}