{
  "title": "Escape: The First Omnibus WTF I-III",
  "description": "ESCAPE is the first Omnibus containing: Escaping The Dead, Tales of The Forgotten and Only the Dead Live Forever in one cover.A page-turning zombie slasher Series with over 1,000 five-star reviews on Amazon: From the outbreak in Afghanistan to the struggles at sea. Brad and his comrades realize the war for humanity has only just begun. And there's no guarantee any of them will survive the long journey home...Escaping The Dead:Alone in a foreign land. The radio goesquiet while on convoy in Afghanistan, a lost patrol alone in the desert. Withhis unit and his home base destroyed, Staff Sergeant Brad Thompson suddenlyfinds himself isolated and in command of a small group of men trying to survivein the Afghan wasteland.Every turn leads to danger. The local populationhas been afflicted with an illness that turns them into rabid animals. Theypursue him and his men at every corner and stop. Struggling to hold his teamtogether and unite survivors, he must fight and evade his way to safety.Tales Of The Forgotten:The world is at war with the PrimalVirus. Military forces across the globe have been recalled to defend thehomelands as the virus spreads and decimates populations.Out on patrol and assigned to a remote base inAfghanistan, Staff Sergeant Brad Thompson's unit was abandoned and left behind,alone and without contact.They survived and have built a refuge, but nowthey are forgotten. No contact with their families or commands.Brad makes a tough decision to leave the safety ofhis compound to try and make contact with the States, desperate to find rescuefor his men.What he finds is worse than he could have everpredicted.Only The Dead Live Forever:The escape from Afghanistan was only thebeginning.The Trio survived the initial fall, and built arefuge, they thought they had reached safety, but only to find themselves onceagain abandoned and surrounded by the primals. No contact with their familiesor commands, no relief from the rabid enemy. The fight continues as Brad andhis men struggle to survive in a post-apocalyptic world where the enemy is farmore dangerous than anything they had been trained for.Over land sea and air they will do anything to reach home.",
  "genres": [
    "Zombies",
    "Horror",
    "Apocalyptic",
    "Amazon",
    "Science Fiction",
    "Military Fiction"
  ],
  "author": "W.J. Lundy",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/23823313-escape"
}