{
  "title": "Tech, Lies, and Wizardry",
  "description": "Getting caught between a local crime boss and a galactic syndicate makes you nostalgic for the rock and the hard place.  Carl Ramsey has a heist to run and the crew to pull it off. All he’s missing is a specialized computer and the tech to run it. But when an unrelated robbery loses him both, the prospects for a successful job look grim. Unfortunately the one who hired them won’t take excuses, and the owners of the computer come looking for their stolen gear. Caught between a local crime lord and thugs from a galaxy-spanning syndicate, Carl needs to come up with a plan that doesn’t get them all killed.  His assets: his retired marine ex-wife, a drunkard mechanic, a feline security chief, and an old family friend who happens to be a wizard. His liabilities: a missing computer, a hospitalized tech, two ruthless criminal organizations looking for answers, and about two hours to sort it all out.  …no problem.  Tech, Lies, and Wizardry is the free short story prequel to Black Ocean, a science fiction fantasy series set in the 26th century. Do you wish there had been a second season of Firefly? Do you love the irreverent fun of Guardians of the Galaxy? Have you ever wondered how Star Wars would have turned out if Luke and Obi-wan had ditched the rebellion to become smugglers with Han and Chewie? Then Black Ocean is the series for you!  Pick up your copy of Tech, Lies, and Wizardry. You don’t even have to steal it!  Interview with the Author Q - So, what made you decide to write the Black Ocean series?  A – After rewatching Firefly, I wondered why no one since had made a series that recaptured the edge-of-the-law, outlaws-in-space feeling. Then it dawned on me that even though I’m not a TV producer, I could still write one of my own. Black Ocean isn’t meant to be a successor to Firefly, or a clone, but I wanted to put together a “miscreants in space” series to fill that void the show left.     Since I’m a fantasy writer at heart, I added wizards.  Q – How do wizards fit in a sci-fi series?  A – Anyone who follows science fiction knows that a lot of hand-waving goes on. Faster than light (FTL) travel probably isn’t possible. Artificial gravity would be more 2001: a Space Odyssey than the “we just walk on the floor” sort that Star Trek or Star Wars use. Those and a host of others I just left alone. Instead of waving my hand and having phony science appear, I just let wizards handle it with actual magic.     Arthur C. Clarke said that “Any sufficiently advanced technology is indistinguishable from magic,” but I wanted to have magic be magic, science be science, and for the two not get along at the office holiday party.  Q - So, what genre is this? Does it have a name?  A – There’s really no consensus that I’ve found on what to call a mix of space opera and high fantasy. I’ve heard it called science fantasy, futuristic fantasy, sci-fantasy, and sword and laser. There’s always just plain old space opera fantasy. I’ve found that it isn’t easy finding books like Black Ocean because no two people seem to call it the same thing.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Space Opera",
    "Audiobook",
    "Short Stories",
    "Adventure"
  ],
  "author": "J.S. Morin",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/23822977-tech-lies-and-wizardry"
}