{
  "title": "Ex Addict: How to Stop Obsessive Thinking and Break the Cycle of Love Addiction",
  "description": "Love Addiction or Why Do I Keep Thinking About You? Have you ever had a relationship that you simply can't forget? Do you long for someone who is emotionally or physically unavailable to you? Is your happiness dependent on this one person? Are you infatuated with an individual who doesn't even know that you exist? No matter how hard you try, this one person occupies your every single thought. Constantly 'living in the past,' you are stuck in a time-warp and unable to move forward with your life. Call it what you want. Love sickness, infatuation, obsessive love or addictive love. It is all the same. A powerful, overwhelming and complex emotional state in which you feel helpless, worthless, anxious and desperate. This is the painful reality of love addiction.Caught in the grip of obsessive behavior, you are consumed with an uncontrollable desire to call, text, email or even stalk your ex. You develop an unconscious habit of over-analyzing every single interaction, with the object of your desire, often replaying it over-and-over in your mind.This may not even be the first time that you have felt and behaved this way. You may recognize this pattern of destructive behavior as being typical of your response to the breakup of a relationship.All over the world there are rejected men and women who are compulsive, dependent and addicted to someone they know, either personally or superficially. Even though this obsessional behavior often begins in a relatively innocuous manner, if left unmanaged, then it may escalate into something far more sinister. This book demonstrates how easily, and progressively, a relatively innocent infatuation can progress from simple information gathering, right through to murder.Do not allow yourself to become an addict!This book will help you break the cycle of love addiction and put an end to your obsessive thinking. You will gain an insight into the signs of addiction and why you repeatedly behave the way that you do.You will take action to improve your life and break the obsessive habits that you have developed, in your personal relationships. You will let go of your fear, anxiety and the need to control. As you begin the healing process you will rediscover your inner strength, become emotionally self-sufficient and look forward to building healthy and long-lasting relationships.",
  "genres": [],
  "author": "C.L. Grant",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/23822659-ex-addict"
}