{
  "title": "It's Not about the Coffee: Leadership Principles from a Life at Starbucks",
  "description": "“At Starbucks, the coffee has to be excellent, from the sourcing and growing to the roasting and brewing. The vision has to be inspiring and meaningful. Our finances have to be in order. But without people, we have nothing. With people, we have something even bigger than coffee.”  During his many years as a senior executive at Starbucks, Howard Behar helped establish the Starbucks culture, which stresses the importance of people over profits. He coached hundreds of leaders at every level and helped the company grow into a world- renowned brand. Now he reveals the ten principles that guided his leadership—and not one of them is about coffee.  Behar starts with the idea that if you regard employees and customers as human beings, everything else will take care of itself. If you think of your staff as people (not labor costs) they will achieve results beyond what is thought possible. And if you think of your customers as people you serve (not sources of revenue) you’ll make a deep connection with them, and they’ll come back over and over.  This approach has been integral to Starbucks from the start, and remains so today. Behar shares inside stories of turning points in the company’s history as it fought to hang on to this culture while growing exponentially. He discusses the importance of building trust, facing challenges, daring to dream, and other key principles, such as:  • Know Who You Are: Wear One Hat When organizations are clear about their values, purpose, and goals, they find the energy and passion to do great things.  • Think Independently: The Person Who Sweeps the Floor Should Choose the Broom We need to get rid of rules—real and imagined—and encourage the independent thinking of others and ourselves.  • Be Accountable: Only the Truth Sounds Like the Truth No secrets, no lies of omission, no hedging and dodging. Take responsibility and say what needs to be said, with care and respect.  • Take Action: Think Like a Person of Action and Act Like a Person of Thought Find the sweet spot of passion, purpose, and persistence. “It’s all about the people” isn’t an idea, it’s an action. Feel, do, think. Find the balance, but act.  Behar believes that as work becomes less hierarchical and as the world economy becomes more and more about relationships and connecting, the principles of personal leadership are more important than ever. This book will show you the way.",
  "genres": [
    "Business",
    "Nonfiction",
    "Leadership",
    "Management",
    "Audiobook",
    "Self Help",
    "Psychology"
  ],
  "author": "Howard Behar",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/2382714.It_s_Not_about_the_Coffee"
}