{
  "title": "Phase Three: Devastate",
  "description": "Book Three in the Best Selling Zombie Apocalypse Series Territory of the Dead  Life as we know it is over. There is nothing to anticipate but death, and the body count just keeps growing. I wonder how long it'll be before I become one of them. You know, just another dead body wandering the streets in my never ending search for new prey.  In a world like ours, there is no hope.  But in the midst of this darkness that we call life, there is Jayden. With his long, dark hair and heated eyes, he's everything that any girl could ever desire. He wants me, and I want him.  But there's a problem. I can't stop thinking about the kiss I experienced with Kellan. He might be older. He might be military tough, with an iron will that never bends, but I can't get him out of my mind. Kellan is the sexiest man I've ever seen, but so is Jayden.  If you found yourself caught in the middle of two alpha men, how could you choose? Especially knowing that each day could very well be your last...    Excerpt:  His body had filled out quite a bit in the last several months. Some of it was just normal, that last little push that nature gives every male as he steps into his twenties. But some of it was from all the physical activity we'd both endured. Surviving a zombie apocalypse required quite a bit more stamina than sitting in the classroom. But over time, our bodies had hardened. We'd both grown stronger. We were survivors in a world where so many hadn't been, but surviving had left its mark on both of us.  In that moment, though, life was perfect. Sitting there with Jayden, with the sun warming our bodies, I felt carefree again. The world felt bright and new, and nothing could touch us. We were young, and we were in love. Together, we could handle anything that was thrown at us, especially since we had the support of the precious few that were still with us.  Couldn't we?  If I'd only known what the future held, I might not have jinxed myself by thinking that way. Then again, I might not have changed a thing. The joy that I found in the innocence of our love was so pure and uncomplicated that many times my thoughts have returned to the magic of that day in the grass. It was an exquisite afternoon, a rarity, in a long line of heartaches and heartbreaks. As the years passed, I would learn to treasure the good times. They were few and far between.   Make sure to read Phase One: Identify to see how it all started and Phase Two: Evaluate.",
  "genres": [],
  "author": "Rose Wynters",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/23825152-phase-three"
}