{
  "title": "What's Eating Gilbert Grape",
  "description": "Adapted into the classic 1993 film starring Johnny Depp as Gilbert and Leonardo DiCaprio in his Academy Award–nominated role as Arnie, What’s Eating Gilbert Grape is the touching and entertaining story of an unusual family that rises up to do the astonishing…Gilbert Grape is a 24-year-old grocery store clerk stuck in Endora, Iowa, where the population is 1,091 and shrinking. After the suicide of Gilbert’s father, his family never recovered. Once the town beauty queen, Gilbert’s mother is morbidly obese after seven years of house-bound depression; his younger sister is boy-crazy and God-fearing, while his older sister sacrifices everything for her family. And then there’s Arnie, Gilbert’s younger brother with special needs. With no one else to care for Arnie, Gilbert becomes his brother’s main parent, and all four siblings must tend to the needs of their helpless, grieving mother.So Gilbert is in a rut—until an enchanting new girl arrives in town. His family gathers for Arnie’s 18th birthday and Becky, the mysterious and lovely newcomer, breathes new life into Gilbert’s world. But can one person really change Gilbert, or his attitudes about his family and Endora? Rich with memorable characters, biting frustration, and family redemption, What’s Eating Gilbert Grape can’t be missed.Raised in West Des Moines, Iowa, Peter Hedges is an award-winning novelist, screenwriter, playwright, and director. He studied drama at the University of North Carolina School of the Arts. His first novel, What’s Eating Gilbert Grape , was made into a classic movie starring Leonardo DiCaprio in his breakout role. Afterward, Hedges went on to write and direct numerous critically-acclaimed films, including Pieces of April , Dan in Real Life , and The Odd Life of Timothy Green . His screenplay for About a Boy was nominated for an Academy Award in 2002.",
  "genres": [
    "Fiction",
    "Classics",
    "Young Adult",
    "Contemporary",
    "Coming Of Age",
    "Media Tie In",
    "Novels"
  ],
  "author": "Peter Hedges",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/23812025-what-s-eating-gilbert-grape"
}