{
  "title": "A Ridgeway Christmas",
  "description": "Return To Ridgeway for An Unforgettable Holiday \nA Ridgeway ChristmasA Roses of Ridgeway Historical Romance Short\nby Kianna AlexanderHoliday Romance NovellaHistorical Romance VictorianHistorical Romance Western and FrontierKindle Short Reads: One Hour  A Season For Family and Friends The year is 1886, and it's Christmastime in the small enclave of Ridgeway, California. As the town gathers at the Taylor Hotel for the first Ridgeway Holiday Social, memories are shared, secrets are revealed, and new attractions are discovered.\nFamily is Everything\nRicardo and Lilly Benigno have journeyed by ship to his home in Barcelona, to introduce their son Leo to his Spanish roots. For Ricardo's parents, meeting their first grandchild is a delight beyond compare- but old wounds still exist between Ricardo and his elder brother, Hernando.\nA Secret to Tell\nBack home in Ridgeway, Prudence is keeping a secret from her husband, the Reverend Derrick Emerson. Between keeping their home, chasing after their young daughter Chloe Grace, and helping take care of the needs of their parishioners, she's hardly sure of when she'll have the time to tell him what's on her mind-but the Christmas social presents the perfect opportunity.\nA Choice to Make\nSheriff Noah Rogers and his wife Valerie are still in the throes of newlywed bliss, and are looking forward to finding every sprig of mistletoe the staff at the Taylor hotel has hung. Watching little Abraham grow up makes Valerie long for another child- but will Noah agree, when he has his eye on the mayor's seat?A Ridgeway Christmas is Book 3.5 in the Roses of Ridgeway historical romance series. Below is the series chronology:Book 1:Kissing the Captain-Ricardo and Lilly's storyBook 2: The Preacher's Paramour- Derrick and Prudence's storyBook 3: Loving the Lawman- Noah and Valerie's storyThe Roses of Ridgeway, Volume One Books 1, 2, and 3 in a convenient box setBook 4: Electing to Love- Gregory and Angel's story",
  "genres": [],
  "author": "Kianna Alexander",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/23824950-a-ridgeway-christmas"
}