{
  "title": "Bedlam Butchers: Volumes 1-3",
  "description": "This boxed set collects the first three Bedlam Butchers motorcycle romances:  OFF LIMITS - Lucky and Solo Lucky…isn’t. In fact, she’s considered ‘off limits’ to the Bedlam Butchers because she’s caused them nothing but bad luck in the past. As a bonus? She’s also the president’s kid sister. Single and lonely? That’s Lucky’s way of life. Now, the Eighty-Eight Henchmen are harassing her and they’re out for blood.  Solo…is. In a club where pairing up with a brother to watch your back is mandatory, Solo still hasn’t gotten over his partner’s death two years ago. The club’s pressuring him to name a second Treasurer, but he has to trust that person in bed and out. And it’s damn hard for Solo to trust.  But when he rescues Lucky from the Eighty-Eight, maybe it’s time for Solo to find a partner, and time for Lucky’s luck to turn around…  PACKING DOUBLE - Kitty, Domino, and Gemini When Kitty hears about the notorious ‘panty raid’ happening at a bar Friday night, she heads in looking for a good time with no strings attached. She might want to get laid, but she does not want to be part of any motorcycle club’s lifestyle. She’s not good with following directions or taking orders, and she’s been told that’s what an old lady does.  But when she meets Gemini and Domino, everything changes. The dual presidents of the Bedlam Butchers, they stake their claim on Kitty and decide to show her what the club lifestyle is really about: riding free, living on the edge, and letting them show her just how good being claimed by two men can be. Kitty might like being the center of their attentions, but when her life takes a dangerous turn, she has to decide who to trust both in bed and out of it.  DOUBLE TROUBLE: Shy, Beast, and Muscle In the world of motorcycle clubs, a snitch is a dead man. And the Bedlam Butchers have a snitch who’s intent on taking down one of the newest members of their club.  Shy knows just who the snitch is, too–it’s her older brother. But she can’t do anything about it, because Shy’s got no one to protect her. If she tells what she knows, her brother’s going to sell her out to his new, dangerous buddies. If she keeps quiet, she’s still at risk from the Butchers. She needs someone at her back. Enforcers Muscle and Beast are the perfect solution… if she has the guts to make a play.  Beast’s big hulking form and a face only a mother could love drives most women away. Muscle’s pretty as could be, but he’s got a nasty attitude and a brick wall around his heart. No one wants to get in their bed…which means they’re perfect for Shy’s needs. When the three get together, it’s obvious that these men need Shy just as much as she needs them. And now she wants to stay for entirely different reasons than just safety.  But what’s going to happen when they find out Shy has been withholding information?   Available Now in the Motorcycle Clubs series:  HIS WILD DESIRE by Ella Goode (Death Lords MC #1) OFF LIMITS by Ruby Dixon (Bedlam Butchers #1) WANTING IT ALL by Kati Wilde (Hellfire Riders #1)  HER SECRET PLEASURE by Ella Goode (Death Lords MC #2) PACKING DOUBLE by Ruby Dixon (Bedlam Butchers #2) TAKING IT ALL by Kati Wilde (Hellfire Riders #2)  THEIR PRIVATE NEED by Ella Goode (Death Lords MC #3) DOUBLE TROUBLE by Ruby Dixon (Bedlam Butchers #3) HAVING IT ALL by Kati Wilde (Hellfire Riders #3)  THEIR FIERCE LOVE by Ella Goode (",
  "genres": [
    "Menage",
    "Contemporary Romance",
    "Romance",
    "Contemporary",
    "Novella",
    "Erotica"
  ],
  "author": "Ruby Dixon",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/23815986-bedlam-butchers"
}