{
  "title": "The World as I Remember It: Through the Eyes of a Ragamuffin",
  "description": "Rich Mullins was more than a musician. He was a poet and thinker who left behind a timeless legacy. As a columnist for Release magazine for nearly six years, Rich shared his musings on faith and life, conveying the wonder and awesomeness of his God with the same depth and simplicity that characterized his music. The World As I Remember It is a collection of these personal writings, complemented by striking photography and some of Rich's most memorable quotations. This one-of-a-kind collection will be cherished not only by his fans, but by anyone who appreciates fresh, deep spiritual nourishment.Rich Mullins was more than a musician. He was a poet and thinker who left a legacy of deep gratitude, humility, and delight before the dace of an awesome God. Here you'll find a treasury of Rich's engaging, intimate reflections on faith and life. Revealing the spiritual meaning behind the simplest events, Rich muses about subjects ranging from fear to contentment, childlikeness to emptiness, from war to music. This is a feast for anyone who appreciates fresh, deep spiritual nourishment. As you savor the arresting ideas of one of modern Christianity's most ardent pilgrims, you'll find your adoration focused on your Creator, Redeemer, and Inpirer.Story Behind the BookFor nearly six years, Rich shared his thoughts about faith and life through his columns in Release magazine. When his first column was published in the spring of 1991, the editors introduced him this \"Rich not only has a lot to say…he also has a unique way of saying it. And although Mr. Mullins could easily fit into that intellectual bohemian-type category (we’re sure he could hold his own in a discussion with any theologian or philosopher of old), most often, his message is a straightforward call back to the principles of faith. He’s a poet, a scholar, a gentleman, and yes, just a little bit off-center. But that’s why we like him, and are pleased to welcome Rich to Release with this regular column.We trust you’ll love him and what he has to say as much as we do…\" Rich had a way with words, and a collection of his writings seems an appropriate tribute to a man who has been referred to as \"the greatest songwriter of our time.\"",
  "genres": [
    "Christian",
    "Nonfiction",
    "Biography",
    "Christianity",
    "Memoir",
    "Faith",
    "Religion"
  ],
  "author": "Rich Mullins",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/238249.The_World_as_I_Remember_It"
}