{
  "title": "We Never Asked for Wings",
  "description": "From the beloved New York Times bestselling author of The Language of Flowers comes her much-anticipated new novel about young love, hard choices, and hope against all odds.   For fourteen years, Letty Espinosa has worked three jobs around San Francisco to make ends meet while her mother raised her children—Alex, fifteen, and Luna, just six—in their tiny apartment on a forgotten spit of wetlands near the bay. But now Letty’s parents are returning to Mexico, and Letty must step up and become a mother for the first time in her life.   Navigating this new terrain is challenging for Letty, especially as Luna desperately misses her grandparents and Alex, who is falling in love with a classmate, is unwilling to give his mother a chance. Letty comes up with a plan to help the family escape the dangerous neighborhood and heartbreaking injustice that have marked their lives, but one wrong move could jeopardize everything she’s worked for and her family’s fragile hopes for the future.   Vanessa Diffenbaugh blends gorgeous prose with compelling themes of motherhood, undocumented immigration, and the American Dream in a powerful and prescient story about family.Praise for We Never Asked for Wings  “Deftly blends family conflict with reassurance: Wings is like Parenthood with class and immigration issues added for gravitas.”—People (Book of the Week)  “This poignant story will stay in readers’ hearts long after the last page. . . . Diffenbaugh weaves in the plight of undocumented immigrants to her tale of first- and second-generation Americans struggling to make their way in America. Moving without being maudlin, this story avoids the stereotypes in its stark portrayal of mothers who just want the best for their children.”—RT Book Reviews (Top Pick)\n \n “Diffenbaugh is a storyteller of the highest order: her simple but poetic prose makes even this most classically American story sing with a special kind of vulnerable beauty.”—Bustle\n \n “[A] gripping, heartfelt exploration of a mother’s love, resilience and redemption.”—Family Circle\n \n “Satisfying storytelling . . . Diffenbaugh delivers a heartwarming journey that mixes redemption and optimistic insight [and] confirms her gift for creating shrewd, sympathetic charmers.”—Kirkus Reviews“I was hooked from the first breathtaking pages of We Never Asked for Wings, caring about this exquisitely vulnerable family, hoping right along with them on every page that each heart-rending, impossible choice would lead them somewhere better together.”—Lisa Genova, New York Times bestselling author of Still Alice   “Vanessa Diffenbaugh’s We Never Asked for Wings propels us into a mother’s heart as she and her family travel down a rocky path to understanding and forgiveness. With breathtaking imagery and lyrical prose, Diffenbaugh makes Letty’s growth from a troubled young mother to a responsible woman who learns to put her children first, but also allows herself the possibility of love, entirely believable. Hers is a hard-won victory you will cheer even as you wish this graceful, moving book would never end.”—Melanie Benjamin, New York Times bestselling author of The Aviator’s WifeFrom the Hardcover edition.",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Adult Fiction",
    "Adult",
    "Family",
    "Audiobook"
  ],
  "author": "Vanessa Diffenbaugh",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/23834610-we-never-asked-for-wings"
}