{
  "title": "Once Pure",
  "description": "She bears the scars of the past. He blames himself for things he can’t control. Their defenses are up, but in Cecy Robson’s latest Shattered Past novel—perfect for fans of Monica Murphy and J. Lynn—true love lands a knockout punch.   Sofia Tres Santos remembers a time before her life went sour, before her innocence was ripped away, before she began punishing herself with risky behaviors and unworthy men. Now, at twenty, she just hopes she’s ready to rebuild some of what she lost. One way or another, it always comes back to her childhood friend and longtime crush, Killian O’Brien.   As strong as Killian is, Sofia has always been his one weakness. He knows Sofia has suffered and wants to ensure she’s never hurt again—not like before, and definitely not under his watch. When Sofia agrees to work at his mixed martial arts gym, Killian seizes the opportunity to help and protect the sweet girl he’s always cared for. And yet, as he trains Sofia to defend herself using his hard-hitting MMA techniques, he’s drawn to the vulnerable beauty in ways he never expected.   As Sofia grows stronger, she also grows brave enough to open herself up to love. And along the way, she challenges everything Killian believes to be true, showing him that no matter how much he dominates in the ring, the real battle is fought in the heart.Praise for Once Loved \n \n“Brody made it his mission to be Lety’s rock . . . Cecy Robson created a perfect book boyfriend in Brody Quaid, and many will enjoy his patience, sexiness, and unconditional love for Lety.”—Heroes and Heartbreakers“With its skillfully developed characters and scorching sexual tension, Once Loved is a gorgeous second-chance love story you won’t want to put down.”—USA Today bestselling author Lauren Layne“This book was amazingly fantastic! I loved it from beginning to end and read it in one sitting. Mateo has made my list of top ten favorite alpha heroes! I highly recommend this one!”—Wendy S. Marcus, author of Loving You Is Easy   “This heartbreakingly beautiful story and series is one to keep and read again and again. Truly beautiful. Amazingly touching, and completely breathtakingly beautiful. To say I loved this book is so mild a word, but I truly do, and I can’t wait for the next book.”—April Hollingworth, author of Double Magick in the Falls   Praise for Once Perfect \n \n “Once Perfect is exactly perfect for fans of sweetly sexy New Adult with a to-die-for protective hero.”—New York Times bestselling author Marquita Valentine   “Sweet and sexy, a perfect combination . . . Cecy Robson delivers pure reading bliss.”—USA Today bestselling author Sawyer Bennett   Includes a special message from the editor, as well as an excerpt from another Loveswept title.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "Contemporary",
    "Sports",
    "Fighters",
    "Friends To Lovers"
  ],
  "author": "Cecy Robson",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/23834613-once-pure"
}