{
  "title": "Spellbound Holiday Box Set",
  "description": "The complete Spellbound trilogy includes an all-new 2019 foreword and Holiday Magic, a seasonal bonus story. ✔ Death. ✔ Resurrection. ✔ Duplication. ✔ Enchantment. Over 700 pages of magical mayhem and outrageous twists that will keep you guessing until the very last page.   \"Fast-paced and filled with page-turning action.\"★★★★★ \"One of my all-time favorite series!\"★★★★★ \"A must read for lovers of young adult paranormal.\"★★★★★ “The ending was totally heart-stopping and awesome at the same time!” ★★★★★ ____________________________________________________________________________ Entangled, Book 1 Hiding her powers was never a problem for seventeen-year-old Graylee Perez. Not until her diabolical twin sister decided to go on a rampage that could expose them all. When a suicide threat turns to murder, two tragic events unfold and it will take more than a resurrection spell to set things right.  After Gray is brought back from the great beyond, three powerful wizards offer to help keep her alive. Gray is on borrowed time and doesn’t know whom to trust or how long she has left before she vanishes for good, but she’s determined to stick around no matter what the cost. ____________________________________________________________________________ Duplicity, Book 2 Life's not perfect for \"Lee\" 2.0, but pretty darn close . . . until her powers backfire. Charlene returns from boarding school claiming that she, too, is Graylee Perez. Impossible, right? Maybe not, thanks to a certain avenging warlock's meddling. If Lee thought her twin was bad, dealing with a duplicate of herself is two times worse. Gray the second doesn’t seem to get that Raj McKenna is off-limits. Then there’s the problem of Adrian Montez. He expects one of the Grays to be his and he'll fight dirty to get what he wants. Nearly a year later, the council is on to them for past misdeeds and Gray is being stalked by what looks like the Grim Reaper. If the two Grays work together, they may stand a chance of setting things right. But will they both make it out alive? ____________________________________________________________________________ Enchantment, Book 3 Barcelona. Summer escape. Or so Graylee Perez thought until her old adversary, Adrian Montez, brings his magic show to Spain. How is Gray supposed to protect herself when she's sworn off magic for the summer?  Badgered and bullied as a young wizard, Adrian Montez suffered a tragic event as a young boy that changed his life forever. No more Mr. Nice Guy. Life is pain and everyone must pay the price, including Graylee Perez. One moment Gray is spitting mad to see Adrian in Barcelona. The next, she's throwing herself at him. It can only mean one thing . . . Adrian convinces Gray she's been put under a love spell. Sure, it makes sense when she hated him just days ago. But who would do such a thing? And how can something so wrong, feel so right? Can Gray still love Adrian after the spell is broken? ____________________________________________________________________________ Holiday Magic Every day is a gift worth celebrating—especially when you’ve died not once, but twice. Holiday Magic is a special edition Spellbound Christmas story about love, forgiveness and second chances. ____________________________________________________________________________ The Spellbound Trilogy is a coming of age dark fantasy intended for mature young adults and older. The first two books take place in high school. Book three is a new adult paranormal romance.  One-click today for a dark, thrilling, romantic read filled with magic, redemption, enemies to lovers, and second chances.",
  "genres": [],
  "author": "Nikki Jefford",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/23842819-spellbound-holiday-box-set"
}