{
  "title": "Pursue Friendship",
  "description": "A naked magician vanishes, a severed hand appears\n… and Frank Friendship is about to wet his pants.This darkly sparkling thriller puts the fun back into murder. \nKarma delivers—with both barrels\nMarek the naked magician—Frank’s arrogant work colleague—has gone missing and Frank is desperate to hide what happened the day the man disappeared. But the police have found a severed hand and night after night a witness daubs a message on the cafe window in blood-red letters. Fingers have started to point to Frank. Dead fingers.Frank is slow to realise the stakes. His every move to hold onto his crummy job only digs a deeper, darker hole. And Frank’s new “best friend” Annie is helping him dig. She has the hots for him and her actions only implicate him further.All Frank ever wanted was to win back his estranged wife. With his world collapsing around him, he has to reexamine who and what matters most in his life. But is he twenty years too late?  The Frank Friendship Series \nThe story of a murderer’s son, told in a\n series of interlocking novels\nEach book in the series is unique, non-genre, unpredictable. And though each tells a complete story, they connect as clues in an epic mystery. If you haven't read Screw Friendship yet, there are spoilers in here.This full-length, darkly fun thriller continues the Frank Friendship Series—an off-kilter world of secrets, murder and weird relationships. With Frank at the wheel, you could wind up absolutely anywhere. Hold tight.  Review “Every now and then I come across a book that I think should be snapped up by a [big] publisher and displayed prominently in bookstores, and this is one of those books [...] The plot is great, the narrative arc superb, and the reveal is timed just right.” — Unsolicited feedback from the line-editor of Pursue Friendship",
  "genres": [],
  "author": "R.G. Manse",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/23830659-pursue-friendship"
}