{
  "title": "What the Eye Hears: A History of Tap Dancing",
  "description": "Magisterial, revelatory, and-most suitably-entertaining, What the Eye Hears offers an authoritative account of the great American art of tap dancing. Brian Seibert, a dance critic for The New York Times, begins by exploring tap's origins as a hybrid of the jig and clog dancing from the British Isles and dances brought from Africa by slaves. He tracks tap's transfer to the stage through blackface minstrelsy and charts its growth as a cousin to jazz in the vaudeville circuits and nightclubs of the early twentieth century. Seibert chronicles tap's spread to ubiquity on Broadway and in Hollywood, analyzes its decline after World War II, and celebrates its rediscovery and reinvention by new generations of American and international performers. In the process, we discover how the history of tap dancing is central to any meaningful account of American popular culture. This is a story with a huge cast of characters, from Master Juba (it was probably a performance of his in a Five Points cellar that Charles Dickens described in American Notes for General Circulation) through Bill Robinson and Shirley Temple, Fred Astaire and Ginger Rogers, and Gene Kelly and Paul Draper to Gregory Hines and Savion Glover. Seibert traces the stylistic development of tap through individual practitioners, vividly depicting dancers both well remembered and now obscure. And he illuminates the cultural exchange between blacks and whites over centuries, the interplay of imitation and theft, as well as the moving story of African-Americans in show business, wielding enormous influence as they grapple with the pain and pride of a complicated legacy. What the Eye Hears teaches us to see and hear the entire history of tap in its every step.",
  "genres": [
    "Nonfiction",
    "History",
    "Music",
    "Jazz",
    "Art",
    "Microhistory",
    "Historical"
  ],
  "author": "Brian Seibert",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/23847906-what-the-eye-hears"
}