{
  "title": "The Horse: The Epic History of Our Noble Companion",
  "description": "The book horse-lovers have been waiting forHorses have a story to tell, one of resilience, sociability, and intelligence, and of partnership with human beings. In The Horse, the journalist and equestrienne Wendy Williams brings that story brilliantly to life.Williams chronicles the 56-million-year journey of horses as she visits with horse experts around the world, revealing what our biological affinities and differences can tell us about the bond between horses and humans, and what our noble companion may think and feel. Indeed, recent scientific breakthroughs regarding the social and cognitive capacities of the horse and its ability to adapt to changing ecosystems indicate that this animal is a major evolutionary triumph.Williams charts the course that leads to our modern Equus-from the protohorse to the Dutch warmbloods, thoroughbreds, and miniature horses of the twenty-first century. She observes magnificent ancient cave art that signals a deep respect and admiration for horses well before they were domesticated, visits the mountains of Wyoming with an expert in equine behavior to understand the dynamics of free-roaming mustangs, witnesses the fluid gracefulness of the famous Lipizzaners of Vienna, contemplates what life is like for the sure-footed, mustachioed Garrano horses who thrive on the rugged terrain of Galicia, celebrates the Takhi horses of Mongolia, and more. She blends profound scientific insights with remarkable stories to create a unique biography of the horse as a sentient being with a fascinating past and a finely nuanced mind.The Horse is a revelatory account of the animal who has been at our side through the ages, carrying us into battle and traveling with us across the plains. Enriched by Wendy Williams's own experience with horses, The Horse is a masterful work of narrative nonfiction that pays tribute to this champion of the natural world.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Animals",
    "Horses",
    "Nature",
    "Biology"
  ],
  "author": "Wendy   Williams",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/23847972-the-horse"
}