{
  "title": "Ghostbusters: The Ultimate Visual History",
  "description": "WHO YOU GONNA CALL? The Ghostbusters saga has been thrilling fans around the world for over three decades, from the original movies to the animated shows, comics, video games, toys, and other collectibles. For the first time, Ghostbusters: The Ultimate Visual History takes a comprehensive look at the entire franchise, telling the complete story behind the creation of a true pop culture phenomenon. Beginning with an in-depth look at the original film, Ghostbusters: The Ultimate Visual History delves into the archives to showcase a wealth of never-before-seen concept art and photography that will take fans into the production of a true classic. Also featuring a large section on Ghostbusters II, the book brings together exclusive interviews with the key players from both films, including director Ivan Reitman; stars Dan Aykroyd, Ernie Hudson, and Sigourney Weaver; and producers Michael C. Gross and Joe Medjuck. The book also explores the creation of The Real Ghostbusters and Extreme Ghostbusters animated shows, featuring interviews with the writers, animators, and voice artists, plus previously unseen sketches, animation cels, and other stunning visuals. With additional sections on Ghostbusters comics, video games, merchandise, and fandom, Ghostbusters: The Ultimate Visual History is the last word on one of the most popular franchises of all time. ALSO INCLUDES INCREDIBLE SPECIAL ITEMS THAT WILL THRILL GHOSTBUSTERS FANS, INCLUDING: -Peter Venkman’s business card -Sedgewick Hotel storyboard booklet -Rare concept art sketches of ghostbusting gadgets -Stay Puft Marshmallow Man package sticker -Production notes -A schematic of the Gozer temple miniature Ghostbusters TM & © 2015 Columbia Pictures Industries, Inc. All rights reserved.",
  "genres": [
    "Nonfiction",
    "Film",
    "Media Tie In",
    "Art",
    "Pop Culture",
    "Horror",
    "Cultural"
  ],
  "author": "Daniel  Wallace",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/23846161-ghostbusters"
}