{
  "title": "Pandemic: Tracking Contagions, from Cholera to Ebola and Beyond",
  "description": "Scientists agree that a pathogen is likely to cause a global pandemic in the near future. But which one? And how?Over the past fifty years, more than three hundred infectious diseases have either newly emerged or reemerged, appearing in territories where they’ve never been seen before. Ninety percent of epidemiologists expect that one of them will cause a deadly pandemic sometime in the next two generations. It could be Ebola, avian flu, a drug-resistant superbug, or something completely new. While we can’t know which pathogen will cause the next pandemic, by unraveling the story of how pathogens have caused pandemics in the past, we can make predictions about the future. In Pandemic: Tracking Contagions, from Cholera to Ebola and Beyond, the prizewinning journalist Sonia Shah—whose book on malaria, The Fever, was called a “tour-de-force history” (The New York Times) and “revelatory” (The New Republic)—interweaves history, original reportage, and personal narrative to explore the origins of contagions, drawing parallels between cholera, one of history’s most deadly and disruptive pandemic-causing pathogens, and the new diseases that stalk humankind today.To reveal how a new pandemic might develop, Sonia Shah tracks each stage of cholera’s dramatic journey, from its emergence in the South Asian hinterlands as a harmless microbe to its rapid dispersal across the nineteenth-century world, all the way to its latest beachhead in Haiti. Along the way she reports on the pathogens now following in cholera’s footsteps, from the MRSA bacterium that besieges her own family to the never-before-seen killers coming out of China’s wet markets, the surgical wards of New Delhi, and the suburban backyards of the East Coast.By delving into the convoluted science, strange politics, and checkered history of one of the world’s deadliest diseases, Pandemic reveals what the next global contagion might look like— and what we can do to prevent it.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Medicine",
    "Health",
    "Medical",
    "Audiobook"
  ],
  "author": "Sonia Shah",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/23847947-pandemic"
}