{
  "title": "Mischief",
  "description": "Horrormeister Douglas Clegg tones down the gore and ratchets up the suspense in his latest nightmarescape, Mischief. This time out, Clegg chooses a setting ripe with explosive potential: Harrow Academy, a private boy's school located inside in old, haunted mansion. Yet ghosts are only part of the problem in this tale of tragedy, psychological manipulation, and horror. Young Jim Hook is spending his first year at Harrow Academy, a prestigious private school for boys located along the Hudson River in upstate New York. Jim's older brother, Stephen, also attended Harrow, though he never finished, having died in a tragic car accident along with Jim's father not long ago. On the eve of their deaths, Jim was visited by the ghost of his just-deceased brother, as well as something elsesomething that tried to come through from the other side but didn't quite make it. Or did it? Now that only he and his mother are left, Jim is determined to follow in his brother's overachieving footsteps and graduate from Harrow Academy. The honor code at Harrow is considered inviolable and transgressions are generally met with expulsion, so when Jim is caught cheating on an exam, his future at the school looks grim. A trial is set but before it happens, Jim is approached by a mysterious group of students who are all part of a secret cabal called the Cadaver Society. They want to induct Jim into the group, promising in return that he will not suffer for his violation of the honor code. At first, Jim is skeptical, but then things happen -- horrible things -- that suggest the group is very real and frighteningly powerful. The hazing process he endures at the hands of the Cadavers nearly pushes him over the edge. But there is something else at Harrow, something far more powerful and terrifying than this human cabal. It is something that needs Jim, wants Jim, and will do anything to get him. With Mischief, Clegg proves himself a master of both psychological suspense and otherworldly horror, digging deep into the darkest corners of the mind and often letting subtle suggestion and clever inferences create the terror. This is intelligent, satisfying fiction -- a lively and unforgettable tale that manages to horrify and delight all at once. Beth Amos Beth Amos is the author of several novels, including Second Sight, Eyes of Night, and Cold White Fury.",
  "genres": [
    "Horror",
    "Fiction",
    "Paranormal",
    "Ghosts",
    "Audiobook",
    "Suspense",
    "Fantasy"
  ],
  "author": "Douglas Clegg",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/23846.Mischief"
}