{
  "title": "Let There Be Water: Israel’s Solution for a Water-Starved World",
  "description": "As every day brings urgent reports of growing water shortages around the world, there is no time to lose in the search for solutions.The U.S. government predicts that forty of our fifty states—and 60 percent of the earth's land surface—will soon face alarming gaps between available water and the growing demand for it. Without action, food prices will rise, economic growth will slow, and political instability is likely to follow.Let There Be Water illustrates how Israel can serve as a model for the United States and countries everywhere by showing how to blunt the worst of the coming water calamities. Even with 60 percent of its country made of desert, Israel has not only solved its water problem; it also had an abundance of water. Israel even supplies water to its neighbors—the Palestinians and the Kingdom of Jordan—every day.Based on meticulous research and hundreds of interviews, Let There Be Water reveals the methods and techniques of the often offbeat inventors who enabled Israel to lead the world in cutting-edge water technology.Let There Be Water also tells unknown stories of how cooperation on water systems can forge diplomatic ties and promote unity. Remarkably, not long ago, now-hostile Iran relied on Israel to manage its water systems, and access to Israel's water know-how helped to warm China's frosty relations with Israel.Beautifully written, Let There Be Water is an inspiring account of the vision and sacrifice by a nation and people that have long made water security a top priority. Despite scant natural water resources, a rapidly growing population and economy, and often hostile neighbors, Israel has consistently jumped ahead of the water innovation-curve to assure a dynamic, vital future for itself. Every town, every country, and every reader can benefit from learning what Israel did to overcome daunting challenges and transform itself from a parched land into a water superpower.",
  "genres": [
    "Nonfiction",
    "Israel",
    "History",
    "Science",
    "Environment",
    "Politics",
    "Nature"
  ],
  "author": "Seth M. Siegel",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/23848393-let-there-be-water"
}