{
  "title": "Striking Gridiron: A Town's Pride and a Team’s Shot at Glory During the Biggest Strike in American History",
  "description": "In the midst of a strike and economic uncertainty, a football team from an iconic steel town just outside Pittsburgh set out to capture its sixth straight season without a loss, uniting a region and inspiring the nation.In the summer of 1959, most of the town of Braddock, Pennsylvania--along with half a million steel workers around the country--went on strike in the longest labor stoppage in American history. With no paychecks coming in, the families of Braddock looked to its football team for inspiration.The Braddock Tigers had played for five amazing seasons, a total of 45 games, without a single loss. Heading into the fall of ‘59, this team from just outside Pittsburgh, whose games members of the Steelers would drop by to watch, needed just eight victories to break the national record for consecutive wins. Sports Illustrated and other media descended upon the banks of the Monongahela River to profile the team and its revered head coach, future Hall of Famer Chuck Klausing, who molded his boys into winners while helping to effect the racial integration of his squad. While the townspeople bet their last dollars on the Tigers, young black players like Ray Henderson hoped that the record would be a ticket to college and spare them from life in the mills alongside their fathers. In Striking Gridiron , author Greg Nichols recounts every detail of Braddock's incredible sixth, undefeated season--from the brutal weeks of summer training camp to the season's final play that defined the team's legacy. In the words of Klausing himself, \"Greg Nichols couldn't have written it better if he'd been on the sidelines with us.\"But even more than the story of a triumphant season, Nichols's narrative is an intimate chronicle of small-town America during the hardest of times. Striking Gridiron takes us from the sidelines and stands on game day into the school hallways, onto the street corners, and into the very homes of Braddock to reveal a beleaguered blue-collar town from a bygone era--and the striking workers whose strength was mirrored by the football heroics of steel-town boys on Friday nights and Saturday afternoons.",
  "genres": [
    "Nonfiction",
    "Sports",
    "History",
    "Football"
  ],
  "author": "Greg  Nichols",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/23848415-striking-gridiron"
}