{
  "title": "How the Soviet Man Was Unmade: Cultural Fantasy and Male Subjectivity under Stalin",
  "description": "In Stalinist Russia, the idealized Soviet man projected an image of strength, virility, and unyielding drive in his desire to build a powerful socialist state. In monuments, posters, and other tools of cultural production, he became the demigod of Communist ideology. But beneath the surface of this fantasy, between the lines of texts and in film, lurked another the wounded body of the heroic invalid, the second version of Stalin's New Man. In How the Soviet Man Was Unmade , Lilya Kaganovsky exposes the paradox behind the myth of the indestructible Stalinist-era male. In her analysis of social-realist literature and cinema, she examines the recurring theme of the mutilated male body, which appears with startling frequency. Kaganovsky views this representation as a thinly veiled statement about the emasculated male condition during the Stalinist era. Because the communist state was “full of heroes,” a man could only truly distinguish himself and attain hero status through bodily sacrifice-yet in his wounding, he was forever reminded that he would be limited in what he could achieve, and was expected to remain in a state of continued subservience to Stalin and the party.Kaganovsky provides an insightful reevaluation of classic works of the period, including the novels of Nikolai Ostrovskii ( How Steel Was Tempered ) and Boris Polevoi ( A Story About a Real Man ), and films such as Ivan Pyr'ev's The Party Card , Eduard Pentslin's The Fighter Pilots , and Mikhail Chiaureli's The Fall of Berlin , among others. The symbolism of wounding and dismemberment in these works acts as a fissure in the facade of Stalinist cultural production through which we can view the consequences of historic and political trauma.",
  "genres": [],
  "author": "Lilya Kaganovsky",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/2386365.How_the_Soviet_Man_Was_Unmade"
}