{
  "title": "Devil's Breath",
  "description": "Sue Ellen Jenkins has lived a life most would not survive. Now, she has found a semblance of peace after moving away from the small Georgian town where her father enjoyed killing—and received a life sentence for his pleasures. To enable her escape, she married young to a tolerably abusive man. When her father dies in prison, issues arise with her autistic brother, forcing her to return to the town she thought she had left behind. Here, she discovers that life has saved its best for last—an evil so dark that it threatens to consume the country. Her devastation is complete when she finds out it is the same sadistic spirit that had possessed her father, but now it occupies her husband.Reunited with the high school sweetheart she should have married, former Army Ranger Ron Dalton, Sue finds herself dragged into insanity beyond comprehension. Together they must rescue her brother from the merciless cult that has been preparing for the return of the entity, but to do so, they have to survive in a town that has become Hell on Earth. Nearly every resident is now a killer, made that way by the cult's secret weapon, the drug Devil's Breath. Once used by the Nazis and CIA for interrogation, utilized today by Colombian criminals to gain control of victims, the drug effectively turns people into zombie-like puppets.Shockingly, Sue discovers that her brother may be a key player in the murderous plot, but more disturbing is what Ron Dalton learns about Sue; she used to be a killer, too. Unsure if he can trust the woman he still loves, Ron finds himself in a bloody war once again. This time though, it is not with the Taliban, but with a demon and its cult who are testing their strategy on his small town before moving to their ultimate using Devil's Breath to carry out the largest terrorist attack the world has ever known.",
  "genres": [],
  "author": "Sebastian Chase",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/23868893-devil-s-breath"
}