{
  "title": "Unholy Creations",
  "description": "My name is Kara Radcliff and I’m a witch. Not the pointy hat and black cat kind, but a true spell casting, sneaker wearing, party loving, kick-ass witch.  Until two weeks ago, that is all I was and all I ever wanted to be. I was perfectly happy with who I was. My expectations in life didn’t soar higher than graduating college and finding a decent job that would help me to pay off my mounting student loans.  All of that went out the window when I received the invitation.  I’ve was selected to compete for the chance of a lifetime. If I win, not only will I fulfil the newly vacant spot as an Associate, but I will be leaving my family behind to go live and work alongside the four Rulers of our paranormal community. I will be trusted in helping them keep our kind safe and hidden from the humans and those among us that prefer to cause trouble and mayhem. Every society has hoodlums, our kind just happen to cause more destruction than most.  Being an Associate is an honor. The job is dangerous and will require me to go up against Fae, shifters, witches, and vampires that are much more powerful and stronger I could ever hope to be. I love kicking butt and casting spells, but even I have my limits. On top of everything, I seem to have caught the attention of two of the Rulers. Only I could go from having no men in my life to having one too many. Neither man is used to hearing the word, “No”, and although my mind says the word often, my mouth and body keep saying, “Yes”.  Am I up for this new Challenge? Yes. Can I handle the danger? Yes. Will my heart survive the journey? Maybe.  This is my screwed up story. This is my crazy life, and this is the just the beginning.",
  "genres": [
    "Paranormal",
    "Shapeshifters",
    "Paranormal Romance",
    "New Adult",
    "Fantasy",
    "Vampires",
    "Romance"
  ],
  "author": "C. Shell",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/23855169-unholy-creations"
}