{
  "title": "Give and Take",
  "description": "What is right if you decide there is no wrong?For Ty, Lena and Danny, they're about to find out as they cross the boundaries from all things safe to an arena that will test love, friendship and loyalty. An arena that's forbidden, taboo…and oh so tempting. In their world sex, money and excess are all a game of give and receive, were any wish can be granted if you just ask...Lena Roman: Life was supposed to have gone back to normal. After all…It’s been months since that night at Sadist. Months of reliving, remembering, experiencing…each moment. Over and over again. Oh yeah, she remembered. Every. Vivid. Illicit. Detail. Like it was yesterday. What she did. Who she did it with. Her best friend. And Danny…the one who had carved out her heart years ago. There to witness it all. An act so public, so voyeuristic, so forbidden, she was still feeling the intensity between them all. The lines were crossed now. There was no going back. Not even if she wanted to.If she were honest she would admit she didn’t…Tyler Malone: I knew I risked a lot doing what I did. I risked my friendship, with the one person I trusted and loved most of all, even if she can’t…or won’t see it. I played a dangerous game with Blake, too, but he either needs to step up...or step back. I put everything on the line for just one night. And hell yeah, it was worth it. She’s worth everything. I love her just as much as he does, maybe more, since I accept everything about her, even her love for him. Life is all about the chances you take. To succeed you have to gamble. Play big…or go home. And I play to win. At all costs…Danny Blake: Seeing her that night with Ty, watching her come undone, made me realize for the first time the life I could have. I saw her. Really saw her, body and soul, and I know now, the ache for her never truly went away. It only intensified over the years, with a need bordering on obsession. My one addiction I could never get clean of. I need her like air.In the high stakes game of give and take, you have to risk everything.***Give and Receive is an erotic romance serial released every 4 to 6 weeks, at approximately 10000 to 14000 words each. Due to graphic sexual content and language, we recommend this to mature audiences, ages 18 and over, who are comfortable with this subject matter.***",
  "genres": [],
  "author": "Alisa Anderson",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/23870653-give-and-take"
}