{
  "title": "Our Souls at Night",
  "description": "3 hours, 28 minutesA spare yet eloquent, bittersweet yet inspiring story of a man and a woman who, in advanced age, come together to wrestle with the events of their lives and their hopes for the imminent future. In the familiar setting of Holt, Colorado, home to all of Kent Haruf's fiction, Addie Moore pays an unexpected visit to a neighbor, Louis Waters. Her husband died years ago, as did his wife, and in such a small town they naturally have long been aware of each other, if not exactly friends; in fact, Addie was quite fond of Louis's wife. His daughter, Holly, lives hours away in Colorado Springs; her son, Gene, even farther away in Grand Junction. What Addie has come to ask--since she and Louis have been living alone for so long in houses now empty of family, and the nights are so terribly lonely--is whether he might be willing to spend them with her, in her bed, so they can have someone to talk with. Louis is surprised, even shocked, that she would've thought of him, though he soon is brave enough to try, impressed by the courage of her proposal. And so their lives now find a new rhythm and their conversations range freely, if sometimes haltingly, through their personal histories: his work as a high school English teacher; the loss of her teenage daughter, and the harm this did to her marriage as well as their son; his brief affair, as a young husband and father, which Addie had heard about; their youthful aspirations and middle-age disappointments and compromises; the joy both feel in at last being able to express the woof and weave of their experiences. This unusual arrangement, as Addie predicted, provokes local comment, and then the disapproval of their children, and their nightly pattern is further disrupted when her son, whose wife has departed for California, asks Addie to take in his six-year-old son, Jamie, for the summer while he tries to solve his various troubles. Jamie is confused and hurt, of course, but gradually finds comfort in the company of his grandmother and her friend Louis, neither of whom has spent much time with kids in years but in turn learn how to all over again. Teaching the boy to play catch. Adopting a dog from the local shelter. A camping trip in the mountains, a trip to the county fair, simple pleasures that are a hallmark of Haruf's fiction. As are the things that jeopardize them, from the death of a mutual friend to family tensions that suddenly test Addie and Louis's ability to withstand them. And the subtle denouement then sweeps both of these amazing people forward--heartbreakingly, hearteningly into the unknown.",
  "genres": [
    "Fiction",
    "Book Club",
    "Romance",
    "Contemporary",
    "Literary Fiction",
    "Audiobook",
    "Adult Fiction"
  ],
  "author": "Kent Haruf",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/23879379-our-souls-at-night"
}