{
  "title": "No Sweat: How the Simple Science of Motivation Can Bring You a Lifetime of Fitness",
  "description": "We start out with the best intentions. We're going to exercise more and get in shape! Then five days a week at the gym turns into two... then becomes none. We hit the snooze button and skip the morning run. We really do want to be healthy and fit, but we're over whelmed and overextended—and exercise feels like another chore to complete. Is it any wonder we don't stick with it? Behavior expert Michelle Segar has devoted her career to the science of motivation. In No Sweat, she reveals that while \"better health\" or \"weight loss\" sound like strong incentives, human beings are hardwired to choose immediate gratification over delayed benefits. In other words, we're not going to exercise unless it makes us happy right now. So what's the solution? To achieve lasting fitness, we have to change our minds—before we can change our bodies. In No Sweat, Segar shows us how. Translating twenty years of research on exercise and motivation into a simple four-point program, she helps readers broaden their definition of exercise, find pleasure in physical activity, and discover realistic ways to fit it into their lives. Activities we enjoy, we repeat--making this evidence-based system more sustainable in the long run than a regimen of intense workouts. Even if we don't sweat, we really benefit. The success of the clients Segar has coached testifies to the power of her program. Their stories punctuate the book, entertaining and emboldening readers to break the cycle of exercise failure once and for all. Complete with worksheets, tips, and techniques, getting in shape has never been so easy—or so much fun.",
  "genres": [
    "Nonfiction",
    "Health",
    "Self Help",
    "Fitness",
    "Psychology",
    "Personal Development",
    "Audiobook"
  ],
  "author": "Michelle Segar",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/23875809-no-sweat"
}