{
  "title": "Too Hot to Handle",
  "description": "Katie Rose’s Boys of Summer series returns for a delicious double-header—with the story of total opposites who are drawn to each other like moths to a flame.   Nikki Case is no fan of baseball. Her ex gambled away a fortune on the sport, and now her PR firm has tasked her with cleaning up the league’s most notorious bad boys. The New Jersey Sonics are known for wild womanizing and booze-fueled brawls, so Nikki expects the worst. Her first stop in the battle to win hearts and minds is star hitter Jake Baldwin—a legendary ladies man so smokin’ he threatens to melt her tough-girl armor.   Although his teammates prank her without mercy, Jake admires the way Nikki gives as good as she gets. She may be the queen of frost, but there’s kindling beneath those sultry curves—and he’s just the man to ignite it. But when a PR nightmare lands the Sonics in headlines across the country, Nikki is ready to walk. Only then does Jake realize how important she is to the Sonics’ success—and that winning the love of a good woman is no game.Advance praise for Too Hot to Handle \n \n “Katie Rose scores a home run with a hero who’s Too Hot to Handle!”—New York Times bestselling author Carly Phillips  “A whirlwind love story that leaves you wanting more of both Jake and Nikki. Together. Great light read with just the right touch of heat to it.”—Love Words and Books   “A nice, sweet contemporary read.”—Living to Read   “Sexy, sweet, swoony . . . It all revolves around the American national pastime with Too Hot to Handle ballplayers. . . . I’m eager to see who comes next.”—TJ Loves to Read Includes a special message from the editor, as well as excerpts from other Loveswept titles.",
  "genres": [
    "Romance",
    "Sports",
    "Sports Romance",
    "Contemporary",
    "Baseball",
    "Contemporary Romance",
    "Adult"
  ],
  "author": "Katie    Rose",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/23882196-too-hot-to-handle"
}