{
  "title": "Pulse",
  "description": "What about Iran Pulse, a national security thriller, by Robert Cook Pulse describes the complex process of preventing Iran from deploying nuclear weapons that are likely to destroy Israel, destabilize the Middle East and threaten world peace. Pulse opens in Morocco, passes to Washington at the White House and then Camp David, passes again through Morocco and ends in Tehran. The interwoven back story is about how to bring the transformational lessons of the Enlightenment to the Middle East, with inexpensive, technology-enabled, mass education as the catalyst. Pulse is a -thriller for the thoughtful reader. The lessons and arguments for and against the morality of war in a societal context are from some of history's great minds. The protagonist, Alejandro Muhammad Cuchulain (Cooch), is a former US Marine who served on the CIA Special Operations team for eight years. He is a purveyor of violence and of Islamic philosophy gained from studies at the College of Oriental Studies at Oxford. He is also a successful Middle Eastern businessman. Cooch is the leader of a team of five. Cooch's best friend is preppie, former Navy Seal and Rhodes Scholar, Brooks F. T. Elliot IV, a student of the Enlightenment. Dr. Caitlin O'Connor, is a CalTech trained computational physicist with an enormous ego and larger intellect who has developed a software product that crunches huge amounts of Big Data to infer conclusions from it, to the delight of both the National Security Agency and every-day students across societies. Jerome Masterson is Alex's long time CIA Special Ops partner; he is a student of institutional violence and it s application. Mac MacMillan is on the staff of the White House National Security Advisor and is an enabler. They ebb and flow around Cooch. Iran plans to deploy soon a nuclear weapon to deliver Zionist-occupied Palestine back to its historic owners and enslave current residents. Israel abhors that idea, and plans to attack Iran without US permission. The President seeks desperately to find a way to contain nuclear proliferation without again putting US troops in ground combat in the Middle East. His chief of staff and the Secretary of State are skeptical of proposals, and articulate in their opposition. The US decides to instigate a civil war in Iran with few US boots on the ground. The full military hegemonic might of the US will be employed to support the chosen side of the Iranian conflict. Cooch travels to Iran to facilitate identifying and convincing a group of Iranians to lead the insurrection against Iran's radical Shiite leadership. His reputation as the leading Islamic scholar on the violent Sunni/Shiite schism allows him entry into Tehran. The US attack on Iran opens with a display of military might and prowess designed to free the Straits of Hormuz for the flow of the world's oil. Iran's Russian backed navy and its huge fleet of small, armed boats and minelayers threaten both the US fleet and the world's oil supply. New weapons cause US casualties and threaten the offensive. Farther north, Iran's uranium enrichment sites at Fordo and Natanz are destroyed. In the first few minutes of the US attack, Iran's telecommunications infrastructure is destroyed with a new electromagnetic pulse weapon that fries silicon and copper wires and thus brings the internet and every electric powered device in range to a halt, destroyed forever. The radical Shiite leadership in the holy city of Qom is incinerated with their internet, television and radio center. Inshallah.",
  "genres": [
    "Thriller"
  ],
  "author": "Robert     Cook",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/23876431-pulse"
}