{
  "title": "Blyssful Lies",
  "description": "Blyssful Lies (Book 2) has over 2000 five star ratings and still growing! A best seller!  Blyss is part of a carefully orchestrated, organized game, and is driven by much bigger and darker forces. A very complex and original plot!       Two sexy, ruthless men...and one innocent female caught in the middle.             Sexual tension, danger and intrigue will keep you on your toes! Learning how to survive in her new world, Julianna has no choice but to play \"The game of Life.\" Except it's Nick's game, and his rules apply. Captivity, drugs, and submission are the cards that are dealt, and it's a losing game.  Biding her time as she waits for her rescuers, it's far from smooth sailing, because all too quickly the rules abruptly change as Nick takes matters into his own hands... As the drama unfolds, and hesitating to interfere, Travis has everything to lose should he decide to step in, including his life. It's opposition at its finest - freedom versus control as Nick and Julianna face the ultimate battle of wills. While Travis has the uncanny ability to manipulate her with a single touch, Nick struggles to conquer her body, mind, and soul. It's every man for themselves as each have their own secret agenda, including Julianna, whose plan is survive. If you’d love to Get Deleted Scenes, Giveaways, and Specials...Visit me  JCCLIFF.com Blyssful Lies (BOOK 2)  A New Adult Erotic Romantic Suspense This contemporary, erotic captive romance book is full of action & adventure, mystery & suspense. This is an edgy, erotic thriller that will have you hanging on to the edges of your Kindle eBook. (350 pages) Books must be read in order (BOOK 1) Blyssful (BOOK 2) Blyssfully (BOOK 3) Women's Fiction. **Mature Audiences Only** This book is intended for adults of mature audiences only (18+). This book contains themes which could be considered dark.",
  "genres": [
    "Dark",
    "Romance",
    "Erotica",
    "BDSM",
    "New Adult",
    "Suspense",
    "Dark Romance"
  ],
  "author": "J.C. Cliff",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/23880982-blyssful-lies"
}