{
  "title": "Love Gone to the Dogs / Yours, Mine and Ours / Love Triumphs",
  "description": "Amazon Bestseller of sweet contemporary romance with humor Love Gone to the  Single mom, Leah Taylor, has her hands full with a grandfather, an inventor, who lives a bit risky when it comes to his job and two sons, one a rambunctious genius. But it is her free spirited beagle who gets her into trouble with her new neighbor, Dr. Shane O'Grady, when her dog makes a move on his champion bichon that he wants to breed. Leah and Shane clash over their dogs that clearly like each other. Leah is determined to ignore her neighbor, but when her youngest son who tries to defy gravity and fly ends up hurt, it is her neighbor, the doctor, who takes care of her son. Can Leah and Shane find love or has love gone to the dogs? Your, Mine and  The last thing Tess Morgan, divorced mother of three rambunctious kids, needs is a speeding ticket--especially not one delivered by sexy-as-sin Officer Zachariah Smith. Not only is he ridiculously overbearing, but handsome enough to tempt her to forget her vow to steer clear of all men! Too bad for her, the widowed cop has other plans. Zach, a single parent himself, knows all too well what it's like being alone, and he's had enough. Will his determination to forge better lives for both of their families be enough to overcome past pains? Love  Roxie Davenport came to New Mexico to learn about her birth mother. She has no intention of getting involved in her biological mother's family or letting them know who she is…until she meets Alex Stone, a rancher and brother-in-law to her birth mother. Everything changes and tries Roxie in ways she hadn't been before. Alex Stone has no desire to fall in love again after his wife died, leaving him and his mischievous little daughter alone to go on in spite of their pain. But when he meets his sexy new tenant in the cabin on his ranch, his resolve to remain single is tested.",
  "genres": [],
  "author": "Margaret Daley",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/23876841-love-gone-to-the-dogs-yours-mine-and-ours-love-triumphs"
}