{
  "title": "A Dangerous Reality",
  "description": "Keep your lovers close—and your enemies in bed.TURK: My club sent me to track him down. And when my mission was over, I never wanted another one again. When I found him, I kicked the crap out of Havelock Singer. I issued the mightiest beatdown of all time. Problem is, we’re evenly matched. We’re equals in every way, and when we finished whaling on each other, exhausted, we fell into each other’s arms.I’ve never regretted it for an instant. It’s been the ride of my life. But loving another man in the MC world is a risky business. As if our business isn’t already brutal and ruthless enough, Lock’s homophobic sergeant-at-arms Stumpy gets an eyeful of our lovemaking and blackmails us into doing some of his dirty work, or be exposed for what we are—a couple of deviants.This run into the Indian reservation is sleazy and beneath us, but now I’m cornered, and I’ll do anything to keep my sweet master Lock from being lynched by his club.LOCK: When that kingpin Carmine Rojas got a load of my beautiful stallion Turk Blackburn, he’d stop at nothing to have him—and Rojas gets what he wants. It’s my fault we’re in this situation. I should’ve kicked Turk’s ass and sent him packing back to The Bare Bones. I wasn’t even close to being ready to come out, but now they’re forcing my hand.I can hear my destiny calling me. Either I’ll slink back to my club like a hetero bounty hunter with no morals—and no respect from anyone in my own backyard—or I’ll step up to the plate and be the lion of the day. Either way, my lover and I are screwed. Our clubs are going to hound us underground or into another country before we escape this mess—if we don’t die trying.“Living off the grid and being an outlaw brings a dangerous reality.” –Ron PerlmanPublisher’s warning: This book is not for the faint of heart. It contains scenes of gay sex, consensual BDSM, illegal doings, dubious consent, and man-on-man violence.",
  "genres": [
    "M M Romance",
    "BDSM",
    "Erotica",
    "Contemporary",
    "Romance",
    "Crime",
    "Abuse"
  ],
  "author": "Layla Wolfe",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/23879399-a-dangerous-reality"
}