{
  "title": "The Zen Commandments: Ten Suggestions for a Life of Inner Freedom.",
  "description": "The Ten Commandments tell us how to behave, but they don't say much about the inner awareness from which outer behavior springs. Do the right thing, of course-- but better yet, find your inner light and doing the right thing becomes as natural as breathing. THE ZEN COMMANDMENTS offers ten powerful nudges toward that light.Drawing on sources from Zen stories and the Bible to jazz and rock 'n' roll, from American movies to Tibetan meditative techniques, Dean Sluyter steers clear of dogma and emphasizes what works-- a sort of spiritual street smarts. He shows that the state of boundless freedom and happiness isn't something distant or exotic, but is right here, while you're stuck in traffic or taking out the trash. And revisiting the Ten Commandments, he shows how on a deeper level they offer some surprising enlightenment wisdom of their own.“The book is extremely well written and joyously entertaining.”—Publishers Weekly “With sparkling clarity and wit, Sluyter's ten suggestions lay out the practical essentials of the path. My suggestion listen to this guy.”—Lama Surya Das, author of Awakening the Buddha Within “Dean Sluyter clearly presents simple but profound ways to live one's life consciously and skillfully. He teaches that the source of universal truth not only rests in the heart of every one of us, but is the essence of what ultimately brings us true happiness and freedom. This is a wonderful book with rich wisdom and deep insight.”—Rabbi David Cooper, author of God Is a Verb “No matter what your religion (or lack of it), this book shows how to live the kind of life people ache for. It turns out to be pretty simple.”—Jane Cavolina, co-author of Growing Up Catholic",
  "genres": [
    "Nonfiction",
    "Zen",
    "Buddhism",
    "Spirituality",
    "Philosophy",
    "Self Help"
  ],
  "author": "Dean Sluyter",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/238869.The_Zen_Commandments"
}