{
  "title": "The Fate of the Elephant",
  "description": "With a single hand, he can pull two palm trees to the ground. If he had two hands, he could tear the sky . . .So unfolds a Yoruba poem celebrating the largest, most powerful, and one of the smartest creatures to walk the planet: the elephant. In this richly detailed exploration of the natural history and troubled fate of both the African and Asian species of elephant, noted wildlife biologist and author Douglas Chadwick travels the world to acquaint us with these awesome giants.Through visits to India, Siberia, Botswana, Thailand, Malaysia, Kenya, and even an American zoo, Chadwick illustrates the pivotal role the elephant plays in shaping and balancing not only the ecosystems it calls home, but also the livelihoods of a wide array of people. We travel to East Africa and join elephant families on the savannas of Amboseli Reserve in the shadow of Kilimanjaro. In the thick jungles of the Congo Basin, Chadwick leads us down pygmy footpaths on the trail of the elusive forest elephant. In Asia we experience a day in the life of a working elephant at an Indian timber camp, and take a raft trip to transplant problem elephants to remote areas of the Malaysian rainforest. At the zoo, we watch a four-ton artist take brush in trunk and paint a canvas with delicate strokes. In each place we visit, Chadwick reveals the elephant as a playful, intelligent being, full of surprises and ready to smash the narrow confines from which we traditionally view animals.As he shows us how similar elephants are to humans - they travel in closely knit families, learn from each other, look after their ill and elderly, mourn their dead, and communicate through a vocabulary of audible and subsonic sounds that addup to a surprisingly nuanced and expressive language - he leads us to rethink our definition of and approach to conservation.Chadwick also introduces us to the people whose lives are intimately connected with the elephant's - mahouts, researchers, loggers, royal white elephant metaphysicians, veterinarians, poachers, and some of the world's most talented ivory carvers. He illustrates how the elephant is integral to the history and mythology of the peoples with whom it has lived, and shows us why, despite that bond, elephants and humans have come into inevitable conflict as they vie for the same crucial tracts of land. Discussing the combination of factors that have pushed the elephant to the brink of extinction - the drastic loss of habitat, the ruthless pursuit of ivory, the unstable societies in crowded nations - Chadwick shows us why the fate of the elephant is a potent metaphor for our own fate, and makes a compelling case for acting immediately to save the elephant from oblivion, lest we destroy a creature we are only beginning to understand.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Natural History",
    "Nature"
  ],
  "author": "Douglas H. Chadwick",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/2389132.The_Fate_of_the_Elephant"
}