{
  "title": "Acorna's World",
  "description": "Acorna the \"unicorn girl\" found as a baby years ago, abandoned and floating alone in an escape pod at the far end of the galaxy has made peace with her past, her Linyaari heritage, and with the powerful \"differences\" that set her apart from the loving humans who raised her. But only in the deep reaches of limitless space can she truly feel at home.Now, aboard the interplanetary salvage vessel Condor, Acorna is free once more, traveling through space in the company of her good friend, ship's commander Captain Jonas Becker, his gargantuan feline \"first mate\" Roadkill, and Aari, a proud Linyaari survivor of torture at the hands of the savage, bug-like Khleevi. But the journey is interrupted when a transmitted distress call faint but undeniable draws Acorna and her companions down to the surface of a nearby planet.What awaits them is a world of wonders, shrouded in an atmosphere of strange, intoxicating perfumes. Intelligent, sentiment plants help guide Acorna, Becker, Aari, and RK to the source of the SOS. But a broken, burned out alien ship is all they find, the pitiful remnants of a relentlessly brutal yet carefully coordinated assault. To Acorna, the signs are unmistakable.This is the grim handiwork of the cold-blooded species that seeks the complete eradication of all human and Linyaari life from the galaxy... the Khleevi!And suddenly all that Acrona holds dear is in grave peril. Because the devastation that was wrought here was no isolated occurence, but the opening move in a planned onslaught that will decimate the two races to whom Acorna is culturally, emotionally, and geneticallytied. A worlds-shattering catastrophe is in the making unless one courageous and beautiful young woman with remarkable healing powers and her small, motley group of friends can go the unthinkable: discover the fearsome insectile enemy's greatest weakness... and strike first.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "Space Opera",
    "Aliens",
    "Unicorns"
  ],
  "author": "Anne McCaffrey",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/238937.Acorna_s_World"
}