{
  "title": "Monogamy is Dead",
  "description": "“Gabriel,” Bianca whispered. “What have you done to me?”“Done?” he asked, his own voice gruff and filled with need. “ Nothing really. Yet. But I plan on doing many, many things to make you love me.”Socialite Bianca Lightenger has everything a woman could ever hope for: a wealthy husband who adores her, a mansion full of servants, and more designer labels than a trunk sale. Still happiness eludes her. The only thing that seems to temper the dull ache of ambivalence is casual sex with a long line of willing victims, a string of lukewarm affairs. Until the one day that the pleasure finally fails to outweigh the emptiness of her reality. Desperate to make a fresh start, Bianca finds herself eagerly searching for the happiness that seems intent on eluding her. When that happiness arrives in the guise of the handsome and enigmatic Gabriel Falcone, Bianca is forced to reexamine her views on love and life. And when she finds out that the man she is quickly falling for isn’t exactly what he seems, Bianca is more at odds than ever; can she just accept the love that Gabriel has to offer on his terms or did she already miss out on the perfect fairytale life of her dreams?Warning: This novella is intended for mature audiences and not for the romantic faint of heart. It does not have the typical HEA that you may be expecting but will definitely get you thinking about how complicated love can be, even when everything seems to be perfect on the surface. HOWEVER, there is something for everyone, so come along for the Incubus Rising ride, with the gorgeous Gabriel Falcone as our ringmaster:More stories in the Incubus Rising Series are:Page Turner (Book Two) - Tessa and Cage's fantastical journey into pure imagination and some steamy, page turning romance. The Only Exception (Book Three) - Olivia and Dante's epic love story, that's all about hope and second chances. Invisible (Book Four) - A sexy Cinderella story about unassuming, good girl Cassadee who gets much more excitement than she bargained for as a bridesmaid at a certain Incubus Rising couple's private island wedding. Wild Thing (Book Five) a new Miami based off-shoot of the Incubus Rising Series, where we meet Willa Thorne, a brassy, ballsy, wild child who falls down the rabbit hole of the magical Hotel Danu and finds herself in the crosshairs of one very sexy Silverfox with some serious magical mojo.Also by Jennifer Mancini - Devil May Care, a full length novel about a badass, female assassin named Raine who inadvertently inspires the wrath of the surprisingly gorgeous God of the Dead.",
  "genres": [
    "Paranormal Romance",
    "Fantasy",
    "Fiction",
    "Paranormal"
  ],
  "author": "Jennifer Mancini",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/23899241-monogamy-is-dead"
}