{
  "title": "Cassidy Yates Series: Books 1-3",
  "description": "The first three books in the Cassidy Yates series in one volume:  The Outlawed Deputy - Cassidy Yates was appointed deputy sheriff of Redemption City but such was his knack of attracting trouble that barely twenty-four hours after his appointment he had been slapped in jail! And if that wasn’t bad enough, Brett McBain’s outlaw gang rode into town to bust Nathaniel McBain from jail. Sheriff Wishbone is killed and the townsfolk think Cassidy responsible. Now, having been imprisoned for the murder of his own sheriff, Cassidy must prove his innocence and the only way to do this is to infiltrate Brett’s gang. He must convince Brett he’s an outlaw, and persuade everybody else that he really is an honest lawman. Could he pull off his enormous bluff or would he join Sheriff Wishbone on Boot Hill?  The Last Rider from Hell - Staked out under the baking heat of the desert sun by Frank Chapel’s riders from hell is no way for any man to die. Only someone as resilient as Matt Travis had the courage to endure the heat and the vultures and survive. When finally he manages to escape a gruesome death only one thing is on his mind – revenge. But his memory has been blasted to oblivion and he is even unsure of his own name. All he knows is that everyone wants him dead! Justice must be done and Matt will be judge, jury and hangman. First, though, he must face up to the truth of his past and, that accomplished, lead begins to fly.  Yates's Dilemma - When Wendell Moon hightailed it out of Monotony, he left in his wake a murdered lawman and a mob braying for his blood. Fifteen years later the word is out – Wendell Moon is back! But, for Sheriff Cassidy Yates, Wendell’s unwelcome return rekindles old vendettas and ignites three days of raging gun battles. Now the sheriff has the impossible duty of keeping the peace, but as if that isn’t enough Wendell also claims he never killed the lawman! If Cassidy doesn’t unearth the truth quickly, Wendell’s trigger-happy enemies will deliver their own form of gun-toting justice. Real trouble lies ahead!",
  "genres": [],
  "author": "I.J. Parnham",
  "average_rating": "2.00",
  "url": "https://www.goodreads.com/book/show/23906629-cassidy-yates-series"
}