{
  "title": "E-Go: Ego Distancing Through Mindfulness, Emotional Intelligence, and the Language of Love",
  "description": "Who are you? How do you define your place in this world? Do you often feel at odds with those about you? \n  There are many misconceptions about ego. Some tie an over-reaching ego to success, arrogance, self-esteem and other behaviors. Is it that simple? Ego is really the sum of the false ideas that we have about self. These beliefs are formed early in life, reside in the subconscious and have an incredibly strong influence on our thoughts, actions and emotions. When ego ideas rule your life, you are prevented from both seeing and living up to your true nature.  E-Go  can best be described as an enlightening and enriching look at how ego creates barriers in our lives and the most effective methods for ego distancing so that you can become your true self. Taite Adams explores ego not as something that you simply wish away, but rather a definition of self that should be re-examined and re-directed where necessary.  Part I examines the essentials of ego, offering several definitions of ego and connecting those to our thought patterns and how we relate to others. Adams outlines the various factors that ego uses as defining mechanisms, offering personal stories and examples from her own journey. Part II takes a look at how ego creates barriers in major areas of our lives and provides specific methods for ego distancing in each of those areas. The principles of mindfulness, emotional intelligence and the language of love are common themes. Part III ties it all together as the true nature of all problems relating to the ego is revealed: the myth of separation.  Are your old ideas about self and behavior causing problems in your life? E-Go  invites you to examine ego behavior in relationships, career and health - giving a clear understanding of a life with ego distancing in each of these areas. Throughout, the path to ego distancing through mindfulness, love and gratitude is made clear. Learn how to awaken your true nature as you re-connect with others and discover your oneness with the Universal Source.",
  "genres": [
    "Self Help",
    "Spirituality"
  ],
  "author": "Taite Adams",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/23920100-e-go"
}