{
  "title": "Countermeasure",
  "description": "In the first novel of the COUNTERMEASURE SERIES, tenacious ex-CIA agent Cassandra James is in hot water. A cyber thief stole sensitive information from her father's top client - information she was supposed to keep secure - and now she could lose her job, even if she is the boss' daughter. The only person who can help her recover the stolen data is sexy NSA analyst Trevor Bauer - a computer mastermind who's broken through her personal security and might break her heart as well.  Trevor is on the hunt for answers to the mystery surrounding his parents' disappearance. Following a promising lead into the missing Bristol files, he accidentally gets on the radar of a woman too hot to handle...and a mercenary willing to do anything to keep both of them from recovering those files.  To track down the thief, Trevor and Cassandra must embark on a harrowing adventure that leads them across the ocean and into a world of intrigue, danger, and passion. But as they close in on their target, their relationship begins to boil, jeopardizing their mission as well as their very lives. Will they learn to trust their instincts - and each other - in order to survive?   NOTE:  The Countermeasure Series novels have two tie-in/sideline series: Countermeasure: Bytes of Life and Bits of Life. These short stories and novellas give the readers glimpses into the day-to-day life of the Countermeasure characters. They are voyeuristic glimpses into their married life, proof that the heat of romance begins with I do. These short stories and novellas can be read as standalone Romantica, they are character-driven, NOT plot-driven. Please be advised that ALL shorts in these series contain MATURE content. They are NOT recommended for younger audience. Some of the events taking place in the short stories are referenced in the novels and vice-versa. Although the three series are interconnected, the short stories are not a necessary read for the unraveling of the mystery in the series, yet each book pushes boundaries in the development of their intimate relationship and that reflects in their behavior/actions in the novels.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Mystery",
    "Suspense",
    "Contemporary",
    "Thriller",
    "Fiction"
  ],
  "author": "Chris Almeida",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/23905596-countermeasure"
}