{
  "title": "Last Kiss",
  "description": "New York Times bestselling author Luanne Rice returns to Hubbard’s Point, Connecticut, and to characters from her beloved Beach Girls , to tell the haunting story of a close-knit community grappling with a heartbreaking mystery, and of a woman rebuilding her world and reclaiming a love she believed lost a lifetime ago.A face on a poster, a name in the news, an inexplicable tragedy. A promising young man goes out one warm summer evening and is found dead—murdered—less than twenty-four hours later. No motive. No clues. No answers. Most people reflect briefly on the disturbing headlines, perhaps say a silent prayer of safely removed sympathy, and go on with their lives. But what if the young man was your son? Or your true love?Nearly a year after the death of eighteen-year-old Charlie, singer-songwriter Sheridan Rosslare still hasn’t played a note of the music that was once her life’s passion. Tucked away in the beach house where she raised her only child, she lives with her memories of him and a grief too big to share even with her beloved sisters or her dear friend Stevie Moore. Nor can Stevie comfort Charlie’s heartbroken girlfriend, Nell Kilvert, whom she regards as a daughter. Nell won’t rest until she finds out what really happened to the boy she loved. Out of the past she summons a man she believes cares enough, and is tough enough, to uncover the truth—Sheridan’s long-ago soul mate, Gavin Dawson.Now Gavin’s boat, the Squire Toby, sits anchored in the harbor within sight of the window of the woman he once loved, still loves, and will always love. Sheridan, too, had once fervently believed in the miraculous power of love and healing, forgiveness, connection, and reconnection. But that faith died along with her son….Unfolding among the Hubbard’s Point people and places that fans have come to treasure, and replete with feeling and mystery, Last Kiss weighs the power of the past to heal as well as wound, in a captivating tale of love, loss, and redemption that no reader will ever forget.",
  "genres": [
    "Romance",
    "Fiction",
    "Mystery",
    "Chick Lit",
    "Contemporary",
    "Womens Fiction",
    "Contemporary Romance"
  ],
  "author": "Luanne Rice",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/2391127.Last_Kiss"
}