{
  "title": "Come An’ Get It: The Story of the Old Cowboy Cook",
  "description": "Come an’ Get It was the most familiar and welcome call on the range era of the great trail drives following the Civil War. In this entertaining volume, Ramon F. Adams, author of the popular Western Words, tell the story of the old cowboy cooks, and the result is another highly original contribution to the folklore of the cattle country.Although the cowboy cleared the Southwestern frontier of savage Indians and opened the land for settlement, the cook and his commissary contributed greatly to the success of the operation; for as an army depends upon its mess-kitchens, so the cowboys depended upon the chuck wagon. Without it, there would have been to trail drives to rescue Texas from bankruptcy following the Civil War, no roundups to speed the development of the cattle industry, and no beef for the heavily populated areas of the United States.The author records the place and influence of the range cook upon Western life. He discusses the functions of “coosie,” the food he served, and his methods of preparing it-giving recipes for sourdough biscuits, fluff-duffs, son-of-a-bitch stew, and other distinctive dishes of the range. He describes, too, “the wagon,” its evolution, and its place in the hearts of the men who called it home.Although there remain a few chuck wagons on the larger ranches today, they have become so scarce that one is rarely seen except in a museum or a rodeo parade, and the younger generation of cooks, like the cowboys themselves has been tamed.Every cook was a “character,” perhaps with reason, for no man ever worked under greater difficulties or with fewer conveniences. Anecdotes and incidents which illuminate the idiosyncrasies of these “Sultans of the Skillets” are recounted with gusto.Nick Eggenhofer’s drawings help Mr. Adams bring the cook and his accoutrement vividly to life.",
  "genres": [
    "Westerns",
    "Nonfiction"
  ],
  "author": "Ramon F. Adams",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/239206.Come_An_Get_It"
}