{
  "title": "Find It, Fix It, Flip It!: Make Millions in Real Estate - One House at a Time",
  "description": "Michael Corbett is the best selling author and Real Estate Expert for NBC's EXTRA, EXTRA's Mansions and Millionaires, ABC's THE VIEW,   FOX News and GOOD DAY LA.   He a regular contributor to CNN , TIME.com , SMART MONEY Magazine , FOX Business , Yahoo Real Estate and BankRate.com .   Michael is also the real estate expert and contributor to the real estate website Trula.comIn this book he shares his strategies, tips, and never-before-revealed insider techniques that have helped him make a fortune in real estate no matter what the market is doing! Especially in Today's Market , it is essential to lean how to be smart, safe and conservative when flipping.  This book is for aspiring flippers, first-time home buyers, or any homeowner who wants to create big profits and own their ultimate dream home—mortgage free! Starting with the essentials, Corbett shares how to crunch the numbers to instantly determine a house's profit potential. He teaches you how to streer clear of the \"no money down gurus\"  by teaching you the safe and practical strategies you need to know in this market . He then covers every step from purchase to • Learn to take advantage of Today's Market opportunites   Get the profit-making house at the price you can afford• Make the improvements that make you millions• Insider secrets that save you thousands• Safeguard your profits from the market's ups and downs• Sell your home tax free and pocket the profitsFilled with practical tips, illustrated with before-and-after case studies and easy to use charts and worksheets, Find It, Fix It, Flip It! offers the insider expertise needed to tap into an exciting—and potentially limitless source of income and financial independence. Lean Real Estate the Right Way!",
  "genres": [
    "Nonfiction"
  ],
  "author": "Michael Corbett",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/239148.Find_It_Fix_It_Flip_It_"
}