{
  "title": "Coping with Chronic Pain, a Team Effort! 1: For You and Your Partner",
  "description": "Coping with Chronic Pain, a Team Effort! For You and Your Partner  Do you suffer from invisible chronic pain and does it cause you to have a hard time maintaining a healthy and strong relationship with your significant other? Does your partner not understand what you go through and what you really need? Do you act tough, trying not to come across as whiny, leading to more pain and you not getting sufficient help and support?  Read and learn how to turn your spouse into a 'Strong Helper' and get the attention, support and help that you need.  Are you the spouse of someone suffering from invisible pain? Do you find it difficult to understand the anxiety and fear, and tough knowing how to lend support and adequate help? Are you overwhelmed by all the extra work, and do you miss the relationship you once had?  Read and learn how you can become a 'Strong Helper’, and save your own health ánd your relationship at the same time.  Anna Raymann is a writer, a physiotherapist and a chronic pain patient. She knows how chronic pain can affect your social life. She wrote this book, with the help of a psychologist and over a hundred CPPs and the people around them, to help you retain a healthy relationship and family life, in spite of the pain!  Be beware: this is a self-help/work book! If you don’t want to come out of your comfort zone, then don’t read it! If you don’t want to save the relationship with your significant other, or make him/her understand your needs in order to give you the support and help you require, don’t read it either!  Living with chronic pain places a strain on all the important relationships in the life of the patient, as well as their spouse, children, family & friends. In these books you will find hundreds of ‘dos & don'ts’; practical, instantly applicable tips and advice that will benefit everybody suffering from pain, as well as those in their inner and outer social circles. A stronger social network for the chronic pain patient increases activity and can help to reduce the pain, as well as the need for medication and therapy.  More Coping with Chronic Pain, a Team Effort!:  Book 2. For You and Your Kids Book 3. For You and Your Family & Friends  Read more about Anna and her work on http://www.supportforchronicpain.com/",
  "genres": [],
  "author": "Anna Raymann",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/23921639-coping-with-chronic-pain-a-team-effort-1"
}