{
  "title": "Divided Houses: The Hundred Years War, Volume 3",
  "description": "The Hundred Years War was a vicious, costly, and, most dramatically, drawn out struggle that laid the framework for the national identities of both England and France into the modern era. The first twenty years of the war were positive for the English, by any account. They already held the South of France, through Eleanor of Aquitaine's dowry, and were allied with the Flemish in the north. After the brilliant naval battle of Sluys, the English had control of both the English Channel and the North Sea. The battles of Crécy and Poitiers gave the English a powerful toehold on the continent; they even captured the French king, Philip, occasioning a peace treaty in 1360.This long-awaited third volume of Jonathan Sumption's monumental history of the war narrates the period from 1369 to 1393, a span marked by the slow decline of English fortunes and the subsequent rise of the French. The English were condemned to see the conquests of the previous thirty years overrun by the armies of the king of France in less than ten. Edward III was succeeded by a vulnerable child, destined to grow into a neurotic and unstable adult presiding over a divided nation. England's citizenry was being asked to pay for a long and expensive war, soldiers were becoming disenchanted, and the Peasants' Revolt of 1381 evidenced the social unrest in the land. However, France too paid a heavy price for her success. Beneath the surface splendor the French government sat poised at the edge of bankruptcy and the population subsisted in fear and insecurity. The inexperience of Charles VI and his gradual relapse into insanity divided the French political world, as the king's relatives competed for the plunder of the state, sowing the seeds of disintegration and civil war in the following century.Marshaling a wide range of contemporary sources, both printed and manuscript, French and English, Sumption recounts the events of this critical period of the Hundred Years War in unprecedented detail.",
  "genres": [
    "History",
    "Medieval History",
    "Military History",
    "Medieval",
    "War",
    "Nonfiction",
    "European History"
  ],
  "author": "Jonathan Sumption",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/2392905.Divided_Houses"
}