{
  "title": "Belvedor and the Four Corners",
  "description": "See Alternate Cover and New Edition HERE.The Hunger Games meets Red Queen and Throne of Glass in this action-packed Epic Fantasy Adventure series.On a quest for freedom from a tyrant king, follow Arianna Belvedor as she unearths the enchantment buried beneath her dark world and learns how to wield magic alongside her swords. She will either win or die; whichever her fate, freedom is certain.  ****Arianna Belvedor has only ever dreamed of winning her freedom from the Four Corners—a cold and cruel city where all the children of the world are kept, each with an opportunity to earn their citizenship upon their eighteenth year. Just months away from her ultimate battle, she is certain that her notable skills as a warrior-slave (having been trained by Master Solomon Bell, a formidable mentor in Warrior's District) will give her an edge during the annual Free Falls Festivals: Free for the slaves who earn their citizenship. Falls for the ones who die.  Alas, Arianna's talent with a sword cannot outmaneuver the burning curiosities of her heart, leading her to reveal a shocking yet spectacular secret about King Devlindor and his long-standing reign as High King of Olleb-Yelfra. The world as she knows it is a lie, its true spellbinding history exploited and suppressed under centuries of deceitful acts.Her world turned upside down with new, unfathomable knowledge, Arianna must make a choice that could change her life forever—ignore the truth and continue following the path laid out for her since birth or break free from her chains and carve her own... if she can survive.Immerse yourself in this addictive fantasy world as Arianna is thrust on a thrilling journey to uncover magic and more than earn her rights to freedom.Belvedor and the Four Corners is a recipient of the 2017 Indie B.R.A.G. Medallion Award.****Don't miss the next books in Ashleigh Bello's enchanting Belvedor Saga: Belvedor and the King's Curse, Belvedor and the Desert of Secrets, and\n Belvedor and the Golden Rule.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Magic",
    "Ghosts",
    "Adult",
    "Dystopia"
  ],
  "author": "Ashleigh Bello",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/23931136-belvedor-and-the-four-corners"
}