{
  "title": "Hunted",
  "description": "*To the reader: This is NOT the typical MC romance. It IS the story of how a man who happens to be in a MC club falls for his lawyer. It IS the story of how a lawyer, an ICE agent and a MC club are thrown together by unavoidable circumstances and forced to work together for the good of all involved. If you are a die-hard MC fan looking for a die-hard MC romance novel this may NOT be the book for you. This is the introductory book to (Dauntless MC) series. Though it is the story of Talon and Grace, it also has 3-4 other stories interwoven within the story line in order to introduce you to characters you will see in future Dauntless MC books. If you do not like that many story lines in a book, this may not be the book for you.*You met Talon in 'Don't Judge a Book' and you asked for his story...this is it. Talon: She walked into my world when I least expected it and like a sucker punch to my gut she knocked the wind from me. The last thing I need is some do-gooder feeling sorry for me and taking my case. I made the mistake of thinking she was here because she had a good heart— what I didn’t know… is the woman has heart…period.She’s going to need it because now the president of Dauntless MC is insisting she not only take over my case—but every legal case any one of the brothers have—now and in the future. He’s not the kind of guy you say no to.Grace: I walked into that jail to help a man I believed needed it. Whether I made a mistake that day or not is yet to be seen. One thing is for sure…I have been immersed into a world I know nothing about… against my will.Whether I like it or not, I need this arrogant man who goes against everything I believe as a strong professional woman. I’m nobody’s old lady, I’m nobody’s fool, and I’m damn sure nobody’s property. What I am is…legal representation for the Dauntless MC chapter. My name is Grace. Welcome to my world.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romantic Suspense",
    "Dark Romance",
    "Contemporary",
    "Erotic Romance",
    "Motorcycle"
  ],
  "author": "Suzanne Steele",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/23923238-hunted"
}