{
  "title": "The Shooting Party",
  "description": "Anton Chekhov's only full-length novel, this Penguin Classics edition of The Shooting Party is translated and edited by Ronald Wilks, with an introduction by John Sutherland.The Shooting Party centers on Olga, the pretty young daughter of a drunken forester on a country estate, and her fateful relationships with the men in her life. Adored by Urbenin, the estate manager, whom she marries to escape the poverty of her home. She is also desired by the dissolute Count Karneyev and by Zinovyev, a magistrate, who knows the secret misery of her marriage. When an attempt is made on Olga's life in the woods, it seems impossible to discover the perpetrator in an impenetrable web of lust, deceit, loathing and double-dealing. One of Chekhov's earliest experiments in fiction combines the classic elements of a gripping mystery with a short story of corruption, concealed love and fatal jealousy.Ronald Wilks's brilliant new translation of this work is the first in over seventy years. It brilliantly captures the immediacy of the dialogue that Chekhov was later to develop into his great dramas. This edition also includes an introduction by John Sutherland, suggestions for further reading and explanatory notes.Anton Chekhov (1860-1904) was born in Taganrog, a port on the sea of Azov. In 1879 he travelled to Moscow, where he entered the medical faculty of the university, graduating in 1884. During his university years, he supported his family by contributing humorous stories and sketches to magazines. He published his first volume of stories, Motley Tales, in 1886, and a year later his second volume In the Twilight, for which he received the Pushkin Prize. Today his plays, including 'Uncle Vanya', 'The Seagull', and 'The Cherry Orchard' are recognised as masterpieces the world over.If you enjoyed The Shooting Party, you might like Chekhov's Plays, also available in Penguin Classics.",
  "genres": [
    "Classics",
    "Fiction",
    "Russia",
    "Russian Literature",
    "Mystery",
    "Literature",
    "19th Century"
  ],
  "author": "Anton Chekhov",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/114610.The_Shooting_Party"
}