{
  "title": "The Surrender Your Love Trilogy: Surrender Your Love, Conquer Your Love, Treasure Your Love",
  "description": "All three books of the New York Times bestselling Surrender Your Love trilogy are included in this bundle. Includes the first three chapters of The Lover's Secret. \"If you like any book like Fifty Shades, Bared to You, the Up in the Air series....you will totally love this!\" \"Surrender You Love is among my top five reads of this year, great characters, wonderful plotline and love scenes that have you fanning yourself.\" \"This is a real \"page turner\" Un-put-a-down-able! Seriously like a delicious warm chocolate piece of cake, you will devour it! Whole! In one steamy afternoon.\" \"Secrets, scary pasts, lies, tragedy, love, lust, betrayal... the perfect blend to any successful story!\" SURRENDER YOUR LOVE (Book 1) Meeting Jett was like lightning. Dangerous. Better left untouched. And better forgotten. But lightning always strikes twice. Brooke Stewart, a realtor in New York, doesn't do relationships. When she's sent to a remote estate to finalize a real estate deal, she discovers her new boss is no other than the guy she left naked in bed. Sexy, dangerously handsome, and arrogant Jett Mayfield attracts trouble, and women, like a lightning rod. But the night he meets Brooke he gets more than he bargained for. The green-eyed millionaire playboy isn't used to taking no for an answer, and he isn't about to start now. When he proposes two months of no strings sex, Brooke is intrigued and accepts his proposal. Little does she know Jett's determined to claim the one woman he can't have, pulling her deeper into his dangerous world. CONQUER YOUR LOVE (Book 2) Meeting Jett was like bad luck. Dangerous. Unpredictable. And better avoided. In his game, the stakes are high. But are they worth the risk? Brooke Stewart, a realtor in New York, finds forgetting is hard, but forgiving is harder. When the man she trusted, betrayed her, the only way to forget is to move on. Brooke is determined to start a new life, until she meets him the green-eyed, sexy as sin, six foot two sex god. The man who played dirty. The man who played her. Sexy, handsome, and arrogant Jett Mayfield knows he has made mistakes. He could have any other woman, and yet it's Brooke he wants. When second chances collide with secrets and Brooke is threatened by the past, Jett is determined to protect her. She accepts his help unwillingly because she needs him but she wants to play his game on her own terms. And she has no intention to forgive or let him back into her bed. When the man she is supposed to hate is the one she should trust, will he conquer her...or lose her forever? TREASURE YOUR LOVE (Book 3) Meeting Jett was like a drug. Dangerous. Addictive. And better forbidden. In his game, there's a high price to be paid. But how much is too much?   Brooke Stewart, a realtor in New York, was never in love until she met the green-eyed, sexy as sin, six foot two sex god, Jett. The man to whom she surrendered. The man who hurt her once only to conquer her heart again.   Sexy, handsome, and arrogant Jett Mayfield knows he has found his match. Brooke is like no other woman he's ever met and he has every intention of keeping her in his bed. Their future seems full of promises...until the past is catching up with them and dark secrets threaten to destroy their lives. Soon they realize that to love means to lose, and some choices are harder than others. When everything comes crashing down, can mistakes be amended...or will he lose her forever?",
  "genres": [
    "Romance",
    "Anthologies"
  ],
  "author": "J.C. Reed",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/23927954-the-surrender-your-love-trilogy"
}