{
  "title": "Strands of Sorrow",
  "description": "BOOK 4 AND CONCLUSION OF THE BLACK TIDE RISING SERIES FROM THE NEW YORK TIMES BEST-SELLING AUTHOR. Sequel to Islands of Rage and Hope, To Sail a Darkling Sea, and Under a Graveyard Sky. A hardened group of survivors fights back against a zombie plague that has brought down civilization.With the world consumed by a devastating plague that drives humans violently insane, what was once a band of desperate survivors bobbing on a dark Atlantic ocean has now become Wolf Squadron, the only hope for the salvation of the human race. Banding together with what remains of the U.S. Navy, Wolf Squadron, and its leader Steve Smith, not only plans to survive—he plans to retake the mainland from the infected, starting with North America.Smith's teenage daughters have become zombie hunters of unparalleled skill, both at land and on the sea, and they may hold the key to the rebirth of civilization on a devastated planet.At the publisher's request, this title is sold without DRM (Digital Rights Management).About the Black Tide Rising Series:\"Not only has Ringo found a mostly unexplored corner of the zombie landscape, hes using the zombie frame to tackle a broader theme: the collapse and rebirth of civilization. The zombie scenes are exciting, sure, but its the human story that keeps us involved. A fine series.\"—BooklistAbout Under a Graveyard Sky:“Ringo combines humor and horror in this strong series debut, the thinking reader’s zombie novel.”—Publishers WeeklyAbout John Ringo:“[Ringo’s work is] peopled with three-dimensional characters and spiced with personal drama as well as tactical finesse.” —Library Journal“. . . Explosive. . . . fans. . .will appreciate Ringo’s lively narrative and flavorful characters.” —Publishers Weekly“. . .practically impossible not to read in one sitting . . . exceedingly impressive . . . executed with skill, verve, and wit.” —Booklist“Crackerjack storytelling.” —StarlogBLACK TIDE RISING SERIES:Under a Graveyard SkyTo Sail a Darkling SeaIslands of Hope and RageStrands of Sorrow",
  "genres": [
    "Science Fiction",
    "Horror",
    "Zombies",
    "Military Fiction",
    "Post Apocalyptic",
    "Fiction",
    "Military Science Fiction"
  ],
  "author": "John Ringo",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/23923487-strands-of-sorrow"
}