{
  "title": "The Steppe and Other Stories, 1887-91",
  "description": "The Steppe and Other Stories 1887-91 is a collection that reveals Anton Chekhov's evolution from a novice writer to a master of short narrative form. This Penguin Classics edition is translated by Ronald Wilks with an introduction by Donald Rayfield.This collection of Chekhov's finest early writing is headlined by 'The Steppe', which established his reputation, telling the unforgettable tale of a boy's journey to a new school in Kiev, travelling through majestic landscapes towards an unknown destiny. 'Gusev' depicts an ocean voyage, where the sea takes on a terrifying, primeval power; 'The Kiss' portrays a shy soldier's failed romantic encounter; and in 'The Duel' two men's enmity ends in farce. Haunting and highly atmospheric, all the stories in this volume show a writer emerging from the shadow of his masters - great Russian writers such as Leo Tolstoy, Ivan Turgenev and Nikolai Gogol - and discovering his own voice. They also illustrate Chekhov's genius for evoking the natural world and exploring inner lives.This is the first of three chronological volumes of Chekhov's short stories in Penguin Classics. Ronald Wilks's delicate translation is accompanied by a chronology and explanatory notes. This edition also contains an introduction and annotated bibliography by internationally renowned Chekhov scholar Donald Rayfield.Anton Chekhov (1860-1904) was born in Taganrog, a port on the sea of Azov. In 1879 he travelled to Moscow, where he entered the medical faculty of the university, graduating in 1884. During his university years, he supported his family by contributing humorous stories and sketches to magazines. He published his first volume of stories, Motley Tales, in 1886, and a year later his second volume In the Twilight, for which he received the Pushkin Prize. Today his plays, including 'Uncle Vanya', 'The Seagull', and 'The Cherry Orchard' are recognised as masterpieces the world over.If you enjoyed The Steppe, you might like Chekhov's The Lady with the Little Dog and Other Stories, also available in Penguin Classics.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Classics",
    "Russian Literature",
    "Russia",
    "Literature",
    "19th Century"
  ],
  "author": "Anton Chekhov",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/114606.The_Steppe_and_Other_Stories_1887_91"
}