{
  "title": "Trial by Ice: The True Story of Murder and Survival on the 1871 Polaris Expedition",
  "description": "In 1871, the Polaris sailed with great fanfare from New York harbor and began a historic journey to one of the earth’s final frontiers. Seven months later, a handful of half-starved survivors returned with a story that shocked the entire nation. . . .In the dark, divisive years following the Civil War, America’s foremost Arctic explorer, Charles Francis Hall, became a figure of national pride and renown when he embarked on a harrowing, landmark expedition. With financial backing from Congress and the personal support of President Grant, Captain Hall and his crew boarded the Polaris, a steam schooner carefully refitted for its rigorous journey, and began their quest to be the first men to reach the North Pole.Hall was a veteran of the Arctic and a man of great physical stamina, but all his strength and experience couldn’t combat the conflicts brewing among his officers and crew. Beset by bad luck, a lack of discipline, and an unclear chain of command, the Polaris entered the icy waters off the coast of Greenland. Neither the ship nor its captain would ever return.As the expedition reached its most crucial stage, Hall inexplicably sickened and died. Whispers of murder swept through the ship. Still, the Polaris forged on, only to meet with a further disaster that left half the crew separated from the ship and most of their supplies at the bottom of the ocean. What followed was a horrifying, seven-month ordeal through the heart of an Arctic winter, when men fought starvation, madness, and each other upon the ever-shifting ice.Trial by Ice is an incredible adventure that pits men against the natural elements and their own fragile human nature. Beyond this, it is also an authentic murder mystery that, in its time, led to accusations of foul play and a dramatic, unresolved investigation. Now, more than a century after the crime was committed, the author draws on recent evidence to recount the amazing story of the killer who boarded the Polaris–and got away with murder.In this powerful true story of death and survival, courage and intrigue aboard a doomed ship, Richard Parry chronicles one of the most astonishing, little known tragedies at sea in American history.",
  "genres": [
    "History",
    "Nonfiction",
    "Adventure",
    "True Crime",
    "Survival",
    "Travel",
    "19th Century"
  ],
  "author": "Richard Parry",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/2393406.Trial_by_Ice"
}