{
  "title": "Charlie Dead and the So-Called Zombie Apocalypse",
  "description": "Zombies, zombies, zombies! How does it feel to be one of the walking dead? Hunted? Not free? Never allowed to live the life you choose? Charlie Dunlap, newly infected with the zombie virus, fears he is about to find out. Charlie doesn’t want to become one of the mindless corpses at Norwood High School, where his few friends include the zombified Emma Fletcher. In this post-apocalyptic Armageddon, undead hordes are part of the horror of daily life. Just as Charlie is losing hope, though, a mysterious government agent appears at the door, raising questions about the boy’s late mother. How was the vanished scientist connected to the origin of the virus? Why was this terrible plague unleashed on the world? And who is now targeting zombies for persecution? Charlie, recruited to aid in the investigation, faces each new adventure with a dose of gallows humor and fading hope for a cure. But Charlie knows there’s more than his own fate on the line. At stake is the power to control the whole human race. Will Charlie survive? Who can he trust? In a world at war with the living dead, it’s not always easy to tell who the real monsters are. From author Geoff Camphire comes this high-flying, pulse-pounding zombie novel series, a new kind of dystopian science fiction. “CHARLIE DEAD and the So-Called Zombie Apocalypse” is Book 1 of the acclaimed CHARLIE DEAD series. PRAISE FOR ‘CHARLIE DEAD’: ‘I only put it down, temporarily, when absolutely forced to. I’m looking forward to the next installments!’ - Scott Leonard ‘A great read! Geoff Camphire puts a unique spin on the genre with fascinating characters - both of the living and zombie kind. He’s a great storyteller with writing and a plot that keeps you hooked.’ - Mary Tamberrino ‘I am fifteen. I really liked the books. I am ruthless when it comes to reviewing books and movies on my favorite subject. This more than held my interest, and that is no easy feat… I will pass the word on to my friends.’ - L. Hartley ‘In the first of Geoff Camphire’s CHARLIE DEAD young-adult zombie-lit series, life returns to a new kind of normal in a post-apocalyptic world… Camphire’s writing is crisp, and the plot and pacing are fresh and focused… I’m hungry for more!’ - Kevin S. ‘Irresistible. The story flows, the characters are vibrant, and the prose is witty!’ - Sarah ‘Never miss a ‘Walking Dead’ show? Here is the book to tide you over during those long breaks. Camphire pulls you in like the master of ghoul Stephen King and never lets you go.’ - Paula Kay ‘Light-hearted and creepy all at the same time, CHARLIE DEAD weaves through a world where zombies are a way of life, for the living and the non-living. Forget prom dates and pimples, Charlie and his friends have a zombie apocalypse to grow into.’ - Michael T. Gabriele ‘It’s as wonderfully fresh and different from any zombie literature as ‘Shaun of the Dead’ is from any zombie film!’ - T. Riordan ‘Attention YA Geoff Camphire has written a YA-Lit book with chops. The main character, Charlie, is nicely ‘fleshed out’ as a teen with both smarts and doubts... reflective, yet quick-acting when needed. The overall scenario in which the teen finds himself is unenviable - infected with a zombie virus, and unsure of who his true allies are. The portrayals of friendships are well-crafted, and the adventures well-paced.",
  "genres": [
    "Zombies",
    "Young Adult"
  ],
  "author": "Geoff Camphire",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/23944815-charlie-dead-and-the-so-called-zombie-apocalypse"
}