{
  "title": "A Second Dawn: Lesbian romance short stories: The best of Leasbian Romance Erotica Short Stories",
  "description": "erotica lesbian first timeThe heels of Kimberley's black leather boots dug into the gravel pathway as she swung the iron gate closed behind her. It thudded as it came to a close. The evening breeze nipped at her soft, pale skin as she proceeded up the narrow, winding footpath that led to the arched wooden door in the old brick wall of her cottage. The building was silhouetted by the sun setting behind the hills in the background. Waves of crimson, rose and magenta jumped vividly away from the sun's blinding surface and danced in the sky, painting it beautifully as the daylight began to fade away.She reached into the outside pockets of her scarlet winter jacket as she looked for her keys, but the door swung open just as her short body reached the wooden steps. Her lifelong friend, Lucy, welcomed her home, and Kimberley's grin spread across her cheeks as she darted into the arms of her friend.“Hey, you! I wasn't expecting to see you today!” Kimberley giggled softly in her silky Scottish accent.“I Heard that you were coming home today, I couldn't miss the opportunity!” Lucy responded.Lucy was about half a foot taller than Kimberley, and her bleach blonde hair fell like snow onto her shoulders.The two of them made their way into the warmth of the cottage. Lucy had lit some scented candles, and the sweet, fruity smell of oranges floated merrily around the small, cosy living room.The room had a low ceiling and a wooden beam arched over the top of the floorspace. A fireplace warmed the room as the flames hypnotically flickered and danced and the lovely heat oozed out into the surrounding area.“I'm so happy that you're healthy now!” Lucy whispered to Kimberley, who had just come home from the hospital. Lucy ran her fingers delicately through Kimberley's brunette hair. Lucy's soft touch comforted Kimberley and sent massaging waves gently floating up her spine.“Me too, it's all over now. Fingers crossed, anyway!”The two of them were nested in the comfortable embrace of the retro-style leather sofa that was arranged next to the open fire. Kimberley had fallen asleep with her head balancing on the sofa's curved arm, and Lucy glanced across at her. The two of them had always been close friends – since they were just two years old they had shared everything with one another – secrets, memories, tears and joy.",
  "genres": [],
  "author": "J.D. Killi",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/23933924-a-second-dawn"
}