{
  "title": "Instant Conflict Resolution - How to Resolve Conflict Instantly!",
  "description": "The Instant-Series Presents \"Instant Conflict Resolution\"How to Resolve Conflict Instantly!When was the last time you found yourself in a tough sticky situation where somebody was upset, angry, disagreeing or yelling at you about to make your life a living hell...and you thought they were going to pound your teeth out, smack you across the face, and smash your head on the concrete pavement, or threatening to sue you with a lawsuit...or vice versa, it was you who wanted to do all these things to them.Or perhaps maybe the issue might have been more internal such as YOU, yourself, were upset or angry not at ease with yourself in turmoil.The point is...problems, or conflicts, happen all the time. They will occur at home or at work, with anybody you meet or know, whether it's a spouse and loved one, friend and family, or co-worker and colleague.Conflicts are not always avoidable...but they are controllable. That's where conflict resolution comes in.For your safety, well-being, and best interest, it's important to know how to resolve conflict whenever they creep up as soon as possible!Within \"Instant Conflict Resolution\":* How to resolve, not just yours, but others' conflicts as well, by being the go-to mediator of all conflicts.* How to handle threatening angry people yelling at you without stooping down to their level for both party to come winning.* How to almost always avoid conflicts in you life by adopting some simple habits to practice.* How to confront intense unpleasant problems with calmness, confidence, and positivity without losing your cool.* How to immediately get yourself out of dangerous situations that can put you at risk of harm or injury.* Plus, custom practical \"how-to\" strategies, techniques, applications and exercises to resolve conflicts....and much more.Now the question you have to ask is, what would you rather do when faced with conflicts?You can add fire to the fire...or put out the fire through mediation to avoid making the problems worse, causing more harm to yourself and others.That's the importance of instant conflict resolution!",
  "genres": [],
  "author": "The Instant-Series",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/23938752-instant-conflict-resolution---how-to-resolve-conflict-instantly"
}