{
  "title": "eXcess: A Collection of Erotic Desires",
  "description": "#XcessiveOs Await You! 9 New York Times, USA Today & Amazon Bestselling Authors bring you some of the steamiest romance novels for one low price. KM Scott — Temptation— Cassian March gave up on love, but his sexy new assistant Olivia might just change his mind. Will they give in to temptation at Club X, or will they let their fears keep them from finding love? CJ Roberts— Captive in the Dark — This New York Times Bestseller is the story of a young woman kidnapped and held hostage by a human trafficker out for revenge. Gritty, violent, and not for the faint of heart. 18+ Heed all warnings. Pam Godwin — Beneath The Burn — Amid corruption and power, rock stars and drugs, Jay and Charlee must face their worst fears. When the battle is over, what will be left...Beneath The Burn. Al Daltrey — Testing The Submissive — Abby stood nervously before her Master, having to recount in exact detail the proceedings of her last whipping. How far will he push her with these tests, and what will happen when she’s pushed too far? Ella Dominguez — Grace Street — Cold and calculating, Victor has found the next victim on his to-do-list. But Elsa proves to be an infuriating challenger when she flips the tables on his selfish and twisted game - a game they both may end up losing their hearts and minds over. Scott Hildreth — Undefeated — While Shane Dekkar fights in the boxing ring, Kace Meadows fights for her life. After ten years in an abusive relationship she is ready to escape and does so with the help of an unlikely hero. Undefeated is a story about the realities abuse, the aftermath of abuse and learning how to love again. Marc Nobbs — The Big Four Ohhh! — When Dave Cartwright comes across a local newspaper ad offering twenty-seven inches of Prime British Beef, it plants the seed of an idea which leads to a unique celebration of his wife’s upcoming fortieth birthday. And a night that both of them will never, ever forget. Gina Whitney — Saving Abel — Abel Gunner, lead singer of Lethal Abel and Gia must face their demons before they can embrace a future together. In the end they're faced with two choices: fight for their love or die with their demons. Adriane Leigh — Wild — An independent woman, a controlling man, and one wild one-night stand… Desire and temptation smolder before she succumbs to her darkest fantasies with the captivating stranger. Kat Kenndedy doesn’t expect to see Lane Wild again after an explosive one-night stand leaves her breathless and craving more, but just like lightning in the darkness, he shows up in her life at the most unpredictable moments.",
  "genres": [],
  "author": "K.M. Scott",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/23945499-excess"
}