{
  "title": "The Chinatown Death Cloud Peril",
  "description": "The Chinatown Death Cloud Peril casts the rivalry between two of pulp fiction's most revered writers into its own saga, which bursts from the pages with blood, cruelty, fear, mystery, vengeance, courageous heroes, evil villains, dames in distress, secret identities and disguises, global schemes, hideous deaths, beautiful psychics, deadly superweapons, cliffhanging escapes, and other outrageous pulp lies that just might be completely true.Ravaged by the devastation of the Great Depression, America turned to the pulp novels for relief, for hope, for heroes.And the pulps delivered in spades.The science fiction story, the hard-boiled detective, and the superhero were all born on these cheap yellow pages, found behind blood-drenched covers dripping with sex and violence. Return now to those thrilling days of yesteryear, enter at your own risk into the dark and dank lair known as the White Horse Tavern, and meet Walter Gibson, the mind behind The Shadow, and Lester Dent, creator of Doc Savage, as they challenge one another to discover what is real and what is pulp.For Gibson, writing a new novel about The Shadow every month is a way to evade his own dark past. For his rival, Dent, creating Doc Savage is an attempt to bring the light of better days to desperate millions. In their lives and loves they are as different from one another as the heroes they've created. But now the hideous murder of the fringe pulp writer H. P. Lovecraft - victim of a mysterious death that literally makes the skin crawl - will set these two men on a collision course with each other, and face to face with a terrifying and very real evil that could have sprung from the pages of their own pulps.From the palaces and battlefields of warlord-plagued China to the seedy waterfronts of Providence, Rhode Island; from frozen seas and cursed islands to the labyrinthine tunnels and secret temples of New York's Chinatown, Dent and Gibson will find themselves in a dangerous race to stop a madman destined to create a new empire of pure evil. Together with the young pulp writer L. Ron Hubbard, a mysterious stranger, and a sexy psychic with a chicken, they will finally step out from behind their creations to take part in a heroic journey far greater than any story they have imagined. Their quest will force Gibson to look beyond the shadows and discover the true evil that lurks in the hearts of men, while Dent will learn that the nature of a true hero is not found in a fictional superman, but in the faith of the woman who challenges death itself to love him.",
  "genres": [
    "Mystery",
    "Fiction",
    "Pulp",
    "Historical Fiction",
    "Fantasy",
    "Crime",
    "Noir"
  ],
  "author": "Paul Malmont",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/239529.The_Chinatown_Death_Cloud_Peril"
}