{
  "title": "The Scare",
  "description": "Librarian's Note: this is an alternate cover edition - ISBN 10: 0981599303Stranger Things meets A Nightmare on Elm Street in this vividly terrifying teen-horror thriller.Is a dead bully killing from beyond the grave? Ethan, Shay and their friends must solve the mystery to stay alive.Set in the stormy coastal town of Emerald Bay, The Scare is a contemporary Gothic horror story in which love and friendship triumph over bitter jealousy and brutal lust. It is not for the squeamish: there are nasty bits and mean bits; love, laughter and tears; good friends and deadly enemies. There is blood and there are screams... and a fight to the death.Haunted by the murder of his little brother, sixteen-year-old Ethan Harris finds a kindred spirit when Shay Cassidy moves to Emerald Bay. Like Ethan, Shay is the product of a guilt-ridden, broken past, and Ethan is drawn to her.But town bully, Viktor Sols, harbors his own dark desire for Shay, and will stop at nothing to get her. When Sols is killed during his latest rampage, a series of grisly murders begins, and Ethan is convinced that Sols is coming after Shay from beyond the grave. His friends agree to help investigate, but mystery and death follow their every step.After Shay vanishes, Ethan refuses to accept that she’s dead, believing instead that Sols has taken her. He and his friends must launch an attack on the dreaded Sols House to try and rescue Shay.Can they save her before it’s too late, or will the horrifying secret of the Sols family kill them all?If you like Buffy the Vampire Slayer, I Know What You Did Last Summer, Stranger Things, and A Nightmare on Elm Street, you’ll love The Scare.“…well-defined characters with witty, sarcastic speeches and interactions that at times reminds me of the best of Joss Whedon…” see full review here: https://goo.gl/98XI1p",
  "genres": [
    "Horror",
    "Young Adult",
    "Paranormal",
    "Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "Robert   Shaw",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/11463118-the-scare"
}