{
  "title": "I'll Storm Hell",
  "description": "While tensions grow between the British Crown and its American colonies, precocious tearaway ‘Mad’ Anthony Wayne studies the victories of Hannibal, Caesar and the Duke of Marlborough, in the hope one day leading an army of his own. Then in 1774, inspired by the call-to-arms of Benjamin Franklin and George Washington, he raises a battalion of militiamen; a rag-tag bunch of farmers, but tough Pennsylvanian Patriots nonetheless. By 1775 the colonies have declared themselves the United States of America, and Anthony Wayne is marching his men to expel the Redcoats and protect a new country’s independence. Following unprecedented success in the field, he swiftly earns the respect of revolutionary leaders and British generals alike. But as war drags on, the challenges facing the Americans evolve. The British army is the best trained in the world. Devastating bayonet raids are taking their toll on an exhausted, malnourished and under-equipped militia. Congress vacillates on a course of action, while the morale of Anthony’s men wanes by the day. Washington knows the capture of Stony Point, a formidable British redoubt, could be the turning point of the war. Despite the odds, Anthony Wayne believes he can storm it. Indeed, for independence, he’ll storm hell. In this inimitable blend of fact and fiction Noel Gerson brings to life not a mad man, but an unjustly overlooked founding father and American hero. ‘Like Wayne, the story has virtually everything — adventure, color, romance’ – Kirkus Review. Noel Bertram Gerson (1913-1988) was a prolific American author, who wrote 325 books under his own name and under several pseudonyms. He channeled his own wartime experience in military intelligence into many of his novels, as well as writing widely about American history. His titles include ‘Liner’, ‘The Conqueror’s Wife’, ‘The Great Rogue: A Biography of Captain John Smith’ and ‘Daughter of Earth and Water: A Biography of Mary Shelley’. Endeavour Press is the UK's leading independent publisher of digital books.",
  "genres": [
    "American Revolutionary War",
    "History"
  ],
  "author": "Noel B. Gerson",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/2395514.I_ll_Storm_Hell"
}