{
  "title": "Permaculture - Guérir la terre, nourrir les hommes",
  "description": "En 2004, Perrine et Charles Hervé-Gruyer créent la Ferme du Bec Hellouin, en Haute-Normandie. Cette ferme fait aujourd’hui référence en matière d’agriculture naturelle et attire des visiteurs du monde entier.Ce récit est celui d’une famille qui réussit à créer, en quelques années seulement, une oasis de vie généreuse sur des terres peu fertiles. C’est également une vaste enquête menée autour du monde, à la rencontre de pionniers de l’agriculture qui explorent des voies novatrices et inventent le monde de demain.La démarche de Perrine et Charles Hervé-Gruyer repose sur la permaculture. Son principe est de prendre la nature comme modèle et de concevoir des installations humaines fonctionnant comme des écosystèmes productifs et économes en ressources.Les résultats obtenus à la ferme du Bec Hellouin, grâce à l’énergie du soleil, stupéfient aujourd’hui les agronomes : en travaillant entièrement à la main, Charles et Perrine produisent des récoltes abondantes et de qualité sur une toute petite surface, tout en créant de l’humus, en aggradant la biodiversité, en embellissant les paysages, en stockant du carbone dans les sols et les arbres. Une étude agronomique menée en partenariat avec d’éminents chercheurs démontre la pertinence sociale, économique et écologique d’une agriculture permaculturelle qui dessine une nouvelle manière d’être paysans au XXIe siècle, source potentielle de millions d’emplois.Perrine Hervé-Gruyer a mené une carrière de juriste en Asie avant de se consacrer à la psychothérapie. Éducateur de formation, Charles Hervé-Gruyer a sillonné le globe à bord du voilier-école Fleur de Lampaul pendant vingt-deux ans. Il est l’auteur de nombreux documentaires et livres sur la nature. Tous deux sont ensuite devenus paysans et formateurs en permaculture.",
  "genres": [
    "Gardening",
    "Nonfiction",
    "Agriculture",
    "Sustainability",
    "Health",
    "France",
    "Food"
  ],
  "author": "Charles Hervé-Gruyer",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/23953876-permaculture---gu-rir-la-terre-nourrir-les-hommes"
}