{
  "title": "Beskrajna priča",
  "description": "Beskrajna priča, knjiga koja je postigla senzacionalan uspeh širom sveta spada među najneobičnija dela napisana u žanru fantastike. Prvobitno objavljena u Nemačkoj kao knjiga za decu, brzo je stekla popularnost i kod odraslih i kod dece kao neodoljiva tvorevina imaginacije.Moć ljudske imaginacije zapravo je jedna od najznačajnijih tema ovog romana, moć koje glavni junak Bastijan postepeno postaje svestan. Na stranicama jedne stare knjige, Bastijan, debeljuškasti dečačić od svojih deset ili jedanaest godina otkriva tajanstveni svet čarolije – Zemlju Fantaziju, ali taj svet lagano propada. Samo bi ljudsko biće moglo da ponovo uspostavi red, i taj veliki zadatak biva dodeljen upravo Bastijanu.Beskrajna priča može se čitati jednostavno kao uzbudljiva fantastična priča, čiji svet sačinjavaju noćni vilenjaci i lutajući plamenovi, Močvare Tuge i Srebrne planine, Crni kentaur i Kula od slonovače. Ali pored toga, taj svet nudi nenadmašno upečatljivu viziju moći ljudske imaginacije – moći koju svaki čitalac treba da podeli sa Bastijanom dok putuje njegovom začaranom zemljom.Ovenčana ogromnim međunarodnim uspehom, Beskrajna priča je knjiga koja prelazi granice, kako one između različitih kultura, tako i žanrovske granice između knjiga za decu i knjiga za odrasle.Od objavljivanja, 1979. godine, do danas prevedena je na više od trideset jezika, a samo u Japanu je prodata u više miliona primeraka. Snimljene su tri filmske verzije i jedna televizijska serija. Postoje kompjuterske igrice nastale prema motivima Beskrajne priče, pa čak i klubovi ljubitelja Zemlje Fantazije. Beskrajna priča pripada lepoj tradiciji romana kakvi su Brežuljak Voteršip ili Gospodar prstenova, koji i deci i odraslima mogu pružiti neizmerno zadovoljstvo.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Young Adult",
    "Childrens",
    "Adventure",
    "Classics",
    "German Literature"
  ],
  "author": "Michael Ende",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/23950016-beskrajna-pri-a"
}