{
  "title": "The World's Columbian Exposition: The Chicago World's Fair of 1893",
  "description": "This exceptional chronicle takes readers on a visual tour of the glittering \"white city\" that emerged along the swampy south shore of Lake Michigan as a symbol of Chicago's rebirth and pride twenty-two years after the Great Fire.The World's Columbian Exposition, which commemorated the 400th anniversary of Columbus's voyage to America, was held from April to October in 1893. The monumental event welcomed twenty-eight million visitors, covered six hundred acres of land, boasted dozens of architectural wonders, and was home to some sixty-five thousand exhibits from all over the world. From far and wide, people came to experience the splendors of the fair, to witness the magic sparkle of electric lights or ride the world's first Ferris wheel, known as the Eiffel Tower of Chicago. Norman Bolotin and Christine Laing have assembled a dazzling photographic history of the fair. Here are panoramic views of the concourse--replete with waterways and gondolas, the amazing moving sidewalk, masterful landscaping and horticultural splendors–-and reproductions of ads, flyers, souvenirs, and keepsakes. Here too are the grand structures erected solely for the fair, from the golden doorway of the Transportation Building to the aquariums and ponds of the Fisheries Building, as well as details such as menu prices, the cost to rent a Kodak camera, and injury and arrest reports from the Columbian Guard. This unique volume tells the story of the World's Columbian Exposition from its conception and construction to the scientific, architectural, and cultural legacies it left behind, inviting readers to imagine what it would have been like to spend a week at the fair.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Architecture",
    "Historical"
  ],
  "author": "Norman Bolotin",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/239648.The_World_s_Columbian_Exposition"
}