{
  "title": "Double Header: My Life with Two Penises",
  "description": "He was featured on the front pages of RollingStone.com, Jezebel.com and was covered by The Huffington Post. Both Conan O'Brien and Jay Leno featured him in their opening monologues. Countless news agencies around the world broke the story when he went on Reddit and did an Ask Me Anything (AMA). Ranking as the 4th most popular Reddit AMA of all time (beating out the likes of Peter Dinklage, Bill Murray, Arnold Schwarzenegger and Harrison Ford), DoubleDickDude spent 48 hours discussing his life with a genetic condition known as diphallia. Only 1 in 5.5 million males worldwide are born with two penises. However very few (if any) are born with two working, and by all accounts, attractive penises. After having managed to stay under the radar for over 20 years DoubleDickDude (or DDD for short) amassed thousands of followers on Twitter and Tumblr in a matter of hours. In fact Twitter (temporarily) suspended his account for replying to his followers too many times! For the past year he has taken to writing a more lengthy and detailed account of his life so far. Very little could be detailed during a frenzy of questions from thousands on Reddit. DDD goes from discussing his childhood, and explains how he knew he was special at an early age. His parents support grounded him in his early youth. We find out how he lost his virginity and was exposed to his peers. From there he discusses his wild streak of sexual adventures fresh out of high school. Recapping his favorite questions and answers, discussing sexuality and acceptance DDD covers the gamut. Don't worry, all the saucy and steamy stories he hinted at in his AMA are covered and then some. Like that 7-way orgy he briefly detailed amid the torrent of questions during his AMA. Not to mention the hunky straight gym jock who \"went gay\" and the poor girl who... shall we say, her lady place was a wreck after one time with DDD. It's all in there and more! Written from first person perspective the narrative is raw, honest and often times gritty. Details are not spared and readers beware, naughty moments are revealed! The next time you see a man on the street with more than an adequate bulge in his jeans, it might just be DDD.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Sexuality",
    "Biography",
    "Autobiography",
    "LGBT",
    "M M Romance"
  ],
  "author": "Diphallic Dude",
  "average_rating": "3.02",
  "url": "https://www.goodreads.com/book/show/23966541-double-header"
}