{
  "title": "Ghost Soldiers",
  "description": "Ghost Soldiers is the second novel in the epic new ‘Mercenaries’ series that chronicles the violent struggles of the sprawling Centauri Alliance.The newly formed Interstellar Assault Brigade has been tested in secret, but their first official combat action will send a shockwave through the Alliance. A group of mercenaries and criminals have occupied part of Old Spascia City , the scene of some of the heaviest fighting in the Biomech War. They have heavily fortified the entire area, and beaten off numerous attempts by local forces to defeat them. With public attention focused on this impregnable fortress, the IAB arrives and assaults the position in broad daylight. Advanced dropships swoop in to release squads of robotic warriors known as 'Grunts'. As they engage the defenders, smaller numbers of large 'Maverick' bipedal combat suits blast fortifications apart with high-power plasma weaponry. It is a stunning debut that puts the brigade on the lips of every citizen.On the opposite side of Alliance space is a deadly new threat, a massive spacecraft that is heading directly for the colonies of T'Karan. A heavily armed destroyer is diverted to intercept, and apparently lost with all hands in a matter of minutes. There is only one unit capable of performing a rescue operation in the limited time remaining. With just hours to spare, Spartan assembles the newly christened IAB for their deadliest mission yet. A journey across the stars to face this ancient vessel that dwarfs even a fully assembled warfleet. Waiting deep inside this vast derelict lies an alien intelligence, one that can be traced back to a civilisation long forgotten. What starts as a rescue operation quickly turns into a bloodbath, where every members of the unit is hunted by this new terrible enemy, that seeks no less than their utter annihilation.Ghost Soldiers is a futuristic military sci-fi adventure that continues to expand the vast universe of the Star Crusades series that includes Star Uprising and Star Nexus. Essential and unmissable reading for enthusiasts of the Military sci-fi genre.",
  "genres": [
    "Science Fiction",
    "Military Science Fiction",
    "Adventure"
  ],
  "author": "Michael G. Thomas",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/23965925-ghost-soldiers"
}