{
  "title": "Redemption",
  "description": "How could anyone move on from a betrayal so devastating, it cut down to the bone and rooted itself deep within? You could never forgive such heartache… Or could you?From the moment Tyler was six, she fell in love with that cocky eight-year-old boy with the black spiky hair, captivating blues eyes, and scruffy uniform. From the moment he punched a boy for hurting her, Tyler knew there was no going back. They were always meant to be together...Always.Then everything changed. The stage was set like a tragic Shakespearean play, and Tyler’s and Dean’s world—as they knew it—had ended.Or had it?TylerMy name was Jessica now. I faked my own death, changed my identity, and moved thousands of miles across the ocean just to escape the one man I would never get out of my heart. I had a four-year-old son I adored more than anything in the world. On one fateful, horrific night, the life I knew disappeared in the blink of an eye. I left people behind. People I cared about. People I would never forget. People I loved.But had I truly moved on?No one said leaving behind the one man you had loved since you were six would be easy. I lived life day-to-day. I even met a man and tried to settle down. Evan was a man any woman would desire. So why could I not love him the way he obviously loved me? Why couldn’t I move past the dark-haired, blue-eyed boy who consumed my every thought? I may have left him, but he had never truly left me.I could never love another man. Dean made sure of that the day he breezed into my life. I was only half a woman now. I had been broken and bruised by the one man I thought I could always love and trust. How could I let go of something like that? I suppose I just had to. I was just getting by with each day that passed. I was coping. I was managing, and that was keeping me from falling apart.But then disaster struck again. And it was on that day…Everything changed.DeanYou can’t hide forever, Tyler. I will always be hunting you, always be searching, and will never give up. If there was ever one certainty in your life, it was that. You slipped through my fingers, not once but twice. You took my heart with you when you left me that day. No amount of alcohol, women, or punching bags would block you from my mind. You couldn’t be dead. I wouldn’t allow you to be dead. You’re out there somewhere. I must congratulate you that you had evaded me for this long. You always were a smart girl. How could I not have fallen in love with you? You did escape me this time, but I will find you, Tyler. I promise you that. And when that day comes…I will finally make you MINE.",
  "genres": [
    "Romance",
    "Dark",
    "Dark Romance",
    "Contemporary Romance",
    "Contemporary",
    "Erotica",
    "Second Chance"
  ],
  "author": "Jaimie Roberts",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/23971156-redemption"
}