{
  "title": "Blood Hunger",
  "description": "An alternate cover edition can be found here.It’s been seven years since Nikulas’ brother walked out the door of his Seattle apartment and never came back. All he knew was that the he was on his way to meet with the leader of a neighboring vampire colony who’d been causing trouble, and neither of them have been seen since. Now, with the first lead he's had in years, Nikulas discovers that a witch went missing around the same time. Coincidence? No way. And even better, she has a sister. And that sister is hot. Nikulas knows as soon as he sets eyes on Emma's strawberry-blonde head that he should stay away from her...the moment he tastes her blood, he knows he won’t be able to. Because Emma is HIS.Seven years after Emma witnessed her sister’s kidnapping, there’s still no sign of what happened to her. She, herself, spent three months in the hospital after the “bear” attack, and still has the scars to prove it. Now, as day after day passes with no news of her sister, she has to fight against the loss of hope…until she gets a phone call from a seductive stranger who claims to have new information. He seems harmless with his teasing manner and Hollywood pretty-boy looks, but she can sense a predatory air of danger about him. Instead of warning her away, however, she finds herself irresistibly drawn to him, and agrees to go with him on a rescue mission to find their missing siblings.Although Nikulas aches to keep Emma with him always, a ghost from the past won’t let him. And he soon finds out that she her own demons to fight. Determined to resist the Blood Hunger, Nikulas decides that she deserves more than spending her life with a vampire, even if it means losing his own in the process. However, Emma is just as determined to prove to him that they can fight their ghosts…together.",
  "genres": [
    "Paranormal",
    "Vampires",
    "Romance",
    "Paranormal Romance",
    "Fantasy",
    "Witches",
    "Urban Fantasy"
  ],
  "author": "L.E. Wilson",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/23985848-blood-hunger"
}