{
  "title": "Payback and a Bottle of Merlot",
  "description": "Mia James almost has it all…At thirty, she is a successful photographer with the craziest but most loyal friends in the world and a wonderful life in a picturesque village. The only things missing are a husband and a brood of kids. Love happens when you least expect it, her mom always says.An appointment to show her photography portfolio brings her front and center with Jack Barnes, a gorgeous, successful Manhattan businessman. Mia is smitten, and they marry less than a year later. Unfortunately, the marital bliss she craves never shows up.Jack, the controlling absentee husband, has a someone else is occupying his mind and bed. Mia has no idea until a chance sighting reveals the real Jack with his mystery woman.Payback is definitely in order and way overdue. With a little help from her friends—and a lot of Merlot—Mia is on a mission to take Jack down.Hilarious speed bumps, hiccups, and crazy calamities along the way could turn Mia’s ridiculous plot for payback into a chance for unexpected friendships, and real love.Payback and a Bottle of Merlot, Book One, in the Like Sisters series, is a romantic comedy novel that will appeal to fans of chick lit, women's fiction and humorous books. Like Sisters is a laugh out loud series of best friends, hot guys and the right amount of steam to have you anxiously waiting for the next book.There are no cliffhangers in this series, but since the characters carry over, the books are best read in sequence.Like Sisters Romantic Comedy Series#1 Payback and a Bottle of Merlot#2 Insecurity and a Bottle of Merlot#3 Destiny and a Bottle of Merlot#4 Intrigue and a Bottle of Merlot#5 Desire and a Bottle of Merlot",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary",
    "Fiction",
    "Humor",
    "Amazon",
    "Contemporary Romance"
  ],
  "author": "Bria Marche",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/23980212-payback-and-a-bottle-of-merlot"
}