{
  "title": "Upending Tad, Bundle 1",
  "description": "Volumes One, Two, and Three of the Upending Tad Loser Takes All ad’s weekend started out like any other; hitting a college frat party with a handful of buddies. But just as the evening hits its peak, things get up-ended fast. Ditched by his drunken, trolling friends, Tad winds up getting hustled by three jocks playing poker. Now he’s forced to pay his dues in the most outlandish of ways; accepting a couple broken bones or spending an hour with his victors’ favorite flogger, Scott. But the guy’s tantalizing torture quickly proves to be the least of Tad’s worries… and the kickoff to a night of raw, shocking lust. Experience the graphic, minute-by-minute account of that hour spent at the hands of Tad’s insatiable tormentor. Addicting chemistry lights the stage as Scott ignites Tad’s reluctant desires into a frenzy of forbidden need. Test of Endurance The last time Tad saw Scott, the ripped physical trainer left him with quite a lot to think about. And that's pretty much all Tad's been doing for nearly two weeks straight. At his wit's end, he seeks Scott out, voluntarily, on his own terms. Will the completely different setting offer what he's seeking; proof that their exchange's unexpected turn was just a random mishap? Hormones run amok and truly nothing more? Or will being in Scott's presence suggest something different... their newest encounter tempting Tad's resolve while testing his ultimate limits. Sideline Submission Round two with Scott hadn't been what Tad expected, but it did end up providing a few important realizations. For one, that crazy first encounter was definitely more than mere male hormones. Which meant he felt a true attraction to the guy. Something that explained his defenselessness against Scott's smoldering charms. Seriously, the dude had cut through his fortifications like the things hadn't even existed. Which, yeah, was pretty unsettling. So Tad had resolved to cope with his findings the only logical way he knew purge the guy from his system once and for all by staying away for good. Unfortunately, that proved way more uncomfortable than he'd anticipated. Seemed his \"stupid infatuation\" ran considerably deeper, which made going cold-turkey one miserable chore. So when Scott unexpectedly seeks him out, Tad's too drained to fight his turmoil any longer. Allowing himself a much needed fix, he agrees to hang out, neither he nor Scott knowing Dom boy Max will end up part of the deal. What starts out as an unassuming evening quickly turns shockingly licentious. Question is, will Tad be able to handle it? And more importantly, what path will it send him down in his ongoing journey of discovery? Erotic romance. Contains gloriously explicit gay sex. Intended for mature audiences only.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Romance",
    "Erotica",
    "Contemporary",
    "Audiobook",
    "Gay For You"
  ],
  "author": "Kora Knight",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/23984516-upending-tad-bundle-1"
}