{
  "title": "British Flash: A revealing collection of short LGBT fiction",
  "description": "Enjoy this entertaining collection of flash fiction stories, and their short and sweet expression of what it means to be queer in Britain, past and present. All these stories reflect the iconic sights and national character of the British Isles: a taste of our idiosyncrasies and eccentricities, but also an unashamed representation of the love, loyalty and laughter of our people. Follow the British way of life from historic villages to modern cities, from the countryside to the sea, through history and with a fantasy twist, in gardens, shops, campus and the familiar, much-loved local pub. The stories cover universal themes of romance, desire, remembrance and reconciliation. The authors range from multi-published to up-and-coming, and they all share a passion for their characters, whether through great drama, erotic excitement, humour—or a combination of all three! Contents: The worst pub in London / JL Merrow — Our place / Clare London — We’ll always have Brighton / Zahra Owens — Commission and omission / Charlie Cochrane — Paint / Stevie Carroll — Ben’s new colleague / Serena Yates — Giving it up / Josephine Myles — Thoughts in spring / Mara Ismine — Mouth Almighty / Victoria Blisse — Reunion / Lisa Worrall — While the boys are away / Lucy Felthouse — Nessie / Caroline Stephens — Slap and Motley / Sandra Lindsey — Like a girl / JL Merrow — Last client / Jay Rookwood — Sunshine Superman / Elin Gregory — Escape to the country / Stevie Woods — Prince Charming’s Buttons / Stevie Carroll — Yesterday upon the stairs / Erastes — Benefits of peace / Alex Beecroft — They who come after the stories end / Sophia Deri-Bowen A revealing collection of short LGBT fiction, available free of charge from Smashwords; edited by: Josephine Myles, Alex Beecroft, Charlie Cochrane, Clare London and JL Merrow. This anthology is a souvenir of the 2011 UK Meet, an occasion for GLBTQ supporters to get together in a relaxed setting to celebrate and chat about the fiction community they love.",
  "genres": [
    "Anthologies",
    "M M Romance",
    "Romance",
    "Short Stories",
    "LGBT",
    "Fiction",
    "Gay"
  ],
  "author": "Josephine Myles",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/11464932-british-flash"
}