{
  "title": "الدولة المستحيلة: الإسلام والسياسة ومأزق الحداثة الأخلاقي",
  "description": "صدرت عن المركز العربي للأبحاث ودراسة السياسات ضمن سلسلة \"ترجمان\" الترجمة العربية لكتاب الدولة المستحيلة: الإسلام والسياسة ومأزق الحداثة الأخلاقي (352 صفحة، من القطع الكبير)، لأستاذ الدراسات الإسلامية وائل حلاق، وترجمة عمرو عثمان. تتمثّل أطروحة الكتاب الرئيسة في أنّ مفهوم \"الدولة الإسلامية\" مستحيل التحقّق وينطوي على تناقض داخلي؛ وذلك بحسب أيّ تعريف سائد لما تمثّله \"الدولة الحديثة\".وردَ الكتاب في سبعة فصول؛ يتناول الفصل الأوّل \"مقدمات\" وصف \"الحكم الإسلامي النموذجي\"، ويرسم حدود مفهوم \"النموذج\" كما سيجري استخدامه بوصفه مفهومًا مركزيًّا في أطروحة الكتاب الكلّية. ويصف الفصل الثاني الدولة الحديثة، \"الدولة الحديثة النموذجية\"، ويحدّد \"خصائص الشكل\" التي تمثّل الصفات الجوهرية للدولة الحديثة. ويقوم بتفكيك تلك الخصائص، معترفًا في الوقت عينه بالتغيرات المتزامنة والتنوّعات المتلاحقة في تكوين تلك الدولة.أمّا الفصل الثالث \"الفصل بين السلطات: حكم القانون أم حكم الدولة\"، فيناقش مفاهيم الإرادة السيادية وحكم القانون في ما يخصّ مبدأ الفصل بين السلطات؛ هادفًا من وراء هذه المناقشة إلى استعراض الأطر والبنى الدستورية لكلٍّ من الدولة الحديثة والحكم الإسلامي، وتسليط الضوء على الاختلافات الدستورية بين نظامَي الحكم هذين. واعتمادًا على هذه الاختلافات، يستكشف الفصل الرابع \"القانوني والسياسي والأخلاقي\"، معنى القانون وعلاقته بالأخلاق. ويؤكّد هذا العرض الفلسفي أساسًا الاختلافات النوعية بين المفهوم الأخلاقي للدولة الحديثة والحكم الإسلامي. وسيتحوّل هذا العرض في الجزء الثاني من الفصل الرابع إلى عرضٍ ذي طابع سياسي. وستتعزّز هذه التباينات القانونية - الأخلاقية بفعل التباينات السياسية كاشفةً عن مجالٍ آخر من عدم التوافق بين الدولة الحديثة والشريعة.ويرى الفصل الخامس \"الذات السياسية والتقنيات الأخلاقية لدى الذات\" أنّ الدولة القومية الحديثة والحكم الإسلامي يميلان إلى إنتاج مجالين مختلفين من تكوين الذاتية، وأنّ الذوات التي ينتجها هذان المجالان النموذجيان تتباين تباينًا كبيرًا، الأمر الذي يولّد نوعين مختلفين من التصورات الأخلاقية والسياسية والمعرفية والنفسية والاجتماعية للعالم. وتلك الاختلافات العميقة بين أفراد الدولة القومية الحديثة ونظرائهم في الحكم الإسلامي إنّما تمثّل التجليات المجهرية المصغّرة للاختلافات الكونية المادية والبنيوية والدستورية، وكذلك الفلسفية والفكرية.ويحاجج الفصل السادس \"عولمة تضرب حصارها واقتصاد أخلاقي\" في أنّ الأشكال الحديثة للعولمة ووضع الدولة في هذه الأشكال المتعاظمة القوّة، يكفيان لجعل أيّ صورة من الحكم الإسلامي إمّا أمرًا مستحيل التحقّق، وإمّا غير قابل للاستمرار على المدى البعيد هذا إذا أمكن قيامه أصلًا. وبعبارة أخرى، يصل المؤلف إلى نتيجة مفادها: إذا جرى أخذ كلّ العوامل في الحسبان، فإنّ الحكم الإسلامي لا يستطيع الاستمرار نظرًا للظروف السائدة في العالم الحديث.ويختم الكاتب بالفصل السابع \"النطاق المركزي للأخلاقي\"، متفحّصًا مآزق أخلاقية حديثة مع الإشارة إلى أسسها المعرفية والبنيوية بصفتها تؤسّس لأصل الأزمات الأخلاقية التي واجهتها الحداثة في كلّ صورها الشرقية والغربية. ويرى المؤلف أنّ استحالة فكرة الحكم الإسلامي ناتجة بصورة مباشرة من غياب بيئة أخلاقية مواتية تستطيع أن تلبّي أدنى معايير ذلك الحكم وتوقعاته، ويرى أنّ هذه الاستحالة هي تجلٍّ آخر لعدة مشاكل أخرى ليس أقلّها شأنًا الانهيار المطّرد للوحدات الاجتماعية العضوية ونشأة أنماط اقتصادية استبدادية، إضافةً إلى ما هو أكثر أهمية من ذلك، وهو الدمار الشامل للموائل الطبيعية والبيئة. لا يهدف هذا الكتاب كما يصرّح مؤلفه إلى إصابة القارئ المسلم والعربي بالإحباط واليأس من عدم قدرته على الفكاك من ورطة الحداثة التي وجد نفسه فيها بلا اختيار منه، ومن استحالة قيام دولة إسلامية تحافظ على خصوصيته الأخلاقية والتاريخية، وإنّما غايته هي توفير سبيل للمسلمين إلى الحياة الحسنة المستندة إلى موارد تاريخ الإسلام الأخلاقية، وهو يثبت في هذا السياق، أنّ أزمات الإسلام السياسية وغيرها ليست بالفريدة أو الخاصة، بل هي جزء لا يتجزّأ من العالم الحديث، في الغرب كما في الشرق.",
  "genres": [
    "Politics",
    "Islam",
    "Religion",
    "Philosophy",
    "Nonfiction",
    "Political Science",
    "History"
  ],
  "author": "Wael B. Hallaq",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/23991573"
}