{
  "title": "Switched On: A Memoir of Brain Change and Emotional Awakening",
  "description": "An extraordinary memoir about the cutting-edge brain therapy that dramatically changed the life and mind of John Elder Robison, the New York Times bestselling author of Look Me in the EyeImagine spending the first forty years of your life in darkness, blind to the emotions and social signals of other people. Then imagine that someone suddenly switches the lights on.It has long been assumed that people living with autism are born with the diminished ability to read the emotions of others, even as they feel emotion deeply. But what if we’ve been wrong all this time? What if that “missing” emotional insight was there all along, locked away and inaccessible in the mind?   In 2007 John Elder Robison wrote the international bestseller Look Me in the Eye, a memoir about growing up with Asperger’s syndrome. Amid the blaze of publicity that followed, he received a unique invitation: Would John like to take part in a study led by one of the world’s foremost neuroscientists, who would use an experimental new brain therapy known as TMS, or transcranial magnetic stimulation, in an effort to understand and then address the issues at the heart of autism? Switched On is the extraordinary story of what happened next.   Having spent forty years as a social outcast, misreading others’ emotions or missing them completely, John is suddenly able to sense a powerful range of feelings in other people. However, this newfound insight brings unforeseen problems and serious questions. As the emotional ground shifts beneath his feet, John struggles with the very real possibility that choosing to diminish his disability might also mean sacrificing his unique gifts and even some of his closest relationships. Switched On is a real-life Flowers for Algernon, a fascinating and intimate window into what it means to be neurologically different, and what happens when the world as you know it is upended overnight.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Autistic Spectrum Disorder",
    "Science",
    "Psychology",
    "Biography",
    "Neuroscience"
  ],
  "author": "John Elder Robison",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/23995406-switched-on"
}