{
  "title": "Finale: A Novel of the Reagan Years",
  "description": "Adding to a fiction chronicle that has already spanned American history from the Lincoln assassination to the Watergate scandal, Thomas Mallon now brings to life the tumultuous administration of the most consequential and enigmatic president in modern times. Finale captures the crusading ideologies, blunders, and glamour of the still-hotly-debated Reagan years, taking readers to the political gridiron of Washington, the wealthiest enclaves of Southern California, and the volcanic landscape of Iceland, where the president engages in two almost apocalyptic days of negotiation with Mikhail Gorbachev.   Along with Soviet dissidents, illegal-arms traders, and antinuclear activists, the novel’s memorable characters include Margaret Thatcher, Jimmy Carter, Pamela Harriman, John W. Hinckley, Jr. (Reagan’s would-be assassin), and even Bette Davis, with whom the president had long ago appeared onscreen. Several figures—including a humbled, crafty Richard Nixon; the young, brilliantly acerbic Christopher Hitchens; and an anxious, astrology-dependent Nancy Reagan (on the verge of a terrible realization)—become the eyes through which readers see the last convulsions of the Cold War, the beginning of the AIDS epidemic, and a political revolution.   At the center of it all—but forever out of reach—is Ronald Reagan himself, whose genial remoteness confounds his subordinates, his children, and the citizens who elected him. Finale is the book that Thomas Mallon’s work has been building toward for years.  It is the most entertaining and panoramic novel about American politics since Advise and Consent, more than a half century ago.A New York Times Notable Book  One of the Best Books of the Year: The Washington Post, San Francisco Chronicle, The Daily Beast, The Miami Herald, St. Louis Post-Dispatch",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Politics",
    "Presidents",
    "Novels",
    "American History",
    "Literary Fiction"
  ],
  "author": "Thomas Mallon",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/23995211-finale"
}