{
  "title": "A Queer World: The Center for Lesbian and Gay Studies Reader",
  "description": "An anthology of the Center for Lesbian and Gay Studies's most provactive LGBT scholarshipThis compendious, cutting-edge volume offers a broad array of the most provocative gay, lesbian, bisexual, and transgender scholarship produced by the Center for Lesbian and Gay Studies (CLAGS) over the first decade (1986-1996) of its existence at the CUNY Graduate School.CLAGS has had a profound and legitimizing influence on the establishment of gay and lesbian studies as a discipline. Thousands have attended its events, featuring hundreds of scholars, activists, and cultural workers; many thousands more have lamented how they would have liked to have been there. With this book, they finally, vicariously, can be.Divided into five parts―on identities as they revolve around gender and sexuality; on the terrains of homosexual history; on mind-body relations; on laws and economics; and on policy issues related to gay youth, AIDS, and aging― A Queer World offers a compelling panorama of gay and lesbian life. Featuring the work, among others, of such figures as Yukiko Hanawa, Will Roscoe, Jewelle L. Gomez, Jonathan Ned Katz, Elizabeth Lapovsky Kennedy, Jeffrey Escoffier, Janice M. Irvine, Kendall Thomas, Gilbert Herdt, Vivien Ng, Douglas Crimp, Walt Odets, Serena Nanda, Cindy Patton, Michael Moon, William Byne, and Randolph Trumback, A Queer World is distinctive in its focus on the social sciences and issues relating to public policy. Consisting largely of previously unpublished essays, this volume―and its companion volume Queer Reading Lives, Reading Cultures ―is an invaluable addition to the bookshelf of anyone interested in the study of sexuality.",
  "genres": [
    "LGBT",
    "Queer",
    "Nonfiction",
    "Politics",
    "Sociology",
    "Anthologies",
    "Feminism"
  ],
  "author": "Martin Duberman",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/239930.A_Queer_World"
}