{
  "title": "Bitter Sweet Deception",
  "description": "The question on everyone's mind is.... Who is Charlie? And what is she hiding? Planting herself deep within the club's inner circle, Charlie came to Chisolm with one goal in mind... to destroy the Kingsmen, M.C., no matter the personal cost. An unknown hatred fuels her mission to take them down. Pairing herself up with one of the club's bad boy's, the M.C.'s enforcer, Clink, seemed like just the ticket to get her in the door. Once inside the club she had been eyeing from afar, she comes to realizes things are very different from what she had imagined them to be. Villainizing the group as a whole for an injustice that was done to her many years earlier no longer seemed to fit with growing attachments and relationships she was forming. And then there's Clink. He may very well be the wild card thrown into the mix that derailed Charlie's plans from the get go. Originally, serving as nothing but a way in to the club, and a body to warm her sheets at night, Clink has thrown Charlie for a loop. Determined from an early age to never need a man, Charlie can't help but find herself drawn to him in a carnal and ethereal way. She's tried to fight it, to deny it, but it was in vain. He calls her sugar... but, she's anything but sweet. A chance twist of luck placed Charlie right in the middle of club politics, where she was able to help free the club's Vice President, Jay, from serving time for murder he did not commit, but willingly confessed to in Book 2. Her risk earned her the hard earned respect and admiration that is hard to come by in the world of the M.C. Now that she finally has a place of her own in life, a place where she belongs and is wanted... is she willing to give it up? Give Him up? Willing to let it all slip through her fingers? Warning: This novella is intended for those 18+ of age and contains strong language, sexual content, and adult situations. The Kingsmen MC's saga continues in this newest installment of Tara Oakes' tantalizing new series. In the first three novella's you've come to know and love the characters within the club. Jay and Lil's have had their epic love story play out over the pages of A Lil' Less Broken, followed by A Lil' Less Lost and finally, A Lil' Less Hopeless. While their fairytale is far from over, the next arc in the series concentrates on some of the other intriguing characters that have been woven throughout Jay and Lil's storyline.",
  "genres": [
    "Contemporary"
  ],
  "author": "Tara Oakes",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/23992061-bitter-sweet-deception"
}