{
  "title": "The Only Woman in the Room: Why Science Is Still a Boys' Club",
  "description": "A bracingly honest exploration of why there are still so few women in the hard sciences, mathematics, engineering, and computer scienceIn 2005, when Lawrence Summers, then president of Harvard, asked why so few women achieve tenured positions in the hard sciences, Eileen Pollack set out to find the answer. In the 1970s, Pollack had excelled as one of Yale’s first two women to earn a bachelor of science degree in physics. But, isolated, lacking in confidence, and starved for encouragement, she abandoned her lifelong dream of becoming a theoretical physicist. Years later, she thought back on her experiences and wondered what had changed in the intervening decades, and what challenges remained. Based on six years of interviewing dozens of teachers and students and reviewing studies on gender bias, The Only Woman in the Room is an illuminating exploration of the cultural, social, psychological, and institutional barriers confronting women in the STEM disciplines. Pollack brings to light the struggles that women in the sciences are often hesitant to admit and provides hope that changing attitudes and behaviors can bring more women into fields in which they remain, to this day, seriously underrepresented.Eileen Pollack is the author of the novels Breaking and Entering (a New York Times Editor’s Choice selection) and Paradise, New York, as well as two collections of short fiction, an award-winning book of nonfiction, and two creative-nonfiction textbooks. Her work has appeared in Best American Essays and Best American Short Stories. She is a professor on the faculty of the Helen Zell MFA Program in Creative Writing at the University of Michigan. She divides her time between Manhattan and Ann Arbor, Michigan.",
  "genres": [
    "Nonfiction",
    "Science",
    "Feminism",
    "Memoir",
    "Womens",
    "Biography",
    "Education"
  ],
  "author": "Eileen Pollack",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/23995384-the-only-woman-in-the-room"
}