{
  "title": "The Rising: Murder, Heartbreak, and the Power of Human Resilience in an American Town",
  "description": "The astonishing story of one man’s recovery in the face of traumatic loss—and a powerful meditation on the resilience of the soul On July 23, 2007, Dr. William Petit suffered an unimaginable Armed strangers broke into his suburban Connecticut home in the middle of the night, bludgeoned him nearly to death, tortured and killed his wife and two daughters, and set their house on fire. He miraculously survived, and yet living through those horrific hours was only the beginning of his ordeal. Broken and defeated, Bill was forced to confront a question of ultimate How does a person find the strength to start over and live again after confronting the darkest of nightmares? In The Rising , acclaimed journalist Ryan D’Agostino takes us into Bill Petit’s world, using unprecedented access to Bill and his family and friends to craft a startling, inspiring portrait of human strength and endurance. To understand what produces a man capable of surviving the worst, D’Agostino digs deep into Bill’s all-American upbringing, and in the process tells a remarkable story of not just a man’s life, but of a community’s power to shape that life through its embrace of loyalty and self-sacrifice as its most important values. Following Bill through the hardest days—through the desperate times in the aftermath of the attack and the harrowing trials of the two men responsible for it— The Rising offers hope that we can find a way back to ourselves, even when all seems lost. Today, Bill Petit has remarried. He and his wife have a baby boy. The very existence of this new family defies rational expectation, and yet it confirms our persistent, if often unspoken, belief that we are greater than what befalls us, and that if we know where to look for strength in trying times, we will always find it. Bill’s story, told as never before in The Rising , is by turns compelling and uplifting, an affirmation of the inexhaustible power of the human spirit.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Audiobook",
    "Crime",
    "Death",
    "Biography Memoir",
    "Adult"
  ],
  "author": "Ryan D'Agostino",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/23995362-the-rising"
}