{
  "title": "The Unraveling: High Hopes and Missed Opportunities in Iraq",
  "description": "One of the New York Times ' 100 Notable Books of 2015One of Financial Times ' Books of the Year, 2015A New York Times Editors' ChoiceA New Statesman [UK] Essential Book of the Year 2015A Times [UK] Book of the Year 2015Shortlisted for the 2015 Samuel Johnson Prize for NonfictionShortlisted for the 2016 Orwell PrizeWhen Emma Sky volunteered to help rebuild Iraq after the overthrow of Saddam Hussein in 2003, she had little idea what she was getting in to. Her assignment was only supposed to last three months. She went on to serve there longer than any other senior military or diplomatic figure, giving her an unrivaled perspective of the entire conflict.As the representative of the Coalition Provisional Authority in Kirkuk in 2003 and then the political advisor to US General Odierno from 2007-2010, Sky was valued for her knowledge of the region and her outspoken voice. She became a tireless witness to American efforts to transform a country traumatized by decades of war, sanctions, and brutal dictatorship; to insurgencies and civil war; to the planning and implementation of the surge and the subsequent drawdown of US troops; to the corrupt political elites who used sectarianism to mobilize support; and to the takeover of a third of the country by the Islamic State.With sharp detail and tremendous empathy, Sky provides unique insights into the US military as well as the complexities, diversity, and evolution of Iraqi society. The Unraveling is an intimate insider's portrait of how and why the Iraq adventure failed and contains a unique analysis of the course of the war. Highlighting how nothing that happened in Iraq after 2003 was inevitable, Sky exposes the failures of the policies of both Republicans and Democrats, and the lessons that must be learned about the limitations of power.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Military Fiction",
    "War",
    "Biography",
    "Memoir"
  ],
  "author": "Emma Sky",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/24000585-the-unraveling"
}