{
  "title": "Somebody's Gotta Say It",
  "description": "I've come to the conclusion that roughly 50 percent of the adults in this country are simply too ignorant and functionally incompetent to be living in a free society. You might think I'm off base, but every day around half the people in this country go out of their way to prove me right.—from Somebody's Gotta Say It Think you've got it all figured out? Think again. Neal Boortz—the Talkmaster, the High Priest of the Church of the Painful Truth—has been edifying, infuriating, and entertaining talk radio audiences for more than three decades with his blend of straight talk and twisted humor. Now, the author of the smash number one bestseller The FairTax Book returns to gore every sacred cow in the pasture, from the subversive agendas behind children's books to the scam artists behind \"High Art.\" In Somebody's Gotta Say It , Boortz warms up for the coming political season with a preemptive strike in \"the War on the Individual\": \"The Democrats' theme for 2008 will be 'The Common Good.' I can't speak for you, but I am an individual. Government exists to protect my rights, not to order my life. And I damn sure don't exist to serve government.\" He takes on liberal catchphrases like giving back (\"Nobody—especially not the evil, wretched rich—actually earns anything anymore. Why do liberals think this way? Because they find it impossible to acknowledge that people work for money\"), our rampant civic idiocy (\"We are not a democracy. Never were. Weren't supposed to be. And we shouldn't be\"), and Big Brother (\"We have smoke-free workplaces. We have drug-free school zones. I say let's start establishing government-free oases, where we can be free to leave our seat belts unbuckled, and peel the labels off anything we choose\"). And somehow, along the way, he finds room for pop quizzes, cat-chasing contests, and an answer, once and for all, to the eternal question, \"Neal, why don't you run for president?\"—in a chapter called \"No Way in Hell.\" Full of irresistible wisecracks and irrefutable libertarian wisdom, Somebody's Gotta Say It is one man's response to America at a time when the government overreaches, the people underperform—and the truth hurts.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Humor",
    "Audiobook",
    "Economics",
    "Philosophy",
    "Pop Culture"
  ],
  "author": "Neal Boortz",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/240185.Somebody_s_Gotta_Say_It"
}