{
  "title": "Wild Marauders MC: Lynch",
  "description": "The woman in question was still on the ground, unwittingly bringing attention to her large tits as she lay on her backside panting. Her wild blonde hair was half-up, half-down, and with a huff she brushed it out of her face and eyes, which were shooting daggers of blue lightning up at us. When my gaze returned to hers, she had enough fury in her eyes to damn me to hell and back. If she recognized me she didn’t show it.I shouldn’t have, but I smiled.She got to her feet on her own steam and headed straight for Chicken. “You dumb shit! I couldn't breathe!” It was clear that she was going to hit him, which just wouldn’t do. No one hit a brother, even a prospect, and got away with it. Chicken actually took a step back, producing laughter from Wizard and Tank. It was clear her attack had caught him by surprise. “You could have killed me!”Just as she raised her hands to hit him I stepped forward and wrapped an arm around her waist hauling her off her feet and back against me. I immediately noticed the difference between her and the skinny whores that hung around club. Thicker waist, curvier hips, and right now her fleshy ass was rubbing against me, and any time I had something this sweet against my dick I got hard.“Who the hell is in charge here?” she snapped, digging her nails into my arm and struggling wildly, obviously too angry to appreciate her situation. “Kidnapping is against the law, you jerks!” She tried to pull my arm from around her waist, throwing her head back with purpose.She wasn’t scared, just mad as hell.Her attempt to head-butt me produced a chuckle from the guys. I was six-foot-six and her head barely reached my chest. There was nothing she could do to hurt me physically, but that didn’t matter. Just the fact that she was trying to hurt me was cause for immediate action. As the president of the club I had a reputation to protect. My crew might be amused at what was happening, but they still expected me to put her in her place and show her who was boss. As she continued to wiggle against me, the clip holding her hair popped open, releasing long, wild hair.The kind of hair a man could grab a hold of when pounding into her from behind.Fuck me. Not a vision that I wanted right then.“Let me go, asshole!”I had a feeling that her hysterical command was the result of my hard cock. Unless she was dead from the waist down, she had to feel it against her ass. I was harder than a steel rod from her movements, and I’d always liked a woman that looked like a woman, with curves I could sink myself into. Another thing affecting my libido was the way she smelled, clean and fresh. I was used to the smell of cigarettes, booze, and sex on the whores that I slept with.“Take your filthy hands off me!”That did it. She needed to be taught a fucking lesson. There was an old, broken down jeep nearby and I threw her up against it, pushing her there with my body. Ignoring her gasp of pain, I fisted a hand in her long hair and jerked her head back roughly, enough so that our eyes could meet.“Give me anymore trouble and I’ll show you how filthy I can get.",
  "genres": [
    "Contemporary",
    "Romance",
    "Contemporary Romance",
    "Adult",
    "Erotica",
    "Fiction",
    "Motorcycle"
  ],
  "author": "Tory Richards",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/24012765-wild-marauders-mc"
}