{
  "title": "Safari to Hell",
  "description": "Blood-curdling novel of a different Africa than the one we know, a place where you only come out as a billionaire ... or a bodyA young, inexperienced lawyer applies for a job at a renowned law firm. With his weak credentials chances are slim. Much to his surprise he is hired at a generous salary. Suddenly the law firm is whisking him off to deepest, darkest Africa, on an important assignment, with next to no instructions. What begins as a promising first ever business trip quickly starts looking like a one-way ticket to hell.Caught up in a true horror story, he is powerless to escape the nightmare. This safari to hell lands him in the middle of illegal transactions and money laundering by corrupt politicians, and gets lured into the bed of the wife of the most dangerous and ruthless man in the country. With innocent people dying under suspicious circumstances all around him, his life is always hanging by a very thin thread, as he learns when he is invited to sign his own death certificate. He has no way out of the country, and when he rings his firm no one seems to know him… Will the young lawyer survive being buried up to his neck in hot desert sands, while vultures loom ever closer, waiting to pick out his eyeballs?The author, a leading international lawyer himself, has masterfully crafted the character of the young lawyer with a great eye for detail and the workings of the human mind.If you love a fast-paced literary thriller with a plot that keeps you guessing, this book is for you. The action and psychological terror will keep you turning pages until the end.Literary thriller about the power of evil set against the background of a terrifying realityPraise for Safari to Hell:Bone-chilling. Everyone needs to read this - Professor Bob SmalhoutExciting buildup from exposition to shocking conclusion. Truly a literary thriller. – Jacques van EkVery good book about corruption... I have some experience in Africa, and this could very well be a true story! Very well written by a man with professional knowledge of the world of lawyers and of Africa. – C. van AmerongenI’ve read ten thousand books, and this is one of the most fascinating. Literary masterpiece of the highest order- Martin Ros, publisher",
  "genres": [],
  "author": "Nemon",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/24017314-safari-to-hell"
}