{
  "title": "The iAmerican",
  "description": "To all good things... \n\"We came here to make Congress effective again, and that is bigger than any one man.\"\nSome people see a conspiracy behind everything, only this time there was one. While coming to grips with the discovery of who tried to have him assassinated, Michael Bennit must make the decision that will define his character - make a deal with the devil to save his political career or risk losing everything he has worked for.As party allegiances crumble in Washington, the new president is desperate to advance his own agenda with or without the help of Congress. Heeding the calls of a disgruntled public, he plans to act unilaterally and fundamentally change the face of the American government. Now the former soldier and teacher and his staff must race to do the impossible and unite the Legislative Branch against an egomaniacal president.With enemies mobilizing against him, the media no longer on his side, and most of his former students no longer able to help, the stakes have never been higher for Michael Bennit - he must succeed in his quest to bring change to Washington or watch as the center of national political power permanently shifts to the White House forever.The fourth book in The Michael Bennit Series, The iAmerican follows the plight of four people caught in the crucible of the greatest power struggle the nation has ever witnessed. Friendships will be tested and careers destroyed, but can the integrity of one man be strong enough to save the government from itself and restore the confidence of the American people?\nThe Michael Bennit Series (in order):\n1. The iCandidate2. The iCongressman3. The iSpeaker4. The iAmerican ˃˃˃ More Than Just a Plain Vanilla Political Novels The Michael Bennit Series books are more than just another political novels. Although the books are set against the backdrop of a politics, the themes they explore the about social media and society, education in America, and how we react to a pervasive media culture are important to learn about and discuss. ˃˃˃ A Glimpse Into the Future!Social media is everywhere today! It is a powerful tool, but are we too trusting of it? This must read series of books examines that question in a fun and entertaining way.\nRead the first three books in the series first, then purchase a copy today!",
  "genres": [
    "Fiction"
  ],
  "author": "Mikael Carlson",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/24004448-the-iamerican"
}