{
  "title": "Black Wolves",
  "description": "Contains all three books in the Black Wolves story arc.  Thief: Black Wolves (Haven City Book 3)  When Fisk, a cat shifter and thief, is sold into sex slavery, the most dangerous shifter gang in Haven City buys him: the Black Wolves. Ian Black, the gang's leader and alpha wolf, has plans for Fisk. It's up to Breaker, the beta, to follow the boss's orders.  Breaker doesn't expect to fall for the alluring feline with the bad attitude. Only Fisk strikes Ian's fancy too, and a beta can't cross an alpha.  Fisk finds himself torn between two very different men - Ian, the sexy alpha and Breaker, the stoic enforcer. One of the wolves is his mate, but Fisk isn't sure how to handle it. Sex is one thing - love is something else.  Alpha’s War: Black Wolves (Haven City Book 4)  Sebastian knows criminals. He was raised in a family of thieves. But nothing could prepare him for the charming and dangerous gang leader and alpha wolf, Ian Black.  Since Seb isn’t strong enough to protect himself, he seeks aid from the Black Wolves – the most infamous shifter gang in the city. While the alpha promises to protect Seb, Ian wants something in return. Seb has to pretend to be Ian’s sex slave in public.  Only problem is Seb’s straight – or he thought he was. Ian’s insistence tests his resolve at every turn.  As violence explodes throughout the city, desire sizzles between the cat and wolf. But giving into passion is difficult for Seb who spent his entire life pushing other people away.  Can these two broken men find love in the midst of chaos?  Tiger’s Den: Black Wolves (Haven City Series # 5)  Milo, the Black Wolves’ omega wolf, always stayed on the sidelines. He’s a hacker – not a badass. Hell, he can’t even get laid, much less play the part of a dangerous gang member.  But, in order to stop an ongoing gang war, Milo is unceremoniously thrust into the middle of the Tiger’s den as a nark (for the cops) and a spy (for the Black Wolves). Not to mention the dead sexy Tiger leader, Xian Fei, insists Milo stay by his side at all times. For protection purposes, of course. Milo’s not even sure if he’s gay, but Fei makes his stomach do backflips, and his cock – well, that’s another story.  Yeah, the omega is pretty sure he’s fucked, and he likes it. A lot.  Fei clawed his way to the top of the Tigers after years of serving the desires of others. He’s close to ruling his gang in peace, if he can protect the hot little wolf in his care. Problem is – Fei’s not sure he can keep his paws off Milo. While Fei plays the confident leader, he’s hiding a dark past and a vicious secret.  Milo’s the only one who can break Fei’s cool – the only one who can bring the tiger to his knees.  Passion burns between Fei and Milo, but will the lies and twisted loyalties tear them apart before they find a happy ending?  Contains: graphic violence and gay sex.  *book set available for limited time.",
  "genres": [],
  "author": "Zoe Perdita",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/24009785-black-wolves"
}