{
  "title": "Simplify your Life: Einfacher und glücklicher Leben",
  "description": "Wer würde nicht gerne sein Leben einfacher und überschaubarer gestalten? Die Welt ist schließlich komplex genug. Simplify your life hält, was der Titel verspricht: Werner Tiki Küstenmacher und Zeitmanagement-Guru Lothar Seiwert haben eine Fülle von konkreten Tipps parat und verzichten dabei auf Platitüden. Alles ist sofort umsetzbar, bis hin zu den Tipps zum Umgang mit der Informationsflut. Die Botschaft: Unordentlich zu sein, ist kein Schicksal, sondern vergleichbar mit einer leichten Sucht. Wer sich ändern möchte, kann es schaffen. Aufgebaut ist das Buch nach dem Schema einer \"Lebenspyramide\": Erste Aufgabe und damit quasi der Sockel der Pyramide ist, seinen Arbeitsplatz zu entwirren und seine Umgebung zu entrümpeln. Küstenmacher begleitet seine Leser buchstäblich durch jeden Raum der Wohnung. Sein Rezept: Vieles, was man besitzt, benutzt man längst nicht mehr und braucht man auch nicht; es ist Ballast, der einen buchstäblich belastet. Weniger Sachen bedeuten mehr Geld und mehr Wahlfreiheit. Also wird aussortiert, wenn nötig radikal. Der nächste Schritt sind die Finanzen. Hat man sich erfolgreich entschuldet, vom Lotto-Traum verabschiedet und den \"inneren Kontostand\" auf einen positiven Wert gesetzt, heißt es, in seinem Leben eine Zeitschneise frei zu schlagen. \"Entperfektionieren\" lautet die Devise. Da der Druck oft genug von außen kommt, liefert der Autor gleich \"Sieben Wege, das Nein beziehungsorientiert zu verkaufen\" mit. Nicht leugnen lässt sich, dass auch Beziehungen und Partnerschaft das Leben deutlich komplizierter machen. Küstenmacher leitet dazu an, seine Familienbande zu entwirren, Gespräche zu entdramatisieren und das Verhältnis von Beruf und Privatleben zu entkrampfen. Wie ausführlich die Ratschläge sind, zeigt sich an einzelnen Skurrilitäten wie der Simplify-Idee Nr. 22: \"Entkrampfen Sie Ihre Beerdigung.\" Der wirklich gut organisierte Mensch macht sogar seinen Nachkommen das Leben leichter. Von den einzelnen Bereichen geht es zum großen Ganzen: Die Spitze der Pyramide bilden Tipps, wie man sich selbst vereinfacht, indem man sein Lebensziel entdeckt, seine Stärken entwickelt und sich selbst enträtselt. Denn eine chaotische Wohnung, anstrengende Beziehungen und ein Konto, das ständig in den Miesen ist, sind nicht selten Ausdruck einer Persönlichkeit, die nicht im inneren Einklang ist. --Sylvia Englert",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Productivity",
    "German Literature",
    "Inspirational",
    "Psychology",
    "Personal Development"
  ],
  "author": "Werner Tiki Küstenmacher",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/2400779.Simplify_your_Life"
}