{
  "title": "The Rules of Love",
  "description": "The Hampton Road Club  Welcome to the Hampton Road Club. It’s the 1920’s and men who enjoy Dominance and submission have to be very careful that their dark desires aren’t discovered. The exclusive and secret Hampton Road Club near Hollywood is one of many private homes around the world that offers facilities for those who practice sadism and masochism. Meet the men who search for love amongst the world of bondage, whips and chains. This is where a Master can find a submissive to cherish forever and a submissive can give himself to his Master for a lifetime of painful pleasure. The Rules of Love by Morticia Knight Book Two in The Hampton Road Club seriesMaster Saul is captivated by the beautifully submissive Kenneth and the boy’s love of pain. Unfortunately, Kenneth belongs to Master Preston.It’s 1926 and as one of the founding members of the Hampton Road Club, Master Saul Liebowitz has enjoyed the charms of many willing submissives over the years. One of the newer submissives to the club has captured his attention more than anyone has in a long time. Kenneth is tall, muscular and also seems to have a greater love of pain than most. If only Kenneth didn’t already belong to another Master.After Kenneth’s Master died years before, he allowed himself to be taken in by the promises of Master Preston. As time has gone by, Preston has become increasingly crueler to the point where Kenneth fears for his life. They’ve recently joined a sadomasochism club and Kenneth can’t help but yearn for the handsome Master the other boys speak so highly of—Master Saul.Preston takes things too far one night, and when Saul and his good friend, Master Aaron, do some investigating, they realize that Kenneth might be in real danger. Amidst turmoil at the club over whether there should be rules to keep the boys safe and Preston’s play for power, Saul searches for a way to save Kenneth from what he’s sure is a deadly situation.Both men fight for what they believe to be the right thing. When they find their way to one another, a wonderful new world opens up to them. But there’s one man out there who refuses to let go of the old ways. Kenneth is his property and Master Preston won’t give him up.Morticia Knight About the   M/M and M/M/F Erotic Romance author Morticia Knight enjoys a good saucy tale – after all, who doesn’t? Since she loves several genres, you may find your heroes in a contemporary, historical, paranormal or sci-fi setting. One of her passions is bringing people's fantasies to life on the page, because life is too short for even one boring moment. Her stories are volcanic in heat, deep in emotion, and sprinkled with doses of humor.When not indulging in her obsession for books, she loves the outdoors, film and music. The Pacific Northwest is the ideal spot to enjoy both hiking and beachcombing. Once upon a time she was the singer in an indie rock band that toured the West Coast and charted on U.S. college radio. She now resides on the northern coast of Oregon, where the constant rain and fog remind her of visits to family in England and Scotland when she was a child.She is currently working on the Sin City Uniforms Series and a BDSM spin-off to the Gin & Jazz series entitled The Hampton Road Club. A follow-up to Bryan and Aubrey’s story in Rockin’ the Alternative will be available in 2015.",
  "genres": [
    "BDSM",
    "Historical",
    "M M Romance",
    "Historical Romance",
    "Abuse",
    "Romance",
    "Erotica"
  ],
  "author": "Morticia Knight",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/24013180-the-rules-of-love"
}