{
  "title": "My Mysterious Son: A Life-Changing Passage Between Schizophrenia and Shamanism",
  "description": "What does a father do when hope is gone that his only son can ever lead anything close to a “normal” life? That’s the question that haunted Dick Russell in the fall of 2011, when his son, Franklin, was thirty-two. At the age of seventeen, Franklin had been diagnosed with schizophrenia. For years he spent time in and out of various hospitals, and even went through periods of adamantly denying that Dick was actually his father.A mixed-race child, Franklin was handsome, intelligent, and sensitive until his mental illness suddenly took control. After spending the ensuing years trying to build some semblance of a normal father-son relationship, Dick was invited with his son, out of the blue, to witness the annual wildlife migration on Africa’s Serengeti Plain. Seizing this potential opportunity to repair the damage that both had struggled with, after going through two perilous nights together in Tanzania, ultimately the two-week trip changed both of their lives.Desperately seeking an alternative to the medical model’s medication regimen, the author introduces Franklin to a West African shaman in Jamaica. Dick discovers Franklin’s psychic capabilities behind the seemingly delusional thought patterns, as well as his artistic talents. Theirs becomes an ancestral quest, the journey finally taking them to the sacred lands of New Mexico and an indigenous healer. For those who understand the pain of mental illness as well the bond between a parent and a child, My Mysterious Son shares the intimate and beautiful story of a father who will do everything in his power to repair his relationship with a young man damaged by mental illness.",
  "genres": [
    "Memoir",
    "Psychology",
    "Health",
    "Mental Health",
    "Nonfiction"
  ],
  "author": "Dick  Russell",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/24017731-my-mysterious-son"
}