{
  "title": "Splatterism: The Disquieting Recollections of a Minotaur Assailant: An Upbuilding Edifying Discourse",
  "description": "Meet Scammander and Evander. They're not trying to save the world. They're trying to destroy it.  But first they must find a book.   Doom and Destruction are Coming to this World   As pools of blood dry around the rotting corpses in ravaged cities, the races of the world band together to find a group of young heroes to capture—and preferably kill—Evander and Scammander.   The Gathering of Heroes   Assembled by Scammander’s own mother, these heroes are given arms and armor from the legendary Hall of Relics. Noble, educated, and all descendants of the ancient aristocratic families of the world, civilization’s hopes for survival rest on their shoulders.   The Desperate Search for Lost Knowledge   While the heroes are hunting the two villains, the elf and the minotaur are busy hunting books. Books, after all, are some of the most dangerous things around.  Especially if you know the right way to read them.  The only problem is that all the books they need have either been lost over the centuries or reside with Scammander’s old wizarding tutors, former unsavory accomplices to sinister schemes and assassinations, and greedy power-hungry monarchs. And not a single one of them want to see Scamander ever again, unless of course it’s his corpse.   A Wizard, a Warrior, & an Aristocrat   Scammander is lost in his own labyrinth of lies, unable to remember who he’s betrayed, who’s betrayed him, and who he should betray next.  He used to be the greatest wizard of all time, and now time is running out on his greatest plot.  Evander is suicidal, reckless, and cynical. He wants to kill and destroy everyone and everything—including himself—which is going to be a problem due to a spell Scammander cast on him. Maybe Scammander is actually the only one he should be trying to kill.  He’s also narrating this tale to Tristan D’Mure, very much against his will.  Tristan D’Mure is an entitled aristocrat, and is entitled to the truth. As the only living survivor besides the minotaur he is interrogating, he is forced to discover increasingly innovative ways to pull the truth from Evander’s mind. Many of these ways seem to guarantee his death, leaving only the ignominious minotaur alive. But the risk is worth it, if only to see the minotaur wince and writhe for just a little longer.  Splatterism: The Tragic Recollections is currently FREE:amzn.to/ZJOmMs",
  "genres": [],
  "author": "Christian Winter",
  "average_rating": "2.50",
  "url": "https://www.goodreads.com/book/show/24033605-splatterism"
}