{
  "title": "Time Tattoo: Book 1 (TIME SERIES)",
  "description": "Book 1 : Time TattooBook 2 : A Reasonable TimeBoth can be read as stand aloneSuited for mature readers due to language, violence and sexual content.I approached the veranda of the cafe and saw Alaric sitting with his back to me. My heart skipped a beat as I got closer. I touched his shoulder. “Alaric.”He swung around and stood up. The surprise was evident on his face. “Holy shit! You’re a woman?” He actually took a few steps backwards.I could not help but laugh at him. This was so funny to me because I was so used to the confident self assured Alaric.... This was not like him at all.I tried to cover my laugh with my hand and saw his face change from confusion to amused surprise. “You are laughing at me…” He said this as if he could not believe I had dared to do so. But his face had that lazy grin, only his eyes were still surprised.He recovered and held his hand out to the chair. I sat and he pushed the chair in.When he sat down I could see the devils dancing in his eyes. “So ....you are the new recruit.”I nodded. “Yes…. Jade Pax.”“Mmmmm.... and you met me already, right?”I nodded again but I was not smiling anymore. This was just too weird and Alaric’s whole demeanour scared me a little.He smiled lazily. “Did I fuck you?”My eyes bulged. “Excuse me?” I was so taken aback by this other Alaric. He seemed like a total stranger to me. He shrugged and called the waitress. “Never mind.” Then smiled lazily as the waitress reached the table. He sat back in the chair and was looking her up and down.“Can I get you anything?” She asked.Alaric lifted his eyebrows suggestively and she giggled in response. I looked at her and she was really pretty and blushing. I knew it was stupid but I instantly felt a pang of jealousy. “Darling...you can get me anything you want...but to eat I would like hake and chips and to drink, a savannah dry please.” He smiled his sweet angelic smile at her and I could practically hear her heartbeat stutter. Then he looked at me. “What are you having...you must be starving.”I quickly looked at the menu and selected the hake but with a salad and a glass of white wine. I looked at her but she was still staring at Alaric.“Thanks.” I said to bring her back to reality.She looked at me and smiled, then turned to place our order.Alaric was staring at me ...his eyes perplexed and burning me.“So tell me what’s going on here.” I asked, hoping to get some of his usual reaction.“Mmm... I meet you here, I show you… the ropes, I go back, tell Max who you are- well that you know by now surely - and that’s it.” He sat back and lit a cigarette. “Those things will kill you.” I said with a smile on my face.He looked at the cigarette and smiled. “I really hope not.” I grinned because I knew he would say that and that raised his suspicions again.“What’s so funny?” He said with an open smile and his eyes were perplexed.“Nothing.” I composed myself.Just then the waitress brought our drinks and bent low towards Alaric, smiled sweetly while giving him a view of her cleavage and left again. I saw him checking out her behind as she walked away. He turned to me and I looked at him questioningly. This Alaric was the player everyone talked about... dangerous to the core and extra dangerous to me. He sighed and bent forward, leaning on the table.",
  "genres": [],
  "author": "M.K.F. Soundread",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/24034275-time-tattoo"
}