{
  "title": "Destined",
  "description": "\"A book to rival TWILIGHT and VAMPIRE DIARIES, and one that will have you wanting to keep reading until the very last page! If you are into adventure, love and vampires this book is the one for you!\"--Vampirebooksite. com (re Turned)DESTINED is book #4 in the Bestselling series THE VAMPIRE JOURNALS, which begins with TURNED (Book #1), a free download on Amazon with over 600 five star reviews!DESTINED is book #4 in the Bestselling series THE VAMPIRE JOURNALS, which begins with the free book TURNED (Book #1).In DESTINED (Book #4 in the Vampire Journals), Caitlin Paine wakes to discover herself back in time. She finds herself in a cemetery, on the run from a mob of villagers, and seeks refuge in the ancient cloisters of Assisi, in the countryside of Umbria, Italy. There, she learns of her destiny and her mission: to find her father and the ancient vampire Shield needed to save mankind.But Caitlin’s heart still pines for her lost love: Caleb. She desperately needs to know if he has survived their trip back in time. She learns that her mission requires her to go to Florence, but if she wants to pursue matters of the heart, she must go to Venice. She chooses Venice.Caitlin is overwhelmed at what she finds. Venice of the eighteenth century is a surreal place, men and women dressed in elaborate costumes and masks, celebrating an endless, lavish party. She is thrilled to discover and reunite with some of her close friends, and to be welcomed back into their coven. And she is excited to join them in Venice’s Grand Ball, the most important costume dance of the year, where she hopes, once again, to find Caleb.But Caitlin is not the only one who can travel back in time: Kyle soon arrives, too, and is determined to hunt her down and kill her once and for all. Sam, too, arrives, determined to save his sister before it is too late.At the Ball, Caitlin searches everywhere, and finds no sign of Caleb. That is, until the very last dance. She dances with a masked man who takes her heart away, and she feels certain that it is him. But as the partners change, she loses him again. Or does she?Caitlin soon finds herself torn between the two loves of her life, and discovers that she has to be careful what she wishes for. Her joy at finding what she wants might just come mixed with tragedy and heartbreak.In a climactic, action-packed ending, Caitlin finds herself up against true evil, Rome’s ancient vampire coven, and the most powerful vampire coven that ever existed. Surviving will demand all her skills, as she finds herself battling for her very life. She will have to sacrifice more than ever, if she is to save the one she loves….“DESTINED is the fourth installment of the Vampire journals series and it will not disappoint. There are so many twists and exciting developments throughout the story that it keeps your attention. The main character Caitlin is developing and maturing. …Great adventure/romance!”--The Romance Reviews“I just turned 30 and there are a few YA series that I just love and this one is definitely on that list! READ IT! READ IT! READ IT! Don’t forget READ IT!”--werevampsromance. org",
  "genres": [
    "Vampires",
    "Young Adult",
    "Fantasy",
    "Paranormal",
    "Romance",
    "Fiction",
    "Supernatural"
  ],
  "author": "Morgan Rice",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/11468029-destined"
}