{
  "title": "The Complete Book of Pasta and Noodles: A Cookbook",
  "description": "How do you boil pasta? How much water and salt do you need? Should you add oil to the water? How well should you drain it? (Turn to page viii for the answers.)One part cooking course, one part kitchen reference, and one part foolproof recipes, The Complete Book of Pasta and Noodles tells the story of flour and water like no other book on the market. Extensively covering the basics of pasta and noodles, this thoroughly researched and taste-tested guide is dedicated to the home cook who needs practical advice on everything from penne to pad thai. The experts at Cook's Illustrated present their knowledge and techniques in a hands-on way so that each and every step of the cooking process can be understood and easily executed. The authors leave room for interpretation and taste, of course, but you will not walk away from this book without knowing which olive oil to buy, why egg pastas tend to complement cream sauces, or how to mince garlic.The book is arranged in four sections, exploring first dried semolina pasta, then fresh Italian-style pasta, Mediterranean pasta and European dumplings, and finally, Asian noodles. There are thirteen chapters devoted to sauces alone, and recipes are included with the type of pasta with which they work best -- from the simplest to the complex, but all within reach of the home cook. As a bonus, the book includes excellent photographs of the various pasta and noodle shapes, and impeccable illustrations clearly depict each step of key techniques. Special sections are devoted to such specific topics as \"Are Electric Pasta Machines Worth the Money?\" and \"A Guide to Popular Cheeses.\"\"Cook's has always been the definitive word on any subject it tackles,\" says The Post and Courier, and The Complete Book of Pasta and Noodles will serve as the definitive reference volume for pasta lovers.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Reference",
    "Nonfiction"
  ],
  "author": "Cook's Illustrated",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/24033.The_Complete_Book_of_Pasta_and_Noodles"
}