{
  "title": "The Weight of Stars: Three United States of Asgard Novellas",
  "description": "“This infinitely exciting tale’s twist and turns highlight the characters’ missions as they decide which identity to choose: hero, martyr, or villain. Readers looking for a sophisticated fantasy that shows a raw, rowdy, and rough side of life will be utterly satisfied. For fans of Robin LaFevers’s His Fair Assassins series.” —School Library JournalThe United States of Asgard is a nation of poets and warriors, of rock bands and evangelical preachers, of gods and their children. The media tracks troll sightings and reality TV is about dragon slaying and teen prophets. The president rules the country alongside a council of Valkyrie, and the military has a special battalion dedicated to eradicating the threat of Greater Mountain Trolls. Welcome to the United States of Asgard: Be sure to watch for troll-sign!GOLD RUNNER tells the story of Amon Thorson, bastard son of Thor Thunderer, a rebel who specializes in illegal troll artifacts and elf gold. Someone has stolen Loki’s Mask of Changing, and Amon is the prime suspect, putting a famous hunter and a mysterious stranger on his tail.LADY BERSERK is about Vider, the first female berserker warrior in generations, who is loved by Loki Changer but determined to stand on her own. One of six celebrities invited to participate in a televised dragon hunt, she knows things are not as they seem—which is usually a sign Loki is up to his old tricks.GLORY’S TEETH offers a glimpse into the wild heart of the Fenris Wolf, also called Glory, trapped in the shape of a teenaged girl for hundreds of years so she cannot grow large enough to devour the sun and begin the end of the world. But Glory’s seen signs that now is time she’s fated to hunt Baldur the Sun down and eat him.With evocative writing and lush world building, Tessa Gratton once again captivates readers with her inventive reimagining of Norse mythology and American life in this collection of novellas based on her United States of Asgard series.“With razor-sharp prose and bone-deep emotions, Tessa Gratton doesn’t just tell a story. She invites readers into another world-- one we hate to leave when the last page is turned.” —Saundra Mitchell, author of Mistwalker and The Vespertine",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Mythology",
    "Short Stories",
    "Alternate History",
    "Fiction",
    "Urban Fantasy"
  ],
  "author": "Tessa  Gratton",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/24037784-the-weight-of-stars"
}