{
  "title": "A REASONABLE TIME: Book #2 in the Various Dimensions series",
  "description": "Book 1 : Time TattooBook 2 : A reasonable TimeBoth can be read as stand alone books but Time Tattoo gives a lot of background.*Suited for mature readers only due to sexual content and language and because Cathy and her friends say what they want and do what they want. Promiscuity is part of their lifes and surroundings and could be offensive to some readers.He looked at her and she looked away to the street. He could see her biting her lip and wondered what she was thinking.“Why do you do that?”She looked back at him. “Do what?”“Look away when you’re scared I might see what you’re thinking… and biting your lip.”She laughed and lowered her head. “I thought I was supposed to be the therapist here.”“So what were you thinking?”“Jason….”“C’mon Cathy… you said no analyzing, no taking notes... just talking, right?”She stared at him a while. “The truth?”He sat back. “Yes… Always the truth, please. I won’t be offended, I promise.”She bit her lip again and smiled. “Your eyes. They kind of scare me. And when you look at me I have to look away because they are so… so… well… green.”He laughed loudly. “Green?”“Sometimes they are yellow.” She said in a whisper.He wasn’t smiling any more. “I know, usually when I’m mad, right?”“Yes.”The waiter came over and placed their cups in front of them. They kept looking at each other and the air was static. She took a sip of coffee and watched him over her cup and he wanted to drown in her honey brown eyes. He kept watching her.“Jason.”“Yes.”“Stop that.”“What?””Stop looking at me like you want to kiss me.”He smiled. “Sorry.”He looked down at his cup but when he lifted it he stopped. She was still watching him. “You can stop that too, you know.”“What.”“Looking at me like I’m a chocolate muffin.”They both snickered and she lowered her cup.The next moment he was up and leaning over the table and her mouth was on his. He kissed her hard and she opened her mouth to him. He knew he should stop. He knew this was insane. He knew that everyone was probably staring at them with him bending over the table and holding her face but he couldn’t stop.What the fuck was he doing?",
  "genres": [],
  "author": "M.K.F. Soundread",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/24034278-a-reasonable-time"
}