{
  "title": "The Masculine Mind: Alpha Male Life Lessons on Careers, Money, Relationships & Women",
  "description": "Most men begin their lives unprepared for both women and personal finances alike, despite what they think they know. Dylan Thrasher follows up his 2013 best-selling release The Masculine Way: What Your Dream Girl Really Wants with a unique, highly anticipated book focusing on equal parts former (women, dating, love, relationships), equal parts latter (personal finance, careers, saving, retirement).  A philosophy book standing out in the world of dating/relationship and financial advice, it offers insights on more than just “how to pick up chicks” or “how to get rich” type of material typically found, with chapters highlighting:  -The role of family and friends in an Alpha Male’s life. -When marriage is appropriate, and thoughts on divorce. -The bachelorhood vs. commitment debate. -Education costs and their return on investment. -Saving and investing vs. spending and living. -Managing credit and debt. -Having a job vs. building a career. -What is the “game,” does it need to be played, and what is winning? -How to have beautiful women in your life (hint- it’s not based on being tall, rich or handsome) -The traditional male vs. female dynamics vs. today’s changing roles -When is cheating / infidelity ever ok? -Does money buy happiness or not? -Why spending money on women is unnecessary. -How much should one spend on cars or homes? -Things you can do today to make yourself more valued in the workplace -How to survive and remain valuable in a changing world, with changing economies.  With a goal to have every reader find more success in their life in all realms, from being a leader of men with financial freedom to creating attraction in only the most amazing woman/women you choose to have in your life, you will live the life you want confidently as you see the path in front of you. Always partial to living the life of a “natural” Alpha Male, the author focuses on step-by-step improvements in both realms as you use the power of self-discipline and focus to achieve everything from a better sex life to improved money management. Success is a holistic, total picture world – having either financial success or romantic success alone is not enough for a true Alpha Male.  Very rarely will you see a book combining material on financial freedom with attracting women, discussing charisma and emotional control with pinpoint focus on self-improvement and motivation to live one’s dreams in establishing the relationships they truly want. As an empowered Alpha Male, this could be a wife/marriage or a bachelor lifestyle of many women in their lives, all of whom would be happy to be there!  More of a book promoting personal transformation, examining men's gender studies/men’s movements through a look at the “Manosphere” (collection of similar and varying philosophies in the seduction, pickup artist, and Red Pill communities), the book focuses on growth for more fulfilling interpersonal relationships of all kind, rather than simply examining dating & relationships. This book is ideal for those who want to cut a little deeper into social psychology with the author’s trademark incorrigible humor and tough love style mixed in. Written for both the up-and-coming Alpha Male and the older soul who wants to affirm the wisdom he has to share, this book is geared to help you truly develop a masculine mindset.",
  "genres": [],
  "author": "Dylan Thrasher",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/24022039-the-masculine-mind"
}