{
  "title": "The Neanderthal Box Set",
  "description": "***Books 1 and 1.5 in the Knitting in the City Series*** NEANDERTHAL SEEKS HUMAN This is a full-length, 110k word novel and is the first book in the Knitting in the City series.  There are three things you need to know about Janie Morris: 1) She is incapable of engaging in a conversation without volunteering TMTI (Too Much Trivial Information), especially when she is unnerved, 2) No one unnerves her more than Quinn Sullivan, and 3) She doesn't know how to knit.  After losing her boyfriend, apartment, and job in the same day, Janie Morris can't help wondering what new torment fate has in store. To her utter mortification, Quinn Sullivan- aka Sir McHotpants- witnesses it all then keeps turning up like a pair of shoes you lust after but can't afford. The last thing she expects is for Quinn- the focus of her slightly, albeit harmless, stalkerish tendencies- to make her an offer she can't refuse.   NEANDERTHAL MARRIES HUMAN This book is not a standalone. It is the sequel to ‘Neanderthal Seeks Human,’ it is book #1.5 in the ‘Knitting in the City’ series, and it is a full length, 105k word novel.  There are three things you should know about Quinn Sullivan: 1) He is madly in love with Janie Morris, 2) He’s not above playing dirty to get what (or who) he wants, and 3) He doesn’t know how to knit.  After just five months of dating Janie, Quinn—former Wendell and unapologetic autocrat—is ready to propose marriage. In fact, he’s more than ready. If it were up to Quinn, he would efficiently propose, marry, and beget Janie with child all in the same day—thereby avoiding the drama and angst that accompanies the four stages of pre-matrimony: engagement, meeting the parents, bachelor/bachelorette party, and overblown, superfluous wedding day traditions. But Janie, much to Quinn’s dismay, tosses a wrench in his efficacious endeavors and challenges him to prove his devotion by going through the matrimonial motions, no matter how minute and mundane.  Will Quinn last until the wedding day? Or will he yield to his tyrant impulses?  Regardless, one thing is for certain, Quinn Sullivan will have to learn to expect the Spanish Inquisition (i.e. the unexpected) if he plans to have and keep Janie Morris as his wife.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Humor",
    "Chick Lit",
    "Anthologies",
    "Fiction"
  ],
  "author": "Penny Reid",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/24023093-the-neanderthal-box-set"
}