{
  "title": "Adventures of a Lifetime: Travel Tales from Around the World",
  "description": "Adventure can mean so many things. For some, it means climbing the peaks of Tibet, sailing the open seas or cycling through Europe. For others, adventure is conquering a fear or pushing yourself to a whole new level. And for many, adventure means bravely stepping into the unknown of a new culture, language or setting.Adventure travel, in its essence, means pushing yourself outside of your comfort zone to experience something novel and worthwhile. It can change you, deep in your core, as you experience a side of life that you never imagined. Join the wild, bumpy ride during these 24 true adventures of a lifetime.•Get chased by monkeys in the forests of Indonesia•See what happens when you’re stranded in the Gobi Desert•Play a game of naked Frisbee with a tribe in New Guinea•Hang out with polar bears in the frozen lands of Manitoba•Say goodbye to your love on a final trip to Venice•Get hopelessly lost during a scary jungle hike in Hawaii•Stare history in the face uncovering your roots in Latvia•Watch over your back for hippos on a Ugandan safari•Attempt to sail across the wild Tasman Sea•Travel by camel with the “Blue Men” of Mali•Step foot in Antarctica among icebergs and penguinsAnd many more…Contributors to Adventures of a Lifetime •Robert N. Jenkins•Michael Engelhard•Kimberley Lovato•James Michael Dorsey•Todd Pitock•Maggie Cooper•Mariusz Stankiewicz•Erin Byrne•Darrin DuFord•Dan Leeth•Asia Nichols•Bruce Northam•Claire Ibarra•Mim Swartz•Janna Graber•Richard McCulloch•David Richard Teece•Gina Kremer•Peter Mandel•Aaron Paulson•Nayanna ChakrbartyFor more information on each contributor, see Adventures of a Travel Tales from Around the World is the second book in the World Traveler Tales anthology series. For more information, see WorldTravelerPress.com",
  "genres": [
    "Travel",
    "Adventure"
  ],
  "author": "Janna Graber",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/24044036-adventures-of-a-lifetime"
}