{
  "title": "Armstrong Dent and the Edge of Earth",
  "description": "This is an anthology of three full-length Armstrong Dent adventures and includes the first story in the series, Armstrong Dent and the Order of the Copper Scroll. Armstrong Dent is the leader of a unique team of special ops agents made up of famous celebrities, each with a highly specialized talent. For example, the team's white hat hacker is a multi-billionaire tech entrepreneur, the team's cryptologist is a best-selling author of conspiracy novels, and the team's linguist is a Grammy Award-winning musician. In all, ten team members rotate in and out of the stories. The series is accompanied by the world's first book series soundtrack with songs written and performed by the author. The book includes a code to download two free songs from the original book series soundtrack.The Anthology Dent and the Order of the Copper Scroll - In this novella, the world’s most famous secret agent, and his team of celebrity adventurers, must overcome a terrorist who intends to use an ancient biblical relic to destroy the world. The team will have to transform the opinion of the American government which intends to shut them down or allow a new shadow world government to assume control of the entire world.Armstrong Dent and the Death of the Sun - Armstrong Dent and his team must unravel a villainous plot to overthrow the United States government by a Mexican drug cartel kingpin who uses children as bait. Dent must atone for an earlier mistake that allowed his most cunning adversary to threaten the lives of hundreds of schoolchildren. Armstrong Dent and the Guerrilla Revolucion - Armstrong Dent and his team of celebrity secret agents must solve the mystery of a sunken pirate ship before a long-hidden World War II conspiracy is exposed that could ignite a new World War. A famous revolutionary is poised to spark a new worldwide uprising on the back of this history-changing cover-up.",
  "genres": [
    "Fantasy"
  ],
  "author": "Aeyess",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/24040775-armstrong-dent-and-the-edge-of-earth"
}