{
  "title": "Semper Fidelis",
  "description": "Anomaly by S.A. McAuleyWarning: Untested chemical reactions in process…When Staff Sergeant Galen Welc is handed Temporary Additional Duty orders that move him to the Marine Corps base at Twentynine Palms, he thinks he’s prepared for what’s to come. Known for his uncanny ability to spot improvised explosive devices, he’s pitted against the latest in defense technology. He trusts his instincts and his training, but they may just be leading him somewhere—and to an explosive reaction with someone—he could never see coming.Always Ready by T.A. ChaseMaking a living on the Bering Sea is hard enough, but throw love into the equation, and things can blow into a hurricane.Senior Chief Dean ‘Jake’ Jacobson loves his job as a Coast Guard rescue swimmer. Saving lives is the second best thing he could ever do. The first is loving Phil ‘Rhody’ Rhodes.Phil is a third generation crabber who fishes the Bering Sea. Being gay and in love with Dean isn’t something he talks about, especially not with the six men he lives with on the Angela Kayla for weeks on end. But he’s been happy with his life.Until one day the Bering Sea reminds them that she is a dangerous place to work. As her icy waters surround them, they discover one truth. Dean and Phil must always be ready to love each other because life can be taken so easily when one works on the sea.A Ring and a Vow by Devon RhodesEvery promise must someday be fulfilled, and the best way Owen knows how to reward Cary’s faith is with a vow.It’s been nearly five years since Owen went down on one knee with his Academy ring and promised Cary he’d someday do it for real. With Cary being a Naval aviator and Owen a Marine officer serving in Iraq, they’re rarely on the same continent, let alone together.About time for them to fill out paperwork to re-up, Owen realizes that if they were married, they’d have a much better chance of being stationed nearby. But time is not on their side so he’s forced to compromise on his proposal in order to make it work.Cary has been waiting for Owen for years—there was no chance he’d ever say anything but yes. Owen is coming home at last, and wants to make a home with him. However, between the chronic nightmares he’s been fighting and the ever more complicated wedding plans, the next month could be anything but a dream. Publisher's Note: This book is the sequel to A Ring and a Promise.My Marine by LE Franks & Sara YorkFor a man who made his career in intelligence, falling for an Afghani national in the middle of a war zone wasn't the smartest thing a Marine could do.Marine Captain Sean Kelley loves his country and the men he serves with, but when he meets Akim, he’s tempted to throw it all away for the mysterious man. He knows better than to chase after a local, but repeat encounters culminating in a moment of passion leave him reeling—he’ll do almost anything to figure out how they can be together.Akim Bijan has a secret of his own—one large enough to get more than just himself killed if it's revealed. But from the moment he first lays eyes on the handsome Marine, he's tempted to do just that rather than hide his growing attraction to the man. Being a translator allows him access to the base and he finds Sean alone one night. They take things farther than he ever intended. If only he could tell Sean everything, but his lips are sealed.When tragedy strikes, Akim is afraid he's lost Sean for good and he’s forced to make a decision that will change both their lives. Will love win, or will Sean and Akim be separated forever?Soul Sick by Kendall McKennaJamie thought he made it home to Tucker, leaving war behind. Now, each day he battles to fit into his own life, and save the love that saved his life.Jamie is a captain in the U.S. Marine Corps who carried a photo of Tucker with him throughout his deployment. His body and his heart both make it home, but he isn’t sure about his sanity. It no longer feels like his own life even fits.Tucker is a reformed bad boy who has an advanced degree and an important job but still sports long hair and tattoos. He missed Jamie while he was on deployment, but he couldn’t stop living his own life. Now, they’re struggling to learn to live with one another again, and things are going downhill fast.Jamie wants everything to be the way it used to, but his anger and self-destructive behaviour begin to push Tucker away. Too much alcohol and a night of violence inside their home take them nearly to the brink. Tucker is willing to fight alongside Jamie to keep it all from falling apart, if Jamie can learn to accept the help he needs…before it’s too late. Reader Advisory: This book contains scenes of domestic violence.Safe Shores by Morticia KnightKirk’s Coast Guard lover, Shane, is the only person who can save his son from a vicious gale storm – if he’s not too late.Fishing is the only life that Kirk has ever known. Born and raised in a small town on the Northern Oregon Coast, coming out of the closet was a struggle. Fortunately, he’s been lucky to find an amazing man to be with who serves in the Coast Guard. But he can’t help but wonder whether Shane wants more than just a shore leave romance.Shane loves the Coast Guard, loves the sea. That’s one of the main things he has in common with his fisherman lover, Kirk. He just needs to make sure that Kirk knows how serious he is about their relationship and what he plans on doing about it.Shane and Kirk’s joyful reunion is interrupted when a vicious gale storm threatens the coast. Kirk has to stand by helplessly and wait while his lover battles the raging seas to save his son. In an instant, Kirk could lose everyone he holds dear. Reader Advisory: This book contains scenes of BDSM.",
  "genres": [
    "Anthologies",
    "M M Romance",
    "Contemporary",
    "BDSM",
    "Romance",
    "Military Fiction",
    "LGBT"
  ],
  "author": "T.A. Chase",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/24058781-semper-fidelis"
}