{
  "title": "Sicily: An Island at the Crossroads of History",
  "description": "Critically acclaimed author John Julius Norwich weaves the turbulent story of Sicily into a spellbinding narrative that places the island at the crossroads of world history.“Sicily,” said Goethe, “is the key to everything.” It is the largest island in the Mediterranean, the stepping-stone between Europe and Africa, the link between the Latin West and the Greek East. Sicily’s strategic location has tempted Roman emperors, French princes, and Spanish kings. The subsequent struggles to conquer and keep it have played crucial roles in the rise and fall of the world’s most powerful dynasties.Yet Sicily has often been little more than a footnote in books about other empires. John Julius Norwich’s engrossing narrative is the first to knit together all of the colorful strands of Sicilian history into a single comprehensive study. Here is a vivid, erudite, page-turning chronicle of an island and the remarkable kings, queens, and tyrants who fought to rule it. From its beginnings as a Greek city-state to its emergence as a multicultural trading hub during the Crusades, from the rebellion against Italian unification to the rise of the Mafia, the story of Sicily is rich with extraordinary moments and dramatic characters. Writing with his customary deftness and humor, Norwich outlines the surprising influence Sicily has had on world history—the Romans’ fascination with Greek civilization dates back to their sack of Sicily—and tells the story of one of the world’s most kaleidoscopic cultures in a galvanizing, contemporary way.This volume has been a long time coming—Norwich began to explore Sicily’s colorful history during his first visit to the island in the early 1960s. The dean of popular historians leads his readers through the millennia with the steady narrative hand of a master teacher or the world’s most learned tour guide. Like the island itself, Sicily is a book brimming with bold flavors that begs to be revisited again and again.Praise for Sicily“Suavely readable . . . The very model of a popular historian, [Norwich] writes to give pleasure to the common reader. And what pleasure it is.” — The Wall Street Journal“Entertaining on every page . . . There is something ancient and sorrowful in Sicily, ‘some dark, brooding quality,’ just as captivating as its spellbinding history or its beautiful and varied landscapes, from beaches to lemon groves, pine forests to volcanoes. . . . The most amiable and freewheeling of guides, Norwich will always find time for the amusing anecdote.” — The Sunday Times“Utterly engrossing . . . written with passion about the art and architecture of this magical island, filled with gossipy tidbits and sweeping historical theories.” — The Daily Beast“Dazzling . . . Norwich is an elegantly graceful and entertaining storyteller.” — Richmond Times-Dispatch“Charming . . . richly nuanced history relayed with enormous fondness.” — Kirkus Reviews“A brisk and always-lively tour.” — Open Letters Monthly“Norwich is deeply in love with Sicily. [His] boundless affection has inspired a determined effort to understand its painful past. The result is impressionistic, as love often is.” — The Times“Norwich sketches personalities vividly. . . . He does the island and the reader a generous service in providing such an amiable introduction.” — The Sunday Telegraph“Norwich tells [Sicily’s] long, sad but fascinating story with sympathy and brio.” — Literary Review",
  "genres": [
    "History",
    "Nonfiction",
    "Italy",
    "Travel",
    "European History",
    "Audiobook",
    "Italian Literature"
  ],
  "author": "John Julius Norwich",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/24042911-sicily"
}