{
  "title": "Robbing the Bees: A Biography of Honey--The Sweet Liquid Gold that Seduced the World",
  "description": "Holley Bishop loves bees. No, more than that: she idolizes them. She marvels at their native abilities and the momentous role these misunderstood and unjustly feared creatures have played in the development of human history. And with her book, Robbing the Bees, she succeeds in making the reader love bees, too. Take this nifty bit of information, one of countless fascinating factoids offered by Bishop in her celebration of all things bee-related: \"Because of bees' starring role in the drama of pollination, we humans are indebted to them, directly and indirectly, for a third of our food supply. Visiting bees are required for the commercial production of more than a hundred of our most important crops including alfalfa, garlic, apples, broccoli, Brussels sprouts, citrus, melons, onion, almonds, turnips, parsley, sunflower, cranberries, and clover.\" Or how about this: \"For the past decade, the American military has been testing [bees'] potential as special agents in the war on drugs and terrorism. Bees are as sensitive to odor as dogs and can be trained to buzz in on drugs, explosives, landmines, and chemical weapons.\" Beat that as a winning opening gambit at a cocktail party. And that ain't all. Bishop charts the evolution of honey and beeswax harvesting through the ages, gives us an up-close look inside working beehives from ancient Egypt to the present day, interviews beekeepers, quotes bee chroniclers past and present (from Charles Darwin to contemporary Florida beekeeper Donald Smiley), reveals her rather clumsy foray into beekeeping in candid detail, studies bees' impact on religion and history, and provides a selection of innovative recipes calling for honey. Through it all, Bishop never loses sight of the star of the show--the humble honey bee--or the crucial but largely unrewarded role they continue to play on our planet. And she does it with snappy prose and keen humor. Dogs be warned: if Bishop has her way, bees will be the it pet of the future, or at least less likely to die at the end of a folded newspaper next time one buzzes in through an open window. --Kim Hughes",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Food",
    "Nature",
    "Animals",
    "Natural History"
  ],
  "author": "Holley Bishop",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/240513.Robbing_the_Bees"
}