{
  "title": "Children of the Wild Cats 1: Kitten Adventure",
  "description": "\"The beginning of a new book series that will be loved by kids who enjoyed Erin Hunter ‘Warriors’.\"  - - Denis Vukosav, TOP 100 AMAZON REVIEWER  When feral kitten Hattie is born into poverty in a cat cult ruled by evil tomcat Scarab Razorclaw, she is destined to fulfill his dream of returning to her wildcat roots by shunning humans. But Hattie can't bear the suffering she sees in her family, and rebels against every rule in a fight to survive, and is banished from her home and everything she knows. Alone, she searches for her place in the world, meeting danglepaws and wildcats, and even dreaded Bluntpaw humans, always fighting for her survival and freedom.  Will she be punished by the cat gods? Will Scarab Razorclaw find her? And can she retain her freedom in the strange world of the Bluntpaws?  Hundreds of pairs of eyes glowed, unblinking, all directed to their queen. The Daughter’s Eye shone brightly, fully open, her reflection rippling in the waves. The sea was calm tonight, the air hot and still, the sand dry under their paws. Mice scuttled in the shadows, but the cats made no move to catch them. It was a perfect time to hunt, but tonight they would all go hungry...  Don't miss Book 1 in the NEW Children of the Wild Cats trilogy: Kitten Adventure.  Kids and cat lovers of all ages will enjoy this action-packed adventure filled with suspense, friendship and adventure.  Perfect for fans of Erin Hunter's 'Warriors' and 'Survivors' series. Age: 9yrs+ Upper Middle Grade/Tween/Young Teen adventure.  Fantastic story with fascinating characters! It's full of wonder and adventure for kids and even some wit that adults can enjoy! For anyone looking for something refreshing and new (not to mention cheap) to read, this book is a great choice. The characters are intriguing and the plot keeps a good pace all throughout, I could barely put it down.  - - Bryan Bartlett, Amazon Reviewer  A WONDERFUL ADVENTURE Amazing story! The author takes the reader into the world of cats, deep inside the world of feral cats. The characters are interesting and wild. But some of the cats want to go live with the humans and live a life of domestication, but this is discouraged in the feral cat world. But Hattie is curious and daring. Fascinating read that takes you on a journey full of contrasts and survival.  - - BOOK CZAR, Amazon Reviewer  If you love cats you'll adore Children of the Wild Cats by Lily Pickles. Anyone who knows cats will have tried to imagine this world and I have to say that the depiction of the atmosphere and cat-cat and cat-human interactions ring true (to my imagination and observation at least). The way it ends up made me really want to see what happens next (which we get a taste of in Chapter 1 of the next instalment, ‘ Led Astray’). I strongly recommend it to cat lovers of all ages.  - - Mrs M Main, Amazon Reviewer  OMGGGG BEST THING EVARRRR I absolutely love this book. If you've read Warrior Cats by Erin Hunter, you'll love this and notice it's much more realistic in terms of the cat's behavior and instinct. This book really deserves its own fandom!!! - - Lindsay Britten, Amazon Reviewer  What a lovely story, so full of heart. I highly recommend this read for all of those in search of a pick-me-up, feel good, time.",
  "genres": [
    "Cats"
  ],
  "author": "Lily Pickles",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/24082000-children-of-the-wild-cats-1"
}