{
  "title": "Nobody's Child Anymore: Grieving, Caring and Comforting When Parents Die",
  "description": "As longevity expands so too does the reality that increasing numbers of people become Nobody's Child Anymore. Unlike most books on grieving the loss of a parent, Barbara Bartocci takes a comprehensive approach from caring for a dying parent through finding new meaning beyond grief. Barbara Bartocci, who has lost both of her parents, speaks from experience and offers poignant vignettes approaching hard questions with compassion and a wealth of practical wisdom. Nobody's Child Anymore is an immensely helpful and comforting resource for anyone caring for a dying parent, mourning the loss, caring for the remaining parent and seeking new meaning beyond grief. Introduction When our parents die and we are adults, we're expected to say, This is an appropriate death. My father . . . my mother . . . lived a full life. It is their time. I'm okay with that. But we are not okay with it. Losing a parent--at any age--is a profound loss. It is such a primal connection, that of parent and child. No matter what your age, no matter what the circumstances of your rearing, no matter how loving or how lethal your relationship, it's impossible to completely ignore the people who gave you life. You can divorce a spouse but not your parents. There is that ultimate tie--the genetic inheritance that somehow entwines us no matter how hard we may try to disconnect. As society ages, and more people experience this inevitable passage, people are beginning to realize that it's not an easy loss just because your parents are in their 60s, 70s, 80s, or even 90s. I was surprised at the depth of my pain when my parents died. And since there isn't yet a lot of cultural support when adults lose their parents, I had to feel my way, as if walking through an unfamiliar forest. I have written this book as a gentle guide through the forest of feelings you may be encountering. It is not a practical manual--turn to other sources for help in planning a funeral or settling an estate. Rather, I share my own experience and the thoughts and experiences of others as a source to ease your soul-pain. The four parts of this book parallel the four-fold experience of loss through which we pass. It begins when we are called upon to care for one of our parents and we come to the difficult realization that Mom or Dad is dying. Then, after the loss, we struggle with the pain of our grief and perhaps some unresolved issues in our relationship with our parents. At the same time, we are often called upon to offer comfort and support to our surviving parent. We may then lose a second parent and experience the special pain of becoming an adult \"orphan.\" Grieving is a process that has its own time. But eventually, we come to some resolution of our pain and we complete our grief. I have learned that there is a special light that may come in the wake of our parents' leaving. I discovered, as you will, too, that in a deeper sense, our parents don't leave us. They become part of us. A SORIN BOOKS Publication Distributed by Ave Maria Press",
  "genres": [
    "Grief",
    "Nonfiction",
    "Self Help"
  ],
  "author": "Barbara Bartocci",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/114690.Nobody_s_Child_Anymore"
}