{
  "title": "Kirinyaga",
  "description": "Hailed for his grandeur of imagination and superb worldbuilding, winner of and nominee for more than fifty awards for his outstanding work, Mike Resnick has rightfully won a place as one of science fiction's master storytellers. Now, in Kirinyaga, Resnick presents the haunting and utterly compelling tale of one man's utopia.By the twentieth second century in the African nation of Kenya, polluted cities sprawl up the flanks of sacred Mount Kirinyaga. Great animal herds are but distant memories. European crops now grow on the sweeping savannas. But Koriba, a distinguished, educated man of Kikuyu ancestry, knows that life was different for his people centuries ago--and he is determined to build a utopian colony, not on earth, but on the terraformed planetoid he proudly names Kirinyaga.As the mundumugu--witch doctor--Koriba leads the colonists. Reinstating the ancient customs and stringent laws of the Kikuyu people, he alone decides their fate. He must face many challenges to the struggling colony's from a brilliant young girl whose radiant intellect could threaten their traditional ways to the interference of \"Maintenance\" which holds the power to revoke the colony's charter. All the while, only Koriba--unbeknownst to his people--maintains the computer link to the rest of humanity.Ironically, the Kirinyaga experiment threatens to collapse--not from violence or greed--but from humankind's insatiable desire for knowledge. The Kikuyu people can no more stand still in time than their planet can stop revolving around its sun.Deeply moving, swiftly paced, and profound in its implications, Kirinyaga is Mike Resnick's most triumphant work to date. His Fable of Utopia is the book every science fiction reader will want to own and savor for years to come.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Short Stories",
    "Fantasy",
    "Africa",
    "Utopia",
    "Science Fiction Fantasy"
  ],
  "author": "Mike Resnick",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/2408155.Kirinyaga"
}