{
  "title": "Време разделно",
  "description": "В тази книга са събрани и подредени записките на двама души — на светогорски монах, наричан поп Алигорко, и на френски дворянин, пленен при Кандия и приел исляма, наричан Венецианеца. И двамата съвременници описват едно и също събитие — разорението и помохамеданчването на родопската долина Елинденя през лятото на 1668 година. Поп Алигорко го е гледал откъм страната на българските родопчани. Венецианеца — от страната на турците. Много пъти и двамата описват една и съща случка и ясно се вижда как различните гледни точки и различното осветление променят очертанията на събитията. Тия повторни, макар и различни, описания почти винаги са избягвани, за да намери място само това от тях, което е по-пълно и по-обективно. Двата ръкописа са преведени и преработени. Записките на поп Алигорко са написани на чудновата смесица от черковнославянски книжовен език и родопски говор. Венецианеца е писал на френски. Повече съкращения са правени в записките на Венецианеца, защото, макар и някъде да се е мъчил да изтегли на заден план собствените си преживявания, другаде той доста често говори за себе си. Съкратени са и разсъжденията му върху насилието, промяната на убеждения и вяра, кръвното родство и духовното братство между хората и върху други подобни проблеми. Поп Алигорко, обратно, по всички начини се мъчи да избегне думата „аз“ и в някои части на записките говори за себе си в трето лице. Целта на преработката беше двете съставки на книгата да се приближат по дух и език, за да не се чувствува така рязко двойното авторство. А целта на книгата най-добре е изразена от летописците — да не позволи да се изличат от паметта на потомците делата и подвизите на ония силни люде, живели триста години преди нас по великата Родопа. Преди всеки откъс от летописа на поп Алигорко има няколко реда от народна песен, и тя намерена в записките му.",
  "genres": [
    "Bulgarian Literature",
    "Historical Fiction",
    "Classics",
    "Bulgaria",
    "Fiction",
    "Historical",
    "School"
  ],
  "author": "Anton Donchev",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/24105786"
}