{
  "title": "شهرنان",
  "description": "الرواية تنتمي لنوعية أدب الحرب والرومانسية؛ موضوعها الأساسي الخيانة بمختلف أشكالها، تدور أحداثها بين لبنان والأردن؛ بين شخصيات فلسطينية وأردنية ولبنانية، تصف أحداث حقيقية؛ في فترة زمنية خصبة مليئة بالأحداث السياسية، بالإضافة لجانب التشويق والمتعة التي يتيحها الجانب الجاسوسي في العمل.وتدور أحداث الرواية جزء أول في الأردن وتحكي عن عائشة فتاة لبنانية فلسطينية خلال فترة حرب أيلول الأسود، ثم فرارها واستقرارها في الجنوب اللبناني الزاخر بالأحداث هو أيضا؛ حيث تبدأ أحداث القصة الثانية الخاصة بالجاسوس اللبناني.يتخلل الأحداث سرد لمجموعة من قصص الحب في شكل حلقات مسلسلة لبرنامج إذاعي تتابعه البطلة.أحداث حوَّلتني من طفلة مشاكسة عنيد تبلغ الرابعة عشرة، إلى أنثى في العشرين من عمرها هادئة كسول، لا هدف لها بالحياة.سنوات عجاف عشتُ منها سنتين وسط أجواء حرب أهلية، كنت بقمَّة بؤسي فيها، ثم ثلاث سنوات أخرى كل ما أفعله هو كتابة كل ما أتَذَكَّرهُ أو يمر بي من أحداث، أدوِّن ما أسمعه من أصدقائنا القدامى، الذين يأتون أحيانًا للاطمئنان على أحوالنا، ومن أقاويل الجيران القادمين للزيارة أو لتسلم ما حاكته أمي لهم من ملابس، أو لتبادل الأحاديث في جلسات نميمة معلنة مغلفة بدعوة لتناول كأس شاي.أُتابع ثرثرتهن عبر غرفتي.. وكيف لا؟ فمنزلي ما هو إلا غرفة أقبع بها ليل نهار، ومطبخ ودورة مياه كل منهما لا يتجاوز المترين، وصالة واسعة تحيك أمي بها الملابس للجيران نهارًا، لتنام قتيلة جواري ليلًا، ثم تعاود دورانها في ساقية الحياة باليوم التالي لتستطيع إعالتنا.بين ليلة وضحاها تبدَّل الحال، بعد أن كُنتُ «عائشة»، تلك المدللة من أبيها «عزيز» وأخيها الوحيد «جاسر» وأمها الحبيبة «حبيبة»، أعيش حياة رفاهية في عز والدي تاجر المفروشات يدوية الصنع، تحوَّلت بعد فراري مع أمي، من الأردن إلى لبنان، حيث يُقِيمُ عمي «نواف»، إلى فتاة تعيش عالة عليه وعلى مساعداته الشحيحة كل شهر أو شهرين، متعللًا بسوء الأحوال.يسأل عنَّا باقتضاب وعن أحوالنا، كأنما يخاف أن نسأله شيئًا فعليًّا، ثم يذهب إلى حال سبيله، ولولا خوفه من تعليقات الجيران وأصدقائه لتركنا دون سؤال.بعد الحادث تحوَّلت لفتاة كسول، أخاف الناس والدنيا، قابعة داخل حجرتي، تحوطني جدرانها الأربعة؛ فهي أماني الوهمي، أصبحتُ بلا هدف سوى تسجيل كل ما أراه وأسمعه في مذكراتي.نشرت إلكترونيا علي موقع #دار_حروف_منثورة#شهرنان#إنجي_مطاوعمراجعه لغويه استاذ محمد عبد الغفار#دار_حروف_منثورة_للنشر_الإلكتروني#حروف_منثورة_للنشر_الالكتروني لينك الروايه علي الموقعhttp://www.mediafire.com/file/n31027e...",
  "genres": [],
  "author": "إنجي مطاوع",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/24102165"
}