{
  "title": "Atmospheric Disturbances",
  "description": "Atmospheric Disturbances is at once a moving love story, a dark comedy, a psychological thriller, and a deeply disturbing portrait of a fracturing mind.When Dr. Leo Liebenstein’s wife disappears, she leaves behind a single, confounding clue: a woman who looks, talks, and behaves exactly like her—or almost exactly like her—and even audaciously claims to be her. While everyone else is fooled by this imposter, Leo knows better than to trust his senses in matters of the heart. Certain that the original Rema is alive and in hiding, Leo embarks on a quixotic journey to reclaim his lost love. With the help of his psychiatric patient Harvey—who believes himself to be a secret agent who can control the weather—Leo attempts to unravel the mystery of the spousal switch. His investigation leads him to the enigmatic guidance of the meteorologist Dr. Tzvi Gal-Chen, the secret workings of the Royal Academy of Meteorology in their cosmic conflict with the 49 Quantum Fathers, and the unwelcome conviction that somehow he—or maybe his wife, or maybe even Harvey—lies at the center of all these unfathomables. From the streets of New York to the southernmost reaches of Patagonia, Leo’s erratic quest becomes a test of how far he is willing to take his struggle against the seemingly uncontestable truth he knows in his heart to be false. Atmospheric Disturbances is at once a moving love story, a dark comedy, a psychological thriller, and a deeply disturbing portrait of a fracturing mind. With tremendous compassion and dazzling literary sophistication, Rivka Galchen investigates the moment of crisis when you suddenly realize that the reality you insist upon is no longer one you can accept, and the person you love has become merely the person you live with. This highly inventive debut explores the mysterious nature of human relationships, and how we spend our lives trying to weather the storms of our own making.",
  "genres": [
    "Fiction",
    "Mystery",
    "Novels",
    "Literary Fiction",
    "Book Club",
    "Contemporary",
    "Literature"
  ],
  "author": "Rivka Galchen",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/2410293.Atmospheric_Disturbances"
}