{
  "title": "The Paranoid Style in American Politics and Other Essays",
  "description": "This timely reissue of Richard Hofstadter's classic work on the fringe groups that influence American electoral politics offers an invaluable perspective on contemporary domestic affairs. In The Paranoid Style in American Politics, acclaimed historian Richard Hofstadter examines the competing forces in American political discourse and how fringe groups can influence — and derail — the larger agendas of a political party. He investigates the politics of the irrational, shedding light on how the behavior of individuals can seem out of proportion with actual political issues, and how such behavior impacts larger groups. With such other classic essays as “Free Silver and the Mind of 'Coin' Harvey” and “What Happened to the Antitrust Movement?”, The Paranoid Style in American Politics remains both a seminal text of political history and a vital analysis of the ways in which political groups function in the United States.\"Recent months have witnessed an attack of unprecedented passion and ferocity against the national government. The Republican Party has apparently embarked on a crusade to destroy national standards, national projects, and national regulations and to transfer domestic governing authority from the national government to the states. A near majority of the Supreme Court even seems to want to replace the Constitution by the Articles of Confederation…\"Unbridled rhetoric is having consequences far beyond anything that antigovernment politicians intend. The flow of angry words seems to have activated and in a sense legitimized what the historian Richard Hofstadter called the 'paranoid strain' in American politics.\" - Arthur Schlesinger, Jr., Wall Street Journal, June 7, 1995",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "Essays",
    "American History",
    "Philosophy",
    "Political Science"
  ],
  "author": "Richard Hofstadter",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/241061.The_Paranoid_Style_in_American_Politics_and_Other_Essays"
}