{
  "title": "Need Me",
  "description": "New York Times and USA Today best-selling author Cynthia Eden offers readers a new \"Dark Obsession\" romantic suspense tale...NEED ME.  Innocent…or guilty?  The cops think that Julianna Smith is a murderer. No one will listen when Julianna claims she’s innocent, and as the suspicions mount against her, only Julianna knows the truth…a killer is hunting her. Somewhere in the darkness, a stalker is closing in and preparing to deliver a final justice that she can’t escape.  He’s her only option.  Devlin Shade isn’t a man who trusts easily, and when Julianna Smith walks into VJS Protection, he’s well aware of her reputation—the sexy blond could be a cold-blooded murderer. Only when he looks at her, cold is the last thing that Devlin feels. There’s an instant attraction between them—hot, fierce, primal. And he agrees to take her case. He’ll be her bodyguard. He’ll keep her safe from the enemy hunting her, and he’ll also find out the truth about the mysterious Julianna. If she is a killer, he’ll turn her over to the cops himself.  She can’t let him get too close…  Julianna knows that she is walking a dangerous line with Devlin. She never expected to want him so much, and as they grow closer, she realizes that he’s working to uncover her secrets. But the secrets that she carries are worth killing for…and she can’t let anyone discover the truth, not even Devlin.  Killer or victim…  Soon the thin line between right and wrong is blurred. For Devlin, the case becomes personal, and all that matters is Julianna—keeping her safe and stopping the stalker who is on her trail. As he slides deeper into Julianna’s dangerous world, Devlin’s own darkness rises up. He’s played the good guy for so long, but now his mask is falling away. He isn’t controlled, he isn’t safe, and when Julianna is threatened, he will cross any line to keep her safe.  NEED ME.  Some needs can push you to the edge of sanity…  Author's NEED ME is a stand-alone novel.  Other \"Dark Obsession\"  WATCH ME - Book 1 WANT ME - Book 2",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Contemporary",
    "Adult",
    "Mystery",
    "Contemporary Romance"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/24108937-need-me"
}