{
  "title": "614 Scarlet Ct.",
  "description": "Drake Henry was a junior at Winding Heights High School in Austin, Texas. Legendary for his tennis accomplishments, he was the most popular kid at school. Drake lived with his adoring parents, Ivan and Emily, his sister Briar, a brainiac freshman, and his spoiled baby sister Ella. The Henrys were a loving and supportive family and Austin had always been their home.Drake’s father, a forensic scientist, received a serious death threat from a notorious murder suspect and immediately relocated the family to the small town of Shady Oaks. Fearing change, Drake and Briar were anything but pleased to leave their hometown.As the teens pulled up to their new home at 614 Scarlet Court, they were more than thrilled with the stately manor, feeling as royalty among the tattered buildings of the surrounding town. That is, until unexplainable, atrocious happenings transpired. Drake’s well-regarded tennis career fell into shambles as a notorious bully made his life a pure living hell. The days progressively worsened for the Henry family as their most terrifying fears manifested one by one.The Henry family's horror continued as a mysterious murder ensued followed by a nightmarish kidnapping. All fingers pointed to one of the Henrys but Drake’s eye was on a peculiar townsperson. Drake’s second theory was that the house at 614 Scarlet Court might have been the source of evil and chaos. The pieces of the baffling puzzle did not fit and alarmingly, the Shady Oaks police officers seemed disinterested in the criminal and seemingly supernatural events surrounding the Henry family.An unknown force took control of Drake's parents and he immediately realized that he was running out of time to solve the shocking mysteries at 614 Scarlet Court. He had to stop whoever or whatever it was before he was alone and before it was too late.614 Scarlet Ct. is a suspense mystery thriller with an unbelievable twist ending that you will never see coming! If you are ready to take a high-energy journey full of action and intrigue, this novel's for you.",
  "genres": [],
  "author": "Bon Blossman",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/11470811-614-scarlet-ct"
}