{
  "title": "Standalones: a Collection",
  "description": "Four full length, standalone novels by Carey Heywood.  - A Bridge of Her Own -  It has been said that the hardest thing in life is to know which bridge to cross and which to burn.  Jane Martin has it all figured out. She has just graduated from college and is expecting a proposal from her boyfriend Wyatt. The night of Jane's graduation her picture perfect future dissolves in front of her eyes. In the aftermath Jane struggles to find her own way while balancing her reflex to put everyone else's feelings first.  - Uninvolved -  What happens when two commitment-phobes fall for each other?  Becka Sherwood has one man in her life, her best friend and roommate Dave. That is exactly how she wants to keep it. Becka has no problem casually dating. It's once things start to get serious that she bails. To Becka getting serious means trusting someone, and she has zero interest in making that mistake again. What about Nate is different?  - Stages of Grace -  Denial, Anger, Bargaining, Depression, Acceptance...  When facing death, a mourning period is to be expected. But what if it's not a person but a relationship that dies? Grace and her boyfriend Jon have been together for three years. They live together and have shared many beautiful memories. Those memories are what keeps Grace from admitting Jon has changed and is no longer the man she fell in love with.  - Better -  Aubrey is embarking on a bucket list trip around the world, the last wish of her Aunt Ally. It was supposed to be the trip Ally would take when she got better. Now it's just a chance for Aubrey to say goodbye. Adam escapes in his solo trips overseas, working just enough to fund the next one. When the opportunity to circle the globe falls in his lap he can't refuse. The only catch, he won't be traveling alone this time.",
  "genres": [],
  "author": "Carey Heywood",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/24108950-standalones"
}