{
  "title": "How I Fly",
  "description": "*What if it’s time to move on?*Over six months after an accident that broke her legs as well as removed her boyfriend from her life—because Cam Campbell left town and dumped her—high school senior, Ellen Foster, wants to move past her broken heart. She’s off to attend a summer photography workshop at a real university along with her best friends. Ellen’s determined to find a new love—or at least a summer boyfriend. In the dorm, she meets Harrison Shaw. He’s a handsome photography student, a charmer who likes her, and a perfect way to forget her past. *What if it all goes perfectly?* Ellen thinks she has everything she wants. Her summer program couldn’t be better. She’s half in love with Harrison Shaw, and she’s going after her next scholarship. But when she kisses Harrison, she can only remember how Cam Campbell used kiss her better, sweeter, and how he used to make her feel like she could fly…*What if something’s not right?* When Cam shows up at the university it’s a shock, especially to Ellen’s new boyfriend. Cam’s distant, different and very afraid to hurt Ellen again. He asks Ellen if they could be friends despite the past and how they’ve both changed and Ellen agrees. But after all they’ve been through, can Cam and Ellen ever be just friends? *What if...?* Editorial Description:How I Fall, is the first book, bestselling, high school romance series ending with: How I Fly. Though they can be read as stand-alone-it is recommended readers read this book first. The series is about friendship, boyfriends, taking risks and first love. There’s a photographer heroine who has left-sided cerebral palsy (hemiparesis) that makes her weak on one side and she falls often; all while she’s falling deeply in love with football jock, Cam Campbell. A guy who also dreams to be a photographer like Ellen but can't because of his parents’ controlling rules.",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary",
    "Young Adult Romance",
    "Audiobook",
    "Fiction",
    "Amazon"
  ],
  "author": "Anne  Eliot",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/24110210-how-i-fly"
}