{
  "title": "Accidental Theft",
  "description": "PART 1: Shifter/Vampire Serial Stolen by the Alpha Wolf is a follow on to Chosen by the Vampire Kings. I strongly recommend that you read this 6 part serial first.  The arrogant vampire kings have always proclaimed themselves to be the rulers of all the non-humans making war between the species inevitable. In order to win, it is imperative that the shifters steal the chosen human female. The alpha wolf will take her for himself thus weakening the position of the bastard kings. No heirs means no future for the vampires.  Something Ward didn't bank on was that the yellow bellied elves would turn tail forcing the wolves to flee or face defeat.  In desperation, one of Ward's pack members grabs a female vampire taking her with him to the wolves’ hideout deep in the mountains. The alpha is forced to take responsibility of the female until the dust settles...there are things that she may not find out about the shifters...things that would put them at further disadvantage against the vampires. In a few short days he’ll take her back to Sweetwater himself. It soon becomes clear that being in such close proximity to this refined, delicately beautiful creature is pure torture. A few days suddenly feels like a lifetime. How he longs to be able to get under her skin and make her lose a little bit of that ironclad control she’s so desperate to hold onto. It doesn’t help that some of the shifters want her dead whilst others wouldn’t mind taking her for themselves. Shifter females are in short supply.  Stephany watches her estranged mate being struck with arrow after silver tipped arrow while she is dragged away by one of the enemy. Lance falls to his knees, dying from his wounds, just as Stephany is knocked unconscious. After accidentally mating Lance twenty years ago, she has remained celibate ever since. So long she no longer even craves the touch of another, so long she doesn’t even go into heat anymore. Forced to remain at the alphas side, her resolve is sorely tested. Suddenly she's feeling things she shouldn't be feeling, her own body is betraying her in worst of ways. She needs to stay strong. Especially since Ward is a wolf and she vampire...sworn enemies.  Accidental Theft is Part 1 of a 3 part serial and is approximately 26,000 words/104 pages. Make sure you read Chosen by the Vampire Kings first for the most enjoyment. The Story Contains strong sexual themes/language and is not intended for readers under the age of 18.",
  "genres": [],
  "author": "Charlene Hartnady",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/24128061-accidental-theft"
}