{
  "title": "She Plays His Tune:",
  "description": "This is your classic blackmail story. Karen is the daughter-in-law of Lucas a man she despises. He is going out of his way to send Nick her husband away for work meetings most weeks. This week he was supposed to be a week he stayed at home. However she was woken by him packing a suitcase very early Monday morning.She is fuming in disgust that her father in law would keep sending his son away every week. She see her neighbour Justin out in his yard and waves to get his attention and holds up a cup of coffee offering him one. Justin never let her down and would always lend an ear for to vent her disgust.However, this time when she leans in to offer him a hug for his friendship He takes it a little further than he should have. That's where her problem started that day as Lucas was out side looking in through the side panels in the door.Lucas has always craved after her and seizes on the opertunity presented. He bangs on the door and frightens them both in the midst of a deep passionate kiss. Justin bolts out the back door as Karen takes her time answering the door.She opens the door to a ranting Lucas and she is confronted with his accusation from the get go. The resulting exchanges results in her giving into his demands a little bit at a time until she is standing naked in front of him.The inevitable happens and he drags her into her bedroom and fucks her hard savage and roughly. Releasing over six months of cravings for her. She is surprised at how her body surrenders to him and the pounding he is giving her. She ends up enjoying it way more than she should have.The story covers humiliation, spanking, strapping, deepthroating, and hard rough sex with a penis that she was amazed her small pussy could take.He is just staring down at me, stroking my hair. Then he lets his finger trail down my shoulder to my breast. I start to move away, then think better of it. “That's not going to happen, Karen. You are like a little bitch on heat and I can smell you.”I start quivering at the thought of what he is going to do to me. I know, I can just protest, and then face Nick. When I tell him, he will understand what happened. At least I hope he will. However, with all Lucas’s groping and innuendos, over the last six months, there is something else at play here. Something I have no control over and yet something I want. Why did the bastard show up at my door anyway.“If you really want to keep this between us, you will need to do exactly, what I tell you, and when I tell you.”I feel my shoulders slump. Knowing I will have to do what he is asking; if I want to keep him quiet. I’m hoping it will not go too far. My docile manner and my body language, must have told him I’m willing to play along with him. Next thing I know, he moves closer. He begins squeezing my small but firm breast.“That's it, sweetheart. There's no reason at all to get Nick upset. Let's work this out ourselves.”His other hand reaches behind me; grasping my hair, he pulls down, tilting my head up. He bends down and presses his lips to mine, slipping his tongue forward and into my mouth. The sensation of my soft lips on his must have been enjoyable. He moans out his satisfaction. I guess the gratification of having me, his daughter-in-law in his embrace.When he forces his mouth down on mine, I’m thinking it best not to resist. His tongue invades my mouth, and his hand begins squeezing my small breast tighter and tighter. As his tongue works frantically in my mouth. I notice my tongue beginning to respond, despite my repulsion of him, forcing me into this situation. I let out a moan as his fingers find my hard nipple, and he begins to squeeze it. Then I can feel him rolling it back and forth. Then my nipple swells and stands out. I know it looks like the head of an eraser standing out on the tip of my breast.",
  "genres": [],
  "author": "Misty Lane",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/24148444-she-plays-his-tune"
}