{
  "title": "Psychic Storm",
  "description": "PSYCHIC STORM: Ten Dangerously Sexy Tales of Psychic Witches, Vampires, Mediums, Empaths and SeersTen books. Ten internationally bestselling authors. Ten different tales of sexy psychics, empaths and seers who solve crimes, fall in love, make magic and fight to save the world.Over 2,000 pages of extrasensory reading await, with three brand new, original novels and over 1,400 5-Star Reviews for the rest!From Bestselling Author, HEATHER TOPHAM WOOD –– NEW REVELATIONS –– Life should’ve been perfect. Kate Edwards won the heart of police detective Jared Corbett and is coming to terms with her psychic ability. Things are blissful—until the day she meets Declan Brayden. Kate doesn’t trust the damaged and arrogant seer, but knows combining their abilities would allow her to help more people. When visions of a missing fitness instructor turn into a race against time to save her life, Kate might have no choice. HEAT LEVEL: 2From Bestselling author, APRIL AASHEIM –– ARMAND –– \"Never trust a warlock…” Before Maggie Maddock and her sisters returned to Dark Root, Oregon, a generation of witches and warlocks reigned over The Council -- 13 men and women devoted to holding back the dark they believed would eventually end the world. This is the origin story of Dark Root's most notorious warlock: Armand. HEAT LEVEL: 2From USA TODAY bestselling author, DALE MAYER –– TUESDAY’S CHILD –– What she doesn't want...is exactly what he needs. Shunned and ridiculed all her life for something she can't control, Samantha Blair hides her psychic abilities and lives on the fringes of society. Against her will, however, she's tapped into a killer--or rather, his victims. Sam knows she must go to the authorities, but will the rugged, no-nonsense detective in charge of tracking down the killer believe her? HEAT LEVEL: 3From bestselling author, JESI LEA RYAN –– JUST A LITTLE NUDGE –– Marley Sexton never aspired to be a stripper. But it’s the only job that puts a dent in her mother’s medical bills. It’s also the only job where she feels justified using a little talent she calls nudging. But JC Moreno figures out Marley may have taken the nudge too far. Marley’s not big on trusting people, especially a man with a gun, a badge, and a story that doesn’t add up, but maybe they can work together to both get what they want…if they don’t end up dead. HEAT LEVEL: 3From NEW YORK TIMES and USA TODAY bestselling author DEANNA CHASE, HAUNTED ON BOURBON STREET –– Jade loves her new apartment—until a ghost joins her in the shower. When empath Jade Calhoun moves into an apartment above a strip bar on Bourbon Street, she expects life to get interesting. What she doesn't count on is making friends with an exotic dancer, attracting a powerful spirit, and developing feelings for Kane, her sexy landlord. But when the ghost moves from spooking Jade to terrorizing Pyper, the dancer, it's up to Jade to use her unique ability as an empath to save her. HEAT LEVEL: 4From bestselling author, MORGAN HANNAH MACDONALD –– SPIRITS AMONG US –– WHAT HE SEES WOULD SCARE YOU TO DEATH. Cajun bad boy and ex-FBI profiler Jon-Luc Boudreaux is in Paris hunting a serial killer. That's nothing new, neither is being haunted by the victims, but watching the murders through the killers eyes, now that's something new entirely. Jon-Luc is on the hunt for the most diabolical killer he's ever encountered, and Angela Henderson, fashion designer, is next on the killer's list. HEAT LEVEL: 4From bestselling author, JC ANDRIJESKI –– LONDON –– If there was ever a race-traitor job, this was definitely it. Revik arrives in London with a new job, a new home…and new people watching him, seemingly more than he has helping him watch the Bridge, a holy warrior hidden among humans to keep her safe from dark Seers called the Rooks. Meanwhile, in San Francisco, Allie has no idea that she’s the Bridge…or even that she’s a Seer. Then she meets Jaden. HEAT LEVEL: 4From bestselling author, JORDAN CASTILLO PRICE –– AMONG THE LIVING –– Victor Bayne, the psychic half a PsyCop team, is a gay medium more concerned with flying under the radar than making waves. He hooks up with handsome Jacob Marks, a non-psychic from an adjacent precinct at his ex-partner’s retirement party and it seems his luck has taken a turn for the better. But then a serial killer with a gruesome M.O. surfaces--and no one agrees what he looks like. HEAT LEVEL: 5From NEW YORK TIMES and USA TODAY bestselling author, C.J. ELLISSON –– VAMPIRE VACATION –– Meet Vivian. She's a 580-year-old vampire who exudes sex, has a talent for drama, and is passionate about two things: her human husband, Rafe, and their resort for the undead. Her ability to project physical illusions creates the perfect vacation spot—a dark, isolated Alaskan hideaway where visitors can have their wildest fantasies come true. The powerful vamp is put to the test when she discovers a corpse in a locked guest room minutes before the next arrivals. HEAT LEVEL: 5From bestselling author, HAZEL HUNTER –– TOUCHED –– In the world of Isabelle de Grey, eyesight isn’t the only way to see. When she touches objects and people, she looks into their past. But her gift is equal parts curse. She has yet to find the lover who can accept the brutal truth of what she sees. Isolated and rejected, she is ready to leave Los Angeles and abandon her career when she meets FBI profiler Gavin “Mac” MacMillan. Thrown together when the daughter of a mutual friend is abducted, Isabelle discovers that Mac could be the man who won’t push her away. HEAT LEVEL: 5Categories:Thriller/SuspenseRomance/Suspense",
  "genres": [
    "Anthologies",
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Mystery",
    "M M Romance",
    "Science Fiction"
  ],
  "author": "C.J. Ellisson",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/24135410-psychic-storm"
}