{
  "title": "Needing Him",
  "description": "Colton and Addison's Story One moment can change the path of your life. In that moment, you can see a new path you never knew could exist. You can see your present slowly change and morph into a future of complete happiness. You can look into someone’s eyes and see all that in a moment.  For Colt, that moment came in the form of a pair of the bluest eyes he had ever seen. Everything he thought his life was, the son he loved more than his own life, his family’s ranch and the life he built. He wanted to wrap her in his arms, breathe her in and share it all with her. He knew when his eyes met hers that day, he needed Addison to complete his life that he didn’t know was incomplete, until that moment.  In a moment, you can see your future happiness shatter right before your eyes. You can think that it was finally time for a happy ending and then it’s gone in a puff of smoke, violence, and drugs. The fear sets in and you begin to wonder if that happy you dreamed of as a little girl was in reality, a simple moment in time, which actually feels like a minute in your lifetime.  For Addison, she felt like her minute was the time she spent with Colt. In such a short time, he made her believe that all the past drama with her ex-husband, was exactly that, in the past. He had moved on. Until she gets a phone call and it puts a halt to all of the happiness she got when she moved back home and was with Colt. All she wanted was to be happy and most importantly make her daughter happy. And when she was with Colt, she had felt that connection, like she needed him.  You can search, unknowingly, your entire lifetime for a moment. Your life and all you’ve ever wanted or needed can appear in front of you, out of thin air, in a moment. Will Colt and Addison get their happily ever after?Or will their moment be just a minute in a lifetime? ****WARNING**** This book contains adult content and is intended for adults 18 and older. It contains adult language, adult situations, as well the mention of drug use and domestic violence.",
  "genres": [],
  "author": "A. Sloan",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/24131487-needing-him"
}