{
  "title": "Possibilities",
  "description": "Possibilities, is set in the turbulent 1960's, and is the story of a young woman named Nora Steele. She must face her worst fears, when she is dragged into a dark alley late at night, by abusive, would be rapist, Jason Merk. Despite the fact that she was raised in an orphanage, Nora lands a decent job just before she has to move out on her own. Her hard work and dedication pays off however, when she wins the respect of her employer, powerful Detroit Michigan defense attorney Houston Ripley, and he volunteers to pay for her college education, and then gives her an impressive promotion. Ultimately, masquerading as a newspaper reporter Nora locates her maternal grandparents, in historic Mariemont Ohio, and through them finds her mother, famous author, Amy Snider. Her life is almost perfect until Blake Baxter, on leave from the Navy, anticipating a tour in Vietnam, shows up at Jeff's party. Although he is accustomed to having his way with women, he can't get to first base with Nora Steele. Every time he turns on the charm, she insults him. The fact that she hates him, and sees him as a clumsy, annoying jerk, only intensifies his desire to win her over. Memorable characters include, Jeff Foster, an impressive and smart attorney with a perky personality, Rose, the Italian bookstore owner in Cincinnati, who works around the clock to keep her business open, Roy Rollick, the big redheaded farmer from London Kentucky who loves fat women, Laura, the orphan who dreams of becoming a doctor, Jane Goodbee, the compassionate head mistress of the Seventh Street Orphanage, Mindy Wilson, an aging heiress who is alone in the world, Samantha Tabor, the woman Blake Baxter expected to marry, and Susan, the beautiful negro paralegal that falls in love with a white man, even though her parents are over zealous in the civil rights movement.",
  "genres": [],
  "author": "Janet Sue Terry",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/2414954.Possibilities"
}