{
  "title": "ترامادول",
  "description": "ترامادولمجموعة قصصيةعدتُ بعد قليل، وكان بكتيريا مُنهمكًا في العمل، وأحضرت العِدة. قُرص بالفم لن يفيد سيحتاج لنصف ساعة على الأقل حتى يبسط يده على الوجع، فلا حل إذًا سوى إطلاق سراحه في الدم مباشرة، ليقبض على الوجع في دقيقتين. بيدي زجاجة البريل الباردة أرفعها ولا أتركها إلا فارغة، أحضر قرصين ترامادول. والحكمة. فجرعة زائدة كفيلة للقضاء عليَّ. أطحنها وبقليل من الماء تصير مُستحلبًا. أخلع بنطلوني، ثم رحتُ أبحث عن شرياني الفخذي الذي انتفخ، بعدما أبْصرَ القرصين المطحونين بدءًا للضخ. أحدِّق في المفقودين! مُبصرًا الوجع. وأتذكر حتى أبكي وأبكي وأبكي، ثمَّة عينين كنتُ أعدُّهما بحيرتين من عسلٍ مُصفَّى، تمنيت المُكوث فيهما طيلة العمر، وثمَّة درب مليء بكِ كنتُ أسير فيه محمَّلاً بالأماني والأحلام، وأنا أغني وأغني وأغني على وقع خطواتك يا نجوى، فويلٌ لنا من الحياة ستذيقنا مرارتها في كل آن. غرستُ سن السرنجة، وسحبتُ بعضًا من الدم فيها ليختلط مع المستحلب، ثم.. بدأتُ الضخ ببطء. حين بدأ الدواء يسري في الشريان، هي دقائق قليلة وكان ألم كليتي قد كف عن ضربه المُبرح. أعلمُ أن كليتي قد صارت قطعة خُردة، وآن الوقت لانتزاعها، لكن غير مُهم. سأتجرع الوجع حينًا، وأروِّده حينًا، مُتحملاً الوقت المتبقي، ريثما أتقيأ كل ألمي في أفواههم********عن الكاتب************محمد محمد فهمي الزحاف* دكتور صيدلي، تخرج في كلية الصيدلة جامعة المنصورة 2012.* حاصل على البورد الأمريكي في تخصص الفارماكوثيرابي.* شارك في كتاب «حكايات» مع مجموعة من المؤلفين الصادر عن دار الحلم 2012.* شارك في كتاب «خمستاشر» الصادر عن دار حواديت 2013.* شارك في المجموعة القصصية «اللعبة» الصادرة عن اتحاد الكتَّاب 2014.* صدرت له مجموعة قصصية بعنوان «حتى يسكن العرش» عام 2012 عن دار ليلى «كيان كورب».الجوائز الأدبية:* حاز المركز الأول في مسابقة القصة القصيرة على مستوى جامعة المنصورة عام 2012 عن قصة «تعويذة علمية». * حاز جائزة مجلة العربي الكويتية وهيئة الإذاعة البريطانية الـ«بي بي سي» في القصة القصيرة على مستوى الوطن العربي عن قصة «ذكريات مُحرَّمة», التي أشادت بها الناقدة د. داليا سعودي, وقالت إنها تنبئ بموهبة.* حاز جائزة صلاح هلال الأدبية على مستوى الوطن العربي في القصة القصيرة عن قصة «العِيديَّة».* حاز جائزة مسابقة دار حواديت في القصة القصيرة على مستوى مصرعن قصة «ريشة طايرة».* حاز جائزة مسابقة الإبداع الكبرى على مستوى مصر عن قصة «الشَهد».* حاز جائزة اتحاد الكتَّاب في القصة على مستوى مصر عن قصة «بلهارسيا», التي أشاد بها الكاتب الكبير أ.يعقوب الشاروني, وأبدى رغبته في ترجمتها.* حاز جائزة ربيع مفتاح الأدبية في القصة القصيرة في دورتها الثانية على مستوى مصر عن قصة «سي مايو».للتواصل مع الكاتب:فيس بوك:https://www.facebook.com/Mohamed.Fahm...الإيميل:Dr_M.fahmy@yahoo.com",
  "genres": [],
  "author": "محمد فهمي الزحاف",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/24132533"
}