{
  "title": "Van Gogh in Love: A (not so!) romantic Van Gogh Biography",
  "description": "Van Gogh in Love tells the story of Vincent van Gogh's longing for love and family, exploring the lesser-known area of the artist's love life. Matters of love were always on Van Gogh's mind, and were inextricably linked with other aspects of his life. Van Gogh in Love focuses on Van Gogh's relationships with four striking women: his widowed cousin Kee Vos-Stricker, the prostitute Sien Hoornik, the unstable neighbor Margot Begemann and the flamboyant Parisian café-owner Agostina Segatori. As can perhaps be expected from an artist like Van Gogh, his choice of women was unconventional. He favored more mature companions, and pursued relationships with women that were considered unsuitable.Van Gogh's love affairs were frowned upon by his family, and further complicated by his lack of money. The artist's yearning for love and a family life was intimately connected with his artistic practice. A woman was important, but there is no doubt that art was the most important thing in his life.The authors quote extensively from the Van Gogh letters, allowing the reader to discover the artist's feelings about love and relationships at first hand. The book follows Van Gogh’s quest for love up until his tragic end, detailing his life-long, and ultimately unfulfilled, desire for a woman and a family. A sensitive portrayal, shedding light on the man behind the iconic paintings.Van Gogh in Love is number # 4 of the series Secrets of Van Gogh, written by Van Gogh scholar Liesbeth Heenk in a conversational, accessible manner without the use of art historical jargon. Want to read other volumes in the series Secrets of Van Gogh?  \n   #1 The 1-Hour Van Gogh Book - Complete Van Gogh Biography for Beginners \n   #2 Van Gogh's Inner Struggle - Life, Work and Mental Illness \n    #3 Van Gogh Today: Short Stories \n   #4 Van Gogh in Love - a (not so!) Romantic Van Gogh Biography \n   #5 Van Gogh and Money - The Myth of the Poor Artist \n The 1-Hour Van Gogh Book is a brief introduction to Van Gogh's fascinating life and work. If you want to gain a greater appreciation for one of the most fascinating artists of all time, this is the book for you. You will probably gain a new perspective on Van Gogh. Van Gogh’s Inner Struggle is a fascinating look into the life of a tortured genius. The letters vividly show the artist's life was no bed of roses. Van Gogh acknowledged that being an artist simply involved struggle, but he believed that one would benefit from adversity, both personally and professionally. \"No victory without a battle, no battle without suffering.\" Van Gogh Today - Short Stories contains eight short stories of lives that were touched in some way or another by the artist. They are a reflection of the power of his story, and why Van Gogh remains a timeless inspiration to us all. Van Gogh in Love is the current volume. Van Gogh and Money focuses on the artist's financial situation, a subject never explored before. Regardless of the actual amount of money he received from his brother, it becomes clear that Van Gogh was poor in the light of his ambition.\nEager to learn about this tragic and lonely genius? Grab a copy now!",
  "genres": [
    "Art"
  ],
  "author": "Nienke Bos",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/24131003-van-gogh-in-love"
}