{
  "title": "My Life as an Indian: The Story of a Red Woman and a White Man in the Lodges of the Blackfeet",
  "description": "\"A unique picture of Indian life on the plains when there was still warfare between the tribes.\" -American Review, 1907\"Describes with powerful simplicity a life so full of colour and incident that the book is assured of a place in literature.\" -The Quarterly Review 1907\"Such an intimate revelation of the domestic life of the Indian has never before been written.\" -George Bird GrinnellKnown as \"Apikuni\" to the Piegan Blackfeet, Schultz, as a young man went to the Blackfoot Country, near Fort Benton, at the head of navigation on the Mississippi River, and there, enamoured of the life, became, in fact, an Indian. For years he led their life, full of action and incident. He wins the hand of Nat-ah-ki, a squaw, who becomes his devoted wife. He goes on the chase—on the war-path—trading, farming, or fighting, as the case may be.Schultz' 1907 book \"My Life as an Indian\" is a fascinating, firsthand memoir of a his life among the Piegan Blackfeet in Montana Territory.Includes detailed accounts of religious ceremonies and customs, child-rearing, food preparation, tanning buffalo hides, war parties, raids, and much else. Of great interest to ethnologists and students of Native American history. First published in 1907, My Life as an Indian is the memoir of J. W. Schultz’s life as a young white man among the Piegan Blackfeet in the Montana Territory. Out of curiosity and in search of adventure, Schultz went west and became a trapper and trader. He was inspired by the journals of Lewis and Clark and George Catlin’s Oregon Trail, but found a wholly different source of inspiration when he met the Blackfeet and quickly settled into their lifestyle, even taking a Blackfoot woman for his wife and riding along with the men on buffalo hunts and wars with neighboring tribes.About the James Willard Schultz, or Apikuni (1859-1947) was a noted author, explorer, Glacier National Park guide, fur trader and historian of the Blackfeet Indians.Other books by this author •With the Indians in the Rockies• The Indian Boy•The Quest of the Fish-dog Skin•On The Warpath•Blackfeet Tales of Glacier National Park•Apauk-Caller of Buffalo•The Gold Cache•Bird Woman (Sacajewa) - The Guide of Lewis and Clark•Lone Bull's Mistake-A Lodgepole Chief Story•Rising Wolf-The White Blackfeet, Hugh Monroe's Story of his first year on the plains•Running Eagle-The Warrior Girl. Boston, Houghton Mifflin Company.•In the Great Apache Forest. Boston, Houghton Mifflin Company.•Dreadful River Cave. Boston, Houghton Mifflin Company.•The War-Trail Fort-Further Adventures of Thomas Fox and Pitamakan•Seizer of Eagles.•Trail of the Spanish Horse.•The Danger A Thrilling Story of the Fur-Traders.•Friends of My Life as an Indian.•Sahtaki And I.•Plumed Snake Medicine.•Questers of the Desert.•Signposts of National Park as the Indians Know It.•Sun Woman - A Novel.•William Jackson-Indian Scout.•A Son of the Navahos.•Red Crow's Brother.•In Enemy Country.•Skull Head The Terrible.•The White Beaver.•Sun God's Children.•Friends and Foes in the Rockies.•Alder Gulch Gold.•Gold Dust.•The White Buffalo Robe.•Stained Gold.•Short Bow's Big Medicine.•Blackfeet Man•Blackfeet and Buffalo",
  "genres": [
    "History",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Historical",
    "Indigenous",
    "Westerns"
  ],
  "author": "James Willard Schultz",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/24138046-my-life-as-an-indian"
}