{
  "title": "Defying Destiny",
  "description": "Louie ~Have you ever felt that there was something inside of you that you couldn't control? You just hit an imaginary limit and then it's like something takes hold of you to the point you don't even recognize yourself? Ever since I could remember, I've had a short fuse, hot temper, and was always quick to violence. But could you expect anything less? Ever since I could remember, people were always voicing their opinion of me, which was pretty much that I'd never amount to anything. I wasn't smart enough to get into college, I wasn't tough enough to be a Marine, and I would never make anything out of my life. I'd either die young or be in prison - that was my future.My dad was all I had in my life, my only constant. He always told me to turn the other cheek, that people would say or think what they wanted, but that didn't mean that it was true. My dad taught me how to fight and how to be a man. He always said in order to find out what you live for, you have to find what you'd die for. He was the only person who ever truly believed in me…until I met Harlow. But is she my reason to live and what I'd die for?Harlow ~My whole life has been a battle. I grew up in the system, bouncing from one foster home to the other. Most weren't that bad, but some of the places I was sent to was like walking through the gates of Hades. The one thing that stayed the same was that never was there a family who took me in because they actually wanted me there. It was always because they got something out of deal, which was usually money, but sometimes it was other things. They got sympathy points from the community and brownie points from the state.The only good thing in all of this was that I wasn't alone. My twin brother, Hendrix, was always beside me through everything. Even though he was only a few minutes older, he acted like he was years my senior. There was never a time that he wasn't there for me when I needed him, never a time he wasn't there to offer me words of advice or encouragement, and there was never a time he put himself before me. He always told me that even though people may judge us, that we should never do that the same. He said that life is tough for everyone, not just us. You just have to roll with the punches and wait out the storm. But what happens when life throws you in a tail spin and you lose focus of what's important in life?When Louie releases his monster and Harlow finally faces what life has thrown her way, will they both lose themselves to their anger and pain…or risk it all Defying Destiny.",
  "genres": [
    "Romance",
    "Abuse",
    "Contemporary Romance",
    "Audiobook",
    "Erotica",
    "Contemporary",
    "Amazon"
  ],
  "author": "Shelly Morgan",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/24197541-defying-destiny"
}