{
  "title": "The End of Average: How We Succeed in a World That Values Sameness",
  "description": "Each of us knows we’re different. We’re a little taller or shorter than the average, our salary is a bit higher or lower than the average, and we wonder about who it is that is buying the average-priced home. All around us, we think, are the average people—with the average height, the average salary and the average house.But the average doesn’t just influence how we see ourselves—our entire social system has been built around this average-size-fits-all model. Schools are designed for the average student. Healthcare is designed for the average patient. Employers try to fill average job descriptions with employees on an average career trajectory. Our government implements programs and initiatives to serve the average person. For more than a century, we’ve believed that the best way to run our institutions is by focusing on the average person. But when you actually drill down into the numbers, you find an amazing fact: no one is average—which means that our society built for everyone is actually serving no one.In the 1950s, the American Air Force found itself with a massive problem—performance in expensive, custom-made planes was suffering terribly, with crashes peaking at seventeen in a single day. Since the state-of-the-art planes they were flying had been meticulously crafted to fit the average pilot, pilot error was assumed to be at fault. Until, that is, the Air Force investigated just how many of their pilots were actually average. The shocking answer: out of thousands of active-duty pilots, exactly zero were average. Not one. This discovery led to simple solutions (like adjustable seats) that dramatically reduced accidents, improved performance, and expanded the pool of potential pilots. It also led to a huge change in thinking: planes didn’t need to be designed for everyone—they needed to be designed so they could adapt to suit the individual flying them.The End of Average shows how success lies in customizing to our individual needs in all aspects of our lives, from the way we mark tests to the medical treatment we receive. Using principles from The Science of the Individual, it shows how we can break down the average to create individualized success that benefits everyone in the long run. It's time we stopped settling for average, and in The End of Average, Todd Rose will show you how.",
  "genres": [
    "Nonfiction",
    "Education",
    "Psychology",
    "Business",
    "Self Help",
    "Science",
    "Personal Development"
  ],
  "author": "Todd Rose",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/24186666-the-end-of-average"
}