{
  "title": "Victoria The Queen: An Intimate Biography of the Woman Who Ruled an Empire",
  "description": "The true story for fans of the PBS Masterpiece series Victoria, this page-turning biography reveals the real woman behind the myth: a bold, glamorous, unbreakable queen--a Victoria for our times. Drawing on previously unpublished papers, this stunning new portrait is a story of love and heartbreak, of devotion and grief, of strength and resilience.NAMED ONE OF THE BEST BOOKS OF THE YEAR BYTHE NEW YORK TIMES - ESQUIRE - THE CHICAGO PUBLIC LIBRARY \"Victoria the Queen, Julia Baird's exquisitely wrought and meticulously researched biography, brushes the dusty myth off this extraordinary monarch.\"--The New York Times Book Review (Editor's Choice) When Victoria was born, in 1819, the world was a very different place. Revolution would threaten many of Europe's monarchies in the coming decades. In Britain, a generation of royals had indulged their whims at the public's expense, and republican sentiment was growing. The Industrial Revolution was transforming the landscape, and the British Empire was commanding ever larger tracts of the globe. In a world where women were often powerless, during a century roiling with change, Victoria went on to rule the most powerful country on earth with a decisive hand. Fifth in line to the throne at the time of her birth, Victoria was an ordinary woman thrust into an extraordinary role. As a girl, she defied her mother's meddling and an adviser's bullying, forging an iron will of her own. As a teenage queen, she eagerly grasped the crown and relished the freedom it brought her. At twenty, she fell passionately in love with Prince Albert of Saxe-Coburg and Gotha, eventually giving birth to nine children. She loved sex and delighted in power. She was outspoken with her ministers, overstepping conventional boundaries and asserting her opinions. After the death of her adored Albert, she began a controversial, intimate relationship with her servant John Brown. She survived eight assassination attempts over the course of her lifetime. And as science, technology, and democracy were dramatically reshaping the world, Victoria was a symbol of steadfastness and security--queen of a quarter of the world's population at the height of the British Empire's reach. Drawing on sources that include fresh revelations about Victoria's relationship with John Brown, Julia Baird brings vividly to life the fascinating story of a woman who struggled with so many of the things we do today: balancing work and family, raising children, navigating marital strife, losing parents, combating anxiety and self-doubt, finding an identity, searching for meaning.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Historical",
    "Biography Memoir",
    "Audiobook",
    "British Literature"
  ],
  "author": "Julia Baird",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/24212581-victoria-the-queen"
}