{
  "title": "Of 2 Minds: The Growing Disorder in American Psychiatry",
  "description": "Is the fight between cures worse than the disease? The fairly comfortable truce between psychotherapy and drug treatment for mental illness started eroding a few years ago, when the latter's bottom-line efficiency made it the preferred option for HMOs and many other health care providers. The often-sharp division between these two methods is highlighted in Of Two Minds, an insightful anthropological assessment of psychiatric training in America by University of California-San Diego's T.M. Luhrmann. She studied with psychiatrists in training, visited inpatient and outpatient facilities, and interviewed scores of doctors and patients to reveal the craft of a strange and misunderstood profession. Neither opponents nor defenders of the mental health establishment will find unqualified support from the author's careful evaluation. While she states from experience that she believes mental illness is real and in many cases of biological origin, she also despairs at the divide between research and treatment. Luhrmann is strongly sympathetic with her subjects, whether physicians, patients, or instructors. She paints a portrait of harrowing training for young doctors and hellish experiences before, during, and after treatment for those seeking relief. She does find much to recommend both drug and talk therapies, though current research suggests that combining them is more effective for more patients than either one alone. In closing, Luhrmann warns that we are in danger of dehumanizing the mentally ill by emphasizing cost-effective pharmaceutical management of symptoms over interpersonal relationships. Of Two Minds has the depth and complexity necessary to match its subject and the warmth to reach its readers. It's essential reading for anyone involved or interested in mental health. --Rob Lightner",
  "genres": [
    "Psychology",
    "Anthropology",
    "Nonfiction",
    "Psychiatry",
    "Ethnography",
    "Science",
    "Medicine"
  ],
  "author": "T.M. Luhrmann",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/1147490.Of_2_Minds"
}