{
  "title": "Loyalties: A Novel of World War II",
  "description": "New York Times bestselling author Thomas Fleming tells a haunting love story set against of the more perplexing and least explored chapters of World War II.  In Berlin, Berthe von Hoffman dreams of an angel in the depths, embracing her husband's submarine – and remembers Kristallnacht, when Hitler declared all-out war on the Jews. The stench of evil in that memory draws her to the headquarters of Admiral Wilhelm Canaris, enigmatic head of the German secret service – and guiding spirit of the Schwarze Kapelle, the circle of courageous men and women who comprise the secret dangerous resistance to Nazism.  Aboard the USS Spencer Lewis off Iceland, Lieutenant Commander Jonathan Trumbull Talbot is denouncing President Franklin D. Roosevelt's unconstitutional undeclared war against Germany when a torpedo fired by Berthe's husband, Kapitanleutnant Ernst von Hoffmann, cut the destroyer in half. Out of this conjunction grows a tormented tangle of love and jealousy and patriotic deceit when the three meet in Spain after Pearl Harbor has catapulted American into the war.  By that time, Talbot's criticism of the president has wrecked both his naval career and his marriage to Annie Richman, daughter of a congressman whose power depends on FDR's political wizardry. When Talbot returns from Spain to urge negotiations with Canaris and other leaders of the German resistance, Annie, now a powerful journalist, becomes a player in the struggle for the mind of the intransigent, mortally ill president. At its gripping climax, Loyalties draws everyone into an anguished confrontation with the limits of patriotism and God's baffling role in the middle of human destiny.  From murderous contests between rival intelligence agencies in Spain to the labyrinthine political machinations in Washington, London, and Berlin to warfare beneath the North Atlantic, Loyalties is a dazzling mosaic of men and women caught in the crossfire of history – yet finding in the midst of destruction and chaos inexplicable glimpse of meaning and hope.",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Thomas    Fleming",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/24201935-loyalties"
}