{
  "title": "Come Back Strong: A Widow's Song",
  "description": "Gone . . . running with spirit down the middle of the road . . . a knuckle bump from her coach still fresh in her mind. Heart and soul - Come Back Strong has the heart of a bittersweet love story and the soul of an athlete's triumph. While reading this true story of a woman's unexpected journey, be prepared to smile, laugh, tear up, and cheer. First a 64 year old woman is flattened by bad news and endures a hard year - her husband’s lung cancer. Then one year later she's up again unexpectedly transformed, ninety pounds thinner and an athlete. Different than other books about life-changing events, Come Back Strong, a Widow’s Song invites the reader to follow a positive path - exercise, nutrition, friendship, challenge, and the power of endorphins. “Walking will clear your mind and lift your spirit,” she told me. The story starts and ends in Presidents Park on an extremely hot Fourth of July morning. A “newly young” and strong woman is running in her community’s annual 5K. While running, she thinks about the terminal cancer journey she made with her husband, the events of a comeback journey, and changes in her life - facing hard, deserving happiness, losing “coupleness”, and having a coach for the first time in her life. “Ironic. Of all times in my life.” The heartfelt part of the book is the love story of a couple's final days together. Not sad or happy but positively happy and positively sad, a determined couple spend their days working hard to be happy in spite of the massive cancer in his chest. From the first \"it doesn't look good\" from the family doctor to the final days in palliative care, the couple lived with what the author calls a special sass (spirit, attitude, stubbornness, and strength). “We’ll fight it. Fight it hard!” Then he was gone. The author had left her own health go during the stress and dread of his sickness. She found herself sad-eyed, \"fat\", and unhealthy. A grief counselor challenged her to find the mind-body connection and use movement to quiet her mind, change her body, and pop her spirit. The clumsy non-athlete would meet an understanding but tough trainer and build an unlikely bond with the young man she laughingly names “Sheriff”. Slowly he teaches her what she needs to know and coaches her to compete as an athlete. With a touch of her special sass they work together to physically change her body and return her to happiness again. “If you embarrass me I’m out of here.” Written for those painfully aware of loss but appealing to all who like a warm story about an unlikely friendship, Come Back Strong, a Widow's Song is thoughtful, warm, and powerful. “Good to see up. Been down way too long.\"",
  "genres": [],
  "author": "Eileen McGuire Whaley",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/24218546-come-back-strong"
}