{
  "title": "Pressing Matters",
  "description": "Press for Change (founded in 1992) was a hugely successful campaign for the civil rights of transgender people in the UK — achieving in the first 12 years a string of legislative successes that included protection against discrimination in employment, the right to NHS treatment and ultimately the process for full legal recognition of transsexual people in their acquired gender in 2004.  These are the memoirs of Christine Burns MBE, one of the leading figures in that campaign until 2007. In this second volume Christine describes how Press for Change moved up a gear and challenged Britain’s Labour Government, starting in 1998. She describes how employment protections and the right for trans people to be treated on the NHS were won — culminating in the successful passage of the Gender Recognition Act.  This is no conventional trans biography, nor is it a conventional political history. Christine tells the story of a remarkably successful campaign from her personal perspective, at the centre of much of the action. Her perspectives provide valuable insights into how such a tiny campaign fought, working all the while on a minuscule budget, fought its way to the centre of Government and shaped a new Act of Parliament.  The historical perspective is backed up with extensive contemporaneous material (including her personal correspondence) written to document events as they happened. And the personal perspective is full of revealing insights into Christine's private life — reconciling the demands of work alongside campaigning  Nobody has ever before published an account of this amazing period in the development of civil rights for trans people. And few transsexual people have written in this detail about their lives and career development on the \"other side\" of the transition from one gender to the other.  This second volume covers the period from 1998 onwards — successes and failures — leading to the passage of the Gender Recognition Act in 2004.",
  "genres": [],
  "author": "Christine Burns",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/24204642-pressing-matters"
}