{
  "title": "Alice's Adventures in Wonderland and Through the Looking Glass",
  "description": "Alice's Adventures in Wonderland and Through the Looking Glass, by Lewis Carroll, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:New introductions commissioned from today's top writers and scholarsBiographies of the authorsChronologies of contemporary historical, biographical, and cultural eventsFootnotes and endnotesSelective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the workComments by other famous authorsStudy questions to challenge the reader's viewpoints and expectationsBibliographies for further readingIndices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. First published in 1865, Lewis Carroll’s Alice’s Adventures in Wonderland was an immediate success, as was its sequel, Through the Looking-Glass. Carroll’s sense of the absurd and his amazing gift for games of logic and language have secured for the Alice books an enduring spot in the hearts of both adults and children. Alice begins her adventures when she follows the frantically delayed White Rabbit down a hole into the magical world of Wonderland, where she meets a variety of wonderful creatures, including Tweedledee and Tweedledum, the Cheshire Cat, the hookah-smoking Caterpillar, the Mad Hatter, and the Queen of Hearts—who, with the help of her enchanted deck of playing cards, tricks Alice into playing a bizarre game of croquet.  Alice continues her adventures in Through the Looking-Glass, which is loosely based on a game of chess and includes Carroll’s famous poem “Jabberwocky.” Throughout her fantastic journeys, Alice retains her reason, humor, and sense of justice. She has become one of the great characters of imaginative literature, as immortal as Don Quixote, Huckleberry Finn, Captain Ahab, Sherlock Holmes, and Dorothy Gale of Kansas. Tan Lin is a writer, artist, and critic. He is the author of two books of poetry, Lotion Bullwhip Giraffe and IDM.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Classics",
    "Childrens",
    "Young Adult",
    "Literature",
    "Adventure"
  ],
  "author": "Lewis Carroll",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/24217.Alice_s_Adventures_in_Wonderland_and_Through_the_Looking_Glass"
}