{
  "title": "Cruel Devices 3: Forbidden Punishment Collection",
  "description": "Broken. Humiliated. Dominated.  Warning: This third, ultimate box set of taboo fantasies contains extreme bondage and punishment, including the use of cruel devices of torture and pain. It is highly explicit and for mature readers and lovers of forbidden temptation only!  Hot and controversial, these three final installments of J D Cirque’s best-selling ‘punishment’ books are now available in the one complete bundle ready to whip your Kindle into submission. Included stories include:  PUNISHED AT THE STAKE When untouched Elizabeth washes up on a strange beach after being shipwrecked, she thinks her troubles are over. That's until she's surrounded and taken captive by the strange natives of the island. Caged and stripped, Elizabeth soon discovers what the villagers have in store for her - a brutal ritual that will see the entire village have their way with her unblemished body, bound and punished in full at the stake.  PUNISHED ON THE JUDAS CRADLE Innocent, untouched Lucia has heard the tales of Don Gianno’s iron fist, but she doesn't feel it until her father refuses to pay his new taxes. Taken in the middle of the night and brought to the don’s stronghold, she’s about to suffer the consequences of her father’s disobedience. Don Gianno is a man who takes pride in dispensing pain. He has a special device, a Judas Cradle, just for such purposes and perfect for a nubile rose such as Lucia. Whipped, bound and suspended above the horrible pyramid, she will learn just how fleeting the line between pain and pleasure can become.  PUNISHED ON THE BREAKING WHEEL Unblemished Helga knows that now she is eighteen she must undertake the initiation that marks womanhood in her village. But the ceremony is marked by secrecy. She knows nothing until she is led into the crypt and her eyes fall upon the horror that is the breaking wheel. A village favorite for torturing criminals, Helga knows nothing good can come from being bound to the wheel, legs splayed and body exposed. As the night progresses, she will find herself deep in the throes of humiliation, naked, bound and made master to the men of the village.",
  "genres": [
    "BDSM"
  ],
  "author": "J.D. Cirque",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/24222163-cruel-devices-3"
}