{
  "title": "The Physician's Tale",
  "description": "Sweeping us from plague-ravaged Europe to the terrifying near future, acclaimed author Ann Benson brings two eras brilliantly to life. The Physician’s Tale is a spellbinding saga of two healers separated by six centuries, both facing terror and trials, bound together by history, science, and destiny.In the near future, in the hills of the American Northeast, a group of men, women, and children band together for survival against nature and human enemies, huddling in the only corner of the world they know. Among these people is Janie Crowe, a physician whose son is her greatest hope and deepest secret. Etched into Janie’s memory is the ancient journal of a Jewish man of medicine–a man who fought for survival in his own age of plague.In Europe, in the age of the Black Death, Alejandro Canches must hide his identity–and break his oath as a physician for the sake of his and his loved ones’ lives. As France and England are locked in war, and disease lays waste to both, Alejandro’s daughter Kate is caught in the clutches of King Edward of England. Betrayed by a patient, hunted by the king, Alejandro makes a desperate journey to Windsor itself, where a clever scribe named Geoffrey Chaucer has hatched a fantastic plan for Kate’s escape.... As the story of Alejandro and his family builds to a gripping climax, and as Janie’s life is racked by trials and the dawning of a new age, The Physician’s Tale brings together a rich cast of friends and lovers, traitors and healers. Unraveling mysteries of science, history, and the human heart, Ann Benson has created a stunning chronicle of courage in the face of darkness–in a work of vibrant storytelling and unrelenting suspense.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Science Fiction",
    "Historical",
    "Time Travel",
    "Suspense",
    "Romance"
  ],
  "author": "Ann  Benson",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/242302.The_Physician_s_Tale"
}