{
  "title": "Three Brothers",
  "description": "I grew up with three brothers. They weren’t tied to me by blood, but our connection went beyond genetics or bearing the same last name. Our connection was forged the summer I turned thirteen, the summer my mom ended her life and left me in the custody of John Armstrong, a man I’d never met. Packing all I owned in a couple of boxes, I left the familiarity of the big city and headed west to Red Mountain Ranch, set in a lonely valley outside of Jackson Hole.Nothing was as it seemed at Red Mountain—it didn’t take long for me to figure that out. John was kind to me but distant, as if he was afraid to let anyone get too close. His three teenage sons had their own devices for keeping love as far away as they could. The eldest distracted himself with cheap relationships that had a shelf-life of one night. The middle son threw himself into the rigor of running a ranch, and the third wielded cruelty and mind-games in his quest to keep people from getting close.Time has gone by, and I’ve spent those years trying to forget the brother I’d fallen for—the biggest mistake of my life.Finally, I’ve moved on. Finally, I’m back. But what I didn’t realize was that running away from the wrong brother meant I’d also run away from the right one. The one who’d been there for me all along, waiting in his brother’s shadow for the day I either would or could move on.But a decade is a long time to wait. Has the brother I should have chosen all of those years ago moved on too? Am I about to discover that my biggest mistake wasn’t falling in love with the wrong brother, but failing to return the love of the right one sooner?Does unrequited love have an expiration date?I’m about to find out.Author’s Note: This book is a “sweet” romance that isn’t overly sexy. Fans of Lost & Found will be interested in Three Brothers.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Contemporary Romance",
    "Westerns",
    "Drama",
    "Friends To Lovers"
  ],
  "author": "Nicole  Williams",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/24234838-three-brothers"
}