{
  "title": "Nakba: Palestine, 1948, and the Claims of Memory",
  "description": "For outside observers, current events in Israel, Gaza, and the West Bank are seldom related to the collective memory of ordinary Palestinians. But for Palestinians themselves, the iniquities of the present are experienced as a continuous replay of the injustice of the past.By focusing on memories of the Nakba or \"catastrophe\" of 1948, in which hundreds of thousands of Palestinians were dispossessed to create the state of Israel, the contributors to this volume illuminate the contemporary Palestinian experience and clarify the moral claims they make for justice and redress.The book's essays consider the ways in which Palestinians have remembered and organized themselves around the Nakba, a central trauma that continues to be refracted through Palestinian personal and collective memory. Analyzing oral histories and written narratives, poetry and cinema, personal testimony and courtroom evidence, the authors show how the continuing experience of violence, displacement, and occupation have transformed the pre-Nakba past and the land of Palestine into symbols of what has been and continues to be lost.Nakba brings to light the different ways in which Palestinians experienced and retain in memory the events of 1948. It is the first book to examine in detail how memories of Palestine's cataclysmic past are shaped by differences of class, gender, generation, and geographical location. In exploring the power of the past, the authors show the urgency of the question of memory for understanding the contested history of the present.Contributors: Lila Abu Lughod, Columbia University; Diana Keown Allan, Harvard University; Haim Bresheeth, University of East London; Rochelle Davis, Georgetown University; Samera Esmeir, University of California, Berkeley; Isabelle Humphries, University of Surrey; Lena Jayyusi, Zayed University; Laleh Khalili, SOAS, University of London; Omar Al-Qattan, filmmaker; Ahmad H. Sa'di, Ben-Gurion University; Rosemary Sayigh, Lebanon-based anthropologist; Susan Slyomovics, University of California, Los Angeles",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Essays",
    "Anthropology",
    "Historical"
  ],
  "author": "Ahmad H. Sa'di",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/242277.Nakba"
}