{
  "title": "When We Were Gods: A Novel of Cleopatra",
  "description": "\"The most complete woman ever to have existed, the most womanly woman and the most queenly queen, a person to be wondered at . . . whom dreamers find always at the end of their dreams.\"-- Theophile Gautier, 1845Arrestingly beautiful and fiercely intelligent, Cleopatra VII of Egypt was barely more than a teenager when she inherited the richest empire in the world--one that stretched from the scorching deserts of lower Egypt to the shining Mediterranean metropolis of Alexandria, with its famed libraries, storehouses, and treasuries. Imperiled at every turn by court conspiracies and Roman treachery, the young queen was forced to flee Alexandria and live in exile while a foreign army overran her city and her own siblings plotted her downfall. With nothing to lose, Cleopatra brazenly sought a partnership with the only man who could secure Egypt's safety: Julius Caesar, a wily politician and battle-hardened general with a weakness for women. The result was a passionate love affair that scandalized Rome and thrust Cleopatra into the glittering but deadly world of imperial intrigue and warfare-- a world that she would mesmerize and manipulate even after Caesar was gone.At the height of her power and fame, Cleopatra fell in love with Caesar's protégé and successor, Marc Antony, a handsome general known as much for his drunken hedonism as for his victories in  battle. Brash, irresistible, and fatally unreliable, Antony's once-strong hold on the Roman Empire was slipping fast, and with it slipped Cleopatra's fortunes. When the tide had finally, irrevocably turned against her, the proud queen plotted a last, spectacular maneuver that was to save her children, her empire, and her place in the pantheon of gods. Colin Falconer's bold, sensuous prose takes the reader inside the walls of Alexandria's great palaces and into Cleopatra's very heart, creating a vivid portrait of an unforgettable woman who thrived and triumphed in a world ruled by men. This is the story of a legendary woman's most glorious time, a story that blazes through thousands of years of history to capture the imagination of readers today.From the Hardcover edition.",
  "genres": [
    "Historical Fiction",
    "Egypt",
    "Fiction",
    "Historical",
    "Adult",
    "Mythology",
    "Romance"
  ],
  "author": "Colin Falconer",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/242353.When_We_Were_Gods"
}