{
  "title": "Huckleberry Milton",
  "description": "\"What Jackson Pollock did for painting fifty years ago, Bradley J. Milton has today done for the novel.\" -- text from early review of Huckleberry MiltonHaving made the international news in 2010 after publication of a new \"politically correct\" version of Mark Twain's Huckleberry Finn, in which the infamous and controversial \"n-word\" in Twain's classic novel had been replaced with something less offensive to today's sensibilities, now we get the full monty: business executive, former Deadhead and '80s technologist Bradley J. Milton has gone far beyond a simple one-word search-and-replace.Using his neo-retro technology, a Windows PC and a dollop of hardcore psychedelia, he brings us an entertaining work so original, new, and entirely American that it shocks with its power -- pushing the bounds of the novel with a message so unique, pressing and ultimately controversial that it may be the Finnegans Wake of our century.It's well into the second decade of the 21st century, where Osama bin Laden is dead and universal health care is coming for all -- yet it's also Evening in America, where the nation is faced with an unsolveable fiscal crisis at a time when, to the young generations, Woodstock is not even a memory ... nor is Howard Cosell, Telly Savalas, CHiPs -- or even the original Charlie's Angels, for that matter.Enter the post-pomo meta-character Huckleberry Milton as he leaves the safety of his Twitter account and cramped office cubicle and goes off on a cross-country mindquest to bring this country together, melding the forgotten pop culture of decades past with the goings-on of now, reviving the counter-culture of the Sixties, and doing it with an amalgam of DIY technology: '80s IBM PC software, 21st century future-tech, and plenty of hardcore psychedelia.Can a robotic Jerry Garcia revive the Grateful Dead, playing ad-hoc (and continuous) concerts at local shopping malls, schoolyards and Subway restaurants, jump-starting a sinking economy and leading the way to a new, highly profitable American Dream?Huck Milton -- himself a product of Burroughsian cutup technique, AI experiments, gratuitous Notepad cut-and-paste operations, and something much deeper -- shows the darkness, the fiery colors, the depth and originality of the idiot-savant mind of Bradley J. Milton.A failed concert at Altamont over 40 years ago where the Hell's Angels rough up the crowd quickly fades into Ed Wood graveyard backdrops, classic Hammer film horror scenes, Platonic dialogues between Laverne and Shirley -- shots ring out in the cold air on the campus of Kent State, just beyond some grassy knoll -- meanwhile back at the office, the new DOS 3.1 diskettes have arrived, and someone is dialing out on a modem with PROCOMM ... a mysterious figure is attempting to be the next Jim Morrison, preaching to the dot-commer kids at Height-Ashbury ... meanwhile on Twitter, delayed Morse code messages arrive from a capsized Love Boat (circa 1978), and tens of thousands of followers and members of the new 'Generation SHOP' are urging Yoko Ono to lead the new economic revolution.Fans of Hunter S. Thompson's drug-addled gonzo psychedelia, William S. Burroughs' tripped-out routines, William T. Vollman's deep weirdness, and anyone who appreciates the rare, odd humor of a mind that can blend five decades of pop culture into a musical lyric lullaby is going to love what this \"business executive\" (and former Deadhead) has conjured up: an American joyride that rockets through time, space, and several uncharted dimensions, bringing us to a crystalline happy Somewhere that we never thought we had access to.",
  "genres": [],
  "author": "Bradley J. Milton",
  "average_rating": "2.86",
  "url": "https://www.goodreads.com/book/show/11475607-huckleberry-milton"
}