{
  "title": "Dirty Girls on Top",
  "description": "The Dirty Girls are back, saucier and sexier than ever….but would it be wrong to ask them to be a little smarter, too?? Especially when it comes to men. And sex.\nLauren Fernandez is at the top of her game as the cleverest columnist the Boston Gazette has on board—but she can't quite figure out how to pick a guy or how to eat (and not drink) like a healthy person.  Usnavys is still sashaying all over town, 260 pounds of her dolled up in designer duds and ready for action—from anyone except her husband Juan, that is.  He’s become just a bit boring staying home scrubbing the tub and cooking up chicken fingers for pre-schooler Carolina while somebody else brings home the bacon. \nMaybe the other Dirty Girls could help Lauren and ‘navy out, but they've got their own messes to deal with: Rebecca Baca hasn't gained a pound since college (well, who would, if they had an ounce of self-control?) but suspects her picture-perfect marriage may not yield the baby she longs for; Sara may be the star of her own decorating show on cable television, but her dangerous pull toward her ex-husband Roberto isn't so pretty;  Amber keeps renaming herself and doesn't want to hear that her soulfulness and reinvention aren't enough to make fans actually buy her music; and Elizabeth is discovering that a relationship with another woman takes more than bravery and a nesting instinct.\nDirty Girls on Top is about trying to figure it all out without quite as much time left as there was five years ago.  And it’s about sex and love—getting it, not getting it, yearning for it, having it with the wrong person, fighting it from the right person, trying it a new way, giving up on it. And, in the end, if your fingers are crossed and the planets are in alignment, having it come out just the way it should.",
  "genres": [
    "Chick Lit",
    "Fiction",
    "Latino",
    "Romance",
    "Literature",
    "Contemporary",
    "Book Club"
  ],
  "author": "Alisa Valdes-Rodriguez",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/2422754.Dirty_Girls_on_Top"
}