{
  "title": "Discover Your Brand: A Do-It-Yourself Branding Workbook for Authors",
  "description": "Discover your brand and how to communicate it to readers with proven advice you can put into action today. Are you having a hard time condensing everything your writing represents into a neat, tidy, and easily explained package? Perhaps you’re still trying to figure out what brand means when applied to a person. Or maybe you’ve already diluted your brand so much that readers have no idea what to expect when they pick up one of your books. Discover Your Brand is here to help! In just a few hours, you will uncover an entirely new path for your writing or add more certainty to your existing path. You will learn how your ideal readers look and think, and how to excite those readers. With this guide, you will… \n   Participate in a guided branding exercise \n   Brainstorm & borrow 8 story ideas \n   Put a face to your ideal reader \n   Determine whether you need a pen name \n   Learn which writing & marketing rules are okay to break sometimes \n   Find your genre (“choose your own adventure” style!) \n   Define your brand in 3 words \n   Create an author bio & tagline \n   Form a plan for your evolving interests & abilities \n   Download 5 exclusive freebies for readers of this book \n  Our Guarantee: Tired of sifting through book marketing guides that focus more on the author’s life story than on advice you can apply to your career? Or, worse still, advice guides that are really meant for nonfiction authors and have precious little information for novelists? What about when an entire book reads as nothing more than a pitch for the author’s services or other books in his series?We’re tired of it too. Every Novel Publicity Guide to Writing & Marketing Fiction is focused on you. Whether you’re an aspiring novelist who’s still trying to figure all this out or an established novelist doing your best to stay up-to-date with the hottest marketing tactics of the day, this book will deliver tons of action-packed advice you can put into practice today. Are you ready to get started?  \n   Download now and discover your brand TODAY! \n   Scroll to the top of the page and select the BUY button.",
  "genres": [
    "Writing"
  ],
  "author": "Emlyn Chand",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/24223455-discover-your-brand"
}