{
  "title": "Not hungry, Not sleepy!",
  "description": "[Dies ist das zweite Buch in der Balu Baldauf Serie. Balu Baldauf ist eine geschäftige Junge. Er hat viele Dinge zu tun, bevor er ins Bett geht. Sein Freund ist Welt. Sie braucht zum Schlafen und Essen. Jedes Buch ist in sich abgeschlossen und kann für sich gelesen werden.Empfohlen für Kinder von 3-6 Jahren. Ein Bilderbuch mit vielen farbigen Illustrationen. Der Kinderbuch zum Lesen und Vorlesen. Dieses Buch ist ideal um es ihrem Kind vorzulesen, aber auch Leseanfänger werden Spass an den einfachen Wörtern auf jeder Seite haben.Falls Sie mehr zu den aktuellen Büchern von Ruthz SB erfahren bzw. auf dem Laufenden bleiben möchten, besuchen Sie sie doch auf Goodreads: goodreads.com/ruthz]Balu is one busy boy. He has a dozen different things to do before going to bed. Read to see how his tired and sleepy friend World gets into bed.This is the second book in the Balu Baldauf series. In this book Balu is being a brat and wont go to sleep or finish his food even though it is late into the night. On the other hand, his friend World loves to sleep and eat on time.This insightful beginner reader’s eBook will teach your child about sleeping and eating on time, time management, health, and being considerate to others. It will inspire your child to switch off lights and save energy.Your kids will enjoy cute full-color illustrations of Balu and the World. With simple text and 15 colorful illustrations, it is sure to captivate your kids' hearts.Not hungry, Not sleepy! is a sweet children's book written especially for you and your kids ages 2- 8. The story is suitable as a read aloud book for preschoolers or a self-read book for beginner readers. Although this book may be ideal for young kids, it also enjoyable for the whole family as well! Follow the entire series and look for other Balu Baldauf book titles!",
  "genres": [],
  "author": "Ruthz S.B.",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/24235872-not-hungry-not-sleepy"
}