{
  "title": "Quintessential Style: Cultivate and Communicate Your Signature Look",
  "description": "Would you like your mirror to reflect an image that makes you feel wonderful and confident - so great you can totally forget about how you look and get on with the amazing life you want to live?Quintessential Style will help you discover how to:• Communicate without uttering a word• Wear any color• Become a visual shape-shifter• Solve your fashion dilemmas using Sets of Accessories• Shop with confidence and purchase with conviction• Use \"lifestyle skincare\" to balance and maintain great skin• Remedy the two things that cause every woman to look older• Find an effortless personal style that enhances your self-confidenceYou can become your own personal stylistJoin thousands of women who have been mentored by professional image consultant, Janna Beatty, on color, design, and makeup artistry. She shares thirty-plus years of knowledge and experience, so you can learn to cultivate and communicate your authentic, one-of-a-kind style.About the AuthorJanna Beatty, owner of one of Texas' premier makeover studios, plunged into the study of image consultation when the field was still relatively new.After an education at the University of Southampton, England, Muskingum University,and the London Academy of Music and Dramatic Arts, and receiving a degree in communications, several careers followed, including news anchor for one of television's top one hundred stations. Then Janna discovered the image consulting business.Janna has studied in New York and Paris with some of the most respected advisers in the fashion and beauty industry. Her knowledge of line, color, and makeup design is unparalleled. The color system Janna has used her entire career is Color 1 Associates.Janna insists, \"After all that (study), it is the thirty years of working with my amazing clients that has taught me the most important thing -- each person is unique, with his/her own beautiful possibilities.\" www.makeovers4u.comSharon White lives and writes in Temple,Texas. Her longstanding friendship with stylist Janna Beatty inspired her to co-write a book that would capture ideas Janna has been presenting to her clients for the past thirty years, in hopes of enlightening women about the infinite possibilities for enhancing their own \"quintessential\" style.Catch their BLOG at www.qstylethebook.com",
  "genres": [
    "Fashion",
    "Nonfiction"
  ],
  "author": "Janna Beatty",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/24245605-quintessential-style"
}