{
  "title": "The Last Boy on Earth",
  "description": "\"You see, there was this boy, and he ruled the world.Everything belonged to him now. As far as his eyes could see, he was the only one left alive. You might think he was pretty upset about the whole situation and he was, for awhile. There were dead bodies and nothing but desolation and it's true that he sat around a lot and wished that he was dead, too. For a long time he wondered why he remained and all the others were taken. Then he thought, it doesn't matter. It just is. Anyway, sitting around just got boring. So he equipped himself with tools and weapons and set out with his faithful sidekick so see what there was left to see and do what there was left to do. He wasn't disappointed, because since the fall of Humanity, the world had changed in a thousand different ways too small to notice at first and some so fantastic he couldn't believe it. As the days passed into weeks, he discovered something there really are monsters in the dark.\" What if a pandemic plague struck the planet and when you woke up one morning, everyone else was dead? What if you were a fourteen year old boy with an excellent imagination and the will to survive? What if you found that something else was out there, hunting you? This is the story of Brady, a teenager who quickly discovers that although people may be scarce in the world of the Abandonment, other things are arising to take their place. He is master of all he surveys but discovers that the world has changed and that he has gained some new exciting abilities. With no adults to tell him what to do and no peers to judge him, Brady discovers that he is capable of great deeds and this is a good thing, because things long quiet are waking up from the sleep of ages. With his faithful dog, Max, and a host of non-human assistants, Brady discovers that there are monsters in the dark and that deep within his own heart, a hero dwells. This post-apocalyptic novel straddles the line between fantasy and magic surrealism and is intended for teenage audiences and beyond. Half survival tale and half magical odyssey, this is a hero's journey into the darkness of the monster's lair and back out again. Action, horror, and mystery blend together with a sense of wonder and loss at a world gone forever. If the world ended tomorrow and you were still alive, then what? In this novel, the main character decides to survive and finds that, aside from food, water and a safe place to sleep, his most necessary tool for survival is imagination and a good, sharp sword! This novel is lavishly illustrated with 50 beautifully crafted drawings by Brian Estes. The story is set in the present-day cities of Bangor and Brewer in central Maine after the advent of an airborne virus has destroyed all but a few humans on earth. Unless these people can find each other, the species is doomed to extinction. This reconnection of the few straggling survivors becomes one of the central themes of the story. Perfect for readers looking for adventure, ghosts, werewolves, and things coming to life that were never meant to do so. A ripping good tale!",
  "genres": [
    "Science Fiction"
  ],
  "author": "Thomas M. Burby",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/11476121-the-last-boy-on-earth"
}