{
  "title": "Shades of Submission: Fifty by Fifty #1",
  "description": "Fifty By Fifty: Fifty Novels by Fifty Bestselling Authors in four big boxed sets - look for the next one coming soon!These alpha males know exactly what they want, and they're going to take it, one way or another. They're hard, hungry and determined--and once they get what they want, they're not going to let go without a fight.Surrender to the power of these tales, get lost in the passion, caught up in the fever. These New York Times and USA Today bestselling authors will hypnotize, trouble and transform you.So come on in. He'll see you now.----------------------------------Still Waters by Joanna BlakeJack is the most dangerous man in the Devil's Riders MC Club. He doesn't need anyone or anything. Until he meets Janet. The feisty redhead gets under his skin, no matter how hard he pushes her away.Heidi and the Kaiser by Selena KittMousy, wannabe designer Heidi is hired as an assistant to Kaiser, CEO of one of the largest companies in the world of fashion, and her \"\"training\"\" proves to be a test of surrender.The Object of His Desire by PJ AdamsA passionate erotic romance, where scandals buried away in the past lead to murderous intrigue in the present, in the intensely steamy world of the super-wealthy and powerful.Enslaved by Artemis HuntWhen small town girl Beth Tyrell meets her new boss, the stunningly handsome and mercurial CEO, Chris Morton, she experiences a 'I want to be taken right here on your desk' desire.The Exhibitionist by Starla ColeWhen Syria is offered the opportunity to be a wealthy man's escort and exhibitionist, she must choose between him and her tumultuous relationship with a male stripper.Her Two Doms by Adriana HunterWhat happens when two dangerously obsessive men find themselves wanting more from Brooke than just her submission?Owned by Amy AdaySelena explores her sexuality with her hot literature professor, but she soon learns that he has secrets--there's another side of him that she doesn't know if she can trust.Her Wish, His Command by Malia MalloryDr. Anna Foster has admired Jonah Granger from a distance for years--and loved him as well. Anna decides to reveal her deepest secret to Jonah--her desire to be dominated by him.The Billionaire's Command by Victoria VilleneuveWhen Caroline's company wins an all expenses paid trip to Hawaii, she never imagined she'd find a man hotter than the climate. But will circumstances get in the way of their new found love?Entropy by Arden AoideJosephine Hildegard has secrets. She can't remember them. Dr. Tesla Sorelle is a brilliant cutting edge researcher comfortable in his world of medical science. Until Josephine illuminates everything.Sunsets and Kisses by Juliette JayeWhen Julia Marley wins a vacation to Grand Cayman Island, she never expects a whirlwind romance with a sexy stranger. But will they be able to make it work when they leave the island?",
  "genres": [
    "BDSM",
    "Erotica",
    "Anthologies",
    "Erotic Romance",
    "Romance"
  ],
  "author": "Selena Kitt",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/24248699-shades-of-submission"
}