{
  "title": "Accidental Valentine",
  "description": "Falling in love on Valentine's Day is the happiest of accidents.Guiding Hearts by Claire GillianDescription: Is a lonely woman's GPS sentient or is her subconscious taking her by the hand to help heal a scarred heart?When Jemma Ernst's GPS malfunctions and sends her to the home of handsome and engaging Gabriel Nash, she writes it off as a fluke. But she can't seem to reprogram him out of her thoughts nor her GPS.Better Latte Than Never by Katrina SizemoreDescription: Single and cold on Valentine’s Day, Hailey Merritt is not looking forward to working all day at the coffee shop while everyone around her is cheery with romance and she’s stuck trying to figure out her next step in life.But, when a special bouquet arrives for her from a secret admirer, she decides to reserve judgment on this holiday and find whomever sent the flowers.Maybe Cupid has a plan to make this her favorite Valentine’s Day ever.Dream Architect by S.L. HughsonDescription: Taylor and Sons Custom Design keeps ASHLIN TAYLOR at arm’s length from her dream job. If only she were a son, she could follow her architectural dream. In the Taylor creed, girls get married and boys have careers. DYLAN CUTRIGHT focuses on finishing college and landing an architectural engineering job in a large firm. Minus emotional ties.After their accidental encounter, their attraction is amplified during their work interaction. Unlike her family, Dylan encourages Ashlin to pursue her dream by enrolling in college. He even argues her case with Uncle Mike. All of this support confuses Ashlin because when she moves closer to him, he rebuffs her for reasons she can only speculate about.Valentine’s Day might be the perfect opportunity for Ashlin to make him notice her. They are working together - alone - on the most romantic day of the year. Dylan builds her dream of career, but will he ever lower his walls and become more than just the man IN her dreams?One Hot Angel by Jaylee AustinDescription: Oblivious to Tiffany Jenkins in three short weeks her life will end—unless she makes the perfect choice. Will she chose revenge and expose her ex-husband? Or chose love and surrender her heart to the only man who can save her?Rock My Bones by Wendy SparrowDescription: Jared has been eyeing the sexy mural painter from inside the museum’s paleontology lab, but she’s way out of his league. He can’t let her paint that obviously misplaced fern, though…even if it means initiating contact. You could call her a paleontology groupie, but Shay Meyers is interested in a more modern specimen. An adult male Homo Sapien to be exact—one who needs to be dragged out of his lab for a practical course in mating rituals. If she’s lucky, this will be the Valentine’s Day she rocks his bones.",
  "genres": [
    "Anthologies"
  ],
  "author": "Claire Gillian",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/24264581-accidental-valentine"
}