{
  "title": "Slumbering",
  "description": "Alternate cover edition of ASIN B00RM6325U\nA narcissistic teenager who doesn't believe in destiny. \n\nA city under supernatural attack. \n\nAn adventure that unfortunately changes everything. \nSixteen-year-old Hamilton Dinger leads a charmed life. He's got the grades for the top of the class, the abilities of a star athlete and Tetris player, and the charisma to get away with anything. Everything seems to be going along perfectly, including his plans to ask out Gwen Kessler, as he enters into tenth grade at Apollo Central High School.Everything, that is, until a meteor crashes into the city, releasing the Seven Deadly Sinisters and their leader, Orpheus, from their celestial prison, and awakening Hamilton's longtime dormant supernatural abilities. Suddenly Hamilton finds himself reluctantly allied with his self-declared mentor, Elysian, a changeling dragon, and Starry Knight, a beautiful but dangerous warrior, as they seek to protect the souls of Apollo City from the Sinisters and their evil intentions.Can Hamilton give up his self-proclaimed entitlement to happiness in order to follow the call of a duty he doesn't want? More importantly, will he willingly sacrifice all he has to find out the truth?\n\nFROM THE BOOK: \n\nAt the time, I didn't really believe that anything outside my control would change my life. Or at least, not in a significant, substantial way. My life was all about myself, and I figured I had complete control over that. Anything that happened outside of my control was more or less because I let it happen, and didn't feel like stopping it.\n\nIt's funny how one disaster of epic proportion can really make you change your mind.\n\n\nFROM THE AUTHOR: \nWelcome to the epic world of The Starlight Chronicles, a young adult fantasy series about a team of fallen Stars with supernatural powers. Follow them through this alternatively snarky and sweet series as they become their city's resident superheroes, with all the fun and frustration of dragons and swords and homework! Look for Book 2, Calling, as the battle between good and evil continues on!Perfect for young teenagers or disaffected college students, or adults who enjoy some wry humor with their reading! \n\n\nWHAT REVIEWERS ARE SAYING: \nIf you like Narnia, superhero adventures, or coming-of-age tales, definitely give this book a try. ~ Chandler Brett, author of Wolf Code5 STARS! ~ Reader's Favorite... Hamilton's inner progress toward heroism feels touchingly genuine, and there are plenty of good comic moments to keep the story moving ... Percy Jackson fans will eagerly await the next volume in the series ... A fast-paced, effective teen-paranormal outing. ~ Kirkus Reviews",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Paranormal",
    "Amazon",
    "Science Fiction",
    "Christian Fiction"
  ],
  "author": "C.S.  Johnson",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/24263233-slumbering"
}