{
  "title": "The Art and Science of Low Carbohydrate Living",
  "description": "Carbohydrate restricted diets are commonly practiced but seldom taught. As a result, doctors, dietitians, nutritionists, and nurses may have strong opinions about low carbohydrate dieting, but in many if not most cases, these views are not grounded in science. Now, whether you are a curious healthcare professional or just a connoisseur of diet information, two New York Times best selling authors provide you with the definitive resource for low carbohydrate living. Doctors Volek and Phinney share over 50 years of clinical experience using low carbohydrate diets, and together they have published more than 200 research papers and chapters on the topic. Particularly in the last decade, much has been learned about the risks associated with insulin resistance (including but not limited to metabolic syndrome, hypertension, and type-2 diabetes), and how this condition is far better controlled by carbohydrate restriction than with drugs. In this book, you will learn •Carbohydrate restriction is the proverbial ‘silver bullet’ for managing insulin resistance, metabolic syndrome and type-2 diabetes.•Restricting carbohydrate improves blood glucose and lipids while reducing inflammation, all without drugs.•Dietary saturated fat is not a demon when you are low carb adapted.•Dietary sugars and refined starches are not needed to feed your brain or fuel exercise.•Long-term success involves much more than simply cutting out carbs.•Electrolyte and mineral management are key to avoiding side effects and ensuring success.•Trading up from sugars and starches to a cornucopia of nutrient-rich, satisfying, and healthy foods is empowering.•Studying hunter-gathers’ diets provides clues to how best formulate a low carbohydrate diet.This is a great book for health-minded individuals.It is an excellent book for healthcare professionals.Best of all, it is the perfect gift for health-minded individuals to share with their doctors, dietitians, and nutritionists.",
  "genres": [
    "Health",
    "Nonfiction",
    "Nutrition",
    "Diets",
    "Food",
    "Science",
    "Self Help"
  ],
  "author": "Jeff S. Volek",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/11476367-the-art-and-science-of-low-carbohydrate-living"
}