{
  "title": "The Waking Forever Omnibus",
  "description": "The Waking Forever Omnibus includes all five books of the bestselling vampire series. The omnibus is a sinister and sensual romp laden with vampires, lycans, witches and shifters that takes you through the paranormal underworld, with heart pounding plunges into first love and maniacal murder. WAKING FOREVER (BOOK 1) Sara Glass, a successful thirty-five year old lawyer in San Antonio, leads a comfortable life. Then a near fatal encounter changes all of that, restoring vitality to Sara's life. Rachel Collins, a charming but reserved art dealer, saves Sara from a violent attack and their subsequent friendship quickly heats up. But Rachel has a secret and when her past threatens Sara, the two women explore a dark world Sara never knew existed—a world that will challenge her very notions of life, love, and death. ELA: FOREVER (BOOK 2) Ela Bauer has endured horrifying acts of violence and betrayal, committing many of her own along the way. As she continues her search for retribution across the Atlantic, she will be held accountable for her decisions. But her strength and passion sustain her in her darkest hours, adding more fuel to her raging desire for revenge. As she terrorizes Europe and the Americas, Ela uncovers even more secrets about her world, every step drawing her closer to her ultimate goal: destroying the woman who destroyed her. BECOMING FOREVER (BOOK 3) Homicide detective Ash Haines is not fazed by violence, but the brutal murder of a man covered in bite marks sends her spiraling into an unfamiliar world filled with danger and intrigue. The investigation leaves Ash more and more baffled, challenging her perceptions of reality while sending her into the path of Dr. Emma Atman, the beautiful Medical Examiner assigned to the case who has secrets of her own. As Ash digs deeper into the case, she becomes entangled in a violent and unforgiving underworld, forcing her to adapt or die. DYING FOREVER (BOOK 4) As a down-to-earth professor of American folklore, Alison Bailey teaches her students that legends are a function of cultural memory, based in collective fantasy and fear. Her reality is demolished in a single moment of terror, replaced with a world of shadows and horrors as she discovers the folklore she teaches is based in truth. Now she is forced to rediscover the world with Bryce Whelan, the alluring stranger who has a bigger secret than Alison could ever imagine. As their feelings for each other grow, so does the danger they must face together. Now Bryce and Alison must mend relationships and form new alliances to face a most formidable foe. COLEEN: FOREVER (BOOK 5) Set four years after Dying Forever, Coleen: Forever is a novella that delves into the origins of the oldest vampire in the Waking Forever universe, the alluring, intelligent, and sometimes snarky Coleen Andrade. Faced with the challenge of finding a new companion, Coleen must choose between love and tradition. She will be forced to break her own rules, and ideals she has held for centuries will be pushed aside as she struggles to reconcile the person she has been, and the one she must become to survive.",
  "genres": [
    "Lesbian",
    "Paranormal"
  ],
  "author": "Heather McVea",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/24269383-the-waking-forever-omnibus"
}