{
  "title": "Echoes of Betrayal",
  "description": "The action continues fast and furious in this third installment of Elizabeth Moon’s celebrated return to the fantasy world of the paladin Paksenarrion Dorthansdotter. This award-winning author has firsthand military experience and an imagination that knows no bounds. Combine those qualities with an ability to craft flesh-and-blood characters, and the result is the kind of speculative fiction that engages both heart and mind.All is not well in the Eight Kingdoms. In Lyonya, King Kieri is about to celebrate marriage to his beloved, the half-elf Arian. But uncanny whispers from the spirits of his ancestors continue to warn of treachery and murder. A finger of suspicion has been pointed toward his grandmother, the queen of the Ladysforest elves, and that suspicion has only intensified with time and the Lady’s inexplicable behavior. Clearly, she is hiding something. But what? And why?Meanwhile, in Tsaia, the young king Mikeli must grapple with unrest among his own nobility over his controversial decision to grant the title and estates of a traitorous magelord to a Verrakaien who not only possesses the forbidden magic but is a woman besides: Dorrin, once one of Kieri’s most trusted captains. When renegade Verrakaien attack two of Dorrin’s squires, suspicion and prejudice combine to place Dorrin’s life at risk—and the king’s claim to the throne in peril.But even greater danger is looming.  The wild offspring of a dragon are on the loose, sowing death and destruction and upsetting the ancient balance of power between dragonkind, humans, elves, and gnomes. A collision seems inevitable. Yet when it comes, it will be utterly unexpected—and all the more devastating for it.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "High Fantasy",
    "Science Fiction Fantasy",
    "Military Fiction",
    "Epic"
  ],
  "author": "Elizabeth Moon",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/11476589-echoes-of-betrayal"
}