{
  "title": "Twisted Triangle: A Famous Crime Writer, a Lesbian Love Affair, and the FBI Husband's Violent Revenge",
  "description": "Twisted Triangle is the first complete narrative thriller about the sensational story of Margo Bennett, a married FBI agent, who had a love affair with best-selling author Patricia Cornwell, and whose jealous husband, Gene Bennett, a superstar FBI undercover agent, kidnapped and attempted to murder her. When the case first came to trial, it was reported in Vanity Fair, Newsweek, People, the Washington Post and the New York Times. Most every profile of Cornwell, written in the U.S. and abroad every time she releases a book, mentions this case and her relationship with Margo. Margo also was the inspiration for the heroine in “Hostage Negotiator,” a TV movie that came out in 2001. Now, for the first time, Margo Bennett has given Caitlin Rother complete personal access, sitting for interviews and turning over photographs, documents, records, and private papers. Twisted Triangle  has the makings of a major bestseller: including the crazy dynamics of Margo and Gene Bennett’s family, the brilliant FBI undercover career of Margo's husband Gene, the lesbian affair with celebrity author Pat Cornwall, Gene's reactive kidnapping and attempt to kill Margo, Gene’s insanity defense, the trial that validates Margo’s story and shows she was telling the truth all along, and a happy ending to her tale of survival.  Margo Bennett lives with her two daughters in the San Francisco Bay Area, where she is a high ranking officer in the University of California police department. Caitlin Rother lives in San Diego. Gene Bennett is incarcerated in Virginia, not far from Washington DC where most of the events of this incredible story took place.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Audiobook",
    "Biography",
    "Mystery",
    "Queer"
  ],
  "author": "Caitlin Rother",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/2428421.Twisted_Triangle"
}