{
  "title": "Shadow of a Lady",
  "description": "Against the backdrop of the Napoleonic Wars and the glitter of the court of Naples, this captivating novel unfolds the story of Helen Telfair, a young English woman in search of herself. Helen, intelligent, witty, rebellious, had sworn never to marry. But when she found herself with child after a brutal encounter with a stranger, she agreed to marry the wealthy and dissolute Lord Henry Merritt. Helen, neglected by her husband, felt very much alone—until she met Emma, the celebrated Lady Hamilton. No two women were less alike. Emma was uneducated, sensual, and by sheer will and unsurpassed beauty had catapulted herself into a brilliant marriage and into a scandalous affair with the famous Lord Nelson. But fate joined these two unforgettable women in a drama of intrigue and war and Helen's destiny was newly shaped by a great and exotic moment in history. Born near Cambridge, Massachusetts to Pulitzer prize-winning poet Conrad Aiken and his first wife, the writer Jessie McDonald. Jane Hodge was 3 years old when her family moved to Great Britain, settling in Rye, East Sussex, where her younger sister, Joan, who would become a novelist and a children’s writer, was born. Their parents divorced in 1929. From 1935, Jane Hodge read English at Somerville College, Oxford University, and in 1938 she took a second degree in English at Radcliffe College, her mother’s alma mater. She was a civil servant for a time, and also worked for Time Magazine , before returning to the UK in 1947. Her works of fiction include historical novels and contemporary detective novels. In 1972 she renounced her United States citizenship and became a British subject. For many years a believer in the right of people to end their own lives, Hodge chose to end her own by means of an overdose in June 2009. The Times obituary (pub. July 25, 2009) stated that she left ‘a letter expressing her deep distress that she had felt unable to discuss her plans with her daughters without risking making them accessories.’",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Historical",
    "Historical Romance",
    "Fiction",
    "Gothic",
    "Regency"
  ],
  "author": "Jane Aiken Hodge",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/2427803.Shadow_of_a_Lady"
}