{
  "title": "Sidelined",
  "description": "Three people. Three motives. Three reasons.\nWhen the game leaves the field in the second book in the USA Today bestselling By His Game series and mixes with sex, lies, and betrayal, the future isn't the only thing on the line...\nMacey Kelly has sworn off men. \nUnless they’re going to zip in and out of her apartment—and her vagina—quicker than they can give her an orgasm, she’s not interested. Finding out her boyfriend of three years got her cousin pregnant was a total confidence knock. Luckily for Macey, confidence is something she has in abundance, so all Mitch’s asshole move did was make her pretty cynical toward men. The last thing Jack Carr needs at the start of the season is for a dark-haired, sexy as sin, gyspyesque beauty to be consuming his thoughts. Football is his life, which leaves no time for girls. Unless they’re the love ‘em and leave ‘em girls. Becoming one of the best running backs the league has ever seen by racking up the yards is his top priority… not bedding Macey Kelly, despite her affinity for blow jobs and total sexual abandon. Avoiding each other is the perfect solution, but when your best friends are in a serious living together kind of relationship, that isn’t always an option. Sometimes, sex on tap is the easiest option. \nAnd the sweetest.\n Until Mitch shows up with a bombshell that could shatter Macey’s perfectly carved out life. It’s been a year, but he isn’t giving her up, not now he has a chance at winning her back. And he knows her buttons. Every single one of them. Unfortunately for him, Jack Carr isn’t a loser. The star running back has his eye on the Vince Lombardi—and on Macey. But seeing her hanging between them both isn’t something he’s down with, not when he discovers why she’s so against anything more-ish, as she puts it.  Macey quickly realizes she’s the ball being passed between two desperate yet opposing teams, and that only one of them can score the touchdown. But will the winner be the guy she lived with and loved for three years, or will the winner be the guy who understands her and makes her body come alive?\nIn this game, someone will be sidelined, and calling the play isn’t always as easy as it seems.\nSidelined is a full-length, standalone novel. It's not necessary to read Blindsided before this book, but it is advised.",
  "genres": [
    "Sports",
    "Romance",
    "New Adult",
    "Football",
    "Sports Romance",
    "Contemporary",
    "Amazon"
  ],
  "author": "Emma Hart",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/24279519-sidelined"
}