{
  "title": "Keeper and Kid",
  "description": "“Keeper and Kid is a marvel. I dare you. Open this book and try to put it down.” ---Ann Hood, author of The Knitting RoomEight years ago, James Keeper fell in love with his upstairs neighbor in Boston, a sassy pastry chef with gray eyes and a fierce attitude. They got married, found a dog, and shopped for cilantro. But conflicting schedules and a real estate deal gone bad took its toll on the twenty-somethings in love. One divorce later, the hand-me-down chairs were separated, the potato masher custody settled, and Keeper moved to Providence to work with his best friend selling antiques at a quirky shop called Love and Death.A new job, a new love, and a new life now in place, Keeper is in a comfortable situation. Business is steady, Leah (the new love) is intriguing and passionate, and Keeper’s friends always turn up for Sunday evening Card Night.But one phone call from his former mother-in-law changes everything. And so days later, Keeper comes away with a son he never knew he had, and life all of a sudden takes on a new meaning.Leo, the precocious three-year-old who sports Keeper’s square chin, is more than a handful---he eats only round foods, refuses to bathe, thinks he’s a bear, and refers to Leah as “that man.” For a guy who never thought he’d be a parent, Keeper is thrown headfirst into fatherhood---and has no idea what to do. As Keeper and Leo adjust to the shock of each other and their suddenly very different lives, Keeper begins to let the people in his life in, in turns strange and heartwarming, funny and painful. But some, like Leah, aren’t so eager for change.In this humorous and poignant novel, Edward Hardy explores the depths of modern love, parenthood, and compromise. Keeper and Kid is the story of how a normal guy receives an unexpected gift and in turn must learn to ask more of others and himself. A coming-of-age story for the guy who thought he had already grown up, Keeper and Kid is a sharp and witty account of what we do for love. Advance Praise for Keeper and Kid“A fine, fetching novel with a good heart. Keeper is nimble and affecting, a tribute to the author’s endless comic inventiveness.”---Stewart O’Nan, author of The Good Wife“At once immensely engaging and about the things that matter most: how we love, how we move on, how the past moves with us. Lovely, wise, and surprising.”---Elizabeth Graver, author of The Honey Thief“Ed Hardy’s voice in Keeper and Kid grabs you and won’t let you go until the very last page. Full of local color, bittersweet characters, and a story we can all relate to---the day your past arrives on the doorstep of your present life.”---Ann Hood, author of The Knitting Room",
  "genres": [
    "Fiction",
    "Romance",
    "Adult Fiction",
    "Novels"
  ],
  "author": "Edward Hardy",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/2427922.Keeper_and_Kid"
}