{
  "title": "Getting Lucky",
  "description": "Getting Lucky The Las Vegas Kingsnakes - Players Club Series, Book #1  Losing it all…  Seven years ago, tragedy stole everything from rising hockey star Ryder O’Bryan. He’s coped with the devastation by shutting down emotionally, and maintaining strict control over everything in his life: his image, his career and the carefully hand-selected women he takes to his bed. He vows the only commitment he’ll make again is to the game, and the only ring he’ll ever wear will be the one given to him when the Las Vegas Kingsnakes win the most coveted trophy in professional hockey. Hedging his bets…  When straight-laced Zoe Miller shows up at Callahan’s bar, the pretty redhead charms Ryder with her sweet personality and sexy legs. He gives her a ride home and is surprised to learn she has an agenda: a one-night stand with no strings attached.  After the hottest sex of his life, Ryder wants to see her again, but Zoe won’t settle for being just one of his many lovers-she wants more.  Unable to reach a compromise, they go their separate ways. As fate leads them back into each other’s lives once more, Ryder gets a second taste of their explosive chemistry. This time, he isn’t about to let her go so easily.  Zoe’s complicated past prevents her from giving Ryder what he desperately wants. She’s determined to guard her heart against the charming forward with the sexy tattoo sleeves and killer smile.  Going All In...  The inability to break through Zoe’s walls rattles Ryder, and the life he’s fought so hard to control quickly unravels. The pain he’s kept buried begins to surface again, and he’s forced to confront the one thing in his life he’s feared for the past seven years. If he doesn’t take the risk, he might never recover from his heartbreaking past. But, if he can roll the dice just one more time, he might find himself finally getting lucky-in life and in love.",
  "genres": [
    "Hockey",
    "Romance",
    "Sports",
    "Contemporary",
    "Sports Romance",
    "Contemporary Romance",
    "Novella"
  ],
  "author": "Jennifer Lazaris",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/24280598-getting-lucky"
}