{
  "title": "Forgotten Suns",
  "description": "For five thousand Earthyears, the planet called Nevermore has been empty. Its cities are deserted, with every trace of their inhabitants erased. Only a handful of nomadic tribes remain, none of whom remember the ones who went before.An expedition from Earth has been excavating one of the planet's many ruins, and attempting without success to find the cause of its people's disappearance. Now the expedition is in trouble, its funding cut; unless it makes a major discovery, and soon, it will be shut down. Then the United Planets will invade Nevermore and strip it of its resources, and destroy its ancient and enigmatic treasures.Aisha, the daughter of the chief archaeologists, tries to save the expedition by opening a sealed tomb or treasury-and manages instead to destroy it. But one treasure survives, which may be the key to the planet's mystery. That treasure is alive, and deeply dangerous: a long-forgotten king and conqueror, sentenced to be preserved in stasis centuries before his world was abandoned.Khalida is a Military Intelligence officer with a quarter-million deaths on her conscience. She has retreated to the near-solitude of Nevermore to try to come to terms with what she has done, but her past will not let her go. The war she thought she had ended still rages, and is about to destroy one planet and spread chaos through a hundred more. Her superiors force her back into service, and dispatch her to a world that may also offer a clue to the mystery of Nevermore.With the alien king, the sentient starship he liberates from an unholy alliance of Military Intelligence and the Interstellar Institute for Psychic Research, and a crew of scientists, explorers, and renegades, Aisha and Khalida set off on a journey to the end of the universe and beyond. What they find will change not only the future of Nevermore, but that of all the United Planets.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Space Opera",
    "Fiction",
    "Aliens",
    "Adventure",
    "Science Fiction Fantasy"
  ],
  "author": "Judith Tarr",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/24290807-forgotten-suns"
}