{
  "title": "Under a Wolf Moon",
  "description": "Five brand new, hot paranormal romance stories from bestselling authors. Alpha heroes and heroines with dark pasts and the need to discover their own happy ever after will draw you in and make you turn to the next page.Each novella offers a look into a different series and world, but each features the power of the wolf. Whether you like your wolves from small town, as billionaires, fighting wars they have to win or wrestling with ancient powers, Under a Wolf Moon has something for you. Discover never seen before stories!Meet tempestuous wolves!Survive fiery battles!Mark the date to meet their mates!The wolf moon fills the sky and it’s time to howl!Warning: Contains alpha heroes and heroines, scorching passion, tough love, family ties, and pack dynamics which bind them together. Sometimes a wolf’s greatest challenge is finding their way home…Wolf Next Door by Heather LongWhen Claire Webster was five years old Tyler Buckley, the wolf next door, told her he was her mate and then ordered her not to play with one of her friends. Butting heads throughout their childhood, her choice to leave Willow Bend tore them apart. Eight years later, she sends a request to the new Alpha—she wants to come home, and when he grants it, she’s both relieved and terrified. The first person she runs into is the last one who ever wants to see her again.Princess of the Pack by Saranna DeWyldeMarchessa de la Luna’s duty is to the marriage arranged to the enigmatic and powerful, but aging Alpha Antony Rommulus. Her passion is for the rogue Cassius who can give her nothing except pleasure. Marchessa must choose if it will be duty or desire that will decide her fate and that of her pack.Eternal by Rebecca RoyceDougal Owens has served on the front line of The Dragon Wars for sixteen years. The last thing this Alpha werewolf expects is his mate to drop in with a plan to end the war. Together, they will battle to save the Wolves or die trying.Hell’s Playground by Cara CarnesThe Quadrant Alpha once thought Mira’s death was the worst thing that could have happened. Learning she lives, and worse, survived torture and purgatory gives Adrik a chance to save Redemption and his mate.Odd Wolf by Virginia NelsonDara is Alpha and used to taking control of the situation when it goes swirly. A rogue on her turf means a fight, and she’s ready to take him on. A woman with no plans to be tamed and a rogue wolf with no plans to stick around shouldn’t have more than a brief meeting to establish boundaries and be done. However, when Dara meets Lynwood, the call to mate might drown out logic altogether.",
  "genres": [
    "Shapeshifters",
    "Anthologies",
    "Romance",
    "Paranormal"
  ],
  "author": "Heather Long",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/24305397-under-a-wolf-moon"
}