{
  "title": "اللوكانده",
  "description": "إنه المكان الذي يوفر أقصى قدر من الآمان والراحة “خان” بالفارسية و”نزل” بالمغرب العربي و”فندق” بالعربية و”اللوكانده” إسماً لهذا الكتاب بين يديكم في رحلة إلى تاريخ المنشآت السياحية خروجاً من صورة الآرض في وصف إبن حوقل ومروراً بعين الشريف الإدريسي وروائع الأندلس إلى إبن جبير في العراق والشام, وصلاح الدين في إسطورة خان السلطان, ثم تزداد الرحلة جمالاً بعبق التاريخ من منظور عربي آمين؛ رحالة غني عن التعريف ”إبن بطوطة” شهرته وأسمه “أبو عبدالله” وسنده في السند والهند تحفة الأنظار في غرائب الأمصار وعجائب الأسفار, ثم يأخذنا التاريخ نحو التغيرات الإقتصادية والصناعات التحويلية ونظم المعلومات الإدارية حتى أصبحت صناعة السياحة والسفر أحد أهم مصادر الثروة في عالمنا المعاصر. ونباشر رحلتنا نحو مكونات صناعة السياحة وأنواع المنشآت السياحية وأنشطتها المختلفة مرورا بمعايير تصنيف المنشآت السياحية من حيث الموقع وعناصر الجذب, والحلول السحرية لإبقاء المنشآت السياحية في ظل الأزمات الإقتصادية قائمة؛ لأهمية تلك الصناعة في دعم إقتصاديات الدول وزيادة الإيرادات وتحسين ميزان المدفوعات, وكذا تنمية الصناعات الموازية, وتوفير مجالات جديدة وخلق فرص للعمل.ومن خلال رحلتنا بين هذه السطور ننتقل إلى تنظيم العمل وسياسة التشغيل بالفنادق إبتداءاً من الترتيبات الأولية لرسم السياسة العامة للتشغيل مروراً بالتمويل وعقود الإدارة وإنتهاءاً بأنظمة الرقابة والخطوات التي تتخذ في حالة وجود إنحرافات عبر تحليل عمليات التشغيل وإستخدام الوسائل الفنية والنظريات الخاصة بالهندسة الصناعية لتحسين كافة العناصر التي تدخل في إنجاز عمليات تشغيل الفنادق بدءاً من المكاتب الأمامية حجزاً وإستقبالاً وتسجيلاً, ومروراً بمناطق الخدمة ونقاط البيع جانباً, والمطابخ والمطاعم والمخازن جانباً أخر, إلى خدمة الغرف والمغسلة, ووصولاً للنظام المحاسبي والدورة المستندية لتحقيق الرقابة الفعالة لعناصر التكاليف وإصدار التقارير المالية والإدارية والضريبية, وإنتهاءاً بالجودة ومراقبة الآجور قياساً بمستوى الآداء وكفاءة الإنتاج وعائد التدريب ومتابعة مشكلات الآمن الصناعي وأعمال الحماية المدنية. ولا تنتهي رحلتنا على هذا النحو؛ بل نتعرض للسلوك التنظيمي, فالمنشآت السياحية ليست مجرد جمالاً معمارياً أو موقعاً خلاباً وإنما هي ترحيب بالضيف وإرضاء للنزلاء وإهتمام بوسائل الراحة وتوفير للآمان وهي أشياء لا تشترى, وإنما هي قدر كبير وجهد وفير لهؤلاء العاملين؛ فالمنشآت السياحية الناجحة تضع قدراً كبيراً من إستثماراتها في إختيار وتنمية مواردها البشرية للتأكد من جودة التشغيل وسلامة الأصول. وقبل أن تنتهي رحلتنا كان ولابد أن نسترشد بالنظم واللوائح والأحكام؛ حيث القوانين والأعراف والهياكل التنظيمية, ثم الإستقطاب والترقي والتأمين والتدريب والرعاية, ومرورا بأنظمة التأمين ضد المخاطر, وإنتهاءا بالنظم والعلاقات التنظيمية بين المنشآت السياحية ووكالات السفر وكذا صياغة العقود .. سنبدأ رحلتنا بالتاريخ, ونباشرها بالسياسة والتنظيم, ونختتمها بالنظم واللوائح والقوانين.",
  "genres": [],
  "author": "محمد عادل عبد العزيز",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/24290246"
}