{
  "title": "The Southern Tradition : The Achievement and Limitations of an American Conservatism",
  "description": "In recent years American conservatism has found a new voice, a new way of picking up the political pieces left in the wake of liberal policies. But what seems innovative, Eugene Genovese shows us, may in fact have very old roots. Tracing a certain strain of conservatism to its sources in a rich southern tradition, his book introduces a revealing perspective on the politics of our day. As much a work of political and moral philosophy as one of history, The Southern Tradition is based on the intellectual journey of one of the most influential historians of the late twentieth century. To appreciate the tradition of southern conservatism, Genovese tells us, we must first understand the relation of southern thought to politics. Toward this end, he presents a historical overview that identifies the tenets, sensibilities, and attitudes of the southern-conservative world view. With these conditions in mind, he considers such political and constitutional issues as state rights, concurrent majority, and the nature and locus of political power in a constitutional republic. Of special interest are the southern-conservative critiques of equality and democracy, and of the Leviathan state in its liberal, socialist, and fascist forms. Genovese examines these critiques in light of the specific concept of property that has been central to southern social and political thought. Not only does this book illuminate a political tradition grounded in the writings of John Randolph and John C. Calhoun, but it shows how this lineage has been augmented by powerful literary figures such as Allen Tate, Lewis Simpson, and Robert Penn Warren. Genovese here reconstitutes the historical canon, reenvisions the strengths and weaknesses of the conservative tradition, and broadens the spectrum of political debate for our time.",
  "genres": [
    "History",
    "Politics",
    "American History",
    "Nonfiction",
    "Cultural"
  ],
  "author": "Eugene D. Genovese",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/2429895.The_Southern_Tradition_"
}