{
  "title": "Candy Candy",
  "description": "La prima edizione occidentale del romanzo \"Candy Candy Final Story\" è italiana! Dopo decenni di attesa, una delle maggiori icone dell'immaginario giapponese torna finalmente nel nostro Paese.America, inizio del Novecento.Mentre trascorre la sua infanzia presso la Casa di Pony, Candice \"Candy\" White teme di essere diventata ormai troppo grande per essere adottata.Il giorno in cui anche la sua migliore amica Annie se ne va con i nuovi genitori acquisiti, Candy incontra un giovane abbigliato con l'abito tradizionale scozzese che si esercita con la cornamusa sulla collina nei pressi dell'orfanotrofio, e che le dà un consiglio che l'accompagnerà per tutto il resto della vita: sorridere sempre, anche quando tutto sembra andare male. Da quel giorno, il 'Principe della Collina' è sempre nei suoi pensieri, ma non lo rincontrerà mai più. Finalmente Candy viene adottata da una ricca famiglia. La aspetta però una brutta sorpresa: il suo ruolo tra le pareti domestiche è quello di compagna di giochi per i pestiferi figli dei padroni di casa. La cattiveria dei due, che odiano il carattere solare di Candy, la sua gentilezza e la sua predisposizione a essere ben accetta da chiunque, si spinge fino a renderle la vita impossibile, ma l'incontro casuale con tre meravigliosi ragazzi, i più giovani esponenti di una nobile famiglia di origine scozzese, le permette di dare una svolta imprevista alla sua esistenza. Uno di loro, inoltre, assomiglia incredibilmente al Principe della Collina incontrato anni prima, benché la sua giovane età renda chiaro che non possa assolutamente trattarsi della stessa persona...Da quel momento in poi, le vicende costringeranno Candy a prendere importanti decisioni sul suo destino per evitare di restarne in balia, affrontando così una grande e romantica avventura che la porterà dall'America all'Europa, in un mondo che si sta preparando alla Prima Guerra Mondiale...Candy, ormai adulta, ci racconta in prima persona le avventure vissute in gioventù, e ci svela poco alla volta quel che è accaduto 'dopo' le vicende classiche.Un modo davvero emozionante per riscoprire uno dei personaggi più amati da generazioni e generazioni di lettori e di spettatori.Kappalab ringrazia in particolar modo l'autrice Keiko Nagita per aver concesso all'edizione italiana una prefazione esclusiva, e per aver collaborato attivamente con la casa editrice nel riportare i nomi di alcuni personaggi – foneticamente travisati nella celebre edizione televisiva italiana – alla loro versione originale",
  "genres": [
    "Fiction",
    "Young Adult"
  ],
  "author": "Keiko Nagita",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/24312365-candy-candy"
}