{
  "title": "Expats: Travels in Arabia from Tripoli to Tehran",
  "description": "Expats is Christopher Dickey's fascinating account of the new Arabia, and of the expatriates who have helped create it. The fabled Arab world - whose vast deserts, overwhelming solitude, and stark, noble civilizations once beguiled explorers like T. E. Lawrence and Wilfred Thesiger - is nowhere to be found today. The deserts remain, of course, but souks give way to shopping malls, fortresses crumble in the shadows of glittering hotels, and oases are replaced by ice-skating rinks. In Dubai an earthly paradise has been wrested from the the Emirates Golf Club. Foreigners have moved in on Arabia's oil wealth like pilgrims to a shrine, bringing their own hopes and dreams, mingling them with those of the Arabs. The stories of the expatriates' lives, of the peculiar niches they inhabit, and of the meteoric ascendancy of a hybrid society are the stuff of Expats \"a book that penetrates what Lawrence called \"the glamour of strangeness,\" and that updates all our notions of the Middle East. The symbiosis of the West and Arabia is eccentric, to say the least. Texans extract oil from the Libyan desert for Muammar Qaddafi and brew \"flash\" to numb their brains back at the company compound. The Sultan of Oman has retained a firm run by an ex-CIA agent to manage the affairs of several government agencies. Naguib Mahfouz, Egypt's Nobel Laureate, lives under threat of death from Islamic fundamentalists for writing like a Westerner - that is, books with conscience, truth, and sex. Dubai boasts Tex-Mex food at Pancho Villa's, a bar where it is rumored that one evening a shaken boat crew, having just been strafed by Iranian speedboats, found themselves seated next to their attackers. Video clubs vie with the imams for the attention of the populace, and life, such as it is, goes on. And so does the war in the Gulf. While Iraq launches Exocets and Iran lays mines, a Yorkshireman who once fished the North Atlantic now operates supply boats out of Sharjah. Missile explosions rattle windows in Kuwait but rarely interrupt the flow of commerce. All around the Gulf the war is spectrally present, at times swift and fatal, but overall not bad for business'drydock work, weapons trafficking, and always the lucrative trade of shuttling oil through the Strait of Hormuz to the industrial world. One retired British military man makes his living defusing rockets lodged in the sides of tankers. And the U.S. Navy, protecting \"the free world's oil supply,\" blows a commercial airliner from the skies. In the aftermath, the Iranians Dickey meets in the streets of Teheran, numbed by fighting, reminisce fondly about the expatriates they knew in the days of the Shah. The new Arabia bears only a passing similarity to its desert ancestry. As Thesiger says, \"It's the curse of this bloody oil, you see.\" But in this land awash with Madonna videos and air-conditioned BMWs, the Arabs have started searching again for their past. Camel races followed from four-wheel cars, and impromptu falcon hunts arranged by cellular phone keep them in touch with their traditions. Theirs is a world where the wildest dreams - of Arab and expat - have come together and come true.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir",
    "History"
  ],
  "author": "Christopher Dickey",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/114779.Expats"
}