{
  "title": "The Complete Fire on Ice Series",
  "description": "This series has five full-length novels about hot hockey stars and the women who steal their hearts.  Bound  College senior Kate Camden has learned to adapt - to her last year of school, to the promise of motherhood, to the fact that she’s doing it all alone. But just when she’s learned to adjust, heartache threatens to break her apart.  Pro hockey player Jason “Ryke” Ryker has it all: adoring fans, a promising career, and a beautiful wife. But when his seemingly perfect life is shaken by tragedy, he’s left questioning whether having it all is ever more than an illusion.  When circumstance brings Kate and Ryke together, they discover they don’t have to hurt alone. Bound by a grief that haunts them both, they must rely on one another to survive heartbreak. But that grief is more powerful than they realize, and the tie that binds them together may ultimately tear them apart.  Captive  Two years ago, Jason and Kate Ryker were brought together by grief and bound to one another by love. Now married, they’re confronting their fears together.  But heartbreak finds them again, and the ties that bind Kate and Ryke are tested as she struggles against fear and sadness. As a grief counselor, Kate understands all too well the pain of her clients. And while her husband’s career as an NHL forward is at an all-time high, he’s coping with the frustration of feeling powerless as his wife's hopes slip away.  Edge  One bad hit has left the career of young NHL Center Luke Hudson in question. When he arrives for rehab with a minor league team, his injury has robbed him of the edge that made him great.  Team trainer Adella Price’s job is to help Luke get back in peak condition. But their one on one sessions shake her resolve to remain unattached. Dell is hands-off to all hockey players, even one as charming and successful as Luke.  As Luke starts to get ahold of his game again, he loses his grip on his heart. Helping Luke get his edge back brings to light what Dell is missing from her life. But those who want them apart are relentless, and with their careers on the line, Luke and Dell must decide if their love is worth risking it all.  Drive  Years of training are about to pay off for hockey player Nikola Vereshkova. A call to play in the big league means he can finally come through for those who need him. His relocation to Chicago comes with built-in friends – and one gorgeous enemy who was less than impressed with him after their first encounter. Sadie Alexander knows all about the drastic measures men will take just to get laid. She’s not only experienced it first-hand, but lived to tell about it in her online column, Sadie Says. And even though she’s a die-hard independent woman on the outside, the recent marriage of her best friend has her secretly feeling more alone than ever. Getting close to a foul-mouthed Russian hockey heartthrob was the last thing Sadie expected. And the timing couldn’t be worse since she’s sworn off of men for a writing assignment. The line between love and hate is eroding, and Niko and Sadie find themselves in deeper than they ever expected. Could something that started out wrong end up being just right?  Release  NHL player Orion Caldwell protects his own. He’s an enforcer to his core, but he was the one left defenseless when his longtime girlfriend broke his heart. Now he’s all about his game, but spending the offseason in his hometown forces him to confront painful issues –both old and new.   Samara Cross just wants to be invisible.",
  "genres": [
    "Sports",
    "Romance",
    "Contemporary",
    "Anthologies",
    "Sports Romance",
    "Hockey",
    "Amazon"
  ],
  "author": "Brenda Rothert",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/24312456-the-complete-fire-on-ice-series"
}