{
  "title": "Tibet, Tibet: A Personal History of a Lost Land",
  "description": "When Patrick French was a teenager, the Dalai Lama visited his school in northern England. Fascinated by this exotic apparition, French began what was to become a lifelong quest to understand Tibet, the myth and the fact. He would immerse himself in the history, travel as the guest of ordinary Tibetans–nuns, nomads, and exiles–and organize Free Tibet activists from an office in London. Now he gives us a kaleidoscopic account of that journey.Part memoir, part travel book, part history, Tibet, Tibet ventures beyond our world-weary fantasies to discover the truth behind a culture’s struggle for survival. In French’s narrative, a land adored for peaceful spirituality reveals its surprising early history of fierce war-making. Here as well are the centuries-old legends of how Tibetan diplomats maneuvered deftly at the Chinese court, legends that inform to this day each people’s view of the other. A perennial vassal state, Tibet nevertheless managed to preserve its distinctive culture for centuries–until the twentieth, when everything was destroyed with devastating speed by Mao’s overwhelming forces.Today, as Chinese tourists take snapshots and buy kitsch at Tibetan monasteries, young nuns quietly continue the underground fight against Communist rule. In Dharamsala, over cappuccino, exiled monks pitch their cause to Western pilgrims decked out in gaudy robes. Tibetans recall the terrible days of the Great Leap Forward and eagerly ask French for news of the Dalai Lama. In the presence of this internationally revered spiritual and political leader, French retains a measure of his youthful amazement, but finally, inescapably, he comes to disturbing conclusions about His Holiness’s role in his people’s collective tragedy.With immense learning and a clear but compassionate eye, Patrick French gives us a sober new understanding of a culture’s senseless catastrophe and allows us to see what realistically can–and cannot–be done to alleviate it.",
  "genres": [
    "Travel",
    "History",
    "Nonfiction",
    "China",
    "Asia",
    "Buddhism",
    "Memoir"
  ],
  "author": "Patrick French",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/1147873.Tibet_Tibet"
}