{
  "title": "The Secret Series Books 4-6",
  "description": "Secret Passions Sandi has escaped her old life. She’s shed her hijab and her family obligations to start a new life, alone. It’s been five years since she first stepped foot in America to save her life. She’s earned enough money to live comfortably, thanks to her artwork. But just when she finally feels like she can start to relax and not jump at shadows, her past returns, hot on her heels. Now she must trust the man who saved her years ago, and ask him to do it once again. Mitch risked it all to bring the young girl to America years ago. And when she shows up at his door in the middle of the night all grown up, he’ll do everything he can to help her again. Dodging her past has gotten a lot harder this time, but they might survive—if he can keep his hands off her.   Secret Identity Eve is at the top of her game. She's finally going to make partner at the ad agency run by two of her best friends. But when she takes a business trip to wine and dine a potential customer, her boss decides to tag along at the last minute. Now everything she's worked hard for might just disappear in a flash. Carter has had a thing for his best friend Eve ever since he can remember. He hired her a few years ago to help boost his business and it has never run more smoothly. But when a once-in-a-lifetime opportunity presents itself, he takes a chance at happiness that could end up destroying their friendship.  Secret Sauce Trent owns a high-profile restaurant in New York. His food and secret recipes are highly sought after. His personal life mirrors his successful career. Beautiful women hang on his every word. But when his restaurant receives a bad review from a well-known food critic, things take a turn for the worse. When he finally tracks down the food critic, he might just lose more than his secrets to her. Marina’s true identity has been hidden for years. She receives her paychecks in secret and hides in one of the largest cities in the world. But when her secrets are threatened, she’d do anything to protect the person she loves the most.",
  "genres": [],
  "author": "Jill Sanders",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/24324281-the-secret-series-books-4-6"
}