{
  "title": "Capture: Unraveling the Mystery of Mental Suffering",
  "description": "Why do we think, feel, and act in ways we wished we did not? For decades, New York Times bestselling author Dr. David A Kessler has studied this question with regard to tobacco, food, and drugs. Over the course of these investigations, he identified one underlying mechanism common to a broad range of human suffering. This phenomenon—capture—is the process by which our attention is hijacked and our brains commandeered by forces outside our control.In Capture, Dr. Kessler considers some of the most profound questions we face as human beings: What are the origins of mental afflictions, from everyday unhappiness to addiction and depression—and how are they connected? Where does healing and transcendence fit into this realm of emotional experience?Analyzing an array of insights from psychology, medicine, neuroscience, literature, philosophy, and theology, Dr. Kessler deconstructs centuries of thinking, examining the central role of capture in mental illness and questioning traditional labels that have obscured our understanding of it. With a new basis for understanding the phenomenon of capture, he explores the concept through the emotionally resonant stories of both well-known and un-known people caught in its throes.The closer we can come to fully comprehending the nature of capture, Dr. Kessler argues, the better the chance to alleviate its deleterious effects and successfully change our thoughts and behavior Ultimately, Capture offers insight into how we form thoughts and emotions, manage trauma, and heal. For the first time, we can begin to understand the underpinnings of not only mental illness, but also our everyday worries and anxieties. Capture is an intimate and critical exploration of the most enduring human mystery of all: the mind.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Science",
    "Audiobook",
    "Mental Health",
    "Health",
    "Self Help"
  ],
  "author": "David A. Kessler",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/24336403-capture"
}