{
  "title": "Rywka's Diary: The Writings of a Jewish Girl from the Lodz Ghetto",
  "description": "The newly discovered diary of a Polish teenager in the Lodz ghetto during World War II—originally published by Jewish Family & Children’s Services of San Francisco, now available in a revised, illustrated, and beautifully designed trade edition.After more than seventy years in obscurity, the diary of a teenage girl during the Holocaust has been revealed for the first time. Rywka’s Diary is at once an astonishing historical document and a moving tribute to the many ordinary people whose lives were forever altered by the Holocaust. At its heart, it is the diary of a girl named Rywka Lipszyc who detailed the brutal conditions that Jews in the Lodz ghetto, the second largest in Poland, endured under the Nazis: poverty, hunger and malnutrition, religious oppression, and, in Rywka’s case, the death of her parents and siblings. Handwritten in a school notebook between October 1943 and April 1944, the diary ends literally in mid-sentence. What became of Rywka is a mystery. A Red Army doctor found her notebook in Auschwitz after its liberation in 1945 and took it back with her to the Soviet Union.Rywka’s Diary is also a moving coming-of-age story, in which a young woman expresses her curiosity about the world and her place in it and reflects on her relationship with God—a remarkable affirmation of her commitment to Judaism and her faith in humanity. Interwoven into this carefully translated diary are photographs, news clippings, maps, and commentary from Holocaust scholars and the girl’s surviving relatives, which provide an in-depth picture of both the conditions of Rywka's life and the mysterious end to her diary.Moving and illuminating, told by a brave young girl whose strong and charismatic voice speaks for millions, Rywka’s Diary is an extraordinary addition to the history of the Holocaust and World War II",
  "genres": [
    "Holocaust",
    "Nonfiction",
    "History",
    "World War II",
    "Biography",
    "War",
    "Memoir"
  ],
  "author": "Rywka Lipszyc",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/24331499-rywka-s-diary"
}