{
  "title": "Monet's Palate Cookbook: The Artist & His Kitchen Garden At Giverny",
  "description": "Foreword by Meryl Streep.For the first time in history, Monet’s Palate The Artist & His Kitchen Garden at Giverny brings Claude Monet's beloved kitchen garden back to life. Written by filmmaker Aileen Bordman and garden writer Derek Fell, the book includes sixty recipes linked to Monet's two-acre kitchen garden near his home at Giverny, France. Included is detailed information about the vegetables he grew, plus photographs and descriptions of the house interiors and gardens capturing Monet's extraordinary lifestyle. Meryl Streep has written the Foreword and the recipes beautifully photographed by Steven Rothfeld. The farm-to-table tradition lived passionately by Claude Monet has been brought into the 21st century which beckons one to take a culinary journey in Monet's footsteps. The backdrop to the renaissance of the garden are chapters that cover Monet’s lifestyle including French tips for entertaining as well as recipes inspired by his cooking journals and places he visited. The recipes were developed using the abundance of fresh herbs and vegetables found in Monet's kitchen garden. Some of Monet's favorites to grow in the kitchen garden included zucchini, cherry tomatoes, radishes, pearl onions, brussel sprouts, asparagus, rosemary and mint. A few of the recipes are of French origin, such as the famous Normandy apple tart. Others are from locations abroad where he traveled in search of motifs to paint, such as the Savoy Hotel, London where Monet acquired their recipe for Yorkshire pudding. Exquisite photography and inspired recipes brings Monet’s kitchen garden back to life. Aileen Bordman is the creator and producer of the acclaimed documentary film titled Monet's A Gastronomic View from the Garden, which has been broadcast nationally through American Public Television to all 350 PBS stations. She has been immersed in the world of Claude Monet since 1980 and has more than 35 years of firsthand experience at Monet's home and gardens. Her knowledge and passion with respect to Claude Monet's lifestyle, cuisine, gardens and art prompted the creation of the Monet's Palate concept. Bordman independently wrote and produced the film Monet's Palate with Meryl Streep, Alice Waters, Daniel Boulud, Michel Richard and Steve Wynn. The film has been screened from Cannes to New York, and was featured during the six-month \"Monet's Garden\" exhibit at the New York Botanical Garden in New She lives in just outside of New York City in New Jersey. Derek Fell writer and photographer, is the author of two books on Monet, The Magic of Monet's Garden and Secret's of Monet's Garden. He has a strong following as America's most widely published garden writer. His books on gardening, travel and art have been published worldwide and total more than 2.5 million books. He divides his time between Bucks County, Pennsylvania, and Sanibel Island, Florida.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Art",
    "France",
    "Nonfiction"
  ],
  "author": "Aileen Bordman",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/24345928-monet-s-palate-cookbook"
}