{
  "title": "Your New Prime: 30 Days to Better Sex, Eternal Strength, and a Kick-Ass Life After 40",
  "description": "“If you want to live life of passion and excellence as you age, this is your blueprint.” —Tony Robbins, New York Times #1 Bestseller, Entrepreneur, and Peak Performance Strategist---Feel great and perform at your best in the boardroom, weight room, bedroom, and beyond with this indispensable health and wellness guide: Your New Prime debunks current thinking about men’s health and shows how every man can continue to operate at his peak at any age.Getting older may be inevitable, but in Your New Prime, serial entrepreneur and men’s health expert Craig Cooper shows men that they don’t have to accept the “natural” aging process. Based on the latest scientific research and Cooper’s personal experience warding off diabetes, preventing cancer, and naturally increasing his own testosterone, Your New Prime is a comprehensive guide to the questions every man has as he ages. Tailored specifically for the “New Primers,” men forty years old and up, the book covers a wide range of vital topics—from improving sexual health and the impact of decreasing testosterone to proper nutrition, preventing memory loss, surviving the “mid-life crisis,” and achieving peak physical fitness.Your New Prime provides an indispensable 30-day program designed to help you lose weight, boost energy, and transform eating habits. Divided into easy-to-navigate sections, the book also contains essential information about how to influence “epigenetic” traits and reverse the effects of aging, while quizzes, audits, charts, tables, and callouts help readers determine and address their specific personal needs.Practical, honest, and vitally informative, Your New Prime details a lifelong strategy for maximum health—and will help any man perform his best, no matter what his age.---“Craig Cooper offers up great information to men who are looking to maximize their potential at any age. He has a passion for helping men be their best in all facets of life.” —Laird Hamilton, Big Wave Surfer, World-Renowned Waterman and New York Times Bestselling Author of Force of Nature: Mind, Body, Soul, and, of Course, Surfing",
  "genres": [
    "Fitness",
    "Health"
  ],
  "author": "Craig Cooper",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/24336394-your-new-prime"
}