{
  "title": "Nutrition: An Applied Approach",
  "description": "Bring your nutrition course into focus! \"Nutrition: An Applied Approach,\" Fourth Edition introduces you to nutrition with an innovative, applied format that discourages rote memorization and promotes long-term understanding of the material. Building on your natural interest in nutrition, the authors demonstrate in a clear, conversational style how key nutritional information relates to your personal health and nutrition, and show how to debunk commonly held misconceptions. The applied approach is reflected in the functional organization of the micronutrient chapters, focusing on the vitamins and minerals and their primary functions within the body. The applied content is focused on key content areas: fluid and electrolyte balance, antioxidant function, bone health, and energy metabolism and blood health-topics of particular importance to instructors. You can easily grasp this accessible conceptual framework for understanding the role nutrients play in bodies and overall health. The Fourth Edition features MasteringNutrition(TM), an online homework, assessment, and tutorial system that allows instructors to personalize the nutrition course like never before with next generation course management tools. Master topics through interactive mini-lessons, quizzing, and immediate wrong-answer feedback. This program will provide a better teaching and learning experience-for you. Here's how: Personalize learning with MasteringNutrition Improve results quickly by mastering concepts from self-paced tutorials that feature immediate wrong-answer feedback and hints that emulate the office-hour experience to keep you on track. Help students visualize and understand tough topics: All-New Focus Figures appear in bold, full-page displays throughout the text to help teach you the toughest topics in nutrition. Emphasize applications: Practice core nutrition concepts by using MyDietAnalysis, a software system that allows you to complete a diet assignment and then enter the information to create a variety of reports, in addition to other tools. Note: You are purchasing a standalone product; MasteringNutrition does not come packaged with this content. If you would like to purchase both the physical text and MasteringNutrition search for ISBN-10: 0321908740/ISBN-13: 9780321908742. That package includes ISBN-10: 0321910397/ISBN-13: 9780321910394 and ISBN-10: 0321956737/ISBN-13: 9780321956736. MasteringNutrition is not a self-paced technology and should only be purchased when required by an instructor.",
  "genres": [
    "Nutrition",
    "Reference",
    "Nonfiction",
    "Textbooks",
    "College"
  ],
  "author": "Janice L. Thompson",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/24332893-nutrition"
}