{
  "title": "The Oxford History of Byzantium",
  "description": "The Oxford History of Byzantium is the only history to provide in concise form detailed coverage of Byzantium from its Roman beginnings to the fall of Constantinople and assimilation into the Turkish Empire. Lively essays and beautiful illustrations portray the emergence and development of a distinctive civilization, covering the period from the fourth century to the mid-fifteenth century. The authors - all working at the cutting edge of their particular fields - outline the political history of the Byzantine state and bring to life the evolution of a colourful culture.In AD 324, the Emperor Constantine the Great chose Byzantion, an ancient Greek colony at the mouth of the Thracian Bosphorous, as his imperial residence. He renamed the place 'Constaninopolis nova Roma', 'Constantinople, the new Rome' and the city (modern Istanbul) became the Eastern capital of the later Roman empire. The new Rome outlived the old and Constantine's successors continued to regard themselves as the legitimate emperors of Rome, just as their subjects called themselves Romaioi, or Romans long after they had forgotten the Latin language. In the sixteenth century, Western humanists gave this eastern Roman empire ruled from Constantinople the epithet 'Byzantine'.Against a backdrop of stories of emperors, intrigues, battles, and bishops, this Oxford History uncovers the hidden mechanisms - economic, social, and demographic - that underlay the history of events. The authors explore everyday life in cities and villages, manufacture and trade, machinery of government, the church as an instrument of state, minorities, education, literary activity, beliefs and superstitions, monasticism, iconoclasm, the rise of Islam, and the fusion with Western, or Latin, culture. Byzantium linked the ancient and modern worlds, shaping traditions and handing down to both Eastern and Western civilization a vibrant legacy.",
  "genres": [
    "History",
    "Nonfiction",
    "Medieval",
    "Greece",
    "Historical",
    "Ancient History",
    "World History"
  ],
  "author": "Cyril Mango",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/1148136.The_Oxford_History_of_Byzantium"
}