{
  "title": "Inside the O'Briens",
  "description": "From award-winning, New York Times bestselling author and neuroscientist Lisa Genova comes a powerful new novel that does for Huntington’s Disease what her debut Still Alice did for Alzheimer’s.Joe O’Brien is a forty-four-year-old police officer from the Irish Catholic neighborhood of Charlestown, Massachusetts. A devoted husband, proud father of four children in their twenties, and respected officer, Joe begins experiencing bouts of disorganized thinking, uncharacteristic temper outbursts, and strange, involuntary movements. He initially attributes these episodes to the stress of his job, but as these symptoms worsen, he agrees to see a neurologist and is handed a diagnosis that will change his and his family’s lives forever: Huntington’s Disease. Huntington’s is a lethal neurodegenerative disease with no treatment and no cure. Each of Joe’s four children has a 50 percent chance of inheriting their father’s disease, and a simple blood test can reveal their genetic fate. While watching her potential future in her father’s escalating symptoms, twenty-one-year-old daughter Katie struggles with the questions this test imposes on her young adult life. Does she want to know? What if she’s gene positive? Can she live with the constant anxiety of not knowing? As Joe’s symptoms worsen and he’s eventually stripped of his badge and more, Joe struggles to maintain hope and a sense of purpose, while Katie and her siblings must find the courage to either live a life “at risk” or learn their fate. Praised for writing that “explores the resilience of the human spirit” (The San Francisco Chronicle), Lisa Genova has once again delivered a novel as powerful and unforgettable as the human insights at its core.",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Audiobook",
    "Medical",
    "Family",
    "Adult"
  ],
  "author": "Lisa Genova",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/24358129-inside-the-o-briens"
}