{
  "title": "Franklin and Lucy",
  "description": "Franklin Delano Roosevelt was arguably the greatest figure of the twentieth century. While FDR’s official circle was predominantly male, it was his relationships with women–particularly with Lucy Mercer Rutherfurd–that most vividly bring to light the human being beneath this towering statesman. It is no coincidence that Rutherfurd was with Roosevelt the day he died in Warm Springs, Georgia, along with two other close women companions. In Franklin and Lucy, acclaimed author and historian Joseph E. Persico explores FDR’s romance with Lucy Rutherfurd, which was far deeper and lasted much longer than was previously acknowledged. Persico’s provocative conclusions about their relationship are informed by a revealing range of sources, including never-before-published letters and documents from Lucy Rutherfurd’s estate that attest to the intensity and scope of the affair.FDR’s connection with Lucy also creates an opportunity for Persico to take a more penetrating look at the other women in FDR’s life. We come to see more clearly how FDR’s infidelity as a husband contributed to Eleanor’s eventual transformation from a repressed Victorian to perhaps the greatest American woman of her century; how the shaping hand of FDR’s strong-willed mother helped to imbue him with the resolve to overcome personal and public adversity throughout his life; and how other women around FDR, including his “surrogate spouse,” Missy LeHand, and his close confidante, the obscure Margaret “Daisy” Suckley, completed the world that he inhabited. Franklin and Lucy is an extraordinary look at the private life of a leader who continues to fascinate scholars and the general public alike. In focusing on Lucy Rutherfurd and the myriad women who mattered to Roosevelt, Persico paints a more intimate portrait than we have heretofore had of this enigmatic giant of American history.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Presidents",
    "American History",
    "Politics",
    "Us Presidents"
  ],
  "author": "Joseph E. Persico",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/2435658.Franklin_and_Lucy"
}