{
  "title": "The Old Doll",
  "description": "ABOUT THE BOOKTHE OLD DOLL tells the story of a doll, Aimee, who, because she is now old, disabled, and soiled, is rejected by Gertrude, the little girl who owns her. Gertrude's mother takes Aimee to the doll hospital to have her restored. Having undergone the appropriate procedures at the doll hospital, Aimee is now more attractive than ever. She is grateful to the hospital staff for all they did for her, and when Gertrude's mother refuses to pay for the work done, Aimee decides to stay at the hospital so she can be of help to dolls who may, in the future, come to the hospital and may need love and encouragement, as she did. The moral of THE OLD DOLL will not escape readers, young or old.ABOUT THE AUTHORBorn in Israel (then called \"Palestine\"), Judith Weinshall Liberman came to the United States in 1947 to pursue higher education. She earned four American university degrees including two in law, a J.D. from the University of Chicago Law School and an LL.M. from the University of Michigan Law School. After settling in the Boston area in 1956, she studied art and creative writing. Beginning in the early 1960s, and for four decades thereafter, Ms. Liberman created numerous series of artworks. Her art has been widely exhibited, and is represented in the collection of museums and other public institutions. During her long career in visual art, Ms. Liberman wrote several books, among them some children's books. Her book THE BIRD'S LAST SONG (Addison-Wesley, 1976), which she also illustrated, won a citation as one of the \"fabulous books of the year.\" Since 2012, she has published several additional picture books, including ICE CREAM SNOW (2012), THE LITTLE FAIRY (2013), COLOR IN OUR WORLD (2014), THE VERY OLD PAINTER AND HER HUSBAND (2014), HAIFA (2014), ANGEL'S PUPPIES (2014), THE GIANT HOUSE (2014), THE BEE AND THE BUTTERFLY (2014), THE MOUNTAIN (2014), and THE TUNNEL (2014). Judith Weinshall Liberman's archives can be found in the Arts Department of the Boston Public Library and at the Smithsonian Archives of American Art.ABOUT THE ILLUSTRATORThis is the seventh book on which Judith Weinshall Liberman, the author, has collaborated with Gail Davis, the illustrator. Since she did not feel that, in light of her deteriorated eyesight, she could do justice to illustrating THE OLD DOLL herself, Ms. Liberman selected a fine artist, Ms. Gail Davis, to create the illustrations under the author's guidance. The two had previously collaborated on THE LITTLE FAIRY, on THE VERY OLD PAINTER AND HER HUSBAND, on ANGEL'S PUPPIES, on THE GIANT HOUSE, on THE MOUNTAIN, and on THE TUNNEL. In the present book, Ms. Davis beautifully captures the spirit of the story and of its characters.",
  "genres": [],
  "author": "Judith Weinshall Liberman",
  "average_rating": "1.00",
  "url": "https://www.goodreads.com/book/show/24347750-the-old-doll"
}