{
  "title": "Beyond the Consequences",
  "description": "From New York Times bestselling author Aleatha Romig comes more of the suspenseful romantic thriller about secrets and deception, passion and love, choices and consequences. Secrets and deception As the pieces of their puzzle come together, Anthony and Claire Rawlings continue to defy the odds. Together they overcame an incomprehensible beginning. Apart they endured unimaginable heartache. Reunited with family and friends, their journey continues as they navigate a dangerous world where secrets threaten to destroy what they hold the most dear. Passion and love Tony and Claire turn up the heat as sparks fly, passion rages, and love prevails. With only a dark glance or devilish grin, the fire that sparked in an isolated suite, continues to burn. Though no longer willing to be less than Tony’s equal in life, behind closed doors only one man makes the rules. Choices and consequences The safety of the Rawlings family is not debatable, and only Phillip Roach can assure that they are not disappointed. Learn how he leads old friends and new associates through the dangerous world of delusion and revenge. The choices he makes for both the family and his personal life will have consequences. Beyond the Consequences is a novel that began as the novella, A Peek Beyond the Consequences, in a limited-release anthology, Breathless. Since its publication in 2014, Beyond the Consequences has more than tripled in length with more action, heat, and secrets to reveal. Learn once and for all the identity and fate of the sender of the Rawls-Nichols letters as you join the Rawlings for a special surprise!Theirs was a long, complicated story with a monster and a knight. What made their story unique was that these two players were the same person. — Aleatha Romig, Convicted",
  "genres": [
    "Romance",
    "Dark",
    "Dark Romance",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "Adult"
  ],
  "author": "Aleatha Romig",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/24356706-beyond-the-consequences"
}