{
  "title": "The Reunion",
  "description": "A fiercely funny, sometimes sad but endlessly entertaining read.\nNow you see, what you're meant to do in any mid-life crisis worth having is go out and buy yourself a shiny new and very fast motorcycle.Trouble is, they’ve already been through that fast motorcycle stage.So that’s not the quick fix to cure a sudden bout of middle age boredom. And besides, it’s not only boredom. It's the fear that they're past their best.Now, it’s time for the pipe, slippers and reading glasses... Or is it? Maybe one quick phone call...A deserted car park in northern England.It's dark - It's cold - It's miserable.A solitary figure glances up and down the road, then checks his watch.... again.It's Yorkshire - It's 2010 - And it's looking like rain. It's also the beginning of one of those peculiarly British adventure stories. But, to paraphrase Pulp Fiction's Vincent Vega, this one's just that little bit different.The storyline revolves around a bunch of fifty-something-year-old-men who are all, in one way or another, stuck in their own private mid-life crisis. All they seem to have left now are memories of days long past, days when they were younger, tougher and healthier - A time when they were members of The No Name Motorcycle Club.To these guys it feels like only yesterday when they were young, strong, fit and fearless bikers...... But that was over thirty years ago, and time hasn't been very kind.It's now 2010 and they're fat, they're old, they're bald and they're bored .... then out of the blue they're called back together and the long defunct club prepares to head out on its final adventure. The fun, laughs and adventures of the past could begin again, as the last living members of the once strong No Name MC ride again for the ultimate road trip.Sometimes life throws you the odd bone - these men caught one.Read The Reunion.Kindle/Paperback from Amazon - Product Page",
  "genres": [],
  "author": "Jack Elgos",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/24348484-the-reunion"
}