{
  "title": "Secrets At Maple Syrup Farm",
  "description": "A small town, opposites attract romance, perfect for cozying up with by the fire this Autumn.‘Rebecca’s stories are like a warm hug, gently enticing you into the heart of Ashford life, making you feel you belong there… an absolute joy from start to finish’ ⭐⭐⭐⭐⭐ – Paris Baker’s Book NookLucy would do anything for her mom…but she never expected to end up promising to leave her. After her mom got sick, Lucy dropped everything to take care of her, working all hours in a greasy diner just to make ends meet and spending every spare moments she had by her mom’s hospital bedside.Now, Lucy is faced with a whole year of living by her own rules, starting by taking the first bus out of town to anywhere…Except she didn’t expect to find her next big adventure just around the corner! Especially when on her first day in town she bumps into grumpy, but oh-so-delicious Clay amidst the maple trees. Surrounded by the magic of Ashford, Lucy has the chance to change her life forever and finally discover a life she wants to live!Fall in love with Ashford, Connecticut in this dazzling and beautiful romance from bestselling author Rebecca Raisin.What readers are saying about Secrets at Maple Syrup Farm‘[Rebecca Raisin] is a modern Maeve Binchy’ – Books for Bunny‘A touching story mixed with laughter and secrets, a reminder of how important it is to live your own life’ – Reviewed the Book‘I smiled, laughed and cried throughout Secrets at Maple Syrup Farm. If you like me are looking for a read that will pull at your heart strings, make you smile and awww then this is a book for you.’ – Crooks on Books‘another wonderful story set in Ashford and her beautiful writing always adds this unique atmosphere.’ – Sky’s Book Corner",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction",
    "Contemporary Romance",
    "Womens Fiction",
    "Audiobook",
    "Chick Lit"
  ],
  "author": "Rebecca Raisin",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/24365015-secrets-at-maple-syrup-farm"
}