{
  "title": "Kestrel",
  "description": "Kestrel (A Hart Brothers Novel) *This is a STAND ALONE Novel*Not intended for readers under the age of 18 due to its mature content and strong language.Two lives with broken pasts no one can imagine. One encounter that changed them both forever.“One look at her and I want to run. Frizzy hair, thick glasses, mom jeans, and ruffles up to her neck. Who the hell wears shit like that? What decade is she living in? My mother doesn’t even dress like that!”Kestrel is a survivor. The monster who raised him is dead and he’s now building a new life for himself, shedding his dark and twisted past. He moves away from his family, but a surprise awaits him. Her name is Carter.Carter is also a survivor. Her past is every bit as horrid as Kestrel’s. But she has a secret. In order to protect it, she proposes something so foreign, so outrageous, even she is shocked.Carter needs love. Kestrel craves human contact. Neither of them recognizes what’s right before their eyes. Will they see it before it’s too late?“I’ll do anything you want. Anything.” Then something comes over me. Call it madness. Desperation. Insanity. Call it whatever you want. I step right up to him, put my hands on his shoulders, and I kiss him. He stands there like a chunk of stone. So I press my body up to him, and rub myself against him. I open my mouth and run my tongue over his lips, and then push it into his mouth. Nothing. No response. Humiliation sets in. I am not this girl. I’m the classic nerd. I don’t have boyfriends. Where is this coming from?He pulls away from me and steps back, rubbing his mouth. “I’m sorry, but you’re not my type.” His features initially register shock. But worse than that, distaste replaces it.That stings. Really stings. But even more dreadful, I am morbidly ashamed of myself. That doesn’t stop me from digging myself into an even deeper hole.“What? Am I not sexy enough? Are my clothes not revealing enough?”“Um, Dr. Drayton, this is more than a bit awkward.”“No, tell me. And my name is Carter.”“You’re propositioning me.” Now I detect a hint of mockery.“No, not propositioning. I want to strike a deal. You see, I’m a desperate woman. And desperate people do all kinds of things.”“Carter, I’m really not interested.”“I know I’m not very attractive, but if you want me to change the way I look, I can do that.”“You don’t understand.”“What? Am I not good enough for you?”His eyes skim me from head to toe. “Good doesn’t have anything to do with it. You’re not bad enough for me.”",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Abuse",
    "Dark",
    "Suspense"
  ],
  "author": "A.M. Hargrove",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/24369492-kestrel"
}