{
  "title": "The Divided Ground: Indians, Settlers, and the Northern Borderland of the American Revolution",
  "description": "In 1761, at a boarding school in New England, a young Mohawk Indian named Joseph Brant first met Samuel Kirkland, the son of a colonial clergyman. They began a long and intense relationship that would redefine North America. For nearly fifty years, their lives intertwined, at first as close friends but later as bitter foes. Kirkland served American expansion as a missionary and agent, promoting Indian conversion and dispossession. Brant pursued an alternative future for the continent by defending an Indian borderland nestled between the British in Canada and the Americans, rather than divided by them.By telling their dramatic story, Alan Taylor illuminates the dual borders that consolidated the new American nation after the Revolution. By constricting Indians within reservation lines, the Americans sought to control their northern boundary with the British Empire, which lingered in Canada. The border became firm as thousands of settlers established farms, held as private property, all around the new reservations. This struggle also pitted the federal government against the leaders of New York, competing to control the lands and the Indians of the border country. They contended for the highest of stakes because the transformation of Indian land constructed the wealth and the power of states, nations, and empires in North America.In addition to land, the frontier contest pivoted on murders, which repeatedly tested who had legal Indians or newcomers. To assert power, the contending regimes sought to try and execute Indians or settlers who killed one another. To defend native autonomy, however, the Indians asserted an alternative by “covering the graves” of victims with presents to console their kin. When the gallows replaced covered graves, the Indians lost their middle position as free peoples.Taylor breaks with the stereotype of Indians as defiant but doomed traditionalists, as noble but futile defenders of ancient ways. In fact, the borderland Indians demonstrated remarkable adaptability and creativity in coping with the contending powers and with the growing numbers of invading settlers. Led by Joseph Brant, the natives tried to manage, rather than entirely to block, the process of settlement. Taylor shows that they did so in ways meant to preserve Indian autonomy and prosperity. Rather than sell lands for a song to governments, the Indians sought greater control and revenue by leasing lands directly to settler tenants. But neither the British nor the American leaders could accept Indians as landlords, as competitors in the construction of power from land in North America. Once a “middle ground,” the borderland became a divided ground, partitioned between the British Empire and the American republic.",
  "genres": [
    "History",
    "Nonfiction",
    "American Revolution",
    "Native American",
    "American History",
    "American",
    "Native American History"
  ],
  "author": "Alan Taylor",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/1148257.The_Divided_Ground"
}