{
  "title": "EROS - Indie Erotica Author Challenge 2015",
  "description": "INTRODUCTION: In an effort to showcase the amazing talent that exists in the world of independent (Indie) authors, and to offer a variety of styles of creative writing to romance and erotica readers around the world, a concept was born in 2014 to pull together a compilation of authors from all sub-genres of romance and erotica for a common goal. The challenge...to write a short story 10,000 to 30,000 words in length in a sub-genre that none of the authors had ever published in...sci-fi and post-apocalypse. The result? EROS – Indie Romance/Erotica Challenge 2015. What better way to display the versatility of these incredibly gifted authors and gain exposure for both well-known and lesser known Indie literary personalities to the general public in a more broadly accessible publication. Each and every author included within these pages retains rights to publish this collection of short stories as well as to publish their individual stories separately to reach the widest audience possible. Included at the end of each story is a brief biography of the author to get to know her/him better and gain insight into their individuality and style of writing. We are very fortunate to have writers from around the globe included in this inaugural volume of EROS, and look forward to adding writers from more countries in the next annual volume, so if you know a great Indie author from a nation not included here, let them know we'll be looking for new talent for the 2016 issue!  Science fiction is a pretty broad term. It can encompass everything from a space odyssey to time travel to adventures into the deep mysteries of the oceans and beyond. Interesting isn't it, though, that much of what was called science fiction in the past has come to pass as science FACT over the decades and centuries since it was first written. A submarine capable of traversing the globe underwater in 20,000 Leagues Under The Sea (Jules Verne)...today a reality...a science fact. Airplanes, spaceships, galactic probes exploring space beyond our own solar system, cloning, and a myriad of other impossibilities that are, today, a collection of common occurrences. Fascinating isn't it that what you read within these pages may very well one day become reality and commonplace? Perhaps, then, science pre-fact would be a more accurate term for our romance and erotica stories contained within these pages?  Post-apocalypse. After the destruction of the modern world as we know it. Total destruction by asteroid? Nuclear wasteland? Chemically or biologically mutated life forms? Cities in ruin? Depraved and debauched human existence beyond annihilation of our governmental and societal systems? Who knows what life would be like after any one of these worst case scenarios took place? Well, as a matter of fact, there are possibilities we haven't thought of...and you can read about them here. From the greatest Indie romance and erotica author minds, you get a glimpse at their alternate reality in a future wasteland of post-apocalyptic disaster, complete with stories of the primal romantic and erotic desires of humanity that can never be extinguished as long as our species persists against all odds.  We (the authors) genuinely hope you enjoy our stories, and look forward to earning you as a loyal fan of our writing. Though you may not love every story here, we hope you find authors here whose stories inspire you to read more and share your love for reading with others. It is truly our PLEASURE to present our tales of science fiction and post-apocalyptic romance and erotica to you, and we thank you for reading Indie!",
  "genres": [],
  "author": "Don Abdul",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/24374872-eros---indie-erotica-author-challenge-2015"
}