{
  "title": "The Heir of Olympus and the Forest Realm",
  "description": "Not availableGordie Leonhart does not understand how he survived a cataclysmic attack upon his hometown, which resulted in the death of his father. After the eruption, he is met by Hermes, who implies that Gordie shares a relationship with Hercules. Gordie does not realize it, but he possesses Herculean strength one day out of every twelve; like his heroic ancestor, he must complete twelve trials—each associated with a different god—in order to unlock his full potential. Gordie is skeptical when Hermes tells him that Zeus is responsible for the attack, but driven by grief and anger, he vows revenge upon the King of Olympus.Hermes, meanwhile, promises to hide Gordie’s survival from Zeus, which he can do because he has sealed the borders between the worlds of gods and men upon Gordie’s birth, trapping the immortals in other parallel planes of existence. Zeus, trapped on his seat of Olympus, has become angry with the mortals for forgetting the power of the gods; he plans to reassert his dominance over the humans, but the Olympians are divided, and Hermes believes that Gordie is the one destined to thwart Zeus’s schemes.Gordie and his mother Ellie travel to her father’s house to escape the pain of their loss. Atalo Anastasios surprises them when he confirms that they are descendants of Hercules, and that his father actually had direct contact with Hephaestus, one of the Olympians, who is holding a family heirloom for them. Ultimately, the boys convince Ellie to travel with them to Greece to find Hephaestus and begin undertaking the trials of the gods.At the airport, Gordie is dumbfounded when he runs into Bridget Clemens—the most popular girl in his class—waiting at the same gate to travel to Europe. Sparks fly, but of course, sixteen-year-old Gordie puts his foot in his mouth before long, and they part ways on bad terms after landing at Heathrow Airport. On the connecting flight from London to Athens, Gordie receives another shock in the form of Hermes, who sends Gordie to Hades in order to retrieve the centaur, Chiron, Master of Heroes. Gordie meets the Lord of the Underworld and succeeds in his first task, set to him by Hades himself; his reward is Chiron’s mentorship.Gordie, Ellie, and Atalo take up residence in Chiron’s home on Mount Pelion, and Chiron adopts the difficult task of training the stubborn adolescent. On a training exercise, Gordie finds himself in a strange and magical forest where he meets a hostile satyr. When Gordie returns to Chiron’s cave, he learns that he had crossed over to the Forest Realm of Dasos, another plane of existence ruled by the same angry satyr whom Gordie had met. Unfortunately, Gordie will later have to return to Dasos to complete one of his trials, and he will meet the great satyr again.It seems that Gordie is one of a select few entities who can traverse the borders between the worlds. But there could be dire consequences if one without that privilege were to sneak their way through. Watch, as Gordie meets members of the Olympic pantheon and completes the first of his twelve trials, all while the worlds teeter on the verge of colliding in The Heir of Olympus and the Forest Realm.",
  "genres": [
    "Fantasy",
    "Young Adult"
  ],
  "author": "Zachary Howe",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/24379558-the-heir-of-olympus-and-the-forest-realm"
}