{
  "title": "The Love God",
  "description": "One of the greatest historical love stories the world has ever seen is not one that is taught in schools. Across much of the pre-Christian Roman Empire sexuality was expressed very differently, but even in Ancient Rome romance can be a dangerous thing when it is with the wrong person.Antinous is handsome, athletic and intelligent, but being the son of a Bithynian fruit trader, his ambition to get to Rome is very distant indeed – that is, until the great Emperor Hadrian appears in his home city of Claudiopolis and their eyes meet across a crowded square. That one look sparks a world of historical romance intrigue for the young Antinous, and he is taken to Rome to be inducted into the Paedagogium, where the noble sons of the city are trained for their future lives. But he can never quite shake his dreams of intimacy with the greatest man in Rome.Hadrian is equally intrigued by the young Bithynian. When the time comes for a tour of his empire, the emperor chooses Antinous as an advisor, and together they set off on the dangerous voyage to the cold lands of the North. Shipwrecked off the coast of Britannia and staying in the royal palace of the Atrebate king, the two men find themselves lost as historical romance gay lovers with passion not seen since the time of Alexander the Great and his general, Hephaestion.But their intimacy and Antinous’ growing influence over Hadrian has aroused the ire of the most powerful woman in the Roman Hadrian’s wife. Scorned in public and determined to uphold the traditions of Ancient Rome romance gay lovers feel for each other is swept aside in a plot to remove the low-born Bithynian from his new-found position of power.Celebrate one of the greatest historical love stories never told by looking in the LOOK INSIDE feature for romance intrigue and the colourful, dangerous world of Ancient Rome.",
  "genres": [
    "Historical Fiction",
    "LGBT"
  ],
  "author": "Martin Campbell",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/24383754-the-love-god"
}