{
  "title": "The Grim Wanderer",
  "description": "Hirandar Firefist has been searching for longer than she can remember. She is aided by her loyal companion Logan Fornor, a once-renowned Sodan warrior, broken by the war on the Border. They travel the realms of Hathlore, seeking the answer to an ancient prophecy, one that leads to death, ruin and darkness.  But Logan's apprentice, Taem, is young and full of hope. He journeys to the great city of Dolam with Forgrun, the brash and proud Rhungar, and Baek, a naive yet secretive man of the forest. Devastation, bandits and Krun raiders shadow their every step.  Hirandar meets them in Dolam, and gathers a disparate company of warriors to follow her. They race for the City of Night, across mountains and wilderness, to stop the Key-Piece falling into the hands of the Cult of the Maliven. But the path is fraught with danger. Dark Servants hunt the companions in the night. Nargs ambush them in the wild. Enemies close in all around, and the warriors begin to suspect a traitor lurks amongst them.  On this treacherous journey, only the legend of the Grim Wanderer can hold the company together.    About the Author  James Wolf is a doctor, who previously spent seven years in the Metropolitan Police - working in drugs, vice and robbery, and finally as a riot police medic. He is a lifelong student of the martial arts, and spent a year in Malaysia being toughened up by a Taekwon-Do master.  The Grim Wanderer is a melting pot of an overactive imagination and James’s real-life experiences – from the uncompromising and inspiring training of a revered Taekwon-Do master, to being in riots and fighting for his life on the dark streets of London, to learning the more compassionate skills of being a doctor and caring for the sick. James has incorporated all the aspects of his life into writing this book.",
  "genres": [],
  "author": "James   Wolf",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/24378682-the-grim-wanderer"
}