{
  "title": "Oltre i confini del tempo",
  "description": "Odyssea non riesce a pensare ad altro: Jacko è partito, abbandonando Wizzieville per andare nel Mondo-Altrove, senza dire se e quando tornerà. Neppure l’inizio dell’ultimo anno scolastico e la vicinanza dei suoi amici, valgono a distoglierla dalla nostalgia che le avvelena l'anima. Né ci riesce la certezza che Squartavene, il mostro più efferato che la storia ricordi, sia in agguato, pronto a pugnalarla alla schiena per impedire che si avveri la profezia che lo vedrà sconfitto per sempre. Disillusa da un futuro che sa di menzogna, Odyssea cercherà di vivere, nonostante tutto, e forse una nuova affascinante conoscenza dagli occhi verdi potrà aiutarla a dimenticare, facendo battere il suo cuore sepolto. Ma è davvero capace di rinunciare a quell’amore così assoluto? Sulle tracce del complice di Squartavene, Odyssea sarà costretta a percorrere strade difficili e tortuose che la condurranno ancora dinanzi al Male. Strade che le sveleranno il doloroso e scottante passato di Jacko, e la porranno di fronte a molti altri inquietanti interrogativi: chi ha liberato Hilda Strawberry dal Maniero di Blackhole? Chi è l’uomo misterioso che spia il figlio di Hilda e Pericle, l’erede di Squartavene, nell’orfanotrofio che lo ospita? Cosa nasconde il Muro di Scarabei nel Quartiere a Est che ha respinto Jacko con efferata violenza e sembra invece attrarre lei come un potente richiamo? Odyssea sa solo una cosa: il suo nemico mortale le dà la caccia. E stavolta è più subdolo e più feroce che mai. Un terzo volume ricco di eventi, ancora più intenso e drammatico dei precedenti, più nero e spietato, in cui Odyssea dovrà vedersela con straordinarie esperienze, tra grifoni domestici e folletti fantasma, notti di Halloween e scope volanti, baci rubati e cuori frantumati, cupe galere e case maledette, malinconici arrivederci e disperati addii che rischieranno di spezzare definitivamente il suo spirito. Il terzo volume della saga magica dedicata a Odyssea Bennet e al suo contrastato amore con Jacko.",
  "genres": [
    "Fantasy",
    "Magic",
    "Romance"
  ],
  "author": "Amabile Giusti",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/24381504-oltre-i-confini-del-tempo"
}