{
  "title": "Hide and Seek",
  "description": "Catch the next “fast-paced thrill ride”* in the Phoenix Code paranormal romantic suspense series from New York Times bestselling authors Lara Adrian and Tina Folsom!Darkly gifted and dangerously skilled, they were once the nation's most powerful asset--until betrayal by unknown enemies sent the Phoenix operatives deep underground. They devoted their lives to the program, sacrificed their futures. Now it's kill or be killed in a desperate race to thwart a hellish event. And with assassins closing in from all sides, desire can be a deadly mistake...HIDE by Lara AdrianJohn “Ranger” Duarte was one of the Phoenix program’s deadliest operatives, a man with a dark past and a ruthless sense of justice. Since the fall of the program, Ranger’s gone deep off-grid in the mountains, preparing for war against his enemies. No one has found him in three years, until a woman in desperate need of help arrives on his doorstep—a woman he once vowed to keep safe. Ranger’s honor demands he uphold his promise, but with premonitions of a looming apocalypse haunting his dreams and killers edging closer by the hour, protecting Lisa Becker is a distraction he can ill afford. And when the passion that sparks between them becomes a flame neither of them can put out, Ranger will be forced to decide between the mission his own life depends on, and the woman he cannot live without.SEEK by Tina FolsomNicholas “Fox” Young, brilliant computer programmer and ex-Phoenix operative, is on a high-tech quest for intel that could bring him one step closer to finding his fellow Phoenix and shed light on the recurring nightmarish premonition that plagues his dreams. But the online cat-and-mouse game he’s been playing with ex-hacker, now CIA-contractor, Michelle Andrews, is elevated to a risky new level when danger thrusts them into a tenuous alliance. Fiery, quick-witted Michelle is a puzzle the cool computer genius cannot resist solving, nor can Nick deny his need for the sensual woman who tempts him like no other. With passion igniting between them and lethal enemies lurking in the shadows, Nick and Michelle must balance their shared determination to expose a deadly secret with the desire that could jeopardize their mission and their lives.Don’t miss the first book, CUT AND RUN, on sale now in trade paperback, ebook, and unabridged audiobook.*Fresh Fiction",
  "genres": [
    "Romance",
    "Paranormal",
    "Suspense",
    "Romantic Suspense",
    "Paranormal Romance",
    "Adult",
    "Anthologies"
  ],
  "author": "Lara Adrian",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/24380828-hide-and-seek"
}