{
  "title": "Kiss Of The Fur Queen",
  "description": "In the 1950s, Abraham Okimasis becomes the first Indian ever to win the Trapper's Festival Dog Sled Race and, as tradition dictates, he is kissed by the festival's beautiful Fur Queen. Nine months afterward, Abraham's wife Mariesis gives birth to their son, Champion, in a tent on a trapline in snowy northern Manitoba. Later, three-year-old Champion watches his brother Ooneemeetoo come into the world in the same tent. The boys grow up in a magical Cree Garden of Eden: stars, fish and caribou are their playmates; canoes and dogsleds transport their nomadic family. Joy and raucous laughter roll across the tundra with them. No English is spoken, no white people cross their path. And everywhere they go, the boys are accompanied by a photo of their father being kissed by the Fur Queen, their guardian angel. At the age of six, Champion is hauled into a plane and whisked to a boarding school three hundred miles south, where he enters a Hell on Earth. His name becomes Jeremiah, and his language is forbidden. His brother later joins him at the school, where the two boys are abused by priests. As young men, they suffer the humiliation of racism on the streets of Winnipeg. Wherever the brothers go, the Fur Queen -- a wily, shape-shifting trickster -- looks after them protectively. For Jeremiah and Gabriel (as Ooneemeetoo is now called) are destined to be artists. Through music and dance, the Okimasis brothers flourish in the world. Until tragedy sneaks up on them. Kiss of the Fur Queen fuses Native story-telling techniques with European narrative form to create an engaging, funny, passionate, and triumphant novel of a uniquely Canadian experience: that of being a stranger in yourown land.",
  "genres": [
    "Fiction",
    "Canada",
    "Indigenous",
    "Historical Fiction",
    "Queer",
    "Canadian Literature",
    "LGBT"
  ],
  "author": "Tomson Highway",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/1148403.Kiss_Of_The_Fur_Queen"
}