{
  "title": "Tamed By Him - Book Three: The Billionaire's Strict Requirement",
  "description": "'\"You don't have to do this, Lindsay. It sounds dangerous to me. And expensive too.\" Marco Friedlander barked at his fired up investigative reporter on the other end of the line. He gripped his phone tightly in his hand. He was worried about the risks involved in the plan that Lindsay Day had outlined to him and it was more than just professional concern. Why he had ever hired her was a mystery to him now. With the history they shared together and the feelings he had for her, it was a crazy idea. \"Stop being such a mom, Marco,\" Lindsay insisted, playing down the risks involved in her latest venture. \"This is what I do. I'm an investigative journalist; it's in the job description.\"\"Not the one I gave you. And what about Nena? Doesn't she figure in any of this?\"Nena was Lindsay's eight-year-old niece. She had taken legal guardianship of the little girl after her sister tragically passed away just one year earlier. It was a low blow from Marco to bring her into it, but then again, he did have a point.\"This has nothing to do with her and besides, nothing is going to happen to me. I'm onto something really big here that could be huge for AltNews.org. We could be in for a Goldsmith Prize for investigative journalism with this one.\"\"Is a Goldsmith Prize worth your life? Or Nena's for that matter?\"\"It's not that big a deal.\"\"It's the Russian mob. It doesn't get much more big a deal than that.\"\"Jesus, Marco, I'm not parachuting into a warzone. This is all old history. No-one who really matters gives a damn about Mikhail Boyevik, but I'm telling you, I can feel that there's a massive human interest story in there somewhere. I just know it.\"\"What is it with you and Boyevik? Look, the guy only went off the radar a week ago. He's probably just living it up with strippers and cocaine in some Black Sea Mafia holiday resort. You don’t need to go anywhere looking for him. Just sit tight and he'll show up stateside again in a week or two.\"\"It's way more than that. He was up to something. He was ready to make a comeback and now suddenly he's gone. I've been getting closer to him for months, and now 'poof', he disappears into thin air. If we let this one go then AltNews deserves to die.\"One low blow deserves another, she thought. She liked Marco but their relationship had always been so strange, even when they had been back in college together. Marco sighed. He knew all too well who and what he was up against. Lindsay had always been this way–all passionate determination and no forethought. It was in her DNA. It made her a fearless reporter and then when her sister had passed away, she had reacted with the same unstoppable instinct, taking on the guardianship of her young niece without a second thought, but he knew it would eventually get her into trouble one day. On the other hand, he had to admit that despite the added responsibilities of guardianship, Lindsay hadn't once dropped the ball professionally. Now she wanted him to pay for a trip to Australia to follow up on the disappearance of notorious Russian mobster, Mikhail Boyevik. Couldn't she just stick to local political and showbiz scandals or general human interest stories? But if she did that she wouldn't be Lindsay Day and as yet, she had never let him down.'From the moment he lays eyes on her Dale Hargrave knows he has to have her. What he doesn’t know is that Lindsay day has a secret to hide that will ruin him, his brother Clayton and his friend Ruben Mayweather. One way or the other he wants the feisty woman in his bed but Lindsay Day is a seasoned investigative reporter and knows how to give as good as she gets and much more again.",
  "genres": [
    "Erotica"
  ],
  "author": "Drew Sinclair",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/24396953-tamed-by-him---book-three"
}