{
  "title": "Confessions of a Heartbreaker",
  "description": "For high school senior, Parker Montgomery, life is pretty damn awesome. With his good looks and easy charm, girls have always fallen right into his lap. Which FYI- is precisely where he likes them. Sure, it can be something of a curse, but it's one he thoroughly enjoys taking advantage of. And he can always rely on his best friend, Max, to have his back. A little added side bonus to that friendship- Parker is continually reminded by Max's rollercoaster of a relationship (the guy was, after all, stabbed with a spork) just as to why he has absolutely zero interest in being tied down. Parker's idea of a long term commitment consists of a few pleasant hours spent fooling around in a dark room. And then there's football. Yep, he pretty much lives and breathes it. Unfortunately for Parker, life is just about to nosedive before exploding into a fiery ball of flames because senior literature isn't going so well for him. And his teacher, Ms. Fisk (whom he not-so-lovingly refers to as an old bat) has called his parents to set him up with a tutor. With an ultimatum between raising his grade or sitting out for the season, Parker has no other choice but to begrudgingly meet with a tutor three times a week. Now throw in a girl who thinks he's nothing more than a walking STD and Parker suddenly finds himself doing all the chasing. If that wasn't enough to make him feel as if the world hasn't totally fallen off it's axis, this girl has relegated him to some strange realm called the friend zone. And he's pretty sure she doesn't mean friends-with-benefits either... Is it possible that Parker Montgomery has finally found the one girl worth changing for? Will he somehow be able to prove to her that even a man-whore like himself can be reformed? This is a Mature Young Adult Novel",
  "genres": [
    "Young Adult",
    "Romance",
    "High School",
    "Young Adult Romance",
    "Contemporary",
    "Humor",
    "Sports Romance"
  ],
  "author": "Jennifer Sucevic",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/24397105-confessions-of-a-heartbreaker"
}