{
  "title": "Sniper One: The Blistering True Story Of A British Battle Group Under Siege",
  "description": "Sniper One is the gritty, awe-inspiring true story that takes you right into the heart of the Iraq war from Sunday Times No.1 bestseller Sgt. Dan Mills. 'One of the best first-hand accounts of combat that I've ever read' Andy McNab We all saw it at once. Half a dozen voices screamed 'Grenade!' simultaneously. Then everything went into slow motion. The grenade took an age to travel through its 20 metre arc. A dark, small oval-shaped package of misery the size of a peach ... April 2004: Dan Mills and his platoon of snipers fly into southern Iraq, part of an infantry battalion sent to win hearts and minds. They were soon fighting for their lives. Back home we were told they were peacekeeping. But there was no peace to keep. Because within days of arriving in theatre, Mills and his men were caught up in the longest, most sustained fire fight British troops had faced for over fifty years. This awe-inspiring account tells of total war in throat-burning winds and fifty-degree heat, blasted by mortars and surrounded by heavily armed militias. For six months, they fought isolated, besieged and under constant enemy fire. Their heroic stand a modern-day Rorke's Drift. ************** Dan Mills served for 24 years as an Infantry Soldier reaching the rank of Warrant Officer Class 2. During his long military career he served on operations in Northern Ireland, Bosnia, Kosovo, Iraq and Afghanistan. Dan was awarded a 'Mention In Despatches' for Gallantry for his services during The Iraq War. Since leaving the Army in 2010, he has forged a career as a writer and security consultant, amongst other things. Sniper One is his first book.",
  "genres": [
    "Military Fiction",
    "Nonfiction",
    "War",
    "History",
    "Military History",
    "Biography",
    "Autobiography"
  ],
  "author": "Dan Mills",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/2439931.Sniper_One"
}