{
  "title": "The Denim Blue Sea",
  "description": "New York Times bestselling author Joanne DeMaio returns to seaside Stony Point in this novel filled with beach friends, love, and the enchantment of a sandy boardwalk winding along the shore.During two August weeks, denim designer Maris Carrington and coastal architect Jason Barlow prepare for their much-anticipated wedding. Guests arrive early, turning keys in charming cottage doors to begin their New England summer escape. The wedding is a reason for old friends to gather again; to meet in their shabby beach hangout and get the jukebox cranking; to walk that weathered boardwalk beneath a starry sky; to breathe the sweet salt air. \"Cures what ails you,\" one of the friends, Neil, always said long before his life was sadly claimed. But his legacy was not.When Maris discovers Neil's long-lost journal, its passages reveal a heartbreaking secret. Can truths be found within its timeworn pages? Can this leather-bound journal unite the friends as their lives begin to fray? A bittersweet family reunion, a surprising encounter from a devastating accident, a shocking confession leaving one marriage shattered--all will test the once close-knit circle. Suddenly this safe haven on the tranquil Connecticut shoreline churns with emotional turmoil, threatening even the beach wedding just days before it is to happen.Yet like a silver cap on a breaking wave, love and friendship wash ashore with hope, ever shimmering, in \nThe Denim Blue Sea.\nThe Seaside Saga Reading Order:Book 1 - Blue Jeans and Coffee BeansBook 2 - The Denim Blue SeaBook 3 - Beach BluesBook 4 - Beach BreezeBook 5 - The Beach InnBook 6 - Beach BlissBook 7 - Castaway CottageBook 8 - Night BeachBook 9 - Little Beach BungalowBook 10 - Every SummerBook 11 - Salt Air SecretsBook 12 - Stony Point SummerBook 13 - The BeachgoersBook 14 - Shore RoadBook 15 - The WaitBook 16 - The GoodbyeBook 17 - The BarlowsBook 18 - The VisitorBook 19 - Stairway to the SeaAnd more Seaside Saga Books",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit"
  ],
  "author": "Joanne DeMaio",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/24404896-the-denim-blue-sea"
}