{
  "title": "Designer Relationships: A Guide to Happy Monogamy, Positive Polyamory, and Optimistic Open Relationships",
  "description": "Contemporary relationships are in a state of rapid evolution. These changes can and should empower people with the opportunity to develop partnerships based on their own sexualities, understandings, and agreements. This makes it possible to create what Kenneth Haslam, founder of the Kinsey Institute’s Polyamory Archive, has called “designer relationships.”Designer relationships may encompass: people who bond emotionally but not sexually; people who agree to be non-exclusive; single people who have occasional lovers or friends with benefits; couples who consciously choose to be monogamous; multiple partner configurations where long-term bonds exist among all or some; partnerships in which people are kinky and that make room to explore kink.The possibilities are limitless, and thinking about a partnership as something people can craft allows for flexibility and change. Relationships can open and close or have varying degrees and kinds of openness as circumstances demand. In the context of a designer relationship, decisions are made mutually, consciously, and deliberately.Designer Relationships will show you how to create the relationship that works for you, based on: · Free and enthusiastic choice.· Mutuality in defining the relationship and its structure.· Permission to consider all forms of relating.· Dedication to maintaining radical regard your partner(s).· Transparency about sexual history.Best-selling authors and nationally known relationship experts Patricia Johnson and Mark A. Michaels are exemplars of this life choice. This book explains exactly how you and your loved ones can design your own life and love.Editorial ReviewsReview\"Michaels and Johnson's latest book on Designer Relationships takes my book, The New Monogamy one step further, past communication skills about monogamy agreements and into new ways to be transparent about all types of revolutionary forms of commitment that will take us forward into the 21st Century. Where my book left off, theirs continues and includes all the information any couple could ever want or need to create loving, open partnerships. Where most books only offer history and data, Mark and Patricia give practical advice and ground rules for trust, empathy and intimacy for collaborative non-monogamous relationship. We all need a book like this that integrates good tips and techniques and the words to define what we want from a partner; the freedom to choose. Whatever you are looking for, it is in this book. Written by a couple who really love one another and are committed to their work, this book comes at the perfect time, I am convinced it will help a lot of people.\"–Dr. Tammy Nelson, Author of The New Monogamy and Getting the Sex You Want\"Thoughtful, honest and powerful! Reading this book is like rubbing a lamp to get your own Genie – but instead of magic, you’ll get practical guidance on how to create the relationship that’s ideal for you. Mark Michaels and Patricia Johnson speak from experience, lead from the heart, and open a space for true sexual freedom.\"–– Ricci Joy Levy, Executive Director, The Woodhull Sexual Freedom Alliance\"Patricia Johnson and Mark Michaels explore far beyond one-size-fits-all coupling to a rainbow of choices, showing us all that the only ways our relationships are supposed to be are the ways we choose with one beautifully stated guideline: “Keep kindness as your touchstone.”\"–– Dossie Easton, Author of The Ethical Slut: A Practical Guide to Polyamory, Open Relationships & Other Adventures and Radical Ecstasy.\"How would you live and love if society, religion, and the media weren’t constantly “shoulding” all over you?\" –– Jenny Block“Designer Relationships: A Guide to Happy Monogamy, Positive Polyamory, and Optimistic Open Relationships by Mark Michaels and Patricia Johnson is an insightful read into the different types of sexual and romantic relationships, It debunks the myths that tell us there is one type that works for everyone. It also imparts wisdom on how to navigate relationships for whichever type you find yourself in. I found this book to be a great starter guide for designing relationships that work for you.\"–Dr. Martha Tara Lee, author of Love, Sex and Everything In Between\"I would highly recommend Designer Relationships to any couple who wants to explore opening up and wants to strengthen their relationship.\"–Shervon Laurice, MS, LCPC, LPCFrom the foreword:\"Designer Relationships is a guidebook for these changing times and what is now available to anyone with a computer, a modicum of curiosity, and the willingness to take a risk and explore.\"–Ken Haslam, founder, Polyamory Archives of the Kinsey Institute",
  "genres": [
    "Relationships",
    "Nonfiction",
    "Polyamory",
    "Self Help",
    "Sexuality",
    "Audiobook",
    "Psychology"
  ],
  "author": "Mark A. Michaels",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/24402980-designer-relationships"
}