{
  "title": "Die verlorene Ehre der Katharina Blum",
  "description": "Die junge anständige Haushälterin Katharina Blum lernt beim Tanzen den Betrüger und Bundeswehrdeserteur Ludwig Götten kennen, verliebt sich, verbringt die Nacht mit ihm und verhilft ihm am nächsten Tag zur Flucht. In der Annahme, sie sei eine Komplizin des vermeintlichen Terroristen Götten, wird die unbescholtene, von Bekannten als prüde angesehene Blum am Morgen verhaftet und gerät sofort ins erbarmungslose Visier einer auflagenstarken Boulevardzeitung.Nach der verleumderischen, verlogenen Berichterstattung, nach beruflicher und sozialer Degradierung durch ihren einstigen Arbeitgeber und unter wachsendem psychischem Druck entlädt sich Katharinas Verzweiflung in der Ermordung des skrupellosen Reporters Tötges.Wie Gewalt entstehen und wohin sie führen kann, lautet der Untertitel von Heinrich Bölls Erzählung. Bevor „Die verlorene Ehre der Katharina Blum“ mit einer Startauflage von 100 000 Exemplaren auf den Markt kam, druckte „Der Spiegel“ Bölls erfolgreichstes Werk in mehreren Folgen ab. Das Buch wurde in mehrere Sprachen übersetzt, für die Bühne dramatisiert und 1975 von Volker Schlöndorff verfilmt.Aufbau: Ein Erzähler berichtet in 58 Abschnitten Hintergründe des Mordes an dem Journalisten. Er stützt sich auf fiktive Quellen, insbesondere auf Vernehmungsprotokolle. Sein Bericht ist angereichert mit persönlichen, oft ironischen Kommentaren, die seine Sympathie mit Katharina und den anderen Opfern der Hetzkampagne widerspiegeln.Entstehung: Anfang 1972 plädierte Böll in dem Spiegel-Artikel »Will Ulrike Gnade oder freies Geleit?« für eine sachliche Berichterstattung und gegen die Kampagnen der BILD-Zeitung über die Baader-Meinhof-Gruppe. Von diversen Medien wurde Böll als Sympathisant der Terroristen diffamiert, im Zuge einer Fahndung wurde sein Landhaus in der Eifel durchsucht. Vor diesem Hintergrund beauftragte Böll einen Mitarbeiter, sensationslüsterne Artikel von Boulevardblättern zu sammeln, die Menschen in Wort und Bild verleumden. Die kleinen skandalösen Geschichten von bekannten und unbekannten Personen bildeten das Material für Bölls Erzählung von einer unpolitischen Frau, die durch die Berichterstattung der Presse zur politischen Verbrecherin gemacht und dann zur Mörderin an einem Journalisten wird.Bölls Kritik richtet sich nicht allein gegen die Bedrohung der persönlichen Freiheit durch die Gewalt des Sensationsjournalismus, sondern auch gegen Menschen, die Boulevardzeitungen mit ihren kriminellen Praktiken zur Meinungsmache lesen und deren Existenz finanzieren.Wirkung: Der Springer-Verlag, den Böll u. a. im Visier hatte, ließ in seinen Zeitungen so lange keine Bestsellerlisten mehr veröffentlichen, wie „Die verlorene Ehre der Katharina Blum“ an deren Spitze stand. In den 1970er Jahren wurde die Erzählung oft als Rechtfertigung von Gewalt gelesen und der Autor verurteilt. Mit zeitlichem Abstand zur damaligen restriktiven politischen Situation versachlichte sich die Rezeption. Die Forschung entdeckte literarische Vorbilder wie Verbrecher aus verlorener Ehre (1787, Friedrich RSchiller) und Michael Kohlhaas (1810, Heinrich von R Kleist), beschäftigte sich mit Form und Sprache der Erzählung und entkräftete teilweise den Vorwurf des stilistischen Mangels.",
  "genres": [
    "Fiction",
    "German Literature",
    "Classics",
    "Germany",
    "Literature",
    "Nobel Prize",
    "Novels"
  ],
  "author": "Heinrich Böll",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/243977.Die_verlorene_Ehre_der_Katharina_Blum"
}