{
  "title": "Silent Destiny",
  "description": "Prof. Emma Walters is awakened by an early morning phone call with the shocking news that she has inherited a Scottish estate. Armed with limited information and a naturally suspicious mind, she decides this unexpected legacy is worthy of investigation. So, days later, she leaves everything that is familiar and exits her uncomplicated life in her quiet corner of Canada and flies off to Scotland.  Met in Edinburgh by a handsome and splendidly kilted, Alexander Wallace, he explains that he is her chauffeur and guide for the next two weeks. Knowing very little about Scotland or her family, she finds herself intrigued. In the days that follow she learns her kinship to Alex began with the marriage of his ancestor, William ‘Braveheart’ Wallace at the beginning of the Scottish Wars of Independence 700 years before. He explains the remarkable connection between their two families and she begins to appreciate that the perplexing treachery behind her inheritance is more fascinating than any historical novel she has ever read.  As the days pass, she is drawn deeper and deeper into the story of the Wallace family yet, she finds the whole situation rather strange. Upon receiving more information, she also finds that two of the terms in the legacy are quite disturbing and she becomes hesitant to accept her future. Bewildering dreams begin to haunt her sleep and stories of a prophecy and missing artifacts unnerve her. Alex’s integrity comes into question and she realizes that he has a vested interest in her decision, a decision which will drastically change his own life. Dare she trust him?  Meanwhile, her appetite for history increases when she learns of the potential involvement of the crusading knights known as the Hospitallers. Her wariness increases and she knows that time is running out for her to decide whether to accept her inheritance and its accompanying duties of immense responsibility. What is the right decision? Will this legacy be good for her or could it place her in untold danger? Did she really want to become the Lady of Traymore? It falls on Alex’s shoulders to persuade her that the benefits of the 21st century will override her historical demons … despite being far from convinced himself.",
  "genres": [],
  "author": "J. Robert Whittle",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/24400155-silent-destiny"
}