{
  "title": "Most Likely",
  "description": "Fair warning: This is the work of a bored person. Names, characters, places and incidents are products of the author’s immense boredom and are used fictitiously. Any accidental impression of important lessons, morals or advice, good or bad, is entirely coincidental.This is a superficial book covering trivial issues, and these are not my words. So if you are looking for a serious book to learn from - \"snort\" - , put this one down and go to the Chinese section and pick up a book about Confucius. To save your time and money, the only lesson in this book is, ironically, not to learn from books. For those who expected to learn something from this book's first part: Like most, I'm as offended by that as you were disappointed. That being said, I can promise a few laughs but this part is just as useless, enjoy … I'm not old. But somehow, unlike most young Egyptians, I have exceeded my life expectancy. I've just turned twenty-three, which means that I have lived a few extra years than most Egyptians around my age; hell, if I were a guy, I'd be dead already. A few months ago, when I realized that I was almost twenty-three, which meant that I could die at any minute – especially now that I've gotten a car – I decided to finish this book quickly; just in case. There is a certain age here in Egypt, that if you outlive, you stop worrying a lot about Egyptian death methods: getting shot, beaten to death, run over by a car, dying in a train crash or the most dangerous and painful of all; getting a stroke watching Egyptian TV, and start worrying about dying of natural causes. If I ever make it to that age, I will look at the back of this book and laugh, if not, others will look at it and wonder why I hadn’t done something more useful with my life if I had known I was going to die, rather than write this pointless book.",
  "genres": [],
  "author": "Asmaa K. Marie",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/24405667-most-likely"
}