{
  "title": "Dark Disciple: Star Wars",
  "description": "Based on unproduced episodes of Star The Clone Wars, this new novel features Asajj Ventress, former Sith apprentice turned bounty hunter and one of the great antiheroes in the  Star Wars galaxy.\n\n \n \nThe only way to bring down the Sith’s most dangerous warrior may be to join forces with the dark side.In the war for control of the galaxy between the armies of the dark side and the Republic, former Jedi Master turned ruthless Sith Lord Count Dooku has grown ever more brutal in his tactics. Despite the powers of the Jedi and the military prowess of their clone army, the sheer number of fatalities is taking a terrible toll. And when Dooku orders the massacre of a flotilla of helpless refugees, the Jedi Council feels it has no choice but to take drastic targeting the man responsible for so many war atrocities, Count Dooku himself.   But the ever-elusive Dooku is dangerous prey for even the most skilled hunter. So the Council makes the bold decision to bring both sides of the Force’s power to bear—pairing brash Jedi Knight Quinlan Vos with infamous one-time Sith acolyte Asajj Ventress. Though Jedi distrust for the cunning killer who once served at Dooku’s side still runs deep, Ventress’s hatred for her former master runs deeper. She’s more than willing to lend her copious talents as a bounty hunter—and assassin—to Vos’s quest.   Together, Ventress and Vos are the best hope for eliminating Dooku—as long as the emerging feelings between them don’t compromise their mission. But Ventress is determined to have her retribution and at last let go of her dark Sith past. Balancing the complicated emotions she feels for Vos with the fury of her warrior’s spirit, she resolves to claim victory on all fronts—a vow that will be mercilessly tested by her deadly enemy . . . and her own doubt.Praise for Dark Disciple\n \n“Reading Dark Disciple really feels like you’re watching some of the best episodes of The Clone Wars.”—EUCantina   “Emotionally charged . . . Christie Golden does a wonderful job of capturing the characters.”\n—Roqoo Depot\n\n \n “A cool inclusion into the Star Wars mythos . . . Ventress and Vos have a cool and compelling dynamic, and are used to explore more of what it means to flirt with the Dark Side of the Force.”—IGN\n \n “[The Clone Wars have been] a huge part of the Star Wars brand for years, and [Christie] Golden manages to craft a story worthy of the themes and characters that fans have come to relate to. . . . [She] uses this opportunity to craft Dark Disciple into a spy/espionage thriller.”—Tech Times\n \n “Golden especially excelled at bringing Ventress’s biting but appealing personality to life. . . . She’s very much a woman trying to find her way, and Dark Disciple adds nuance.”—Nerdist\n \n “Smart, captivating, and unforgettable . . . among the finest in Star Wars storytelling.”—Coffee with KenobiFrom the Hardcover edition.",
  "genres": [
    "Star Wars",
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Audiobook",
    "Romance",
    "Space Opera"
  ],
  "author": "Christie Golden",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/24406698-dark-disciple"
}