{
  "title": "The Last Coup D' etat",
  "description": "The main character Alex McKenna is in a criminally liable situation with the US Government. After 8 months of arguing through expensive lawyers, his business was ruined and he had been denied travel for that period of time. So he decides to do what might be considered fleeing the jurisdiction, and that’s where his life changes forever. Once a straight arrow honest defense contractor making gear to protect Police, now on the verge of going to jail or losing his company or worse, Alex is forced to make some outrageous decisions that are the antithesis of how his life had transpired up to this point. Million dollar heists, extortion, and financial terrorism became his new modus operandi. He makes powerful enemies and fantastic lifelong contacts and friends along this journey that spans the globe in search of profiting on the demise of the billionaires that run this world we live in.  The desired result is summed up into one question, what if all the rules we commonly live under no longer applied to you, what would you do with this kind of power?  About the Author  Allan’s Dad writes books for a living and you can find him at www.darrellbain.com , and last year he challenged Allan to follow in the family footsteps, and write a book or maybe more if it turned out to be something attractive as an alternate career.  That was last summer and a year later Allan published The Last Coup D’etat. This book examines the escalation of government intrusion and is based on real events at the start. The Author was driven out of business by the US Government by default of having to defend claims they never could prove. It's a thought provoking view of the history of powerful forces that have sought to control the world, and how they have evolved to our current model. This is all infused into a fictional work based on real events, probabilities, and their effects on the world in a way that really depicts our reality and where it's going in the future.  Allan has been involved in defense contracting making armor systems for over 25 years, and writes patents, marketing copy, and technical papers, and reports for those who hire his services.  Over the years Allan has invented world renowned protection systems , and one in particular is called Dragon Skin. In all Allan Bain has 8 patents credited to his name in the field of protection systems.  Allan doesn’t manufacture armor or gear anymore, but has always been creative and hardworking and delivers what he promises.",
  "genres": [],
  "author": "Allan Bain",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/24424387-the-last-coup-d-etat"
}