{
  "title": "John Quincy Adams: A Public Life, a Private Life",
  "description": "February 21, 1848, the House of Representatives, Washington,   Congressman John Quincy Adams, rising to speak, suddenly collapses at his desk; two days later, he dies in the Speaker's chamber. The public mourning that followed, writes Paul C. Nagel, \"exceeded anything previously seen in America.\" Forgotten was his failed presidency and his often cold demeanor. It was the memory of an extraordinary human being--one who in his last years had fought heroically for the right of petition and against a war to expand slavery--that drew a grateful people to salute his coffin in the Capitol and to stand by the railroad tracks as his bier was transported from Washington to Boston. Nagel probes deeply into the psyche of this cantankerous, misanthropic, erudite, hardworking son of a former president whose remarkable career spanned many minister to Holland, Russia, and England, U.S. senator, secretary of state, president of the United States (1825-1829), and, finally, U.S. representative (the only ex-president to serve in the House). On the basis of a thorough study of Adams' seventy-year diary, among a host of other documents, the author gives us a richer account than we have yet had of JQA's life--his passionate marriage to Louisa Johnson, his personal tragedies (two sons lost to alcoholism), his brilliant diplomacy, his recurring depression, his exasperating behavior--and shows us why, in the end, only Abraham Lincoln's death evoked a greater outpouring of national sorrow in nineteenth-century America. We come to see how much Adams disliked politics and hoped for more from life than high office; how he sought distinction in literary and scientific endeavors, and drew his greatest pleasure from being a poet, critic, translator, essayist, botanist, and professor of oratory at Harvard; how tension between the public and private Adams vexed his life; and how his frustrations kept him masked and aloof (and unpopular). Nagel's great achievement, in this first biography of America's sixth president in a quarter century, is finally to portray Adams in all his talent and complexity.",
  "genres": [
    "Biography",
    "Presidents",
    "History",
    "Nonfiction",
    "American History",
    "Us Presidents",
    "Politics"
  ],
  "author": "Paul C. Nagel",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/244162.John_Quincy_Adams"
}