{
  "title": "The Politically Incorrect Guide to Western Civilization",
  "description": "Everything you should know--but PC professors won't teach--about Western heritage. Western civilization is the envy of the globe. It has given to the world universally accepted understandings of human rights (rooted in Judeo-Christian principles), created standards for art, music, and literature that have never been equaled, and originated political and social systems that have spread all across the planet.  Political correctness now obscures these and other truths about Western civilization. Leftists and Islamic jihadists find common cause in assailing Western \"colonialism,\" \"imperialism,\" and \"racism\" as its defining characteristics. Guilt-ridden Western leaders and public figures speak of their cultural patrimony in disparaging terms they would never dare to use about a non-Western culture. And in universities, \"multicultural\"-minded professors flatter students into believing they have nothing really to learn from Sophocles or Shakespeare.  But now, Professor Anthony Esolen--one of the team-teachers of Providence College's esteemed Development of Western Civilization Core Curriculum--has risen to the West's defense. \nThe Politically Incorrect Guide(TM) to Western Civilization\n takes on the prevailing liberal assumptions that make Western civilization the universal whipping boy for today's global problems - and introduces you to the significant events, individuals, nations, ideas, and artistic achievements that make Western civilization the greatest the world has ever known.  Today, defending the West has become an urgent imperative: if we don't value what we have and what we have inherited, we will surely lose it.\n The Politically Incorrect Guide(tm) to Western Civilization\n is an essential sourcebook for that defense.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Philosophy",
    "Cultural",
    "Education",
    "Audiobook"
  ],
  "author": "Anthony Esolen",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/2442595.The_Politically_Incorrect_Guide_to_Western_Civilization"
}