{
  "title": "Saving Dancer",
  "description": "CarrieI’ve been in love with Jacob Blake since he picked me up in his strong arms. He held me close and promised me everything would be okay. I knew then, I had met the man who would own my heart forever.I was five years old.As the years went by, the need and longing for Jacob only increased—at least on my side. Jacob has never seen me as more than his kid sister’s best friend.I’ve spent my life chasing after Jacob and trying to make him see I’m more than just his sister’s little friend. I never dreamed that by trying to show Jacob how much I loved him, I would also destroy him.One night...one night that held so much promise, but ultimately destroyed the man I love and broke him in so many pieces, that I don’t know if he can be mended back together.Jacob “Dancer” BlakeI’m finally home. Out of the hell hole I had been trapped in since killing another man. With the thrust of my knife everything changed.That night I ended two lives, the scum who had been trying to rape my little sister’s friend... and my own. The other man got the easier out. I live and breathe in a hell I’ll never escape.My brothers look at me with pity in their eyes. It cuts my insides out.There’s trouble in the club, trouble all around us and I have to get my head straight. I have to be able to help them. Trouble is, I can’t even help myself. I just keep piling the mistakes up.Carrie just might be my biggest mistake yet.Now it’s another night that’s haunting me--a night that I keep repeating even if I shouldn’t.I’m so trapped in the darkness that I can’t stop myself from going back because she is light.She wants to save me. You can’t save something as lost as I am. I’m going to destroy her.I’ve warned her. Now I’ll show her.",
  "genres": [
    "Romance",
    "Abuse",
    "Dark",
    "Contemporary",
    "Contemporary Romance",
    "Motorcycle",
    "Drama"
  ],
  "author": "Jordan Marie",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/24415976-saving-dancer"
}