{
  "title": "Passionate Nomad: The Life of Freya Stark",
  "description": "With the publication of The Valley of the Assassins in 1934, a legend was launched. Freya Stark had begun the extraordinary adventures that would glamorize her, though distinctly unglamorous, as the last of the great travelers. Hailed as a classic, the book chronicled her travels in remote and dangerous regions of the Middle East, inspiring Lawrence of Arabia to call the audacious, ambitious Freya \"a gallant creature.\"        Her reputation had begun in 1927, when she was captured by French military police after penetrating their cordon around the rebellious Druze. She explored the mountainous territory of the mysterious Assassins of Persia, became the first woman to explore Luristan in western Iran, and followed the ancient frankincense routes to locate a lost city.        At first a thorn in the side of the British colonial establishment for consorting with \"wogs,\" Freya was later extravagantly admired by officialdom. Her knowledge of Middle Eastern languages and life aided the military and diplomatic corps, for whom she conceived an effective propaganda network during World War II.          Throughout her long life--she died in 1993, over a hundred years old, having been knighted at age eighty-two by the Queen--she rejoiced in the attentions of the press and of her audiences. In private she remarked that she put herself in harm's way in order not to fear death.          Her indomitable spirit was forged by contradictions. A child of privilege, she grew up in near poverty after her mother rashly allied herself with an Italian count in a rug manufacturing venture. She yearned for a formal education but was largely self-taught, mastering seven languages. She longed for love but consistently focused on the wrong men. She was thirty-four before she extricated herself from her family and embarked on the travels that would make her reputation. Her astonishing career lasted over sixty years, during which she produced twenty-two books unmatched for perception and poetic prose.          This is a brilliant, balanced biography, rich in sheikhs, diplomats, nomad warriors and chieftains, generals, would-be lovers, and luminaries, with author Jane Fletcher Geniesse digging beneath the mythology to uncover a complex, quixotic, and controversial woman.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Travel",
    "History",
    "Adventure",
    "Womens",
    "Biography Memoir"
  ],
  "author": "Jane Fletcher Geniesse",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/2442481.Passionate_Nomad"
}