{
  "title": "Come / Come Back",
  "description": "***THIS IS A TWO-BOOK BUNDLE***  COME – Dirty, Dark, and Deadly Book One  THIS IS BOOK ONE OF A SERIES. THIS IS A NOVELLA. YOU WILL GET MORE QUESTIONS THAN ANSWERS IN THIS BOOK. IF YOU HATE THAT - SKIP THIS WHOLE SERIES COMPLETELY. (It's twisty, complicated, dark, dirty, and ALL the main characters are killers.)  My name is James Fenici and you will never see me coming. I walk the shadows like darkness itself. I hide in the corners where nobody looks. I live by no rules, I have no boundaries, I take no prisoners, and I never, ever blink. I am not your knight in shining armor; I'm your worst nightmare.  My name is James Fenici and you are my target. Only one of us is getting out alive, and that's not gonna be you. Once your name is on my list, your life is over. It's a deal I make with death, it's a contract I sign in blood, it's forgone conclusion--get used to it.  My name is James Fenici and I'm as dirty as they come. But then one day I saw her. And every monster I thought I was. Every fact I thought I knew. Every dirty promise I ever turned down came back to slap me in the face.  My name is James Fenici and I think I am in love.   COME BACK – Dirty, Dark, and Deadly Book Two  This is a full-length novel This is book two in a three book series. The final book releases November, 19 2014.  \"Secrets keep the darkness alive,\" Harper tells me. But that's not how I see it at all. Secrets keep me alive, the truth is overrated, honesty is never the best policy, and when your job title is Assassin Number Six--lies are your lifeblood.  \"Death is a business deal,\" I tell her back. And I shake his hand with secrets every chance I get. They're currency in my world. I pay my debts with them, I feed on them, they ground me in the present and they promise me a future.  But Harper Tate is everything I've ever wanted. She's my promise, she's my obsession, she's a delicious fuckable transgression. She can be mine. She will be mine. All I have to do is complete the mission.  There's just one teeny, tiny problem with the mission.  It's a secret.",
  "genres": [
    "Erotica",
    "Dark",
    "Romance",
    "Suspense"
  ],
  "author": "J.A. Huss",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/24430156-come-come-back"
}