{
  "title": "a Game of Inches",
  "description": "Will Lola really shut down the Fantasy Leagues, just as she was making serious friends? With Rudy, her best client and confidant, in the hospital after a paralyzing football injury, she must evaluate what's important. Her mother reveals a bizarre addiction just before she gives Lola cryptic information about her dad. What did Rod Stewart really have to do with Lola's father? The Letter opens doors to both heartache and love, but, she doesn't know how to deal with either one. Just what did she do to make Marty attack her car with a baseball bat? Does she really have that much passionate power over her closest companions?Meanwhile, a second encounter with Danika ignites smoldering passions leaving these besties more than confused. Does Danika love both Lola and Finn? How could the two relationships be so opposite?Will Eugene agree to shoulder Lola through this latest crisis? Potentially, working behind the scenes on the Fantasy Leagues may have revealed to Eugene what he is missing the most- a soul mate.Finn receives an offer almost too good to be true, if he takes the brass ring opportunity, will he say good-bye to Danika just as things are heating up?Lola spirals downward in an alcoholic torrent of hopelessness and fear, trying to help her long lost daughter, Sharlyn. Dying from a disease, Lola would've never even met her long lost daughter if the situation wasn't critical. With Sharlyn's appearance, an unknown father is revealed, unraveling everything Lola tied shut years before. Just as in football, life is a game of inches, some gained some lost. Watching these characters struggle to gain yards may destroy relationships instead of scoring touchdowns. With many twists and turns keeping the reader guessing, a Game of Inches exposes the raw as well as the tender we all experience in life. But, do we get up and power on, or do we lie down and give up what may be the best game of our lives?",
  "genres": [],
  "author": "Davee Jones",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/24430549-a-game-of-inches"
}