{
  "title": "Europe: A History",
  "description": "\"In the beginning,\" writes Norman Davies, \"there was no Europe. All there was, for five million years, was a long, sinuous peninsula with no name, set like the figurehead of a ship on the prow of the world's largest land mass. To the west lay the ocean which no one had crossed. To the south lay two enclosed and interlinked seas, sprinkled with islands, inlets, and peninsulas of their own. To the north lay the great polar icecap, expanding and contracting across the ages like some monstrous, freezing jellyfish. To the east lay the land-bridge to the rest of the world, whence all peoples and all civilizations were to come.\" So begins Davies's magisterial Europe , a master work of history that stretches from the Ice Age to the Atomic Age, as it tells the story of Europe, East and West, from prehistory to the present day.Davies's absorbing narrative captures the full drama of European history, on a sweeping canvas filled with fascinating detail, analysis, and anecdotes. It is a glorious chronicle packed with momentous the rise and fall of Rome, the sweeping invasions of Alaric (leader of the Vandals) and Atilla (leader of the Huns), the Norman conquests of Sicily and England, the Papal struggles for power, the Crusades, the Black Death, the sack of Constantinople, the growth of cities such as Venice, Ghent, London, and Paris, the Renaissance and the Reformation, the Enlightenment and the French Revolution, the Napoleonic Wars, Europe's rise to become the powerhouse of the world, and its eclipse in our own century, following two devastating World Wars. Davies omits nothing. We read not only of the great figures and events of European history--battles, usurpations, tyrants, and saints--but of philosophers, scientists, writers, and artists; the great explorations; the stateless nation and thenation-state. Minority communities, from heretics and lepers to Jews, Romanies, and Muslims, have not been forgotten in this vast tapestry. And Davies has also added 299 \"time-capsules,\" small, self-contained sections that focus intensely on an aspect of an age, to attain a greater sense of immediacy, a sharper picture of life as it was--articles that range from \"Erotic Graffiti at Pompeii,\" to \"Stradivarius,\" to \"Psychoanalyzing Hitler.\" And there are also twelve \"snapshots\"--fascinating glimpses of moments frozen in time, such as \"Knossos 1628 BC,\" or \"Constantinople AD 230,\" or \"Nuremberg 1945.\" And finally, the book features over one hundred superbly detailed maps and diagrams, and seventy-two black-and-white plates.Never before has such an ambitious history of Europe been attempted. In range and ambition, originality of structure and glittering style, Norman Davies's Europe represents one of the most important and illuminating histories to be published in recent years.",
  "genres": [
    "History",
    "Nonfiction",
    "European History",
    "World History",
    "Politics",
    "Historical",
    "Audiobook"
  ],
  "author": "Norman Davies",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/2442386.Europe"
}