{
  "title": "Laughing Without an Accent: Adventures of an Iranian American, at Home and Abroad",
  "description": "In the bestselling memoir Funny in Farsi, Firoozeh Dumas recounted her adventures growing up Iranian American in Southern California. Now she again mines her rich Persian heritage in Laughing Without an Accent, sharing stories both tender and humorous on being a citizen of the world, on her well-meaning family, and on amusing cultural conundrums, all told with insights into the universality of the human condition. (Hint: It may have to do with brushing and flossing daily.)With dry wit and a bold spirit, Dumas puts her own unique mark on the themes of family, community, and tradition. She braves the uncommon palate of her French-born husband and learns the nuances of having her book translated for Persian audiences (the censors edit out all references to ham). And along the way, she reconciles her beloved Iranian customs with her Western ideals.Explaining crossover cultural food fare, Dumas says, “The weirdest American culinary marriage is yams with melted marshmallows. I don’t know who thought of this Thanksgiving tradition, but I’m guessing a hyperactive, toothless three-year-old.” On Iranian wedding anniversaries: “It just initially seemed odd to celebrate the day that ‘our families decided we should marry even though I had never met you, and frankly, it’s not working out so well.’” On trying to fit in with her American peers: “At the time, my father drove a Buick LeSabre, a fancy French word meaning ‘OPEC thanks you.’” Dumas also documents her first year as a new mother, the familial chaos that ensues after she removes the television set from the house, the experience of taking fifty-one family members on a birthday cruise to Alaska, and a road trip to Iowa with an American once held hostage in Iran.Droll, moving, and relevant, Laughing Without an Accent shows how our differences can unite us–and provides indelible proof that Firoozeh Dumas is a humorist of the highest order.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Humor",
    "Iran",
    "Biography",
    "Book Club",
    "Travel"
  ],
  "author": "Firoozeh Dumas",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/2441475.Laughing_Without_an_Accent"
}