{
  "title": "My Anecdotal Life: A Memoir",
  "description": "More than once, Carl Reiner has had friends say, “Hey, Reiner, you ought to write those things down.” And at eighty, he finally has.In this funny and engaging memoir, one of the best raconteurs on the planet recalls his life in show business in short comic takes. Reiner tells of how, after answering an ad for free acting classes on his brother Charlie’s advice, he forsakes a budding career as a machinist for an acting career. In “Sidney Bechet and His Jazz Band Meet Franz Kafka,” he captivates the legendary jazz man and his band with an unusual reading of The Metamorphosis , during a thunderstorm at a Catskills resort in 1942.Reiner also recalls the highlights of the succeeding his first sweaty audition, impersonating a dog impersonating movie stars; his forays into the theater; his work on Your Show of Shows and The Dick Van Dyke Show during TV’s golden days; and his long friendship and collaboration with Mel Brooks which gave birth to the Two Thousand Year Old Man.In “A Recipe to Remember,” he recites a recipe for cream cheese cookies to a star-studded audience that includes Paul Newman, Leonard Bernstein, and Barbra Streisand. In “The Gourmet Eating Club,” he gives an insider’s take on the now-legendary group that included Mario Puzo, Joseph Heller, Zero Mostel, and other luminaries.Mary Tyler Moore, Sid Caesar, Mickey Rooney, Johnny Carson, Cary Grant, Dinah Shore, Ann Bancroft, Jean Renoir – the list goes on and on – also appear in what Reiner calls the “literary variety show” that captures the highs and lows of his extraordinary life. Through it all, Reiner displays the wit and warmth that have made him one of the most beloved figures in the entertainment business. This charming memoir will delight anyone who wants a behind-the-scenes look at five decades of Hollywood and television history.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "Humor",
    "Biography Memoir",
    "Audiobook",
    "Comedy"
  ],
  "author": "Carl Reiner",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/244323.My_Anecdotal_Life"
}