{
  "title": "The Sugar Divorce",
  "description": "\"I LOVE THIS BOOK ! I am so happy with my progress.\" Susan Goins, Ormond Beach, Florida\"Suzanna's book gave me the same feeling as when I read \"Julie and Julia\"! Her writing is friendly and personal - like your best friend writing to you, and encouraging you to come along for the ride.\" Heather Noell\"This very engagingly written book will help you to understand how managing your insulin by ditching the refined sugar and eating \"slow carbs\" and plenty of healthy protein and good fats will help you find your body again. Especially recommended for those of us in the over 50 group.\" Nutritionist, Diane Fischler of San Rafael, CA\"It's all a great prescription for life and Suzanna brings it to us with candor, humility and humor. Thank you Suzanna!\" From Lori of Lori's Latest on Amazon ReviewsToday, people interested in fitness after 50 are benefiting from all the tools used by younger fit-conscious people. But there's one element that may play the biggest role in whether you are on the road to being strong & lean, or headed in the opposite direction as you age. That one thing is insulin -- and your sugar intake is the overriding factor in your insulin levels. Insulin is the agent that programs your body to hold onto every particle of fat, or to burn fat for energy. Your sugar intake is running the stop-and-go lights on your insulin.Leaving sugar is not a little thing. Not when it's been your friend, companion, deep counsel, doctor, healer, stimulant and brain food. When a person realizes a dangerous addiction, the customary \"healthy\" response is to end the relationship. But that doesn't really end it, does it? Once an addict, always an addict? This journey is one of coming into a new relationship.From inside the The Body ChangeSomething you should know. At the end of the first four weeks, I bought a pair of jeans one size smaller than I've worn in the last ten years plus. I am indeed gently, slowly melting.I also want you to know how different this is from losing 15 or 16 pounds on the South Beach diet. That was four years ago, and the only time in my life I've been on a diet. Naturally (it is nature pure and simple) I gained that back plus two or three on top of it.That's not all, though, it's different in several ways. How I feel is very, very different. How my body looks is so different it's downright confusing. When did I ever have an hourglass? What's going on? I've now lost only half the weight I lost on South Beach, and hello, I never looked like this on that diet. I never felt like this either. Keep in mind I am exercising less.I definitely want you to know all the ways I messed up the food plan! All the things I didn't do that are supposed to be part of this process. I want you to know all that, because we're human beings. If you're at all like me, you are no longer running high level of youth hormones in your body. Maybe you are also on the sedentary side, and maybe you would like to change that, too. Losing weight helps with enjoying an active lifestyle.With Edition Two, I've added a \"Kickstart Guide\" to help you get going -- and get through your first days.",
  "genres": [],
  "author": "Suzanna Stinnett",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/11487112-the-sugar-divorce"
}