{
  "title": "His FBI Sub",
  "description": "This edition is no longer available.Courtney Sears entered the exclusive Club Alpha Cove, a BDSM club on David’s Island, all for the sake of uncovering a syndicate. She was an undercover FBI agent, as tough as nails and as sassy as they come. She led a lonely life, all due to a tragedy six years prior that forced her to draw away from anyone that meant something to her. Her job became her life, she took chances no one else would, but at least all her loved ones were kept alive.  Ruark Greer decided she was his the moment he laid eyes on her and set motions in place to keep her returning to his club as his sub. Courtney was appalled when the bust was successful and found she had no other choice but to remain at the Club as a trainee sub. Yet, her fascination with the gorgeous hunky Master known as my Liege, grew and under his unyielding hands, she discovered a need she could not deny.  Even though Courtney did her utmost to keep an emotional distance from him, Ruark refused to back down. No matter how many hard FBI Agents she controlled, in the Club she was a sassy submissive, yet sweetly vulnerable. He soon realized her defenses were keeping her on the fringe of her sexuality and living life to the fullest.  Note: This book contains explicit sexual situations, graphic language, and material that some readers may find objectionable: Anal play, BDSM theme and elements.  Excerpt Courtney was actually quite annoyed at the fact that she was under instruction from Ruark not to play. So, to get at least some action, she sassed Master Quinlan and ended up over a spanking bench, to receive ten strokes with a paddle. “Master Quinlan, is this a demonstration, or a punishment?” He was back! Oh shit! “Punishment, my Liege. She sassed me. She is due ten with the paddle.” “Is this her first punishment?” “No, second.” “Hmm … well, why don’t I take care of that for you?” “As you wish, my Liege.” She felt his hands on her hips, slowly stroking the seam of the denim short she was wearing. He walked to the front and slowly but deliberately tightened leather wrist cuffs around her wrists and hooked them to the steel shackles on the legs of the horse. He slowly lowered the front part of the bench and lifted the back part higher. Her ass was now sticking high into the air. He stroked his finger down her cheek and leaned down. “Now is it not luck I decided to come back early, little pet?” He walked back to the other side and she gasped when she felt him lift her hips and unzip her shorts. “These are in my way. They have to go.” “No!” No matter how she wiggled or tried to kick at him, he had her shorts off and threw them on her back. By the time he had her legs tied as well, she was breathless. She gasped when his large hand stroked over her ass. Her ass, sticking up in the air, with only a thong to cover her pussy! She moaned when his finger dipped beneath the thong and stroked over her labia. “Sweet and so wet, little pet. Not that I can see anything now, but from the glimpses I got at the Fashion show, you have a beautiful pussy.” She groaned and rested her forehead on the padded bench, her long hair like a curtain around her face. Suddenly his fingers were gone and stroked over her ass. “Beautiful. I can’t wait to whip that pussy of yours, my pet. Now tell me, why are you being punished?” “I-I sassed Master Quinlan.” She stammered, the thought of him whipping her pussy made her even wetter. “How?” “He told me to bend over and grab my ankles.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Contemporary",
    "Dark Romance",
    "Contemporary Romance",
    "Crime"
  ],
  "author": "Linzi Basset",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/24438825-his-fbi-sub"
}