{
  "title": "The Sound Catcher",
  "description": "A delightfully imaginative and wonderfully illustrated children’s story filled with colourful description and pictures aplenty. A read aloud children’s tale for parents and family alike peopled with a wonderful cast of humorous characters. Once a sound is made it does not simply disappear, as most people think. It becomes a stray sound, floating through the atmosphere before popping up in a variety of places, usually with alarming consequences. Since Chloe banged her head she's been seeing strange coloured clouds, which happen to be stray sounds. She's also met the Sound Catcher, whose job it is to gather up stray sounds so that can't go round scaring people. Seated on the Sound Machine, Chloe and the Sound Catcher zoom around the country capturing as many stray sounds as they can, including that of a dangerous dog that snarls and growls and frightens lots of children. At first Chloe finds it exciting. But things take a turn for the worse when she hears the stray sound of a mystery voice planning something diabolical. To discover what the plan entails they need to capture more stray sounds of the mystery voice. Back at the Sound Catcher's laboratory they listen to the stray sounds that they've captured and try to piece together all the clues. It soon becomes apparent that the crime of the century is about to be committed...the theft of the Crown Jewels. And to stop it happening Chloe and the Sound Catcher will have to pit their wits against Locksmith Larry, a criminal mastermind. But how can a twelve year old girl and the Sound Catcher, who no one but Chloe knows exists, possibly succeed in catching Locksmith Larry when every police force in the country has failed? All stray sounds are stored in test tubes. When one of the test tubes breaks the unexpected noise of the escaping stray sound it contains gives the Sound Catcher a nasty fright, and gives Chloe an idea.. By the same author - Bullies, Ghosts and Jars Full of Smoke (Also published on Amazon)",
  "genres": [],
  "author": "Graham Garrity",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/24442340-the-sound-catcher"
}