{
  "title": "Mulberry and Peach: Two Women of China",
  "description": "This extraordinary novel tells the story of two women-Mulberry and Peach-who are really one. Mulberry is a young Chinese-American woman who has fled the turmoil of postwar China to settle in the United States. Unable to forget the terrors she has witnessed or to resolve the conflicts between her new life and her old, she copes by developing a second personality: the fearless, tough-talking, sexually uninhibited Peach. While Mulberry clings to her cultural and ethical roots, Peach renounces her past to embrace the American way of life with a vengeance.   These two women-both in flight-speak to their readers through an innovative narrative structure, combining journal entries, interior dialogue, letters, poetry, and myth. Mulberry's past-mainly her experiences during the Japanese occupation of China and the years of civil war between Communists and Nationalists-haunts the text. Separated from her family, she seeks refuge in the home of wealthy cousins, who try desperately to maintain their rigid traditions as warring forces close in around Peking and the house is systematically looted. Mulberry escapes downriver in a boat carrying a strange assortment of refugees. But her escape to Taiwan only brings new terrors: when her new husband is targeted by the police, Mulberry must go into hiding with him in a tiny attic room. There her young daughter who cannot remember life \"outside\", descends into a fantasy world of her own invention and unwittingly ensures her family's doom,   Mulberry's journal entires alternate with a series of letters from Peach to \"the man from the USA immigration service.\" Peach has embarked on a cross-country journey in flight from possible deportation. Pregnant and penniless, she lives by her wits while taunting her pursuers and ridiculing her alter ego Mulberry, whom she seeks, finally, to conquer.   In Mulberry and Peach Hualing Nieh offers a rare perspective, through the eyes of a young refugee woman, of the upheavals of contemporary China (where the book was banned upon its first publication in 1976). Through her experimental, highly effective narrative, she also presents an unforgettable portrait of the pain of cultural dislocation and the anguish of psychological disintegration.",
  "genres": [
    "Fiction",
    "China",
    "Historical",
    "Historical Fiction",
    "Chinese Literature",
    "School",
    "Literature"
  ],
  "author": "Hualing Nieh",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/244379.Mulberry_and_Peach"
}