{
  "title": "Asperger Syndrome: Natural Steps Toward a Better Life for You or Your Child",
  "description": "Asperger Syndrome now affects an estimated 10 million children and adults in the United States. Here, Lawton takes an evenhanded look at AS, its development and symptoms, the biological and potential genetic components, the associated physical complaints, and how natural medicine can help. She includes a history of early treatment and current drug and psychotherapy treatments, and explains how diet, blood sugar, and food sensitivities or allergies can play a role. She also looks at the controversy over vaccinations and explains blood tests that can pinpoint a rationale for herbal and homeopathic treatments. The book includes a chapter specifically addressing what is safe to do on your own and when you should seek the help of a medical practitioner. Resources include a listing of AS traits, books that are reliable sources of information, and authoritative Web sites.The spotlight on Asperger Syndrome has been widening with recent attention from mainstream media. This neurological condition, often misdiagnosed as Attention Deficit Disorder, Obsessive Compulsive Disorder, or high-functioning autism is increasingly being recognized, and now affects an estimated 10 million children and adults in the United States alone. Unlike autistic individuals, Asperger sufferers have normal or above normal language, intelligence and cognition, and are often seen as brilliant―verbose with formal speech patterns and superior memory―but they have odd interests, unusual reactions to the environment, inflexibility in routines, poor interaction with people, and inability to form age-appropriate relationships. There is no known cure, but as Suzanne Lawton explains in this work, there are approaches that can reduce or remove the symptoms. While traditional medications are the only option for some sufferers, there are those who can benefit from the natural treatments offered by herbal medicine, diet and nutrition, homeopathy, and amino acids. These drug-free approaches also reduce the physical problems common to Asperger suffers, including stomachaches and headaches and irritable bowel syndrome. says Lawton.Recent FDA warnings regarding the use of psychotropic medications with children (previous treatment has focused on anti-anxiety, anti-depressant, and mood-stabilizing drugs) have fueled the outcry of parents who want to get their children off drugs to avoid the side effects. Here, Lawton takes an evenhanded look at Asperger Syndrome, its development and symptoms, the biological and potential genetic components, the associated physical complaints, and how natural medicine can help. She includes a history of early treatment and current drug and psychotherapy treatments, and explains how diet, blood sugar, and food sensitivities or allergies can play a role. She also looks at the controversy over vaccinations and explains blood tests that can pinpoint a rationale for herbal and homeopathic treatments. Lawton includes a chapter specifically addressing what is safe to do on your own and when you should seek the help of a medical practitioner. Resources include a listing of AS traits, books that are reliable sources of information, and authoritative Web sites.",
  "genres": [],
  "author": "Suzanne C. Lawton",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/2443510.Asperger_Syndrome"
}