{
  "title": "النصوص المحرمة ونصوص أخرى",
  "description": "النيل والفرات:هذا كتاب جميل تترك قراءته في النفس أثراً طيباً للغاية. قد يستغرب القارئ في البداية أن يجد المؤلفين الذين ترجمت بعض أعمالهم في هذا الكتاب ينتمون إلى ميادين مختلفة جدا الاختلاف، فمنهم المناضل السياسي، وعالم اللغويات الشهير، والمصلح الاجتماعي، والمؤرخ، ورئيس جمهورية سابق، وعلماء أفذاذ، وروائية، ومغن شعبي، وشاعرة. فما الذي يمكن أن يجمع بين هؤلاء جميعاً؟َ! وهل هناك من القضايا ما يمكن أن يكون هماً مشتركاً لهم؟ ثم ما الذي يدفع كاتباً عربياً أن يترجم كتابات لهؤلاء جميعاً ويجمعها في كتاب واحد؟! على أن استغراب القارئ لن يطول، إذ بمجرد أن يقرأ فصلين أو ثلاثة سيدرك أن شيئاً مهماً يجمع بين أغلب فصول الكتاب، وأن هذا الشيء هو الذي يجعل الكتاب جميلاً، ويجعله يترك هذا الأثر الطيب في النفس. من الممكن التعبير عن هذا الشيء المهم والمشترك بين أغلب فصول الكتاب بتعبيرات مختلفة، ولكن مقدم هذا الكتاب \"جلال أمين\" اختار تعبير \"النظرة إلى السياسة كأخلاق\". وهو يقول \"لقد تعودنا أن ننظر إلى السياسة على أنها وسيلة الوصول إلى هدف، بصرف النظر عن الطبيعة الأخلاقية لهذا الهدف. والسياسة كثيراً ما تعرف بأنها \"فن الممكن\"، ووصف عمل ما بأنه \"ممكن\" أو \"غير ممكن\" لا يفترض شيئاً يتعلق بأخلاقيته أو عدم أخلاقيته. والسياسة كثيراً ما تفهم أيضاً على أنها ممارسة القوة، والقوة بدورها قد تستخدم لتحقيق هدف أخلاقي أو غير أخلاقي. لهذا السبب نجد أننا عندما نصادف شخصاً أو مؤسسة أو حكومة تتعامل مع قضية سياسية وكأنها قضية أخلاقية، فتخضع العمل السياسي لمعايير أخلاقية، نستغرب هذا عادة أشد الاستغراب، وإن كنا على الأرجح نشعر أيضاً بالإعجاب والتقدير، ونتمنى لهذا الشخص أو لهذه المؤسسة أو الحكومة النجاح في هذه المهمة الصعبة، وهذا العمل البطولي وغير المألوف، وأقصد بهذا العمل البطولي وغير المألوف \"ممارسة السياسة كأخلاق\". إن ممارسة السياسة كأخلاق ليست فقط عملاً غير مألوف، بل ما أكثر ما نصادف عكسه بالضبط، أي \"ممارسة الأخلاق كسياسة\". فما أكثر ما يستعمل السياسيون شعارات أخلاقية لتبرير أعمال سياسية هي أبعد ما تكون عن المبادئ الأخلاقية المستقرة، فيتكلمون مثلاً عن حقوق الإنسان لتبرير انتهاكها، وعن السلام لتبرير الحرب، وعن العدل لتبرير الظلم، وعن المساواة لتبرير القهر. فإذا كان الأمر كذلك، فكيف لا نشعر بالتقدير والإعجاب العميقين، بل والرهبة والخشوع أحياناً، إزاء رجال ونساء تصدوا للقضايا السياسية وكأنها قضايا أخلاقية، تصلح لأحكام الضمير الإنساني، وحكموا على الأعمال والإجراءات السياسية وفقاً لاتفاقها أو اختلافها وما يقضي به الحس الأخلاقي السليم\". هكذا يطلع القارئ الفصل بعد الآخر من هذا الكتاب، فيصادف -المرة تلو المرة- التعامل مع السياسة كأخلاق. يصادفه عند مالكوم إكس عندما يكرس عمله السياسي لمكافحة التمييز العنصري، وعند نعوم تشومسكي عندما يكرس نشاطه لفضح أكاذيب السياسة الخارجية الأمريكية، وعند رالف نادر عندما يجعل قضيته السياسية تحرير المستهلك من خداع الشركات الكبرى، وعند هوارد زن عندما يكشف حقيقة الحرب، وعند فاتسلاف هافيل (وهو الأديب والكاتب المسرحي) عندما يجرب حظه كرئيس جمهورية ولكنه يحذرنا في النهاية من الظن بأنه من الممكن للعالم \"عندما يحكمه الشعراء أن يتحول إلى قصيدة!\"، وعندما يرفض آينشتين العرض المقدم إليه في 1952 بأن يصبح رئيساً لجمهورية إسرائيل، وكان قبل ذلك قد أرسل رسالة إلى حاييم وإيزمان الذي كان رئيساً للمنظمة الصهيونية العالمية قال فيها: \"إذا لم ننجح في الوصول إلى طريق للتعاون الصادق والاتفاق مع العرب، فكأننا لم نتعلم شيئاً من محنتنا التي استمرت ألفي سنة، وسوف نستحق المصير الذي سنصل إليه\". وهذا كلام في الأخلاق قبل أن يكون كلاماً في السياسة، أو كلام يحاول به آينشتين أن يحول السياسة إلى أخلاق. عندما تقرأ بعد هذا كله، في الفصل الأخير من الكتاب، قصيدة /مقالة بالغة الجمال، ومترجمة ترجمة جميلة، لكاتبة أمريكية قضت في المملكة العربية السعودية خمس سنوات، فوقعت في حبها، وكتبت هذه القصيدة /المقالة لتصف بعض ما أحبته في نمط الحياة في السعودية: \"أحببت الأمان، خاصة بالنسبة لأطفالي.. الذين لم أكن بحاجة إلى تعليمهم عدم الحديث مع الغرباء ورفض الحلوى والهدايا منهم. أحببت أن أخرج من غير إغلاق منزلي بالقفل، وترك محفظتي في عربة التسوق والذهاب إلى آخر السوبر ماركت لإحضار الحليب الذي نسيته (...) أحببت الصبر اللامتناهي لأصحاب محلات الذهب، حين تقوم ابنتي ذات الثلاثة عشر عاماً بإضاعة أوقاتهم وهي تساومهم لشراء حيلة بمبلغ من مدخراتها. رأيتهم يقدرون جرأتها حين تشتري منهم بسعر أقل من سعر الذهب في الأسواق العالمية!\". عندما تقرأ هذه القصيدة/ المقالة في نهاية الكتاب يخالجك الشعور بأن الكتاب قد أدى مهمته، إذ تتسق هذه القصيدة/المقالة وما انطوت عليه معظم الفصول من مشاعر: امرأة أمريكية نبيلة المشاعر، تتجاوز كل أكاذيب السياسة وادعاءاتها وتصل إلى لب القصيدة، وهو أن المشاعر الإنسانية الحقيقية هي في نهاية الأمر واحدة، وأن ما يجمع بين الناس من تعاطف يستند إلى حاجتنا جميعاً إلى التواد والتراحم، وهو أثمن بكثير من مغنم التسلط وفرض الإرادة على الآخرين قهراً وظلماً، وهو أيضاً أبقى في الزمن.",
  "genres": [
    "Biography",
    "Politics",
    "Nonfiction"
  ],
  "author": "Malcolm X",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/2444465._"
}