{
  "title": "The Fox Woman",
  "description": "Kij Johnson has created an achingly beautiful love story, a fable wrapped in smoke and magic set against the fabric of ancient Japan. Johnson brings the setting lovingly to life, describing a world of formalities and customs, where the exchange of poetry is a form of conversation and everything has meaning, from the color of the silks on wears to how one may address others.Yoshifuji is a man fascinated by foxes, a man discontented and troubled by the meaning of life. A misstep at court forces him to retire to his long-deserted country estate, to rethink his plans and contemplate the next move that might return him to favor and guarantee his family's prosperity.Kitsune is a young fox who is fascinated by the large creatures that have suddenly invaded her world. She is drawn to them and to Yoshifuji. She comes to love him and will do anything to become a human woman to be with him.Shikujo is Yoshifuji's wife, ashamed of her husband, yet in love with him and uncertain of her role in his world. She is confused by his fascination with the creatures of the wood, and especially the foxes that she knows in her heart are harbingers of danger. She sees him slipping away and is determined to win him back from the wild...for all that she has her own fox-related secret.Magic binds them all. And in the making (and breaking) of oaths and honors, the patterns of their lives will be changed forever.The Fox Woman is a powerful first novel, singing with lyrical prose and touching the deepest emotions. A historically accurate fantasy, it gives us a glimpse into, and an understanding of, the history that shaped the people of one of our world's greatest nations. But it is also a story about people trying to understand each other and the times they live in, people trying to see through illusions to confront the truth of who they are.",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Japan",
    "Fiction",
    "Romance",
    "Historical",
    "Historical Fantasy"
  ],
  "author": "Kij Johnson",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/2446528.The_Fox_Woman"
}