{
  "title": "Sleeping, Dreaming, and Dying: An Exploration of Consciousness",
  "description": "This is an absorbing account of a dialogue between leading Western scientists and the foremost representative of Buddhism today, the Dalai Lama of Tibet.For modern science, the transitional states of consciousness lie at the forefront of research in many fields. For a Buddhist practitioner these same states present crucial opportunities to explore and transform consciousness itself. This book is the account of a historic dialogue between leading Western scientists and the Dalai Lama of Tibet. Revolving around three key moments of consciousness--sleep, dreams, and death--the conversations recorded here are both engrossing and highly readable. Whether the topic is lucid dreaming, near-death experiences, or the very structure of consciousness itself, the reader is continually surprised and delighted.Narrated by Francisco Varela, an internationally recognized neuroscientist, the book begins with insightful remarks on the notion of personal identity by noted philosopher Charles Taylor, author of the acclaimed Sources of Self . This sets the stage for Dr. Jerome Engel, Dr. Joyce MacDougal, and others to engage in extraordinary exchanges with the Dalai Lama on topics ranging from the neurology of sleep to the yoga of dreams.Remarkable convergences between the Western scientific tradition and the Buddhist contemplative sciences are revealed. Dr. Jayne Gackenbach's discussion of lucid dreaming, for example, prompts a detailed and fascinating response from the Dalai Lama on the manipulation of dreams by Buddhist meditators. The conversations also reveal provocative divergences of opinion, as when the Dalai Lama expresses skepticism about \"Near-Death Experiences\" as presented by Joan Halifax. The conversations are engrossing and highly readable. Any reader interested in psychology, neuroscience, Buddhism, or the alternative worlds of dreams will surely enjoy Sleeping, Dreaming, and Dying .",
  "genres": [
    "Buddhism",
    "Psychology",
    "Philosophy",
    "Spirituality",
    "Nonfiction",
    "Religion",
    "Science"
  ],
  "author": "Dalai Lama XIV",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/244634.Sleeping_Dreaming_and_Dying"
}