{
  "title": "The Boys' War: Confederate and Union Soldiers Talk About the Civil War",
  "description": "This contemporary classic explores the role of boys who fought in the Civil War. No reader’s vision of America’s most brutal and bloody war will be the same after reading this book. “This wrenching look at our nation’s bloodiest conflict through the eyes of its youthful participants serves up history both heartbreaking and enlightening.” — Publishers Weekly Some Union and Confederate soldiers were as young as twelve when they went off to fight in the Civil War. It is thought that as many as ten to twenty percent of all Civil War soldiers may have been under sixteen. The Boys' War  follows these young soldiers through the rigors of camp life and drilling, right into the chaos of the battlefield. Jim Murphy skillfully weaves together firsthand accounts and personal letters of these countless young men with historical context to paint their portrait—young soldiers who, either seeking escape from the drudgery of farm work or embracing fantasies of glory, participated in the Civil War. Handsomely produced with numerous period photographs and drawings, The Boys' War is a winner of the Golden Kite Award for Nonfiction and an ALA Best Book for Young Adults. “Making extensive use of the actual words—culled from diaries, journals, memoirs, and letters—of boys who served in the Union and Confederate armies as fighting soldiers as well as drummers, buglers, and telegraphers, Murphy describes the beginnings of the Civil War and goes on to delineate the military role of the underage soldiers and their life in the camps and field bivouacs. Also included is a description of the boys' return home and the effects upon them of their wartime experiences. An excellent selection of more than 45 sepia-toned contemporary photographs augment the text of this informative, moving work.” — School Library Journal  (starred review) “This well-researched and readable account provides fresh insight into the human cost of a pivotal event in United States history.” — The Horn Book  (starred review)",
  "genres": [
    "History",
    "Nonfiction",
    "Civil War",
    "American History",
    "War",
    "Read For School",
    "American Civil War"
  ],
  "author": "Jim  Murphy",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/244588.The_Boys_War"
}