{
  "title": "Fallen Founder: The Life of Aaron Burr",
  "description": "This definitive biography of the revolutionary era villain overturns every myth and image we have of him  The narrative of America's founding is filled with godlike geniuses Franklin, Washington, Adams, Jefferson versus the villainous Aaron Burr. Generations have been told Burr was a betrayer of Hamilton, of his country, of those who had nobler ideas. All untrue. He did not turn on Hamilton; rather, the politically aggressive Hamilton was preoccupied with Burr and subverted Burr's career at every turn for more than a decade through outright lies and slanderous letters.  In Fallen Founder, Nancy Isenberg portrays the founders as they all really were and proves that Burr was no less a patriot and no less a principled thinker than those who debased him. He was an inspired politician who promoted decency at a moment when factionalism and ugly party politics were coalescing. He was a genuine hero of the Revolution, as much an Enlightenment figure as Jefferson, and a feminist generations ahead of his time. A brilliant orator and lawyer, he was New York's attorney general, a senator, and vice president. Denounced as a man of extreme tastes, he in fact pursued a moderate course, and his political assassination was accomplished by rivals who feared his power and who promoted the notion of his sexual perversions.  Fallen Founder is an antidote to the worshipful biographies far too prevalent in the histories of the revolutionary era. Burr's story returns us to reality: to the cunning politicians our nation's founders really were and to a world of political maneuvering, cutthroat politicking, and media slander that is stunningly modern.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "American History",
    "Politics",
    "American Revolution",
    "Audiobook"
  ],
  "author": "Nancy Isenberg",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/244625.Fallen_Founder"
}