{
  "title": "Global Woman: Nannies, Maids, and Sex Workers in the New Economy",
  "description": "In a remarkable pairing, two renowned social critics offer a groundbreaking anthology that examines the unexplored consequences of globalization on the lives of women worldwide.Women are moving around the globe as never before. But for every female executive racking up frequent flier miles there are multitudes of women whose journeys go unnoticed. Each year, millions leave Mexico, Sri Lanka, the Philippines, and other third world countries to work in the homes, nurseries, and brothels of the first world. This broad-scale transfer of labor associated with women's traditional roles results in an odd displacement. In the new global calculus, the female energy that flows to wealthy countries is subtracted from poor ones, often to the detriment of the families left behind. The migrant nanny — or cleaning woman, nursing-care attendant, maid — eases a \"care deficit\" in rich countries, while her absence creates one back home. Confronting a range of topics, from the fate of Vietnamese mail-order brides to the importation of Mexican nannies in Los Angeles and the selling of Thai girls to Japanese brothels, a diverse and distinguised group of writers offer an unprecedented look at a world shaped by mass migration and economic exchange. Collected and introduced by bestselling authors Barbara Ehrenreich and Arlie Russell Hochschild, these fifteen essays — of which only four have been previously published — reveal a new era in which the main resource extracted from the third world is no longer gold or silver, but love. Barbara Ehrenreich is the author of New York Times bestsellers Nickel and Dimed and The Worst Years of Our Lives, as well as Blood Rites. She lives near Key West, Florida. \nArlie Russell Hochschild is the author of national bestsellers The Time Bind and The Second Shift. She live in San Francisco, California.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Gender",
    "Sociology",
    "Economics",
    "Womens",
    "Politics"
  ],
  "author": "Barbara Ehrenreich",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/24454.Global_Woman"
}