{
  "title": "An Outbreak of Peace",
  "description": "'The colonel talked to me about the women coming back to look for their husbands. What if a woman came back with a child fathered by someone from the other side, would they welcome her,' I asked. He gave me that non-smile. 'To accept a woman who is carrying another man's child - that's all part of national reconciliation.' (Chapter 12, \"War and Peace in Angola\", February 2003) The Angolan story is only another in the fantastic web of indulgence, misery, absurdity and suffering beyond expression that is bred in peace no less than war in 'situations' the world over. The story told in this book involves an understanding of what is particular to Angola, but it goes far beyond that. It is a story of the extremes of the human condition and, as such, its relevance is timeless. Combining reportage and analysis, Justin Pearce shows the human face of Angola at a critical juncture in its history. Jonas Savimbi, leader of the rebel movement UNITA, was killed in February 2002. Crippled by the large imbalance between its resources and those of the MPLA government and the death of its messianic leader, UNITA collapsed, giving Angola its first extended period of peace since the nationalist uprising against Portuguese rule in the 1960s. Working as the BBC correspondent based in Luanda, Justin Pearce was the only English-speaking journalist based in Angola in 2001 and 2002. He travelled extensively in Angola, hearing the testimonies of those whose lives were shaped by political divisions and war. He was also able to observe how Angola was governed in a manner which had little in common with the ideals professed by the government since independence. This is an important book. It speaks to the non-specialist reader with an interest in African affairs; or people who have a particular interest in Angola, be it through business, humanitarian or policy development work, and who are looking for a perspective on the country's recent social history.",
  "genres": [
    "Africa",
    "Nonfiction",
    "Angola"
  ],
  "author": "Justin Pearce",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/2445588.An_Outbreak_of_Peace"
}