{
  "title": "Law and Society in Transition: Toward Responsive Law",
  "description": "Year by year, law seems to penetrate ever larger realms of social, political, and economic life, generating both praise and blame. Nonet and Selznick's Law and Society in Transition explains in accessible language the primary forms of law as a social, political, and normative phenomenon. They illustrate with great clarity the fundamental difference between repressive law, riddled with raw conflict and the accommodation of special interests, and responsive law, the reasoned effort to realize an ideal of polity. To make jurisprudence relevant, legal, political, and social theory must be reintegrated. As a step in this direction, Nonet and Selznick attempt to recast jurisprudential issues in a social science perspective. They construct a valuable framework for analyzing and assessing the worth of alternative modes of legal ordering. The volume's most enduring contribution is the authors' typology-repressive, autonomous, and responsive law. This typology of law is original and especially useful because it incorporates both political and jurisprudential aspects of law and speaks directly to contemporary struggles over the proper place of law in democratic governance. In his new introduction, Robert A. Kagan recasts this classic text for the contemporary world. He sees a world of responsive law in which legal institutions-courts, regulatory agencies, alternative dispute resolution bodies, police departments-are periodically studied and redesigned to improve their ability to fulfill public expectations. Schools, business corporations, and governmental bureaucracies are more fully pervaded by legal values. Law and Society in Transition describes ways in which law changes and develops. It is an inspiring vision of a politically responsive form of governance, of special interest to those in sociology, law, philosophy, and politics.",
  "genres": [
    "Law"
  ],
  "author": "Philippe Nonet",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/244521.Law_and_Society_in_Transition"
}