{
  "title": "Summer Series Boxed Set",
  "description": "Enter a world of sweltering Aussie summers, fabulously addictive characters and sweet intoxicating romance in C.J Duggan’s SUMMER SERIES.  ***  THE BOYS OF SUMMER  After first shift disasters, rude wealthy tourists, and a taunting ex boyfriend, Tess is convinced nothing good can come from working her summer away. However, Tess finds unlikely allies in a group of locals dubbed ‘The Onslow Boys’, who are old enough to drive cars, drink beer, and not worry about curfews. Tess’s summer of working expands her world with a series of first times with new friends, forbidden love, and heartbreaking chaos. All with the one boy she has never been able to forget. It will be a summer she will always remember.   AN ENDLESS SUMMER  With the new threat of putting the Onslow up for sale, Amy reluctantly turns to a local tradesman for help: Sean Murphy, the very same Onslow boy who saved her life all those years ago. With his help and that of some old friends, the task is clear: spend the summer building the hotel back up to its former glory or lose it for good.  In an endless summer, Amy soon realises that sometimes in order to save your future, you have to face your past, even if it’s in the form of a smug, gorgeous Onslow boy.  THAT ONE SUMMER  Now the countdown begins to reach the others at Point Shank before the party is over and the new year has begun. Alone in a car with only the infuriating Chris Henderson, Tammy can’t help but feel this is a disastrous start to what could have been a great adventure. But when the awkward road trip takes an unexpected turn, Tammy soon discovers that the way her traitorous heart feels about Chris is the biggest disaster of all.  Fogged up windows, moonlight swimming, bad karaoke and unearthed secrets; after this one summer nothing will ever be the same again.",
  "genres": [
    "Romance",
    "New Adult"
  ],
  "author": "C.J. Duggan",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/24471203-summer-series-boxed-set"
}