{
  "title": "Climate Change: The Facts",
  "description": "Stockade Books and The Institute of Public Affairs are proud to publish Climate Change: The Facts, featuring 22 chapters on the science, politics and economics of the climate change debate. Climate Change: The Facts features the world’s leading experts and commentators on climate change. Highlights of Climate Change: The Facts include:  Ian Plimer draws on the geological record to dismiss the possibility that human emissions of carbon dioxide will lead to catastrophic consequences for the planet. Patrick Michaels demonstrates the growing chasm between the predictions of the IPCC and the real world temperature results. Richard Lindzen shows the climate is less sensitive to increases in greenhouse gases than previously thought and argues that a warmer world would have a similar weather variability to today. Willie Soon discusses the often unremarked role of the sun in climate variability. Robert Carter explains why the natural variability of the climate is far greater than any human component. John Abbot and Jennifer Marohasy demonstrate how little success climate models have in predicting important information such as rainfall.  Nigel Lawson warns of the dire economic consequences of abandoning the use of fossil fuels. Alan Moran compares the considerable costs of taking action compared to the relatively minor potential benefits of doing so. James Delingpole looks at the academic qualifications of the leading proponents of catastrophic climate change and finds many lack the credentials of so-called ‘sceptics’. Garth Paltridge says science itself will be damaged by the failure of climate forecasts to eventuate. Jo Nova chronicles the extraordinary sums of public money awarded to climate change activists, in contrast to those who question their alarmist warnings. Kesten Green and Scott Armstrong compare climate change alarmism to previous scares raised over the past 200 years. Rupert Darwall explains why an international, legally binding climate agreement has extremely minimal chances of success. Ross McKitrick reviews the ‘hockey stick’ controversy and what it reveals about the state of climate science.  Donna Laframboise explains how activists have taken charge of the IPCC. Mark Steyn recounts the embarrassing ‘Ship of Fools’ expedition to Antarctica. Christopher Essex argues the climate system is far more complex than it has been presented and there is much that we still don’t know. Bernie Lewin examines how climate change science came to be politicised. Stewart Franks lists all the unexpected developments in climate science that were not foreseen. Anthony Watts highlights the failure of the world to warm over the past 18 years, contrary to the predictions of the IPCC. Andrew Bolt reviews the litany of failed forecasts by climate change activists.",
  "genres": [
    "Science",
    "Climate Change",
    "Politics",
    "Nonfiction",
    "Economics",
    "Environment"
  ],
  "author": "Alan Moran",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/24475607-climate-change"
}