{
  "title": "HOA Wire",
  "description": "If you are a fan of fast-paced, action-packed thrillers that combine corruption and murder with courtroom drama, then 'HOA Wire' is the novel for you  \n  The President of the Local Homeowners Association is Murdered, and Every Resident is a Suspect\nLawyer Brent Marks defends a homeowner from foreclosure who is then accused of murdering the HOA president”The president of the Orange Grove Homeowners Association is murdered and there are plenty of suspects - in fact everyone who lives in Orange Grove. Brent Marks thinks he is dealing with a routine foreclosure defense until his client is implicated in the crime and calls upon Brent to defend her. To make matters worse, another client's destiny is about to cross their path. At the crossroads of morality and ethics, the courtroom drama explodes, while the action outside the courtroom spirals out of control.  Searing, exhilarating and topical, 'HOA Wire' puts a new spin on Homeowners Associations' excessive controls over property owners  ˃˃˃ Go on a wild ride where the action never stops \"Fans of Grisham will find equal talent here in Eade's ability to captivate and hold readers with the unexpected, both in character development in nonstop action which lays the foundation for a story that's anything but predictable.  ˃˃˃ Discover what other readers already know \"If you are a fan of fast-paced, action-packed thrillers that combine corruption and murder with courtroom drama, then the Brent Marks Legal Thriller Series by Kenneth Eade is the best choice you could ever make. The author's compelling writing and brilliant dialogue will remind you of John Grisham's first novels, which makes Kenneth Eade an author you must follow. A master of mystery, thriller and suspense, the author is already well-known for his bestselling novel 'An Involuntary Spy', and 'Predatory Kill,' for which he was praised by both critics and Amazon reviewers.\"\"Kenneth Eade is the well-known author of the bestselling political thrillers \"An Involuntary Spy,\" \"Predatory Kill,\" and \"A Patriot's Act.\" \"HOA Wire\" is another edge-of-your-seat legal thriller that will take readers by surprise and raise some thought-provoking questions about law and justice in the world we live in today.\"“If you like fast paced, action packed legal thrillers, the Brent Marks Legal Thriller Series is for you. Eade is a master of dialog and presents a well developed fictional tale that is full of drama both inside of the courtroom and out.” \"As good as any on the New York Times Bestseller List\"\nScroll up and pre-order your copy of HOA Wire today at the low sale price!",
  "genres": [
    "Mystery",
    "Crime"
  ],
  "author": "Kenneth Eade",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/24466220-hoa-wire"
}