{
  "title": "Stolen Dreams",
  "description": "“But Sol, it ain’t haunted like you thought,” Marty argued cautiously. It wasn’t a good idea to get Sol too angry. “We’ve tried everything, séances, Ouija boards, mediums—everything. This place is just an old, empty house. A creepy, old house.”Sol shook his head, disregarding Marty’s words, and started up the tall staircase to the second floor. “It just has to seem like a haunted house,” he said. “We’ll keep the crowds coming if it seems like a haunted house. People pay good money to spend the night in a haunted mansion.” Marty followed him, shaking his head. “After that last paranormal research group came through and found nothing, we ain’t been getting the crowds like we used to,” he pointed out. “People look on the internet for everything. All they have to do is research the house and they’ll see we’ve been investigated by three different groups. They ain’t gonna pay top dollar to stay in the state’s most haunted house if it ain’t got no ghosts.”Sol stopped at the top of the stairs and waited for Marty. “Then all we need is a ghost,” he said.Marty shook his head and put his hand on his partner’s shoulder. “Sol, we’ve been at this for three years,” he replied. “The balloon payment is coming up in three months. We ain’t got the capital. We gotta let go of this place before we lose everything.”Shoving Marty’s arm off his shoulder, Sol paced angrily down the hallway. “Don’t you get it, Marty?” he growled, his teeth clenched. “I’m going to lose everything if this place doesn’t pan out. I sunk everything I owned into this place. I don’t have any reserves. I don’t have anything to turn to. This place has to work out.”Marty leaned one hand on the balustrade at the top of the staircase and sadly shook his head. “I’m sorry, Sol. I’d do anything to help you,” he said sadly. “But this place just ain’t got a ghost.”Sol sighed deeply and turned back to his friend, nodding his head slowly. “Thank you, Marty,” he replied.A icy tremor of fear swept through Marty’s body as he saw the cold, calculating look in Sol’s eyes. He lifted his hands defensively. “No, Sol, no,” he cried even as he felt the power of Sol’s body knock him backwards and down the stairs.A few moments later, Sol stood at the top of the staircase, looking down at the broken, lifeless body of his business partner sprawled unnaturally on the black and white, ceramic tiled, lobby floor. He leaned against the same balustrade that only moments before had been held by Marty and nodded. “And now we have a ghost.” Mary, Ian and Mike investigate a supposedly haunted house and discover there are more than just ghosts hidden behind its doors.",
  "genres": [
    "Paranormal",
    "Mystery",
    "Romance",
    "Ghosts",
    "Fiction",
    "Paranormal Mystery",
    "Supernatural"
  ],
  "author": "Terri Reid",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/24473075-stolen-dreams"
}