{
  "title": "No Perfect Princess",
  "description": "The Stones are back. Let the OMGs begin. Angel Payne and Victoria Blue's explosive series continues. Are you ready for Margaux and Michael's story?What came first? The princess or the shoes? And does it really matter?My name is Margaux Asher. Don't be afraid to ask how it's spelled though I may enlighten you, anyway. Yes, I'm that Margaux Asher. The attitude icon. The bitch in the latest heels. The princess of the PR game.Just don't bring up the queen.Mommie and I aren't on comfortable terms. Last winter, I learned a secret that Andrea Asher has hidden from me since my birth--by another woman. And my real father? Josiah Stone, one of the world's richest men. Dream come true, right?There's a lot of baggage attached to that answer. And now, Michael Pearson wants to help me open it.Michael. My six-foot-three, golden god of a dilemma. He's patient, indulgent--anddon't get me started on his passion--but he wants too much. He wants all the secrets. What would he say if he knew my birthright was only the start of my life's mess? What would he do if he learns...I'm no perfect princess? Someday, my princess will come...The apple never falls far from the tree? Depends on who you ask.I'm Michael Pearson. Son of an apple farmer. First family member to graduate college, move to the big city, and work for one of the most prestigious PR firms in the country. I'm the success, the star--And the sap who's fallen for the boss's daughter.So technically, Margaux isn't Andrea's daughter anymore. Doesn't matter to the rest of the company--and the world--who vilify her as they always have. But where they see a she-snake, I see a terrified girl in the woods, yearning for a place where she's accepted, loved. Every time I volunteer my arms to be that place, she ducks deeper into her shell, pushing me away with more fear and anger. Her facade thickens every day, making me more determined to learn what magic kiss will set her free, so she can finally see the truth... I don't want her to be perfect. I just want her to be mine.",
  "genres": [
    "Romance",
    "Audiobook",
    "Contemporary",
    "Adult",
    "Friends To Lovers"
  ],
  "author": "Angel Payne",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/24476642-no-perfect-princess"
}